[{"title":"The Conjuring","rating":9,"date":"13 February 2020","review":"\"The Conjuring\" is one of the most thrilling horror film to have come out in recent times. It is up there with \"Sinister\" as one of the scariest films I have watched. Since it's based off of \"true events\", it makes it even more interesting. I can't quite give it a full 10 star rating because it does have quite a few jump scares, but at least a good portion of those jump scares add to the atmosphere of this movie. If you are a first time watcher of this movie, it will certainly disturb you for a while. It doesn't stick with me like \"Sinister\" does long after, but The Conjuring is a fun watch and I always love coming back for a rewatch every now and then.","user":"MR_Heraclius","rank":[40,42]},{"title":"With virtually no sex, no gore and no cursing The Conjuring earns its R-rating on scares alone.","rating":9,"date":"17 July 2013","review":"Who would've guessed that the director of Saw would end up being the most inventive horror filmmaker working in the industry? James Wan brilliantly takes us back to the retro days of horror, delivering an extremely stylistic, visually striking horror film that stands tall amongst the classics. With virtually no sex, no gore and no cursing The Conjuring earns its R-rating on scares alone.<br><br>Set in 1971, The Conjuring focuses on the married paranormal researchers Ed (Patrick Wilson) and Lorraine (Vera Farmiga) Warren, who lecture at colleges across the US on all the interesting cases they come across. Just as they're thinking of retirement cue the Perron family; parents Roger (Ron Livingston) and Carolyn (Lili Taylor) are scared for their lives and the lives of their 5 daughters claiming there is something evil in their now Rhode Island home. It doesn't take long for the Warrens to discover that the Perron's are being tormented by something supernatural, but what is it, and what does it want?<br><br>In short: The Conjuring is the most terrifying film I've ever seen. Trying to erase his name from the \"torture porn\" crowd has proved difficult for the director of Saw, however without a doubt he's finally done it. On looks alone this movie should be a PG movie, which would normally be frowned upon by the horror junkies, but despite having no sex, no gore and no swearing, James Wan's latest film has been slapped with an R rating anyway. If you're wondering how frightening it actually is I think the MPAA has spoken on its behalf.<br><br>Most horror films these days climax somewhere in the middle; and in turn everything that follows doesn't really have the same affect. In The Conjuring there is comic relief brilliantly placed throughout to bring you down from your own climax so they get another chance to build your fear up and startle you again. Wan understands the psychology behind tension and builds suspense through mere scene construction.<br><br>While obviously taking notes from the Exorcist and The Amityville Horror, the inspiration for this film derives from real case files from the Warren's, which is still their most famous case to date. Straying away from the ironic style made famous by The Cabin In The Woods, nothing on the surface of this story seems inventive, but I assure you the way in which this film works makes it one of the most creative films in recent memory. One thing I've always loved about James Wan is how he manages to take something so unoriginal, like the haunted-house- possession story in this case, and shows it to us like we've never seen it before.<br><br>The scares, pacing, sound design and camera work can only be described as precise. Together James Wan and cinematographer John Leonetti (responsible for the look of Insidious as well) give us a fresh visual style that, unlike most horror films, include a lot of wide shots AND movement. The cinematography is absolutely stunning, and not relying on shaky cam for its realism leaves a rather unique feel to the movie, separating it visually from any other movie you can narratively relate this to.<br><br>One issue I've always had with recent films in the genre was that they revealed the demons too much. Insidious and Sinister are examples where they hooked me to the story and then showed me too much. Fear of the unknown is the greatest thing a horror filmmaker has on its audience and Wan has definitely learned from Insidious. In The Conjuring the apparitions aren't revealed to the audience until way late, and even then they're far away or out of focus. Letting us use our imagination is what makes this film truly horrifying, and I think horror filmmakers should be taking notes from Mr. Wan.<br><br>This film is everything I wanted it to be and more, my only complaint about the movie isn't even something wrong with the film. Once again marketing has screwed us over and the trailer for The Conjuring reveals way too many of the scares. I avoided most of the trailers for this movie on command from James Wan's twitter account but it's hard to miss TV spots. I wish I went into this with a fresh mind so if you still haven't seen the trailer and want to see this film, please stay away from any of the marketing!<br><br>Ultimately the overall production value allows The Conjuring to stand out in an otherwise rotting genre. The acting is impressive, the practical effects are perfect and the classic 70s feel Wan was going for make for a great time at the movies. This is the first must-see film of the summer.<br><br>Our Rating: 9.0/10<br><br>Let me know on Twitter @thejoshl what you thought of The Conjuring!","user":"thejoshl","rank":[538,683]},{"title":"By far one of the best horror movies I've seen in a while.","rating":10,"date":"19 July 2013","review":"I'm an avid horror fan. Lately I've been thinking there isn't much that can scare me (though Sinister got under my skin). I appreciate James Wan's films, I love the first Saw, Insidious was a damn good modern ghost story, but like all reviews have stated for it, the movie kinda loses it's momentum in the final act.<br><br>The Conjuring is better, scarier, and more tense than Insidious. I'm gonna go out on a limb and say it's one of the best horror movies of the last 5 or 10 years. It goes back to the classic rule of horror film making, never show the bad guy fully to your audience. Plus this movie knows suspense, I tell you, I almost threw a water bottle at the screen from sheer terror once the scare finally happened. There are no fake jump scares, the movie earned an R rating without any blood, sex, or profanity, it's all from the terror that this movie builds upon.<br><br>Not only is the movie scary, but as a film itself, it's almost a masterpiece. The script, acting, direction, style, tone, etc were all simply top notch. Wan's camera-work here is by far his best out of any of his movies. The choice to set the movie in the 70s was a stroke of genius as it feels so authentic and all the more real. If this story were set in the present, it simply wouldn't be as a effective or scary. The 70s style film making, costuming, and hair styling are a great throwback to likes of The Exorcist &amp; The Amityville Horror.<br><br>Though there are a few (extremely minor) flaws, such are length, repetitiveness, and a resolution that happens way too fast. I don't care, every horror movie (or movie in general) has it's flaws. There will never be a perfect horror movie, if there is one, I haven't seen it yet. But all I know is James Wan's The Conjuring is one of the best horror movies I've seen in a long time, and it's been a really long time that a movie has scared me this badly.<br><br>10/10 Don't miss this one, it's an amazing theater viewing experience.","user":"skeletonman13","rank":[336,450]}]