[{"title":"It's like getting beaten over the head with the obvious hammer.","rating":1,"date":"24 March 2019","review":"It's like getting beaten over the head with the obvious hammer.","user":"mick-lexington","rank":[32,60]},{"title":"Not Dean Cain's worst film in the last decade","rating":5,"date":"16 January 2020","review":"It's not a new premise by any measure, but the narrative and dialogue has enough originality to hold some interest. There are moments of brilliance in the cinematography, like islands in a sea of low budget mediocrity. \"Futurising\" the present by dropping in the odd cheesy special effect really doesn't work; either go all the way, or be way more subtle. This is just disjointed world-building that drops the viewer out of the story.<br><br>The acting and dialogue is like the cinematography. Inconsistent. Moments of beauty and powerful nuance, drowning in acres of awkward and stilted.<br><br>I'm glad Dean can still get work. I've always had a soft spot for him. He's not a great actor, and his 50+ years sans A-grade Hollywood cosmetic surgery/stylist/nutritionist/trainer budget are showing, but he seems like such a nice guy. He deserves a shot, and this film shows not all hope is lost.","user":"troy-boulton","rank":[5,7]},{"title":"Speaking as a fan of Robot Genre films,....","rating":1,"date":"19 February 2020","review":"...., Don't Bother, you'll never get these wasted minute back.<br><br>Go watch the UK production 'Humans' instead, it's a lot more thought provoking and deals with the disruptions to society and family that the technology will bring in the near future.\nThere's very little to make this turkey stand out from the crowd, visually it's uninspiring, there's no real plot, just a load of over-wordy sentences strung together with no real meaning - the Director and Writer should watch \"Ghost in the Shell : Stand Alone Complex\" to understand how to use dialog properly during scenes with limited activity on camera.\nThe actors do a fair job of trying to deliver the lines with conviction, but the dialog they're given to work with, just makes the viewer want to skip forward.","user":"pidstr","rank":[2,2]}]