[{"title":"good enough for single watch or cinema trip","rating":7,"date":"10 September 2012","review":"This is a story of a young and disobedient falcon who left his father and their nest in the isolated desert to challenge the mysterious bird-city Zambezia.<br><br>I watched this with two kids, 4 and 9, both liked it a lot and so am I. It's pretty dynamic and funny, colorful (beautiful nature, birds, animals) and has nice and lively soundtrack. Storyline is easy to follow, not too complicated for children and not too boring to fall asleep in the middle for grownups. Characters are OK, although no really memorable ones (don't remember the kids to discuss anyone on the way back from the cinema). As an extra plus I see the absence of hidden context or jokes for adults.<br><br>Overall, I think it's underrated and surely worth at least a single watch in the cinema or at home by all of your family.","user":"mrassokhin","rank":[60,71]},{"title":"Brilliant!","rating":7,"date":"3 November 2012","review":"An amazing gem set in an imaginary world in the heart of Africa right where it plunges over the magnificent Victoria Falls, arguably one of the greatest waterfalls in the world. <br><br>What as incredible setting for a 'coming of age' story that should appeal to everyone, young an old.<br><br>While the animation might be a little dated, this in no way detracts from the way the tale is told - the characters are just as relevant now as ever they were.<br><br>Fresh! Different! Yet familiar enough for youngsters to identify with and enjoy.<br><br>Go and see this movie. <br><br>You'll be so glad you did.","user":"johnhillconsulting","rank":[21,25]},{"title":"My 8 year-old daughter loved it","rating":8,"date":"6 January 2013","review":"It is easy to spot a good animated kids movie: Kids will sit on the edge of their chairs, and parents will stay awake throughout and be reasonably engaged. This one ticked both boxes. <br><br>Leonard Nimoy, Samuel L &amp; Jeff Godblum created believable characters, but the Ezee character came over as a bit of a cliché. The animation was done well and could easily rival a movie like Rio. <br><br>This is miles better than the previous animated attempts from South Africa, but unfortunately its very difficult to create an animated blockbuster if you don't have the budget of a Sony, Pixar, Dreamworks or Disney. <br><br>Pleasant hour and a bit overall.","user":"izakvh","rank":[18,22]}]