[{"title":"slow, boring and any heart will do!","rating":3,"date":"14 January 2014","review":"This was described as \"not for the faint of heart\" and I can only surmise that the individual's taste is far different from mine or that person was involved with the film or knew people involved with the film. When part of a positive review is that it was filmed on film, well that is not pertinent to whether the film is good or not.<br><br>The story moves very slowly and is not very involving. Basically a one person film, the other characters make a short appearance and disappear. I wish there was some way to make these reviews and rating more honest. The rating was well over 7, to me that means we are talking about an exceptional film. Not the case here!! This was a disappointing experience. Let's try to be more honest with each other, shall we?","user":"iraz","rank":[68,75]},{"title":"This movie contains fillers, plot holes and above all moping","rating":3,"date":"13 August 2014","review":"This does contain spoilers.<br><br>When some one directs, acts, produces and writes their own movie, it ends up sacrificing the quality of the movie.<br><br>The pace is slow, dull and the plot goes missing with endless fillers. Fillers such as a debt collector bugging him. His family come over and tell Coby about his brother has a tumor (which went no where)at and a lengthy discussion about the gate for the car to enter being broken. <br><br>He is meant to have hearing problems, yet he is able to hear every thing.<br><br>If i was the script writer, i could of made the movie more interesting with the same budget and cast.<br><br>This is how I would of done it.<br><br>Cody comes home from the funeral, he stops at the entrance of the drive way and slowly pulls in. It is silent, you can not hear any noise except his low breathing (which is distorted) as he pulls in a car beeps his horn to tell Cody that he almost hit the other driver.<br><br>Cody gives up and parks the car on the road. He stares a head and a tear rolls down his eye. He gets out of the car and enters. You see a shot of Cody ears, he is wearing hearing aids and the noises of the birds are coming out tinny.<br><br>The next day, his family comes over. They are concerned about Cody behavior and brought food over. The mother finds the over due bill Each family member tried to talk to Cody, The father tries to offer to go fishing to help him take his mind off. His brother offers to get him a job where he works. Cody pushes away from each family member except his sister who told him she going to hang out with him during nights. <br><br>Cody goes into the kitchen and starts talking to his mother about wanting to be a lone when he hears faint inaudible voices where it grows louder until he hears a womans scream for help. He blacks out.<br><br>He wakes up on the couch and his mother and sister are fussing over him. Trying to get him to drink water and his pills. After insisting he will be OK, they all leave.<br><br>Cody's house began to act weird. Lights are not turning on one moment and when he comes back into the room with new, the lights are on. He is in the shower and he is thinking about his late wife when he hears a noise. He looks around and he looks at the drain, cody peers into the drain where for a second he sees an eye.<br><br>Cody freaks out and runs out the room with a towel. He runs into his sister. She waves a movie at his face with a movie. She peers into the shower and asked him why is it still on. He mutters about where he found his late wife and starts crying.<br><br>Cody sister notices that he not watching but staring at a dark corner. She turns the movie off and makes him talk. he talked about how he met his late wife during one of his refunded research projects and she was the one who rescued him when he delve too deep. <br><br>He explains how quiet every thing was when his ears burst but before he blacked out he heard a noise. In the course of the night he sees his wife walking down the hall way, his sister keeps hearing noises in the walls to the point where one merged out of it. <br><br>Cody soon hears his late wife calling him to run but it is too late.","user":"theadventuresofimo","rank":[16,20]},{"title":"Avoid.","rating":30,"date":"30 April 2015","review":"Absolute dreck. Slow, boring, meaningless, plot less. Just truly dire dreck. I watched it halfway through, waiting for it to pick up and be something describable as a story, then gave up and fast-forwarded it in stages until I got to the end where there finally seemed to be some action. I watched that for three minutes until the movie ended and congratulated myself for fast-forwarding it. I occasionally see movies of this quality and always sit bewildered as to how they ever made it to the screen. God only knows how much money was wasted in the creation of this trash. And let's not get all hung up with pretentious claims to the art and metaphorical meaning; there is none.","user":"aproofofgod","rank":[7,8]}]