[{"title":"mostly boring","rating":4,"date":"25 April 2011","review":"i found this Steve Austin vehicle to be mostly boring,with a bit of mild action here and there.there was one twist i wasn't expecting.Austin was pretty decent here in the acting department,but for me,Adam Beach stole the show.too bad the show wasn't worth stealing.i had to fight tot keep my eyes open for this one.i wouldn't recommend it.there's a lot of talking going on and not much else.and the dialogue isn't that great either.i'd give this one a miss unless you're a die hard Steve Austin fan.i'm he's probably done better work than this,although this is the first film i've seen of his.anyway,for me,The Stranger is a low 4/10","user":"disdressed12","rank":[7,7]},{"title":"Not a Very Enjoyable Film, Flaws Just Keep Popping Up","rating":4,"date":"27 May 2010","review":"\"Stone Cold\" Steve Austin stars as a man with no memory who travels cross-country (and in Mexico), trying to find his home... but the Russian mob wants him, the FBI wants him, his psychologist wants him... and there's millions of dollars on the line.<br><br>Let's just sum this one up: semi-poor writing, very poor directing, atrocious cinematography. Just a mess all around... sadly, the best part of this film was Steve Austin's acting. Austin effectively pulls off fight scenes, speaking in Russian and Spanish and English and just being an all-around decent lead.<br><br>I can't explain the pointless motorcycle camera shots, or the opening scene, or many other filming gimmicks they tried and failed with. I also can't explain why they thought \"Tom Thomachevsky\" was a good name... it's just silly sounding.<br><br>There's not much to say beyond that... the film is not worth your time or money. I hate to slam a film, but this one was just such a drag to watch I think it would be unjust to praise it even a little.","user":"gavin6942","rank":[29,38]},{"title":"solid story and acting, not so much for the directors ability","rating":7,"date":"29 May 2010","review":"The stranger is a good solid film with an enjoyable story however the cinematography and direction is poor to say the least, in fact the opening scene almost put me completely off, you need to allow 15 or so minuets to get into the film. this film doesn't really have that many big action set pieces and is more concerned with telling a mysterious tale than getting our adrenaline racing. Flashbacks abound as snippets of memory keep darting through Austins head, mostly centered on his wife and daughter apparently being killed while he's mixed up in some dangerous sting operation. We're teased with such scenes numerous times during the film as much of Austins struggle is more internal than external. But while it's not that hard to piece much of it together ourselves, it's interesting to watch the characters slowly unravel the secrets of Austins identity and discover a few other startling surprises as well. All actors put in a good performance most notably Austin in his third leading role its clear that if he takes the right career path and keeps giving these kind of performance he should soon be a star of the silver screen. this is not an action film. overall a good watch just a shame about the director.","user":"olivermartin809","rank":[21,27]}]