[{"title":"Decoding Annie Parker Wins Top 5 at SIFF and Samantha Morton Wins Best Actress","rating":10,"date":"9 June 2013","review":"This film has it all! Humorous, heart-touching, authentic performances of the real life struggles of genius geneticist Dr. Mary-Claire King in her tireless efforts to find the genetic link in breast and ovarian cancer--the BRCA gene--and Canadian Annie Parker, a young woman who must face one of the greatest fears of all women. Samantha Morton's portrayal of Annie Parker is brilliant, heart-felt and sometimes, painfully real.<br><br>I've seen the movie three times, and each time I get more from it. Helen Hunt's performance of Dr. King is right on target, and the entire cast adds even more depth, warmth and personality to this important work. Steven &amp; Adam Bernstein's script, Steven's direction, excellent cinematography, and an all-star cast combine to create a film that is exploding the awareness of people around the world in a way that both entertains and educates.<br><br>On top of that, this movie is changing lives every day. Audiences are giving it standing ovations, and for the next several months at least, the producers have authorized charitable screenings of the movie to raise awareness and funds for breast and ovarian cancer research and patient support. It couldn't be any better! CONGRATULATIONS to all involved.","user":"sidneypowell-511-2350","rank":[21,22]},{"title":"Bravo to Bernstein who starts the important conversation about hereditary cancer with \"Annie Parker\".","rating":7,"date":"1 May 2013","review":"Bravo to Steve Bernstein for making this important film that starts the conversation about hereditary cancer. Bernstein manages to weave the \"remarkable\" Annie Parker's personality and humor throughout this film of serious subject matter; ultimately providing bursts of laughter just when you are thinking you might need to reach for that huge handkerchief to wipe your tears. \"A\" rated performances from Samantha Morton (Annie) and Aaron Paul. Rashida Jones shines brightly in her supporting role. Heartfelt, humorous, and honest...you will go home thinking about your family and family history. Knowing it is a true story, you will find yourself thinking about the \"real\" Annie Parker and her incredible spirit--at the very least, for the rest of your week.","user":"wifeofjon","rank":[26,30]},{"title":"An Impressive Feature Debut!","rating":10,"date":"9 June 2013","review":"Director Steven Bernstein's feature debut, which he co-wrote with his son Adam Bernstein and physician Dr. Michael Moss, is based on two true stories and weaves together the fifteen year journeys of two women both struggling to overcome insuperable odds. Annie Parker (Samantha Morton) is on intimate terms with breast cancer, having watched both her mother and sister succumb to it. When she herself is diagnosed with the cruel disease, she bravely struggles to hold herself and her family together, displaying a force of will that contradicts the odds. Meanwhile, geneticist Dr. Mary-Claire King (Helen Hunt) is researching the hereditary link between DNA and breast cancer, a process that finds her scrambling for both funding and the support of her disbelieving colleagues. How the paths of these two women intersect is funny, irreverent, and heartwarming without sentimentality or melodrama. Bernstein, both in his direction and writing, deftly balances the seriousness of the situation with the all too human response, finding unpredictable grace notes of beauty and wit during even the darkest of times. Featuring award worthy performances by Morton, Hunt, and an equally impressive supporting cast including Aaron Paul, Rashida Jones, Alice Eve, Bradley Whitford, and Maggie Grace, Bernstein's film pays tribute to one of the most important scientific discoveries of the 20th century as well as the people forever changed in its wake.","user":"carolynrodneyhome","rank":[13,16]}]