[{"title":"Likable cast but story could have been better","rating":4,"date":"11 September 2012","review":"This movie just isn't very funny, endearing or involving as a dramedy. It runs out of steam early. Just aren't many funny situations. And those that could have been funny were done better before (eg the speed dating scene). There could have been better situations with the marriage counseling theme but the one with Alison Hannigan is okay.<br><br>Wanted to watch this mainly for the likable attractive cast. Unfortunately the material they are given to work with isn't good. Mandy Moore isn't the best actress but her lines aren't really that great so can't blame her. Kellan Lutz's character isn't convincing. He doesn't look like he is ready to settle down at all more like some big frat boy. Jessica Szhor's character is more likable than in Gossip Girl. James Brolin is a bit miscast. It's nice to see Jane Seymour acting again - haven't seen her since \"Wedding Crashers\".<br><br>Overall watch it once if you are fan of the cast but bear in mind it just isn't that good.","user":"phd_travel","rank":[9,9]},{"title":"predictable","rating":5,"date":"1 June 2011","review":"When I found this film I knew what I was in for. A formulaic romantic comedy that should entertain all of the romantics out there. Although there is not originality there is a certain charm about the film that tops up a lot romantic comedies out there. This is not a film for a film buff to get something out off right when he leaves the theater. This is a film to enjoy while it lasts, and enjoy the beautiful people in this film. This is not a film that will define the way we make films. This is just pure entertainment. So if you go into this film with the exact mind set you will enjoy it like I did. But if you go into this film looking for career changing acting and an original plot then do not watch this film for it is only pure entertainment.","user":"wilsonalexandre-l","rank":[28,35]},{"title":"Trite, clumsy & preposterous","rating":2,"date":"18 March 2011","review":"If this is the best that Dermot Mulroney can do as a director, then I can safely say that I'll pass on any future projects to which he is attached. This is another \"Pottery Barn/cashmere throw\" style rom com a la Nancy Meyers (with his and hers convertibles!), but her scripts are superior. This one ranks with the worst offerings on Lifetime TV-- superficial, dull and directed in a lumbering style. The lead is miscast: Mandy Moore is unbelievable as a marital counselor with a Ph.D and a thriving private practice. She has no intellectual weight, no emotional maturity and delivers her lines like a high school girl. It gets old fast. I'm not a Jew but I was offended by the way Brolin's character tries to \"explore\" his spirituality by taking on all the trappings of that faith and nothing else. If this \"subplot\" was supposed to be funny, it really wasn't. (Compare the scene in \"Annie Hall\" when Woody Allen decides to become a Catholic and unpacks white bread and mayo from a grocery bag.) In order to get to the end (which I had to do because of my work), I entertained myself by ticking off how many times Jane Seymour dropped her American accent in the middle of sentences (47). This is a waste of 90 mins and you're better off watching something else.","user":"Naneaux","rank":[55,76]}]