[{"title":"One of the most compelling films I've seen in a long time","rating":10,"date":"11 April 2013","review":"I see a lot of movies, and the great majority of them make little impression on me. They are fun and entertaining, but quickly forgettable. Not DISCONNECT, though. This is a powerful and provocative film that not only keeps you pinned to your seat but also makes you think about the consequences of your actions. It should certainly be required viewing not only for young people but also for anyone who uses social media or communicates via the Internet. This is a timely, well-written, well-acted, and well-paced movie that stays with you long after you leave the movie theater. I was also pleased by the fact that the director and writer did not take the easy way out. No glib, predictable solutions here, which is one reason why the film's events linger in your mind.","user":"sls3","rank":[197,227]},{"title":"Disconnect.","rating":9,"date":"11 September 2013","review":"Why hasn't this movie been raved about? One of the best I have seen in a long time. Don't even think it got a cinema release in Australia. This is the sort of movie that should have Oscar nominations and a must see. An ensemble cast and all are outstanding. Jason Bateman is such an under rated actor but can just about do anything, probably hurt by Arrested Development although I must admit I did like that show. If you liked movies like Crash you should enjoy this. 3 stories going on at the same time which also have some intermingling, if there is such a word. IMDb rating is a bit low and I would rate it in the high 8's even getting close to a 9. Have banged on a bit as I didn't realize you needed to submit 10 lines of text to post a review/comment.","user":"mareva-742-370416","rank":[79,90]},{"title":"Sad story of how technology alienates us rather than bringing us closer","rating":8,"date":"14 April 2013","review":"A brilliant story to tell how technology has alienated marriage, family and friendship instead of connecting people. It is even sadder when all the stories are based on true events. I watched it at the Hong Kong International Film Festival and for the first time after almost 10 films thought this is the first one which can be publicly released for a wider audience because of its social message, especially right after two cases of murders of local parents by their adult sons who loved to play computer games.<br><br>Disconnect mainly centers on three sub stories which are loosely linked. There was nothing wrong in each character's internal logic or perception of the world: a lonely teenager looking for friendship, a wife confiding to a stranger on the internet because her husband cannot talk with her on their loss of their son, a young journalist trying to get a scoop on runaway youth turned cyber sex provider.<br><br>As the story progress, however, we see how these longing deviate and troubles follow. Some people were so longing for connection with other human beings but cannot be satisfied at home that they naively trust this virtual relationship on the internet or mobile phone – while on the other end of the line, their \"friends\" might well be abuser or bullies, taking advantage of these lonely hearts, intentionally or not.<br><br>Since the director used to shoot documentaries, the film is filled with an authentic flavor, developing with an urgent tempo. The cast are excellent in portraying they care for their families with wrong method so it looks like they are communicating on the wrong channels thus counterproductive. Jason Bateman is superb in portraying a concerned father who tried to save his son after realizing how much he has neglected him. The large portion of computer chat is displayed by text overlaying on head shots of the authors. And here is what we see how good the acting is, especially young Colin Ford who showed a strong sense of guilt on an innocent face, but also deep concern for his friend.<br><br>The characters are not lovable but you cannot help but feel sorry for them and keep asking what went wrong. It also makes us reflect what we need to do, as parents, as classmate, as a regular net shopper to be really connected with people we care amid this overflow of information technology. Just turn off your computer, drop your mobile, and go see it.","user":"Kicino","rank":[89,102]}]