[{"title":"Two acting heavyweights and an interesting story that squanders its potential in the dumbest possible ways.","rating":4,"date":"18 March 2016","review":"I was expecting to despise this movie. I only watched it because I was in the mood to see a bad De Niro movie, so the one where he's opposite Travolta playing a Serbian seemed to fit the criteria perfectly. But I was actually on board for the first 15 or so minutes of Killing Season. De Niro's character is off in a cabin isolated from his family and still recovering from the effects the Bosnian war had on him however many years ago, and Travolta's character is out for vengeance because he was left for dead in the same war on the opposing side. It's a simple enough premise. And there's one interesting scene where De Niro and Travolta are drinking and sharing war stories where you actually feel some tension but mutual respect building between them. Kind of like Pacino and De Niro in Heat (a blasphemous comparison but it's the first thing that came to mind). Anyway, I wanted more of that. <br><br>But as soon as that's over, the movie turns into a cat-and-mouse game between the two of them that consists of one of them getting captured and tortured, then they somehow escape and the chase continues until the other guy gets captured and tortured, then they somehow escape and the cycle continues. It's just dumb and predictable. And let's talk about the accents for a minute. Travolta doesn't even have a bad accent. Mind you I don't know how authentic of a Serbian accent it is, but the accent itself is convincing enough. The problem is that he uses the same intonation for everything he says. At one point he's literally shot in the f*cking face and the next minute he's talking in exactly the same tone as before. And De Niro does this southern accent that drifts in and out, and you can tell he's just there for a paycheck because he's not even trying to pull it off convincingly. Hell it was more believable in Machete. And the special effects, holy god they're awful. They'll randomly cut to a close up of a wound and it just looks terrible. It's gratuitous, and I don't mind gratuity all that much but when you can clearly tell something is CGI, there's no excuse for that to make it in the final cut. It's unnecessary, it looks like crap, get it out of there.<br><br>So yeah, I ended up disliking the movie but not for the reasons I was expecting. Travolta's accent wasn't the worst part of the movie like I thought it'd be. The story was quite interesting but it gets resolved in the most half-assed way, like there's absolutely no pathos when there so easily could have been seeing as how it's about two opposing war vets encountering each other after all this time. I mean, it's not a terrible movie. It really isn't. De Niro has had much worse, so has Travolta. But there are glimpses of potential all over this movie that get squandered in the dumbest possible ways, and that itself makes Killing Season a frustrating watch.","user":"lnvicta","rank":[40,47]},{"title":"A movie that could have been very good","rating":4,"date":"15 July 2013","review":"For starters, the movie gets absolutely everything wrong about events of the Bosnian war, but since such ignorance is expected from Hollywood, there is no reason to hold it against this particular title.<br><br>The premise of the movie is good, the basic story is decent, but the script could have been better written, the two main characters' stories never get satisfyingly developed. If this was directed by John McTiernan as originally planned, this would have been a great movie. Sadly, instead we got the guy who did Daredevil and he once again delivered a bland, uninspiring product. Acting is OK, Travolta did his best to hold a consistent accent (it was the wrong accent, but hey!) throughout the movie, while DeNiro looked more like he was only concerned with the paycheck.<br><br>All in all, the movie is not terrible, I guess it wouldn't kill you to watch it if you have nothing better to do for an hour and a half. The sad part is that this could have been a much, much better movie, perhaps even a classic.","user":"laserburn","rank":[116,156]},{"title":"Retarded from beginning to end. An absolute stinker. Do not watch.","rating":1,"date":"13 July 2013","review":"Where to start? Don't second-guess yourself: it's been panned for a reason. It is an ugly, pointless potboiler lacking in brains, charisma and even the slightest hint of excitement. What follows is one and a half hours of very crude torture scenes, mock character development, Macgyver-like scenarios of escape and an abundance of completely unnecessary CGI effects.<br><br>It just reeks of \"cut and dry\". Obviously it was too much effort to spend time on practical special effects so the director just found a cheap CGI company to scribble in the animals, the weapon effects, the squibs, the sunsets, the lighting, and anything else he can think of. Poor direction. Frankly I would think after such long and successful careers that Travolta and De Niro were beneath such roles. <br><br>Travolta, as always, brings a kind of raw energy to his role and immerses himself in his character, even if his accent is off he never winks to the audience and does his best to do his job to a good standard. De Niro, however, is out of his element here, with a slipping southern accent that wasn't necessary. He feigns injury like Pierce Brosnan (poorly). Even when threading a metal cable through the exposed wound in his leg he is not convincing. <br><br>After a poorly conceived prologue, a taut first act will draw you in, but unfortunately it all goes downhill from there. The sheer excess of symbolism and foreshadowing is a clumsy misfire. Macgyver scenarios pile up quickly and the action climax will have you practically laughing at how stupid it is. Seriously. Don't pay to watch this crap.","user":"mwburrows","rank":[154,220]}]