[{"title":"American Pie presents: Snore fest 2009","rating":4,"date":"1 January 2010","review":"Hmmmmm.....it finally happened. The \"American Pie\" franchise got beaten to death, succumbing to it's inevitable demise with this tired, bored, stupified pathetic excuse for a film \"The Book of Love\".<br><br>Now before I go any further, I have to express that I am indeed an \"American Pie\" fan and enjoy all the films so far even the straight to DVD released ones of the past few years.<br><br>So naturally when I heard of the 7th film's release I was eager to sit back, relax and enjoy some more mindless potty humour and enjoy a few laughs....sadly, there were only a FEW laughs to be had as in I believe there were 2 scenes I found funny. I won't ruin those scenes for anyone who still feels the need to watch this film but I'll just say they involved a women's underwear department store and the other some old ladies false teeth!<br><br>The rest of the film relies on tired old jokes from the previous six films which by now aren't funny and are slightly altered to appear fresh and original but just end up falling flat and leave the viewer wondering if they were supposed to laugh or not.<br><br>The acting in this film is absolutely atrocious but no surprises there as the only relevant actors in the film were Rosanna Arquette and Eugene Levy who stole every scene he was in. Too bad his scene's were so short that his role was more like a cameo role which is a major shame but I guess this film was done on no budget and what little money they did have was used to pay Mr Levy for the one day of shooting he did for this film.<br><br>The characters this time round just weren't memorable and although I just watched the film lat night...I'm struggling to remember any one character's name!<br><br>The new \"Stifler\" was average too and without a string Stifler....what can you expect to get out of a so called \"American Pie\" film?<br><br>The film tries desperately to avoid boredom and throws in many pointless cameos from Hollywood Caleb's such as Bret Michals which just aren't funny!<br><br>I think I'll skip adding this one to my collection!<br><br>I'm nearly done complaining but before I wrap up....I would like to mention that it's a real shame this film is the one released 10 years after the original. If I was a rich Hollywood movie director/ writer...I would do a film about the original group getting together ten years later to celebrate their High School reunion! Think about how funny that film could be! See how all the characters turned out ten years after high school and what hilarious scenes could unfold if they all end up really drunk at their reunion? Will any old flames be re-ignited? Will Stifler still be an immature horn-bag? Will anyone shag a pie??? And the movie could be called; \"American Pie: High School Reunion\".<br><br>Now that sounds like an \"American Pie\" film that people would want to see!!!!<br><br>Please stop the straight to DVD releases!!!!","user":"Mash-the-stampede","rank":[32,34]},{"title":"Rock bottom","rating":3,"date":"4 July 2012","review":"Dildo. If you're laughing hysterically right now, this is totally the movie for you. If not, \"Book Of Love\" is going to be a pretty tiresome ride. Nobody expects a great story when they see the \"American Pie Presents\" (what does that even mean?) moniker, but a little variation here and there would be pretty nice. I mean, come on. Another batch of hapless (not to mention unlikable) virgins getting into sexual misadventures? Another previously unmentioned Stifler cousin? Another utterly pointless appearance by Jim's dad? You know your plot elements are desperately uninspired when they make \"Band Camp\" seem fresh. The movie's also very unstructured, it's basically just a series of barely related sketches. Wouldn't be that much of a problem if the little vignettes were funny, but the supposed highlight of the movie consists of faux-Stifler getting raped by a moose. Creative stuff right there. The makers even seem fully aware they're making crap, but all they do to solve it is adding more frighteningly plastic boobs. This is just painful to watch.","user":"Sandcooler","rank":[16,17]},{"title":"Painful","rating":2,"date":"1 December 2009","review":"Pretty much what you'd expect from yet another straight-to-DVD attempt at capitalizing on the already thinly-stretched \"American Pie\" name. I got through exactly 34 painful minutes of this before having to shut it off for medical reasons. Aside from Eugene Levy, there are no other past American Pie actors in the movie. Nor is there any other reason to call this movie \"American Pie\", aside from it being about high school kids trying to get laid and containing a character named Stifler (who does not remotely measure up to the name).<br><br>A lot of the humor is derivative of the original American Pie movies (which I enjoyed), but isn't funny at all here, possibly because we've seen it before and likely because it just isn't written or acted as well. If you have any semblance of an IQ, this movie won't engage you or make you laugh. Though it is a glossy production with some good-looking people.","user":"equazcion","rank":[77,111]}]