[{"title":"Faster","rating":6,"date":"24 February 2020","review":"It's the Rock's performance that makes this movie watchable. Otherwise it's a standard revenge driven action move that doesn't add anything to the genre. Also, I usually have issue when movie characters are underdeveloped, but in this case the assassin and his girlfriend were way too overdeveloped and I just didn't need to know that much about his character - not only did it not add anything to the story, it actually detracted from it.","user":"MR_Heraclius","rank":[42,44]},{"title":"A really worthwhile action flick","rating":8,"date":"16 February 2011","review":"Faster does not try to be anything it's not. It is a fast paced action flick with plausible performances from all round.<br><br>I've always liked Thornton as he is very good at playing a drugged out low life. He is perfect for this role. Forget Thornton though, nothing fits better than the role \"The Rock\" played. A cold mean*** man with big muscles looking for revenge. That's exactly who the Rock is and I could easily say there was no better man for the job! Oliver Jackson-Cohen as the hit-man also played a decent role and I really liked the addition to his role of being \"challenged.\" Maybe I'm not expressing myself very well, but what I think I'm trying to say is that Faster didn't feel corny in any scenes. Like most action films go waaaaaay overboard or some try to mix too much drama into it when it's supposed to be an action flick. I didn't feel any negative element like that linger around in Faster. It's solid action that's believable and although it does have some drama in it, it's woven in quite well, but in any case, the action overpowers any other element the movie may have to offer.<br><br>Throughout the movie I was actually gripped with tension and it also has a good twist at the end, though the smarter movie goer would probably pick it up early on.<br><br>I really can't say anything bad about this film besides the fact it's just an action movie, and that's not a negative because that's what it set out to be and that's what it is. No academy performances, no sensational script (but much better than other actions movies because like I said no corny scenes, all plausible), no dodgy romance scenes.<br><br>By the way, without giving too much of a spoiler, I also really enjoyed the fact how Faster developed a scenario where I expected at least one character's life to turned to ruins, but instead, an unexpected but easily believable resolution was found. Everyone got what they deserved, which is great, and I also got what I deserved: enjoyable action! By the way, this movie no where near deserves a 6.7 rating on IMDb. I know action titles aren't given too much credit, but Faster deserves to be at least 7, probably about 7.2.","user":"warthogjump","rank":[61,70]},{"title":"The Rock has finally come back!!","rating":8,"date":"2 December 2010","review":"To start of, this movie is not groundbreaking and I doubt it is going to claim to be. It's a simple revenge thriller with a few plot twists. That's why I did not give it a full score.<br><br>But those things aside, this movie was quite fun to watch. Loved how Dwayne Johnson finally decided to get back to his action roles after the lame kid movies he had starred in lately. His screen presence was awesome, and kinda reminded me of the good old times while he was wrestling.<br><br>The music and the setting were awesome, it really did remind me of the 70's revenge thrillers. The entire movie was like an ode to the old dark and moody revenge movies just as Kill Bill was. I believe they got the setting and tone of the movie quite right, and the music itself was awesome. Nothing flashy just melancholy sounding from beginning to end.<br><br>The action scenes were quite good since Dwaynes character (The Driver) just oozed of cold blooded anger and hatred. Making the showdowns quite interesting and funny at one point as well. The other characters were entertaining as well, The Killer and The Cop. Each had their own story going on until they get intertwined with each other as the movie progresses.<br><br>Overall I loved the movie and I feel anyone who is wanting to check out a action flick this weekend should definitely check this movie out. It will be worth the money spent if you are looking to be entertained.","user":"illnino-2","rank":[103,133]}]