[{"title":"Good cast, visually stunning but often put focus on the wrong things","rating":6,"date":"9 December 2014","review":"The cast is good enough and you can't complain about the visuals but the script is flawed, due to the makers eagerness into focusing on the teen- romance aspects of the movie instead of the survival aspect.<br><br>For instance there is a scene where the gang have a potentially lethal mission going on and 2 girls can't stop chatting about the boys they like, asking if this or that person is a good kisser etc.<br><br>And stuff like that happens throughout of the movie, so what everyone they know is either dead or prisoners of war does that really mean we can't go on a date right?<br><br>Yeah... But when it's not focused on that it's fairly entertaining.<br><br>The violence is very minimal which takes away a lot of the tension that could have been in the movie, okay it's aimed at teens but still war is never pretty.<br><br>There's also very little action for it to be listed as a action-movie and the poster makes it look like it's actionpacked as well but it's really not.<br><br>In the end of the movie which ends with a cliffhanger of sorts it's kind of obvious that it was always intended as a trilogy or something with this movie being the first part.<br><br>And it appears that the sequel is being made as we speak, I'd watch it but I hope they don't focus on too many love-triangles but of the actual war/survivor-story that time.","user":"Seth_Rogue_One","rank":[12,14]},{"title":"Where do I get paid to say this movie was good....","rating":2,"date":"24 December 2010","review":"Someone is obviously paying people to give positive reviews, I had heard that this was a film I should see... Wrong! <br><br>Clumsy, predictable, laughable. They should have had a grown-up check the script before starting production. <br><br>Dump trucks are not bullet proof! Soldiers don't run away when a teenager blows up a lawnmower. Soldiers don't go for dinner when someone steals their tanker. Soldiers don't sneak up on enemy 'commandoes' with their gun-lights on.<br><br>It kept looking like it could improve and some parts looked very stylish, but then ffffttt! Deflation.<br><br>Paper-thin character development, dry lines, ridiculous action sequences and the final scene... OMG lol wtf...I was embarrassed to have told my wife she should watch this with me, she doesn't mind suspending disbelief when watching something like this but she laughed out loud at the final 5 seconds and I cringed!<br><br>Sorry to the writer and director, good on you for having the guts to make a movie, no doubt better than I could do, but sheesh, maybe share the workload next time.","user":"promo2","rank":[121,184]},{"title":"Worst movie I have ever seen","rating":1,"date":"31 December 2010","review":"I haven't read any of the books so I watched this film on its own merits and I'm generally supportive of Aussie films, but this film was terrible.<br><br>Let's start with the characters. Stereotypes galore from the prissy, ditsy uptown blonde through to the Chinese boy who's family owns a Chinese restaurant and he demonstrates Kung Fu skills. The actors seem very camera-aware, talking at the camera instead of each other and it doesn't help that the story is full of woeful clichés and unrealistic dialog. There was no development of the characters, i felt no attachment to any of them and towards the end i was wishing the \"enemy\" would kill at least half of them. The worst part for me is that the story suggests that they are mostly 17 years old, but only 1 character (the priests daughter *groan*) actually looks right for the part. I would have turned it off halfway if it wasn't for the stoner character. At this point I started watching it like it was a spoof movie.<br><br>The story unfortunately is full of holes and unrealistic events that make it so hard to watch. The enemy was made out to be so stupid and wildly inaccurate with their weapons. Please use a military adviser next time you want to make a film containing armed forces. Are we really supposed to believe that they wouldn't have engineers that could rebuild a bridge? On top of all the technical and military logic errors in the story, it almost seems to completely ignore the fact that Australia has a defense force.<br><br>Afraid of political correctness, the Asian coalition army invading has no name and it is painfully skirted around making the movie more unrealistic. Trying to keep gender equality alive with woman enemy soldiers (did we forget it was an Asian army?) another painful reminder of the poorly written script. The lead female gaining inspiration for a wall mural depicting aborigines and English redcoat troops was a vomit moment. You guys realise that the English settled here right, effectively conquering?? Just needed a scene with a woman vet holding an injured joey to finish it off.<br><br>The only good thing about this film is the view of the national park.<br><br>There is more, but I'm over it. Do yourself a favour and save your money.","user":"graham-938-455077","rank":[144,232]}]