[{"title":"Worth seeing","rating":18,"date":"18 June 2013","review":"A satellite crashes bringing with it a virus that turns people into people chomping cannibals. All of this takes place around a sleepy small American town protected by a very young deputy sheriff.<br><br>I thought it was a pretty good movie, or at least a nice fast moving one most of the time. There's plenty of action and the effects were pretty good and so was the acting.<br><br>The camera work is annoying in places though. For some reason it wobbles around wildly when two people are talking but is steady in the action scenes. In some scenes actors nearly vanish off the screen for lack of a tripod.<br><br>There's also all that military hardware just sat around as scenery. I would have thought a dozen or so soldiers would give a horde of zombies a run for its money, it's a shame we weren't shown that or more of the hazmat guys freaking out about the situation.<br><br>Well nobody likes a long review so I'll just say I liked it and if you like zombie movies and that kind of thing this is a pretty entertaining movie and definitely improves from its shaky opening.","user":"sebpopcorn","rank":[29,34]},{"title":"Cannibalistic virus action not scary enough","rating":4,"date":"15 December 2013","review":"A satellite crashes near a small town in the middle of the woods. Something from space came with the satellite, and starts to turn the townfolks into cannibalistic freaks.<br><br>This is an indie with freaks running around attacking people. It could be a scary watch if it's done right. This one isn't right. It tries to have that kinetic feel, but the camera work doesn't accentuate the action. This is not '28 Days Later'. The camera is not aggressive enough. There is a lot of blood, a lot of killing, a lot of running, and not enough excitement.<br><br>In addition, the movie starts excruciatingly slow. It's 25 minutes before anything interesting happens. It's even longer before we get the first kill. That's way too long for a modern horror movie.<br><br>I'm not put off by the low budget. In fact, I think they got good value for their money. The acting is pretty good for a low budget horror. Even the little kids put in good performances. But the directions don't show any sparks or originality. There is nothing special here, and there are too many glaring problems.","user":"SnoopyStyle","rank":[9,10]},{"title":"Definite Guilty Pleasure","rating":7,"date":"26 April 2014","review":"Why am I rating this so high? I wish I knew. If you've read my other reviews then you know I'm a fairly harsh critic of new movies in the horror genre. That's not my fault, I just grew up with awesome horror movies that could scare the crap out of you and had a decent storyline with good acting.<br><br>The acting was definitely sub par. The zombie source is very unoriginal. The action scenes weren't all that good.<br><br>There were definitely cliché moments along with a bunch of scenes we've seen in other zombie movies. The gore scenes weren't even done very well. I could go on and on.<br><br>But seven stars............? The movie had a nice flow to it, something rarely ever seen in a B zombie flick. I'm not sure if there was supposed to be a bunch of comedy in this movie since it isn't billed as a comedy/horror, but it had me laughing out loud at some points and even talking at the screen. Maybe that's why I liked it so much? <br><br>If you can stand B horror with some good moments that may be unintentionally funny but still make you laugh and shake your head this is definitely the movie for you. But don't go into it expecting a lot of scares, there were none in this movie.","user":"hudsonda4","rank":[5,5]}]