[{"title":"Everything a nuanced documentary about a complex subject should be","rating":2,"date":"2 January 2019","review":"This documentary is everything a nuanced documentary should be.\nToo often we view and judge by our own current sensibilities. An institution such as Bordentown at the time of outright segregation, Jim Crow, Integration and today can be seen out of context with profoundly different lenses. \"A place out of Time\" addresses those points of view in an intelligent and balanced way.","user":"VoyagerMN1986","rank":[1,13]},{"title":"Perhaps there are some lessons to be learned from Bordentown.","rating":8,"date":"17 September 2011","review":"This is a one-hour documentary that was shown on PBS originally and it's available now on Netflix. It's all about a residential vocational and prep school in the town of Bordentown, New Jersey. The film was narrated by Ruby Dee and consisted of LOTS of interviews--mostly with various graduates from this school. What made this program unique was that it was a public black school--modeled, in many ways, after Tuskegee Institute. However, unlike Tuskegee and the vision of Booker T. Washington, Bordentown also emphasized higher learning and readied many of the graduates for college--which managed to take Washington's views on education and fuse them with W.E.B. Dubois' push for blacks to earn university degrees and strive for higher callings than just being ready for trades.<br><br>It's an interesting film--mostly because of how the school was perceived over the years. As a result of changing views on Black America, what was once seen as a bastion of education and opportunity became, around the time of desegregation (with Brown Vs. Board of Education) became yet another example of what is wrong with American eduction. However, the film emphasizes the good that was done--the instillation of pride, employment skills and self-determination--all things that would be wonderful for intercity kids today. So, as you hear the stories of the old residents of the program, you can't help but wonder if such programs might succeed today--especially if they are voluntary and open to all at-risk kids. It really makes you think--and makes for an especially thought-provoking film.<br><br>Well-constructed, intelligently written and fascinating--this is well worth watching because it makes you think. Good stuff and some very touching stories.","user":"MartinHafer","rank":[0,1]}]