[{"title":"Extraordinary spectacle","rating":8,"date":"18 June 2011","review":"To put this review in context, I went to see this film with no previous interest in contemporary dance. I have always put it into that category of 'things I just don't understand'. I understand it's a way of communication, but it's one that has never communicated to me. So my thoughts on this film probably won't have any interest to you if you are already a dance fan or a dancer or a fan of Pina Bausch in particular. But if, like me, you have heard that this is a visual feast of a film, or just that it is a Wim Wenders documentary, and are wondering whether to go see it for those reasons, this might help you decide.<br><br>I was a reluctant viewer because it was clear from the beginning that I still didn't 'get' it - what did it all mean? But visually, physically, this film ended up astounding me. It has stuck with me such that I can't stop thinking about it.<br><br>As a documentary, it doesn't do much to reveal its subject. It doesn't say much about how this woman thought, how she felt, her journey and what influenced it, what tortured her, what she was in denial about and how she related to the wider society. These are the revelations I expect in a 'great' documentary film. Films such as 'Man on Wire', 'Grizzly Man' or 'When We Were Kings'. Maybe those things are communicated though the dance itself. I don't know. Almost the whole film is dancing, interspersed with very short recollections from individual dancers. What these do get across are that Pina Bausch had a way of communicating with people and a depth of feeling that is unusual and wonderful. Those who worked with her (at least those that were interviewed) have the greatest love and admiration for her and what she was able to bring out of them. I ended up with a great feeling of admiration for her myself. Perhaps that was the point of the documentary.<br><br>But for me, it was the dancing and the way it was filmed that was astounding. It comes across with such intensity, such belief and such love, that I almost became a fan of contemporary dance. The sheer physicality. The bodies and what people could do with them. The beauty of movement. It is simply a joy to watch.<br><br>The quality of the visuals is startling. I saw it at a local arts centre which has a very good screen but I've never seen anything as sharp and as detailed as this. And the colours seemed more vivid than is usual. It was like discovering a new form of super high definition film. I understand it was filmed in 3D although I saw the 2D version. Still, it was amazing to watch. The way it is filmed also seems to work very well. It seems pretty straightforward. Most of the dance sequences are filmed quite simply on stage, but the framing seems to bring out the subjects well, even in 2D. Wenders has also filmed individual dancers or pairs of dancers in various outdoor locations - a city street, a road intersection, a train, an open cast mine. These little pieces are so beautiful and so unexpected. There is even one that is intentionally funny, where a girl gets on a train and pretends to be a robot monster. It's hilarious! So, for me a wonderful surprise. I still didn't end up understanding much of what Pina Bausch was trying to communicate but I enjoyed watching her try.","user":"markmagennis","rank":[38,45]},{"title":"Unexpected results","rating":8,"date":"6 April 2011","review":"I had a lot of preconceived ideas about this documentary before seeing it. They all came flat whenever I entered a Parisian movie house on the Champs-Élysées. That is to say, a few hours ago — the 6 of April being the French release date of Pina.<br><br>I was initially skeptical about the 3-D. The wave of Hollywood-like and -made items following Avatar has not convinced me. The new technique has remained a mere gimmick, funny and compelling at first sight, but eventually tedious. In this rather commercial context, Wim Wenders seems to be first « classical filmmaker » to use it for artistic purposes, that is as an adequate medium to render the complexity of Pina Bausch's choreography. Also, the critical reception during the Berlinale turned out rather positively. Nevertheless several reviews insisted upon the unrealistic effects of 3-D : the dancers' body would seem strangely « clean », almost virtual. I tended to agree with these considerations. I quickly understood my mistake. Wenders never uses 3-D for the sake of 3-D. Most of the time the viewer forgets its existence. It only appears from time to time : a sudden big shot, leaves floating in the air, drops of water falling on human skin, curtains dividing the space Theses are all magical moments. They reveal a new way of seeing reality and contain the premise of a might-able aesthetic revolution. Till the 1950's people used to dream in black-white. Perhaps, soon, I will be dreaming in 3-D.<br><br>On the other hand, I expected much of the Wender-Bausch dialog. Of course, with Pina dying on the eve of filming, the dialog could only have been posthumous. Well, the result is not so good. The film composes a beautiful, moving elegy to a great artist, but nothing more. After a first, innovating and convincing half-hour, Wenders' narration becomes repetitive and monotonous. It's mostly a serial of individual focus on dancers who all equally says how fine Pina was and sorry they are about her death. The film does not go beyond an extensive, overlong tribute. Preceding Wender's documentaries really showed the in and out of things : Tokyo-Ga revealed the paradoxical legacy of Ozu, and the Buena Vista Social Club the spontaneous life of the homonymous music band. Here, there is no paradox and not much spontaneity. Strangely enough a 3-D film only reveals a one-dimensional image of Pina Bausch : an unaccessible goddess, far away from the livings, and far away from the living person she was.<br><br>My final statement : an overlong documentary, but, probably, the cinematic experiment of the year. It's not a must-like, but a definite must-see. Eight out of ten.","user":"Dyscolius","rank":[54,68]},{"title":"Lifted me to a different awareness of movement","rating":9,"date":"3 October 2011","review":"Pina makes me wish I knew more about dance, though I suspect not all dance and dancers are so accessible or emotionally charged, by choice. At moments I was moved nearly to tears, I wanted to answer the question Pina reportedly put often to her dancers, \"what do you long for,\" with the answer \"beauty—and this could serve for now.\" I saw this tonight at Vancouver International Film Festival in 3D on the strength of its description and Wenders being the director and I'm very glad I did. One of the hallmarks of strong cinema, for me, is an altered perception of the world when I leave the film, which sometimes lasts for a considerable time: the vision of the film awakening me to what is around me. I found tonight not only a visual but a kinaesthetic carryover as I walked to the car, drove my friend to the subway, and then drove home through streets light in traffic. Though normally I don't care for cars or driving, in the wake of the dance spirit invoked in this film, I revelled in freedom of movement—in movement itself—at first hand in my own body and at a remove, in the things around me. This is good stuff.<br><br>I will think about scenes such as the woman straining at the end of a rope, about the driven and frenetic movements as well as the lyrical moments and the tributes to Pina, for a while, I think.","user":"E Canuck","rank":[27,32]}]