[{"title":"Worst writing ever...","rating":1,"date":"23 April 2010","review":"This might possibly be the lamest movie I've ever watched. The writing was so horrible, that my friend and I only continued to watch it so we could mock it. I cannot believe this was made into a movie. And on top of that fact, only a few of the people could actually act. The lines were so forced, it was embarrassing. The idea for the movie sounded good, which is why I was interested to watch it in the first place ~ but what could have made for a good story was just not there. I'm surprised that the few people who could actually act, took on the roles. As an actor/actress, I'd have quit after one read of the script. If you want to watch a mystery movie to get a good laugh, then this is it. You will not be disappointed on that front.","user":"kobara1","rank":[6,11]},{"title":"The Building","rating":29,"date":"29 April 2010","review":"I was fortunate enough to read the script 'The Building', and I have to say it isn't an easy task to create such a good story with so few settings and characters. I don't understand why so many people always assume when they don't like a movie for whatever reason that it automatically is the writers fault. Honestly, it's not! The director after all has the ultimate saying and could easily change the script. In the end, making a movie is a collaborative endeavor. This isn't the best movie of the century, but it's a small story with many twists and turns that will entertain you. And for sure it's not the typical boring action/horror thriller filled with useless chases and explosions.","user":"yvonneb2","rank":[7,16]},{"title":"Exposition destroys it","rating":2,"date":"16 February 2020","review":"When the characters have to spend the last 10 minutes of the film explaining what the audience didn't see that supposedly made everything that it did see make sense, you have a problem.<br><br>In short, the more the villain talked at the end, the lower the film's rating got. And the more the heroine talked in the last scene, the worse it got.<br><br>That's quite rare for a film.","user":"ryan_robbins-1","rank":[0,0]}]