[{"title":"Entertaining if flawed","rating":7,"date":"1 August 2011","review":"As people may know already I am a huge fan of Scooby Doo, the original(and best) show Scooby Doo! Where Are You? and The Scooby Doo Show being two of many shows to shape my childhood. The various incarnations after have ranged from surprisingly good(Scooby Doo! Mystery Incorporated) to terrible(Shaggy and Scooby Doo! Get a Clue).<br><br>And I do like the movies a great deal, especially Witch's Ghost, Goblin King and Zombie Island. Alongside Goblin King and Abracadabra Doo, Samurai Sword, even with the flaws, is one of Scooby's better recent efforts.<br><br>The movie is too short, the plot rather haphazard and meandering and the music rather uninspired and rushed in places.<br><br>Complaints aside, the animation is great. The colours and backgrounds have a colourful and fluid quality to them, and the character designs are thankfully not at all crude. The writing and jokes are amusing, and the samurai fighting is well choreographed and maintains interest. The characters, lead and support, are likable and fun and the voice acting is excellent with nobody really I would consider bad.<br><br>In conclusion, an entertaining movie. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[7,8]},{"title":"Pretty and action packed but seriously (and often needlessly) flawed","rating":5,"date":"15 September 2009","review":"The Good:<br><br>* My son (4 years old) liked it (hence 5 stars) * It was visually well done * It has ninjas, samurai, sword fighting, etc * It doesn't have Scrappy Doo (that HAS to be worth 3 stars alone!) * Frank Welker does a good job as Fred and Scooby Doo. Nobody can replace Don Messick as Scooby, but Don does about as well as anyone could.<br><br>The Bad:<br><br>* The music in this movie is, somehow, WORSE than the incredibly bad chase songs that they introduced in the 2nd season the original series. (Prime example: http://www.youtube.com/watch?v=5Nd37AkFsVI) * The plot is all over the place, but that's almost in keeping with the original series * Joe Sichta (writer/producer) is apparently infatuated with technology that he felt the need to have it DOMINATE a story about a Samurai legend. In case you think that I'm exaggerating, he has Velma build an EMP generator powered by a bicycle to defeat a band of ninja robots. 'Nuf said! * Daphne is now a martial arts master (wha' wha' what!?) * Casey Kasem sounds to old and tired that he is barely recognizable. Only when you hear that trademark Shaggy laugh does he remind you of the good old days.<br><br>The skinny:<br><br>Overall, it's action-packed enough for young kids to enjoy. The kids will enjoy it but it doesn't have the spirit of the original series that the adult Scooby fans are hoping for.","user":"culbeda","rank":[3,3]},{"title":"Well, at least it's better than \"Shaggy and Scooby-Doo Get a Clue!\"","rating":7,"date":"24 April 2009","review":"This may have a minor spoiler in it.<br><br>I was surprised that Termite Terrace was able to instantly churn out another new direct-to-video Scooby-Doo movie, especially since \"Scooby-Doo and the Goblin King\" only came out seven months ago! Usually the trend is a new Scooby-Doo movie every fall season, since 1998 when Warner Bros. Animation started the series with \"Scooby-Doo on Zombie Island.\" However, while this film was more enjoyable than the notorious \"Shaggy and Scooby-Doo Get a Clue\" or even its predecessor \"What's New, Scooby-Doo?\", it wasn't as good as \"Scooby-Doo on Zombie Island,\" \"Scooby-Doo and the Witch's Ghost\" or even the previous \"Scooby-Doo and the Goblin King.\" The plot isn't too bad, keeping real supernatural elements, but the plot is basically like a Japanese variation of \"Scooby-Doo and the Witch's Ghost,\" complete with a phony samurai ghost at one point, followed by a real one near the end. It strays a little close to the line with the real ghost resembling a kind old man but wearing a mask of the monstrous face. But I REALLY like the dragon that Scooby and Shaggy visit at one point in the movie that teaches them to be samurais, partly because I really like friendly dragons, and partly because it's about time a real dragon was used in a Scooby-Doo cartoon (well, there's Matches from the Ghoul School movie, but he was a baby dragon). However, once again, there is not much originality with the movie, since the gang had already been to Japan (I know they did so on \"What's New, Scooby-Doo?\" and \"Scooby-Doo and Scrappy-Doo\"). I was still a little irked about seeing the dumbed-down Fred (ala \"A Pup Named Scooby-Doo\" and \"What's New, Scooby-Doo?\") and the fashion-paranoid Daphne (same as previously mentioned shows), but I thought it was hilarious when after Shaggy, Scooby, Daphne and Velma said their catchphrases (\"Zoinks!\" \"Rikes!\" \"Jeepers!\" and \"Jinkies!\", respectively), Fred moaned, \"Dang! I STILL don't have a catchphrase!\" But the thing is, I guess the writers forgot that Fred DID have a catchphrase in \"A Pup Named Scooby-Doo\"... \"Let's split up, gang!\" But it was still enough to make me laugh. The Scooby gang gets an equal amount of time, and there were more scenes of them together than the previous films, but there was still quite a bit of scenes with just Shaggy and Scooby, and a few scenes with just Fred, Daphne and Velma. But at least Scooby-Doo has gotten more screen time than in \"Aloha Scooby-Doo\" and various \"What's New, Scooby-Doo?\" episodes, since he's my favorite character.<br><br>Voices are decent, with Casey Kasem still being able to voice Shaggy (need I mention that terrible Scott Menville's Shaggy voice?) and Frank Welker pulling double-duty as Fred and Scooby-Doo. The latter sounds much like a combination of his Brain from \"Inspector Gadget\" and Scott Innes's Scooby-Doo voice, so at least he's getting a bit better.<br><br>As for sound effects, once again they haven't changed much since they started doing the direct-to-video Scooby-Doo movies since 1998, only limiting the classic H-B sound effects to exaggerated comedy sequences or nearly any scene with Shaggy and Scooby-Doo. Maybe this H-B sound effect limitation worked just fine with the original made-for-video movies, but here it just sounds awkward, even though at least they've brought back the old Scooby teeth chattering noise, which \"What's New, Scooby-Doo?\" and the 2004-2006 made-for-video movies never did. This also goes for the Haunted Mansion-esquire \"Castle Thunder,\" which they still thought was too obsolete to use and instead recorded real thunder sounds (since the Samurai Ghost has the ability to generate lightning). I wonder if they came to my hometown to do so? (we had a particularly bad storm last summer that sounded exactly like the one in this film) But what annoys me about that is how the annoying \"Shaggy and Scooby-Doo Get a Clue\" series used the old thunder sounds, but the made-for-video movies (which are WAY better than \"Get a Clue!\") don't bother.<br><br>And speaking of \"Get a Clue,\" now on to the animation. The Scooby-Doo gang is still drawn in their typical \"What's New, Scooby-Doo?\" style, which is, I must admit, easier on the eyes than the crude animation/designs used on \"Shaggy and Scooby-Doo Get a Clue\" TV series. Good thing those awkward character designs only stuck with that show! But I think they should try showing the characters in their original outfits like the newest Scooby-Doo comics usually do, or at least make up a new style, maybe combining their \"What's New?\" outfits with the ones they wore on \"Zombie Island\" to \"Cyber Chase.\" Movements are fluid and realistic, and like the previous film, it is heavy with CGI effects.<br><br>But I do wish they'd start making them actually resemble \"Zombie Island\" and \"Witch's Ghost\" in look and feel again. Though it looks like a Joe Barbera dedication is definitely out of the question now, they have continued the trend from all the other made-for-video Scooby-Doo movies made since 1998 and ended them with a Hanna-Barbera logo, even though this patently hasn't been true at all! (At least Bill and Joe were alive when \"Zombie Island\" and \"Witch's Ghost\" were made.) In fact, I wouldn't be surprised if they used that remake of the old 1970s Hanna-Barbera \"box\" logo to replace the still Scooby/H-B graphic at the end of the first four movies!<br><br>Overall, good to rent or catch on TV, but I'd only recommend buying if you're a hard-core Scooby-Doo fan. Besides that, it's definitely better to watch if you're sick of \"Shaggy and Scooby-Doo Get a Clue!\"","user":"wile_E2005","rank":[5,6]}]