[{"title":"I get it, why don't more people?","rating":9,"date":"27 June 2010","review":"I watched these as a long-time Halo fan who's managed to get a solid OD of Halo life. I've read the books and seen all the extra content, I've debated back and forth with other fans and, more to the point, I've kept my sense of humour.<br><br>I loved Legends from end to end, although I despair a little at some of the people who can't seem to get the different aspects of it.<br><br>Origins; Solid work with a good director and a great narrative. Although for people who've read the books and seen the time lines before, it's nothing new.<br><br>The Duel; Showing signs of some of the great samurai movies of history, the change in depicting the Elites from vicious enemies to honourable warriors over the course of the games is only strengthened in this short. I loved the style, and I'm a die-hard fan of the 'one strong man against an army', why else would I enjoy Halo so much? <br><br>Homecoming; What's with all the hate? If you've ever even tried to pick up the books you'll know that this is pretty much another variation on the kind of thing that happened. The Spartans in training really were just angsty kids. Despite the size of Daisy in the flashbacks, she wasn't any older then eleven or twelve at the time. And that kind of thing does have a very hefty effect on you, regardless. The Spartans did escape, they did try to run away, and they most certainly experienced those emotions. So despite the slightly clashing styles in animation between characters and background, I loved it, heck I nearly teared up.<br><br>Odd One Out; Now this was just funny. What a mish-mash of classically over-done, completely over-the-top anime clichés! Super powered kids, dinosaurs, a stupid lead character who comes out on top in the end... Throw in a few internet memes and you've got the kind of stupidity that made 'Imma Chargin My Lazor!' funny in the first place (and don't pretend that you missed that bit, if you were watching it at all you'd have seen that face). Heck, even the Spartan's call-sign was '1337'. All of you claiming to be serious fans, just why? Why think that nothing about Halo could be funny? Don't tell me that you didn't stick the original game on easy and chase Grunts around with a pistol to make them squeal. It's literally just Halo for the Lulz. Secretly I have the opinion that most of you are people who would describe themselves as 1337 online too.<br><br>Prototype; Okay, yes, I know it's a cliché plot, and the characters do seem very... familiar. On the other hand, the easter-eggs hidden among both the fight scenes and the flash-backs are worth finding for some classic references. But again, the Halo universe thrives on just this kind of heroism, one person staying behind to hold them back? Using powered armour? And he's an inscrutable, seemingly emotionless man who's a veteran of hundreds of battles? Are we not drawing parallels between 117 here, instead of some other characters named so far? Babysitter; Again I say what's to hate? This is exactly the kind of situation that Spartans were deployed in. It's exactly how they were viewed, and exactly how they would have acted, and how others behaved towards them. I've been waiting for a decent rendition of how the Spartans had to interact with others, the games, especially the early ones, showed the ODSTs as far too helpful. The other marines weren't scared, they were impressed, and the military brass was altogether too happy to see them. The Spartans were freaks, as unlike the rest of humanity as the Covenant were, to some, with their green armour and faceless visors... Read the books kids, they might just open your eyes and shut some mouths.<br><br>And finally The Package; Brilliant, utterly brilliant. The spin-off game Halo Wars showed a couple of cut-scenes, highly rendered and beautifully directed, of what it was like having three Spartans take on the Covenant directly, including a fantastic case of direct hand-to-hand combat. This gave me the same feeling; the Spartans were unstoppable when they made their move, and particularly when they were led by 117, they never failed. Even if it killed them, they never failed. Plus, cameos are awesome.<br><br>I rate this highly, because I, much like the guys at Bungee (remember them, game creators?), have watched these shorts and not seen insulting values, but different and open takes on what the Halo universe has to offer. I've laughed with the funny stuff, and appreciated just how tragic the Spartans' lives really have been, and that's all there is to it.","user":"nosonnic","rank":[22,28]},{"title":"The origins stories of Halo are brought to glorious life.","rating":9,"date":"25 October 2011","review":"I must say, this was quite a surprise. About a decade ago, Halo: Combat Evolved revolutionized how games, specifically first-person shooters, should be played. What followed was a succession of sequels, each being better than the last one. Inevitably, a movie was not far away. With the possible live-action movie postponed by companies fighting over it, this anime was created help satisfy fans and keep them waiting for the live-action film. It does its job well.<br><br>In a style similar to \"Batman: Gotham Knight\", Halo Legends consists of several action-packed episodes, each made by a different studio, having its own unique artwork/animation, and basically revealing a certain aspect of the Halo universe. The episodes are Origins Part 1 and 2 (history of the Halo universe), The Dual (how the Arbiter became a title of shame), Homecoming (the horror of the Spartan II program), Odd One Out (a ridiculous non-canon episode), Prototype (the first Spartan armor), The Babysitter (ODST-Spartan rivalry), and the Package (Master Chief and company go in to retrieve a heavily-guarded package).<br><br>Odd One Out is the only flaw in this movie. Everything else is excellent. Beautiful animation, wonderful music, awesome action scenes, and great stories. This is as good as the games. Fans will most likely enjoy this and so will you. In the words of the Master Chief, \"... we're just getting started,\" because soon enough the live action movie will arrive.","user":"kevinxirau","rank":[11,14]},{"title":"Diversity over Quality","rating":6,"date":"15 February 2010","review":"Halo Legends is an anime anthology series in a similar vein to \"Animatrix\" and \"Batman: Gotham Knight\". It consists of 8(but actually 7 since two of them are just parts 1 and 2 of the same story) short animated stories that explores areas of the rich Halo game universe which were previously only the stuff of rumors. Different anime studios and directors worked on each segment as as such, the quality of both the stories and the animation varies a lot from one clip to the next. Some for the better, others less so. Overall, the whole production plays the \"diversity over quality\" card. There is something for everyone to enjoy but at the same time, something that a anime fan might like, a Halo fan might consider it as a great insult to a great game. It also requires viewers to be well versed in at least the most basic of Halo jargon. Curious little piece but not quite essential viewing for either anime or halo fans.<br><br>I'll rank the segments from my favorite to the least favorite <br><br>1) The Package, Directed by Shinji Aramaki(Appleseed).This one is for the fans of the game as it looks just like one of the in-game cinematic cut-scenes. For the only time in the whole anthology do we finally get to see Master Chief 117 in action. First, an amazing scene of space combat that rivals even Star Wars: The Clone Wars. Then all out Guns-a-blazing action as Master Chief and a team of Spartans attempt to retrieve the titular package John Woo style. So many little easter eggs including a short FPS sequence and an important cameo appearance, easily make this segment a fan favorite for sure.<br><br>2) Origins 1 and 2 directed by Hideki Futamura(director of \"Genius Party\" Key animator of Vampire Hunter D Bloodlust) with animation produced by Studio 4C(Transformers Animated, Spriggan). Cortana narrates out the history of Halo from the ancient time of the forerunners to the events of the game. Though it plays out like some slideshow, the animation is richly detailed combined with the best 3D CGI used for backgrounds and vehicles. They even used a older 1980s animation style for the ancient history segments to give it that aged look.<br><br>3) \"The Duel\". Boasting a graphic style reminiscent of classic Japanese watercolor paintings courtesy of Production I.G (Ghost in The Shell: Innocence, IGPX), it really is refreshing to see an anime studio try something new. With themes of honor and betrayal, the costumes worn by the characters and even the traditional woodwind music, it is safe to assume that the directors, Hiroshi Yamazaki and Mamoru Oshii(Ghost in the Shell, Sky Crawlers) intended this to be a homage to traditional Japanese folk tales and art. We follow a tale of an Arbiter named Fal who fears that the covenant's ways are dishonorable. The prophet uses this to accuse him of heresy and has Fal's wife killed in order to lure him to his death. It is action intense while also giving a glimpse into the Covenant's inner workings.<br><br>4)\"Prototype\" by studio bones (rahxephon, FullMetal Alchemist).Directed by Tomoki Kyoda of \"Eureka 7\" fame and new comer Yasushi Muraki, it seems that someone got lazy and just edited a story outline of a Gundam episode with new names and Halo terminology. I would have ranked it higher if it weren't so unoriginal. Basically its about a Platoon commander \"Ghost\" who suppresses his human emotions in battle. He steals a weapon laden mobile suit and attempts to hold off the Covenant forces while the humans can escape. Imagine Gundam Wing's Heero Yui as a Halo marine and you have Ghost. While this was a heart wrenching little anecdote, it suffers thanks to its unoriginality.<br><br>5) \"Homecoming\". another unoriginal story. The main character is a SPARTAN II soldier named Daisy 23. While the story takes place during a mission in present day, flashbacks reveal the sad origin of the SPARTAN program where children are kidnapped to be surgically augmented and trained to be super soldiers. The flashbacks tell the tale of a failed escape attempt by Daisy and some other trainees and how she finally comes to terms with her role in the coming war. Homecoming tries to tug on the heartstrings but ends up a mildly boring mess. The flat 2D art and uninspired character designs clash badly with the beautiful backgrounds. Whats more, the tough SPARTAN soldiers are portrayed as angsty emo teenagers. One of the weakest entries in the whole movie.<br><br>6) Odd One out. 1 word summarises it = stupidity.The title not only describes the main character SPARTAN 1337 but the entire segment itself. While other clips focus on dark gritty war stories, Odd one Out focuses more on lighthearted slapstick comedy. It is no surprise that director Daisuke Nishio, who also directed the Dragonball anime, would imbue this with all the staples of those long running Shonen action series. Exaggerated hand to hand combat, quirky characters, super powered kids, cheesy dialog. Even the flaws like repeated scenes and inconsistent animation is present here. A real insult to Halo.<br><br>7)\"the Babysitter\". Not only is this little story one of the weakest in terms of narrative but in the animation too. The story does not have the emotional impact of the previous ones and only serves as a reminder for the Halo fans that the production team has not forgotten about the Helljumpers from \"Halo: ODST\". Toshiyuki Kanno's animation is flatly colored and clashes with the detailed CGI backgrounds. Character movements are painfully stiff except for one or two shots.<br><br>In closing, Halo legends has something for everyone and something to put everyone off. Where Animatrix and Batman Gotham Knight had constant running themes or common characters throughout each of its separate segments, Halo legends lacks that cohesiveness.","user":"xamtaro","rank":[45,73]}]