[{"title":"It's all about the \"feel\"","rating":8,"date":"28 February 2012","review":"There is one element that distinguishes a \"great\" sports movie from a \"good\" sports movie. It's \"the feel\". It doesn't matter if the movie is about baseball, basketball, football or hockey. If it doesn't smack of authenticity you might as well flip over to a live game. \"The Natural\" had the feel of baseball and for hockey \"Slapshot\" has always been the template for the great hockey movie. I happily add \"Goon\" to that rarefied space.<br><br>As far as movie making goes, it has all the right stuff. The acting is convincing and solid, the jokes are funny and there is lots of on-ice action. But the defining feature of this film is that it feels real. It feels like these are real guys playing a real game in front of real fans. True hockey fans will get the in jokes, wince at the ankle injury, relate to the dressing room banter, and feel tempted to yell \"head's up\" when the bad guy starts to take a run at the little guy.<br><br>The key scene is, of course, the final showdown between \"good goon\" and \"bad goon\". We know it's coming, but sometimes we know the NHL fights are inevitable, as the tough guys line up before the face-off and start jabbering. The build-up is just as visceral in \"Goon\", and when they finally drop the gloves it reminded me of that great final shoot-out scene in \"The Good, The Bad and the Ugly\", as the guys do the pre-fight strip tease and wait for other to draw first.<br><br>I will risk the wrath of my fellow hockey fans who have grown up worshipping at the church of \"Slapshot\". It was a great movie, although a bit long. I found \"Goon\" to be more entertaining, as authentic and more believable. Nice work guys!","user":"jimhurcomb","rank":[68,78]},{"title":"If this is your type of movie, you won't be disappointed.","rating":8,"date":"25 February 2012","review":"I think that if you go to see this movie, you know what you're getting into. It's essentially a love letter to the violent side of hockey written by Jay Baruchel and Evan Goldberg, both of whom are known for a particular kind of comedy, and it stars Seann William Scott, who is known for playing a particular kind of character. Check out the 'People who liked this also liked...' section on the page for this movie. You'll see flicks like The Hangover, Crazy, Stupid Love, and Role Models. If those are your type of movies, chances are you'll enjoy Goon. <br><br>The premise of the movie is that a likable, polite, not-exactly-bright bouncer, Doug Glatt, is invited to join a semi-professional hockey team as an enforcer. I think what I chiefly liked about the film was that yes, there's lewd and crude humour and a somewhat predictable plot line, but you'll like the characters and at no point does the movie start to drag or fail to entertain. <br><br>I was also pleased to see that, as a Canadian hockey fan myself, I wasn't spoon-fed easy stereotype jokes. The things that were funny hadn't been recycled a hundred times in every other movie that pointedly features Canada as a setting. The characters do drag out the old 'eh' every now and again, but you feel more like it's a wink to Baruchel's home audience rather than something intended to hit you over the head with a 'SEE, we're in CANADA!'<br><br>Bottom line: This flick isn't going to win any Oscars. But if you want to see something thoroughly entertaining, it's a good bet. If you don't laugh at least once, you're - probably my grandmother.","user":"december_starz","rank":[75,89]},{"title":"The trailer doesn't do this justice.","rating":7,"date":"18 January 2012","review":"I hadn't read or heard much about Goon before I went to see it; all I'd seen was the trailer. I didn't even realise that it was based on a true story. I wasn't expecting it to be that good, but was pleasantly surprised. <br><br>I was expecting that the funny bits in the trailer were all that would be on offer but the whole film was seeped in that simple (albeit sometimes unnerving) comedy that had the audience laughing out loud often. <br><br>Furthermore, beneath the usual humour we've come to expect from Goldberg, there is a much deeper underlying story to it. It was even endearing in parts. OK so 'endearing' isn't the best word to describe a comedy sports film that has as much gore as it has humour, but the way that Seann William Scott portrays Doug really did something of touching my heart, and it was refreshing to see Scott play the role.<br><br>Granted it may not clean up at the Oscars, but the story of a guy who really has no idea where he belongs is both hilariously and sweetly told in Goon, with a great relationship conveyed between Doug and his friend - excellently played by Baruchel - who seems to be the only one who believes in him.<br><br>Teamed (no pun intended) with the banter generated with the game of hockey and Doug's fellow players, this really makes for a must-see for any sports film fan, or comedy film fan, or indie film fan. There's a love story in there too for the romance fans. Which could potentially give Goon a pretty huge audience. If people ignore the trailer, that is.<br><br>Yes the whole story is slightly clichéd, but this film does so much more than the trailer gives it credit for, and deserves the word to be spread that this really is worth a watch.","user":"leana555","rank":[85,104]}]