[{"title":"Not only the lake was placid here...","rating":2,"date":"29 August 2010","review":"Truth be told, I didn't even know there was a 2nd and 3rd movie to the \"Lake Placid\" movie, so I just came over the third movie by coincidence. So I sat down and watched it.<br><br>And then the terror began...<br><br>Oh. My. God! The CGI effects in this movie were so unbelievably poor. The crocodiles were among the crappiest CGI creatures I have seen in a long, long time. The intentions were good, but the effects were so lousy.<br><br>As for the story? Well nothing much to be expected here. You have a pretty basic \"let's make a sequel\" movie here. Local people and animals being eaten by monstrously big crocodiles, and a gun happy hunter is brought into the fray. And a family with troubles that somehow manages to save the day. It is all here. And it has all been seen before.<br><br>The acting, well it was wholeheartedly attempted, and actually most weren't too shabby. Some were questionable to say the least. But, of course, this is not an award winning movie, just another SyFy flick.<br><br>I managed to sit through it, but I was so tempted to get up and find something else. Which I should have done. This movie is not really entertaining, it is in the line of being ridiculous. But generally I sit through a movie once I started it. I think you have to be a really, REALLY hardcore fan of the first \"Placid Lake\" movie to actually fully enjoy this movie.<br><br>Well, at least it was an attempt at making a movie with giant crocodiles, it just didn't work out all that well. This is not a good choice to put on if you want to be entertained by a good wholesome movie with giant creatures. There are lots of other (and better) movies out there.","user":"paul_haakonsen","rank":[18,22]},{"title":"Go back to the 'old school' critter effects!","rating":5,"date":"9 November 2010","review":"'LAKE PLACID 3': Two and a Half Stars (Out of Five) <br><br>Second sequel to the cult classic 1999 horror / comedy film 'LAKE PLACID'. Having been a fan of the original film it is pretty disappointing to see it take the sequel rout that so many seem doomed to (like 'LOST BOYS', 'TREMORS' and 'STARSHIP TROOPERS' for example, the 'FROM DUSK TILL DAWN' direct to video sequels were actually pretty good compared to others). These sequels (this one and it's 2007 predecessor) were actually released as original made for television Syfy network movies first and then as 'unrated' video releases quickly after. They have a great deal of nudity as well as graphic gore and it appears as though the films were filmed with two versions planned, to capitalize on both markets (Syfy network television and 'unrated' DVD).<br><br>This third film stars Colin Ferguson (from TV's 'EUREKA'), Yancy Butler (an old favorite of mine and she still looks hot, and is hilarious as well) and none other than Michael Ironside. Ferguson plays Nathan Bickerman a game warden who relocates his family to Lake Placid and into the house of his late aunt Sadie (played by Cloris Leachman in the second film, who was the sister of Betty White's Delores Bickerman character from the original film). She was killed by a crocodile in the end of the second film but Sheriff Tony Willinger (Ironside) assures the Bickermans that all the killer crocs are gone from the area. Unfortunately Nathan's son Connor (Jordan Grehs) discovers some baby crocs near by and secretly feeds them until they grow into deadly crocs as well and start terrorizing the locals once again. Butler plays a tough and foul mouthed hunting guide hired by a college student (Mark Evans) to find his girlfriend (Kacey Barnfield) who went hiking in the area with another guy.<br><br>The film is quite a bit better than the last chapter, especially the acting. Some of the supporting actors are still pretty bad but Butler, Ironside and Ferguson all give better performances than the material has to offer them. The directing and writing is about what you'd expect from this type of film but it does have it's quirky funny moments. The film's main problem (as with the last one and all Syfy network films) is the horrible special effects. The CGI is so bad and painful to watch that it ruins the whole film. This is especially disappointing with this film considering it had potential in other areas. The last chapter was just an all around bad film (although Leachman and John Schneider were entertaining in it). These films really should go back to the 'old school' plastic critter effects, they'd be a lot cooler if they did so. I know they don't have a lot of money to spend but no effects would be better than the CGI were subjected to.<br><br>Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=CcXJ6wkPwN0","user":"Hellmant","rank":[15,18]},{"title":"You get what you pay for (Hint: this was free)","rating":3,"date":"23 August 2010","review":"Brazenly ridiculous. It has little to do with the self-satirical original Lake Placid, other than the name. For whatever reason, somebody thought the bargain-basement LP2 warranted a sequel, or a remake, or whatever. So there's yet another generation of these hungry chomping monsters.<br><br>Except for Michael Ironside as the quintessential skeptic hick sheriff, and the guy from Eureka poking fun at his Eureka character, the acting is laughably amateurish. The teen actors fare worst; when the girls scream, the shrill noise they emit sounds like an old Talking Tina doll with a broken speech mechanism. The laughable teen soap opera plot doesn't help the paper-thin throw-away characters, either. The knife-wielding nut wasn't bad, considering the outlandish cliché she got stuck with. Don't get me started on that latchkey kid and his weird problems. Throw-away characters have \"gator meal\" stamped on their heads at all times. <br><br>Could the director explain why the gators always grab people's shoes, and drag them for 20 minutes before they decide whether to kill them or not? Do they like to nibble on shoes? <br><br>Go in with a \"laugh at dumb it is\" MST3K attitude, and there'll be a few moments that will not disappoint.","user":"MartianOctocretr5","rank":[12,16]}]