[{"title":"Interesting film.","rating":7,"date":"15 September 2010","review":"I saw the premiere of this film tonight at the tiff festival in Toronto. Most of the starring cast was on hand for the premiere, which was nice, and they appeared very proud of the film.<br><br>In all, the film was a bit above average, but the pacing was a bit off in places and so it seemed that just when it sucked you in it let you go, and that repeated several times during the show. It's a good film though, with a great deal of humour and subtleties, but doesn't quite get there enough to make it a great film.<br><br>Jennifer Connolly gives a very inspired performance, and she's really the one who draws you in the most and really puts you through a bit of an emotional roller-coaster. She's over the top, silly, tragic, and lovable, though you never quite figure her out. Ed Harris plays a wonderfully complex and very understated role, but it's the underlying parts of his character that he brings out so well.<br><br>In the end, you don't quite come out with a feeling that you were completely happy, but you have a lot of good parts to look back on. I would have given this film an 8 if not for the uneven pacing of the film, and if you're into character driven stories then you'll likely enjoy this one.","user":"Fludlerk","rank":[28,31]},{"title":"Undertones of mental illness, religion and politics take Virginia to interesting places","rating":8,"date":"20 August 2012","review":"Virginia (Jennifer Connelly) is one seriously disturbed woman. One possible look at it is that she was screwed over by having an affair with an aspiring Senator, Dick Tipton (Ed Harris), who left her pregnant and alone to raise her son as a single mother. \"Virginia\" has a number of story lines, some in present time, some in flashbacks, but all resulting from the affair between Virginia and Sheriff Tipton.<br><br>The first is one of a teen romance. Virginia's son, Emmett (Harrison Gilbertson) is in love with the Sheriff's daughter, Jessie (Emma Roberts). The problem is they are half-siblings and they're told they're not even allowed to see each other let alone be friends with each other. Nobody is supposed to know of the affair so their forced separation can raise a few eyebrows. Interestingly, it's Emmett who starts questioning what's really going on.<br><br>What's really going on is that nobody is stable. The Sheriff is a devout Mormon and extreme conservative. In his Senatorial bid campaign, he needs a photo-op with a red, white and blue Ferris wheel, but the town's only Ferris wheel is pink and it's owned by an out-and-proud gay man. It is the simple conflicts like this which are resolved on the surface which lead to the very interesting dynamics in the film.<br><br>Dustin Lance Black is a relatively young filmmaker who is making his directorial debut with \"Virginia\" and previously wrote the screenplays for \"Milk\", \"J. Edgar\" and the HBO series \"Big Love\". He was raised in a Mormon household and community and was worried about his sexuality. Most of his filmmaking career has been spent inspiring people to become LGBT activists. <br><br>What is interesting about \"Virginia\" is that while none of the main characters are outwardly gay, the film appears to still be very personal with the boardwalk town likely doubling for Black's hometown of San Antonio, Texas. The religious undertones are very present but never over-powering. <br><br>The overall plot of \"Virginia\" definitely has places to go but the story hasn't been too well received. What is more interesting is what the film is trying to say without actually saying it. Black is such a talented writer that there's lots to read in between the lines.","user":"napierslogs","rank":[19,23]},{"title":"There's nothing wrong with Virginia, but there might be a mormon boy in her closet!","rating":17,"date":"17 September 2010","review":"I was fortunate enough to attend the world premiere of Dustin Lance Black's highly personal, unique, and heartfelt new film, \"What's Wrong With Virginia\", in Toronto. The film owns a quirky charm that reminds me of Tony Richardson's \"The Hotel New Hampshire\" (1984, based on John Irving's novel), yet with its own very personal style. Jennifer Connelly, more beautiful than ever at 39, gives her best performance since 2003's \"House of Sand and Fog\". She plays Virginia Nicholaus, a mentally ill single mom who's had an affair with the local Mormon (and married) Sheriff Dick Tipton (Ed Harris, great as always) for 16 years. Her teenaged son, Emmett (newcomer Harrison Gilbertson, very convincing and simply adorable) is her only real love, and their relationship is the real core of the film (Black has stated the film is loosely based on his relationship with his mom). Things get complicated when Emmett - who may or may not be the Sheriff's son - starts dating Dick's daughter, Jessie Tipton (Emma Roberts), and how that and an unwelcome 'revelation' by Virginia can ruin Dick's political goals and marriage.<br><br>Black, who won a much deserved Best Original Screenplay Oscar for Gus Van Sant's \"Milk\" (and gave a groundbreaking, already classic acceptance speech), is not just a terrific writer, but also a natural actor's director. He extracts great performances from his ensemble, and although this is clearly Connelly's show, other cast members deserve to be mentioned: Amy Madigan, married to Ed Harris in real life and in the film, gives a moving, understated performance that could've easily been overplayed/clichéd; she's one of our most underrated character actresses. Carrie Preston, of \"True Blood\" fame and the best thing about \"Duplicity\", plays Virginia's friend Betty with gusto, and Toby Jones (\"Infamous\") is great in a character that starts out as creepy to later become human and even endearing. Yeardley Smith, mostly known as the voice of Lisa Simpson, also has a small part and is one of the executive producers of the film (Christine Vachon and Gus Van Sant himself, who don't get involved with just any kind of material, are some of the others who helped bring this project to life). <br><br>\"What's Wrong With Virginia\" provides lots of laughs and a considerable emotional punch that almost made me sob by the end. It's humorous and outrageous, tragic yet optimistic; it made me feel a range of emotions that most films out there fall short of. Well done, again, Mr. Black! It's comforting to know real auteurs are still blossoming in the world of cinema.","user":"Benedict_Cumberbatch","rank":[29,38]}]