[{"title":"a moving and serene examination of grief, greatly acted","rating":8,"date":"17 July 2011","review":"The universal theme of suffering after the abrupt death of a dear one, with the necessity for those who remain to go on with life, is here presented in a very serene way. No melodrama, no anxiety, no exaggeration in sensitivity, but solid realism, with a touch of the magic of this tree, heart of the family and of the movie. It's a movie which follows the pace and the inner development of the single characters, mainly of Dawn, the mother, and Simone, the daughter, both wonderfully interpreted by a high-talented Charlotte Gainsbourg, and by a surprisingly mature little girl. It's a movie about the need to go on, to accept the strokes of life with the force and dignity that, let me say it, sometimes only women have, with no sentimentalism, no pathetic indulgence, but with sober realism and a strong feeling for human courage. Another movie that unfortunately will not reach the great distribution, but we know that the phantasmagoric magic of Harry Potter attracts more public and brings more money than the humble magic of a fig tree. However, a truly valid picture.","user":"yris2002","rank":[18,20]},{"title":"Beautiful tale of family and life","rating":8,"date":"25 July 2010","review":"After the sudden death of her husband, his wife and four children try to get on with life in the bush of Northern Australia. It could be a story overwhelmed by emotion, but yet it play the emotionally side with more subtlety. The family live in an old house with an enormous Morton Bay fig next to it and it's this tree that firstly with the young daughter and then with other family members where they gain the idea that somehow the spirit of their loved one is inside. The film follows the family as they move on, but without forgetting the tree and protecting it at all costs.<br><br>Thought the film has a potentially supernatural idea, it doesn't play out that way, in fact it's quite the opposite. The notion that the tree contains the spirit is quite charming and leads to some wonderful encounters for various members of the family. Grief is dealt with in many ways and for these people this is how they deal with it. The cast is very fine: Charlotte Gainsbourg is very good as the mother, she is charismatic and a joy to watch. As is the daughter Simone, played wonderfully by a superb young actor, she really is something, creating a funny, touching and realistic portrayal of a young girl who is dealing with the loss of her Dad. But all the cast is fine creating a truly real feeling to events that occur.<br><br>The film also works for it's use of nature. Australian films set outside the city are known for their great use of the landscape and this is no exception. Stunning landscapes and skyscapes fill the screen and there are other wonderful moments including natures creations, such as the fruit bat that flies into the kitchen or the frogs in the toilet and the families attempts to get rid of them. And let's not forget the tree. It is a huge presence in the film, literally and metaphorically and could in it's own way be a character, it is a imposing, glorious and wonderful creation and of course paramount to the story.<br><br>The film ends with a bang, but a positive one, a situation that leaves the family or gives the family a chance to move on, it is almost a relief and at the same time quite touching. The film as a whole is a highly enjoyable one, and that doesn't tug on the heart strings with it's story, instead presenting itself with humour, charm and beauty.<br><br>Find more of my reviews at my site iheartfilms.weebly.com","user":"ihrtfilms","rank":[20,25]},{"title":"Good movies don't make much noise","rating":7,"date":"2 July 2011","review":"Story of the 'The Tree' takes place in the country side of Australia. It's plot around Dawn O'Neil who is a mother of 4 children struggling to recover with the unexpected loss of her husband. When the father die the happiness of the family seems to ran far away and Dawn for months tries to understand the reality and put everything back together for her kids. But the youngest 8 year old daughter Simone fails to adapt to the situation and starts to believe that her father speaks to her via the big old tree in their garden. And when this tree becomes too unstable and threatens the house and the family Dawn has to decide if to chop the tree down amidst her daughter's objection. <br><br>The Tree has a good flow. It's filled with little events which defines the O'Neil family and how they try to cope up with the loss of their father and the protection and income. Alongside the main attention is given towards the giant tree which holds a significant value in the family and its history. Soon the viewer starts to feel like the tree is actually a family member which keeps the family in bound to each other. And it does it for good reasons. <br><br>Dawn's character is a strong one. And Charlotte Gainsbourge portrays it quite skillfully. And the performance by the little Morgana Davies who plays the sweet yet stubborn Simone does a wonderful job as well. Overall the acting in the movies is quite raw and closer to reality. Thus brings viewer in to more realism with the whole situation. <br><br>The Tree most of the time is a quite movie. With little score and few lines in between it will put the viewer in to the middle of a lonely place. But don't let that loneliness to gulp you down. Because good movies don't make much noise. <br><br>My reviews at flickshout.tk","user":"priyantha-bandara","rank":[9,11]}]