[{"title":"Riddick Returns to Darkness","rating":9,"date":"6 September 2013","review":"There have only been a few time this year that I have gotten to leave the theater with a giant grin on my face, Riddick was one of those times. <br><br>I spent a little bit of time reading others reviews before I started typing this up and, I won't lie, they kind of ticked me off. Riddick is a movie that took its 40 Million dollar budget and stretched it to the absolute MAX, I also feel like this is one of Vin's best performances to date. There is no sexism in the film...There is no horrible see through acting...there is no moment during this movie when I was bored...It's a thrill ride. A brief summary <br><br>Act 1-Riddick is stranded on what might be his home planet and has to re-man up after becoming soft while leading the Necromongers (Riddick being the only person hard enough to ever soften up when taking over a galaxy dominating army) There is a dog in act one but it plays very well into the story and I personally got attached to the pup...think of Will Smith's dog in \"I am Legend\" <br><br>Act 2-Mercs are brought to the planet and the fun begins...for the next forty five minutes the story is about the Mercs and Riddick becomes what we all love...a monster in the Darkness.<br><br>Act 3-It starts raining...I'm going to stop there on act three because I want to spoil nothing... The End-Was exactly what I wanted and had me leaving the theater with a giant grin on my face. <br><br>WARNING: This is not a happy sing along movie with a perfect hero who saves the day in the endthis is also not \"A Piece of Art.\" This is Riddick it's Muddy, Bloody, Painful and as always FUN!","user":"ninjaeatingataco","rank":[355,507]},{"title":"Riddick - just as bad-ass as the previous ones!","rating":8,"date":"6 September 2013","review":"Just saw the movie and loved it. I greatly enjoyed the first and second films so I've been looking forward to this since it was announced. It's a great sci-fi bad-ass action movie. Plenty of cheesy one-liners and good action scenes set in a sci-fi world.<br><br>The story wasn't anything spectacular, no breaking new ground here but it does set the stage for the next (hope we get a next!!!!). Graphics were well-done, alien life wasn't anything unique but were suitably scary.<br><br>If you liked the 1st and/or 2nd film you'll enjoy this. It pays more homage to the 1st than the 2nd. Vin Diesel does another great job acting as Riddick and you'll be cheering for the anti-hero as usual.<br><br>I personally am hoping the series continues, can't get enough of this! hope you enjoy!","user":"bobbo204","rank":[158,229]},{"title":"More than a fun sci-fi flick","rating":8,"date":"4 September 2013","review":"I wasn't expecting much. When I heard of the sequel I assumed it'd be a bigger and \"better\" chapter in the Richard D. Riddick series. Then I saw the trailer and thought that going back to the basics of Pitch Black felt like Twohy didn't know how to go bigger and was reverting into his safe bubble. I was wrong. This is by far Twohy's strongest script with a surprising range of fleshed-out characters. The first ten minutes of the movie has no dialogue and right from the get-go I was pleasantly surprised. It begins to feel like an appropriate direction to take the character. There are jokes that don't work but most do. While Riddick's monologue is a little... quaint (and a cgi dog companion that feels a tad out of place; but i get why it's there) i really think it's important that 'Riddick' is a success at the box office -- to help open the way for genuinely fun, inventive sci-fi narratives with a budget.","user":"LumpysFriend","rank":[211,312]}]