[{"title":"A Vacuous \"Vacancy\" Rip-Off.","rating":3,"date":"26 September 2010","review":"They should've sold this script as Vacancy 3. A couple who are having marital problems are involved in a crash on a deserted highway in the middle of nowhere. The other driver takes off. Cue the creepy Sheriff (Jeff Fahey) who recommends staying at a dodgy motel up the road until they can arrange a tow. Cue the creepy guy behind the counter who don't much like them city folk. Break out the guys in masks, the disturbance in the room next door, the loud banging, the awful realisation that they're being watched and then introduce the sicko's who are viewing this snuff for their own sick pleasure. The only differences between Terror Trap and Vacancy are the use of a sinister Sheriff as opposed to a smiley Gas Station Attendant and the fact that the snuff customers are watching a live feed of the mayhem as opposed to buying the videos.<br><br>Cue Michael Madsen as the dude in charge. I'm a huge Tarantino fan and I have oodles of respect for Michael Madsen, but someone seriously needs to tell that guy to stop playing Mr Blonde in every movie. Whether he's playing a good guy or bad guy, his persona is always the same. Although, he was quite different when he played the lovable cat burglar in Heart and Souls. Wait a minute... that was Tom Sizemore.<br><br>I have a newfound appreciation for Luke Wilson and Kate Beckinsale's performances in Vacancy. I couldn't bring myself to care even slightly about the main couple. The woman, Nancy, is the most unlikeable heroin I've seen for a long time. About 10 minutes into the movie I started preying for her to get brutally slashed to death, just to shut her up.<br><br>The only reason I made it to the end of this film is because it hadn't been reviewed on IMDb yet. That's how bored I was. My review is quite generous. Save yourself!<br><br>Check out my IMDb List for some better suggestions. \"HORROR/THRILLER: Obscure, Overlooked &amp; Underrated\" http://www.imdb.com/list/8QFZ78e4Ar8/","user":"NozinAroun81","rank":[38,44]},{"title":"Lame Rip-Off of Vacancy","rating":2,"date":"23 September 2011","review":"While driving at night in a lonely road, the car of the estranged couple Don (David James Elliott) and Nancy (Heather Marsden) is hit twice by another car in the middle of nowhere. Nancy asks for help and the unpleasant sheriff Cleveland (Jeff Fahey) offers to take them to the nearby Motel Royal Vista and wait until the morning, when their car would be towed. .<br><br>When the couple arrives in the low-budget and foxy motel, they are attended by a weird receptionist. They are disturbed by noises and screams inside the next door room and Don asks them to keep quieter since his wife and he are tired and need to rest. But sooner they realize that they are part of a sick and deadly game, and their lives are threatened by sickos led by Cleveland and his partner Carter (Michael Madsen).<br><br>\"Terror Trap\" is a lame rip-off of \"Vacancy\", with terrible story, characters and acting. The plot has several holes and the conclusion is absurd and apparently with no consequences to the creepy and sadistic participants and the victims of the sick game. Nancy is one of the most detestable and annoying characters I have ever seen, especially considering that she is leading lady of the story. I was cheering for her to be killed and vanish. Michael Madsen is a one-dimensional actor, repeating his performance in \"Reservoir Dogs\" is many low-budget movies. My advice: better off watching \"Vacancy\" again than spending time with \"Terror Trap\". My vote is two.<br><br>Title (Brazil): \"Não Há Vagas\" (\"No Vacancy\")","user":"claudio_carvalho","rank":[21,25]},{"title":"Low Rent rip-off of Vacancy.","rating":3,"date":"2 November 2010","review":"Terror Trap starts late one night as squabbling married couple Don (David James Elliott) &amp; Nancy (Heather Marie Marsden) drive through the isolated back-roads of a small Louisiana town called Santa Parish on their way to a casino in Marksville, suddenly a car crashes into them &amp; speeds off leaving Don &amp; Nancy stranded in the woods. They call 911 for help &amp; Sheriff Cleveland Taylor (Jeff Fahey) arrives, Taylor drives Don &amp; Nancy to a nearby motel, the Royal Vista which is a rundown dump. Don &amp; Nancy are given a room but soon discover that the owners are playing a sick game in which the motel is used to snuff films &amp; the paying guests used as unwilling stars...<br><br>Written, produced &amp; directed by Dan Garcia this film could quite easily be thought as of a cheap low budget remake of Vacancy (2007) as the two are so similar, from the big city couple checking into a rundown motel in the middle of nowhere to their terrorisation &amp; attempts to kill them by the owners for profit &amp; the eventual turning of the tables by the resourceful city folk. Now I will list what I liked about Terror Trap, firstly I appreciated the fact that it lasted just under 75 minutes, secondly I liked that the main city couple were adults rather than dumb teens &amp; I liked the feisty Nancy who had a lot of personality &amp; gave as good as she got in some amusing verbal sparring between herself &amp; Don, she almost made this watchable. Almost. You see what I didn't like far outweighs what I did. Even at only 75 minutes in length Terror Trap takes ages to get going, it's forty odd minutes before the city folk realise what's going on &amp; the onslaught begins, the body count is really low &amp; the gore is none existent, the plot mechanics are never adequately explained, who is in charge of the operation? Why ran Don &amp; Nancy off the road? Are they making snuff films? Is it being streamed across the internet? How do they make their money? There's about eight people who watch monitors of what's going on but surely they wouldn't make much from that? What are these people paying for? Do they participate or not? Do they just get to watch? What do the van load of women have to do with anything? Who is Michael Madsen in this exactly? Who is the guy he blow's up at the end? The whole film feels unfinished, the film feels like a first draft without the finer points of the plot fleshed out. The film feels a lot like Vacancy. I already said that didn't I? Well, it's worth repeating. Basically I liked Nancy as a surprisingly strong &amp; well rounded character but not much else.<br><br>Gore fans will be disappointed with Terror Trap, there really is no gore to speak of &amp; the potential was there for some torture scenes but no-one is ever shown being killed apart from a few of the bad guy's at the end &amp; even then it's just a few bullet wounds rather than memorable gory death's. There's no sex or nudity either. The film looks alright, there's some annoying black and white ultra quick edited supposedly stylised sequences that just irritate as you can't really tell what's going on. As a whole Terror Trap is competent but little else &amp; the lack of gore in a supposed torture pron film such as this is unforgivable, isn't it? There's no tension or scares, the seemingly random attacks on Don &amp; Nancy are pathetic with a few guy's in animal mask's chasing them but making no real attempt to kill them for reason never really explained.<br><br>With a supposed budget of about $2,000,000 one has to ask where the money went, it certainly wasn't on special effects &amp; considering the types of films they lower themselves to make these days it couldn't have been on Michael Madsen or Jeff Fahey's fee. Fahey is quite good here actually, we never really find that much about him out &amp; Michael Madsen's character seems almost irrelevant to be honest (I don't even remember him getting a name) although it's always nice to see a couple of pro's even if it's in junk like Terror Trap.<br><br>Terror Trap (which sounds a lot like Tourist Trap (1979)) is a total rip-off of Vacancy, the two films could have been made from the same script with minimal changes. This is far too tame &amp; forgettable to make any sort of impact, at least it's short &amp; Heather Marie Marsden as Nancy gives it her all but when all said &amp; done give this one a miss.","user":"poolandrews","rank":[10,13]}]