[{"title":"Re-hashing of Old Material","rating":5,"date":"29 May 2011","review":"I was really optimistic going into the theatre, I didn't expect it to as great as the original, but I thought it would still be good movie. But most of the material was stuff taken from the original only tweaked, and I hate to say it but I was actually bored for a good part of the movie. Some of the jokes/scenes dragged to long, to the point where I didn't find them funny anymore. There were some good moments, but the truly outrageous/original scenes that made the original so great were too few and far between. Some of the scenes were more outrageous in the sense that there was some full frontal nudity, but I'm not someone who finds that super entertaining. Overall it felt to me like a re-hash of stuff that had already been done with some naked people thrown in, and it just wasn't enjoyable like the first movie.","user":"lolabeningfield","rank":[189,250]},{"title":"It' Happened Again ... And Again","rating":6,"date":"29 May 2011","review":"Greetings again from the darkness. Two years ago, director Todd Phillips presented a highly creative, hilarious, raunchy, unique film comedy called The Hangover. And now, he does it again. He presents that SAME film again. I am unsure whether this is a sequel or remake. The only substantial change is the setting ... Bangkok instead of Vegas.<br><br>Now I fully understand WHY most sequels follow the formula created by the successful original film. Filmmakers want to keep their audience satisfied. If it worked once, it will work again. Especially when the first film grosses a half-billion dollars! So the chances are very good that if you liked the first one, you will also enjoy this one. But for me, I get excited for creative filmmakers ... not re-treads.<br><br>The key characters are all back and played by the same guys: Bradley Cooper (Phil), Ed Helms (Stu), Zach Galifianakis (Alan), Justin Bartha (Doug), and Ken Leong (Mr. Chow). All of these guys have worked constantly since the first film, but it makes perfect sense to return to the scene that put them on the Hollywood map.<br><br>This time around, Stu (Ed Helms) draws the long straw and has the storyline based on his pending marriage to Jamie Chung (Sucker Punch). Stu's \"wolfpack\" buddies agree to a one-beer bonfire beach bachelor party, but of course, something goes very wrong. The next morning finds our boys staggering to regain consciousness in a sleazy Bangkok hotel with no recollection of the previous night's events. The only clues are a monkey, a severed finger, a facial tat and international criminal Mr. Chow.<br><br>No need for me to go into any details or spoil any moments. You know the drill if you have seen the first. What follows is nearly two hours of debauchery and moments of varying levels of discomfort, gross-out and comedic skits.<br><br>Supporting work is provided by Paul Giamatti, Jeffrey Tambor, and Mason Lee (Ang Lee's son). There is also a cameo by Nick Cassavetes as a tattoo artist. This role was originally meant for Mel Gibson, and later Liam Neeson. Cast and crew protests kept Gibson out and Neeson's scenes were cut when re-shoots were necessary.<br><br>I feel tricked by Mr. Phillips. The first Hangover had me excited that a new comedic genius had entered Hollywood and would quickly blow away the Judd Apatow recycle jobs and copycats. Instead, we get Todd Phillips copying Todd Phillips.<br><br>This is certainly an above-average comedy and there are plenty of laughs from the characters we kind of feel like we know - though, wish we didn't. Just know going in that are witnessing a clear attempt at cashing in, not a desire to wow.","user":"ferguson-6","rank":[108,147]},{"title":"Copy and Paste","rating":4,"date":"27 May 2011","review":"2009 wasn't exactly the best year for movies, but out of that year we did get a comedy that will last for years to come, The Hangover. When I heard that there was going to be a sequel, I was telling my friends that I had a feeling that this was being made for the money. After all, The Hangover made over 200 million dollars world wide, they are going to milk it for everything that it's worth. Plus what made the first Hangover so great was that as crazy as their night was and outrageous, in some strange way it was believable where we've been so drunk we couldn't remember the night before and somehow did the most insane things. How is this supposed to happen again and be believable? But I loved the first Hangover so much that I went into this just hoping it was going to be a good time and sadly, it was exactly as I feared, this was made for money because it was nothing but copy and paste.<br><br>Phil, Alan and Doug travel to Thailand for Stu's wedding, but after their escapade in Las Vegas, Stu has opted for a safe, subdued pre-wedding brunch. They go to Thailand with Allen as well, when Stud did not want to invite him due to the previous events. They all look to have one drink on the beach, however, things do not go as planned after they lose the 16-year-old brother of Stu's fiancée and somehow wake up in Bangkok. Now they must go through the whole mystery again of trying to find their missing friend, but everyone they meet tells them that \"Bangkok has him now\".<br><br>See, the thing is, I did laugh a couple times, I will admit that. But the beginning and ending verbatim is the exact same thing first Hangover. A lot of the jokes are the exact same thing as the first film, the monkey was the replacement for the tiger, the silent monk was a replacement for the baby, the brother was a replacement for Doug, Paul Giamatti was a replacement for Leslie Chow, Stu's girlfriend's attitude problem from the first film is now his future father in law's attitude problem, you get the idea. Leslie Chow becomes more of a main character in this movie which I felt was another problem, as I mentioned in my review of the first film, even though he was funny he was the only thing about The Hangover that I felt was a little too over the top. He did make me laugh still, but again, it's more of the same. Also I don't know why but it seems since Stu had such an awful girlfriend in the first Hangover, they felt they had to go to the extreme opposite and give him a girl that not only looks 20 years younger than him but also is the perfect girlfriend who doesn't question anything and thinks Stu is the best man in the world.<br><br>I really wanted this to be an excellent film, I was so looking forward to having a good laugh, but when it's the exact same thing as the first film, how could you enjoy it? There are no surprises and the magic is gone. They made Allen into a mean character that is totally unbelievable, Stu is over the top in being a sissy and Phil is now there just to be the pretty boy and I really wish they had used Doug more in this one since we didn't get to see him in the first Hangover much, he seems like a great character. Seriously, skip it, this is not worth your time or money, the first Hangover is a classic. If they make a third one, make the girls have the hangover or bring a new group in because the story is just done. This was lazy and pathetic and I want my money back.<br><br>4/10","user":"Smells_Like_Cheese","rank":[58,76]}]