[{"title":"Heart tugging","rating":8,"date":"18 April 2012","review":"Okay, The Big Miracle is not an epic or a grand movie. What it is, is a totally enjoyable feature with a good and simple story with no unusual surprises that people can relate to. It is good to see the Hollywood factory machine put out a movie like this. Much credit has to be given to Drew Barrymore (sort of a mogul herself these days).<br><br>Ken Kwapis does a really good job in telling this story without relying on massive special effects. He also works very well with his actors. He was given a good script from Jack Amiel and Michael Begler, both of whom also resisted going for any kind of cheap humor.<br><br>Drew Barrymore and John Krasinski have a nice chemistry together as they deliver fine performances.<br><br>This movie was, I am told, inspired by a true story about a small town reporter and a Greenpeace volunteer who are joined by rival superpowers to save a family of gray whales that are trapped by ice in the Arctic Circle. <br><br>The story, the visuals and the very fact that whales are a main character in this movie, all tug at the heart strings.","user":"StInSanDiego","rank":[23,26]},{"title":"Wholesome Family Movie","rating":9,"date":"18 August 2012","review":"Bravo for creating a refreshingly clean family movie! It's encouraging and rare these days to have an opportunity to view a film the whole family can enjoy. Big Miracle is a wholesome, educational and entertaining movie that I happily recommend to anyone struggling like we often to to find a movie suitable for the under 15 crowd, that adults will also enjoy.<br><br>Big Miracle is loosely based on a true story and utilizes TV news clips from the Reagan era that we felt made the film very realistic. Ancient traditions, multi-generational challenges, morality, ethics, friendship, love and social responsibility are weaved into a story set in beautiful Alaska that made us laugh, cry and cheer along with the characters - it was a fun adventure into a world we didn't know much about.","user":"contact-951-691937","rank":[19,22]},{"title":"Well Executed Story For Both Adults and Kids","rating":9,"date":"4 February 2012","review":"Yes, there were simplistic clichés, but for a PG-rated movie and the confines therein, Big Miracle is about as good as it can get. The Inupiat people, the reporters, the extraction industry - all sides were treated with a degree of nuance. The take-away message was really important too - that you can accomplish things with people you don't agree with or even like. And we really enjoyed the efforts made to set the film properly in its late 80s period.<br><br>I disagree with the other reviews that found the special effects lacking. I don't think they detracted from the story, which in the end was quite compelling.","user":"slitherk","rank":[45,59]}]