[{"title":"What the F?!?","rating":5,"date":"9 July 2011","review":"This is a disturbingly twisted, absurd yet original movie ... and it is the first of three! Made on a miniscule budget, The Human Centipede gives its audience some truly horrid moments. Two young (and annoying) American girls are in Europe and headed to a club when their rental car blows a tire in the middle of nowhere after dark (in these types of horror films -- surprise, surprise!). Needing assistance, they seek out the nearest shelter ... which just happens to be inhabited by Dr. Crazy-Psycho-Sick-Brained-Bastard. Offering the girls water while he \"calls\" for help, he has secretly drugged them to get them where he wants them (them along with another unfortunate third).<br><br>From the VERY literal and non-misleading title of the movie ... one can pretty much assume what he wants them to become. This is one of the sickest movies I have probably ever come across, and yet ... it is watchable -- highly watchable (as one continually asks themselves WHAT is coming next?!).<br><br>German actor Dieter Laser plays the mad doctor (who was world-renowned for separating Siamese twins) very well as he is most-convincing as a warped genius (who has LOST it). He may play for some slight camp ... but in this movie its allowed to work. There are many, many, many plot holes (or craters) here and there throughout the movie, but they can be overlooked because something with a title-like-this is given some liberties.<br><br>While this film was titled specifically for the curious-minded, it is not for the feint of heart or queasy. Disturbingly twisted and absurd, The Human Centipede is not a film that one will quickly forget.","user":"twilliams76","rank":[22,22]},{"title":"Award to Dieter Laser & Mr. Fix for \"Scariest Mad Doctor\"","rating":6,"date":"6 November 2011","review":"I finally got around to seeing this film and frankly I was not shocked; probably because I had read about its grossness far in advance. What I wasn't prepared for was the fact that a large part of the grossness was not actually shown, but rather spoken of and indirectly seen through bandage attachments. At some points it was very Hithcockian in the fear was instilled indirectly. Graphs showed how the surgery would be accomplished; only bits of the surgery were actually shown; the graphic defecation scene was verbalized and intimated. Very Hitchcock were the master of suspense a tad more mad. However, the scariest part of the film was Dieter Laser's performance. I can't recall ever seeing a mad scientist on film that projected madness and insanity as deeply as Mr. Laser..Every time he was on screen you could feel your skin crawl with fear. Brilliant performance, mainly because it went to the edge of \"over the top\" but never actually got over the top. I've also read reviews which damned the actresses for not being \"good actresses\". A bunch of hooey for sure from those observers. I'd like to see them top the girls \"tongue in cheek\" performances. I never for a moment didn't see fear in their eyes, which btw is also another means of showing more fear than the actually surgery which was done while the cast was under anesthetics. In the beginning of the film you could feel the chemistry of the girls as they giggled about in their hotel room. A definite chemistry; one which would be needed as they got closer to each other at the Dr.'s house. Hats off to this film for sever reasons; suspense, fear and scare without an overload of blood and gore as in other films. Think of the Akitamura's job of convincing us that he was frightened, angry and scared in his native Japanese tongue, while again having tongue in cheek fears to contend with of his own character. Bottom line: An original, at the edge, horror film. Where does on go after that..kudos to the cast for braving out a fully developed and overly imaginative film..and to Mr. Six for following through. Can you imagine the sales pitch he had to prepare? Besides, our news media shows more graphic crap than this on their 24/7 newscasts (eg. There was more gore with Kadhafi killing, etc.)","user":"josephlord-1","rank":[10,10]},{"title":"Who's eating more poo, the audience or the actors?","rating":1,"date":"27 May 2010","review":"So, they're trying to squeeze a few cents more out of the hype around the \"Saw\"-type movies? Sadly the ones making this movie has no idea on how to keep the audience's interest up, no idea on how to create believable characters or make a decent movie that holds up for more than 15 minutes.<br><br>It begins rather believable with the two young girls going to a party (if you see them as mentally defective and do not scrutinize their personalities too much) and getting car trouble. That's about what works in this movie...<br><br>Then there's a series of highly improbable events with completely unbelievable actors and it devolves into a simple type, really bad, SCAT-movie (search the porn shelf for those and you'll see the similarities).<br><br>* Ooohh, No cell phone reception in Germany!!! Do Americans know that Germany is an industrialized country and their cell phone system is much more advanced and has more coverage than anything in the states?<br><br>* OOOoooohhh, We cannot fix a flat tire because we have too many cromosomes going rampant. We don't even bother to check if there's something in the trunk of this rental car that can be used in some way!<br><br>* OOoooohhh, We won't even try to drive the car with the tire flat because then the entire universe will explode. Sure, it'd thrash the rim and everything, but it should hold up for at least a couple of miles when going slow.<br><br>* Ooooohhhhh, We need to walk for help. Let's NOT follow the road or anything, let's go into the dark scary woods in our high heels and no sense of direction. And let's not check if the cell phone gets some reception back either!<br><br>The movie keeps going in this fashion and if you do not shut off before the real action begins you are greeted with a couple of unbelievable characters going around on all fours with their mouths connected to each others rectums, eating feces.<br><br>Thank GOD that I didn't pay to watch this movie. Maybe I should sue the movie company for wasting my time like this.<br><br>Believe me, it doesn't get any better as the movie continues either.<br><br>100% medically accurate too... Well, then it must be good... People vomiting in theatres... Well, that's just because the movie is such UTTER CRAP that you cannot help yourself! :D<br><br>If you see it, make sure you have the option of fast forwarding through 90% of the movie and just getting to the perverted fecal-eating scenes that the movie's creators probably got a good, decent sized erection by creating!","user":"fruktflugan","rank":[180,252]}]