[{"title":"Better then most recent martial arts movies, but still nothing amazing. The type of movie you forget as you watch. I say B-","rating":6,"date":"20 May 2012","review":"\"You don't understand, there's nothing you can do to save your father.\" When Sizwie (Storm) finds out that his father is in prison he wants to get him out. He finds a way by selling black market diamonds in America. What starts as a simple transaction turns dangerous when he is double crossed and becomes a party to contraband. He must now fight to save not only his father but also himself. While I was expecting much worse from this it was still a very forgettable movie. The fighting is exciting and very well done and the plot is a good idea. The problem is that when the fighting isn't happening it tends to drag a little and becomes forgettable. I again think this isn't a bad movie at all and is entertaining to a point but it seemed to be flat the whole way through and was really nothing original. There are a ton of martial arts movies out there and this is a little better then most but still very OK. Overall, another type of movie that is entertaining but you forget as you are watching it. I give it a B-.","user":"cosmo_tiger","rank":[25,36]},{"title":"\"If you don't temper your rage, you *will* make a mistake\"","rating":6,"date":"12 May 2015","review":"T.J. Storm is sort of an oddity within martial arts cinema: despite rarely being cast as more than a minor supporting player in most movies (his biggest role to date was as a recurring sidekick on CONAN THE ADVENTURER), he's remained relevant and a minor fan favorite among the B-movie community for more than two decades. The fact that his very first solo vehicle here didn't come about until 21 years after his debut in the movie business is a shame, if only for the fact that he may no longer be in his physical prime, but the movie does nonetheless show that he can still be utilized in larger roles. BLACK COBRA is far from a perfect vehicle, but it is one of the better (very-)low budget vehicles I've seen in a while.<br><br>The story: On a quest to liberate his incarcerated father, a South African martial artist (Storm) travels to Los Angeles to secure the necessary legal funds, but runs into unexpected trouble in the form of the Japanese mafia...<br><br>The film's premise potentially sets the movie up as a derivative of RUMBLE IN THE BRONX, but this isn't really the case: the scope just isn't there, and even though Storm's character is a stranger to America, there are no awkward culture shock scenes to be had. Nevertheless, the movie isn't humorless, and this helps things immensely: after seeing some of the intro scenes' cheap camera-work, I expected the worst in the form of a cruddy backyard action flick that takes itself too seriously, but the script by Scott Donovan (adapted from Sebati Mefate's novel \"When the Cobra Strikes\") actually includes a couple laugh-out-loud moments - a rarity among these kinds of flicks. Also serving as co-director (and co-star), Donovan makes the absolute most of what must have been a limited budget, as he believably stages scenes taking place on two different continents and ensures relatively clean-looking production values.<br><br>At its worst, the movie's action content is serviceable, but on the downside, its quality never exceeds \"kinda good.\" T.J. Storm is a legitimate practitioner of a plethora of fighting arts, and by default it's cool to watch an African character utilizing snake-style kung fu, but I think it's fair to say that, compared to a good deal of modern practitioners, he's a bit on the slow side, physically. Of course, this may just be the flawed pace of the choreography, but some of his opponents just plainly look quicker than him: Hong Kong veteran Jeff Wolfe and sometimes-heroine Stefanie Cheeva immediately come to mind. Conversely, stalwart villain Cary Tagawa - playing the Yakuza lord - is also kinda slow but looks relatively good when engaging T.J. with a katana; I really wasn't expecting anymore fight scenes out of him, so it's cool that we got this one.<br><br>The movie begins with investigating the inequality and racial hatred that still goes on in South Africa, but this ends up giving way to contrasting pictures of friendship and father-son relationships. Pleasingly, the film features sections of genuine Japanese and African dialect being spoken - always a nice thing, in these cheap movies. If BLACK COBRA here were judged simply on a ratio of what was attempted versus what ended up working, it'd get a higher rating, but there's really only so high a rating that I can give a film like this. Were the picture made with an actual budget and with maybe a slightly tighter storyline, not to mention swifter fights, this one would at least manage a 7. Nevertheless, if you're interested in T.J. Storm, this is definitely a place to start.","user":"The_Phantom_Projectionist","rank":[2,4]},{"title":"NOBODY MESSES WITH THE FAMILY JEWELS","rating":6,"date":"3 December 2018","review":"T.J. Storm stars in the title role. His chosen nickname is \"Cobra\" but somebody else has that so he becomes \"Black Cobra.\" The nickname comes from his chosen style of martial arts known a \"Cobra style Kung-fu.\" Cobra has diamonds stolen from a mine, or a mine that belongs to his family depending on your point of view. He smuggles them into the US with the intention of selling them on the black market as they have no providence. He wants to use the money for the noble cause of saving his father in prison by buying him a pardon...doesn't this guy do anything legal?<br><br>Black Cobra is engaged and doesn't fool around even when a pretty woman (Ogy Durham) offers him some cocaine. (Made the whole story unbelievable). Having once attended San Diego State, Black Cobra uses his contacts to arrange to sell the diamonds after a cliche Sensei-student session out in an open field.<br><br>If you read the story line, Cobra is double crossed and now goes after the bad guys to recover the diamonds/money. Except for the language, this could be a made for TV movie, it has that kind of quality. The script and dialogue was second rate, and the acting left something to be desired. The movie digresses to the expectation of South African martial arts vs. Japanese martial arts.<br><br>F-bomb, N-word, no sex or nudity. Brief cat fight.","user":"nogodnomasters","rank":[0,0]}]