[{"title":"If I could rate it higher I would...","rating":10,"date":"12 March 2011","review":"As I watched this movie I felt like I was viewing my own life story...<br><br>In 1991 I lost my little brother to a tragic accident as well. The emotions and inability to continue \"living\" life felt by Charlie are the same I had struggled with for many years. I found this movie to be extremely emotional, heart felt and true to the subject at hand. The acting of ALL the actors was outstanding, as well as the camera work, editing, directing, and most of all the writing.<br><br>If you like movies with true heart and emotion I highly recommend this movie as you can tell by my rating of 10. Honestly, I would rate it even higher than that if I could.<br><br>Although my love of this movie is very much inspired by my personal attachment to the subject, I think anyone would find this movie to be very touching...","user":"sammie-hartman","rank":[35,40]},{"title":"'The Death and Life of Charlie St. Cloud'","rating":6,"date":"16 November 2010","review":"Ben Sherwood's Novel THE DEATH AND LIFE OF CHARLIE ST. CLOUD pretty much describes this Hallmarky love and spiritualism showcase for teen idol Zac Efron. Craig Pearce and Lewis Colick adapted the book for the screen and director Burr Sherwood (known for his other films that are of this genre) stirs the whipped cream. It is a pretty story with pretty people filmed in a pretty location (British Columbia) and the results are pretty predictable, yet when compared to the types of stories on film that flood the theaters at least this film has gentle heart and a lack of terror and horror and for that we should be pleased. <br><br>Charlie St. Cloud (Zac Efron, who holds in own in this rather implausible role) is a highly regarded young sailor who is wins a sailing scholarship to Stanford upon graduation from high school. He is devoted to his younger brother Sam (Charlie Tahan) and his single mother nurse Claire (Kim Basinger - don't blink or you'll miss her very brief appearance in the film). One night while Claire is on extra shift at the hospital Charlie and Sam are in an auto accident: Sam dies, but Charlie is resuscitated by paramedic Florio Ferrente (Ray Liotta, in another very brief cameo). Charlie is devastated over Sam's death and gives up his chances for a life by taking a custodian job in the town cemetery so he can be near a certain spot where he 'sees' and communicates with Sam every sunset - a life long promise to never leave his little brother. Five years pass and Charlie's friend Alistair (Augustus Prew) - his only other friend Sully (Dave Franco, brother of actor James Franco) has gone into the military - tries to encourage Charlie to date, but Charlie's eyes fall on Tess (Amanda Crew), a fellow sailor from the past, and love begins. Tess decides to take a long solo voyage in her boat and disappears. Charlie meets the now cancer-ridden and dying Florio who gives him his St Jude medal and encourages Charlie to embrace life. Charlie strikes out on a mission to find the missing Tess and the rest is pretty obvious. <br><br>Though the story is heavy on the saccharine edge and strains credibility, the team of actors is very fine - especially Zac Efron, whose presence is on the screen in practically every frame - so the film ends up being endearing. The cinematography by Enrique Chediak is gorgeous and the musical score by Rolfe Kent leans heavily on sad love songs. It is not a profound film though it does dip gently into the ideas of 'the beyond', but there is something about the honesty of it all that makes it s a satisfying evening of entertainment. <br><br>Grady Harp","user":"gradyharp","rank":[33,38]},{"title":"The St. Cloud Brothers In Life And Death","rating":9,"date":"9 August 2010","review":"I was much moved by Charlie St. Cloud and by Zac Efron in the title role. It looks like the young man is going out way beyond being a Walt Disney bubblegum poster boy for pubescent young ladies. <br><br>When we first meet Efron in the title role he looks to be a young man with a bright future. A scholarship to Stanford is his as he graduates high school from his New England coastal town where he enjoys sailing and the companionship of his younger brother Charles Tatan. The two are rabid Red Sox fans as all New England kids are brought up to be. Efron's boat is named the Splendid Splinter which everyone in New England knows is the nickname of Ted Williams. Being much older than Zac or his character, I actually remember seeing Ted play.<br><br>A cruel trick of fate puts the two of them in the path of an oncoming drunk driver. Both die, but a determined paramedic played by Ray Liotta brings Efron back.<br><br>As per an agreement they made minutes before the crash, Efron and Tatan still meet in the woods every day to play catch and work on Tatan's baseball skills. It's all Efron lives for. By some trick of fate he can communicate and see Tatan, in fact he sees all kinds of dead folks including a young man he graduated with from high school who was killed in Iraq. Efron's forgotten Stanford and he now works at the local graveyard, the better to be near the ones he identifies with. <br><br>I won't go into the rest except that Efron does learn to let the dead bury the dead. Meeting up with Amanda Crew, another sailing enthusiast does help. And Liotta now dying of cancer tells Zac that he was saved for some special purpose.<br><br>Two great lessons of life are to be learned in Charlie St. Cloud. First that we all have some kind of destiny, the trick is to find it and recognize it. The second is that some people die young and maybe are meant to so that the rest of us recognize how precious life is and not to waste it. Having lost any number of people including a sister at a young age, it's something that is always uppermost in my mind.<br><br>Charlie St. Cloud is beautifully filmed with some breathtaking sailing sequences. The performers are flawless, especially Zac Efron. One thing I will agree with other reviewers about is that I wish that the role of the mother of the St. Cloud brothers played by Kim Basinger was more fully developed. After the death of her younger son, she moves out of town and you never really learn why.<br><br>Despite that minor criticism, Charlie St. Cloud is a moving film that should be seen by all generations for the life lessons imparted.","user":"bkoganbing","rank":[75,95]}]