[{"title":"Worth a Look if you like Musicals","rating":8,"date":"29 November 2013","review":"Going in I knew this was a movie with music and that's what it is, versus a \"musical\" like Les Miserables, where there's singing throughout opera-style. <br><br>The good<br><br>All the actors stand out and do their characterizations well. Especially Jennifer Hundson as Naima, the single mom raising a boy-child on her own without help and estranged from her parents. Especially Tyrese who really shows his gentle side as Tyson. His body and face marked with scars, he looks like a thug but has a worldly view as he tries to steer young Langston to the right side of life. Especially Forrest Whitaker who characterizes the Reverend Cobb. Stern, unyielding but with a soft side. Especially the music that soars and transforms the screen into a gospel show near the end. Director Kasi Lemmons (\"Eve's Bayou\") integrates stage show with movie set ala \"Rent\". The story of a young boy struggling to find answers and being pulled toward wrongful ways is simplified and strikes just the right tone with spirituality and religiousness. <br><br>The bad <br><br>Near the end the drama is laid on thick.<br><br>See it! This is the only \"live\" action musical of the year and while it is based on a little known play written by Langston Hughes, it's a triumphant interpretation on film.","user":"mizwright","rank":[21,29]},{"title":"Good cast and acting but the movie was just too cheesy for me to fully get into. Feels like a made for TV movie.","rating":5,"date":"12 April 2014","review":"\"Proof of God's grace is all around you, you just have to open your eyes.\" After struggling single mom Naima (Hudson) is faced with foreclosure and homelessness right before Christmas she decides to send her son Langston to live with his grandparents. Her father Reverend Cobbs (Whitaker) and his wife gladly take him in even though none of them know each other. Langston wants nothing more then to get back home to his mother and will do anything to make that happen. When a stranger offers to help his life is changed. Even though the cast for this movie is good I was not thrilled about watching this. After watching it my preconceptions were pretty much right on. It wasn't terrible but it was just so over-the-top cheesy that it made it a little hard to get into and enjoy. If this was a made-for-TV movie it would have been OK but the fact that this was a theater release really makes you wonder why this got that kind of distribution when there are so many other more deserving movies that don't get the wide release this one did. Overall, cheesy and nothing amazing. It is a Christmas movie though so that has to be taken into account. I give this a C+.","user":"cosmo_tiger","rank":[4,4]},{"title":"Very Happy With This Production","rating":8,"date":"4 April 2014","review":"I really would have given it a higher rating but I wasn't 100% crazy about all of the singing. I loved the story line and the cast was phenomenal. Overall everyone did a really good job with the acting and singing. So many of my favorites in one film is really a treat. I will be telling everyone I know about this movie.It should be watched by all who value family and faith. This situation plagues many minority homes. Holding on to the anger, hurt of misunderstandings for years when it can be fixed with communication, respect, honesty and forgiveness.I wasn't sure about whether it would be good in the beginning but very pleased I stuck it out and even got my hubby-to-be to watch it with me and he liked it also.","user":"hisnamillion","rank":[5,6]}]