[{"title":"Unclear moral to the Story","rating":5,"date":"7 January 2011","review":"Well after watching this film, i was left a bit confused really. Half of me was saying \"there is something meaningful in this story\" and the other half of me was saying \"this story sucks, it had no relevant meaning to......anything\".<br><br>The film starts with Robert De Niro's character threatening his wife to kill their daughter if she leaves him. Then it immediately fast forwards 20-30 years with his wife and him together meaning that his threat worked and she stayed with him.<br><br>Enter Stone (aka Edward Norton). Stone wants to get out of prison. He was convicted of aiding murder by burning his grandparents house (and his dead grandparents).<br><br>De Niro works in the jail house as an \"approval of release\" guy. Basically if he thinks someone has been rehabilitated, then he writes his report to his superiors and they decide whether or not to release someone.<br><br>Stone and De Niro get talking and Stone desperately wants to get out of prison, so he sends his wife to De Niro. She basically seduces De Niro and he ultimately writes the approval.<br><br>In the mean time, Stone keeps talking with De Niro, and he finds a religion that basically makes his desperation go away. Somewhere along the lines, the tables turn, Stone is freed, and De Niro is now having a bad time with his life.<br><br>The result is that he loses nearly everything, his wife hates him and he has no job and no friends.<br><br>Now this is the point of the story i don't think made any impact at all. You have a hard working guy who works all his life that made a mistake with his wife (and his daughter). Then you have a convicted criminal who burnt his grandparents and spent time in jail.<br><br>By the end of the film, it seems like you are made to want to like Stone and want to hate De Niro.<br><br>I get it. I really do. I get what they were trying to do with the film - Two people did two separately morally wrong acts. One of them was sent to jail, the other spent his life working.<br><br>I just don't see the point of trying to make the convicted criminal out to be the good guy, and the hard worker out to be the bad guy. Pointless. It just didn't work.<br><br>De Niro and Norton gave very good performances, as did the rest of the actors and actresses, but the plot of the film just sucked. Big time. It barely made it clear what the point of the film was, and the point it was trying to make just wasn't.......right.","user":"danielsummers519","rank":[29,34]},{"title":"Someone dropped the ball....","rating":4,"date":"12 January 2011","review":"De Niro , Norton and Jovovich . Quite the cast I'd say , but thats all there is to it .<br><br>The start is really interesting , both De Niro and Norton giving top notch performances . But then everything is lost as the movie looses focus and struggles to define itself . What starts of as a thriller goes nowhere trying to answer existential questions . No character is developed enough , the background stories clumsy and incomplete and thats in my opinion what killed this movie . No cohesion and a weak ending is the coup de grace .<br><br>Edward Norton is one of my favorite actors , so is De Niro . Im so disappointed that this didn't work out .","user":"stefgrig","rank":[125,165]},{"title":"A Vegetarian Tuning Fork","rating":6,"date":"24 October 2010","review":"Greetings again from the darkness. Psychological Thrillers have long been my favorite genre of film. The best ones cause us to examine our own thoughts while analyzing the actions of others we probably don't quite understand. Unfortunately, most scripts fall short in complexity and stimulation, and leave us with a half-empty character study. Director John Curran (The Painted Veil) and writer Angus MacLachlan (the superb Junebug) offer up a just-miss.<br><br>Robert DeNiro plays a parole officer on the brink of retirement. He is the guy that lives and works by the book to suppress his inner demons of which we get a glimpse in the film's opening. Despite the horror, he and his wife stay married for decades ... the relationship is built on a false worship of scripture and plenty of nerve-deadening booze. DeNiro decides to finish out his current files, one of which belongs to Edward Norton. He is an 8 year convict, serving a sentence for a crime that ended with the death of his grandparents.<br><br>The real fun begins when Norton enlists his schoolteacher wife, played by Milla Jovovich, to invade DeNiro's cold facade. So really what we have is: DeNiro trying not to feel anything, Norton trying to pull one over on DeNiro either by himself or with his wife, and Jovovich trying desperately to obey her husband while playing evil mind and body games with DeNiro. This is the point I like to call \"the table is set\".<br><br>Unfortunately, none of these story lines really go deep. The best seems to be Jovovich and DeNiro, but even that falls short of real grit. So much potential here and the actors all seem up for anything. It's just the script lets them off easy.<br><br>Frances Conroy is excellent as DeNiro's wife whose had her soul locked away. We never really get the full scoop on the Norton/Jovovich connection, but by the end, that doesn't seem to matter. Is the film watchable? Yes. Could it have offered more deliciously evil interaction between these characters? Absolutely.","user":"ferguson-6","rank":[81,106]}]