[{"title":"A most bizarre swamp gumbo","rating":3,"date":"18 October 2013","review":"This is a bizarre story of a collection of very strange people in swamp land. A reporter (McConaughey) and his brother (Efron) help exonerate a man (Cusack) for killing a sheriff.<br><br>Nicole Kidman tests her acting ability and is quite convincing as a self destructive white trash who falls in love with the prisoner (John Cusack). She's got the dialog and body language down and looks very different from her usual ladylike sophisticated self.<br><br>Poor Matthew McConaughey, uglied up, raped beaten maimed and finally throat cut.<br><br>Zaf Efron looks quite convincingly lovesick as the totally whipped guy in love with Kidman's character. What an idiot his character is causing the death of his brother.<br><br>Still don't understand the point of freeing Cusack so he could murder.<br><br>A major directing and screenplay flaw is that some plot elements are revealed in heavily accented dialog which is hard to follow.<br><br>To cap this often senseless story is a lush 60s European style film score that is quite inappropriately beautiful.<br><br>Watch it if you are a fan of the stars but be prepared it's way out there.","user":"phd_travel","rank":[19,21]},{"title":"A quick dip in the Louisiana swamps","rating":9,"date":"26 January 2013","review":"First off, I'd heard of Zac Efron, somewhere, I thought he was some teeny bopper's fantasy. But this kid is no lightweight. He's quite good here in an ultra adult film, as is everyone else, all playing against type: Kidman as a slut, McConaughey as a sexually troubled man, John Cusack as a backwoods maniac, and Macy Gray as a lovable servant.<br><br>My wife hated the movie but couldn't take her eyes off of it. And by its end, we were both thinking that was quite a ride. What more do we want from our movies? Everyone here, maybe a little less so with Efron who's the novice, abandons themselves to their parts. I didn't even catch Gray in a misstep though she's a novice too. They all channel their people quite successfully in a well-directed though not for the kids, movie that manages to shine a light on a south that actually was and for all I know still is in places.","user":"socrates99","rank":[98,124]},{"title":"Powerful film about love, honor, redemption, and connection","rating":10,"date":"6 October 2012","review":"It's hard for me to understand the scorn that has been heaped upon this film. You'd think Lee Daniels had created a film praising Hitler, the Antichrist, and communism. Also, it's hard to understand why some critics have focused on certain aspects of the film. Zac Efron in his \"tidy whities\" or Nicole Kidman urinating on Mr. Efron. The level of titillation that is being shown would be credible in a 7-year old, but not for adult critics. To focus on these rather minor points shows a deep misunderstanding of what this film is about. <br><br>So, what is this film about? While I think it's hard to reduce a work of art to the level of a short essay, I am so fed up with what has been written about this film that I shall attempt to do so. <br><br>For starters, I believe this film reflects the world as it is, and not as we want it to be. I think this film is saying that our deepest need is for love, connection, and moral truth but these needs become warped when filtered through the lies,despair, and degradation that American society has offered up as the truth. Mainstream films never go here, and while some indie films touch on this theme, they don't usually go for as deep a dive. The only other director that I can think of even approaching this level of an unblinking stare into the abyss is Todd Soldendz. <br><br>The characters in the film consist of Ward Jansen (Matthew McConaughey), a journalist who has come back to his home town to investigate whether or not Hilary Van Wetter (John Cusack), a man on death row, received a fair trial. Ward's attention has been drawn to this case by Charlotte Bless (Nicole Kidman), a woman who has maintained a jail house correspondence with Mr. Van Wetter, and who believes she is in love with him. Ward brings with him a colleague, Yardley Acheman (David Oyewolo), a black journalist from London. They are assisted by Ward's younger brother, Jack Jansen (Zac Efron), who still lives at home. The Jansen family maid, Anita Chester (Macy Gray) is Jack's confidant and a stand in for the mother that left the family several years ago. <br><br>Each character's story is that of connection or love that has been twisted or thwarted for various reasons. Jack's playful relationship with the family maid can never be a relation between equals because of his racism. Jack can see that she is his natural ally and friend, but his racism denies them both a deeper connection. As brothers, Ward and Jack share a powerful bond of affection, but no amount of affection between the brothers can halt Ward's impulse to self-destruction brought on by his inability to accept being homosexual. Charlotte Bless is looking for love and thinks she can find it by writing to men in prison. She receives a response from Van Wetter, and because of its seeming indifference to what other men want from her, she decides this man loves her. The delusion is so powerful that even when real love is offered by Jack, she doesn't understand it. The film doesn't make it clear why she is so self-destructive. We can only assume it is the logical end to the toxic sexism that forces women to see themselves as worthy only if they are desired by a man; any man. Jack's impulse toward love and connection with this woman is driven by the damage done by the abandonment Jack experienced at the hands of his mother.Yardley is a black man trying to have a decent career as a journalist at a time (1969) when racism almost guaranteed that black men remain in lowly positions and did not allow them to rise to their full potential. It is this very racism that makes him betray his colleague and his principals and forces him to assume an identity other than his own. Van Wetter is, I think, a kind of stand in for a force of nature. It is when you face up to these kind of forces that your innermost strengths and weaknesses are revealed. <br><br>Through these characters, Lee Daniels is showing the damage done to human relations, forcing people to act in ways that are not pretty to watch, and so the world he shows us is not pretty. It's hard and brutal. But so are the forces that drive these characters. To the critics who hated this film, if you want pretty, watch Lucy and Desi. Mr. Daniels world is the real world; flawed, messy, and hard to look at, but with humanity and the impulse to transcendence at its core.","user":"karenaziz229","rank":[167,219]}]