[{"title":"A spoon full of nothing.","rating":3,"date":"10 February 2011","review":"Another hoody film. <br><br>A boring couple have their home invaded by some scumbags looking to exact revenge on their son. The usual tying up and degradation of the main characters takes place. The problem is I didn't care about them. The characters were so clichéd and one dimensional that I felt nothing for them. <br><br>The lead thug is just a ridiculous ball of unthinking testosterone that he's unbelievable. Couple this with his sidekick thug with a heart and it just gets stupider. I spent the whole film just hating the main thug, which I suppose was the intent. But I was just waiting to see him die and had no interest with anything else. Then just when you think the limits of believability can't be stretched any further, the thug's girlfriend shows up with her little brother in tow to watch. I think even an idiot would doubt a school child's ability to keep his mouth shut about witnessing the events which take place, but they let him stay all the same. <br><br>I'm not really a fan of the this kind of film but I had enjoyed the directors other films so I thought I'd check it out. Now I've seen it I never want to see it again.","user":"Greenzombidog","rank":[29,41]},{"title":"Meaningless Waste of Time","rating":1,"date":"29 October 2010","review":"I was tricked into watching this film by a review, so I feel obligated to give my own so there will be no more casualties..!<br><br>This movie can not really be called a thriller: there is no real suspense and nothing is surprising;you can tell how things will evolve from the first minute that the actual \"plot\" starts.<br><br>I actually fast forward it many times and compelled to rerun it, only to find that nothing had happened in between.<br><br>All in all, this was a wooden, disturbing presentation of a lower class youth, with a completely unsuccessful attempt to portray a dysfunctional family, lacking all definitions of any meaning of film.","user":"antoniadesnektarios","rank":[27,42]},{"title":"An effective and disturbing house-invasion movie","rating":6,"date":"21 June 2010","review":"Cherry Tree Lane is an urban thriller about a couple whose home is invaded one night by a gang of youths who wish to harm their absent son. While they wait for the boy, they mete out some physical and psychological torture. Like all house-invasion movies this is a very disturbing film. It's not entirely dissimilar to notorious exploitation films such as House on the Edge of the Park (1980). Although, admittedly, the sexual violence in this thriller is committed off-screen unlike that earlier film's non-stop barrage of sexual assault. Nevertheless, Cherry Tree Lane is certainly in the same general ball-park, just toned down and with better acting performances.<br><br>All of the action is restricted to the interior of the house at the fateful address, generating considerable claustrophobia. The villains are typical London gansta youths - this is a house invasion movie for the hoody generation. It plays on middle-class fears of gangs of violent working-class youths. The young hoodlums seem to have come from a different world from their victims. They have no use for the contents that make up the unfortunate couple's home such as bottles of red wine or their DVD collection. This uneasy chemistry adds to the tension and adds a different undercurrent to proceedings. The film does stretch believability a little with the introduction of two teenage girls and a young schoolboy into the fray; they act as if this is a normal night out but it just seems inconceivable that they could be so blasé in this extreme situation. Nevertheless, the introduction of these characters does allow for the set-up in the final scene in the movie, in which things are left hanging on an unanswered question that leaves the viewer wondering if the horror of the night has in fact ended at all.<br><br>Overall this is not an easy film. It's intense and sometimes difficult to watch, and it truly offers no respite by the end. So Cherry Tree Lane is certainly not a film for everyone. But for those with a mind for something dark and troubling, it's a journey worth taking.","user":"Red-Barracuda","rank":[35,57]}]