[{"title":"Cool Little Film","rating":8,"date":"2 October 2009","review":"I caught this film at Fantastic Fest in Austin, during a sold out screening. Clearly the reason the screening was sold out is that the lead actress was in attendance, days after winning an award for Next Wave Best Actress, so everyone wanted to know what the fuss was about. I won't bother going into the details about the plot since it's covered here by others, but I gotta say this was a cool little film. It's a nice modern take on the old style 70's revenge film. It's got a great energy, an engaging story, some bad-ass, albeit low-rent kill scenes, and yes, the performance from the first-time lead actress is a knock-out. She owns the screen. From the reaction of the audience, and the fact that almost 3/4 of them stuck around for the Q&amp;A, I'd safely say that most others would agree with me. A perfect film? No. But a solid, must-see piece of entertainment? You bet.","user":"BibbyWoo83","rank":[30,40]},{"title":"Engaging and fun to watch","rating":8,"date":"12 July 2009","review":"I saw the world premiere of this movie at the 2009 Fantasia Movie Festival in Montreal. I went in with an open mind, not necessarily hoping or dreading anything. But I have to admit, my initial thoughts were that the \"rape revenge\" thing has been done to death. It seems like an easy way to have sex and violence in your movie and draw the most typical movie-watching crowd (ie. an easy way to make a fast buck).<br><br>Sweet Karma surprised me. Right off the bat, the movie has a very dark and gritty feel to it that draws you in. Shera Bedard is awesome as Karma, avenging the death of her sister. Having the \"heroine\" be a mute added a great dimension to her character. She does a great job of expressing emotions and intentions through her eyes and body language. She's really believable as a shy young woman who has nothing left to lose and forces herself to take out her anger on those who're responsible. This also adds an unexpected complexity to the movie, since Karma can't tell her story herself. There are sporadic \"flashback\"-type scenes early on which help to clarify things, and these do a great job of helping us understand what's going on.<br><br>Most of the rest of the cast is great too. The Russian accents don't sound forced or fake. The main \"bad guys\" are especially despicable, and I found myself wanting Karma to succeed in her self-appointed mission. One exception is John Tokatlidis, who was neither believable nor very interesting. In fact, when his character is focused on about halfway through, the movie's quality goes down a couple notches. He manages to bring it down all by himself.<br><br>One of the big draws for me about Sweet Karma is the fact that it's a purely Canadian movie. The story is based in Toronto, and it was entirely filmed there. Everything was financed by the crew, apparently with no outside help. Unfortunately, it seems like the story could've happened anywhere just by changing a few words in the script. There were almost no recognizable Toronto landmarks, and very few Toronto-specific scenes except maybe the airport. There's a scene near the beginning of the movie where the bad guys are joking about forming a hockey team, but it feels tacked-on and out of place. Almost like someone said \"Hey, this movie doesn't feel Canadian enough, let's add some hockey dialog!\" Despite this, it's great to see a purely Canadian production that's so engrossing and entertaining. Maybe the fact that it doesn't really \"feel\" Canadian is a good thing since the movie can appeal to a bigger audience outside the country... if they cut out that scene with the hockey dialog.<br><br>Obviously, sex and violence were portrayed. But not in an over-the-top way, only in a realistic way that fit with the theme of the movie. This definitely isn't PG-13 stuff, but it's not gratuitous either.<br><br>The rest of the audience really seemed to enjoy the movie too. There was loud applause after the credits, and the questions that people asked the crew during the Q&amp;A session showed a lot of interest.<br><br>I'm really glad I went to see Sweet Karma, it's an excellent take on the old \"revenge\" theme. For me, nothing will ever beat High Plains Drifter as the best \"revenge\" movie, but Sweet Karma comes close, and ranks right up there as one of the best movies I've seen recently. For a purely independent film, the production values were really high, even matching or exceeding some of the stuff coming out of Hollywood these days... especially the ones that pretend to be \"nitty gritty\".","user":"PureGore","rank":[24,33]},{"title":"Impressive...","rating":9,"date":"27 July 2009","review":"I too caught this film at Fantasia Fest in Montreal. I went in expecting the typical low-budget Canadian dreck like \"Deaden\", and was very surprised with just how good it was. While in some ways it's a typical revenge film, the story unfolds in a way that keeps you engaged as a viewer. The pacing of it is spot on, delivering the obligatory kick-ass scene, some nice t&amp;a, an occasional laugh, and the intriguing storyline all when needed. <br><br>The film takes place within the world of the underground sex trade in Toronto. It's not very often that we see this side of Canada on film, and I think the filmmakers did a great job in creating a setting that feels completely realistic. It doesn't try too hard or go over the top in its portrayal of this world as so many Canadian films are apt to do. The cinematography adds perfectly to this gritty, seedy environment by keeping everything minimally lit and hand- held. <br><br>What really surprised me the most though, were the performances of all the actors. There isn't a bad performance in the bunch, which is something you generally expect in a low- budget indie film. The stand-out of course is the lead actress, Shera Becherd, who carries the film virtually all by herself. She's tough, vulnerable and incredibly sexy all at the same time. So often you see performances by women in revenge films who basically reduce themselves to female terminators - robotic killing machines without a feminine trait in sight - but her performance, considering her claims of never acting before, could easily go down as one of the best in the genre's history. There's also a striptease scene of her's that's worth the price of admission alone. I know I'll be hitting the rewind button a few times when I see it again on DVD... <br><br>All in all, Sweet Karma was not only one of the stand-outs of the festival for me, but one of my favourite films of the year so far. Highly recommended!","user":"j_t_man","rank":[22,33]}]