[{"title":"A good example of dance movies, which are not real movies.","rating":6,"date":"8 June 2010","review":"Let's be honest, here. Nobody expects any real movie quality from a dance movie, except for beautiful and entertaining dance moves and a director who's skilled enough to shoot them adequately. Anybody complaining about the cheesiness of dialog or the non-existent plot is missing the point. Dance movies are cheesy by definition (\"Dirty Dancing\", anyone?), so the viewers must adopt a kind of \"suspension of belief\" and embrace what is being offered. Does anybody enjoy ballet or operas for their plot? Compared to an opera libretto, an episode of \"Gossip Girl\" is \"Citizen Kane\". \"Streetdance\" has the merit of presenting nice choreographies (especially the very interesting finale) accompanied by an enjoyable soundtrack, with also a bit of professional acting courtesy of Charlotte Rampling. The 3D effects offer a pleasant support to the dancers' efforts. It's an honest movie. It doesn't promise anything more than what it is.","user":"marioonline","rank":[22,26]},{"title":"Ballet + Streetdance = Breaking Point","rating":3,"date":"3 November 2010","review":"'StreetDance 3D' is pretty much another dance movie of the current crop of recently released dance films such as 'Step Up'. Now, if one likes dance and energy, such as myself, they can enjoy this one. The story is easily predictable and it doesn't have anything new to offer but I felt that it was well told and the viewer does care for the characters. There's plenty of energy, drama and lightness to entertain. The acting of Nichola Burley and co is very good. Charlotte Rampling also does a fine job as the encouraging kind-hearted teacher. However, the highlights of 'StreetDance 3D' are the dance sequences. Each of the actors/ dancers give their all to the performances exuding energy, passion and love for music and dance. The refreshing and innovative combination of ballet and streetdance is wonderful to watch. I didn't see the 3D version but I doubt that it would effect my liking.","user":"Chrysanthepop","rank":[11,12]},{"title":"A Nutshell Review: StreetDance 3D","rating":7,"date":"23 July 2010","review":"For a minute this looks like another American film that just can't wait to jump onto the 3D bandwagon, and taking along the teenage dance film fan demographic with them. But surprise, it's a British film, and the Brits can street dance just as well, going heads up with yet another upcoming American dance film continuing the Step Up franchise, also presented in 3D.<br><br>So is this new three dimensional format any good for this genre? There are a few moments and scenes here specifically crafted with 3D in mind, such as the tossing of items toward the screen, from hats to a busy food fight in a school canteen. There's also some jarringly added bullet-time choreography during one of the street dance battles in a club, but the real treat here is for that depth of field when we sit around and admire the precision-timed and energetic dance choreography from procedural balletic moves to raw, improvisational street dancing.<br><br>But this film does go the distance to explain and show the basics 101 of street dance, since it has characters from different camps put together to try and influence one another, and from their initial adversity come craft something unique from its diversity. All these thanks to Charlotte Rampling's Helena, a ballet teacher looking to infuse some spunk, energy and drive into her lethargic ballet students who are looking to impress some judges for entry into the prestigious Royal Academy of Dance.<br><br>At the opposite corner, we have a crew looking forward to their participation in the UL Street Dance Competition finals, only for their leader Jay (Ukwell Roach) handover the reins to his girlfriend Carly (Nichola Burley) who has to step up to the plate and assert her own leadership style in the crew's final lap to glory. To make matters worse, she has a lack of EQ with her teammates save for a few core supporters, and has to gather logistics from scratch, hence a marriage of strange bedfellows when she takes up Helena's offer.<br><br>Simply put, the story's very typical of dance films, with the usual themes of clashing of cultures, and to learn from each other's differences. Much like a Zero to Hero story with the usual cliché trappings involving romance, betrayal and friendship, with that dash of comedy, eye candy cast and of course, authentic street dancing moves unseen (at least to me) put on the big screen, made to come alive through 3D technology properly done. You'll come to expect that usual big bang finale where the fruits of the characters labour become the money making showpiece that the teenage crowd will line up for, and probably emulate, and it's not hard to see how this cannot go down that path of glory.<br><br>It's something that street dance enthusiasts, and they're growing by the numbers everyday, will embrace and flock to the cinemas for, and hey, the fusion of ballet and street dancing elements does pose an intriguing proposition. But after all, it's not about the techniques and styles used, but that of the human spirit of expression and perseverance, practice and camaraderie that ultimately soars above all. Recommended!","user":"DICK STEEL","rank":[14,16]}]