[{"title":"Surpsingly enough not horrible.","rating":6,"date":"15 September 2012","review":"It was real surprising for me to find out how watchable this movie actually was. I mean, a movie in which a shark attacks a bunch of people trapped in a supermarket, after a tsunami hit, doesn't exactly sound like high quality stuff. As a matter of fact. you would normally expect a movie like this to be extremely bad and cheesy but the movie, as it turned out, was far from cheesy and simply was being pretty good for what it was.<br><br>I still expected the worst, after the first 15 minutes or so, which wasn't exactly being a very promising start for the movie. It looked horrible and I feared for the rest of the movie. I expected it to be a very formulaic genre flick, in which nothing exciting or original ever happened. And even while the movie isn't being all that original, it still feels like a good watch, since it manages to entertain and takes itself serious enough.<br><br>That was perhaps being the key as to why the movie worked out; it took itself serious. Normally modern B-movies are very self aware and actors and directors obviously don't take their work all that serious. They make things deliberately cheesy to add to the fun factor and while this does work out at times, at others it makes the movie noting less but bad and annoying. In that regard it also was being refreshing to see how serious everybody involved took this movie. It definitely adds to the overall quality of the movie and its nice to see that this is a movie that took its audience serious and didn't treated them like a bunch of popcorn-eating-no-brainers, who only wanted to see lots of blood and nudity. The movie is not like that at all, even though the first 15 minutes would still suggest otherwise. Perhaps it was all deliberate and in the first 15 minutes they were like; 'this is what you expect us to do' and what after that follows was 'but this is what we are going to do with the concept'.<br><br>Thing I also liked about the movie was that it didn't featured one main, heroic character, in it, who saved everybody. instead there is a wide range of different characters in this, who all, just about, share an equal amount of screen time. None of them is pretending to be a hero, which also lets all of them all feel somewhat realistic and human-like.<br><br>On the downside; the special effects in this are pretty horrendous. Sort of funny that after 40-years, \"Jaws\" still has the most convincing looking shark in it. This movie too often relies on CGI effects, which aren't exactly of the best quality. But still, as far as shark movies go, this definitely is being one of the better ones, believe it or not.<br><br>Definitely watchable!<br><br>6/10 <br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[59,79]},{"title":"It was good","rating":6,"date":"14 September 2012","review":"OK when I saw the trailer for this I thought to myself that this movie was gonna be another cheap ''Shark night 3d'' but no. This movie had effort put into it and it's not a cheap awful Shark Night 3D. I enjoyed the movie. The acting was good, suspense was good, it had some twists that were nice too! and a great character development with humor. I enjoyed character development and relationships and the team work was great too. Yes, the CGI shark wasn't the best, but there were a lot of good scenes with non-CGI shark and gore scenes too. <br><br>This wasn't an average flick with no effort, it was a good movie. With effort put into it and does not deserve to get trashed by dumb kids with ''oooh, the movie was bad! I expected this too be God Father, but it disappointed me!!! skip it!!! 3/10 durr'' no, and that also applies to the first user reviewer (no offense) this is not cheap bad shark money- grabber for me. It's good flick<br><br>Yes, some facts about the shark may have been unrealistic, but so? doesn't make it a bad movie, cause it's a movie! and the idea is also nice and rare. You don't see a lot of movie with sharks, tsunami, and markets. <br><br>Check it out if you like Shark horror movies. It's not a masterpiece, but it's entertaining. Don't listen to ''average'' IMDb Mr.Negatives who won't give the movie 7 unless it's Citizen Kane or Pulp Fiction. Check it out.<br><br>6/10","user":"hobgoblinlol","rank":[61,88]},{"title":"More than just flesh...","rating":7,"date":"14 September 2012","review":"Some shark movies are laughable, cheesy, and way too far fetched  (Sharktopus). Some shark movies and horror movies in general can just  be unbelievably bad. This Australian film was a pleasant surprise.  There wasn't scantily clad girls walking around topless (Piranha) or  cheap thrills. This had some genuine pillow clenches, it had some  unpredictability, great acting, and had a location I had not seen  before in a shark movie, Australia. Most importantly it had characters  I actually cared about! There is more to this shark flick than just  sharp teeth and flesh. Dig your teeth into this film if you are a  thriller, horror, shark movie fan.","user":"BreakawayDaily","rank":[44,69]}]