[{"title":"Better than rated","rating":8,"date":"8 September 2012","review":"Despite the mediocre rating we decided to watch this and were surprised. It's quite a bit better than the rating. The well acted, odd storyline kept us interested. The main character is seemingly an unmotivated mid-thirties flunky who evolves throughout the film, but not how you might expect. Despite his lack of redeeming qualities he somehow draws you in. Perhaps it is his innate charm, or his boyish qualities and laissez faire approach. His quirky teen-aged girlfriend simultaneously provokes and entices, impossible to predict - nearly. This is not a formulaic Hollywood piece, though the film does not exactly break new ground either. Enjoy!! We did.","user":"davidcla-471-617940","rank":[34,41]},{"title":"It grows on you","rating":6,"date":"26 May 2012","review":"I wasn't sure whether to watch this or not initially, but I liked the look of the cast list and went with it to see what happened. I can say that in a lot of ways I am glad I did. While not a world winner it was good enough to entertain me for 90 minutes.<br><br>Michael C Hall is was the lead actor and was IMO well suited to the role of a man with no money, no prospects and only one big dream, to travel the world.<br><br>He is stuck in a rut living with his father (Peter Fonda) in a pokey little flat. His life needs a kickstart and he gets it from the consequences of his very short liaison with the 18 year old daughter (Brie Larson) of one of his school mates (Brad William Henke).<br><br>One word to describe this movie would be weird, but it was a fun sort of weird and there are some amusing parts that make it worth the watch.<br><br>Not a movie for someone looking for lots of action.","user":"nowego","rank":[30,43]},{"title":"likable indie flick","rating":7,"date":"5 June 2013","review":"been on showtime lately. watched it a few times. yes, the movie is ragged indie, and some of the characters are a little un developed. but miss larson, is great. she is sexy without being overt. even quirky. this is one of the better low budget flicks i have seen in a while... the bliss character is almost autistic, he deadpans thru the whole film. the side characters are weirdly off putting yet interesting. and peter fonda depressed the hell out of me, seeing him as a shut in old guy. but all in all, i like to see small films that have storys and not a freakin explosion thru out.... liked the soundtrack too, set a good mood for the film, also an issue with me today.<br><br>worth a look.","user":"boilinabag","rank":[14,19]}]