[{"title":"A lovely fun movie.","rating":9,"date":"30 May 2010","review":"Diane and I watched this lovely, unpretentious film yesterday and we both enjoyed this movie experience greatly. The comments about the movie and its low result from viewers illuminates the difficulty of contemporary movie appreciation. Yes, this film will not win awards nor will it win plaudits from reviewers but this raises the hoary question about what we the viewers want in a movie. I do not want to watch Disney movies with lifelike drawings of people; I realize that this movie making technique is a method of not spending huge salaries on actors for their roles in a film but I like our movies where real people do real things on the screen.<br><br>In this movie I have read complaints about the sketchiness of the plot and the paucity of acting in the film by some of the leads but I will have none of those criticisms. We loved the film; the island and the people and the buildings should be nominated for an award for best actor. The setting was magnificent and the actors blended into this beautiful background with ease. The script was a vehicle, not so much to challenge us intellectually but to present a canvas into which these fine Greek actors could play out their roles in the beauty of Mykonos. The script is merely the vehicle by which the true star of the film, Mykonos, can take centre stage. This is the best thing about film; it allows the viewer to remove themselves from the contemporary world and escape into something more than us.","user":"diane-34","rank":[29,42]},{"title":"A Greek-Australian dish that satisfies","rating":8,"date":"29 September 2010","review":"Nick Giannopoulos and his team have crafted another genuinely funny movie. This is a character driven, rare comedy whose simplicity belies its talents. Rare because Giannopoulos' humour comes from the heart. This lends much pathos to the characters we meet in 'Kings of Mykonos'. It warms us to, and sustains, our interest in a storyline that is clever without being contrived, is flawed without ever being pretentious.<br><br>The enjoyment Giannopoulos and his cast get out of every moment and every scene should be in the textbook for comedy filmmaking. It's a skill many bigger names in the industry will never master. Giannopoulos is an Aussie gem, and Kings of Mykonos reflects every facet of his talent.","user":"diogenes-858-449167","rank":[13,17]},{"title":"Beautiful scenery with paper thin plot","rating":6,"date":"12 May 2010","review":"I attended the premiere last night. I was a big fan of the first, so I knew this could never live up to it - I still enjoyed it.<br><br>The Kings of Mykonos clearly had a higher budget than the original, but a lot of charm was lost in this. The plot revolves around Steve &amp; Frank heading to Mykonos to claim an inheritance from a long lost relative and the predictable hi-jinx ensue.<br><br>I don't think anyone was expecting an Oscar quality movie here, and it won't exceed those expectations. There are still sufficient laughs to be had, but it is certainly not the laugh-out-loud-only-in-Australia humour of the original Wog Boy.<br><br>Nick G &amp; Vince C are starting to show their ages, but it works in the context of the film.<br><br>The two female leads are absolutely stunning in any language but you never quite buy the chemistry on screen. Kevin Sorbo has an amusing role as the King of Mykonos, and Alex Dimitriades's Mihali character had so much potential but barely has a line in the film considering the pivotal role.<br><br>The ending of the film was confusing and abrupt and I'm not quite sure what was supposed to go on there. It might be worthwhile waiting for the DVD version to see if there was an alternate ending. I also read that there was a sex scene filmed, but this certainly wasn't in the edit I saw last night.<br><br>All in all, I recommend it - particularly if you enjoyed the music and oh-so-Melbourne \"wogginess\" of the original. The scenery is breathtaking which is a nice change for the film. Don't have exceedingly high expectations and you won't be disappointed.","user":"ice_sarah","rank":[17,25]}]