[{"title":"Great Story, not half bad","rating":8,"date":"26 February 2018","review":"When I saw the initial reviews, I immediately prepared for disappointment.\nTurns out, the movie was great. Easily 7 to 7.5 and maybe a narrow 8/10 for me. It is technically above average, 3/10 is plain ridiculous.<br><br>I have to say this film is more drama than thriller.\nAnd yes, it can use a bit of refinement on pacing, and does lack a bit of punch.\nHowever, it did tug on my heartstrings on certain spots, and showcased a range of complex relationships and emotions between the characters.\nIt's great fun because in the end, its hard to tell who the villain is.\nI say this as a person who appreciates Drama and slow tempo Art films.<br><br>This film is not meant to be:\n1) a blockbuster thriller\n2) a hard Sci Fi that pushes philosophical questions<br><br>Rather, it is more of a drama / tragedy that effectively uses the Sci Fi backdrop to highlight the contrasting character of the protagonist Leo. Who is a sensitive soul and a man pure at heart who is unaffected by all the neon signs and the madness that surrounds him.","user":"lojohn-77131","rank":[85,102]},{"title":"A mess...","rating":3,"date":"8 November 2018","review":"Can't believe this is by the same guy who created Moon.\nI'm genuinely wondering if the script was written by primitive A.I. because the dialogue feels like sound bites taken from a back-catalogue of movie scripts.\nAlso, what went wrong with the cinematography? It's like the exposure values are all over the place, the environment is competing for attention with the lighting on the characters, and the shots are poorly framed. How can this be the work of the guy who shot Moon?","user":"dantehr","rank":[10,11]},{"title":"Promising Storyline, Messy Screenplay, Uninteresting Character","rating":5,"date":"25 February 2018","review":"In the near future, in Berlin, the Amish bartender Leo (Alexander Skarsgård) works in a bar with his beloved girlfriend Naadirah (Seyneb Saleh) and her gay friend Luba (Robert Sheehan). Leo is mute since he was a boy and had an accident in a lake. His mother, averse to technology, did not let Leo to be submitted to a corrective surgery since she believed God would heal him. Meanwhile, the American surgeons Cactus Bill (Paul Rudd) and Duck (Justin Theroux) work for the local gangsters. Cactus Bill has a daughter and dreams on returning to the United States, but he does not have documentation since he deserted the army. His hope is to get fake documents with the mobsters so that he can go back home. His partner Duck has documents but is a pedophile and likes to live in Berlin. When Naadirah vanishes without a trace, Leo seeks her out and goes to the underworld of Berlin, where his life entwines with Cactus Bill and Duck. Will he find his beloved Naadirah?<br><br>\"Mute\" is a disappointing film by the cult-director Duncan Jones. Despite the good acting and great music score and cinematography that recalls \"Altered Carbon\", the promising storyline fails mainly because of the messy screenplay and the uninteresting lead character. Most of the viewers certainly wants to like \"Mute\", but Leo does not help since it is an unattractive and annoying character. In the end credits, Duncan Jones dedicates this film to his father David \"Bowie\" Jones and to his beloved nanny Marion Skene, an incredible woman for caring for him as a toddler when his parents split. My vote is five.<br><br>Title (Brazil): \"Mudo\" (\"Mute\")","user":"claudio_carvalho","rank":[48,67]}]