[{"title":"Hysterical and Heart Warming!! Loved it!","rating":10,"date":"19 April 2010","review":"This film is sure to become the next great cult classic. It's the kind of movie you want to share with friends and watch over and over again. I haven't laughed that hard in a movie in a long time! If you've ever watched late night televangelists and laughed out loud, then this is the movie for you! But there's so much more to it than a simple satire of televangelism. I was surprised at the heartwarming story that made you come to love Pastor Sheperd! <br><br>Wow!! What a great character! Pastor Sheperd is reminiscent of a classic SNL character, however I enjoyed this movie far more than any movie spawned from an SNL character I've ever seen! The comedic timing is brilliant! <br><br>And then there's Danny Trejo, \"the world's greatest bad-ass\", playing the warm and friendly neighbor. How can you miss out on that! <br><br>It was a pleasant surprise to watch a movie that was that funny and yet was so clean. It seems like comedies today are in a contest to see who can be the most vulgar. Movies like Pastor Sheperd and Napoleon Dynamite have proved that that isn't necessary. <br><br>Its well cast, well written and perfectly executed!!","user":"ckaylinna","rank":[18,26]},{"title":"Great Movie!","rating":8,"date":"28 May 2014","review":"This is a great movie to watch with anyone you want! At first everything seems a little creepy but all the characters are played great and you can feel the good atmosphere in there :) <br><br>Even if its incomparable some scenes had a \"little miss sunshine\" feeling to it . <br><br>Also I like the fact its not overloaded with vulgarity so I can recommend it to anyone I want :) <br><br>There is a lot of videos from Pastor Shepherd on youtube and from Josh Perry &amp; Scott Allen Perry too ! <br><br>Thanks for this great Movie !","user":"Watmachtdiekuh","rank":[9,12]},{"title":"I was pleasantly surprised...","rating":8,"date":"27 May 2010","review":"Raised by evangelists, I normally don't find films about religion funny at all. Between flashbacks of my baptism in the Atlantic Ocean and post-traumatic stress from having to memorize all the books of the Bible (forwards and backwards --- that's right Revelation to Genesis and everything in between -- 66 in all, if memory serves) I normally run faster than Lot's family from Sodom and Gomorrah at the mention of anything with the word \"Pastor\" attached.<br><br>Soooo, I was pleasantly surprised when I found myself happily locked into my seat for the duration of Edwin Marshall's \"Pastor Shepherd.\" As an industry veteran, my normally jaded filter was wiped clean by the naiveté with which our hero approached life. Not since \"Forrest Gump\" has a character's purity of spirit so captivated an audience. His journey as he cares for his prescription drug and televangelist-addicted mother, applies himself diligently to his dare we say... morbid? profession, and struggles to communicate with those in his small world, has us cheering for this unlikely hero. \"Pastor Shepherd\" hearkens us back to a time when innocence was cool. And I think that's pretty darn neat.","user":"paulinetone","rank":[9,12]}]