[{"title":"A Solid Period Setting for a Romantic Comedy","rating":8,"date":"5 April 2012","review":"I was quite surprised at how much I sincerely enjoyed this film. Thinking I was wandering into quite a serious film about the female condition in Victorian Times I quickly realised it was a sharp witted rom-com about the characters inventing new ideas in Victorian Times.<br><br>I really enjoyed the interplay of the characters, who were all played very well by the actors who seemed to be having a lot of fun. The period setting was very realistic and beautifully realised. The story, although slight, had enough meaning behind it to make the experience a satisfying one and thoroughly enjoyable.<br><br>There were a few quibbles with the realistic attitudes of the Victorian Era, but the sense of innocence about the matter made it all very charming. The fact that the doctors administering their treatments to the women insisted that it was all very medical and there were no gratification from the act was endearing. Even with the smiles of sheer delight the women displayed upon the completion, no, it was all very professional.<br><br>I believe that's the attitude that encapsulates the film. Near the end the story veers into women's rights and tries very hard to ensure that people are left feeling the indignation those women who fought for our rights felt. But at the end of the day that wasn't what this film will be remembered for. It's all about the sheer pleasure of watching actors enjoying themselves, a fun storyline built for laughs in a well realised environment rarely used for such. It was fun, light and left you smiling. I highly recommend it.","user":"kath_henderson","rank":[63,69]},{"title":"Absolutely delightful film.","rating":10,"date":"20 September 2011","review":"My absolute favourite film from this year's Tiff. I was laughing like a crazy person but I was completely drowned out by the howling and squealing of all the women in the audience. Special attention was given to historical details and they all were masterfully done. The quality of the cast is something I haven't seen in quite a while, the roles were so much fun that many of the actors would have wanted to do this for nothing or at least for scale. It was true genius that such material was discussed and portrayed in such a manner as to be purely enjoyable without risking even the slightest offence. Be sure to stay for the very end and watch the antique devices as they appear on the left side and then the right side of the credits. The entire audience was still fixated on the screen as if in a champion tennis match until the lights came up and we applauded some more.<br><br>Absolutely delightful film.<br><br>Keep it up.","user":"mtrubic","rank":[99,119]},{"title":"A great English comedy","rating":7,"date":"14 February 2012","review":"I watched \"Hysteria as a sneak preview and, having no idea what to expect, I was pleasantly surprised. Both Dancy and Gyllenhaal refrain from playing their, somewhat stereotypical, roles over the top and the script is intelligent enough to build a strong relationship plot around the already interesting subject of the invention of the dildo. The subject is also interpreted in an entertaining way and not simply used as a gimmick, which happens quite a bit in these period pieces that feature a certain historical event. The comedic pacing is refreshing, tasteful and does not feel cheap which is impressive if you consider that some of the biggest laughs stem from scenes that depict the masturbation of middle aged women. All in all \"Hysteria\" is a fun movie, with good actors, a good story and, if that's important for you, a great happy end.","user":"TheDoomSong","rank":[55,68]}]