[{"title":"Bad reviews due to wrong target audience, marketing.","rating":8,"date":"26 October 2015","review":"Cronenberg's Cosmopolis is an adaptation of Don DeLillo's novel. The Novel is accepted as unfilmable an as one of the few novels which composes a precise image of our zeitgeist. The movie is not just based on Cronenberg's clever written script that could be a marvellous play for theatres but also a well directed movie with a talented cast and gets the audience into the atmosphere of a Japanese surreal anime. Nonetheless the movie is a marketing mistake of its kind. The negative reviews that emphasis the main actor Robert Pattinson's ex-sanguine performance are not to understand, since he is exactly as vampire as his character Eric Packer, a 28 years old egoist with a lot of money. However the reason of the box-office flop can be understood. First reason is the difference of target groups: It is possible that neither real Cronenberg fans (because of the poster of Pattinson on the foreground) nor Pattinson fans (since it's not a teenage movie) had the intention to see the movie. Second reason is he wrong advertisement: The audience watches an action trailer but finds out it is a Japanese surreal anime. This masterpiece of art proves us that even sci-fi legend David Cronenberg can flop on box-office.","user":"nm6369641","rank":[25,28]},{"title":"Philosophical and poetic","rating":7,"date":"4 January 2013","review":"If you are going to watch this movie, you need to give yourself adequate space to do so. This is a philosophical movie and not exactly easy to watch. It comes across more as visual poetry than anything else and therefore won't appeal to a mass audience. Which is partially the reason for a rather low score on this site. In my opinion it deserves more; the reason for this is that I firmly believe a movie has to be critiqued on the basis of it's type - you shouldn't judge this movie on the basis of all movies, but other movies of this sort, which are close adaptations of novels packed with dense dialogue and philosophical themed subject matter. The question you're looking for the answer to is \"should I watch this movie?\" And yes, you should, but curb your expectations to what type of movie it is. In it's genre, I find it thoughtprovoking and streamlined; It's a limo slowly being covered by graffiti; Something cold, perfect and seamless being torn apart from within. You will find no typical storyline and no lovable characters; at several times I thought to myself that these characters are in fact portraying computers assessing and processing information and various symptoms of the human condition. People do not talk like they do in this movie. The movie is very well executed and absolutely worth your time. If you are interested in this type of movie that is - and if that's the case it will likely leave you inspired in some way because you are constantly thinking throughout.","user":"p_v_dshoi","rank":[46,57]},{"title":"\"When he died he would not end. The world would end.\" (Don DeLillo)","rating":9,"date":"28 May 2012","review":"Eric Packer, genial asset manager, sitting in his limo, contemplating about himself and his visions while playing with numbers that represent an immense fortune, behaving almost in an autistic way once he tries to connect with the real world outside. Eric Packer also as the symbol of the small financial elite that rules our planet, arrogant, shameless and above all what's common and human.<br><br>What happens when you have all you want? When there's no challenge, no real desire anymore? When the last goal you want to pursue is, like a real Icarus, to fly so close to the sun that you can't but let melt the wax of your wings and fall, very deep?<br><br>This is, IMO, the essence of the story in Cosmopolis, with that difference that the protagonist in DeLillo's novel caused his downfall intentionally, while the financial disaster we live in the last few years was caused by the megalomania of the 1%.<br><br>When I first read the novel, I felt confused and a bit dumb too. DeLillo tried to send messages that I didn't understand at all. Then happened Occupy Wall Street and the pie into the face of Rupert Murdoch, so I gave the novel a second chance. I got hooked by the very complex character of Eric Packer, cold and emotionless on the outside and in his actions, but so vulnerable and lonely once you got to know him better. He's a very sad example of how far people can go in our society, just for the sake of money. I've read the book 2 times more, just to enjoy the countless, thoughtful quotes and one liners, weaved into stylistic dialogues as only DeLillo can pull off.<br><br>So, why have I written about the novel in a review about the film adaptation of this novel? Because I think that David Cronenberg did a fabulous job in trying to bring this book on screen. As a real master he has chosen to stay true to the dialogues, taking the risk that people, just like me when I first read the book, couldn't get the meanings of them. <br><br>He took from the novel what could work on screen and left scenes out, that he thought could disturb or change the mood of the movie. In the first part of the movie, he focused more on the little world of Eric into his limo rather than to shift the emphasis also outside the car. Not that I don't feel sorry some scenes didn't make it on screen (the famous street scene at the end) and for me the reality outside, in the streets of New-York, could've gotten more attention, but I can see his POV and I can live with it.<br><br>In this daring exploit Cronenberg made sure of the presence of an excellent cast, with remarkable performances of the supporting actors/actresses for the short time they appeared in the movie. The biggest challenge of course was the casting of Eric Packer, the doomed capitalist, who appears in almost every scene. Once again, David took a risk in hiring Robert Pattinson, but he was confident and he was right. Pattinson nailed this character to perfection. Especially when Eric (as his world) starts falling apart, Rob showed how able he is to bring out the psychotic, insane aspects of human being.<br><br>This is a movie that makes you think, that can give you an uncomfortable feeling and mirrors what's going on in some levels of our society. I understand that it is a difficult watch for people who haven't read the book, that they are disappointed but never was promised that this movie was going to be easy. The biggest issue IMHO isn't the movie itself but the fact that, in theatre, you haven't a button to pause and rewind so you can hear the dialogues again and again. Once the words are spoken, they're gone and I can imagine people reacting like WTH?? Though the movie stands on its own, it can only improve your experience if you go a bit prepared to the screening. With my review, I've tried to help those who're interested enough to give it a try. For those who didn't understand and by that didn't like the movie: even Cronenberg and Pattinson didn't understand the story quite well, but they went for it and created a masterpiece. There's nothing wrong with not understanding everything. It doesn't make the audience dumb, it doesn't make the movie bad and it doesn't make a brilliant performance less brilliant.<br><br>Sorry for mistakes as English isn't my first language.","user":"blackbeanie","rank":[297,407]}]