[{"title":"not just for kids.. and not just for Xmas","rating":10,"date":"29 November 2013","review":"The \"test\" of a film like this is whether you can just let go and enjoy it, or whether you are constantly feeling the presence of the writers or directors trying to push you or pull you.... I was delightfully surprised because this little treat was not released by a major player with all kinds of fanfare and expectations, it seemed designed as a simple holiday staple from the getgo, yet the writing and the animation were as good as or better than any of the big league stuff. This film is more fun than a barrel of hammers and in my view can (and should) be watched anytime of year by children of all ages, which includes grandparents.<br><br>--------------------------------<br><br>updated review ... unappreciated film ... and I know why<br><br>After first watching, I felt compelled to revisit Arthur Christmas again, and then again, and just finished my 4th go. The IMDb score is much too low and I know why. This is one of those very rare films where the creators put so much care and effort into the production that you cannot appreciate it all first time around. The dialog, the action is simply too quick. Fourth time around I was on the floor laughing at lines I had missed the first three times. There is more attention to detail in the closing credits than in many B-grade \"thrillers\" being churned out today. I believe this is not only one of the best animations ever done (in terms of script and execution) but also one of the best X-mas stories ever done. It deserves to be considered a classic. Maybe a new generation will notice it and give it the respect it deserves.","user":"A_Different_Drummer","rank":[31,36]},{"title":"A different kind of Christmas...","rating":8,"date":"19 December 2011","review":"I want to give this a 7, but its originality boosts it to an 8.<br><br>The story is predictable, but fun, but the tri-planar nature (Father-Father-Son) of the piece with off shoots of wife, mother, brother and friend, mean this is truly a film about a family Christmas.<br><br>Nothing unexpected happens, but I found myself laughing and egging Arthur on all the way! A film that succeeds in entertaining children and, in making the older viewers feel the onset of rosy and sometimes, emotional family nostalgia.<br><br>A more original plot may have blunted the message, but would also have engaged my brain.<br><br>Regardless, well done! A good Christmas film to add to the ranks.","user":"garethok","rank":[33,39]},{"title":"Delightfully charming","rating":9,"date":"19 November 2011","review":"Arthur Claus (James McAvoy) is the bumbling son of the reigning Santa, Malcolm Claus (Jim Broadbent). Arthur is relegated to the Letter Department where he can presumably do no damage. Arthur's brother Steve (Hugh Laurie) is the heir apparent to the title of Santa. Steve is handsome, confident, and in charge of the North Pole command center that monitors Santa's gift-giving flight around the world. The film opens with a bravura set piece showing how Santa is able to stop in millions of homes in one night. Hint: he has the help of thousands of elves. <br><br>When Arthur discovers that one gift was accidentally undelivered, he becomes determined to get it to the unfortunate girl before Christmas sunrise. Even with the help of his retired grandsanta (Bill Nighy) and a perky elf (Ashley Jensen) from the Wrapping Department, can Arthur travel around the world in time?<br><br>There have been many movies over the years where Christmas must be saved from disaster, but Arthur Christmas has a very creative take on it. From the opening scene where it's established that Santa is really a dynasty through the centuries, a title handed down from father to son, to the paramilitary operation to get millions of presents delivered in one night, to the misadventures of Arthur and his grandsanta as they try to make sure one little girl is not disappointed, Arthur Christmas is fun, creative, and original. Produced by Aardman Animations in association with Sony Pictures Animation, this CGI animated film delivers Aardman's distinct brand of quirky humor and style. <br><br>The art direction maintains the slightly skewed look of an Aardman claymation film. The character designs are asymmetric and the surface textures are realistic yet bold. The North Pole command center and Santa's high-tech sleigh are clean and modern. <br><br>Sometimes celebrity voice talent backfires, but here it works beautifully, the English accents lending a sense of gravity that heightens the silliness. Bill Nighy is particularly good, conveying wisdom that is tinged with resentment of the modern gift-delivery methods his son and grandson use. <br><br>Arthur Christmas is a funny, heartwarming, and poignant look at the Santa Claus mythos, adding a family dynamic that will resonate with children and adults. I expect Arthur Christmas will become a joyful holiday favorite for years to come.","user":"Scrooge-3","rank":[47,58]}]