[{"title":"A Hidden Treasure","rating":8,"date":"9 January 2011","review":"I saw the trailer to this film online and it seemed like a funny - yet unsustainable premise. I went to see it with friends anyway and I can't remember laughing so hard at a film in years. This movie takes a promising premise and knocks it out of the park. The cast is superb in this send-up of the psycho in the woods genre and the writing and direction take what I feared was an unsustainable premise and they give it surprising energy and humor. This is not Scary Movie crap. This is inventive and fresh and it has a beautiful heart. Tyler Labine and Alan Tudyk are the \"Hillbillies\" in this hilarious tale of prejudice and paranoia and they deliver performances that are grounded and authentic. Tucker and Dale never become plodding stereotypes of ignorant rednecks. They are portrayed with great wit and dignity and the actors never overreach or retreat into the safety and insecurity of broad camp. The cast trusts the writing and the director and it pays off. The script by Morgan Jurgenson and director Eli Craig is tight, smart and has a wonderful heart. These qualities are given life by an above average cast that includes the lovely Katrina Bowden from NBC's 30 Rock. An especially guilty pleasure is the character of Chad, brilliantly played by Jesse Moss who channels some alternate universe version of a sociopathic Tom Cruise as the lead frat-boy. Eli Craig really guided home a winner with this film. The movie sets a course at the beginning and you know where you're headed in the first five minutes-- but Craig's the captain of the ship and this journey is filled with surprises and wonderfully subtle moments that give the film a fun trajectory and a brisk pace. You breezily travel through a fantastic, hilarious and utterly sublime entertainment. Bravo!","user":"jeff-coatney","rank":[221,237]},{"title":"A must see. Instant cult classic.","rating":9,"date":"14 February 2011","review":"I did not have many expectations when I sat through this gem of a movie. This movie takes the horror/comedy genre to new levels. The plot is fairly simple, Lots of misunderstood situations that take place between Dale and Tucker and their fix-ur-upper vacation home, and some overly critical, unstable college kids. Very original script, good acting (Tucker and Dale are fantastic), and clever direction. How can a brilliant movie like this not make it to the big screen, yet movies like Season of the witch, Skyline, and Gulliver's Travels do. If you want to laugh till milk shoots out your nose, watch this movie. Should be on everyone's must-see list.","user":"bill-kercher","rank":[178,193]},{"title":"Wonderful!","rating":10,"date":"17 February 2011","review":"Anyone who is a fan of the horror genre will want to add this to their Netflix queue, or better, see it in a theater, because laughter shared is better than laughing alone. \"Tucker &amp; Dale vs. Evil\" does for the Hillbilly slasher/chainsaw massacre genre exactly what \"Evil Dead 2\" did for the demon possession genre and what \"Shaun Of The Dead\" did for zombies. It takes the well-worn, done-hundreds-of-times conventions of horror movies and turns them into side-splitting (as opposed to skull-splitting) humor.<br><br>The basic plot is that Tucker (Alan Tudyk, who played Wash in \"Firefly\" and \"Serenity\") and Dale (Tyler Labine, whose work I don't know but will look into) are two not-completely-bright but sweet Virginia hillbillies looking forward to a vacation in their \"fixer upper\" cabin in the woods, and there kicking back and doing nothing more stimulating than fishing and drinking beer. To their dismay, a group of spoiled, Preppie college students decide to camp next door to their cabin. The students get it into their heads that Tucker &amp; Dale are deranged, chainsaw-wielding serial killers, and react accordingly.<br><br>The movie actually has a lot to say about stereotypes, and how people project onto others those stereotypes, and their own inner \"dark sides.\" It's also at times hilariously funny, including an homage to the \"Groovy\" scene from \"Evil Dead 2\" (the corresponding great one-liner from this film is \"Bring it, frat bitch\"). There is definitely blood and gore involved, but...uh...funny blood and gore, if you're into that sorta thing. This is really a surprisingly good movie. I am already salivating at the thought of a sequel.","user":"UncleTantra","rank":[143,157]}]