[{"title":"Surprised (in a good way)","rating":8,"date":"28 May 2017","review":"At first I wasn't looking forward to watch Table 19.I assume that you already know the plot if you are reading user's reviews but you are not sure if you should watch the movie or not so , I am just going to tell you not be afraid of the poor rating and just watch the movie.Full of funny and dramatic moments and unexpected twists that reveal slowly the character's background I believe that Table 19 is a great movie for both drama and comedy lovers. All the actors give excellent performances and make you feel closer and more attached to the characters. It was just a great film and I really hope that it gets the reputation that it deserves.","user":"evrivali","rank":[100,117]},{"title":"Charming to a Fault","rating":8,"date":"16 March 2017","review":"I've been reviewing films off and on for about five years. And if there is one thing I've learned about criticism is that the vast, unchallenged mean between absolutely great movies and downright terrible ones hides a lot of non-committal fence sitting. I'm guilty of it myself; in today's age of instant self-gratification, it's easy to cobble together a knee-jerk opinion based on someone else's ideas. Problem is those ideas, whether valid or not, sometimes creates a subterfuge of undeserved hype or undeserved vitriol depending on the circumstance. They feed a cycle of wafer-thin subjectivity masquerading as authoritative proof of something's worth. This is why, for example a movie like Equilibrium (2002) can be seen as something more than a splashy Matrix (1999) rip-off while movies like Mystery Team (2009) are swept under the rug.<br><br>So it is with Table 19, a movie no one will likely see because the critical consensus is so bad that it's created its own negative feedback loop. Table 19 takes place over the course of several hours of a wedding reception at a rustic hotel lodge. As the happy couple celebrates their new marriage amid friends and family, a small group of strangers sit at the back table, forcing uncomfortable banter and gracelessly ignoring the reason for their position in the back. Among them are the argumentative Kepps (Kudlow and Robinson), the dotty Ms. Jo (Squibb), gawky teen Renzo (Revolori), distant cousin Walter (Merchant) and Eloise (Kendrick) the disgraced ex-Maid of Honor who was dumped by the Best Man (Russell).<br><br>To say Table 19 is \"ridiculous and a mess,\" is a bit of an understatement. As critics rightly point out, the pacing is stop and go, the editing is slapdash and the high-concept simply doesn't have the wherewithal to make it through a feature-length movie. Once the initial awkward niceties are flushed under the force of the first big narrative reveal, the film descends into a checklist of soapy plot-points and lazy character short hands. Much like 8 Heads in a Duffel Bag (a similarly imperfect ensemble farce), Table 19 klutzily mixes its farcical elements with broad, sweeping story setups and has them slosh about until the runtime wears out. On top of it all, the tone shifts wildly depending on who you're following at the time.<br><br>Thing is, I actually liked 8 Heads in a Duffel Bag, and I liked Table 19 too for much the same reason. The characters, as broad as they may be at times never ceased to entertain; Stephen Merchant's portrayal as a familial pariah Franken-walking through the banquet hall is worth the admission price alone. As are Renzo's far too honest conversations with his mother (Martindale in a superb unseen role) which mostly consist of him rolling his eyes while she pushes him to \"get laid already.\" Behind the Kepps' increasingly hostile quibbling and Grandma Jo's insistence that she'll be remembered (just you wait), lays a unified feeling of melancholy.<br><br>That feeling of melancholy along with some solid comedic setups and payoffs permeate through the film's cosmetic faults. Every time you're distracted by an awkward cut or taken aback by some of the more hammy moments, the film quickly lulls you back with its quixotic charm.<br><br>Helping to dry up this mess and put it back into a nice looking bucket is the relentless Anna Kendrick who by now has turned the neurotic jilted girl archetype into a symbol of quasi-empowerment. While she wins no brownie points for that here, there's something near noble about the way she throws herself into the fray. She easily elevates an already stellar cast and sells the hell out of the movies main conceit.<br><br>Much like the twangy banjo version of Pachabel's Canon in D that plays over the film's title sequence, Table 19 is a unique version of a very old cultural tradition. It's certainly not the best version of what it could be but with more than a handful of charming performances, this delightful little farce deserves a little better than the wedding inspired japes it's been getting from critics. Perhaps it's a case of ugly duckling syndrome on my part, but I'm going to go ahead and say \"I Do\" to this one.","user":"bkrauser-81-311064","rank":[82,105]},{"title":"An unexpectedly entertaining wedding sit-com.","rating":6,"date":"14 May 2017","review":"Trailers are notorious in over-promising for movies that under-deliver. But every now and then, one pops up that does the opposite. The trailer for Table 19 (2017) gives the impression of a lightweight romantic comedy with a touch of slapstick, all framed around a wedding. Despite being critically panned by many, there is more to this unexpectedly entertaining low-profile film than meets the eye.<br><br>The heroine is Eloise (Anna Kendrick) who, against her better judgement, accepts a wedding invitation knowing she is persona non-grata with the bridal party. She was recently dumped by the bride's brother, who is now the best man, and she is suddenly no longer the bride's best friend. She was the chief helper with the reception planning and knows who is at every table and why they are here. Her companions on Table 19 comprise a lovable granny-type, two oddballs, and a quarrelling married couple. They were all expected to decline their invitation but still send a gift, and that alone is a recipe for humour and satire. Their distance from the bridal table and proximity to the toilets quickly establishes their lowly social status and the comic sketches play on social awkwardness. The thread of continuity is through Eloise and her manhunts. The standard sit-com one-liners and the obligatory near-catastrophe with a wedding cake are neither original nor particularly funny, but the situation develops a warm emotional undercurrent that is unexpectedly touching.<br><br>One of the interesting things about this film is the difference between its plot and story. The plot is standard wedding reception comedy which laughs at the marginalisation of unwanted guests. On the other hand, the story explores why the Table 19'ers are together. It offers insight into their lives, their personalities, and the emotional hurt caused by being placed on the social fringe. The best part of the film is when the offended \"randoms\" leave the reception for a while to console each other. Through flashbacks we get the back-story to their invitations which range from pathetic to comic. For example, the granny-type really believed she was invited because the bride fondly remembered her first baby-sitter, but the bride barely knows who she is. There is also a wannabe trying to lose his virginity, a weird guy straight out of prison, and a couple who are far from an inspiring example of a loving marriage.<br><br>Anna Kendrick plays the perfect balance between awkward, aggrieved, and aggressive, and the randoms are standard comic stereotypes. But while our eyes are on Elosie, the warmth of the story come from her table companions. The gags are at snicker level rather than belly laughs and the cinematography is colourful and cluttered as wedding receptions often are. There is no shortage of embarrassing moments as Eloise stalks her men, both old and new, and the final scenes rise through melodrama to operatic farce. But this film offers a fresh take on standard rom-com themes in amusing and entertaining ways. and it might make you think twice if you need to create a seating plan.","user":"CineMuseFilms","rank":[51,67]}]