[{"title":"Less Is More, Much more.","rating":9,"date":"8 October 2010","review":"British crime films are a very mixed bunch, for every 'Long Good Friday' or 'Sexy Beast', there is a whole load of low rent, formulaic fayre of diminishing returns.<br><br>This film has one advantage from the off, not being set in London - or as many of the characters in the poorer films of this genre say it, 'Laanndan'. (Hiding those well brought up accents can be a strain perhaps).<br><br>It's set in Brighton, a town (recently upgraded to a 'City') on England's south coast. But not the Brighton known to many here in recent years, the place of celeb second homes, nightclub culture, a liberal place for homosexuals before most of the rest of the country became more adult and relaxed about this part of society.<br><br>The Brighton of mundane suburbia is the setting, not the cultural epicentre.<br><br>Largely set in a home, where Bill and his wife live with their 34 year old son, we first see them, the father and son, after being acquitted in a drugs trial, little to celebrate though - how did they get into court in the first place? Who grassed them up - have to be someone close, to their right little, tight little world of lower ranking club employees and drug pushers.<br><br>The home is the actual dwelling of the actor playing the father, where the son - his real life son - was actually brought up. Only the mother is played by a quite familiar actress - Julia Deakin. The father, Bill, being an ex hippy who wistfully reflects on the brief period of apparent enlightenment through Cannabis and LSD, via yoga and the Tibetan Book Of The Dead, before money, crime, harder drugs, intruded - which swept up Bill too.<br><br>So begins a claustrophobic period of suspicion, paranoia, leading to violence and murder. Between bouts of domestic bickering, including a 'meet my pregnant girlfriend' family dinner that is a mire of passive-aggressiveness.<br><br>The cast are largely drawn - when they are not family members of the writer and actor playing the son - from innovative and usually rather dark comedy shows and stand up.<br><br>Micro budget it might have, but Down Terrace punches well above it's weight. Lack of flash leads to a concentration on family dynamics - albeit a deeply disturbing one - realistic script and genuine plot shocks and surprises.<br><br>This film is refreshing, often laugh out loud funny - darkly funny usually - intense and a real gem. Clearly a labour of love from the small team involved in the whole production, a labour though of inspiration rather than just perspiration.","user":"GrahamEngland","rank":[50,69]},{"title":"Movie Review: 'Down Terrace' has memorable characters amongst the mundane","rating":7,"date":"1 April 2011","review":"Just released from jail, father and son Bill and Karl (played by real life father and son Bob and Robin Hill) are patriarchs of a small crime family. Their business and life in Down Terrace is plagued with infighting. When Karl's estranged girlfriend claims to be carrying his child, Karl's added priorities create tension amongst his immediate family. Suspicions grow when the family believes there's an informant in their midst that could send them all to prison for a very long time.<br><br>This film is hard to categorize. Some have called it a British version of Sopranos. While it is a story about a crime family, there's nothing very \"gangster\" about them. They don't dress or look the part. The three characters, Bill, Karl, and Maggie (Julie Deakin), Karl's mother, look and act like a regular blue collar family. They're not particularly convincing as gangsters (which may be why they're so well-hidden). For a good chunk of the movie, I had forgotten they were gangsters at all. Kind of like the TV show Roseanne, they bicker about regular family issues. Heavy with dialogue and awkward situations, the film plays almost like a comedic sitcom. It could have been about any family business and it would have worked.<br><br>There's realism and candor in the film's look and style. Characters talk about everyday things. Characters are often irritable, unkempt, and cumbersome. The camera is often hand-held, jerky, and frequently focuses on the mundane. The dialogue is often quite sharp and funny. It's certainly not glitzy like a gangster film.<br><br>There's virtually no action until the latter half of the film. Admittedly, some parts dragged. And, some parts are engrossing and sentimental. Some parts take you by surprise. The film's focus on both the mundane and the surprising moments is perhaps used to its benefit, but can sometimes feel a little uneven in terms of pacing. When the unexpected, violent moments hit, it reminded me that yes, this is indeed a \"gangster\" film. This results in some great dark humor. Advertisement<br><br>The characters truly make this film. The dynamics between Bill, Karl, and Maggie are realistic, funny, dysfunctional, and sad. Bob Hill is particularly memorable as Bill, an aging father who is frequently disappointed and putting down his son, Karl. Robin Hill expertly plays off his real-life father Bob (who plays Bill) as the constantly-frustrated Karl. Julie Deakin gives a complex, multifaceted performance as Maggie, the loving, sometimes scheming, mother, who may not always be as kind as she appears. The supporting cast, which consist of thugs who often do not act like thugs, bring proper amount of quirky, dry humor.<br><br>Given the expectations one may have of the frequently popular gangster genre, fans of that genre will likely be let down by this film while missing out on this film's more subtler, deeper story about family relationships. The initial pacing of the film may try some people's patience. It did me a little. I wished the film hadn't really characterized itself as a story about a crime family or a \"gangster film\" because it really isn't. I think it perhaps hurts the film somewhat—it makes it seem less real, maybe more gimmicky. This is closer to a family dramawith occasional violence thrown in. One may mistakingly go in expecting The Godfather. I can see this film re-imagined as a small crime story starring ordinary people—something akin to a Coen Brothers' film. These characters are odd, quirky, and dark in that vein.<br><br>I enjoyed the humor and the little surprises in this film despite the fact that the plot didn't always keep my interest. Some parts are quite banal and I sometimes wondered where the film was going. The film picks up considerably on the second half and the film's theme seems to follow the old adage that \"what goes around comes around.\" By the end, though, it was ultimately the memorable characters that remained with me long afterwards.<br><br>You can find more of my movie review updates on http://twitter.com/d_art","user":"d_art","rank":[24,35]},{"title":"The Royle Family Meets The Sopranos!","rating":7,"date":"15 December 2010","review":"This low budget British crime drama is as entertaining as it is inspirational for film makers everywhere. Played by a real life father and son in the main character roles, the story revolves around the two men (shot mainly in their real life family home) as they are released from prison and set out to determine who is the police informant in their circle. It makes excellent use of a simple acoustic soundtrack, also helped by the fact that the father likes to play guitar as well and is an old hippy, who has, over the years morphed into a gangster and so is different from your usual cockney style villain. This being shot in Brighton also shows a different side to the city which is usually perceived as simply a holiday destination. The plot while being slightly ambitious is played out by the actors very convincingly and holds your attention throughout. I would encourage anyone to see this movie, apart from maybe Michael Bay!","user":"stuart_osborn","rank":[21,36]}]