[{"title":"Too slow","rating":1,"date":"15 September 2012","review":"First 10 minutes gave me hope that it might get good, but it didn't. There is very little action, lots of pointless talking. It feels like this entire movie could have been a very short story, or a monologue.<br><br>Reason I started watching it in the first place is because it has several actors which I normally like. Acting is OK, problem is that situations are not believable, but rather pointless, and I was not made to care for any of characters.<br><br>I cant even recommend this movie as something to watch when you have nothing better to do. Instead, go outside, sit on grass, watch grass grow and meditate. Whatever you think about during it will be very likely more entertaining than this movie.","user":"BingBangBoom","rank":[35,44]},{"title":"Atrocious","rating":1,"date":"16 September 2012","review":"...in every way.<br><br>Script, acting, fight scenes, set design - accents - you name it, it's absolutely terrible.<br><br>Not worth your time. Or theirs.<br><br>More interestingly, a review here on IMDb has to be ten lines in length, or it cannot be posted - but there genuinely isn't ten lines of criticism worth leveling at this film.<br><br>In part, that is one of the problems the film has as well - *it could have been done in less than ten lines* - there aren't many films brave enough or strong enough to carry off the 'four protagonists in one room for the entire film' scenario - and this one shouldn't have attempted it.","user":"DrtyBlvd","rank":[27,37]},{"title":"Prepare for a dangerous dinner in Four Assassins","rating":5,"date":"18 February 2013","review":"Action films come along all the time, but sometimes the cover or poster art to the release is a bit deceptive. While it is the selling point and they clearly want it to be eye catching and interesting, it can also hurt a film if it doesn't live up to expectations. Four Assassins is one such film that leads you to prepare for an action heavy film, but delivers something completely different, but does it work? <br><br>Four Assassins follows four assassins that meet up in a Hong Kong hotel room to resolve unfinished business. As the night progresses secrets and the truth is slowly revealed that affects them all and all in the name of love. The story here is fairly simple and for all intents and purposes should not work at all, but somehow does. Most of this is thanks to the cast featuring the always good Will Yun Lee and Miguel Ferrer taking the lead. The film features some decent action, but is more about the character study than anything else. The structure is very Tarantinoish focusing on the dialogue as opposed to the action to keep this film moving forward as well as using flashbacks to learn more about their past. While at first it is a bit of a letdown with the lack of action, the well written dialogue ends up making for an unexpected film that works. While it doesn't break any ground it still steps out of the normal forgettable action fare and ends up delivering a smart thought provoking story. Have no fear, there is some action here and while it's not much it is well done.<br><br>This film is heavy on the dialogue, but keeps things interesting enough to keep the viewer from losing interest. Think Reservoir Dogs and change out the bank robbers with assassins and you have the vibe of this film. Lee has everything needed to carry this movie and does a great job. The rest of the cast do a fine job, but the only down side may be the misleading box art. Hopefully people will give this film more of a chance and watch it for what it is as opposed to what it appears to be.","user":"rgblakey","rank":[4,6]}]