[{"title":"Very good movie","rating":10,"date":"5 April 2011","review":"I had the opportunity to see Best and the Brightest at a showing in Brooklyn recently. This movie is a comedy that documents the struggles of a young couple trying to get their kid into a NYC private school kindergarten. They go to ridiculous lengths to make this happen, and hilarity ensues.<br><br>I don't normally go to independent movies, but I thought to myself that this is a movie that I would like to see if it were a major studio release. I felt that the premise had potential.<br><br>Then I found out that Neil Patrick Harris was one of the leads in this movie. NPH is arguably the most talented actor in my age bracket. I guess I don't really need to toot his horn. If you're reading this, you're likely a fan.<br><br>For an independent film, there sure were a lot of actors I knew. The main lead in this movie was Bonnie Somerville, who I remember from an arc in The OC. There was Kelly Coffield Park, who I used to watch on In Living Color. Another In Living Color vet, Steve Park (Kelly's husband), had a big role. Kate Mulgrew, of Star Trek Voyager fame, was also in there. The movie also had two very talented supporting actors in Amy Sedaris and Christopher McDonald. I've seen both their work in the past, but for me, McDonald's resume looks like a list of movies I've seen. He was in Grease 2, Breakin', and I'm probably the only person on the planet that would complement his work in Chattanooga Choo Choo. And finally, I'll mention Jenna Stern, who I haven't seen much of, but was very good in this movie as the comedic foil.<br><br>The movie itself was very good.<br><br>From the opening shot I knew this wasn't some amateur production. It had good cutaways, real music, and of course, a great cast. But most important, the audience I was with laughed.<br><br>That's the key. People laughed. I've seen so many movies where the jokes bomb. Comedians bomb more often than they are funny. But here, people laughed.<br><br>This was not some sort of family comedy. It was rated R. No question. F bombs were flying like Libya was the target. We had boobs. Two of them! And they were good! <br><br>I expected the movie to center around Neil Patrick Harris, though I would say that Somerville, who played NPH's wife Samantha, was the true star of the film. Best and the Brightest was not exactly what I expected. I went into the movie expecting PG-13 humor, with some sort of funny competition between families involving getting into preschool. The movie was really nothing like that. It was an R rated comedy with the kindergarten theme, with some dirty humor that just worked.<br><br>This is my first review on the IMDb, and I see the ban on spoilers. I don't THINK I'm revealing a spoiler here, but just to be safe, here's your SPOILER warning:<br><br>The movie shows the difficulty one has to get their kid educated in a private school. While the movie was an exaggeration, apparently, it isn't THAT much of an exaggeration. These people hit a brick wall, and even hired a coach named Sue (Sedaris) to get this kid into school. Sedaris basically decided that these people were too hum drum to stand out, and looked for a hook, and wasn't above stretching the truth. <br><br>Upon hearing that NPH's character Jeff wrote a single poem in high school, Sue decided that Jeff would market himself as a soon to be published poet. The idea was they could fake it through the interview with the headmistress(Stern), and all would be OK. I don't want to spoil this movie too much, but let's just say something made its way into the application by mistake, and the humor that came as a result made this movie. <br><br>One theme of this movie is what happens when a good intended lie spirals out of control. Well, in this movie, funny things happen.<br><br>This movie is better than a lot of things you see from the big studios today. The acting was top notch. Christopher McDonald has to be considered one of the more underrated actors out there. Everything he does, he does well. I don't need to compliment NPH. We all know he's the man. Sedaris was energetic and funny. Somerville of course was the star. The Parks' roles were written especially FOR them, and they were funny as well. <br><br>The movie's biggest issues will be marketing. Yes, it's a funny movie. Yes, it's a good movie. But how do you market an R rated comedy with a PG 13 topic? The people that would laugh at this movie, and the people that would likely go out and see it, may not be the same people. At the post-movie Q&amp;A, Director/co-writer Josh Shelov even said studios weren't sure how to market it. That said, I hope this movie showcases Josh well enough to get him to the next level. <br><br>If Michael Bay can make movies, if Brannon Braga can still get work writing and producing, if Will Ferrell is still allowed to act, then maybe it's time Hollywood raises its standards and lets some more talented people like the crew behind Best and the Brightest at it.<br><br>The bottom line is this--this movie has the most important element of a comedy. It's funny.","user":"chalpinm","rank":[21,31]},{"title":"A comedy rich with laughs AND story","rating":9,"date":"5 April 2011","review":"If an armed assailant pointed a loaded weapon at my head and demanded that I describe The Best and the Brightest in only two words, I would have to go with \"utterly refreshing.\"<br><br>The new comedy is a studio quality production crafted at the independent level, and perhaps even more delightful is that it offers a much needed alternative to the stale formulas that have characterized the majority of mainstream post-nineties comedy films. It's not that the film won't appeal to mainstream audiences, but that it represents the kind of mature yet lighthearted fun that they don't get the opportunity to enjoy much these days. <br><br>The story centers on a young couple, Jeff and Sam (played by Neil Patrick Harris and Bonnie Somerville) who, after inheriting some money courtesy of a dead aunt, relocate their family to upstate New York. It's when the two middle-class parents take on the task of getting their daughter into an elite private kindergarten that things get deliciously wacky. For Sam, breaking through the stonewall of fake smiles and gag-inducing pretentiousness becomes symbolic of her last shot to have her family move up in the world, and the ridiculous lies she must sustain to blend in with the yuppies propel the comedy forward.<br><br>Here's the thing: while The Best and the Brightest may not be the perfect film, it's got the perfect measures of all the great comedy ingredients. It's not a one note joke -- it seems that, too often, comedies take one simple idea (drinking, doing drugs, don't have sex with your friends) and stretch it out for two to two and a half insufferable hours. This film actually has a story, and kudos to first time feature film director (and co-writer) Josh Shelov for crafting comedic scenarios which flow naturally from the drama of the story rather than just having the characters sit around talking about how funny they are. The jokes don't need explaining -- probably because they're funny to begin with.<br><br>The acting from everyone involved is solid and appropriate for this type of film (there's no third act lull where everyone cries for twenty minutes on the off chance they might snag an Oscar nod). Neil Patrick Harris is essentially the straight man here, but without aloofness or condescension, rather with willingness to support his wife even while reacting to the madness of situations that require him to read his friend's filthy, borderline dehumanizing online sex chats at a school board meeting and pass it off as part of his newest poetry anthology.<br><br>Bonnie Somerville does the impossible, makes us care about the former high school cheer-leading captain, who is still very much in the process of falling more deeply in love with her nerdy husband. Watching her suddenly break from her sweet, mom-like demeanor to drop f-bombs on anyone who threatens her family's security was a source of much amusement. And her interactions with the fast-talking school system consultant Sue Lemon (played with goofy zeal by Amy Sedaris) make for some very quotable lines.<br><br>The supporting cast does well also. Standouts include Peter Serafinowicz as spoiled man- child Clark who gets drawn into Jeff and Sam's schemes, and the sexually repressed villain played by Jenna Stern, who gets drawn into Clark's shameless sexual escapades. There's also a subplot involving Jeff's ex flame, a mentally unstable actress played by Bridget Regan, who may or may not be trying to win him back by showing off her lovely...feminine assets. Regan's fans will most likely be impressed with her versatility here. She sheds her dignified Seeker persona for an interesting turn as Robin, giving her supporting role depth by not playing Robin as straight up out-of-her-friggin-mind but as someone who just doesn't seem quite right from the neck up. On the outside, Regan looks amazing as usual, and at a pivotal moment when Jeff becomes mesmerized by her beauty while hanging out in a seedy swingers club (you know, the usual), we the audience are right there with him.<br><br>The Best and the Brightest succeeds on many levels, not the least of which is that it's not just a senseless stream of nut-shots or poop jokes -- the vulgarity here proves that there is, in fact, an art to vulgarity, and it works. There are times when the jokes slow down a bit, which are noticeable when compared to the majority of the fast-talking, laugh-out-loud scenes in the film, but even when the pacing winds down here and there, there's the engaging story and likable characters to keep us eager for the next big moment (a vital factor missing in most film comedies of late). I often found myself postponing laughs because I was so wrapped up in whether the heroes would be foiled in their outrageous quest.<br><br>From a technical standpoint, the movie looks clean and polished, with good sound mixing so the audience doesn't miss any of the often hilarious banter. The perfectly punctuated finale had me cracking up for a good ninety seconds. And anyone who's ever edited video knows how long a time ninety seconds really is. Catch one of the upcoming screenings of the film, or get it on DVD, then put the kids to bed (or your drunken roommates) and enjoy some real intelligent, adult comedy with no sickening side effects.","user":"DayDreamer7","rank":[17,26]},{"title":"Very Funny Movie","rating":9,"date":"6 April 2011","review":"Saw an advanced screening of this movie with a Q&amp;A afterward with Co-Writer/Director Josh Shelov. I was on-set during one of the scenes and I thought this would be an independent PG-13 comedy. Instead, it's a very heartfelt, R-rated comedy with excellent actors. <br><br>First the movie, it was hilarious! People in the audience were laughing hysterically, so I wasn't alone. To me, there is four parts of this movie. Part 1, 2, and 4 are hysterical, and part 3 was pretty good, but not great. The writing by Josh Shelov and Michael Jaeger is witty, old-school, and just plain funny. It's been a while since I've seen a comedy that isn't sarcasm and too raunchy. This film is raunchy, yes, but in a good way. It's a farce, and a very good one. The story is very right-on and the situations are original and just hilarious. <br><br>The acting ensemble, including Peter Serafinowicz (voice of Darth Maul/Pete in Shaun of the Dead), Jenna Stern, and Amy Sedaris, are great. Neil Patrick Harris isn't great but it's cool to see him play someone other than a womanizer like Barney. Bonnie Somerville carried the leading role more than Harris. She carried the film with her unique acting skills. Another scene stealer was Christopher McDonald (remember? Shooter MaGavin in Happy Gilmore). He is a very funny guy and he needs to stick with comedy and not those TNT shows. <br><br>Overall, funny movie. If I say anymore about the story, I'll spoil it. I'm saying, anyone would be up for a real surprise. <br><br>After the film, Josh Shelov spoke to everyone in the audience. I asked him a few questions. He is witty and original guy, and if you ever see an advanced screening with a Q and A with him, ask him about his big break. It's a very fascinating and appalling story. <br><br>See this movie...","user":"tub87373","rank":[16,26]}]