[{"title":"Ratings must be rigged - don't waste your time","rating":3,"date":"28 December 2013","review":"I'm just writing this review to counter some of the other obviously faked reviews written here. I was tricked to watch this movie too, because it had a rating of 7.3 with over a 1000 ratings. So I thought this could be a solid piece of horror/splatter. But it's not. I assure you, it's not. You will be disappointed after watching it, because it's painfully bad. And I don't mean bad as in \"The Tourist\" bad, it's just cheap filmmaking by people who don't know what they're doing. This can't be the work of professionals. Bad acting, bad dialog, bad lightning, bad camera, bad cinematography, bad special effects... complete senseless directing, conclusion, story(telling).... It's just a piece of trash. Yes it's that bad. And I'm writing this only to save you from losing over 1hour of your life. And to restore justice to the rating/review system of IMDb. You're welcome.","user":"EddyOne","rank":[206,280]},{"title":"terrible movie","rating":1,"date":"23 December 2013","review":"i'm honestly just writing this because of the high score and 2 rave reviews obviously written by people involved with the project. i feel like i was duped into watching it. so here's an honest review: this is a terrible movie. it's poorly written, and badly acted. only exception is the deaf girl. she wasn't bad, given the material she had to work with. <br><br>it's just lazy filmmaking, seems like. says nothing about the human condition (as purported from the existing reviews), only the sophomoric insight of a film-school reject who saw one too many eli roth movies. <br><br>seriously, avoid at all costs.","user":"bigtrouble8","rank":[138,209]},{"title":"Awful, don't waste your time on this crap!!","rating":1,"date":"28 December 2013","review":"First of all, I just wanted to vote for this movie and let it go, but I felt really guilty after reading some delusional reviews on here, and its rate of 6.3 which will fool you and make you watch this huge crap. I'm so surprised with some users who gave it a 10, they're probably a part of this film, or maybe they were drunk while writing their reviews. And the real question is how on Earth did it get a 6.3 rate among over 1000 of users, like what is wrong with people's attitude nowadays?! Now let's talk about this movie, the acting was not that bad, the special effects were very bad, the story was nonsense, or I'd prefer saying that this movie didn't even have a story. It started with a girl whose mother and sister died because of cancer, and when she knew she was affected with it, she raised her middle finger to God, but what's shocking is that the next time she visited the doctor, she was told she COMPLETELY recovered from Cancer without any treatment and for an unknown reason, and she walked by and thanked God. This is the first nonsense event in this movie. What happens next is that many people found themselves in an unknown place and they can't remember how did that happen, and they all were in the same place when that happened. Then people start running during the whole movie. There were two deaf couple at that incident, and for some reason a \"miracle\" happened and they could hear again. Another senseless event in this movie. Let's now talk about the rules of this race, if you step on grass your head will blow up, if you get passed by someone twice your head will blow up, if you don't obey the directions your head will blow up too!! All what you'll see is heads blowing up, for an unknown reason, running and running for another unknown reason. Then people will start killing each other and that annoying voice will be continuously counting down how much people are still alive. At the end you'll be left with, as usual, a senseless ending. Your questions won't be answered, you won't know why and how all this crap happened, and you won't even know what happens to the only survivor. To sum up, this is one of the worst movies ever made, it lacks everything, and you'll probably regret wasting one and a half hour of your life on it. I already wasted my time watching it and now writing a review about it, hoping it helps and saves your time. So don't listen to any of these misleading reviews, and save your time and money for a better reason.","user":"Salim08","rank":[66,103]}]