[{"title":"Great Visuals, Weak Script overall","rating":7,"date":"4 October 2013","review":"Visually, Gravity is unlike what we have seen on a cinema screen before and arguably it has one of the best uses of 3D in a movie. The setting is spectacular and the premise is inventive.<br><br>On every other front,the movie falters badly. Once you get over the initial wonderment surrounding the beautiful visuals, the chinks start showing up. Overall the script is very weak. Apparently the Russians bomb their own satellite by mistake and the debris is flying around at bullet speed, smashing everything in its way. Now upon hearing an emergency evacuation request, Kowalski (who has been wasting his precious thrusters all this while, floating around, spouting inane dialogs) orders Ryan (Bullock) to disengage from whatever she is repairing. Apparently Ryan has six months of training (only) and fails to be responsive and then the trouble starts.<br><br>We come to know that Ryan has some head issues surrounding the death of her daughter as the writer felt a dire need to give Ryan some sort of existential problem in her head to make her character feel more human. Apart from this minor bit, nothing is presented in terms of character development for any other protagonists. Who is Kowalski? Who are the people who died in their space pods? No idea.<br><br>Then the whole manufactured sense of suspense. Every time Ryan gets anywhere near the Air Lock (she does it three times), the debris presents itself like on cue every single time. Then a fire in a space station, then running out of Oxygen, then something then something. It's fine that they used some standard tricks but it all seems so manufactured and mechanical by the numbers suspense.<br><br>Also at times I couldn't shrug off the feeling that what they are showing on screen is not actually factual. Do the controls on various international space stations have their national languages on them? Really? Maybe they do but seems hard to believe when 20$ phones are built with custom User interfaces with changeable languages, why have your billion dollar space stations with Russian or Chinese characters on your buttons totally beats me. Oh manufactured suspense owing to the whole can't-understand-this-thing machinery.<br><br>The the dialogs when they come are nothing to write home about. Ryan has a hallucinatory moment when she talks to herself following some Mandarin Chatter on the radio which is cringe worthy. I wont even mention the in-your-face allegory about rebirth which is there for to make the movie seem deeper than it is.<br><br>So what works for the movie? It's a cross between an IMAX documentary with some suspense elements thrown it which makes it look path breaking.<br><br>But it's not. Not a bad watch but nothing to rave about either.","user":"vikascoder","rank":[567,838]},{"title":"Super special effects, weak story and dialog","rating":7,"date":"6 October 2013","review":"In segments, Gravity has marvelous special effects--truly a remarkable achievement. The weak parts of the movie are the contrivances that link these segments together, along with unbelievably bad dialog. (Maybe someone will be brave enough to register the contrivances formally as \"goofs\" here on IMDb?)<br><br>No way could astronauts from the shuttle ever reach the International Space Station, but Gravity asks us to believe both this could happen and that an astronaut could then go on to reach a Chinese space station, too. These objects just don't orbit anywhere--ANYWHERE!!!!--near close enough to each other to make these events even remotely possible. Not only are their orbits vastly different in altitude and trajectory, it would be highly unlikely for them all to be near each other in the same orbit. Oh, I almost forgot to mention that Gravity also asks us to believe that the orbit of the space debris intersected with that of the shuttle and was synchronized with it.<br><br>No way could Ryan Stone figure out how to operate a Soyuz capsule in a few seconds of reading the manuals. No way could Ryan Stone figure out how to operate the Chinese capsule just by poking around.<br><br>Of lesser failures: Space debris traveling 20,000 miles an hour relative to an observer is not going to be visible except *possibly* as an indistinct cloud that passes by so fast the \"observer\" won't know what hit them.<br><br>For all of the CGI effort, I had hoped the Earth would look more realistic and (naturally) beautiful.<br><br>In closing, the special effects were great but the weak story relied on too many absurd contrivances and the script contained no redeeming dialog (sorry, George). On balance: 7 stars.","user":"junkmail-385","rank":[330,491]},{"title":"Lost in Space","rating":1,"date":"8 October 2013","review":"The big \"spoiler\" is that this is a big budget Hollywood move with a preposterous plot and lots of special effects. The problem here is that nobody could possible survive through any of this, and the special effects become a substitute for any meaningful plot. Even taken on its own terms, the movie makes no sense. Sandra Bullock has become an astronaut but lacks even the basic skills for that occupation. She tells us she always crash landed the flight simulator, and we find her thumbing through an instruction manual about the size of the instructions for a DVD player to figure out how to safely pilot a space craft back to earth. She even picks the buttons eeny, meany, miney, mo style. Add to this the contrived scenario that she has not only lost a child but also is \"revived\" and given a reason to live by the now dead George Clooney appearing in a dream sequence. And how great a movie can it really be where there is only one character (and almost no dialog) on camera for most of the film. The special effects are impressive, but what they've obviously done is use computer graphics to create all the weightless effects. As such, things remain weightless even when they shouldn't be, and you eventually become more interested in looking for the screw-ups than watching the movie. Please, please, please. Will someone make a movie with a clever plot that keeps you guessing to the end and with interesting and passably believable characters.","user":"BKTrayner","rank":[959,1]}]