[{"title":"Initially avoided this movie, but when I watched it I felt like an idiot.","rating":8,"date":"25 February 2019","review":"To start off this review I'd like to say that before I ever watched this movie I had the opinion that it was going to be rubbish, solely because of how blown up the movie was. Everywhere I went it was \"The Greatest Showman\". I thought that perhaps it would be a mediocre film at best, blown out of proportion by a craze.<br><br>Boy was I wrong. Even at the beginning of the movie you are thrown straight into the extravagance of what the movie was about to become. What is basically the story of a simple man becoming a legend in the show-business, is the most flamboyant and breath-taken musical movie I've seen. The soundtrack for this movie is beyond brilliant. Having been impressed by Hugh Jackman's vocals in Les Miserable I was not surprised he pulls it out of the bag in this movie yet again. But Zac Efron really stood out in this movie and that truly surprised me.<br><br>When you finish this movie you will have the great songs stuck in your head, and you will be fully satisfied having finished the movie, your next plan will likely be getting the soundtrack and reliving the magic all over again.","user":"Brandon-Donlon","rank":[113,126]},{"title":"Critics are Wrong","rating":10,"date":"26 December 2017","review":"I have never written a movie review but I couldn't let this jewel of a movie be slammed by the cynical critics without saying how much I loved it. This was the perfect movie for our family on Christmas Day. Don't pay attention to the \"professional\" reviews; judge by the moviegoers who are praising the movie. It was moving, upbeat, and romantic. Can't say enough good things about it. Hugh Jackman, Zac Efron, Michelle Williams, and Zendaya are all so talented. Go see it in the theater to really appreciate how magical this movie is.","user":"lilylou-85745","rank":[732,944]},{"title":"As Soon As It Was Over, I Wanted to See It Again","rating":10,"date":"1 January 2018","review":"I love the circus. I love quality cinema. Not since Billy Rose's Jumbo (1962) has a motion picture so successfully combined these two elements. I wouldn't be surprised if it won the same awards as Cecil B. DeMille's The Greatest Show on Earth (1952). Michael Gracey skillfully brought together the best music, choreography, cast, cinematography, visual effects, costumes, and set decoration I have seen in recent years, all fresh and original, and integrated them into nothing short of a masterpiece.","user":"hertl","rank":[446,572]}]