[{"title":"Nice Feel Good Film","rating":3,"date":"9 June 2010","review":"This is a really nice feel good film. As far as teen Rom-coms go, this isn't half bad. I'm sure teen girls would love it but as a guy, I quite enjoyed it too.<br><br>Brian Krause was really impressive and the clueless father, Daniel. He really suits the lovable Dad role, so this was a smart piece of casting.<br><br>Never seen any of the other cast members but I was particularly taken by Danielle Chuchran who played the beautiful Emma. Not only is she stunning but she played the role really well.<br><br>The special effects were a little cheesy and if I'm honest, the film could of done without them. A Cupid doesn't need sparks flying from their finger tips but it is an improvement to the old diapers and bows n' arrows.<br><br>If you want to some light viewing. Then check this out. :)","user":"dantayuk","rank":[9,12]},{"title":"Fun family film!","rating":10,"date":"5 August 2010","review":"A darling story with a great cast! No need to be worried about who this film is appropriate for as it is most definitely appropriate for all ages. How refreshing it is to be able to sit down to view a movie without any concerns as to which eyes or ears are watching. While animated films are fun, it is nice to find a great family film without it having to be animated. No sex, blood, violence or bad language. The magical touches in the movie add to the fun! The locations of the film are beautiful and well chosen. I especially enjoyed the beauty of the prom scene in the movie. A nice film to add to your family film library! I highly recommend taking the time to check this movie out!","user":"voodoowoman2010","rank":[7,12]},{"title":"Excellent movie for the whole family. Fun and entertaining","rating":10,"date":"14 May 2010","review":"I love this movie. It's really awesome. Jeremy Sumpter is so cute in it, I have been a fan of his since Peter Pan. I watch Friday Night Lights and I am really looking forward to Soul Surfer.<br><br>Brian Krause is really cute as the clueless Daniel Valentine, and Lauren Holly is hilarious as Audrey.<br><br>This movie reminds me of Parent Trap meets Bride Wars I love the story, it's fun and entertaining all the way through.<br><br>Jeremy Sumpter does a really good job as the love struck Connor. When he gets put under the spell of the girls, he comes off as a sweet bumbling lovestruck guy, and it's believable.<br><br>Chad Hively who plays Elliot might be a newcomer, but his considerable skills show that he's going to go far.<br><br>Danielle Chuchran and Caitlin EJ Meyer are delightful as the fraternal twins Emma and Lily. <br><br>The supporting cast is great too. I liked the goofy Marvin and his hot new love.<br><br>This is a fun movie that girls of all ages will enjoy.","user":"BackRoadGirl","rank":[6,11]}]