[{"title":"I'm seriously confused.","rating":3,"date":"15 May 2011","review":"OK. After seeing the previews of this movie, it was added to the list of movies I did NOT have any intentions of seeing. However, I heard so many great things about it, I decided to give it a try. Let's just say, my gut feeling was correct. I have NO idea what so many people found so amazing about this movie.<br><br>It's not that funny. Yeah, there were a couple of scenes that I found humorous, and chuckled. However, most of the \"funny\" scenes were either involving sex, about sex, about poop/vomit/farting/burping, or a lame attempt at slapstick humor. Lots of predictable cheap shots. Seriously, no sophisticated or classy humor... the whole film made me feel trashy, honestly. I get that it's rated R, but still. I felt like I was in an adult version of an equivalent to Spongebob at times.<br><br>Small plot. This movie is slowly stretched out for over 2 hours, with a plot that could easily be explained entirely, with all important scenes, in about 30 minutes. There were SO many long scenes that seem to be thrown in just so Kristen Wiig can score another laugh, yet they don't progress the story. Quite a few plot holes, and there were many scenes where I caught myself rolling my eyes, thinking, \"really?\" <br><br>The greatest movies develop their characters so much that you literally feel for their outcomes. I left the theater with no regards to any of the characters in this movie, because they were all so distant and under-developed. The plot was so weak and rushed for the next pointless comedy spiel, that they didn't give the characters any depth, except maybe the lead of \"Annie.\" I can think of 2 memorable scenes right now from this film, and I saw it last night. Yeah, there were some funny scenes, but nothing worth raving about in my opinion.<br><br>I do have to give \"Bridesmaids\" some credit. An all-female leading role movie is very new in show-business, especially in comedy. Sadly, these women made the \"Hangover\" equivalent instead of raising the bar, but they get Kudos for the efforts. There were some sweet moments in the movie, that for me, held the film from turning into a complete waste of money. I do like comedy, but I prefer classier, witty humor instead of the easy, thoughtless humor. I would much rather watch a movie that evolves a character so much that the cheap shots aren't needed for laughs. If you liked \"The Hangover,\" then you'll probably enjoy this movie..","user":"chicka91","rank":[485,893]},{"title":"A hilarious and surprisingly touching comedy","rating":9,"date":"21 April 2011","review":"My friends invited me to a preview screening of Bridesmaids last night, and I accepted the invitation with a sense of cautious optimism. The trailer for the film admittedly didn't do much for me, but I was intrigued by the concept of a female-driven Apatow film. Ultimately, I went into the theater with modest expectations, hoping to get a few good laughs out of it.<br><br>By the time we came out of the theater, my three friends and I had smiles plastered across our faces, and we couldn't stop talking about the film for the next couple hours. We all loved it. I think it easily ranks with the best of the Apatow productions, and it might even be my personal favorite. Like all of Apatow's productions, there are admittedly scenes that arguably go a little too far or a little too long, but that's a small criticism when the film successfully fires on so many other cylinders.<br><br>To start with, the film is hilarious, and I think the comedy far exceeds the standalone bits shown in the trailer. Scene after scene is filled with humorous and often sidesplitting moments, and they had the theater in an uproar during the screening. I can't say enough about Kristen Wiig. Prior to this, I've always liked her to some extent but never really loved her. I think she's good at what she does, but I wasn't sure her shtick could sustain an entire film. Would her passive aggressive wit get old? Is it the only note she can play? Can she handle anything more dramatic? Ultimately, she blew me away in this film. Not only is she consistently and uniquely funny, but her character is surprisingly well-developed, and Wiig brings the character to vibrant and dynamic life on-screen.<br><br>And this brings me to my next point about Bridesmaids: the film has a surprising amount of depth that completely caught me off guard. Bridesmaids isn't a quickie 80-minute gag fest by any stretch of the imagination; it's actually a leisurely paced 2-hour character-driven comedy that takes time to develop its characters and establish the various relationships and resultant conflicts between them. Ultimately, the film ends up being quite heartfelt and even rather sad in places. Despite the over-the-top antics shown in the trailer, the themes that the film explores are actually quite grounded. Kristen Wiig's character is someone who is feeling completely let down by life, which is a place we've all been, and the personal journey of her character resonated strongly for me. While her character is easily the most well-developed of the bunch, even the other bridesmaids ultimately show some three-dimensionality as well, despite the fact that they are sometimes initially introduced as two-dimensional caricatures.<br><br>Ultimately, Bridesmaids was one of the most enjoyable comedies I've seen in a long time. It's certainly not perfect: it could probably do with some editing, there might be a few too many subplots (some of which are left unexplored), and it arguably goes too over-the-top at times, but everything else about the film works so well that these complaints are little more than nitpicks. While I applaud everyone involved in the production, it is Kristen Wiig who deserves the most accolades. As co-writer and lead actress, she plays a huge part in the film's success, and I sincerely hope this film puts her on the Hollywood map, as I would love to see more from her in the future. Whatever the case may be, Bridesmaids certainly makes for a successful maiden voyage for her into the world of feature-film comedies.","user":"AntoNEO","rank":[227,407]},{"title":"This movie is so desperate for a laugh that if it nudged you it would have broken a rib","rating":2,"date":"26 June 2011","review":"Annie (Kristen Wiig) is a lonely woman who works in a jewellery store and shares casual sex with Ted (Jon Hamm). She is still reeling after her bakery closed during the recession. Her best friend that she's known for years is Lillian (Maya Rudolph). Lillian announces that she's getting married and that she wants Annie to be her maid of honour. Annie is initially excited but then realises that she will be alone again. Worse still is that Lillian is using four other women to help organise the wedding, including the dominating Helen (Rose Byrne), who she met less than a year ago. Helen and Annie compete furiously to outdo each other on the wedding plans but its Annie and her relationship with Lillian which comes off worse. Adding a little bit of joy to Annie's life is patrol officer Nathan Rhodes (Chris O'Dowd) as they start to slowly connect.<br><br>'Oh my God! You're getting married!' If you enjoy this kind of shrieking, along with references to various bodily functions and wedding parties so extreme they'd make royalty look mild, you will like Bridesmaids. As someone who does not have any interest in these things I found Bridesmaids to be a film of two halves: the first appalling and the second not much better. It's been directed by Paul Feig, under the watch of producer Judd Apatow and many have touted this as a female version of The Hangover (2009). Although the misdirection of the comedy could be pinned on Feig, the film was already on shaky ground because of the screenplay written by Wiig. She co-wrote the film with Annie Mumolo and was also one of the producers herself. Wiig has a background in variety programs like Saturday Night Live and for worse, it shows. Somewhere the rules of comedy have been forgotten. Comedy must exist in reality. Humour is funniest when we can imagine ourselves in similar, plausible, situations. There are very few scenes in Bridesmaids that feel honest or genuine. Too many moments play out like extended skits, stretching plausibility with unsophisticated humour and little concern for developing theme. This movie is so desperate for a laugh that if it nudged you it would have broken a rib. I took zero pleasure from watching women defecate over a sink, vomiting on top of each other, or becoming boozy on an aeroplane.<br><br>If these situations weren't distasteful enough, smaller moments are undone by dialogue that lacks subtlety. Some lines of dialogue, like when Annie talks to customers in the jewellery store, are ridiculously blunt when they should have been loaded. It weakens the credibility of the characters and flattens the humour because we know people don't talk like this. Though taste in humour is subjective it's difficult to ignore the image problems rising in modern comedies. A lot of rom-coms, including this one, are pushing a social view that if you are fat, single or unmarried, you are weird, low in confidence and a failure. Wedding parties in films are also now so extravagantly realised that they have become a measure of success and social approval. Bridesmaids continues many of these trends, taking every chance to deprive its characters of dignity. That is until Annie can find the ridiculously nice Irish bloke. In the second half, the film at least tries to give Annie a recovery after hitting rock bottom but its views of friendship and renewal are simplistic and predictable. Like a lot of the film, Wiig's comedic performance is so annoyingly exaggerated that it saps any chance of realism. But Chris O'Dowd, as one of the film's few likable characters, is mercifully restrained. A lot of women will see this because it gives them the rare centre of attention in a raunchy, mainstream comedy. But is this really the best Hollywood can offer? If there's a Bridesmaids: Part II I'm sending a non-acceptance card.","user":"Likes_Ninjas90","rank":[203,372]}]