[{"title":"Jackie Chan Gives His All in His Final Action Movie!","rating":7,"date":"3 February 2013","review":"This was the first solo Jackie Chan movie that I have seen for a long while. In \"Forbidden Kingdom,\" he shared the star billing with Jet Li. In \"Karate Kid\", he even played a supporting role for Jaden Smith! Now comes word that this film \"Chinese Zodiac\" will already be the last action film of the iconic martial arts star. If that statement alone will not convince his fans to catch it, then I do not know what will.<br><br>I think a lot of people shared that idea, even my kids who have only seen him before in \"Karate Kid\". Today is the first weekend that it is showing in local theaters. We watched this in a movie theater in Chinatown, and that 3pm showing was totally SOLD OUT. It had been quite some time that I have been in a completely full theater in a showing that is not a premiere. It is truly impressive that the audience was composed of fans of all ages.<br><br>\"Chinese Zodiac\" recounts the exploits of a mercenary of historic relics, JC (Jackie Chan), who is searching for the twelve bronze heads of Chinese Zodiac animals which had been looted from the Summer Palace. JC leads a team who works with him, \"Mission Impossible\" style. <br><br>He shares his adventure as well with two plucky ladies: Katherine (a French heiress who would like to him to find her great-grandfather ship which was lost at sea), and a Chinese activist Coco (who is part of a crusade to have Western powers to return cultural treasures back to the countries from whom these were stolen during colonial times). <br><br>As with all Jackie Chan movies in the past, the main reason people go to watch it is not really the story, but Jackie's unique brand of comedy- action. This film certainly does not disappoint. It is two hours worth of exciting stunts which only Jackie can deliver. The movie opened with a long sequence wherein he was sailing down a mountain road using a body suit with roller blades all over it. The last scenes involved skydiving in order to recover the last animal head before it plummets into a volcano! There were still so many action scenes in between -- involving dogs in a maze, pirates on an island, a rival mercenary on a sofa, henchmen with photography equipment -- all as exhilarating as they were also funny.<br><br>Yes, Jackie Chan's age may be showing (he is 58 now), but he definitely still has IT! The outtakes shown over the end credits show that he was still the one doing all those dangerous stunts and demanding physical comedy routines himself. Though he was uncharacteristically playing a rogue character in this film, like all of his past movies, there are still lessons to be learned at the end, both personally as well as patriotically. Cheesy dialogs and corny acting, yes, but above all it is excellent entertainment, as can be evidenced by the enthusiastic audience response. Come on in and enjoy Jackie Chan's final show!","user":"3xHCCH","rank":[42,51]},{"title":"Appropriate send-off in my opinion","rating":9,"date":"8 January 2013","review":"I watched this movie without seeing the reviews and enjoyed it very very much. Which is why I'm quite surprised of the low reviews it's been getting from critics.<br><br>Sure, many dialogues were corny and the plot is borderline ridiculous. But do you really go to a Jackie Chan movie for its story? <br><br>The stunts and fight scenes in this movie are simply amazing. I don't want to spoil anything for those who haven't watched it yet, but if you grew up watching Jackie's earlier films (80s and 90s), you're gonna be pleasantly reminded of his golden days. He's not as fast or as nimble, but it is still light years better than the typical 'hollywood' action scenes.<br><br>As mentioned, story and dialogue: meh. Think of it as a vehicle for the action that ensues. You'll get a few trademark comedy reminiscent of Jackie's earlier works, and overall it's a very good family film. But action is the hook of this movie. It's seriously so good that you'll come in with expectations of great action, and still come out thinking that was better than expected.<br><br>If you're a fan of Jackie, this is a no-brainer must-watch. If you're not a fan, give it a chance as it is still an extremely solid action movie.","user":"fabian_mardi","rank":[64,84]},{"title":"Jackie Chan of 1980's 1990's is back","rating":8,"date":"29 December 2012","review":"Went in with a load of expectations as it was jackie's full fledged action movie after a long time ........ and sequel of a highly entertaining \"Armour of God\" added more zeal to the expectations ... movie starts off with a superb stunt with jackie trademark of riskiness written all over ... then movie movie moves off superfast with stunts, comedy and entertainment all through the way ... 2 and half hours runs without brakes ..... jackie is wonderful throughout the film ... though the movie misses jackieism of 80's and 90's a little bit , still the magic works .........<br><br>verdict: Jackie's show throughout - highly entertaining ... action fans don't miss it ;)","user":"ramkumar-uiic","rank":[48,70]}]