[{"title":"Truly the most wonderful movie I have ever seen","rating":10,"date":"23 November 2012","review":"I am 24 year old fairly macho male,but I love animated movies. Me and my wife went and saw this movie on date night and hands down best Christmas movie of all times. It was full of wonderment,amazement and magic.I teared up at least 4 different times during the movie. It made me feel like a kid again it made me believe. I found myself gasping and laughing at the same parts as the the 3 year old little girl sitting 3 seats away was and any movie that can do that is worth seeing. best holiday movie of all times.<br><br>I am the wife :) and I found the movie to be equally moving and evoked emotions about the holidays and that I hadn't felt since I was a child. This may seem like a simple children's movie, but it is so much more than that if you really allow yourself to feel the characters. :) I hope you and your family enjoy the movie as much as we did!","user":"writeherrerajc","rank":[217,265]},{"title":"'Guardians' gives kids some holiday inspiration","rating":7,"date":"11 November 2012","review":"Here's a fresh look at old tradition: a tatted-up Russian St. Nick and an Australian kangaroo-looking Easter Bunny. Rise of the Guardians is based on an original children's book series by William Joyce, who produced the film along with Guillermo Del Toro. The books were inspired by the author's 6-year-old daughter when she asked him if Santa Claus and the Easter Bunny knew each other.<br><br>Admittedly I was skeptical going in, but the chemistry of personalities works wonderfully. It creates an original formula that goes against certain expectations. Perhaps one improvement in potential sequels would be to focus more centrally on Santa (or \"Nicholas St. North\"), but Jack Frost's story is incredibly touching and I found it clever how it parallels the antagonist's motives. The film is slow to start but picks up at a fast pace with non-stop action. By the end, the entire movie theater was in applause.<br><br>Rise of the Guardians is a cute, adventurous, and heartwarming family film that focuses on hanging on to the best thing about childhood: belief.","user":"DjMethod","rank":[101,130]},{"title":"A Movie Destined To Become A Classic!","rating":9,"date":"30 November 2012","review":"This movie is magical and utterly charming. In this film DreamWorks did it all exactly right. Every voice is precisely as it should be. Perfection! Chris Pine, Jude Law, Hugh Jackman, too many to list if you didn't know that was Alec Baldwin doing the Russian accent for Santa, you would never guess it. The characters, all of them, are endearing, totally engaging. Sad moments, glad moments, hilarious moments. I haven't laughed this much in an animated movie since.well, never, actually. As I said, this one is destined to become a classic. A wonderful family movie and best of all it doesn't just appeal to the children, adults will love it too. Every adult in the audience,while I was there, seemed as captivated as the kids. And how many movies do you go to these days where, at the end, people applaud? They did for this one. And rightly so. I know I came out of that theater wishing I could somehow have my own Little Baby Tooth...and the friend I was with wished even more that she could have one of the Feisty Elves. You'll totally understand what I mean after you see this delightful movie. Don't miss this one!","user":"patsworld","rank":[83,107]}]