[{"title":"Coming from a non-Michael Jackson fan...","rating":9,"date":"27 October 2009","review":"I haven't been since I was a kid. I therefore had zero expectations for this movie, and even groaned that I had to come in at 6 this morning to preview it for my theater. That said, I was completely blown away and entertained from beginning to end. His voice and his dance moves are top form and timeless. He sang all his greatest hits, even from the J5 era, which really hit a soft spot with me. And people might be complaining that this isn't a typical concert movie...in truth, that is a big plus here. Typical concert movies are overly produced. The intimacy of this footage makes you feel, not like you're in a concert, but like you're witness to very private performances. You get to see first hand how involved this man was (to every little detail of production and planning). There are no crowds of screaming and crying fans to have to sit through (with the exception of a brief opening scene in which the auditioning dancers get a little too blubbery at times). This film easily reignited my appreciation for the man, who was without a doubt one of the greatest entertainers of our time. Complete 180 for me, I'll be the first to admit. And a side note, his female guitarist (her name escapes me) had me picking my jaw up off the floor, and not just her looks. You'll see what I mean.","user":"ashfordcrane","rank":[240,273]},{"title":"Genius ?","rating":10,"date":"29 October 2009","review":"This was a clear view into the intergral preperation of a concert by a complete genius. I was never a Michael Jackson fan, however, my wife was and since she was desperate to see the film I decided to accompany her. I was astounded. I could not believe this man in the film was the same person that is was always hounded by the press and made to look like the devil. He was by no means weird, ill health, or a drug user. If he was, he masked it very well. The film shows us what we are missing as far as the concert goes and what a pity, it would have been amazing! He seemed at ease, and so happy and normal while on stage, as if it was built to be his. You would never believe this was the ''freak'' that the world perceived him to be. Shame on those people. Genius at work, a perfectionist down the smallest detail and I think the film has captured this very well. What I liked a lot was the fact that the film was not concentrating on his death and tradegy, but solely on his concert, his music, and his geniality and it was a fitting tribute to one of the greatest musicians of our times. So I would urge anyone who has had any miss conceptions about the man to go see this, you like me will more than likely change your views on the man. RIP","user":"shakazulubb","rank":[133,154]},{"title":"Moved with no expectations.","rating":9,"date":"28 October 2009","review":"I went to see this movie as a non-Michael Jackson fan with absolutely no expectations. I bought the tickets for the world premiere as a birthday gift for my girlfriend. We went to the cinema in the morning and from the beginning I was moved. I have never done it before but in the very beginning a tear came to my eye. Thinking that this guy, with so much energy is 50 years old and about to die. When I bought the tickets I expected a movie with some biography of Michael, a lot of interviews etc, but there is none of this in the movie. The whole movie is about how the concerts would be, but I still didn't feel like I was seeing a concert. I was seeing a little family making a big project come true. I also expected to see Michael less weak, than some of his others concerts, but damn.. If you didn't know he was dead, and saw him dance and sing like he does there is no way you could predict that he was about to die of illness. There was no way I wanted to pay for tickets to his concerts before this day, but now I would pay 500$ for seeing those concerts in London. Although that This is it was about the concerts, the movie also consist a little sense of humor, love and a insight to the worlds climate problems.<br><br>A really great job, with great cutting and editing. This movie is a must see for everyone! Even though you aren't a fan of Michael, go watch it!","user":"casperladeby","rank":[209,251]}]