[{"title":"See ISTL for Tom Hiddleston's great performance and for Hank's eternal songs","rating":7,"date":"26 March 2016","review":"It's a shame that some of this film's structural flaws will keep many from seeing one of the best on screen performances I've seen in years. Hiddleston's Hank Williams is a masterful creation: haunting, driven and soulful with the added bonus of Hiddleston doing his own singing and playing (no lip-syncing) including Hank's famous yodel. <br><br>While the film would have benefited with less marital squabbling and more music, it nonetheless takes one on an gripping journey of an American music icon's tragic life and short but amazing career.<br><br>Elizabeth Olson as Audrey, William's headstrong wife, does a fine job but I could have done with less of their relationship story and more about Hank's musical process. Cherry Jones is also excellent as Hank's bossy mom.<br><br>The stellar singing in the opening segment is worth the price of admission.","user":"trez1","rank":[44,49]},{"title":"Hiddleston does Hank admirably--the movie no so much.","rating":25,"date":"25 March 2016","review":"\"I'm So Lonesome I Could Cry\" or \"Your Cheatin' Heart\" might have been better titles for the Hank Williams biopic, \"I Saw the Light.\" The story written and directed by Marc Abraham has too much emphasis on his lonely, cheating persona that led to divorce and broken hearts along the arc of this film's 1944 to 1953, when he died of too much drugs and alcohol. After seeing Amy, about Amy Winehouse, I'm waiting currently for a softer biography, say of Perry Como.<br><br>Anyway, Tom Hiddleston's turn as Williams is hypnotically spot on from tics and Southern drawl to hats and all the charm in between. Hiddleston is a good singer who seems to have captured Williams in a masterful interpretation of a manic depressive genius. That's my major concern with the story: I want more of the music, its creation and its challenges, and much less of the personal and domestic warfare, led by his wife, Audrey (Elizabeth Olsen).<br><br>Olsen's Southern accent is impressively accurate without being too twangy although her singing is not up to Huddleston's level of smoothness. Audrey was apparently a strong woman who interjected herself into the studio as well as the home. Although she isn't as memorable as June Carter Cash, she is a force in Williams' life. At a point I was sympathetic to her and her children, who were small players in Williams' life.<br><br>I guess if you really want to know Hank Williams, listen to his songs. If you want to see what Loki can do outside of science fiction, see him play Hank Williams in I Saw the Light.","user":"jdesando","rank":[36,42]},{"title":"From a big Hank fan...","rating":7,"date":"1 April 2016","review":"I'm only 25 years old, but I have almost all of Hank's music and have read multiple books in high school about him (including \"Hank Williams: The Biography\" by Colin Escott). So needless to say, I had high hopes for this movie.<br><br>I feel like my high hopes were mostly met. I thought the movie did a very good job of laying out Hank's life and showing his stardom as well as struggles. I didn't like as much that it was rated R vs a PG-13 for \"Walk the Line\", but then again, anyone who has studied Hank knows that his life was rough and he wasn't candy-coated by any means. <br><br>I think Tom Hiddleston does a very good job as Hank, though maybe not QUITE as spot on as I would've liked. But when a big movie comes out about probably my biggest musical artist of all-time, I won't complain. From what I've read, Mr. Hiddleston was basically trained to be as spot-on as possible, and when I saw the movie, he had me believing it was Hank. Elizabeth Olsen did a very good job as Audrey as well.<br><br>Overall, I quite enjoyed the movie and am anticipating any special edition releases when it comes out on DVD in a few months. Of course, there were moments of sadness especially toward the end, but there were also moments of happiness and (at least for me) a few chuckles. Although I wouldn't rank this as high as \"Walk the Line\" in my list of biopics, it was definitely worth the price of admission to me and I would totally see it again if given the opportunity.","user":"mizzouram","rank":[36,44]}]