[{"title":"Excellent Documentary!","rating":9,"date":"8 June 2010","review":"This is a very informative documentary, and one that doesn't try to shove anything down your throat. Nor does it try to use guilt or fear in an attempt to sell some sort of moral message to the viewer. It simply just gives you as much info that is known about the life of the Buddha. It also explains some of the teachings and beliefs that the Buddha went on to develop and share. This film gives a general overview of the Buddhist way of life and thought. The pace of this documentary is also very good, this aspect makes it very easy to pay attention. Richard Gere with his smooth voice also suits the film perfectly as the narrator. And of course he is also a Buddhist himself. The visuals are great here as well. I highly recommend this to everyone. Whether you consider yourself a spiritual person or not, this is certainly worth a look. It is very interesting stuff, and this is well crafted material. Check it out!<br><br>9/10","user":"TheAnimalMother","rank":[37,39]},{"title":"A worthy addition to a documentary collection","rating":3,"date":"3 May 2010","review":"In great contrast to the previous review shredding this documentary apart, I (as a Buddhist) feel that this documentary was profound in its execution and content for both Buddhists and non-Buddhists. Considering the vast complexity of a faith that has evolved and differentiated itself many times over the centuries, this documentary made a valiant and successful effort in presenting the core story and principles of the life and teachings of the Buddha. It is presented with animations and interviews that are easily identifiable without going deeper into more complex principles of Buddhism that would alienate the viewing audience of lay Buddhists and non-Buddhists. I highly recommend watching it and respectfully disagree with the previous reviewers points of contention about the documentary.","user":"unlovbl","rank":[44,51]},{"title":"Marvelous","rating":10,"date":"22 May 2010","review":"I found this documentary very instructive. I saw it on PBS, which is very well known for its high quality documentaries. And this one just follows that tradition. Buddhism is a beautiful religion/philosophy and was portrayed in the documentary in a simple and easy to understand manner. The music adequately accompanies the narration and the beautiful animations.<br><br>The Buddha's story is very touching and reflects the endless quest of humanity for peace. Peace starts with one's self, to be able to reflect it on the outside world.<br><br>Personnaly, it opened my eyes and heart at life. Will definitely meditate more often now. Highly recommended.","user":"buggsi","rank":[26,29]}]