[{"title":"Pa Negre: Dark and Deep","rating":8,"date":"12 May 2011","review":"Black Bread begins with a familiar scene: a man leads his horse and cart through a darkened wood, glancing around with unease at the various forest sounds which break the tense silence. A fairy-tale quality hangs over the scene, the images framed in wide angles and brought to life with rich autumnal hues; perhaps this will be a fantasy parable. When an assailant attacks the traveller, binds him in the cart, and leads the now-blindfolded horse to the cliff's edge, brutally smashing it in the face with a sledge hammer, our stomachs concomitantly fold alongside the illusion that this will be anything but sickeningly real. It is the first clue to us that we are not in for the easiest of rides; many of the images that will come to us will be disturbing, even distressing.<br><br>Set in the years following the Spanish civil war, the film portrays the lingering dissent and tarnished political atmosphere of a nation divided. Andreu—the young boy who discovers the wreckage and is caught up in the post-civil war world of deceit that grips his small village as he attempts to discover the truth behind the \"accident\"—is sent to live with his grandmother, aunt, and cousins when his father—having fought for the losing side along with the murdered man—is forced to flee in fear of his own life. Andreu's journey to discover what happened to the cart and its riders takes him into the darkness within his village, his family, and even himself.<br><br>It seems to me that there is a recurrent idea in modern Spanish-language cinema: to explore the issues of the civil war through the eyes of a child. Predating Black Bread, there are a number of films such as Butterfly's Tongue and Pan's Labyrinth which use the same concept. Examining the war through young eyes contextualises it, reducing it to its most fundamental perceptible elements and providing a fascinating perspective on (in the case of the former) the senselessness of condemning people by ideology alone and (the latter) the monstrousness of war and the frivolity of conflict. In a way, Black Bread achieves both of these things, though far more so the second. It demonstrates not the horror of war itself, but the horror of the people war creates; the capability for evil of those left living. The dark truths Andreu unearths are as horrifying as any war, the images he dreams up truly disturbing. The child protagonist is a proxy through whom we see things at their most stripped-down, basic, and shocking, exposing to us the sheer lunacy of humanity's follies. Surprising is the film's tackling of a particular societal issue which gradually becomes the centre of its comment upon our race, and the animalistic prejudices which, sadly, so often characterise us. Worth making mention of is the film's name, something of a motif referring to the secondary theme of class and social standing, commenting upon the sickening imbalance between the wealthy and the poor in times of hardship. Most films would do well to achieve half the depth Black Bread manages with this theme, and it is a secondary one.<br><br>A worthy addition to the fray of Spanish civil war dramas, Black Bread is a surprisingly dark and deep examination of war's effect upon the lives and personalities of those who suffer through it. Condemning the capability of ordinary people to do extraordinary evil, it is an impactful portrait of guilt, responsibility, society, and family.","user":"imagiking","rank":[28,28]},{"title":"Villaronga steps up","rating":9,"date":"18 March 2011","review":"This film swept the board at this year's Goyas (Spanish cinema awards), but after last years Cell 211 ( an enjoyable but unremarkable prison drama) did the same, I wasn't expecting too much. <br><br>I'd enjoyed Villaronga's disturbing Aro Tolbukhin, but I wasn't expecting this. One of the best opening sequences you'll see all year leads to a mystery, experienced through the eyes of one boy, that reveals lies, conspiracy and the dark secrets in the heart of a rural Catalan village a few years after the end of the Civil War. <br><br>It's magnificently done, and the performances of the children match those of actors such as Sergi Lopez (whose role echoes that in Pan's Labyrinth),Eduard Fernández and Marina Comas.<br><br>Scenes such as the boy's father instructing him to uphold his ideals and walk tall, or a powerless mother pleading her husband's innocence, are familiar from more commercial films. Here they are brutally undermined until nothing is left but pitiless self interest. <br><br>A chilling study of how war and poverty create monsters.","user":"ironheadrat","rank":[41,43]},{"title":"A boy wades past fascism and rural poverty in a strong Catalan coming-of-age film","rating":9,"date":"17 April 2011","review":"Agustí Villaronga wrote and directed this austerely beautiful Catalan coming-of-age film based on a novel by Emili Teixidor with echoes of Clément's Forbidden Games and Dickens' Great Expectations and a setting -- a child's rural world during the grim days after the Spanish Civil War (1944) -- that links it with de Toro's Pan's Labyrinth. But while del Toro's film is Gothic and surreal, Teixidor's, apart dream sequences and flight metaphors, impresses in both its narrative and its imagery with a stark simplicity worthy of Italian neorealism, overlaid with greater layer of moral ambiguity. Again as in Pan's Labyringh, Sergi López plays the local fascist Alcalde, this time a less clearly sadistic one. <br><br>At the center is 11-year-old Andreu (Francesc Colomer), who at the outset witnesses a shocking crime. He sees a hooded figure kill a man, toss him in a covered wagon, than blindfold the horse pulling the wagon and cast them all off a cliff with a boy inside. Andreu's father Farriol (Roger Casamajor) is suspected, perhaps because he has an anti-fascist background. Farriol goes into hiding and Andreu is sent to live with his grandmother (Elisa Crehuet) in a houseful of widows. Andreu's lean, handsome father gives his son many inspiring peptalks about keeping the moral high ground, but all the while his own character remains somewhat suspect. Eventually Andreu will also turn away even from his long- suffering mother Florencia (Nora Navas) when he is adopted by a rich, plump Miss Havisham figure, Mrs. Manubens (Merce Aranega).<br><br>At school the teacher is a monomaniacal fascist drum-beater and alcoholic (Eduard Fernandez), who even sleeps with Andreu's feral, maimed but beautiful cousin Núria (Marina Comas) -- her hand has been blown up by a bomb. Yet he is not without redeeming qualities, and Fernandez conveys complexity when he advises Andreu to leave his past behind and seek a better life. Núria and Andreu become frequent companions, and roam the mysterious forest together (this is the Forbidden Games part). Here also he meets an older boy, first spotting him bathing naked in that forest, a consumptive boy (Lázaro Mur) who lives in the monastery, and who imagines he has angels' wings. The none- too-subtle bird imagery extends to a pet in a red wooden cage kept by Andreu's dad. Obviously Andreu is to fly away, and the comsumptive boy can only dream of it.<br><br>It's Andreu's mother who approaches Mrs. Manubens when Farriol has been found and taken away. Not much comes of that, and Farriol is taken to Barcelona and shot, but Mrs. Manubens warms to the idea of adopting Andreu. <br><br>All this happens with a kind of precipitous energy fueled by the intense but simple cinematography, the understated, compelling acting, the emotional scenes, and the prevailing sense of fear and moral ambiguity in which Andreau remarkably, with the innocence and determination of a boy, sails through unharmed, or at least capable of accepting adoption and going to a good school that will change his future. <br><br>It's not necessary to undermine the rich accomplishment of Pan's Labyrinth to praise Black Bread, but it does shine forth precisely because of its simplicity and completely lack of the kind of baroque flourishes del Toro relishes. There is some strong hand-held camera work, but also smooth tracking shots. The cinematography of Antonio Riestra is classic and the editing by Raul Roman is smooth and swift. <br><br>According to Jonathan Holland's review in Variety, this is Villaronga's\"most mainstream film\" but still \"retains his trademark subversive edge.\" Holland also points to the way \"as a depiction of rural poverty\" the film is \"impressive: The darkly lit, richly textured interiors seem to be an extension of the beautifully lensed natural landscape.\" Something about the simple dignity of the people offsets the danger and moral uncertainty of events and gives one a sense of humanistic tradition even in a world where all's gone mad and main characters like Andreu and his parents reject the comforts of religion. <br><br>Black Bread/Pa negre, whose sense of style is timeless, understandably won many awards, an unusual number for a film in Catalan, both at its San Sebastián festival debut and with nine Goyas after Spanish theatrical release including best picture and best director and prizes to most of the main actors. Both Francesc Colomer, who plays the young lead and Marina Comas, who plays his cynical pal Núria, won \"most promising\" awards. Colomer, who is in nearly every scene, has a limpid confidence that stays with you as a memorable presence long after the final scene.<br><br>The film showed earlier this year in the US at the Palm Springs festival. Seen and reviewed as part of the San Francisco International Film Festival 2011.","user":"Chris Knipp","rank":[18,19]}]