[{"title":"A Weak Cast Offering Weak Performances In A Dreadful Movie","rating":1,"date":"29 January 2010","review":"By the time \"Second Chances\" is finished, all you wish is that you had a second chance to live the hour and a half wasted on watching this. This is truly a dreadful movie, composed of a weak cast offering weak performances playing uninteresting characters filled with meaningless sub-plots and a main plot that was poorly developed and not that interesting. It's supposed to be about a former reporter filled with remorse about not helping the police capture a serial killer years before who is suddenly being targeted herself. Why, then, did we need to know about her former marriage - replete with flashbacks? Why, then, did there have to be a past romance between her and the cop on the case? Why, then, did there need to be this irritating professor at the college she's hired to teach ethics in journalism at who adds nothing to the story and offers perhaps the worst performance of a bunch of bad performances? Why, then, did she even need to have a son? And - my pet peeve - why did this Canadian movie have to pretend to be an American movie by placing itself in Cambridge, Massachussetts? (I mean, Kate could just as easily have left Toronto to teach in Peterborough.) On behalf of all Canadians, I apologize to the people of Cambridge for setting such a dreadful movie in your city. Those who put out this movie should now apologize to us all. 1/10","user":"sddavis63","rank":[14,21]},{"title":"Warning signs of a bad movie","rating":1,"date":"11 March 2015","review":"I just had a good laugh at sddavis63's review about wishing he had a second chance to get the last 1 1/2 hours of his life back after watching this. How true! It's funny how a bad movie has warning signs right from the get go and in this case, it was literally a sign in the form of a highway sign. I won't go into the details about the movie because they really don't matter, it's so poorly made that the details don't even matter.<br><br>The bottom line is there's this kid in a Canadian movie that's trying to pretend it's filmed in America, and as he's heading towards Boston, there's a highway sign which reads, Cambridge XXX miles and Boston XXX miles, (I'm surprised they didn't goof up and make the sign in kilometers). But the fatal flaw is you can tell the sign isn't real! The fonts are too small and it just clearly looks fake. It reminded me of when Wylie Coyote would see the Road Runner coming and he'd make a fake sign that said 'detour' and would be waiting at the top of a ravine with a giant bolder. <br><br>So that's all you need to know, the sign says it all. From there on in it's 1 and a 1/2 hour downhill boulder into a ravine.","user":"Sean_Biggins","rank":[2,2]},{"title":"Moderately entertaining","rating":6,"date":"3 January 2017","review":"A reporter who made an error of judgement finds it coming back to haunt her a couple of years later. <br><br>This is a made for TV movie so you are aware from the time you put it on that it's not going to win many awards. The story is a bit confusing at times and very generic but it is held together by a decent performance from Melissa George as the ex reporter. The rest of the performances are less impressive and this does hamper proceedings at times. <br><br>For all it's faults it does at least build up a nice air of mystery but unfortunately the end reveal is a bit disappointing <br><br>Whilst this isn't a great film, I did find it somewhat entertaining and it did at least hold my interest. As long as your expectations are low then this is an easy enough watch.","user":"MattyGibbs","rank":[2,3]}]