[{"title":"Dumbed down from a highly intelligent and thoughtful franchise.","rating":1,"date":"17 May 2013","review":"Star Trek Into Darkness should be renamed Star Trek In Name Only. What has always distinguished Star Trek from other sci-fi is the thoughtful and nuanced way that philosophical and sociological commentary was woven into the stories. Star Trek is not just a lot of sci-fi nonsense but a meaningful exploration of what it means to be human. In the past, Star Trek has been intelligent and character driven. Now it is all fancy CGI and snappy one-liners. Abram's Star Trek is an action-for-action's sake Kirk and Spock buddy flick. The \"surprises\" Abrams plants aren't surprises if you're familiar with the Star Trek universe. His preference for violence and political intrigue makes Abrams' vision more Star Wars than Star Trek.<br><br>The fill-in-the-blanks plot is a repetitive onslaught of video-game like CGI sequences separated by brief breaks used to set up the next CGI spectacle. The first half begins with a scene taken from Raiders of the Lost Ark and quickly moves to The Return of the King's Mount Doom. Cumberbatch's attack on Starfleet HQ is a scene stolen from Godfather 3. When Cumberbatch is captured, he and Pine briefly become caricatures of Hannibal Lecter and Agent Starling from Silence of the Lambs. The second half attempts to remake The Wrath of Khan but is backwards and upside down. Instead it is practically a beat-for-beat repeat of the identically plotted Star Trek Nemesis.<br><br>The cast was the best thing about the last movie but not this time. The other familiar crew members each get a brief moment in the spotlight but for the most part they fixate on comedic asides. The romance between Uhura and Spock is unnecessary and actually diminishes Uhura's character. Alice Eve is little more than eye candy. Peter Weller's Admiral Marcus is a disappointment. Karl Urban was eerily good as McCoy last time but stays in the background this time, a third wheel on the Kirk/Spock bicycle. Pine's beefy frat-boy Kirk is an exaggeration of Shatner's Kirk. When he is angry he sounds like a bratty child. Cuberbatch's performance is the best thing this time and overshadows everyone else.<br><br>I left the theater thinking that my free passes were over-priced.","user":"cdettlinger","rank":[693,992]},{"title":"We need Star Trek Into DEEPNESS, not darkness.","rating":8,"date":"8 August 2013","review":"We need Star Trek Into DEEPNESS, not darkness.<br><br>In the movie theatre I heard a complaint from an old school Trekkie that the second installment of the Star Trek reboot had too many \"Little Archie and Veronica\" moments.<br><br>This is true and it would be OK if that were just the icing on the cake. The real problem with the movie is that it runs like a typical SciFi action plot inserted under a Star Trek banner.<br><br>This movie is missing the hallmark epiphany moments Star Trek is famous for. Mainly, it is missing the philosophical \"WOW\" factors that don't just blow your mind but rather expands it, making you realise that everything you thought you knew is wrong and that everything you thought the Federation had figured out is also wrong. These expansions used to pave the way for the audience to mentally and emotionally take that next step to, \"Boldly go where no man has gone before...\" <br><br>This movie has no epiphany. Where is the deepness that Star Trek is synonymous with? This movie gives us what? A federation struggling with internal corruption and terrorism, a la the typical disgruntled ex employee, who in this case was cryogenics frozen for 300 years, as is the plot. Big deal. These are familiar themes we've all seen in movies before. Just trade the Federation for any corrupt financial, medical, educational, government and or religious institution. Trade the \"John Harrison\" character for any Bond villain and you have a movie that sounds like a bunch of other movies or what the news broadcasts. Boring.<br><br>To me the Federation meant a time in the future when Humanity had finally gotten its act together and to a certain extent had rooted out all this corruption and terrorism. Unless a Klingon or Romulan shows up, things are supposed to be refreshingly illuminating. Not something that degrades into ordinary, mainstream, average caveman fist fight showdowns. <br><br>How can we boldly go where no man has gone before in the future unless we have thrown off the shackles of the past? What a sad/shamey day it is when a Star Trek movie presents a not so optimistic future just as dark as today's headlines. I can read/watch the news/The Matrix if I want that. IS THERE NO ESCAPE?!!! IS THERE NO HOPE?!!! <br><br>Obviously, Gene Roddenberry's spirit could not find a way to keep the franchise on track. Will, (Vulcan fingers crossed) Trekkies and non-Trekkies alike know the difference between the wealth of deepness and the poverty of darkness?","user":"dillydrop","rank":[318,447]},{"title":"Garbage","rating":1,"date":"18 May 2013","review":"JJ, you really are destroying a large piece of scifi history.<br><br>Star Trek was never an action based show/movie. It was always a story that had supporting action elements. This movie is completely devoid of any cohesive story and is an action junkies dream come true.<br><br>Kirk in the original series was confident, capable, intelligent, suave, etc.... The new and improved JJ version of the character is a moron. Don't get me wrong, I really like the choice of actor, but the character portrayal which is dictated by the writers and directors is everything the original Kirk was not.<br><br>Space ships crush under pressure....its physics dumba**es...the Enterprise is not a submarine. <br><br>I could go on and on, but I find it all a bit depressing. Star Trek is after all just a piece of fiction. ...now lost to time to only be remembered by a new generation as bad fiction.","user":"robertjastrow","rank":[177,251]}]