[{"title":"What's wrong with you?","rating":7,"date":"26 August 2011","review":"Greetings again from the darkness. This one has been on my radar since the Sundance Festival and all the raves about Elizabeth Olsen's performance. After attending a screening last evening, I find myself at a loss to adequately describe not just her stunning turn, but also this unusual film from writer/director Sean Durkin.<br><br>On the surface, this sounds like just another movie peeking inside a creepy cult that brainwashes, and psychologically and physically abuses women, and is led by a charismatic (and creepy) religious style figure-head. There are many similarities to the Manson-family story of which much has been published, but Mr. Durkin takes the film in a much different and very creative direction by concentrating on what happens to Martha (Olsen) after she escapes the cult.<br><br>In the Q&amp;A, Durkin states he did much research and found the most fascinating story to be that of a cult escapee and what she went through during her first three weeks of freedom. Martha sneaks out early one morning and places a panic call to her older sister, whom she hasn't communicated with in two years. Settling in to the lake house with big sis and new brother-in-law, it becomes quite obvious that Martha doesn't know how to fit in society and has absolutely no interest in discussing her recent past.<br><br>The sister is played very well by Sarah Paulson, and her husband is Hugh Dancy (so very good in Adam). This seemingly normal yuppie couple is trying to do right by Martha, but the fits of paranoia, outbursts of anger, and societal goofs are just too much for them.<br><br>The genius of this film is in the story telling. The cinematic toggling between today and moments of time at the cult farm house leads the viewer right into the confused mind of Martha. We don't get much back story but it's obvious she was \"ripe\" for cult world when she was chosen. We see how Patrick, the quietly charismatic leader, sings her a song and steals her heart ... she wants so much to belong. We also see how she bonds with the other women at the farm house, and ends up in a situation that seems to snap her out just enough so she finds the strength to leave. The editing of scenes between these two worlds in outstanding and serve to keep the viewer glued to the screen.<br><br>Last year I raved about an independent film called Winter's Bone. I chose it as one of the year's best and it ended with some industry award recognition. I am not willing to say this film is quite at that level, but I will say that the younger sister of the Olsen twins, Elizabeth, delivers an incredible first feature film performance and Sean Durkin deserves an audience for his first feature film as writer/director. Another bond between the two indies is that John Hawkes plays the cult leader Patrick, and Hawkes was a standout in Winter's Bone.<br><br>There will undoubtedly be some debate about whether this is cutting edge independent filmmaking or just another snooty art-house mind-messer. All I can say is, I hope the film grabs enough audience for the debate to matter ... it deserves it.","user":"ferguson-6","rank":[149,194]},{"title":"Character development is not one of the film's strong points","rating":8,"date":"6 November 2011","review":"In first time director Sean Durkin's Martha Marcy May Marlene, Martha (Elizabeth Olsen), a young woman in her early twenties joins a commune in a wooded area in upstate New York and endures psychological and sexual abuse at the hands of charismatic leader Patrick (John Hawkes). Patrick is a Charles Manson look-alike, who calls Martha \"Marcy May\" (all women must use the name \"Marlene\" when answering the phone). Nothing is said about the reason the commune exists or what its philosophy may be, other than Patrick's misinterpretation of the Buddhist word \"Nirvana\", and his remark that death is but a continuation, not an end. We are not told the circumstances that led Martha to join the group, but we do know that her parents are deceased, and that her relationship with her older sister Lucy (Sarah Paulson) has been strained.<br><br>In the commune, women's role is subservient. They work in the garden and prepare the food but are allowed to eat only after the men are finished. They have no beds but sleep on mattresses on the floor in the same room. Their initiation is to be given drugs and brought to Patrick's room for sex. Apparently, the house has many babies but it is unclear who takes care of them. Although it is possible, even probable, that fringe groups such as these do exist, and that the director may have personal knowledge of them, the members of the commune, as depicted in the film, seem little more than dehumanized caricatures of how some think \"free-love hippies,\" should look and act.<br><br>Without explanation, Martha suddenly leaves the commune and escapes into the surrounding woods, reaching town, though followed by Patrick's assistant Watts (Brady Corbet). Strangely, she goes to a restaurant in open view and, even more puzzling, Watts makes no attempt to restrain her and bring her back to the commune, odd behavior for a cult that doesn't hesitate to resort to murder. Somehow, Martha finds the inner resources to call her sister who brings her to their upscale lake house where she and her husband Ted (Hugh Dancy) live. <br><br>It is clear almost immediately that Martha is having trouble reconnecting with society, but she is apparently too traumatized to communicate with Lucy or Ted about her present emotions, recent past, or plans for the future. <br><br>The film continues on parallel tracks, flashing back to scenes from the commune and her life with her sister. The reason she left the commune becomes clearer when a flashback depicts a home invasion in which an innocent man is murdered. Martha's behavior at Lucy's home is unconventional, to say the least. She swims in the nude and inappropriately climbs into bed with Lucy and Ted when they are making love. She fears that she is being tracked down by cult members, but it is not clear whether this is real or imagined. Martha's trajectory continues downward, but no one seems to be able to get a handle on the situation.<br><br>There is no intervention by the family when it is clearly required, no growth or adjustment on Martha's part, and not a single moment of sunlight lightening the film's dark mood. There is also no evidence that her sister or her husband have the empathy to create a space safe enough for her to communicate. In a home seemingly shut off from the outside world with no television or Internet to be seen, and no thought of contacting a counselor or psychologist, all Lucy and Ted can do is to shout repeatedly, \"What's wrong with you?\" \"There's something wrong with her,\" until it becomes risible. Ultimately, Ted and Lucy decide to act but it may be too late. In an ambiguous ending, Martha's fate is left open for the viewer to interpret.<br><br>Although the performances by Elizabeth Olsen and John Hawkes are outstanding, character development is not one of the film's strong points. Though it is billed as a psychological character study, Durkin does not provide enough insight into Martha's character, philosophy, or motives for us to identify with or care about what her fate may be. Martha Marcy May Marlene is a psychological thriller that is beautifully performed and, at times, gripping, but ultimately does not seem to have much point other than to tell us that destructive cults are welldestructive, that they mess with your mind, and that failure to talk about them afterwards can mess up your head even worse.","user":"howard.schumann","rank":[76,115]},{"title":"Martha Marcy Maggie Mae","rating":2,"date":"11 July 2012","review":"Woman escapes from cult and fears reprisals from remaining cult members. There's your premise. So many endless, exciting possibilities for what a writer could do with such a premise, and yet what we are presented with is this: Martha Marcy May Marlene, which may as well have been called \"Oh my god, you're not middle class anymore\".<br><br>First of all, this is not a psychological thriller as has been described. It's not even really a drama. It's 2 hours of watching three people (one of whom has recently been through the interesting experience of joining, participating in, and escaping from a cult, but you never really get enough info about that to satisfy your intrigue) eat, drink, sleep, cook, clean, and make small talk, interspersed with the main character - Martha - displaying signs of being \"deeply disturbed\". But, with the exception of kicking her brother-in-law halfway down a flight of stairs, most of this supposedly outrageous behaviour is actually quite subtle etiquette-based faux pas that do not exactly make for an engaging cinematic experience.<br><br>As for the cult, you never find out what they're about, what they believe in, or what their purpose is. Occasionally, you'll get a little snippet of some half-baked philosophical belief, but not enough to build up any sort of idea of what they stand for. It's painfully obvious that the writer has put hardly any thought whatsoever into the background of the most important feature of the entire film.<br><br>On the plus side, the acting is OK, and the scenes are well-filmed. Big deal, not much of a consolation when you've just wasted 2 hours watching the cinematic equivalent of waiting for a kettle to boil, only to discover that you've forgotten to switch the plug socket on.<br><br>Oh and another thing I hated is that it's one of these films where you have to keep adjusting the volume because every so often there will be a scene where the actors mumble inaudibly for a little while, followed by a scene which is then way too loud in comparison. So also not a good movie if you like to watch films in bed and/or when someone is sleeping in the room next door.","user":"spiral5441","rank":[34,49]}]