[{"title":"Dark, But Highly Entertaining Christmas Film","rating":8,"date":"20 September 2010","review":"I just recently caught a screening of Rare Exports: A Christmas Tale and I was definitely not disappointed. My expectations were relatively high after having seen the two short films previously released in this series, and while this version did stray somewhat from the concepts shown in the short films, it did stay true to the overall feel of the previous incarnations.<br><br>Although this film was not particularly deep or thought provoking it was very fun to watch and highly enjoyable. Somewhat creepy in places, this was mainly played up for humorous effect and overall the film displayed a dark sense of humor quite different from any Christmas movie that I have ever seen.<br><br>I would highly recommend this film to fans of the original short films or anyone looking for something a little bit different around the holiday season!","user":"AFleet","rank":[109,126]},{"title":"what a wonderful surprise","rating":9,"date":"31 October 2010","review":"I saw this the other day at the London Film Festival and went in with no expectations, not having seen the short films it was based on. It was a fantastic surprise and i would put it right up there, if not in number one position, as the best film festival films i have ever seen. The pace and storyline were top notch and although some of the characters were a bit weak in substance and originality it took nothing away from my enjoyment of the film. This is one i would highly recommend to any film fan except those under 13. Indeed it is one i would be proud to recommend as it has a dark and dry sense of humour and an original twist on the Christmas tale. I will buy the DVD and happily see it again; I rarely say those words these days.","user":"kingbrutus","rank":[120,141]},{"title":"A superb Anti-Christmas horror fable which adults and over 13 year old will enjoy","rating":8,"date":"28 November 2010","review":"Just seen this at a Preview Screening in London.<br><br>This was an excellent little Christmas horror film but good enough for older kids above 13 to watch. Its not gory as this is one of those less is more type of films but it is quite creepy. Bizarelly, there is quite a bit of male nudity but its in such a way that you should think nothing of it. It wasn't a big deal to the on screen characters and I suspect somehow that the film makers are not expecting it to be a big deal with us either. But there were a few people in my audience who chuckled loudly and as for me, I did so, quietly, and fleetingly wanting to just watch the film unravel its mysteries.<br><br>The child antagonist was absolutely superb playing the typical \"why won't the grown ups listen to me\" role. How he eventually grabs their attention will have you cheering like hell. The story is well paced and creepy. With a couple of good twists and a sprinkle of humour thrown in the mix.<br><br>The soundtrack was pretty bombastic (reminiscent of Michael Giacchino \"Roar\" track from Cloverfield) which was great but perhaps a little too over used when a bit more subtlety was needed in certain moments of the film.<br><br>This film reminds me of my favourite old dark fable movies with child protagonists such as Night of the Hunter, Something Wicked This Way Comes, and Lost Boys. In fact I would sum this up as a Stephen King type horror story for the family.<br><br>The very ending of the film felt rather overly silly though, which is my only criticism but its not enough to knock any marks off my rating.<br><br>This might well turn into a Christmas sleeper hit, if not, perhaps later on, will be a little cult classic","user":"theycallmemrglass","rank":[82,101]}]