[{"title":"Better Than Expected","rating":6,"date":"6 April 2013","review":"When I accessed the reviews for Columbus Circle, I couldn't believe all the negativity surrounding this production. Apparently, after this was made, there was no studio willing to release it theatrically. It went straight to video. I sometimes don't listen to the multitude of reviews that surround a certain film, preferring to make my own opinion. After viewing this, I found it to be a surprisingly good and watchable film with a good story, good acting and good directing. This was an original story which had a good denouement, very satisfying. I suppose that there was not enough sex and violence in this production to serve the prurient tastes of the mass audience. Tastes have changed much in recent years and I guess that there isn't much of an audience for a film that does not rely on CGI effects or gratuitous sex and violence. I even liked the main title sequence, which would not have been out-of-place on a suspense film made in the fifties or sixties. Maybe I'm in the minority here, but I liked this.","user":"earlytalkie","rank":[42,57]},{"title":"Acceptable thriller well written , produced and played by Kevin Pollack","rating":6,"date":"14 May 2012","review":"This interesting suspense movie deals with a young woman named Abigail Clayton (Selma Blair) who lives deeply alone . She is a heiress who's been shut inside her apartment building for nearly two decades is forced to confront her fears after one of her neighbors is killed . The famous daughter of a wealthy industrialist, Abigail disappeared from the prying eyes of the press and the intrusiveness of her family on her 18th birthday, the day she received her massive inheritance. During years of self-imposed isolation, Abigail has had contact with only two people-her building's Concierge, Klandermann, with whom she communicates via notes-and Dr. Raymond Fontaine (Beau Bridges) , a longtime family friend . When there happens the death of her elderly neighbor , Police arrives to begin the investigation and prompts NYPD Homicide Detective Frank Giardello (also producer Giovanni Ribisi was previously in George Gallo's earlier movie Middle Men) and Detective Jerry Eaans (Jason Antoon) to launch an investigation, the Abigail is distressed to find him outside her door, asking to question her. Having tried to acquire the dead woman's now vacant apartment to ensure her privacy, Abigail is further upset when her requests go unanswered, and new tenants Lillian and Charlie move in. Abigail anxiously monitors her new neighbors from the safety of her front door's peephole, but her well-ordered world begins to unravel when she finally encounters Lillian (Amy Smart) and Charlie (First non-comedic film for Jason Lee since The Ballad of Jack and Rose) face-to-face-and her sheltered existence becomes threatened in unexpected and terrifying ways.<br><br>This is a nail-biting and exciting thriller well directed by George Gallo . The film contains suspense , thrills , twits and turns . From start to final the intrigue and thrilling scenes are continuous . This is a picture made among friends , as most of them either play , write or produce such as Giovanni Ribisi , Jason Lee and Kevin Polack . Good performance from Selma Blair as the attractive agoraphobic heiress who has not left her Manhattan loft apartment for almost two decades. All-star-support-cast formed by known actors as Jason Lee , Kevin Pollack , Robert Guillaume and the veteran Beau Bridges as a Doctor and her sole confidant for most of her life . Suspenseful and moving musical score by Brian Tyler . Colorful though sometimes dark cinematography by Anastas Michos . The flick was compellingly written and realized by George Gallo . He is a prestigious writer such as ¨Bad boys I and II ¨ and ¨Midnight run¨ ; being an expert filmmaker on comedy genre as proved in ¨My mom's new boyfriend¨ , Double take¨ , and ¨Trapped in Paradise¨ . His greatest success is ¨The middle man¨ and ¨Colombus Circle¨ results to be his only thriller .","user":"ma-cortes","rank":[29,38]},{"title":"Smart, Clever","rating":8,"date":"3 July 2013","review":"It seems that a lot of users like to bash a movie and talk about how predictable a mystery is, just to show everyone else how smart they are. Talk about what's wrong with the direction even though they don't really know a thing about directing. This is a smart movie with good actors. Some think the villains made illogical and unreasonable choices. Well, most criminals aren't as smart as they think they are and do illogical things when everything starts to unravel. Most criminals aren't smart and don't keep a cool head under pressure. That's why they get caught!<br><br>This is perceived as a movie about an agoraphobic and everyone is incredulous when she leaves her apartment in the climax. Abigail's doctor has told her she's agoraphobic, but he's in on the con and doesn't want her to have any contact with anyone but him. Remember that she chose to disappear for a reason. She had the privacy she wanted so she had no reason to leave her apartment - and her life was purposefully controlled. People choose fight or flight when threatened. When Abigail comes under extreme threat, she chooses both flight (nowhere to run except OUT of her apartment) and fight (for her fortune without which she could not exist).<br><br>The doctor's choice of henchmen seems flawed, but what kind of people are you going to get for something like this? First person I would ask would be an ex-con, which by definition is a loser. Greed can fuzzy your thinking. The closer they got to the money, the less logical they became. They kept thinking \"just one more person out of the way and we'll have enough money to run where no one can find us\".<br><br>Another user spoke of how dumb the police were. They had already zeroed in on Ray owning both apartments. One user said it was not believable that Abigail was leaving without an identity. She had already transferred her money somewhere. She could by her own plane and pilot. She knew how to disappear - she had done it before.<br><br>I really liked the acting by Kevin Pollack and Jason Lee. Ribisi always brings a sense of intelligence and also naiveté to his characters. His partner's character could have added humor or at least something with better lines and actor - Samm Levine would have been great as the partner rather than the bank manager.","user":"eloyal9756","rank":[16,20]}]