[{"title":"Blazes A trail of Blood and Guts. So full of Fiery Passion but fizzles near the end","rating":7,"date":"11 February 2010","review":"How far would you go to save the soul of an innocent loved one? Would you travel to the very depths of hell(or \"the inferno\" as it is referred to in this show) to slay the devil himself? Dante's Inferno, an anime movie adapted from the video game(itself inspired by the classic \"Divine Comedy\" by Dante Alighieri) chronicles the epic journey of the titular troubled Knight, a veteran of the Bloody Christian Crusade, who returns home to find his wife murdered and her soul spirited away by the devil Lucifer. Claiming to have been steadfast in his faith and his love for his wife, Beatrice, Dante travels through the nine levels of Hell, guided by the spirit of Virgil the poet, to challenge all sorts of horrors beyond imagination just to return her to salvation. But perhaps the greatest horror lies within Dante himself and the sins of his past that he so vehemently denies.<br><br>Like most anime adapted from video games, the story is a straight forward tale for which its only purpose is to conveniently propel Dante from one level of Hell to the next. True to the spirit of a video game, each level of Hell has its own blade fodder troops and \"stage boss\". Throughout the linear and somewhat simplistic main story, the more intriguing back-story is fleshed out in flashbacks. It seemed that Lucifer challenged Beatrice to a bet that Dante would never betray her trust or fall into sin while he was away fighting the war. Naturally The pure-hearted Beatrice, so full of faith in her husband, accepted that bet with her soul as the prize. As the show progresses and as Dante gets nearer to his goal, Lucifer delights in utterly shattering Beatrice's faith first in God, then in mankind and ultimately in her husband who's sinful past deeds are stitched to his chest in the form of a blood red cross.<br><br>Animated by 5 animation studios and 6 directors, Dante's Inferno no doubt suffers from some inconsistency. Film roman's work opens the movie and where it lacks in artistic detail, it makes up for it by having the most fluid character movements in the whole film. Designs maintain the simpler contemporary western animation style similar to other Direct-to-Video animated movies like Planet Hulk yet preserves the game's dark gritty setting. Upon entering the level of Limbo, Studio Manglobe(famous for their work on Samurai Champloo) takes over animation with director Shukou Murase (whose works include animation design for Gundam Wing and directing the anime series Ergo Proxy) at the helm. Boasting the most incredible amount of art detail, a nightmarish Gothic feel and great looking character designs, Manglobe's segment is impressive to behold. No small cutesy characters, big kawaii eyes or bright cheery colors that so many Japanese productions suffer from. <br><br>From gritty Gothic the show transits to the amazing animated visuals of Dong Woo Animation (justice League Unlimited, Masters of the Universe 2002) and director Jong Sik-Nam(Batman Gotham Knight: Deadshot). Balancing beautiful artwork with slick animation, a leaner meaner Dante slashes through the levels of \"Lust\", \"Gluttony\" and \"Anger\" which are rendered in a stylish American graphic novel look not unlike 2009's \"Tales of the Black Freighter\" from Warner. Sadly from here on, the animation takes a slow dive in quality.<br><br>JM animation handles the next 2 segments and one thing they can never get right is the mouth movements of characters. The first segment, taking place in the level of \"Violence\", boasts a buff, muscular Dante and a stylized design more suited for a Saturday morning action anime than a dark gritty horror piece. At this point even the story, which started off like a blazing bonfire, starts to sputter and ebb. This is followed by the level of \"Fraud\", supposedly the start of the film's climax. But by now, the story has descended so much into a brainless hack and slash that the ultimate resolution to the climax is a big letdown. Complex and intriguing themes that were hinted upon earlier in the film are discarded in favor of moving the action along. For example, the running theme of repentance and forgiveness is trivialized into a kind of \"magic spell\" that can redeem lost souls by waving a silver cross at them. <br><br>Lastly, Dante's Inferno goes out with a sad fizzle thanks to a sub-par rush job by Production I.G. It boggles the mind how the studio responsible for Ghost in The Shell, Sky Crawlers and other beautifully animated productions could turn up such a thing. The final showdown with Lucifer is an appropriate closure for Dante's spiritual journey but the animation presented is only mediocre, the artwork simplistic and the character designs, laughable. Dante is now a disproportionately wide oaf who looks more fat than muscular and Lucifer himself conjures up memories of some lost Digimon.<br><br>Not many may appreciate the unnecessarily convoluted narrative or the inconsistent visual styles. The characters tend to fall into hero/damsel/villain/hero's guide stereotypes even though the stellar voice cast play their roles with such burning passion. On first viewing, Dante's Inferno may satisfy fans of violent horror anime like Vampire Hunter D Bloodlust or Hellsing. The bloody action never fails to please though the more conservative types may be put off by the religious musings and sexually graphic visuals (that level is not called \"Lust\" for nothing). It might seem like all style over substance at first but if one were to read in between the lines, Dante's Inferno presents a tragic tale of love, loss, faith and redemption; unoriginal themes for sure but themes that anyone can easily relate to.","user":"xamtaro","rank":[29,39]},{"title":"Hell not so hot","rating":6,"date":"5 April 2010","review":"High culture collides with low in this anime, a spin-off from the imminent computer game from EA. Whether or not you take to it will depend on your view of Dante, Japanese animation, and video game tie-ins, as well as more generally on the cross-fertilisation between different cultural artifacts - always a contentious subject. Most of those in the target market for Dante's Inferno: An Animated Epic will not be over-familiar with the original source, but there's no need to climb on any literary high-horses, though general observations are worthwhile. Purists, however, may wish to stay clear of it.<br><br>Dante's original, one of the great epics of world literature, has been the inspiration of much work by writers and artists down the centuries. IMDb lists four or five screen works with the title. Animated versions have been rare, although no doubt there's a comic book version lurking somewhere. Such is the nature of things that this present version appears in a year along with a rival animated production titled more succinctly 'Dante's Inferno' - one shorter in length, but apparently superior to this in its fidelity to the original. The most notable live-action version has always been that of 1935 with Spencer Tracy, an even freer adaptation than the one we have here, in which the horrendous visions are compressed into 10 minutes of a much longer narrative.<br><br>By contrast, the present version spends most of its running time on these elements, depicting at length Dante's journey through the nine circles of hell to reach his beloved Beatrice. Perhaps sensing a need for variety between the titanic battles that this progress involves, Dante's Inferno: An Animated Epic breaks up the hero's progress with several flashbacks, not in the original, during which the true state of affairs and Dante's real moral stature becomes more and more explained.<br><br>The character of Beatrice has been changed as part of this new narrative device, giving her a more dynamic role in the narrative as well as providing the romantic core. Whether or not Dante would have appreciated his ideal love appearing briefly as the bride of Lucifer, or his reflective protagonist-self metamorphosing into an axe-wielding warrior figure more Conan than Christian, one can only conjecture; but a target audience will respond to the changes. Only Dante's guide, the poet Virgil, keeps some of his original quiet dignity.<br><br>Given the EA game standing behind the release, it's no surprise that Dante's Inferno: An Animated Epic has action and a plot structure more reflective of that more commercial source than Dante's leisurely writing. Much of the moral depth and complexity of the book has been jettisoned thereby in favour of arcs of swift movement. The original contained a more sophisticated and extended version of damnation than the mere nine circles of doom rather simplistically imagined here, each becoming just another test for our hero to reach, then duly pass through. The original's spiritual shock and awe has been replaced by a gamer's inevitable level-creep, where it is never really in doubt that Hell is likely to be overcome. It's a considerable reduction of the medieval original's salutary purpose, even if the ending of the film attempts to have it both ways.<br><br>The original Inferno, one part of the three-part Divine Comedy, makes particular use of allegory throughout, in ways an educated medieval reader would be expected to follow. Understandably feeling that allegory is not something that modern audiences will sit through at great length without growing restless, and with the imperatives of a game franchise to support, one imagines Dante's Inferno: An Animated Epic was always going to be obliged to substitute breathless action for contemplation, sketched in typical anime style.<br><br>Suffice to say that the animation on offer here is certainly vivid even if, by comparison to the Shrek-like pictorial quality of the game (a trailer for which is helpfully included as an extra on the disc), the line-drawn work seems dated in style. Some, incidentally, have noticed a lack of continuity in the rendering of Dante's features. At first I thought each of the nine circles cleverly had its own subtle visual identity, but no: it's just because eight studios and directors from America, North Korea and Japan all had input. It's an inconsistency that's a little distracting; one indication perhaps of a rushed production, tied to release dates elsewhere.<br><br>Japanese fantasy anime and manga have a tradition of dealing with the matter of monsters and shadow worlds, often with their own original mythologies and shock tactics - so much so that they sometimes give censors pause for thought. It was one reason why they acquired such a cult following. But there's no tentacle horror intruding here; no stomach-churning changes of form, no real depravity, while the sexual content is reduced to occasional titillation.<br><br>Hell, one would hope, ought to be the most alarming and appalling spectacle of all, an updated warning to all who behold it, a moral imperative to reform, a presentation of the most terrible of terrors. But the horrors of Dante's Inferno: An Animated Epic leave us frankly un-aghast and un-chastened. Whether or not the creators have been constrained by deference to the august original or just the mass-market demands of their sponsors is hard to say; but for a real walk on the dark side you would be better off with something like the now elderly Devil Man (aka: Debiruman) or, most memorably, the notorious Urotsukidôji.","user":"FilmFlaneur","rank":[16,23]},{"title":"Well\"Epic\" isn't the exact word I would use to describe this.","rating":3,"date":"8 April 2012","review":"Based in a video game (Which is also loosely based in \"the Divine Comedy\" by Dante Aliegheri) which I never played in my life, \"Dante's Inferno: An Animated Epic\" it's a deeply flawed production with a very few interesting elements.<br><br>This movie is divided in chapter, each one of them with a different style of animation: However, this is not an anthology film, since it follows in one linear story-line. During the first part of the movie, the animation and the designs keep a good level, but as the story advances, it turns more generic and bland, being not much better than any average anime series.<br><br>The same goes for the plot: The elements from the Divine Comedy from Dante gives this movie some level of interest, sadly, those elements doesn't seem to be very well developed, so the internal conflicts of the main character seem way too shallow or forced. The Beatrice character is just plain and uninteresting in comparison with her literary counterpart, being just a typical damsel in distress. And don 'get me started on Lucifer, which here is just merely a stereotypical villain, not so different to any guy from Naruto or some Saturday morning cartoon.<br><br>Even the spiritual and historical elements that are added in this story just seem superfluous or being put in order to establish some vague connection with the poem in which the game was inspired. In many ways, this is just another story of a hero that must save her love interest; it is just the setting which gives this some sort of interest. To get it worse, this is not even very funny to watch, being way too heavy-handed in order to enjoyable as a simple entertainment, but at the same time, it is way too banal to be considered as a serious work.<br><br>Despite the interesting premise and some few moments of good animation, this film feels just flat and forgettable. It's just neither entertaining nor satisfying enough to be considered something worth watching.","user":"Rectangular_businessman","rank":[9,12]}]