[{"title":"More than just horror","rating":8,"date":"18 June 2011","review":"I checked out the IMDb rating for this before deciding to watch it at the cinema and decided it was worth a trip at 6.8, horror flicks rarely creep above 8 as they are generally poorly acted with little or no depth to the story. Not many scary films keep you gripped but this one hit the spot for me. The acting was generally very good, the sets first class and the story went at a nice steady pace with just the right amount of horror thrown in to keep you on your toes. If you enjoyed The Road you will love this as it makes you think, you find yourself putting yourself in the characters shoes and there are lots of subtle things in the movie where actions not words set the scene. If you are looking for a mindless blood fest or sexy vampires then give this a miss, if however you are looking for a horror film with an actual story and some decent acting then sit back and enjoy.","user":"rjschofield-51-405376","rank":[85,104]},{"title":"A low budget gem","rating":8,"date":"1 June 2011","review":"I saw this movie because I love post-apocalyptic movies. The idea of a world with less human beings meddling with it always looks enticing. Its the same reason why we take vacations in remote locations.<br><br>First thing you will notice about Stake Land is it looks great. I am not much familiar with the cast except Connor Paolo. The actors act naturally which looks great in a film such as this. The plot is simple. It is a story of survivors of a vampire epidemic. But its the execution of the plot which is why this movie is so good. The director knows what he can and cant do. 10 out of 10 for the director's efforts.<br><br>Lastly, I wont say its a different movie than the rest of vampire movies coming out these days. But Stake Land should be watched because it has the ability to suck you in its environment within the first 10 minutes. And trust me it never lets it go.","user":"vsg07","rank":[102,134]},{"title":"Real vampires are back in a another post-apocalyptic road movie","rating":7,"date":"17 June 2011","review":"Synopsis: Orphaned Martin is taken under the wing of bad-ass Mister as they travel across vampire-ravaged America in search of the refuge known as 'New Eden'.<br><br>Aside from the fairly frequent jumps, scares and gore, Stake Land feels surprisingly subdued for a recent horror film. With its melancholic tone, ravaging of the religious right and focus on characters over action, the film succeeds in being a bit more thoughtful than many of its contemporaries. And don't go into this expecting sanitized, pretty-boy vampires a-la-Twilight. These monsters are old school to the core- more like zombies than modern takes on vampires; all ferocious snarls and messed up faces. With fairly few jumps or scenes that are likely to scare a grizzled horror fan, Stake Land is easier to recommend for its realistic world-building, mournful soundtrack and interesting, well-drawn characters.<br><br>Opening with Martin's voice-over as he introduces himself and his traveling companion, the enigmatic father figure and teacher, Mister, the film quickly flashes back to a vicious encounter between Martins family and the horrific vampires. Sticking with most of the rules of the vampire myth, it is soon established that stakes and sunlight are still useful in this tale of vamp vs human conflict. The pace is deliberately slow and the film painstakingly constructs a very authentic feeling vision of post-apocalyptic America. Guarded communities living in fear while supplies dwindle, drinking and sleeping together in packed bars until the sun rises and religious nutjobs taking over the wilderness to rape and murder as they please. It is this rendering of the Christian crazies that strikes the biggest false note in the story, feeling over-blown and too simple for the subtleties of much of the rest of the story and character drawing.<br><br>The cast are great, particularly Nick Damici as Mister who delivers a convincing performance with the familiar role of mean old git with a soft heart underneath. Kelly McGillis is barely recognizable as a constantly victimized nun (bet she must be wondering what happened to the days of getting jiggy with Tom Cruise in a Navy uniform) and the youngsters, especially Connor Paolo are good in their less demanding roles. It's particularly nice to see Danielle Harris still working, even if she has lost some of the spunk of her early appearance as Bruce Willis' daughter way back in The Last Boy Scout.<br><br>Jim Mickle should be applauded for his direction; the film works very well as a whole, with good performances from the cast, a bleak soundtrack and pacing that could have easily been spoiled by trying to appeal to a bigger audience. It is a brave movie; not overly rushed and taking its time to build to its understated climax. The action and horror are handled well and the villain is a right nasty piece of work that should stick in the memory.<br><br>The film is most memorable for its details of life after the vampires take over. The small communities that have popped up round the country feel realistic and lived in. A sense of community, of something we have lost to some extent in 2011 shines through and gives the film a nostalgic feel, as if the vampire apocalypse may help America return to a simpler, more caring time. The positioning of the cult of Christian crazies dropping 'bombs' on peaceful communities and their obsession with deliverance and the 'will of God' is the least subtle and most forceful of themes on display and does feel a little OTT in places but the journey of the characters and their encounters with ordinary folk ground the film and make up for its excesses in other areas.<br><br>Stake Land is a very well made film and can be enjoyed as a simple horror film but also as an experience of a post-apocalyptic society and the highs and lows of living in a world with a drastically reduce population.","user":"pturner1010","rank":[97,128]}]