[{"title":"Dirty, funny, sexy, violent and unabashedly romantic: Deadpool has arrived!","rating":12,"date":"12 February 2016","review":"I really, really liked Deadpool. And you know what? I didn't expect to. Seriously, I was never a fan of the character (in the sense that I hardly knew anything about him) and the humor as well as the violence seemed forced and overdone in the trailers. Still, I remained interested in the film, I just never expected it to actually be good - until the reviews arrived. After most critics unexpectedly showered this newest superhero movie with praise, I went in cautiously optimistic (but still fully prepared to hate the film).<br><br>The first thing I noticed was how inventive the storytelling is. The film throws you into the action from the first moment (literally: the very first moment) and then it goes back and forth in brilliant and unexpected ways to slowly unspool the story of this insane - but oddly charming - antihero. Flashbacks and fast-forwards can be annoying as hell, but when done right, they can help render even a somewhat simple story fresh and exciting. And that's exactly how Deadpool felt to me right from the start: like a fresh (if somewhat dirty) jolt of energy.<br><br>The action itself is beautifully designed, employing playful visuals and using pretty much every camera technique available; it never feels repetitive and the pacing is close to perfection. But, and that was probably the key to me liking the film so much, there's a beating heart underneath all the action and carnage, and that has a lot to do with how brilliantly Ryan Reynolds portrays the character and the great chemistry he has with co-star Morena Baccarin. What came as a complete surprise to me was how unabashedly romantic Deadpool is. The love story in this film is probably the most sincere I've ever seen in a superhero movie and it gives the film the strong emotional core which so many of these movies lack.<br><br>The humor, which I initially feared would just be non-stop juvenile wisecracks and soon become distracting, also works surprisingly well. Not every line or every joke lands - but that's the beauty of this character: they don't really need to. Deadpool can't help himself; as long as he's able to breathe he'll crack wise and make fun of himself and those around him. It's a clinical condition; he's not a stand-up comedian whose jokes need to land: he's a madman (albeit a very entertaining one) and the comedy in his case is born out of tragedy.<br><br>Despite all my praise, it's not a perfect film. The villain in this revenge tale could be more memorable and the story itself is a bit too derivative to really do its highly unconventional protagonist (he insists he's not a hero) justice: but it's a damn good first entry in a franchise that will hopefully explore the character and his world to a much larger extent in the sequel(s). And it's actually a very important film for another reason. If Deadpool is a financial success - which at this point is already clear it will be - this could play a vital role in how studios henceforth view the financial prospects of R-rated superhero films, and we'll hopefully see more of them in the future.<br><br>Many people might feel different - and I respect their opinion - but I've grown tired of the entirely bloodless CGI overkill in all those 200 million productions where even the most terrible villains talk like Mormon schoolgirls. I mean: there's a gigantic audience out there that is over the age of 18, loves to read comic books and can absolutely handle real-world language, real-world sex and real-world violence in superhero movies. This genre is so diverse; it's ridiculous to believe just because comic books have pictures in them all film adaptations - regardless of the material - must automatically be made for kids in order to be successful.<br><br>As it is, I think Deadpool - a dirty, funny, sexy and violent film which is decidedly NOT for kids - just proved my point perfectly. 8 stars out of 10.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[814,1]},{"title":"Great movie, funny, good story, a must see","rating":9,"date":"23 February 2020","review":"Before Logan, this was my favorite non-MCU marvel movie. The humor lands every single time thanks to Ryan Reynolds' charismatic and hysterical performance. The action was really well-helmed, which i think benefits from the fact that none of it is censored (disney if u make DP3 don't censor it). It also does a great job fleshing out Wade Wilson's character, instead of making him a service-level comedian; they showed us his prior life and love life, and it was executed very well. Overall, this is a badass and hilarious x-men film, and a really damn good time.","user":"MR_Heraclius","rank":[39,56]},{"title":"This is what it looks like when filmmakers take risks","rating":8,"date":"15 February 2016","review":"Deadpool is a triumph of artistic vision over studio interference. Little credit should be given to 20th Century Fox, as they had zero faith in the success of a Deadpool movie. To put things into perspective, Ryan Reynolds fought for this film back in 2004 when Blade: Trinity was released. Reynolds and co. went to shoot test footage that was then leaked online by Reynolds because Fox had no intentions to release it to the public. Finally, after years and years of BEGGING to the studio and the overwhelming positive responses of the test footage from the public, Fox didn't even tell Reynolds and co. that the film was greenlit. They had to find out online like the rest of us plebeians. If that sounds bad, Fox even cut their budget by $7 million AT THE LAST MINUTE, which caused the writers to scratch some action sequences that I'm sure would've been great to see.<br><br>Deadpool now has the biggest opening weekend in the month of February (surpassing Fifty Shades of Grey), the biggest opening weekend for 20th Century Fox (surpassing all the X-Men films), and the biggest opening weekend for an R rated film EVER (surpassing The Matrix: Reloaded). With all that being said, Deadpool is a hilariously entertaining film that works mainly because of Reynolds himself. His comedic skills pay off gloriously as the titular character, who gives so many quips in one instance that some jokes will be missed. Of course, credit should be given to the writers too (AKA: The Real Heroes Here), and it's impressive that this is Tim Miller's directorial debut. The action sequences and pacing are so good that you'd think this came from a veteran director.<br><br>From the ingenious opening credits to the subversive ending, Deadpool constantly upends clichés and tropes you're used to seeing in superhero flicks in the past few years. What's great here is the filmmakers had something weird and perverse and just went with it. Jokes about pedophilia, pegging, and sex run rampant, but it's never really dark, despite the mature subject matter. On top of that, it's also very refreshing to see a pansexual superhero in such a big studio film. It's unheard of these days. Fox and other studios, learn from this success. It's not the fact that a hard R-rated film can do well, it's that Deadpool also happens to be very good, most likely because you, Fox, actually gave the filmmakers the creative freedom to do whatever the hell they wanted.","user":"moviewizguy","rank":[609,1]}]