[{"title":"Another brilliant genre masterpiece from Takashi Miike","rating":9,"date":"2 May 2011","review":"Takashi Miike is arguably one of Japan's hardest working directors who has tackled several different genres, generally with good results. It used to be he would do a dozen or so projects a year, and more in his earlier days. This, of course, has diminished in place of bigger projects, but the man still remains one of Japan's most well known and prolific directors. So, it shouldn't surprise anyone that his undertaking of yet another new genre, the samurai epic, is something of a highly anticipated film. And yes, it succeeds in being another brilliant masterpiece from the man.<br><br>13 Assassins, though full of characters, is quite simple actually. A master Shogun samurai is charged with the killing of a cruel and masochistic Shogun lord before he can become more influential in the Japanese Shogunate. With this mission, he gathers together 13 samurai to join him in what appears to be a mostly suicidal mission as they take on a small army of soldiers. For years I have argued that Miike is a master filmmaker that doesn't get nearly the kind of recognition he deserves, as his experience and resume put him up with the likes of other classic filmmakers. This shows in Assassins as he brilliantly puts together this simple, yet purposeful film that calls back to the era of epic samurai films of the likes of Akira Kurosawa. In fact, the influence of Seven Samurai is quite apparent here, even going so far as to model some similar characters. However, do not be mistaken, as this is very much a Miike film, a combination of his abilities to craft a mainstream film and a cult hit. <br><br>And the trademarks are certainly there, with the sadistic young Shogun lord bearing the bizarre violent fetishes that have been displayed in Miike's more obscure works, namely Ichi the Killer. As you might suspect, the violence early on is shocking, effective, and often unexpected. This gives way later on to more stylish violence, but none the less, the film is incredibly violent, worthy of a hard R rating by American standards. Miike fans should be very pleased as he both employs his skills as a filmmaker while at the same time adhering to the general guidelines of making a samurai film. Here, he delves greatly into the genre, showing what it means to be a samurai and questioning their purpose through multiple views. Our master samurai, Shinzaemon, sees samurai as being for the people, while Hanbei, his rival, sees them as entirely in servitude to their master without question. Even the young lord, Shinzaemon's target, has a view, thought it is certainly the most negative of any of them.<br><br>If I have any complaints, it's two. First, the film does little exposition of the large cast and most of the assassins are simply there to be a fighting force. We learn very little about most of them, and even the samurai we do learn about, including Shinzaemon, get little exposition besides what we already expect, that he's a great samurai of justice. The second would be the clunking over the head about samurai ideals. Miike continues to push messages we've already acquired early in the film and it becomes slightly redundant by the end. However, these are minor complaints that are mostly easily ignored as the film runs at a fast pace with a 45 minute battle that is one of the best samurai battles I've seen on film, comparing to Azumi or Zatoichi's finale, but arguably handled better and with a master's touch.<br><br>It's hard to know if this is Miike's pinnacle. He certainly creates a modern samurai masterpiece of an epic here. One particularly powerful scene will remain with you for a long time, and this is the power of Miike's film, one that goes to places many are afraid to tread to leave a lasting impression. Violent, entertaining, and with good examination of the samurai and their duties, fans of Miike's previous films and fans of the samurai epic will not be disappointed.","user":"cadillac20","rank":[79,100]},{"title":"Thundering Shogun!","rating":9,"date":"4 October 2010","review":"This film was a dark-edged delight from beginning to end when I saw it at the 2010 edition of TIFF. The audience there loved it too, breaking out into spontaneous applause during several scenes.<br><br>Solid direction by Miike, great characters, beautifully shot and simply some of the best and most intense action sequences put on film - ever! It does have it's obvious influences, such as Kurosawa's \"Seven Samurai\", but damn, this one kicks ass mightily! You've never seen Shogun like this! And something else to point out: the sound on this film was thundering, shaking and stellar! THIS is the kind of film that reminds us why we go to a movie theatre to enjoy a film on a big screen, why we turn off our cell phones and immerse ourselves in the experience of cinema-going, as opposed to staying home on our couches.<br><br>I'll go see it again on the big screen when it hopefully returns to town - you can bet on that!","user":"armandcbris","rank":[127,167]},{"title":"A Future Classic by Takashi Miike","rating":9,"date":"24 October 2012","review":"In 1844, the peace of the Feudal Japan is threatened by the cruel Lord Naritsugu Matsudaira (Gorô Inagaki) that is politically rising and getting closer to his half-brother, the shogun. After the harakiri of Namiya clan leader, the samurai Shinzaemon Shimada (Kôji Yakusho) is summoned by the shogun's adviser Sir Doi (Mikijiro Hira) of the Akash Clan to listen to the tragedy of Makino Uneme ((Takumi Saitô), whose son and daughter-in-law have been murdered by Naritsugu. Then Sir Doi shows a woman with arms, legs and tongue severed by Naritsugu and she writes with her forearm a request to Shinza to slaughter Naritsugu and his samurais.<br><br>Shinza promises to kill Naritsugu and he gathers eleven other samurais and plots a plan to attack Naritsugu in his trip back to the Akash land. But the cunning samurai Hanbei Kitou (Masachika Ichimura) that is responsible for the security of his master foresees Shinza's intent. Shinza decides to go with his samurais through the mountain, where they find the hunter Koyata (Yûsuke Iseya) that guides them off the mountain and joins the group. Now the thirteen men prepare an ambush to Naritsugu and his army of two hundred samurais in a suicide mission to stop evil. <br><br>\"Jûsan-nin no shikaku\", a.k.a, \"13 Assassins\", is a future classic of the samurai genre by Takashi Miike. It is inevitable to compare this film with Akira Kurosawa's \"Seven Samurais\" and the epic \"The 300 Spartans\", but \"13 Assassins\" is among the best samurais movies I have ever seen, with a solid story in the Edo period of Japan, stunning cinematography, wonderful performances and fantastic choreography in the battle scenes. My vote is nine. <br><br>Title (Brazil): \"13 Assassinos\" (\"13 Assassins\")","user":"claudio_carvalho","rank":[33,40]}]