[{"title":"Not for those who want an easy time","rating":7,"date":"5 October 2010","review":"If you are familiar with Puiu's previous film, Death of Mr. Lazarescu, you will be well-prepared for the slow pace that draws attention to the nonchalant, almost cold and disconnected sensibility of the ex-Eastern Bloc. What you will find extremely different in Aurora is the lack of words in many long scenes. Conversations are sparse, accentuated with grunts or untranslatable sounds. The main character seems to walk around like a ghost, one that everyone can see and can, if they were so inclined, interact with, but also one that nobody seems too interested in or concerned with. Of course, we know that there must be a reason why we are following this seemingly aimless character, and we are peeved at the very beginning by his paranoid over-the-shoulder glances and slow scenes where he seems to be watching a family. About an hour into the film, we know he is up to no good, though still nothing really is explained. We do not really know who most of the people are in his life, and why he is doing what he is doing. The violence also remains unexplained. In the last half hour of the film his actions are finally explained. This time the indifference and Soviet sensibility, the lack of intelligent conversation, the attitudes of the resigned members of the bureaucratic wheel all help to create a highly absurd and funny \"confession\" scene. Without the last scene, the film would get a 5 from me. It gets a 7 for capturing the sensibility of a whole people, a whole way of reacting to life, so perfectly. It also manages to unravel the complexity of adult lives without ever explaining anything. It would have gotten an 8 or 9, if it was edited tighter, especially the first 2 hours. It was great that things were not explained, but the slow pace could have been helped a bit without losing from meaning.","user":"cguldal","rank":[47,58]},{"title":"There's a land called 'Passiva Aggressiva' and Cristi Puiu is its king","rating":8,"date":"22 January 2012","review":"http://slnks.com/0xz<br><br>preview: But seriously, 'Aurora' has been the first movie I watched this year, a story set in gloomy, contemporary Bucharest – a slice of life, if you may call it that way – where a divorced man follows his ex-wife through town with the not - so - obvious intention of killing her. The movie is long – three hours long – and as some interesting critics who haven't even had the decency to watch an entire movie before reviewing it say – pretty boring. But instead of boring I would like to call it slow paced, aerated, leaving just enough room for the characters to develop and for the viewer to get accustomed to their lifestyle. I think it was actually polite – yes, I'll use this word – that the director took the time he thought he needed in describing the characters (mostly the main character, played by the director himself) and the situations created by the relationships the characters are in.","user":"andreea-gintaru","rank":[35,49]},{"title":"heavy, but refined movie","rating":27,"date":"27 July 2011","review":"Heavy movie, especially watching it now, after the Norwegian massacre.. But definitely worth seeing, makes you think about all those annoying people in your life that you wished you'd never come across (or dead). His character goes a bit further than that.. actually takes the gun and shoots them. And somehow you empathise with him, you find those people around him terribly vulgar and intrusive, shameless. It's strange how lonely the character is in his sense of respect and dignity (\"bun simt\" in Romanian) - but to anyone who has been in an absurd Romanian situation - police, administration, school, hospital - knows how lonely you can feel when nobody else except you realises or cares about how ridiculous that situation is.. Chapeau bas for Puiu stepping in those shoes and playing the main part. I would have given him a 10 - definitely for the script and acting - but found the camera work a little disappointing, a lot of shaking and bad shots. Also found the naked shower scene completely unnecessary.","user":"v_pop","rank":[28,40]}]