[{"title":"Won no Oscars, but won my heart!","rating":10,"date":"21 October 2012","review":"This film, although simple in premise is beautifully told, and superbly acted. Jae-Yeong Jeong has now become one of my favorite actors on the strength of this film. His range is incredible, and is deserved of an Oscar (Hollywood, take note). This film is incredibly easy to watch and entertaining. It will make you laugh out loud, and will also pull on those heartstrings. The comparisons to Tom Hank's Castaway is inevitable, but like other reviewers have said, it's way more than what Castaway had to offer. It's a real gem of a movie and is highly recommended.<br><br>Bravo to all involved making this movie!","user":"shimuzu","rank":[44,46]},{"title":"Beautiful Fable, True at its Core","rating":10,"date":"18 December 2011","review":"I can't believe I hadn't heard of this movie until it showed up in my Netflix recommendations. Why isn't everyone talking about this movie? Why didn't it win best foreign picture? Why... Oh, right. No car chases. No sex scenes. No scenes in bars, or at football games. Subtitles. If you can enjoy a movie with subtitles, if you don't think someone has to look or act just like you to be comprehensible as a human being, if you've ever read a poem and loved it, you will likely love this movie. <br><br>I'm not even going to talk about the plot. The plot is wonderful, but not really the point. This is a movie about isolation, and human connections, and what makes us human at all. It is a social commentary, and a beautifully told fable. To call it a romantic comedy, to compare it to an American movie with a similar title, is to miss the point entirely.<br><br>Warning: before you watch this movie, you'd better figure out where you can find a local source for black bean noodles ('jajangmyun' in Korean). Even if you've never tasted them, you'll be craving them by the end of the movie. I have tasted them - fresh from a street vendor in Seoul - and I'm now nearly wild for black bean noodles.<br><br>And this basic hunger for a simple comfort food - for enjoyment of sustenance with all the associations that come with true comfort food - sums up the movie nicely.","user":"berghwithanh","rank":[49,54]},{"title":"Very well done movie, fully recommend.","rating":9,"date":"14 September 2009","review":"This movie could be classified as a \"romantic comedy\", if that term wouldn't be associated with so many cheap, artificial and silly movies. \"Castay on the Moon\", while both funny and romantic (and sometimes very sad), is amazingly well done, with an fine balance between its elements. <br><br>The plot is solid, the images and camera work are top notch, and the story, containing some rather delicate situations and characters, is very sensibly and honestly and told. <br><br>I have not found any weakness with this movie, no part that i would have done differently, or where i felt that the characters did something just for the sake of the plot. They are very real people, sometimes confused, sometimes weak, and they make no apology for it, do not try to explain themselves. Both main (only) characters are some of the most interesting, real people i have seen on a screen. <br><br>I fully recommend it, and i believe it is a good example that any genre (even one that combines romantic and comedy situations together) has amazing achievements. <br><br>SPOILER!!!\\/<br><br>Watch for the scene with the guy making fire, the whole theatre laughed for 20 seconds straight. It is brilliant.","user":"victor-ragusila","rank":[65,74]}]