[{"title":"Damn good vampire fun.....","rating":7,"date":"21 August 2011","review":"Can a horror remake actually be a good for a change? I mean, how many classic horror flicks does Hollywood have to crap on until they finally give up? \"Texas Chainsaw Massacre\", \"Amityville Horror\", \"Nightmare on Elm St.\", \"Friday the 13th\", \"House of Wax\".......all of these films are examples of why i sometimes HATE Hollywood.<br><br>Finally......a horror remake that's WORTH seeing. I must admit, i had some pretty low expectations walking into this, and it did way more than prove me wrong. Initially i thought they were going to make this a straight 'B' movie by incorporating tons of humor with their gore, which would have been fine with me, seeing that i love the genre'. But this movie was more fun than funny. Don't get me wrong, there are some sequences that are funny, but it had more of that 'drive-in' appeal to it's horror. And i loved every bit of it.<br><br>It's story is pretty basic, and somewhat cliché'. I mean come on, a vampire living next door. But the weird thing is, it didn't come off as cliché'. And i think the biggest contribution to that was the pace of the film. Once you get past the first 10 to 15 minutes of the film, which are kind of dull, the movie quickly begins to morph into a fast paced gore fest. And now looking back on it......if it were not rated R, then this movie would have been stupid, and it would've fit in with every other crummy horror remake.<br><br>But the aspect that i appreciated the most was the writing. For once, they didn't alter any rules to make their film different. They stuck with what already works, and left it up to the actors to make these vampire rules entertaining. And Collin Farrell did just that.<br><br>Bottom Line.....Of all the horror movies that come out this year, this will probably be the one you will have the most fun at. It's funny, it's somewhat scary, but most of all, it's pretty damn entertaining. It's one of those movies i would've loved to of seen at the drive-in. If your tired of all this 'Twilight' crap, which they happen to mention in the movie itself, then this is really a breathe of fresh air to all the TRUE vampire fans.","user":"blackmambamark","rank":[139,186]},{"title":"Solid and enjoyable remake","rating":9,"date":"18 April 2017","review":"After a mysterious stranger moves into his neighborhood, a teen and his friends accidentally stumble upon his terrifying secret about being a vampire and recruits a famous vampire hunter to try to stop the trail of carnage left behind and his friends become the next target.<br><br>This was a surprisingly decent enough affair that wasn't really all that bad with some good points to it. Among the better parts here is the absolutely fun storyline throughout here that does compare favorably against the original since the ruse is discovered early on. This has a lot of rather fun antics that really push this along, from their initial meeting that clues him, the strange way he continually creeps around the neighborhood to pop up at exactly the wrong time or the few behavioral ticks that give him away which all go wrapped together alongside the previously-discovered videotapes that all help to give this one the work needed to fully reveal the ruse. Beyond this, the scenes stalking around the house where he has to free the captive inside and her eventual fate not only gives this one yet another charge for the ruse yet also features quite a really suspenseful sequence to help build that section more beyond the friendly scenes. There's a lot to come off of that in its action in here, from the house destruction and eventual high-speed chase along the highway that has a lot to like about it during their various chases and encounters with him to the battle in the office that includes some nice stalking scenes through the endless rows of artifacts stored away or battling the creatures in the panic room. As well, this here has the final assault on the underground hideout with all the turned victims providing enough of a battle to allow for some big action moments before the one-on-one confrontation, which is rather entertaining in its own right as there's some rather fun fighting here with their contraptions and some decent enough gore scenes to make it interesting. Along with the vampire makeup and gore, this is a pretty good effort with a lot to like although there are a few problematic elements here. The film's biggest flaw is the fact that the ruse is found out far too early and far too easily, since there's little investigation required to find out his true identity and it's all out in the open with such little push- back or need to look further into who he is which makes for some questionable storyline points. Along with this effort, the film also manages to stumble somewhat in it's CGI which is rather cheesy and clumsy throughout here as there are some exceptionally weak shots in here. The fact that so many of them are due to the wounds inflicted upon him which is quite obvious due to his spastic movements and disorienting behavior during the attacks, and along with the transformation scenes and use of blood and gore all just make for a rather flawed experience. These do knock it down somewhat but not enough to lower it overall.<br><br>Rated R: Graphic Language and Graphic Violence.","user":"kannibalcorpsegrinder","rank":[8,8]},{"title":"A worthy remake to the classic original horror flick!","rating":8,"date":"30 October 2015","review":"R.I.P. Anton Yelchin (1989 - 2016). It is a tragedy he past away yesterday so young and he is no longer with us anymore. So my review is dedicated in memory of Anton. <br><br>Fright Night (2011) I s a really good decent remake of the original horror flick Fright Night (1985). Usually I hate remakes and reboots, but there are some good remakes that I like. Fright Night is one of them! I love Vampire movies and this one is pretty good and well done. I know that Original is the best vampire slasher horror film, but that doesn't mean that remake is awful, which is not! This movie is good and has a good story and does not copy the original. The idea of this film is pure originality. The writers and the director did not copy the original film, but he used his imaginative, that's what makes this film so good. This film is very hated and bashed from critics and fans who just don't understand this film, I do and I love it. It is my favorite slasher comedy horror vampire flick! Sorry but I love it! <br><br>This remake is actually good, it Is not bad it is good! - I enjoyed it - The scene when Colin is in the doorway and he is telling Charlie that it's up to him to look out for his girl &amp; his mom - Colin plays that scene just about perfect - a warning &amp; menacing at the same time:)!!!! This movie is fun I loved it. It didn't drag, it was just right, It had a comedy and it had a horror to it, it was a good remake! An example of a good horror remake. Colin Farrell is extremely, extremely underrated in everything he does, it is sad because he is awesome as Jerry the vampire, I like him as vampire. This awesome actor made me lough before he even told a joke. And I just lough because this guy is awesome. This was just a good fun time at the movie theater, I didn't see it in movie theater but you know what I mean, it is a good fun time. It has fun with it, doesn't take it self too serious, like the original one did, which kind a brought the movie down for me. This one knows it is a satire comedy, horror comedy and it treats it as such. Too bad this movie failed! Of all the remakes this one failed! Well the sucky remakes make the money! This is by far the second good horror remake I believe, the first one will always gonna be My Blood Valentine 3D (2009) and the third will be Sorority Row (2009) not that good horror flick but still a good horror film! I am sorry that was awesome, I did enjoyed this movie. <br><br>This was an excellent film that distinguished itself from the amazing original but still through out a few shout outs here and there. The cast was awesome with amazing performances by Colin Farrell &amp; Anton Yelchin in the staring roles. The good thing: Amy's (Imogen Poots) part from the original as a girl not sure of herself has been changed to more of a girl who isn't shy about herself or how she feels about Charlie. Also, instead of Ed (Christopher Mintz-Plasse) being the skeptic, it's now Charlie (Anton Yelchin) who doesn't believe his next-door neighbor is a vampire. The bad: I have one problem with it and that is David Tennant as great vampire slayer Peter Vincent, don't get me wrong but for me will always be Roddy McDowall as Peter Vincent, cause this actor can kick the out of David Tennant''s ass and any vampire out there. I wish they would putt Roddy McDowall back in the role instead of David Tennat. I don't like this version of Peter Vincent AT ALL - they should have kept him true to the original. But Roddy McDowall died in 1998 before they could cast him back. May the actor rest in peace. It is sad he is no longer with us anymore. <br><br>The basic plot is about Jerry Dandridge (Colin Farrell). He's dangerously charming – and utterly lethal. That's because he just happens to be a vampire, and out for bloodbuckets of it. After high school senior Charley Brewster (Anton Yelchin) makes the connection between Jerry's suspicious activity and a steadily rising body count, he vows to end the reign of terror next door. But he can't do it alone. His only hope is Las Vegas magician/vampire-slayer Peter Vincent (David Tennant). Together, this unlikely duo set out to end Jerry's evil rampage. But Jerry is a ruthless, relentless killer, and he's not going down without a fight. Get set to sink your teeth into this thrilling re-vamp of the terrifying horror classic. Fright Night will captivate you from the very first bite! <br><br>The rating to this movie I am giving an 8/10, because this film deserve it and it was really enjoyable horror flick! <br><br>Fright Night is a 2011 American neo-noir comedy horror film directed by Craig Gillespie. A remake of Tom Holland's 1985 film of the same name, the film was adapted by Marti Noxon. The film premiered at The O2 in London on August 14, 2011, was produced by DreamWorks Pictures, and widely released by Touchstone Pictures on August 19 in Real D 3D.<br><br>8/10 Grade: B+ Studio: Touchstone Pictures, DreamWorks Studios, Reliance Entertainment, Michael De Luca Productions Distributor: Walt Disney Studios Motion Pictures Starring: Anton Yelchin, Colin Farrell, Christopher Mintz-Plasse, David Tennant, Toni Collette Director: Craig Gillespie Producers: Michael De Luca, Alison R. Rosenzweig Screenplay: Marti Noxon Story: Tom Holland Based on Fright Night by Tom Holland Rated: R Running Time: 1 Hr. 46 Mins. Budget: $30.000.000 Box Office: $18.298.649","user":"ivo-cobra8","rank":[10,11]}]