[{"title":"He's bored we suffer.","rating":2,"date":"19 November 2010","review":"A black Ferrari, on what appears to be an oval track, roars past. The same place five times. The car is going nowhere fast. The movie goes nowhere slow.<br><br>Eventually a bored Hollywood star has to take care of his eleven year old daughter. That's were it starts? But that's about a half hour into the film. Elle Fanning adds some life to the movie. The relationship of Stephen Dorff to his daughter in an underwater tea party is the only thing that makes him likable.<br><br>Nearly every scene is too long. Dorff sits on the sofa, drinks beer and smokes more then once. Twin pole dancers twice get too much screen time. In a swimming pool, the star floats on a raft slowly out of frame. When he is called in for a make-up mask we watch the plaster dry. Thankfully we didn't have to see the plane fly to Italy in real time.<br><br>There is some red herring, read between the lines, business with nasty text messages and paranoid behavior that never pays off. The send in the masseuse bit was funny, but who would question his sexuality, as he rarely declined the gorgeous women that continually threw themselves his way. <br><br>The film is short on dialogue and has nothing to say. Some striking visuals skillfully convey a boredom story that is way to thin to be told.<br><br>Written and Directed by Sophia Coppola, here, the apple falls far from the tree.","user":"Quietb-1","rank":[177,238]},{"title":"Empty People, Empty Lives, Empty Movie","rating":4,"date":"20 November 2010","review":"Stephen Dorff plays Johnny Marco. His life is boring. He is the target of beautiful women, the epicenter of LA parties. He tools around in his Ferrari, the cad-about-town who sleeps with lovely strangers. At one point his boredom is so complete that he falls asleep with his face between the thighs of a beautiful woman, before she is able to have an orgasm,unable to gorge himself on more sex. He is a much-in-demand movie star. He goes first class, but wears casual clothes. There is no appetite he cannot quench immediately. He is jaded by his own sated appetites. <br><br>This is a bad script. There is no tension, no stress, nothing to overcome. The characters are flat. They are spoiled people who live their excessive lives without joy or enthusiasm. They are not bad people. They do not do bad things. They are not particularly interesting people, except that they walk through rich lives without friction or much interest. So we lose interest in them fairly soon.<br><br>\"Lost in Translation\" shared some similarities with this story. It was an insular world, known to only a privileged few (life in a 5-star Japanese hotel) and the players had little to do other than live well in their fish bowl. \"Somewhere\" is the insular world of the movie star in a fishbowl of fame with immediate access to the world's pleasures. Movie stars wait for someone to take them somewhere to be interviewed or to speak a few lines. Apparently, no one tells Johnny Marco, what his movies are about so he isn't prepared for the little he is expected to do. Similarly, Bill Murray waited for days to be taken somewhere to do his commercials. He stumbled through his lines. The language barrier was a source of some humor.<br><br>Unlike \"Somewhere,\" \"Lost in Translation\" had a plot line which kept you guessing. Would Bill Murray's character take advantage of the bored young wife, played by Scarlett Johansson? The male leads in both films have long spaces between activities and their next words. They lead lives of self-gratification. But empty lives - cavernous emptiness, without soul or joy or hope. Pleasure-seeking without purpose. <br><br>Johnny Marco's relationships are elsewhere. An ex-wife who calls to drop off his daughter, people want to arrange something for him and people who don't matter want to hang out. Johnny is sleepwalking through life. He isn't sad or unhappy, just unaware. <br><br>The film comes to life, a little, when his daughter shows up. One must wonder if Cleo Marco, played by Elle Fanning, isn't the autobiographical proxy for Ms. Coppola. Cleo wants more time with her father, who is preoccupied with his movies. Perhaps, Ms. Coppola spent long hours when she was eleven, waiting for Francis Ford Coppola to return from his movie sets. Johnny plays with his daughter, and she likes it, but she is afraid of being left behind in the divorce. These scenes are as close to a plot as the movie gets. They are nice scenes, but they are long, music-filled and much in need of editing. They are almost too romantic for a father-daughter relationship. We have seen these scenes in romance stories, and they are generally post-coital.<br><br>This film feels like a remake of \"Lost in Translation\" without the minimal plot in the former movie.<br><br>Somewhere isn't going anywhere. It is Johnny did this, then that, then this other thing, the end. At no time, is there a question, a moment of tension or apprehension, a suspenseful scene, a moment of conflict or a resolution to a problem. He's rich; he gets everything he wants. No problem.","user":"ligonlaw","rank":[92,124]},{"title":"Somewhere never leaves the station","rating":1,"date":"25 May 2011","review":"I know that when you see my rating you will think \"it can't be That Bad\". It is. If you don't believe me, then please rent the DVD (hope you have NetFlix). After you watch it, please read any other reviews that I have made because you will realize I'll tell you the truth and that I'm not one of the Hollywood flunkies that rate movies high to get more sales.<br><br>I hope the movie was recorded digitally and not on film. It would be a shame to waste all of that good film. The first few minutes of the film start off very s-l-o-w and then, very quickly, proceeds to get even slower. The movies starts nowhere, goes nowhere, and then ends in the same location that it started.<br><br>After reading someones bad review I rented the movie anyway because Sofia Coppola wrote and directed it. I wish I would have believed his review. I plan to read more of them:)","user":"countryshack","rank":[18,21]}]