[{"title":"strikes a fine balance between story and action","rating":8,"date":"6 March 2010","review":"this animated offering from marvel is quite good.i liked the story.it's nice to see a little thought put into it once in awhile.it doesn't take a back seat to the action.in fact,i think the balance between the two is about even.the action sequences are well done,and some are fairly graphic,and bloody.this is a 14A film,for sure.the voice acing is terrific here.Rick D. Wasserman provides the Hulk's voice and i don't think anyone could be more suitable.equally as impressive is Paul Dobson as the voice of Beta Ray Bill.i'm also glad they included such a great character in the movie.there are some other great characters as well.for me,Planet Hulk is an 8/10","user":"disdressed12","rank":[16,19]},{"title":"Not the best.","rating":6,"date":"6 June 2018","review":"So the Avengers have had enough of Hulk and decide to send him far away. They say he is going to a place where there are no people but of course that doesn't happen. Since all the characters are new we are treated to a half dozen boring back stories and given no explanation why Beta Ray Bill was there. This is for hard core Hulk fans only.","user":"TheMeanGreenMidget","rank":[10,13]},{"title":"Great Fun! Marvel Rulz!","rating":5,"date":"5 February 2010","review":"Animated films like this one are the reason why Marvel is king. Honestly, most agree that the Marvel Universe is the richest, most entertaining fictional realm ever imagined by man. Now, it's good to see live action and animated features that can match or at least come close enough to the magnitude of the books. While not as complex as the reads themselves, these animated features carry their own level of satisfaction. Just like \"Hulk VS\" before it, this film delivers the goods. It's more than fun to see Hulk in a gladiatorial setting. It's a blast to see Beta Ray Bill pop in from out of nowhere! When you compare these animated films to their only real competition, it clear to see that Marvel still has the advantage. Planet Hulk makes Green Lantern: Fist Flight look sick by comparison. Hulk VS outclasses the mindless Superman/Batman: Public Enemies and so on. When the foundation is stronger, the things built upon it will be stronger as well.<br><br>Hulk is the strongest there is... and so is Marvel. Bring on the Thor animated project!","user":"SpanishRicky","rank":[15,23]}]