[{"title":"A rare movie that doesn't stereotype struggling poor people","rating":10,"date":"3 June 2015","review":"A rare movie that doesn't portray struggling poor people as linguistically-challenged, trash-dressing, immoral gun-wielding drunk meth-heads. And as no-nonsense sensitive as you might expect from Phil Morrison, the director of 'Junebug', and Melissa James Gibson, the writer of many 'House of Cards' episodes. So refreshingly real, and so much talent on all sides, actors included. Of course, Paul Giamatti and Paul Rudd are great as always, as is British Sally Hawkins (see Mike Leigh's 'Happy-Go-Lucky', Woody Allen's 'Blue Jasmine', etc.), playing a Polish immigrant with a heart as big as her accent. The final scenes may seem a bit of a positive stretch, but you're sure ready for one by then, and movies do need to provide us a little fantasy, or else, what's the point?","user":"jac-berry","rank":[18,21]},{"title":"All is bright, it just depends from where you look","rating":9,"date":"15 November 2013","review":"I went in to watch this movie expecting it to be a lot more sugary, maybe some poor guys discover the meaning of Christmas and everything is glowing in the end.<br><br>I was wrong. Sort of.<br><br>This movie teaches you a few things if you're willing to see them: - Sometimes life just won't cut you a break, no matter how noble your intentions or how much you suffer or work - you may discover you're dedicated to goals that much surpass your personal well-being and give up any rewards if only you can see them fulfilled.<br><br>The storyline is simple: guy, Dennis (Paul Giamatti), gets out of prison, wife tells him to go away and announces that their daughter now thinks he's dead. Wife also announces that she's about to marry a good friend of his, Rene (Paul Rudd), just as soon as he gets his divorce. With no house, money, or family, Dennis asks Rene to take him to New York on his yearly tree selling trip. <br><br>Both men are resolute to not commit any felonies anymore – this becoming a comedic point because from the get go, they're not exactly law abiding. Dennis leaves the country although he's released under parole, and hides in the truck among the trees to pass customs. He threatens other sellers as soon as they arrive, steals petty stuff at any chance he gets. <br><br>When the season ends and they count the good money, they get robbed by a guy who earlier pretended to be blind – at which point by the way he had the funniest line in the movie. At the end they plan a robbery to the wealthy house where a woman they became friends with worked. They're not stealing what you'd expect, and I'll leave it at that.<br><br>Other commenter criticized the fact that they didn't put the money in the bank. Well, for one they're cons so they don't think that way, and then they're cons and have records, you can't just walk into a bank and then start sending funds to your account from another country.<br><br>It's the obscure/dark humor, hopeless and sad humor at the same time, combined with the survival situation to achieve relatively small, but unattainable goals, that give the movie its character.<br><br>Some characters are delicately crafted: the Russian woman they befriend is a simple house maid in some dentist's house. She is poor, and shares the same passion as Dennis' daughter – playing the piano.<br><br>Rene is added depth when his current wife announces she'll give him a divorce. He's not happy, he's not celebrating – he is devastated he didn't even take her on a honeymoon. Granted he's a hypocrite because he's trying to marry another woman, but still it was a different reaction from what you'd expect.<br><br>Dennis and Rene remain in a hanging-by-a-thread kind of relationship, and that thread is survival. Dennis, despite what you'd expect from an ex con, cares about his (ex)wife and daughter so much that he's willing to stick it out, and stick up for, with the guy who took them from him in order to give his daughter a gift that he promised in his mind, and in order to not make his wife suffer because of Rene's behavior. (\"Why would I lie for him?\")<br><br>While they're making a tree sale to 2 guys, Dennis actually has a breakdown about how Rene stole his wife and the 2 guys are strongly on his side and encourage him to do all that he can to get her back. That's the voice of the viewer, I'd say, because that's what other movies teach you to want. I like to interpret Dennis not following this path of action as the selfless choice of reason: his wife and daughter have been through a lot while he was in prison and managed to rebuild their lives. They seem happy and do not show signs of wanting him back. He realizes his fight to get them back will very likely be unsuccessful, and would add hardship to the wife's already tough time. So he chooses to step back (not without a few  desperation fits) – with the last gesture of getting his kid a piano, by any means. And by this gesture he does not aim to be the hero, to be lauded and acknowledged. He just wants to make his kid happy even without the reward of \"good daddy\".<br><br>I'm not surprised that the film has a low score and few reviews. It's not a general public type of film, and it's not an American type of film as it's not rewarding to watch - all things don't get fixed up by the end. <br><br>Both Pauls are remarkable in their roles, they make believable and deep characters. Sally Hawkins is funny and quirky as the Russian girl. I have nothing to say about Amy Landecker as the wife. This for me is also a good point of the movie: she's a regular woman with a kid and real problems, she's not a trophy.<br><br>The film has a nice offbeat rhythm that I enjoyed and that fits well with my understanding of how films should be (music too – but that has no place here). I hope there are viewers out there who feel the same.","user":"luana_rrr","rank":[21,26]},{"title":"All is bright... But all is not funny...","rating":6,"date":"8 October 2013","review":"I must say for a comedy starring Paul Rudd and Paul Giamatti, then \"All Is Bright\" was somewhat of a disappointment if you look at the movie from a comedy aspect. Why? Well, because there was almost no comedy here. This was more a drama with some elements of pseudo-comedy thrown into it.<br><br>The story is about Dennis (played by Paul Giamatti) who is released from prison, only to find his wife Therese (played by Amy Landecker) having told their daughter that he is dead. And to make matters worse, she is to marry his former partner in crime Rene (played by Paul Rudd). Down on his luck and low on cash, Dennis have to bite the sour apple and go with Rene to New York City to sell Christmas trees.<br><br>Now, as much as the story is without comedy that will make you laugh, then the movie is equally stacked with an interesting story that was really well acted by the lead actors, and they really carried the movie quite nicely.<br><br>The characters in the movie were well carved out, with lots of depth, personality and characteristics, as odd as they may be. But with the talent of Rudd and Giamatti, then the audience are introduced to two very different characters, that are each individually very likable for better or worse. And together on the screen, their chemistry is just magnificent.<br><br>\"All Is Bright\" is well worth a watch if you enjoy a movie that is something out of the ordinary.","user":"paul_haakonsen","rank":[18,25]}]