[{"title":"A pedal to the medal action thriller","rating":7,"date":"22 October 2017","review":"Inevitably this movie couldn't come close to the original in terms of sheer impact. It is, however, such an improvement over the other dreadful sequels that it deserves merit simply for that. Adrien Brody is solid in an against type role, and carries himself well. Every other character had the potential to be interesting but was not explored enough, especially Laurence Fishburne. The action was seriously well done, with flashes of the visceral energy that this series desperately needed. Should have been about half an hour longer to flesh out the characters and maybe have a few more plot twists but as a straightforward, entertaining and visually appealing sci-fi actioner it works. Will not go down as a classic but will always be worth watching when in the mood for an adrenaline rush.","user":"jackcwelch23","rank":[23,23]},{"title":"Could watch it again and again.","rating":8,"date":"31 August 2015","review":"Predators picks up where the last two great films left off hunting and killing. The predator is by far the greatest hunter in the alien fictional history. Unlike the last two movies where the predator was on earth in this movie the predator has abducted there victims and placed them on an uncharted planet. For me there are a ton of characters in this movie that I like, the cool samurai guy, the crazy guy in the ship who betrays the survivors. My favorite character was the big Russian guy. At first I was so caught up with all the great characters that I forgot till midway through that most of these characters if not all would die. My favorite thing about this movie though was the fact that there was two different type of predators the ones that we've seen from the other movies and the new ones who apparently are the stronger ones. When I found out that there were two different types of predators, that got me so pumped to see a showdown and sure enough we did. Of course the smaller predator died but it was a good effort. This movie is absolutely one that I can watch again and again and still be interested I loved it. Only problem was they didn't really explain how the humans got on the planet, but still great movie.","user":"jesusdelgado","rank":[19,19]},{"title":"Finally a worthy sequel to a great original","rating":9,"date":"18 December 2010","review":"It's clear they had a real long look at the original film and decided to keep the best pieces (the tension, the focus on group interaction, the music) but also try new things with it to attain the same feel of mystery the original was so good at.<br><br>The visuals are gorgeous, the acting solid, the writing exciting. And what I really love is the fact that there is very little use of CGI. What little there is, is convincing or subtle. Laurence Fishburn's appearance was a complete surprise to me and I loved his character. Though it reminded me a bit of Pandorum.<br><br>Like Sade said: \"Never as good as the first time,\" but still a very well-crafted film.","user":"nicolasmarinus","rank":[54,61]}]