[{"title":"Bonkers","rating":8,"date":"3 October 2013","review":"I left the cinema speechless; i normally try to critique and discuss the film straight after, but i was speechless. It was the craziest film i have seen in a long time. It takes boundaries and tells them to f*** off. There are no restrictions with this film. There is brutality, sexism, racism, oppression, homophobia. It is polluted with prejudice. But i thought it was a great film. Am i part of those worldly problems? No. But let's face it, this is unfortunately the way the world is and all this film is doing is showing you just how filthy this world can be. <br><br>James McAvoy is a revelation as Detective Bruce Robertson; i really didn't see all the fuss with him. Yes he was good in \"The Last King of Scotland\", but the rest of the films i just couldn't match the hype to the actor, then i went to see \"Trance\" and i was blown away by his performance. And if it weren't for seeing that i probably wouldn't have been half as eager to see this. Because he showed the ability to portray more than one character in a film; someone who is both fragile and unstable. With \"Filth\" he excels beyond that and gives his best showing of his young career. He conveys every emotion, from bitterness, to regret, to sadness, to rage, to insanity and he conveys them extremely convincingly. It is a masterclass of acting. <br><br>Some may be easily offended, and if you are usually like that, i would avoid seeing the film. But if you want to face the World and its obvious problems head on (in the form of a film) then it is an outstanding film to do so.","user":"The_moan_of_all_moans","rank":[246,281]},{"title":"Crazy","rating":9,"date":"16 October 2013","review":"There is no other way that I could describe this film. It is filled with some of the most crazy and strange scenes that I have seen in film. There was weird sex, masturbating, murder, drugs. Pretty much everything offensive that you could think of is in this film. <br><br>It made me laugh, cringe and frown at some of the ridiculous stuff that happened in it.<br><br>Deep in the storyline though, was an utterly captivating, yet tragic story of a man loosing his mind to drugs, mental illness and grief. In many ways it was this that made the film all the more shocking, but brilliant at the same time. <br><br>I came out of the theatre speechless, I had no idea what to make of it or think. Now I have thought about it, I can see how good it really was. <br><br>James McAvoy gave a perfect performance in the lead role. Everything about the character that he portrayed was realistic, and I could feel the emotion coming out of him throughout his descent into madness.<br><br>This film is not for the faint of heart or easily disturbed, but if you can deal with the weird and wacky, then you are going to love it.","user":"samlynn12","rank":[156,183]},{"title":"Joyful depravity. Enough said!","rating":10,"date":"25 September 2013","review":"Mister Tumnus, I've a feeling we're not in Narnia any more <br><br>Think you know James McAvoy? Think again. His performance in Jon S. Baird's adaptation of Irving Welsh's Filth is astounding and there is nothing sweet or fluffy about it or any other aspect of the film. Filth is very funny, very wrong, very sordid and very likely to incite hatred from Daily Mail readers across the land. Sex, drugs, more sex, more drugs, violence, corruption, depravity, even more sex and drugs Filth is absolutely, well, filthy, and is a memorable experience to say the least.<br><br>My companion for the screening, Bag, made two comments that stood out post-screening. The first I agree with entirely: \"With the thousands of films I've seen over the years, this is the first one I've come out of wishing that I'd made it.\" The second, that it was a film to appreciate rather than enjoy, I'm going dispute. Call me debauched, immoral and twisted, but I enjoyed every last nanosecond of Filth.<br><br>But that's not to say it is always easy viewing. Far from it. Sometime after the midway point the laughs die down, the stomach churns a little more uneasily, the grimaces are more evident and the intakes of breath are more audible. We are less willing to forgive but, like the car crash up ahead that has caused all the drivers in front to rubber-neck, well, just one long look as we pass can't hurt, can it? <br><br>Bruce Robertson (McAvoy) is a bigot. He's bi-polar, a junkie, sex-obsessed, self-obsessed, manipulative and frequently thoroughly unpleasant. He's also a cop. With a promotion in the balance, Bruce is up against several colleagues and sets about turning one against the other, unsettling them with salacious gossip and blatant lies to ensure he beats them to the post. Throw in his manipulation of fellow freemason Bladesey (Eddie Marsan), his sultry wife, Carole (Shauna MacDonald) and his hallucinatory sessions with Doctor Rossi (Jim Broadbent) and you have one monumentally screwed up anti-hero. And what's not to love about that? <br><br>The Cohen brothers may have the monopoly on fantastic character names, but nobody writes actual characters like Welsh and the cast that Baird has poured into Filth is staggeringly good in their interpretation of this mess of freaks and misfits. There isn't a poor performance in the entire film from the uncertain laddishness of Ray (Jamie Bell) to the fantastic absurdity of Doctor Rossi. While none are bona fide Hollywood stars, the cast that glitters in a maniacal, dirty way is a treat beyond expectation: Imogen Poots, Shirley Henderson, Gary Lewis (yes, Billy Elliott and his dad are reunited at last!), John Sessions, Joanne Froggatt <br><br>Filth is a perfectly paced film; it roars ahead stirring emotions and judgment, exciting and thrilling as it trashes everything in its wake but it is never so fast that we feel left behind or that we've missed out on a juicy morsel of degeneracy. Sufficient time is allowed for us to filter through, as best we can, the quagmire that is Bruce's life, but Baird never pauses or permits us time to glance at our watch or neighbour.<br><br>The soundtrack, too, is bang on the money stamping though a musical landscape that is at times acceptably cheesy and more often a reminder of what to check is on the iPod. Where else can you effortlessly segue from David Soul into Shaking' Stevens? While the latter is consigned to audio wallpaper, the bizarrely fantastic cameo from David Soul is a delight. Had Dennis Potter snorted cocaine Pennies From Heaven might have resembled this.<br><br>Yes, there are elements of Welsh's novel that are missing (no police dogs here) from Filth but there always have to be excisions for film adaptations and there's no reason, in this instance at least, to mark down a film for that. No, Filth is superb and as near to perfect as I've seen for many months (since Broken and Trance).<br><br>If the trailer excited you, take the plunge. If you're a nun, a granny, my mother, or lack a strong stomach and nurture your prudishness, take a very long, very fast walk in the direction of something much safer. Dixon of Dock Green this ain't! <br><br>If you look in the mirror and see something slightly off-kilter grinning back, however <br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[206,255]}]