[{"title":"May Contain a Spoiler, but I don't see how","rating":13,"date":"13 January 2010","review":"I got suckered in to watching this waste of time. Had I known it was a remake of that mess \"Machined\" I wouldn't have bothered.I know, it's supposed to be a \"sequel\" but it's basically the exact same movie on a slightly bigger budget. I watch a lot of horror movies both major productions and indie films. I don't expect a lot from the cheaper production but I do expect a coherent plot. The film school dropouts that sort of put this mess together really need some help.<br><br>It's basically about a disgusting slob that lives in a junkyard and turns some hapless soul in to his own personal killing machine. It's never really clear just how he's able to do that. The whole point of movies like this is to create a \"scary\" environment, display some gruesome special effects, maybe show a little boob, and kill off as many people as possible. I get that. That's why I watch 'em. But I also expect to be a little entertained. Like the movie should have some kind of plot I can understand without having to watch the film over again and read what other people say about it (who the hell is \"Motor Man\"?) And this flick is just plain cruel. It's pretty much just an excuse to try and graphically depict torture, especially on semi-hot women. Watch \"Hostel\" or \"Hostel 2\" again if that's what gets you off. This just appeals to the lowest common denominator. Yeah, they have the \"drilling human flesh\" part down pretty well and over use it. It should make you squirm. But let's not encourage these losers to make yet another version. try anything else.","user":"ponusjoe42","rank":[32,34]},{"title":"Better than The Original Machined but that...","rating":3,"date":"7 January 2010","review":"I watched Machined and Machined Reborn back to back and I have to say that this sequel is a little bit better then the cheap original. But it is not great either, even for the horror fans. Same director, Motor Man Dan has somehow survived the first movie (??) and a young couple buys his garage and things start to happen again. From ghostly appearances (??) to unconvincing torture scenes (The Saw and Hostel movies are hot, so why not ?) Machined Reborn is a quick and cheap cash-in on the horror genre that still is commercial these days. They can't be all good so some have to be really bad. So the leading actress has some nice tits which is shown twice in the first 15 minutes, she still can't act well like the rest of the cast. The camera and lightning is better than the original The story has potential this time but it all derails fast and you really do not care anymore after half an hour. Let's hope Machined won't be a trilogy...","user":"homecoming8","rank":[16,18]},{"title":"Well what do we have here?","rating":4,"date":"6 April 2019","review":"A-Z Horror Movie of the Day...\"Reborn\" (R - 2009 - US)<br><br>Sub-Genre: Slasher/Gore\nMy Score: 4.1<br><br>Cast=3 Acting=5 Plot=2 Ending=4 Story=3\nScare=3 Jump=4 F/X=5 Kills=6 Gore=6<br><br>A couple moves onto a property in Arizona that used to be a torture ground owned by a serial killer, who rises for one more round of terror.<br><br>\"Well what do we have here?\" a.k.a \"Machined Reborn\", this is actually a sequel to the 2006 movie \"Machined\". I don't think you need to watch the original to understand this one...then again I don't think you need to watch this one. The acting, gore, and kills were pretty good, but there wasn't much else to this movie. I bought this for 99 cents when Blockbuster was closing and I think I just barely got my money's worth.","user":"lojitsu","rank":[1,1]}]