[{"title":"A group of college students are stranded at a dilapidated hunting lodge. After a couple disappear and one of their body's is found, the group must flee to stay alive.","rating":9,"date":"12 September 2011","review":"I enjoy renting low-budget horror films. If they're not scary (and they usually aren't) then they're sometimes good for a laugh. When I rented The Eves last weekend I definitely thought it was going to be no exception. An attractive group of college kids stranded at a dilapidated house in the middle of nowhere is definitely something I've seen a thousand times.<br><br>However, this film surprised me for several reasons. The twist ending was nicely executed and kept me engaged. Also, the filmmakers took a lot of time developing each character and their strained relationships at the outset. As a result, the pacing is a little slow in the beginning but when things begin to unfold and the mystery of what is happening presents itself, it really does draw you in. After watching the film once I zipped through it again and found clues I hadn't noticed or picked up on during my first viewing.<br><br>There wasn't as much blood and gore as I prefer but the third act is very violent and quite creepy as the film mixes religion and violence giving it a Southern Gothic tone. The performances were all very good. Overall, I'd recommend this film as it definitely stands apart from other low-budget horror films.","user":"tylerglodt-158-749677","rank":[19,29]},{"title":"Pedestrian effort but nothing too offensive","rating":6,"date":"30 January 2014","review":"Getting stranded while on a road-trip, a group of friends follow the advice of a local to stay at a supposedly-abandoned shack in the woods, only to find it's actually the home to a group of demented, devout religious followers intent on saving them from their sins, forcing them into a deadly struggle to survive.<br><br>For the most part, this is an absolutely generic slasher in every sense of the word, as the fact that the twisted, warped views on religion provide so many agonizing moments of stupidity to come forth that it alone amounts for nearly all the film's problems right there, then take into account that it follows a time-honored tradition of a group of friends getting stranded in the woods and the locals with a hidden agenda that just seems so common a set-up that, by not doing anything radically different here, it tends to feel very clichéd and repetitive after a while. Added together with the very slow and drawn-out beginning here and it's got a lot to overcome. There's some nice brutality in the kills and the treatment of the prisoners in a dark, intense second half filled with more confrontations and encounters that does go some way toward redeeming this one, but all that religious stuff really can't be overcome and drags this down a lot, for there's not a lot that really overcomes a flaw like that.<br><br>Rated R: Graphic Language, Graphic Violence and Brief Nudity.","user":"kannibalcorpsegrinder","rank":[4,6]},{"title":"My Review Of \"The Eves\" 2012","rating":7,"date":"21 August 2014","review":"\"The Eves\" is an entertaining modern backwoods/road horror film. It is a nightmare scenario that is a dark, thrilling journey into cruelty and psychotica that seems totally Americana. \"The Eves\" is a film I will be watching again-especially during the Halloween season. There is something truly terrifying about psychotic young people!<br><br>The story takes the road horror into grindhouse territory effortlessly. The innocent trip that turns into a fight for survival against homicidal madman shows strongly in \"The Eves\". There is a period in the beginning that gets a bit old with the \"ooh you scared me bit\" which really set me into the notion that I was not gonna like this flick. However from the first real scare, that results in the kick-off to the horror show, the film pulled me in. The blunt cruelty of the antagonist, against the helpless victims offers a disturbing sense of realness that hooks you in. I found the cast to be apt in bringing these characters to life, creating a strong, well executed story. Plus with the intense, brutality of the last act, \"The Eves\" becomes a chilling survival nightmare. <br><br>The special effects, suspenseful build-up, and over all darkness of 'The Eves\" creates a steady, even-paced intensity the feels natural and \"at times\" cringe worthy. The director does a great job working the cast, and scene direction so that kill scenes look genuine. It is above low budget quality really. The sound effects, and overall ability of the film to keep a strong foreboding atmosphere never falls flat. If it wasn't for the slow, annoying start to the film, with way to many \"fake scare\" moments, then this film would be flawless. Still the second and third act make up for that unnecessary exuberance.","user":"ASouthernHorrorFan","rank":[5,9]}]