[{"title":"For All Its Acting Strengths, \"Lovelace\" Should Have Gone Deeper","rating":6,"date":"11 August 2013","review":"It is debatable what differentiates a great film biography from the rest. Arguably, a great biopic embraces the complexities of a person's life while using storytelling to organize such intricacies. It makes the film's subject all the more intriguing.<br><br>Poor and mediocre biopics either become blatantly overwhelmed by a life's complications, or ignore them altogether. Unfortunately, \"Lovelace\" chooses to ignore, and consequently misses greatness.<br><br>The woman who was born Linda Susan Boreman, and would later be better known by her stage name, Linda Lovelace, lived a very complicated, and devastatingly sad, life. This film centers on the real life Lovelace's claims of being used and abused by her first husband, Chuck Traynor, and being browbeaten into the pornography industry.<br><br>Lovelace's allegations of spousal abuse have been disputed by some, and supported by others who knew her personally, but that's beside the point. The film was right in basing its narrative solely on Lovelace's side of the story, not getting bogged down by antipathetic discrepancies. Still, there were crucial parts of her life the movie should not have left out.<br><br>For instance, \"Lovelace\" strongly implies that \"Deep Throat\" was Lovelace's first pornographic film (untrue) and her last (also untrue). It doesn't mention a stag film in which she engages in bestiality with a dog.<br><br>In one of her four books (yes, she wrote four books), she claimed that Traynor forced her to act in such movies, which would have made a good case in this movie for how controlling Traynor was. After all, having sex with a dog, especially on camera, is not an action in which most would engage willingly.<br><br>I could go on about relevant moments of the real Lovelace's life that this movie chose to ignore. However, the primary faults of \"Lovelace\" lie not in what they left out, but in a questionable storytelling structure where the filmmakers obviously tried to be too clever in their narrative.<br><br>Basically, the first half of the film chronicles a 21-year-old, naive Linda Boreman (Amanda Seyfried) who lives with her strict, Catholic parents (Robert Patrick and a shockingly deglamorized, unrecognizable Sharon Stone) in Florida. A charismatic, 27-year-old Chuck Traynor (Peter Sarsgaard) spots Linda at a rollerskating rink and begins dating her.<br><br>While Traynor claims to own a bar and restaurant, young Linda doesn't realize he dabbles in prostitution until after they are married, and she bails him out of jail. Eventually, Traynor coerces her into performing sexual acts on complete strangers for money before taking her to audition for pornographic movies.<br><br>From here, the film chronicles the making of the notorious \"Deep Throat\", the rise of Linda Lovelace, and does more than hint at the unexpected cultural impact the film creates.<br><br>Halfway through, the film makes the mistake of jumping ahead six years later (I guess circa 1980), and showing a visibly disheveled Linda taking a lie detector test administered by a publisher (Eric Roberts) in order to assess the validity of her marital abuse claims in her new autobiography, \"Ordeal\". The film then jumps back 8 or 9 years to show many of the same scenes over again, except adding footage at the end of each scene actually showing Traynor physically and sexually abusing Linda.<br><br>Why go back and show these scenes? The lie detector scene would have made a good narrative framework, especially since you see Amanda Seyfried look so shockingly worn down. This is not the same doe- eyed, blonde hottie from \"Mamma Mia\" (2008), or at least it doesn't look like her.<br><br>The point is, though, that going back and retreading all the scenes feels like a waste of time. Considering the film's running time of 93 minutes, there is no excuse for retread, especially considering Sarah Jessica Parker's well-publicized cameo as Gloria Steinem was cut out of the film altogether.<br><br>However, casting was the film's main strength, which I initially thought would be its weakness. I had my doubts about Seyfried portraying Lovelace, considering that Seyfried is exceptionally gorgeous, and the real Linda Lovelace was (Is there any way to say this nicely?) not even close. Listing actresses in this review who bear a stronger resemblance to the doomed porn starlet would probably be insulting to them.<br><br>While Seyfried donned a shaggy brunette hairstyle and freckles to deglamorize herself, she still looked a lot prettier than Lovelace on her best day. Scenes such as low-level mobster Butchie Periano (Bobby Cannavale) arguing that she is not attractive enough for the porno he is financing appear consequently more dubious.<br><br>Still, Seyfried did well with what she was given. Her best scenes include the lie-detection test, a surprisingly touching moment with an unexpectedly cordial publicity photographer (Wes Bentley), and her begging her emotionally cold mother for asylum from her abusive husband. Another scene where she is raped by five men at Traynor's behest shows little, but is still hard to watch.<br><br>While Peter Sarsgaard is effectively charismatic as Chuck Traynor, he wasn't convincing enough during the abuse scenes. Every time he threw Seyfried around, his face looked as though he would apologize to her right after the directors yelled \"Cut!\".<br><br>Sharon Stone, as Dorothy Boreman, had the movie's best performance, and not just because she is indistinguishable from her more glamorous roles. The scene where she does anything but console a visibly frightened Seyfried makes her eerily believable, and surprisingly multifaceted.<br><br>While the performances were well done, and \"Lovelace\" successfully shied away from exploitation, it suffered from fractured storytelling, awkward editing, and the vague epilogue implying that Lovelace's life only improved before her untimely death in 2002 in a car crash. If you watch the insightful documentary \"Inside Deep Throat\" (2005), or read Joe Bob Briggs' excellent, astute retrospective on her life (http://old.nationalreview.com/comment/comment-briggs042502.asp), you'll get a far more accurate, and grimmer, account of her life after pornography. It's sad, dismal, and, as \"Lovelace\" proves, a story Hollywood still does not want to tell.","user":"D_Burke","rank":[100,117]},{"title":"Biopic Sympathetic to its Subject","rating":6,"date":"2 September 2013","review":"It is quite surprising that sweet and wholesome Amanda Seyfried has been cast as legendary 70s porno star Linda Lovelace. Seyfried, whom we know better as ingénues in musical films like \"Mamma Mia\" and \"Les Miserables,\" how could she pull this daring stunt off?<br><br>\"Lovelace\" tells of how young and pretty Linda Boreman, from a strict Catholic family, unlikely met and married a sleazy guy named Chuck Traynor. <br><br>First, she goes along with Chuck's wild idea to make a her a porn actress, exploiting a certain extraordinary talent of hers which would be the central theme of a little porn flick entitled \"Deep Throat.\" She actually enjoyed the heady success of this stardom as Linda Lovelace, for a while at least.<br><br>In a sudden change of pace, the second half of the movie showed how Linda was abused by her husband, physically, mentally, sexually, financially. She quietly suffered this torture until she could not take it anymore and fights to get her old life back.<br><br>The acting of Ms. Seyfried was quite good, as she was able to convince us that she was Linda despite being cast against type. She will get us on her side before the film ends. People who watch this film expecting her to reveal more skin will be disappointed, as this Linda kept it pretty clean on screen. The image painted of Linda was actually very sympathetic as well, like it was all Chuck's fault. Ms. Seyfried played the perfect naive victim.<br><br>Peter Sarsgaard was effectively creepy as Chuck from the start. You really cannot understand how Linda would marry a guy like this. He could have portrayed being more charming in the beginning to convince us. But he looked like a creep even in that scene where he first met with Linda's parents (portrayed by Robert Patrick and a completely unrecognizable Sharon Stone.)<br><br>I think the main problem of the film was in its story telling. There was a very abrupt and stark transformation from happy Linda in Act 1 and sad Linda in Act 2. I think the director was trying to be stylistic about this, not telling these details linearly, instead going back and forth in time. I think this could have been told more effectively another way.","user":"3xHCCH","rank":[26,29]},{"title":"Lovelace: An Odd Bipolar Biopic","rating":6,"date":"9 August 2013","review":"Lovelace is an odd film in that it's really two films wrapped into one. The first film is a rather light 70s set piece about the porn business very reminiscent of the film Boogie Nights, with great performances by Mama Mia's Amanda Seyfried (holding her own even though she is much too pretty to play Linda Lovelace) as well as Peter Sarsgaard as her creepy husband who has no qualms about prostituting his wife out for a buck. Sharon Stone is just fantastic as Linda's mother (you won't even recognize her) and Robert Patrick (of Terminator 2) as her father, and the supporting cast is also perfect, including Boardwalk Empire's Bobby Cannavale and even James Franco playing Hugh Hefner. There is a bit of foreshadowing about what the second film is going to be about, such as when Linda's co-star alludes to the bruises on Linda's leg and also some questionable looks by her husband, but otherwise the movie plays out as a strongly R-rated biopic delivering quite a few laughs.<br><br>Then, suddenly, we are thrown into the second film, a PG-13 Lifetime Network-like drama including violins playing. The second film retells the first film, showing the behind the scenes abuse Linda receives from her husband and portraying Linda as someone who is doing it all reluctantly and is trying to escape the porn business. The stark contrast between the second and first films would be more effective if the second film wasn't so formulaic--it even has a gift wrapped happy ending. I imagine the truth of Linda's life falls somewhere in the middle, with Linda's own bad judgment playing at least some part in her life's situation. Unfortunately, although Amanda Seyfried is lovely in the first film as the naive young newlywed getting caught up in the porn business, she isn't reinvented and just doesn't transcend in the more watered down drama of second film like, say, Charlize Theron was in the film Monster. There just aren't any great performance by anyone in the second film as a matter of fact and the scenes that are suppose to be brutal just aren't. When it comes to showing the ugly side of the porn biz this film peters out.<br><br>Lovelace, therefore, stands as a slightly above average and obviously heavily fictionalized biopic, when it could and should have been much more, if only some more guts were put into the second half of it.","user":"chicagopoetry","rank":[68,90]}]