[{"title":"Underworld","rating":7,"date":"22 February 2020","review":"Most movies don't get to a fourth in the series these days. I loved the first one the best, and though the effects have gotten cheaper, this movie is still an enjoyable continuation, and Kate is still the best effect!","user":"MR_Heraclius","rank":[37,38]},{"title":"Just Not an Underworld Movie. . .","rating":5,"date":"19 January 2012","review":"This movie was, at best, mediocre. The action was good, I suppose, but it simply wasn't as good as its three predecessors. The plot was underdeveloped and unsatisfying. Also, without Speedman, it was really just missing something.<br><br>The story was, quite simply, lacking. It's difficult to explain this film's shortcomings without spoiling it, but, to say the least, they ignored elements that could have made a good movie and skipped to rather simple, unsatisfying plot devices. This movie was also absurdly short, testifying to its lack of content.<br><br>In the end, it just didn't feel like Underworld. I would compare this to the way I felt about The Mummy: Tomb of the Dragon Emperor, Indiana Jones and the Kingdom of the Crystal Skull, and Pirates of the Caribbean: On Stranger Tides - just an out of place fourth movie of a series. I really wanted it to be good, but it just wasn't.","user":"tucker-408","rank":[147,206]},{"title":"Amazingly Overrated!","rating":2,"date":"21 January 2012","review":"I may be acting a bit rash in rating this film at 2 stars, but at the time of my writing, there are just too many shadow marketing reviews on this site to ignore. In a different situation, and if the first 2(3) underworld movies were not so good, I might rate this a 5.<br><br>New writers, new director/directors, different movie.<br><br>If you just want to see some cookie cutter CGI 'action' movie, then give this a look.<br><br>If you are a fan of the earlier movies, if you know the story of Selene, Viktor, Corvinus, and the rest, you will be disappointed. It is not as bad as the crazy changes they made to the highlander movies, but they just decided to forget the past films and do something new. Actually they decided to rip off a few other stories, none of which were good the first four times you saw them.<br><br>I am not going to go into every detail of what is wrong with this movie. For the most part, it is bad because it must be compared to the earlier films in the series. It just does not compare in any way. Acting, scenery, sets, writing, story, effects, all better in prior underworlds.<br><br>Aside from all I have said, the production value is high, and the movie is watchable.","user":"wiseman987","rank":[97,140]}]