[{"title":"Worst acting EVER","rating":1,"date":"6 October 2011","review":"I wish I could give this movie 1/2 a star, it was just awful. I couldn't even watch the whole thing, I had to keep skipping through it. The lighter haired guy was the WORST \"actor\", no one expect to see him in anything ever again and trust me we are dodging a bullet there. Though technically they were all bad, he kept smiling and smirking all the time until I wanted to throw something at my TV! If not for the acting I might not have hated it as much because, while the story was cheesy if the acting had been good I might have been able to forgive the ill written script. I am a sucker for horror movies, even the badly written ones so this one was really bad if I didn't even finish it. I'll sit through almost anything if the movie shows promise somewhere...not this time. No wonder I never heard about this movie anywhere.","user":"akohfeld","rank":[9,12]},{"title":"I like bad movies, this was unwatchable","rating":1,"date":"2 February 2014","review":"I think someone watched the final seen from Soprano's and was like wow what a good idea. It didn't work after 7 years of a brilliant TV show and it sure didn't work for this piece of crap. I would say the acting was a 3 of 10 not good but I wasn't stuck their annoyed with it. The plot was bad but I did like how the killer found out were they lived, thought that part was actually a little creative. The receptionist wasn't that bad as an actress. Overall though the writing was a 1 of 10, acting 3 of 10, dialog 1 of 10, ending -5 of 10 blood and guts factor 0 of 10 overall 1 of 10 is about right not the worst movie I have ever seen but I am having trouble of thinking of something worse.","user":"jamesdgorman","rank":[3,5]},{"title":"Low budget,but good.","rating":8,"date":"28 February 2016","review":"While many seem to have not liked this movie,for whatever reasons,I thought it was pretty damn good,for a lower budget film. It has kind of a modern,yet classic slasher film,feel to it. Don't know how else to describe it. Good music throughout too,if you like rock. I guess it's not 'tons of gore&amp;tits in your face' enough for some. The knife kills were more implied,than seen. I like a little more to knife kill scenes myself,but still,these were'nt done too badly. Also,it's not too heavy on the 'sappy bonding moment',thing,that too many movies do with couples. Good acting,for the most part. Was'nt too fond of 'the sock part' LOL,but whatever,still a good,low-budget movie,that deserves a chance,IMHO. A fun movie.","user":"theviperqueen","rank":[1,2]}]