[{"title":"Excellent homage","rating":9,"date":"7 September 2010","review":"I really enjoyed this movie.<br><br>And I'm saying that as a huge fan of the original, Scum. <br><br>I don't want to spend too much time comparing the two titles but since it's pretty much a shot for shot remake, I'll touch on that later.<br><br>The plot is simple enough. Three teenagers are committed to a juvenile facility. What follows is a transitional phase within the prison between the three kids who basically run things and the newcomer, Butch, who is provoked into violently assuming the leadership role.<br><br>There are subplots as well featuring some of the other inmates and the guards. Davis, one of the newcomers, is a naive rich kid who can't handle the tough prison life. Max is the weirdo who has successfully freaked out everyone into leaving him alone by telling them he has AIDS. Goodyear is the bitter C.O., whose home life is being complicated by his job.<br><br>This film is supposed to be a commentary on the rehabilitation system, much like the original was. It does a decent job of showing the brutality of the system and how irrevocably flawed it is. Kids like Banks, the thug at the top, and his cronies basically enjoy this life and the control they can exhibit. The weaker kids, meanwhile, are left out to dry. No one gets rehabilitated. No one is \"cured.\"<br><br>One of the problems with this movie is that it doesn't know quite what it wants to be. It starts out with backstories for three of the main characters, except one of them isn't main at all and after arriving at the Elona Vale facility he all but disappears for most of the film. It then follows as pretty much a look inside a juvenile prison but breaks the flow with a flashback to a sex story one of the inmates is recounting. To me, that scene really didn't fit at all. It's like they touch on the lives of the characters but instead of making that the core of the film they try to do both but don't succeed. That was what the original did so well. The movie wasn't about the characters; where they came from, what they did. It was about the system and it's flaws.<br><br>Now, onto the inevitable comparison. Both movies are excellent and both have their strong points. But Dog Pound really is a scene for scene remake. It's tweaked some things and added some additional plot lines but anyone who has seen Scum will know exactly what happens all the way to the ending. Dog Pound benefits greatly from increased production values; it looks great and the hand-held camera work puts you right in the action. Scum on the other hand played out almost like a pseudo documentary and was very washed out and gritty.<br><br>Several scenes from the original have been altered, some for the better and some for the worse. The violence is awesomely brutal and you can literally hear the wet smacks of fists hitting noses and the crack of bones breaking. The riot scene at the end has been extended and is infinitely more bad ass. I actually had a bit of an adrenaline rush watching that scene. <br><br>Unfortunately they've cut down and taken out some parts that were crucial to Scum's plot and overall message. The rape scene, for example, has been pretty watered down and there's no guard witness. The subsequent suicide as well isn't seen, all we get a glimpse of is a body. The two scenes were pivotal in establishing the flaws and corruption of the borstals and giving the viewer a graphic insight at the inability of children to cope with such an experience. The guards are way, way nicer than in Scum. In a shocking way, actually. The riot at the end is supposed to be an expression of rage at the guards and the facility but there's really not much justification for it. The guards are super, super nice. Even Goodyear, with an obvious exception, of course, is pretty nice to the kids given the circumstances. <br><br>But my biggest qualm with this remake was the alteration of the original message. Yes, it does a good job showing the brutality of these prisons. But that's not just what Scum was about. Scum was also a commentary about how the prison system degrades not just the inmates, but the facilitators as well. Max, who is supposed to portray Archer from Scum, is disappointingly under utilized. In the original he provided the voice of reason, the opposition to the juvenile prison system. The scenes where Archer voices his theory on this with the guard over coffee is gone. As is most of his civil disobedience tactics from the original, like refusing to wear shoes and threatening to convert to Islam.<br><br>That was the underlying message of Scum. It wasn't just a prison movie, it was a social commentary as well. Dog Pound is just a prison movie. A good one, but lacking substance.<br><br>All in all though this was a very good film and an admirable homage to the original. The story is solid, the acting is excellent (Adam Butcher as Butch is mesmerizing) and unlike Scum which had a notable lack of music, the score for this film is quite good and used appropriately. I don't know when this is being released in the United States but I would definitely recommend seeing it.","user":"kjsundstrom-839-771870","rank":[17,19]},{"title":"Dog eat dog","rating":9,"date":"28 December 2010","review":"And considering it's a dog pound ... Seriously though: The movie is one of the best ones I have seen in a while, that contains people being locked-up (or in). I have to admit, that I have not seen \"Scum\" yet, which this movie is based on (or a Remake according to IMDb), but after seeing this, I have to go out and rent that one.<br><br>The characters on display here might feel a bit too distant and not everyone will be able to find a character he can entirely sympathize with, but that's what made it so intriguing to me. It's not showing a rose-tinted world. And it is not afraid to go ways, that other movies might have been. It's raw and sometimes feels like a documentary (though it obviously isn't).<br><br>Very good acting and a story that flows from start to finish, with no (visible) flaw in the storytelling. Highly recommended","user":"kosmasp","rank":[17,20]},{"title":"Inspired by scum","rating":7,"date":"24 September 2010","review":"Alan Clarke made the violent and barbaric movie Scum 31 years ago and there have been various attempts with smiler movies since, all trying to become the daddy of juvenile delinquent dramas, from Sean Penn in Bad Boys to Larry Clarke's Kids. This avaricious animal is the most successful attempt thus far. This attempt, albeit billed as 'inspired' by scum, is inherently a remake with three miscreants sent to a juvenile facility in Montana, with no chance of any hope of reform, forced into a system of sheer brutality forcing Butch (Adam Butcher) to go on the rampage. And though Alan Clarke's original film still has the edge, this perhaps has more relevance for a new generation of cinema goers which cleverly used real ex prisoner instead of conventionally well know actors, helping in part to set a more real and gritty tone. Having said all that I did enjoy it.","user":"doyler79","rank":[22,28]}]