[{"title":"Wonderful Interpretation","rating":10,"date":"13 December 2011","review":"It's always risky to make a book into a movie, and usually the flick doesn't live up to the tome, primarily because great literature explores the internal whereas film concerns itself with the exterior. Riskier still when the book is category-killing classic such as Golf In The Kingdom.<br><br>This film, however, gets it--beyond faithful to the feel, the spirit, and the mystery of the novel. Impeccable direction, inspired acting, and brilliant cinematography. A must see for any aficionado of Murphy's eternal gift to golf literature, not to mention any golfer who has ever played or dreamed of playing on America's only true-to-Scottish links course. I shan't spoil it by naming the location. You'll you'll just have to stay through the credits.<br><br>To the Producer/Distributor: please, PLEASE get the DVD out soon, because I want to see it again and again, and I'm running out of airfare.","user":"jlh-766-904880","rank":[6,8]},{"title":"As a lifetime golfer, I was bored silly by this movie.","rating":4,"date":"4 July 2012","review":"I gather there is a book written by Michael Murphy, perhaps about his real experiences in Scotland, on his way to India. But whatever that book might have been, this movie to me is a total waste of time. The director/writer does not have much of a resume' and this one will not add to it. I saw it on Netflix streaming movies.<br><br>Mason Gamble, who was good as the teenage golfer in \"A Gentleman's Game\", a movie I enjoy greatly, is recruited here as Michael Murphy , American student on his way to India, stopping off for a day of golf on the coast of Scotland. The movie was actually filmed at courses in the Oregon coast and, except for the distinctive Pacific NW evergreen trees actually passes pretty well for Scotland.<br><br>This is one of those scripts where no one ever talks \"plainly\" to the young American. When he asks a question he is answered in a way that doesn't seem to make sense, sometimes not answered at all. I suppose that was to try to evoke a \"mystical\" response, but it just became very annoying after a while. Also lots of daytime filming made to look like it was filmed at night on the golf course.<br><br>The story woven through a round of golf and conversation over dinner with the gang is supposed to be a metaphor for life, enjoying \"the walk\" between events. But it is told in such a dull and drawn-out manner that it loses most of its impact.<br><br>The acting is actually pretty good. Best is David O'Hara as the mystical golf pro, Shivas Irons. Malcolm McDowell is there also, but mostly in a cameo as Julian Lange. But the script and editing did not do much for the movie.","user":"TxMike","rank":[2,2]},{"title":"I expected a movie about golf. While it was it is more of watching a kid get a private lesson. I've seen better. B-.","rating":6,"date":"13 May 2012","review":"\"Michael you have to remember your in the land where all these rules were invented. It's the only way you can play in the kingdom.\" Michael Murphy (Gamble) is a philosophy student that is searching for himself. His one real love is golf and before he decided to give it up forever he stops by Scotland to play in the famous \"Links of Burningbush.\" I have said this before but I am a sucker for sports movies. Any kind and golf is no different. I really enjoyed \"Greatest Game Ever Played\" &amp; \"Bobby Jones\". The recent \"Seven Days In Utopia\" was also fantastic so my expectations were high for this one. While the movie itself is not bad and the scenery is pretty I was very disappointed. This movie is more of watching the young boy Michael meeting a golf pro named Shivas Irons (O'Hara) who proceeds to teach him about the game. The movie then becomes watching Michael get an hour private lesson about golf. I understand the book is great, but I wasn't that entertained by this movie. It's not bad, I was just hoping for something different. Overall, not bad, but more of movie about the rules and philosophy of golf then the sport itself. I give it a B-.","user":"cosmo_tiger","rank":[3,6]}]