[{"title":"Dark, muddled, badly shot","rating":4,"date":"22 June 2015","review":"I was looking forward to watching OUTPOST: BLACK SUN, having enjoyed the first film and being a fan of Nazi zombie films in general. However, this sequel appears to have been shot by a crew without much talent, because it's generally a mess, and a poorly-shot mess at that.<br><br>The story begins promisingly as a young woman tracks down an old Nazi in Paraguay. It's great to see the veteran Michael Byrne in this minor role. However, things start slipping when she gets teamed up with an obnoxious researcher (Richard Coyle, sporting an American accent) and a team of grunts to go and investigate another Nazi menace.<br><br>What this all boils down to is lots of shaky cam work as the characters run around, kill, and are killed by Nazi zombies. The villains are pretty weak here, indistinguishable from loads of other movies, and the characters are paper thin. Everything has been shot in the dark, and clumsily with it, which means the action is no better than something you'd see in the ultra low budget likes of THE ZOMBIE DIARIES: WORLD OF THE DEAD and its ilk. What could have been a strong and terrifying supernatural-themed movie turns out to be badly shot, badly scripted, and completely forgettable to boot.","user":"Leofwine_draca","rank":[9,9]},{"title":"A really pointless and poor sequel","rating":2,"date":"5 December 2013","review":"Outpost, the original was watchable and a good honest, original idea.<br><br>This incarnation, the sequel is a botched attempt at something, not sure what, maybe the actors got together to make a type of CV of their skills (which is pretty low judging by this) The acting, the accents and the plot are dire.<br><br>Furthermore, the story jumps and flits about like a grasshopper in mid summer and the only aim is to reach the end of the movie with room for a sequel.Oh dear.<br><br>No connection between events and the lunacy of the idea to make a sequel is plain to see.<br><br>Then, consider the special effects; I reckon a group of students clubbed together and chipped in £50 a piece to make a pseudo CV of their talents; amounting to about 0.5 / 10 Someone, somewhere must have stumped up hard cash for this drivel and I can only question their sanity for doing so.<br><br>I will soon be viewing the 3rd installment","user":"Info-340-323067","rank":[9,9]},{"title":"Lackluster Sequel","rating":4,"date":"2 May 2012","review":"I really enjoyed the first one, it was one of those films you came across and thought \"theres nothing else to watch\" but found yourself presently surprised.<br><br>The sequel however is a different matter entirely. Although not a bad film, its not a good one ether. The plot has a massive amount of holes, the script is straight out of a b-movie and the acting was fairly dull.<br><br>There were moments of excitement but they are few and far between and unlike the first film this one contains not a single tense moment at all. I found myself many times throughout the film checking my phone or tablet which is a pretty good sign of how interesting a movie is.<br><br>Sequels always being rubbish aside, don't pay to see this film, watch it on TV or stream it online when you've watched everything else of merit on Netflix.","user":"chinkychongchong","rank":[38,50]}]