[{"title":"It got to me","rating":9,"date":"9 September 2011","review":"Okay, I'm a male and a cancer survivor. This looked like an interesting movie, albeit a \"chick flick,\" but once I started watching I got completely hooked. Yes, the subject of cancer is again given the Hollywood-style treatment (no makeup, just a sallow look, and A FULL HEAD OF HAIR! Guess the filmmakers thought a bald actress wouldn't look so good in love scenes; also, I wish I had experienced the minor discomfort she does during chemo treatments, not to mention how energetic our heroine is when most of us feel like we're lucky to be able to just stand up). But all that aside, it was a beautiful movie message-wise, and after only seeing Kate Hudson in her first role many years ago in Cameron Crowe's \"Almost Famous\" (and not being that impressed by her), she has certainly matured as an actress. There were two or three scenes that really hit home to me and I could understand exactly what she was feeling at the time. I don't remember seeing this opening in theaters here in San Francisco, and if it did, it didn't play very long, which is a shame; I hope this isn't another film that's gone direct to video. \"A Little Bit of Heaven\" is about tying up loose ends, little by little, and realizing, finally, that life is a gift and to be celebrated in the short time we're all here. Don't deny yourself the chance to see this movie.","user":"avenuesf","rank":[105,123]},{"title":"A great movie.","rating":8,"date":"17 September 2011","review":"I saw this week \"Something Borrowed\", \"Bridesmaids\" and \"A Little Bit of Heaven\", and the rate seems so opposite to what I think. Bridesmaids 7.3 and \"A Little Bit of Heaven\" 5.9, I just don't understand how. This movie makes you laugh and makes you cry, I had seen some really really bad comedies that makes you cry! but this one really touches your feelings. This is my first review, the only reason I wrote this is because I think people should know it. In my humble opinion, this one was so much better . Kate Hudson's acting goes beyond to what we have seen before, I think she is doing it better and better with the pass of the time. Well that's it! Just to let you know what I think.. Thanks for reading it.","user":"hello-dean09","rank":[84,105]},{"title":"A different review from a Man","rating":9,"date":"6 February 2012","review":"Okay, I have read the other reviews of this movie, and I must say, I think the women are much more on base than the men. I believe the other men who have reviewed this, have some issues with what the world calls a chick flick... A Little Bit of Heaven, in my opinion as man, was actually the perfect blend of humor and drama, Kate Hudson's finest work that I have seen to date. Its a story of an individuals ups and downs of coping with death at a very young age. I felt this movie showed both the attempts to stay positive an upbeat as well as what I am sure happens, the anger to the people around you. For the reviews who gave this anything less than 6 minimum, but then rate \"The Other Guys\" a perfect 10, shows you they are just shallow. I am a father of 4 daughters, and can't imagine what it would of be like to go through something like this. I would recommend this movie to all, minus the men, who think they are too cool or tough to show a little emotion, as this movie in my opinion will bring tears to anyone...","user":"duane4321","rank":[53,67]}]