[{"title":"A beautiful film--and realistic","rating":13,"date":"13 September 2011","review":"If this film were total fiction bearing no relation to reality, it would still be worth seeing for the fine acting and production values--even if some of the young white women approached \"Southern Gothic.\" <br><br>But it wasn't fiction--at least, the depiction of Southern society wasn't. As I watched I kept drifting back to small-town South Carolina in the 1950s, where I grew up. It was moving and disturbing to be reminded how black people were treated then--loved and yet \"kept down in their place.\" Our neighborhood was all middle-class and every family had a maid. There were plenty of boys my age, we visited in each other's homes, and called every maid by her first name. One even started a baseball team for the little white boys, for which her reward was a visit by the Klan.<br><br>Our maid helped my mother cook and clean. One of my parents picked her up and took her home every day--and she rode in the back seat. She ate her lunch in our kitchen--without being allowed to use our utensils. I remember her eating with her fingers. I do not remember ever seeing her use our bathrooms. I thought about that during the movie and truly cannot recall what she did, an embarrassing gap in memory.<br><br>I do remember when my father was out of work and our maid had to be cut back to three days a week. I actually cried; she was a member of our family. When talk about civil rights began in the late 1950s, my mother became annoyed at our maid for getting \"uppity.\" And so it went. We moved to central Florida in 1961, where there were no maids.<br><br>Travel back in time with this film. It's quite real, and I highly recommend it.","user":"jwfuller","rank":[341,388]},{"title":"See this film","rating":10,"date":"9 June 2011","review":"I just returned from seeing a special preview of \"The Help,\" which is due out in theaters this summer. <br><br>Okay, so here's the truth: I'm a middle-aged, white male... I didn't read the book and I assumed, based on the fact that this is a virtually an all-female cast, that this was some sort of chick flick. Boy, was I wrong! <br><br>This is an incredible film that not only pays justice to the bestseller on which it's based (according to those who have read the book AND seen the film), but is phenomenally cast, with exceptional performances by Viola Davis, Emma Stone, Octavia Spencer, Bryce Dallas Howard and Allison Janney. Veteran actresses Sissy Spacek and Cicely Tyson also deliver incredible performances. While Tyson's character is central to the storyline, her role comprises what seems to be a few, precious minutes of the 2:20 running time, she delivers, in my opinion, one of the most powerful and moving moments in the film...one in which she doesn't even utter a line (trust me, you'll know when you see it.)<br><br>The Help also delivers some very funny moments and will make you laugh. I'll go so far as to say that this film and a few of its cast members will draw some Oscar nominations. I certainly think this takes Stone into a whole new level.<br><br>The racial imbalances of 1963 are well illustrated in \"The Help,\" and will, no doubt, underscore how far America has come, as well as how little progress we've made in the last 50 years. Either way, this is a powerful movie that needs to be seen on the big screen as soon as you can get a ticket.","user":"stevemcalevey","rank":[406,486]},{"title":"Minny Don't Burn Chicken","rating":7,"date":"13 August 2011","review":"Greetings again from the darkness. The film is based on the controversial best selling novel by Kathryn Stockett. It was controversial because it is the story of Jim Crow-era maids written by a white woman. Yes, the book is actually the fictionalized story of a white woman getting black maids to discuss their lives as maids for white folks. Rather than get into some politically correct dissertation on the book, movie or story, I will only comment on the film itself ... this very entertaining movie that also manages to deliver a timeless message.<br><br>Let me first start by saying that this movie is incredibly well acted. It is quite rare to have so many developed characters in one movie. There are some characters we immediately connect with, while others draw our ire each time their face appears. The script and these fine actresses utilize humor to point out the shameful behavior of those who saw themselves as superior. The humor doesn't soften the ignorance or abuse, but it does make the film infinitely more watchable and entertaining. Please know this is not a documentary.<br><br>Ms. Stockett's novel has a very loyal following in addition to the naysayers. A two hour film must, of course, take short cuts and trim story lines. Still the key elements are present. Based in Jackson, Mississippi during Governor Ross Barnett's term we see the social shark, Hilly Holbrook (Bryce Dallas Howard), in her full glory of ignorance, entitlement and superiority. We see her minions and followers emulating her moves while trying to gain her approval.<br><br>The story takes off when Skeeter (Emma Stone) graduates from Ole Miss and returns home and takes a job at the local newspaper. Possessing observation skills and humanity that her lifelong friends can't comprehend, Skeeter desperately wants to tell a story from the perspective of the maids. As expected, the maids are hesitant, but Aibileen (Viola Davis) does relent. The stories begin to flow and soon the robust Minny (Octavia Spencer) joins in. Others soon follow their lead and Skeeter's education goes to an entirely new level.<br><br>That's really all of the story I care to discuss. The brilliance of this one is actually in the details ... individual scenes and moments of acting genius by most of the cast. In addition to those mentioned above, Jessica Chastain plays Celia, the \"white trash\" outcast who so desperately wants to be allowed back into the girls' club. Ms. Chastain was seen a few weeks ago in the fabulous \"Tree of Life\" in quite a different role ... I would venture to say no actress will have two roles of such variance this year. Also, Allison Janney plays Skeeter's cancer-stricken mother, and Sissy Spacek is Hilly's mother who gets tossed aside before she is ready to go! The great Cicely Tyson makes a brief appearance as Constantine, Skeeter's childhood maid who was done so wrong after 29 years of service. Mary Steenburgen has a couple of scenes as a big NYC book publisher.<br><br>As a said, this is pure acting heaven, but I must single out Viola Davis and Octavia Spencer. Viola is so powerful at the beginning and end of the film, and Ms. Spencer is a force of nature during the middle. This movie is really their story and these two ladies make it fascinating, painful and a joy to behold. They both deserve recognition at Oscar time.<br><br>There are so many fantastic details to the film. At times, it is like watching a classic car show ... the late 50's and early 60's models are works of art. The wardrobe, hair and make-up are perfect in setting up the class differentials. The TV and radio segments provide context and timing with the deaths of Medger Evers and JFK. Even the books on Skeeter's shelf make a statement: To Kill a Mockingbird, Huck Finn, Native Son, and Gone With the Wind.<br><br>This story takes place 50 years ago and director Tate Taylor does an admirable job of bringing Stockett's novel to the big screen. Mr. Taylor is a longtime friend of Ms. Stockett's and was quite fortunate to get the directing rights. He doesn't disappoint. Sure the story is a bit glossy at times ... it is geared towards the masses. If you are looking for more depth, there are numerous documentaries available on the Civil Rights movement. If you are seeking a very entertaining movie that uses humor to tell a story and send a message, then this one's for you.","user":"ferguson-6","rank":[217,258]}]