[{"title":"Accept it for what it is...","rating":24,"date":"24 January 2014","review":"Let's talk plainly here... A poodle could of seen this trailer and automatically knew this wasn't going to be Hollywood masterpiece. If you saw the trailer and then still bought a ticket, then you don't have anything to complain about if you hated this film. This movie is about Gargoyles, Demons and Frankenstein!!! I doubt the best movie minds of all time could of turned this plot into a well made movie. It's SCIENCE FICTION people, not every film can get an 8.0 on IMDb. <br><br>With all that being said, I have to honestly say that I enjoyed this movie. Maybe I enjoyed it because I didn't go into it with high expectations. Yes, the plot was OOOVEEERLY simple, but it did have pretty good special effects and there was plenty of action sequences. Also, I'm a fan of Eckhart, Nighy and Jai Courtney. I would love to go into detail and use all type of specific film lingo to review this movie, but I would be wasting your time. If you want to escape reality for an hour or two and your a true sci-fi fan, I recommend this flick. If your looking for a movie with Oscar potential, you should sit this one out.","user":"funkhouser10","rank":[281,372]},{"title":"I... didn't find it so bad.","rating":6,"date":"24 January 2014","review":"I must admit that I enjoyed watching this supernatural action flick heavy on CGI effects despite its flaws. I wondered why afterwards. First, it seemed to follow from the book events and made a good point that the creature is not actually called Frankenstein. However, the \"creature\" itself, played by a strong Aaron Eckhart (Harvey Dent in Dark Knight) did not look like any previous incarnation. Mostly, it looked like a normal-sized, muscular, even handsome man with scars, not like a tall, grotesque, patchwork of a man as it should have been. So, the film following this trend of making \"monsters\" sexy bugged me, but the performance of Eckhart won me over. He might not have emoted much, as befitted the character who didn't learn how, but he certainly had the charisma and gravitas necessary. He didn't look the part but he acted the haunted, grim part very well.<br><br>So, the story starts not long after the end of the Frankenstein book by Mary Shelley at the end of the 18th century (1795). While burying his creator, Frankenstein, he find himself attacked by \"evil\" demons (who look like men, but with demonic faces sometimes) and rescued by, of all things, \"good\" gargoyles (who look human except when they're CGI gargoyles). The creature is brought to the gargoyle leader and quickly given a name, Adam. He's made an offer to join them in a secret war against the demons over humanity's fate. He declines and lives the next 200 years alone (would have been nice to see, but glossed over in a few minutes), defending against demons. Cue modern day, where his presence is revealed once more to the demons who are trying to bring back life to dead bodies for their own purposes.<br><br>So, instead of the overbooked vampires and werewolves, we have demons against gargoyles, plus Frankenstein's creature thrown in to act as wild card. I, for one, found that refreshing. However, the demons looked and acted like standard evil vampires, except when you saw their red eyes or their faces reverting to demonic. Except for their sophisticated leader, they were quite underwhelming and even boring from lack of personality. The gargoyles fared a little better, switching from medieval-looking, grey-tunic-wearing human warriors to big, winged stone gargoyles like you see on some old churches. They were supposed to be good (angels in disguise), but I liked their ambiguity. I didn't initially care for their obvious CGI looks, but they eventually grew on me, and who knows what animated gargoyles might look like anyway.<br><br>Foremost, this is an action flick, not really drama or horror, so it doesn't delve much on the inner psychological turmoils of Adam or his everyday \"normal\" life, nor does it try to scare or gross you out. However, the somber, tormented portrayal by Aaron Eckhart (mostly with his face and eyes) made him an interesting anti-hero. The action itself was peculiar. There were cool set pieces where tons of demons fought gargoyles around a very impressive-looking Gothic church. It had an epic feel to it, it was quite exciting, but you seemed distanced from the action because it cut things fast and the camera often pulled back. Also, there was a particular vibe as the numerous, weak demons were mostly slaughtered by the fewer, powerful flying gargoyles. It was usually one blow, one kill. On the other hand, you had one-on-one fights involving Adam that were very good for the most part. There were still quick cuts, but it wasn't abusive, sometimes lingering a bit on an angle, making for more involving and easier-to-follow battles. The musical soundtrack was better than expected with epic-sounding classical music and dramatic choruses.<br><br>Storywise, I found the concept interesting, the demons' motivation made sense, and it didn't hinder my enjoyment with too much obvious stupidity, except a few places where I thought things were just too convenient (like no civilians in the streets or the \"secret\" base of the demons being so close to the church of the gargoyles). The dialogue seemed awkward or cliché at times, but it was said with such sincerity that it passed through anyway except for a few chuckles from the audience. I liked watching the film, but I don't think I would have wanted to pay full price for it in theatres though. It was like a summer blockbuster but in the middle of the winter.<br><br>Rating: 6.5 out of 10 (Good)","user":"Quebec_Dragon","rank":[123,176]},{"title":"Doesn't deserve the overwhelming negative reviews","rating":8,"date":"27 January 2014","review":"With a miserable 5% on Rotten Tomatoes, it seems like I, Frankenstein is one of the worst movies in 2014 and it is only January. The abysmal rating made me lower my expectations and surprisingly it is a solid entertainment. Sure, it doesn't impress on any level but for a January movie, it is an entertaining one.<br><br>The story: The story is as generic as a Direct-To-DVD movie can be. The Frankenstein's Monster, Adam, is caught in a battle between Gargoyles and Demons. Many decent action and 'dramatic' scenes are squeezed into the brief runtime of 1 hour 32 minutes. Thankfully the pace moves briskly without becoming boring. However, the short runtime also poses some problems such as skimping on characters' development. But it is expected as this is a mindless action movie which relies more on action and CGI than story and characters' development. Acting wise is okay, nobody impresses. Bill Nighy is playing his usual self as a villain. Aaron Eckhart has nothing much to emote as an emotionless monster except fighting and showing off his body. The rest didn't particularly stand out. Music is surprisingly good and fits the tone of the movie.<br><br>3D: For a post-converted 3D movie, it looks good. There is a good depth between characters and backgrounds. It is also effective when it comes to action scenes especially the flying of Gargoyles and the bursting of the demons.<br><br>Overall: It is obvious that I, Frankenstein tries to follow the success of the Underworld movies. On its own merits, it provides an entertaining watch with decent special effects and action. I guess it could do better if it is released straight to DVD. It may not be great but for a January movie, it is a decent watch with decent 3D.","user":"helmutty","rank":[152,231]}]