[{"title":"Less like a geographical reboot of D-9 and more like an art-house Cloverfield or a blockbuster Stalker","rating":9,"date":"8 August 2010","review":"While there have been plenty of valid comparisons made between this film and last year's sci-fi hit District - 9 (due solely to the fact that the two films share an admittedly similar global concept; that of aliens landing and being contained within a restricted zone as a forced but entertaining allegory for racial disharmony. There the zone was in central South Africa and here it is the northernmost section of Mexico, the borderlands.) I think the media have missed the much more obvious filmic connections. To my mind this film is in fact less like a geographical reboot of D-9 and more like an art-house Cloverfield or perhaps a blockbuster Stalker (Andrei Tarkovsky's epically sparse sci-fi classic). While the concept and metaphor certainly match that of District – 9 the closest the execution sways it further towards a combination of the latter two examples.<br><br>Instead of attempting to tell the story of a fictional universe using a number of cipher characters like D-9, this film instead tells the story of its two leads by way of its alien infestation. The titular monsters certainly are an integral force in crafting and driving the films narrative but they are not its real focus, this is where the two films differ. Instead we are made to follow American investigate journalist Colbert who is tasked by his employer to find and then accompany his daughter through the infected zone and into the United States before the beginning of the creature's active season.<br><br>It's a sparse plot and one that leads to a lot less action than you would expect, but it does work as the spinal centre of the film. Instead of confronting the creatures at every turn, discovering their origin, their weakness, their queen and then eventually using their knowledge to develop a dues ex machina and save the day like the big damn heroes of every similar film, these two simply exist in the universe like we do ours; as everyday citizens living their everyday lives. That's not to say though that the film is in any way banal; in fact their journey through the zone allows for a lot of stunning shots, shocking stories and silent terror, it's just that these occur in a different tense then we are used to. We are, like the protagonist Colbert, journalists in this world; we follow in the wake of the story, catching occasional glimpses of it from afar but mainly focusing on who and what it leaves behind.<br><br>The monsters, their destruction and the alternate world that they destroy are all filtered through the protagonists before they reach us upon the screen. It is their reactions to the events that elicit responses in us and their responses that in turn become our emotions. It is essential that the two leads be well crafted in order for this method to work. Thankfully then, they are; Hitting that perfect ratio of realism, stereotype, flaw and likability. They are the kind of characters that you would happily follow within the comparatively banal confines of a drama and so here, in this realm of heightened stakes, they become doubly interesting. The real surprise of the film for me was just how enjoyable, and oftentimes moving, it was to take this trip with the leads; to the point that by the time the ending rolled around I almost echoed their calls of 'I don't want to go home'. That dreaded disillusionment, the return to drudgery after a distinctly powerful event is something I can really understand but it is something uncommon to see in cinemas. Edwards isn't the only person to be thanked for this though; while his writing is great it's the two lead performances that are really essential and I think these two will be ones too watch in the future.<br><br>While I've made it quite clear that personally I preferred the human side of the story - that I could take or leave the monsters in comparison – i know there are many others around here who will not feel the same, others that are in it for the monsters (Spaulds certainly comes to mind). While I wouldn't advise taking that particular approach with this particular film, I don't think any of you creature features that do will be disappointed with what you see – and yes, you do see. The creatures are as well designed and animated as the characters. They feel totally alien to this world yet retain a certain sense of plausibility, as if they could feasibly belong to some other. Their power is also very well handled, being threatening enough in every situation but invincible in none. There is then a consistency to them that doesn't exist in a lot of other creatures, which sometimes feel like they are acting in accordance with the plot rather than their own rules or reality. While this may get some of you salivating I have to say again that well designed or no these creatures are little more than an external force, they exist off screen much more than on.<br><br>It is then, an ironically titled film I guess because the Monsters of the title are anything but central. I think the real test should be whether or not you would go and see this film were it called 'Humans'. Those that do, more specifically those that make their way all the way through to the final act, will be in for a treat as the film has a handful of utterly sublime moments. The ending itself was a little abrupt but I think it's pretty clever, probably warranting a second watch. Definitely warranting a first watch.","user":"foamhands713","rank":[357,532]},{"title":"Less action than expected, but 9/10 imagery, acting, and direction.","rating":9,"date":"1 October 2010","review":"The first 3 reviews said it all. Amazing movie for a $15k budget. Amazing shots and scenery, good plot line, great acting from leads. Decent monsters and action, when it occurs. I'm starting to think it's the soundtrack that makes a movie seem \"big\". This movie's eerie sounds, and tension building strings draw you in, like a blockbuster. Can't believe this guy wrote, directed, edited and did the efx. A++++<br><br>And ignore the whiny babies crying about this and that. They'd rather watch blood pour out of a corpse than a decent piece of acting. As long as you don't expect another Cloverfield, you should be surprised by a unique cinematic experience. ;)","user":"jephbennett","rank":[261,396]},{"title":"Satisfying movie, if you get what sci fi really is","rating":8,"date":"31 October 2010","review":"I first heard about this movie in a radio interview, so I was aware that it was very low budget. But lately \"sci fi\" movies have been all about escalating action to the point of absurdity. Classic sci fi is about people reacting to new/mysterious/dangerous situations. This movie has that, with interesting protagonists. It has echos of Sin Nobre and El Norte, and yes, the context of \"alien substitution\" echoes District 9. But it's not a re-make, and it's consistently entertaining, with a straight-ahead narrative. There are only a few moments where a shock reaction is telegraphed. A big studio would have made this story into an effects extravaganza. But in my opinion it's more effective showing limited interaction with the aliens.<br><br>If you can handle real sci fi -- movies without the excesses of Transformers or 2012 -- this sci fi will satisfy.","user":"BillK","rank":[207,313]}]