[{"title":"A mediocre action-comedy to kill time","rating":5,"date":"9 August 2011","review":"NOTICE: If you are looking for a high budget tactical operations movie with hundreds of crew, do not watch this movie, instead go try some Denzel Washington movie. But notice that this movie's budget is not somewhere near what Denzel is paid for a movie. I do not even mention if you are looking for a Goldener Bär or Academy Award Nominate. This movie itself DOES NOT aim such a thing.<br><br>The movie is actually a short story of 4 careless officer (3 guys + 1 woman) who love more action and less thinking. Most of us are used to watching action movies in which there are clever S.W.A.T. officers who always put the hostages' (even criminal's) safety as priority during their operations. But heroes of this movie are exact of opposite of this model. I mean they are looking for more action even they lose a team member. This intent behind the hard-look of those policemen gives the viewers an absurd feeling, and I must say I liked it.<br><br>I do not want to go too deep about the technical aspects but I can say that the acting is O.K. (Especially M. Jai White's acting and Lexa Doig's beauty worth mentioning) Musics and sound effects fit the action. Dialogues are usually silly (But again usual for this kind of action), similarly storyline is predictable, but that does not really disturbs while following.<br><br>Well, I'd like to say this movie is worth watching if you like non-stop action, and if you are not looking for real art. 5.5/10","user":"clarioncall","rank":[10,10]},{"title":"It was a fun, entertaining movie.","rating":6,"date":"1 August 2011","review":"If you start to play this movie and you are expecting it to be a serious police drama that is 100% realistic you will be in for a round of disappointment. HOWEVER, if you watch it and just go along for the ride, you'll get some laughs, some adrenaline rushes and basically be able to have something fun to talk about with your friends.<br><br>I'm sure that there are some LAPD cops out there saying, \"You gotta be f***ing kidding me!\" and LAPD S.W.A.T. units are going to be hiding their patches for awhile to try and live down the \"crazed cowboy\" image this movie has painted of them. But take heart guys, I think anyone with a functioning brain will realize that the good guys are just as LARGER THAN LIFE as the bad guys are.<br><br>It's an action movie and to be honest, I have to say that although the characters were outrageous stereotypes; the people portraying them did an excellent job of carrying it off without making it too campy. Especially kudos to both females in this movie because they carried off their parts well without having to depend on their sexuality.<br><br>**************************SPOILER ALERT******************************** <br><br>It truly began to feel like a James Bond movie with the number of times that our heroes got captured and were ABOUT to be executed but somebody just had to say something before pulling the trigger. That is probably the only thing that really threw it for me. Bad guys were shooting and shooting to try and kill these cops and when they do finally get them, they TALK instead of shoot. As was said in an old classic movie, \"When you're going to shoot somebody, shoot, don't talk.\" All in all, give this movie a watch and make sure you do it with a few friends because you'll be laughing and talking about it for long after the final credits roll. ENJOY!","user":"davidfurlotte","rank":[19,22]},{"title":"Worst \"SWAT\" movie ever.","rating":3,"date":"2 August 2011","review":"A really good example where larger than live characters work is Stallone's \"The Expendables\". Here they tried but the characters just sound dumb. As do all dialogs in \"Tactical Force\". Throughout the movie I had the feeling that the cast wrote the script themselves while having a few drinks too many and now they made it into a movie with the sole goal of having some fun themselves, no matter the outcome. But while it looks like they really had fun doing it the only reason I watched through the whole thing was to see all martial arts scenes with Michal Jai White because those few were the only half good thing about the flick.<br><br>I'm pretty sure if any SWAT member ever sees this movie he'll face-palm himself black and blue because kids playing cowboys and Indians in the garden show better tactics and skills then the SWAT team in this movie.<br><br>Then there is the endless talking of the bad guys in every moment they are in control. It's like they were thinking \"how long can we stretch the cliché of the bad guys talking too much until they get overpowered until someone switches off the movie or starts taking vodka intraveinously to find some fun in it?\".<br><br>The movie also had two female characters but they don't do much except getting one over the head at some point and more or less looking pretty. Lexa Doig in SWAT gear is the \"less\" and Candace Elaine in leather the \"more\".<br><br>It seems they tried to give the dialog this cult movie style of humor, the one that's pretty well executed in \"Mean Guns\", but all I could do here was roll my eyes. As I said before, it just sounds dumb.<br><br>I think you really have to be a fanboy/fangirl of one of the actors to find anything enjoyable about this movie. For me that was Michael Jai White, without him I'd switched it off after 10 minutes.","user":"tatsu2050","rank":[30,39]}]