[{"title":"Wonderful Performance By Bill Murray","rating":8,"date":"26 December 2012","review":"I don't get all the negativity directed at this film. I thought it was charming and witty. History is rarely so much fun.<br><br>The story is simple enough. On the eve of World War II King George VI and his wife journey to the US to see President Roosevelt at his family's Hyde Park retreat hoping to secure American support against Nazi Germany. The FDR we see here isn't the Great Depression/war leader he's a weary man battling polio and trying to find solace in relationships with a distant cousin among others.<br><br>Bill Murray gives an amazing performance humanizing the 32nd president an avid stamp collector who during this period when another European war appeared inevitable was more likely to find himself seeking peaceful coexistence between his dominating mother and estranged wife, Eleanor. Laura Linney is Margaret Suckley an unassuming, humble cousin who becomes a regular visitor to the retreat at the time of the royal visit. Samuel West and Olivia Colman are a convincing King and Queen making the first visit in history to the US by a British monarch. I found \"Hyde Park On the Hudson\" a delightful little film and the 95 minutes flew by leaving me wishing for more.","user":"georgep53","rank":[53,60]},{"title":"Franklin Delano Murray.","rating":9,"date":"31 December 2012","review":"Hyde Park on Hudson is no mixed bag, as some may have you think. Bill Murray turns in a perfectly mannered, whimsical performance as FDR and is very ably supported by an award-worthy cast that includes Laura Linney and Olivia Williams. It's funny, yes, but it's not a laugh riot, nor is it meant to be. It's a postcard look at a lost time, the first visit of an English monarch to a sitting U.S. president, dappled with a touch of uncertain, unlikely, and illicit romance.<br><br>It's a few years before The Big One, WWII, but there's a storm a-brewing in Europe. Everyone knows it, but relations between the U.S. and England have been strained, something about revolting and then fighting in the War of 1812. Ancient history to some but not all, it would seem. At any rate, King George VI and Queen Consort Elizabeth (Samuel West and Olivia Coleman, respectively) travel to America to visit Roosevelt with the intention of securing his support for the upcoming war. But rather than host them in stuffy Washington, DC, FDR (contrary to the real visit) invites his royal guests to his home away from home, Springwood, a stately manor in upstate New York. It happens to be on the Hudson River, or near it, in case the title has tripped you up.<br><br>Now, FDR was quite an unusual president. He was the last to serve more than two terms, as the Constitution was amended later. Also, he had polio, which he had contracted as a child. The funny thing is this - people went to great lengths to pretend nothing was wrong with Roosevelt's legs whatsoever. The Emperor had no clothes. Even the press were complicit, gamely waiting for the president to be lowered into the back of a convertible before taking their pictures and asking their questions. Can you imagine that today? The slightest limp by a leader seems to imply a lack of leadership in the minds of some.<br><br>And so it was at the time, only not. The nation turned its eyes to Roosevelt as a resolute, optimistic leader, a man who could help them finally rid themselves of that awful Depression, and so they gladly ignore whatever shortcomings he may have. The king of England, meanwhile, is in a similar situation. He is the same George depicted in The King's Speech - you know, the one about the king who stuttered? FDR, who is much older, is not as self conscious about his malady as he used to be, whereas poor George is practically frozen by his own. Now, recall that the king and queen are visiting to gain the support of America; FDR already knows this. He could easily just issue a statement to the effect that the USA would help England in any way it could, but he chooses to host royalty instead. He wishes to meet the man beneath the crown, and he wishes to size him up. <br><br>Enter into the fray a quite-distant cousin of FDR, a Daisy Stuckley (Linney), who narrates the story. Daisy is introduced to the president, and somehow they find a connection. Daisy, like the arriving king, is also unsure of herself, a bit of an ugly duckling among the glamor of the president's residence. They find in each other a kindred spirit. Franklin is more or less estranged from his saintly wife Eleanor at this point (they live in separate houses in New York!), and although he cannot walk, he does enjoy him some female company.<br><br>But what is this story really about, anyway? It depends on your own perspective. Some will see this as a docudrama reflecting the meeting of two leaders (and their wives); some will see it as a comedy, an intelligent, subtle comedy with a barely smirking Bill Murray. Others still will find romance in almost every scene, no matter who the players, no matter where the setting.<br><br>Murray deserves an Oscar nomination here, and perhaps the Academy will make up for their Lost in Translation snub. Linney does as well; her Daisy never undergoes a sudden transformation into a woman with a real backbone. She seems sad much of the time, working in the White House with tightened lips. Her life appears joyless; that is, until she has some alone time with Franklin, whence a window to a sunnier day slowly opens.<br><br>Hyde Park on Hudson is a gorgeous movie with a splendid, bemused, and convincing performance by Bill Murray as our 32nd president and endearing, exhilarating role for Laura Linney. Each should be richly rewarded come award time.","user":"dfranzen70","rank":[68,81]},{"title":"Through one affair, one perfect friendship is formed at the beautiful Hyde Park on Hudson","rating":8,"date":"9 February 2013","review":"In 1939, King George VI (Samuel West) and Queen Elizabeth (Olivia Colman) made the trek across the ocean to visit American President Franklin D. Roosevelt (Bill Murray) at \"Hyde Park on Hudson\". It was the first trip of its kind and tensions were high. First Lady Eleanor and Mother Roosevelt expected perfection, and the Queen (the eventual Queen Mother) also expected perfection. Roosevelt was in no shape to deliver perfection.<br><br>Mostly confined to a wheelchair and married to a woman he did not love, Roosevelt reportedly had affairs. The film focuses on one such affair that started just before the King and Queen of England were to arrive. Margaret \"Daisy\" Suckley (Laura Linney) is FDR's distant cousin and she is excited for this new turn in her life. She essentially moves into the Hyde Park residence, is convinced of Roosevelt's need for her, and won't accept a lesser role in his life. She's a tough pill to swallow and it's unfortunate that she's the main character of the film.<br><br>The best characters of the film are easily Franklin Roosevelt and Bertie (the King). Murray transforms Roosevelt into such a humanized version of the esteemed President that he's always relatable, always likable and always entertaining despite the pedestal that he's on and despite the pedestal that he probably shouldn't be on. West gives a pitch-perfect, award-deserving portrayal of the humble would-be King providing an understanding confidante for the President. Together they provide the film with an undeniable comedic chemistry and also an honest dynamic that gives it a much needed stability as it tries to find its way as a comedic, dramatic biopic.<br><br>The other women in the film, notably: First Lady Eleanor Roosevelt (Olivia Williams), Mrs. Roosevelt and Queen Elizabeth, were portrayed with a likely honest, indifferent, and distant air. That approach allows the film to make no judgements about these three strong, independent and forceful women who have all forged their way into history. We only see them through their equally strong husbands (and son) and we can form our own opinions.<br><br>True to its name, \"Hyde Park on Hudson\" has beautiful cinematography. While it's shot in England rather than New York, it is a suitable substitution, recognizing the source of the inspiration for the name, the architecture and the landscaping of the Presidential family estate in upstate New York.","user":"napierslogs","rank":[11,13]}]