[{"title":"Wow two thumbs up","rating":9,"date":"15 January 2012","review":"Obviously lacking a significant budget, but wholly cow. This film hit home, as my wife and I are both from Army families. It is centered on a redeployed Marine, and the troubles his family deals with at home in his absence. Very slow at first, but it really takes off about mid-way. I am not ashamed to say that I that lump in my throat, and the water in my eyes more than made up for the slowness, and lack of high dollar fancy stuff. The writers/producers/directors nailed a wonderful movie on the head, and it is absolutely worth watching. The characters were selected, and played quite well, and man, that little guy can sing. The end of the movie, was one of the most powerful tributes I think I've ever seen, and the dedication was perfect. I can't say it enough, that this little film is a must see.","user":"wmjoe1953","rank":[21,27]},{"title":"Great family movie, good tribute to our Soldiers","rating":9,"date":"16 September 2011","review":"Heartfelt, entertaining and very sweet. Starts out a little slow, but quickly catches your attention. Rather than keeping you on the edge of your seat with anticipation, Lifted takes a closer look at the passion behind the music, and, more importantly, gives a glimpse into the life of a soldier's family. There was no profanity, no scanty clothes, and no innuendos, which is probably why it hasn't gotten much attention. This is safe to watch with any audience. The purpose of Lifted might have been to show viewers something of what soldiers sacrifice every day, and they did it beautifully. The song \"Letters from Home\" came to mind several times. Definitely worth watching. Do come prepared with Kleenex.","user":"margiekeith07","rank":[27,42]},{"title":"Great Movie! You MUST watch!","rating":10,"date":"28 January 2012","review":"I have watched this movie several times. After finding this film on Netflix, I loved it so much, I found some copies on Amazon and bought 4 copies to give away. The acting was done beautifully, the singing was awesome, and the reality behind a family's emotional life in the absence of they're beloved service member is so right on point. WOW! That kid can really sing! You will find yourself falling for that kid and rooting for him too. The real love he and his dad share in the film is just amazing! This movie is one of my top three favorites now. What a great tribute to our wonderful troops. There is no greater spirit than the one from our precious American Soldier. This movie provides a glimpse of that...and the end? One of the GREATEST endings ever and completely unpredictable.","user":"Cranberryicetea","rank":[16,24]}]