[{"title":"Not overly remarkable in any way...","rating":5,"date":"3 April 2014","review":"\"HairBrained\" was an adequate movie, it wasn't great, nor was it a waste of time. I must admit that I really had expected a little bit more from it.<br><br>The story is about an odd friendship between a young 13 year old genius who is attending college and a somewhat mature and out of place student. Despite their differences, they are kindred souls in a way.<br><br>There weren't any laughs in the movie to be found anywhere, and the movie was frightfully predictable. But what made the movie bearable to watch was the performances put on by Brendan Fraser and Alex Wolff as the two out-of-place individuals in a college environment.<br><br>I didn't really get the deal with the strange hair on the Eli Pettifog character, it was just too much and it was a nuisance to look at throughout the entire movie.<br><br>\"HairBrained\" is the type of movie that you are most likely to watch once and not bother to pick up to watch a second time, because it just doesn't have enough contents to support more than a single watching.","user":"paul_haakonsen","rank":[16,18]},{"title":"Doesn't quite hit the spot","rating":6,"date":"6 October 2015","review":"Overall the movie is fairly enjoyable but it has some turns that just feels very forced and contrived.<br><br>And although the cast does a fine job there are some random character developments with some of the smaller roles that seem to happen instantly and completely out of the blue, for instance the popular girl who's personality literally changes from one scene to the next in one moment of the film.<br><br>And other random odd ideas, which doesn't seem like they were meant to be funny but just poor script-writing and lack of knowledge of human interaction or potentially something made up on spot while filming.<br><br>I won't go into too much details as I don't like to spoil movies but I'm sure if you watch it you'll figure out instances I could be referring to.<br><br>Anyways besides that yeah it's fairly entertaining it's just not as good as it could have been.<br><br>Oh and despite Brendan Fraser and Alex Wolff's tennis get-up on the poster I don't actually remember them playing tennis once in the movie (and I just watched it) so unless I dozed off a minute and they did that for 20 seconds then there's no tennis in this movie (and that seems unlikely).","user":"Seth_Rogue_One","rank":[5,5]},{"title":"not bad for an unknown film...","rating":7,"date":"6 April 2014","review":"I actually liked this movie, although I can see why others wouldn't. When I started watching, I thought it was a Brendan Frasier film, but it is most definitely not. Although he does a fine job in it, he is most definitely in a supporting role here. The acting was all around pretty good and the jokes, although a bit obscure, were quite good. It seemed to be fairly well written, and definitely had a certain \" feel \" to it from beginning to end. My suggestion would be that if you enjoy Wes Anderson films, you'll probably enjoy this. It's not quite as Quirky and odd, but definitely has the same vibe to it. Would definitely recommend for a rental.","user":"rooag","rank":[12,15]}]