[{"title":"Really enjoyable","rating":7,"date":"27 May 2012","review":"First of all I want to say this, I really like animation films and I actually liked this more than the first Happy Feet. The characters felt more developed and they went through a more interesting journey. This film aims to tell to children not to lie and how important the friendship is. However I have been astonished when I have seen rude comments on Happy Feet 2. I think people are being too harsh on this movie. Some critics refused to look deeper because this is not their usual type of child animation film. I am actually shocked while reading some of the scathing reviews. Also, I think people are being too hypercritical because the first Happy Feet won the Oscar. I loved this movie and I found it far superior to Rango, Gnomeo &amp; Juliet and Cars 2. The animation was amazing. In my opinion, it has the best production values and cinematography of any animated film of 2011, I have watched lately. The story is in-depth, layered, complex and much more meaningful than the first Happy Feet. Also, there are significant themes and messages about community, teamwork, bravery, overcoming obstacles and environmentalism. I laughed, cried and felt such empathy for these penguins because this movie has a lot of soul and heart.","user":"celiktugce","rank":[15,15]},{"title":"Happy Feet 2 Review","rating":10,"date":"18 November 2011","review":"Happy Feet 2 is amazing. As a 12 year-old, I suppose I haven't watched even a total of 30 movies or such to rate this as 10 but in my opinion, Happy Feet 2 is almost as good as the first. It contains the hilarity and also amazing songs, similar to Happy Feet 1. I watched this movie with about 19 of my classmates and two of my teachers as a farewell on our graduation from school. When Erik started singing to the elephant seal, the scene itself was so sad I couldn't help but start crying. And I love those two krill, Bill and Will if I'm not mistaken...One asked the other of they could have children and the other replied that they were both males. Hilarious! My favourite quote \"We're doomed and they're dancing. Unbelievable!\" I recommend this movie to others because I enjoyed, became emotional and had a lot of fun!","user":"LarissaBeth","rank":[14,20]},{"title":"Pretty, but all over the place","rating":4,"date":"28 January 2012","review":"I watched this today with two of my younger sisters, one of whom regarded the first movie as her \"favorite movie ever\" (before Kung Fu Panda came out) and was really excited for this sequel. As soon as the credits rolled, she commented \"That was... off.\"<br><br>(Spoilers! Spoilers! Spoilers!) First of all I'd say that the visuals were amazing as before, as well as the music and choreography. But the plot... it reminded me of how I used to put my iPod on shuffle and make up stories to go with it. A whole musical number just to calm upset Erik down? A bunch of elephant seals singing while stampeding? I was generally surprised and not sure I should be humored or facepalming at the inclusion of \"Never Gonna Give You Up\" and \"Dragostei Din Tei.\" I mean did I really have to get rickrolled by krill?<br><br>Oh and the krill. I kinda sorta liked the idea, but their almost pointless side-story had me rolling my eyes. The audience we were with seemed to like them, though, and laughed every time they appeared. So I guess YMMV.<br><br>There were WAY too many accents and half the script was lost on me as I tried to process what each person was saying, having to quickly switch from American to Spanish to Swedish (Romanian?) to Indian, etc.<br><br>The environmental message was even more heavy-handed this time (tufted puffins apparently all killed off, oils spills, global warming, etc.) I agree we should be concerned with these, but the constant shoving of it in your face makes you numb to the idea. This is coming from an environmentalist.<br><br>That said, there were a bunch of things that bothered me that PROBABLY wouldn't bother most people. Like why there were African Black-footed Penguins (Africa) and Little Blue Penguins (Australia and New Zealand) living with the Adeles? Or why Mumble is still fuzzy after having almost lost all his down in the first movie. Or why Eric has all of the same markings as his father and is the ONLY blue-eyed penguin aside from his father. Is he retarded too? Did they just run out of character design ideas?<br><br>All of this, plus the plot not really picking up until about a third of the way through the movie, bothered me... but it was kinda okay. Again, the visuals were great and I very much enjoyed the music. The penguins and other animals were fun to watch and for the most part realistic. I was dancing along to the big dance numbers and thought the reveal of Erik's talent was awesome (even if it sounded like an opera singer inhaling helium).<br><br>So, sure, if you want something energetic and cute to sit your kids down in front of, be my guest. I might even watch it again, if I can get around the dead plot and nature issues. It's fun and pretty to look at. Just shows what a superficial, visual race we are.","user":"Armgirls","rank":[13,19]}]