[{"title":"Funny, but too long and very hard to relate to","rating":6,"date":"14 October 2016","review":"I am not sure what to make of Bridget Jones's Baby.<br><br>On the one hand, it has undeniably funny moments. On the other hand, many of the gags fall flat. This didn't stop many others in the theater from laughing their heads of, but it did leave me wondering what I was missing that made it so funny.<br><br>And considering that I'm almost in the right demographic for this film (almost, because I'm male), I found the characters very hard to relate to. I'd say both the characters and the portrayals are to blame. Zellweger does a good job, but that's easy. Colin Firth is the quintessential Mr.Darcy, but this is also the problem, because by now his Mark is boring to death. We know what Mark is like, and it would be great to see him do something, anything, besides being Mr.Darcy. But he never does. Patrick Dempsey's portrayal of Jack was simply lackluster. It was a role that someone like George Clooney would've probably nailed, but Dempsey was really struggling to look and act the part. At times he looked like he really really didn't want to be there. Sloppy script doesn't help either - at times I really struggled to understand why his character would be there at all. On the bright side, Emma Thompson is a standout - she manages the steal every scene she's in, and adds the wit and the sarcasm that BJB is so desperately lacking.<br><br>Finally, the movie is too long. The gags are overdrawn, punchlines are spoon-fed, and the story just drags on and on. Time and time again I almost found myself screaming at the screen \"fine, I get it, move on!\"<br><br>Anyway, 6/10 for the laughs. And please don't make another one.","user":"AlienByChoice","rank":[27,37]},{"title":"Light Romantic Comedy that works","rating":9,"date":"5 November 2016","review":"First of all, this is not supposed to be a heavy, meaningful, deep film. People are judging it on what it is not supposed to be. It is light, funny, romantic and the name Darcy hints on what it is more about. It is about love and finally getting with the person you are meant to be with. It is a modern day Jane Austin story of love and tanglements. The actors are lovely and their characters are credible and sweet. My usual genre is crime so for me to enjoy something as light as this it has to be good. If you like these actors and feel like something romantic and light then you will enjoy this film. If you want to judge it by a criteria that it is not pretending to be then you will be disappointed. It entertains as a romance and comedy. Nothing heavy or earth shattering but it is a good movie.","user":"KathleenK22","rank":[33,48]},{"title":"Loved It!","rating":10,"date":"10 January 2017","review":"I absolutely loved Bridget Jones's Baby! I was afraid that after all this time, the humor of the previous films (especially the first one) would be lost. I was very pleasantly surprised! My husband, who never cared for romantic comedies, actually watched the entire movie and laughed most of the way through. It is great to see Bridget at a later stage of her life. ( as well as the other characters... Mark Darcy,Jade, etc.) I would highly recommend it to any \"true\" Bridget fan. I also agree with some others that Emma Thompson was a great addition to the cast. I just bought the DVD and have already watched it again. It is great to see a sequel and not be disappointed!","user":"sullydo","rank":[18,25]}]