[{"title":"It Was and It Wasn't","rating":9,"date":"10 August 2010","review":"Being an American rather new to Shakespeare, I have come to discover that Hamlet is my favorite play, and as of today the David Tennant and Patrick Stewart version provides the breakthrough to understanding this complicated play. I have watched all versions of Hamlet available and was quick to check out the newest one; however, Patrick Stewart was the only familiar actor to me. I have not a clue who Dr. Who might be. Just as well, as that might have tainted my view of Mr. Tennant's acting. Most contemporary productions of Shakespeare border on silly (Leonardo D's version of Romeo and Juliet) to ridiculous (Ethan Hawke's Hamlet), but this version rocks, to use an overused phrase.<br><br>I thought the juxtaposition of Shakespeare Old English in a Modern Setting worked amazingly well. The talents of the cast came together superbly (wished for a different Ophelia though). Polonius reminded me of a more dignified version of Bill Murray's treatment, but still caught the pompous drift of the character. Horatio played the devoted and loyal friend to great satisfaction. His Roman to the death speech had me crying all three times I watched the dramatization. I thought Tennant's version of Hamlet contained a measured lunacy, the intelligent fool who had mostly everyone fooled. The To Be soliloquy had the right intensity and then in a moment Tennant switches to Guarded Lover with Ophelia and Knave of Fools to Polonius.<br><br>I'm up for another view after writing this. Three hours spin by as I absorb new nuances and understanding. What a marvelous way to spend the afternoon.","user":"pdwebbsite","rank":[38,43]},{"title":"Better than Branagh?","rating":10,"date":"16 May 2010","review":"After seeing Branagh's version years ago, I honestly never thought it could be improved upon. However, while that version relied heavily on pageantry, this one thrives on the script. I may have minimal theater experience, but I do have an English degree and felt that this was a wonderful interpretation of the play. The difficult thing for many people is, having seen it performed before, cannot re-imagine it any other way. It's a shame to hear some of the reviewers bash the actors when we all know that no two Hamlets are (or should ever be) the same. Who's to say how it was performed during Shakespeare's time? That's the beauty of the play. In a time of constant Hollywood remakes where the original is available to be seen and borrowed from, the RSC has made it fresh and new again. I hung on the words as if hearing them for the first time, and in some cases thought of them in an entirely different fashion. Plus, as a long-time Dr. Who and Star Trek fan, it didn't feel as if I was watching the Doctor or Captain Picard performing. The staging was quite brilliant as well; it didn't distract or become a character in and of itself. The rest of the cast performed quite well and should be celebrated also.","user":"spinzgirl","rank":[35,41]},{"title":"Among the better Hamlets","rating":7,"date":"30 December 2009","review":"This is great. When one is such a passionate Shakespeare appreciator as I am - and even one who rarely has the opportunity to attend theater performances - the coming of a major new Hamlet production is a Great Event. I anticipate it with excitement, I pre-order the DVD, and I prepare to let the Royal Shakespeare Company work its dependable magic and sweep me off my feet with a stunning new production. And with Tennant's Hamlet I am not disappointed. It's fresh and it's delightful and every single moment of it held me utterly captivated.<br><br>It is in modern dress which worked well in most scenes, but less well in a few others. Taking place inside some aristocratic castle with black walls, marble columns and black shiny floors, it certainly achieved the requisite darkness that this play must have (although I found it didn't make sense pointing out clouds in an in-door environment. I also found the lack of paintings, which would comprise such an obviously effective device in a setting like this, rather strange) - which is good, because Tennant himself never quite conveyed a convincing sense of brooding menace and inner turmoil. I am a big fan of David Tennant, esp. his Doctor Who, but there's no doubt he can pull off a much wider range of roles, although I do think comedy is his main strength. And he wasn't a bad Hamlet - just not a great one either. He might have been, under different circumstances, but not in this incarnation. Tennant being Tennant, however, he was still splendidly entertaining to watch, even if Claudius, Polonius, Horatio and Gertrude all out-acted him quite a bit.<br><br>In this version, the early scene where Claudius is addressing the court, turns to Hamlet, saying, \"Now...\", and then arrogantly turns around to address Laertes instead of Hamlet was for me the greatest single moment. It succeeded in making me consider something I never had before, namely how odd and deliberate it is that the king in this situation addresses Laertes before Hamlet. This is quite a stunningly thought-provoking detail. Hamlet being the crown prince, etiquette should demand that he be honored with the earlier mention at such an official function. Laertes should not take precedence there. Clearly, Claudius is actively belittling Hamlet, consciously treating him with less dignity than his status demands. Well done there, Mr. Doran!<br><br>This is overall a good Hamlet, but it is not a seminal one. It is probably true that it worked better on stage than on television, and I also felt that several actors, incl. those playing Laertes and Ophelia, fell short of the necessary charisma. Even Tennant himself, in most scenes, was not quite intense enough to convince me that he really was Hamlet, and I was a bit disappointed with many of the soliloquies, which in most cases are recited almost without gesture, without animation and without the action that would have directed us towards some subtle interpretation of each speech. One marvels at a director who has this rare opportunity to produce the greatest speeches in all of literature, and then does not seize it. Maybe he had no opinion about them? A bit odd, I find. I'm probably missing something, though.<br><br>Also, having the same actor play Claudius and Old Hamlet, essentially making them twins? I dunno. One of the play's most major points is how different the two brothers are. The main difference between them, perhaps, is in character, but Hamlet also makes a point out of pitting them against each other physically, when he describes them to Gertrude. If they look the same, this scene becomes a bit dubious. Still, having secured someone like Patrick Stewart for the parts, one does rather like to see him in as many roles as possible, so I'd be something of a deadbeat if I belabored this point any further. :-)<br><br>Having mentioned these shortcomings, I must admit to being quite surprised at how much I enjoyed this Hamlet after all. One of the most successful scenes was Hamlet's final \"absent thee from felicity\" plea to Horatio, which I thought was quite a bit more powerful than most other scenes in this version. All in all, I think this must be said to be the best Hamlet to come out on DVD since Branagh's, which however it falls significantly short of matching. Gregory Doran is no Ken Branagh, and the Tennant Hamlet will probably not, however fresh it feels today, endure the coming decades without acquiring some air of staleness. Still, for speaking loudly and clearly to a current audience that may be justifiably fed up with the loftier kinds of Shakespeare productions, it deserves high marks indeed.<br><br>On the one hand it is difficult to do a good Hamlet, but on the other hand it is also difficult to foul up such resplendent material. The RSC being the RSC, most of this Hamlet does hold the attention and does make the mind work. Shakespeare is such a passion-filled author that most productions, in my opinion, actually fall short of fulfilling the dramatic potential of the text. It is a continual puzzle to me why producers don't seem more awed by Shakespeare's words than they do. But I guess that just gives us so much more to look forward to in future productions. What luck that Shakespeare is never too old to be dusted off and renewed for a new generation of literature lovers!<br><br>7 out of 10.","user":"sarastro7","rank":[50,70]}]