[{"title":"Give yourself a root canal instead","rating":1,"date":"2 June 2015","review":"OK it only took me about 8 minutes to realize that I would have more fun digging my eyeballs out with a spoon than watching this. Just to make sure though I did skip ahead, a few minutes at a time until I got to the end. The cinematography was amateurish, the acting was poor, but the dialog was unbelievably atrocious. Seriously if you are considering watching this movie, go get a power drill and give yourself a root canal, it will be more enjoyable than this trash.<br><br>****** minor spoiler section ...first 8 min ****** Just in case you think I was joking about the dialog: The movie starts out with a strange scene of a crazy woman rubbing blood on her face, a guy talking to her and an axe murderer standing behind him. Then it flashes to the guy and two women waking up in the woods with no memory. It's not a flashback because crazy lady still has blood on her face. Now here is where I realized the streaming pile that the dialog would be. The sane woman says they need to get out of the woods, the guy gets hysterical about not even knowing where they are. Crazy lady says \"stay out of the shadows\". Then in a sudden reversal of roles, sane lady wants to stay and the guy wants to leave and suddenly takes off. Really? From my fast forwarding and checking in periodically none of it gets any better...ever.","user":"maverickz-33-530388","rank":[3,3]},{"title":"Till Sunset","rating":2,"date":"24 June 2015","review":"This is a low budget, experimental film. Remember that saying if you pay peanuts, you get monkeys? That isn't always true, but the scriptwriter and the individual who came up with the plot - if plot it can be called - need to hone their talents considerably before they tackle their next project, that is assuming they have any talents. And assuming they really are the same person because it is difficult to credit that one individual could have come up with something so disjointed.<br><br>Three people stuck in the woods, apparently talking to ghosts and ghosts whispering to them; the male of the group appears to be engaging in a conversation with his dead brother. There are many flashbacks which suggest this could be some sort of bizarre experiment, or perhaps they are escaped lunatics, the latter is more convincing on account of the hospital staff, as in booby hatch rather than A&amp;E. Assuming that is true, what is it all about? Go figure, or better still, watch something comprehensible instead.","user":"a_baron","rank":[1,2]}]