[{"title":"Not to all tastes - but to mine","rating":10,"date":"10 December 2010","review":"This is not a movie that will appeal to everyone, even fans of George Clooney, who is in almost every scene. His famous smile and immense charm are totally absent in a tight, laconic role as the eponymous assassin-cum-gunsmith Jack/Edward/Mr Butterfly. But I really admired this brave departure from the Hollywood dazzle which has a genuinely different pacing plus look and sound.<br><br>So if you're expecting a fast-moving, action-packed thriller, forget it. After a dramatic pre-title sequence, there is more than an hour of a quiet, slow build up to the retributive finale. The assassin is determined to do one last job before giving up his nefarious profession, but two women are complicating his intentions: fellow shootist Mathilde, played icily by the Dutch Thekla Reuten, and a local prostitute Clara, the beautiful Italian actress Violante Placido. Which woman will get her man? This is a visually striking work, partly because of the unusual setting in the arid terrain of the Abruzzo region of central Italy and the narrow, cobbled streets of the town of Castel del Monte, partly because of the artistry of Dutch photographer turned director Anton Corbijn and his German cinematographer Martin Ruhe. The sparse script is the work of Rowan Joffe (son of the director Roland Joffe) who has adapted the novel \"A Very Private Gentleman\" by the British novelist Martin Booth.<br><br>Clooney is a great lover of all things Italian and this film - which he co-produced - is obviously a very personal work which is likely to be more enjoyed in Europe than in the States.","user":"rogerdarlington","rank":[103,126]},{"title":"Time will value this gem","rating":9,"date":"3 November 2010","review":"The cinematography is breath taking, but with top photographer Anton Corbijn at the helm, you wouldn't expect anything less. There's very little dialogue in this film, about 500 lines in total, which emphasizes the acting and the visual spectacle. Don't expect any CGI or amazing action scenes. It's just not that kind of film. It's a homage to C'era una volta il West by Sergio Leone, to The Day of the Jackal (the original!) by Fred Zinnemann and writer Frederick Forsyth, to Italy and in a way to Clooney. The deliberate slow pace will put a lot of people off. The movie is about professionalism, betrayal, loneliness, revenge and love. How good \"bad\" people can be. A wonderful film, that will not be valued by the average Hollywood loving movie goers, but a must see for people who love movies and for whom movie-making is an art.","user":"elroy_geronimo","rank":[206,287]},{"title":"A victim of bad marketing","rating":8,"date":"15 September 2010","review":"As an action thriller, I'd give this film maybe a 2/10. But that is not what it was intended to be. The ads and marketing of the film falsely suggest this is an action film, and that is a great disservice both to the film and to the audience. I suspect that the film's rating would be higher had the marketing been honest. It is almost the opposite of action: it's a quiet, introspective film. I didn't expect a thriller and so I wasn't disappointed.<br><br>As usual in this kind of film, there is not a lot of backstory. We never find out exactly where Jack came from, how he found his job, why he could take such a job, etc. But that's not really the point. We never really find out much about the back story on the other characters, either. I think we actually found out more about the priest.<br><br>I enjoyed the film in about the same way I would enjoy a short story, which focuses on a few points rather than furnishing a history and full explanation.","user":"Ric-7","rank":[227,323]}]