[{"title":"Interesting concept. Good ending. Forgetting the Girl is above average for an independent production.","rating":6,"date":"17 August 2014","review":"Forgetting the Girl introduces us to Kevin Wolfe (Christopher Denham), a soft spoken photographer consumed by his need to try to reconcile the traumatic childhood memory of his sisters accidental death. He works in a rented studio space with a chatty and emotionally fragile makeup assistant, Jamie (Lindsay Beamish). Their job brings upon encounters with a flurry of wannabe actresses and models. They fleetingly pass, both into and out of Kevin's life. <br><br>Kevin addresses the camera directly, with neurotic detail to explain his sometimes unusual, borderline obsessive way with the ladies. We follow Kevin's visits to his last living relative, his grandmother (Phyllis Somerville), his awkward but well-meaning exchanges with potential clients/ potential subjects of a mild infatuation (one of which is Adrienne, played by Anna Camp). He scared her off with his tenacious approach to the post-hookup. <br><br>He finally catches a break when viable love interest, Beth (Elizabeth Rice) meets him outside a theater and has an actual interest in getting to know him. From this point forward, it becomes apparent that one of these characters are not to be trusted. <br><br>The GOOD The gore level is set to a minimum. It achieves the same intended result without the use of gratuitous violence. The end. Many viewers will probably predict what will happen, the first 10 minutes in. Well thought out, nonetheless. <br><br>THE BAD The proclamation power-point presentation. The three P's, if you will. Kevin speaking directly into the camera is reminiscent of a mediocre high-school drama monologue (intentional?). <br><br>Mawkish is the only way to describe the script. Especially when Jamie repeats the whole \"I want to be beautiful for you, Kevin\" bit. Involuntary eye-roll. <br><br>This is Nate Taylor's directorial debut . It's well directed with an intriguing set of characters. Impressive considering it's an independent film with a low estimated budget of only 600K. <br><br>6/10","user":"Myusersnameiscoolokay","rank":[5,6]},{"title":"A morose look inside the mind of a serial killer","rating":6,"date":"26 October 2014","review":"Forgetting the girl is a provocative well paced movie. It delves inside the mind of a man who is extremely mentally ill. Some would call the movie sick &amp; twisted. But, this is a movie that shows light upon dark subject matter that as much as we would like to deny exists, does. For a somber subject such as death, it has a cavalier &amp; carefree tone. It attempted to misdirect viewers by offering three plausible killers. I felt it was clear what type of surprise the audience was in for &amp; it was just a question of when it would happen. Anna Camp &amp; Elizabeth Rice were gorgeous additions to the leading cast. I felt neutral about the leading male, as almost any actor could have played the role, and perhaps elevate the movie's rating.<br><br>It is rated AO which I assume stands for adults only, and I agree due to the subject matter. Only mature adults should see some of the scenes because you simply don't want to put some of the imagery inside a mind not fully formed or otherwise impressionable. It is not gruesome or gory and that makes it different from most serial killer movies about the true crime genre. This is a fictional story. If you enjoy getting inside the minds of the mentally ill or psychotic, this movie is for you. If you want a horror movie with blood and gore or a movie with a message or one that entertains it is not. <br><br>I rate it 6/10 stars because it was different in tone than others in the genre &amp; it's pace kept my attention. Had Rice &amp; Camp not been cast, I would rate it a 3/10. My feeling at the end is melancholy. <br><br>Knox D. Alford, III","user":"knoxiii","rank":[6,8]},{"title":"Dark, twisted, and brilliant","rating":8,"date":"21 January 2013","review":"Forgetting the Girl is a dark and twisted film that left me emotionally drained and mildly concerned who might be living next door. The director (Nate Taylor) brilliantly crafts a slow build of tension and dark suspicion as the viewer is drawn into an uncomfortable intimacy with the lead character played by Christopher Denham. Denham masterfully portrays a deeply and genuinely disturbed individual struggling to find some sense of normalcy in a relationship while surrounding himself with equally, if not more overtly damaged personae. Deserving of special mention for her amazing performance is Lindsay Beamish who played Denham's obsessive and thoroughly screwed up assistant.<br><br>The slow build of this film is laced with such real emotion and frightening honesty that I was left wondering whether the director did some extracurricular study of mental health issues to so succinctly draw out such amazing insights into the psychoses of his characters. Even after the crescendo, the director (and Beamish) left me wondering whether the reveal answered all of the mysteries crafted throughout the film or if there was more than meets the eye. This movie makes me want to run background checks on my neighborsor not have any neighbors. I'm not sure. A+ job by the Director, cast and crew.","user":"leon-588-470541","rank":[15,32]}]