[{"title":"Combo of Family Man and It's a Wonderful LIfe","rating":9,"date":"29 August 2010","review":"I thought this was a very well written, well acted movie. The film is about a man who gets a chance to see what his life would have been like if he had not made the choices he did.<br><br>The story has a Christian viewpoint (disclosure: I am a Christian and agree with the beliefs expressed in the movie), but is not heavy handed at all. I believe people of all faiths or who have no faith will agree with the positive message of the importance of family and serving others.<br><br>I have watched a lot of movies by Christian filmmakers and this is definitely one of the best. John Ratzenberger is one of my favorite actors and does a great job in the movie.<br><br>As I mention above, the story is similar to the Family Man, but What If, is much better acted and more family friendly that that the Nicholas Cage movie. There is no swearing, violence or sex, but the PG rating is accurate as there are some intense moments . I would not recommend taking small children. I think it is a great date movie.<br><br>The movie is in limited release and my wife and I had to drive about 30-40 minutes to get to the theater it was in. I hope it will stay around for a while.","user":"l-piotrowski","rank":[42,61]},{"title":"Family Entertainment","rating":9,"date":"9 September 2010","review":"Family Entertainment. You know, the feel-good, wholesome, honest, \"take your child to without risking embarrassment\" entertainment that is becoming popular once again. Professional cast (who would think of John Ratzenberger as an angel). Tried and true plot (but then how many truly original story lines have you seen lately?). Humor without being a comedy. Serious without being overbearing. Nice without being sticky-sweet. Christian without being overbearing (disclosure, I am a Christian). No blood, gore, bad language, bare-bodies or other objectionable content.<br><br>A solid presentation. Intellectual enough that you go home thinking about the plot, not the special effects or love scene. At the same time, not so complicated that your child cannot follow.<br><br>Highly recommended.","user":"silver-spinner","rank":[29,47]},{"title":"I highly recommend What If...","rating":10,"date":"9 September 2010","review":"I thought that this movie was a great throwback to how movies used to be. A modern day It's a Wonderful Life. It was very family friendly and contains many positive messages. For those who are looking for a thought provoking movie this one fits the bill. I saw it with my husband and teenage daughter and it gave us many meaningful conversations. The acting is top notch. We laughed and we cried often one right after the other. I haven't enjoyed an \"angel\" so much since Clarence. John Ratzenberger is fabulous. Taylor Groothuis who plays the younger daughter is delightful. Kevin Sorbo gives a very convincing performance as the corporate shark and as the man out of his element. As a Christian I was pleased to see an accurate depiction of faith without it seeming cheesy or fake.","user":"sklupella","rank":[31,51]}]