[{"title":"Monsters University: A worthy prequel","rating":8,"date":"11 July 2017","review":"I adored Monsters Inc, it was one of those surprise movies you go into with no expectations and are blown away by. It took years for me to get round to this due to my endless watchlist but I'm so happy I can say that it's worth of the the franchise.<br><br>Charming, well written, full of laugh out loud moments and undeniably loyal to the original movie with tie-ins around every corner.<br><br>I especially liked Helen Mirrens character, part monster, part bat, part centipede? I like centipedes, I wanted to be an entomologist once upon a time, obsessed over bugs, learnt all about them then learnt about these things called university, qualifications and effort and thought against it. I'll leave entomology to those with motivation, you enjoy your bugs and I'll enjoy women, movies, video games and various other fun stuff.<br><br>I digress, Monsters University is a sweet heartfelt movie and makes me hope they make a final part to make a monsters trilogy. Maybe touching upon certain events that happened in this as opposed to it's sequel.<br><br>Sadly I don't see this happening, I think we have more likelihood of a Princess Bride 2, Brave 2 or a movie where Zac Efron doesn't play an arrogant douche who likes to take his shirt off.","user":"Platypuschow","rank":[22,22]},{"title":"Pleasant Story of Friendship","rating":8,"date":"9 February 2014","review":"When Mike Wazowski is young, he visits the Monsters University in a tour of his primary school. A senior student gives his hat to Mike and he plans to become a scary monster.<br><br>Years later, Mike joins the Monsters University and on the arrival, he receives a flier of the Scare Games that will take place soon in the campus. Mike also befriends his roommate Randall. When the lazy student James P. \"Sully\" Sullivan, who belongs to a family of famous \"scarers\", breaks in his room, they start a competition in class. Their dispute ends when they accidentally break the pride and of joy of Dean Abigail Hardscrabble, a cylinder with her greatest achievement – a powerful scream of a boy. They both are expelled from the scare classes by Hardscrambble that tells that Sully is lazy and Mike is not scary, and they become enemies. <br><br>When Mike recalls the Scare Games, he sees his only chance to return to the scare course. He makes the application to participate, but he learns that he needs a fraternity. Mike joins the Oozma Kappa that is the only fraternity available with four losers, but he is informed that the fraternity needs to have six members. Sully offers to complete the team and Mike has no other alternative but accept Sully in his team. Then he bets with Hardscrambble that if he wins the games, she will accept them in the scare classes. Soon the game begins...<br><br>\"Monsters University\" is a pleasant story of friendship and a prequel of \"Monsters Inc.\". The plot is based on the American college life and despite the lack of any identification with my country, with fraternities and silly parties of American college students, the plot is funny and entertaining. My vote is eight.<br><br>Title (Brazil): \"Universidade Monstros\" (\"Monsters University\")","user":"claudio_carvalho","rank":[25,27]},{"title":"Finally and thankfully Pixar does it again!","rating":8,"date":"9 June 2013","review":"Of all the Pixar movies Monsters Inc. has always been my absolute favorite. The incredible story of the remarkable friendship between Sully, Mike and Boo made me watch the movie more than 10-15 times already. When it was released on blu-ray I was the first one to buy it. So when Pixar announced another Monsters movie I got concerned. How could Pixar make a better movie than the original? Or even one that equalled it? But having seen the movie last week I can ensure you all: Pixar is back on top. Monsters University is great fun and it's Pixar best since Up!.<br><br>Monsters University, a prequel to Monsters Inc., begins with a young and very little Mike Wazowski (Billy Crystal) still in primary school. After a field trip to Monsters Inc. he has only one dream: to become a scarer. Years later he arrives at Monsters University but soon learns he still has a long way to go. His main problem? Mike isn't scary at all. He befriends his roommate young Randall (Steve Buscemi), who at that time is an unimportant loser (and later gets seduced by the dark side). The first night he makes an enemy out of Sully (John Goodman), a freshman who thinks that his family name (of legendary scarers) is enough to get him through school. A personal vendetta is born.<br><br>Things go wrong when Mike and Sully accidentally destroy a sacred item that belongs to the devilish Dean Hardscrabble (a brilliant Helen Mirren). They get expelled from all Scare Classes and will not graduate as a real Scarer. Luckily Mike comes up with a plan, a bet with the dean. If he finds a team to compete in the Scare Games and if he indeed wins, he's allowed to follow the Scare Classes until the end. Dean Hardscrabble approves. Now it's up to Mike, Sully and his team of losers to work as a team and go the distance<br><br>In Monsters University the Scare Games are very well done. I can see both kids and adults laughing their socks off when Mike and Sully, in the same team but still enemies, are doing their first race and try not to step on the items that make their body grow. Bizarre, but hilarious! Their next assignment, when they have to steal something in the library, is also a winner. But what really works in Monsters University is that the story is mainly about friendship. We not only see how Mike and Sully turn from big enemies into big friends; they become soul mates for life. To join the Scare Games Mike must find five extra members to form a team and the only ones left are a bunch of nerds that no one pays attention to and a big blue monster that he absolutely hates (Sully). Still Mike succeeds in making it work. <br><br>Even when you know that Mike and Sully will win the Scare Games (that isn't a spoiler, is it?), this film isn't predictable at all. It doesn't end with Sully holding up the Scare cup but it takes one more great scene to bring Mike and Sully definitely together. I will not spoil it for you, but it involves a door to the human world and a little green monster that's depressed. <br><br>Monsters University is a great film. It's both funny and sentimental in all the right places. Fans of the first movie will see a lot of cameos in this one (Yeti!). The story ends when Monsters Inc. begins. I will even advise the next generation to see Monsters University first and then go on to Monsters Inc.<br><br>Yeah, my faith in Pixar is restored. Although I must confess that with Planes coming up, things can change very fast in the wrong direction. But maybe that's because I have never liked the Cars movie.<br><br>9/10","user":"Joejoesan","rank":[84,100]}]