[{"title":"Should have never been released.","rating":2,"date":"1 April 2016","review":"Let me start by saying that everything in Get a Job is atrocious except one thing: the acting. If these stars weren't attached to the movie nobody would bat an eye at this thing. It's so awful. I audibly \"ugh\"-ed when it finished. The message this movie tries to convey is that it's hard to find a job, so you have to stop smoking pot and be determined and never give up and do whatever it takes to get a job. Or don't get a job and be an entrepreneur. The movie throws that one in at the end. A stupid message in the first place because, hey, not everyone has the same circumstances. This type of movie can only resonate with a niche crowd, but worse than that the writing is just dreadful. Cringe-City is what this movie should've been called. I felt bad for Miles Teller having to deliver these cliché lines like, \"Never stop believing.\" Sorry Get a Job but I learned that lesson from Journey a long time ago. Bryan Cranston and Alison Brie try to have fun in their roles, and they really brighten up the mood, but it isn't nearly enough. Anna Kendrick is forced into this shell of a character who gets fired and can't get back on her feet so she succumbs to the evils of weed and laziness. When Anna Kendrick can't be adorable for every second she's on screen, then you know you have a problem. <br><br>The problem is literally everything else. The writing, the directing, the editing, the f*cking music, it all SUCKS. It's painful. It's one of those movies where you know if the actors weren't already attached to the project, it would've never been made. But the money was there so they hired great actors and they forgot about the rest of the crew so they got people on the street to do direct and their pet cat to write and who needs an editor anyway? The cat can do it! It's like an amateur film at points. I'll be honest, I chuckled a couple of times. And by a couple of times I mean it. I chuckled twice. Maybe smiled a few more times, but for a majority of Get a Job I was either cringing or frustrated at the fact that it was even greenlit and released. This movie... just...<br><br>UGH.","user":"lnvicta","rank":[72,93]},{"title":"I'm Being Kind to Say It's Abysmal","rating":1,"date":"21 June 2016","review":"How the likes of Miles Teller, Anna Kendrick, Bryan Cranston, Marcia Gay Harden, Alison Brie, John C. McGinley, and Brandon T. Jackson, all most talented actors, can be in such a stinkeroo is a mystery to me. I'm no prude, but when a film is incredibly vulgar and mean-spirited and the intended humor falls flat as a pancake it just becomes torturous to watch. The customary 180 at the end of the film was way too little and way too late.<br><br>I saw some reviewers state that this movie was \"in the can\" for 4 years before being released. Why inflict us now? I guess this is a puzzle only the filmmakers can know the answer to.","user":"larrys3","rank":[17,21]},{"title":"The jokes fall flat, just like its characters","rating":2,"date":"6 April 2016","review":"Miles Teller is once again playing the same character he always plays; I'm starting to question whether his role in Whiplash was a one time thing. He was fine in this role, I think he's mastered this character, but his character in this film was uninteresting. The cast (Bryan Cranston, Ana Kendrick, Alison Brie, etc.) is surprisingly very talented, but it seems that they were wasted in this movie because their characters are indistinguishable from one another. The movie is about people losing their jobs and eventually getting a job, and yet does not succeed in demonstrating why they deserve their job or would realistically even get that job. For example, Miles Teller's character gets his dream job by making a \"viral video\" (I doubt the movie knows what viral means, because he only get 100 000 views on only one video) and gets a straight pass to job offers and a start at his own company. I don't think that that's how life works, but apparently this movie thinks so. Other than the plot, it's supposed to be a comedy, and it's not actually funny - I mean it's not unfunny but when there is jokes, they kind of fall flat (like its characters).","user":"maripere95","rank":[16,22]}]