[{"title":"Acting so bad, it almost saves the film","rating":1,"date":"20 January 2015","review":"Within minutes of starting the film we are introduced to all the central actors. I'd like to say central characters, but that would be an exaggeration. The acting is so wooden in some cases, so stilted in others, so beneath the level of a decent High School play, that these are not characters but at best caricatures. Sometimes the delivery is funny, seeming to be a parody of the kind of character you often see in similar, but better films. But most of the time it just grates on you, and makes you regret starting the film. The rest of the film is so bad, from the massive plot holes resulting in the impossibility of suspension of disbelief, to the pointless scenes of blood and gore interspersed through the introductory portion, that if the acting had been a little funnier it might have actually been the saving grace of the film, moving it in to the so bad it's good category. However some of these actors show some potential, and so are just not bad enough for that. Nothing saves this film. Don't waste your time.","user":"joshuathirteen","rank":[6,7]},{"title":"A little formula movie saved by the presence of Domiziano Arcangeli!","rating":7,"date":"13 April 2012","review":"I happened to watch a screening of this film \"The Ritual\"(formerly known as: 'The Occultist'),at the last Berlin Film Festival, where it had its own international premiere. Let's start off with the main flaw, that,in fact, does not even allow us to talk or discuss too much,about this Title: \"The Ritual\" has its foundations anchored very tightly on a very formulaic premise: basically, it can be summarized by this clearly ironic question: \"Will a-politically correct- diverse group of back-stabbers students,in some exclusive and costly US College, ever be able to save themselves from what they're dealing with,and most of all, will they be able to defeat a couple of evil,yet fascinating,professors,who are violating so unrealistically all the main rules of traditional lecturing,by talking openly of sorcery,and, of the cult of pure Evil,without ever considering -even merely- any of the dangerous consequences, until the very end? And,sorry,but, must point out -again- that you should buy all of the above, on the premise, that all this is supposedly happening somewhere in the peaceful,impeccable,and rather conservative atmosphere of an high end,woodsy College,in the middle of the stoic United States of America! Useless to tell about the extremely cliché events,unfolding, within the quickly forgettable,however -thankfully,at least- always rather thrilling, 90 minutes to follow! This movie is just what it is,and you may just even enjoy it,if you avoid thinking too hard, and most of all,trying to make sense of all the unnerving stretches of credibility: here's a typical Genre product, made for the international Markets, with all its obvious and predictable limits, but, also a few virtues, like the extremely seductive cinematography, and a few interesting sets, and gruesome scenes. The direction is not particularly great or inventive,but,at least,it always keeps the whole movie to a professional level. Domiziano Arcangeli is also always incredibly interesting to watch,even when playing in such trite and convoluted material,like this one: his performance is in fact, probably the only thing that rings completely true,managing to become the only haunting ingredient,in this whole production. The rest of the actors are rather uninteresting, with the exception of Derek Baker,who also fairs well,considering his extremely thinly layered role. \"The Ritual\" manages, at times, to be even mysterious, and offers, without doubts,lots of gore and repellent situations, but,quite honestly, it's way too bad than the authors of this Project,would have not even have considered to go more in depth with the situations,and to dare a little more: It would have been much more interesting to tell -for example- this story and its characters,all so 'eerily' related to evil,or/and to those who become progressively its worshipers, by simply adding more of a gripping kick,and 'that madness' necessary to turn the story into some more unsettling conclusions! While, the visual style (and especially,for most of the scenes,regarding the students and their personal relationships)should have simply been more unusual,way darker,and not as bland as it is,but,instead trying to cleverly seeking more ways to scare,or amuse or simply just to surprise,its audiences! But, \"The Ritual\",instead,clearly opts for the obvious and the secure. It's like a movie made on a formula: some old,and (wrongly considered) never failing recipe,so that,this movie, while,for sure, getting sold for a certain amount of money in certain Countries,it's basically presented as a typical 'factory' product, trying to avoid to test new waters,or even, to get merely close to something contemplating any creative risk, just limiting itself to use the Horror and Supernatural Genres,as its only basic selling points! I believe, that,if they had,instead, developed the characters with more coherence,and had searched for more extreme situations to, at least, bringing on the surface, a more thrilling,and, way more realistic sensation of what the natural trigger's effects and repercussions over the events,could have truly been, \"The Ritual\", might even have easily escaped,from the usual limitations,of certain straight to cable or DVD films, facing the challenge to become -perhaps- that more interesting and unique, type of independent Horror film,that,at the end, could have been also definitely more appealing to a much wider range of audiences. Unfortunately, the blindness,and lack of \"bravado's\" of certain producers and writers, is here way too persistent, than any other attempt, aiming to focus into a more creative filmmaking, allowing even a film like this, to its own right to twinkle, and to an actor,like Arcangeli, for example,to come through,more completely,with his own, still very sensitive, characterization: there's, in fact, not that much more left to do, even for such a real actor,who's getting no help,from a script,that does not even pretend to look any further,than some pulp fiction narrative,shamelessly going against all odds! So,despite Arcangeli's, penetrating eyes,and expressions, displayed almost too abruptly, by an editing, trying to cover up for dramatic holes and logical continuity,and, an almost feverish effort, aimed to make us understand, with an almost praiseworthy and professional acting,he's truly 'believing' all the events, they're putting him through,cannot make us buy all the 'drills' of this way too schematic, if,at times, again, colorful composition. This movie lives off of a a constantly present sense of deja vu' (SyFy Channel,anybody??) that may make for sales,but not for quality, and that is to say it, with a very kind euphemism!","user":"Icons76","rank":[4,27]},{"title":"This is what happens when extras are cast as actors.","rating":1,"date":"10 February 2017","review":"Some of the cast have several roles credited to them on IMDb, though the parts must have been minimal indeed as it appears that none of those experiences in film developed any acting skill among this bunch.<br><br>I really could go grab random people off of the street and have a lot better of a cast just based on the fact that I would have to work hard searching high and low to find anybody worse off in front of a camera.<br><br>The soundtrack was horrible, the non-musical sound effects were worse. The sets were laughable. I am serious in relating that they put some plastic tables inside a tarped off area to film in, as if they couldn't actually be bothered to look for anything resembling a classroom or an operating room.<br><br>The worse part was those ridiculous blinking lights for special effects. I have seen better blinking lights by squinting too hard. This movie was absolutely horrid, and the exaggerated stereotypical accents effected by the two main characters were so unpleasant to the ear I could not even leave the volume up enough to mock this turd like a MST3000 episode.<br><br>I really hate whomever green lighted this poor excuse for a waste of time. Why couldn't they just have smoked a joint and watched grass grow if they had nothing better to do?","user":"jerrybri","rank":[0,2]}]