[{"title":"Mental Buoys Rockzzzz.. Go for this Perfect movie","rating":10,"date":"15 July 2011","review":"Just saw Zindagi Na Milegi Dobara.. beautiful,adventurous,funny​ ,i m a big Hrithik fan who excels the movie,all the characters are excellent.<br><br>Three young men take a holiday that changes their lives forever. Kabir (Abhay Deol) is engaged to Natasha (Kalki). Kabir decides to go on an extended bachelor party, before he gets married. A 3-week road trip with Imraan (Farhan Akhtar) and Arjun (Hrithik Roshan), his two best friends since school. The only problem is Arjun is too tied up with work. After much emotional blackmail and cajoling, the boys set off on a journey they were meant to take four years ago. A fantasy holiday they had planned to take after college, which never happened. A road trip where each one gets to do the ultimate sport of his choice and the other two just have to do it with him. Whether they want to or not! <br><br>STRAIGHT INTO FAVOURITES..:):) Awesome work by Zoya..:) HR,Farhan,Abhay mass...Hrithik and Katrina adds spice to the romantic scenes in the movie..Farhan Akhtar shows a refreshing flair for comedy and has impeccable comic timing...Kalki Koechlin is excellent in her bitchy role of a possessive girlfriend. Naseeruddin Shah is impressive in his cameo. ..superb Love + friendship movie..don't miss..:)","user":"flyingkitezz","rank":[51,58]},{"title":"Zindgi Na Milegi Dobara, Live it!","rating":10,"date":"15 July 2011","review":"ZNMD takes you to the journey of life. There are very few movies which makes you feel good specially when it comes to Bollywood. ZNMD is a movie to get back your life, if you lost it somewhere in today's fast life. It takes you to silly and simple moments of your life. <br><br>Bachelor Trip of 3 childhood friends, which becomes much more than just a bachelor trip. Witty and humorous dialogues makes it a funny ride. Awesome locations shot beautifully. Music and background score is beautiful. Poetry is beautiful. In short the movie is beautiful.<br><br>Farhan is super talented. what a great actor he is. loved his performance. Hrithik and Abhay did great too. Katrina &amp; Kalki too did justice with their roles respectively. Deep Sea Dive, Sky Diving, Tomatina Festival, Bull Race all these things made it an adventurous journey. Message of the movie is conveyed very beautifully. Live the life in your way! don't make it complicated. Search for your own happiness. Zindgi Na Milegi Dobara, so live the every moment of it. Live it as beautifully as u can.<br><br>ZNMD is must must watch. I'll highly recommend this.","user":"ankioo7","rank":[35,39]},{"title":"Mind Blowing Stuff","rating":10,"date":"16 July 2011","review":"Before going for this movie I was careful not to read anything about it, not watch a single trailer. This extremism mainly comes from my distrust on Indian Media which trashes movies that are comfortably awesome. Okay. If you are planning to go for it, do not read the rest of this. Come back and do it. This movie deserves an open mind. It shouldn't be that you go inside the theater with some invisible strings controlling how you perceive it. Let me tell you it is simple. It is also beautiful. And the combination makes it immense.<br><br>Right from the first scene, the director makes this his own. I wonder how many directors in this industry will be able to give a complete character definition of the protagonists through a sequence depicting their luggage-packing-styles for a 3 week trip. Zoya Akhtar does exactly that. She is a genius. I'll come back to her.<br><br>Lets look at the actors. Abhay Deol, Farhan Akhtar, Kalki Koechlin, Katrina Kaif and Hrithik Roshan. Abhay Deol is a stalwart. He has been a part of movies that have changed the face of Indian Cinema. Hrithik Roshan is another great actor. His movies have always contained a central theme of self-improvement. And for me, he is mind-blowing. Farhan Akhtar is a multi talented dude. Acting, singing, directing with equal panache. Any competitors? No. Kalki Koechlin has proved her worth in Shaitan and Dev D.<br><br>The real surprise in this movie comes from Katrina Kaif. She is amazing in this movie as the NRI diving instructor with high intellect. She embodies the role with such ease that she never looks the out-of-place girl she usually does. And she is hot in a very warm way. Her physicality is projected and used by Zoya in a controlled manner which enhances her beauty.<br><br>Hrithik is at his best, giving 100% to the role and carrying the transformations in his character so smoothly that at the end you feel happy for him. His journey across his life comes alive on screen through his facial expression. And eyes. The use of sunglasses by Zoya is absolutely perfect.<br><br>Abhay is the usual casual fellow you could find strewn all over India. But such is his expertise, he makes that guy stand out. Where Farhan and Hrithik have characters with a certain premise, Abhay's Kabir(a) is a free-bird. And boy, how he uses the freedom! A treat to watch, his dialogue throwing style adds a very important spice to the movie. It pierces you.<br><br>Kalki is good. With a limited screen-time, she fares really well. She has one shriek in the whole movie and one funny sequence while singing \"I'm a hot chick in a hard rock world\". These two scenes show us why she is different. Pretty powerful stuff. The perfect sugar coated knife.<br><br>Farhan. Hats off. You just blew my expectation ceiling with an atomic bomb. Perfect, infallible comic timing. Add to that the raspy, metal-on-wood voice, the casual sense of style, the few looks of soul-searching and the full blown expression of joy after Sky Diving. What you get is in my opinion the best performance I have seen in some time. Character constructed, deconstructed, resurrected with the absolute smoothness of a tequila shot.<br><br>Cinematography. The whole movie is pivoted on the use of short range focus. Pure genius. It makes the scenes look alive. Almost as if you are looking at the characters in reality.<br><br>Locales. Its one thing to choose correctly and absolutely another to use it. ZNMD sells Spain like Rafael Nadal and Barcelona. The azure blue ocean, the gray and dark plateaus, the vibrant green forests, the super sexy roads and a flaming yellow sunset. Breathtaking.<br><br>Songs. What lyrics. Perfectly picturised. Totally blends into the script.<br><br>Background score. I can't stop if I start on this. The use of the heartbeat promotes the signature sound from the murky depths of Kal Ho Na Ho to the actual surge of nervous energy it stands for. The use of the silencing technique while slowing up the screen pace creates magic moments. And whoever played the rapturous guitar chords did a great job. Awesome.<br><br>Dialogues. Great. General stuff mostly but again, the relevance and timing kills it.<br><br>All these factors combined with the finesse of Zoya creates the unforgettable experience of ZNMD. The movie is about a lot of things. About relationships, about self discovery, about losing control, about life in a microscopic view. But above all, it glorifies friendship, a virtue that is priceless. It will take you through a plethora of emotions, evoked by the various situations faced by Imran, Kabir and Arjun. The situations poised are some real problems the current society is facing like career v/s life, identity crisis, family pressure and relationship maintenance. And truly, they fit the characters.<br><br>The single thing that separates this movie from other hits is the creation of numerous magic moments. Directorial expertise blends with the awesome crew work to make you jump in mirth, look with awe, feel good from within, suppress a tiny tear drop, dance in your mind and applaud a timely joke. I would recommend this movie to everyone, just like Iqbal. It will give you wings. And it will give you the desire to take flight, to live your life like never before.<br><br>Finally, the idea of using shayaris to verbally emote key junctions of the movie is brilliant. In Farhan's voice, it adds to the overall positive vibration of the movie and moves you. Excellent. Thank you Bollywood, for making this movie.","user":"souvikghosh","rank":[89,108]}]