[{"title":"Self-indulgent, not even good enough to be a parody.","rating":1,"date":"4 April 2011","review":"‎1 star. Shim Hyung-Rae has some kind of ego. He takes money from fellow Korean investors, goes to the Paramount lot in Hollywood, and shoots this self-indulgent and unwatchable \"film.\" Harvey Keitel, Michael Rispoli, and Jason Mewes, am...ong others, try in absolute vain to save this wreck and bring some form of realism to the proceedings. Maybe they shouldn't have bothered. It's like Shim saw a couple mob films and wanted to recreate them without any knowledge of the genre. Worst of all, his Younggu character comes across as being the worst Asian stereotype to grace the screen in a long time...with his broken accent, combed over hair, stumbling, and bad teeth. It's impossible to even watch this thing. He even tries to throw in a \"magical\" musical number that is his montage to the Hollywood greats but just seems random. There were maybe 7 people in the auditorium....5 walked out before the end. Maybe I should've as well, I was just too curious to see how this monstrosity would end.","user":"ajy1","rank":[23,32]},{"title":"Absolutely terrible.","rating":1,"date":"10 January 2011","review":"I saw it in Busan a few days ago and my two friends and I all agree that it is probably the worst film we have ever seen. I am British and my two friends are both American so its certainly not a case of us having a homogeneous sense of humour yet we all felt that 'The Last Godfather' was so bad that we actually left the cinema about an hour and ten minutes in.<br><br>The film was absolutely terrible in every possible way and it saddened me to see a Hollywood legend like Harvey Keitel stoop so low. Slapstick can certainly be entertaining, Rowan Atkinson and Charlie Chaplin are two good examples of actors that make me laugh heartily but this was just puerile drivel. I am honestly finding it hard to give a sober and balanced perspective on this film when I'm enraged at just how flat, predictable and pathetic it was.","user":"imsorrydave","rank":[28,43]},{"title":"This is okay for children.","rating":10,"date":"14 April 2011","review":"Hello. <br><br>First I am Korean. I know a lot about this movie and the directer. Actually, in Korea, lots people have been arguing about the quality of this movie.<br><br>Yes! Most adult Koreans do not like this movie and the rating is very low like here, but children do like this movie and seem to enjoy a lot. <br><br>If you have kids and wanna see one movie with them this is for you, but if you expect a really fun comedy movie for adults this may not be your movie.<br><br>Thanks for reading this.","user":"ratmfan-28-404437","rank":[12,27]}]