[{"title":"We could do this...if we had money","rating":9,"date":"9 October 2013","review":"Sunlight Jr. paints a gritty, depressing reality that is unfortunately possessed by many Americans today. Many Americans live paycheck-to-paycheck, have little life-savings, plan for the week, not for the future, and have financial debt that cripples them. With the impact of the 2007-08 financial crisis in America still showing its ugly effects, it's stunning that only a handful of films about the decline in American prosperity have be detailed in films.<br><br>Every so often, a film like Sunlight Jr. comes along, a film with honesty, realism, and an emotional core that not only caters to a relevant issue but provides people with the thought that they're not alone in their struggles. This is obviously no solution to the problem, but it's almost comforting to note that someone share your struggles and have experienced the hardships you're going through. Sunlight Jr. is almost a film that allows you to lean on it, and as a familiar song goes, we all need someone - or something - like that.<br><br>The film focuses on Ritchie and Melissa (Matt Dillon and Naomi Watts, respectively), a Florida couple burdened by financial hardships. She is the breadwinner of the two, working at a convenient store for long hours with a disrespectful pervert of a boss. He worked as a carpenter before an injury confined him to a wheelchair and a disability check. Now, money is a rarity because once Melissa gets her paycheck, it is devoted to bills and very little luxuries.<br><br>Simultaneously wonderful and heartbreaking news comes through when Melissa discovers she's pregnant. They are thrilled, but worried all the more. Melissa must now work the graveyard shift at the store, a dangerous job for a young, attractive woman. Ritchie must live with the stress that he can't provide for the family due to his injury, all the while Melissa's obnoxious ex-boyfriend Justin (Norman Reedus) keeps coming back on the scene. He harasses her at her job, turns up to insult Ritchie, and makes her feel guilty for leaving him.<br><br>A film like this needs to get two aspects down to a tee and it's safe to say Sunlight Jr. does. The aspects are capable acting and writing along with an emphasis on realism through dialog and structure. Dillon and Watts accentuate true chemistry as a couple, most prominently when it comes to the way they discuss financial matters with one another. It also helps that both allow themselves to sink into the characters of two people living a financially-strapped life in America, whether it's Watts' Melissa coming into work late with messy hair and a wrinkled uniform or Ritchie slugging down Bud Light at the local tavern or with dinner, relieving the physical pain of his injury and the mental pain of his presumed worthlessness.<br><br>On the topic of the realistic dialog, writer-director Laurie Collyer never attempts to make the problems of Ritchie and Melissa overreaching or even transcend the line of unbelievable. The film is grounded in reality; there are no easy answers, no simple solutions, and no happy ending. The commentary the film subtly sneaks in is that the working class sector of America is a miserable sector to be in. Often there feels as if there is no hope, and that the only accomplishment from working long hours, aside from money which quickly disappears, is tiredness.<br><br>I've always had respect for people working lengthy hours at a retail job. Now, being a part of that demographic, I can't fathom doing this work for years on end, eventually making it my only source for cash. The scariest part about being young and working retail (or even being older in some cases) is that you're always replaceable. Somebody else can learn how to push buttons on a cash register, stock goods on a shelf, bag groceries, work a store's computer system, help a customer with a question, mop up at night, and lock up. Many retail jobs do not possess skills that people can't learn without school; all can be taught in a day-long orientation session and mastered in the matter of weeks.<br><br>This is the kind of workplace honesty Sunlight Jr. infuses in its writing. It's a difficult subject but Collyer doesn't sugarcoat it. Her depiction of the material at hand possibly hints she, herself, or her parents were actively part of the working class drudgery at one point in her life, seeing as she clearly knows the harsh realities of the situation her characters find themselves in.<br><br>One of the best films to detail with the impact of the crisis is The Company Men, centering around Ben Affleck, a man victim to corporate downsizing who is now questioning his value as a male when he suddenly can't afford all the luxuries he felt made him one. Sunlight Jr. makes itself more accessible to people in the position of not having much to start out with and then working their way to having more demands in their life, whereas The Company Man was more of an analysis of the male in general along with going from everything to significantly less. Sunlight Jr. is among one of the best dramas of the year, mainly because it not only takes itself seriously but knows the realities of its characters' situations, which is half the battle with films along this line.<br><br>Starring: Naomi Watts, Matt Dillon, and Norman Reedus. Directed by: Laurie Collyer.","user":"StevePulaski","rank":[41,46]},{"title":"Realistic","rating":10,"date":"29 June 2014","review":"Certainly not an uplifting movie, but ironically, I found it to be refreshingly real and believable, at least as far as the world that I live in. No special effects, no affluent people, and nothing gratuitous ~ just real life. Good, gritty performances by all the characters. I relate to every single problem Melissa has to deal with, which is rare for me and probably made me biased. I think all rich people should watch this movie to understand what real problems are. This is a genuine portrait of what it's like out here for people who are just trying to get by, day to day. The cycle of poverty is hard to break and I believe this movie reflects the lives of many in our country today.","user":"hbeerose","rank":[9,11]},{"title":"Moving, though-provoking movie with stellar performances by Watts and Dylan","rating":10,"date":"9 October 2013","review":"Sunlight Jr., staring Naomi Watts and Matt Dylan doesn't sugar coat anything and that's a good thing. The subject of the movie, the working poor, along with stellar performances make for an intense, deeply moving and though-provoking film.<br><br>At heart a love story, the movie reveals the tremendous obstacles minimum wage works face to have a decent life in this country. Watts is haunting in an understated performance as Melissa, a convenience store worker with dreams of going to college and improving her life. She's in love with Richie (Dylan) a paraplegic, who also wants to make a better life for himself and protect her from her menacing ex-boyfriend, played wonderfully by Norman Reedus.<br><br>The beauty of Melissa and Richie's love shines through the bleak circumstances of their lives in Florida through convincing dialog that focuses as much on what's left unsaid as on their actual words. On the whole, Sunlight Jr. is a poignant and believable story conveyed by enormous talent—- I bet Dylan wins an award for this amazing performance!","user":"elizaamon","rank":[19,27]}]