[{"title":"Showcase for Binoche's acting talent","rating":7,"date":"21 April 2012","review":"The star of this movie is Juliette Binoche, who plays a reporter for Elle Magazine writing a story about two students earning a living as call girls. She leads the life of a typical bourgeois woman, with a husband and two sons, a big Parisian apartment, design kitchen and expensive clothes. She has everything she wants. But at the same time, her life is shallow and limited. The conversations with the two girls make her realize that there is more to life than she thinks, and she starts to doubt her own values and certainties. <br><br>The students confront her with the relativity of the things she takes for granted. 'Do you have a bathroom with a view?', asks the girl who hates the poor quality of life in her working class neighbourhood. 'I guess so, I've never thought about it', answers Binoche's character. And as she says it, she realizes how lucky she is to have a life many can only dream of. <br><br>At first, she is shocked by the girls' relaxed attitude towards prostitution. Later on, she realizes that in reality these girls are everything she herself isn't: independent, adventurous, open minded, rebellious, ambitious. Binoche is perfect in the way she expresses the doubts and confusion of her character. 'Elles' is a showcase for Binoche's acting talent. <br><br>Polish director Szumowska does a nice job by switching from the girls' sexual encounters with their clients to Binoche's daily routine of making breakfast, cooking dinner and washing clothes. The contrasts between the scenes accentuate the difference in lifestyle of the characters.","user":"rubenm","rank":[44,53]},{"title":"Disappointing but some redeeming features","rating":7,"date":"2 March 2013","review":"I was expecting Juliette Binoche to be as fabulous as she normally is, but she was the disappointment among the three female leads.<br><br>To be fair, I think it was the fault of the part, rather than faults in her performance. I think the idea was that her character, the journalist, got so involved in what she was researching and writing that she forgot about her own life and family until the story was finished; but the result was that her character was just a mess.<br><br>What I liked about the film was what seemed to be a much more honest and realistic portrayal of the two prostitutes than we normally see. Both were very believable. Both students, one (Anaïs Demoustier as Charlotte) in control of what she was doing, and the other (Joanna Kulig as Alicja) drinking to much and seemingly headed for disaster. Both of them liked sex; Charlotte liked the sex she had with her customers apparently just as much as she liked the sex she had with her boyfriend. You don't see that in Hollywood movies. In Hollywood movies the prostitutes never kiss and they never have orgasms, and they all hate what they're doing. In this film, Charlotte didn't hate it at all, in fact she liked it a lot; whereas Joanna said that she liked it, and seemed to like the physical sensations, but also seemed to hate the idea of what she was doing. That seemed pretty realistic to me.<br><br>There were two things that struck me particularly. One was quite early on in the film, when Juliette Binoche asked Charlotte why she kept working. The answer was that the money was hard to give up.<br><br>The second was from Charlotte again, and again in answer to a question from Juliette. The question was, what was the worst thing about the work, and the answer was having to tell lies all the time.<br><br>Both of those things rang pretty true to me.<br><br>So what it comes down to is a more realistic portrayal of prostitution than we normally get, but a rather messy movie with a rather messy central character.","user":"Felix-28","rank":[14,15]},{"title":"Erotic lifestyles","rating":7,"date":"24 March 2012","review":"According to some reports, great many female students in France financed their studies from prostitution. This film starts from this report. Juliette Binoche plays the journalist who interviews two of these girls. Many times.<br><br>She tries to analyze it all from a cold professional view, but finds that she is the one who changes and maybe also gets analyzed. The girls tell her they are abused sometimes, but Binoche is the one who takes the biggest injuries.<br><br>Interesting film about \"Western morals\" declining more and more in all ways, since we're not interesting in sharing profits like we used to. But the film is a little cold and and analyzing, just like a professional journalist should be.","user":"stensson","rank":[30,44]}]