[{"title":"A decent thriller/heist movie. Full of the usual plot-holes though!","rating":7,"date":"4 January 2012","review":"As you'd expect, \"Man on a Ledge\" is a Swiss-cheese plotted heist and \"prove his innocence\" movie but taken as just that, it's quite an enjoyable movie. I suppose after having seen enough of these kinds of movies, I shouldn't expect perfection in how every plot thread is tied up since very few movies manage it. However, what the movie does excellently is setup the plot and build up the situation perfectly. Just starting as a literal man on a ledge, we see subtle layers added until we get this full on crescendo of diamond heists, negotiators, cops, convicts, bad guys, good guys all happening on in a single block in New York. So, given that you're willing to suppress your tingling plot-hole sense, it can be an enjoyable movie.<br><br>The cast is quite good and the acting and tension is par for the course. The leads Sam Worthington and Elizabeth Banks do a great job. Seeing Worthington as an ex-NY cop, ex-convict and Banks as a negotiator/psychologist with a past is surprising on paper but they manage to pull it off very well. However, Jamie Bell is one of the heist-team but his opposite who plays Angie make for some cringe-worthy comedy, like some Sofia Vergara slapstick in the middle of a tense situation. Ed Harris looks emaciated but equally sinister as the villain and there are a host other minor NY characters.<br><br>I can hear the Hollywood pitch for the movie in my head, \"it's like The Negotiator combined with The Italian Job but happens in NY and instead of a hostage situation we have a jumper.\" And, essentially it's just that – a movie that heavily recalls other movies from the past except perhaps for the man on ledge. On a side note, it seems that every NY movie nowadays has a reference to the OWS movement and what a typical OWS protester might look like.<br><br>The movie is at its best when it clamors for our hero who desperate and is fighting all odds to clear his name as he shouts from his ledge, \"I am innocent and this is my retrial.\" The movie is at its worst when it's ungainly roping in all the plot threads it cast out but can't seem to put it together. Overall, it's a good enough movie for people who like these kinds of movies. If you've caught yourself bitterly berating the many plot holes in heist movies, maybe this isn't for you.","user":"MosHr","rank":[108,145]},{"title":"Disregard the Bad Reviews and Enjoy this Entertaining Action-Thriller","rating":7,"date":"17 June 2012","review":"In Sing Sing Correctional Facility, the ex-cop Nick Cassidy (Sam Worthington) is informed that his appeal was denied by the court. When his father dies, Nick has authorization to go to the funeral escorted by two policemen. However, he has a fight with his estranged brother Joey Cassidy (Jamie Bell) and Nick subdues the police officers and escape. <br><br>Nick lodges at the 21st floor of the Roosevelt Hotel in New York and he goes to the ledge through the window and threatens to jump on the floor, attracting a crowd on the street. The negotiator Lydia Mercer (Elizabeth Banks) is assigned to convince the unknown jumper to give up of his intention. Meanwhile Joey and his girlfriend Angela Maria 'Angie' Lopez (Genesis Rodriguez) breaks in the jewelry owned by the powerful David Englander (Ed Harris). Nick claims innocence to Lydia and asks her to give more time to him since he will prove that he is innocent. Lydia believes that Nick is honest or lunatic and decides to investigate his information.<br><br>\"Man on a Ledge\" is an entertaining action-thriller with a great cast. The story has the usual plot holes and unrealistic situations, but that is the funniest part of this type of movie. The unknown Genesis Rodriguez is a very beautiful actress and my advice to the readers is to disregard the bad reviews and enjoy this good film. My vote is seven.<br><br>Title (Brazil): \"À Beira do Abismo\" (\"On the Edge of the Abyss\")","user":"claudio_carvalho","rank":[58,76]},{"title":"Man on ledge = viewer on edge","rating":7,"date":"22 June 2012","review":"Don't be put off by the rather boring title, this is a quirky little movie that works quite well and will give acrophobics a dizzying run for their money.<br><br>I have to say that I figured a movie in which the plot revolves around some guy on a ledge would be relatively slow paced. However the film is in fact surprisingly fast-paced with the viewer largely unaware of the underlying plot even as our man steps out on to his ledge. <br><br>The characters and their parts in the plot are revealed as we go, with plenty to keep the viewer on the edge of their seat as our disgraced ex-cop dangles precariously on his ledge. <br><br>The revelations come thick and fast, and at one point you may well be asking yourself whether there are actually any good cops in this movie (luckily for our \"jumper\", there are!). <br><br>There is one really good action scene/stunt in the movie which is difficult to describe without ticking the \"spoiler\" box so I will leave you to discover what was for me the best jaw-dropping moment of the film.<br><br>And just in case anyone reading this review has already watched the movie and was wondering, Genesis Rodriguez stripping down to her underwear was my second best jaw-dropper scene (sad, I know!)<br><br>Not an epic but a nevertheless entertaining movie that is well worth watching, and there is even a nice little twist towards the end.","user":"MrGoodMovie","rank":[40,54]}]