[{"title":"Rewards for the Serious Moviegoer","rating":8,"date":"19 May 2011","review":"This is not a movie for the masses. Will Ferrell fans who liked Melinda and Melinda and Stranger Than Fiction will not be surprised by his performance as Nick Halsey in this movie. He does comedy so well, many of his devoted fans may not realize that he is a good dramatic actor as well. <br><br>Ferrell's supporting actors, especially Christopher Jordan Wallace, are also very good. The story moves at a slow and deliberate pace which will bore all but serious moviegoers. However, the acting is excellent along the way, and in the end, the movie has synergy and leaves you with a positive feeling about Nick's future.<br><br>If you like deliberately paced independent films, go see this movie. It won't be around long.","user":"jwbeller","rank":[59,72]},{"title":"Sold","rating":8,"date":"29 September 2011","review":"Everything Must Go is probably Will Ferrell's first truly well done film in years. The Other Guys was pretty good, Step Brothers was funny in parts, but this one totally takes the cake for being a great drama, and schools anyone who thinks Will Ferrell can't do anything but comedy. Though I doubt fans of Old School will think highly of this.<br><br>The plot isn't too much, but it sustains a film. Will Ferrell is Nick Halsey, an alcoholic who has had one too many alcohol-related episodes and has finally lost his job. He returns home to find out his wife has changed all the locks on the house, and has moved all of his belongings to the front yard. Frustrated and hopeless, he decides to life on his front lawn, and make the best out of a horrible situation.<br><br>He spends his day sucking down Blue Ribbons beers, until he is met by a chubby adolescent named Kenny (Christopher Jordan Wallace, the son of the late rapper Notorious B.I.G.). Kenny's mom takes care of an elderly woman, leaving him free to roam the streets on his bike. Kenny and Nick strike up an odd, but warm relationship with each other and when Nick is informed by his AA sponsor (Pena) that he must move all his stuff off his lawn in three days, he works with Kenny to help them hold a big yard sale.<br><br>A sub-plot involves Nick getting acquainted with the woman across the street who has just moved to the neighborhood and is awaiting her husband's arrival. The relationship isn't as strong or as well-crafted as the relationship between Nick and Kenny, but it is still a solid one.<br><br>It's also noteworthy that we never see Nick's wife or the woman's husband anywhere in the film. We don't need to, though. The plot works fine without them, and I believe that if we saw Nick's wife in the film we'd get too many arguments between the two which may result in (a) believability being low and (b) a possibility for Ferrell's comedy side to sneak in. We don't need comedy here. We get it, but in tiny, miniscule doses. There is almost nothing funny about this situation.<br><br>Once again, this proves that Will Ferrell is a great character actor, and doesn't have to get drunk, shout his lines, or get in goofy fights to be successful. Unfortunately, Everything Must Go's overall performance wasn't impressive, and it may be a long time before Ferrell does something like this ever again.<br><br>Not everything here is perfect. The worst flaw is the ending because there is no emotional payoff, and nothing to make our experience anymore than just enjoyable. I wanted more than enjoyable. I haven't read the short story \"Why Don't You Dance?\" by Raymond Carver, so I'm not sure of any similarities both this and the story share. Everything Must Go is a good film in general, but a great film in terms of Ferrell, who is essentially putting on a one-man-show for more than half the film.<br><br>Starring: Will Ferrell, Christopher Jordan Wallace, Laura Dern, and Michael Pena. Directed by: Dan Rush.","user":"StevePulaski","rank":[39,47]},{"title":"Everything Must Go is a well-made movie, but heavier than I was seeking","rating":7,"date":"25 May 2011","review":"I really enjoyed Stranger than Fiction and, since I had heard Will Ferrell's performance in that movie compared favorably to the one in Everything Must Go, was excited to see EMG. I walked away after seeing EMG a little unsure of whether I truly enjoyed the movie or just merely appreciated the quality of the director's vision and execution. Everything Must Go is the story of Nick Halsey (Ferrell), a struggling alcoholic who, in the first 10 minutes of the movie, has been laid of from his job and kicked out of his house by his wife, all within the same day. The rest of the movie looks at Halsey's attempt to manage the tension between wanting what he once had and trying to pursue a life that he desires, even though he isn't entirely sure of what that looks like. I will start by saying I thought the acting of everyone involved, especially Will Ferrell and Christopher Jordan Wallace, was superb and a highlight of the movie. I thought the music and visuals added significantly to the feel of the movie, especially how so much of the movie occurred in the front yard with the records of his father occasionally playing in the background. Now I knew to expect a story that was not a happy-go-lucky comedy (is there one about an alcoholic struggling with sobriety), but was hoping for some more lightheartedness. I did particularly enjoy watching the relationship between Nick Halsey and Wallace's \"Kenny Loftus\", and thought that the filmmakers did a good job pairing the two actors up. A couple of things with which I walked away: first, I found it interesting how the director decided to show Halsey's eventual growth in the way that he let go of certain things, and to whom he left them. Afterwards, a friend of mine and I discussed how difficult these acts would have been, but thought it appropriate for someone trying to move beyond such a serious issue as alcoholism. I also found it interesting that such a pivotal character, like Halsey's wife, has no screen time at all, save for her voice in one scene. It is as if the filmmakers want us to see how much damage one person has managed to do by simply stepping out of another's life. Overall, I do believe that the movie was well made, with an interesting story and fantastic acting, but the mood of the film was a little heavier than what I was looking for.","user":"scotty_cable","rank":[58,75]}]