[{"title":"Definitely the best Action flick in the series from 2011","rating":10,"date":"18 October 2015","review":"Fast Five (2011) is one of the best Action heist films of all 5. film series of all time. This film reunites all actors from the previous films. Vin Diesel, Paul Walker, Jordana Brewster , Tyrese Gibson , Chris 'Ludacris' Bridges, Matt Schulze, Sung Kang, Dwayne Johnson, Gal Gadot, Tego Calderon and Don Omar, the gang are all here! They are all cast from the previous installments. <br><br>\nThe Director brings all new actors in the cast crew: Joaquim de Almeida, Dwayne Johnson and Elsa Pataky. The script, the players, the action scenes, the story. Everything about this film is awesome! This film kicks ass. Is my second favorite best film in the series franchise. This film for me even beats Furious 7. Cause Furious 7 is not that good as this film is. The far of the highest best films ever. It's actually probably my favorite movie that I've ever seen. If you like any of the other fast and furious movies SEE THIS ONE!!!!! It's a Epic movie watch it till all the way to the end.<br><br>Fast Five picks up, literally, right where Fast &amp; Furious left off. Dom (Vin Diesel) is on his way to prison when his partner, former undercover detective Brian O'Conner (Paul Walker), and his sister Mia (Jordana Brewster) stage a daring (albeit highly unlikely) prison-bus break. On the run from the police, the FBI and the media, the three hightail it across the border and head even further south, all the way to Rio de Janeiro. There, they decide to lay down, lay low and avoid any unwanted attention. Nah, I'm just kidding. They do what any international fugitives would do: rob a train, double cross a local crime lord named Hernan Reyes (Joaquim de Almeida) and his right-hand man Zizi (Michael Irby), put themselves on the radar of a ludicrously musclebound U.S. Diplomatic Security Service agent (Dwayne Johnson), and set out to steal untold millions from Reyes. That's right, it's One Last Heist for Dom and Brian. Not that anyone should be foolish enough to think this is the last we'll see of the led-foot duo; not after Fast Five revved up $600 million at the worldwide box office. (Be sure to sit through the first chunk of end credits for a nice little surprise.) Fast Five boasts incredible action scenes that are all varied and equally exciting. The film is full of clean, well choreographed shots that are easy to watch and the cast works great as a whole unit, making the film's running time breeze by. The heist in Rio De Janeiro was amazing An energetic, high-octane. The film was brilliant and smart it was action fun Entertained. The fight scenes between Dwayne Jonson and Vin Diesel was tremendous. I was happy that they put someone (Dwayne Jonson) in the movie that was so smart like Dom (Vin Diesel) was. Luke Hobbs as A Diplomatic Security Service agent to track down Dom and his crew was awesome! He did a brilliant job In this Action packed sequel film! Just Lin deliver us a high octane Action packed story filled with full of cars and shootings in his film.<br><br>Vin Diesel, Paul Walker and Dwayne Johnson lead this all-star all-action movie with outrageous stunts, incredible cars and beautiful girls that pushes the limits into the red and beyond! The legendary Dom Torreto (Vin Diesel) partners with outlaw cop Brian O'Conner (Paul Walker) on the opposite side of the law in exotic Rio de Janeiro, Brazil. Hunted by ruthless Agent Hobbs (Dwayne Johnson) and an army of corrupt cops working for a deadly drug kingpin. Torreto and O'Conner reunite the gang from previous Fast adventures to pull off one last job - an insane heist worth $100 million! <br><br>\"Five Times The Action!, Five Times the Fury!\" <br><br>I love this film to death and I love how they were planning to rob a Police Station. The first half was a little boring, but the second half was fast paced entertained filled with action. I love this film and everything about it. I love that it is 2.hrs long so that it can tell the whole story.<br><br>When developing Fast Five, Universal Studios deliberately departed from the street racing theme prevalent in previous films in the series, to transform the franchise into a heist action series involving cars. By doing so, they hoped to attract wider audiences that might otherwise be put off by a heavy emphasis on cars and car culture. Fast Five is considered the transitional film in the series, featuring only one car race and giving more attention to action set pieces such as gun fights, brawls, and the heist of $100 million. The production mounted a comprehensive marketing campaign, marketing the film through social media, virtual games, cinema chains, automobile manufacturers, and at NASCAR races.","user":"ivo-cobra8","rank":[103,114]},{"title":"Best Fast & Furious movie","rating":8,"date":"23 February 2020","review":"This is the best Fast and furious movie in my opinion. The franchise reinvented itself here and the series really benefited from it. This had a much better and believable plot and of course the Rock made the movie really good as well. 8.5/10","user":"MR_Heraclius","rank":[41,51]},{"title":"I wasn't expecting much from this...but WOW.","rating":10,"date":"23 April 2011","review":"I enjoyed the movie so much, that I came onto IMDb and registered myself just so that I can post a review. <br><br>The movie was packed with jaw dropping, eye popping action from beginning to end. The drama had a mix of sadness, comedy and seriousness which were all mixed in together so beautifully to give a consistency to keep the viewer starring at the screen and being involved in the movie rather than daydreaming about other things. <br><br>In my honest opinion I would say that it is the best Fast &amp; Furious movie to date. <br><br>I want to go see it again!<br><br>(by the way, I realise that this isn't the best review in the world or might even be an awful review, the point is that I enjoyed the movie thoroughly and felt I should contribute to it's high average ratings).","user":"mus_ne_17","rank":[395,573]}]