[{"title":"\"Pure Country 2\"???????","rating":1,"date":"30 October 2012","review":"Short and sweet review. This is no sequel. It's a steaming pile of crap.<br><br>If you loved \"Pure Country\", you'll HATE this stinker.<br><br>The addition of angels is hokey. The plot line is trite and predictable. George Strait is only in it for the WORLD'S HOKIEST \"fight\" scene and a could of distance shots. <br><br>This is a really horrible. SUCH a disappointment. <br><br>Dean Cain was one of the writers of this movie.... he should stick to acting. Or.. maybe if he REALLY wants to write, he should try NOT sullying the memory of a fun movie like \"pure country\".","user":"kjarvis222","rank":[7,7]},{"title":"Why is This Called Pure Country 2?","rating":14,"date":"14 August 2011","review":"Generally when you label a movie as a sequel (hence the \"2\" in the title) you set up the expectation that it will be a continuation or, at the very least, contain some of the characters from the original film. Since this movie bore no relation to the movie \"Pure Country, I am at a loss to understand the title.<br><br>Yes, George Strait was in both movies. However, in the first he played a fictional country singer while in this sequel he played himself in a much smaller role. That is the only tie in. That being said, this movie could have easily had a different title and used a different well-known country singer without changing the plot.<br><br>Speaking of plot, this one was saccharine, corny and predictable. My husband sat through it with me and kept saying, \"okay, now this will happen next.\" It was sad to see so much talent -- Michael McKean, Cheech Marin, Bronson Pinchot, even Dean Cain -- put to waste.<br><br>Katrina Elam has a great voice and I enjoyed some of the songs. However, unless you want your teeth to fall out from all the sugar or you're looking for something to put you to sleep at 3 am, avoid this movie.","user":"dshildebrand","rank":[10,11]},{"title":"NOT, Pure Country 2","rating":5,"date":"5 September 2011","review":"**SPOILERS** I only watched this film because it was titled Pure Country 2. As a fan of the original Pure Country, this film is just sad! It had absolutely nothing to do with the the original film. While this is an OK film, please don't watch this thinking it will be another Pure Country. The only thing this film has in common with the first film is country music and George Strait has only 1 1/2 minutes in the film, even though IMDb has him listed as a main star of the film. Watch this film for what it is and not for what it is not, Pure Country 2. Also IMDb don't list people as first billed, when they have less the two minutes of screen time. George Strait: 1 1/2 minutes of screen time. Dean Cain: 45 Seconds of screen time.","user":"dankohner1","rank":[6,6]}]