[{"title":"Jeff, who lives in all our homes","rating":9,"date":"10 June 2012","review":"Everybody has a quirky movie that they, and few other people or critics, like. It just might be that a movie simply comes along at the right point in our lives and interlocks with events in it. I certainly have a number of movies among my favorites that fit into this category, and I have a feeling that Jeff, Who lives at Home might have been admitted to it.<br><br>Although it is billed as a comedy, and there are certainly comic elements to it, there is a more serious component that underlies it and gives it some depth. Jason Segel plays a slacker who, at the age of 30, has few prospects (and living at home at 30 seems to be the modern stereotype of a loser). Jeff clings to the idea that some 'sign' will appear to show him the way. In fact, he is viewed as nothing but a loser by his mother, brother, and just about everyone else. When someone mistakenly calls his number asking for Kevin, Jeff, seeing this as the sign he's been waiting for, begins his search for his role in the universe, brushing aside all ridicule in the process.<br><br>I like movies that show how small, apparently insignificant, choices can lead to life changing events. I also like movies in which a character is redeemed by adhering to principles that everyone else thinks are insane. In its own subtle way, the movie questions many of the basic premises that underlie modern society. Yeah, I know, maybe I'm reading too much into this, but, I suppose, that's why we all like certain movies that others don't.<br><br>You're not going to get a better guy to play a slacker-loser than Segel. The other actors hold up their roles well. I admit that I expected little of this movie, but I found it engaging right from the opening scene. Give it a chance and I foolishly believe you will not be disappointed","user":"SteveMierzejewski","rank":[85,101]},{"title":"Money, That Was Well Spent","rating":8,"date":"30 March 2012","review":"Don't let the title scare you away, 'Jeff, Who lives At Home' is a deep character study about three unhappy people and the meaningless existences they each inhabit.<br><br>One such person is Pat (Ed Helms), a man stuck in a roller coaster of a relationship with his wife, Linda (Judy Greer). Pat has recently purchased any man's dream car, a brand new Porsche. Judy doesn't share in his delight for his new automobile, which only distances them even more. When Pat suspects Linda of having an affair, it leads him on a inept detective mysterious, where most of the films humor draws on.<br><br>Susan Sarandon plays Sharon, the mother of Pat. A widower, Sharon is very lonely and loans for someone to connect with. When a \"secret admirer\" begins sending her flirty messages, Sharon is delightfully surprised someone is still interested in her despite her age. It's up to Sharon to uncover this mystery person's identity.<br><br>The last chapter, the title character, is played by Jason Segal. By far the best part of the movie, Jeff is a slacker in his 30's with no real aim in life. After seeing the movie 'Signs' and having someone with the wrong number call him and ask for a Kevin, he believes it to be a sign. The rest of his arc delves into him following after all things tied to \"Kevin,\" and the strange paths it takes him.<br><br>A common misconception I can see being falling into is that this will be a broad, raunchy comedy, like the ones Ed Helm and Jason Segal have headlined in their career. If you go into this film expecting that, you'll be disappointed. This is a thinking man's movie, with smart humor and likable characters sprinkled in. With your time.","user":"Pycs","rank":[76,104]},{"title":"More of a drama then a comedy but very good. Heartfelt and moving. Not your typical Segal movie. I say B+","rating":7,"date":"14 June 2012","review":"\"You ever feel like your waiting for forever to find out what your destiny is and when you do it's not really that exciting?\" After receiving a phone call from a wrong number Jeff (Segel) thinks that the call has a deeper reason. His mom (Sarandon) calls and asks him to run an errand for him. What starts as a simple trip to a hardware store begins to evolve and change the lives of everyone Jeff comes into contact with, including his brother Pat (Helms). This is another movie that is almost nothing like the preview. The preview made it seem much funnier then it was. While this did have some funny parts in it I found this movie to be more sweet and heartfelt then I expected. Some of the aspects of the movie are very serious but they are done in a way that tone it down. Segel is just about the perfect choice for this role because there is just something about him that you find disarming and comfortable no matter what he is doing. If you are looking for a typical Segel comedy this is not it. This one has more substance and heart and is very much worth watching. Overall, if you liked \"Everything Must Go\" then this movie is for you. I recommend this but this is again not your average comedy. I give it a B+.","user":"cosmo_tiger","rank":[21,27]}]