[{"title":"Meets Moderate Expectations","rating":6,"date":"28 January 2012","review":"The current score of this movie is 4 and unless you are a devoted fan of the books that's harsh. If you are in love with the twenty or so books you must have known less than two hours worth of movie will never compare, ever. I sympathize, beloved books are difficult to put on film, but this was actually rather amusing. On par with most romantic comedies and even better than some. It's not actually a romantic comedy though, an outlandish-girly-action-mystery-comedy is a more accurate description. The previews are representative of the film.<br><br>I will say the PG-13 rating was forced, mostly in the \"language\" category. Cable TV after 10 pm has more bite. An R rating with a few swearing felons would have been a bit more realistic, especially since the sexual situations are more than a 13-year-old should be watching and the storyline definitely adult. The writers must have sacrificed 10 swears for 3 bras and a shower curtain or something equally un-creative.<br><br>The comedy was there, sexual and self-deprecating and physical as advertised. On opening weekend (with the $6 groupon) the theater was full and the audience was seated throughout and laughing regularly.<br><br>Eavesdropping, the book fans were a little disappointed but mostly because they know so much more about the characters at this point. They wanted more Lula and Grandma and quirky little side scenes they remembered from the novel. Katherine Heigl was not loved as Stephanie Plum, but not hated enough to curse. Expectations were met.<br><br>I will agree it wasn't worth $11.25, but a lot of movies aren't. As a matinée or a DVD, go for it.","user":"anarresa","rank":[56,69]},{"title":"Surprisingly enjoyable despite itself","rating":7,"date":"15 June 2012","review":"Very enjoyable light entertainment. A crime story that revolves around a clueless but persistent woman. The crime itself isn't all that important, and the focus is not on the narrative drive forward (which is good because it's kinda predictable). The focus is instead on the character of the female lead. Oddly, it's not about her growing as a character, or even about her getting more and more confident about her chosen line of work. It's not even about proving herself to everyone that she is capable.<br><br>The story is about persistence, about how this character is somehow ideally suited for this situation, but just lacks the knowledge to be truly successful. <br><br>If this wasn't such a light and airy movie, I would suspect that it was a metaphor for living in the age of the Internet, where knowledge is a commodity and anyone who has access to specific areas of knowledge can be an expert. Alas, it's a little less than that.<br><br>Unfortunately for the movie, the lack of character depth and the cumbersome box-like production make it seem very TV-ish. Like this was the pilot episode of a series. It also suffers from useless-narrator syndrome. I didn't read the book, but I suspect the source material may share some of the blame for that via lazy exposition.<br><br>Speaking from a guy's point of view about what is essentially a chick movie, it doesn't hurt that Heigl is hot, has a nice smile, and can handle a gun. And is a pretty good actress, sure, yeah... that. The casting could have been a lot worse. I would watch Heigl in just about anything if she stayed brunette.","user":"stills-6","rank":[16,18]},{"title":"Some fun quirks and unpredictable points of view","rating":7,"date":"27 January 2012","review":"This adaptation of Janet Evanivich's book is well done and a lot of fun. Katherine Heigl is excellent in the role of Stephanie Plum. Apparently the author considered Katherine perfect for this role after seeing her in another movie. I'm so glad it was directed by a woman and combines the chick flick aspect with the mystery/bounty hunter storyline. Women's dates will be well rewarded, by Heigl's charm and beauty, for being along for the ride.<br><br>Heigl proves again what she showed in her television work in Grey's Anatomy and Roswell, that she's an excellent and versatile actress. She displays the vulnerability combined with toughness and a certain likable gullibility that are exactly as the book portrays the main character.<br><br>The movie is only 91 minutes long. Since the book and the movie depend more on the fun of getting to know the characters, including the first-person narrator, Stephanie Plum, it would have been so easy, and would have made it much better IMO, to include more scenes with the family, especially Grandma Mazur (Debbie Reynolds!), and with Lula (Sherri Shepherd is also wonderful). As it is, the \"action\" plot takes over in the second half, and it left me wishing for more of the fun character interactions.<br><br>Plum, Morelli and Ranger are really well portrayed and quite a lot like I imagined them while reading the book. This is light entertainment with a few quirks and unpredictable points of view, like the book, and overall a very enjoyable hour and a half.","user":"ladyokey","rank":[74,109]}]