[{"title":"Ashley?... Ashley! .... Ashley!!!","rating":1,"date":"6 January 2017","review":"Shhh.... Did you hear that?... Peter?... Peter?!... Peter!... Peeeter!!... Ashley!...Ashley?... Ashley!....ASHLEY!... Aaaashleeey!!... Aaashleeey!....James?... Jaaames!...Lisa!... Liiisaaaa!... Peter?... Peter!!!.... Lane?... Laaane?.... Talia?... Talia!.... Ashley?... James???... Lisa? ... Liiisaaaa!... HEY! All of you just shut the f**k up! It's over! OK? Take it down a notch. It's finally done. What started in 1999 with a unique low-budget, cleverly executed and promoted, and genuinely creepy little indie film, finally ended in 2016 with a ridiculous corporate big-budget hackneyed piece of shhhh...did you hear that?... Ashley?... Ashley?.... ASHLEY!","user":"pazu7","rank":[303,387]},{"title":"The Jump Scare Project","rating":4,"date":"30 January 2017","review":"Adam Wingard is considered by many in the horror community to be one of the best young directors coming up right now. Frankly, I've never much been impressed with his work before this and after seeing this travesty I'm even less impressed. I simply cannot fathom what some of the horror blogs and websites appreciated about this movie when they gave it such rave reviews. I know, as I push past 40 years old, that I am not exactly the target demographic for teenage horror any longer. Being the age that I am, though, makes me also right in the wheelhouse of the generation who adored the original. <br><br>I was in my late teens when THE BLAIR WITCH PROJECT came out. I saw it on a date, as a matter of fact, and was blown away. Having grown up in the era of the slasher film, I was more used to horror being much more blatant and gory. It had become a mockery of itself by the 90s, though, and we were all so hungry for something fresh to re-kindle horror and this movie took the world by storm. If you are too young to remember, it's release then you really can't understand the impact that it had. Nowadays, indie horror is packed full of found footage, but this was revolutionary to us. Even more, the style of horror was something that my younger, novice horror mind was not yet used to. This was horror that was that was not in your face with a villain or brutal deaths. This was much more psychological, an intense fear-driven journey through into truly frightening territory.<br><br>I was excited when it was announced that a sequel/remake was coming. I thought this could legitimately have a chance to be good, but man was I wrong. This movie seems to completely misunderstand everything that made the original terrifying and replace it with dumbed down horror for brainless fans. Then again, when I see the younger reviewers on this site tear apart the original BLAIR WITCH as boring and \"unscary\", then maybe I get a better understanding of the adderall-fueled legions that this movie was trying to target.<br><br>Whether you liked the original film, or not, it definitely starts out with a much more interesting cast. The trio in the original have their annoying habits, but they are likable people with personalities. The characters in this one are as cardboard as it comes. The tragic hero looking for lost loved one. The jock. The weird stoners. All we're missing is the slut. Now, take these boring people and stick them out in the woods with no building sense of dread, at all. Replace that with instant terror that takes almost no time to build right, then endless shots of the characters walking around screaming each others names. Now, replace all of the subtlety of the original for loud noises and witches who have now become X-men villains, capable of ripping tents up out of the ground and knocking over trees. All of it leads to a house in the middle of nowhere, with a camera-shaking chase through random scenes of horror, more loud noises and crashes and tantalizing glimpses of a bad monster that we're probably better off having not seen in its' entirety but since viewers seem to be too unimaginative now to see a movie and have to imagine the monster rather than see it, we have to be given something.<br><br>I'm sounding a lot grumpier than I intended to, but this movie makes me mad. It's an all too perfect example of the sort of garbage horror that gets brought to the big screen while terrific movies go almost unnoticed on some streaming site that a few hundred people get to see. It's a reminder that Hollywood is completely afraid to back original horror and this mockery of the original doesn't deserve the Blair Witch name.","user":"TheRedDeath30","rank":[43,53]},{"title":"Completely misses what the original was about.","rating":2,"date":"3 January 2017","review":"Here I was, expecting a continuation to a truly scary \"lost in the woods\" simulator. What I received was a couple of American teenagers getting picked off one by one by the supernatural - as usual in low effort horrors.<br><br>The Blair Witch Project (1999) was good, because it was trying to be realistic. Heather, Josh and Michael for all their faults weren't lacking chromosomes, unlike the protagonists of the sequel/reboot. <br><br>James, Lisa, Ashley, Peter, Lane and Talia - each one of them makes 12 y.o children look like master tacticians. One terribly stupid decision follows another.<br><br>Let me kick around parts of my tent, because I'm a choleric who can't put it up in 5 minutes. Let me just go gather firewood alone, in the middle of the night, losing line of sight with the camp. Let me climb this tree, even though I could barely stand 10 minutes ago, because of the fever and leg wounds. See a creepy dolls hanging around? Oh, look at this one - not only it looks like a human being, but also it has some hair of this crying, scared out of her wits girl. I see no reason I shouldn't snap it in half, dealing with a witch and all.<br><br>When I saw the preparations - GPS, drones, portable radios I thought I was in for a great, well-written story that despite the wonders of technology will show how helpless a man can be versus nature (and a curse). I wasn't wrong about the last part, but I didn't expect the witch to be a REC-zombie rip-off walking EMP. You know that electronic devices known for their reliability in survival situations? They don't work anymore. Why? F*** you, that's why.<br><br>It's extremely hard to watch. I considered leaving the theater mid-session, because I felt insulted by just watching it, but I managed to endure it to the end.<br><br>I felt relief when the last survivor got picked off the same way her friend was few seconds ago. She SAW it happen and then she did the same thing herself nonetheless. \"I'm free now\" I thought \"and nothing of value was lost\".<br><br>The only reason I didn't grade it with 1 star, is because of my respect for Blair Witch Project (1999). Yeah, it started the whole 'found footage' fad, but it was original and scary for someone who lived near the woods for most of his life.","user":"belknerp","rank":[64,92]}]