[{"title":"An A-status B-movie.","rating":7,"date":"5 December 2015","review":"This is obvious a B-Movie.Along the line of a cult flick. Especially the beginning felt very comic book like.<br><br>Difference with the majority of these sort of flicks is, that this is worked out pretty well the whole movie thru. Most elements to make a good movie are there but some don't reach there full potential thru budget restrains.<br><br>The whole cast seemed to have a blast making this and the love for the source material is definitely present for everyone involved.<br><br>Surprised this only got a one review but happy because he summed it up better than I could.<br><br>If your a horror fan you should give it a change. It is worth much more than the money they put into this.<br><br>I think, like me,you will be pleasantly surprised.<br><br>I strongly recommend this. It's very entertaining good old horror fun.<br><br>Just awesome!<br><br>Enjoy.","user":"djangozelf-12351","rank":[11,20]},{"title":"My Review of \"Hell Fire\"","rating":9,"date":"18 December 2014","review":"The story is a strong, well written onslaught of witty humor spat out by comparable indie actors. The characters are, individually, creative personas that come together in perfect insanity. The cast and director of \"Hell Fire\" were definitely in sync and really feeling this story because everything came together to create a wild, entertaining moment of escapism. Fratto's creativity and ability to tell a story is stellar, as exciting as John Waters with Trash Cinema, and intense as Tarantino with his postmodern crime- thrillers. <br><br>The special effects are pretty tight in \"Hell Fire\" with some very gritty, realistic horror elements that will please any horror/gore fan. I was impressed, mostly because it is obvious that this is a low budget film so I was shocked at the higher quality practical effects used here. The over all effect of the scenes often felt too real. Kudos. There are a few moments when CGI is chosen, but never enough to kill the mood or sap the Hellishly fun energy out of the film. <br><br>The only suck of \"Hell Fire\" is the very noticeable moments of poor sound quality during dialog scenes. Not always but it does keep the film from reaching 100% of its \"awesomeness\" potential. Now the soundtrack and music were both doing their thing to really create the right atmosphere Fratto was going for. The music pulled from classic, b-movie nostalgia and contemporary mood enhancement. Yeah, other than the wonky sound quality in several of the dialog scenes, things are on point in \"Hell Fire\" – in my opinion. <br><br>Overall \"Hell Fire\" is a killer action-packed, bloodbath of supernatural insanity, with an atmosphere of gutter trash avant garde. I loved this movie and Marc Fratto knows how to tell a great, original story. The characters are affective and at times likable. Even as bad, and unsavory as they are portrayed, I couldn't help but connect with them. These are not people engaging or talking table talk by any means, this back alley, trashy, real stuff that goes down after dark in red light districts. Which makes the fact that this is a supernatural battle between good and evil fought by hookers, pimps, druggies and the Anti-Christ that much more special. \"Hell Fire\" is definitely worth the watch. Any fan of horror, gore or exploitation.will really enjoy this film.","user":"ASouthernHorrorFan","rank":[16,35]},{"title":"SO WHAT ELSE CAN YOU DO?","rating":4,"date":"5 May 2018","review":"Josie (J. Scott Green ) is an underachieving Anti-Christ who has yet to reach his potential. He smokes pot and likes dirty hookers. Dark Gable (Chris Davis) is his connection. After a melee shoot out, Josie is abducted by four prostitutes who believe he has money. Josie's agenda is to have someone kill the infant of a Bronx woman who is to be the second coming of the Messiah.<br><br>The film had numerous scenes with blood, killing, possession, re-killing, more demonic possession with re-re-killing. In fact the lack of order within the film and the bloody chaos made the viewing less enjoyable as the goal seemed to throw idiotic blood at us for the sake of blood and gore.<br><br>The film had some good scenes and some humor that worked, but for the most part it was a poorly shot amateur attempt that needed a lot of polish. More of a slasher film than an Omen type.<br><br>Guide: F-word. Brief sex. Very brief nudity (?)","user":"nogodnomasters","rank":[1,1]}]