[{"title":"Worth a look at least once","rating":13,"date":"13 May 2011","review":"\"Mirrors 2\" isn't exactly in the same league as its predecessor. Unlike the Kiefer Sutherland story, there's more or less no suspense. Not because its predictable (which it isn't), but simply because it's a sequel. Actually, this isn't a sequel. It's a rehash of the first one, except there's no mystery this time. I found this \"sequel\" fairly enjoyable, and I recommend to anyone not expecting too much out of it. Compared to the previous story, this one is a pale imitation, which is easy to see why it went straight to DVD. A worthy rental, but it's not worth spending 20 some dollars on.<br><br>**1/2 out of ****","user":"raisleygordon","rank":[15,18]},{"title":"Truly Terrible","rating":1,"date":"4 October 2010","review":"For one the first movie wasn't very good (so your expectations are low anyway). BUT this movie is WAY worse. The dialogue is terrible and at times the acting is almost laughable. Nick Stahl has been in some decent movies, but in this he looks like he's just come out of rehab and took this part for a quick buck. He clearly didn't read the script or watch the first movie, which makes me think he didn't care as long as he got the work.<br><br>If your watching it for the shocks, you won't find any in this which actually \"work\" (not unless your of an extremely sensitive disposition at least). A character doing \"insane things\" in a mirror while a \"normal\" person at the other side of it \"isn't\" can only work SO MANY TIMES (like once) before your completely bored and used to the whole thing.<br><br>No story. No plot. No believable characters. No dialogue. No scares. No decent effects. No decent nudity (at least get REAL looking women, not plastic surgeon modelling wanna be actress rejects). Not worth renting.<br><br>At the end of this movie one of the characters screams. I knew EXACTLY how he felt. I imagined he'd just watched the movie himself and was sharing my pain.","user":"rosscosjunk","rank":[63,107]},{"title":"Okay sequel more bloody then first but not creepy or scary!","rating":5,"date":"6 October 2010","review":"I was disappointed with Mirrors (2008) , the trailer made it look a lot more creepy then it was, that movie did have one or two creepy scenes and the acting was great for that movie and they had one really good death in that movie, i gave that movie an 5 out of 10 and I am going to give the same to Mirrors 2.<br><br>This is a stand alone movie there is no connection to the first movie at all as they basically repeated the formula from the first movie but added different plot.<br><br>What l liked about this movie, is that it did have some really good creative kills in this movie , this movie is more Bloody/Gory then the first however it not as creepy as the first and its not scary at all.<br><br>The acting was not great at all but just Okay, they could done much,much,much better with the acting.<br><br>I will watch this movie again but i won't be buying the movie on DVD. it's worth a rental at least.","user":"atinder","rank":[16,30]}]