[{"title":"Fell for the trailer. Don't let the trailer rob you.","rating":1,"date":"29 December 2016","review":"Epic failure. The movie's premise had so much potential. I cringe just thinking how the end result turned out to be.<br><br>If you are looking for a comedy, this is not it. I didn't laugh once the entire movie. Poor performances, except for J.K Simmons, lame and generic screenplay. Jokes are not funny. This movie is trash. Please do not watch it. Wish I could give a zero, no option on this site though. Not exaggerating.<br><br>I have noticed a common trend in movies like this, Neighbors 2, Bad Moms, Horrible Bosses 2, Mike and David Need Wedding Dates, is that they rely heavily on dick jokes, overuse cringe comedy, awkward situations and characters, seriously who are the writers and directors, I want to throw tomatoes at them. Crap after crap after crap. This movie was the last straw. <br><br>Seriously guys, this is garbage. I regret watching this. Only good thing about this movie is J.K Simmons, everything else is trash.","user":"meterlongkingkongdong","rank":[26,30]},{"title":"Incredible supporting performances that deserved better.","rating":5,"date":"5 August 2017","review":"Okay, so here's the thing -- I watched this film over a week ago, and I'm still thinking about it. Why? Because I get riled up over films that are SO CLOSE to being good, but just... aren't.<br><br>The Late Bloomer definitely falls into this category. There are bits of dialogue and interactions between characters which are genuinely top-notch comedy, and the supporting cast put in one of the best ensemble performances I've seen in ages. Seriously. Kumail Nanjiani in particular is fantastic, and J.K. Simmons continues to be the best supporting actor in Hollywood right now.<br><br>Buuuuuut... there are six writing credits listed, and it's likely that therein lies the problem. The moments of brilliance are almost completely overshadowed by other bits of writing which are, at best, trite, and at worst completely cringe-worthy. The last twenty minutes or so of the film legitimately don't even make sense, and are among the worst I've seen all year. It really feels like something that was cobbled together from different people who had different ideas of what the film should be, and maybe some of those people were... incorrect.<br><br>So yeah, I wish this film was as good as it could have been. A lot of inspired performances and great dialogue that deserved better than what this ends up being.","user":"evendir-308-386664","rank":[11,12]},{"title":"Pollak good actor, not so good as a director","rating":2,"date":"9 June 2017","review":"I wanted to give it 1 star but decided that J.K. Simmon's appearance was worth another star - he does a fine job as the father. I also like Maria Bello but her character as the mother was just too strange to like (some kind of new age hippie, and a later scene with her boy was just creepy).<br><br>As another viewer said, I was expecting this kind of movie to be more like 'American Pie' - even something like 'The 40 Year Old Virgin' would have been nice, but Pollak seemed to get stranded between those and some stupid coming-of-age teenage flick. Based on the promising opening, I got fooled into watching the rest of this pedestrian comedy that really, really tried to get it up but at the end tried too 'hard' and just became a flaccid mess - pun intended. His friends were at the level of children and it was hard to believe a doctor would still be friends with such tools, much less let them have free access to his apartment. Here's a clue your friend is stupid: if all he ever talks about is his boner, then he's stupid. And I don't know about what kind of friends other guys have but I personally have never had any that openly talk about masturbating all the time - that's ridiculous. We certainly do it but we don't advertise it to everyone like a neon billboard at a stripper's joint! I think I snickered once or twice during the movie, and I was hoping for the last third of the movie to redeem the rest of it and I was sorely mistaken. I don't watch chick flicks and thought this was safely out of that category and I am sad to say it isn't. At least for chicks who are profane and enjoy stupid dick jokes.<br><br>Kevin Pollak - go back to acting, playing poker and doing that great Christopher Walken imitation because this movie was just an oddball, nothing really hung together (another pun). At least it didn't have 'coming' attractions, which was a plus (my final pun).<br><br>Skip it and spend the time doing something more enjoyable - like having sex. :-)","user":"romneymeredith","rank":[7,7]}]