[{"title":"Better than rated","rating":6,"date":"4 July 2013","review":"I thought this movie was a soldier war/action story based on the picture on Netflix. I ordered it Just out of curiosity because I wanted to see what Christian Slater was doing these days. I last liked him in True Romance but haven't seen him do anything, remotely as good, since. The Netflix promo cover picture http://DVD.netflix.com/Movie/Assassins- Run/70270735?trkid=5966279 must be for a different movie, altogether. The original title, White Swan, was more appropriate and Christian Slater has only a small role in the first quarter of the movie. Obviously, the promo materials, title and DVD release were designed to draw in action fans and try to get a bigger audience for this film which is more of a psychological suspense thriller mixed with some cool but unrealistic martial arts. The real star of the film is Sofya Skya, a slender actress with a beautiful face who plays a ballet dancer, Maya, who's life is turned upside down but the Russian mafia, which is out destroy her husband's fortune and find some bearer bonds worth half a billion dollars. Christian Slater overacts with little sincerity but he's out of the picture early. The last three quarters of the movie are much better than the first. If you get past the initial part without shutting it down, you are rewarded with a passable suspense, mystery, kidnapping, revenge, martial arts stew of a film that's worth a 6 rating, not the 4.2 average on IMDb. The assassin in the film, is creepily played by a mostly silent Russian actor and the ultimate villain is fairly obvious but the film just shuts down at the end, leaving the revenge to the imagination.","user":"alanjayd","rank":[14,18]},{"title":"One Bad-Ass Ballerina!!!","rating":8,"date":"10 November 2013","review":"Look out Jean-Claude Van Damme! Sofya Skya has appropriated your butt-splitting, body-whirling, high-kicking acrobatics for \"Assassins Run,\" an above-average, straight-to-video, white-knuckled crime thriller with Christian Slater cast as her wealthy husband. \"Soldiers-of-Fortune\" scribe Robert Crombie and \"Shadows in Paradise\" actress Sofya Skya share the helm on this exciting but improbable chick flick actioneer with enough suspense and surprises to make it a rewarding experience. Freshman scenarists Diana Cohen and Sergey Veremeenko penned their damsel-in-distress screenplay from a story by executive producer Mikhail Gutseriev. Obviously, these people have seen their share of Alfred Hitchcock movies because they employ the \"Psycho\" surprise of killing off their leading man in the first half-hour. Indeed, fans of the \"True Romance\" star should know this from the outset because they might not want to waste their time on the film. The practice of killing off celebrity actors has been done to death, but it really succeeds here because the heroine is a slim, trim, and supple ballerina who discovers that her businessman husband has rubbed out a group of ruthless Russian mobsters. Although these thugs have put Christian on ice, they still need the important documents that will legitimate their hostile take over. Naturally, these greedy dastards and the mystery man lurking in the background are determined to do whatever it takes. They try to tie up the loose threads by framing our hero's grieving widow on a narcotics possession charges and abducting their cute little daughter. <br><br>After the murderous gangsters knock off billionaire businessman Michael Mason (Christian Slater) at a remote railway crossing, they turn up the heat on his pretty wife, prima ballerina Maya Letiniskaya (Sofya Skya), who dances the Swan Lake. A rival dancer, Ballerina Olga (Svetlana Tsvichenko of \"Lost in Siberia\") persuades Maya to give her a ride to visit a sick relative. Olga uses the opportunity to distract our heroine so she can plant a baggie of cocaine in Maya's dressing room. After our heroine drops off Olga, the police pull Maya over, and she winds up in prison. Eventually, Maya will give Olga her just comeuppance with a little surprise in her slippers when stands on her toes! People who like women-behind-bars exploitation thrillers will enjoy our heroine's brief stint in the penitentiary. Maya hides a ring that Michael gave her, but one of her evil cell-mates spots her admiring it. During their exercise time outside, this inmate insists that Maya cough up her jewelry. When Maya refuses, the inmate starts kicking the crap out of her. Surprisingly, Maya musters the gumption to fight back and deploys her skills as a ballerina to smash her opponent into submission. A prison official intervenes and the fat, sloppy, female guards confiscate the bauble. Later, Maya's angry cell-mates exact revenge on her later. They slash her wrist and leave the knife behind so it will appear for all practical purposes that our heroine committing suicide. Fortunately, a prison official discovers Maya in time to pack her off in an ambulance with a trio of slimy medical technicians. When it appears that Maya is flat-lining, these technicians wield the paddles on her to restore life to \"the whore\" as they call her. One of the technicians cannot take his eyes off Maya breasts and decides to rape her. Maya surprises them and manages to escape. Later, with the help of one of Michael's associates, Roman (Cole Hauser of \"Pitch Black\"), our heroine is able to fly out of the country with the documents intact, but not before she kicks the crap out of two beefy Russian thugs. In America, she is promptly captured and interrogated by Sheriff Nash. The filmmakers exploit this extended interview session as an excuse to pace the story piecemeal so as to heighten the suspense. <br><br>Mind you, I doubt that Maya could deliver enough momentum to knock down the over-sized gorillas that chase her into the bathroom at an airport, but it makes for an exciting sequence. Sure, Cohen and Veremeeko rely on predictable, time-honored, melodramatic tropes to pump up the action, but \"Assassins Run\" will keep you entertained throughout its 90 minutes, even if you suspect you know where it is taking you. Angus MacFadyen makes a cameo that is largely a waste of time. He qualifies as the proverbial red herring, and Cole Hauser cements his persona as a villainous turncoat. The idea of a ballerina kicking the living daylights out of her adversaries on more than one occasion is enough to make this movie worth watching more than once. If this idea has been used before, I'd love to know the title of the movie that I missed that contains such ballerina fu.","user":"zardoz-13","rank":[10,15]},{"title":"A movie with potential to be good but ended up a little cheesy and a lot generic. Be ready for ballet fighting. I say C.","rating":15,"date":"15 April 2013","review":"\"How did two American's wind up in the Russian oil business?\" Maya (Skya) is a Russian ballerina living with her wealthy husband and daughter. Her husband Michael (Slater) is working with a Russian oil firm when suddenly millions of dollars goes missing. The mafia decides to take matters into their own hands and goes after Michael and frames Maya. All she has on her mind is revenge, and the safety of her child. I first off have to say this was nothing like I expected at all. That said this movie has been done a hundred times...most recently called Colombiana. I have no problem with a strong female action hero, I think that is refreshing...but the only reason I think they introduced the ballet aspect is so when she starts to fight it seems legit. Before you question that line...yes, she uses ballet moves to fight. Lots of spinning and high leg kicks to take down her assailants, when that started I started to lose interest and by the end I was just waiting for it to end. This movie could have been so much better but ended up just a little too cheesy and generic for me. Overall, a movie with potential but fell short. I give it a C.","user":"cosmo_tiger","rank":[13,25]}]