[{"title":"Deep & Simple","rating":10,"date":"4 March 2012","review":"Benjamin Wagner briefly met Fred Rogers not long before his death and picked up a simple pearl of wisdom from him: \"deep and simple is better than shallow and complex.\" He was so moved by the idea that, with his brother Chris' help, he decided to spread the word by making this simple, sweet film. This is not a biopic. You learn about Mr. Roger's life, but by interviewing people who knew him and worked with him, instead, what the Wagners have managed to do is to bring to life his ideas. This movie will make you try harder to be a better person, to understand the value of living in the moment, and of silence, and to live up the ideals of that man in the red cardigan. Find it!","user":"info-308-10559","rank":[8,9]},{"title":"Yes, Mister Rogers really was your neighbor.","rating":10,"date":"19 August 2012","review":"Was Mister Rogers REALLY like that? You know, sweet, patient, and kind? Did he REALLY like you just the way you are? Apparently the answer is yes. He was. And he cared enough to hope that we would realize the people in our lives that we could be grateful for. There aren't very many real saints among us--people who are living, walking examples of the very best of humanity. Mister Rogers was one. This is a touching tribute to Mister Rogers, told by people to whom Fred Rogers was literally a neighbor. I hope that when I reach the end of my life, people can say I was even a fraction of the good person that Fred Rogers was. This movie is an inspiration. A delight. A warm place in my heart. Thank you MTV Vice President Benjamin Wagner (one of the lucky neighbors!) for making it.","user":"kmaver","rank":[3,3]},{"title":"Glad man in a mad world","rating":9,"date":"27 April 2012","review":"I was blessed to have been born during the mid-nineties so that I could still enjoy classic programming. I look at Television now and my heart sort of drops; is this the kind of programming our nation is interested in? \"Reality\" Television, bland children's shows, and ridiculous reruns of a tired Nickelodeon show plague the lineups so that not a shred of ingenuity or authenticity can be found. This is a depressing use of an innovative medium.<br><br>Whenever I think of a Television character who was sweet, iconic, and beyond compassionate and earnest, it's easily Fred Rogers. My fear is that some children will not recognize the name, or the simple lyrics to his opening and closing songs during his program. When PBS decided to stop syndicating Rogers' show, Mister Rogers' Neighborhood, in 2008, I wrote them a letter saying that the decision was absurd and detrimental to current generations. With the barrage of media outlets filling our heads with fear and the constant cynicism in society, shows like Mister Rogers' Neighborhood need to be syndicated, not abandoned.<br><br>Mister Rogers and Me is barely an hour long documentary, chronicling one man's interactions with the icon himself. Benjamin Wagner was a typical Midwesterner, who upon graduating college, moved to Nantucket Island where he discovered that his neighbor was none other than TV personality Fred Rogers. With all the \"neighbor\" talk on Rogers' program, it must've been surreal and heartwarming to find America's most insightful character living next door. Wagner was in his thirties when he moved next door to the man, but that had little effect on the overall experience.<br><br>Wagner, a creative writing and journalism major, now an MTV executive, decided to travel around and find some of Rogers' close friends to discuss what they personally thought of the cardigan-wearing man. Wagner's story is a simple one; he was involved with many hopeful, insightful, and human conversations with the man. They sat and drank lemonade, talking about hefty issues they both endured when they were young. Rogers said when he was young, he was teased and picked on for being overweight. It is explained numerous times by Rogers and several colleagues that he stated the worst thing one human could do to another is demean them. Rogers stood by that statement all his life, and it was almost his direct motivation for entering the Television scene.<br><br>Mister Rogers' Neighborhood had over one-hundred episodes and aired for decades on the PBS station. The question some find puzzling is why the show endured so much success and has bared such an incorruptible legacy. It's easy; the show was about values. It had moral simplicity and pure authenticity to it, and its protagonist was never condescending, pretentious, or cartoony. He was gentle and kind, speaking as if you were sitting across from him in his home, or his actual neighborhood.<br><br>That is the main thing the show had that many others didn't. You weren't being sold anything. Rogers never did a commercial endorsement in his life, although if he did, whatever he was selling would probably sell in mass amounts. I wonder if the offers he did get were hard to turn down. Many celebrities, and a lot of common people, value money over ethics, wealth over morals, and impulse over contemplation. Rogers stuck to ethics and values. When you turned on Mister Rogers' Neighborhood, you weren't a customer, a viewer, or the victim of a corporation's vicious playing tactics; you were a neighbor, a friend, and a person. During the Gulf War and even the Iraq War, Rogers obligated our parents to take care of us and told us that we would without a doubt be safe. How many personalities would take the time do assure us something so grand? The documentary is just wonderful. Interviews with author Bo Lozoff, close friend Amy Hollingsworth, and the late media-man Tim Russert of Meet the Press are all conducted, and all seem to have a genuine understanding of the man himself. Even an interview with Marc Brown, the author of the children's books Arthur is shown, where Brown states that the medium of Television is miraculous, but it is sadly abused. I couldn't agree more.<br><br>National Public Radio correspondent Susan Stamberg states that it's a shame Rogers died because, she believes, we need values now more than ever. Hollingsworth even states that Rogers told us what we never heard. He liked us for who we were. Often we are browbeaten for our differences, unfair advantages, and appearance. Never are we told we are perfect just the way we are. Rogers told us that numerous times.<br><br>Mister Rogers and Me revolves around the central moral of keeping things \"deep and simple\" rather than \"shallow and complex,\" a phrase Rogers himself often stated. The film, at a mere sixty-eight minutes without credits, definitely stays true to that idea and never becomes bogged down by dry sequences, false sentimentality, or even corny, unnecessary elements. Just like the show itself, it remains wholesome in a sea of potential cynicism.<br><br>Starring: Benjamin Wagner, Fred Rogers, Bo Lozoff, Amy Hollingsworth, Tim Russert, Marc Brown, and Susan Stamberg. Directed by: Benjamin Wagner.","user":"StevePulaski","rank":[3,4]}]