[{"title":"What a great film!","rating":10,"date":"10 September 2011","review":"Congrat's Charlie Smith, you've done it again. Congrat's Andrew Kosove and Broderick Johnson...and Bob Engelman. I've been a part of a lot of films in our industry, as an actress, a choreographer, a director...and there are only a handful of great films you can point too, that you can watch over and over and over, and it never gets old. Dolphin Tale will be added to that list. From Morgan Freeman to Ashley Judd, all of the actors were phenomenal. The child actor Nathan Gamble pours his little heart into this one, and will become the new it young actor. Harry Connick Jr. is the dad of all dads, and the young actress Cozi Zuehlsdorff will will eventually become a wonderful little actress if she stays away from troublemakers in the industry. There were also a lot of successful actors in the supporting cast that helped make this film one for the ages. like, Frances Sternhagen, Kris Kristofferson, Ray McKinnon, Jim Fitzpatrick, Marc Macauly and Richard Libertini. And last but not least Winter. If you love animals and/or Dolphins..you too will love Dolphin Tale!","user":"septhdr-156-627329","rank":[360,390]},{"title":"A perfect family movie!","rating":24,"date":"24 September 2011","review":"This is the first review I have written, but I feel obligated as this movie was so perfect for its genre. I'm not saying it is an academy award winner, but as far as inspirational, age appropriate and inspiring family movies go, if simply won't get much better than this.<br><br>Let me start by saying that I have a child with a physical disability, and during his second surgery, his school class gave him a book about Winter. This was way before the movie, and I had never heard of Winter. My son (age 5), who loves fish and sea life, was instantly taken with the idea of a dolphin that was special like he was. We read the book many times, and even at the hospital we promised that someday he would get to meet Winter.<br><br>About six months after his surgery, we traveled to Clearwater from our home on the opposite Florida Coast (4 hour drive). When we arrived we found the aquarium there very sparse and not all that impressive. That said, they were majorly renovating due to the money that they were paid to make this movie even though it still wasn't out yet. That said, Winter was well worth the trip. She is every bit as inspirational and real as what you see in the movie. I'm only bringing this up to focus on my movie review. This is for anyone that thought the movie was over the top sappy or cheesy. I'm sorry, but that part is true and to not make it look that way would be virtually impossible. Winter gives hope to people with special needs. My son even made her a card and got to hold her special tail.<br><br>The other features of the movie like the boy finding her and probably many other aspects are creative license. She was actually found by a boat on the East coast of Florida. But, I don't think that really matters. When we went there, even with no movie, and met Winter we knew that she was a movie star.<br><br>The movie itself was well produced, well-acted (Morgan Freeman was very good), and took on difficult themes subtly for young children. I guess the best comparison to this would be Free Willy, however that story was pure fantasy and simply not as good of a movie, in any way, to Dolphin Tale.<br><br>I highly recommend this movie for any family, especially anyone with a disability. And as far as the barely believable and possibly sappy plot, sometime real life is like that and that is a good thing!","user":"dan-169-25741","rank":[81,88]},{"title":"An Inspiration to us all","rating":10,"date":"10 September 2011","review":"Inspirational films are often difficult to review. The movie is inspirational for a reason; therefore, it's usually telling a story of someone making the best out of a bad situation. The problem is that no one wants to be the person to say the movie isn't worth watching. Thankfully, Dolphin Tale isn't one of those movies. Dolphin Tale tells the true story of Winter, a dolphin who due to a very unfortunate accident loses her tail and the group of people who help her to survive despite her handicap. <br><br>Director Charles Martin Smith, best known for his roles in The Untouchables and Never Cry Wolf, takes a heartfelt story and presents it just as is. The movie's lead is a young actor named Nathan Gamble, who plays Sawyer Nelson. . Gamble is surrounded by high level talent, which you usually don't find in movies of this type; Ashley Judd, plays Lorraine Nelson, Sawyer's mom; Morgan Freeman, working alongside of Judd for the third time, plays Dr. McCarthy, a VA doctor tasked with trying to create a working prosthetic to replace Winter's tail; and Harry Connick Jr. is doctor Clay Haskett, who runs the Clearwater Marine Aquarium and along with his team is mostly responsible for saving Winter's life. Judd provides an endearing charm as Lorraine, and her enthusiasm shines through. There couldn't have been anyone better to play Dr. McCarthy than the great Morgan Freeman. Freeman gives credence to Dr. McCarthy and, thanks to him not being in the right frame of mind, his dedication to creating a new tail for Winter. The charismatic Harry Connick Jr. gives a stellar performance, providing Sawyer with a role model. Cozi Zuehlsdorf makes her acting debut as Hazel Haskett, Sawyer's best friend. Along with Sawyer, the two of them work together to make some magical happen. Zuehlsdorf's shining personality and adorable smile, along with her chattiness, reminded me of what makes my own daughter so special. Not to be overlooked or forgotten, Winter the Dolphin plays herself and is a wonder to watch. <br><br>Dolphin Tale teaches and inspires in so many ways. It teaches us to not judge anyone that may be different; it teaches us that family is forever; it inspires us to be role models; it inspires single parents to keep up the great work; and most importantly it inspires those that have set back to never give up. Winter's story is an incredible miracle. As I sat between my son, who's almost 8, and my daughter who is 5, I couldn't help but well up with tears at the determination of these extraordinary people as they all went above and beyond in the hopes of saving a fish; yes, I know that dolphins are mammals and are not really fish. At the end of the movie, I asked my kids how they liked it and they both said that they loved it. They then asked me how I liked it, and my response to them was \"I think that may have been my favorite movie so far this summer.\" I no longer have to think about it, it IS my favorite movie so far this year.<br><br>Grade: A+<br><br>Be sure to check out Winter at www.seewinter.com; and then check out our website at www.twodudereview.com","user":"facebook-124-955845","rank":[101,114]}]