[{"title":"Despite claims to the contrary, a necessary re-interpretation of the story","rating":8,"date":"27 December 2011","review":"After the announcement that The Girl with the Dragon Tattoo was getting an English-language film treatment, I decided that the hype had built up to a point where I just had to read the source material for myself. Though it is not without flaws, Dragon Tattoo is an excellent story with the important mission of raising awareness concerning violence against women. Mere days after finishing the book I watched the Swedish film. The hype train had me excited for an outstanding thriller. <br><br>The hype train let me down.<br><br>I was left cold and somewhat irritated by the Swedish adaptation. A ton of important plot elements were left out, some were inexplicably added (Blomkvist's memories of the island became far too important and contrived), and Rapace felt all wrong as Lisbeth. She was brilliant and violent, but lacked the quiet pensiveness of the original character. She did not come off as autistic and emotionally disturbed, just bratty and rude. Worst of all, I was constantly confused by the extremely rushed, strange new take on the story. <br><br>As a lover of foreign films, I normally grind my teeth when I hear that America is developing a remake. However, I found myself desperate for this one. I needed a movie that actually gave me the experience of reading the book for the first time, that made me care for Lisbeth and that truly disturbed me. Thankfully, the American adaptation (not a remake) delivered exactly what I was looking for. Those who say this version is unnecessary or a rehash must have seen a very different Swedish Girl with the Dragon Tattoo than I saw. The American take is jam-packed with scenes that were either skimmed or completely left out of the Swedish version. Yet, despite being more robust, the English- language Dragon Tattoo is incredibly paced, feeling less rushed yet hitting all the important plot points. The characters have time to develop and grow on you, the clue-finding makes more sense, and the killer is more horrifying. Screenwriter Zaillian knows exactly what to leave out and what to change (though the ending, which mirrors the book's ending, could have been arranged better). Craig, Mara, and even Plummer are spot-on in their roles and feel more fleshed-out as characters. Mara, in particular, inhabits Larsson's Lisbeth in a way Rapace did not. She captures Lisbeth's silent, borderline-autistic nature perfectly. Her fragile body and alien appearance even match the book's description. She allows herself to be vulnerable, but clearly regrets it over time. It's a captivating performance.<br><br>If someone were to ask me, personally, which version to see, I would have to say without hesitation that this is the rare occasion where the American adaptation is superior. I did not think it was possible to stay so true to the story under three hours.","user":"jlars777","rank":[495,687]},{"title":"Quick Comparison of both versions - both excellent in their own right","rating":22,"date":"22 December 2011","review":"Here is a rundown of the differences in the two movies:<br><br>-MIKAEL BLOMKVIST-<br><br>American - Blomkvist is played as more of a tough guy and not a good guy. His flaws are laid bare and he shows himself to be much more detached than emotional.<br><br>Swedish - This is the \"good guy\" side of Mikael. He is sensitive, caring, and smart. He shows a protective side when it comes to Lisbeth. Physically speaking the Swedish Blomkvist doesn't look as sturdy as his American counterpart. He has a gut and appears to be quite a bit older than Lisbeth which can make the relationship between them more shudder inducing and probably accounts for why there are fewer sex scenes between them in the Swedish version. <br><br>-LISBETH SALANDER-<br><br>American - Perhaps because Blomkvist was made into such a strong character Lisbeth was then morphed into a more withdrawn and vulnerable girl so as to complement the new Blomkvist. She still has attitude, aggression, and rage but she also exhibits a quiet shy side that was not in the original as well as more of a romantic side.<br><br>Swedish - In this version Lisbeth is not shy, not gentle, and not nice. She doesn't chase Blomkvist - he chases her. She perfectly embodies everything you think of when you think of a strong female lead and has an unpredictability and edge to her that is exciting to watch. Her dragon tattoo is much, much better.<br><br>-OVERALL- <br><br>I liked the American Mikael and the Swedish Lisbeth. <br><br>While I may prefer a scene or two from the Swedish version, such as the ending, overall I enjoyed the American version more. <br><br>On the flip side, I can understand why some may hate this version because Lisbeth was their favorite character and she's been changed into something they don't like. For me, the modifications to Lisbeth's character weren't severe enough to put me off.<br><br>The Swedish version captured a cult following for a reason and I would recommend both to anyone who has an interest in darker gritty movies that have a raw intensity to them. The Girl with the Dragon Tattoo isn't for the faint of heart and that's what I love about it!","user":"hyprsleepy","rank":[218,320]},{"title":"The Girl With The Dragon Tattoo: Another Winner From David Fincher!","rating":10,"date":"22 December 2011","review":"The lights dim, the movie begins with a brief prologue, and the zany and incredibly weird opening credits begin, set to a creepy cover of Led Zeppelin's \"Immigrant Song.\" From the beginning, we are in for a wild ride as Stieg Larsson's incredibly popular novel \"The Girl with the Dragon Tattoo\" is brought to life on screen.<br><br>Scorned journalist Mikael Blomkvist is called upon by Henrik Vanger, a very wealthy man, while writing a book. Vanger is in search of an answer to the disappearance of his niece, Harriet, which occurred over 40 years ago. He assumes that Harriet is dead, and that she was murdered. He looks to Mikael to investigate her disappearance and who killed her. Then Mikael gets assistance from Lisbeth Salander, a dangerous but intelligent 24 year-old punk who is an accomplished computer hacker and a great contribution to the solving of other crimes. Together, Mikael and Lisbeth go on a dark, eerie journey into a world of crime, Nazism, and corruption that will lead them to Harriet's assassin.<br><br>I walked into \"The Girl with the Dragon Tattoo\" with almost no knowledge of Larsson's novel or the Swedish film made a few years before David Fincher's version. The end result is ultimately an extremely satisfying, brutal, and complex thriller thanks to great direction by Fincher (known greatly for his work on \"Seven,\" \"The Game,\" and \"The Social Network\"), excellent writing, and an impeccably chosen cast.<br><br>After only a few years, the character of Lisbeth Salander has become an attention-grabbing heroine that is as iconic as Edward Cullen of the love-it-or-hate-it \"Twilight\" series. And we can understand why. After all the truly awful and hideous things that have plagued her life, Lisbeth doesn't take any crap from anybody. She may be angry, violent, overtly sexual, demanding, and perhaps a little crazy, but she is a genius at what she does, and has reasons for all of her actions, no matter how gruesome they may be.<br><br>The mystery surrounding the film is sophisticated and white-knuckling, adding to the intensity and mood of the story and its characters. We're not sure of who is Harriet's killer, or if Harriet is even dead, until the last half hour of the film, and when we do find out the twist, it leaves a stupendous impact.<br><br>After cementing his reputation in brutal crime thrillers, and surprising us with \"The Curious Case of Benjamin Button\" and \"The Social Network,\" David Fincher was the right man for the director's chair. Every film he makes, even a drama like \"The Social Network,\" sets up a tone of genuine suspense, tension, and fear for the characters. \"The Girl with the Dragon Tattoo\" isn't any different as Fincher adds his signature touch to the movie.<br><br>Of all of the people they could have chosen to play these roles, the casting director landed in a pot of gold. Daniel Craig does a wonderful job as Mikael, showing us that he can play characters other than James Bond. With the amount of screen time she has, Robin Wright is also very good as Blomkvist's business partner Erika Berger. Christopher Plummer and Stellan Skarsgård also turn in great performances as Henrik Vanger and Martin Vanger.<br><br>The person to really watch out for, however, is Rooney Mara as Lisbeth Salander. Getting her big break in the underrated remake of \"A Nightmare on Elm Street\" and later starring in Fincher's previous film \"The Social Network\" (giving a dynamite performance in the opening scene), Mara has sealed her future with many more promising and exciting roles because of her portrayal of Lisbeth. This is not an easy role to play, knowing that Mara is the second person to play the character. She must endure two shocking rape scenes and a torture sequence, and there is a hefty amount of nudity involved. Mara embodies Lisbeth, immediately bringing immense intimidation, danger, and fury every time she comes on to the screen. Her eyes are wide and emotionless, almost as if you can see right through her. And with everything that has happened to the character, we understand that Lisbeth has a right to be that way. She may be smart, but she is not interested in attraction or friendships with another human being. Overall, Mara gives a sensational, fearless, dedicated, and electrifying performance that guarantees an Oscar nod.<br><br>Being released during the cheery time of the holidays, \"The Girl with the Dragon Tattoo\" is not a feel-good film, by any means. It is a harsh, gritty, and rough cinema trip that answers the question of leaving the kids at home with the babysitter. Also, if you're squeamish, you will not like it. However, those who have read the book, and those who have not read it, should check it out. Even without having read Larsson's novel, I left the theater completely satisfied. It is a movie experience that you don't commonly get. Fincher has done it again. \"The Girl with the Dragon Tattoo\" is a must!","user":"eytand94","rank":[300,448]}]