[{"title":"Sober entertainment","rating":7,"date":"19 September 2012","review":"You have to love a movie that plays with stereotypes and uses them for the plot. Of course you could call this twist in the plot convenient, but that would take the fun out of it. Plus it does really feel genuine in the movie. Even the romantic aspect of it does work (which is even crazier than the story of the movie itself).<br><br>The movie is called Grabbers for a reason. And the reason will be revealed pretty early on. Of course the twist that I mention will take some time until it is discovered by the characters, but most people who watched it did realize it much earlier (could be that it was in the description of the movie, since I haven't read it, I couldn't tell you though). A really fun light little comedy, that is worth your time","user":"kosmasp","rank":[48,54]},{"title":"Well balanced - Drink it up","rating":8,"date":"4 April 2014","review":"I watched this movie expecting it to be a comedy. It is, but to a lesser extent than I was led to believe. Don't get me wrong, it has its share of humor, but if you take out the comedic elements, the film really stands up as a good low budget creature feature. Pleasantly surprising! <br><br>A simple script, no Oscar winning performances or intense dialog, but no over baked hams here either - except maybe in one or two spots where it's done intentionally for humor. The male and female leads were exceptional and they played their roles just right. They were endearing. The assortment of characters making up the island folk were spot on and I wanted to pop on down to the pub and buy them a round or two.<br><br>Although Grabbers borrows elements from a number of classic films in the genre, it never seems tired or cliché. I think that's due to it's understated nature and the originality it does have. Anything familiar is presented with respect and with it's own style.<br><br>A big nod to the writer and director on this one. Getting the balance this finely turned between comedy and horror isn't easy. American Werewolf in London had that, but not many others. I don't quite think this compares with that classic, but it's got that certain 'something' that will grab you. <br><br>Low budget is where you'll find the gems in this genre and Grabbers is top notch. A perfectly balanced, thoroughly enjoyable movie. If you like the genre, don't miss it.","user":"vipcorp-954-708527","rank":[25,28]},{"title":"Comedy and Horror Conspire on a Small Irish Island","rating":8,"date":"4 August 2012","review":"Workaholic Garda officer Lisa Nolan (Ruth Bradley) takes a 2-week assignment on the small island of Erin while the town's sergeant is on vacation; she immediately runs across (and afoul of) fellow Garda Ciaran O'Shea (Richard Coyle), who both starts and ends his days with booze, a lot of it. Your typical drunken Irish cop, in fact. They are not destined to get along, but when bloodsucking aliens crash-land in the nearby ocean and start devouring the townspeople, Lisa and Ciaran have to work together to save the community. Teaming up with the English scientist, Dr. Adam Smith (Russell Tovey), and with Paddy Barrett (Lalor Roddy), one of the more sloshed senior citizens of the island, they make the stunning discovery that human blood, steeped in alcohol, is toxic to the bloodsucking creatures. A big storm is coming, and the Coast Guard can't come to the rescue; instead, it's up to our intrepid heroes to convince all the townsfolk that getting, and remaining, drunk for the whole night is a matter of life and death - literally.<br><br>One might bristle at the stereotype of the drunken Irishman (and woman), but when it's the Irish telling the stories on themselves, it's another matter altogether. This is a very funny movie, and even the bloodsucking creatures grabbing people and devouring them isn't gross, it's just kinda yucky. There were a few times when I jumped at an unexpected occurrence, which is always good in a monster movie, but there were a lot of times when I was laughing a lot too. Not to mention cheering from time to time....The leads are all terrific; I only know Tovey's work (from the excellent UK television series, \"Being Human\"), but I would make a point of looking out for more of Richard Coyle and Ruth Bradley, both of whom I liked a lot. My one quibble is that sometimes it was hard to understand what a character was saying, especially once they were all drunk as lords and slurring their words all over the place, but that's quite minor really, as the gist of the dialogue always came through. Definitely worth seeing, especially with a FantAsia crowd in Montreal!","user":"alisonc-1","rank":[55,67]}]