[{"title":"Waiting for Superman is simplistic and one-sided","rating":6,"date":"31 October 2010","review":"Waiting for Superman makes teachers the scapegoats for our ongoing educational problems in the U.S. To the lay person, the film is appealing, and seemingly makes a good case that poor teachers are the main reason why so many children are failing. It shows statistics that allegedly illustrate how far behind we are from the rest of the world in education. Again, to the uninformed viewer, it all seems credible. However, as an inner city teacher for 20 years, I can tell you that we are not falling behind most other countries as they would like us to believe. You can't compare Finland, a country of 5 million people, to the U.S. Countries similar to ours are experiencing the same problems we are due to the increasing divorce rate, single parent households, and the lack of respect for teachers and educational institutions. The test scores from other countries, particularly Asian countries, are skewed since they are used as tracking for academic and social class for life. Hence, they go to after school \"cramming classes\". There is no evidence that they actually learn the material better in the long run, however. For a detailed explanation, please read Tamin Ansary's article \"The Myth of America's Failing Schools.\" <br><br>The biggest problem I have with the movie is that it is one-sided. It focuses on the unions allowing poor teachers to continue because of tenure, which I agree is wrong and must be rectified immediately. However, the film gives the viewer the impression that the majority of teachers, particularly in the inner-city are \"poor\" and are only there to collect a paycheck. Nothing could be further from the truth. In my experience, I estimate that there are 5-10% \"poor\" teachers on the average in any school, just as there are in any profession. The vast majority (90%) in most schools are dedicated and diligent professionals who do the very best they can with the circumstances they have. Poor teachers are only a very small part of the problem.<br><br>Waiting for Superman neglected two important factors that dramatically affect the success of schools and its students: parental involvement and student discipline within the school system. The parents shown in this movie were NOT the typical inner city parents. They were educated, lived in nice, clean, and well maintained apartments, and did homework with their children each night. If all parents were like them, there would be no \"failing schools\" discussion; this movie would never have been made. These parents were model parents -- definitely the exception and not the rule in the inner-city. Another issue ignored completely is the student discipline. Most inner -city teachers spend much more time on disciplining a few students every day than teaching the rest of the class. Only schools with strong principals and an effective system of discipline in place have a chance at any success in the inner-city. The very best schools remove habitually disruptive students sooner and place them in alternative schools. As long as there are 2-3 habitually disruptive students in a classroom, the time on task will never be that of suburban schools or any successful school. The KIPP school cited in the movie didn't simply just \"extend the day\" as some assume, they REQUIRED parental support and participation, much like Catholic schools do. The successful charter schools do the same. They cannot be compared to the inner-city schools that have to deal with habitually disruptive students and parents who refuse to provide the basics for their child -- clean clothes, a trip to the public library, a place at home to do their homework, limiting television and computer time, etc.. <br><br>Incidentally, only the very best parents in the inner city would call the classroom teacher to REQUEST a parent-teacher conference, as shown in this documentary. I found that comical since in my 20 years of teaching not ONE parent has ever REQUESTED a parent conference. It's the other way around -- we have to try to track down parents, go to their homes, and beg them to come to conferences! The parents in this film were proactive in their child's education -- definitely not the norm in the inner city.<br><br>Even the very best teacher in the country cannot successfully teach all of his/her students without adequate parental support. Case in point: Jaime Escalante, the inspiration for the movie \"Stand and Deliver\" (1988), was very successful at teaching inner city students calculus. He did, however, have wonderful parental support. When he moved to Sacramento several years later and taught at risk kids there, he had no such success. Why? He stated that the kids and parents didn't care as much as his kids in East Los Angeles.<br><br>Education does NOT occur in a vacuum. The schools, teachers and parents must all work together. Any administrator who simply adopts the defeatist approach and states \"parents can't be fixed\" and refuses to make them accountable will never have a successful school. And remember this: A bad teacher only lasts 9 months, but a bad parent lasts a lifetime!","user":"inmatom","rank":[77,100]},{"title":"Our System is Broken","rating":7,"date":"3 October 2010","review":"Greetings again from the darkness. The system is broken. I am neither a teacher, Union official or politician ... simply a U.S. citizen who sees a real problem with a public education system that seems to adequately serve very few.<br><br>After viewing Davis Guggenheim's documentary, I find it fascinating to read some of the comments made. To my eye, the film does not blame any one group for the problems - though lousy teachers and a misguided union do take some serious criticism. Shouldn't they? The film makes the point that excellent teachers and principals can definitely make a difference. The specific subject families show caring, involved parents and eager to learn children. Of course, not every family or child fits this definition. But shouldn't the system work for the engaged parents and students? <br><br>There is no shortage of blame in this game - politicians, unions, teachers, administrators, parents and rowdy kids. Regardless of the situation, it's clear that the overall system is flawed, especially in lower income areas. Do neighborhoods drag the school down or is it vice versa? To me, it doesn't matter. The system should reward the teachers, parents and children who do want to teach and learn.<br><br>Regardless of your politics or personal involvement in education, I commend Mr. Guggenheim (\"An Inconvenient Truth\") and Mr. Gates and Ms. Rhee for rocking the boat ... for getting the questions asked in a public forum. This movie should inspire much debate and discussion - typically the beginning of real improvement and change. Let's hope this is the needed start to finding a better system.","user":"ferguson-6","rank":[46,65]},{"title":"Super","rating":9,"date":"6 October 2010","review":"I may not be a teacher, but both my parents were, and I grew up going to public school and got many views of the educational system as a whole. I'm really surprised to see that some teachers went to this and were actually offended by what it offered.<br><br>This movie did not set out to blame the issues of this country's education on the teachers. It depicts the issues with the SYSTEM. It's a system that protects the teachers' needs over the students in some cases. We all are aware that teachers don't get paid very well, but there are many upsides to a career as a teacher, and some go into this field because they are gifted, but just as many aren't.<br><br>What this film attempted to say (in my opinion, successfully) is that we must put the child's needs above all. The system is BROKEN, and that's all the director wanted to say. Through the establishment of the abuses of the unions, the communication of the compelling stats, and the following of just a few examples of a larger populace of suffering students and their families, the director did a BEAUTIFUL job of bringing issues to the surface.<br><br>Teachers who are talented, work very hard, and are committed to pushing students and not cruising through should not take offense to this film. However, there are plenty of teachers out there who should find this film threatening, just as many departments of education should, because on the whole, American schools are failing, and we have a lot of work to do.<br><br>Because there are educators who are threatened by the message of this film, I say that is what makes it a success. What effective documentary doesn't shake up the system and strike fear in those whose system it threatens? I'm ready for more!!!","user":"karmajustice","rank":[63,92]}]