[{"title":"It's bold but brilliant cinema...","rating":9,"date":"11 October 2012","review":"The Seasoning House is a raw, powerful and, frankly, brilliant film. I recommend it, but it's not a date movie.<br><br>Hyett has clearly learnt a lot from his time on other film sets. The Seasoning House is a carefully crafted and controlled film which, at times, almost goes too far, but somehow manages to pull itself back from the brink. The direction is excellent, with Hyett infusing the first two acts with a slow, dreamlike, almost ethereal, feel that may reflect either Angel's resignation to the life that she now tolerates or the state of perpetual drug-based anaesthesia that the girls are constantly under.<br><br>Rosie Day is an absolute revelation. She is incredible as Angel and, although she doesn't utter a single word, her face tells us everything and we are never lost as to what Angel is feeling. It's notable that this is also Day's feature film debut. As such, and based on her performance here, I would expect to see a lot more of her in the future<br><br>The rest of the cast do a superb job. Willem Dafoe-alike Kevin Howarth is outstanding and tackles the role of Viktor with real conviction and we are torn between hating him (deservedly so) and as the film goes on, rooting for him. Sean Pertwee, as militia leader Goran, has never been more menacing, while Dominique Provost-Chalkley gives a brave performance as Vanya, especially considering all that the role entails.<br><br>It's bold cinema, make no mistake, and not a film to be taken lightly. Hyett's film is an uncompromising, unflinching and brutal glimpse into a real-life world of suffering that we, living out our comfortable little lives, simply cannot fathom and subsequently ignore. Hyett should be commended on making this film as honestly as this one. It's a film that sticks with you long after the credits have stopped rolling.","user":"david-elliot1981-2","rank":[60,78]},{"title":"The Pigs Have It.","rating":9,"date":"4 October 2014","review":"The Seasoning House of the title is a Balkans Brothel, it's 1996 and young girls are being kidnapped during military attacks and sold to the owner of the Seasoning House. One such girl is Angel, a death and mute sufferer who the house owner takes a shine to and uses her as his assistant. When Angel strikes up a friendship with one of the girls, it is the catalyst for violence unbound.<br><br>A thoroughly bleak and distressing viewing experience, but in turn it's also bold and brilliant film making. Debut director Paul Hyett paints a grim portrait of an all too real problem in certain parts of the world, but thankfully he never once lets the material slip into exploitation territory.<br><br>The brothel is unsurprisingly an utterly desperate place, rife with squalor and abject misery. The windows are boarded up with crooked pieces of wood, the beds are filthy, the walls stained with years of dirty grime and the after effects of vile human actions. The girls are battered and bruised, chained to the beds and injected with drugs to make them compliant towards anything the human monsters so wish to do to them.<br><br>For practically 70 minutes we the viewers are holed up in this awful place along with the girls. Daylight is only briefly glimpsed through the window shards, we can smell the fear along with the dankness, and claustrophobia is rife. Angel (a brilliant Rosie Day) is our conduit as Hyett builds relationships between her and the two other main characters. Viktor (Kevin Howarth) the ruler of this vile kingdom, and inmate Vanya (Dominique Provost-Chalkley), the latter of which is deeply touching and superbly crafted by those involved.<br><br>Film then switches in tone after some truly awful scenes have paved the way for what transpires in the final third of the story. This switch to more conventional horror cinema has proved divisive, but the way Angel moves about the house, how she finds fortitude, is fascinating, and she has well and truly earned our utmost support as she seeks to erase some dastardly evil wrongs from history (headed by a suitably scary Sean Pertwee). This is not a cheap rape revenger movie, it's a survivalist horror, and some of the horrors inherent in The Seasoning House are tough to stomach, but necessary to balance the art and the reality. Stunning. 9/10","user":"hitchcockthelegend","rank":[25,30]},{"title":"A tragic tale of love, loss and death, this is one film you won't forget in a hurry.","rating":10,"date":"5 March 2013","review":"England's answer to Greg Nicotero moves away from the special make up effects and goes behind the camera to bring us this harrowing tale of Angel (Day, in a breath-taking debut), a girl ripped from her home during the war in the Balkans.<br><br>In war torn zones, military are kidnapping girls and selling them into the sex trade where they are sold to militia and civilians. Deaf and mute Angel is one of these girls who sees her mother murdered in front of her before being delivered to a brothel where she becomes the personal sex slave to its owner. A birthmark on her face makes her tainted goods so the owner, Viktor (Howarth), uses her to dope the girls with heroin to make them more amenable to their visitors, then clean them up afterwards. She spends her time away from the prying eyes of her captors crawling through the limited space of the ventilation system. Until an unplanned incident brings her head to head with the men who took her from her family.<br><br>Make no odds, The Seasoning House is not a comfortable watch but it is impossible to take your eyes from it. Based on true events of atrocities that happened during the war, Hyett brings us into a degenerate world of men willing to pay for sex with tied up, drugged women and pay extra to be rough with them. Some of the girls do not survive some of their \"customers\". The performances, especially from Day (watch out for her, she will be a name to take notice of) had to be good to make the film believable and to care about Angel. Howarth gives us a dark turn of a man just as at ease plunging a knife into the neck of a young girl to simply make a point as he is pouring a shot of whiskey. <br><br>Hyett builds a relationship between Angel and Viktor that enables the power dynamic between the two of them to change during the film. This is integral to some of the major turns in the story and needed to be handled delicately so as not to be too in your face about it but also sustain a sense of believability with the interaction of the two.<br><br>The Seasoning House is violent and gripping but never feels exploitative which was needed to ensure you retained a high level of empathy for Angel. It's hard to use the word enjoyed with this film but it is a superb piece of art that fully deserves wider recognition. If you get the chance and can stomach something more hard hitting than your usual Hollywood attempts and horror then I highly recommend this film.<br><br>A tragic tale of love, loss and death, this is one film you won't forget in a hurry.","user":"jjwould94","rank":[57,83]}]