[{"title":"Countess D'Winter sword-fighting and spinning on the wire rig","rating":1,"date":"8 June 2012","review":"\"After failing in a scheme to steal Leonardo Da Vinci's airship blueprints, the Musketeers...\"<br><br>Seriously, the writer of \"Predators\" and the director of \"Resident Evil\" decided that Alexander Dumas masterpiece was not good enough... so they decided to add \"Leonardo Da Vinci's airship\" and make some other \"improvements\" on this horrid joke of a movie. I stopped watching when I saw Countess D'Winter sword-fighting and spinning on the wire rig. I wondered how long before the zombies would show up. <br><br>As a lover of literature, I can't stand those Hollywood adaptations. Like when someone decided to cast Robert Downey Jr as Sherlock Holmes and also ignored that the detective from Baker Street never before touched a firearm and sent the most brilliant detective ever imagined on a shooting spree around London. <br><br>Anyway, it isn't hard to understand why this $75,000,000 piece of garbage flopped in the box office. This shows that the public is not as stupid as we may think. Vox populi, vox Dei.","user":"electrobird","rank":[38,49]},{"title":"There is stupid logic, no logic and then there is...","rating":4,"date":"6 September 2011","review":"The three musketeers, and by god am I disappointed. I mean don't get me wrong I excepted a simple story with typical elements, nice fight scenes and a great cast that can act great. Except for the actually really cool looking fights I didn't get anything, the cast is great but the dialogs and script are so horrible even Christoph Waltz couldn't save them. The story is all over the place, you don't get to know any of the musketeers, or barely a character at all and the biggest problem: A movie doesn't have to be realistic for me but it has to make sense in his own universe of the movie (like Matrix its not realistic but logical). The three musketeers plays with the rules of physics, logic and sense of a human being like they were beanbags. Oh and surprise surprise: 3D is useless, but thats nothing new tell me a movie that really had to have 3D except for avatar or maybe tron.<br><br>Movie with a simple plot fine , one that makes no sense at all, you better don't count on my vote.<br><br>So if you can enjoy a pointless excuse of a story for some nice swordplay, have fun.","user":"michael-neichl-904-632888","rank":[286,425]},{"title":"\"Nuking the fridge\" is harmless in comparison to what this film does","rating":2,"date":"3 September 2011","review":"First of all I ought to note that I did not expect much of this film - and yet was left completely underwhelmed. <br><br>There are some major issues regarding this film which I would like to address, they are the reason for my extraordinarily low ranking, which would have been even lower if I had not thought it disrespectful to those actors who did their job very well (against all odds).<br><br>One may argue that screen adaptations require some changes to be made to the original material, and I wholeheartedly agree, but the changes made to this particular adaption are so fundamental they might as well not have bothered to call it The Three Musketeers\". There is as good as nothing left of the original plot in this movie, and what is left of it is changed beyond recognition. I did expect it to be more action laden than ultimately necessary, I expected it to deviate from the original plot, but nothing could possibly have prepared me for this shipwreck of a film. <br><br>One might think that while a film shouldn't be required to follow the book's plot word by word to qualify for bearing the title of a famous novel - one should be able to tell it is supposed to be based on said novel, right? Apparently not. Apart from the title and the the names of the characters, there is but little that would betray it to be even roughly based on Dumas' novel. Buckingham is turned from lover to evil Lord, and Queen Anne into a blameless little lamb who fell prey to the Cardinal's machinations. No such thing as the fleur-de-lis is even mentioned. Constance doesn't only not die, she isn't even threatened by Milady. And that's just a selection. <br><br>One might be led to think it was deliberately conceived as a parody of remakes. After all, it has all the ingredients – a butchered plot, characters with any debt taken out of them (despite the fact that if given the chance, most actors would have delivered an outstanding performance, but the time usually assigned to character development is devoured by sexy\" scenes featuring Milla Jovovich – who herself is a whole other problem), references to everything from the Matrix to Mission Impossible, goodness – it even has airships. <br><br>Airships. Not one, not two, but an entire armada of airships. I understand that Rocheford's eye patch is tempting, but they might as well have put a parrot on his shoulder, it would not have managed to make it appear any more ridiculous. I was surprised they did not venture to release an air Kraken. <br><br>If this film had had less Milla Jovovich, no airships and if anyone had bothered to actually read \"The Three Musketeers\" beforehand, it might have been decent - and had they fixed some minor problems (like the annoyingly clean costumes and settings), it may even have been great. It certainly had the potential. It's a pity it nuked the fridge... or should I say - flew the airship?","user":"goebel-c","rank":[153,231]}]