[{"title":"If any of the makers read this...","rating":9,"date":"8 November 2010","review":"... review please, let me ask you something respectfully!: What do I have to do to get to watch more of these remarkable cartoons?!?! Shall I donate? You need a lucky mug in the studio? Write a permission? Whatever needs to be done consider it done! Because I just love these fantastic stories! The music, the art direction, the characters, the cast, everything was just great! And for a certain level I enjoyed it more than the movies! Don't get me wrong! I love the movies as well! The Burton ones, the Nolan ones are fantastic! (Let's just not talk about the Schumacher ones already!) These titles belong to these directors. It is their vision. This one is very creative as well, but this one is the real BATMAN! <br><br>The movie is not flawless though. Of course sometimes they do simple things, and there is no problem, I mean it is a cartoon, so they can get away with it! But one thing is for sure: Warner Bros. has realised that there are two groups of Batman fans out there, and one of these groups is all grown ups now! This cartoon is for them! I definitely wouldn't watch it with my child - there is blood. A lot of blood. - but for us it is like reading a comic book! They both come to life before our eyes. <br><br>I was waiting for this one and I was very happy to see it eventually! So if anybody would read this from the fantastic team of creators of this great tale: Please make more! You got one definitive fan! And I'm sure that I'm not alone! :D","user":"rooflivers","rank":[62,66]},{"title":"An exceptional production which brings out the best of the franchise.","rating":9,"date":"13 July 2010","review":"The story line has been amazingly written (rewritten since it's a comic book adaptation) with exceptional direction. Even as an animated movie it is on par with some of the best live-action productions. The voice acting is exceptional as well. But what draws you in most is the ease and fluidity with which the story has been told. The flashbacks add a more emotional element otherwise not seen in most batman production. The audience is able to look slightly more into the mind of batman. Though what makes this movie a true masterpiece is the dramatic finale. Only complaint is that some of the points in the plot are a bit obvious which tends to render some of the scenes moot.<br><br>A must watch for any batman fan and extremely entertaining for the rest.","user":"vaidya-abhishek","rank":[75,83]},{"title":"The Dark Knight returns triumphantly....","rating":10,"date":"18 July 2010","review":"Having this new Batman movie, I must say that I was amazed and caught off guard. I was expecting it to be good BUT not that good. The opening alone is a thing of beauty and one that stays in your head long after the the film has ended. Yes it is violent BUT you can't say its a great film then mark it down for being too violent. That makes utterly no sense. The people who watched the original animation series are now adults. The Batman comics are incredibly violent and the films aren't exactly for kids. I was amazed that D.C had the courage to present a story that was brutal, emotional, funny and with consequence. One scene in particular is as shocking as anything the Dark Knight had to offer. This is without doubt ranks as one of the very best DC animations and a good stop gap while you wait for the new movie to arrive. I know the Joker may not look like you expect him too but the Dark Knight proved that you don't need to have a skinny pale character in the role. This Joker is dangerous and for once you get the real sense that he is Batman's equal rather than a bumbling fool. He is crazy and has a death wise. He just wants to see the world burn. The other characters are well done, each adding to the Batman mythology. The Dark Knight isn't portrayed as some demigod without feelings. Here he is imperfect and haunted by past mistakes. You understand why he is the way he is. Nightwing was done well, cracking jokes and lightening the mood. With his character you get a real sense at his frustration with Batman and how hard it must have been for him to be the first robin. Their relationship is fractured to say the least but it also has the hallmarks of a father and son bond where there are many unspoken emotions running between them. I won't talk about the other characters as I do not want to ruin the plot. All I will say that even if you just watched the Batman films, you need to add this to your collection.","user":"knightsamurai-794-272673","rank":[77,86]}]