[{"title":"Decent documentary, not enough detail","rating":5,"date":"19 June 2010","review":"I would say the movie itself isn't anything too special. I went in expecting to learn much about Shulgin, and his series of books: Pihkal and Tihkal. Perhaps more in-depth information about how Sasha and Ann synthesize their different analogs and homologues, their experiences with these substances, and info on how the family live their lives. The last one was fulfilled to some extent, but much of this movie gave me a sense of Deja Vu because I had seen some of the clips used in it on Youtube and such. However, this is not a failure, because while it doesn't focus on the things that a viewer might expect them to (this movie attracts a very rare breed, and the showings are very exclusive), it does show what some people don't expect: the lives of a happy, normal, successful family. No matter how many drugs Shulgin has invented for people to eat, snort, shoot, this film makes you realize that this man's only intention is to figure out the mind, and he's very careful (if a bit humorously absent-minded) with his creations. You can sense the love and life between the characters, they are simply normal people, and much of the movie shows the more mundane parts of their lives, albeit in a humorous way.<br><br>Its sad that his chemical formulas for things like mescaline and DMT derivatives are considered by many to be \"Dirty Pictures\", when really they are some of the only paths straight into the mind (not the brain, as Shulgin explains himself)<br><br>Don't get me wrong, its not that there wasn't enough detail on drug use (but it sort of is), and there is plenty of humor (although it is subtle) in this documentary, definitely more than I expected. Shulgin is juxtaposed with his son, who collects rare tools (unlike the \"tools\" Shulgin makes, these are tools in the most traditional way), and a DEA agent. Lots of filler as people ride in trains (this is symbolic of Shulgin's first MDMA trip as is explained in the movie, but it was overused if you ask me) Maybe its just that I'd like to know more about HOW Shulgin started manipulating chemical formulas to make 2c-b and created a whole series of famous 2c-based drugs, or his experiments with countless other hallucinogens, how he got DEA approval, more detail on his struggles with the DEA, since this information is basically nowhere to be found, besides maybe snippets of P/Tihkal.<br><br>On the other hand, its interesting to find out about his rebellious son, the way he and Ann go through the day, seeing the lab in person and hearing people being interviewed on their opinions and relation to Sasha Shulgin.<br><br>For a movie so exclusive, you would just expect more detail on the \"low key\" aspects of his life. I was fully prepared to hear psychedelic formulas and experience reports throughout the whole movie, only to find out this wasn't the case. Not a tragedy, but I wish the director had taken that route at least a *bit* more","user":"emptyspaces153","rank":[30,38]}]