[{"title":"This movie is a little Gem! Recommended.","rating":9,"date":"12 April 2010","review":"This New Zealand made movie had me laughing and entertained right from the outset. In fact, within the first five minutes, there were more laughs than some comedy movies manage to achieve in their entirety. <br><br>The movie 'Boy' is proof that a good script, decent characters and plenty of laughs produces a better result than big budget movies with no originality and plenty of marketing.<br><br>Go and see this -- but only if you like decent movies, 1980 references, laughing and characters you'll care about; a blend of serious under-currents wrapped up in quirky NZ humor.<br><br>For New Zealand viewers, some of the scenes will seem so familiar; something you'll be able to relate to...but anyone can watch this.","user":"TroyWoodfield","rank":[71,80]},{"title":"a painfully personal film that deftly mixes black humour and sadness","rating":7,"date":"15 July 2010","review":"\"You could be happy here. We could grow up together.\" This epigraph from ET at the start of this quirky New Zealand comedy serves as a perfect introduction to the themes and central plot of Boy.<br><br>Writer/director and former stand-up comedian Taika Waititi (Eagle Vs Shark, The Flight Of The Conchords, etc) has drawn upon his own experiences growing up in new Zealand in the 1980's to shape this poignant and quirky coming of age tale. Boy deals with themes of family, fatherhood, responsibility, the innocence and imagination of childhood that is lost when one grows up, hero worship, and the heartbreaking loss of innocence. Waititi further develops themes and ideas from his Oscar nominated short film Two Cars, One Night, and suffuses the material with subtle black humour, quirky touches and plenty of his trade mark deadpan humour.<br><br>New comer James Rolleston makes his film debut, and has an appealing and natural presence as the 11-year-old title character. Since the death of his mother, Boy and his family live in the care of their elderly grandmother. But when she travels to Wellington for a few days to attend a funeral, Boy is left in charge of his siblings. When we first meet Boy he is fantasizing about his absentee father, whom he envisages in a variety of heroic roles. But the reality is vastly different. Alamein (played by Waititi himself) has been released from jail, and returns home to the small dead end town of Waihau Bay. Dad turns out to be a drug addled loser, a petty crook who has come home, not to spend time with his children but to try and dig up some money he buried a couple of year earlier. Unfortunately he can't remember where he buried it, and is forced to hang around for a few days. Boy tries to bond with his father, but in the end he realizes that Alamein is a failure as a parent, a father, a man, and a role model.<br><br>Boy is a painfully personal film that deftly mixes black humour and sadness. The film is set in 1984, and Waititi also imbues the film with a strong sense of place and time, particularly through Boy's obsession with Michael Jackson. Boy has becomes one of the most successful films released in New Zealand, and its universal themes and quirky humour suggests that it could also have broad appeal in other territories.","user":"gregking4","rank":[23,24]},{"title":"A refreshing eccentric version of a road well travelled","rating":10,"date":"5 April 2010","review":"I went along to this film hoping that it would not be an awkward repeat of the Maori-against-the-world-old-chestnut that seems to pop up far too commonly here in NZ: and I was not disappointed!<br><br>This was a fantastically enjoyable film that managed to tackle some prolifically odious practices that (still) exist (illicit gang affiliation, the lack of reasonable care and responsibility for children, drug abuse, poverty) without being gratuitously violent. Surprisingly, and very refreshingly, the writer even succeeded to make this film wonderfully heart warming and funny.<br><br>Thoroughly recommended.","user":"HamiltonRaglan","rank":[30,33]}]