[{"title":"A Fun Film","rating":8,"date":"7 January 2013","review":"I can't believe how many negative opinions surround this film. I mean granted, its not Oscar worthy or going to go down in time as one of those incredible films, but the humor, sarcasm and light hearted tone are greatly enjoyable. Perhaps some people cannot vibe with the blunt somewhat twisted humor, but I loved it.<br><br>This is a film for people who want to simply watch something fun. It's never serious and simply a parody. The cast and acting were excellent and I really liked seeing all the stars. I think this movie makes fun of the current state of our culture and perhaps that is what annoys some viewers. It also attacks our cultural vampire-obsession which has become quite ridiculous in my opinion. So, perhaps this is not a movie for twilight fans as it may ruffle their feathers? I don't know.<br><br>As a fan of vampire films and light hearted comedies, this film fully delivered for me. It's kind of got a feel good vibe but also a lot of demented moments. Perfect for me :) I would recommend to anyone who likes vampire movies, comedies or cheeky dramas with some slightly twisted humor.","user":"synikk","rank":[49,52]},{"title":"Vampire Success","rating":10,"date":"25 October 2012","review":"I saw this movie and died laughing. I'm a huge Heckerling fan of course, and Vamps fits right into her already ridiculously impressive catalog. Alicia Silverstone is hilarious and adorable, and Krysten Ritter is even better than she was on Breaking Bad (which is practically impossible in my opinion.) This could be my favorite Silverstone movie of the decade, just sayin'. Wallace Shawn is ruthlessly hilarious as always, and Sigourney is at her most devilish. And then out of no where, Justin Kirk shows up (Uncle Andy, from Weeds) and he had me cracking up from his vampire accent. And Malcolm McDowell too... this cast is stacked. The movie is a real delight. Fingers crossed for a sequel!!","user":"lmpassist","rank":[36,47]},{"title":"Funny enough","rating":7,"date":"25 August 2012","review":"I saw Vamps at the Fantasy Filmfest, where the comedy was well received by the public. The main actors were very funny, Alicia Silverstone and Krysten Ritter make a good duo. The story was fine and most of the jokes were great. The film is aimed more at middle-aged people than teens so I doubt it will be very successful. It is a little gem, yet miles away from Clueless or Fast Times. There was more potential for horror or gore, it is very tame in that department. Also, Sigourney Weavers sire vampire of both Goody and Stacy was too tame a character for my taste. Malcolm McDowell, Justin Kirk and Wallace Shawn were funny and as always great in their supporting roles. They can do no wrong.","user":"alexander-75-640939","rank":[46,63]}]