[{"title":"Drive Angry","rating":8,"date":"8 March 2020","review":"A supernatural action movie about a man who escapes from \"prison\" to exact revenge on the killers of his daughter and the kidnappers of his granddaughter. Picture Ghost Rider without all the neat effects. Barely good enough to recommend, but Amber Heard as the ass-kicking partner pushes it over the top.","user":"MR_Heraclius","rank":[38,44]},{"title":"Is that your tongue in your cheek or are you just pleased to see me?","rating":9,"date":"25 February 2011","review":"If you've seen the trailer you know what this films about. A Grandfather everyone thought was dead is out to save his baby granddaughter from the clutches of a gang of devil worshippers. Thats the plot in a nutshell and you don't need to know anymore.<br><br>This film is really a throwback to the old 70's revenge movies. The dialogue is purposely cheesy. The violence is over the top. There's nudity and gore and a few laughs to be had along the way. Nicholas Cage gives another fine unhinged performance delivering these cheesy lines like he was doing Shakespeare. Amber Heard as the sexy sidekick is just as good, but possible the best performance is from William Fichtner as the accountant. The music is loud the gunshots louder and the 3D is great all the way through.<br><br>For me it had a similar feel to the crank movies and planet terror. It was just stupid fun and I loved it.","user":"Greenzombidog","rank":[187,243]},{"title":"A ridiculously over-the-top and wildly enjoyable thrill ride","rating":8,"date":"23 March 2011","review":"Nicolas Cage takes a lot of flack for his acting choices. The man is likely the most inconsistent actor in the entirety of Hollywood, jumping from headlining critically acclaimed films like Leaving Las Vegas and Adaptation to headlining putrid, bottom of the barrel films like Next and The Wicker Man. But going through his filmography, sorting the good from the bad, and the bad from the unwatchable, you will find a good handful of films that are just meant to be silly and fun. This is where Drive Angry 3D resides.<br><br>John Milton (Cage) did some bad things, and was sent to hell as a result. After the death of his daughter and the kidnapping of his granddaughter at the hands of crazy cult leader Jonah King (Billy Burke), Milton escapes hell and becomes a man on a mission. As he hunts and searches for King, he brings the gorgeous Piper (Amber Heard) along for the ride to assist him in his quest.<br><br>Drive Angry 3D was unfairly trampled by critics when it was released just under a month ago, and it is a real shame it never was able to find a true audience. Just looking at the trailer should have suggested exactly what kind of film you were in for, and this one delivers at all turns. Right after its gory and explosion-filled opening, you get one ridiculous set piece after the next, moving at a near delirious speed through some of the most over-the-top sequences of the last decade. There is an almost automatic comparison to Grindhouse and more specifically, Death Proof, and it is well warranted. There is next to nothing to take seriously in Drive Angry 3D. There is no thinking involved. It was never meant to look or act like an Oscar-winner. All it wants is for you to strap in and enjoy the ride.<br><br>A lot of the fun and enjoyment comes from the 3D more than I would like to admit. The film is of the rare breed of actually being filmed in 3D as opposed to being post-converted, and you can tell in just how much stronger and better it looks as a result. There are no real dull or dark moments, and only a few instances where it feels like the gimmick it actually is. In most cases, it just looks natural and stylish – a natural progression for the grindhouse, B-movie genre. And though the special effects do look cheesy, they fit in almost perfectly with the visual motif and landscape the 3D provides for the film. But it is not just the elements that pop out and on the screen that are impressive. A flashback scene, with Cage flashing back in the foreground and the scene playing out in the background is of particular note, because it actually does something unique outside of what we have come to expect from the 3D effects Hollywood continues to pump out. It adds to the medium, and suggests that we may see some creativity out of this format yet.<br><br>The rest of the fun, when not laughing near maniacally at all the brutal carnage going on (the effects of \"The Godkiller\" are of particular note), comes from the goofy dialogue and delivery from the cast. They may look stone faced, but you can tell they are having a great time acting out this preposterous storyline. Burke and William Fichtner (who plays the Devil's right hand man, The Accountant) seem to be having the most fun hamming it up, and doling out ridiculous one-liners. Just watching them react and play their roles so deliciously over-the-top is more than enough reason to see the film on its own. Heard plays the drop-dead gorgeous blonde she has perfected over the years to a tee, adding in a bad ass rebellious attitude for good measure. While she does not wear those fantastic booty shorts for the entirety of the film, rest assured that you will not complain about her other outfit choices (if of course, that is a selling point to your watching the film).<br><br>Surprisingly, Cage plays Milton cool and monotone. He does the most outrageous things in the movie, and gets many of the great one-liners, but he seems very mellowed out in every instance. He seems to not be his over-the-top, absurdist self, which is saying a lot since he's made a habit in the last few years of making each character more unusually eccentric than the last (see The Bad Lieutenant: Port of Call New Orleans and Kick-Ass for proof). He seems perfectly comfortable playing his character as the closest thing to the straight man, while everyone else acts over-the-top.<br><br>What I disliked about the film was that it stumbles as it nears the finish line. Late in the film, David Morse is introduced merely as a means for the plot to advance to the ludicrous ending. And all his character does is stall the film, and make it run longer than it needs to. While his entrance sheds a bit of light on Milton as a character, by that point it is too little, too late. As stated previously, this is not the kind of film that benefits from characterization and explanation. It revels in saying and doing irrational and silly things. Why try to turn the movie around on its audience, who had been eating up every word and action until that point? It just makes the film run longer, and takes away some of the fun.<br><br>Granted you know what you are getting into, Drive Angry 3D is a ridiculously over-the-top and incredibly fun diversion. This not a serious movie in the least, and may even offend some people with how outrageous it is. But if you can handle the heat, this underrated gem may prove we cannot give up on Nicolas Cage just yet.<br><br>8/10.<br><br>(This review also appeared on http://www.geekspeakmagazine.com).","user":"DonFishies","rank":[137,176]}]