[{"title":"Ludicrous 3rd Act","rating":2,"date":"5 January 2013","review":"First the positives:<br><br>1. The movie moves quickly, it doesn't drag, so edited well. 2. The middle part is half decent and what you expect for this series. 3. The female lead and her friend are very attractive. 4. Decent special effects. 5. Nice highlights from the original movie at the beginning.<br><br>Negatives:<br><br>1. Where did all these family members come from that wasn't in the 1st movie? Terrible answer to what happened after the woman escaped. 2. Are you really suppose to feel sympathy for a family who killed 4 people in the 1st movie and implied they killed countless others? They deserved to be shot and burned but the movie says it was wrong. 3. Why is everyone a jerk in the movie? One guy steals, 2 people cheat, people abusive, lying, etc. Only the boyfriend of the lead actress's friend wasn't, and he was the most brutally killed. Come to think of it, the mayor wasn't either, he did what had to be done, and he was the 2nd most brutally killed. Too bad the movie thought he was a jerk. 4. Too many clichés like the officer going to the house and not waiting for BACKUP! Guess what happened to him. 5. Tombstone scene showing grandma died in 2012, meaning 39 years after the 1st movie, yet no one aged that much. Eating human meat must keep the body young as Leatherface at 60 something moves awfully well. 6. This must be the only carnival in Texas that no one carries a gun. Also, amazingly, Leatherface doesn't cut anyone with the chainsaw moving thru the crowded carnival. 7. A van with a cut tire flipping over. That doesn't happen. 8. A sheriff who believes in equal rights for serial killers. Just absurd. 9. Terrible ending. Trying to have sympathy for Leatherface? How did anyone think that was a good idea? He's suppose to be scary! 10. Lead actress who suddenly forgets Leatherface killed her good friend and boyfriend, and now loves him because he's her cousin. Terrible! 11. How does a sheriff lose a deputy, see on video 3 cut up bodies, and just tell Leatherface to clean up his mess? Fire the script supervisor! 12. Leave evidence out so someone else can look thru it. Always the incompetent police dept. If that were true today, the US would still be like the wild west. 13. Have to take care of Leatherface? Let the cannibal rot. 14. If it wasn't for the thief, would Leatherface ever have gotten out of the house? How did he survive when Grandma died? 15. CGI gore, not that great.<br><br>I could go on, but too many more negatives, I'm done. I see why this came out the 1st weekend of the new year.","user":"jamdifo","rank":[57,84]},{"title":"I already forgot about it","rating":2,"date":"4 January 2013","review":"Pure garbage. They set the movie in 2012, 39 years after the original. The only character that aged was the Sheriff. The main character was a baby in 1973 but is miraculously only about 22 or 23 in 2012 (which they clearly display on a grave stone, 2012). Also in 2012 smart phones can stream live HD video in real time over a call. I wonder how much their data plan is? Which, by the way, brought the film from ridiculous to absurd especially given that streaming the video served no purpose in the story or the scene. A speaker phone would have sufficed and my disbelief would not have been called back from suspension. So yeah, those are just TWO of the myriad issues this movie has. This was worse than the remake, by far. There isn't a film maker in the world who could make a good sequel to the original, even Tobe Hooper couldn't do it and HE directed the original. The Texas Chainsaw Massacre (1974) is a perfect film, it needs no more exposition, but this is the era of the retro cash grab. So everything cool from the 70's and 80's gets dragged out and crapped on for the youth market and they think the winks and nods to the source material will tickle us old fans nostalgia gland. Well screw you Hollywood. It doesn't. It's lazy film making. What I paid 10 bucks for was nothing more than a 1sr draft script chock full of slasher clichés and inept story telling. You know what made the original so brilliant? It wasn't about anything! It was simple, I dare say even plausible. But this movie BEGAN in implausible territory and only sank deeper into the abyss. Stay away if you have a brain. CGI gore, 'nough said. The 3D was not even adding any degree of anything, it was more distracting than anything, which is more the format, 3D just sucks.","user":"Jason_Marsh_35","rank":[149,246]},{"title":"An Excess Devoid of Thought or Merit","rating":1,"date":"6 January 2013","review":"Beyond all the pink-cheeked, bated-breath laudation that has come from critics and horror aficionados in the 38 years since the release of the original film, it's not a stretch to say that the two things that worked together so effectively in the execution of the original was the stark, naturally-lit and flat documentarian style of cinematographer Daniel Pearl and the sparse writing of Hooper and Henkel, whose utter lack of exposition lend a terrifying, claustrophobic immediacy in counterpoint to sun-baked Southern Gothic vistas, which place the viewer squarely and unremittingly in role of Hitchcock's man filming in the corner, with all of the legendary director's flinch-inducing atmospherics and not of whit of his restraint, such as it was.<br><br>With so much latitude in which to effect a direct sequel (apparently given a seal of approval by Hooper, undoubtedly for monetary incentive and despite his directing a direct sequel in 1986), with so little to hamper questions of plot or motivation, Texas Chainsaw 3D fails so completely and morosely that one might wonder for whom the film was even made, for it definitely was not for a viewer with any sense of taste or even the ability to do basic arithmetic.<br><br>It is generally understood that the events of the first film take place in 1973 or '74. Once this film left the confines of those few brief sequences which dovetail immediately from the end of original, in which a lynch mob and the most ineffectual sheriff ever are party, directly or indirectly, to picking off the entire Sawyer clan to which Leatherface is kin, and then burning the farmhouse to the ground, and a member of the mob inexplicably taking the lone babe of family home to raise as his own, we skip, by all accounts of vernacular, media, and what little of civilization we see before plunging back into the wilds of rural Texas, to be modern day; a tombstone later in the film confirms that the year is in fact 2012. From this, we must conclude one of two things: Heather Miller (the now grown-up Sawyer child from the intro, played by a disturbingly thin Alexandra Daddario) is either the youngest looking 40-year-old heroin chic store butcher (as heavy-handed a nod to the nature vs. nurture debate as I've seen in film since being lampooned in Trading Places) in the history of cinema, or people were picking up retarded hitchhikers in VW bugs while wearing bare-backed polyester fashions of the seventies sometime between the fall of the Berlin Wall and the Rodney King riots. So far is this discrepancy from being explained that all reference to the date of the original film's events are limited to \"August 19th\" with the year consistently being deliberately obscured.<br><br>The rest of the cast is equally unremarkable in presence and abysmal in performance, from the Tonia Raymonde shedding her more tame bad-girl image from ABC's absurd Switched at Birth series to become the requisite slutty slasher-bait, inexplicably involved in a love triangle, never exposed or explained beyond its smarmy, innuendo-laced exposition, with Heather's boyfriend, played by Trey Songz, included no doubt in an attempt to add urban flair and coax minority viewers that are probably sick of seeing Caucasian kids lumber around stupidly and getting fileted in the dark woods.<br><br>The greatest disservice to the original material was the ridiculous attempt, by way of the Sawyer family slaughter at the beginning and the near single-minded thuggery of the lead vigilante, now serving as the town's mayor, to make Leatherface and company sympathetic characters, even swinging for the anti-hero fences when the bloodthirsty mayor meets his boring and contrived ending. Were the mayor and his retinue of good old boys terrible people for mowing down a slew of people and burning the house to ash with Molotov cocktails? Undoubtedly. But we should not forget those people were part of an inbred family of murdering, cannibal sadists, something that no amount of rural oppression can allow any sane person to ignore.<br><br>The film exists for the same reason that the sequel to the Blair Witch Project was released: to produce a sexualized, tangential story with hot young actors in a shameless attempt to cash in on a franchise name. At least Book of Shadows attempted a story even if it was a terrible one. Avoid this one, unless you have enough morbid fascination to see both the death of a franchise's self-respect, and one torn button-down shirt which maintained its wearer's modesty purely by proving that one of the few forces in nature greater than gravity is a non-nudity clause.","user":"greycomics-1","rank":[24,34]}]