[{"title":"I really enjoyed this movie for one reason","rating":8,"date":"11 May 2012","review":"This movie stands out from any movie I've ever seen for one reason: it is the only movie I've seen where I believed the people fighting were actually fighting. I can't remember ever seeing a film where I was actually wincing and tensing up from fear that somebody was going to get hurt.<br><br>This isn't a film that depends on CGI or fast cuts or clever angles or even stunt people for the most part. The star of the film is clearly a very physical and capable woman of action, and she made me believe she was actually hurting the people she was pretending to hurt.<br><br>For that reason alone, it will always stand out in my memory. Most action films these days are terribly boring because it's all so cartoonish and exaggerated and stylized, and therefore unbelievable and fake. But this film kept the action grounded in the physical capabilities of its very capable star, and that made it anything but boring. I guess it didn't do to well at the box office, which is too bad. If this had launched a franchise I'd have been a big fan.","user":"imdb-12650","rank":[174,235]},{"title":"Nothing new, but likeably cool!","rating":7,"date":"1 February 2012","review":"Once again, I stepped into a movie with zero expectations, and was pleasantly surprised. People told me to avoid \"Haywire\" but I found it reasonably entertaining.<br><br>First off, I was amazed by the number of likable actors that are in the movie - Ewan McGregor, Michael Fassbender, Michael Douglas, Antonio Banderas and Bill Paxton (where has he been hiding?) all star in co-roles. I don't know the main actress in the movie but she did a fine job, and apparently did all her own stunts.<br><br>Flick has been un-fairly compared to Angelina Jolies \"Salt.\" Why? Because it stars a woman kicking guys ass's perhaps? I guess their plots are kind off similar too, but \"Salt\" was an over the top action movie. Outside of a couple of movie-style fights \"Haywire\" feels more realistic, but where it really succeeds is in its style. It works as a cool thriller that I found myself smiling at because off the way it tells its ex-assassin-getting-chased-again plot. Although maybe not everyone will give it a thumbs up, I will because I enjoyed it.","user":"martinrobertson300482","rank":[184,257]},{"title":"Enjoy Soderberg, especially enjoy Carano","rating":7,"date":"31 January 2016","review":"And the reason I give that advice is that you will have the opportunity to experience Soderberg again but I am not sure I can say the same for Carano.<br><br>This is of course a change of pace for Soderberg who is actually becoming known for his ability shape-shift between genres and do a pretty good job at each one he chooses.<br><br>This is an average spy thriller lifted to above-average by an A-List cast backed by Gina Carano in the action scenes.<br><br>Carano is the actual reason I wanted to review the film. She is a rarity in modern film, a good looking actress who shows not the slightest hesitation at going all JCVD on someone's butt if the script demands it.<br><br>And she is good. I mean there are multiple scenes here where she carries the attention of the viewer and it is hard to imagine another actress doing that as well.<br><br>The unfortunate part is that it seems no one in Hollywood wanted to accept the challenge of moving her career along even though it deserved to be moved. I watched her in IN THE BLOOD, a later effort framed as a B movie and lacking all the class and polish in this one.<br><br>Too bad. I miss her already.","user":"A_Different_Drummer","rank":[18,21]}]