[{"title":"Amazing how this site can screw up people's perception of a film.","rating":7,"date":"25 March 2013","review":"Most reviewers gave a high score to this film and with a good reason, this is a good comedy, but the score displayed is around 4, that is simply put, ridiculous.<br><br>If you enjoyed good British comedies like walking ned divine, holly water and saving grace you will surely enjoy this one and Brendan fits very well in it as the American in ireland caught in the middle of good mess.<br><br>Don't miss it because one person had a low opinion of this film, there are those who will find the eiffel tower, the grand canyon, the beatles and mozart to be horrible and worthless.","user":"gonzofaratro","rank":[25,33]},{"title":"Corny Comedy","rating":5,"date":"25 April 2014","review":"In Belfast, the criminal Mad Dog Flynn (David O'Hara) cannot have a baby with his girlfriend. The gambler Jimbo (Martin McCann) has a baby and owes five thousand dollars to Mad Dog. The gangster proposes to exchange the debt for the baby and Jimbo decides to heist the Fish Market with his friend Sox (Conor MacNeil) using an automatic weapon from the IRA that belongs to Sox's grandfather. Meanwhile, the American Joe Maguire (Brendan Fraser) flees from his wife, whose father is a powerful mobster in Boston, and comes to Belfast to run his cousin's antique business. Joe dates his neighbor Sophie (Yaya DaCosta) and notes that Jimbo is frequently staring at him on the street. The clumsy Jimbo steals a suitcase from the Fish Market without knowing that it belongs to Mad Dog. However his escape plan fails and he runs to Joe's store. However he accidentally shots his gun and the police puts the place under siege. When Jimbo tells to Joe that he might be his son, the American sympathizes with the hoodlum and decides to help him negotiating with the police. <br><br>\"Whole Lotta Sole\" is a corny comedy lost in many unnecessary subplots. The story has a funny beginning and good gags but in a certain moment becomes boring and mawkish. My vote is five.<br><br>Title (Brazil): \"O Negociador\" (\"The Negotiator\")","user":"claudio_carvalho","rank":[10,12]},{"title":"Surprisingly good","rating":8,"date":"12 March 2013","review":"Im no great fan of movies from my home country. Usually grim or trying to be funny when they're not. But this little movie has charm and wit a plenty although some laughs may be lost on you if you're not from Northern Ireland. There are many scenes of Belfast and the little street where the antique shop is situated was filmed in Downpatrick. There were a few laugh out loud scenes for me, where one of the gypsy children gets his head stuck in a window and Brendan Fraser uses soap to get him out and he doesn't know what it is. Or the scene where fish get shot in St Georges Market and they put flags on them to mark the bullet holes including a crab which has a hole in it. There are many nods also to the current peace here which was done in a light hearted way. All in all i truly enjoyed this movie and it was nice to see a film made about NI which didn't portray Belfast as grim and humourless. It certainly seems now that Northern Ireland has become big business for the movie industry as we enjoy regular film crews coming to our (mostly) untapped locations. Long may it continue.","user":"horizon2008","rank":[17,23]}]