[{"title":"Enjoyable zombie flick with comedic elements.","rating":8,"date":"4 March 2020","review":"A genuinely pleasant surprise! Here's a film that takes a dead-on-arrival plot (no pun intended) and turns it into something that is fresh for the uber-popular zombie genre. While the film gets off to a slow start and the acting can be *ahem* stiff at times, we as an audience are invested in this endearing and lovely relationship between the zombie, R, and his living girlfriend, Julie. We want to see them live happily together and survive in the odd, post-apocalyptic conditions that plague their world. I also can't help but dig the nice use of music in this film. Nice work!","user":"MR_Heraclius","rank":[41,45]},{"title":"More original than you might think","rating":7,"date":"25 February 2013","review":"Finally the great zombie romance? Well, maybe not, but it's the closest I've seen. You get to see zombie life from the perspective of a zombie, who starts to get feelings for a girl who's alive. Through a set of circumstances, he \"rescues\" her and they take refuge in a grounded plane at an airport overrun by the undead. There were several original elements that I had never seen in a zombie movie. First and foremost is the narration by our young zombie giving us insights into his condition. He can barely utter words, but weirdly, in his head, he seems smart and talks normally. I liked that part and I was kinda sorry when he got somewhat better at talking, therefore evacuating most of his thoughts. Second original element was the romance. I wasn't impressed by it, but at least it was slow-building, somewhat charming, avoiding most of the disgusting stuff, and you kind of rooted for them by the end.<br><br>Third original element would be the zombies not stuck as they are. They can \"evolve\" (our hero) or \"devolve\" (bonies, zombies who shed their outer skins, looking almost like black ghouls or skeletons). Speaking of bonies, I thought they looked amazing, creepy even, but their movements were stiff and made them look computer-generated. Also, who knew that eating brains for zombies could be a way for them to live vicariously the past life of the person they ate, through visions. It's not even the only way they can \"change\", although the other way, though nice, seemed a bit far-fetched and too quick. Fourth original element was that there was sometimes a humanistic, hopeful even, vibe to the proceedings despite the dramatic elements. There's something at the end involving the zombies and the bonies that I had never seen before. So the movie is more original than one might think, however the execution wasn't flawless.<br><br>Sure, overall, I found the movie had charms, but for me the laughs were few and far between, like most romantic comedies I suppose. Because it's supposed to be one of those, but with obviously more somber elements. The drama could have used more \"teeth\" to make this film truly memorable and moving though. The movie even made me think of Romeo &amp; Juliet as well as Edward Scissorhands, not bad stories to be associated with. The creators never really went into total parody or silly mode, which I think was a smart choice. What really took me out of the picture at several occasions though is that they didn't follow their own internal rules. We're told by our hero that zombies can only shamble slowly, yet not long after, we see zombies running. It's like they can have bursts of speed at will. Also, bonies, for some reason, move fast despite being in a more advanced stage of zombification. Also, I know it's a short movie, but zombies \"evolve\" too quickly, especially the best friend. Acting was fairly good, not exceptional, but I particularly liked the main character. Why? Because he's a nice, smart freak, quite lonely and having trouble to express his feelings in words and actions, but able to be slowly \"healed\" by kindness and love. It made him interesting and relatable to me and probably others. Yes, the movie could even be seen as an allegory on solitude, not fitting in, and how hard it is to truly connect to others in modern society.<br><br>Zombie makeup was rather minimal, and they managed to make the protagonist kind of attractive, in a goth-like way, mostly because of his great hair and pale blue eyes. I thought there were wasted opportunities with the concept, but it could have been done much, much worse. So, I liked the movie, I would even recommend it to most people not allergic to zombies to see a different take on them. It's very minimally bloody and the most \"gory\" part is when they show a zombie shedding his skin to become a bonie, and even that's not too disgusting. I think it would make a good date movie. Warm Bodies didn't leave me cold and the more I dwell on it, the warmer my feelings for it get.<br><br>Rating: 7 out of 10 (Good)","user":"Quebec_Dragon","rank":[107,134]},{"title":"Loved it","rating":9,"date":"2 February 2013","review":"I was looking forward to this since the moment I saw the trailer and so got myself out of bed for the 10:05 am showing on opening day. It looked funny, like 'Shaun of the Dead,' and seemed to have its own interesting take, which is rare in the zombie genre. Usually the plots of zombie films are about as aimless as the zombies. The best way to describe this film is a zombie romantic comedy. It does have some action and some tense moments later on but the initial set up is the zombie, R's, emotional growth and how meeting this girl sparks something in him to evolve. This is nothing like 'Twilight,' and those that are saying that have either not seen it or are too absorbed in the fact that the two leads are good looking, which is the only commonality this film has with 'Twilight.'But, let's face it, the majority of leads in films are attractive, so, that's not much to base a similarity on. 'Shaun of the Dead' was just a comedy, where this is a comedy with heart and depth. It's a satire, but they don't force feed the point of the film, instead they make it very subtle, which is nice.<br><br>It wasn't a laugh-out-loud comedy, but I don't know that I necessarily thought it would be when I saw the trailer. It definitely had more emotional depth than I thought it would which gave me a much fonder attachment to the film than if it had simply been made for laughs. The two leads had great chemistry and were believable and well cast. The directing, writing, and pretty much everything in the film was well done. I have no complaints. It delivered what it said it would and exceeded my expectations which is rare these days in entertainment.","user":"plasticanimalz","rank":[195,253]}]