[{"title":"Will you like it? The answer is, \"it depends\".","rating":25,"date":"25 October 2010","review":"When looking through reviews on this site I've noticed that it seems most people who weren't impressed with the first one like the second one more and those who absolutely loved the first movie were somewhat disappointed with the second.<br><br>I think this is because the first one had more build-up and a slower pace that gradually came to it's climax. The second one instead went from harmless innocent events and not much happening to BOOM - death! So I think it has to do with the person's patience and preferences as to which style they prefer. Personally, I prefer PA1's style and think it allows the dread to intensify as it grows and grows with each scene.","user":"hyprsleepy","rank":[97,143]},{"title":"Scary and creepy enough. Worth seeing.","rating":8,"date":"23 October 2010","review":"If you liked the original Paranormal Activity, you'll like this one. Myself, I was not really that impressed with the original, and I liked this one quite a bit better. The mood and creepiness was pretty intense at times.<br><br>It is NOT just a remake of the original movie, as some would have you think. Yes, it uses that format, and follows it pretty closely, but does it better and takes it a few steps farther. Just because it uses the same format doesn't mean it is the same movie. That is like saying all 'Cop' movies or all 'Buddy Pictures' are the same, just because they also follow the same format.<br><br>If you saw the first movie, you will recognize everything that is happening here, but that doesn't decrease the sense of dread and hair-raising-on-the-back-of-your-neck scariness. Instead, I think it will increase your enjoyment as you watch things develop. Talk about things that go 'bump in the night!' And sometimes in the daytime, too! I thought this movie was more intense than the original, and it helps to put the original into a context, and makes more sense out of it all.<br><br>Is it a perfect movie? No, but show me a perfect movie. They all could be better in SOME way, and this is no exception, but I think it is a pretty darn good movie, and worth the time.<br><br>Oh, I should also tell you kind of \"Where I'm coming from.\" I LOVE a good horror movie. I LIKE to be scared. But I hate slasher, torture, vicious movies or movies that get too overt about hurting people. Give us something we can feel, something we are afraid of, but don't make us sick. I think Paranormal Activity 2 is just my kind of horror movie.","user":"fmc3","rank":[130,214]},{"title":"You need an imagination to make this movie work","rating":9,"date":"24 January 2011","review":"As with the first Paranormal Activity, this movie is largely suggestive instead of implicit with its creepiness. The performances given by the actors are genuine and the characters are more relatable than in the first movie. This movie both expands on the Paranormal Activity mythos and provides a genuinely scary experience, so it comes highly recommended. So many horror movies these days either mistake gross for scary (Drag Me to Hell) or are uneventful/predictable with characters no one could care about (The Strangers, White Noise 1/2, The Eye, Shutter, etc.). The Paranormal Activity movies stand out as the best horror films since the superb El Orphanato, you just have to be willing to fill in some of the blanks yourself to truly appreciate the terror.<br><br>Many people \"pooh-pooh\" the Paranormal Activity films, but I think it's likely because they've become desensitized to good horror by all the tripe that constantly comes out undeservedly under the \"horror\" name these days. Do yourself a favour and see this movie if you are a horror buff. It won't disappoint as long as you're smart enough to understand the movie and what makes it scary.","user":"wii60","rank":[84,137]}]