[{"title":"Fast paced, excellent tension,sensitive, violent and thought provoking.","rating":10,"date":"4 June 2011","review":"If you want a movie that will hold your attention and leave you feeling like you've watched a great movie, this is it. I am not a connoisseur of Ken Loach, or a movie snob, I just enjoy a movie that holds my attention.<br><br>Unlike the other reviewers, I thought the characters were well-drawn and convincing. The effects used on the film itself such as graininess, washed out lomo effect, and darkness in the right places, makes this a pleasure to watch.<br><br>The over-use of the f-bomb is a real factor. Men do talk exactly like that, but for a film less would have been more.<br><br>The politics of the mercenary world are shown brilliantly and without any sense of preachiness or one-sidedness.<br><br>Just an excellent movie.","user":"rtaron","rank":[31,44]},{"title":"A very British action drama","rating":8,"date":"1 November 2011","review":"As I watched this superb Ken Loach film I kept on being reminded of \"Get Carter\". It wasn't the storyline but the imagery, the characters, the acting, and the reasons why this film works so well. And the central idea, as in \"Get Carter\", is about seeking justice for something that has happened to someone close. <br><br>From the moment we observe the bereaved Rachel, played with uncanny realism by Andrea Lowe, walk up and symbolically thump Mark Womack's Fergus we know we are in for a tough and uncompromising movie. And, as the story unfolds, we observe Womack's troubled character go through so many transitions whilst being so convincingly set on obtaining a certain justice for his best mate Frankie (John Bishop).<br><br>And although there are complexities in unravelling who did what and to whom the basic story is very simple, so simple it tells itself right to the very end. There is no room for sentimentality in this film, no clear divide between the good and the bad, we are simply left to imagine what we might do in the same circumstances. If there is a moral to the story it is the price of justice and the cost of being a survivor when things go wrong for someone very close to you.<br><br>The acting across the board is of the highest standard but I will single out Andrea Lowe and Mark Womack for performances which are stunningly realistic, beautifully honed and so powerfully delivered. These two just hold you in their grasp whenever they are on screen.<br><br>It is not a film for everyone and the subject matter is very controversial but it achieves what it sets out to do. It makes you think about what you might do in the same situation, how far you might go, how guilty you might feel, and it does so without ever sensationalising what is going on.<br><br>I recommend it wholeheartedly to anyone who enjoys being immersed in intelligent films.","user":"perkypops","rank":[14,19]},{"title":"423rd Review: Passion overtakes Ken Loach - off-balanced but effective","rating":7,"date":"27 May 2011","review":"Ken Loach remains the British auteur. Route Irish while definitely not his best due to the off-script ad lib workshop style remains a powerful and relevant film. It would have been made into a big Hollywood thriller in the US going all the way up to the Senate and beyond, and this is the film's strength - it focuses on squaddies - simple soldiers - no big politics here - and the film gets its impact from that.<br><br>The plot of the man whose best friend joins up because of him then dies is mysterious circumstances in Iraq is a very strong plot - more so that most Loach films.<br><br>Set in Liverpool and Iraq the filming, the settings, the language, and even, in places the acting are crude and in your face - this is not Ae Fond Kiss or even The Wind That Shakes The Barley, this is an angry Ken, a Ken saying look this matters forget subtlety - let's just get it done.<br><br>The film is carried by Mark Womack who brings both skill as an actor and improviser and an unknown raw almost out of control energy that carries the themes and give the film its power.<br><br>All in all, while not Loach's best in terms of film, this should be his most powerful and relevant, but by opting for a crude and broad approach instead of some subtle in with the barrage - left this viewer numbed - some space and silences (Like all over Loach films have had magnificently) would have helped perhaps.<br><br>A visceral film but one that overpowers the viewer's emotions too much, one that while still very powerful doesn't linger as other Loach films have.","user":"intelearts","rank":[19,29]}]