[{"title":"Terrible waste of time","rating":1,"date":"1 July 2010","review":"The first 50 minutes of the film is girls talking and shouting at each other and montages of girls taking their clothes off, the closest thing to horror is that some girls go missing. Afterwards it descends into the usual group splits up and go missing 1 by 1. The ending is a huge slap in the face that makes you realise you just wasted your time watching it and makes the film pointless.<br><br>The \"Reality horror\" that it markets itself as is basically Jersey Shore in the woods. The \"characters\" (all the girls play their real life counterpart) are completely unlikable, which takes away what little suspense ever existed. The only reason you might want to watch this is because the girls get naked but considering you can find better stuff on the internet it's not worth wasting your time with this.","user":"iceflame7777","rank":[60,73]},{"title":"Well, OK, it IS a film (in the broadest sense).","rating":1,"date":"1 October 2011","review":"I did manage to sit through the whole thing. It had sound, moving images, some sort of plot, and characters.<br><br>I suppose I'm at the right age and of the right gender to enjoy this sort of thing...young alt women in various states of undress. But it didn't appeal to me at all. For one thing, these young women have particularly unattractive personalities. For another, contrary to what others have written, they're pretty plain-looking and not much of a turn-on, even nude and trying to pose seductively.<br><br>I think it really began to irritate me when four girls in a boat, even when equipped with a very nice paddle, couldn't seem to get their boat the last 100 feet to the shore. Nope...got to strip (literally) and swim to shore.<br><br>As for the final resolution and climax of the story, if you can't see it coming from a mile away, you don't watch many movies.<br><br>Better than \"Birdemic,\" but not by too much. Still, watchable in parts.","user":"innocuous","rank":[4,5]},{"title":"Not scary, but it is interesting...","rating":7,"date":"2 July 2010","review":"This movie is actually pretty interesting. Not just for the fact that there are semi (and fully) naked hot tattooed girls shooting a calendar in the movie. It takes a while for the movie to actually get interesting, but there are a few decent moments in it. These girls aren't acting though, this is an actual documentary and they were giving real reactions to what was happening as they all thought it was real. Throughout the film you tend to think \"WTF?\" quite a lot as there weren't actually any scary bits. If you want to be scared don't bother watching this movie, but if you want to see members of the Suicide Girls posing in front of the camera, running about with barely any clothes on and lots of drunken arguments this film is for you!","user":"i_am_ant1012","rank":[15,30]}]