[{"title":"nice movie to watch","rating":4,"date":"24 July 2013","review":"Well made film, nice directing, almost good acting, believable (and a little sick) romance, good suspense twists and turns throughout the film.<br><br>At the end of this film you will not say, \"who is going to give me back this time?\" Just don't expect the greatest movie ever made but a decent movie for its budget and maybe forget logic questions inconsistencies or plot holes.<br><br>During the movie the viewer grows feelings of sympathy for the loving couple.<br><br>Not very disturbing r rated.<br><br>Recommended time to watch: Monday night","user":"kostas6565","rank":[2,2]},{"title":"Good movie, horrible sound mix.","rating":6,"date":"6 July 2013","review":"A lot of reviews on Rotten Tomatoes have been railing on how bad the music is, I thought the music was fine. What was bad, actually, terrible, was the sound mix. My god, I haven't had to sit through a mix that bad in years. I never really thought a sound mix could ruin a movie so badly, but this one did. <br><br>As educated as movie critics like to think they are, they are usually clueless when it comes to how a film is actually put together and merely react in a knee jerk fashion to the easiest thing their little minds can grasp, in this case, the score. Don't get me wrong, the score was not spectacular (although I did like the theme music), but it was mixed in WAY too loud, so subtle stings were turned into ear-splitting shrieks. ALL of the sound effects were mixed in way too loud and ruined perspective/context. For instance, there's an establishing shot of an apartment building and way off in the distance there was the flashing lights from a helicopter, but the way the sound was mixed in, it sounded like it was about to land on top of the car that was pulling up. Why the hell would you mix something that is so distant and has absolutely nothing to do with the scene so loudly into the show? Unbelievable. Any scene that took place in the kitchen sounded like there were 30 pots of boiling water somewhere. There's also a scene where Haley is putting a bandage on Josh's forehead in the bathroom and it sounds like someone's filling a bathtub just out of frame... what the hell is that about? <br><br>Anyway, ABSOLUTELY HORRIBLE MIX aside, the acting was quite strong, particularly from Aidan Quinn and of course Beau Bridges is always good. Haley was pretty good through most of it as was Josh, though there were a few sections where their vibe seemed off. It feels like there were a few large scenes that were cut, so we're kind of missing why the characters mood have changed so much. <br><br>Overall I liked the story but it did feel like some of the connecting tissue was somehow missing and it feels like I was rushed through it. The Production Design and Cinematography are the stand outs in this film. The whole move looks great and it's nice to see an indie film that was still shot on 35mm instead of RED. All the sets look really good and I couldn't tell which was a built set and which was a location, which is pretty impressive!<br><br>All-in-all, I think it's a film worth seeing (I saw it at the Chinese Theatre in LA) but man, that mix will pretty much ruin most people's enjoyment of the film.","user":"Z32","rank":[8,15]},{"title":"Excellent guy movie","rating":9,"date":"25 February 2014","review":"I was very surprised after watching this movie. I really was not expecting it to be as good as it was, being that it did not make it to the big screens. Even if the critics were to tear it to pieces, much worse films make it to the big screens every week. I can definitely recommended it as a very enjoyable \"Guy flick\". It's got a good fair share of action for a thriller. It may not be a \"Chick flick\" but it has a sufficient amount of romance to make a good date movie. Over all the acting was great. The Plot has it's twist and turns to keep you from getting bored from predictability, which is the norm for most thrillers. If I was to find one thing to pick at. Maybe they could have cut the segment and story relating to the whipping scene. Was not very believable as the type of reaction you would expect from the main character. Maybe they wanted to show some extra skin. However it's a sure entertaining movie.","user":"badttboy","rank":[3,4]}]