[{"title":"I really enjoyed this movie..","rating":3,"date":"3 October 2013","review":"I love Sam Rockwell. He picks great projects and this no exception. This is not a fast paced feature but I story I really enjoyed. Maintained a great tension and foreboding throughout which I really enjoy in a film. This is a simple story with some great twists and turns. Starts out slow like a slow burn and then ramps up quickly. This story is believable and has no real holes in it. It's a story you can relate to in that it seems very plausible and believable. You feel the characters fear and tension with the situation he finds himself in. This is a slow paced thriller that is well filmed and the performances are excellent.","user":"scottibailey-997-291611","rank":[52,64]},{"title":"An exquisitely dark, rural, all-American series noir.","rating":9,"date":"10 April 2014","review":"This is an exquisitely dark, rural, all-American series noir. Plot line and moral being: a good man goes bad, because that's the way things can be, the way things are. Nature -- human or otherwise, isn't kind. Mistakes happen. And you often pay for them in the wilderness of this world we live in alone and altogether. Chance has its way of crushing you, burying you alive. Watch out. Plus, aside from a potent story line, the acting is downright first rate. Not a single one of the actors are off key. I don't know who did the casting for \"A Single Shot\", but they deserve an award for it. Also exquisite in this film is the ending -- one of the most original examples of \"open ended\" I've ever seen in a film. You've got to be in a dark, worried mood to like this film; its darkness is relentless. \"A Single Shot\" is not for everyone; in no way is it \"G\" or \"GP\". But for thoughtful adults it is very well worth the watching.","user":"jdeureka","rank":[26,33]},{"title":"A serious and dark movie","rating":8,"date":"21 September 2013","review":"This is a serious movie for serious viewers. Sam Rockwell gives a convincing performance as John Moon, a West Virginia cracker who stumbles into bad luck from the opening seen. All of the characters bring to life what it's probably like to live in a rural, poor area in flyover country. The accents of the characters are often thick, which can make it difficult to understand some of the dialog, but the plot nonetheless comes through clearly. Rockwell's character progresses from being a dumb cracker to someone you care about, as the tension builds towards a final resolution of his accidental and potentially deadly predicament. The acting and direction are first rate. The cinematography fits the story; the musical score does likewise. The story is dark, in a Jack London sort of way. You won't be inspired, but you might be brought closer in touch with the human condition.","user":"scott1953","rank":[45,61]}]