[{"title":"Him and Her – At their best when they're together","rating":8,"date":"20 December 2013","review":"When this intriguing and original film was first screened at the Toronto International Film Festival on September 9, it surprisingly didn't have a release date. Fortunately, The Globe and Mail reports that less than 24 hours after viewing its Toronto screening, distributor Harvey Weinstein scooped it up. And that's a very good thing — no one should have to miss out on this clever and creative story-telling.<br><br>Imagine, for a second, that a friend comes to tell you about his terrible break-up. You hear about how hurt he is and how devastatingly it ended, and you feel for him 100 per cent. But then a few days later, you happen to run into his ex and you hear her side of the story. Suddenly, the break-up doesn't seem so clear. Who's \"at fault\" is murky, and what really brought the relationship to a close is a complex and intricate issue. That's precisely the mystery that Ned Benson brings to us in his new film, The Disappearance of Eleanor Rigby: Him and Her. Rather than simply showing the complex issues of a marriage from one character's point of view, Benson created two separate but united films — one told from the point of view of the husband, and the second from that of the wife. Not only does Benson tackle the issue of perspective — but he also weaves in the subject of memory. What might initially seem like continuity errors between the two halves are quickly revealed to have far more significance and ultimately tell an equally affecting tale. Some differences are subtle, while some are striking — but all showcase how our perspectives subjective, but so too are our memories.<br><br>At the beginning of the movie, the lively and upbeat Conor (James McAvoy) and Eleanor (Jessica Chastain) are in a quickly disintegrating marriage. What follows are the stories of how each of them got to where they are, as individuals and as a couple, and where they hope to go. McAvoy and Chastain have proved themselves to be brilliant actors in their own rights — and, if you can believe it, they're even more dynamic and captivating together. Their deep understanding of the story paired with their commitment to the roles and intense chemistry makes this story enthralling to watch from beginning to end.<br><br>The one aspect that may have made it harder for this exceptional film to get a wide release is its length. Since it's essentially two separate films, it has a running time of three hours and ten minutes — and not everyone has the patience required. To combat this challenge, The Globe and Mail notes there has been some talk of showing the films each on their own rather than as a combined unit. Although the performances are spectacular, the writing compelling, and the direction well done in each film, it seems to me that a lot of the brilliance of the film's structure would be lost without the two parts together. It's the clever balancing act between the two perspectives and the way they address how much we can trust our memories that make The Disappearance of Eleanor Rigby: Him and Her so unique and captivating. If you were to take away the \"Him and Her\" in favour of one pronoun or the other, I feel you would lose a great deal of what makes the film special. It might be a longer haul as far as romantic dramas go, but I beg you to grab your popcorn — and a sizeable coffee if necessary — and settle in for the full three hours. This powerful and invigorating tale is worth the time.","user":"jul-kinnear","rank":[57,63]},{"title":"Excellent study on memory and perception","rating":9,"date":"15 September 2013","review":"In this review I'm gonna make sure I say everything I didn't say in the previous review. First of all, I find that it becomes easier to find good things about this movie, and harder to find things wrong with this movie, the more i reflect upon the film. Also, I found that this half of the film was the weaker half.<br><br>Most of Her was great just like Him. The acting was spectacular (especially Viola Davis), and there was the same great writing and directing. I found that Her was slightly worse than Him, for a couple reasons. First of all, I thought Him was funnier, and I found that it had a bit better music. Secondly, I found that Him resolved it's subplots better, and had a more interesting main plot. My main problem with the film though, is that I watched it immediately after watching Him. This is a problem firstly because, I started to become bored three- quarters of the way into Her, but that's because I had been watching the film for 2 hours and 45 minuets.<br><br>Another interesting fact about the movie is that in Him, the husband seems to be in the right with the wife being in the wrong, and in Her, it is the other way around. This means that since I watched Him first, I liked Her a bit less. It could be very possible that if you watched Her first, you would like it better than Him. That point brings me to one of the best factors of the movie, which is even the scenes that were the same in each part, were different in each part. Think of this movie as two people going through a divorce. Him is the husband's side in the divorce, and Her is the wife's side. When the husband tells his story, he leaves out key pieces of information, lying by omission to make him self look better. When we hear the woman's side of the story, we hear about all the things that the man did wrong, but the woman also lies by omission to make herself look better. In the two parts of the film, when we do see scenes that are in both parts of the film, there are subtly changes in the dialogue, showing that there are two sides to every story, two perceptions to every event, and two truths in every situation.<br><br>Both parts of this movie are truly spectacular achievements in film making, and I feel sorry for you if you do not end up thinking this is a good movie. Again, I highly recommend watching both parts of the film in theaters, as it is an unforgettable experience. Both these films a strong individually, but even more so together, which makes it harder to give each film an individual rating. This is an 8.5/10 star film, that I am happy to have got to see at TIFF.","user":"jdj2122","rank":[13,16]},{"title":"I am not the target audience for this kind of tripe.","rating":16,"date":"16 February 2015","review":"This review is for both the HIM and HER versions of the movie. please note this is just one guy's opinion.. My friend who I watched the movie with loved it.. unfortunately, I did not have the same experience.<br><br>THE GOOD: <br><br>1. The acting, except for Jessica Chastain's performance, is good and all of the actors did their jobs well considering the script. Jess Weixler as the sister did exceptionally well for such a small part. She carried all the scenes in which she appears. <br><br>2. Sound and editing. I could hear and understand all of the dialog spoken. The transitions between scenes and the flow of the storytelling felt very natural. <br><br>THE BAD: <br><br>1. The story &amp; dialog felt very contrived &amp; pretentious. A couple deals with the death of their infant son and their relationship breaks down afterward. This is the root of the story but the way these characters deal with such a tragedy is what I found to be so contrived.<br><br>For example: James McAvoy's Character Conor has a pet goldfish \"Ralph\" and it dies when his Dad accidentally overfeeds or feeds it the wrong food. The two men have a \"heart to heart\" talk during a walk to the river to dispose of Ralph's corpse, which is in a little cardboard box, by throwing it in the river. seriously, who would do that? would you do that?<br><br>another example is a scene where the two main characters are sitting on the sidewalk having a normal discussion about their relationship troubles which is only very odd considering the circumstances that one of them just got hit by a car and The Rescue personal which is clearly there for the whole discussion appear to be just standing around off screen waiting for them to finish the conversation before they load him into the ambulance.<br><br>There are many more moments like these and it may seem trivia and unimportant to some but for me it is this lack of attention to details that break the story. <br><br>2. The cinema photography is too dark in quite a few scenes and the soft blue color correction tint used is an interesting choice and will probably not be a problem for most people but i found it distracting. It took me out of the movie viewing experience just by the fact that I noticed it. <br><br>3. Jessica Chastain.. Her acting or her character in this movie rubbed me the wrong way.. i found it wooden. She was unable to emote in a believable manner.. I did not like or sympathize with her character at all but i am not sure whether it is her performance or the way her character is written.. maybe we are not suppose to like her and the fact that her character has difficulty expressing emotion could be intentional.. if so mission accomplished.<br><br>4.The relationship between the two main characters is strange from the beginning and why in the world the main guy would want to stay with a such a flaky, cold and emotional distant person is beyond me.<br><br>I watched both movies back to back. The HIM version first and then HER. I liked HIM better than HER but overall hated THEM both. Mediocrity at its best and a complete waste of time unless you are a film maker or screenwriter looking to learn from someone else's mistakes.<br><br>side note: watch THE ACCIDENTAL TOURIST instead which also stars William Hurt and contains the very same subject matter of a couple that deals with the loss of their son and the break-up of their marriage.","user":"glowinthedarkscars","rank":[8,10]}]