[{"title":"What a beautiful little film","rating":8,"date":"1 February 2015","review":"I don't recall ever hearing about this movie. Perhaps it was too steeped in 60's attitude for today's audiences. If so that is truly a shame because that probably means today's young people are too far removed from the era to understand it well. In today's world that is a great loss. If we could live as hippies attempted to back then, we'd be far closer to mitigating climate change than we are now and a large part of that lifestyle was the attitude. This movie captures that attitude beautifully.<br><br>Laura Ramsey as Angela, the young hippie step-mother, brought back memories for me about women who actually existed in those years, who would float through life elevating everyone around them like some magical earthbound angel. I suppose nowadays she seems implausible. But back then she was very possible and meeting someone like her was unforgettable. Ms Ramsey's depiction captures the type in a way I haven't seen done in a very long time. It was a pleasure to reacquaint myself with the woman she represents. In a lot of ways those flower children were more affecting than anyone I've met since.<br><br>The idea of the film apparently is to bring some of that ethos into the present. The two main leads, Owen Wilson and Zach Galifianakis, have no problem evoking the era and they do a splendid job. I thought both brought the right mix of humor and pathology to their parts. They seemed to understand what the movie was trying to convey, and they were quite successful for people like me. What's surprising is that younger people apparently don't get it and I don't quite understand why they wouldn't.<br><br>Amy Poehler is also in the movie but in an unattractive role. I still appreciated her contribution to the mix in what seemed like a risky departure from her usual performance.<br><br>The story revolves around two friends, pretty much drifting through life who end up supporting each other through the trauma of having one's well-off father die. That death spurs them both to grow up a bit though the transition is not easy for them. The movie is set in farm country where Amish live and coincidentally I live in that sort of country myself. It was actually a bit of a treat to see them carry on in such a setting.<br><br>I enjoyed the movie very much, understand its point completely and am really bummed to find out that very few others enjoyed it. I would recommend it to anyone familiar with that era (it's actually set in the present) and not hostile to it. Believe me from my point of view it is far more your loss than mine that this movie wasn't as praised as it should have been.","user":"socrates99","rank":[36,44]},{"title":"Started as one thing, ended as another","rating":4,"date":"26 August 2014","review":"I found this movie leaving a bad taste in my mouth... It started out as a typical 'Zach stoned out of his mind funny' type of thing, and turned into it trying to teach me something about mental illness, but doing it in the poorest way possible.<br><br>Also, just a side note, I think it is the first time I have ever seen Owen Wilson pick up a stoner role. That's just me. I found it weird watching him smoke up on the couch watching cartoons.<br><br>It was amusing for the first while, but it ended with a 'what the hell did I just watch' feeling.<br><br>They introduced mental illness into the story line, a reason for Zach being nuts, and they solved it basically by getting him to shave his beard off. Now, I understand that that shows a drastic change, but they didn't follow it with anything.. Just watch it, it'll make you mad as well.<br><br>Overall, not really worth the two hours unless you have nothing better to watch. Or if you absolutely love Zach (however you spell his last name) or Owen Wilson, and are dedicated to watching everything they put out.","user":"shaitan_lives","rank":[52,81]},{"title":"profound, but bizarrely cast","rating":8,"date":"8 October 2014","review":"If this had an unknown cast and a different director this would have been an award winning film about the difficulty of finding meaning in our lives.<br><br>It starts a little slowly with the main character (weather man) who is a womaniser and seems to be happy, and who also helps his bipolar friend who is struggling to find meaning in his life. However, ultimately find that it is the weather reporter who is searching for meaning in his life - and he finally breaks down when his bipolar friend begins to develop a life on his own.<br><br>The film contains quite profound comments (subtle inferences) on what it is to be crazy (and if belief in God is crazy); how relationships can be sexual and caring, but without being about becoming a couple; vegetarianism; living within the modern world or finding meaning in returning to a simpler way of life.<br><br>So - the film sounds arty and profound. Except it isn't produced in that way. It is directed like a Hollywood movie, indeed a Hollywood comedy. This mismatch between the complexity of some scenes and some of the plot, and the characters/actors and filming style are probably what disappointed many viewers. Personally, I loved it and put it in the same league as 'the way way back' but a bit more bizarre.<br><br>In summary - a great script and good film, with odd casting and presented as a comedy, which it isn't. Will be disappointing if you want something pure Hollywood, but will be engaging if you like sentimental and deep films that make you think, but are not pretentious (indeed - I wonder if it was done purposely like this in an effort to take out all the pretentiousness and make it seem like a light film).","user":"ian-dodkins","rank":[19,27]}]