[{"title":"What genre movie is this? I'm not sure, but watch it for the acting","rating":7,"date":"18 December 2011","review":"This is a flawed but still watchable film that seems to steal characters and plot from the Coen Brothers' Fargo, yet manages to succeed. At least to an extent.<br><br>The problem may be - as we were told at our cinema previewing club - that the director lost final cut here, and found herself with a movie she no longer can even comment on, with 15 minutes cut, the film re-edited, and a score she never intended - and one that doesn't work well.<br><br>The result is a somewhat uneven, too dark black comedy. Or is it a drama? Or perhaps a \"caper\" movie? I'm not quite sure.<br><br>When it comes to the acting, though, this is a great film. Greg Kinnear plays a character too reminiscent of Wm. H. Macy's turn in Fargo, but he makes the most of it, though - team player that he is - he's outshone by more spectacular performances. Alan Arkin, for one, who also did it to Kinnear in Little Miss Sunshine. But the \"steal the show\" performance is by Billy Crudup, always sexy (my wife says he's \"hot\") and interesting to watch, and here at his very best. Bob Balaban is spot on as a violin dealer, and the rest of the cast is excellent.<br><br>Worth seeing for many, but mostly for those performances.","user":"richard-1967","rank":[39,43]},{"title":"loads of late twists help this slightly above average fargo-esque flick","rating":7,"date":"14 July 2012","review":"\"Thin Ice\", much like Fargo, is a murder-story set in a snowy-midwestern town. The lead character is an immoral salesmen who's life is literally falling apart around him.<br><br>The good news is that \"Thin Ice\" provides the audience with an even-more-twisty-tale. The performances are steady across the board. Now, I'm not saying this is as good or better than Fargo, IT'S NOT! But, it's a good movie.<br><br>The twists in the last 30 minutes are hefty and hard to scrutinize. There are a few aspects of the plot that were a little predictable, but for the most part the twists in the end were well-concealed and somewhat believable.<br><br>The film moves fairly slow, but never came off to me as boring. It doesn't really have any style to speak of, and the other director elements are nothing special. Greg Kinnear, Alan Arkin, and Billy Crudip do a fine job with an average script that is completely void of comedic moments(style and comedy were two of Fargo's strengths).<br><br>The plot twists in the last third of the film DO set this one apart, and while the film DOES lack style and comedy, the acting helps keep it afloat.<br><br>I'd say this deserves a bit higher ranking than it's current 6.1 here, but it also isn't something that you should feel the need to move up to the top of your list.<br><br>A Coen Brothers story without some of the Coen Bro's trademarks.<br><br>I'm stuck between 6 and 7 here at 65/100, but rounding up and taking into consideration the low 6.1 score.<br><br>You might like this if you liked: American Gun(not as good), Fargo(better), Burn After Reading(about even), and Millions(not as good).","user":"witster18","rank":[12,12]},{"title":"A Great Con Movie - Done Midwestern Style","rating":8,"date":"26 January 2011","review":"The swindle, the bamboozle, the big Con. A favorite subject for filmmakers for nearly a century now. The game is basically always the same, but the players are what makes for a great con movie. \"Thin Ice\" (previously titled at Sundance 2011 as \"The Convincer\") goes white-collar crime, the legal kind, just look in your phone book and you might find your own convincer, the local Insurance salesman.<br><br>\"Thin Ice\" directed by Jill Sprecher, is Sprecher's return to feature films after her well received \"Thirteen Conversations About One Thing\". Alan Arkin, returns to team up again with Sprecher and is joined on screen with \"Little Miss Sunshine\" cohort Greg Kinnear to create a thoroughly enjoyable tale of Midwestern simplicity and the everyday Con man with a silver tongue. An old man with an unfathomably rare violin crosses paths with an insurance salesman at the end of his rope, what unfolds across the frozen terrain of Wisconsin is a wonderful bit of storytelling The film has a solid cast of players, alongside Kinnear and Arkin, Billy Cudrup has a solid little role. David Harbour delivers a gem of a performance and the fantastic Bob Balaban is always a welcome addition to any movie.<br><br>Much of the effectiveness of the movie, which could easily have been a rehash of all the movies before it, is in its Midwestern point of view and ability take your average insurance man and peel away the layers to observe how the art of lying creates a life of constant deceit that will eventually take it's toll. Mickey the insurance man(Kinnear) trolls 24/7 for a mark to give his sales pitch, but when he crosses paths with the simple farmer Gorvy the amount of deceit he will need to get the big payday pushes him to cross even lines he never dreamt of going.<br><br>A unusual relationship forms between the insurance man and the farmer, as Mickey is forced into a role of caregiver as he circles the rare violin in hopes of selling it for big money. \"Thin Ice\" unfolds through these series of encounters between Mickey and Gorvey and tension builds at a detailed pace towards Mickey's eventual ultimate deceit. Mickey's life is falling apart around him, ultimately their is no back-up plan, at any and all costs his existence is tied to the old man and the violin.<br><br>The film maintains a steady pace, each detail is thoroughly absorbed and clearly never losing sight that its all building up to, not if, but when Mickey will cross the line from white-collar liar to criminal. Although \"Thin Ice\" is a fascinating take on the relationship between a simple Midwest farmer and convincing insurance man, it is foremost a story of the consequences of lying and when those lies will come back to haunt you.<br><br>Thus the story takes a dramatic turn as Mickey unwillingly teams with a local ex-convict locksmith(Billy Cudrup) to break into Gorvy's home to get his prize violin. Things don't go at all as planned and soon Mickey is dealing with a whole nother type of crime. The killing kind. What unfolds through the second half of the movie is a masterful touch of high tension and bumbling amateur criminal misbehaving.<br><br>Though the film will undoubtedly be compared to a few other con movies, Fargo comes to mind though that's primarily just scenery correlation, \"Thin Ice\" is very much original. The strength of this film is the wonderfully acted script that is sharp and nearly without flaw. The movie could not have had better pieces then Kinnear and Arkin who are brilliantly matched and thoughtfully reminiscent of their real life counterparts.<br><br>This thoroughly engaging and captivating little tale works from beginning to end. If one were to focus on possible weaknesses it would only be that true to it's Midwestern stylings its not overly flashy Nor particularly gritty compared to slicker studio productions. That being said \"Thin Ice\" is completely its own film and gives very little to dislike.","user":"sundevil27","rank":[22,27]}]