[{"title":"There's Something Missing Here...","rating":6,"date":"13 December 2011","review":"I must admit, going into this film, I was rather excited; I've enjoyed both of David Cronenberg and Viggo Mortensen's previous collaborations and my interest in both Freudian psychology/psychoanalysis and Michael Fassbender practically guaranteed that I would be seeing this film. I fear now, however, that my expectations may have been a bit too high. <br><br>I must admit, however, that I thought that Michael Fassbender and Viggo Mortensen played their roles very well, although Mortensen definitely didn't receive as much screen time as he deserved. Vincent Cassel definitely shone in his extended cameo as Otto Gross. I did have some issues with Keira Knightly's acting, however. I feel like she may have over exaggerated her actions, particularly in the beginning scenes where she is in the midst of hysteria.<br><br>However, my real problem with this film is that, for lack of a better term, it all seems a little too shallow. Events that should be important are skimmed over and not explained; to be honest, it doesn't particularly seem like anything of real importance happens in the film. The characters have little depth; despite the fact that they are all playing rather well known persons, there simply isn't anything to them other than a name. On top of this, despite what the taglines of the film and trailer seem to suggest, the relationship between Freud and Jung is hardly explored. For the most part, their scenes involve reading letters from the other. This is hardly compelling viewing. <br><br>Overall, I feel like this film would have been better if it had been longer. If the film had a running time of even two hours, compared to one and a half, more character development could have been inserted, particularly for Freud. In addition, more focus on Jung's relationship with Freud, rather than his relationship with Spielrein, would have been nice to see. <br><br>Here's hoping that any future collaborations between Cronenberg and Mortensen pack a bit more of a punch.","user":"kkhannah","rank":[238,267]},{"title":"a great idea. idea.","rating":6,"date":"18 December 2012","review":"This started very well, great cast, landscapes, scenography, characters etc. I loved the idea of to greatest psychology minds working together on improving therapy methods and changing the approach to curing people of their traumas and problems. Where i find the movie failed a bit is the story where the connections in the scenes are bit off. I got the feeling that it was jumping trough periods without any connection which i could put together. It seemed like there were years in gaps between couple of scenes where there wasn't any. Even if this followed only true life events of Jung and Freud it still leaves us with wanting more then just few dialogs and scratch on the surface of psychology treatments. Kinsey (2004) is a movie which is a good parallel example how a movie about similar subject can be and can be done brilliantly. Maybe movies about lives of both Jung and Freud are in order. So, all in all, i enjoyed watching it, everyone did a great job and gives you a good feeling after, it has minor gaps in the story which doesn't make you stick to the chair but definitely recommend it to everyone.","user":"georgemilojevic","rank":[26,28]},{"title":"Intriguing","rating":7,"date":"27 December 2011","review":"I've only read very few of Jung's and Freud's abstracts of work but i've always been interested in knowing a bit more. A Dangerous Method cleared some of my questions and was pleasant for me to watch and learn a thing or two about their contributions and contradictions in psycho-analysis.<br><br>What is emphasized in this film is their well known \"disagreement\" on sexual activity (libido) and apparently religion. Something that's been brought here by a female patient of Jung, Sabina Spielrein -played by Keira Knightley, who's been diagnosed with hysteria and was admitted to Burghölzli Clinic in Zürich in 1906. Michael Fassbender (Jung) and Viggo Mortensen (Freud) both performed seriously and insightful and Knightley captured pretty well the behavior of a hysteric person and then, her transition through therapy.<br><br>The German locations where the filming took place were picturesque and the atmosphere was warm, theatrical, peaceful enough but rather slow at some points. The intense relationship between the Austrian neurologist and the Swiss psychiatrist was very interesting to watch nevertheless.<br><br>The reason i enjoyed this film is simple: It was exactly what i was expecting it to be. Educational. And the fact that a talented cast did their best to bring out on the screen such facts, has left me a satisfied watcher full of interest and food for thoughts.","user":"synevy","rank":[92,114]}]