[{"title":"Beautifully crafted black comedy","rating":9,"date":"14 May 2012","review":"The Dexter series has paved the way nicely for some modern anti-heroes. It's OK to be a serial killer provided the people you kill are not nice people. The worse the crime, the more acceptable (on screen) it is to kill the criminal and the less guilty we can feel about enjoying the spectacle of their death.<br><br>So Some Guy Who Kills People rides along on similar rails and gives us someone we can both root for, be afraid of and concerned about all in one highly confusing package.<br><br>Kevin Corrigan plays unorthodox Ken Boyd, a depressive cartoonist recently released from the 'loony bin' into a world he doesn't understand. Clearly resident in the kind of small town community where everyone knows everyone else, Boyd lives with his sardonic mother (Karen Black) and works the only job he can get: slopping out ice cream at the local diner.<br><br>Ken keeps his head down and his mouth shut, but life has a way of intruding on his self-imposed cocoon in the form of his best friend Irv's unyielding encouragement to get out there and grab the bull by the horns, the attentions of beautiful English girl Stephanie (Lucy Davis) and Ken's long absent daughter of eleven years, Amy. This trio of distractions are merciless in their presence, drawing Ken away from his preferred mode of introspection and silence.<br><br>Character development is awesome, with young Ariel Gade hitting just the right level of chatty pre-teen and needy daughter vs vulnerable sweet kid and mini-charmer to win us over rather than put us off. Corrigan is effortlessly charismatic despite his apparent predilection for decapitating his enemies, and his rarity of lines (despite his presence in most scenes). Lucy Davis is a little too attractive and besotted to be believable, particularly as the first time she encounters Ken he is dressed up in a most unbecoming giant ice-cream costume. Davis also has a limited acting range, giving the same performance here as she gave in The Office and other American projects of late.<br><br>But Barry Bostwick is simply sublime as the eminently watchable Sheriff Walt Fuller and Karen Black puts in a great performance as the disillusioned chain-smoking mother with only the lowest expectations in her son.<br><br>Ultimately a moral warning about the perils of withdrawing and allowing the past to consume the present; thus missing out on the important things (like the parent/child relationship) Some Guy Who Kills People is a thought-provoking, beautifully crafted tale from beginning to end featuring some of the most comically subtle black humour you're ever likely to see on the big screen. You'll laugh, but you'll also hover on the edge of your seat. Mixing comedy with genuine drama is no mean feat and full credit should go to Perez, Levin and their wonderful cast for pulling it off with unparalleled aplomb.","user":"chaugnurfaugn-269-83012","rank":[31,35]},{"title":"Best New Horror Film?","rating":8,"date":"25 June 2012","review":"Ken Boyd (Kevin Corrigan), a lonely man fresh out of the loony bin, sets out to kill those he deems responsible for his miserable life.<br><br>Since I did not know most of the people attached to this (besides Karen Black and executive producer John Landis), I did not know what to expect. I set my sights low, and came out with quite an impressed mind. This is not your typical slasher. It is oddly endearing and has just enough comedy and plot twists to really keep the audience interested.<br><br>Kevin Corrigan is superb, Barry Bostwick even better... but, of course, we must salute Ariel Gade in this breakout performance. She adeptly portrays the precocious 11-year old Amy, and is both likable and a good plot-carrier. Gade, even more than Corrigan, keeps the story going.<br><br>I have not yet checked out the special features, but would like to. I think they would greatly enhance my understanding and appreciation for this already pleasantly-surprisingly gem.","user":"gavin6942","rank":[21,24]},{"title":"Good Film with Bad Title","rating":7,"date":"20 July 2012","review":"This has to be the worst title the producers could possibly have come up with; someone must have lost a bet. It's a shame because it is really good and very few people will ever see it, unless the word of mouth helps, as happened with Boondock Saints. I reluctantly watched that and ended up loving it.<br><br>Ken works at an ice cream parlor after being released from a mental hospital. He has nightmares of a hazing type of attack from his high school days. One by one the classmates responsible die horrible deaths. Barry Bostwick is the town sheriff, and he is wise ass who is having a good time with Ken's mother played by Karen Black. She and Bostwick are terrific and sarcastically funny throughout. Ariel Gade is Ken's daughter Amy, and she is an actress to watch out for. The chemistry between her and Kevin Corrigan as Ken, her father, are totally believable. The girl is an absolute natural; never mugging for the camera, as many child actors have a tendency to do.<br><br>Ken is an outcast living with his mother and spending his spare time drawing sketches. His daughter finds out that he is her biological father and they have an awkward reunion. This is a murder mystery, a comedy, and a sporadically violent family film, all at the same time. Although a bit confused, the acting is so good, I was able to accept some plot holes along the way. Bostwick and Black are funny as hell, and the young Ariel Gade still manages to steal the picture, her potential is unlimited. Ignore the ridiculous title and trust me; try it, you'll like it.","user":"billcr12","rank":[16,18]}]