[{"title":"Powerful, graphic, unsettling movie with a profound message of hope and human courage shown in adversity","rating":2,"date":"2 November 2011","review":"I went into this movie with no expectations. The title made it seem like it would be a typical action movie; all guns and brawn and little in the way of storyline but boy was I wrong. This movie, based on a true story, was powerful and touched me so much that it has prompted me to write my first film review on IMDb in over six years! This is a movie with a solid pedigree of cast behind it, it is based on the life of Sam Childers (Gerard Butler), who without giving much away, has a criminal past, finds God and embarks on undertaking missionary work in civil war-torn Sudan, leaving his loyal, loving wife Lynn Childers (Michelle Monaghan) and his young daughter Paige (Madeline Carrol) back home in Penslyvania. This movie follows Sam's juggling how his Christian faith inspires him at home and also in Sudan.<br><br>Gerard Butler has always been something of an enigma to me. In my opinion he can be hit and miss as an actor, but in this movie he gives a powerhouse performance as the emotionally conflicted and stunted Sam Cilders, someone who follows his faith and shows simple, sometimes primal humanity in inhumane foreign environments. I think this is Gerard Butlers best performance to date, he expertly immerses himself into Sam , he is so believable in this role, both emotionally, mentally and physically. The audience may find it hard to remember it is just a movie at some stages. Michael Shannon is amazing a Sam's childhood friend Donnie, a troubled soul who is another person loyal to Sam but ultimately flawed.<br><br>This is not a movie I feel will get the awards it richly deserves. Similar in tone to Hotel Rwanda, it is an inspiring story but with a sobering message. It reminded me a lot of Hotel Rwanda because it showed how one man alone with enough faith in simple humanity can make a difference. Sam Childers is not a saint; far from it, he is flawed and he has a violent and criminal side and this is evident in the movie. However he is also shown as having humanity and the fact that he decides to make a stand and do something away from the comfort of his armchair in America is testament to his character. Would the audience have the courage to do what Sam did? That is a question facing the audience as they leave the movie, along with the graphic images which will haunt the audience for a long time after seeing the movie.<br><br>There are so many powerful moments in this movie that it is hard to pin point any without spoiling the plot. This is not a movie that you should take a date along to; or anyone who is squeamish or unsettled by blood and guts. This is a movie that takes the audience in the palm of their hands and opens their eyes to the blunt reality and the truth of genocide. It is similar in that way to Hotel Rwanda but I found this movie even more graphic and unsettling in many ways. This is a movie you should watch at all costs although you may not want to see it again. It is hard hitting, powerful, emotional but most of all thought provoking.","user":"jameslamont","rank":[135,164]},{"title":"machine gun","rating":9,"date":"2 March 2012","review":"I m not a usual review writer of any kind but i especially register for IMDb to write about this movie. After watching the movie and checking the IMDb rate i must say it is highly underestimated and i was forced to make a statement.<br><br>i would recommend this movie. it leaves you thinking not only about the characters itself but also about the issue of the movie. I myself spend hours of researching about the problems which are shown in the movie.<br><br>i find the characters very appealing although at some point i thought it could be portrayed better than it was actually done.<br><br>Overall it is a really good movie and worth a watch.","user":"khan-behroz","rank":[58,74]},{"title":"Fantastic but Unfortunately not Well Known Biography","rating":8,"date":"21 April 2012","review":"In Pittsburgh, Pennsylvania, the addicted gang biker Sam Childers (Gerard Butler) is released from prison and learns that his wife Lynn Childers (Michelle Monaghan) is no longer a striper and has converted to Christianity. One night, Sam and his best friend Donnie (Michael Shannon) give a ride to a hitchhiker that threatens Donnie with a pocketknife; however Sam reacts and stabs the stranger and dumps him on the road.<br><br>Sam is affected by the incident and is convinced by Lynn and his mother Daisy (Kathy Baker) to join their church and he is baptized. Sam finds a straight job in construction. He is well succeeded and when he meets a preacher from Africa, he decides to visit the continent. Sam travels to Northern Uganda and South Sudan many times and builds an orphanage for the victims of the cruel Lord's Resistance Army (LRA). Further, he fights whenever necessary and becomes a legend known as The Machine Gun Preacher.<br><br>\"Machine Gun Preacher\" is a film tailored to Gerard Buttler about the fantastic but unfortunately not well known biography of Sam Childers, an addicted troublemaker drug-dealer biker that changes totally his life and becomes the only hope for thousand of orphans in Africa. <br><br>The story and the screenplay are engaging with a perfect combination of drama and action. The only thing that irritates me is douchbags that write that this film like is a Christian propaganda. This is a true story and can be found everywhere in Internet and has nothing to do with propaganda, but reality and redemption. My vote is eight.<br><br>Title (Brazil): \"Redenção\" (\"Redemption\")","user":"claudio_carvalho","rank":[46,59]}]