[{"title":"Step up Dad","rating":7,"date":"12 June 2016","review":"This is actually pretty funny. It's not the most sophisticated comedy, but you should know that even before watching this. Mark Wahlberg showing off his perks ... I mean comedic talents again. Also his muscles yes (for those who care). There are quite a few jokes that go below the belt (even literally), but it's all kept pretty light, if you don't mind that direction in general.<br><br>Will Ferrell and Mark Wahlberg have lots of fun, playing off each other and being \"enemies\". The ending kind of could be seen as a \"things to come\" kind of thing, which might ring true, with Part 2 already announced (though the movie as I know did not make that much business in Germany at least). Still you get what the box/cover promises after all, so why complain?","user":"kosmasp","rank":[23,30]},{"title":"Some giggles, but pretty formulaic","rating":4,"date":"4 June 2016","review":"I have to confess that for the most part, Will Ferrell kind of mystifies me; I don't see what makes him so popular with the mass public. Still, I have to confess that in \"Daddy's Home\", he tones it down so he isn't strident like he is in other movies. In fact, he does end up having some charm and likability, and paired up with Mark Wahlberg (another actor who usually doesn't impress me), some genuine chemistry is generated. Also, director Sean Anders wisely lessens the raunch factor that is usually high in in the two stars' other movie; there is an easy-going feeling instead that is quite palatable, a feeling that does sneak up on you and does tickle your funny bone on occasion. However, in the end there are not quite enough laughs to make me give it a recommendation. As I said in my summary line, the movie is quite formulaic; you can really predict what will happen before it actually happens throughout. Since there are no surprises, it becomes very difficult for the movie to pull the rug out under the audience and generate laughs. There are many comedies that are much worse than this, I admit, but in the end it's only a movie to watch when something else in your home is asking for your primary attention.","user":"Wizard-8","rank":[16,22]},{"title":"Another Typical Comedy where all the Good Parts are in the Trailer,","rating":3,"date":"7 February 2016","review":"Daddy's Home is an awful movie with a very poorly developed storyline that is all a set up for poor jokes, and an impressive comedic cast that all just felt wasted. There are some funny parts in it, but sadly those parts were also in the trailer, so we are left with good bits that are no longer funny cause we've seen them all already, and a ton of lame, immature jokes such as watching Will Ferrell get electrocuted or a ridiculous dance off between Mark Wahlberg and Bill Burr. Ferrell and Wahlberg really weren't the stars of this movie because any chemistry that the two certainly have is thrown away with poor development, as well as the fact that both of their characters are unlikeable, it was hard to tell who we were suppose to root for, neither of them was really an antagonist or protagonist. The only two people who really seemed to enjoy being a part of this movie were Thomas Haden Church and Hannibal Buress, they did have me genuinely laughing in their scenes, and for the time they're on screen we can forget about how poor, unfunny, poorly edited and regretful this movie is. Lacking energy, heart and original comedy, Daddy's Home kills any potential it has, and you would be much better off avoiding it. <br><br>Brad finally gets the two children of his wife to look up to him as a father figure, but all his effort is thrown away when their dead beat father returns. <br><br>Best Performance: Thomas Haden Church","user":"lesleyharris30","rank":[70,116]}]