[{"title":"Way too underrated....","rating":10,"date":"19 October 2018","review":"One of the first Mainland of China movies that got released worldwide in 2010. Last Kung Fu Monk is a drama with kung fu about handle different situations in a different surroundings.<br><br>Meet mr Li Long, a Shaolin monk that leave his beliefs and move to America to find his brother. Instead he hear the news that his brother and his wife died in a car accident. His brother has a son though and Li volunteered to take care of him. To make money, Li befriend a Shaolin fan named Dave who tells him he can help him to open up a kung fu school. What Li doesn't know is Dave is connected with the Russian Mafia and the Russian mafia boss wants his money back for tribute the schools fundings.<br><br>When the movie came out on 1st October 2010 in the cinema I just thought this movie was just ok, and didn't even put it as a top 20 favorite. But now after 8 years since the release the movie starts to grow on me, and nowadays the cinema is filled with stereotypes hero movies and crappy CGI style, this movie has started to grow on me so much that it is on my top 5 list of my favorite movies of 2010s.<br><br>And to compare with nowadays, this movie doesn't deserve the harsh treatment as it got through the early years, this movie is it own movie, and to compare with other Chinese mainland movies, this movie is lighthearted and not much propaganda and quite a cute movie to watch.<br><br>I have raised the bar of this movie now and give it a 10/10 because it deserves it.","user":"euroasiangenetic","rank":[11,12]},{"title":"Exactly What You'd Expect","rating":6,"date":"18 September 2011","review":"There are few movies that a film lover would rent without first taking into consideration the quality of the acting - Chinese martial arts films are certainly an exception to this rule. This film is a quintessential example of that caveat, turning what initially would be perceived as a poorly scripted, amateur attempt at entertainment into a rather enjoyable two hours of remarkably impressive fight sequences. Even after reading what the movie was about, I'm still not sure the plot ever actually permeates into a logical series of events. And I've seen better acting from college kids with a video camera pretending to have talent. But that's not the reason we choose to rent these kinds of flicks is it? We rent them to have a few hours viewing of ass kicking while enjoying a late night indulgence - and to this extent the movie achieves a most lovable form of quality. What the cast lacks in talent, they make up for in looks; the supporting actresses are gorgeous and the lead actor is in fine shape. The direction and editing is notably horrific. The choreography, on the other hand, is on par with most other movies of its genre. Last Monk of Kung Fu never lives up to the level that Ong Bak set (the plots have considerable correlation) but it does provide a great few hours of action and unintended laughs.","user":"ejb57220","rank":[8,10]},{"title":"Better Than the 70's Kung Fu Movies!","rating":5,"date":"7 December 2014","review":"This is a low budget Kung Fu flick...but it's really not that bad - I've seen much worse! This movie had the typical \"good guy out to avenge his family and help others along the way\" kind of story...not as good as others, better than some. Some of the acting was OK...others were pretty bad and some hilarious! The story wasn't going to win any awards, but was good enough to keep me interested. The punch/kick sound effects were reminiscent of the arcade game \"Mortal Kombat\" and bugged me a little...but the choreography and fight scenes were done very well and sated my ninja bone. Which brings me to one thing that really bugged me...the man who wrote, directed, choreographed, and starred in this movie (Peng Li) doesn't even get top billing or proper credit! I had to search for him and his name on this page! Really? Give the guy a break!","user":"The_BDC","rank":[5,6]}]