[{"title":"Worse than Twilight, and I loathed Twilight.","rating":1,"date":"13 October 2013","review":"--- SPOILERS AHEAD ---<br><br>I watched this fim with a friend who has never read the book. I, on the other hand, read it years ago, but wasn't interested enough to continue with the series. However, I was willing to judge it as a film on its own merits, not as a book adaptation. By the end of the movie, we were left disappointed. It was rushed, choppy, unevenly paced, and made no effort to define the world it was set in. All the characters could have died and we would have felt nothing because the film did little to make us care them.<br><br>FLAWS IN THE FILM:<br><br><ul><li>The script was so atrocious that we began predicting what characters would say next during the cheesiest scenes. 95% of the time, we were right - word for word. When Jace said to Clary, \"I told you I'd never met an angel\", I said, \"Please, for the love of god, don't say: 'now I have'\". He did. We died a little. </li></ul><br><br><ul><li>There was zero character development. Clary had no personality. When we tried to describe her, we could not come up with a single adjective as we knew nothing about this girl. (Actually, that's a lie. When she pulled the mortal cup out of the card in front of the witch who was obviously a demon, and then again in front of Hodge, my friend yelled, \"How are you so STUPID?\".) Clary was presented as the protagonist even though we were given no reason to root for her or care about her. We. Knew. Zilch. About. Her. (Beyond being prone to dumb and reckless behavior). It didn't help that Lily Collins, while pretty, has no on-screen charisma. She was just a bland attractive girl. The other characters suffered equally. We could tell that Simon was nerdy, Isabelle liked slutty clothes and fighting, Valentine was evil, Hodge was sketchy, Luke was some kind of family friend (why, who knows?) and Jace was the standard romantic lead with a penchant for sappy lines and rescuing Clary. Beyond that, nothing. </li></ul><br><br><ul><li>Words like 'the Clave', 'the accord', and others were thrown in without explanation. </li></ul><br><br><ul><li>We were expected to believe that the mortal cup was some kind of holy grail even though the movie hardly explained how it functioned beyond a couple of statements about its necessity for making more shadow hunters. After all the build up with no clarification, my friend began to expect that the cup's powers would be demonstrated at the climax, making things clearer. Of course, this did not happen, and she was left unsatisfied. We cared about the mortal cup as much as we cared about the characters - which is to say, not at all.</li></ul><br><br><ul><li>The Silent Brothers were never explained. They were just creepy dudes living under a graveyard.</li></ul><br><br><ul><li>The weapons were ill-defined. They just did whatever the characters needed them to do at any given time - be it tattooing runes, slaying demons, or drilling magical peepholes through bookcases. They might as well have been Harry Potter wands.</li></ul><br><br><ul><li>Clary inexplicably accuses Alec of being in love with Jace even though we saw no indication that he was even gay. </li></ul><br><br><ul><li>The Clary and Jace romance felt forced. There was no build up. We were never shown why he would be attracted to her, or why she returned those feelings. When they finally kissed in the garden, it was uncomfortably awkward.</li></ul><br><br><ul><li>In a seemingly random act, Valentine wanted Clary to drink his blood from the cup and no one knew why. Said my friend at this point: \"Is he Jesus?\"</li></ul><br><br><ul><li>Loose ends. Simon is bitten by a vampire. At no point in the film does anybody bother to tell him this. Even when he storms out of the institute, Clary doesn't think to say, \"By the way, a vampire bit you.\" We waited for the effects of the bite to manifest - to find out if he was a vampire or not. But in the end, we were forced to conclude that in the world of The Mortal Instruments, being bitten by vampires only improves your eyesight. </li></ul><br><br><ul><li>The werewolves only existed to serve as expendable extras in fight scenes.</li></ul><br><br><ul><li>Speaking of fight scenes, many went on for far too long. Time could have been better spent on character development so that we actually cared if anyone died in a fight. </li></ul><br><br><ul><li>In the ultimate deus ex machina, Clary draws a rune that freezes all the demons. No one else has ever seen this rune. No one figures out how Clary knows how to draw it. It was like the screenwriters realized that their heroine had been useless and needed her to do something powerful to prove why she's the protagonist, since her talents thus far largely involved leading others into mortal peril.</li></ul><br><br><ul><li>Why were they using fire to battle demons that looked as if they were made essentially out of fire? Do we spray water to stop a flood?</li></ul><br><br><ul><li>The portal in the wall was supposed to take someone to the place they focused on or keep them in limbo. How did Valentine reach out of the portal to grab Clary after he gets shoved in?</li></ul><br><br><ul><li>Clary draws a cleaning rune at the end of the movie and magically tidies her apartment. At that point, it just became ridiculous. Are there runes to trim cat toenails and enable WIFI as well?</li></ul><br><br>I thought the whole Twilight franchise was awful but despite the dreadfulness of those movies, the plot was never unclear to even those with IQ deficiencies. I can't say the same about The Mortal Instruments.","user":"sasha-tifton","rank":[400,535]},{"title":"Horribly disappointed","rating":2,"date":"23 August 2013","review":"Cassandra Clare's Mortal Instruments is one of my favorite series and I was so excited to see this movie. I've been to plenty of book-to-movie showings, so I knew not to expect the exact same thing, but regardless, I went in with high expectations. The beginning was... weird (and out of order, but that's just my OCD, no biggie). However, this movie was so horribly different from the book that it lost all of it's value. I don't just mean the events were slightly moderated to save time, I mean they changed the entire plot. Jace wasn't terrible- could've been cockier, Clary was horribly over-dramatic, Magnus was expressionless, and they managed to ruin my favorite character: Valentine. He became a bland, one- sided villain, unlike the ingeniously dynamic character Clare made him out to be. The movie had changes in it that ruptured the foundation of the book and a lot of what it stands for, ruining the ingenuity of the plot and the world that Clare built which had me so enraptured from the beginning. It's a shame because they had such potential with this movie. I still can't understand how they could take such a great story line and decide that it was only acceptable to warp it to a point beyond recognition....","user":"mpurdy1030-772-496775","rank":[209,287]},{"title":"Horrible","rating":1,"date":"22 August 2013","review":"Words can't describe how disappointing this film was . Cassandra Clare effed this up . it had the potential of being something good.. lets start with the characters <br><br>Alec (Kevin Zegers) Is your character going thru a language dilemma ? Are you British , or American..&amp; No one other than the fans of the books got the gay vibe off him, so it was balls confusing to everyone else when Clary outed him . 0/10<br><br>Isabelle (Jemima West)<br><br>Pretty enough for the character, but why change her entire personality from the book? &amp; not to mention her height.. 4/10<br><br>Simon(Robert Sheehan) Perfect Simon , from top to bottom But Cassandra Clare,why would you allow an entire story arc change for this character. again other than the fans , no one had a clue why he didn't need his glasses anymore.. and why all of a sudden he is a day walker... where was the rat , where was the birth of a vampire , where was his Jewish jokes!!! this character was the seconded most disappointing portal. 5/10 <br><br>Jace (Jamie Campbell Bower)<br><br>what the eff ... this , this is not jace. Jamie looks like he is a drug addict , scrawny , unflattering , and not to mention the lack of chemistry between jace and Clary on film. Disgusting performance.. #1 most disappointing thing about this entire film was him . 0/10<br><br>Clary (Lily Collins) sigh , obviously this was a money grab of a casting choice.<br><br>0/10 <br><br>Valentine (Jonathan Rhys Meyers) If you make such a fuss in the book about his white hair ....WHY DOESN'T HE HAVE WHITE HAAAAAIR!!! arg. JRM , was a terrible Valentine . He made that character into a stubborn child , and not the sly evil devil valentine should've been . And really hodge makes up the idea for jace to be your son REALLY ?!?!?!? bull just bull ! 0/10<br><br>Jocelyn (Lena Headey) She wasn't that bad actually , stayed true to character , but i blame the script and how is was made that made her character look like a fool. &amp; Oh , and she has a bad case of the duck lips.. 6/10<br><br>Now to talk about the movie itself ( i'll keep it short)<br><br>Too fast , did not stay true to the book of characters , horrible cinematography, the cheesiest soundtrack, and way too jumpy for fans and newbies alike . <br><br>Sorry for the harsh review , in fact its my first and most likely my last.But after watching this movie i was heartbroken and i needed to share my frustration with anyone willing to read this, My grammar &amp; spelling are very poor i realize this , so take it as it is and if you go and see this movie go in knowing its not what your wanting to see. <br><br>-Dancia","user":"danicas","rank":[179,259]}]