[{"title":"Absolutely incredible!","rating":9,"date":"12 April 2011","review":"I'm not often compelled to write movie reviews online, but after seeing some of the bad reviews this film got, I decided I would. This film is well worth your time and money. Granted, some of the scenes may feel cheap and I think my brother could create a better CGI shark. That's not the point. AnnaSophia Robb does a spectacular job of playing Bethany Hamilton, a 13 year-old girl determined to continue doing what she loves after losing an arm to a shark. Helen Hunt and Dennis Quaid do an excellent job of portraying her supporting parents. The raw display of emotion from herself and the rest of the cast is mesmerizing. The character chemistry and development could not work better here. The film includes great cinematography and well-done surf scenes which add to the overall effect. If this movie does not inspire you, I don't know what will. The target audience is teenage girls, but the whole family can enjoy Soul Surfer. You will leave the theater feeling uplifted after viewing this great film. SEE THIS MOVIE! You will not be disappointed.","user":"xxelizadxx","rank":[82,109]},{"title":"One of my favorite faith-based movies","rating":10,"date":"17 September 2011","review":"Soul Surfer is in the top 10 of my favorite faith-based movies. It really is a tremendous uplifting film that leaves you in tears from the very beginning to the very end. And it's all attributed to God. Kudos to Dennis Quaid and Helen Hunt for being in the film and giving terrific performances! I give Soul Surfer a 10 out of 10<br><br>My top 10 faith-based movies of all time are: 1) Ben-Hur; 2) The Genius Club; 3) Soul Surfer; 4) Facing the Giants; 5) Chariots of Fire; 6) End of the Spear; 7) The Climb; 8) Gospel of John; 9) Time Changer; 10) Book of Matthew<br><br>You're missing out if you haven't seen these films!","user":"laurenbeatty3","rank":[99,137]},{"title":"Truly inspirational!","rating":10,"date":"9 April 2011","review":"This film touched my heart in a way few ever have it was well done in every aspect. The acting was excellent, everyone in this very strong cast turned in excellent performances's but Annasophia Robb was a stand out, absolutely genuine in her performance, your heart breaks for her and soars with her. The cinematography was beautiful and the under water shots were very creative. The special effects are convincing. But the true star of this film is the story itself. It tells the remarkable story of Bethany Hamilton which can not help but challenge and inspire the viewer. I can not recommend it highly enough. Don't miss this one! It is family safe we went with 7 people ages 12 to 70 and everyone loved it. It inspired us all!","user":"FanGirl7","rank":[60,85]}]