[{"title":"Well made biopic","rating":8,"date":"21 March 2015","review":"This new film held the audience spellbound at the 2015 Cleveland International Film Festival. It was especially effective having the actual subject serve as narrator. Hunter's narration was very honest, truthful and insightful. His voice was sonorous, statements rich in humor and warmth, and his attitude toward himself rather laid back. <br><br>The photography and direction was of a high level with editing that kept the pacing alive and energized. Besides looking at the main subject, the film also revealed a candid slice of the film industry of the 50s-- qualities still with us in 2015 (the film's release year). <br><br>Hunter had more of a varied career than one might normally think--he played a variety of parts (particularly some stark TV dramas) and kept a cool attitude throughout. The film also reveals the actor's relationship with his mother and his rich past time with horses. <br><br>All in all, a very engaging biopic.","user":"adamshl","rank":[22,24]},{"title":"Standing Ovation in London","rating":10,"date":"27 March 2015","review":"Caught the London screening. The place was packed, not an empty seat in the house, and Mr. Hunter received a thunderous well-deserved standing ovation. <br><br>This is one of the best celebrity biography docs for a long time, and will bring to a new, younger audience the reality of how the old Hollywood studio system manipulated its stars for their own corporate gain. <br><br>In Tab Hunter Confidential, Mr. Hunter narrates, sharing his insightful and honest view of the Hollywood star-making system of the 50s and his personal rise, success, frustration and fall at Warner Brothers Studios. With self-deprecating humor and warmth, Mr. Hunter reflects on the policies, plans and politics of the studio which dictated how to live in and survive the public life of a movie star, generating popularity and the adoration of his fans. He combines this with honest reflections of his closeted life as a gay man when the word gay did not even exist at the time. Mr. Hunter's frank and authentic portrait of his loves, his family and his faith are complicated, moving and intelligently presented. <br><br>Kudos to getting this fascinating autobiography onto the screen with taste and elegance.","user":"donna-191-140428","rank":[21,23]},{"title":"I give it a 10 !!!","rating":10,"date":"14 June 2015","review":"A thoroughly captivating life and career story of a multi-talented actor, equestrian, figure skater and beloved star. Tab Hunter reminisces about his early life and well documented career in this beautifully produced and directed film. Tab Hunter, Confidential feels more like a conversation with a good friend than a documentary. Clearly respected amongst his peers, numerous well-known stars share insights into their lifelong friendships forged from within the ups and downs of the film community. The film makes great use of clips, publicity stills and promotional memorabilia as a reminder of the scope of his popularity. In addition, highlighting his success as an equestrian - which continues to this day - was a great insight into Tab's life away from the screen. His clear enjoyment of working in a sport that centered on the training and handling of an animal was a window into his desire to be able to get outside of his image and career, a passion that deflected focus off of himself. An afternoon well spent with a Hollywood good guy content with his life. Wonderfully done. Don't miss it.","user":"jmdisante","rank":[15,16]}]