[{"title":"A rather Classic tale....Good overall....Don't understand the hate.","rating":2,"date":"2 January 2015","review":"This movie has some really bad reviews here in IMDb, I guess because of Nicolas Cage, a praised actor in the past, who, because of his recent choices, has become a target of hate. (You can easily identify these reviews of personal hate, when you read comments like \"The worst movie ever made\" etc.)<br><br>First of all the star in this is Hayden Christensen (not Cage), who does a good job overall. Cage has a minor role, not as significant as you might think at first. To tell you the truth they could have assign his part to another actor or scrap the character off the story all together. Cage's acting is sub-par but he gives a \"dying\" performance (pun intended!) in the end.<br><br>This is a rather classic tale. It resembles the plot of many westerns: The master warrior who tries to escape his previous cruel life, drinks to forget, he hits rock bottom... until someday unexpectedly he finds a noble cause to serve and redeem himself.<br><br>The direction is very stylish. Some people might don't like it but I personally did. The movie was filmed in China and you get a few nice landscape along the way.<br><br>There are some really dramatic scenes in the film. In my opinion are well filmed and effective. Certainly not laughable as in some other movies with similar plot. First time director Nicholas Powell does a good job.<br><br>An interesting fact: Despite the bad reviews a SEQUEL is on the works. I don't mind watching it when it's out. The ending, although clear, leaves something to be desired.<br><br>Overall: Ignore the hate and watch it if you have the chance.","user":"Dr_Sagan","rank":[59,69]},{"title":"So so story, camera is disaster","rating":6,"date":"13 October 2014","review":"This film attracted me with the role of Nicolas Cage, however, he is not the main character and his role in the film is not quite interesting. This film is simply a Chinese movie with some new winds from western crusaders. However, it is meaningless, the makers tried to attract us with this image but they failed to connect the stories, so it becomes boring. I felt like being cheated.<br><br>The royal prince was practicing the arrows, but the result is just one hit shot, that's all. The storyline is half done.<br><br>Most important thing, the camera is terrible. If you want to watch fierce sword fights, then you will be seriously disappointed because the camera is so narrow like the you are the fighter in the movie, BUT it is shaken strongly so after a few minutes impressive, you will feel terrible.<br><br>Why don't they film it with wider view so we can enjoy the whole fighting and landscapes...? I hope they return my ticket money.<br><br>Anyways, the characters are good, I can not give them bad rating.<br><br>Finally, sorry for my bad English.","user":"tuongvinhtp","rank":[117,160]},{"title":"Simply awful in every way","rating":1,"date":"17 December 2014","review":"What ever happened to Cage? Has he run out of resources and feels the need to jump on every bad script out there? Not only this, he is actually gives the worst performance of the lot in this movie. The story itself is corny, limping and just bad over all but Cage is even worse.<br><br>Don't waste your time nor money on a movie like this, it's not worth it. It was in fact so bad i decided to create an account here only to rate it as 1 and hopefully someone will be lucky enough to avoid it.<br><br>I guess if you would have skipped the crusaders and left out the two big names from Hollywood it could have been a movie for a rainy Sunday but as it stands now - just avoid it and watch something else.","user":"jens-188-727259","rank":[120,192]}]