[{"title":"Brilliant debut","rating":9,"date":"31 January 2011","review":"Saw this beautiful movie yesterday on IFFR (google it) and was blown away by fantastic acting, a heartbreaking story and beautiful cinematography. I cannot say too much about the movie, since it speaks for itself, but I can say it depicts the situation of Ireland at the moment. Someone asked the director of the movie if the situation in Ireland as depicted was as bad as in the movie, he answered \"maybe worse\".<br><br>All in all this movie has grabbed me and my fellow viewers as a pearl. Camera standpoints are up close and personal and this really makes you part of the sad life of the main characters, never becoming melodramatic. To me, 9 out-of-10! If you're able to go see this movie; go! It's a beauty.","user":"pauleedee","rank":[42,48]},{"title":"Park yourself at the nearest cinema if you get a chance to see this","rating":2,"date":"2 October 2011","review":"A very moving film - a credit to the producers Ripple World and to a very talented cast. The story follows Fred Daly (Colm Meaney), an introverted and marginalized middle-aged man who returns to Ireland and ends up living in his car. He befriends a young homeless junkie, Cathal (Colin Morgan) and the two find comfort and a glimmer of hope in their low-key friendship.<br><br>Meaney gives a superb performance, walking the tightrope between sentimentality and cheap laughs without ever falling into either trap. He plays a man clinging to the last vestiges of normality, whether it be watering a plant or brushing his teeth, - a drowning man by the sea, clinging to the smallest pieces of debris to stay afloat. Morgan, best known as Merlin in the TV series of the same name, shows huge promise as a big screen actor.<br><br>Well written by Ciaran Creagh whose theatre background has given him a good ear for dialogue. Directed with elegant understatement by Darragh Byrne and with some beautiful photography from John Conroy including cinematic landscapes that lifted it away from potential TV-style relentless grimness.<br><br>If there is a single word for the movie, it is uncompromising. It takes a hard, unblinking look at lives on the margins but manages to retain its characters' humanity. I watched it at the LA Irish Film Festival 2011 and there were more than a few tears shed in the audience, which again is a credit to the film-makers in a world where shiny things and explosions usually dominate. For sure it is a slow burn, but all the more elegant for that. Full of sadness and pathos, but leaving the door open for a final sliver of hope to shine through. Bravo.","user":"City-by-the-sea","rank":[37,43]},{"title":"An Emotional Powerhouse","rating":10,"date":"12 May 2012","review":"Parked is a small, independent Irish film with a big heart and unexpected emotional punch. The film is a study of humanity, of keeping that humanity, and ultimately, how we need and depend on each other for any life that's worth living.<br><br>Colm Meaney gives a stand-out, restrained performance as Fred Daly, a man reduced to living in his car when he can find no work and no public aid. He parks his 'abode' in a public beach front parking lot, and he is obviously hanging on by a thread, using the comfort of routine to get him through day after dreary day. Until he finds himself with a neighbor, a young drug addict named Cathal who parks his 'home' in the same lot, and shows Fred how to snatch humor, and even joy, out of a seemingly hopeless existence.<br><br>What elevates this movie is the direction, the beautiful cinematography, a haunting musical score, but most especially the acting. As I said, Colm Meaney, who couldn't give a bad performance if he tried, is poignantly stolid as a man abandoned and alone, clinging to what little civilization he has left.<br><br>The real surprise is Colin Morgan, who plays drug addict Cathal. His performance is a wonder. He has taken a mostly unsympathetic character and imbued him with pathos and humanity. His performance shows, by turns, a jittery, sad, friendly, hopeful and ultimately, powerless and heartbreaking youth abandoned by all those who should care.<br><br>The story of Fred and Cathal and their unlikely friendship is the crux of the movie and told in an organic, decidedly non-Hollywood and non-contrived fashion. It grows naturally and is nurtured with care by the director who lets the story tell itself.<br><br>A beautiful film, poignant yet hopeful and well worth seeking out.","user":"jm-stanley","rank":[10,11]}]