[{"title":"Beary bad","rating":1,"date":"10 March 2017","review":"Norm of the North is painfully bad, with stilted dialogue and a palpable sense throughout that the writers were struggling to fill up 90 minutes. It seems to operate on the premise that animation, cute madcap antics by furry animals and an inspiration-ish story line are enough to make a good movie. The product is the very definition of \"mailing it in\", and by the end I felt that the producer must have had actual contempt for the viewers. Awful.","user":"alan-c-edwards","rank":[24,29]},{"title":"Annoying and Stupid","rating":1,"date":"27 February 2017","review":"WOW this movie was a total piece of of trash to watch! You would expect the animation and voice acting to be impressive and worth something, NOPE! The movie's \"Plot\" at the beginning, felt similar to Happy Feet with a Polar Bear named Norm (Rob Schneider) who wants to dance and be free from everyone else then things get bizarre with him leaving to the big city to become famous and live a new life, that is just redundant.<br><br>we meet annoying and odd characters played by Heather Graham (Vear) and Ken Jeong and we are greeted to Mr. Greene (Ken Jeong) a businessman who wants to convince Norm to start homes in the...Arctic. Who wants to live in the South Pole? This movie is also filled with weird lemmings that literally rip-off the Minions with their squeaky voices and annoying movement that work for Mr. Greene, for a entrepreneur that is pretty stupid of workers Blah, Blah, Blah more ridiculous plot and Greene is defeated and it ends with some dumb dance party<br><br>Norm Of The North is a awful and badly made film, and i am right! The animation SUCKS and is bouncy, spastic, and dull, with reusable character designs. The Story makes no Damn sense with ridiculous cheap clichés and jokes you can see in other animated movies. The acting is cringe worthy with Rob Schneider sticking to being a minority in Adam Sandler films than a polar bear. Most of the music and soundtrack is some cheap music you can get off from some random website. This movie is a broken, cheap, and a queasy mess that deserves no recognition.","user":"dmartinez-52655","rank":[24,31]},{"title":"The antichrist of animation","rating":1,"date":"28 December 2016","review":"Good lord.... god almighty.<br><br>Words cannot describe this heinous disaster that Lionsgate have given us.<br><br>I can't imagine what the producers were even thinking. <br><br>Were they laughing in our faces when they sneaked it into the theatres? <br><br>Or were they crying in shame at what they had just made? <br><br>Chances are it's the first answer.<br><br>I just can't explain how bad this so called \"animated comedy\" is.<br><br>First of all, there is no comedy.<br><br>No gags. <br><br>No jokes. <br><br>No nothing. <br><br>Just a bunch of miserable unfunny things going on that the writers call \"funny\". Not even Tommy Cooper would be laughing at anything this film has to offer.<br><br>Then there isn't a plot to be found. <br><br>Well actually I lied, there is a plot somewhere. But once you dig deep into the surface like Nicolas Cage going insane over a decades old bike, you'll find it's a plot you've seen before. (Case in point Madagascar, one of the films you should instead watch)<br><br>There isn't any animation here either. <br><br>Well again there is but it's straight to DVD quality. Everyone moves jerky, the art style feels lame, the colour palate is typical. This \"thing\" certainly won't be giving any other straight to DVD animated films nightmares anytime soon.<br><br>There isn't any characters, just walking dead lifeless fossils doing things. And nearly all of them are annoying as the heavens above.<br><br>No voices too. What we got is constant shouting, yelling and pain from these actors. <br><br>Rob Schenider should know better than to keep putting his name on stuff like this. Ken Jeong is as grating as he's ever been and I didn't give two craps about anyone else. <br><br>And how dare they waste Bill Nighy too? <br><br>Charlie Adler, Jess Harnell and a couple other well-known voice-actors are there too but even this film isn't one of their finest hours.<br><br>Hold on, why did I just call it a film? <br><br>It isn't one.<br><br>It's a humorous black hole that'll suck the life out of you and your family if you dare watch it.<br><br>It's the antichrist of animation, a disaster so unbearable, you'll might even die of horror watching the bloody thing.<br><br>And the fact it's produced by the same person who did Superted (Mike Young) just terrifies me to almost no end.<br><br>Just how did he put his name onto this? <br><br>Just how? <br><br>Even the voice directing feels non-existent and when it's got Buster Bunny (Charlie Adler) and Oshawott (Lisa Ortiz) trying their best yet it still isn't there, you deserve all the scorn your film gets.<br><br>I hope you're happy Splash Entertainment and Lionsgate. <br><br>I really hope you are.","user":"l-62911","rank":[24,31]}]