[{"title":"Oh it's a stinker alright","rating":3,"date":"16 November 2010","review":"And I was generous with three stars, of ten. Explanation to come. <br><br>A buddy rented this one and brought it over. Starring the only two known 'actors' Steve Austin and Eric Roberts (who has stumbled along on his acting career, never approaching his more famous sister Julia's prominence), Hunt to Kill starts out with a familiar formula: Two cop (southern border guard?) buddies, the two already mentioned, staking out a trailer in the desert. It's desert so it must be the southern US border. They call for backup and then decide to storm the trailer without waiting for the backup to arrive. <br><br>At this point we can see what's going to happen in this movie. The writer is going to have the characters do totally illogical things because he hasn't taken any care to advance the story in a plausible fashion, and we the audience will spend the rest of the show rolling our eyes saying all the while, 'Now why on Earth would somebody do that?'. The movie delivers.<br><br>Of course the bust goes wrong. Eric Roberts must have been expensive because he's only on the screen long enough to get killed. The trailer is full of hidden bad guys and everything blows up in magnificent fashion, leaving only Steve Austin knocked flat but alive.<br><br>Next thing we know it's four years later and Austin has transformed into some sort of Rambo-like master of the forest and now he's in the Pacific Northwest. All the setup with the trailer and the killed partner? It has nothing at all to do with the rest of the movie except maybe to establish that Austin is tough. Oh, and we see him being given a birthday present of a watch with a woven band that can be unravelled into a rope.<br><br>The story shifts to a group of bad guys who have stolen some bonds and who are not only baby kicking bad but who betray each another at the drop of a hat. They kidnap Austin, actually kidnapping his newly appeared incredibly stupid daughter to force his cooperation in order that he should lead them through the forest to their fellow bad guy who has stolen their stolen bonds (don't ask) and taken off with a guide to sneak into Canada through the forest... (I warned you) The watch with the magic rope band that we expected Austin to use to save the day at some point? At one point the McGuffin (bag of bonds) had fallen off a cliff, Austin volunteers to go get it and just up and produces this magic watch band rope in front of everybody, unwinds it, and heads over the edge! Oh, that twist caught me by surprise! I had a great laugh over the fact that the watch-band rope once unravelled, became a half inch line of a good couple hundred feet in length.<br><br>Of course the bad guys betray him, grab the McGuffin, cut the rope so that Austin falls off the cliff, and leave him for dead. Of course he's not dead.<br><br>The forest part allows the story to go the way of presenting Austin as Rambo, although he runs through the bush in a very awkward fashion as though he were wearing high heels. We get to enjoy seeing such eye rolling and laughter inspiring events as Austin leaning back against a log in the middle of the forest and discovering a bag slung up into a tree, that contains a compound hunting bow! How handy. You can almost hear the scriptwriter say to himself, \"Now I want to introduce a hunting bow for Austin, how can I do that?\" \"I know, he just finds it in a bag, strung up in a tree!\" <br><br>Mind you, later Austin discards the bow when he has shot all of the arrows. You can't reuse undamaged arrows, it seems.<br><br>There are enough scenes to inspire laughter that I didn't pull the DVD out of the player. It was funny enough to keep watching, I'll give it that. There were some visually stunning scenes shot around the abandoned Brittania copper mine in Southwest British Columbia and cliff scenes obviously shot around nearby Squamish.<br><br>I can't give it all away but I've said enough I think. Austin has to rescue his daughter before the bad guys can escape with her to Canada. It's not so awful you can't get a laugh or two, but it's pretty awful.","user":"choatelodge","rank":[30,44]},{"title":"Wow.","rating":11,"date":"11 June 2011","review":"This is quite possibly the stupidest action movie I've ever seen. The plot, is cliché, sure, they all are in this genre now. There is a reason that Stallone and the Spermanator are famous for their abilities to make crappy plots work. <br><br>Stone Cold doesn't have that, the dude is a good actor, and was a great athlete, but they have to stunt doubles for him RUNNING for christs sake. And as awesome as a clash between \"Steve \"I drink beer and have rough sex with fear\" Austin\" and \"Darth Maul\" could have been, it's not. It's the antithesis of what you'd expect from such a showdown.<br><br>I mean, there is a low speed ****ing ATV chase, and seeing Austin pop a wheelie on a four wheeler to smash a bad guy into a wall, before shooting said ATV with a flare... Was beyond my tolerance for stupidity, I was hung over, on the couch, and helpless to turn this off since my xbox controller was out of reach. I'm warning you ahead of time so no one else has to suffer. Don't watch this.","user":"sikkwolf","rank":[15,22]},{"title":"Decent action movie","rating":5,"date":"13 October 2010","review":"Right, we need to be honest about some things to begin with. First, this is going to have a lot of people giving it the next title of \"WORST FILM EVARRRRR\" and while they are all wrong, they are people too!<br><br>No, but seriously. When you come into a film called 'hunt to kill' with Steve Austin as the main character, I highly doubt you're going in expecting a film with some Al Pacino style acting, the action equivalent script of The Shawshank Redemption and the cinematography of Lord of the Rings. I suppose my point is that this film isn't that bad, nor is it that great. It's a decent film. The acting on most parts is competent. It's not perfectly shot but I've seen so much worse.<br><br>I'm not going to go into the story, it's a basic run of the mill good guy/good guy's family gets caught in the wrong place at the wrong time, stuff happens.<br><br>On one note, I hated the character played by \"Marie Avgeropoulos\". I always have hated know-it-all teens who think they know everything and just cause more trouble.<br><br>It's worth a watch either way.","user":"halbarad_loire","rank":[31,51]}]