[{"title":"Please, Hollywood, take note...","rating":9,"date":"7 June 2013","review":"... This is how to make a vampire film.<br><br>I find it difficult to fault this film. The plot is intelligent and engaging. No one is entirely black or white. The heroes are flawed and complicated, the villains, for the most part, have motivation and even sympathy. I found myself rooting for the murderous, vampiric prostitute as much for the innocent girl trapped into releasing those tired of life.<br><br>It's really two films, one set 200 hundred years ago, one in the present time, with many of the same characters and the same location, Hastings, once a fishing village, now a tired seaside resort.<br><br>The actors are very good, particularly the leads. As a resident of SE England, I recognised many of the locations. The ending was perhaps a little predictable, but still satisfying.<br><br>Don't go see this if you like your vampires to sparkle, but if you liked Let The Right One In and gritty drama, go watch it.","user":"snodlander","rank":[202,242]},{"title":"Takes you back to the times when vampires were considered monsters","rating":9,"date":"4 August 2013","review":"Although not well advertised and distributed, this movie actually is a piece of true art. It returns to the roots of the vampire genre, but unlike Twilight or the more action-oriented alternatives, this one has a very adult take on it.<br><br>Although it has a fair share of action and blood, this movie really is not for those who expect exciting, thrilling and spectacular fight scenes. More like Interview With a Vampire, the movie concentrates a lot more on understanding these beings. Throwing some of the vampire's newborn traits away (sparkling in the sunlight eh?) and turning them into \"Sucrient\"-s, the movie revolves around how these creatures find their means of survival and how they deal with the price they pay for it.<br><br>Many critics say that the movie is too long and slow paced, which is true, but that's actually one of the reasons what makes it work. The scenes, the music, the characters all give you a dark, twisted, gripping and uncertain feeling. The slow-pacedness of the movie adds the sense of being lost, the sense of being empty to all of it.. which might make you uneasy, but by the end you will realize this is how the characters themselves feel like. You are made to feel uneasy, because it's necessary to be able to understand them.<br><br>...and although there are several quite good acting performances in Byzantium, by \"them\" I now think about Clara (Gemma Arterton) and Eleanor (Saoirse Ronan). Their characters are very different, but are also very interesting and more importantly: very well played. Saoirse Ronan does a perfect job in giving you the Eleanor whom you both understand and don't understand at the same time, an Eleanor whom you love and still are afraid of. Then there's Gemma Arterton who brings her best performance ever to the screen, giving you a cruel, wicked and wretched Clara who soon turns out to be so much more than what they call her...<br><br>There are quite a few vampire stories out there already, yet Byzantium achieves to be a unique pearl among all of them. Its dark feeling, interesting characters and slow storytelling do require a specific audience - people who like to listen and be mesmerized. If you feel like one, Byzantium is a must-see for you.","user":"Tyrel64","rank":[121,143]},{"title":"Best vampire flick since Let the right one in","rating":7,"date":"28 December 2013","review":"This poster drew me to this film. Not the poster shown here on IMDb, but the colorful green, yellow and red which are used other places. I wasn't expecting too much, but was surprise ad when I saw the casting, and that it was a Neil Jordan-flick. I've admired Jordan since I saw The Crying Game.<br><br>This story reminds me quite a bit about the Swedish \"Låt den retta komma in\" (\"Let the right one in\"). It has the right realism which made the the Swedish film so special, and the same coloring tone. The scenery in the beautiful harbor tine of Hastings are perfect, and it really made me want to visit there, which I will, most certainly. Combined with the Dickens inspired older sessions in the movie.<br><br>If there were justice in this works, this would have had the success of \"Twilight\", or rather instead of. It's very British, stylish, bleak, beautiful, and the casting is simply perfect, like it seems in all British films. <br><br>The idea is simply brilliant, and I love the idea of vampires running a brothel, as well as the depth of the longing for a different life. It's desperate. <br><br>Saoirse Ronan is once again electric, and the third film I've seen in a short time with Caleb Landry Jones (both fabulous, \"Antiviral\" and \"Contraband\") convinces me he is a big star in the making. Gemma Atherton is perfect.<br><br>I found the storytelling excellent, and I was very entertained all way through, though this isn't really my type of story. I think the ancient part of the story is good, but I think the red bloody waterfall is a bit over the top, and also slows the story and the believability. But otherwise this is grand film making.","user":"OJT","rank":[28,32]}]