[{"title":"Very contemporary telling of the tale of Macbeth, real, compelling, creepy. Really worth the sit.","rating":10,"date":"6 October 2010","review":"It is true what Patrick Stewart says, in the 'extras' on this film: in the last 20 years or so we have discovered that Shakespeare was a Screenwrite. Every line of verse in this production makes sense, is clearly revealed in its meaning by the use of images, and when the monologues are delivered to the camera, you get it, you follow, you never drift off from the usual 'yadda yadda' quality that the longer speeches, even beautifully pronounced by European players, can induce in all but scholars. The nuance that Goold gets from his actors on meaning and tone is terrific to watch. It is a scary environment; it is a humans-sized environment. Real human ambition &amp; regret &amp; resolve are actively demonstrated--no grand pronouncements. You see how perfect the play is, how dead on. That Lady Macbeth would instantly sicken when Macbeth the King becomes the real 'man' she derides him for NOT being in the first 1/5--is utterly believable.<br><br>That Macbeth would HAVE to become a testosterone ridden, bloodthirsty tyrant is clear: his only way out, as he tries to live without sleep, without 'troops of friends', without progeny.<br><br>I really enjoyed watching Patrick Stewart's maturity as an actor. Every line was a discovery, a delight of \"oh, that's what he's thinking\". No scenery chewing, but, damn, the dude is scary at times. (watching him make and share a sandwich had me writhing). His Macbeth is masculine, vigorous, cerebral (leading to his downfall, perhaps). His foil, Kate Fleetwood as Lady Macbeth, really holds her own against him; I can see her dashing the suckling babe all right. And then hoisted by her own petard in the end, ruined by her ambition instantly, no chance to enjoy the spoils.<br><br>The scene where Thane of Fife goes to England to beseech the Prince of Cumberland to come home and save Scotland really thrilled me. The actor Scot Handy gives a reading that had me utterly flummoxed (\"I don't' remember this scene? Why is he talking like that? Did they re-write this? Oh, I get it!! Well done!\") And to be given the enjoyment of Shakespeare all over again because an actor inhabits it newly – delicious! Later, his physical revulsion and bravery in the final speech of the play was a great note to go out on. Likewise, Fife's breathing when he gets horrifying news, these are great actors and a great director. Not to mention the playwright.<br><br>I am going to buy this film.<br><br>The sound track is particularly masterful. Unnatural creepy perfect sounds. And it never lets up. I'll say no more. Go listen for yourself.<br><br>Nor does it ever appear as a staged film. The claustrophobic environment makes you long for fresh air. That the only outdoor scene has Banquo &amp; Fleance in jeopardy, you are holding your breath for them, is additionally chilling.<br><br>The porter as a decrepit, drunken, save-your-arse kind of Irishman was an unexpected treat. Also, the feeling of a real company was very evident. Small roles like the Queen's maid and the Doctor, the milquetoast Steward who gets his spine in the end, and the porter who delivers the great line: \"The Queen, my Lord, is dead.\", all fit in beautifully.<br><br>There is not a clunker in the group; nor is a false note ever struck; and you cheer for the good guys and the relief of Light &amp; the Good returning in the end.<br><br>If you don't really like or 'get' Shakespeare, see this. Not ONCE does it smack of obligatory literature. It is real, tough, in your face, compelling, and the witches will Rock you! Their presentation is terrific, unexpected and utterly perfect for this version of the play. The use of the horrors of conventional medicine is a hoot. They are Macbeth's own inner demons, made patently evident when he says \"Enough.\", as they disappear for the last time.<br><br>Much like Peter Jackson nailed the 'better &amp; lesser angels of our nature' with the scene of Gollum talking to himself as both Smeagal &amp; Gollum--this production holds a glass up to our ambition, recklessness &amp; the inebriating quality of getting what you want. See it. It may save your soul. A tale of our times, written 418 years ago.","user":"lmfmasterton","rank":[40,46]},{"title":"Masterful gripping production of Shakespeare's Macbeth","rating":10,"date":"6 October 2010","review":"This is the best film performance of Macbeth which I have seen. It ranks with Ian McKellen's Richard III (1994/5) as a definitive production in an \"updated\" setting. Like McKellen's Richard III, Goold's Macbeth uses a staging suggestive of late 1930's - and does not seem out of place any more the McKellen's Richard III did. Patrick Stewart's interpretation and presentation of the Macbeth character is dynamic and cover's a wide range of expression. His Macbeth has a hesitant and sometimes seeming incomplete descent into pure evil. It was a masterful and dynamic performance. However, in my opinion, Stewart's co-star, Kate Fleetwood, just about steals the show. Her Lady Macbeth is pure evil from the start - she comes across as the cold pit viper lacking only visible fangs. Her performance here is truly the best I have seen since I saw Judith Anderson give a TV performance a long time ago. The integration of the 3 witches into the action throughout as 3 triage nurses was an imaginative element. This is a \"hold on to your seat\" production - grabbing your attention right at the start and moving at a steady pace to the last syllable of (its) recorded time - you will not leave your chair.","user":"grant-ellsworth-864-889985","rank":[25,29]},{"title":"A Macbeth like no other","rating":9,"date":"6 October 2010","review":"A visually brutal adaptation of a theatrical production that combines the experience of stylized European director's theater with the documentary-film imagery of war, Stalinist totalitarianism, dystopian landscapes. The result is not as much a drama (although the acting itself is riveting) as a series of rapidly-changing tableaux that bring a striking newness to Shakespeare's language. Sir Patrick Stewart performs the role of a lifetime. As a Shakespearian actor, he manipulates Shakespeare's words so that they ring authentically, as if we are hearing them for the first time.<br><br>This Macbeth channels the early Polish Roman Polanski, the imaginings of a Stanley Kubrick, the gritty grayness of 1984. It HAD to be shown as a PBS \"Great Performances,\" for I cannot imagine it attracting a commercial audience, or even a film festival one, since it seems more like an brilliant artistic experiment that might have its most successful showing in the context of a museum. It is complex, worthy of endless dissection of words and images. My experience of it had less emotion involvement than fascination with creative process behind the filmmaking.","user":"plamya-1","rank":[18,22]}]