[{"title":"Worst hip-hop dancing movie","rating":1,"date":"14 June 2011","review":"If you thought you are going to be amazed by this movie that followed the first \"You got served\" -- you're going to be very disappointed. When the first movie appeared, even though it had bad reviews as storyline and / or acting, the dancing was sick, and it was revolutionary. Someone \"got served\", there were battles, but first of all there were DANCERS. After 7 years in which urban dance evolved incredibly, \"Beat the world\" comes with an even worse script, no dancing (except for some poppers and lockers), no routines, nothing !!! It just blows  As a professional dancer and choreographer, \"You got served\" was a key in what street-dancing should look like, and after 7 years the sequel just made my sleepy. Very disappointed.","user":"alex_igi2000","rank":[15,20]},{"title":"hip hop flop","rating":3,"date":"14 June 2011","review":"This movie completely surpassed my expectations.... as to how bad it would be. I was expecting the terrible acting. I was expecting a nearly non-existent story with more holes than a fine swiss cheese. Unfortunately I was also expecting some jaw-dropping dance moves, which is ultimately the only reason anyone would put themselves through a movie like this. However in this respect the movie totally failed. The dancing is almost completely uninspiring. I have recently been watching the TV show \"Americas best dance crew\", which is the only reason I watched Beat the World, but in comparison the dancing in the movie is just Lame, with a capital L. I feel violated.","user":"mortuustuna","rank":[12,16]},{"title":"Out of a very boring and formulated lousy screenplay","rating":16,"date":"16 June 2011","review":"The Hip-Hot competition did not look like an international one but local event. If it's international, all the countries participated should have their competitions first until the best team won and qualified for the so-called \"International\" competition. But the so-called \"Beat The World International Competition\" was nothing but a sort of backstreet event in one of the American city. The participating teams, especially the team from Brazil was so bad and so mediocre that their dancing skill was even worse than their English. There's nothing so international at all, because you could easily tell most of these boys and girls actually lived in America, they just played as foreign young people. The screenplay was so bad that it didn't fall apart from the very beginning because it never solidified at all in the first place. There was no scenario or plot, everything was just so predictable and so deadbeat boring. The so-called competition dancing, the romance, the maverick or the dark horse, the foe or friend, the normal middle class family, the high school drop-out, the misunderstanding, the quarrel, the fights, the cheating, the helplessness...and so on, all the ingredients used in this pathetic movie were old stuff that had already been used maybe thousand times in other crappy movies. There's nothing newer or better than all the movies in the same genre we have already seen before.","user":"rightwingisevil","rank":[4,5]}]