[{"title":"Strangely Beautiful","rating":10,"date":"30 May 2011","review":"Let me start by saying I hadn't heard of this film until my girlfriend rented it (she's a film student at NYU). And judging by the cover and the title I had low expectations. So I was surprised to find a weird, funny, strangely beautiful movie wedged between the usual coming-of-age shenanigans. In a lot of ways it reminded me of my favorite writer, Haruki Murakami, in that the setting was banal but the plot (and I use that word loosely) was brimming with odd visual non sequiturs and tangents that were occasionally left dangling. There's a girl who has an affair with her teacher, a burning cloud of smoke, a killer in a white suit, a series of car crashes, kids who smoke everything in their kitchen to see what will get them stoned...the list goes on and on. But the thing is, it almost all works! It's almost like magic realism, albeit in a more grim, apocalyptic setting. So if you're someone who likes linear films, or films that follow all the rules, you'll probably not like this. But if you're like me and you get bored of seeing the same thing over and over, this feels pretty fresh. It definitely entertained me and stuck with me -- especially the ending. Oh yeah, and don't pay attention to the box. This movie has nothing in common with Juno or Donnie Darko (which is sci-fi, for Christ's sake). I have a feeling people latched on to that comment and let it color how they saw the story. So to sum up, I wouldn't recommend this movie to everyone, but I was moved by it and enjoyed its shaggy poetic qualities and erratic twists and turns.<br><br>10/10 Lee","user":"changmurakamireader","rank":[46,56]},{"title":"Pop Art Americana","rating":9,"date":"2 November 2011","review":"This movie was beautiful and surprisingly dark and potent. Basically a teenage girl, played by the slightly-too-old for the role Kat Dennings, arrives to a small town where kids keep getting killed, an industrial fire won't stop burning, and everyone does too many drugs. As someone who has spent time in some small American towns, I could relate to the feeling. Though obviously the director is playing with the conventions here and adding a layer of menace, melancholy and haze to the proceedings. So Kat's character decides to seduce her high school teacher, played by the under-rated Josh Lucas. They begin an affair and all is well, until he instructs her to pretend to date a boy her age so the local yokels won't become suspicious. Needless to say it's all a lot of fun--albeit dark fun--and things take some wild twists that suspend logic but are all the more enjoyable for it. I wish this movie had gotten the attention is deserves--was it even released?--because it's by far the best work Kat Dennings has done, and it's full of amazing images and sharp dialogue. Be advised: this movie is an art film disguised as a teen movie. It's probably too ambitious for its own good, and I can see why it might be passed over by many. But I think it'll be a cult classic and I was pleasantly surprised by the artistry that went into this little indie flick. Extra points for the powerful ending.","user":"jamesschwartzvedanta","rank":[18,20]},{"title":"An edge-of-your-seat coming-of-age drama","rating":9,"date":"7 May 2011","review":"In a small town where teachers sit in front of apathetic kids in the classroom and teenagers have nothing better to do than find household items that might get them high, \"Daydream Nation\" sneaks in and takes everything by storm. Caroline (Kat Dennings) is new in town and it's not that she loves to cause strife or turmoil, but she's smarter than her fellow classmates and she's looking to define herself just as any smart, lonely teenager would do. This is the year that everything happens.<br><br>With an industrial fire burning, a serial killer on the loose, and Caroline falling in love with her teacher Mr. A (Josh Lucas), the film sets up such a dark, mysterious, chilling atmosphere that you'll be drawn towards this town and these characters and then want to find a safe place to watch from.<br><br>Some of these characters will break your heart from the very beginning, Thurston (Reece Thompson) is the quintessential awkward teenager, alone and confused and might be falling in love, and his best friend is gone. His single mother (Andie MacDowell) is in constant fear of keeping her kids safe. The other characters should be able to handle themselves just fine. These are the best written characters I have ever seen in a high school film (and yes, I have seen \"Election\").<br><br>Mr. A is looking for motivation, Thurston is looking for love, and Caroline is just looking for something. This film takes those simple longings and puts them into something that looks and feels like a thriller. Originality is not to be feared. It should not be weird or off-putting; it should be celebrated. \"Daydream Nation\" is an edge-of-your-seat coming-of-age drama. These teenagers, plus a teacher or two, are just looking for love, acceptance, understanding and a purpose.<br><br>For the first time in a long time, I had no idea where a film was taking me. I had no idea what they were trying to tell me, and I had no idea what genre it was supposed to be. But the unrelenting atmosphere, the incredibly well written characters, and the smart dialogue make \"Daydream Nation\" something you'll want to experience. Another reviewer compared this to \"Juno\", I was thinking of comparing this to \"Heathers\", but these filmmakers have their fingers on the pulse of something entirely different. They might play with your heart strings, and your blood pressure, but by the end you will be put back together.","user":"napierslogs","rank":[28,37]}]