[{"title":"Character-driven, raucously thrilling crime comedy","rating":9,"date":"14 October 2011","review":"Screenplay writer John Michael McDonagh's directorial debut, \"The Guard\" (2011) is really a fine movie, relying the least on the originality of its story, describing criminal proceedings of the group of cocaine drug-smugglers and their interaction with local police, set against the backdrop of small-town western Ireland, however, filled with crackling good dialogue, sparkling with wisecracks, accompanied with nice scenery and pleasant, unobtrusive music. But, what makes it the best is its protagonists' performances.<br><br>Brendan Gleeson is usually natural, making the character he plays fit like a glove—whether the robust and humorous loyal buddy and the warrior, as in \"Braveheart\" (1995), or a quiet and subdued aspiring politician, as in \"Gangs of New York\" (2002), or a non-supportive father, civil war volunteer-turned-deserter, as in \"Cold Mountain\" (2003), whether the gentle, mentoring, culture-exploring hit man in hiding, as in \"In Bruges\" (2008), or on the other side of the law, the grouchy police sergeant with defiant, often dissident sense of humour (provocative in one-liners like \"being FBI, don't you prefer to fight unarmed women and children\"), as in this movie--and Don Cheadle, in the role of FBI agent Wendell Everett, a bit in the shade of Gleeson's Gerry Boyle, but nevertheless, sufficiently competitive (\"Langley is CIA, I'm FBI\"), neat and convincing in his performance as always. (I admit to have a soft spot for this actor since his impressive role of the manager of Kigali Mille Collines hotel in the movie \"Hotel Rwanda\" (2004), the very same hotel I have been frequenting for two months in 1995, just a year later to tragic events described in the movie.)<br><br>To a pretty frequent movie goer like myself, who hasn't seen a single en par (or better?) leading actor in this year that is rapidly advancing towards its end, it is hard to believe that very many better acting performances could be demonstrated in the remaining two months or so. Therefore, if Brendan Gleeson does not find himself at least among top nominees for any yearly awarded film prize, I'll have a problem finding such decisions just.<br><br>As a marginal note, I was lucky to watch this movie back home in my motherland, because having it subtitled was very helpful in order not to miss any of sergeant Boyle's wisecracks, delivered often in heavy Irish accent, and to understand at all occasional lines, uttered by marginal characters, spoken completely in Gaelic. Of course, point was not to be understood by English native speakers, but it was still interesting to know what usual \"advices\" (if not insults) were given to English speakers, though eventually not English (as FBI agent!) at all. As Irish colleague of mine once said \"We don't sing songs in Gaelic so English people cannot understand how badly we talk about them, they know it already! We sing in Gaelic simply because that's our traditional language (N.B. official whatsoever), and songs sound much better and sweeter in it.\"","user":"Davor_Blazevic_1959","rank":[160,179]},{"title":"Gleeson commands the screen from start to finish. Hilarious.","rating":7,"date":"18 June 2011","review":"Michael McDonagh is the brother of one of the funniest writers in the world just now. Like him, he is a foul mouthed upstart with a unique ability to investigate Irishness with tremendous energy and vividness.<br><br>I was lucky enough to attend the premiere in Edinburgh this week and enjoyed what is another great addition to the McDonagh canon of work.<br><br>Inevitably it has to be compared to the superior In Bruges but this is no lightweight cast off. Particularly when it one again focuses on a heavyweight performance by Irish heavyweight, Brendan Gleeson. In \"In Bruges\" Gleeson had to battle for compliments against Colin Farrell who has never performed better and had most of the best lines. Not here. This is all Gleeson, ably abetted by Don Cheadle as the Black FBI agent drafted in on the back of a glittering career to track down a bunch of slightly bungling drug runners in sleepy old Conemarra - Gleeson's patch.<br><br>Gleeson and Cheadle spar well and develop a likable relationship, despite this it's not the heart of the movie; that belongs, again, to Gleeson in a tour de force performance.<br><br>Cheadle's good and is a great foil. The baddies are less well developed characters and, for my taste, were slightly too caricaturised.<br><br>It's not a life changing film but it has to be seen for Gleeson's complete mastery of McDonagh's marvellous script.","user":"markgorman","rank":[103,125]},{"title":"Understated and funny, a showpiece for Gleeson","rating":21,"date":"21 August 2011","review":"Despite the fact that I live in a bustling metropolis, all of the theaters that show smaller films are somewhere between 30 and 50 miles away. In \"Dallas Traffic Time\", that translates to somewhere between 90 minutes and 16 days. As a result, I don't get time to see many of these films until they come to DVD, if at all. In my experience, art house films are often the most difficult to write about and even more difficult to properly judge, particularly in the summer. When almost everything I've watched in the last three months has involved superheroes, aliens, or jokes related to bodily functions, I have a tough time transitioning to more mature and cinematic endeavors. So it is with \"The Guard, a film entirely unlike anything else I saw this summer.<br><br>Sergeant Gerry Boyle (Brendan Gleeson) is an off-the-wall, somewhat crotchety veteran police officer who patrols a small Irish town. Shortly after beginning an investigation into a peculiar murder, Boyle discovers that his case is related to a major drug ring that is currently being hunted by FBI agent Wendell Everett (Don Cheadle). As straight-laced as they come, Everett is an odd pair for Boyle but the two are forced to work together to take down the cartel. When the case pulls Boyle in deeper than he would have ever imagined he is forced to reexamine his life's work and turn himself into an unlikely hero.<br><br>If that synopsis makes \"The Guard\" sound wholly serious, bear in mind that it is completely and totally a comedy. A dark comedy to be sure but a comedy nonetheless. If you've ever wondered what \"Hot Fuzz\" would be like if it was subtle and less over-the-top, \"The Guard\" fits the bill. This is writer/director John Michael McDonagh's first full length film but I would never have guessed it if not for the magic of IMDb. It is a witty, well-written film that makes its tone clear from the first scene. The pacing isn't exactly what I would call slow but instead calculatedly casual; it knows where it intends to go and it makes its way with balanced determination. This is a film that knows its own identity and doesn't stray from the dark comedy path more than a time or two. Its humor is smart and lively. Even with the thick accents (which probably caused me to miss a joke or two) \"The Guard\" is filled with exquisite dialogue and understated jokes that brought more laughs than anything from all but the very best big budget comedies this year has brought. <br><br>The plot of \"The Guard\" is simple but refined and that pushes all of the attention onto the characters and the actors who portray them. Cheadle is a solid straight man and as he always does, he makes the absolute most of every scene he is given. As one of the ringleaders of the drug ring, Mark Strong's character is straight out of a Guy Ritchie film, a role Strong is great at playing. Please Mr. Strong: stick to these films and stay away from popcorn crap like \"Green Lantern.\" But despite all of the excellent actors around him, \"The Guard\" is all about Gleeson. His work in 2008's \"In Bruges\" (coincidentally directed by McDonagh's brother Martin) finally brought him the attention he deserves, but Gleeson has always been a favorite of mine, a magnificent actor who never fails to impress no matter how little screen time he is given. Boyle is a without a doubt a curmudgeon (and a slightly racist one at that) but Gleeson makes him exceedingly likable. He is a wild card, the type of guy who does the right thing when you're absolutely sure he's going to continue to disgrace himself and Gleeson pulls this off perfectly. Moreover, he once again exhibits the brilliant comedic timing that has made him one of the best and most versatile actors that Ireland has to offer. I'm not saying it's his best performance but rather another in a long string of quality portrayals that illustrate just how undervalued this guy really is.<br><br>Fun, intelligent, and genuinely hilarious, \"The Guard\" is an excellent departure from my typical fare this time of year. I've made no bones about the fact that I really like summer blockbusters. I love them, in fact. But when a movie like \"The Guard\" comes along in the midst of the \"Conan the Barbarians\" of the world, it serves as an incredibly refreshing reminder of what we have to hope for in the coming months.<br><br>Check out my site: www.thesoapboxoffice.blogspot.com/","user":"bdgill12","rank":[90,111]}]