[{"title":"He's seen the future and it's made him (half) crazy","rating":9,"date":"15 December 2009","review":"Michael Ruppert is a 55-year-old one-time LA cop whom the CIA tried to recruit to import drugs in the 70's. He made this public; was fired from the police force; was shot at. In the 30 years since, he has been an investigative reporter, lecturer and conspiracy theorist. In the riveting, compulsive, perhaps indispensable film 'Collapse,' Chris Smith (of 'American Movie' and 'The Yes Men') spends 82 minutes interviewing Ruppert Errol Morris style with nonstop intensity (seamlessly and effectively using archival footage to illustrate the points and increase the energy level) shooting him in a darkened basement under a bright spot in immaculate shirtsleeves, chain smoking, with baggy eyes and neatly trimmed mustache. Supremely confident, hardened by decades of facing scoffers, deeply angry, Ruppert by nature skates on the edge between prophet and crackpot. But when he speaks, you listen. And he has a lot to say.<br><br>Ruppert hits us right away with peak oil, arguing that though actual supplies have been kept hidden by governments, even Saudi Arabia, which has more than anybody, is starting to run out, and we're clearly now on the down slope of the bell curve. He says no substitute will really work, because all the alternative energy sources require too much energy themselves to produce. The planet's infrastructure is going to shut down; it's just a matter of time. Parallel to this is economic collapse, and he predicted the present crisis -- but expected it a year or so earlier. (Mighn't he be jumping the gun a little on this larger collapse?) <br><br>Ruppert is a survivalist, warning us all to live locally. He compares the fates of North Korea vs. Cuba when they lost the Soviet oil lifeline: Korea, a monolithic dictatorship, took a terrible hit. So did Cuba, but people pulled together there, raised crops locally in every available spot of land, and soldiered through so well they're now eating better than ever. He would have us take the same route: raise our own food, and horde gold -- the actual metal, not paper certificates -- and organic seeds, which in a world stripped of supply will become currency.<br><br>Ruppert is a smoker, and Smith doesn't hesitate to show every time he lights up. This looks like a marathon, and the interview -- with challenging, skeptical questions off camera from the director from time to time, not that this overconfident autodidact type ever wavers -- is so intense Ruppert actually breaks down and weeps more than once at the hopelessness of it all.<br><br>Smith's film is effective, and if it leaves you in some doubt whether the man is a kook or a visionary maybe that's part of the sense of radical unease you may justifiably feel walking out of the theater. Though Ruppert is made to seem both knowing and deranged, his talk is smart and well-informed. Clearly fossil fuels are finite. It all depends on transportation; it all depends on electricity. Without oil, these shut down. If seven gallons of oil go into the making of every tire, how are we going to make a whole new set of cars that run on something else? What about plastics? What about overpopulation? Ethanol is a sick joke, clean coal a lie. Even wind and solar power won't be possible because we won't have the energy to set up the power sources to utilize them. Global warming is just the planet's way of crying \"uncle.\" When oil runs out, we'd better be ready before the infrastructures all collapse, or it's going to be hard going. We've got to downsize. It won't be easy.<br><br>It's rare that anybody thinks things through this far. No wonder the tears come. They come when he thinks of Barack Obama, a smart, good, honest man, he says, but someone so locked into the systems that we can't look to him for help. And that's very, very sad. The world's last, best hope is an illusion. (These are just a few of Ruppert's points: into these 82 minutes he condenses the fruits of decades of independent thought and study.) <br><br>Smith asks Ruppert what spiritual beliefs sustain him and he simply quotes the Bible: \"money is the root of all evil.\" He asserts that we must find ways to live without growth and profit as guiding motives. The pervasive pursuit of money is the great, tragic human flaw.<br><br>This is an intensified and distilled Michael Ruppert, very effective but a bit misleading: he has other facets. In another setting glimpsed in the film but available in full on YouTube you can see Ruppert in a suit and tie giving a rambling, self-indulgent slide lecture full of many of the same interesting facts he likes to cite, including the government's reliance on drug trading, but very different in feeling and veering (though he denies this elsewhere) into 9/11 Truth territory. Collapse ends with captions noting that Ruppert, whose only friend seems to be his faithful dog, is having trouble paying his rent and may be evicted from his Culver City place.<br><br>But again on YouTube you find him being interviewed recently in Oregon, where he has moved, looking and sounding sunny and grounded and socially connected. If he's a kook, he has lots of friends, some of them quite respectable, and \"Peak Oil\" is a rallying cry for many. The YouTube videos show Ruppert isn't always the intense nut case Smith gives us. He suffers, he thinks too much, but he can have fun; he can talk without a smoke. He feels Ashland is a place among many (including much of South America) where sustainability will be possible when the paradigm shift comes. The end of he world won't be the end of the world. This may not totally convince you, but it will scare you. Rupert protests in Smith's movie that he deals in conspiracy facts, not conspiracy theories. He just may be right.","user":"Chris Knipp","rank":[74,82]},{"title":"A Devastating Film: This is the End of the Line.","rating":10,"date":"11 December 2009","review":"Whether Michael Ruppert is a madman or a prophet, I do not know. What I do know is that all of his suppositions are based on the hardest and most chilling of facts. You will recall your teachings on Cassandra and the famous Cassandra Complex, whereby a person who bears valid warnings and terrible foresight is doomed to watch it happen. They are helpless to stop it because no one will listen to them. Meet Cassandra.<br><br>Collapse is an amazing documentary that works on several levels. We'll start with the first: Ruppert's analysis of the world around us is stunningly bleak. Our entire civilization is based on oil. This is fact. All transportation requires oil in some form. All manufacturing (and civilization as we know it) is based on energy, which is finite, and requires some oil in some form. Building the resources to harvest ANY energy source requires manufacturing and transportation, which requires oil. Cultivating food requires energy to produce and transportation to get to your grocery store or home. Even if we discover some new energy source - algae, for example, which is not addressed in the film - all the components needed to harvest or utilize that energy are oil-based. Even if we invent cars without tires (which require 8+ barrels of oil to make, PER TIRE), the plastics and metals and components in those vehicles all require oil as either a direct ingredient or as an indirect part of the manufacturing.<br><br>Now imagine a world without oil. See where this is going?<br><br>This film, and Ruppert, go much further than that. Oil dependency is just the appetizer. Then we get to Peak Oil (or the Hubbert Peak). Then an economy based on floated, imaginary, (fiat) money. And so on. Ruppert builds his case with hysterically grim anecdotes and considerable authenticity. It's difficult to disagree with him precisely because he doesn't allow 'theory' or partisan/ideological opinion to seep into the discussion. The facts are accurate. The conclusions... are up to you.<br><br>Let's talk about the film-making itself: Chris Smith's film is shot 'bunker-style' for effect. It works. There are hardly any miscues in the technical aspects, and the editing style is absolutely riveting and never boring. As pure entertainment, if we can call it that, this film will absolutely command your attention for 80 minutes. The film does not subscribe - one way or another - to Ruppert. It just shows him as he is and allows you to draw your own conclusions. Right or wrong, Ruppert's quest to seek this knowledge and tell it to the world has subtly destroyed him. Collapse works on an intensely personal level, too. This film burns itself into the mind. It's point blank brilliant.<br><br>Others have noted a major flaw in Ruppert's arguments, including the filmmaker himself: Ruppert does not allow for miracles or human ingenuity in his apocalyptic scenarios. Ruppert has already decided we've passed the point of no return and is now looking to \"build the lifeboat on the Titanic\". When confronted about this directly, Ruppert's non-answer more or less says that he won't trust his fellow humans to think a way out of this. Ruppert has so expertly identified the problems, but he has no answers. All his \"hope\" is directed at ways to survive what's to come. Again, right or wrong, this man absolutely believes what he's saying and is absolutely terrified. You should be, too.<br><br>What's the way out? Well, I personally choose to believe the first part of Ruppert's argument and disregard the second. We are in trouble. But I choose to have faith in my fellow man, that we can \"fix the Titanic\" before it's too late. In the meantime, you must see this film. See it, soak it in, let it shake you, and tell your friends. Draw your own conclusions. Ruppert's role is to sound the warning. Perhaps if enough people see this film, someone out there will figure out what to do.","user":"Savant-2","rank":[118,134]},{"title":"Prophetic and Utterly Chilling","rating":10,"date":"21 November 2009","review":"One review (official review) that I read while watching the trailer to this film described it at \"an intellectual horror movie.\" Having listened to Mike Ruppert speak in the past, this comes as no surprise. From his scathing indictment of Dick Cheney in his talk \"The Truth and Lies of 9/11\" to the speech he gave in Seattle in January of 2005 (available in two parts on YouTube under the title \"Talk by Michael C. Ruppert\") the picture he paints for the future of the world has been a stark one for some time now.<br><br>However, gloomy is one thing. Being deadly accurate in nearly all predictions is another thing altogether. Ruppert, and his team at From the Wilderness (his newsletter) have been bang on the money when it came to oil prices, housing prices, and of course the collapse of the US housing market, and in other areas as well including drugs, the CIA and 9/11 itself. Ruppert being an ex LAPD narcotics officer who was born into an intelligence family, has had experience in seeing truth where others bury their heads in the sand. When he tried to bring to light evidence that the CIA was dealing drugs within the USA, he was shot at and forced off of LAPD. This was only the beginning of his investigative career, and of the vicious repercussions he suffered because of it. In November of 2004, his book \"Crossing the Rubicon: The Decline of the American Empire and the End of the Age of Oil\" went largely unnoticed, even though it could serve as a final nail in Dick Cheney's political coffin concerning his culpability for 9/11. Ruppert has said, \"This is a book that I, as a detective, would... drop in the lap of a DA and say, 'I want a filing for murder, premeditated, first degree, multiple counts with special circumstances.\" The best part: he makes no mention of bombs in buildings, or holes in the pentagon, or molten metal, but merely treats the case as another crime to be pieced together and solved. His conclusions are staggering.<br><br>And in light of this, to hear what he predicts is yet to come is guaranteed send a chill down your spine, even if you don't believe him. And what does he predict? Nothing short of the collapse of industrialized civilization itself. How could this ever happen? Quite simply, the world runs out of oil. Since everything we do is dependent upon oil... well it's probably best if I let Ruppert speak for himself.<br><br>The film plays like one of Ruppert's more impassioned talks, albeit with some cinematography added in to keep the eye amused. We are in an undefined space that looks like a bunker, or an interrogation room. Ruppert sits in a chair, smoking cigarettes (presumably to calm his nerves, or as he's been known to say \"I smoke as many cigarettes as I want to, but not nearly as many as the movie would have you believe\") and tells us what's on his mind. And by the time you're done seeing \"Collapse\" it'll be on your mind too... no matter how hard you try not to believe it. <br><br>What makes \"Collapse\" so much more powerful than the angry rants and shenanigans of Michael Moore is that while Moore may be passionate about what he's talking about, it's clear that Ruppert is more than passionate... he's scared to death. What's worse, and also unlike Moore who has received greater publicity than many fiction filmmakers, Ruppert has suffered from a kind of Cassandra syndrome for sometime. His writings and speeches are prophetic and yet, until recently, he has gone mostly unnoticed by the majority of people. Despite this, he's cracked open some of the biggest cases of all time: the CIA dealing drugs, empirical evidence that Dick Cheney was directly responsible for thousands of deaths on 9/11, and most recently, the collapse of the global housing market. It's not difficult to picture a similar but more ancient voice shouting \"Don't let the horse through the gates of Troy! It will bring ruin!\" only to be met with violence and humiliation.<br><br>As is true with so many visionaries, Mike Ruppert is just now beginning to be heard... and like so many useful visions, the realization is coming too late.","user":"benmcfee","rank":[115,139]}]