[{"title":"A quirky comedy turns into a coming-of-age dramedy and gets a little lost on the way","rating":6,"date":"8 September 2012","review":"What starts out as a silly comedy quickly descends into a fairly average coming-of-age dramedy. But after reading an interview with the director, \"Goats\" is very clearly a coming-of-age dramedy; it's just the marketers that would like to pretend that it's a quirky comedy – usually an easier sell for indies. The change in genre is both good and bad news for the audience.<br><br>We are first introduced to Ellis (Graham Phillips) as he's living with his mother, Wendy (Vera Farmiga), a new age hippie, and Goat Man (David Duchovny) a step-father-like figure, on a sprawling desert farm. Goat Man smokes weed and makes goat treks – whatever those are. His mother talks in nonsense philosophical quips as she comes up with more and more ways to become one with nature.<br><br>It's a relief when Ellis goes off to prep school because those early comedy stylings could only go so far. In prep school, Ellis clearly doesn't really know normal. He doesn't get along with his roommate and he keeps expecting Goat Man to send him marijuana in the mail. He's at the school because of his father's money and name, but thinks of his father as some worthless jerk who left him and his mother.<br><br>While the film isn't really going anywhere, the characterizations are good. I wasn't really sure what the film was trying to say, but one thing that I picked up on is that no matter how different people may be, they are all selfish. Hippies are just as selfish as those that are rich and privileged. His mother expects Ellis to come home for Thanksgiving even though she won't answer the phone or return his calls. So Ellis decides to spend the holiday with his father who is just as insufferable as he thought.<br><br>His father, Frank, is played by Ty Burrell in a very good, dramatic role. When we meet Frank, we also meet his new, younger wife, Judy (Keri Russell). She's the nicest character in the movie, and is the spark for the expected eventual outcome.<br><br>The acting is good, in particular Graham Phillips as our young hero. Ellis is pretty bland, but Phillips infuses as much warmth and charisma into him as possible. We don't mind following Ellis to prep school, mostly because it would be much better than spending time with his whining, annoying, screaming mother (who is communing with nature). But like the protagonist, the movie gets a little lost when he arrives at school. The only comedy is when he calls home and Wendy's new boyfriend answers the phone, or when Wendy's new boyfriend wears a small Speedo, or when Wendy's new boyfriend throws a hissy fit with Goat Man. Did I mention that Wendy's new boyfriend is played by Justin Kirk? He's hilarious. But he's also not really important to the narrative of the film.<br><br>As I mentioned, \"Goats\" gets a little lost when Ellis arrives at prep school. At this point it's a coming-of-age drama, and it takes him the entire school year to arrive at the tiny bit of acceptance he was searching for.","user":"napierslogs","rank":[17,21]},{"title":"An amazing film, unique and touching!","rating":10,"date":"27 January 2012","review":"I saw this film at the Loft here in Tucson, Arizona, where a lot of the movie was actually filmed! It was one of the best movies I've seen this film season-up there with 50/50 and the Descendants. The film had depth to it, which made the comedy in in it witty and made the audience want to know what would happen next. The best undiscovered (as of yet) film of the year. The actors and actresses were beyond perfect for the film-you could tell they cared about the characters, and they were selected perfectly for their roles as well. Seeing David Duchovny as a pot-head goat farmer was exquisite. All in all, this movie was amazing. I hope it comes out in theaters so I can take everyone to go see it!","user":"elkingcgm","rank":[29,47]},{"title":"Modern coming of age story with a completely original flare.","rating":9,"date":"25 January 2012","review":"My wife and I screened this film at the Sundance Film Festival World Premier this evening and were proud to have given it a 9 out of 10 stars! This fantastically funny modern coming of age story is carried by a great cast that truly brings the audience into a world of starkly contrasting personalities. I never stopped laughing for the entire 90 minutes, not just at the overtly funny moments but at the subtle idiosyncrasies that each character brings to the screen. Put simply I loved this film. David Duchovny as the Goat Man alone is an act that could go on the road. In his directorial debut Christopher Neil has produced a film that I could easily see becoming a cult classic!","user":"libertyforallusa","rank":[30,49]}]