[{"title":"Unexpectedly great","rating":20,"date":"20 March 2013","review":"I was invited to \"The Host\" premiere last night and was very impressed by the film. I'm not a Twilight fan and have not read the book; If anything I was very suspect of this film and for whatever reason even felt negatively towards it (in an eye-rolling manner).<br><br>That said, I found myself walking out of the theater quite surprised. And yes, I still have my manhood and haven't transformed into \"A Hoster\" or a \"Hostling\" or whatever they may call the new breed. Honestly, I thought it had a wonderfully intriguing plot, good acting, and I was completely engaged. Yes, there was a bit of \"romantic cheesiness\" but it seemed to handle itself well and even poked fun of itself at times for this fact. I think if it wasn't for the excellent work of Niccol and Saoirse it might have easily slipped into laughable cheese, but amicably doesn't. Plenty of sophisticated action as well as thought-provoking concepts of love, loyalty, perseverance. A well rounded film overall. I especially enjoyed William Hurt but all the acting was on par.<br><br>Perhaps the Twilights were focused on teenagers but as a 30something guy I really liked it. I would definitely recommend giving this movie a chance to all. I'm just in the market now for a shiny silver Lotus.","user":"MoovyDawg","rank":[360,544]},{"title":"Hit or Miss","rating":9,"date":"31 March 2013","review":"This movie you will either enjoy or hate to be honest. If you want something that is action-packed and filled with cool sci-fi moments do not see this movie. Yes the movie is sci-fi but it's more about romance. It also is a tad slower.<br><br>However, the cast was fantastic and the script was beautiful. There were cheesy moments but it was still really sweet and well done. Basically what I am saying, is if you like romance with a twist go and see it! If you are expecting something like Gattaca, you will be disappointed.<br><br>I really loved the movie and felt it held up to the book. I usually hate movie versions of books but this was really good! If you like the book chances are you are going to like the movie. There are tweaks of course, but I thought they were mainly well done and helped get the same message across.","user":"cnazcona","rank":[204,310]},{"title":"Sci-Fi And Kissing","rating":4,"date":"3 April 2013","review":"The Host has an intriguing conceit. It is about a post-apocalypse where aliens take control on every human body then the remaining unpossessed humans fear them despite that these aliens only want peace. The story might have an idea that the humans could be the real enemy here or it's just both of them. The Sci-Fi bits are pretty interesting but it doesn't end there. It's based on a young adult novel so definitely there will be teenage hormones scattered around the context. It has romance that is suppose to save their world and change their lives, but once again just like any other young adult film, the romance is nothing more than a bunch of good looking people falling in love and doing romantic cliché stuff. Love may not be a problem to these stories but this romance is terribly empty. They're just making out and saying ridiculously cheesy lines. It would have been a fascinating idea but it just can't get away from its typical teen angst.<br><br>It is kind of similar to the recent young adult novel based film, Warm Bodies, except the antagonists in The Host are virtuous beings instead of ravenous monsters. It seems that both stories have the same morality. Humans are not the most peaceful beings either and maybe the order and mentality of both sides are the reason why they couldn't get along. When it goes to the romance, it says that Melanie and Wanda's love between the boys might revolt their world's condition. But it strays from its plot giving us a lousily told story and romance. Mostly the romance. It is noticeable that most of their \"love\" only rely on their lips. Which means they kiss a lot. We do not get to know much about why they care for each other, other than being one of the last normal human beings of their age. It is also filled with plot holes because of course it wants to appeal teens for the endless love that didn't even work. It is directed by Andrew Niccol who is somewhat a Sci-Fi expert but it looks like he's afraid that too much Sci-Fi than romance might disappoint these children. He could have been more indulgent.<br><br>The film has a solid cast but not all of them standout. Saoirse Ronan plays two roles here and she fills enough heart on both characters. Diane Kruger looks like she is enjoying playing the film's villain. The roles of Max Irons and Jake Abel seems to be only designed for kissing, slapping, and sometimes strangling, leaving William Hurt being the only likable gentleman of the picture.<br><br>The script explains some points of the concept which is fine in that way in spite of the plot holes but it gets terrible on the romance. There are dialogues that may get way out of hand, ends up being laughable. Even more laughable is one scene when the protagonist tries to wake up her subconscious by kissing her boyfriend. I don't know if I should blame anyone about it. I mean what choice does she have? Still, it's ridiculous. The film is at least stunning. It gets to explore something magnificent around. The exteriors serves a lot of intrigue to its world. It features shiny cars and choppers. Most of the action are well shot even though the action itself isn't really that interesting but everything in the film looks good.<br><br>The Host is not interesting enough. It thematically talks about peace and stuff. Well, you can make peace out of love but the film only shows kissing and I think there is more in love than just making out. Hormonally, this could be a perfect escapism for teens. An apocalyptic world about relationships of these good looking couples with fast awesome cars crashing on the road. But the story seems to offer more. Again, they are unable to show it because the only fan service for adaptations of teen books is to follow every single sequence from the book because they love comparing. Too bad, they could have also shown what's behind the words as well. The Host is another victim of a generic young adult film adaptation that doesn't understand much of the meaning of the story, and throw away the most bland of all romances.","user":"billygoat1071","rank":[148,223]}]