[{"title":"Zoey Deutch Steals The Movie","rating":8,"date":"18 October 2019","review":"I just got out of Zombieland: Double Tap<br><br>I wasn't the biggest fan of the first movie, i thought it was fun, but I never felt the need to rewatch it and i promptly forgot about it until the sequel was announced.<br><br>This is laugh out loud funny at times, I know zombie apocalypse movies are not where you expect to find laughs, but this has a lot of them. There was a lot of laughter in my screening.<br><br>Woody Harrelson is as awesome as he always is, and is on top form, its always nice to see Emma Stone playing a fun role, her parts down so serious lately!! Yes, i know she is an Oscar winner and she should be playing the best parts she can get, its just nice to see her having fun in a role again, as she is a good comedic actress, I love some of her facial expressions.<br><br>Now, when I hear the name Abigail Breslin, its always the little girl from My Sisters Keeper and Little Miss Subshine who pops into my head, I always forget the has grown up!! Even though I though i though she was great in Maggie with Arnie. She is fun here too, although her character is more of a plot device than anything else. A bit of a waste of her talents.<br><br>But it was Zoey Deutch who steals the movie for me. She was such an unexpected, delightful surprise. Playing the dumb blonde is a hard act to do well without being annoying!! Generally outside of one or two performances I hate the cliche of a dumb blonde character, but she nails it. I wouldn't be surprised if this is her breakout role.","user":"slightlymad22","rank":[200,307]},{"title":"Amusing","rating":7,"date":"17 February 2020","review":"Not as good as the first one. But still enjoyed it.","user":"zenonnelson","rank":[9,10]},{"title":"Flawed and repeat","rating":4,"date":"19 December 2019","review":"I LOVE the first film! The humour is just fantastic. And it was fresh at the time.\nDouble tap is trying to make the same film, and actually it has nothing more to give the characters or story.\nThis movie is totally unnecessary and should be held down longer. Considering it took them ten years to make a sequel its obvious that they have struggled to make it. Storywise and followthrough.<br><br>Just disappointed of the whole thing...","user":"peterrifkin","rank":[164,250]}]