[{"title":"Clever, Humorous & Entertaining.","rating":7,"date":"28 March 2012","review":"Two separate bank robberies go down at the same time, at the same bank. The hi-tech wizard robberies go for the vault and the redneck hick robbers go for the ATM machines. Things get more complicated when a Rain Man like character is stuck inside and believes that there is something else going down as well.<br><br>Flypaper is an under the radar flick that surprises those who give it a chance. It stars Patrick Dempsy in the Rain Man role, he plays a character obsessed with every little detail and he thinks that there is something more sinister going down than the two bank robberies. He enters into detective mode to figures things out, which makes for hilarious situations between the two groups of robbers and the hostages. Dempsy has a crush on one of the bank tellers, played by Ashley Judd in a pretty forgettable performance. Two comedic highlights belong to the redneck robbers played by the always reliable Tim Blake Nelson and the larger than life Pruitt Taylor Vince, better known as Otis from Walking Dead. They play well off each other and the other actors. They are the more eccentric of the characters who run into problems every turn they take. <br><br>The film plays out like a mystery, as the audience has to piece together who shot who and why. Are the bank robberies related? Coincidence? Are people who they say they are? All these questions keep us intrigued in the story and the humour keeps us entertained throughout. It kind of plays out like a modern version of the 1985 comedy Clue, as people die and characters are running around trying to figure out the who and why. <br><br>There are twists and turns and the film isn't as predictable as one would think. Just when you think you know what's going on, it pulls the rug out from under you. I managed to predict one twist before the revelation and gave myself a pat on the back for it. Others managed to surprise me. As a bank heist film, it places a nice spin on things. Usually when bank robberies go awry it turns into a hostage situation with police, yet Flypaper isn't interested in that aspect. It chooses to stay inside the bank the whole time.<br><br>Flypaper works and it never confuses the viewer despite the amount of information it throws across the screen. Dempsy is convincing as the oddball whose good with numbers and the supporting characters are seem to be having a good time. The film isn't afraid to poke fun at itself, which gives the film a light hearted tone. Flypaper is a wonderful surprise.","user":"Matt_Layden","rank":[34,38]},{"title":"A crime comedy that's unique and messy and nowhere near realistic","rating":7,"date":"2 January 2012","review":"There comes a time in every criminal's life when he has to make sacrifices. \"Flypaper\" takes place in a bank where two criminal groups have simultaneously arrived to rob the place. But this is not a crime drama; it's a dark comedy revolving around some very unlikely characters. Namely, Tripp (Patrick Dempsey), an autistic hero of sorts who is super-observant but unable to behave appropriately.<br><br>Tripp enters the bank at closing time but calculating the movements of everyone around him he guesses what is about to occur and jumps over the counter to save the pretty teller (Ashley Judd). In the scramble that ensues, there is one dead body, a room full of huddled bank employees-turned-hostages, and then Tripp, standing there, trying to negotiate a peace accord. It should be made very clear at this point that this is a comedy and is far from realistic.<br><br>The film really does seem like it was trying to be a funny, comedic, chaotic mess. And that's exactly what it is. The characterizations, although unique in some cases, are messy. The many twists and turns, perhaps a half-dozen too many, are messy. But is it really necessary to fault a film when it accomplishes exactly what it set out to do? <br><br>What \"Flypaper\" really accomplishes is a low-budget indie version of \"Ocean's Eleven\" but with a \"who done it\" mystery angle. Sometimes slapstick, frequently zany, but also sometimes clever, it's comedy first, crime second, and realism nowhere to be found.","user":"napierslogs","rank":[21,25]},{"title":"How many thieves does it take to rob a bank?","rating":24,"date":"24 September 2011","review":"VAGUE SPOILERS - NOTHING DETAILED OR CONCRETE GIVEN AWAY<br><br>Flypaper is essentially about a bank robbery where 2 sets of thieves stumble into the same bank at the same time causing a dilemma and confusion between everyone. One group is comprised of 3 professionals that come prepared with high tech equipment and skill, Darrien, Gates &amp; Weinstein &amp; the other consists of 2 goofy hicks who go by the nicknames Peanut Butter &amp; Jelly who lack the intelligence &amp; experience that the other group possesses. Hilarity and hijinks ensue as the 2 sets of criminals need to work together to control the hostages as they simultaneously try to steal money from the bank. However, all is not as it seems as people, including the robbers end up dying &amp; it is revealed that it's no coincidence that those 2 sets of thieves showed up at the same bank at the same time - they were set up by another bank robber who is also in the bank and there might be other robbers hidden amongst the group as well who were planning on stealing money.<br><br>At one point, the two sets of robbers are arguing about who has better street cred and to settle the score go on a website that ranks the most wanted bank robbers. This is where we are shown the names of some top thieves, thieves whose profiles conveniently don't have pictures attached (just a missing photo question mark). Two top robbers, Vicellus Drum (#1) &amp; Alexis Black (#3) are mentioned aloud which of course had me immediately assuming they were in the bank masquerading as hostages - whether I was supposed to pick up on that or not I don't know. I'll just say that I figured out right away who Alexis Black was so when that twist about her was revealed, I saw it coming a mile away. The identity of Vicellus Drum, however, was a solid mystery. By the way, why would I assume there were more robbers in the bank than the initial ones? It's revealed early on that the system was down for about 2 minutes &amp; someone said aloud that they were surprised that more criminals didn't show up to rob the place after it was revealed that the tech man who controls the bank's security system was selling the information about it being down around. It was a big red flag.<br><br>Overall, the movie is funny and clever and most definitely entertaining but my main gripe, a huge hole I just couldn't suspend my belief for.. was the fact that no matter what went on inside the bank, no one outside seemed to be aware and certainly no one called the police. At the very beginning when the robbers first storm the bank, the silent alarm is hit but doesn't work. This is said clearly on screen by the employee trying to set it off. However, throughout the course of the movie there were numerous, loud, bombastic gun fights - no less than 200 bullets were fired from all different types of guns: rifles, shotguns, handguns, etc.. which of course incited lots of screaming. There were also four humongous blasts that created fireballs &amp; did major structural damage to the bank (2, maybe 3 of which were detonated with C-4 / 1 a big gas explosion) yet apparently NO ONE on the street outside or in the surrounding buildings called the cops or heard anything which is just so moronic that it makes my head hurt. This was not a bank in the middle of a rural farmland in Kansas with the closest town being a mile away. This was a bank on a normal city street with a sidewalk full of people right outside the front door and neighboring businesses right next to the bank. How did no one hear the earth shattering bombs that were going off inside the bank? How did no one hear the gunfire that was booming inside? I kept waiting for someone from law enforcement to at the very least knock on the front doors &amp; was wondering how the robbers would deal with it but that never came. I'm willing to suspend belief for a movie but this was just impossible to ignore &amp; definitely downgraded the film for me.<br><br>6/10 It wasn't fantastic but it was worth one watch. Lastly, I want to point out that the acting is very strong from everyone in the movie especially Pruitt Taylor Vince &amp; Tim Blake Nelson's bumbling, doofy Peanut Butter &amp; Jelly &amp; Patrick Dempsey's Tripp who is a neurotic, overly stimulated, gifted man with lots of quirks. The characters are fun to watch.","user":"PhantomAgony","rank":[33,42]}]