[{"title":"Conventional but Effective Action-Thriller","rating":7,"date":"16 June 2012","review":"In Cape Town, South Aftica, the rookie CIA agent Matt Weston (Ryan Reynolds) is a safe house keeper and is in love with his French girlfriend Ana Moreau (Nora Arnezeder) that does not know about his double life. <br><br>When the most wanted rogue and former CIA agent Tobin Frost (Denzel Washington) surrenders to the American Consulate to escape from an attack of dangerous soldiers of fortune, he is brought to the safe house to be interrogated by the specialist Daniel Kiefer (Robert Patrick) and his team. However there is a breach in the safe house and mercenaries break in the place expecting to capture Tobin Frost and they kill Daniel and his men. Matt escapes with Tobin and he contacts the CIA senior management Harlan Whitford (Sam Shepard), David Barlow (Brendan Gleeson) and Catherine Linklater (Vera Farmiga) that give instruction to Matt to reach another safe house with the prisoner. But Tobin warns Matt that there is an informer in the CIA and he shall not trust in anyone. <br><br>\"Safe House\" is a conventional but effective action-thriller with the usual shootings, car chases and explosions. But the great cast, with the charismatic Denzel Washington and Ryan Reynolds; great veteran actors Brendan Gleeson and Sam Shepard; the always excellent Vera Farmiga; and the gorgeous and unknown Nora Arnezeder, makes the difference. The Hollywoodian commercial happy end is unrealistic but certainly will pleasure a great number of viewers. My vote is seven.<br><br>Title (Brazil): \"Protegendo o Inimigo\" (\"Protecting the Enemy\")","user":"claudio_carvalho","rank":[52,56]},{"title":"Nothing really new but a good choice of actors, effects and locations","rating":7,"date":"22 February 2012","review":"If you have seen conspiracy flicks like \"Enemy Of The State\", \"The Bourne Identity\", \"XIII\", \"Unknown\" and so on and so forth, you really won't be surprised by this movie. The story presents nothing new and is about the usual stereotypes: the good one turn out to be the bad ones, the bad ones turn out to be the good ones, the weak ones turn out to be the strong ones and so one. I think you get what I mean. The movie has no big surprises after all.<br><br>But if this kind of movie is well done, it can still merit a rating of eight points. I only give six point five and for this site seven points because of the mediocre camera work that was shaking and irritating at some points of the movie.<br><br>The rest of the film is quite decent. The locations are interesting and the movie takes place in Cape Town in South Africa and not in Europe or North America. The fighting and action scenes are very well done and with the visual and sound effects in cinema, it's a pleasant entertainment to watch this movie for sure. It's a good flick to change your mind, to relax and to take a break from your everyday life for sure. The acting is also rather good with two strong lead actors that are a very cool Denzel Washington and a sympathetic and determined Ryan Reynolds.<br><br>The only little flaw is that I would have liked to know more about both characters, especially about their past and what really led them to do what they actually do in the movie.<br><br>The movie simply has not the greatest script to stand out among many other similar flicks but it's still a good film. I would suggest you to rather watch the movies I talked about in my introduction or classics like \"I As In Icarus\" but if you have seen and liked them all, you will surely appreciate this work, too.","user":"kluseba","rank":[100,126]},{"title":"Reynolds & Washington a Strong Duo","rating":7,"date":"11 February 2012","review":"It is so very difficult to find new material when you piece together a governmental conspiracy movie. Safe House is able to do it to a point. The greatest success of this movie is the usage of modern film techniques. Too often the bulging budget and ability to edit in effects makes action/thriller movies extremely unrealistic. Safe House does the opposite. It takes all of these techniques and uses them to make the movie raw and real.<br><br>The actors were hand-picked perfectly for their roles. Ryan Reynolds is the actor you have to use when you want to put a likable, relatable family man in a difficult situation. As a CIA operative caught up in something far outside his experience, he fits in perfectly. As for Denzel Washington, there is little that he can't do. For the unique character of Tobin Frost, there is no better man to fill the role. Together they form a storyline that merely needs to be able to stand on its own two feet. The storyline does stand on its own. That being said, it is the weakest part of the movie. The twists have all been seen before. This movie doesn't offer new plot points to the old conspiracy theory movie. It merely adds new characters. The new characters are great, but it is not enough. In order for the movie to be great, it needed to give something new to the story.<br><br>I must say that the end was beautiful. Without giving anything away, it was gracefully preformed. It wrapped up the loose ends that too many other movies simply leave hanging. It adds a whole other dimension to Ryan Reynolds' character. It will, without a doubt, leave you wanting more but somehow completely satisfied.<br><br>Safe House is worth a trip to the theatre. With thrillers such as this one, the action is better on the big screen. Between the action and the actors, you will not be disappointed. Next to Liam Neeson's The Grey, this is one of the best action movies so far this year. The thing is, it could have been even better. Too bad.<br><br>reillyreviews.wordpress.com","user":"FFman-847-460126","rank":[80,102]}]