[{"title":"The Mel Gibson vehicle we've all been waiting for!","rating":10,"date":"19 April 2012","review":"With Mel Gibson doing himself no favors in the public media over the last six years, GET THE GRINGO is a much-needed reminder of why we loved him so much for the twenty years prior to his scandalous headlines. While it was greatly refreshing to see Gibson on screen again in EDGE OF DARKNESS and THE BEAVER after an overbearing eight year absence, GET THE GRINGO does the best of capturing everything we truly loved about Gibson's performances: charm, wit, humor, edge. The script by Gibson, director Adrian Grunberg and producer Stacey Persky is an original and tight balance of humor, edge, and danger that can very easily be considered an unofficial sequel to the theatrical cut of Gibson's cult favorite, PAYBACK. While the character of GRINGO's Driver never reveals his actual name, he possesses a lot of the same qualities as PAYBACK's Porter, including a U.S. military tattoo, a chain-smoking habit, sticky fingers, an iron jaw, and a penchant for bloodshed. Grunberg's direction is also solid with an obvious love for Sam Peckinpah paraded throughout. <br><br>For those of us who endured so many years of understandable negativity towards Gibson for his personal troubles, GET THE GRINGO is the film we've long awaited. It's truly a shame this film won't be seen wide in the U.S. It would've been a better comeback vehicle than EDGE OF DARKNESS was meant to be. GET THE GRINGO practically screams, \"Remember me? I'm still here, and I still got it!\"<br><br>But if one thing is certain in the age of home entertainment, it is that every good film gets discovered by an audience. Sooner or later...","user":"HalloweenShape31","rank":[265,302]},{"title":"Sadder but wiser Mel is excellent","rating":10,"date":"9 May 2012","review":"Just finished watching this excellent movie, and I hadn't realized how much I missed Mel Gibs on. Like the man himself, the main character in this film, Driver, is worn and weary, sadder but wiser, and comfortable with the ironies of life. And the world built here, \"El Pueblito,\" based on the actual prison in Tijuana, is real and startling. Portrayal of Mexico is outlandish at the same time it's sympathetic. Not much action, but shoot out scene in middle of movie is worth watching.<br><br>I understand this movie is getting no theatrical release in the US, and that's a shame. Just hope word of mouth will get around about this great movie. It's time to rehabilitate Mel Gibson.","user":"jmr7123","rank":[131,156]},{"title":"Mel Gibson is back!!!!!!!!!!.....seriously back...","rating":7,"date":"11 May 2012","review":"While watching this movie i was wondering why this movie was provided on a VOD service.....with such awesome stunts ,a strong script and brilliant acting this movie deserved a wide release .I was never a big Gibson fan but now i think i like his style of action thrillers never meant to say that i didn't like lethal weapon series but this in a way is more simplistic and tough.<br><br>This movie is seriously meant for fans of tough action movies and is not for people looking out for a highly intelligent action movie.This is a smartly and slickly written piece of work which definitely has its ups and downs.The story is nothing new, first half hour is Mel settling into prison life ,but when the action begins it's a very brutal affair.<br><br>The ups of the movie include the sublimely realistic acting of all the lead actors with Mel Gibson leading from the front,a tightly and smartly written screenplay(courtesy Gibson)and a smart yet simplistic approach from the director.<br><br>The downsides include the quality of shots taken which i think they should have taken with a much higher budget in hand and also a pretty unimpressive trailer. If only it had been marketed well and had a wide release this movie would have hit bulls eye.<br><br>All in all this movie is a Mel Gibson show which is highly gripping,thrilling and which I found is all the more absurdly entertaining.<br><br>Thanks to all the folks who read the review.CHEEEERSSS........!!!","user":"jithinjofrancis","rank":[88,104]}]