[{"title":"Whispers and pretty images DO NOT make a movie!!!","rating":1,"date":"5 May 2013","review":"This is a great movie ..... FOR SELLING TVS!!! I cannot find any other good use for this excuse of a movie.<br><br>I'm not kidding, in a point of the film, they run out of landscapes footages and they throw some TURTLES at us! SERIOUSLY?!?! I mean, what does the poor turtle has to do with anything? I just hope the turtle's payment was at least as big as Ben's, because they get about the same number of lines. Or should I say whispers.<br><br>That's another thing in this movie that is incredibly annoying: there are no dialogues! Only some random whisperings.<br><br>The Tree of Life was bad, but To the Wonder takes it to a whole new level of badness!<br><br>Summary: \"I love you.\" (silence) \"Let's get married.\" (more silence) \"I need a visa.\" (Guess what? More silence) Then she leaves. There is also a random priest going through some middle age crisis.<br><br>And they make it goes for 2 hours by adding a bunch of Nat Geo footages.<br><br>Just a final comment: PLEASE, IF YOU DIDN'T GET THE MOVIE, IT DOES NOT MEAN IT IS A GOOD OR A CULT MOVIE! I don't know how anyone can give this movie a 10. It's like \"I've no idea what the movie was about, so it must have been good.\" or \"if I say I didn't get it, people will think I dumb.\"<br><br>And I don't respect who give it a 5 by saying \"the story deserves a 0, but it is so pretty that I will give it a 5\". They are saying that no matter what you throw at then, if it is mixed with some 'LED TVs add material', it deserves at least 5.","user":"levyhc","rank":[94,133]},{"title":"To the Wonder is an empty shell","rating":1,"date":"25 September 2012","review":"Attending the official screening at the 'Sala Grande' at the Venice film festival. The applause for the attending actors finally stops and I find myself waiting with some excitement for a film created by one of the most praised directors of the moment, lining up some great names like Ben Affleck, Rachel McAdams, Javier Bardem and Olga Kurylenko. I was also expecting another great actress to appear on the screen, Rachel Weisz. I would soon find out that she was being cut out, and some more were. It is not the first time this happens. Malick has a notable history of cutting actors out of his films, which is of course his good right.<br><br>After a typical romantic scene in Paris, more resembling a travel advert then anything else, I start to get nervous. Why? Because the romantic blah-blah doesn't seem to stop. An overhead voice speaking french doesn't make a movie artistic. Loosely filmed scenes in corn fields are not per definition beautiful.<br><br>Kurylenko, in the role of Marina, comes to the hometown of Neil (Affleck), some nowhere ville in Oklahoma where they continue their fairytale romance. Kurylenko is constantly doing little dances and pirouettes on the street, or where-ever she is located. Giggling, singing, hopping on the bed, and looking over her shoulder while laughing towards the camera. That kind of sums it up, since Affleck hardly speaks a word. He is just the typical guy and she is just the typical so called-artistic-french-loving-and-beautiful girl. After she and her daughter return to Paris, he has a identical affair with his hometown sweetheart (McAdams), as if super attractive women are just available everywhere. Then Kurylenko returns, because she needs a Greencard. Explained in just one very meaningful phrase \"Forgive me\" they have a fight. Also very typical (but yes, finally some action!). Of course some kind of vase is shattered and its all tears and gestures.<br><br>Then suddenly Javier Bardem appears as a priest seeking spiritual fulfillment in a church. These scenes seem detached from the rest of the story, although the same church is visited by other characters. Some cleaning personnel and people who are 'worn down by life' are also given some screen time, placed randomly into the movie (in high contrast to the blazing beauty of the main characters).<br><br>The religious undertone becomes stronger and stronger towards the end of the movie, making it all too clear that love and religion are one and the same. And that all of the Hallmark-inspired beauty seen before must be powered by the divine.<br><br>Enforcing religion onto an audience reminds me of brainwashing, and it is something I cannot appreciate. Showing religion in a movie is no problem; since it is a part of most people's lives, but trying to emotionally convey someone to a certain religion, doesn't matter which one, should be a priest's job not a film director's.<br><br>I must say I admire the wish to look upon cinema in new ways, and I can see very clearly what the idea was for making this movie: Malick tries to tell a story by not showing the key moments, conversations or explanations: he shows the in-between. The silent moments, 'life'.<br><br>This is how the movie fails: there doesn't seem to anything in-between. The emotions seem empty, love seems superficial, religion is fake.<br><br>The thing is, I applaud to art cinema, I am very much fond of romantic stories, I love it when a filmmaker pays attention to cinematography. Maybe all of this made me more disappointed in \"To The Wonder\" then anyone else.<br><br>After it was finished some applause but also loud booing was heard from the audience. I sure wasn't the only one frustrated and appalled by this movie.","user":"artalways","rank":[145,211]},{"title":"Wonderful visuals don't make a good story","rating":4,"date":"7 May 2013","review":"TO THE WONDER is the new film from master writer/director Terrence Malick. The story begins with Ben Affleck's character, Neil, in Paris where he falls in-love with a single mother named Marina, played by the beautiful Olga Kurylenko. Neil brings his new love and her daughter, Tatiana, back home with him to the United States. When Marina's visa expires and Affleck's character is reluctant to marry her, Marina and her daughter return to Paris. Neil begins spending his time with a childhood friend, Jane, played by Rachel McAdams. However Jane is a woman of great faith, a faith that Neil does not share. Back in Paris, Tatiana leaves to go live with her father and Marina becomes depressed, longing to return to the US to try to work things out with Neil. It is at this point that the story falls apart.<br><br>It's impossible not to compare TO THE WONDER to THE TREE OF LIFE simply because the two films are shot in the exact same style. Beautiful shots and gorgeous cinematography accompanied by a classical score and poetic voice-overs from the characters. The Tree of Life was and is not only a masterpiece, but one of the greatest films to ever be made. I thought maybe To The Wonder was a little too soon for another Malick epic but I do not believe that is the case as far as why this film fails.<br><br>The two characters I felt for and wanted to see more of was Javier Bardem's Father Quintana and Rachel McAdams' Jane. Here we have a priest struggling in his relationship with God and a woman who has suffered through the grief and loss of a child, yet has found a way to continue living in harmony with great faith. These highly interesting characters are under-used as the film focuses more on Neil and Marina, who by the end of the film, we begin to hate.<br><br>The actors do not help the film tell it's story, it almost seems like they walked on-set without a script and improvised their parts. In Tree Of Life we had Jessica Chastain, Sean Penn and Brad Pitt giving the performances of a lifetime, not through dialogue, but simply through facial expression, movement and body language. There wasn't a need for scenes of dialogue, the story was understood. With To The Wonder, I was craving a scene of dialogue towards the end. I didn't want to believe Affleck and Kurylenko's characters were as shallow and selfish as they seemed, I wanted and felt I deserved to know more about them and why they continued to struggle. Why are they so frustrated and angry? <br><br>No matter how abstract or convoluted a film is, I've never had an issue coming to some sort of an understanding and usually, the more a film leaves open for me to interpret myself, the more I respect the film. However, To The Wonder leaves us with two characters we no longer have any reason to care for and the film gives us no way to understand or relate to them in the end.","user":"themissingpatient","rank":[80,113]}]