[{"title":"Humbling with Courage","rating":8,"date":"22 April 2018","review":"Let me say immediately that I loved it or to be more precise, I loved him in it and by him I mean Al Pacino. An act of generosity a profoundly moving performance. I connected immediately with his disconnection. Al Pacino, through his character, is telling us something personal, something important. Yes, it became personal to me, important to me. How rewarding to be able to say that, to feel that about the work of one of the giants of the XXth Century and counting. Thank you Mr Pacino, thank you very much.","user":"totalwonder","rank":[41,44]},{"title":"Talk about bad timing....","rating":7,"date":"24 January 2015","review":"There's a film about an aging actor who is having doubts about himself and his craft. He's thought of suicide and dreads having a flop on the Broadway stage. So, to help cope, the guy retreats into fantasy--and the audience often finds that they have a hard time separating out what's real and what is not throughout the picture. This is the synopsis for the multi-award nominated Birdman and, oddly, also for a brand new movie from director Barry Levinson (Rain Man, Sleepers, Wag the Dog) which stars Al Pacino! Had I not just seen both of these films recently, I wouldn't have believed two films would be so similar and come out independently of each other only a few months apart...but here we have it.<br><br>When the film begins, Simon Axler (Pacino) is falling apart during a performance of a play. He's forgotten his lines--mixing them up with another play he was in some time ago. In a panic, he throws himself off the stage. Soon, after attempting suicide, he ends up in a mental institution. After a brief stay, he's back home--home to an empty house and with few job prospects. Out of the blue, a woman from his past shows up and she wants him. The minor problem is that she's a lesbian...as well as his goddaughter. Sounds complicated? Sure...but it gets worse...much worse. Along with frequent retreats into his fantasy world, a suddenly super-problematic personal life as well as paralyzing stage fright comes one final chance to star in yet another Broadway play. What's to come of all this comeback...will it be a bust?<br><br>The biggest positive this film has over Birdman is its sense of humor. Birdman is awfully serious. The Humbling is serious but the film also pokes gentle fun at Pacino's character and his age--plus there are quite a few parallels to the real life Pacino. I particularly loved the scene at the vet...but that's just one you'll have to see for yourself. Is it better than Birdman? No. But if you liked one, you'll probably like the other...they are both well- crafted and offer some terrific acting.","user":"MartinHafer","rank":[46,58]},{"title":"Actor with gathering dementia embodies the human condition","rating":9,"date":"29 January 2015","review":"Barry Levinson's The Humbling starts with the Seven Ages of Man speech in As You Like It and ends on King Lear. That is, it begins with the comic context of all the various roles we play in our lives on earth, then closes on our tragic end.<br><br>Simon Axler (Al Pacino) is an actor who lives through the doubts, uncertainties and increasing debility that characterize us all. In the opening scene he appears on opposite sides of the screen, debating himself on the effectiveness of his delivery. When he's wheeled into the hospital he has the same uncertainty, trying different versions of his pained moan. He theatricalizes everything.<br><br>All his life experiences are filtered through film and drama. When he sprains his back his girlfriend Pegeen (Greta Gerwig) calls him Richard III (a familiar Pacino film role) but he calls himself Igor (Dr Frankenstein's assistant). The switch summarizes his increasing servility to Pegeen, who shifts from adulating girl fan to increasingly monstrous betrayer (leaving him on his opening night of King Lear). Simon can't even call the lost Pegeen back, pleadingly, without slipping into an allusion to Brandon DeWilde's Joey at the end of Shane. His roles in life blend indistinguishably into the roles of his drama. Lately he has even been slipping from the lines of one play into another, unsettling his colleagues. But then, all the world's a stage and we are all but players, remember? <br><br>Whole scenes are exposed to have been fantasy. He imagines talking to Pegeen at the fertility clinic. He imagines Pegeen's bringing back a beautiful pickup for a threesome, that doesn't materialize. His imagining of Pegeen's mother (Dianne Wiest) telling him he's the girl's father prompts his killing himself at the end of Lear. Where the character dies of a broken heart the actor with a shattered memory and a mercurial sense of self commits a kind of hara kiri. He who lives by the shifting variety of assumed roles dies by one too. When the vet gives Simon a horse painkiller his brief reduction to stupor anticipates the dementia from which his personalized Lear climax saves him. Never has the valedictory spoken to Lear so movingly applied to the actor.<br><br>The film's ostensible focus on theatre and acting opens into the broader sense of human identity and the individual's spectrum of self-presentation. Pegeen runs her own range of roles: childhood fan, college prof, an administrator's lesbian lover, a trans- sexual's ex-lover, her disappointed parents' daughter. Even as Simon's lover she moves through adulator, mistress, caretaker, exploiter and finally abandons him at his greatest moment of need. Pegeen rejects Prince because in his sex-change he spoiled the beautiful body he had as Priscilla. Talk about role-changes.... Simon hears Pegeen reject Prince because she doesn't have sex with men! He's emasculated by their affair.<br><br>Indeed Simon finds his habitual solitude overrun with lunatics: the mental patient who hounds him to kill her husband, Pegeen's ex who stalks Simon and who implicates him as accomplice, the trans-sexual who tries to make a role for himself in Pegeen's new life. As all the world's a stage Simon's life teems with colourful supporting players, as extreme as the comedia del arte types. His lavish house — in which he only occupies the ground level and even there seems not to have unpacked yet after 14 years — is like a stage set, in fact, the stage set of his Lear, played in modern dress against a spare white abstract set. <br><br>As the film is based on a Phillip Roth novel it's a familiar examination of a famous male persona and his inner conflicts, especially in the sexually Absurd world. Here the kinky is normal, as when the mature housekeeper runs through the care of Pegeen's sex tools, orderly arranged in a laundry hamper. And the normal — trying to get through life by playing all the roles we need to — is mad. <br><br>Of course, with a heroic leap of the imagination this 72-year-old critic can relate to the 65-year-old hero's increasing confusion and diminishing capabilities. In the scenes where his injuries — and painkillers — reduce him to a blithering crippled idiot he anticipates the climax of his first performance: \"sans everything.\" Having lost his craft, having lost his audience, Simon as Jaques tries to leap out of his role. He jumps off the stage, injuring himself but oddly creating a public appetite for watching him do a Spider Man Shakespeare again. In his fatal Lear he not only recovers his craft and his audience but manages to trump his earlier surprise. That would be anyone's, not just an actor's, triumphant exit.","user":"maurice_yacowar","rank":[30,37]}]