[{"title":"Cuba still a little off the mark, but much better then \"Sacrifice\". Pretty entertaining thriller thats not too bad. I say B","rating":7,"date":"10 May 2011","review":"Be careful what you wish for. After having the worst day of his life Allan (Hauser) meets Jonas (Gooding Jr) at a bar. After talking to him Jonas says he can help Allan with his problems. Thinking it's a joke Allan gives him the name of five people he wants dead. When they begin to wind up dead Allan is the only one who can stop it. After watching \"Sacrifice\" I was not expecting much from this movie. This one, however, was very good. Even with Cuba's movie choices lately being one step above Val Kilmer's, his acting is far better. He does a good job playing a heartless killer on the verge of death himself. Cole Hauser also does a really good job playing an everyman trying to correct his mistakes. While there are many similarities to \"Collateral\" (and a hint of \"The Shootist\"), this movie is not as good, but it's not a huge decline from that movie. It is a pretty solid action, suspense movie that is well worth checking out. I give it a B.<br><br>Would I watch again? - I think I would *Also try - Collateral &amp; S.W.A.T. : Firefight","user":"cosmo_tiger","rank":[20,23]},{"title":"Be careful what you wish for!","rating":10,"date":"18 April 2011","review":"I do not understand how people can downgrade this movie so badly, the acting is great, the story is excellent, one of the best I've seen in the past 12months and the movie itself is also way better than the most movies coming around on a daily basis. Sadly its not a high budget movie, so the common public would become aware of it, but downgrading something like that is pretty sad. If that is a 2 or 3, then the grading rates should go in the future down to minus 10 at least, because there are a lot of worse movies out there!<br><br>Its the same with another Cuba Gooding movie, Sacrifice, its also way better than the reviews show, but thats is a different subject. Maybe he is not so liked anymore...:-)<br><br>To me The Hit List is a good 7-8...not a 10 (except the story itself), but in regards of the downgrading, I upgrade it a bit. The story of the movie is simple, be careful what you wish for, even when you are drunk...because sometimes wishes come true! <br><br>More I do not want to spoil. Conclusion: absolutely worth the time watching and money as well...!<br><br>(I do not write many reviews here, only when I see that a movie is so badly discredited like this one!)","user":"Julian0922","rank":[86,121]},{"title":"Could have been worse... but not that great","rating":24,"date":"24 May 2011","review":"I've come to the conclusion that Cuba Gooding Jr. has accepted his downfall to direct-to-DVD movies, because he doesn't seem to be trying to pick good projects anymore, including this one. In fairness, this project isn't as bad as some of his other turkeys. For a low budget direct-to-DVD project, the production values are okay, though there are signs of cost-cutting throughout (such as a number of close-ups and very few wide shots). The police in this movie don't come across as dumb as they do in other B movies, and the movie did interest me enough to wonder how the situation would be wrapped up in the end - though honestly, it wasn't worth the wait. The screenplay has a number of other problems, with some decisions by the hero to be so idiotic that I was groaning out loud, and some implausibilities by others that make no sense when you think about them closely. (For example, think about the way Gooding's character kills the second person on the list.) Gooding is simply unconvincing as a ruthless hit-man, and Hauser has to somehow make his stupid and spineless character sympathetic, which sees far beyond his abilities. If you ask me, more thought and planning went into the fancy opening credits sequence than with the rest of the movie.","user":"Wizard-8","rank":[25,32]}]