[{"title":"You might not agree with what it has to say, but Polley has made a bold and impressive film","rating":8,"date":"26 December 2012","review":"Common terms associated with movies about infidelity would be \"lust,\" \"passion\" and \"betrayal,\" yet all those things are suspiciously absent from Sarah Polley's infidelity drama, \"Take This Waltz.\" Her film is about as anti-soap opera as you can get — careful to avoid melodrama and dedicated to sidestepping any and all conventional depictions of adult relationships in film.<br><br>It seems odd to call Polley bold for showing it like it is, the way that she drags us through the head of her main character, Margot (Michelle Williams), who so undeniably loves her husband, Lou (Seth Rogen), yet cannot deny her feelings for Daniel (Luke Kirby), a man she meets while away for work who turns out to be her neighbor. However, when it comes to filmmaking, anything that deviates from Hollywood reality can make an audience uncomfortable, so it takes some guts to ignore that filmmaking impulse.<br><br>Consequently, a good chunk of viewers will be turned off or frustrated by \"Take This Waltz,\" losing patience with the inaction of its characters and pulling their hair out over the tension oozing out of the most casual character interactions. Yes, \"Take This Waltz\" can be so uneventful that it verges on pointless, but in time Polley's intentions become very clear.<br><br>As Margot and Daniel get closer, they don't really get closer, and as Margot and Lou drift apart, they actually come off as in love as they've ever been. For much of the film, it's in Margot's head that the cheating is actually happening. Her thoughts and actions are not in sync and it becomes extremely difficult for us to find empathy for her because we feel as though she needs to act on her feelings, to either voice her displeasure to Lou or throw herself at Daniel. That's the Hollywood impulse calling.<br><br>Polley continues to resist, and as challenging as it becomes to watch at times, her film comes out better for sticking to its convictions. As she clearly intended, a switch flips in a scene in which Margot and Daniel ride an indoor Scrambler as \"Video Killed the Radio Star\" plays, an in the loopy chaos of the scene, we (and Margot) find a certain clarity in understanding what's going on between the main characters.<br><br>There's a definite phantasmagoria to Polley's style as well that while visually engaging contrasts a bit with what's otherwise such a nuanced, completely believable film. Several scenes play out like dream sequences, but we later can confirm they actually happened. She seems quite content to toy with our expectations and challenge what we think we know to be true about how love works. <br><br>You couldn't cast a better actress than Williams with a performance that's so hard to pull off. We only identify with Margot because we see her humanity, but it's tough to understand her and in some cases even like as a third-party observer of her story. Williams should be lauded for volunteering for this experiment and selling it as well as she does, especially when you consider that Kirby is a total unknown and Rogen is a poster child for modern comedy, for formulaic comedies that are such a far cry from \"Take This Waltz.\"<br><br>The end of the movie is bound to bother a lot of people, while others will be intrigued at the choice and make peace with what Polley has to say because she frankly makes a good argument. Fidelity gets such a black-and-white portrayal in film and television, though maybe that's a societal thing because of its prominence in religious code. Nevertheless, she utilizes every tool at her disposal to present the gray area that we so quickly jump to deny and shudder to embrace.<br><br>It's tough to really enjoy a film that doesn't emotionally click, in which we don't feel with our hearts that things should've turned out how they did, but Polley has such a beautiful directorial style and conveys her intentions so clearly that \"Take This Waltz\" warrants a certain degree of respect for its bold yet so honest and impressively perceptive take on love.<br><br>~Steven C<br><br>Thanks for reading! Visit moviemusereviews.com for more!","user":"Movie_Muse_Reviews","rank":[86,101]},{"title":"Tastes Like Chicken","rating":7,"date":"15 July 2012","review":"Greetings again from the darkness. We have watched Sarah Polley grow up on screen. She began as a 6 year old child actress and evolved into an indie film favorite. Now, she is finding her true voice as a film director ... and what a unique voice it is. In Away from Her (2009), she told the heartbreaking story of a husband's struggle with losing his beloved wife to Alzheimer's Disease. Now we get the story of Margot, who just can't seem to find happiness or fulfillment within the stability of marriage.<br><br>Margot is played exceedingly well by Michelle Williams. I would say that without the casting of Ms. Williams, this film would probably not have worked. There is something about her that prevents us from turning on her character when she veers from her loyal, if a bit lacking in passion, husband Lou (played by Seth Rogen). Williams and Rogen have the little things that a marriage needs ... a language until itself and the comfort of consistency. What Margot misses is the magic. She thinks she finds that in her neighbor Daniel, a rickshaw driver played by Luke Kirby. Daniel is the kind of guy that every guy inherently knows not to trust, yet women somehow fall for. He is a subtle and slow seducer. The kind that make it seem like everything is innocent ... right up until it isn't.<br><br>Margot has that most annoying of spousal traits: she expects everyday to be Disneyland. The best scene in the movie occurs when Lou's sister (a terrific Sarah Silverman) confronts Margot and tells her that life has a gap and that you will go crazy trying to fill it. It's a wonderfully insightful line from writer/director Polley. Of course, we understand that this is Margot's nature and she learns that sometimes broken things can't be fixed.<br><br>Another great scene occurs in the women's locker room after water aerobics. There is a juxtaposition between generations of older women and younger ones. We see the differences not only in physical bodies, but in the wisdom that comes with age. More brilliance from the script. The one scene that I thought crossed the line was the \"martini\" scene. I found it tasteless, vulgar and far more extreme than what was called for at the time. But that's a small complaint for an otherwise stellar script.<br><br>As terrific as Ms. Williams and Ms. Silverman are, I found Seth Rogen to be miscast and quite unbelievable as a focused cookbook writing guy who has pretty simple, yet quietly deep thoughts about how a marriage should work. Again, this didn't ruin the film for me, but I did find him distracting and quite an odd choice.<br><br>It's filmmakers like Sarah Polley that keep the movie business evolving. Her viewpoint and thoughts are unique and inspirational, and should lead to a long career as a meaningful writer/director. Oh, and the use of Leonard Cohen's \"Take this Waltz\" song fit right in over the credits.","user":"ferguson-6","rank":[37,48]},{"title":"When you just need to get Leonard Cohen stuck in your head","rating":9,"date":"23 February 2013","review":"This film shouldn't work nearly as well as it does. Take This Waltz centres around a two-suitors plot that was tired a century ago, takes place in a hipster-utopia version of Toronto, has multiple comedic actors who've worn out their welcome doing Serious Roles, and its characters are either selfish or dull. But Take This Waltz also has a kind of magic that can wash over the most jaded cinema viewer and make you forget that you've seen it all before.<br><br>Maybe it's Sarah Polley's direction, or maybe it's the brilliant performance of Michelle Williams that makes her character likable against all odds. Maybe the thematic statement about the perils of looking for adventure and the need for constant romance is something that we need affirmed more often against the tide of romcoms and gooey melodramas. Maybe it's just that I really want to live in hipster- utopia-Toronto. But this film stuck with me for days afterwards, its scenes playing over and over in my mind, blotting out all the rest of the disposable entertainment. There are so many indelible images here: a public shower scene which plays pranks on the male gaze, that goofy but somehow powerful 360-degree-rotation montage, and of course the final scene, a coda that grants its central character and us along with her a moment of unmediated joy. And it's that joy that the film understands as being something we maybe have to pursue no matter what its cost. Michelle Williams' abashed smile gives us a taste of that adventure, and like the rest of the movie, it's damn hard to resist.","user":"wandereramor","rank":[25,32]}]