[{"title":"Stop and Think About It","rating":8,"date":"6 January 2011","review":"It's a strange way to fight, without ever seeing the people you're shooting at and who are shooting at you.<br><br>The strongest aspect about this viewpoint documentary is its lack of an opinionated narration. The filmmakers--who deserve commendations of their own for putting themselves in the line of fire for 15 months--let the soldiers and their activities tell the story, the firefights, patrols, attempts to communicate with the Afghans, mundane chores.<br><br>And they let the viewer judge for meaning.<br><br>It isn't possible, however, to truly capture a year and three months in 90 minutes. I did find it curious that so much interview footage was cut. If you see it on DVD, don't miss the interviews shown under special features. Perhaps the director-cameramen wanted to keep the ratio heavier on footage than interviews.<br><br>In one omitted interview, the unit Captain admits that he thought he was responsible for losing even one soldier. He also mentions that one of those killed was the unit Sergeant Major's son. There should have been some way to weave this into the story.<br><br>Another soldier says he hates the terms \"you did what you had to do\" because he doesn't think he really had to do it. Says he doesn't think God will greet him with a playful punch to the shoulder and say \"you did what you had to do.\" It's powerful stuff, the included and the omitted footage. For the most part we fight now with volunteers. The mix of soldiers is a bit different than it was when there was a draft, but \"Restrepo\" shows that American forces still bring a wide range of backgrounds and reactions.<br><br>And it shows that most are still so young that we are still sending kids to do the jobs old men ask them to do. They are brave, fearful, obscene, committed for the wrong reasons, committed for right reasons, and committed for no reason at all.<br><br>It's a powerful view.","user":"bobt145","rank":[46,51]},{"title":"A heart-wrenching documentary","rating":9,"date":"18 February 2011","review":"This is where documentary filmmaking becomes serious. Whatever you are expecting out of this film, chances are you will get a whole lot more. Restrepo follows a platoon of soldiers in Afghanistan who are defending a valley, Korgengal. It is said to be one of the most dangerous valleys in the entire country and these brave men take fire every single day of their brutal campaign. This is a riveting film and it is one of those that you cannot shake. It gives you a glance into the absolute darkest depths of modern warfare and just how demanding the fighting is both physically and mentally. It is a film that gives you a rare look into the horrors of war. And it is absolutely astounding.<br><br>Restrepo is shot at a very personal level. The camera never intrudes on the soldiers during their work, and thank God considering some of the harrowing things they go through in this movie. This film hardly even feels like a documentary in the sense of what we think of documentary today. It is filled with interviews, but the bulk of the movie is truly documenting the lives of these soldiers. We get to see all sides of the emotional spectrum that can be afflicted through trauma. We get to look at how different people cope with such horrors as are experienced in this film. And it is all through such respectful eyes. I never once thought, 'Wow, they should really stop filming this.' Every moment of the film feels so important and the fact that all this was so clearly and eloquently caught on camera is astounding.<br><br>The unequivocally greatest thing about this film is the fact that it has absolutely no political agenda. It really has no alternative motive other than telling the story of these incredibly brave soldiers. The film only seeks to honor the brave men who served our country in the most dangerous area imaginable. This film isn't for the political leaders responsible for the war. It isn't for the military commanders that send these soldiers into battle. This movie is for the soldiers themselves. It is a true soldier's film in every sense. It has a very stern focus on the individual. It makes such an important point out of this aspect that it could have possibly gone even further. There are a lot of men in this platoon and thus we don't get to know any one person particularly well. We get to know the platoon well as a whole and how each man interacts with his fellow soldiers and how they all deal with loss and tragedy. Each individual soldier in this movie is important and the movie strives to show how meaningful that is. It is a remarkably important aspect of the film.<br><br>You won't see many documentaries like this, and there's probably a good reason for this. The kind of footage captured in Restrepo isn't easy to get and you have to be just as brave as the soldiers themselves if you are to accompany them into battle to document their bravery. But thankfully when the opportunity to get such unforgettable footage arose, it was all put together extremely well. This is not an easy film to watch, but in the end it is so remarkably worth it.","user":"KnightsofNi11","rank":[33,38]},{"title":"Shooting Hell","rating":10,"date":"19 March 2011","review":"How does a soft, liberal-arts civilian like me even approach a document like \"Restrepo\"? I don't give myself to blind, reflexive worship of the military; before, I have reviewed \"Taxi to the Dark Side,\" an investigation into some chilling crimes committed by individuals in the armed forces, almost surely with the knowledge and approval of their superiors. This, however, is a film, shot by two insane journalists who spent a year with American Army troops in Afghanistan's Korangal valley, and it portrays men who are different from the rest of us in that they have faced and survived the impossible.<br><br>Outpost Restrepo was named after a beloved comrade killed in action, and it was dug and fortified under constant enemy gunfire. The Taliban just hated giving up the position, and the men describe how they would dig for several minutes, then be forced to pick up their weapons and return fire, and after the gunfight died down, go right back to digging. The outpost is only several hundred meters from a larger base, but in case of an attack, support might as well be stationed in Germany.<br><br>The all-seeing documentarians capture the men's brutal physical labor under a constant state of siege and barely-adequate resupply, until violence and discomfort become life's permanent background. The soldiers are forced to go on regular patrols through the countryside, tracking the progress of development projects and trying to build trust among the locals, whose allegiances are never clear. If they are only listening with one ear, if they're only out to hedge their bets between the fighting sides, who can blame them? <br><br>The film culminates in an account of a firefight during an offensive called \"Rock Avalanche\" – words that the testifying soldiers cannot say without a shudder. The mission consists of the men being loudly airdropped on a hilltop and moving around valleys and mountains until attacked by the Taliban. They push onwards, trying not to think which step will finally trigger the inevitable ambush. The ambush occurs; the live footage cuts out, and for several minutes, we follow the brutal firefight only through the soldiers' testimony. It is gut-wrenching. The pain and terror of the men who return fire without knowing which of their fellows are still alive and if they themselves will live for another minute are suffocating. Then, the footage is back, and we see a private wailing like a child over the dead body of the unit's favorite commander. If this can happen to the best among us, he says, what chance do the rest of us have? <br><br>It is an astonishing thing to contemplate, but even at the end of so much hostile fire, the Americans have the better deal. The young men who passed through the trials are scarred and damaged by their experience, but they knew the date when it would end, and the bird was there to take the survivors back to a better life. The local Afghans' pain has no end. Frightened, grimy faces peer out of gashes in dirt walls. Children hide their eyes, dressed in scraps of their grandparents' clothes. The doorways of their mud shacks open into black pits – even in midday, the sun is unable to dispel the darkness. The village elders are a sight from another millennium – gnarly, weather-beaten, half-decayed faces that seem to have been chopped out of rotting tree trunks. You could easily give every one of them a couple of centuries, but who knows? They may still be in their thirties. I've had some rough years as a child of the third world, but I can't imagine even a tenth of what these people go through in their lives.<br><br>So many excellent films have come out of our latest painful conflicts – \"Restrepo,\" \"Generation Kill,\" \"Taxi to the Dark Side,\" \"Gunner Palace\" Almost all of them have been financial failures. Who wants to spend ten dollars to get depressed and emotionally drained? What exactly are we supposed to feel at the end of \"Restrepo\"? Not hope. Maybe futility, weariness and an incredible desire to think about something else.<br><br>I wondered if the place I saw in \"Restrepo\" really exists on the same planet as the Metropolitan Opera. Will its misery ever end?","user":"proterozoic","rank":[52,63]}]