[{"title":"Ask yourself, what am I expecting from this (or any) experience?","rating":8,"date":"18 August 2017","review":"I honestly don't understand the bad reviews behind this film. I'm writing this, not as a review of the events or themes that take place; but rather, a questioning of expectations from the average film viewer. <br><br>It should be fairly obvious that to enjoy any motion picture, one must enable their sense of disbelief. This means when you watch a fantasy film or show you don't question the reality of wands, spells, dragons, etc. Instead, you allow yourself to be immersed within the story. After all, the entire point of art is to transport yourself within the world of the artist. <br><br>I take issue with criticism from professional critics to the average person on the basis of \"realism,\" \"continuity,\" and/or any other tropes related to the experience of (in this case film), art.<br><br>This movie uses certain themes that have a major impact in the possible near future as its basis for storytelling, and therefore, I can see why some might attempt to hold the themes as a basis to grade its merits. <br><br>I must contest this though as I would say you don't read an Asimov, Clarke, Dick, novel and complain that your predictions of the future aren't the same as the author's do you? While watching this I'm reminded of my experience of watching \"Minority Report\" and it's safe to say that that version of the future hasn't come close to existing yet, but nonetheless it's a masterful bit of storytelling. The point though is this, sure there are holes in almost any plot, especially in films that don't coincide with our present day notions of reality; but what has that to do with our ability to enjoy a film?<br><br>Be honest with yourself for a moment, when you're watching anything but a documentary (and even then..) you're primary concern is the entertainment value. To which, this film delivers in spades. <br><br>There's great drama, great action, great acting, and one person playing 7 roles. What more could you ask for? Anyone who denigrates this film, I have to know, what are your expectations, and what are your favorite films? <br><br>8/18/17 23:38","user":"capn_jazz","rank":[466,622]},{"title":"Not What I Expected","rating":9,"date":"23 August 2017","review":"Let me start by saying that I did not expect this movie to play out the way it did. The acting by Noomi Rapace is nothing but phenomenal. The movie does have the basic, typical plot in regards to the whole dystopia and one child policy that has been seen before. However, the notion of the seven sisters working together to survive was what made this storyline unique. Although Noomi played seven roles, each character had the chance of sharing their story and distinctive traits. I definitely recommend this movie. Netflix pulled this movie out of a hat.","user":"Gilles10392","rank":[239,326]},{"title":"Wow......","rating":10,"date":"9 October 2017","review":"How often do I get to say \"wow\" when I see a movie? Let me tell you, rarely......<br><br>What Happened to Monday is really quite brilliant. It takes the serious real world issue of overpopulation and pits it against the intrinsic human imperative to protect its offspring. <br><br>The inevitable collision that takes place when the need to see the species thrive at the expense of the individual, is the starting point of this film. <br><br>What happens in between is a cleverly crafted mix of sci fi, masterful storytelling, well executed action with a emotional component that's genuinely touching. <br><br>Noomi Rapace of \"Girl with the Dragon Tattoo\" fame hands in yet another show stopping performance, nimbly and ably playing multiple characters, seemingly with ease. That's not to dismiss the performance of other cast members. This is a collectively polished affair. <br><br>This is, for me, a \"must see\" and possibly even \"see again\" sci fi. Ten out of ten from me.","user":"s3276169","rank":[174,251]}]