[{"title":"Brilliantly done dramedy with Hader stealing it","rating":8,"date":"12 September 2014","review":"Upstate NY is the setting for this funny and poignant film about a set of twins who split apart but are brought together by near-death experiences. <br><br>It is difficult to make a movie that can go from laughter to the depths of anguish and remain entertaining or even believable, but \"The Skeleton Twins\" manages it well; but without Bill Hader and Kristen Wiig the degree of difficulty would have increased significantly.<br><br>Hader plays a gay wannabe actor who is not doing well out in LA and paying his rent by waiting tables; Wiig is his twin who has stayed in the small town where they grew up and she is a dental hygienist. Although the flamboyantly gay \"Stephone\" was a Hader favorite on Saturday Night Live, do not expect a stereotype with Milo: this is a human and not a joke.<br><br>Wiig's Maggie is a flawed character, and both sibs are scarred by their dreadful childhood. How they eventually come to depend on each other is a thing of beauty.<br><br>Finally, cheers to Craig Johnson for the way he wrote Luke Wilson's Lance: the straight guy who just wants Maggie to be happy and have his children. Johnson makes him a noble character unlike the buffoon so many in Hollywood would have made of this type.<br><br>The chemistry between Wiig and Hader is incredible, and Wilson is a joy to behold. This is a must-see.","user":"bmennen","rank":[101,122]},{"title":"A Worthy Showcase of Hader and Wiig's Dramatic Chops","rating":7,"date":"2 May 2015","review":"Kristen Wiig and Bill Hader are such comedy wunderkinds that a dramatic role sounds like a waste. We can picture Wiig screwing around a room with the pizazz of Carol Burnett, with Hader, alongside her, spitting out wicked lines in a wacky voice. Though The Skeleton Twins has a handful of funny moments, it is first and foremost a gloomy drama; we may all love Wiig and Hader's antics on Saturday Night Live, but they are blessed with some serious acting talent. It's the Double Indemnity to their Ball of Fire, the War and Peace to their Sabrina.<br><br>Twins Maggie (Wiig) and Milo (Hader) have been estranged for 10 years. They're reacquainted, however, when Maggie receives a call from an unknown number; she is informed that Milo has attempted suicide. In one hand, she holds the phone. In the other is a smattering of pills. It's a coincidence that seems as though God set it up just for them. Maggie immediately invites Milo to stay with her and her picture perfect husband, Lance (Luke Wilson), in their suburban New York home; but just as they begin to reconnect, they are forced to face their innermost demons.<br><br>Milo has been living in Los Angeles for a decade, desperate to become a famous actor. He's seen little success, his life marred with constant disappointment. Maggie knows that she has married a good man, but she is bored with her comfortable, predictable marriage; she's partaken in several affairs and has purposely destroyed any chances of having a baby, something Lance dreams of.<br><br>The people in The Skeleton Twins aren't unstable in a melodramatic fashion. They are disappointed with their lives, ready to do something drastic just to inject meaning into their veins. Milo thought he'd be the bullied outsider that could, one day, come to a class reunion and laugh at his balding, middling tormentors. Maggie thought that she could live in domestic bliss and stay within that bliss. But it doesn't happen.<br><br>The film explores several relationships, going back and forth between Milo and Maggie, Milo and his ex-lover, Rich (Ty Burrell), who destroyed his teenage years, and the siblings and their flighty mother (Joanna Gleason). The conversations glide over and under sheer wit and blood- letting, the characters are written with hundreds of layers. They hit close to home, making us question our own self-confidence and achievements.<br><br>But it's one of those films in which the biggest successes come from the actors. If they didn't have chemistry, The Skeleton Twins would never work. Yet the emotional bonds (good or bad) between the actors in the film are so instantaneously genuine that there is a fluidity that makes the anguish all the more real. The laughs are quick, but they are consistently overtaken by the somber sequences that follow them. Because, in real life, a joke can be thrown off a roof if you open up an old wound.<br><br>Read more reviews at petersonreviews.com","user":"blakiepeterson","rank":[27,31]},{"title":"Dramatic / Comedic Balance","rating":8,"date":"18 January 2014","review":"I went to this film at the Sundance premier based on the cast. Knowing this was a Drama with comedic talent left me hopeful but skeptical that it would not be a fish out of water (watch the film to see why I use that analogy) The movie was great. Kristin Wiig was the star she is. Bill Hader was strong in his first dramatic role and the chemistry between these two successful comedians paid off in spades. I believe Luke Wilson will not get his deserved credit in the film due to the role of the leading players, but he was fabulous. This was a drama highlighting some tough stuff. The talent of these actors and their ability to shift to comic relief was the highlight of the film. Get ready to laugh and cry. It was good.","user":"sssummerson","rank":[43,62]}]