[{"title":"Not so much a disaster film as it is a disaster of a film.","rating":1,"date":"5 March 2010","review":"Avoid this film at all costs. It is unbelievably awful. I rented it thinking it would just be some mediocre sci-fi flick to watch late one night when I was bored, but I was very wrong. It's not just bad. It's horrendously awful. I never finished it and probably won't. An unwatchable bore with no redeeming qualities whatsoever. Bad writing, bad acting, bad directing, bad, bad, bad. Did I leave anything out? I get the feeling that there is some sort of religious theme lying in wait, but I did not actually wait to find out. I only took the time to review it here to save any unsuspecting viewers from wasting their time or money on it. Guess I'm an altruist of sorts.","user":"bill-drendel","rank":[56,66]},{"title":"Bad!","rating":2,"date":"17 April 2010","review":"Strange how there are so many really bad disaster movies around. \"Meteor Apocalypse\" ranks right up there with the bad ones.<br><br>Initially, I had no expectations to the movie, and rightly so, otherwise I would be sorely disappointed.<br><br>The story of this movie is ridiculous and often incoherent. There are so many things and scenes that does not make sense and just makes go \"alrighty then...\" I am sure the director meant well enough with his movie, but it just didn't come together as a greater unity. \"Meteor Apocalypse\" was doomed right from the very first minute, already there it was incoherent and downright stupid.<br><br>The CGI effects in \"Meteor Apocalypse\" are bad, though not the worst I have seen, so that got to count for some, at least.<br><br>Some might find it enjoyable if you got nothing better to do, and just want some mindless way to pass an hour and a half. Expect nothing from this movie, and disable your brain if you are going to watch this movie.<br><br>The plus in this movie is that not all of the acting is all that crappy.<br><br>Sad that so many disaster movies are well-intended, but fail to deliver.","user":"paul_haakonsen","rank":[20,23]},{"title":"Good Talent Wasted on a Bad Script","rating":6,"date":"19 March 2010","review":"Can't defend the script or the dialog, but much of the acting in this sci-fi disaster flick is first- rate, especially if you watch the special features and realize they shot this thing in only 12 days. Joe Lando and Cooper Harris, in particular, do exceptional work under what must have been trying conditions. Lando brings a real sense of desperation and urgency and Harris is compelling as a lost soul along for the ride. They even manage to make some of the horrendous dialog sound human and real. It's a shame they didn't have a better script to work with, but they and one or two others in the cast are well worth watching.","user":"catgirl9264","rank":[19,23]}]