[{"title":"Highly Entertaining","rating":8,"date":"22 February 2011","review":"I happened to be in LA during Screamfest (really enjoyed the festival had a great atmosphere!). I tagged along with a group of friends who are die-hard horror/thriller fans, while myself I tend to steer away from the genre, mainly because it's a genre that has seen it all. <br><br>But I found Needle to be highly enjoyable, a device that allows a killer to kill their victims without physically killing them is a highly refreshing concept.<br><br>While I would of loved to have something more in the deaths (after the first two dying similar deaths) it still captivated me as I tried to work out who was picking apart this group of friends and why (I genuinely didn't pick the killer till the reveal at the end). <br><br>The cinematography was fantastic and was surprised to learn that it was actually a horror film produced entirely in Australia. Well worth seeing, can't wait to take my girlfriend to it and watch her squirm at the deaths! ☺","user":"BradAMajor","rank":[51,67]},{"title":"Something to aspire to","rating":8,"date":"28 February 2011","review":"It's films like Needle that have driven me to become a genre based filmmaker. While I'm only in my final year of film school I've watched quite literally 100's of films in this genre! I had the opportunity to view Needle at a private screening earlier this year, at first I thought it was another run of the mill teens die movie which it still is, however it was first class in the way that they die, it actually made me go back to my script that I'm writing and look at my own killer and if there are ways I could be more original and creative.<br><br>Overall the script was nicely presented on screen however some of the acting in stages seemed underdone (above comment when Travis' character doesn't seemed phased about the gruesome death of someone he knows) and when the killer is revealed seems slightly overacted by the actor (still haven't been able to work out if this is the result of the script, actor or director).<br><br>However highly entertaining and refreshing, it showed me there is still plenty of life left in the genre that I love and can't wait to direct!","user":"xanthecoen1","rank":[41,56]},{"title":"Fresh and fun horror film","rating":8,"date":"25 October 2010","review":"I watched most of the horrors at Screamfest and I saw this with my BFFs. I was impressed with the look of Needle...visually its pretty much perfect...definitely not a film for the hardcore gorehounds, as there isn't much blood, instead there are some good scares with some cool spfx...two of the kills were impressive. <br><br>I really enjoyed this film for two main reasons, firstly it uses a new killing device/machine which i've never seen in a horror film before and secondly because of the great acting. I have seen Travis Fimmel in the Beast and he's way better in Needle...the other actors are great too.<br><br>My ratings are as follows;<br><br>Story - 8/10 Acting - 8/10 Visual - 9/10 Efx - 7/10 Score - 7/10 Blood &amp; gore - 6/10<br><br>I guess overall I'd give it an 8.<br><br>Definitely worth seeing, I can't wait for the DVD!","user":"jane_a_usa","rank":[62,102]}]