[{"title":"A brain off comedy that is a little out of convention","rating":13,"date":"13 September 2012","review":"This film is about several couples who are expecting babies. They run into various troubles and emotional rollercoasters while preparing themselves for parenthood.<br><br>\"What to Expect When You're Expecting\" is a lighthearted comedy that makes you laugh, just like what is advertised. Of course, the way to parenthood is not just happy and joyful, so the film also realistically portrays the unglamorous side of expecting mothers. Some of these are presented as crude toilet humour, while others are presented as emotional rollercoasters that will touch your heart. I like the fact that characters in \"What to Expect When You're Expecting\" do not have a smooth breezy path, but face adversity like in real life. It is an interesting comedy for expecting mothers.","user":"Gordon-11","rank":[17,18]},{"title":"deserves a higher rating in my opinion","rating":8,"date":"21 June 2012","review":"Honestly, the reason for seeing this movie was nothing more and nothing less than the desire to go to the cinema with a friend. With some other movies not interesting her, it was between The Lucky Ones and this one, both movies that have a low score on IMDb. I was pleasantly surprised, however, with not just the actors in the movie but also with the dialogue and chemistry on screen, which seemed very natural. I definitely enjoyed watching it and will most likely end up buying it on DVD; not even the fact that Chris Rock was in it bothered me, whereas I usually can't stand him. I have to applaud Jennifer Lopez too, I never thought much of her as an actress, but I found myself sympathizing with her and liking her portrayal of the character. Over all, I find that this movie deserves a higher score than it's currently got on IMDb.","user":"miarae","rank":[42,57]},{"title":"Oh gee, what a waste of money.","rating":2,"date":"18 June 2012","review":"I saw the trailer for What To Expect When You're Expecting and I thought it looked funny, and more than 1 of the cast members happen to be favorites of mine, but pretty much 20 minutes in, I knew I was going to hate this movie. Out of all of the mega cast movies of late, this is indeed the weakest of all of them. This movie is meant to be a comedy, but I didn't laugh once or even come remotely close to laughing, the cast, some if which are rather talented never get a chance to prove themselves as every scene is so ridiculously short, and the script, talk about a cheese overload, and this is written by Shauna Cross, who wrote a terrifically funny script for Whip It, it's a shame none of the heart, wit and humor that was in that could transfer to this film.<br><br>The one saving grace this film has is the always wonderful Anna Kendrick, her character is the only one worth mentioning, and one particular scene of hers nearly brought me to tears, she's honestly the only person to stand out in this movie, in fact the storyline between Anna and Chace Crawford would probably make a good film on it's own, without having to compete for screen time with 4 other plot lines, I'm sure Anna's next movie will leave this as a distant memory.<br><br>Honestly I just can't even explain how silly this movie is, it's best to just see it and surely you will see for yourself. Just wait for the DVD, giving birth is probably less painful than watching this. Mega thumbs down.","user":"JimmyCollins","rank":[39,57]}]