[{"title":"foul language, tough guys, hot chicks, dangerous drugs, big guns, oh, and a Porche for good measure","rating":8,"date":"17 February 2013","review":"As someone whose taste in cinema does not usually run to much violence, choice language or blood (vampires excepted); I really enjoyed this film! No mere fest of foul language, tough guys, hot chicks, dangerous drugs, big guns, oh, and a Porche for good measure - although it's all there - \"Bonded by Blood\" has much more going for it. Cleverly directed by Sacha Bennett, this film has excellent touches of visual humour, some very funny lines, and a number of intense performances. There is even a Shakespeare reference - but don't let that put you off! Tamer Hassan as Pat Tate, high on cocaine and drunk on machismo is superbly scary. You have to duck when he starts pumping out the expletives. Altogether a much classier offering than previous efforts in this genre.","user":"steventraves","rank":[7,10]},{"title":"Pleasantly surprised","rating":8,"date":"24 December 2012","review":"Im not understanding all the bad reviews here. I think to watch this movie for a start you need to have the acquired taste of east-end London cockney slang and gangster culture (drugs, sex and a lot of the word c**t) I was sceptical about this one... i kind of gave up with anything Tamar Hassan is in due to the disappointing movie releases he has had since The Business by Nick Love. I watched the likes of city Rats for example and was shocked he would take part in such a crap movie after the success of the Business. I feel like Tamar Hassan has been trying to get that 'right movie' of the cockney gangster that works well and has failed until this one! I saw this on Netflix so on a rainy day gave it a go with super low expectations expecting to turn off by the quarter way through mark. I was wrong, i was hooked on this one. Had a good few laughs at the raging scenes which are full of colourful language and i thought the storyline was enough to keep me watching. Stunned at all the bad reviews on here.","user":"djkbee","rank":[7,10]},{"title":"bonded by blood is terrible","rating":1,"date":"5 September 2010","review":"I am so disappointed just travelled 65 miles to see this garbage. The movie has some good actors in it yet none of them show a ounce of any of they true talent.The story is poorly put together and doesn't really follow a theme or character from start to finish. The main focus is sniffing drugs and swearing and believe me there had a good true story to work on,Tammer Hussein who is a good actor when he puts it on was crap as pat Tate,Craig fairbrass makes him look like harry potter.This film makes you cringe at nearly every scene.<br><br>Overall not worth a 2nd thought.When will someone pull there finger out and give us another ROTFS or the business type film.<br><br>To be truthful i think never......","user":"birdman99","rank":[23,44]}]