[{"title":"Not What I expected","rating":5,"date":"19 May 2017","review":"Loved the books! But the movie was not very well produced... Even the Mortal Instruments, that also had a lot of very bad reviews... was better than this book adaptation. The cast is good, they are perfect for the roles. The whole movie leaves a very incomplete feeling, it leaves you with the feeling that you were supposed to see something happening that actually did not happen. It did not felt like a movie, it felt like a long trailer.","user":"freakche","rank":[58,59]},{"title":"Subpar and poorly produced","rating":2,"date":"7 March 2017","review":"Ι read the Fallen series years ago and when it was announced it was finally being made into a film adaptation i thought it would come sooner. The book rights have been optioned ever since the first book came out in 2009. Fallen started filming in 2014 and after two years of silence and everyone thinking it would be scrapped eventually, the film came out in a few countries without any promotion or marketing. A movie that it is essentially released on its own cannot be a universal success. I'd say the lack of proper marketing set this saga up. I don't believe a second film will see the green light. Aside from the terrible release strategy, the theme of this series feels too dated for 2017. The trailer of the movie was very Twilight from beginning to end. To be fair, the first book has a lot of Twilight elements but let's remember that the book came out when Twilight was the It movie of the late 2000s and books similar to this story sold like hot cakes. The movie and the book are somewhat similar but i wouldn't call it faithful to the original material. The castle they used as Sword and Cross is very beautiful which is part of the problem. The movie spends too much screen time with beauty shots of the school and forest scenes filled with smoke effects to set the mood. I cannot recall how many times i saw drone shots of the school being surrounded by chunks of smoke. Like, we get it. They also used smoke/steam inside the swimming pool which didn't make much sense since it wasn't a hot bath or a sauna. Addison Timlin as Luce is fine considering i am not a fan of Luce in the books. She is extremely restricted due to the script. Like every character in this movie she is reduced to brooding silences and looking sad. One of the biggest flaws of the book was translated into the screen unfortunately and the side characters are given zero time to unfurl and develop. They are in the background, throwing a couple of lines and then we never see them again. They are so insignificant i feel sorry for the actors. <br><br>Jeremy Irvine is a one dimensional Edward clone who thankfully isn't as rude and condescending as he was in the books but he has zero charm. He is either avoiding Luce or picking a fight with the other walking cliché, Cam. Cam was one of the most interesting, if not THE most interesting character of this series. He is supposed to be popular, charming, fun and sexy. In the movie we get a young Leo lookalike dressed in leather, pretending to be dangerous but doesn't do anything remotely dangerous to cause any attention. He is forced and pretentious, hidden behind a so called mysterious persona which doesn't offer anything. The actor got so caught up in Cam's demon nature that he omitted everything that made him an intriguing character. Also the attempt for a love triangle is so blatant it's hard not to laugh about the lack of substance. Luce has visions about her past lives with Daniel yet she's canoodling with Cam because no one knows why. As soon as the truth is revealed she forgets about Cam and she immediately chooses Daniel without any buildup or good reason other than the film coming to an end. The only character that is actually trying to pierce the screen and get out of their box is Penn. She is geeky, sweet, funny and it is quite sad her end was so anticlimactic. Lola Kirke was really likable as Penn and if the saga continues, she is something to be missed. <br><br>Let's move on to the things that hardly made sense like the atrocious script that ruined whatever potential this movie had. The script consists of awkward phrases and none interaction. Whenever there is actual dialogue the scene ends. It was like the director wanted the characters to wander around aimlessly and let the audience guess about the story. The dialogue is partially and even at times, completely overlooked as if it has no significance in a story. When the story is about to take off the film is over. 85% of the screen time is devoted to Luce's backstory and religion mythology which has way too many scenes. Learning about angels in a reform school? Why would they need to learn how to fence? Is it safe to give weapons to kids with psychological issues? We also keep hearing that everyone is dangerous and a troublemaker but the students seem perfectly normal. The surveillance is laughable since they are able to throw loud parties in the woods unsuspected and everyone comes and goes as they please. In the final scene Penn is murdered, Luce is screaming and Daniel breaks through a glass dome but no one hears anything. <br><br>The production for a fantasy film is poor. The wings look small and unconvincing, the entire rooftop scene is shot inside a studio and the transitions from scene to scene are terrible. There is a motorcycle scene that I still wonder how it ended up in the film and what purpose it serves. There's also too much blurriness in certain parts that can be annoying to the eye. Instead of spending money in smoke effects and ridiculous studio filmed motorcycle scenes with fans they could have done a better job with the editing and the screenplay. The flow is chunky because of the short screen time. 400 pages squeezed into 1 hour and 30 minutes and the result is rushed, badly produced, and forgettable. Fallen could have stood a chance if the production company had tried harder.","user":"maryrock-58-690964","rank":[81,92]},{"title":"No end, no story, what the heck did I just watch?","rating":1,"date":"26 March 2017","review":"Movie was rushed and did not have an end. Did she survive? When the movie ended, all I was thinking was WTF. What happened to the friend? Did the angels bring her back to life? They said they would take care of her. What happened to the girl? Did she survive? The movie left me with more question than answers. The movie could have been so much better. There was too much focus on on it being artsy, not enough on the story line. The plot had no end.","user":"justchillz","rank":[68,80]}]