[{"title":"Understated, Interesting, Familiar, but ultimately a Let-Down","rating":5,"date":"6 November 2012","review":"\"Gut\" has a familiar feel to it. If you've seen \"Thesis,\" \"Videodrome,\" \"A Serbian Film,\" The \"August Underground\" series,\"8mm,\" or any of the other dozens of films covering this topic, this will feel like tread territory. \"Snuff\" films and their impact still represent a valid sub-genre, but \"Gut\" unfortunately brings little new to the table.<br><br>The story has many elements which will ring true to viewers: boring married life, soul-sucking work banality, an old friendship that has lost its zing, love of horror films; but while these parts make for identifiable characters, the film seems to wallow in them rather than rise above their baseness. It could be argued that the banal qualities are where the real horror lies, but the actors don't quite have the chops to sell it. The understated nature of the more violent parts of the film are well done and look believable, but this only echoes the feel that the film has fallen short. I certainly love understated films. \"Beyond the Black Rainbow\" was maddeningly open to interpretation, but left me feeling stunned and violated. While \"Gut\" definitely aimed for a similar jarring, I don't feel it quite succeeded.<br><br>The production presents a host of wins and losses as well. The film looks very good. Shot with a careful eye and a steady hand, the camera observes more than it dazzles, which makes for a calmer viewing experience. I was never annoyed by the editing, which is always a win when you're a long-time horror fan. The score has great and awful elements to it as well, as the hypnotic, delay and distortion-heavy, simple guitar ambiance is essentially a character itself. Almost endless, these guitar notes pluck in and out of the soundtrack without abandon, often interrupting quiet dialog or coming off as a practice recording. Additionally, the acting is wildly uneven. Several 3rd-tier characters' lines come off as forced, and the leads barely contain the film. For a movie consisting largely of dialog-free, music-driven scenes of people dealing with emotions quietly, I found this disappointing and surprising. The lines are often delivered with an unattached quality that never resonated with me. I could never forget that I was watching amateurs, and this was a detriment to the film's success. The sex scenes are frequent and relatively good, so there's that. I'm kind of over boobs and boning in horror, so it normally feels obligatory to me when it's there. That being said, the erotic displays in \"Gut\" are well-executed. <br><br>I hate critique. It never feels just. I didn't go through the laborious process of making a film, so where do I get off criticizing it?! Ha. I guess I'm writing this to warn the viewer what he/she is getting into. The trailer for this film is great, and completely won me over. But horror trailers (or trailers in general, for that matter) are often awesome, so I guess it comes with the territory. If you've never seen a film about Snuff, then you might like this more than I did. I suggest \"Thesis,\" though.","user":"thelixxxmerg","rank":[25,34]},{"title":"Works in the end","rating":5,"date":"19 October 2014","review":"You have to endure a lot until the movie actually delivers. Which is the loaded end, that is really suspenseful and might keep you on the edge of your seat. If you let it, of course, because you might be so annoyed by that point that you don't care anymore. It's not only the \"worst decision\" possible thing, that brings the movie down, it's the essence that seems to be missing (would have worked a lot better as a short movie or with a better worked out script).<br><br>As it is, the end might leave you with a gut pun(ch), but not really satisfied. The acting isn't really good, the dialog either, nudity will either be considered positive or negative in your book, depends on you. Overall a decent first time effort, if you don't have anything against small budget (looking and feeling) movies","user":"kosmasp","rank":[4,4]},{"title":"Interesting but a little to slow thriller","rating":7,"date":"18 September 2014","review":"GUTS is the type of independent movies you do not expect a lot and end up getting really hooked into it. <br><br>Two friends; one of them in the middle of a crisis and the other a lonely (and a little wacko) get obsessed with some snuff videos; and things start getting ugly. <br><br>It is important to note; the good taste and quality filming of the bloody scenes; that reach the desired effects without becoming a gore feast.<br><br>As interesting as things become; the script is not developed enough to fill 90 minutes; so there are many over extended scenes and an irregular pace.<br><br>The small groups of characters; is intimately presented; but their particular conducts or problems never fully explained; thus reaching a tragic but ambiguous conclusion not completely satisfactory in my personal opinion.<br><br>In brief; defects apart; the film is worth watching and the director is one to follow up.","user":"abisio","rank":[5,6]}]