[{"title":"I love Casey Wilson and June Diane Raphael, but this movie is no good","rating":5,"date":"17 November 2013","review":"A comedic dud. It's very unfortunate, because it stars and was written by two of my favorite comic actresses, Casey Wilson (Happy Endings) and June Diane Raphael (NTSF:SD:SUV::). It was a labor of love for the two of them. They ran out of money at one point, halfway through filming, and had to delay the rest of the film for a year or more before finding another backer. Unfortunately, the film is just never funny. The two actresses themselves can be kind of amusing, but few laughs result from their antics. The two play former child beauty pageant participants, now in their early 30s living in New York. They get an invitation to a beauty pageant reunion, and decide to take a road trip to participate once again. The problem: they're total idiots who were terrible when they were kids and who are just as terrible as adults. There are many adventures along the way, almost none of them funny. The film wants to be an absurd comedy, but it also wants a bit of an emotional response. The two protagonists are too silly (and, frankly, unlikable) to ever be taken seriously, so all of the emotional moments fall flat. I have to admit, as much as this doesn't work, I'm too in love with the two actresses to ever not enjoy their presence. It's also too short to have really provoked anger in me. The supporting cast is generally good, too, including Vincent D'Onofrio, Bob Odenkirk, Alicia Silverstone, Paul Scheer and Sandy Martin. And Jon Cryer, who's awful, as usual.","user":"zetes","rank":[15,20]},{"title":"Just God Awful","rating":2,"date":"9 December 2013","review":"OK we get it. Your two idiots out on the road in this \"road\" picture. I like both ladies and of course more familiar with Casey as a former SNL alumni But....This film is nearly unwatchable. Dumb and Dumber...same premise but funny! Ass Backwards..Unfunny. And of course this is meant to be a comedy (I think). All in all I was lightly amused and do find both ladies likable in their pathetic squalor of loquacious losers. The big finale where they finally make it to the pageant is so poorly directed I was choking my own neck in disbelief. Perhaps in better hands Ass Backwards would have been rather comical but I do hope they don't plan a sequel to this mess as I will fondly pass.","user":"Pookey-2","rank":[16,24]},{"title":"Not even those painted on smiles in the poster should fool you.","rating":1,"date":"15 November 2013","review":"No, no, no, and for the Third time trying to watch this load of crap, No! Creepy is only funny when they are not going this far out of their way to be creepy. This is the Dumb, and Dumberer ladies choice edition, written by morons who \"partook\" just a bit too much of the \"inspirational\" \"substance\" and actually started thinking this was funny. On the tails on movies like Bridesmaids,and bestman down, they try to wash this kind on nonsense down your throat, but they forget, you didn't have to go out to rent that movie, you could tell from the first ad you saw what a marvel of nonsense they had brought. The real shame of this movie is the cast, a really solid group were brought together only to throw pennies in a pot, and call it a Leprechaun pot o'gold. All the power to you if you Enjoy this, but I sure didn't, and won't be trying again either.","user":"face-819-933726","rank":[11,17]}]