[{"title":"Rather beautiful and sad","rating":8,"date":"10 December 2011","review":"I went to the cinema on the spur of the moment, I had a couple of hours to kill. I scanned the billboard for anything that might seem vaguely interesting - \"Another Earth\" sounded science fiction-y so I bought my ticket and went in.<br><br>It's important I explain this for two reasons: first because I saw this movie \"tabula rasa\", having not seen trailers, read reviews or having any idea what it was about. Secondly it became evident from the bad- tempered muttering in the back I wasn't the only one to have done this.<br><br>At first I struggled with the concept, but I kept an open mind and a very different movie to the one I thought I would see developed, and was actually quite well done. After about 20 minutes I was ready to get up and leave, but giving it time paid back dividends, by the last half-hour I had become too involved to consider leaving.<br><br>The story is a slow burner that grips you incrementally, and while the occasionally grainy or out of focus shots give you the strong impression this was made on a shoestring, that is no reason to hold anything against it. Having seen the high budget yawn-fest \"Transformers\" I can actually say that given the current state of big budget science fiction this is a refreshing, if a bit left-field approach to the genre.<br><br>Evidently my companion viewers in the cinema, a small group of guys, were not getting as much out of the deeply troubled love story that forms the basis of the plot, and they made their discontent very audible to my irritation.<br><br>In brief, not a film for everyone, but if you're in the mood for an introspective slow-burner and you've got the patience for it, this film will prove a rewarding experience","user":"ix-viii-ix","rank":[142,177]},{"title":"This Me or That Me?","rating":7,"date":"26 July 2011","review":"Greetings again from the darkness. An award winning film at Sundance, this one seems to carry the same polarizing effect that \"Tree of Life\" does. The reviews and comments have been discordant and contentious. After sitting through a Q&amp;A with Mike Cahill (co-writer, director) and Brit Marling (co-writer, star) I am guessing they are taking great pride in the love/hate responses. Their film was designed to take you deep ... make you think and self-analyze. This is not a fluffy Owen Wilson rom-com. Explaining what it is, well, that's a challenge.<br><br>The story begins with Rhoda (Brit Marling) out for a night of partying. We learn she has been accepted to M.I.T. and that she is quite the space and astronomy lover. Her very poor decision to drive home after drinking results in a horrific accident that changes her life and that of a young family. At the same time, scientists discover \"another Earth\" has been hiding on the other side of the sun. Flash forward four years as Rhoda is released from prison.<br><br>She is a broken spirit whose bright future has been dashed. She tracks down the man who survived the crash she caused and has every intention of apologizing. Instead, she cleans his house. She finds John (William Mapother) has dropped out of society and found numbness in the bottle.<br><br>I won't say more about the story because it is really something to watch unfold. What I will say is that I found the advertisements to be somewhat misleading. This is not a sci-fi film per se. Sure the second earth brings about numerous questions concerning the \"other\" us. What would we say? How would we react? Have I done better there than here? But that is actually an underlying element to this story ... always present in our thoughts and those of Rhoda. Instead, this film is a psychological drama. And a dark one at that.<br><br>You will recognize William Mapother (The Grudge, Lost), who plays John. He has a regular guy look to him and stretches well from happiness to depression to, once again, showing a spark. Brit Marling is one you don't know, but will soon enough. She is an amazing presence on screen and avoids the Hollywood acting crutches. She plays Rhoda as the damaged, confused creature she is in the story. Very well done.<br><br>A couple of other interesting notes include Kumar Pallana (The Royal Tenenbaums)as Purdeep. With minimal screen time, his character provides Rhoda with a lesson she needs. There is also a scene where John plays a saw as a musical instrument. The sound is amazing and the music is actually from Natalia Paruz, who is knows as the \"saw lady\". Other music in the film is outstanding and courtesy of Fall on Your Sword. Very unique, but a perfect fit for the film.","user":"ferguson-6","rank":[165,224]},{"title":"Suspend disbelief, and love this movie","rating":9,"date":"7 July 2011","review":"I am a psychiatrist and psychotherapist who can tell a hawk from a handsaw, and there is a wonderful handsaw in this movie. So, I feel qualified to tell you it is safe to see this movie as it is, without worrying about details like gravity. Do not allow unimaginative naysayers to keep you from enjoying this gem. I mean, we all can enjoy vampire and zombie movies, right? Is any movie any better than \"Let the Right One In\"? I saw this movie last night in Brookline Mass at a Q&amp;A preview, with director, writers, and an actor -- all combined in two lovely people. No one in our sophisticated audience that included a CETI scientist cared enough about the \"laws of physics\" problems to mention them in the question period. All we cared about were the endearing characters, the music both acoustic and visual, the plot developments, the shocking climaxes, the compelling emotional plausibility. <br><br>The movie is not about anything as terrestrial as gravity. In the world of this movie, something has happened to upset some kind of cosmic symmetry, and the other earth has appeared from a parallel universe. I do wish some character or other had dispelled the physics with \"I don't know why our orbits are not affected\". But, the metaphor works as a way to discuss looking at oneself. It really does not matter. The acting is perfect, the camera-work perfectly beautiful, the plot deeply affecting with wonderful surprises.","user":"jesus-100-984521","rank":[358,526]}]