[{"title":"Whatever mother says......","rating":5,"date":"29 April 2012","review":"It took me about 45 minutes into the movie before I realized that this movie was very loosely based on the life of Theresa Knorr and the horrors she inflicted upon her children. I read the true crime book \"Whatever mother says\" a few years ago and that was hands down the most awful real life story I have ever read in my life. This movie does not even begin to come close to the book. After watching this horrible effort of a movie, I realized that the unspeakable acts of Theresa Knorr cannot be turned into a good movie. If you want the know the real story, you should read the book. It is completely different, apart from a few of the horrors shown in the movie, but the book is actually a hundred times worse and more painful. Read it to educate yourself in the world of true crime, but be prepared for a disgusting ride into reality.","user":"pecosa-357-988967","rank":[24,28]},{"title":"Very well acted but flawed horror film.","rating":5,"date":"10 May 2011","review":"Maggie (A great, if slightly manic performance from Leslie Easterbrook, aka Callahan from Police Academy!) is a god fearing Christian woman, married to Hank (A nicely done cameo from Kane Hodder). When their marriage fails, due to Maggie's uncompromising fire and brimstone style views, Maggie becomes bitter, resentful and beset with financial woes. Taking to the drink, she begins endlessly watching the public access TV show of the Cowboy Preacher (JD Hart), who comes to visit at times. Spare the rod and spoil the child, the family must stick together, is what the cowboy preaches from Maggie's TV.<br><br>As the financial difficulties worsen, Maggie begins to fancy she can converse with God, and that her children should pull together, and chip in anyway they can. If that means doing things they normally wouldn't do, then so be it. And if any dissent ensues, well, Maggie is more than willing to dispense her own quite vicious brand of discipline, because spare the rod, and spoil the child, after all...<br><br>The Afflicted is a well shot and well acted horror, with good performances all around, from a nice cameo from Hodder to an excellent (if again, slightly ott) performance from Easterbrook.<br><br>It's also pretty grim, with a bleak tone, and will probably inevitably draw comparisons with The Girl Next Door. However, my main beef with this was that it requires serious suspension of disbelief, and I'm actually wondering if it really is based on a true story as it claims or if this is just a marketing ploy, the way Wolf Creek was supposedly based on a true story, when in reality it was simply loosely influenced by a number of true life cases.<br><br>The kids, who are all between 17 and 18, one of them a guy, have ample opportunity throughout the film (at least by default anyway) to either escape, report or even overpower Easterbrook, yet don't. This detracts from any tension, and makes it hard to take the whole thing seriously. Most if not all of the supporting characters outside the family are stereotypical rednecks, and towards the end, you're just kinda waiting for things to finish.<br><br>The Afflicted isn't precisely a bad film, it's more of a flawed one, but overall, I found it neither stand out or substandard. It just failed to leave a lasting impression on me, well made and well acted that it was. 5/10 probably worth a look actually, to make one's own mind up.","user":"Corpus_Vile","rank":[23,30]},{"title":"What an awful performance and filming and writing","rating":1,"date":"18 July 2019","review":"A bad horribly done movie. I can't believe it's even advertised to watch. It's so horrible. The story deserved better writing and better acting. I can believe this kind of garbage is on the air.","user":"gulfshoresscraps","rank":[4,4]}]