[{"title":"Small town American gets a poignant look","rating":8,"date":"22 April 2012","review":"A poignant story about the desire to expand one's horizons and the dangers of drifting away into emptiness and loneliness. The film centers on young Bubbs (Writer Nick Loritsch) wants to leave Panama City, Florida and travel the world like his grandfather who is despised by all in the town for the grief he has caused Bubbs' mother. The film features gorgeous photography of the Floridian Coast accompanied by a soundtrack featuring country music by Jay Vincent. The film's central focus and probably greatest asset is a tremendous performance by Jackson Pyle as Frank, Bubbs' free-spirited grandfather. Pyle carries himself with a strong sense of gravity, but always pokes in a little joviality when one least expects it, giving an otherwise weighty story some levity. The rest of the cast provides strong support, but it is Pyle who carries the film on his shoulders throughout.","user":"franalejo19","rank":[7,14]},{"title":"Beyond Refreshing","rating":10,"date":"27 April 2012","review":"\"Born and Raised,\" feels purely authentic in its astute interpretation of a small town dynamic. The creators truly captured the essence of this lifestyle by even including a bizarre moniker, like a main character named, \"Bubbs.\" The movie cut to the core of some meager mentalities by including individuals' habits of smoking and drinking, sick cycles of young vacillating relationships and minimalistic social lives in empty bars.<br><br>Beyond the imagery and lifestyle of these folks, the true theme of the film is finding and creating one's own path in life. It explores how some may not find peace within their community as they desire adventures outside of the walls that have been built for them by their own family's experiences, heartbreaks, fears, and struggles. The core of this script is exploring the fine line of happiness which can be between what one has and what one desires. To find this balance while remaining true to your own set of internal motivations, sans the hopes and dreams others have for your own existence, can be an overwhelming struggle. Finding this internal strength to walk away can feel almost paralyzing.<br><br>This movie has a raw portrayal of characters that captures real issues of heartache, abandonment, physical abuse, substance abuse, and yet the characters still exhibit courage, curiosity, and resilience while attempting to enter a future of unknowns.<br><br>The production of this film is far from today's \"Hollywood\" standards which makes it magnificently raw and gritty. The main character literally has a major blemish on his face which is so refreshing in a day where most actors are covered in make-up or the flaws are edited out after the fact. This made the production practical, since most lower income individuals wouldn't spend mass amounts of money on proper skin-care products.<br><br>The characters are dressed like normal, earthy people. The female characters aren't glamorous, glitzy, or dressed in provocative clothing, which makes it easier to focus on the storyline instead of being sidetracked by their unmentionables. <br><br>Even the backdrop of the movie, with the scenery in muted shades of gray and the beautifully executed soundtrack, sets the tone to magically allow the audience to feel the conflicts the characters are enduring while still trying to find and implement forgiveness and acceptance for those that have destroyed their hearts. To watch the characters show mental fortitude and composure while having the hope to press forward, in times where they could be crying, was admirable and an accurate testament to the resiliency of people living in a small town.<br><br>This is a production based on the voyage of the seeking out the adventures in life, while straining to see how to move on without abandoning family and friends. It captures the genuine tug of war between responsibility and freedom. The writers deliver the sincere sense of the word, \"Home,\" a place one can leave yet always come back to, no matter where one finds themself in life. \"Born and Raised,\" was beyond invigorating from the script to the implementation!","user":"JeniSweckerRenshaw","rank":[8,18]},{"title":"Truly fantastic film!","rating":10,"date":"17 June 2014","review":"I stumbled upon this film purely by word-of-mouth and was absolutely blown away.<br><br>I had no idea what I had gotten myself into when I chose to watch this. I only knew that it was a coming-of-age film about a young guy from a small town who wanted to experience more beyond the confines of his sheltered home. The realization that I was watching a story about a curious and driven person who was challenged to balance duty to his family, loyalty to his friends, and inherent need to forge his own path was an incredible shock that resonated to my core. Moreover, I was also impressed by how this film skillfully portrayed delicate and complex issues including abandonment, domestic violence, and heartbreak in a way that truly felt organic and authentic. <br><br>It made me laugh. It made me sad. It made me reflect on my own past and I thoroughly enjoyed this thought-provoking film. This film is definitely an amazing piece of work and I absolutely recommend checking it out!","user":"faintlunacy","rank":[3,6]}]