[{"title":"Too many bitter reviewers...","rating":9,"date":"3 September 2011","review":"After perusing other reviews for this movie, I believe that many of the ratings are low, not because viewers disliked the movie, but because they disliked the element in which the film shines. The film succeeds in drawing the audience into the friendship between the main characters, played by Jim Sturgess and Anne Hathaway. Both characters find happiness and meaning in parts of their lives, while suffering through other portions without attaining goals they've set for themselves; i.e., this is real life.<br><br>What the poorly-rating reviewers seek is escapism. In my view--however limited--this film aims to depict two human beings as they learn, grow, and fall in and out of touch with one another. Thus, don't expect any fairy tales here and don't punish the rating on this movie because it isn't a fairy tale! <br><br>A predictable conclusion to this movie would place Sturgess and Hathaway side by side, married, and living together untouched by the trials of a realistic relationship. Instead, the director effectively and with calculation showcases some of life in the scenes and merely hints at events not shown on the screen. As the film narrates exclusively through one date each year (hence, the name), partial narratives are expected. The final third of the film, shunned by a few reviewers, elevated the creative vision of the story because it introduces the unpredictable nature of real life into a movie that was otherwise a run-of-the-mill romance. Again, speaking in terms of the development between characters, the movie is above average. Speaking in terms of storyline, the first two-thirds, to a certain degree, lack what the final third delivers: surprise! <br><br>The juxtaposition of the present with the past near the end of this film makes the events even more potent than they would have been. Audience members who do not fall into the \"half-wit\" category can follow the story, regardless of what the viewers who read the novel state in their reviews. Bravo! Lastly, Anne Hathaway is exceedingly lovely.","user":"guest_pabby","rank":[188,226]},{"title":"'One Day' is an achievement in film acting and a beautiful love story","rating":10,"date":"31 August 2011","review":"Very seldom in Hollywood are movies produced that are as emotionally involving as 'One Day.' It's a beautiful, beautiful love story of two people, Emma (Anne Hathaway) and Dex (Jim Sturgess). After spending the night together after graduation, we are taken on a journey into their lives for one day each year after they met; to see where they are or where they're not. Based on the book by David Nicholls (who also wrote the screenplay), 'One Day' transitions from novel to film brilliantly.<br><br>First let me say film acting is what I believe makes or breaks a movie - if the actors are great, the movie is generally great. That's not to take away from any other element of film at all, but when everything else is done so well, if the acting were bad, the film would have been less memorable. But Anne Hathaway and Jim Sturgess are so very impressive here. They make their characters real and relatable, which are two key things every actor internally wishes they could do. In fact, as an on-screen pair, they work extremely well, together they exude chemistry.<br><br>What I found most interesting about the entire experience was that I cared so much. I became enamoured with their lives. I kept hoping for the best. I anticipated what would happen to each of them. I sat forward, sat backward. I laughed and I cried. I've said many times before, a great movie will effect you emotionally in more ways than one. You'll be angry, you'll be happy, you'll be sad - the key is that you emote. This movie presented all of those elements. It was fresh and witty and everything you hope a movie will be. It's as beautifully made as it is acted and the locations are exquisite. Far too often, characters in Hollywood seem contrived and are not genuine. 'One Day' is honestly one of the most genuine stories ever told - there is no instant gratification, there is however frustration and that is the beauty of it all. It explores love and love lost, it explores friendship and the constraints of time and distance. It explores each character's journey to happiness and the trials they face along the way. So many little pieces of the puzzle are filled in between the years by simple, single lines of dialogue or actions. It's not the typical script of \"everything's all good-obstacle-everything ends well\" - there's a lot more complexity which makes it realistically genuine.<br><br>So many little details, like eye-lines, smiles, sighs, cut-off conversations, etc. were paid attention to. The costuming, cinematography and score were spot on and all noteworthy. All of it combined was moving and awe-inspiring. I left the theater crying, but it didn't stop there, even thinking about the movie and those characters is deeply affecting. Maybe there are some underlying themes in the film that I'm identifying with, or maybe, just maybe the actors were really that great. Whatever it is, this film comes with my highest recommendation, is rated PG-13 and runs 107 minutes.","user":"TheBobbyjames","rank":[224,282]},{"title":"Better than I had anticipated","rating":9,"date":"19 August 2011","review":"I went to see One Day last night, and though I had been looking forward to it for a while, I was surprised at how good it actually is. <br><br>The film has a very unique atmosphere, as it is much quirkier than your average romance. Also, without giving away the ending, I can say that it isn't as predictable as one might think. What I really liked about it was the complexity of the different human relationships that we are shown. The relationship between Emma and Dexter is by no means an easy one, nor is it one-sided. Given how different they are, there is a lot of conflict between them, although they do love each other. Similarly, what Dexter and his ex-wife feel for one another is never pure hatred, but there is a lot of understanding between them. As a consequence, the story seems like it could be taken from real life. <br><br>Plus, both Hathaway and Sturgess are as convincing as always, which makes this film absolutely worth seeing.","user":"queen_of_naboo88","rank":[145,191]}]