[{"title":"Life in Perspective","rating":7,"date":"5 February 2012","review":"People have complained that this is a horror movie filled with horror movie clichés. But how could it not be? I mean is it suppose to be a horror movie at the local shopping mall? No, of course it is in a haunted house, were else would it be? As much as this movie drew on the horror standards, I found it refreshingly different from most horror movies. Part of what I want from a movie is something different, not more of the same, and I think in that respect, all things considered, this movie delivered.<br><br>While it did make use of the standards like jump scares, I really felt the suspense of this movie. I mean, at least for me, this movie was wound very tight. The suspense was ratcheted to the limit.<br><br>While I'm still not past Daniel Radcliffe's voice, I still hear Harry or Daniel, his face and body language were spot on, and greatly added to the tension of the movie.<br><br>In the end, it is what it is, a suspenseful horror movie that gets the job done. This isn't a genre noted for 'Academy Award' performances. But as suspenseful horror movies go, I was very satisfied with this one, and thought they did have a new approach to an old genre.<br><br>Steve B","user":"bboyminn","rank":[222,291]},{"title":"Old fashioned spooker delivering on its perilous period promise.","rating":9,"date":"12 February 2012","review":"The Woman in Black is directed by James Watkins and adapted to screenplay by Jane Goldman from Susan Hill's novel of the same name. It stars Daniel Radcliffe, Ciarán Hinds and Janet McTeer. Music is scored by Marco Beltrami and cinematography by Tim Maurice-Jones. Plot has Radcliffe as young London solicitor Arthur Kipps, who is sent to the North East village of Crythin Gifford to clear up the affairs of deceased woman Mrs. Drablow. When he arrives he finds that the memory of Drablow, and her remote house of Eel Marsh, holds the village in a grip of fear, particularly those who have children.....<br><br>It's fitting that that bastion of British horror, Hammer Studios, should be behind this delightful period ghost story. For this positively oozes old fashioned values, harking back to all those wonderful spookers set around a creepy village that featured an even creepier castle or mansion at its core. More presently, the film has kindred links to the likes of The Orphanage, The Others and The Changeling, while the vengeful spirit acting out of Eel Marsh House is pumped by J-Horror like blood and Darkness Falls' Wraith bitch nastiness. So clearly The Woman in Black is not a fresh arrival to the horror splinter where the ghost story resides. However, great period ghost story films are in short supply, and Watkins' film most assuredly is a great entry in the sub-genre.<br><br>Propelling it forward is Watkins' (Eden Lake) excellent sense of mood and crafting of palpable unease. Quite often the better ghost story films are better because they operate on a what you don't see is what scares you more level, Watkins has managed to keep that aspect of his film whilst also giving us enough of the truly terrifying spirit to jolt us in our seats; often showing her to us and not to Radcliffe's Kipps! When the shocks come, and there are many and they are bona fide underwear soiling, they act as merciful releases from the built up dread, but then when Watkins doesn't deliver a shock, we are left waiting uneasily, darting our eyes all over the expansive frame, searching fruitlessly for a glimpse of something troubling. Did that wind up toy move? Is that a pallid face we just glimpsed in the shadows? That damn rocking chair is the scariest there has ever been! And on it goes....<br><br>A film such as this is only as good as the production design and setting for the story. Thankfully Watkins and his team have nailed it there as well. Eel Marsh House exteriors are Cotterstock Hall in Northamptionshire, perfectly foreboding, while the beautiful village of Halton Gill in the Yorkshire Dales gets a Hammer Horror make over to become Crythin Gifford. But it's with the interior of the house where the makers excel, an utterly unforgiving and upsetting place, brilliantly under lit by Tim Maurice-Jones for maximum scary effect.<br><br>On the acting front the film rests solely on the shoulders of Radcliffe, and he comes up trumps. Initially its awkward accepting him as the father of a young boy, and once he gets to Crythin Gifford he is dwarfed by all the other adults who live there, but once the Victorian setting envelopes him the awkwardness evaporates and the characterisation becomes more realistic and easy to sympathise with. The character is changed from the book, meaning Radcliffe has to carry inner torment as well as exuding an outer coat of trepidation blended with stoic fear. It should be noted that for much of the picture he is acting on his own, reacting to the house and the overgrown gardens and marshes, in short he is terrific and it augers well for his adult acting career. In support Hinds and McTeer are pillars of professionalism, with McTeer's Mrs. Daily a creepy character in her own right, but it's also another neat meditation on grief that sits alongside Arthur Kipps'.<br><br>The ending is also changed from that in the novel, and it's already proving to be divisive. How you react to it, and it is up for a two-fold interpretation, may dampen your overall enjoyment of the picture? Personally I have no issue with it, I was still sunk in the cinema chair breathing heavily at that point! The certification and the presence of Radcliffe ensures that a teenage audience will flock to see it, many of whom will not get the \"horror\" film that they are after. Hopefully the word will get out that this really is only a film for those who love a good boo jump ghost story of old, that's its target audience, and that's the people whose reviews you should trust. 9/10","user":"hitchcockthelegend","rank":[140,184]},{"title":"One of my favorite horror theater experiences","rating":9,"date":"3 February 2012","review":"I am vividly aware, as are most avid moviegoers, of the horror movie machine. It churns out Final Destinations, exorcism films, and at an even higher frequency, ghost films. At first glance, The Woman in Black appears to be yet another of these \"ghost films,\" where cheap scares, predictable plot \"twists,\" and horrible acting drag the viewer down into an hour-and-a-half maelstrom of mediocrity that can only end at the appearance of \"Directed by...\" <br><br>According to most of the reviewers thus far, The Woman in Black was a letdown. So perhaps it is because I went into the film with no expectations that I came out of it impressed and very, very shaken. I do not plan to explain the plot to you (many have done this already and there is a synopsis which does a far better job than I could), but I will argue in favor of how successfully scary this film was. Yes, it contains ghost film elements we have all seen before, but they are cleverly and patiently arranged so that the viewer becomes totally enveloped in atmospheric dread. Sure, there are \"jump\" scares, but these are also complimented by many shots which unfold slowly and effectively. It sometimes reminded me of the 1961 film, The Innocents, if that gives you a better idea. Radcliffe is also a worthy focal point of the film, keeping most of the fear and anticipation unspoken throughout.<br><br>I would not nominate this film for any kind of award, but it achieves what I believe should be the ultimate goal of all \"horror\" movies: to draw us in so close that when our fear manifests itself on-screen, it is already too late to turn away. It rates high as one of my favorite horror theater experiences, alongside The Descent and The Strangers.","user":"DinosaurAct86","rank":[176,248]}]