[{"title":"Nice idea, Nice try, but ultimately fails","rating":5,"date":"17 November 2013","review":"Well I decided to give this a go as it looked interesting and to be fair it was interesting to a point. <br><br>The actually story here was quite a good one, the problem was the method in which they used to convey the story. The direction was all over the place as were the performances from the actors, but overall the pacing and the way it was presented was the biggest mess. <br><br>You could actually sit there and see where the director had time and money to get shots right and where they had to rush shots which ended up looking very amateur, there were certain shots that looked straight out of a college project whereas others were top notch. Same goes for the acting at times it was good and at times it was bad, every female actress in this film was terrible ( as well as all having terrible lip jobs ) . The lead actor Malik Barnhardt overacted in virtually every scene that it became cringe worthy, Sizemore again was hammy but at least he was entertaining. Bokeem Woodbine was decent and stood out admirably in one scene. <br><br>There were also some terrible editing decisions, scenes that should/could have been left out and scenes that needed to be in there for the whole thing to make proper sense and give it a proper feel.<br><br>In the end it was a film trying to be too many films in one go. <br><br>The film however bad in many parts was actually entertaining overall but my my, what a mess of what could have been a good film. <br><br>I hope the writer in the future chooses not to direct his own stuff and instead puts it in the hands of a decent Director and probably more importantly an Editor who can chop out all the crap and keep in all the bits relative to story telling and proper pacing e.t.c. <br><br>This would probably make a decent book to be honest !","user":"eve_dolluk","rank":[17,22]},{"title":"Bad acting, corny lines, very unattractive women, whose makeup seemed to be applied by a circus clown.","rating":1,"date":"22 September 2013","review":"Nothing worth to mention, except for the first five minutes. The actors seem to be playing a \"lame role\", unconvincing and soap opera like, the music is over melodramatic adding to the lack of talent. Not even Tom Sizemore, (whom I had the chance to meet in LA in 2002, on 22nd street and Union Ave, while he filmed Robbery Homicide Division), adds anything to this movie. The scenes of the bank Robbery , taken straight out from \"HEAT\" and Sizemore fixation on playing a mix if DeNiro and Pacino while being on antidepressants, or maybe trying to remember his lines. The clichés, close-ups, and photography another let down, so far this movie seemed to be financed and acted by a bunch of guys who had too much time in their hands and not a single bright idea! The only one who is up for the job is Steven Bauer, on the other side of the coin I would said that the worse of all is the \"actor\" Malik Barnhardt, I wish that he has been shot instead of the cop! Seriously, if I were you I would pass on this one, and reinvest my time watching again HEAT, or THE TOWN or THE Italian JOB, heck I would settle down for Disney's Robin Hood for a better time!","user":"alshwenbear1","rank":[30,48]},{"title":"Not that good","rating":4,"date":"22 July 2016","review":"Wasn't gonna bother reviewing this movie initially, because it's not really a movie anyone ever even heard about and it's not one really worth hearing about either.<br><br>Anyway the reason I decided to do so still is because there are only 8 reviews in total and 4 of these are with a 99% certainty phoney ones made by people who actually made the movie (the fact the only movie they have rated is this and other Kader Ayd directed movies is a clear hint of this) and the fact that they won't admit the obvious flaws.<br><br>Anyway regarding the movie it's pretty bland, a positive thing is the visual aspect it looks pretty neat for a low-budget movie with cool colours and well-placed angles but the movie is just far too messy it has like 8 different sub-plots all filled with plot holes.<br><br>Acting is, not terrible I guess overall but not very good either.<br><br>Worst part is the pace though it's supposed to be a tight thriller but it's just awfully slow at times and that's often where the weakness in the script and dialog shows itself the most.<br><br>Malik Barnhardt and Avelawalance Philips have the leads, and Tom Sizemore has a reasonably big role as well.<br><br>If you are interesting to watch it for any of the other cast-members don't expect too much of them, Taryn Manning for instance is just in it for a couple minutes in the beginning and the end.<br><br>Overall the type of movie you forgot you even watched, 2 months after the fact (maybe shorter we will see).","user":"Seth_Rogue_One","rank":[3,3]}]