[{"title":"Enjoyable, entertaining","rating":8,"date":"12 April 2014","review":"Do you people ever just watch a movie and enjoy it without analyzing the crap out of it? I thought this movie was fun and entertaining, despite it not being THE GRAETEST MOVIE EVAR MADE. \"Oh no, the effects aren't perfect.\" \"Waah.. they didn't have a $100million budget\" \"OMFG there's a plot hole in the 23rd minute of the 2nd act!!\" I keep seeing reviews that say \"Oh, I was EXPECTING such and such, and it didn't deliver\". Stop creating expectations based on a 2-minute trailer. Just try watching a movie for fun and turn off your brain... This movie is actually pretty funny if you know LARPers. Summer Glau is super-hot, as always. I really enjoyed how they would build up mega-drama with the music and dialoge, and then turn it off instantly and it's back to Nerdville -- I thought that was clever. Make some popcorn and watch this, just make sure to take the stick out of your arse first..","user":"poopjuggler","rank":[71,87]},{"title":"Not as bad as the reviews","rating":7,"date":"15 August 2014","review":"It's not as bad as some of the reviews make it out. But you do have to be a geek at heart.<br><br>You don't have to be a LARPer necessarily, but you do have to know a little about the culture. There are a lot of jokes and references that if you know nothing about roll play, LARP or just general geekdom, they will pass you by. <br><br>So yeah its not for everyone, but it is funny and the actors all put in exceptional performances for what it is. <br><br>It's not meant to be a block buster CG extravaganza, so don't expect a block buster action horror and you will enjoy it. <br><br>But again, if you know nothing about geek culture this will go right over your head. <br><br>Great performances by all, need to say that again.","user":"imbendingtime","rank":[23,26]},{"title":"Promising Start, But Doesn't Know Where To Go...","rating":6,"date":"9 April 2014","review":"Knights Of Badassdom exists in a mystical confluence, equal parts Monty Python &amp; The Holy Grail, Animal House, Galaxy Quest and Friday 13th but never quite rises to the brilliance of its forebears.<br><br>Having just been dumped by his girlfriend, wannabe doom metal singer Joe (True Blood's Ryan Kwanten) is 'kidnapped' by his two best friends - hardcore LARPers Eric (Steve Zahn) and Hung (Game Of Thrones' Peter Dinklage) - to the site of their next big event, The Battle Of Evermore.<br><br>Joe is reluctantly talked into joining the Live Action Role Playing game - helped by the presence of the lovely Gwen (Firefly's Summer Glau) - but, unfortunately, in his quest for authenticity Eric has purchased a magical tome off eBay that turns out to be a long lost book belonging to the famous Elizabethan sorcerer John Dee.<br><br>When Eric reads a page at random as a mock spell, he unknowingly summons a succubus from Hell that proceeds to feed on the souls of the LARPers.<br><br>Soon after that Joe and Gwen realise that people are dying for real and take up arms to strike back at the monstrous demon and try to save their friends.<br><br>Knights Of Badassdom starts very promisingly, with plenty of loving nods to both LARPing and Dungeons &amp; Dragons (this certainly isn't a mockery of geeks), but once the horror aspect enters the mix, the film doesn't really know where to go.<br><br>Now, I'm pretty certain that I read a ways back that this release of the film was not the director's vision of the story but a cut put together by the producers. This might explain the feeling that after a while the story is just spinning its wheels.<br><br>What starts off as belly-laughing funny (very much in the style of The Big Bang Theory, but with more swearing) that had me thinking this might one day equal The Holy Grail as geeks' go-to game quote movie eventually lapses into mildly amusing, by-the-numbers fare.<br><br>There are plot holes a-plenty and a lot of undeveloped characters (for instance, what was the deal with the redneck paint-ballers and their major hate-on for the LARPers? Outside of explaining why the police didn't turn up at the camp site when the slaughter began, they were totally redundant to the plot), which again suggests to me to retrospective re-cutting of the film for whatever reason, making do with what footage was on-hand.<br><br>Don't get me wrong, it's good and certainly clever in parts, but there's an inescapable feeling that it could have been much better. There are some great characters, and great \"in-story\" world-building by the LARPers, but it all degenerates into a big slug-fest with a rubber-suit monster.<br><br>Depending on your mood - and your attitude to random absurdity in movies - the climax of Knights Of Badassdom will either have you smirking at its ridiculousness or reaching for the remote control to turn off the television.<br><br>It's such a shame because I genuinely believe this could have been - if done right - a cult classic. As it is, I fear it will simply be swept under the carpet as a missed opportunity and promptly forgotten about.<br><br>Of course, the film's biggest mistake: not enough Dinklage.","user":"knight110tim","rank":[26,31]}]