[{"title":"Eden replayed post-apolapse","rating":9,"date":"30 August 2015","review":"Z for Zachariah is a parable of postlapsarian loss. In a verdant valley miraculously saved from a nuclear apocalypse a young woman and her dog are joined first by a black engineer and then by a young white miner. Together they convert the girl's father's church into a water wheel that will use a radioactive waterfall to generate electricity. The wood from the church will help them rebuild human society. But the new world perpetuates the tensions of the old, including romantic emotions and racial tension.<br><br>The radioactive water points to mankind's corruption of the source of life, the poisoning of purity. Indeed director Craig Zobel converts a survival novel into a religious drama by adding a character to the original two-person novel and developing the religious imagery. <br><br>The title recalls a book that engineer John Loomis takes off a shelf: A is for Adam. The film dramatizes the end of that Biblical story, replaying the myth of Eden after the apocalypse. Zachariah is the prophet murdered between the temple and the altar, the last of the killed prophets, so the name embodies the new narrative as a whole.<br><br>The heroine Ann Burden carries the burden of innocence and faith when she struggles alone with her dog to survive. When she finds engineer John bathing in a radioactive pool she nurses him back to life. They develop a relationship of respect and interdependence. Drunk on beer, Loomis briefly confronts Ann with his vulgar carnality from which he retreats apologetic. <br><br>Through the sacrament of wine Ann approaches John on her own terms and invites an intimate relationship. But John retreats, desiring her closeness but fearing the change that a sexual relationship would make. He's inhibited by both their age and their colour difference. The scene in which Ann comes to him and he embraces her with a tender self-denial expresses the desire for a deep connection through the body but not carnal.<br><br>The serpent in Eden — added to the source novel — is young white Caleb, whose \"Mr Loomis\" is a condescending formality by which he insinuates himself between his two hosts. The scene in which Ann chooses Caleb over John begins with their excessive use of wine, non-sacramental, and another baptism parody when the three cavort in the water. John is finally moved to confess his love to Ann, but when she comes to him he's drunk and unconscious. She surrenders her purity to Caleb instead, waiting when he comes out of the shower. This scene parallels her finding John under a waterfall and parodies their truer love scene, a literal purification parodying the authentic. <br><br>Margot Robbie marvelously suggests her character's transition from Innocence to Experience. After Caleb, her eyes are darker, more knowing, her carriage heavier under the burden of experience, and we know she cannot revert to her earlier self, nor to her earlier relationship. In the last scene she plays a dirge on the church organ while John sits earnestly listening, his hands clasped in prayer as if in futile hope to recover what he had with her pre-Caleb. But you can't recover a lost Eden. After sampling the Tree of Knowledge of Good and Evil innocence is gone. <br><br>One by one the male figures drop out of Ann's life. We see less of her dog after John appears and nothing at all with the arrival of Caleb. Caleb — named after one of Moses's advance spies who encouraged the invasion of Canaan — becomes the animal figure in Ann's life despite his pretence at being her fellow-believer, in contrast to the agnostic John. After losing Ann John arranges for Caleb's disappearance. But he can't erase the change Caleb wrought upon Ann.","user":"maurice_yacowar","rank":[79,111]},{"title":"Creative Post-Apocalyptic Take","rating":8,"date":"31 January 2015","review":"Just saw this movie at Sundance and thoroughly enjoyed it. While certainly not perfect, the film was beautifully shot, scored, and directed. As a post-apocalyptic film, it took a unique take on what was essentially a small group of survivors after nuclear fallout. However, instead of focusing on the apocalyptic elements themselves, it focused on the human drama that resulted and the emotional responses to this extreme sort of isolation.<br><br>I had essentially no expectations coming into the film and found myself completely invested in the storyline, which develops methodically but beautifully. The writing hits all the turning points within each character's development at just the right time, with just enough delicacy. In turn, the actors all delivered superb performances.<br><br>I had only seen Margot Robbie in The Wolf of Wall Street previously, and I was highly impressed by her perhaps more subtle turn here. I thought she did a wonderful job of portraying a woman trying to preserve her faith and even innocence in trying circumstances. Likewise, Chiwetel Ejiofor portrayed his character's shortcomings in an extremely relatable, human way.<br><br>Chris Pine's introduction into the film basically becomes the linchpin for the majority of the rest of the movie's tension, and Pine's typical suave-ness does not disappoint. Ultimately, a story of jealousy, desire, and necessity emerges, with the sense of isolation and loneliness prevailing, with an ending that leaves you thinking afterwards. 8/10.","user":"warevjensen","rank":[97,142]},{"title":"A science fiction without much fiction, an erotically charged tale without eroticism and a pseudo-emotional story.","rating":4,"date":"18 September 2015","review":"\"It's about... rebuilding. Maybe God... or your father... put this here for us. So we can... we can start again. Maybe that's why we're here... Just to start again.\"<br><br>The future prospects of our beloved world looks rather bleak, judging by the post-apocalyptic films of recent years. The endless series of disaster scenarios doesn't bode well. \"The Maze Runner\", \"Divergent,\" \"Mad Max,\" \"Oblivion,\" \"The Hunger Games\", \"Snowpiercer\", \"Automata\", \"How I live now\", \"World War Z\", \"The Well\" ... they all show a society that recovers on the ruins of a previous calamity. Similarly, \"Z for Zachariah\". You won't get a real explanation about the incident that led to a general extermination of our society. Reference is made to radioactivity and emerging nausea caused by polluted water. From this you can deduce that there might have been a nuclear war or accident in the past. But otherwise it is pure guesswork.<br><br>It all started in an interesting way. A sober story with a sole survivor in a fertile valley (a \"Garden of Eden\" as it were), that was spared from the global holocaust one way or another. But this soberness gradually morphed into dullness. The emphasis gradually shifted from the apocalypse that took place in the world, to the complex, apocalyptic emotional world of a few surviving individuals. A love triangle is formed with reconstruction, religion, racial discrimination and jealousy as central themes. The fact that in all probability the world population was wiped out by a disaster, is relegated to the background and is only mentioned briefly afterwards as if it's irrelevant. What remains is an ordinary but complicated love story.<br><br>I came across the following perspicacious summary : \"Z for Zachariah is a sex movie with a science-fiction coating and barely any sex.\". It can easily be added to the list where films such as \"The Boy\" and \"Manglehorn\" appear in. Painfully slow films. What remains are the acting performances. An advantage (and maybe disadvantage at the same time) are the number of main characters. It's limited to three. Margot Robbie as the devout, farmer's daughter Ann Burden, who can drive a tractor to work the land without any problem but on the other hand feels rather inconvenient when it comes to intimate relations with someone of the male gender. Margot Robbie is a ravishing appearance as seen in \"Focus\", \"Suite française\", \"The Wolf of Wall Street\" and \"About time\". Despite her fairly pathetic and bigoted look in this film, her natural beauty is still striking. She's joined by Chiwetel \"12 Years a Slave\" Ejiofor as the scientist John Loomis who is being rescued from a certain death by Ann after taking a refreshing bath in a toxic pond. The group is completed with Chris Pine as the not so bad-looking miner Caleb. He thwarts John's plans to re-populate the planet thoroughly.<br><br>This film is based on the novella by Robert C. O'Brien from 1974. I myself haven't read it and allegedly the film isn't really consistent with the book. For example, there would be no question of a third person. Knowing this, I think I'll let this book pass me, for even three people can't ensure that there's an intriguing, fascinating story. Let alone two. \"Z for Zachariah\" is a science fiction without much fiction, an erotically charged tale without eroticism and a pseudo-emotional story. Despite the nuclear disaster, the chemistry between the characters was hard to find.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[93,143]}]