[{"title":"Honesty meets Reality","rating":10,"date":"28 October 2018","review":"At what point are you no longer owned by your family? Is it marriage? Enjoyed the musing and frequently pensive understandings of a young couple caught in a vortex of culturally imposed minefields and filial duty. In the end aren't we the determiners of our own adult fate, or are we just a reflection of a self. Are by others? This move waxes and wanes the reality of self, self development, and who are we as two may or may not become 1.","user":"ilovefogcity","rank":[1,1]},{"title":"It's okay but it feels very amateurish","rating":4,"date":"24 December 2018","review":"I can see why her family wouldn't want to be in the film, as it seems that she didn't even let them know that she was talking about them in public. Considering the Chinese are already very touchy when it comes to their personal life, I feel she could have been a little more sensitive. The guy just feels like a zero to the left, his role in the film is quite irrelevant. An okay documentary, definitely I learned a few things about China, still not a documentary I would put on my top 10.","user":"fagurado","rank":[0,0]},{"title":"banana in a nutshell. spoiler - possibly","rating":7,"date":"22 March 2014","review":"I'm not Chinese, only part. But, that doesn't matter. My parents never said they loved me. But I'm pretty sure my dad did, and my mother didn't. She was also a great liar, I didn't believe much of anything she did say. I also never looked to her for approval because I knew I would never get it. My dad and I had great times together. My mother had a great time by herself bitching and complaining. If I ever wanted to marry, I wouldn't have told them about it, it's merely polite, not necessary. If they wanted to disown me, I'd say \"great\", and just go on.<br><br>The film was alternately almost unbearable and very pleasant, or it would have got a higher rating. Her complaining about what her parents might or might not do was very annoying. She is a grown up in a relation with a man for eight years, highly unlikely that nothing more was going on. As she finally admitted to herself, \"what difference does it make if they disown me?\" None, dear, they either come to the wedding or not, not a big deal. And congratulations on your wedding.","user":"marilynnewman","rank":[0,1]}]