[{"title":"Makes me suspicious of the good review","rating":1,"date":"1 February 2012","review":"Sometimes when a very bad movie gets a great review, it's because a friend or relative of someone involved in making the movie wrote it. Sometimes that's obvious just from reading the review, but not always. Having now seen this movie myself, I cannot trust any positive review it gets.<br><br>This movie is just terrible. Everything about it is bad: the strident, preposterous screenplay; the harsh, always-on, NEVER-believable acting (if it's fair to real actors to call it that - Michael Joyce and Mandeesh Gill in particular are embarrassingly bad, although Joyce has a bigger role so he sticks out more); the noisy, too-loud and never appropriate music; the interminable fake sex scenes that are always shot from the same weird angle, with the same frenzied, mechanical, totally fake grunts, groans, grimaces and spastic moves - scenes that last ten times as long as they should even if they were good; and the idiotic photography.<br><br>The normal way to film a conversation is to film each actor separately and then edit the shots together into a conversation. THIS director or cinematographer sometimes chose instead to swing the camera back and forth between actors: one reads his line, then the camera swings quickly 90° to the other actor, who says his line, then back to the first actor, etc. In at least one scene he does it between THREE actors. It's dizzying, and not in a good way. I've never seen anything like it. Whether it was done to save production time and costs or with some crazed idea that it's a cool way to make a movie, it's a big, BIG mistake.<br><br>Every character in this movie would be unbearably obnoxious if they were at all believable; as it was, I just kept hoping against hope that the counter was wrong and there weren't REALLY 53 minutes left, then 52 minutes, and so on. I forced myself to stay with it all the way to the end, but I wouldn't wish such torture even on Dick Cheney. This is the worst movie I've seen in years.","user":"jm10701","rank":[20,25]},{"title":"Depressing, dreary and unfocused","rating":2,"date":"11 November 2011","review":"Dale (Christopher Kelham) is a 28 year old hustler in London. He spends his days with his high-paying clients and nights cruising for sex or hanging with his drag queen best friend Sean (the late Michael Joyce). He's also secretly in love with his str8 friend Raj (Valmike Rampersed). Things start to unravel when Raj tells Dale he's getting married...to a woman.<br><br>On the positive side--the acting is pretty good with Joyce excellent as Sean. There are some nice shirtless scenes of Israel Cassol who plays another hustler named Ricardo. Also the ending is somewhat affecting. Other than those points though this is pretty terrible. It's slow-moving with a story that veers all over the place. There was also a howler of a melodramatic twist thrown in at the one hour mark that was so stupid I thought they were kidding! The \"insights\" to love and sex were thoroughly predictable and frankly boring. The main problem is Kelham. Dale is such an obnoxious character that I couldn't believe he had any clients let alone friends. His acting is very good but I didn't believe for one second that he was a gay hustler. He seems uncomfortable with the role. The ONE gay kiss we see is very horribly done because it's so obvious that the actors don't want to do it. Also (I realize this is a matter of taste) Kelham isn't good-looking enough or in good enough shape (he's average at best) to be a hustler. Cassol would have been a better choice for the role. There's no nudity and the simulated sex is so overdone it's embarrassing. Bad direction too. The good acting by Joyce can't save this. Bland and boring.","user":"preppy-3","rank":[12,16]},{"title":"Not that bad","rating":6,"date":"2 August 2014","review":"I thought this movie was OK. I found it sort of interesting and it had a few surprising moments. I liked the way his daydreams were brought to life. If a scene got weird, you soon realised that it was one of his fantasies.<br><br>If I had a problem with the film, it was with the character of Dale (Christopher Kelham). He just didn't come across as a gay escort to me. Kelham is a handsome enough man (in a sort of austere, intelligent, British kind of way) but he just didn't look like an escort, or what gay men would want in an escort. He didn't seem likable. Of course, gay escorts probably come in all different types, and have all sorts of issues, so I tried to convince myself that a gay escort could be like this.<br><br>I suppose I also didn't really find Dale's relationship with Raj to be that realistic. A hardened gay escort isn't going to fall for a straight guy like that. I didn't get Raj.<br><br>Sean was an interesting character (and well played by the late Michael Joyce) but I felt that the director simply threw the drag theme in to make the film more interesting. Estee Applauder didn't further the plot in any way.<br><br>There were a few too many contrivances in the movie.<br><br>It bothers me that this is yet another gay movie with the themes of drag, sexual dysfunction, homophobia and tragedy. Why do we keep doing this to ourselves? The ending surprised me. Make sure you watch the film to the very end. I almost turned it off in disgust before the important final scene.<br><br>I didn't hate this movie the way that many other reviewers and raters seem to have done. I think it's under-rated here. However, I wouldn't recommend this movie to a friend.","user":"Laakbaar","rank":[3,3]}]