[{"title":"Movie is SOOOOO Slow!!!","rating":1,"date":"27 February 2016","review":"Another low budget horror film that is completely worthless. Absolutely no energy in this movie about a woman who is haunted by her past. It was impossible to create any suspense and the acting was very poor. In this type of film it's really important to feel something for the lead characters and instead we're treated to long, boring passages that don't amount to anything. The director needed to make the start much more involving. Simply not at all scary which is what you want out of a picture like this.Don't waste your money on this. In fact, don't waste your time on this. Truly awful.Please give us quality scare films. Not stuff like this!","user":"danocaster","rank":[8,10]},{"title":"Slow and Poorly Made","rating":1,"date":"22 May 2016","review":"I have seen worse movies but this one was a waste of time and money for those who made it and those who took the time to rent, buy, or see this movie. First of all it starts in the heat of the moment of blood and gore. Then it moves to this house in the middle of nowhere with one of the girls in the first scene and it takes a good 20-30 minutes for ANY lines to be spoken. All the while you are watching the same 4 scenes play over and over again with this broad roaming around this house that you have no idea who or where it is or what the hell happened in the scene that took place beforehand. Then when the movie FINALLY decides to progress nothing makes sense and the main plot point is painfully obvious. Honestly, I wish I could take back the time I wasted watching this movie and perhaps put it into watching Twilight again.","user":"cartelsaide","rank":[3,3]},{"title":"Not alone among bad movies","rating":3,"date":"27 February 2016","review":"As far as I can tell from my extensive research (10 minutes on IMDb), this is the first movie in which Lucy Benjamin has appeared. She is more well known in the UK for her role as Lisa Fowler in the soap opera Eastenders ('oy mate, you been shafting my sister, innit?' etc.). She has also acted in other British TV soaps, sitcoms and series. She is a reasonably good actress, so I don't think the blame can be laid on her for this stonker of a movie. Instead, I think we have to point a finger (or two) at director/writer Tristan Versluis. He has also directed a handful of other movies, but his main involvement in movies and TV series has been for make-up, including top-rating shows like Game of Thrones. Anyways, Not Alone (a.k.a. 'The Haunting of Ellie Rose') is badly written and poorly directed. It is predictable and clichéd, and, apart (possibly) from the main role, seriously lacks character development - as we all know, if you can't empathize with any of the main characters, a movie will not hold your attention or stir your emotions (for instance, horror films are supposed to be scary...). On the positive side, some of the photography and filming is very good quality, but the low budget is clearly reflected in the limited locations, poor costuming, limited soundtrack, and dodgy 'special effects'. Versluis does well in the make-up department (where his experience lies) - Ellie Rose's broken wrist is gruesomely real, as are the dead bodies sitting around the kitchen table. But somewhere around the start of the third and final stage of this movie, the viewer begins to realize that there are no surprising twists in store, and that they have just wasted 80 minutes of their life. Let's hope Lucy Benjamin gets offered work in better movies, and that Versluis' writing and directing improves - because both show promise and could have done better. So, unless, as some of us do, you have an inexplicable attraction to B-movies, I advise you to skip this movie and look for a better horror film - about one in 10 of 2015's horror films were watchable, which is a fairly good rate.","user":"thedmtmolecule","rank":[3,3]}]