[{"title":"Powerful and meaningful if you've been there","rating":10,"date":"13 February 2012","review":"There's a serious polarity in the reviews for this film,and I'm not surprised. If you've ever suffered depression this bleak movie will hit hard, and you'll pick up on all of the subtle messages it sends out. It's done so well it can't be anything other than achingly familiar. The despondency, and the frustration the sufferer feels at their own despondency, in particular, is well conveyed. <br><br>Unfortunately I think a large chunk of the people who've seen this film (and there aren't many who have, sadly) went to it expecting a slightly arty apocalypse movie. It's not a smarter Deep Impact. The (blue) planet Melancholia is just a metaphor for depression. Unrelenting and irresistible, Melancholia has the main character in its thrall.<br><br>For those who don't \"get\" this movie, no it's not a pretentious, pseudo intellectual flick. Rather it's a well crafted take on the fine detail of a subject matter that you have been fortunate enough to not have had to understand. Long may that be the case.","user":"misty_77","rank":[507,632]},{"title":"helplessness","rating":10,"date":"12 September 2011","review":"I've never seen anything so painfully familiar. Every move of Justine, her every word echoes with the heartache of a melancholiac. And the inability of the others to understand this pain, their inability to feel it and understand - it only makes it more familiar to the ones drowning in this mute slow-motion everyday despair. After watching this movie I went home without saying a word, I sat down on my chair and sat there silently for about an hour. I like Lars von Trier, I liked his movies before, but this one was a headshot. In this one film Lars von Trier succeeded to show all the ultimate emptiness of the everyday rituals, the endless longing of a melancholiac and the unbearable helplessness of this condition - like a bulletproof glass cocoon around you, muting the sounds and making the colors dim. I vote \"excellent\", 'cause this film is closer to my heart than any other I've seen before.","user":"shizoeid","rank":[618,881]},{"title":"A voyage","rating":8,"date":"16 August 2011","review":"Yesterday I had the chance to see Melancholia. I was a bit anxious given the mixed reception here (either euphoric or very negative).<br><br>It seems the media are talking more about the disaster-press-conference-from-hell Lars gave in Cannes. Which is a shame.<br><br>Like always, Lars von Trier does not want to appeal to the general public, but in stead wants to present the viewer something unique and honest.<br><br>It was influenced by his own \"melancholia\", of which he suffered when working on this project.<br><br>I, for one saw solid acting and great directing from a person who carefully observes and understands human interaction. For me it works.<br><br>This movie is by no means perfect but it was thought provoking, and heart touching and that's exactly what a decent movie should try to achieve. <br><br>Thank you for reading my opinion.","user":"guy-schellens-41-715308","rank":[439,651]}]