[{"title":"A Cycling Riproaring Ride","rating":8,"date":"26 August 2012","review":"It's not a 10 star film but it is a fun ride with action that makes up for a few flaws in plot and the flow of storyline. The best issue in this film is almost constant action and wild biking through the New York streets. One of the elements that were new to the screen and highly workable were the sudden stop of action to follow the split-second decision making of a messenger/biker. Choices (usualy three) that have to be made in the moment. The bad guy in the film is nasty and very believable. So, if you're looking for a thrill ride and a fun film then go see it. Enjoy the earthy feel of the cameras that capture the life of a messenger on two wheels competing with trucks, cabs, and cops.","user":"james1844","rank":[103,137]},{"title":"Life in the Bike Lane","rating":8,"date":"25 August 2012","review":"An action movie about biking through the streets of Manhattan is certainly an interesting idea, and may seem a bit silly, but writer and director David Koepp manages to create a fun and exhilarating film around this premise. Premium Rush is the type of movie that gets better as it goes on, expanding on its characters and creating riveting and never tiresome chase scenes.<br><br>The story is a little over the top, but that hardly matters. Joseph Gordon-Levitt plays Wilee, a bike messenger who loves to ride through the streets of New York like a maniac, with no gears and no brakes. He has a girlfriend who also works for the same company, although on this particular day she is mad at him for not showing up to her college graduation. Near the end of the day, Wilee gets a package from his girl's roommate. This package is of some special importance because a dirty cop, played with exquisite menace and insanity by Michael Shannon, wants the package in order to pay off his immense gambling debt. So of course a chase across the city ensues throughout the remainder of the day.<br><br>One of the major benefits of this movie is that it is not told in strict chronological order. The first scene shows Wilee crashing and flying through the air, only for us to travel back in time to earlier that day. Once we meet Michael Shannon's character and have a nice chase, the movie again backs up for a bit, revealing what the dirty cop was doing earlier that day. This helps the movie to avoid being simple and tired. In fact, the movie has an energy that is on par with its bike riding characters, who seem to hardly ever tire of pedaling. <br><br>Koepp directs the movie with a flare for Manhattan, where the entire movie was shot. The film makes a big deal about life in the city, while minimizing the gaudier aspects of filming in the big apple. There is no sweeping shots of Time Square or the Empire State Building, and we don't even get a wide shot of the city until the very end. Instead, Koepp immerses us in the town, and by extension the characters that know it so well. At times the script falls into the realm of cheesiness, especially when it comes to some of the one liners, and the all encompassing pride that Wilee has in his work. <br><br>Premium Rush is an exiting action movie, and the best one out about bike riding. Michael Shannon's fantastic performance and the on location shooting make this movie an energetic and awesome ride.<br><br>thatguythatlikesmovies.blogspot.com","user":"patrickwigington","rank":[92,130]},{"title":"How to (possibly psychotically) navigate NYC streets - and Michael Shannon's gaze","rating":7,"date":"25 August 2012","review":"Premium Rush is a commercial film that sticks to being a 'B' movie with some A-movie assets - chiefly the actors Joseph Gordon-Levitt and Michael Shannon as the hero and opposition - and David Koepp does a very good job balancing those elements. It could have been just a straight to video title, but it's smart about being a little movie (that is, not quite as on the radar as a big summer tentpole), and has a script that can hold its story and juggle a few elements with more than just competency, that you can go for the ride without being insulted. And yes, it isn't just hyperbole saying it's a 'ride'; here, as in some TV shows (only here with better visual intentions than just quick- adrenaline-fixes), we see with big visual effects the scenarios our hero Wiley (yes, perhaps ironically named as he is really the Roadrunner) navigates the streets, his main route, and then when he's at a cross- walk and cars coming on all sides which of three paths he could take and if he'll die or not or kill others.<br><br>Sure, most of us (those of us walking or driving in a city, such as New York) don't like bike messengers, but it's in abstract or in the all-too personal. Koepp's cleverness is to look at a bike messenger on the street and go 'hmm, how about a movie about him and what he has to do, and then what if we throw in a crooked cop and a mob element and a woman wanting to reunite with her kid?' A lot of these elements on their own (and perhaps still the woman with the kid) could be under-cooked or just not very interesting. Altogether, they amount to something, rather that the elements can connect through Michael Shannon's cop Detective Monday (or \"Officer Ackerman\") who sets a lot of this into motion through his comically inept gambling addiction and inability to get money together - or a ticket from a bike messenger. <br><br>Some of this may just seem like 'screenwriting 101', with pieces like the woman with the son and the hero's conflicts (love interest, side- opponent in another bike messenger, the latter I didn't care for as it was too weak on its own and in the movie), but hey, in a first-level class there can be good work done! It's not even a 'turn off your brain' kind of suspense thriller either; Koepp has enough experience to inject, along with his co-writer, really funny or witty dialog, solid (albeit 'movie') character dynamics as people ride on their bikes and can speak on their blue-tooth phones. It's so good when watching the actors bicycling along, and some stunt doubles but who knows when they really use them it's so well integrated, it almost slows the movie down when they have to stop to fill in the spots of the story's quasi- MacGuffin object in the envelope.<br><br>But mostly, it's the acting that carries it through. Gordon-Levitt is an appealing lead, likable but has a tough attitude when he needs to, and of course you got to go with him. But without Shannon, frankly, I don't know if the movie would have been as successful, at least to the level it's at now. He's such a convincingly kooky-looking villain, brutal, nasty, but cartoonish in a big way (listen to his laugh, or chuckle, and it's a touch of Chucky the doll or something!) Even in a supposedly marginal Hollywood thrill-ride, Shannon brings his A-game.","user":"Quinoa1984","rank":[30,39]}]