[{"title":"Delivers on a feel-good underdog hero story","rating":8,"date":"28 July 2019","review":"Nobody's saying this movie is Spielberg level, but Bottom of the 9th is touching and it delivers in it's promises. It's a feel good hero Hollywood drama to a T. Not too heavy on the cheesiness/unrealistic circumstances until the end and even then it's ok. As expected for this kind of movie.<br><br>I don't understand the reviews about bad acting. The characters were natural and for the most part unforced. I found myself engaged all the way through and rooting for the characters. I can think of so many movies that we just have to turn off because the actors are so obviously acting. This isn't one. Joe does a nice job as a strong understated lead. Handsome to look at and quiet like one would expect a person to be in his position. Was pleased to see Sophia relax and do a decent (not great) but decent job acting like a human instead of a Latina stereotype for the most part.<br><br>Would've like to see a little more arc for both characters. Why would they value eachother now? They're different people now. Why do they want to be together?<br><br>Would've like the director/writers to show us more background as to how the fiery young hot head we saw turned into the humble man coming out of jail.<br><br>I imagine getting out of jail and finding a job and a new life is a good bit harder than portrayed in this movie but still the story sheds some light on the many challenges for people in this position. It's hard to assimilate and feel valued.<br><br>I think the baseball fans found it unrealistic. So be it. That's hollywood and I'm not in it for the sports. Perhaps if you are this movie wont work as well for you.<br><br>Overall this movie delivers as the hero's journey tale it says it is. It's what you'd expect from hollywood's version of this tale with just enough real human element and real life feeling to make it feel real. Overall satisfying movie.","user":"leland-mckeithan","rank":[11,12]},{"title":"A Touching Redemption Story","rating":10,"date":"4 August 2019","review":"A great story about redemption, centered around the love of Baseball. Thoughtful if slow moving at times, but filled with very believable portrayals of guilt, regret, and the very bleak and hard challenges of starting over in adversity. This story could have used any profession or life-dream as its focus but in this case chose what is probably very relatable to many. Even if you never desired to be in the Big Leagues of any sport, you probably played baseball during PE in school. And everyone can relate to aspiring to greatness, and yet for most that \"big break\" never happens. Now imagine the worst--you are the cause of your dream going south and because of your poor judgment, others lives are also irrevocably changed forever as well. Coming back from ALL that with grace, is this touching movie. Well played, well directed, and greatly enjoyed!","user":"jkattaie","rank":[4,4]},{"title":"Classic underdog story","rating":9,"date":"21 July 2019","review":"Im gonna call this the Rocky of baseball. Anybody who rates this a 1 or 2 has no patience or no heart. Awesome movie and I hate baseball","user":"prkozlowski","rank":[8,11]}]