[{"title":"Oh, what surprises we find in such unexpected places.","rating":8,"date":"20 November 2012","review":"I believe that the enjoyment of a movie is directly proportional among other to your beforehand expectations about it. So with that in mind, let me tell you about this movie; It has a completely unoriginal story, terrible special effects and acting that will never be considered, even in a slow movie year, Oscar wordy. In short it's an action / science fiction that should leave you empty.<br><br>Yet, it is not boring, quite the contrary. It has a very special 'Je ne sais quoi' to it. I so wanted to use that in a review for which I want to apologies to you.<br><br>I enjoyed it more than most films I have seen this year. Perplexed to explain what makes it unique without spoiling it for you and considering my first sentence, I will say after much reflection, seeing it with very low expectations would be the best. It will allow you from the start to get into the world the directors are painting for you, couple that with a possession of a twisted sense of humor and you will find a gem of a movie in there.<br><br>In short, for what it is, it is a gem.","user":"nikolobg","rank":[25,29]},{"title":"Die Hard on a Space Station","rating":8,"date":"17 October 2012","review":"Come on people, watch it for what it is. Yes it's silly, it's supposed to be. It looks great and slides down easy. Guy Pearce is a blast to watch as he struts and mouths off throughout the film in a manner I haven't seen since Bruce Willis in the Last Boy Scout. This is an 80's action movie at it's core set in space. One of failures of recent action movies trying to be an 80's action flick is that they forgot that the hero needs to go up against a memorable villain. In this we get 2 brothers that actually deliver the goods. Add in a fancy Star Wars inspired ending and you have fine Friday night escape.<br><br>Don't think too hard and enjoy the trip.","user":"christophershugg","rank":[56,70]},{"title":"Very fun and Entertaining for what it is","rating":8,"date":"19 July 2012","review":"First off, Lockout is not meant to be taken seriously. It is a fun action sci-fi movie that breaks the boundaries of what it physically possible. Remember when you were a kid playing with your little action figures in the sandbox, well that is how they designed Lockout. They forgot about what is real and what can actually be done and simply had fun.<br><br>Guy Pearce is hilarious and teamed up with Maggie Grace the laughs just keep rolling. It is an action, sci-fi, comedy that is amazingly well crafted if you can take your thinking cap off and just have fun. There are a few plot twists, but nothing you didn't see coming. While Lockout doesn't really bring anything completely new to the table, it is very entertaining and well worth multiple viewings.<br><br>Due to mixed reviews I did not expect much, but Lockout really impressed me with its style and fast paced action. Other reviews has said that the special effects looked terrible, that is simply because of the style. One thing Lockout has is style and solid direction and cinematography. They knew what they were doing with this movie and they pulled it off perfectly.<br><br>The PQ &amp; AQ were great on Blu-ray and while the special features were lacking, it is still a solid Blu-ray release.<br><br>Recommended!","user":"Foxbot","rank":[40,49]}]