[{"title":"I think I got it","rating":7,"date":"28 December 2012","review":"Decided to watch this on Netflix because the plot summary seemed good and because I'm a sucker for all those Indie movie awards on the covers. I will admit I was a bit lost through the most of the movie. It seemed as though the movie dragged on and didn't really go anywhere. I started thinking I should have listened to the 2.7 average rating on Netflix, but I was too far in and decided to finish. I ended up frustrated because I did not fully understand the movie and I did not believe it was simply trash as some of these other reviews have described. I like to appreciate the hard work that goes into making this form of entertainment and I love to support independent films. After reading some different views and opinions, I believe I may understand the film now. Hopefully if you are a bit lost as well, this might help; or I may be completely wrong.<br><br>The movie centers around Lee who is seen fighting in the Civil War at the beginning of the film. He is sent off to find some strange artifact. Fast forward to 2039 and Lee is the first person in 20 years aboard the International Space Station. After a few days (may have been more time) Lee loses contact, and a recorded message from Houston tells hints at something happening on Earth (so does a later scene that shows what could be explosions on the planet, followed by all the lights disappearing).<br><br>Time goes on and Lee starts losing his mind. He begins to talk to himself, and eventually finds a journal from his Civil War self. He becomes obsessed with the journal and begins drawing out what he reads all over the station. The journal stops when Lee finds the artifact, but he never wrote down what he saw. Eventually, future Lee loses hope and decides to leave the station saying he would rather die on Earth.<br><br>This is where the story gets weird and starts spinning each way without any sense of direction. It is never shown Lee unhooking from the wire holding him on to the station. However, it then shows him back in the station but with a beard that must have taken at least a year to grow. There's no way he went back in because the station did not have enough power to support him anymore, hence him leaving the station. The movie ends with him finding this server room, which to me seemed to be the memories of everyone. Someone is talking him throughout the end of the movie, and the artifact is shown to be an alien ship in a crater. However, the ship is then shown in orbit around Earth, and the voice welcomes Lee.<br><br>This is my thought on the movie, and hopefully it will help with the negative reviews. I believe Lee killed himself when he left the station. What happens after that I believe is his life \"flashing before his eyes\" sort of speaking. I think that when he died he joined consciousness with everyone else. Where they on that ship? Was it just their memories? I'm not sure, but there was a sense of happiness a the end, and you could hear someone tell him he was the last one. If you've ever studied \"whacky\" science you will understand. I think the movie is a play on social consciousness and how we are all one.<br><br>Pretty crazy stuff, I know. That's my take anyways. I don't believe the movie is as simple as it seemed. Just think it was a bit different and that no reason to hate it. Just need a broad mind and you need to think outside the box.","user":"josh-gillette619","rank":[33,40]},{"title":"Agonizingly slow and disjointed, very disappointing","rating":4,"date":"2 December 2011","review":"Typically I have a soft spot in my heart for Indie and low budget films. When I saw that this film had a decent user rating (at the time of this writing) I thought I might be in for a treat much as I was when I watched other great Sci-Fi Indie films such as \"Moon\", \"Pandorum\", \"The Man from Earth\", \"Melancholia\" and \"Another Earth\".<br><br>Sadly, I had to force myself to watch this through to its end, in the hope there would be something redeeming to justify the agony of watching what I had already put myself through. While I did not anticipate the \"revelation\" at the end, it certainly did not leave me whole.<br><br>Great films, even if only moderately good, take you on a ride of ups and downs I am very sorry to say this was just plain boring and full of unnecessary scenes and shots.","user":"brmelez","rank":[102,138]},{"title":"No Love Lost for This Stinker","rating":3,"date":"18 February 2012","review":"Sometimes I am like a moth to a flame when I see a poster covered with those awards all over them. \"Winner, best international film, Siberia film festival!\" I just can't resist checking them out. So, that leads me to watching Love What a mess a movie. Someday I will learn my lesson. I didn't know anything about this movie but from the trailer it looked promising, even if it did seem to be a rip off of Moon. The premise is pretty simple. An astronaut is orbiting the earth on a space station. There is an undisclosed incident on earth and now the astronaut is trapped on the space station with no way to get home. Sounds interesting right? Nope. The movie bounces between the astronaut and another story involving a soldier during the Civil War. The soldier has been sent on a mission to investigate a mysterious object. Apparently the soldier left a diary that the astronaut has with him on the ship. The astronaut becomes enthralled with the story and with a bunch of old Polaroids that he finds. Eventually due to loneliness and boredom the astronaut starts having crazy hallucinations.<br><br>The movie for me was 90 minutes that felt like an eternity. It is a movie that doesn't really go anywhere. It is really just a prolonged music video for the band Angels &amp; Airwaves who did the soundtrack. I would have preferred if they had just done a movie about the Civil War story. I think it would have been a much more interesting film. Love starts off fairly strong and dissolves into a mess of visuals and abstracts that made me understand why I had never heard of this movie. It is just not very good. Listen to the first line in the trailer below and I think you will get an idea of the type of movie that you are in for; \"When all that is left is a simple shadow, what will we want it to say?\" I want it to say \"Pretentious drivel.\" If you are a fan of Angels &amp; Airwaves then you may get some joy out of watching this but, I recommend everyone else go watch Moon instead. It is a much better film. Love gets 1 guy from me.","user":"ThreeGuysOneMovie","rank":[54,73]}]