[{"title":"Reviewed the same night","rating":6,"date":"20 November 2010","review":"A fine professional cast, including the sadly underused -- by the industry, anyway -- Jennifer Beals enliven a very pleasant little Christmas movie. R.D. Reid makes an amusing, if rather Irish sounding Santa Claus who has taken a tumble off a roof and lost his memory -- and what, pray tell, will happen to Christmas without Santa? Cue Jordan Prentice as a rather overwhelmed head elf who struggles to get Santa back in shape using Miss Beals' dysfunctional family.<br><br>That's the set up and the movie rings the changes on it in a workmanlike fashion. I have some minor issues with the pace of the direction, but the cast goes through its paces with such obvious goodwill that I can't bring myself to cavil. A merry night before Christmas eve to you all who watched this.","user":"boblipton","rank":[18,19]},{"title":"The Night Before Christmas was great","rating":10,"date":"4 December 2011","review":"Another Hallmark Christmas movie with plenty of the right elements but somewhat uninspired.<br><br>Santa crashes and loses his memory. He takes up residence at a disjointed, not really in the spirit of Christmas, family led by the ever watchable Jennifer Beals. His chief elf(not from 'Elf'), nicely played by Jordan Prentice, works with the family to try to help Santa get it together in time for you know what.<br><br>The family is too tied up in their work and own affairs to appreciate the meaning of the season and each other.<br><br>It's clean and well meaning but not super funny or novel. I'd say enjoy it for what it is. Merry Christmas!<br><br>Fun action believable, some sad family scene, but it ended with everyone finding themselves and the meaning of Christmas. well worth watching. Wow, haven't seen Jennifer Beals in a while - she looks great! Looks like a fun new Christmas movie!","user":"brantley7","rank":[7,10]},{"title":"An old soft comfortable shoe","rating":8,"date":"16 November 2014","review":"Now that I have said how I feel about it I must warn that most people will not like this movie. It is too cliché, too predictable, and maybe too slow. But it is unique in the fact that this is the only Santa show I know that Santa doesn't know he is Santa.<br><br>So why do I like it? I don't really know but Christmas before last was when I first saw it and it seems to have just the right homey touches and surprises. It won't win academy awards but it will be suitable for small children or children at heart. I especially liked the bag and its travels. I don't know why but I missed this movie last year. I am getting it several times this year and it is like an old soft shoe. I like it just as much as Kelsey Grammar's A Christmas Carol (The Musical) and Tom Hanks The Polar Express. Christmas just wouldn't be Christmas without these movies and the wonderful music the school choirs sing.","user":"henryhertzhobbit","rank":[2,2]}]