[{"title":"Don't pay attention to the negative, shallow reviews and low score","rating":8,"date":"23 October 2018","review":"No idea why this was so poorly rated, because it's a good, solid, if sad, story. The acting was good, especially the lead. Perhaps they were expecting something like a shallow Hollywood thriller or horror flick. That's not this. This is a slow-burning, disturbing tale that kept my attention the entire time. Yes, it has some quirks in the cinematography and musical choices, but this is a very good dark family drama.<br><br>I consistently see a lot if Australian, UK, NZ, CA, etc. movies with ridiculously low scores and bad reviews, and all I can think of is the viewers must be middle Americans who only like American Hollywood, predictable, cookie-cutter movies.<br><br>That said, this is a sad, disturbing movie, so don't watch it if you are expecting something else.","user":"vegicat","rank":[4,8]},{"title":"Australian indie","rating":1,"date":"17 March 2018","review":"DON'T SHOW MOTHER is an indie thriller from Australia that tackles the subject of domestic abuse. It goes for a psychological approach but doesn't work due to the fact that the whole thing is poorly written and the characters unconvincing. A son and his mother flee from an abusive situation. The low key look is entirely predictable and the twists that do arise are anything but surprising. Instead, this is a long-winded bore.","user":"Leofwine_draca","rank":[2,8]},{"title":"depressing","rating":4,"date":"27 September 2018","review":"This is the kind of genre that cant make blockbuster headlines or boxoffice glamour,made down under or over the water or in uzbekistan,there aint no recipie for success anyhow.\nthis aussious just over feature length family drama is a tragic story of belief and disbelief, trust and hate,psychopatia versus sosiopathia, and it is summarised by total death and destruction in the end.\nit might reflect an avarage australian life,but i really hope it isnt.\ncast ok,shallow script,low grade cinematography , sets and locations.\nwanna keep your backpacker kids away from australia,show them this...","user":"ops-52535","rank":[1,5]}]