[{"title":"Who is the genius wrote teh screenplay?","rating":6,"date":"15 July 2018","review":"Love Neeson but The Commuter has one of the most ridiculous plots I have ever seen, even for an action film. Nothing make sense, literally, NOTHING: <br><br>1) The nemesis, Joanna (played by Farmiga), who is off the train, seem to know every single move MacCauley (played by Neeson) made throughout the entire event, she was always able to call him at the exact moment each critical task was completed, how did she pull it off? No logical explanation is ever given to the audience<br><br>2) It's even more ridiculous, when Joanna called MacCauley to witness through the train window, a random passenger Walt (played by Banks), who just got off the train, being shoved in front of a bus, because MacCauley stealthily slipped Walt a note asking him to contact the police. How did Joanna find out? We don't know. How could Joanna time the whole sequence of events so perfectly (sent her accomplice after Walt, anticipate there will be a bus coming, anticipate MacCauley has a straight line of sight to see Walt being pushed on a street at least a block away from the train platform, how does she know Walt will even take that route, ...), we don't know.<br><br>3) Train derailed at 70 m/hr., but all windows intact, none of the remaining passengers seemed to have a scratch<br><br>4) After the train derailed, none of the passengers seemed too eager to get off the train. And they weren't being held hostage<br><br>5) While being surrounded by scores of police + FBI agents, a rogue police officer Murphy (played by Wilson), stepped onto the train, pretending to negotiate for hostage release, but with real intent to kill the witness. Keep in mind, there are at least 10 passengers on the train at the time, and the police seem to be using some sort of heat-signature technology to watch every movement inside the train car. So what is the end game here? Does Murphy intent to commit mass murder to eliminate all passengers, while FBI is watching outside? If not, how does he intend to get away with murder if the rest of passengers just saw him kill the witness? <br><br>6) Why the FBI send the witness on the train, instead of picking her up? Won't that put the witness in unnecessary danger? <br><br>7) If the rogue and \"powerful\" organization know exactly where the FBI will pick up the witness (Cold Spring), won't it be easier just send a hitman squad to kill the witness + FBI agents at destination? Why even bother to derail a train and kill everyone on board? Both carry a death sentence anyway<br><br>How? How? How? How? How? How? How? How?","user":"dothancore","rank":[171,190]},{"title":"The Commuter","rating":7,"date":"20 February 2020","review":"I liked it a little better than the majority I guess but I'm a sucker for these typical Liam Neeson movies, ever since the original \"Taken\" and \"Non-Stop\". The movie kept you guessing but then it got kind of obvious at the end.","user":"MR_Heraclius","rank":[42,44]},{"title":"Too implausible","rating":3,"date":"15 October 2018","review":"I wanted to like this. It's cool that Liam Neeson launched an action-hero career later in life, and while I loved him in Taken, it seems like he's mostly picked nonsensical action scripts since then. For example, Non-Stop was far-fetched but if you did a little extra suspension of disbelief (which I did), it turned out to be a pretty good thriller. But this?? This?! <br><br>This is one of the silliest, most implausible scripts ever written. The entire premise makes zero sense. ALL-SEEING, ALL-KNOWING \"Bad Guys\" (Well, Vera Farmiga) can make literally anything happen at any time, kill anyone inside or outside the commuter train, and see what's going on inside the commuter train at all times - and yet they can't locate and kill the single witness who's on the train. Thus, they need to pull Liam Neeson's strings to make it happen. The implausible moments pile one on top of the other throughout the film. <br><br>However, the film does have some very good action sequences, so if you're going into without any concern for story at all, you might have some fun with this one. Mindless action. But come on, Vera Farmiga, I expect much better from YOU!","user":"mycannonball","rank":[84,99]}]