[{"title":"Elysium is visually gorgeous but its story and characters left me cold and disappointed","rating":5,"date":"9 August 2013","review":"After director Neill Blomkamp's fantastic debut film District 9 I was understandably eager to see his new sci-fi film Elysium. Unfortunately his second feature doesn't quite match up with the greatness that was District 9.<br><br>Visually the film is quite stunning and it has some great cinematography when it comes to the larger shots. The CGI effects are excellent and blend in well with the environment. The Earth of the film looks very gritty, believable and lived-in and the space station Elysium has this very sterile and futuristic look to it. You could really buy it that Earth could look like this with many decades of neglect and poverty. Everything's in disrepair and in decline. The rich on the other hand have every resource available to them in their own little paradise in space. The set and production designers truly did a great job with the locations. <br><br>Matt Damon is decent as the film's protagonist Max who is an ex-con now working on assembling the droids which keep order on the now overpopulated Earth. His role and the writing of his character isn't anything too special or memorable but he does what he can with it. He's just a no nonsense guy who is thrown into a difficult situation. He was also quite sarcastic and funny when he was dealing with the droids in the earlier part of the film but we didn't see this side of him at all after that. Alice Braga plays Max's childhood friend Frey with whom Max meets up again when he's an adult. I didn't feel much of an emotional connection or chemistry between them though and that hampered the film a bit. Their back story is told almost completely in sentimental flashback sequences which I didn't care for. The antagonists in this film were very one-dimensional and over the top. Jodie Foster plays Elysium's defense minister Delacourt and Sharlto Copley (who was also in District 9) plays an undercover agent named Kruger who is positioned on Earth. They're both very cliché and uninteresting. The writing of all the characters wasn't very good at all in this film and I didn't get emotionally invested in any of them. <br><br>The story isn't that great either and this then also takes away from the film's many action sequences because we don't have that big a stake in them. The film starts quite strongly as it juxtaposes the situation on Earth and on Elysium to highlight the problems of social and economic inequality. Then suddenly when the action starts, these issues fade far in to the background in favor of more and more action. From the trailers and the hype I really got this impression that the film would deal with these issues in a thoughtful manner. Regrettably this is not the case with this film. A big problem with the film is also that none of the characters seems to learn anything new or change their beliefs or anything like that. A huge part of the success of District 9 was in seeing how the main character evolved after spending some time with the aliens. In Elysium the good guys are the good guys and bad guys are the bad guys. There's no complexity, nuance or subtlety in any of them. We also don't get to meet any other citizens of Elysium beside the higher up leaders like defense minister Delacourt and president Patel. It would've been interesting to see the common people of Elysium and how they react to the situation, what their beliefs are and what drives them. The writing is also a little too pointed out and heavy-handed. Some of it just made me think \"Wow, really?\". For example, at one point the CEO of the droid production company literally tells some mid-level manager not to breathe at his direction. Things also seem to happen way too conveniently to push the plot along. Then again you could say this about many films but you really start to pay attention to these things when you're not completely engrossed in the film. This film surely would've benefited from a more subtle approach. The ending was also way too simplistic for my taste.<br><br>The action in this film is quite intense and it looks very impressive at times. The exoskeletons were fun and looked convincing. Then comes the shaky cam. Oh boy. It's really quite annoying and very often it's hard to see what's going on. They should've really taken a page from the Bourne movies on how to shoot action scenes. Luckily the shaky cam isn't there all the time but the action could've definitely been improved with a clearer shooting style.<br><br>All in all, the film has decent action with absolutely gorgeous visuals and it moves along at a good pace. Sadly the writing, the plot and the characters aren't that interesting and it's hard to get emotionally invested in this film. It's watchable and probably quite entertaining if you're in the proper mood for it. For me, the film ultimately left me a bit cold and disappointed.","user":"lornloxor","rank":[764,995]},{"title":"Liked the CGI and sets, but didn't like the story","rating":5,"date":"10 August 2013","review":"What seems to be a trend in big budget SF films occurred, once again, in Elysium. I'm continually impressed with what is being created (visual effects wise)today, but remain disappointed when it comes to the associated screenplays/plot lines. At the end of this film, I had the same, perpetual feeling that no one out there making SF films gets the message: without a good story, you don't have a really good film. Elysium hearkens me back to Prometheus, directed by Ridley Scott. I would have thought he, at least, would appreciate the need for a good story to match the visuals. Especially after being the brains behind Bladerunner. But, oh no - same thing. I suspect that so much talent and expense is spent on the visuals that insufficient amounts of funding and time are left for the associated story.<br><br>I just wish that, when someone comes up with future plans for making a legitimate SF film (sans comic book scenarios), they contract a real science fiction author to write the screenplay. There are any number of SF writers out there that can, I believe, turn out much better scripts than currently making their way to the big screen.<br><br>Bottom line: the world building in Elysium was excellent. Probably some of the best since Avatar. I wish there had been some of this when Bladerunner was produced. As an avid, and long time fan of true science fiction, I thoroughly enjoyed that aspect of the film. As for the story, it could have been a lot, lot better.","user":"mmccord9126","rank":[526,757]},{"title":"Elysium gets worse and worse the more I reflect on it...","rating":1,"date":"13 August 2013","review":"This movie was such a colossal failure on so many levels. I don't usually write reviews for movies, but this monstrosity was so atrocious that I felt compelled to warn unsuspecting potential viewers of the steaming pile of sewage that is referred to as \"Elysium\".<br><br>Where to start<br><br>First off, the plot was a laughingstock. Even if you can ignore the choppy camera-work that looks like the doings of a toddler with a buffed up camera, there's no ignoring the plot. Some examples of the numerous holes in the plot 1) Apparently, if a grenade gets blown up inches from your head, your brain is still intact and it can be repaired at Elysium. 2) If Carlyle could make the code to make Jodie Foster president, then why didn't he just make himself president or give himself all the power, by implementing the code himself or subtly adding a nuance in there? Not the sharpest tool in the shed. 3) Where are all the satellites to help track down Matt Damon while he is fleeing the villains? It seems some of the technology 100+ years in the future has actually regressed. 4) If the medical terminals can literally give a person a new head, through repairing a \"brain\", why can't they disable the sociopathic tendencies of characters like Jodie Foster on Elysium? Once again, only certain technology has evolved for the director's benefit. 5) In order to let one spaceship enter Elysium, you must allow all spaceships to enter too by taking down the no-fly zone. That makes total sense. 6) Last but certainly not least: the ending. Apparently everyone is going to live happily ever after on Elysium now? Every rich person on Elysium just wanted all those poor people on earth to suffer! But now the world is sugar plums and everyone lives happily! Yay!<br><br>Secondly, there was never any point in the film in which I felt connected to the characters in any matter. Why was this? Well, none of them had any depth. The dialogue was one cliché after another. The primary villain in the story appears to have some sort of speech impediment, because for most of the movie he is inaudible. A well-told story will also have a villain that has deeper complexities as to his/her background and motives. This character was just a bumbling moron. Matt Damon and Jodie Foster did the best that they could, but their scripts were so poor that it would have been more interesting had they been reading off the menu at a local Olive Garden. The exchange regarding the hippo between Damon and the little girl that is dying of seizures had me cringing in my seat at the awkwardness of the whole matter. I should have walked out then and there.<br><br>Also, why was the best look we ever got of Elysium one where we saw a few trees and a woman swimming in a pool? Would looking at the inner workings of the politics and lifestyle on Elysium simply have exposed this film for the fraud that it is? I'm not going to go too deeply into the themes of the movie, as everyone has their own opinions, but it doesn't take much to realize the hidden (and rather misguided, imo) opinion of the director in this one. The message was about as subtle as receiving a ton of bricks to the head. View at your own risk for your blood pressure will likely rise after watching this one, as it objectively is a pathetic disgrace of a film.","user":"lbuttny","rank":[450,716]}]