[{"title":"Tough, but Fair","rating":8,"date":"20 July 2012","review":"If you're expecting James Bond, or even Jason Bourne, you've come to the wrong place. This is a brutally realistic film about how both sides in the so-called 'War on Terror' bend every rule of civilized conduct in order to further their own questionable ends. It's a story about people who have absolutely no doubt that their ends justify the means... even though those 'ends' long ago ceased being particularly noble, if indeed they ever were.<br><br>The story concerns the journey of one Middle Eastern man from political agnostic to suicide commando. His compelling, if fairly obvious, tale is counterpointed against the gradual awakening of the British assassin sent to track him down, operating well outside the rules of police work or even espionage.<br><br>There are no laughs in this movie, no car chases. There is extreme violence, and a lot of incentive to question the purpose of that violence. The characters are strong, as is the message. Unfortunately, those who most need to hear that message are likely to either avoid this film entirely, or conveniently misunderstand it.","user":"fung0","rank":[26,28]},{"title":"Thoughtful & even handed British script","rating":8,"date":"7 July 2012","review":"What I enjoyed most about this films that it showed both sides of a very British story without being preachy, one sided or have an agenda. What made me watch it all the way through is that it was all built into the thriller format.<br><br>What I have found in many films dealing with this subject matter is that they all have been either heavy handed but mostly too worthy. Cleanskin gets on with telling a story and just observes and keeps a distance from the issues, simply presenting them asthey are.<br><br>It was good to see the process of how a man born here in the UK is turned to the road of murder and how people use him for their own reasons and benefits. Very refreshing to have a film show the process and treat the character of Ash objectively but showing all his appalling faults. <br><br>It was Sean's Beans best performance for many years, I'm not too familiar with all his films but I thought he did a very good job with this film as he did on Game of Thrones. The good thing about his character is that he wasn't the standard angry soldier, he had a history and motivation.<br><br>My favourite scene was when Ash is about to commit his attack he visits the Cleric, Ash wants reassurance about heaven and the cleric reassures him then hurriedly goes to his sons birthday party leaving Ash alone to commit his act while the Cleric is enjoying himself elsewhere. I think that scene sums the film up, very poignantly written.","user":"SkyGirl3","rank":[51,63]},{"title":"Sean Bean nails it!","rating":9,"date":"18 July 2012","review":"For me, Sean (aka 'Ewan') puts on a fantastic performance, in a film where I was also very impressed with Peter Polycarpou (aka 'Nabil'). The romance between Ash and Kate felt very believable, not all actors/actresses can pull this job off.<br><br>It was a film that touches on a very serious subject, so for all you rom-com addicts, prob not one for you, lol! However, although a serious topic, you'll find some light hearted humour in parts of the film.<br><br>Have already recommended to friends and family, purchased on DVD myself, so go and watch too if you already haven't.<br><br>Overall, a great watch with some excellent action shots and twists and turns throughout.","user":"meldavies74","rank":[32,38]}]