[{"title":"Wow","rating":10,"date":"3 April 2010","review":"As a basketball fan and knowing that HBO does an excellent job with documentaries, I had high expectations for this, and it certainly didn't disappoint.<br><br>Born in 1981, I never fully appreciated the rivalry as it was happening, but this certainly put it in perspective. It covers every intricacy of both the rivalry and the two men as individuals. After viewing it I'm not sure that there is any story in the history of sports that's as unique and special as Bird and Magic.<br><br>It started in 1979 with the NCAA championship and continued on to the NBA for several years.<br><br>On one hand you have Bird, the introverted type-A personality from Indiana; on the other you have Magic, the happy-go-lucky extrovert. The two men couldn't be more different personality-wise. So naturally in the early stages of the rivalry they had every reason to dislike each other. Yet as things progressed and as they found out more about each other, the relationship softened. For all their differences, they were eerily similar on the court and because of that there was a deep-rooted respect. Things really started to change when they got together to shoot a commercial for Converse at Bird's home in Indiana. And when Magic first announced he had HIV, Bird was one of the first people to reach out to him. It's obvious how much that meant to Magic.<br><br>I believe that every professional athlete can learn so much from both of these guys. The respect they have for the game and for each other represents the greatness of sports. It's really what it's all about and this documentary captures it like nothing else I've ever seen. Brilliantly done.<br><br>I also found it amazing how much pain Bird was in during the latter stages of his career. Yet he kept toughing it out game after game, season after season. You'd be hard pressed to find any one who'd do that in today's game.","user":"blitzhard56","rank":[19,20]},{"title":"Excellent Documentary","rating":22,"date":"22 April 2012","review":"Magic &amp; Bird: A Courtship of Rivals (2010) <br><br>**** (out of 4)<br><br>Exceptional documentary covering the rivalry between Larry Bird and Magic Johnson. The film covers their first meeting in high school, their battle for the NCAA National Championship and then their battles in the NBA. Throughout their battles on the court we get to see what made the two men who they become, what different things they were doing off the court and finally what brought the two of them together as friends. If you're a sports fan then you already know this story but it's really amazing what this HBO documentary is able to do because it's just so excellent that it really makes you forget what you already know and it makes you feel as if you're hearing these stories for the first time. The documentary is just so much fun and so touching that you can't help but get caught up in the excitement in these two men. The documentary starts off talking about Johnson and Bird's early lives and we learn where they got their drive to try and become the greatest of their era. This strong passion forced both of them to see the other as the rival and it's just fascinating seeing two people with so much passion and fighting for the same thing. If you know the story then you know many of the stuff discussed here but it's still very entertaining. This includes their first shot at a friendship while shooting a commercial and then there's the story of Johnson's announcement that he's HIV positive. Sport fans are really going to be impressed with this documentary but the film is so strong that even those who don't know Bird and Magic will still find this entertaining. This is certainly one of the most energetic and touching documentaries that's out there and it's well worth watching.","user":"Michael_Elliott","rank":[6,6]},{"title":"Well Done Documentary","rating":10,"date":"17 November 2018","review":"What a lovely and well done documentary. I didn't plan to watch it all but the story just made me sit back and soak it all in. I wish I could have seen these two play. I started following the sport when I saw Michael Jordan with the Chicago Bulls.","user":"vochieng83","rank":[3,3]}]