[{"title":"Gantz 2: Perfect Answer has no perfect answers","rating":9,"date":"23 August 2011","review":"The long wait is over. I am finally able to see the concluding movie to the two-parter series. I enjoyed it a lot. Gantz: perfect Answer is a good concluding movie. Although I wished that Gantz would become a trilogy. Heck, the manga has not yet been finished publishing. It won't hurt to extend into another movie. But the director has in mind a two-parter series and ends the movie firmly. Anyway, that's my wishful thinking.<br><br>The story: After the first movie, I started to read the manga. So I know more about Gantz when watching the last movie. I can see the movie is somehow faithful to the manga but points and scenes have been changed or added on. But the main story seems faithful. Answers are not really explained properly as what reviewers said. But I don't mind that. The action scenes are few but extended. Action fans will have to wait for a while for the first real action scene involving a battle in a train. Unlike the first one, this is not as action-packed but it still delivers the action. This movie packs the thrills and suspense too. As the manga has not yet finished, I could not wait to see how the director ends the movie. Acting is okay, there is still some of the over-the-top crying and screaming. Music is surprisingly epic.<br><br>Overall: A good Japanese movie with great action, thrills and music. Although the movie does not deliver in explaining unknown questions like movie-goers expect, this movie does deliver some of the best action not seen in Japanese movies and that should take your mind from the unsaid answers. Good series. Hope there will be more big-budget Japanese movies series. Japan needs more of this kind.","user":"helmutty","rank":[24,44]},{"title":"A rather dramatic mess","rating":6,"date":"19 June 2017","review":"This continues on the Gantz story. A strange sphere resurrects dead people so they can fight aliens to the death.<br><br>I was a massive fan of Gantz - not so much of Gantz 0. This sequel is pretty disappointing. The actual alien fighting is pretty limited, the majority of the film is spent outside the combat zone.<br><br>the romance and character interactions are pretty interesting, but it feels a bit like you are watching a Japanese soap opera.<br><br>The story aims to shed some light on Gantz. This seems like a mistake as Gantz needs to be fairly enigmatic - but fails completely anyway. After all is said and done you are left wondering why 90% of what happened, happened. None of it makes any sense.<br><br>The film does not really cater for a western audience. It is overly dramatic and tragic. Many poignant last words are mumbled through blood stained lips whilst being cradled by a loved one.<br><br>Not enough action, too much drama, much, much too random.","user":"thekarmicnomad","rank":[4,6]},{"title":"Facepalm","rating":4,"date":"20 September 2015","review":"What a way to ruin one of the best mangas of all time. What a mess.<br><br>The first film was decent although a bit boring, roughly followed the manga.. dragged on some scenes and unnecessarily skipped other important ones, but it is understandable due to limited time. Ending was changed a lot but still recoverable from this error in judgment.<br><br>This time however very very little went according to the excellent story in the manga. There was so much potential, but wasted.. the last invasion arc would have made an excellent film, but this was too early for that of course. .but even just some of the finer missions would have been fine. I can think of at least 3 of similar caliber to the ending of the first film.. not exactly sure at which part the plot was in 2011 but still.<br><br>Acting was fine, action pretty cool, but the plot was a mess and pure wasted potential. Just read the manga.. and weep.","user":"tsoderlu","rank":[6,11]}]