[{"title":"What a relief! The trailers lied--it was awesome. :)","rating":9,"date":"16 December 2011","review":"We just got back from the earliest showing we could get a sitter for. I can say with confidence that my fears about this movie were totally unfounded, and I now hold Guy Ritchie and these writers in the highest regard. Without going into spoilers, here are the three concerns that were put entirely to rest: 1) After seeing the trailer, my biggest worry was the use of \"bullet-time\" type photography during a Victorian-era movie. I thought it would be completely anachronistic and pointless. However, they'd already established in this movie and the previous one that Holmes is hyper-aware of his surroundings. The bullet-time was used to convey how traumatic a couple of scenes were to someone with that type of awareness, and it worked beautifully.<br><br>2) Jared Harris looked so vanilla and soft in the promo pics and trailers that I couldn't imagine him as a fearsome adversary for Holmes. However, his Moriarty is so devious and cunning, and at one time downright sadistic, that I don't think they could have made a better choice. A couple of times I felt like he was channeling his father (the outstanding Richard Harris) without the warmth and empathy that the late actor conveyed. Can you imagine Richard Harris as a cunning, calculating perfectionist that's totally devoid of concern for human life? You won't have to after watching his son. It's freaky. And he sings.<br><br>3) Holmes' relationship with Watson (and in a small way, Irene Adler) is fantastically developed. Saying any more than that would be too spoilery.<br><br>So, watching this w/ my husband(who is a die-hard Sherlock fan, and used to read Sherlock Holmes aloud to me every rainy night, complete w/ voices) was a fabulous experience. We can't wait to see it again, and own it.","user":"dottyjyoung","rank":[225,330]},{"title":"Elementary Holmes","rating":16,"date":"16 December 2011","review":"Professor Moriarty: Are you sure you want to play this game? Sherlock Holmes: I'm afraid you'd lose.<br><br>In Sherlock Holmes: A Game of Shadows, my mind turns two ways: The first half is guns, gunpowder, and gymnastics. Sherlock Holmes (Robert Downey, Jr.) and Dr. Watson (Jude Law) contend with the salvation of civilization mostly through athletics, aided by director Guy Ritchie's considerable skill with the camera and graphics.<br><br>But in the second half, when the duo moves swiftly but intellectually to confront the arch villain Professor James Moriarty (Jared Harris), my mind is at equilibrium, renewing my love of Sir Arthur Conan Doyle's original brainy, eccentric sleuth. The chess game is a marvel of strategy, replete with revenge, intrigue, and just plain ingenuity. Director Guy Ritchie's visuals include delightful Downey disguises and lively speed ramping in a forest bombarded by bullets. Hans Zimmer's music leans heavily on the fiddle to lighten the load of a difficult plot.<br><br>Watson's marriage, rather than taking away from the bromance, adds unexpected color and creativity. So Ritchie has ramped up the intellectual content and at least balanced it with the athletic, which was a strength of his 2009 version, Sherlock Holmes. With Inspector Lastrade just a memory and Holmes's love, Irene Adler (Rachel McAdams), appearing briefly, we are left to enjoy not so much the interaction of Holmes and Watson but the explosiveness of Holmes and Moriarty.<br><br>After a first half of explosions, the second half satisfies traditionalists like me for the chess game of life and death—and that's the suspenseful fate of the world in those pieces. Director Guy Ritchie has improved on his 2009 version.","user":"jdesando","rank":[146,214]},{"title":"Sherlock at the movies","rating":8,"date":"29 January 2012","review":"Doesn't matter how you look at it, this movie is darn good fun. I loved it from opening credits to the close. So what if the acting is a bit over the top, so what if there are probably too many explosions and bullets and bombs. The end result is a thoroughly entertaining 2 hours at the movies with popcorn and Pearl and Dean ads. Moriarty is sufficiently creepy and played with restraint, Holmes is completely over the top but for me if its Robert Downey Jr there are no complaints. The story keeps moving and the action is terrific. The story is loosely based on the last book of the Conan Doyle's first series of Holmes stories ending with the famous Reisenbach Falls in Switzerland. It also gives a great image of early 20th century on the brink of the first world war. If you want to enjoy a good story with great imagery and costume then you will enjoy this, if you are looking for Sherlock ( wonderfully called Shirley by Mycroft ) as Conan Doyle intended then you may be disappointed.","user":"remedy305","rank":[21,27]}]