[{"title":"'New Year's Eve' felt mechanical and forced, a project merely designed for profit. This is rather a 118 minute tourist video about how wonderful The Big Apple is","rating":4,"date":"7 December 2011","review":"After his last holiday-themed box-office smash Valentine's Day in 2010, director Garry Marshall has carbon-copied the exact same formula for his latest film New Year's Eve which uses its gigantic ensemble cast to document various different relationships and states of emotions over the course of a single day and night in New York City.<br><br>The story lines include: a couple awaiting the birth of their child, two people who become trapped together in an elevator and a gentleman who is trying to enjoy his last New Year's Eve on earth as he sadly lays on his deathbed.<br><br>Much like Valentine's Day, Marshall's latest film seems to forget the importance of character development and indeed sure-footed narrative; these films feel like the audience are watching Ashton Kutcher flirt with Lea Michele, or Zac Efron helping Michelle Pfeiffer, which – in all honesty – they are. Never are viewers able to break away from the celebrities portraying these supposed characters, which cause great issues when trying to build and present emotion.<br><br>The film also has some bizarre cast members, including the incredibly pointless Jon Bon Jovi who slinks about, and may as well be promoting a new Greatest Hits album when he enters the frame. Stars like Halle Berry and Robert De Niro are incredibly redundant here, even though they do benefit from moderate screen-time. Performers like De Niro are worthy of a solid script and something more important to do rather than just stand around holding a theoretical sign saying 'And Robert De Niro'.<br><br>Contrary to the opinion of the majority of critics (or males), 'Valentine's Day' was yes fluffy, gooey and forgettable two hours, but also entertaining. It did try very slightly to be different – with a gay romance amongst other things – and whilst this was all still \"Hollywood\", there were far worse movies released in 2010.<br><br>To be fair to 'New Year's Eve', it is not amongst the worst of the year. This might be due to the fact that most of the audience had or have extremely low expectations upon arrival. Expecting a film to be bad makes it all the less painful if the final product is indeed poor and consequently, makes it seem much better than it truly is if a viewer is not disappointed.<br><br>'New Year's Eve' felt mechanical and forced, a project merely designed for profit – there is no love nor compassion, no credibility nor realism. This is rather a 118 minute tourist video about how wonderful The Big Apple is, and how beautiful the people who reside in it are. Throw in disgusting amounts of product placement and an old rock star, and hey, you've got a $100 million motion picture! Spend your £8 at the cinema this Christmas on a film that gives like 'Hugo' rather than this, and save the holiday romances for 'Love Actually' on DVD with the family or partner.<br><br>Verdict:  It is better if Marshall does not attempt to make another movie about a commercial holiday again. If we see a trailer with Kutcher dressed as the Easter Bunny for love next year, run for your life.<br><br>For more The Upcoming reviews http://www.theupcoming.co.uk/category/culture/cinema/","user":"info-130-288696","rank":[115,147]},{"title":"Really enjoyable","rating":7,"date":"21 December 2011","review":"I don't think I understand people at all. I watched it despite all the bad reviews and I didn't regret it. I'm starting to think people are really bitter, it's a really sweet movie about new years and how people feel around that time of the year, it actually gave me a warm feeling, so yes, it's not a deep smart full of effects movie, but sometimes people need a movie like this, I'm all against unchallenging movies, but I don't think this was the case at all. It's the perfect new year movie, that gives you hope for the year to come and live everyday fully. The variety of characters is okay, as you get to know them enough to see a little bit of yourself in them or not,and it's really interesting to see what different people go through at that time of the year and how they feel and what they hope to change. It really is a warm,hopeful movie, at least that's the way I saw it.Sometimes we need to take a break and take a deep breath, that's the movie.","user":"natygance","rank":[92,119]},{"title":"New Years Heave","rating":2,"date":"7 December 2011","review":"The trouble with ensemble comedies - romantic or otherwise - is that the audience is given little time to develop a relationship with any of their characters. This is certainly the case with Garry Marshall's seasonal effort New Years Eve, but the problems with the film are far from done there.<br><br>Stuck somewhere between a 'Visit New York' advert and meandering rom-com, few of the movies plots are linked and many are only hastily so at the end of the movie, almost as an afterthought. The film is incredibly low on laughs of any variety and despite - or perhaps because of - its huge star cast it never feels like its going anywhere, much like the Times Square ball which gets as much screen time as anybody. <br><br>The characterisation is incredibly lazy; Ashton Kutcher plays a pyjama-wearing stoner cartoonist, Zac Efron is the plucky young go-getter, De Niro (who will sign up for anything these days) is the grumpy old coot. These typecasts are bad enough before Lea Michele appears essentially playing Rachel Berry from Glee, replete with the screeching vocal performances. The cherry on top of the cake, however, is Michelle Pfeiffer who re-enacts her performance in Batman Returns as kooky wallflower Selina Kyle; to my immense disappointment she never became Catwoman and proceeded to whip up any sense of excitement. <br><br>The one positive thing I could say about this film is that it isn't offensively bad, except I cant because three of the precious few non-white, non-American characters are horrendously bad racial stereotypes. I'll leave you to spot them should you have the misfortune of having to endure this vapid exercise in futility.","user":"nathan-hooper","rank":[99,137]}]