[{"title":"Stranger than movies","rating":8,"date":"3 August 2013","review":"This is seriously strange and tough to vote for on any scale. But it did touch a nerve with me. James Franco is incredible in the main role. The characters and the story make \"sense\" (maybe not in the traditional sense, but they do). It all fits together even when the movie seems to go in a completely different direction.<br><br>There is a story, but there are also bits and pieces that somehow do not make any sense. But the actors make this work. Like all the relationships in the movie are not really complicated, but it is told in such a fashion that it doesn't really feel like something you've seen before. I thought this was a good thing. I liked most of the ideas on display here (though there are obvious flaws too of course). If you can let yourself, you may be able to enjoy it too (if you are into these kind of movies that is)","user":"kosmasp","rank":[16,20]},{"title":"Interesting but not satisfying","rating":23,"date":"23 July 2015","review":"This film tells the story of a household of three people, and a neighbour who all have some issues, or even psychiatric problems.<br><br>\"Maladies\" is a film that concentrates on the lives and interactions of four characters. James is the one that stands out, as he is a psychotic young man who seeks solace in listening to phone tones. Catherine is also interesting, as she perseveres through the hardship of living with James and Patricia. I like the fact that she stands up for herself and is assertive in the diner.<br><br>Though \"Maladies\" offer an interesting look at four different individuals who are tortured in some ways, I did not feel satisfied in the sense that I got something out of the film. It's like - now what, after the film?","user":"Gordon-11","rank":[3,3]},{"title":"Loved this movie so much","rating":10,"date":"29 September 2015","review":"The structure of this film is unique, which I feel is part of what kept me. I saw a great deal of myself throughout, so it resonated with me unlike any other I've seen before. I'll be watching this over and again because I loved it that much. <br><br>I don't think we'll ever completely understand mental illness, ever have all of the answers that we need or seek to help us in the many ways we wish them to. I was diagnosed at eight-years-old, started writing when I was twelve. The thoughts are constant, and the need to write is with me always. James Franco's character was the one that I closely related to, and the why is so hard to explain. Mental illness can take away so much, yet show us what we are capable of. I keep thinking back to the number of times James corrected Delmar about his leaving the acting world to become a writer. It's hard to say for sure whether he left or whether he was fired. There came a point when I knew that my illnesses limited my abilities at work, that it affected my performance in ways that I never imagined it would. It got to the point where my job fired me. Had I not been fired, I probably would have left anyway because I'd never allow myself to give less than what I was once capable of. Mental illness took me from something that I loved to do, which was quite painful, so I sought to find other things to do in order to feel like I was giving, that I was capable. I wanted to be able and be good at it at the same time. <br><br>Mental illness can very easily take more than what one is willing to give up. The thoughts are constant, and the need to write is with me always. Sometimes I find myself having episodes where I can't put pen to paper because the illnesses take over. They effect the thought process. Whether they're left incomplete, blur before I get a really good look at them, scatter, or overlap one another... my thoughts are one of the few things I have left. It's frustrating because I know that I'm capable. I know and yet I'm horrified every time I see myself fail. That's why I hardly ever use paper. I'd rather type and backspace than have my floors covered with those crumpled up failures, reminding me of what I am and what I'm not. <br><br>This failing made me look at James and how he wanted so desperately to write, to have his work finished, to have it exist. \"Everything needs to be made, and it needs to be made by someone. I just want to be thoughtful, to be full of thoughts.\" This was his new purpose, what he sought to do, and we watched as his illness made him slip even further. It made him slip so much that he couldn't even write anymore, couldn't even think anymore. When everything is taken away, we have a hard time seeing what's left, and sometimes when we see what's left, we find that it isn't enough. It isn't enough to make us feel like we're enough, and sometimes it takes that feeling like we're enough to believe we have every reason to be here. <br><br>I could keep going, but I feel this is enough. What a great movie.","user":"deborahdebbiedeb","rank":[5,6]}]