[{"title":"What a nice surprise!","rating":8,"date":"3 November 2013","review":"No megazillion budget. No zombies. No stupid romantic couples. No bathroom jokes. No unbelievable monsters, situations, technologies. No ultra stars. No social commentary.<br><br>No problem!<br><br>And still this is pretty darn good film.<br><br>OK, it is a retelling of Robinson Crusoe and deals with human loneliness and the price we as humans have to pay for exploration, but it was a well made film, with a good actor and a character one roots for and wishes a g and save trip home.<br><br>Probably it will appeal mostly to science fiction fans, but I would recommend it.","user":"trans_mauro","rank":[48,68]},{"title":"Realistic sci-fi exploring space in physical, mental and collective levels","rating":9,"date":"17 January 2017","review":"Not for everyone and not for every occasion. If you're looking for action, save this for later. If you want to see a realistic take on space exploration and its mental implications, it's time to watch this.<br><br>Realism is the keyword for this film. It doesn't try to convince the viewers with effects or stunts but rather in the way that you could for a brief while really feel you're in space. The director, Eric Hayden's father has been working on the Galileo probe that went to Jupiter which probably had its contribution to this film's script. The whole design of the ship and the mission is very realistic and it'd be quite close to the actual way we would go to Europa if we ever would.<br><br>Without going into spoilers, there is another level going on in the film. More human. Again the characters are realistic and they act like a well trained astronauts would. But as the events unfold, the mental evolution of the main character becomes analogous with the craft's journey both in space and fate.<br><br>There's a hint of third level on the movie which probably means I have to watch this movie again. It's not just the craft or the man inside who's making the journey but us, as human beings collectively.","user":"jani-756-425766","rank":[8,9]},{"title":"Finally a realistic Sci-Fi film","rating":9,"date":"15 June 2012","review":"I can't remember the last time a realistic sci-fi film has been made. Everything seems to be an extension of either Star Trek, Star Wars, or Alien. Never any gravity issues in any of those films, space exploration is simple, as easy as just boosting at light speed, or sleeping for decades without loss of muscle mass. <br><br>The Last Push suggest what it may be like to be true vikings in a new ocean. Rather than being funded by governments, maybe it will take private industry to float away from Low Earth Orbit into the vast nothingness.<br><br>The film builds into a unique climax, perhaps one of the more refreshing peaks in sometime. What begins as a man trapped in a spacecraft in deep space, becomes a possible clarion call for a new perspective regarding space exploration.<br><br>This has more in common with Rocky than Moon. Man is defeated throughout this tale, but like Rocky he does not necessarily win in the end, but the viewer is left with an exciting promise. When I was young I would leave the theater after a Rocky film shadow boxing and wanting to fight a noble match, after The Last Push I want to travel into the nothingness above, not to victory, but because mankind must do this.<br><br>Apparently this was shot with almost 0 money in a garage. Wow!!","user":"ngwttintl","rank":[52,79]}]