[{"title":"Grossly Underrated","rating":9,"date":"14 June 2018","review":"Seriously, if everyone would just chill tfo about wanting to compare this version with the original version, you would find this movie is hilarious. First time in years I didn't want to punch Ed Helms in the face after watching him in a movie. The two actors who play the boys in the movie are great. But the gem and queen of this movie is Christina Applegate. <br><br>All in all, a really funny movie, a lot better than internet trolls have shown it. I just hope the 100 million worldwide gross will generate a remake of Xmas Vacation. <br><br>I will admit that Chris Hemsworth, Charlie Day, Kaitlyn Olson, Michael Pena, Nick Kroll, either Key or Peele, are great in their own small role way. However, this movie does not provide the Cousin Ed role made famous by Canadian truffle sniffer Randy Quaid.","user":"carlitobandito","rank":[19,22]},{"title":"Ridicoulous, stupid, offensive and dreadful..... would watch again!","rating":8,"date":"14 August 2015","review":"Despite the movie is a over the top comedy that is ridiculous and sometimes straight out offensive and disgusting, the movie makes you laugh. I haven't laughed like this for a good while, so it does however do its job as a comedy. if you are however looking for a calm comedy that takes itself a little bit serious..... stay away XD It contains offensive jokes, foul language (often from the small ones) over-dramatic scenes with plot twists, scrap that! there is plot twists everywhere, but the movie is for some reason able to keep you entertained as you try to pick up all the popcorn you dropped on the floor after laughing hysterically from a really bad line that just turns even more awkward as the other character replies back. A must watch mess for the ones that needs a good laugh, and bring a friend. It makes the movie 10 time better when a cheap but funny line comes up and both of you can relate XD","user":"jonathan-kj-2010","rank":[129,180]},{"title":"Everyone thinks this is a family movie?...IT'S NOT","rating":8,"date":"27 August 2015","review":"It's getting annoying seeing reviews giving this film a 1/10 because people have misinterpreted 'Vacation' for a family film and been disgusted by it. It's crude humour and outrageously funny if you like movies like Due Date and The Hangover and deserves more than a 1/10 (Mums who haven't bothered to check the rating).<br><br>The film its-self is also good and I think it's rating has been brought down by disgusted parents who's children have seen a little more than is desired. The acting is good enough, the jokes are tops and the situations get more and more extreme.<br><br>If you want a family movie take your kids to something else but if you like a rude comedy with plenty of laughs, this one's for you.","user":"tillydimech","rank":[40,57]}]