[{"title":"A mundane crime thriller that revolves around one ridiculous twist","rating":4,"date":"3 January 2011","review":"Oscar-winner Cuba Gooding, Jr. has had one of the strangest acting careers in a long time. Ever since he won at the Academy for his performance as Rod Tidwell in 'Jerry Maguire,' he has been caught in a sort of downward spiral. This has sent the once-promising actor deep into the realm of straight-to-video nonsense, like his previous films 'The Devil's Tomb' and 'The Way of War.' Why he's been doing this is a mystery. No talent agent is bad enough to actually think these scripts are worth while or think they're anything more than a guaranteed failure. Maybe it's bad luck, maybe it's laziness, maybe Cuba just doesn't want the spotlight he deserves.<br><br>Whatever the reason for his failing success, it has led him straight to 'Ticking Clock.' In it, he plays Lewis Hicks, a journalist who gets put on the trail of a sadistic serial killer after his own girlfriend is viciously murdered. With the killer's journal in hand, Lewis must race against time to rescue the murderer's next victims. As the path begins to weave its way around and to a young orphan boy, Lewis begins to discover a deeper mystery surrounding the murders.<br><br>In the crime-thriller subgenre, there are really only a few good ways to go about writing a story. One maintains consant mystery, concealing the identity of the killer until a final reveal that should be a shock to the audience. The other is to reveal the killer from the start and use his intentions and motivation as the mystery. With 'Ticking Clock,' however, both approaches are mostly thrown out, revealing the killer's identity, his motive, and everything else pretty much immediately. This is a problem because the mystery is what is usually keeps a viewer watching in a film like this. If you don't have it, the audience just won't care. Here, the writers knew what they wanted to accomplish with an interesting (though ridiculous) twist, but didn't give enough reason to stick with it in the first two acts. By the third act, the audience is fairly apathetic with the story &amp; characters and will most likely not even care about the twist, which the entire film revolves around.<br><br>This major flaw is not the only problem with the film. No, a more detrimental issue to its success comes from the extremely amateurish direction by Ernie Barbarash, a man very familiar with mediocre straight-to-video thrillers with his work on 'Cube Zero' and 'Stir of Echoes: The Homecoming.' If you look at a film like 'Se7en' (which, by the way, 'Ticking Clock' actually compares itself to on its DVD sleeve along with 'Silence of the Lambs'), you will see a perfect a example of how to craft a stunning &amp; dark crime thriller. With 'Se7en,' David Fincher used the gritty city setting as almost another character, having the actors play off the direction in a way that added a deep realism to the film. Barbarash, with 'Ticking Clock,' blows his opportunity to do this by squandering the Baton Rouge &amp; Las Vegas settings he had at his disposal, instead limiting the entire film to a few boring settings like living rooms &amp; back alleys. Add this to the rather annoying cinematography by Phil Parmet and 'Ticking Clock' is just all around unpleasant to watch.<br><br>Unfortunately, there isn't much else to cling onto to try to save the film from being a total disappointment. The script is boring &amp; contrived, providing nothing much that hasn't been done better many times before. The lack of mystery &amp; thrills for the first two acts gives no real drive to continue watching for anyone but completionists who don't like to leave a film unfinished. Even the ridiculous, supernatural twist isn't original, and ends up hurting the film anyway due to the number of plot holes it creates. For being so crucial to the film's success, one would think the filmmakers would be willing to do what they can to seal plot holes (like a simple case of incorrect eye colour, for example). Even the once-talented Cuba Gooding, Jr. has nothing much to offer thanks to how poorly his character was written. Let's face it, an actor can only do so much with what they're given. Take De Niro &amp; Pacino as examples in supremely disappointing 'Righteous Kill' from a couple years back. Add in some shoddy gore FX, CGI that looks like it should be in a mid-90s sci-fi flick, and a mundane cast of supporting actors, and you have nothing more than a sad excuse for a crime thriller here.<br><br>Overall, 'Ticking Clock' is just one of those films that will be stuck on the Blockbuster® shelvse for a few months trying to bait renters into biting onto the former star power of Cuba Gooding, Jr. Sadly, it will do nothing but disappoint with its unoriginal &amp; unthrilling story and amteurish filmmaking.<br><br>Final Verdict: 3.5/10. Hopefully Cuba will get another chance in the spotlight some day.<br><br>-AP3-","user":"Shattered_Wake","rank":[30,38]},{"title":"Could have, should have, would have","rating":3,"date":"16 February 2011","review":"I so wanted this to be an enjoyable movie with Cuba Gooding Jr.<br><br>Not the case.<br><br>Although occasionally believable, on a whole the acting was way beyond par. The storyline, although showing some potential, was far from well executed.<br><br>I'm sure this made for a good movie if you'd just skimmed through the script. And with a lot more effort, I'm sure this could have been an excellent movie. But as it stands, disappointing performances across the board. <br><br>Don't waste your time, this movie deserves it straight-to-DVD status.","user":"larsts","rank":[16,22]},{"title":"Disappointing","rating":11,"date":"11 January 2011","review":"Cuba Gooding Jr.'s previous movie, \"Wrong Turn At Tahoe\", was a surprisingly good movie, so my expectations were pretty high for \"Ticking Clock\". Sadly, Gooding takes a step back with this movie. I admit that I can't say that this is a BAD movie - while watching it, it kept me interested in seeing how it would be wrapped up - but it's not a successful movie. The movie doesn't look very good for one thing, sometimes looking somewhat cheap and photographed in a way that gives the movie a muddy look. Gooding's character comes across as a somewhat dumb and irresponsible character, and Gooding adds a touch of whine to a lot of the lines this character speaks. And the big twist in the movie will become pretty obvious to just about every viewer long before it dawns on Gooding's character. With this movie, it doesn't seem that any time soon that Gooding will work his way out of the straight-to-DVD sludge he's currently stuck in.","user":"Wizard-8","rank":[10,14]}]