[{"title":"Everyone hates poetry","rating":10,"date":"7 August 2016","review":"Great drama moves you. It excites you. Scares you. Makes you sing. Makes you cry.<br><br>The Big Short makes you shake your fist. The Big Short is driven as much by its Iago as it is its Othello, and deservedly so.<br><br>The events in the story did happen. Many people still don't care. The Big Short gives you reason to care. That is what separates this film from being merely a documentary and turns it into high drama. <br><br>No matter your politics - mark this, like Citizen Kane, as a movie that should be seen at least once. It is not always comfortable to watch. And that is a good thing - The Big Short is a documentary of a real life horror that unfolds in slow motion, and reminds us that even after the fact - no one is listening. Because truth is like poetry.","user":"bementar","rank":[149,153]},{"title":"I'm not smart enough to fully understand it.","rating":26,"date":"26 December 2018","review":"I appreciate that The Big Short tries to dumb down the housing crisis of 2008, but, apparently, I'm still not smart enough to fully understand it. A lot of this movie went over my head, but I grasped the generalities and it kept me entertained, so I applaud it for that. This film also featured some great performances by the cast, who lose themselves in their respective roles. This movie is a downer, but it's an educational downer.","user":"cricketbat","rank":[117,125]},{"title":"\"The Big Short\" is educational, relevant and entertaining.","rating":9,"date":"28 December 2015","review":"Nothing Small about \"The Big Short\"<br><br>\"The Big Short\" is based on the book with the same name by financial journalist Michael Lewis. It is about collateralized debt obligations, subprime mortgages, credit default swaps and bundling. A snoozer right? Not one bit. \"The Big Short\" is more entertaining than most films in the cineplex this holiday season. Even if you don't know much about the subprime mortgage crisis of 2007-08, you will recognize a quality film and want to know more about the world economic collapse when the film is over. <br><br>The film uses a multitude of techniques to tell the story. There are fourth-wall breaking monologues, a model in a bubble bath explaining economics as well as a singing idol and a celebrity chef using metaphors of cooking and gambling to explain the economic crisis. There are jump cuts, slow motion, foreshadowing and flash backs. The filmmakers use any and all tricks to explain a complicated mess of financial chicanery in order to help the audience understand. The banks, mortgage brokers, the credit ratings agencies and the government manipulated people in the nation and world into investing in worthless packages of bonds, and it behooves the director and writer, Adam McKay, to use all cinematic tricks to explain and untangle the financial corruption. The miracle is that the film deciphers the economic melt-down well while entertaining its audience. <br><br>The acting is stellar from the stars to the bit players. They aren't just playing a role, they embody characters during a remarkable time in history. My mother thinks Steve Carrell was the best actor in the film, for she did not even recognize him at first. He plays against character and she liked that. However, my mother had never seen Carrell in \"The Office.\" His character, Mark Baum, is much like the boss from that television series. However, in \"The Big Short\", he plays it straight. He is a boss of a fund under the umbrella of Morgan Stanley (but it's not Morgan Stanley, and his team likes to point out), and he is on a mission to bring down banks, to show them up, and to prove he's been right about the financial warning signs. He is betting against the hand that feeds him, Morgan Stanley.<br><br>I preferred Christian Bale's performance as Michael Burry, an unselfconscious, manic math genius. I haven't seen that frightening look in Bale's eyes since \"American Psycho\", but this time he's only killing the mortgage backed securities market. Meanwhile, Brad Pitt, under- playing another disaffected former banker, Brad Rickert, helps two friends make millions while they bet against terrible investments, or \"play short\" the mortgage market. His backstory is revealed steadily and in a way that makes us wonder why he briefly got back into the investment \"game.\" Even Ryan Gosling makes his mark in this star-studded cast playing the prescient \"Jared Vennett.\" Remember, all the characters in the film are based on real people. And that is what makes it so remarkable. <br><br>The other major players in the film are Bear Stearns, Morgan Stanley, and a slew of investment houses who at best ignore the coming financial crisis or at worst, colluded in its creation. From the realtors selling the mortgages, to the banks loaning at subprime, to the banks bundling the worthless packages, they were all making too much money to want to stop. This is exactly the kind of over-exuberance that occurred in the 1920s stock market crash, but few payed attention then or in 2007. <br><br>\"The Big Short\" is a dramatized film of true events. And to make sure we understand, the actors break the fourth wall several times to tell us what part is true to the detail and what part is fictionalized to make it more dramatic. But if you are still incredulous, read the book. The events are all sadly true, and we are still paying for it. <br><br>Rating: Pay full price (but you might want to see it twice.) <br><br>It will take at least two viewings to catch half of what is embedded in this film. This film is entertaining, educational and relevant. <br><br>Peace, Tex Shelters","user":"texshelters","rank":[337,377]}]