[{"title":"Good Acting By Jamie Lee Curtis","rating":8,"date":"31 October 2018","review":"Rating 8.3/10\nGood acting performance by Jamie Lee Curtis. Great horror movie &amp; great Squeal !!","user":"ymyuseda","rank":[205,316]},{"title":"Extremely, extremely overrated by overhyped fans. VERY disappointing.","rating":4,"date":"18 October 2018","review":"*Very minor spoilers*<br><br>I saw this at H40 last weekend. When I left the screening I couldn't help but feel as if there's been a lot of marketing and misdirection thrown out there about this film, because watching the trailers and then the film itself it becomes obvious that Halloween (2018) was heavily reworked and edited.<br><br>Aside from that, the script is laughably bad (wait until you meet one of the new doctors from Smith's Grove and Allyson's horribly written father, Toby), the character of The Shape has been reduced to a really dumb, careless random murderer behind a mask (goodbye stalking scenes), the pacing of the film feels entirely like an action movie and lacks the \"slow burn\" of the original, and some characters just disappear from the story and you never hear from them again. It is NOT at all the dark, brooding film suggested in trailer #2.<br><br>Only positives, for me: Andi Matichak is fantastic, as are many of the teen actors. The first 1/3 is actually very good. When Michael arrives in Haddonfield, however, the subpar writing and direction really begins to reveal itself.<br><br>Overall, it's so disappointingly bad. The positive reviews seem somewhat disingenuous, probably because of the #metoo subplot (which is nice, but doesn't in and of itself make a film \"good\") and less of a reflection of the actual quality of the movie overall. All of the TIFF viewers that raved about this should be ashamed, they clearly got caught up in being at the premiere and having the actors in their presence, so they overhyped the movie to the rest of us.<br><br>So, so disappointed. The original \"Halloween II,\" somehow, is the far superior film.","user":"jdamaso-50871","rank":[853,1]},{"title":"Shocking, shameless and horrific... AWESOME!!!","rating":8,"date":"7 January 2019","review":"Just when you think a cringe-worthy act of heroism is imminent.... think again.<br><br>Yes, I was expecting this to have numerous moments of cheese... How wrong I was.<br><br>As an avid fan of horror movies, I am totally aware of the shambolic efforts that have graced our screens in years past.\nI was expecting the worst. But...<br><br>I highly recommend watching this, tipsy, in the darkness and alone.... a that's how I did it. If you watch it with someone, make sure they shut the hell up!<br><br>How could anyone enjoy a film properly with someone waffling in the background?<br><br>EXCELLENT!","user":"thefenna","rank":[217,355]}]