[{"title":"A fascinating film--half brilliant, half awful.","rating":3,"date":"3 November 2011","review":"Far from the best or worst picture of the year, W.E. is certainly the most intriguing. It tells the story of Wallis Simpson (Andrea Riseborough) and the New York housewife who is obsessed with her in 1998 (played by Abbie Cornish). This is not a straightforward historical film, nor is it trying to be. Instead, the film is a mediation on celebrity, history and the way people search in those realms for meaning in their own lives. For example, Wally in 1998 is trapped in a loveless marriage where she is virtually ignored by everyone, so she imagines Wallis as utterly fabulous, and adored by the man who abdicated for her. \"What are you thinking about?\" she is asked at one point. She responds, \"What it must feel like to be loved that much\". Madonna hits that nail right on its head, and this premise is the reason she can't tell the story from a straight historical perspective--celebrities really only exist in our heads. Madonna likely knows this better than anyone. For this reason, Wally waves away her idols alleged Nazi sympathies and the possibility that she and Edward's marriage was not all that it seemed, because in New York in 1998, she needs to believe that love can be eternal. In this context, the much maligned scenes in which Wallis appears to Wally to give advice make perfect sense. All celebrities and historical figures really are figments of our imaginations anyway.<br><br>In the end, the theme is that people should not obsess over celebrities, but should \"get a life\" of their own. This brings us to the films one serious downfall. The audience is forced to spend more than half the movie with Wally, who is beyond boring and unsympathetic. This can be blamed on the script and the performance by Abbie Cornish, who never seems to do any more than pose and read lines. The character was never believable or engaging, and the script must resort to over the top melodrama to move her story along. In short, the 1998 storyline is a mess, and you'd think that a film whose premise is that celebrity-obsessed people need to get a life would have known better than to focus on an obsessed fan with no life.<br><br>That said, everything with Wallis is spot on, better even than anything found in \"The King's Speech\" (2010). Andrea Riseborough, who plays Wallis accomplishes in a single scene what Abbie Cornish couldn't in all of the movie. She makes us admire and care for the woman she's playing. She has a charisma (much like the director herself) that guarantees the indulgence of the audience. She is going to be naughty, and we're going to love her for it.<br><br>And thus you have the most interesting movie of the year: half masterpiece, half slog. If the 1931 storyline had been stretched out to 90 minutes, and the 1998 one reduced to 10 or 15, this would have been one of the best films of the year. As it is, it a tremendous curiosity.<br><br>I must mention, however, the best scene in the movie, featuring an elderly Wallis and a dying Edward. I shan't give it away except to say that it captures perfectly both the sweetness of enduring love and the sadness, and inevitability of age and death. Where I was laughing derisively at the previous scene, this one had me in tears before it was through. Like I said, a very interesting experience.<br><br>I have refrained from mentioning its superstar director, because most critics can't seem to see past their feelings about her as a person. Still, I can't help but note that Madonna is vastly better suited to depict the lifestyles of the rich and fabulous, than the dreary doldrums of us common-folk.","user":"Mer_Girl_Fits_Heaven","rank":[112,145]},{"title":"'Darling, they can't hurt you if you don't let them.'","rating":7,"date":"8 May 2012","review":"The much maligned, brief theatrical film by Madonna - W.E. - fairs better on the small screen than it likely did in the movie houses. The stories are bifurcated, each one resembling a television creation - one a docudrama biopic, the other a contemporary soap opera. That Madonna, who directed and wrote the screenplay with Alek Keshishian, decided to mix the two stories is a bit daring but in some ways it works very well. In other ways the parallel stories seem like time traveling cars on the same highway that never quite travel at the same speed or quality.<br><br>The film mixes the notorious affair between King Edward VIII and American divorcée Wallis Simpson with a contemporary romance between a married woman and a Russian security guard. The time is 1998 and at an auction of the estate of the Duke and Duchess of Windsor unhappily married ex-Sotheby employee Wally Winthrop (Abbie Cornish) becomes obsessed by their historic love story. Her own marriage to womanizing, abusive psychiatrist William (Richard Coyle) undermines her feelings of worth and as she learns more about the sacrifices involved in the famous affair, she gains her own courage to find happiness.<br><br>The film flips back and forth between the present and the 1930s and it is the historical aspect of the film that is almost flawless. We get to know Wallis Simpson (in a brilliant portrayal by Andrea Riseborough) and understand her failed first two marriages (at the time we meet her she is still married to Ernest Simpson played by David Harbour), and see the American sizzle that made her the talk of England. When Wallis wrangles her way to meet Prince Edward, better known as David, (James D'Arcy) there is a chemistry that develops to the point of passion and ultimately leads to Wallis divorcing Ernest to marry Edward - a deed that leads to Edward's abdication of the throne for 'the woman I love', which he had assumed when King George V (James Fox) dies, to his stammering brother Bertie (Laurence Fox) and his caustic wife Elizabeth (Natalie Dormer). The paparazzi make their life miserable and the couple is not allowed to return to England until Edward dies, with the faithful Wallis supportively by his side through 36 years of marriage.<br><br>Wally - meanwhile - longs to be pregnant but sustains such abuse from William that she ultimately yields to the loving friendship the auction house Russian security guard Evgeni (Oscar Isaac) and begins her life again. The two stories are connected by Wally's obsession with the royal couple's notorious affair and at auction's end she is given access to private letters between Wallis and Edward that have been in the possession of Mohamed Al-Fayed (Haluk Bilginer) - a tacked on ending that feels ill at ease and redundant.<br><br>Everyone connected t the biopic angle of this film is excellent and Madonna shows that she knows how to direct affairs of the heart in a royal situation very well indeed. Both Andrea Riseborough and James D'Arcy are superb and the costumes and music and cinematography of this historical portion are exceptionally well done. Though the idea of the contemporary sluggish story is reasonable, Abbie Cornish seems uncomfortable with the script: Oscar Isaac shines as her new love. In all the film, though spotty, has merit and it not a bad debut for Madonna as director. <br><br>Grady Harp","user":"gradyharp","rank":[33,40]},{"title":"Don't pass judgement on this one until you've seen it.","rating":8,"date":"18 February 2012","review":"\"W.E.\" had one hell of an uphill battle. Not only is it a period piece, but the film is also written and directed by the one woman in the world that makes people pass judgement before even experiencing her work. That woman is Madonna.<br><br>The film tells the tale of the infamously scandalous affair of King Edward VIII (aka David) and Wallis Simpson for whom, in the 1930s, he gave up everything for, even abdicating the throne of England. Being a twice-divorced American, Wallis Simpson was a woman the monarchy would never accept, and because of that, David left everything behind for love. The film concurrently takes us back to 1998 and Wally Winsthrop, a woman who was named after Ms. Simpson by her Wallis-obsessed mother and who also finds herself in a marriage that is not living up to the magic she expected it to be, a fact which is brought more to life by the flirtations of a Russian security guard she encounters at an auction of the Windsor Estate at Sotheby's.<br><br>I can honestly say that, despite being an enormous fan of most of Madonna's artistic endeavours, I was not sure how this film would play out. But you know what? It's a good film. First of all, it takes the perspective of Wallis Simpson in telling the first story, which goes against the norm. Secondly, the interweaving of the two completely different time periods is extremely well done, incredibly edited, and manages to keeps you invested in both stories equally. And most surprisingly, it was an entertaining history lesson: Not only do you learn of this hugely publicized affair but the film, in a way, is almost like a prequel to last year's powerhouse, \"The King's Speech,\" as that film focuses on Bertie, David's brother, who had to take over the throne once David renounced it.<br><br>The film is not perfect, but as Madonna's second attempt at directing, you have to give her credit. Something many critics just refuse to do. No, the script is far from genius, but it's far from awful. The film is visually beautiful to watch and the integration of regular filming and documentary-style graininess makes for an interesting watch. Then there is the exquisite costumes for which this film is nominated for an Academy Award...and has a good chance at winning. And the performances, all of which are good. Andrea Risborough (\"Made in Dagenham,\" \"Happy Go Lucky\") gives a strong turn, if not slightly off kilter at times, as Wallis Simpson. James D'Arcy is at times whimsical yet stoic as the terribly handsome King Edward. Abbie Cornish (\"Limitless\") is close to heartbreaking as the suffering Wally Winthrop and Richard Coyle (\"Prince of Persia\") gives a great performance as Wally's emotionally absent husband. And then there is Oscar Isaac, also in the Oscar-nominated \"Drive,\" as the incredibly handsome and sweet Russian who perks up each time Wally is around.<br><br>No, \"W.E.\" is not brilliant, but it's far better than you might expect, Madonna proving to be a far better director than anyone might give her credit for. And if you just love her for her music, the Golden-Globe winning \"Masterpiece\" plays along the closing credits. Although I have always preferred her musical endeavours over her cinematic attempts, this attempt is one she can definitely be proud of.","user":"DJRMewzique","rank":[59,76]}]