[{"title":"A Breath of fresh air for the Australian film industry","rating":8,"date":"6 May 2018","review":"It may take time to see how Breath is regarded in the list of all-time best Australian movies but regardless of how Simon Baker's debut feature as director ends up being regarded in due time, Breath is easily one of the most impressive local film's in year's and arguably one of the best film's yet made about the power and alluring nature of surfing.<br><br>Based on Tim Winton's novel of the same name, Breath centres around teenage mates Pikelet and Loonie (played impressively by newcomers Samson Coulter and Ben Spence) who in a small coastal town in Western Australia begin a love affair with the waves and a friendship with the older and married surf loving Sando that will shape the course of their lives.<br><br>Its a personable and relatable tale, one that is very close to Winton's heart as an avid surfer and a long time resident of Western Australia and Baker not only does a great job at mixing in teenage coming of age scenarios but perfectly captures the majestic and ominous beauty of the ocean.<br><br>Breath looks beautiful, captured thoughtfully by Baker and his DOP's Marden Dean and Rick Rifici, its one of the more visually captivating local film's to come our way in sometime and therefore justifys an added reason to capture this adaptation on the big screen outside of its nicely crafted character drama.<br><br>With Pikelet and Loonie we have two teenage boys we've likely all come across before in our time, Pikelet the quiet and introverted type and Loonie the more carefree and rashly thinking troublemaker and as these two unlikely commrades attach themsleves to the lives of the somewhat sad Sando and his troubled wife Eva (played by Elizabeth Debicki), Breath creates a real and lived in world where things are set in course for the shaping of these characters lives.<br><br>Final Say -<br><br>Breath is a methodically paced and baggage free coming of age drama that is anchored by a respect and capturing of Australia's relationship with the sea.<br><br>An experience long removed from the world of The Mentalist, Simon Baker has here marked himself down as a director of note with what will be one of the year's best Australian films.<br><br>4 lamb chops out of 5","user":"eddie_baggins","rank":[36,40]},{"title":"a beautiful looking coming of age film full of banalities","rating":6,"date":"17 May 2018","review":"Award-winning novels do not always lead to award-winning films. As we know, the novel's unbounded imaginative space reigns free while the movie is constrained within sight and sound. The coming-of-age film Breath (2017)is beautiful to look at, but its clichéd characters and banal dialogue make it a rather ordinary translation of Tim Winton's widely acclaimed book.<br><br>The story is framed as a middle-age nostalgic flashback to growing up in a logging village on the spectacular West Australian coastline. We follow through the eyes of a young teenager called Pikelet (Samson Coulter) who, with his aptly-named best friend Loonie (Ben Spence), are inducted into the surfing culture of the 1970s. Their dreams of conquering big waves are made real when they are befriended by a 40-something former top surfer and off-the-grid hippy called Sando (Simon Baker). He becomes their mentor, inspiring them with zen-like dogma about the mastery of one's inner fears and the purism of doing something as pointlessly elegant as riding a dangerously large wave. Meanwhile, Sando's surly girlfriend Eva (Elizabeth Debicki) limps around in the background with a chronic injury from top-tier competitive skiing. She is cool towards the teenagers until Sando and Loonie take off to Indonesia to chase even bigger waves, leaving young Pikelet to herself.<br><br>Sexual initiation is not always recalled through misty lens. Eva has dangerously weird taste in bed and no qualms about the boy's lack of maturity. While the camera spends a lot of time watching them together it is never close enough to earn an 18+ rating. Pikelet finds himself between two worlds: innocent school friends on one hand, and a worldly woman who uses him as a toy on the other. It is not so different to the space between mastering a wave for fun and chasing one to prove you are not scared.<br><br>The enduring high point of Breath is its cinematography. Lush rainforests, ruggedly rocky coastlines, and white-crested rollers are captured with almost lyrical beauty. The cameras spend a lot of time on top of and under the water, and some of the wave shots can make you gasp. However,the characters are one-dimensional, the dialogue often inauthentically mystical, and there is not a trace of narrative tension. Eva remains a shadowy person and her past sporting career is barely mentioned. Women's achievements don't count for much in a man's world, but the film labours at length but simplistically over what it takes to be a man. A particularly insipid example is early in the film the two teenagers get around on under-sized kid's BMX bicycles, but the day after Pikelet's sexual initiation he suddenly appears on a full-size bike. Really; is that all it takes?<br><br>If Breathhas serious messages about growing up with worthwhile values, they only hang in limbo, unformed and unexplored. No doubt there will be different responses from those who read the book, those who fondly remember the 1970s, and those for whom sex and surfing is still a pathway to adulthood. If it achieves anything, it highlights how much more complex growing up is today.","user":"CineMuseFilms","rank":[19,21]},{"title":"Subtly brilliant.","rating":10,"date":"7 May 2018","review":"I read each new Tim Winton book as they come out. He's one of Australia's best writers and his work is certainly the most authentic Australiana.\nSo, even though I've admired Simon Baker's work for many years, I worried that the film would be hard-pressed to match the quality of the written story.\nThe anxiety was wasted; Breath the movie is a superb rendering of the book, managing to capture the moods, emotions, fears love and the allure of surfing in an understated and intimate way, even while omitting sections of the book, which was a complex 215 pages, and redirecting the thrust of the novel.\nAt almost two hours, it's paced in a tempo that matches the period, the people and the lifestyle and flows past like the beautiful waves at Barney's.\nThe young actors are brilliant but congratulations to all concerned because so is the film.","user":"waldoc-46531","rank":[22,26]}]