[{"title":"Corporate Malfeasance and Public Health Issues","rating":8,"date":"5 January 2012","review":"PUNCTURE is an apt title for this movie, a true story that pokes a hole in the corporate and governmental greed that endangers public health, and a story about the lawyer who despite poking holes in his veins as a drug addict brought to the attention of the public a safety problem of overwhelming significance. It is tautly written by Paul Danziger (a character in the story), Ela Their and Chris Lopata and directed by Adam and Mark Kassen. It is an important film for public viewing and knowledge and awareness.<br><br>Opening this true story with a young nurse mother Vicky Rogers (Vinessa Shaw) departing for work at the hospital we witness her accidental stabbing herself with a needle while trying to calm a boisterous patient. Fast forward a few years later and we meet two law partners - Mike Weiss (Chris Evans, brilliant in a demanding role and boasting one of the most impressive physiques in cinema!) and Paul Danziger (Mark Kassen) - both seemingly committed to idealistic cases but bogged down in the routine accident settlement cases to make a living. Enter Vicky Rogers, now with full blown AIDS she contracted form the needle puncture we observed and asking Mike and Paul to take on a case of making the hospitals across the country aware of a retractable safety needle invented by engineer Jeffrey Matthew Dancort (Marshall Bell), who owns the Safety Point Company, but is unable to sell his product to any hospital from the United Medical group, apart from San Antonio Memorial. Mike and Paul are committed to Vicky and the cause and take the case on, only to be blindsided by hospital purchasing agents who want to save the hospital money and not buy the slightly more expensive safety needle. As the young men take on the horrors of the case they encounter the powerhouse lawyer Nathaniel Price (Brett Cullen) who represents the stonewall of United Medical. The money in the office of the young lawyers runs out and Paul wants to pass the case on to another law group, but Mike wants to keep the case, gathers mountains of evidence to prove that hospitals and supply companies are preventing the distribution and sales of the safety needle. He even gains the support of Senator O'Reilly (Kate Burton) until she withdraws her support as United Medical makes a huge contribution to her campaign!<br><br>Complicating the tense story is the fact that Mike is addicted to cocaine, pain pills and heroin and his addiction is constantly resulting in his being late and missing deadlines. At the point where Mike decides to give in despite his idealistic motives to win the case the story ends with a staggering reality. The results of the story are given on the screen before the credits role. <br><br>This is a very strong story, well directed an written, and in many ways due to the bravura performance of Chris Evans drives home some realities we all need to acknowledge: money and greed speak louder than patient and hospital staff safety. Food for thought. <br><br>Grady Harp","user":"gradyharp","rank":[29,31]},{"title":"A great movie","rating":8,"date":"3 December 2011","review":"I thoroughly enjoyed the movie but the reviews seem to go from one extreme to the other, i belong the ones that really liked the movie. It's a great story (based on a true one) and the acting is top notch and seriously it is well worth watching, despite the bone crushing judgement of some reviewers' (i bet some of them work for the \"evil\" greedy companies that this story is about :P jokes aside, i'm shocked how appalling the movie's success is compared to how interesting the film is. Just see it for yourself, don't expect too much, then decide. If you're not a cynical a-hole, I reckon you'll enjoy the movie like i did.","user":"ripe_51","rank":[34,37]},{"title":"Gripping movie..commendable performances","rating":7,"date":"16 June 2012","review":"Movies based on true stories can sometimes be dull and dragging, unless they are well-directed and this one is more than well-made.. the first hour which goes into building of the story is slightly slow-paced.<br><br>But as the story unfolds, we come face to face the complicated deceit at mega-corporate levels - This movie shows how some of the large health service manufacturers stonewall any change affecting their profits - even if a million lives could be saved, dangerous diseases like AIDS and Hepatitis C could be reduced.. financial power, legal manipulation and finally criminal intentions..<br><br>Performance of Chris Evans both as a young righteous lawyer and also as a drug addict is authentic..and Brett Cullen as the suave high-profile lawyer is effective..<br><br>The movie at some level moves in the lines of \"Erin Brokovich\" another very good true-story-movie dealing the corporates, legal profession, health hazards and the strength of purpose","user":"unomeyetudont","rank":[14,15]}]