[{"title":"Contraband is Paint by Numbers","rating":6,"date":"13 January 2012","review":"Contraband is a paint by numbers action/thriller. It would be easy to pick on everything that this movie wasn't, but can you blame chicken nuggets for being chicken nuggets? With a rookie screenwriter at the helm, the script suffers from a mash-up of cliché's. They start with \"One last heist\" and end with \"If you want to save your family you'll do as you're told\". There were many déjà-vu moments of been there and done that.<br><br>The star power was strong, but given so very little to work with in the way of character back story. All the characters were two dimensional representations of stereotypes. The locations (New Orleans &amp; Panama) were interesting choices but never really quite fit. While the movie wasn't action packed, it moved at a good pace and kept my interest the whole time. The film work was solid as a whole. There was one particular action sequence that takes place around the halfway mark that was done very well.<br><br>If you have a craving that only chicken nuggets will satisfy, then I think you will come away fairly happy. Not a necessity to see on the big screen, but that helps it a little. Leave your thinking cap outside, that's the contraband that will keep you from enjoying this as it was intended.","user":"toddatthemovies","rank":[93,125]},{"title":"Good Wahlberg action movie. Strong storytelling after the cliché start.","rating":8,"date":"11 January 2012","review":"Contraband starts like \"Gone in 60 Seconds\", but instead of boosting cars it's about smuggling contraband, and like GI6S it's because of an idiot younger brothers and familial responsibilities that brings an ex-criminal/smuggler out of retirement for that one last job. Chris our smuggler protagonist is deemed the Houdini of smuggling but in reality, he's a general super bad-ass who can talk fast, kick ass and smuggle at superhero levels. We are then treated to the Mark Wahlberg show where it's hard to imagine anything adverse happening to him and we just go along with the ride.<br><br>The movie is at its best after it sheds its GI6S intro and moves to the nitty gritty details of smuggling. The movie feels at home at sea where everything is calculated and ordered, but while on land, the movie is always bizarre, violent and out of control. This lends for some really angular storytelling that keeps the movie exciting and interesting.<br><br>It's great to see Kate Beckinsdale in the movies again though she plays the wife whose main role is to look great and be in distress, a far cry from her iconic Underworld Selene or from her last movie Whiteout.<br><br>On the whole it's a good action movie and if you liked Mark Wahlberg's previous movies like the Italian Job and Shooter, you will also like this.","user":"MosHr","rank":[90,137]},{"title":"Contraband- 5 category review","rating":13,"date":"13 January 2012","review":"Directing 6/10- Some unique and intriguing shots, but nothing too rememberable Acting 8.5/10- The acting is the category that without a doubt, stole the show. Solid efforts from the entire cast but the film really benefited from tremendous performances from Ribisi and Landry Jones. Screenplay 4/10- The screenplay is fun no doubt and benefits from decent pacing and a few intense action sequences but the film lacks originality, stealing concepts and at times, lines. Visual effects 5/10- The visual effects were average. I can't completely fault a film for not using unnecessary visuals. Sound effects/Music 5/10- The sound effects were fine, nothing misplaced there. The music was again just OK, sometimes the music was great and mixed well with the action going on but in some the haunting/emotional scenes the music didn't make the scene 'better', which is what it should do. Overall, the film is just another forgettable action film. The film has decent enough story (though cliché), with great acting and some fun action sequences that make the film at least worth a viewing.","user":"nathan-276","rank":[52,82]}]