[{"title":"compelling doc will shock you in the end","rating":8,"date":"1 September 2013","review":"National Geographic photographer James Balog wanted to test his skepticism about climate change. With his Extreme Ice Survey, he was able to photograph undeniable changes in some glaciers. In this documentary, Balog deploys a series of time-lapse cameras to capture a long term visual record of the world's changing glaciers. The lengths to which this is accomplished is mind boggling.<br><br>It's a compelling watch and an important work. But it's the shocking final result that will amaze you. The visual of these glaciers actually melting right before your eyes will shake you to your core as it did to me.","user":"SnoopyStyle","rank":[15,16]},{"title":"Disturbingly beautiful footage of the effect of climate change on several of the world's largest glacier fields.","rating":8,"date":"15 February 2012","review":"James Balog and Jeff Orlowski team up in what turned out to be a fantastic effort in documenting vast amounts of photographic evidence of the effects of recent global temperature increases on glaciers in Alaska, Canada, and Greenland.<br><br>The footage is magnificent and the film is scored very well. James Balog's personal challenges in undertaking the project are also documented, and present an interesting angle to this style of documentary.<br><br>By presenting the footage in as non-partisan manner as possible, Chasing Ice avoids tarnishing its message with politics.","user":"emt409","rank":[34,41]},{"title":"A visceral experience","rating":8,"date":"1 December 2012","review":"Obviously it's preaching to the converted here in Berkeley, but this movie is to global-warming deniers what sunlight is to vampires. You can't sit there and see these glaciers melting before your eyes and not be shaken. I had no idea it was happening so fast.<br><br>Regarding movie production values, it's a DOCUMENTARY folks, and a pretty darn good one - no one in my group was bored at any time. Really good story about this guy's obsession to document it, and awesome (in its original sense) nature photography, with some cataclysmic moments. We could hear some booms and crashes from the big-budget extravaganza Cloud Atlas playing in the theater next door, but I think this movie was just as cool, and it's all real.<br><br>@ JustCuriosity: Yes, it is an emotional appeal, and that's the point. Most people who are in denial don't have a clue of the scale of the problem and don't care, or they care in a shallow way about \"the environment\", but that's seen as some abstract thing out there somewhere, not related to their daily lives.<br><br>@Tracy Allard: Yes, the science and models are solid; climate scientists have been saying that for years, and they've been trying to get across to the rest of the world how serious the problem is. Meanwhile, the right-wing idiocracy has been shouting them down for crying wolf and even accusing them of fraud. This footage is undeniable evidence of the reality of global warming, and it's vital that as many of the public see it as possible.<br><br>I'm trained as a scientist and I'm painfully aware that 90% of Americans could care less about models - any mention of math or anything they don't understand instantly causes their eyes to glaze over. In fact, a growing proportion of Americans think that science is just a bunch of hooey made up by eggheads to pull something over on the rest of society. As Balog notes, half of us still don't believe in evolution. Please read Charles Pierce's Idiot America for more on the scope and magnitude of that problem.<br><br>A whole generation of us has been raised to believe that any nonsense can be true if only it's repeated in the media loudly and often enough. The only way that people are going to update their perception of reality is if they are forcibly shaken awake by events such as a hurricane in Manhattan - or perhaps sitting comfortably in a theater watching a piece of a glacier the size of Manhattan suddenly fall off.","user":"dluber1","rank":[33,40]}]