[{"title":"BEWARE","rating":1,"date":"5 April 2018","review":"ANY title with Tammi Sutton in it (this time as director) needs to be scrutinized for fake reviews. The last 'fare' this person was involved in was \"Whispers\", and it is the most ridiculous and vast example of skewed/fake reviews to have ever happened on IMDb or RedBox. On a good note, since the direction on both films is trash, Ms. Sutton can always acquire a job fluffing ... reviews for others too.","user":"KHALEESl","rank":[11,12]},{"title":"Confused","rating":2,"date":"26 April 2015","review":"What??? I watched this film for 20mins, turned it of because it was so bad. Felt guilty, because maybe I hadn't given it a fair chance, another 20mins was given. My God, am I demented, or was this movie a film school project that they forgot to write a script for. The acting wasn't terrible, but why watch an improv class. For the final stage of the film, I just watched with dismay, waiting for a clown to pop up shouting \"Gotcha\", now that would have been funny. Sadly this didn't happen, however, some of the effects did make me snigger, especially the hand chopping incident. If this film had been any worse it would probably become a cult classic! Unfortunately this was not the case.","user":"ozwillb","rank":[12,14]},{"title":"Isle of Barbara N.","rating":2,"date":"7 November 2010","review":"The guy who spat on your grave (not literally, just in the Remake), Mr Andrew Howard, might just be the best thing in here. Well best \"living\" thing that is. And he (almost) gets away with it. The other two main players/actors unfortunately are not up to the task. This movie could have been so much more (and I cannot stop thinking, that a great title was thrown away on this movie too).<br><br>But then again, there are a few people who read a few things into this (which I clearly didn't catch) and enjoyed it. So please make sure to read the positive feedback too, before you decide whether to watch the movie or not. Just let me point out, that I did see quite a few things coming and wasn't as surprised as another reviewer. The script is not as clever as it thinks it is and Barbara N. (though I do love her) is not game/up to the task. And considering the major role she is playing, this is a big letdown (for my crush and for the movie).","user":"kosmasp","rank":[26,36]}]