[{"title":"Stir the Pot and it will Boil","rating":8,"date":"28 March 2010","review":"Joe Wilson, a resident of Washington, DC, where same-sex marriage is legal, weds his partner. Perhaps in a conscious desire to stir the pot in his hometown, Oil City, Pennsylvania, he sends a wedding notice to the local newspaper. Predictable hate-filled letters to the editor that quote scripture and promise fire-and-brimstone are received and published. After reading them, Wilson and his partner go to Oil City and talk with residents about bigotry and intolerance towards minorities in general and gays in particular. The resulting documentary is short, engrossing, and offers some surprises for those prejudiced towards small town residents.<br><br>Stereotypes wither throughout the documentary. An Evangelical minister and his wife listen and understand, although they never reach complete acceptance. The frustrated mother of a bullied gay teen surmounts natural reticence and speaks out in public forums for change. The harassed teen, CJ, is no stereotype either; interested in cars and sports, he could have remained in the closet, but for his courage and determination not to live a lie. A civic-minded lesbian couple renovates a downtown theater and hope for mainstream acceptance and success. The DVD extras hold further valuable interviews; in one, a woman associates gays with bestiality and incest, but after a civil conversation with Wilson, softens her position. Only one militant \"family values\" woman remains intransigent throughout and prefers to hate rather than understand.<br><br>\"Out in the Silence\" is an earnest work. The low-key film-making is not dazzling or kinetic; however, the subject is important and the results of Wilson's investigative journalism worthy of study; do not miss the DVD extras, many of which would have enhanced the film. Wilson's message is not new, but worth remembering. Live your life openly; prejudice against strangers is easy, bigotry towards friends is difficult.","user":"dglink","rank":[25,27]},{"title":"Interesting; both predictable and surprising.","rating":22,"date":"22 October 2010","review":"This is an interesting if mostly predictable movie. The drama of a gay kid in a redneck high school is the predictable part, although the kid in this case is unusually appealing. That is partly because he has an almost Brando-like look and quiet, macho strength about him, but mainly because he seems so perfectly NORMAL. He has a gentle manner, but there is nothing about him that would flag him as gay. So his decision to come out was perhaps especially brave because he is not the sort everybody would already know is gay. That is how he comes across in the movie, anyway: just a normal teenage kid whose main interests seem to be sports and hot rods, not fashion and Madonna.<br><br>But there is nothing new in his story: gay kid gets abused at school; teachers and school board turn a blind eye and a deaf ear, refusing even to address the issue; Mom is loving and supportive but lacks the confidence and resources to fight the system alone - until the ACLU gets involved.... You know the rest.<br><br>But what is extraordinary in this movie is a local pastor named Mark Micklos. He is one of the people who wrote to the hometown paper objecting to the Joe Wilson/Dean Hamer wedding announcement that was the catalyst for the whole movie. Wilson begins by interviewing him and his wife, and as he is with most of his interviewees, Wilson starts out pretty defensive. But although they disagree about gay marriage, Micklos refuses to spar with Wilson about the issue. Instead, he insists on keeping a dialog open and on trying to show Wilson the love of Jesus instead of arguing with or attacking him.<br><br>What is amazing and deeply gratifying is that it works. Almost against his will, Wilson begins to trust him. They never agree, but they become real friends. By the end of the movie, the greatest change is in Joe Wilson himself. He is less defensive and more tolerant of those who are intolerant of him. If all Christians were like Mark Micklos, the world would be a much better place.","user":"jm10701","rank":[9,12]},{"title":"Yes, both predictable and surprising","rating":22,"date":"22 January 2011","review":"as the other viewer says. What the other viewers say pretty much covers the film, I only want to draw attention to two things.<br><br>First, it is said that the harassment issue is not new, and it is not, yet it sounds as a nothing-new-under-the-sun drawback for the documentary; the fact that the boy's case is exemplary in his not being at all effeminate - exemplary, that is in vivifying the way we should think again what we see.<br><br>What I mean is this: take whatever film you will with man to man love, and tell me no matter how male the male element acts, to put it that way, homosexuality is usually depicted as a right to be admonished or not. But what CJ's case exemplifies is that all the babbling against homosexuality as sin boils down to reproduction: if you publicly act like like a, well, truly male male, who, literally, cares what you do between the sheets? What is missing from the covering of the facts is why CJ came out in the first place. Was it the usual \"what bitch do you f**k\" harassment, or like things one listens at high school? For the sake of privacy we won't know, but we can ponder upon it, that is what truly are the reasons of spelling out \"who we are,\" that is our sexual identity.<br><br>That contrasts well with the female couple, that is their sexual identity as debate is irrelevant in terms of renovating a culturally important location, since that is what they do, significantly, for most of the film. Who we are is also what we offer to the community.<br><br>But of course this is something you know. Some pray for it, some pray against it.<br><br>I liked the nerve CJ brought to the film, I liked, well kind of, the chill that whatshername zealous woman allowed us to witness in the workings of gooood Christians, but the documentary relied a bit too much on them, I'd like to see some nerve from the makers, that is some accent on the emerging friendship between the pastor and the director as a true redeeming factor. That would sustain the tension and the care between leaving your hometown and staying there, as the director himself says towards the end.","user":"sandover","rank":[6,10]}]