[{"title":"I enjoyed this movie","rating":6,"date":"23 February 2020","review":"This sequel may have a few flaws like most sequels, but G.I. Joe: Retaliation is much more charismatic and an improvement upon its predecessor.","user":"MR_Heraclius","rank":[38,39]},{"title":"Plenty of great visuals and action but not much story.","rating":7,"date":"9 September 2013","review":"This second G.I JOE film doesn't have much in terms of a well thought out plot but it does have some great visuals and is packed with loads of well staged action sequences so action movie buffs should have a blast. For those also seeking more of a character story it's still best to look somewhere else.<br><br>The acting is however surprisingly good given the film's plot. Dwayne Johnson and Channing Tatum both bring a certain likability to their characters and I enjoyed watching them the most and of course Adrianne Palicki who was very friendly on the eyes.<br><br>Overall, The film might not have much of a plot but the great visuals and the well made action sequences keep it from becoming a total bore. Those who want more of a character driven plot might not think very much of it.","user":"jhpstrydom","rank":[27,33]},{"title":"Disappointing.","rating":3,"date":"29 March 2013","review":"It sucks that they had to put up a poster of this movie with Duke (Channing Tatum) and Joe (Bruce Willis) so grossly misleading when Duke showed up about what 10 mins or so then dies and Joe shows up when half of the movie is already finished, and not getting much burn at that (I should have known, how many of Willis's recent movies has been like this already). For an average movie goer like me (i'd like to think of myself like that) that doesn't normally go researching(goggling stuff) before watching a movie, I was sucked up by the poster itself expecting a whole lot of Duke and Joe in action. In my opinion, The Rock is not a bad actor himself but sadly he is not able to carry the movie by himself. I believe the movie producers/marketers or whoever is responsible for creating that misleading poster cheated people for their money. To be honest I am not sure I would be going to watch the movie in theater had I known I would be only getting this much, It's one of the movies I could have waited to be available on HBO\\TV or on DVD. I did like the special effects though, especially the mountain action scenes.","user":"zmlatoza","rank":[107,148]}]