[{"title":"A very surprisingly good suspense movie that deserves to be watched. Very neat idea that is both exciting and tense. I say A-","rating":20,"date":"20 September 2011","review":"\"People come together for a reason Mary, doesn't matter how.\" After starting divorce proceedings against her husband Mary (Leferve) starts a new life in a new apartment. After a series of phone calls from a woman they begin to talk about their situations. When the woman acts on an off-handed remark by Mary she begins to rethink the friendship. When people she knows start to disappear she doesn't know how to make it stop. 90% of the way you feel about a movie, I think, has to do with your expectations going in. Movies like \"Bridesmaids\" with all the hype can really let you down after it's talked up as much as it was. This one is the total opposite. Never hearing of this the trailer seemed interesting so I watched it. I was blown away. A very neat (although not original) idea. Think a suspense version of the \"Lake House\". I don't want to give anymore away so I will end this, but this is a surprisingly good must see. I really liked this movie. Overall, a very tense and exciting suspense that deserves more of an audience that I'm sure it will get. Watch this! I give it an A-.<br><br>Would I watch again? - I think I might *Also try - Forget Me Not &amp; Lake House","user":"cosmo_tiger","rank":[41,51]},{"title":"Excellent chiller, subtle and very scary.","rating":5,"date":"5 September 2011","review":"After having seen thousands of films, most of them horror, one tends to get a little jaded. Especially with the turn the genre took to torture porn ( with saw on the very end of the positive side of the spectrum and films like hostel on the very negative part) i got a bit tired of the whole circus.<br><br>And then, just when you officially are ready to give up and kill the odd hours with rubber sharks or other pests brought to you by SciFi a movie like the caller comes along.<br><br>I never gave a 10 rating to any film,but this one does it right, to tell anything about the plot and developments within is a crime. This movie has to be seen and experienced. The basic plot rundown is giving away in other reviews so I wont comment on that. Enough to say this is one scary flick, its smartly written..chills and thrills.<br><br>Go see it now, if you need a fix of spine tingling instead of blood pouring out of your TV set and body parts flying around.<br><br>See it, now!","user":"hopla68","rank":[59,82]},{"title":"Spoiler! There are two themes in this movie!","rating":10,"date":"22 November 2011","review":"For all the negative reviews I've read from reviewers on this movie, I am very inclined to clarify one thing: There are two premises here. These you will see as the plot develops. The first premise is a quantum time loop. The movie begins with this premise. The second premise is psychological. This premise is most clearly seen at the end - and when you look at the plot in retrospect, it's entirely clear that a time loop may never have existed! As the time loop changes, Mary's history is too. As Rose changes the past, it becomes Mary's real present. By the end of the movie she is in the apartment of the woman who abducted her and hurt her as a child! This leads up to the idea that perhaps there was never a time loop, that perhaps Mary's having a psychotic breakdown and imagining what looks like a time warp, and that maybe Mary returned to Rose's apartment (where she was abducted and held as a child) to kill and hide her abusive husband (who has stalked her all the way back to Puerto Rico) in the wall where Rose's victims lay undiscovered! A psychotic break that leads to an unconscious plan to lure and murder her husband! The change in the perception of reality = The change in quantum reality. The First is the psychological premise in the movie, and the second is its scientific premise. The reason why none of the many whys you keep bringing up are never answered is because as the past changed, so would everything that the whys would have explained - so explaining all the whys would have been pointless, seeing how it all would have changed anyway! To get this movie think: Beginning to End = time loop, and End to Beginning = psychosis. It's brilliant! 5 stars! Fantastic movie with fantastic twists and reversals! What seems impossible becomes entirely probable and then almost obvious!","user":"nisusdominus","rank":[33,44]}]