[{"title":"What a waste of starpower...","rating":3,"date":"30 October 2011","review":"It must have been a good deal of money to get these actors in this film. Not just because they are all famous and for the most part talented people, but because this script must have been as bad as the film. Al Pacino, Tatum, Liotta, Katie Holmes, and even Tracy Morgan (Who I felt did a good job in this small role, maybe establishing himself as a bit actor for serious films) all these people couldn't make this movie good. It was bad, just plain bad. <br><br>The plot was boring and really badly put together. The twists were just dull and unfounded. The \"mystery voice\" was pathetic, it was so obvious who was calling, I can't believe they tried to make it some mystery as to who it was. The end, was so disappointingly lame. There was little to no real action in it. Yeah there were a couple people killed but it wasn't any real action. No suspense was built throughout the film even at the points were a person was shot. <br><br>I cannot stress enough how bad this storyline was written. There was nothing good about it. The main character was supposed to care about these killings he committed when he was a child, but in reality he had nothing to worry about there was no evidence pointing to him having any part of it 15+ years later. If the story was brought out he could just deny his involvement and would be fine. That is a small example of how poorly written this was. A good cop thriller needs plausibility, that should go without saying. <br><br>I would not recommend this. I am strongly recommending against it actually. I am very disappointed. I seldom give anything less than five stars for any film that has some watchability, but with these actors, nothing of such bad quality should involve them. They definitely don't have to worry about making the rent so why would they sign on to such crap? Who knows. Anyway, all these other reviews, the ones that say this is anywhere near good stuff, don't know good movies. No one with sense could sit through this film and afterward say to oneself \"I'm glad I watched that.\". There is no payoff to watching this, unless you want to be angered and write a bad review about a movie. If that is the case this is your film!","user":"actiondallas","rank":[74,97]},{"title":"Pacino is the best part of this movie. Writing, idea, story and overall movie are very disappointing. I say C-","rating":4,"date":"25 January 2012","review":"\"You can hate me all you want, but your a free man.\" When rookie officer Jonathan White (Tatum) is assigned to the precinct where he grew up letters start showing up that mention two unsolved murders. When the letters remind White of his past he is stuck between trying to uncover who is sending them and covering up his involvement. I am a huge Pacino fan and that is the reason I wanted to watch this. The trailer looked OK but anything with him I will watch. He was great in this. That about it. The movie was very slow and had a 5 minute idea that they kept repeating over and over until you either struggle through or end up finishing just to see the ending. I will admit that the last ten minutes makes it worth watching, but getting to that part is a real struggle. Any scene without Pacino or Liotta lacks emotion and you have a hard time caring for White at all. Tracy Morgan is actually not bad in a dramatic performance but overall this is one of the biggest disappointments of the year. I give it a C-.","user":"cosmo_tiger","rank":[33,43]},{"title":"Pointless","rating":4,"date":"6 March 2012","review":"Written and directed by Dito Montiel and based on a novel of the same name, \"The Son of No One\" is a mystery thriller that should have never been made into a movie.<br><br>Set in 2002, Queens, the son of a former NYPD detective, Jonathan White (Channing Tatum) is a hardworking rookie cop, providing for his wife and daughter, when new evidence on a 1986 double homicide grabs the attention of Captain Marion Mathers (Ray Liotta). Complications arise when Jonathan is confronted by his father's former partner, Detective Stanford (Al Pacino), where evidence from a mysterious source trails back to Jonathan as a troubled child. Even as he struggles to come to terms with his past, Jonathan learns that there are forces working at shutting this cold case once and for all.<br><br>Evidently, writer/director Montiel tries to fit a lot of fine print into the screenplay. The problem, as I see it, is that this becomes all too obvious very early in the movie; Owing to which, the so called 'twist ending' results in a very half-baked offering that totally ruins any saving grace from the likes of Pacino and Liotta. Demons in the closet, or ghosts of the past, or whatever you call it, form the very gist of the story, where Montiel tries to prove that sometimes it is best not to dig up the past. That being the case, Montiel then goes on to contradict himself by also throwing in themes of redemption and absolution. This clash in philosophy fractures the film's main plot beyond repair and by the time the twist is revealed, it is way too late to salvage anything. Making a police drama within the crime genre is always interesting when the plot is about dirty cops, police cover-ups, and as we have seen many times before, a cop on the edge. To an extent, Montiel gets it right by including all this into the plot, yet somehow, his main failure is in bridging all this together.<br><br>For this reviewer, a film's story forms the bulk of its appeal. It's like a deck of cards really; if the foundation is shaky, the entire structure crumbles under its own weight. This is exactly what happens here. Ironically, Montiel directs the very movie he has written, so no points for guessing who gets the credit for this colossal failure. Pacing is another weak component as the entire film is a slow-burner. I have to agree that some films need slow pacing to build strong characterization, but again, it backfires with a lot of flashbacks on Jonathan, with hardly enough focus on Stanford and Mathers, who just happens to be vital characters in the plot. By the end, Stanford and Mathers are absurd and vague in their cause to maintain the integrity of the policing profession.<br><br>I have always commended Liotta for his antagonistic roles, especially after his memorable psychotic cop in \"Unlawful Entry\". Recently, Pacino has also played deranged cops in \"88 Minutes\" and \"Righteous Kill\". Together, Pacino and Liotta are decent at best for argument sake, however, as veteran actors, their screen time and limp characterization do not justify their star power. Waste of talent, if you asked me. On the other hand, Tatum has a meatier role here compared to his more recent films and appears to have done a decent job in the lead, considering the lackluster story. Even so, the film is just too bland and pointless to consider any effort by Tatum, Pacino and Liotta or even supporting roles from Tracy Morgan and Katie Holmes.<br><br>Avoid it like a plague.","user":"LloydBayer","rank":[28,37]}]