[{"title":"Brown Beauty","rating":8,"date":"23 January 2012","review":"Spielberg's film is his vision of Michael Morpurgo's beloved book, which must surely now be essential reading for all kids, if it wasn't before.<br><br>Superficially it's about a horse named Joey and a boy called Albert, who become inseparable through a series of unfortunate events – World War I being one of them. A closer look reveals a story of such overwhelming humanity that I was bowled over. Spielberg was the only director for this film because he knows what it means to be a child.<br><br>Whether or not it is apparent in the book, there's no doubt this is a war film, one that ranks with Spielberg's 'Saving Private Ryan' and 'Schindler's List'. Emily Watson's character utters a line about the refusal of being proud of killing, which is the line one might use to summarise the film's point. Because Spielberg is Jewish, this line is pregnant with meaning. It's his noble way of saying that, despite the suffering received by his kin, he is willing to forgive their oppressors.<br><br>There's a scene where Joey is trapped by barbed-wire in no man's land and is freed by the combined effort of an Englishman and a German, who put aside their differences under the name of human decency. The scene is breathtaking, and it's the sort which no-one does better than Spielberg.<br><br>Long-time collaborator John Williams provides a moving score, regardless of its resemblance to the one he composed for 'Saving Private Ryan'. Director of Photography Janusz Kaminski reminds us of the beauty of our rural regions by photographing the Devonshire countryside with reverence.<br><br>Jeremy Irvine, Peter Mullan, David Thewlis, Benedict Cumberbatch, Niels Arestrup and Tom Hiddleston form the principal cast and are wonderful. Nothing could have prepared me for how much I'd be moved. There's no reason why you won't be.<br><br>moseleyb13.com","user":"dharmendrasingh","rank":[99,150]},{"title":"Horses fought too.","rating":10,"date":"17 January 2012","review":"I was expecting this movie to be just another extravagant sentimental potboiler. Wow, was I surprised. This is a great movie. The title says the movie is about a horse, but it's really about a lot more than that. The horse plays a central role but the humans figure in the story too, in a big way. The cinematography is outstanding; it really conveys the bleak, gory nature of war. The movie alludes to the Battle of the Somme which is one of the costliest battles in history in terms of the sheer number of lives lost. At times the movie does lapse into sentimentality but in general the story proceeds at a fast pace (pun intended). The performances of the horses in this movie are impressive. They are stars in their own right. If the movie accomplishes nothing else, it shows that war is hard on animals too, and like the humans, they are victims too; there was never a horse that wanted to go to war. That any horses survived at all in the war is amazing. Anyway, this movie is well worth watching.","user":"PWNYCNY","rank":[65,97]},{"title":"With War Horse the usual bloodbath and gory murder scenes are ditched in favour of a genuine story that manages to provoke passion and deep emotion in the audience","rating":8,"date":"21 December 2011","review":"When it was announced that Steven Spielberg was directing a film adaptation of War Horse, fans across the UK were a little apprehensive.<br><br>After all, the stage play and book were massive hits, so the film would have a lot to live up to. Early reviews are now saying that this film will be in the running for major Academy Awards — a statement that seems accurate after watching the film.<br><br>Based on the book by Michael Morpurgo, War Horsedepicts the story of Albert Narracott, played by Jeremy Irvine, and his treasured horse Joey in Britain where World War I is about to begin. Joey is sold to the cavalry by Albert's alcoholic father and finds himself trapped in the devastating fields of war while Albert is trying to find him.<br><br>Spielberg finds a balance between heartfelt emotion, especially from seeing the war through Joey's eyes and the people he meets along the way, and the tragic problems the main characters face, for example the separation between Joey and Albert after we have watched them bond and connect in the first part of the film. It is those emotional contrasts that Spielberg translates onto the screen well, perhaps the best one being the contrast between the overall setting of the devastation and trauma of World War I and the love between the main character and his horse portrayed throughout the film.<br><br>Although some of the cast are newcomers to cinema, they put on a stellar performance. Jeremy Irvine perfectly portrays on screen the character's determination and devotion to find his horse. Practically unknown before this film, his performance in War Horse has now made him one to watch. The rest of the cast include Emily Watson, Peter Mullan, Tom Hiddleston, and Niels Arestrup.<br><br>War Horse is the perfect film to settle down with the family for Christmas. It is a touching, beautiful depiction of the relationship between a boy and his horse, and of life in the countryside during World War I. The usual bloodbath and gory murder scenes are ditched in favour of a genuine story that manages to provoke passion and deep emotion in the audience, and overall this fits into the beauty of the narrative.<br><br>Check more reviews from The Upcoming on http://www.theupcoming.co.uk/?cat=9","user":"info-130-288696","rank":[142,229]}]