[{"title":"A great procedural thriller on a global scale","rating":10,"date":"13 January 2020","review":"Sometimes I think people just simply watch movies wrong. Looking through some of the negative reviews of Steven Soderbergh's Contagion was one of those moments. It's a procedural movie that is meant to capture the wide-ranging reality of a massive disease outbreak in the modern era, not a three act drama with character arcs. It's simply a different type of movie than a lot of people are used to, so they don't know how to process it. Anyway...<br><br>One of the many things I love about this film is that it starts with Day 2, not Day 1. We don't see the actual origin of the outbreak until the very end of the film when it jumps back in time, so we spend the majority of the film trying to navigate the confusion that is the outbreak. We want to know the source, but we know as little as the WHO and CDC officials trying to track it. Alongside that tracking, though, is the human cost of the disease.<br><br>That's mostly handled through Matt Damon's character who watches his wife and stepson die as some of the very first victims of the disease, though he seems to be immune. I expected the film to follow a convention that Damon would be the key to the cure, but it simply never brings up the idea and he's just left to tend to his daughter as they navigate the breakdown of law and order.<br><br>The disease spreads quickly, though, and no one in the disease prevention industry can get a grasp on it. They first have trouble limiting it, all efforts of which prove to be futile. Then they have trouble replicating it in a lab setting, which only gets fixed with a non-government doctor ignores orders to destroy his samples and continues his work. They then have trouble figuring out how to actually attack it, until one of the chief scientists circumvents procedure and injects herself with the most promising vaccine they've developed up to that point. Then, the story's still not over, because while they do have the vaccine, they also have millions and millions of people who need it, and they can only make so much at a time, so a lottery gets developed to distribute it out by birthdate.<br><br>Another way the movie captures the messy reality of this situation is how it uses its characters in the press. There are two, a journalist for a San Francisco paper and a blogger. The journalist is completely uninterested in the first steps of the disease as they unfold because it's just not corroborated or big enough. The blogger, though, is an anti-vaccine advocate and jumps on the story to feed his own biases. The journalist is too slow, and the blogger ends up using his position as a perceived prophet to profit off of the hysteria by pushing a bunk cure.<br><br>The use of major movie stars in seemingly small roles is a very smart decision as well. One of its biggest stars, Gwyneth Paltrow, dies in the first twenty minutes. Another of the major stars dies within an hour. The movie uses star power intelligently, telling the audience that this disease can take out anyone. It increases the tension by helping to cloud the resolution.<br><br>It's a movie about this ever changing process to get an unseen threat that's debilitating the world order under control. It's not about characters going through big emotional changes with catharsis for them at the end of the film. It's a thriller on a global scale. What it sets out to do, it does extremely well. I think it's one of the most effective thrillers in decades.","user":"davidmvining","rank":[444,480]},{"title":"Scary!","rating":9,"date":"3 March 2020","review":"I knew this was an important movie when it came out. I had not seen anything like this before. Excellent writing, good direction, an invisible antagonist, and most importantly - a sense of realism.<br><br>Nine years later, as the Coronavirus disease is running rampant, my mind keeps going back to the horror depicted in this movie. I tried to hold back but my eyes welled up with tears. This should be a must-see movie for the younger generation since it captures the frightening reality of a pandemic and humankind's reaction to it like no movie has ever captured before.<br><br>At this moment, in 2020, I know many more will die from Coronavirus, and it is a scary thought. What makes it even more scary for me- my wife is a physician. She reminds me of Kate Winslet's character. She is out there fighting the infection and the fear that comes with it. Like her, she is tireless and compassionate. No movie or documentary can ever capture or portray fear that follows bravery like a dark shadow. Nevertheless, I applaud the audacity of the filmmakers for making such an important movie. As important as this movie is, I sincerely hope no one ever has to make a movie like this in future.","user":"hprashantarora","rank":[306,334]},{"title":"Most clinical and realistic dissection of real pandemic scenario","rating":9,"date":"27 June 2018","review":"This is a cerebral movie. Many complain about having too many characters, but these characters serve as illustration, the main character is the pandemic, that is explored in non sensationalistic but still interesting and compelling way. The most scary thing about the movie is its realism. Yes, this is what really would happen if there were a pandemic. Not everyone would die, there would be no flashy helicopter drama, but it would not be a pleasant experience either. This is a good movie but perhaps not for the seekers of cheap thrills.","user":"perica-43151","rank":[223,248]}]