[{"title":"A Powerfully Understated Piece Of Filmmaking","rating":2,"date":"2 July 2014","review":"For a film with such a haunting and depressing scenario, 'Beginners' is a surprisingly powerful and perceptive piece of cinema. When I first read the synopsis, I was a bit doubtful about the concept and was uncertain as to whether it was worth a watch, however after learning that the film was partially autobiographical and based on the life of writer-director Mike Mills, I decided to give it a try, convinced by the inspiration of Mills' first-person experiences. 'Beginners' blends comedy and romance against a dramatic backdrop in order to create a charming and character-driven story. In my opinion, it is Christopher Plummer's Oscar-winning performance that really sells the picture accompanied by some assuring performances from Ewan McGregor and Mélanie Laurent. 'Beginners' is a powerfully understated piece of independent filmmaking that maintains it's emotional resonance from start to finish.","user":"CalRhys","rank":[54,60]},{"title":"A Beautiful Film","rating":10,"date":"13 September 2010","review":"I was able to see the world premiere of Beginners at the Toronto International Film Festival this weekend, and it completely took me by surprise. It was a bit of a last minute pick, and it has been my favourite film so far, and probably one of my favourite films in general. To be simple, I will just say that this film is about life and the emotions and experiences that we all go through within it. Christopher Plummer plays a 75 year old man who after the death of his wife is finally able to explore his homosexuality, and we see him come to life through this experience. It is not only about him, but mainly about his son played by Ewan McGregor, whose relationships with both his mother and father shape him as a person. These relationships and his own romantic relationships make up the core of his character, and it is through love, loss and discovery that the three main characters display an authentic view of humanity. It is an original film, and requires a certain audience, but I recommend that everyone should see this true gem.","user":"adri_wholivesathome","rank":[158,199]},{"title":"A deeply original and profound piece.","rating":10,"date":"17 October 2011","review":"Mike Mills' 2005 debut Thumbsucker is a film whose quirky charm was completely lost on me, but where that film was drenched in artificiality, he somehow turned that charm into something grounded and serene with his sophomore feature Beginners. This is a movie that honestly transcends words, for me. The kind of impact it had on me will never be able to be described, but it's one that touched me at my soul and deeply moved me in a profound way. The film is built around this message from Mills' personal life that you have the capacity to assess your situation at any point in life and make a change for the better. However, in the most un-Hollywood sense, Mills never beats you over the head with the message or panders to it's audience; it just exists in it's own world and you can embrace it or not, but the film doesn't exist solely for that reason. It may not particularly exist for any reason, it just exists and for me, that was all it needed to do to hit me right in the heart.<br><br>In taking on a subject matter as emotionally strong as this (a father coming out of the closet at a late age and then being diagnosed with terminal cancer), Mills was open to a plethora of moments for overbearing melodrama to bring the audience to tears, but he never embraces this in a traditional way at all. He treats the subject with this delicate, grounded approach that feels fully original and honestly quite daring in it's subtlety, leading to an experience much more effective than if he had gone the traditional route. His background in graphic design leads to some wonderfully charming editing techniques and Woody Allen circa Annie Hall uniqueness in the story structure, but it never overpowers the center that is ultimately a charming, emotional and entirely natural character study. The study of a young man finally seeing who his father is, contrasted with his first experience in true love. All three of the central characters charmed me off my feet, but Mills creates genuine, flawed and sometimes annoying human beings out of all of them.<br><br>Once again, as with everything else in the film, he transcends the general approach and just creates these full, real human beings. Oliver and Anna instantly became one of my favorite couples in the history of cinema, with the incomparable chemistry between Ewan McGregor and Melanie Laurent, and Hal reminded me so much of my grandfather it really brought me to tears several times. Mills plays everything in an understated way, but by doing this he allows the film to really get under your skin and sink in, a much more effective technique than just hitting you on the surface over and over again. The performances by all three are truly out of this world.<br><br>I find McGregor to be a great talent who rarely gets the opportunity to demonstrate that, but this character allows him to give his finest performance to date. He is so grounded and honest in his portrayal, bringing comedy both light and dark along with genuine emotion that sunk into me deeply over and over again. I related to his faults and his gifts and McGregor really made me feel like I understood this guy through and through. Laurent is a delight and makes you fall in love with her almost instantly; again I have to mention the overwhelming chemistry that the two of these had. Before we even got a chance to fully comprehend their relationship, I was in tears by the simple act of them holding hands with one another. Mills and Laurent take a character that could have been conventional and tossed aside for the father-son dynamic and make a fully-fleshed person out of her, complete with her own demons and turmoil and I fell in love with her all the way.<br><br>Then comes Christopher Plummer as Oliver's father, who is everything you could want from this guy; charming, chaotic, filled with life and regret. He's absolutely enchanting and devastating simultaneously, a guy that makes you want to live your life to fullest potential. In fact, enchanting is a word that is perfect for the film as a whole. Beyond the authenticity and the emotional impact that it had on me (which is not small by any notion), the film truly seems to dance at times and it's in those moments that I felt something...beautiful and serene beyond anything that words could hope to encapsulate. This movie transcended everything for me.","user":"Rockwell_Cronenberg","rank":[75,93]}]