[{"title":"getting tired of temporal roulette","rating":7,"date":"31 July 2013","review":"Tom Keaton (Matthew Goode) is struggling with a mess of sexual encounters with various women after the death of his wife Sarah. He is estranged from his son Oscar. He's a top chef in a chic restaurant.<br><br>The acting is good here. The reason for his dysfunction is compelling. However, many movies nowadays think they need the added tension of shredding the time line. They think they need to confuse the viewers so they have the added tension of trying to figure out the storyline. Instead, they should have the confidence in the story to allow it to unfold. Sure flashbacks may be preferable to a strictly linear time line but there's no need to put the film thru a blender.","user":"SnoopyStyle","rank":[16,19]},{"title":"HK Neo Reviews: Burning Man","rating":7,"date":"4 December 2011","review":"Burning Man is a different film that goes the route not taken. It is works in the same manner of films similar to Memento. It requires the audience to invest into the film and with the effect of constantly solving a complicated life puzzle. It is an unique experience that will stay in your memory for a good while. It is a essentially at its core a film about dealing with loss, moving on, grieve, the love of your life, cancer and the aftermath of a tragedy. It is what you call a smart film that let the audience work it out for themselves. The film also constantly uses sex as a symbol, motif, and metaphor and to depict the passion with the relationships. Shot in the backdrop of Bondi Beach in Sydney, the location is almost unrecognisable and the cinematography is mostly excellent. Although the film is shot and edited in a creative manner, meaning that nothing happens coherent and the director is clearly playing with time and memory, it is exactly this aspect that the film fails to connect with the audience and ultimately feel for the characters deep involved in their respective situations. Still, for an Australian film, these is an admirable effort and along with a wonderful yet conflicted performance from British import Matthew Goode and the screen stealing beauty in Bojana Novakovic. Although I have not since any of director Jonathan Teplitzky's previous works, with Burning Man, one can only say that this man is filled with potential.<br><br>All in all, The Burning Man is not a film for everyone; it can be am torture to sit through and also rewarding at the same time. In essence it is very much an independent film, but for what it is worth, The Burning Man is a fine effort and deserves some much needed credit for the Australian Film Industry <br><br>Neo rates it 7/10<br><br><ul><li>www.thehkneo.com</li></ul>","user":"webmaster-3017","rank":[20,25]},{"title":"Real portrayal of a mans grief","rating":10,"date":"26 November 2011","review":"this is a great movie. One of the best portrayals I have seen of a man experiencing loss and grief. The burn he is acting and the way it is expressed is portrayed in a realistic way. Men can grieve in the arms of others and to the soft well intentioned actions and ministrations of those around them. I find most men do work through the issues with space to brew and rage, talk is important but space to work it out is better.Sitting on the kitchen floor with a bottle of red wine at 2 in the morning nutting it out with someone who cares is where the healing starts. A real visceral portrayal...thank God the only therapist in sight was an ex-shag. The redemption of this guys sad state is due to something greater then himself, his son and the need to carry on. OK, there are a few tears to be had.","user":"mtalty22","rank":[26,34]}]