[{"title":"Streep, Jones and Carrell Break New Ground","rating":9,"date":"19 August 2012","review":"I am a single, 67 year old retiree, who has been married and divorced twice; and this movie really touched me. It acted as a sort of cinematic mirror to prompt me to reflect upon the many daily choices, or even finer gradations of volition, that make up a healthy or dysfunctional marriage or relationship of any kind. The movie was about how we create our own heaven or hell, in the house, in the kitchen, in the bedroom, and in life. We lose our grip on our passionate love affairs almost the way that dust slowly collects on the floor. Didn't I just vacuum that dust yesterday? That is how a marriage can ossify, degrade itself, as if consciousness itself were shot full of some sort of novocaine by sneaky subtle injections over the years, one feeling at a time numbed.<br><br>Meryl Streep, Tommy Lee Jones and Steve Carrell are excellent and break new emotional and acting ground for all three master actors.<br><br>The movie made me think about my entire life, and it made me reflect upon my parents' marriage, too.<br><br>Tommy Lee Jones' portrayal of Arnold, a man who has been an accountant so long he can simply function on automatic with his customers, not really giving his passionate self to his business- or his marriage, ran the gamut from acceptance of various ruts to various kinds of rage, embarrassment, and stubbornness, refusal to drop his pride, or make compromises that would have been in the best interests of himself, his wife and the marriage.<br><br>The camera does not editorialize. It shows Arnold falling asleep watching golf instruction on television. The camera directly above the frying pan and close up, depicts Meryl Streep's Kay, sizzling a strip of bacon and one sunny side up egg for Arnold every day, day after day. He eats his breakfast with his back to her as he reads the paper, then gets up, every day, and gives her a peck on the check without even making eye contact, and he's off to work again- like an unemotional little engine that could.<br><br>When Sisyphus pushed that boulder up to the top of the hill, his punishment by the gods, he had to watch it roll back down to the bottom of the hill whereupon, he repeated this process - for eternity. But Sisyphus smiled - at least according to Albert Camus, he smiled. It occurred to me that relationships and marriages devolve into accommodations, and that passion, like air being spent out the tiny leaks in a worn tire, can evanesce before either party truly, deeply realizes what they are doing, what they have done. The smiles in this movie are forced, automatic, defensive, painful. Boulders are not openly acknowledged.<br><br>In this movie, every scene is slightly underplayed. No line or gesture is over the top. Almost every word of dialogue is realistic. I never felt that I was being lectured or preached to. I did think that the background music was too intrusive several times, however, almost as if someone did not trust Meryl Streep to carry the emotional load of the scene - an error of judgement. This movie needed no such authorial or directorial intrusion - That is my only criticism.<br><br>\"Hope Springs\" is a movie about the ingredients of happiness or lack of same, and the finesse of the actors, the director, the cinematographer and the editors is magnificent. They never stooped to dwell on any sort of cliché dialogue or acting flourishes. It was believable.<br><br>I felt that the movie really opened up my life. I wish I had seen it 45 years ago when I married for the first time. It is that good.","user":"stephenrtod","rank":[82,95]},{"title":"Great acting, excellent dialog","rating":9,"date":"18 August 2012","review":"The plot seemed simple enough, a marriage in trouble, but when you have Streep and Jones you expect a treat and the did not disappoint at all. The scenes where they are sitting with the the therapist you can cut the tension with a knife. You expect Streep to be brilliant and she is, but Jones more than hold his own. It is difficult to play a man who is unable to be vulnerable and he truly excelled.<br><br>Of course as with every cinematic experience depends on your state of mind and your demographic. The couple sitting in front of me were elderly and mid way through the movie the lady leaned over and put her head on her partner's shoulder and stayed like that through the rest of the movie. This movie does that to you, it makes you appreciate your partner more, you can almost thank them for putting up with our own shortcomings.<br><br>This is a real movie for real people ... Enjoy!","user":"badawi_33","rank":[43,51]},{"title":"Touching and real (and unexpected)","rating":9,"date":"10 August 2012","review":"The trailer and marketing campaign for this film is another instance of a collection of sound bites making a film seem like something that it is not. This is NOT a geriatric sex comedy. In fact, I would not even call it a comedy. There are some laughs, several smiles, but most of the time I was in tears. If you go there expecting laughs, you may be disappointed. I went there with such expectations, and I was pleasantly surprised and amazed.<br><br>I am about the same age as the couple, and I deal with divorcing couples every day. This film is so real and true-to-life, with no big fight or over-the-top scene, which is appropriate since so many marriages end as a result of a collection of little unintended cruelties becoming unbearable.<br><br>I cannot think of any film in which Tommy Lee Jones or Meryl Streep gave a more astonishing performance. Tommy Lee going to a couples therapy session run by Steve Carell? The perfect set-up for lots of laughs, but then we realize the situation is really not funny.<br><br>Imagine a film in which Steve Carell has absolutely no gags, routines or funny bits. Yet I can't imagine anyone doing that role better. He was in another film dealing (in part) with a relationship gone bad, \"Crazy Stupid Love,\" which was a comic take (and a marvelous film). Trying to find another film for comparison, the closest that comes to mind is Bergman's \"Scenes From A Marriage.\" But I think this film about the same general subject is much more accessible.<br><br>I would have given this film a 10, but the soundtrack of obvious songs to underscore the plot became somewhat distracting. The song most appropriate here (but not used) is \"That's The Way I've Always Heard It Should Be.\" The couple here would be from the same generation as Carly Simon.<br><br>I'm going back.","user":"Ric-7","rank":[129,165]}]