[{"title":"What a great surprise!!!","rating":8,"date":"16 February 2011","review":"I did not read the manga, but I did watch the entire anime a few years back. The anime had 2 full seasons to tell the story, the movie had just two hours. So clearly while it is not as rich as the anime, the movie does a very good job given the time restriction.<br><br>I had no expectations when I started to watch it, however after 15 minutes I was a believer, and even if I didn't know the story, still a pretty decent movie. Very nice FX and a high quality production to it. <br><br>As fiction flicks goes, it is not for everybody, but If you like the theme and/or anime/manga culture, go for it for sure. And the sequel is already in the works, so we will get our Gantz fix soon enough.","user":"eduardo-peixoto","rank":[24,32]},{"title":"I shouted \"shoot\" 'till I got hoarse....","rating":25,"date":"25 March 2012","review":"This movie started out so good, it was almost criminal it turned out to be such completely unbelievable crap in the end.<br><br>The basic premise was good, for this kind of movie that is:<br><br>1. A bunch of guys die for several reasons. <br><br>2. The end up in a room with a mysterious black globe.<br><br>3. The globe gives them missions to kill UFOs residing in Japan. Hinting that they may redeem their lives this way. <br><br>4. They are given suitcases with black suits and cool sci-fi guns.<br><br>5. They are attacked by vicious UFOs.<br><br>So any person equipped with more than two brain cells would have:<br><br>1. Donned the suit.<br><br>2. Quickly checked out the weapon and got ready for the mission. <br><br>3. You wanna get your life back, right?<br><br>This far into the movie, I expected they would, I was eager for what was to come. This could be great!<br><br>Then they are magically \"lasered\" away to someplace in Tokyo and the UFO guy is not late to show up. Well not to spoil what happens too much, they are completely unprepared for the mission. And why? <br><br>1. They have completely failed to put on their cool black suits. OK, they girl has put it on. And looks good in it! <br><br>2. They have completely failed to check out their cool weapons.<br><br>Not to to spoil the movie, if there is anything to spoil, let me say this as a reality check:<br><br>1. If I knew I had died and had a chance to redeem my life by carrying out a mission, I would be sure to use any equipment given me.<br><br>2. If a monster was attacking me or my fellow undead, I would be sure to shoot first and ask questions later. Out of pure survival instinct.<br><br>3. If a monster was beating the crap out of one of my friends, then, even if I had no gun, I would do something to help out, lest I live in shame for the rest of my life.<br><br>4. If I was a hopeless nerd like most of the guys in the movie, and a cool beautiful girl showed interest in me, I would at least talk to her.<br><br>The guys in this movie, though, fail on all these basic point of normal behaviour. They are all prize-winning village idiots, almost autistic in their passiveness, hopelessly asocial towards the beautiful girls that seem to like these idiots, egoistic, craven individuals who can't use a weapon or even throw a stick at a monster in order to save their own or other people's lives. They lack the most basic survival instincts or humanity.<br><br>As a result, I spent most of the movie shouting \"FOR THE LOVE GOD MAN, SHOOT, SHOOT, SHOOT!!\" <br><br>I'm not a trigger-happy man in normal situations... But with vicious UFOs attacking me, come and get some! :-)","user":"goranbr","rank":[26,38]},{"title":"Great Adaptation of the Anime","rating":9,"date":"18 February 2011","review":"I actually don't like film adaptations of anime, there's something crazy about trying to follow a series that's roughly 12 hours in length down to a suitable movie format of 1.5 to 3 hrs. What surprised me about the film adaptation of Gantz, is how well they adapted the idea of getting transported to a room relentlessly by a alien sphere to fight aliens shortly after your own death, instead of simply trying trying to mash the plot into a shorter format. They kept most of the aliens, but changed a lot to the series which is pretty refreshing after it had been out for five years. Also, the film is just as brutal and violent as it is in the anime, maybe even more so with the film's added realism.","user":"eplanti","rank":[16,25]}]