[{"title":"Joaquin Phoenix deserved the Oscar","rating":8,"date":"15 July 2019","review":"I will never understand how Phoenix and Hoffman didn't win the Oscars. Specially Joaquin, I truly think it is the best actor performance I ever watched in my life. The movie is great, although is not for everyone, you must watch it with the right mindset and pay attention to every detail. Most new actors should watch this movie to take notes on how to be a better actor. Cheers.","user":"Hazu29","rank":[58,61]},{"title":"Critically-Acclaimed Film with Outstanding Performances Left Me Surprisingly Cold","rating":6,"date":"11 February 2014","review":"This is one of those films which the critics were nearly-unanimous in offering universal praise and yet audiences seemed to be relatively dismissive. (The film didn't quite make back its money at the box office.) The performances of Joaquin Phoenix, Philip Hoffman, and the rest of the cast were outstanding, along with the dialog which seems perfectly suited to its characters. Even the sets of the late 1940's and early 1950's were superb. And there are a number of surprising moments in which you don't know where the story is headed. However, by the film's end, I felt like there was something missing, as if the filmmakers were reluctant to take a risk with the material and say something about their subject through the story. About the last half of the film, the story meanders and never finds again its pace or goal.<br><br>The film is about the obsession of cult groups which try to answer life's riddles for troubled people. In this case, the group and its leader appear very loosely inspired by Scientology and L. Ron Hubbard, called \"the Cause\" whose leader is Lancaster Dodd (Hoffman). Although Hoffman plays the title role, the story is really about an ex-naval officer Freddie Quell (Phoenix) who is suffering from PTSD as a result of his involvement in World War II. After the war, he is a lost soul roaming through life with a series of misadventures, such as attacking a customer when he works for a department store as a photographer, or accidentally offering a poisonous drink to a migrant worker.<br><br>At his lowest point, he wakes up on board some kind of small yacht and meets a strange man, Lancaster Dodd, who informs him he's aboard his ship at Quell's request, although our protagonist can't remember having boarded. Quell learns about Dodd at their first meeting who states \"I am a writer, a doctor, a nuclear physicist and a theoretical philosopher, but above all, I am a man, a hopelessly inquisitive man, just like you.\" He also says people attack him for his \"dangerous\" ideas. Slowly, Quell learns that Dodd is head of some kind of an underground movement combining philosophy and pseudo-science and publishes books on some far-fetched ideas which probably have no scientific basis. Dodd is often referred to as simply \"Master\" by members of this group. Dodd and his group believe the way to \"heal\" troubled people is by cleansing their souls through a hypnotic process which attempts to heal injuries inflicted during past lives.<br><br>Probably the most compelling part of the film is the first half, where we as the audience learn about Dodd and the Cause through the eyes of Quell. The most captivating moment is when Dodd is accused of not only illegally accepting a large donation from a philanthropist through a foundation, but practicing medicine without a license. I thought the film would focus on these accusations, but then the film leaves these indictments far behind. Afterwards, the film meanders, a bit like Quell at the beginning. The film becomes an episodic montage of interesting moments which are rather disconnected. By film's end, I didn't feel much more was revealed about Dodd and his Cause than when Quell first joined during the first third of the film.<br><br>Although all the acting is right on the money including outstanding performances by Hoffman and Phoenix, and the script dialog was absolutely true the characters, the entire film was kind of dissatisfying. We as the audience are given hints of the politics of Dodd and his inner circle but often these ideas are never fully developed. Also, much screen time was devoted to many of the \"past life\" sessions conducted by Dodd, but I think at some point it became wasted screen time. After 3 or 4 sessions, I pretty much understood the idea but instead countless others are offered without giving much insight into Dodd and who he is. By film's end, \"The Master\" was more like a character study than a story. A noble effort that wasn't quite there for me.","user":"classicalsteve","rank":[47,55]},{"title":"This is extremely difficult for me. Let me just start.","rating":9,"date":"7 October 2012","review":"Yes, herein contains some of the most ravishing filmmaking of the new millennium. The period details are abstract yet precise. The score has a stark, primordial allure. It's post-WWII America: Psychologically scarred veterans attempt to cramp themselves back into society. One is loner Freddie Quell, adrift in emotional confusion. He's secured a gig as a portrait photographer at a lavish department store imagined like a temple of indulgent commercialism. But Freddie doesn't last long there. In the darkroom, he screws models and chugs rotgut he makes with photo chemicals. Ultimately, he loses it on a customer, not just hitting him but harassing and lambasting him, working out some indecipherable, irrepressible rage.<br><br>Phoenix's performance as Freddie reduces all he's done before to a preparation exercise. He longs for something, but even he can't tell you what, and that sorrow has clotted into self- destructive ritual. We see his snarly face from angles we haven't seen before. We're not sure if his leery eyes are hateful or if he's dead inside. He's a captivating animal.<br><br>Then he meets stout, articulate Lancaster Dodd, always circled by people who treat him like a prodigy, hanging on his every word, laughing at all his mugging. Lancaster fancies himself a renaissance man. He's married to Peggy, who's much more vigilant than we first think. His son trails the proceedings with a dormant pose of derision. His daughter marries a man who, like everyone else in their clique, views him as a wizard.<br><br>The film belongs to Phoenix, but Hoffman more than does his thing, his affectations ringing with conceit and fraudulence. Freddie---father dead, mother institutionalized---is naturally drawn to Dodd, who promises answers, mental freedom, happiness, even claims to cure leukemia. He's written a book his bootlickers treat as a sort of bible. He loves to charm and perform.<br><br>It's well-known that Lancaster's cult is inspired by L. Ron Hubbard's Scientology. It's not direct, but the manner in which Lancaster draws Freddie into the fold, among other things, is unmistakably influenced by the contentious institution and Hubbard's life. Paul Thomas Anderson doesn't bind to that inspiration for his movie...but he doesn't bind to anything, really. You walk out muddled, wearied, wondering where to start in connecting the dots in this elegant, arresting movie. The story is as confounding as its technique is magnificent.<br><br>Anderson, the true wunderkind of the Tarantino generation, sets everything up so beautifully, you wait for the turning point to prevail so the intrigue can come to boil. Instead, nothing progresses. The dramatic developments seem to dwindle and become less consistent as the movie drifts along, and Anderson throws in pauses, like a lingering desert scene or an outstretched montage in which Freddie is made to pace in a room, that slow the movie to a drudge. Freddie's sex preoccupation, which was stressed in the film's early stretch, grows dissonant. It's less about narrative arc and more the emotional condition of two men, a twist of trust and mistrust, id and superego. PTA's vision is grand in scope, but his result is not so much ambiguous as opaque and detached.<br><br>For the first time in his immaculate career, the greatest filmmaker of his generation seems to languish. His newfound frigidness makes the film easy to admire but difficult to love. Anderson is so stunningly impressive, in fact, that it's taken me two viewings of The Master to admit all this to myself. Understandably, some critics have patronized it as deliberately evasive and occult, but isn't that just double-talk? A glorification of an artist's failure to proportionately bear his ideas? Something particularly intriguing is how the movie poses questions not so much about the importance of faith, but how far the human limit for change can extend and to confront emotional devastation so heavy it can never recover. But the film is too ambivalent or cautious to probe them in depth. By the end, it's become an opaque challenge between two phenomenal actors whose commitment to their roles is awe-inspiring, but it's manacled to a work so in awe of itself, the audience gets blockaded.","user":"jzappa","rank":[144,189]}]