[{"title":"Very poor","rating":3,"date":"19 June 2011","review":"Oh dear. Yet another failed attempt to do a 'Four Weddings'. Take a selection of 'hilarious' middle-class characters, throw in a bit of sexual experimentation, some London landmarks and a barrage of romantic clichés, and you have the formula for this soggy mass of mediocrity. The script is banal, the characters unappealing, and the hodge-podge of nationalities baffling (would you believe English, American, Canadian, Australian, Indian and Eurasian characters all together in anything except the Olympics?). Martin Freeman plays a remarkably unsympathetic character, and has little to do except pull his usual variety of faces. The problem with the British film industry is that it's only possible to get funding for this sort of gloop, or for gangster films.","user":"jenkinsc01","rank":[38,49]},{"title":"The premise is great but it chickens out in the middle","rating":4,"date":"19 April 2012","review":"I love movies that deal with sex and marriage because these are topics that, well, are taboo on our society. The movie premise starts great, a marriage with a 'block' on their passion search for alternatives and as I say, it starts great, very liberal in the way it shows the couple trying to search for something different.<br><br>Then, all of a sudden, the movie just chickens out, sex and passion stops being the main topic of the movie and it slowly but surely becomes in another super clichéd romantic comedy about a couple fighting and getting back together.<br><br>Seriously, I love movies that respect their premise and go for it, this movie is not. Swinging (swingers) is the main title of the movie, but, believe me, swinging is the LEAST you will see on this one.<br><br>I don't have a problem with romantic comedies, don't get me wrong, but when the main premise goes to the trash can in the middle of it I get mad.<br><br>This movie is very deceptive, it tries to be original and bold in their initial statements but if rapidly falls in the \"normal\" category.<br><br>A real letdown, if you really want to see a fun comedy that don't dare to chicken out like this one, please, go see \"A good old fashioned orgy\" and do not waste time on this one.","user":"tecnogaming","rank":[17,23]},{"title":"It was light and entertaining","rating":2,"date":"2 September 2011","review":"I read the other reviews and think the film has gotten a bum wrap. It's not Oscar worthy but it's light and easy to watch. I wouldn't say it's a chick flick but definitely would be easy to see with some girlfriends but a couple would get a few chuckles out of it. Assuming you've never swung, it is a bit clichéd but it's not supposed to be taken seriously. The actors do a great job and maybe the writing could have been better. The directing was a bit bland but the overall quality of the production was pretty good. I thought the two main character had good chemistry too. Mandy is not my actress of choice but she's pretty good at light comedy. I've seen far worse actors trying to do comedy. I would recommend this film to friends and couples alike. If anything, once you finish the movie it will be easier to broach the subject of 'swinging' if you get the vibe that your partner is into it!","user":"Momo-36","rank":[11,16]}]