[{"title":"Pollution in itself","rating":1,"date":"3 January 2011","review":"A film so bad it has forced me to spend time creating an IMDb account to warn others about it.<br><br>Animals United should not require a lengthy review or synopsis to achieve this aim. Despite being a feature clearly made for under 12s, the film has a brutal environmental and political agenda of breathtaking ambition. This is presented with so little nuance or charm that, despite all the perfectly good arguments for ecological action, you somehow despise the animals who star.<br><br>The plot is paper thin, chaotic and occasionally plain nonsense. For instance, the plot insists environmental conferences achieve nothing but a conference of animals which tails off into a juvenile eulogy for a fantasy world somehow inspires the action required. Not even my three year old niece fell for that level of reasoning.<br><br>Worst of all, I watched the entire film and, despite sharing the immediate area of the cinema with around twelve children of various ages, can honestly say they did not even smile once, let alone laugh. It is devoid of any entertainment value. I think you get the point.<br><br>I wonder how the makers of this film can live with the amount of energy being wasted to give it distribution...","user":"timothycrippins","rank":[68,99]},{"title":"Terrible","rating":1,"date":"29 December 2010","review":"This was truly the worst film I have ever paid money to watch. It was so terrible that my 9 year old sister and I left halfway through(she asked to leave!) This is a German-produced film with British voices edited in, and therefore the animation was off for the speaking. We went because of the amount of well-known stars in it, and yet all of them sounded dreadfully bored, with only James Corden trying, but trying way too hard. There was no plot at all and too many story lines to follow, each one receiving about 5 minutes before moving somewhere else and then suddenly all the characters are together with a minutes explanation of how. It was just so boring, so unless it is amazing for the last 20 minutes steer well clear of this film! There is a small scene showing fire, although you could clearly see the animation straight lines supporting the fire, it seemed more like a first draft. My only thought was that this must be politically based as there wasn't a single joke worthy of a laugh while we were there, but it was definitely not worth the £10 I paid to watch it, extremely disappointed as I was really excited before it.","user":"joealderton","rank":[39,66]},{"title":"Worst film I've ever seen","rating":1,"date":"30 December 2010","review":"Lazy, badly written, tripe. The plot is so insultingly stupid I wouldn't let children watch it in case it harmed their development. I took my 3 year old son to watch this and even he was bored after 15 minutes (nothing happens in this time)and we ended up leaving 60 minutes into the film, along with several other people that hadn't yet fallen asleep.<br><br>There is NO humour in this, completely witless drivel from the start and it amazes me this was ever made. Pointless musical moments, one dimensional 'characters', not even some basic slapstick to keep kids interested. A total waste of time that doesn't deserve to be watched by anyone. The British voice cast should be ashamed of themselves.","user":"wsionynw","rank":[37,63]}]