[{"title":"The 3 faces of Alyce: Normal. Fearful. Crazy.","rating":5,"date":"5 November 2011","review":"What is this movie about? It's about a chick who goes crazy. Or---who was not right in the head in the first place and circumstances pushed her over the edge.<br><br>The first part of the movie has Alyce and her best friend Carroll out on the street late at night. They're both drunk having a public heart-to-heart. Why? After meeting up with her boyfriend earlier at a bar, Carroll found out her boyfriend Vince is cheating on her. Later, they arrive at Alyce's place and consider making out (sorry guys, that went nowhere). Then Carroll suggest that they go out and get drugs. This they do. Later Carroll winds up in a hospital. All of this eats up about 20 mins of the movie. The next part is about how Alyce copes with her sense of guilt. She's a nervous wreck and seeing things. The movie seemed like a ghost story at this point to me. To help her cope, Alyce goes back to the same drug dealer she and Carroll went to earlier to buy drugs. Her behavior gets even weirder.<br><br>The movie is about a hour and a half. By the last half hour Alyce has totally flipped and the movie doesn't appear to be a ghost story anymore but about a psycho bitch. The ending is so over-the-top in terms of the story and violence, that it becomes a kind of \"horror comedy\" whereas earlier it seemed like a serious offbeat psychological thriller. Finally, all I can say about this movie is that it's a curious mix of style and content. Subject matter includes: drugs, drunkenness, masturbation, necrophilia, rough sex, butchery (only the last item was explicit). As far as the style goes, it seemed light at first (where's this thing going?), then serious (Damn!), then both light and serious (Huh?) Love, Boloxxi.","user":"Boloxxxi","rank":[81,97]},{"title":"Fun Horror/Thriller with Some Comedy","rating":7,"date":"19 October 2013","review":"Stop watching, rating and reviewing horror films unless you are a fan of the genre! As a general rule, I always assume a horror film is good if it gets at least a five on IMDb. That's because you can assume most of the people rating it don't like horror, so the low ratings from the anti-horror raters are balanced out by the higher ratings from those of us who appreciate it. This is a wonderful turn on the psycho-killer sub-genre. Alyce is an attractive, somewhat withdrawn young woman who pretty much leads her life as an extension of her best friend with whom she obviously has more than a \"friendly\" attraction. After an evening of partying and drug use, she accidentally pushes her best friend off of a roof prompting her descent into depravity. She is obviously unbalanced from the first scene, so it is extremely believable that she is pushed over the edge herself after losing her best friend at her own hand. The rest is grisly, morbid fun. Jade Dornfeld is excellent, sexy, and extremely plausible as the crazy girl who is suddenly a drug addict, prostitute, necrophiliac, and killer all at once while developing a new sense of self-confidence. Definitely a 7 out of 10 - a must for horror fans.","user":"sbrazie","rank":[20,24]},{"title":"Into the abysmal maw.","rating":8,"date":"12 November 2011","review":"Carole and Alyce are young, urban women and very close friends. Each of them is having a bad day. <br><br>Alyce is socially obscure and on the brink of losing her job and home, while the enviable Carole finds out that her boyfriend is cheating on her with other girls. Looking to take the edge off, the young women drink plenty of wine then go to Carole's drug dealer for some spirit-lifting ecstacy. Afterwards, they go to the 4th/5th floor roof of Alyce's apartment building, becoming more intoxicated and goofing around. Carole climbs onto the ledge of the roof, and Alyce runs up to prank-scare her. Carole tragically falls off the roof. Realizing what has happened, a distraught and foggy-headed Alyce returns to her apartment certain that her coveted best friend is dead. After officers come to question her, she discovers that Carole has barely survived the incident but is critically injured and disfigured.<br><br>Alyce is quickly consumed by overwhelming guilt, and begins experiencing ghostly hallucinations about her friend. She turns to the very substances that led to the accident for \"comfort\", and one drug is rapidly replaced by even stronger drugs. With a sociopathic drug dealer administering his special brand of social philosophy as her only connection to others, she changes. No longer the guilt-ridden depressee she was, she reveals herself as something depraved, cold and sinister.<br><br>The first half of this story could be viewed as a simple cautionary tale. But just as the primary character transforms, so does the whole story. It is difficult to categorize the film because the genre is constantly evolving the shifting. <br><br>This film is not what is presents itself to be initially, and neither is the lead character. What emerges is a gruesome, cold-blooded killing spree and complete madness. Three characters who are likely targets for the killing spree are spared, while others are indiscriminately slaughtered. I'm not sure of the reasoning. One character is hacked to bits and ground into mush, but I see the reasoning behind the action.<br><br>The main casts acting was convincing enough to earn credibility, thought was put into characters and their development. Buckle up and enjoy this dark ride!<br><br>7.5. Original and intriguing!","user":"hi_im_manic","rank":[13,15]}]