[{"title":"A Christmas No-Go","rating":1,"date":"7 December 2012","review":"OK guys, let's face it. It's December, snow is falling and although we're stressed out, we want to relax and get into a Christmas mood. So we lean back and switch on \"Christmas Cupid\" in hope for a bit silly, but watchable movie.<br><br>I'm sorry I have to stop you right here. This movie is bad from the beginning to the end. The acting is dreadful, not in one million years do I buy the businesswoman on \"the fast track\". The storyline is somewhat incoherent, yet unforgivably predictable. Yes, we have all watched romantic comedies with a predictable ending, but this one has got to be one of the worst. Even calling it a \"comedy\" does it too much honour. The take on Charles Dickens' \"A Christmas Carol\" was nicely thought, but horribly executed. Not to mention, that there was no cupid in the movie whatsoever.<br><br>This is not a movie I'd recommend for you to watch during Christmas time (or anytime, actually). Better go with some old classics, that'll really get you ready for the holidays!","user":"little_nighty","rank":[12,15]},{"title":"The First 15 Minutes Were Great","rating":6,"date":"14 January 2017","review":"BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY REVIEW ONE FILM. WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE PRODUCTION. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THAT PRODUCTION. NOW I HAVE REVIEWED OVER 200 Christmas MOVIES. I HAVE NO AGENDA. I AM FARE ABOUT THESE FILMS.<br><br>When I sit down to watch a \"Christmas Theme\" I avoid reading what the film is about. I am glad I did for this. The first 15 minutes were very funny and I liked the lead character. What I had no clue of was the fact that this film was yet another variation of \"A Christmas Carol\".<br><br>What throw for a huge loop was when won of the characters dies. In this film Christina Milian stars as high powered Hollywood publicist, Sloane, who finds herself haunted by the ghost of her recently departed infamous client Caitlin, played by Ashley Benson (Pretty Little Liars). With just days away from Christmas, Caitlin takes Sloane on a journey to meet the ghosts of her ex-boyfriends from the past, present and future to try and guide her to true love.<br><br>Not my favorite \"Christmas Theme\" film but Christina Milian makes the most cringe worthy scenes watchable. Avoid small children from watching this. There is a few adult words throw around. Most kids under 12 will most likely not watch anyway. <br><br>The film is worth watching but only once","user":"Christmas-Reviewer","rank":[4,5]},{"title":"A bit sassy...","rating":4,"date":"9 January 2011","review":"Alright, well I just sat through this movie, despite it was a movie that was amazingly sassy.<br><br>Let's start off with the title, \"Christmas Cupid\"? I think the movie was somewhat given a wrong title, sure there was a love theme to the story, but there was no Cupid around. And I sure hope they hadn't intended the dead movie star to be Cupid, if so, that would just be morbidly sick.<br><br>The story told in \"Christmas Cupid\" is fairly easy to follow and straight forward, being a whole re-invention of the classic \"Christmas Carol\" story. Just spiced up to appeal to the modern and hip audience of the 21st century. In itself it was actually not a bad interpretation of the classic story, and it did kind of grow on you, despite there were times where you just wanted the movie to end.<br><br>As for the acting in the movie, well I think the people did a good enough job. And they had some fairly decent names on the list, like Chad Michael Murray, Ashley Benson, Christina Milian, and more.<br><br>I think there is something to the movie that appeals to everyone, but as a whole picture, I think the movie is perhaps more suited for a female audience, than it is for a male audience.<br><br>The movie was adequate, but I hardly think it will turn out to be a Christmas classic movie, that you will get to experience year after year.","user":"paul_haakonsen","rank":[9,17]}]