[{"title":"A clinical study on perversion","rating":24,"date":"24 May 2013","review":"Either Nicholas Winding Refn is a Freudian scholar who has made a didactic film illustrating the nuances of the Oedipus complex, or psychic reality really does have an Oedipal structure. I vote for the latter. <br><br>We have Julian, played by Ryan Gosling, who is even emptier than the character he portrayed in Drive. He barely speaks, has no center, and cannot be a man with the woman he loves. In an early scene, we see him sliding his hand up her skirt in a nightclub. He is not just copping a happy feel; trembling, he is approaching the altar of Woman. We then see him walking down a scary hallway. He extends his hand to open a dark door when...SLICE...Chang cuts his arm off. It doesn't take a psychoanalyst to deduce the symbolism of the arm that must be severed when it reaches out. In the next scene, Gosling opens the door in reality and finds...his mother waiting for him on the bed. So, putting the pieces together, when Julian approaches a woman he imagines a door (and is not Woman always a door for Man?). Behind this door in his unconscious hides his castrating, phallic mother. But before he can open this door, a man with a knife appears and castrates him. Why? Castration sucks...but it is not as bad as what is behind that door in Julian's unconscious (psychosis).<br><br>Now, it happens that for perverse subjects like Julian (and, I am guessing, the director), the unconscious representation at the heart of their suffering is that of the phallic mother. Kristin Scott Thomas plays an excellent phallic mother here: obscene, castrating, oversexual...one who goes as far as to belittle Julian's manhood in front of his girlfriend. <br><br>Notice too that we never find out if Julian's girlfriend is a woman or a ladyboy. This confusion is alluded to in the opening scenes with Billy at the brothel and is further confirmed by the way in which Refn films Mai slowly lifting her skirt to show a breathless Julian whatever it is he/she has under there. Like all perverse subjects, Julian is haunted by the fantasy of the maternal phallus. Hence the popularity of ladyboy prostitutes in Thailand: they bring to life, in a non-threatening form, a powerful and archaic unconscious fantasy. What else but the hidden maternal phallus could Julian be looking for when he cuts open the stomach of his dead mother and reaches in? What Julian lacks is an unconscious representation of the womb, one that he tries here to generate. For the perverse subject, femininity is intolerable because in his unconscious, women are nothing but castrated men. He cannot understand that the essence of femininity is infinite interiority. Notice too how Refn's dojo is a surreal labyrinth: Julian has no representation for the labyrinth of femininity because he is stuck INSIDE the labyrinth of his mother's body. <br><br>The clinic shows us that nothing destroys a son's sexuality like a phallic, castrating mother. For Julian to save some shred of masculinity, he needs a father strong enough to castrate his mother. Enter Chang, who must be considered a pure fantasy. Here is a man strong enough, phallic enough, silent enough (he doesn't even speak English) finally to defeat the Gorgon and extract the phallus from her dead body. Once amputated, the hidden maternal phallus becomes the visible paternal phallus (=Chang's knife), one that is not attached to the body but can be symbolically passed from father to son. This is how the Oedipus complex \"normally\" operates. The perverse subject, however, has not accomplished this step. He has no phallus, no symbolic masculinity. He is still stuck in his mother's body, and as such he does not have the right to any sort of accomplished manhood. Hence the importance of cutting, of severing, of dismemberment for the perverse subject: he dreams of the paternal knife that would finally separate him from Mother and allow him to exist as his own man. Notice too that Julian's \"final castration\" takes place outside, in an empty field: through this paternal intervention, he is extracted from mother's body. <br><br>Of course, the super-phallic, super-castrating father that the perverse subject needs to accomplish this amputation is a formidable figure in his own right, one who is hardly better than the phallic mother in a certain sense. However, his violence is essentially just and limited by the Law, whereas the violence of the maternal superego knows no limits. <br><br>Julian's fight with Chang, in which he gets beaten up terribly, is an illustration of the logic of masochism: submit to the father in order that the father might finally castrate the phallic mother.<br><br>\"Only God Forgives\" is the depressing story of a perverse subject's difficult (impossible?) struggle to detach himself from an obscene, oppressive maternal superego. He doesn't really succeed. At the end, the disappearance of Julian's mother his simply led to the masochistic fetishization of Chang. The movie's last scene is ambiguous. Does it show us that Julian cannot see Chang as a man he might one day equal, a man whose phallus he might one day possess, but as an omnipotent God on stage? Or does it show us Julian's deep love and gratitude towards the lawman powerful enough to liberate him? <br><br>The slow pacing and static shots seem gratuitous at first, but as the movie picks up steam, we begin to understand their raison d'etre: Julian lives in a dead world in which nothing can move or change because everything is paralyzed by his mother. I almost walked out after twenty minutes, but I'm glad I stayed - there are some powerful archetypal figures here. The radical otherness of Chang illustrates well the secret of paternity: in our unconscious, our fathers are all Changs. The movie is worth seeing for this character alone.","user":"FrostyChud","rank":[191,274]},{"title":"An atmospheric tale of revenge, and not the sequel for Drive","rating":7,"date":"24 May 2013","review":"Critics have gone way too hard on this movie. Lots of violent, strange et slow films have been presented at the Cannes film festival since its creation but yet every time a film pushes the boundaries of violence while keeping its own style, most critics go mad and sometimes shout at the screening, even leaving the theater before the end and calling it \"outrageous\". This film, along with \"Anti-Christ\" is a perfect example of the type of scandals that go on at Cannes for quite stupid reasons.<br><br>First of all, forget about Drive. If you know Nicolas Winding Refn's style and like it then you'll enjoy this movie but if you've only seen Drive and believe this is going to be in the same style (because of the same actor, similar cinematography, same musical style...) believe me you'll be disappointed. The trailer might give this impression, but this film is very different. The director had already made other movies just like this, but they did not encounter a really large audience. His works were mostly known by cinephiles, artsy people and intellectuals interested in film analysis (in a general way of course). Drive was his first really big success and also his first film taking place in America, starring a worldwide known star (Gosling) and going deep into its message while keeping a more specific style than his other films. <br><br>Here Refn feels a lot more philosophical, and comes back to his original style in directing films such as Valhalla Rising : great visuals, slow-pasted action, scenes that seem a bit detached from one-another, deep character development, little dialogue, extreme violence mixed with soft and/or trance-electro music... all of which are here to deal with philosophical, deep, hard subjects like revenge, good and bad, mother/son relationship etc...<br><br>When it comes to the acting Gosling does not disappoints however this time Refn wanted to do the opposite that he did in Drive : showing the weakness of his character. Also, even though he does pull-off a very convincing performance, Kristin Scott Thomas is surprisingly captivating and gives her character a much more \"real\" dimension than it could have been (like it is most of the time, when a woman is supposed to play a drug-lord badass). But saving the best for the end, Vithaya Pansringarm, an actor totally unknown to me until know, plays wonderfully his role as the mystical bad guy, and really did surprise me by the quality of his acting. He completely understood the movie's atmosphere and makes his character feel mysterious and fascinating.<br><br>To sum-up this is a very atmospheric, deep movie with great actors/actresses and dealing with difficult and serious themes, with some philosophical analysis possible, but definitely not in the same style as Drive, even though it has some similarities with it.","user":"toinou328","rank":[277,422]},{"title":"People are missing the point","rating":9,"date":"26 July 2013","review":"It's a shame that people seem to be missing the point behind this film. However, on one's first sitting, it's easily done - Refn's style and pace may fool you into thinking this is a dull, slow film. The long, seemingly unending shots of actors staring into the distance may make you question Mat Newman's (the editor) talent. But what you really need to do is to look deeper into the film, because behind the extreme violence, the beautiful cinematography &amp; production design and questionable reality, there is an interesting message. That message really depends on how you interpret the film, and differentiates from person to person.<br><br>For instance, Vithaya Pansringarm's character can be perceived in a variety of ways - a silent angel out to balance the injustices of his city, a delusional man who thinks of himself as God, or a vengeful cop who is simply out to do his job. Ryan Gosling's Julian can be seen as a confused soul who is out to avenge someone he clearly despised, someone who is bullied into action by his persuasive mother. Kristen Scott Thomas's excellent portrayal of Crystal, Julian's thoroughly unpleasant mother, acts as a wedge between the two of them. And the motives of each of these characters are questionable throughout.<br><br>It's certain that Refn's ninth feature film is not a simple crime drama as you might have expected. Its twists and turns will almost certainly surprise you, and it will linger on your mind long after the credits roll. It makes you question what was real and what was not in a way I've never seen in cinema before. And it really is a shame that a lot of people seem to completely miss the brilliance and genius behind it.","user":"sephev","rank":[184,280]}]