[{"title":"A decent home invasion thriller with noticeable flaws","rating":4,"date":"25 April 2015","review":"Nicolas Cage has been on a bad movie streak for a while now. Every now and then he makes a winner, but most are forgettable B-movies that he agrees to do for a paycheck: You can't blame the man for doing his job. However, not all B-movies are bad - in fact, they're ideal entertainment if you want to sit back, relax, and shut off your brain for a couple hours. Trespass provides that mindless entertainment in spades, with a few head-scratches along the way.<br><br>The premise of Trespass is simple: Nic Cage plays a diamond dealer who lives in a beautiful house with his wife and daughter, and some thugs break into the house one day to steal his stash. Nicole Kidman plays his wife who feels distant from her hard-working husband, and the daughter is a typical rebellious teen that sneaks out and goes to a party behind her parents' back. Nothing special. <br><br>What makes this movie interesting is the performances. Cage taps into his subtlety - something he rarely does these days - which helps the tension and uneasiness of the atmosphere build until he finally bursts (on more than one occasion). And you never really know what is going through his head. These characters have secrets, all of them, and herein lies most of the film's faults.<br><br>The villains in this movie are a mixed bag. Each of the burglars have their own agenda that we find out over the course of the movie through the use of flashbacks and security cam footage. Some of the reveals are a pleasant surprise, others leave you scratching your head. It gets to the point that they're trying to intertwine all these villains' motives together but it ends up feeling forced and underwhelming. However, it is nice that they tried to do something different. Also Ben Mendelsohn's performance as the lead maniac and his eccentric back-and-forth between Cage really adds to the gravity of the situation and makes for a gripping protagonist-antagonist dynamic.<br><br>So to wrap up, this is not a thinking man's movie. You can try to put all the pieces together at the end but you'll only end up confused and disappointed - it's not worth the effort. The best thing you can do is grab some popcorn, turn off your brain and watch the events unravel before your eyes. You won't remember this movie as one of Cage's best that's for sure, but it's far from his worst. A good date movie? Sure. It's only 90 minutes, and if you're a fan of Nicolas Cage, you'll surely get at least some enjoyment from Trespass.","user":"lnvicta","rank":[85,91]},{"title":"Fairly paint by numbers - but not half what people say of it!","rating":3,"date":"3 November 2011","review":"As is usually the case when a movie gets bad press, I felt compelled to see it for myself. As a fan of Nicolas Cage and Nicole Kidman, I was also interested to see just how terrible they were.<br><br>In actual fact I think the critics have been a little cruel. As other reviewers have commented, this is no groundbreaking piece of work; it's a home invasion story and highlights the lengths people will go to for money (see Panic Room for more details....!). Yes there is a lot of screaming from Nicole and a lot of people saying \"run\" and no one runs anywhere, but to be fair if I was in their position, I would likely be in a corner papping myself with fear.<br><br>It seems that they follow a similar formula to Panic Room, in that the burglars are pretty brutal and one or two of them seem slightly unhinged, but this is clearly a device used to work up tension as they become more panicked and more unpredictable. In a sense I liked this element, which showed something more of the invaders' humanity; their fears and failings.<br><br>All in all this is not an amazing film, but nor is it that terrible. It also isn't half as violent as people make out - there is a fair amount of threat but I have seen a lot worse and I am not a fan of violent movies. So 6/10 seems a fair score, although personally I quite enjoyed it - it was easy enough to watch and I was interested enough to keep watching to the end. But maybe that's just me.","user":"bananjo","rank":[53,68]},{"title":"Not Necessarily a Bad Film","rating":15,"date":"15 October 2011","review":"I've never written a review before but felt compelled in this case due to the overwhelming number of positive reviews for a film that I felt was somewhat surprising in it's mediocrity considering its cast. Nic Cage does a fine job of subduing his performance and avoiding the tics that make him so Nicholas Cagey, but at some points it seems like a detriment. Coupled with the home invaders failure to produce much of a 'menacing' feel, Nic's performance doesn't do much to stem the movie from it's ultimate failure: a lack of intensity. In fairness, it seemed like more of a script issue; his character didn't seem very realistic.<br><br>Kidman's hyperventilating hysteria and sobbing pleas almost seem out of place in such a setting and I couldn't help but wish someone would just slap the bajeesus out of her already to quiet her down. She came close to seeming like a cliché but then it dawns on you that her acting would be right on target were the scenes and script properly conveying the direness of the situation she was responding to.<br><br>The bad guys were somewhat typical bad guys and although Ben Mendelsohn stood out with some great acting, in some scenes it could do little to conceal the sense that he was just doing his best to negotiate through some awkward dialogue. <br><br>The movie wasn't bad, it was just a bit predictable and boring, and watching it plod along, I kept waiting for it to be over so I could do something else. It's not transfixing, so would make for a great background movie while you do crosswords or something.","user":"Jehosaphet","rank":[69,100]}]