[{"title":"A solid adaptation of Oz classic","rating":28,"date":"28 July 2011","review":"Patrick White put Australia on the literary map by winning the Nobel Prize for Literature in 1973, but his rich dense style did not make for a best-selling author. This film, an adaptation of White's novel, marks the first time anyone has succeeded in filming a White novel, though he wrote the screenplay for a curious piece directed by Jim Sharman, \"The Night the Prowler\" in 1977. Director Fred Schepisi said at the preview I attended that it was a challenge to film the allegedly unfilmable; if it had been easy it would have not been worth doing. Yet despite the style White was rather a theatrical author, and Judy Morris's screenplay accurately reflects White's mordant wit. His characters are acting their way through life and there is drama in almost every scene.<br><br>Old Mrs Elizabeth Hunter, widow of a wealthy grazier, is nearing the end of her days in some splendour in her Centennial Park, Sydney, mansion, and her two children have been summoned to her bedside. Her son Basil, once a leading actor on the London stage whose career is now in decline and her daughter Dorothy, the ex-wife of a minor French aristocrat, are motivated more by their possible inheritance than affection for the old lady. In fact Elizabeth inspires more affection in her nurses, solicitor and housekeeper than she does in her children. Dorothy in particular has cause to hate her mother, yet it is she who gets closer to her as the film progresses.<br><br>Schepisi manages to blend in the dark humour of the situation with the downbeat storyline. The cinemaphotograhy is gorgeous and the cutting, often without the usual establishment shots, wonderfully done, given the extensive use made of flashbacks – you instantly realise where the characters are. The book's interior monologues often appear as a single image in a single screen. The casting is such as Geoffrey Rush mentioned at the preview that he could not refuse – the very best of the Australian acting profession, though the pivotal role of Elizabeth Hunter is played with great panache by Charlotte Rampling. Rush plays Basil as a man who takes himself seriously, but can't persuade anyone else to. Judy Davis simmers as the disillusioned Dorothy , and John Gaden as Wyburd the family solicitor with a skeleton or to in his own cupboard is pitch perfect. Flora the day nurse, played by Schepsi's daughter Alexandra, is vividly realised, and there are good performances in minor roles also, including Helen Morse, unrecognisable, as Lotte the tragic housekeeper, and Colin Friels as a Labor politician on the make rather reminiscent of one Robert James Lee Hawke. The only odd casting decision is casting Melbourne locations as Sydney. Mrs Hunter's mansion is definitely not in Sydney and only a couple of brief scenes are shot in Centennial Park.<br><br>It has been opined that \"The Eye of the Storm\" is Patrick White in drag, and it is true that there are some obvious personal aspects to the story - there is a lot of White's mother in Mrs Hunter. Set as it is in the early 1970s in the declining old money grazier milieu, this film could be written off as a period piece. Yet Schepisi has managed to capture both the theme and atmosphere of the novel. The difficulties of dying have rarely been so well depicted on film. This may not be a box office smash, but it will appeal to anyone who likes a solid piece of film-making.","user":"Philby-3","rank":[48,53]},{"title":"A Powerful Story, Difficult to Capture on Film","rating":8,"date":"11 September 2012","review":"THE EYE OF THE STORM has so much going for it that it seems a shame that it likely will not draw audiences in the theaters now that it has been released in this country. Thanks to Amazon's Video on Demand it can be watched in the home without the usual distractions of the theater audience more interested in texting and eating than in being willing to follow a strong story for two hours. It is another jewel of a film from Australia and perhaps in art houses it will be appreciated.<br><br>The story is adapted by Judy Morris from the Nobel Prize winning novel by Patrick White (1912 -1990), an Australian author who is widely regarded as one of the most important English-language novelists of the 20th century. White's fiction employs humor, florid prose, shifting narrative vantage points and a stream of consciousness technique. In 1973, he was awarded the Nobel Prize in Literature, the only Australian to have been awarded the prize. 'The Eye of the Storm' is the ninth published novel by Patrick White and it is regarded as one of his best novels.<br><br>The elderly Elizabeth Hunter (Charlotte Rampling), widow of a wealthy grazier, is nearing the end of her days in some splendor in her mansion in Sydney, Australia, and her two children have been summoned to her bedside. Her son Basil (Geoffrey Rush), once a leading actor on the London stage whose career is now in decline and her daughter Dorothy (Judy Davis), the ex-wife of a minor French aristocrat whose fractured marriage has ended with her only asset being the retention of her title of Princess, are motivated more by their possible inheritance than affection for the old lady. In fact Elizabeth inspires more affection in her nurses (Alexandra Schepisi, Maria Theodorakis), her solicitor (John Gaden) and her tragic cabaret- entertaining housekeeper (Helen Morse) than she does in her children. Dorothy in particular has cause to hate her mother for secrets not immediately revealed ('Dorothy was breathless with resentment for what she herself could no more than half-remember, had perhaps only half discovered - on the banks of the ocean'), yet it is she who gets closer to her mother as the film progresses. Elizabeth is a shrewishly controlling woman and her descent into dementia only reminds everyone involved with her of the damaged childhood, marriage and life she has led. The manner in which the story come sot an end is somewhat surprising and in many ways rewards the viewer for the attention it takes.<br><br>The film is laid out in flashback scenes to manage the histories of all involved and the interior monologues that slowly build the full images of each f the characters and their inherent flaws. The acting is excellent, the cinematography is gorgeous, and the story is fascinating. If it doesn't exactly match the density of the novel by White then the ones who seem to be responsible of that are the director Fred Schepisi and the screenwriter Judy Morris. It is a tough story and if the viewer can maintain the level of concentration the film demands, then this is a most satisfying experience. <br><br>Grady Harp","user":"gradyharp","rank":[15,16]},{"title":"sit down and fasten your seatbelt...","rating":3,"date":"3 October 2011","review":"It quite simply is a miracle of old money that this film exists. Not since the 'International cinema days' of the 80s has Australian film making produced such a splendid and intelligent film. If your cinema going has included such Australian quality films as CAREFUL HE MIGHT HEAR YOU or WE OF THE NEVER NEVER or PHAR LAP or MY BRILLIANT CAREER, or you yearn for the qualities of those, then EYE OF THE STORM is for you. The deep credits of 'extra thanks' detail who put money up for this, and every dollar of the $15m spent is on screen. Also reminiscent of great WB dramas of the 40s or even as literary as ALL ABOUT EVE, this new film from Fred Schepisi is prestige film making and a presentation of emotional intelligence of an era and a lifestyle that still exists in old moneyed mansions and bitter family brittleness. I live across the road from the avenue of Centennial Park mansions where the film is set, and I can vouch that there are streets of them in Sydney. Geoffrey Rush and Judy Davis are impeccable and with Charlotte Rampling as Mother/monster make a three headed hydra of drama. The art direction and set design is as much a feature of the film as is Patrick White's bitter pill dialogue and the acting and casting itself. A feast for stage drama and theatre lovers, EYE OF THE STORM is (hooray!) an Australian film that is intelligent bitter and absorbing.","user":"ptb-8","rank":[36,45]}]