[{"title":"best football feature of the year","rating":10,"date":"18 December 2011","review":"I have just seen this film at the Kerala Film Festival in India and I am still amazed! It might be very well the best football feature film of the year 2011. The story about a boy who tackles his great trauma with the potential healing power of football and who is helped wherever he goes by the solidarity of football fans from different nations brought me at different moments very very close to tears. It didn't surprised me that a female director got this deep understanding of the very soul of football, but when two American scriptwriter-producer prove to be so close at the heart of what they have to call \"soccer\" in their own country - then there is hope for more good football films to come out of Hollywood...","user":"fussballfilm","rank":[30,32]},{"title":"Probably the most emotional football movie ...","rating":9,"date":"13 April 2012","review":"An excellent movie. A truly inspirational movie. The name 'Will' epitomes the movie perfectly. If you have WILL, you can do anything. For a boy whose everything is lost, he still has everything he needs, his passion for football. The movie also brings the good side of football supporters to the fore. In today's world where everyone is divided either by race or religion or ethnicity or political point of view, this movie shows that all these things can be forgotten when there is a football match on. Football has this amazing power of bringing people together and this is shown brilliantly in the film. The initial scenes in which Will runs away from his school and the help of his mates they hilarious and brings the lighter side in an extremely emotional movie. You will cry, laugh, get excited, and get goose bumps while watching the movie. Although this is a football related movie, but it also teaches us a lesson in every walk of life \"Never get fever in the way of your dreams\".","user":"taimoor38","rank":[10,10]},{"title":"A MUST See!","rating":10,"date":"10 November 2011","review":"This is the most inspirational film I've seen in a long time. Ignore the critics—many who have criticized the emotional intensity of this film. Perhaps they are uncomfortable with their own emotions. If you have an open heart you will LOVE this movie. This is a film about overcoming life's obstacles by staying true to your heart. You will laugh, cry, feel excited, disappointed, sad, and exhilarated. This film has beautiful cinematography (see it on a big screen!) and music depicting a moving story of passion (Will's passion for football). If you're not already a Liverpool fan, seeing this movie will make you one!","user":"samat-204-884198","rank":[42,51]}]