[{"title":"Choices Have to Be Made","rating":6,"date":"27 April 2012","review":"Movies in which separate story lines converge are tricky to pull off, and \"96 Minutes\" is an example of the ways in which it can go wrong. This is not to say that the film is a total failure or even bad; it simply doesn't reach its full potential. Writer/director Aimee Lagos is obviously sincere in her efforts, and through her characters and the desperate situation four of them end up in, she makes some valid points about class, race, and the legal system. The issue is not the intent, but the execution. Some of the dialogue, for one thing, is just shy of preachy, which in turn makes specific situations seem mechanical and forced. There's also the fact that, because the story weaves several story lines together, it occasionally veers into territory that's either completely incidental or so distantly related that its overall effect is negligible.<br><br>It also doesn't adequately explain the ninety-six minutes referred to in the title, seeing as the film takes place over the course of roughly a day. In all likelihood, it's a reference to an incident in which the lives of four people are irrevocably changed. I'll delve into that more in a minute. For the time being, let me reiterate that the film has all the right ingredients. What it lacks is a practical method of stirring them together into a cohesive and satisfying whole. Having said that, there is a certain degree of power to the ending, in which the fates of two characters are revealed. It's not simply of outcome; we are made to really think about what has happened to them and why. It effectively addresses the notion that in life we have choices, and with those choices come good or bad consequences.<br><br>The film freely shifts back and forth through time, intercutting between a dramatic carjacking and the events leading up to it. For the purposes of clarity, I'll go against its freeform structure and describe the plot in chronological order. Taking place in Georgia, we meet a college student named Carley (Brittany Snow), who studies law and is usually too busy to take a break from schoolwork. This is largely due to her father, and while he's never seen, it's made perfectly clear that he places great pressure on his daughter to succeed. He tells her over the phone that he'll be too busy to attend her graduation. That's not the one that counts, anyway; he'll be there when she graduates from law school, which has always been the plan for her. But does she really want to become a lawyer?<br><br>Next, we meet a high school student named Dre (Evan Ross), who comes from a crime-infested neighborhood and attends the kind of high school where you have to pass through a metal detector at the entrance. Although he has been working hard academically and is eligible to graduate, he finds himself torn between pursuing an education and staying loyal to his gang roots. Part of him knows that, in the real world, he will be seen as yet another African American statistic. His dilemma is exacerbated by his friend, Kevin (J. Michael Trautmann), an angry sixteen-year-old. He lives with his mom, who's not only negligent but is also dating a man that abuses them both. Kevin doesn't attend school. He has no prospects. His only goal is to join a local gang. They tell him to steal someone's car, although they have no intention of letting him in.<br><br>Dre takes Kevin to an area just outside of the college in an attempt to offer a healthier means of escape. A confession leads to an altercation, which then motivates Kevin to go through with a carjacking. As it so happens, Carley has just left a bar with one of her classmates, Lena (Christian Serratos), who knows her boyfriend is a womanizing jerk and yet can't stand the thought of him not loving her. As they reach Carely's SUV, they're approached by Kevin, who at gunpoint demands that they both get in. Lena isn't as quick to react, and so Kevin shoots her. Dre, now in a panic, takes the driver's seat. What is he to do? If he does the right thing and takes Lena to the hospital, both he and Kevin will get caught, and both their futures will forever be ruined. If he lets Kevin kill both Lena and Carley, they may escape, but he will have a tremendous burden weighing on his conscience.<br><br>At no point are Dre's current living circumstances made entirely clear. We see him living alone in a barren house, and while it is feasible to assume that he's taking care of himself, he has no apparent source of income. The film is further weakened by several superfluous and barely related subplots, one being Lena's relationship with her roommate and her insecurities over her boyfriend. Another involves the owner of a small barbecue restaurant, whose primary function is to conveniently reappear at a time when he's needed most. We learn about his nephew, who has finally discovered girls and is ready to start dating. This is compelling in and of itself, but as part of \"96 Minutes,\" it's just filler material. This movie doesn't quite work, although I do give Lagos credit for trying.<br><br>-- Chris Pandolfi (www.atatheaternearyou.net)","user":"Chris_Pandolfi","rank":[10,12]},{"title":"Foul-mouthed, unpleasant film with some effective scenes","rating":5,"date":"22 June 2012","review":"There is no doubt that director Aimee Lagos has talent and she may go on to bigger things. Some moments of this film are exciting and others are moving. The actors, though largely unknown, give capable performances. Based on a true story, this is a film about how four lives come together in a dangerous carjacking which spirals out of control, even for the perpetrators. The time sequence jumps back and forth and while it's easy enough to follow, it gets irritating. It's also filled with thoroughly unpleasant people and drops the f-bomb repeatedly, and although it's probably an accurate portrayal of the big city, it's hard to care too much even for the innocent victims. Besides the constant flashbacks and flash-forwards, the worst part of this film seems determined to wallow in squalor. There are also a lot of early scenes which contribute little to the central story and clutter the film. The last half hour of the film is the best, when the film no longer has flashbacks and flash-forwards. I was disappointed even though there were moments that were well-done and compelling.","user":"highwaytourist","rank":[11,17]},{"title":"Lol, what is this?","rating":1,"date":"29 March 2012","review":"What's wrong with the ratings these days?<br><br>96 minutes is a failed attempt to make a film.<br><br>What you should expect: Ridiculous character behavior, Clichés all over the place, Repeats, artificial drama, bad soundtrack.<br><br>If you would like to see a film using this approach of story telling, go and take a look at Crash 2004. <br><br>Did the producers actually think about the audience? People go the movies to enjoy their time, pay money and then they get this? This garbage. This movie is not entertaining, which is OK, if it at least would have other values, something like a message etc. But no, it doesn't have anything which hasn't already been shown or said in a better way. <br><br>This one is just a waste of time and as always, don't believe the ratings, this one will end up at 4/10.<br><br>I gave it a 1/10 because I wanted my time back after seeing this, the worst thing which can happen to a film.","user":"p_imdb-238-926380","rank":[25,48]}]