[{"title":"Great start, decent follow-through.","rating":7,"date":"20 January 2012","review":"As others have said, the idea of this movie was excellent. You could call it a skeptical analogy of what is happening in some parts of the world – the richest people of the planet abusing poor.<br><br>What I liked about the movie, especially in the early stages, was how much the movie made me think. It was also bizarre to think of what things would be like if nobody looked older than 25. The movie played upon the possibility of multiple generations would look the same age – at least for those rich enough to afford to purchase the additional years. The story was also well thought out in relation to how people would act within the differing classes of society: the rich would take their time and take few risks. The poor would treasure their time, moving quickly, and, with less to lose, would be less risk adverse.<br><br>Great premise, great start to the movie, decent follow-through. Although I wish the strong start was able to be carried throughout the movie, I found this movie quite enjoyable to watch.","user":"droze01","rank":[169,211]},{"title":"Great idea, mediocre execution","rating":6,"date":"24 November 2012","review":"Everyone is on a clock. What keeps the general population from devolving into id-driven mobs is the fact that no one knows how much time they have left on theirs. If you had a constant reminder on your forearm, however, you might simply go about your life in a desperate attempt to prolong it. Or not.<br><br>Will Salas (played by Justin Timberlake) is a 28-year-old factory worker whose one year clock started and aging stopped, like everyone else in the film, when he turned 25. He and his 50 year-old mother Rachel (played by Olivia Wilde) live in the ghettos of Dayton hoping to earn and save enough to at least see the next day. All while wages in the ghetto are constantly going down and the cost of living is constantly going up. Then, while out drinking with his friend Borel (played by Johnny Galecki), he learns of a man with more than a century left on his clock who has unadvisedly advertised his good fortune while in the same bar as Will and Borel. A local time-thief enters the picture and, rather than retreat like his friend did and advised him to do, Will comes to the aid of the fortunate stranger. While saving his life was all for naught, the stranger gives Will all the time left on his clock before allowing the time on his own clock to run out while he's sitting on a bridge overlooking a dry river basin.<br><br>\"Time is money\" was a phrase first coined by Benjamin Franklin. While the idea of reversing that concept to \"money is time\" is interesting, I don't believe the cast was up to the challenge of exploring it. Whatever success Justin Timberlake might've had in supporting roles, he doesn't have what it takes to be the leading man. Amanda Seyfried, whose role has her playing off Timberlake for a lot of the film, is another professional whose appeal tends to overshadow her abilities for some reason. Perhaps an independent production could provide actors with genuine talent, who are young enough to look the part, but this is closer some sort of CW melodrama.","user":"Treyroo","rank":[51,61]},{"title":"Great idea. Poorly executed.","rating":6,"date":"1 November 2011","review":"Live forever or die trying. Justin Timberlake and Amanda Seyfried star in the new sci-fi action film \"In Time\". Will Salas (Timberlake) and Silvia Weis (Seyfried) live in a futuristic world where time is the currency. In this world, people stop aging at 25. Once they turn 25, they only have one year to live, unless they find a way to get more time.<br><br>Will lives in the ghetto where people constantly are timing out (running out of time and dying), while Silvia lives in New Greenwich where people have centuries. It's extremely dangerous to have too much time; those with centuries are usually accused of stealing and are immediately killed.<br><br>When Will is accused of murder, he takes Silvia hostage and they run from the timekeeper (Cillian Murphy). Several times, they find themselves cutting it close with only seconds left on their clocks.<br><br>The concept is extremely unique and innovative, which made me think it was going to be an \"Inception\"-type film. However, it was disappointing to see \"In Time\" fall short of my expectations. It pains me to say this, but Justin Timberlake should not have been chosen for the role of Will Salas. He just can't pull off the character of a tough guy from the ghetto. Amanda Seyfried is decent as Silvia, but she and Timberlake don't have much chemistry.<br><br>I also don't think the script was very well written, which causes Timberlake and Seyfried to be even less believable as their characters. In addition, the characters are not developed enough; it's difficult to get a sense of whom these people, from opposite worlds, really are.<br><br>I found myself checking my watch multiple times throughout the movie. I was distracted and the movie felt much longer than it actually is. For all of these reasons, I give \"In Time\" a 6 out of 10. Great idea. Poorly executed.","user":"kgmarra","rank":[291,390]}]