[{"title":"Eliza González Was A Joy","rating":6,"date":"11 March 2020","review":"I just got out of Bloodshot<br><br>I didn't like it, but I wouldn't say I hated it. It is a very silly film that is seemingly aware (At least I hope it is) of how silly it is. It's pretty tame violence and blood wise, it's pretty much all in the trailers which is disappointing.<br><br>It's full of cliche's, it's action is routine and the effects whilst not bad, are not mind blowing either, there isn't much humour, but I have to say it is hard to hate a film that includes a dick joke which takes 20 minutes to pay off.<br><br>Of the cast Vin Diesel is a bit bland and Guy Pierce is hamming it up but Eliza González was joy as KT<br><br>It features two things I hate in movies, people eating noisily (when they'd never really eat at that moment) and when you see the back of someone's head (Vin Diesel for example) whilst he is talking, but what you can see of the side of his face, clearly does not match what he is saying.<br><br>There were 16 other people in my screening. They were mostly 20 or younger and spent a lot of time on their phones. Someone was even checking Facebook during a chase scene.","user":"slightlymad22","rank":[176,219]},{"title":"Avoid Theaters to Minimize the Risk of Catching Coronavirus, or Worse, Seeing This Vin Diesel Flick","rating":3,"date":"13 March 2020","review":"One must assume that while the world is at the mercy of a global pandemic and every other high profile film release on record is being delayed, the producers behind Vin Diesel's 'Bloodshot' simply decided to say \"ahh the heck with it, just put the movie out and maybe we'll get a bump in market share.\"<br><br>What's the worst that can happen? The film opens poorly, just as everyone already suspected it would?<br><br>The problem with 'Bloodshot' is that there's nothing we haven't seen plenty of times before. Vin Diesel in a white tank top? Check. Man gets killed, brought back to life using cutting-edge technology making him stronger, faster, and more resilient? Check. Man uses newfound abilities to go on a revenge spree and avenge the murder of his wife? Check.<br><br>Perhaps we should be lauding Vin Diesel for getting paid millions of dollars to play the same character for twenty years. The only problem is that him doing so forces film critics like me to watch his movies. Ray, his character in 'Bloodshot,' isn't interesting at all-either before or after his transformation. It's just Vin with a different three letter name, like a dozen other characters he's played recently, featuring the same brooding look and tough-guy mannerisms.<br><br>Instead of going to the movie theater and potentially catching coronavirus-or worse, having to sit through 'Bloodshot'-stream some other similar (and better) flicks instead, such as 'Hardcore Henry' or 'Upgrade.'","user":"Metaflix","rank":[265,361]},{"title":"I am not familiar with the comic but this film felt very familiar throughout as it seemed to borrow many aspects in visuals and concepts from other recent anti hero films.","rating":6,"date":"8 March 2020","review":"It works on a basic level of action spectacle, but really doesn't offer anything in the story department that we haven't come to know with these revenge anti hero films. Vin Diesel is as standard as he usually is and doesn't make the character interesting either. I'll just sum it up and say this is just a throwaway action film with some cool sequences but overall you will feel like you've seen it already.","user":"gillianronnie","rank":[74,98]}]