[{"title":"Tense action","rating":5,"date":"27 September 2016","review":"An action thriller that has two teenage brothers hunting for deer in the woods when one of them accidentally kills the mayor who happens to be hunting as well. The boys happen to be the sheriff's sons which make matters worse upon arresting them. With one brother being released he fears the worst will happen to his brother so he breaks him out killing two officers in the process. Two handcuffed brothers set off in the woods which begins a manhunt with no intentions of arresting them just killing them.<br><br>This film kept you on the edge with loads of tension. More plot is revealed adding on some layers. The music is awesome in this one as well. Violence is mild.<br><br>Matthew Lillard is in this for two seconds and Justine Bateman is looking older in a weird waitress role.<br><br>You'll enjoy this one.","user":"shawnblackman","rank":[3,3]},{"title":"Genre Confusion and Failing to be Creative","rating":1,"date":"20 May 2013","review":"Beware of Spoilers all over this review... Hollywood is having creativity issues lately and this one shows it. Lets make hunting season for humans as it starts first and story just evolves around this idea. This happened before. Firstly it doesn't fit its genre. It's not a thriller, it's not a drama. Second, It's just a movie that nothing really is special. A LOT of nature view, trees and leaves almost cover quarter of it. When initial info's given to the viewers everything pretty much goes as same, nothing really happens you wouldn't think of except the part that we learn Nate did it on purpose. You keep hoping that dad would slip and go berserk for the revenge of his wife but no, he has as Nate's opinion \"no balls\". In fact if you look at the facts while you are watching the movie you get the idea that this movie ain't gonna meet your expectations. Father can't get to his sons while he is almost 20 meters away from them. You say to yourself if he can't do it now, he will do it at the grand finale then something will happen and a crappy ending i will face. You get this feeling at the half of the movie and you cannot stop watching when you watched half of a film do you? I already said it is a crappy ending nothing more need to be said about it. I hoped you watched the movie before reading this as it's full of spoilers but hey, you can't say you didn't warn.","user":"ignorance-crown","rank":[12,18]},{"title":"a so-so low budget B movie","rating":24,"date":"24 April 2013","review":"was praised obviously by one of the persons who's either the director or one of the producers. i have difficulty to distinguish this movie's genre, a horror one, a thriller or anything else that i just failed to categorized. the screenplay is kinda ridiculous, a mayor's family could have such independent super power to put law and the execution authority to hunt down couple of young people? what era is this? feudalism era or dark age? i just hate to see dimwit producers or lousy directors of b movies use IMDb to promote and fool people to watch their blind investments. this is not a movie that you'd go back to the movie theater and pay for the 2nd viewing experience. read carefully of that review and judge by yourself.<br><br>when i watched it again, i've found out something even more ridiculous: when the two brothers ran to the object they shot and thought it to be a deer, their running route was just ridiculous, they ran along the forest opening in a very wide big curve, the victim was lying behind a big trunk and thick high bush. so it meant that it's absolutely impossible for them to shoot that target from where they hid, and it's impossible to see the target. this is so ridiculous, man.","user":"rightwingisevil","rank":[46,102]}]