[{"title":"Streisand and Rogen Bring Considerable Comedy Chops to a Lightweight Road Trip Movie","rating":8,"date":"19 December 2012","review":"Aside from her near-cameo appearances in two ensemble comedies, Barbra Streisand has not starred in a movie in sixteen long years, not since 1996's \"The Mirror Has Two Faces\" which she also directed. Her output as an actress has been meager since around 1980 when she started directing films, building houses and returning to the concert stage periodically, so it was with both great anticipation and some trepidation that I saw this light- hearted 2012 comedy. What a relief to find she hasn't missed a beat in her sharp comedy timing. I think she's terrific as Joyce Brewster, the energetically overbearing mother of Andy, an organic chemical engineer who long ago moved to California and has recently invented a cleaning solution he is pitching to various store chains headquartered across the country. He plans a weekend visit with Joyce in New Jersey, but upon an intriguing discovery about her past, he invites her on an eight-day cross-country road trip with him.<br><br>As directed by Anne Fletcher (\"The Proposal\") and written by Dan Fogelman (the underrated \"Crazy Stupid Love\") who based his script on his own late mother, the film is about how their two mismatched personalities unsurprisingly clash at every stop as their relationship twists and turns with each new humiliation for Andy and each new revelation for the both of them, a few of them quite poignant. The film is at its comedic best when she and co-star Seth Rogen as Andy volley back and forth with her well-meaning thoughts and antics at odds with his spiky annoyance at anything she says or does. Rogen plays against type as the coiled-up Andy since his stoner-dude personality has been the basis of much of his previous comedy. Here he needs to show some dramatic gravity (as he did earlier this year in \"Take This Waltz\") and again does surprisingly well when necessary. There is a confrontation scene between the two characters that I wish could have gone on a bit longer and deeper than it did, but he manages to bring a real edge to the film in ways I didn't quite expect from him.<br><br>Of course there are predictable comedy pieces that also work like a steak-eating contest in Texas where Joyce has to down a fifty-ounce piece of beef in an hour to avoid a $100 tab. There's also quite a supporting cast here, but like Streisand movies of yore, the familiar actors contribute moments that amount to nearly bit parts. Kathy Najimy and Miriam Margolyes are among Joyce's Weight Watchers friends in a quick dinner scene early in the story, while Adam Scott and Ari Graynor show up at the very end of the road trip in San Francisco. In between are appearances by Brett Cullen as a cowboy who becomes smitten with Joyce during the eating contest and Nora Dunn as an officious HSN TV hostess. But that's fine since Rogen really lets Streisand dominate the movie all the way from pushing off potential suitors at a mature singles mixer to getting into the wrong car at a mini-mart pit-stop to getting drunk in a motel bar to sharing her innocently ignorant perceptions of stereotypes. This is only her 19th film since her extraordinary debut in \"Funny Girl\" 44 years ago, reason enough to enjoy the warm, accomplished performance she gives here.","user":"EUyeshima","rank":[58,71]},{"title":"Ignore the Commercials. See Film on it's own Merits","rating":8,"date":"21 December 2012","review":"The Paramount marketing department would have you think this film is a wacky laugh fest. Which is a pity, since more people would enjoy the film if their expectations were different. They go in thinking the film is one way. When in reality, it's a whole other thing. The film is much more touching, funny, and real. I cared about the two main characters, and how they interacted. I was interested in what was at stake for them. For me, the smaller moments of the film made it enjoyable. It was delightful to see Streisand and Rogen working off each other like they have known each other for years. Be sure to stay for the credits to see just how well they played off each other.","user":"Curly-4","rank":[78,99]},{"title":"I think the reviewers didn't watch it all the way through","rating":8,"date":"5 May 2013","review":"At the beginning of the movie I would agree with some of the sentiments of the reviewers (see the scathing reviews on Rotten Tomatoes), however I stuck with it and was rewarded. <br><br>The second half really picks up and everything comes to frankly a touching and satisfying conclusion with great performances. <br><br>Which just confirms that many reviewers must have skipped out after only watching about 30 minutes of the movie and reviewed it based on the first weakest segment.<br><br>As the movie progresses the performances, the chemistry between Rogan and Streisand, the story and the comedy takes off and it becomes the movie you hoped it would be. It really has a heart, you just need to be patient for it to come along. Hang in there ;-)<br><br>Filmmakers take note - you HAVE to grab your audience in the first 20-30 minutes, especially if some of them are jaded reviewers watching screener DVDs that they might just skip if they get the least bit bored and publish a scathing review as punishment.","user":"bmh2010","rank":[27,34]}]