[{"title":"It's not a horror film!","rating":7,"date":"20 June 2012","review":"THE TALL MAN is directed by Pascal Laugier, who directed MARTYRS. From that sentence alone, you're probably already formulating expectations that this will be a bloody, nasty, little horror film starring Jessica Biel. In fact, you can't be any more wrong. The most important thing you need to know about this film before seeing it is that it's NOT a horror film. It's more of a mystery thriller/drama. The second important thing is to avoid all and potential spoilers. I went in knowing very little about the film (other than its basic storyline), and the end result is that much better. Early reviews for THE TALL MAN suggests that it's a horrible film, but I'm pretty sure the negative reception had more to do with people expecting it to be a full-fledged horror flick rather than its actual quality. In fact, I'm afraid the film's fall would be due to people's expectations.<br><br>If there is one similarity between MARTYRS and this film, it would be the presence of an underlying social commentary. Other than that, the similarity ends there. Jessica Biel, the lead actress, pulls off a phenomenal performance. She brings incredible conviction to her role that she holds our attention. The film is also shot beautifully, and director Laugier does a masterful job keeping people guessing until the very end. Overall, the film is likely to polarize the audience like Laugier did with MARTYRS. However, if you leave your expectations at the door and your mind opened, you may be left surprised and profoundly moved.","user":"moviewizguy","rank":[192,238]},{"title":"Know what you're getting","rating":6,"date":"13 January 2015","review":"Tall Man has come in for a fait of criticism from people expecting one thing and getting another. If you've seen (Director) Pascal Laugier's previous film 'Martyrs' then you may be a little more prepared for a film that deliberately leads you in one direction, only to almost switch genres midway through and go off in a totally different direction.<br><br>Tall Man is about a woman (Jessica Biel) whose child goes missing in a town where this sort of kidnapping is commonplace and put down to the legend of the 'Tall Man' - a shadowy figure who steals children. From there, she has to unravel the mystery behind the kidnappings.<br><br>Most people (including me) expected a straight horror film. What it turns out to be is more than that. Perhaps 'thriller' would describe it better. Everyone turns in a solid performance and, if you're in the mood for something a little different, with a few twists and turns, then you could do worse than this.<br><br>Just know that this isn't simply your average 'horror.'","user":"bowmanblue","rank":[19,21]},{"title":"Great Thought Provoking, Not what you would expect, this is not a horror movie.","rating":10,"date":"21 October 2012","review":"i really don't write reviews a lot but i felt i would give this movie a boost on positive ratings because it deserves better than a 6. At minimum it deserves 7.5, but for me i give it a 10. I liked the direction of the movie, scenery, and the storyline. Movies nowadays are so predictable but this one isn't at all. i think the director was clever in the way they made it. It makes you think about the world we live in and i like movies like this that make you think. This movie i totally could not predict it and i usually figure a movie out within 30 minutes of watching it but not this one. You have to watch it all the way thru. The movie has a major twist towards the last 40 minutes of the movie. The way it was kinda marketed i was expecting a horror movie and i decided to watch it just because i couldn't find nothing else and it turned out to be a good little gem. I could see how it could make someone mad if they are expecting a horror movie but this movie is more of a thriller/drama that starts off with what looks like it would be a horror element. They only used the horror element initially to pull you into the movie to pay attention to the story. As you progress thru the movie you realize its has a much deeper storyline. Anyway I say give the movie a chance, this definitely goes down as one of the movies i like enough to add to my collection and i recommend it.","user":"asrivarde","rank":[101,132]}]