[{"title":"Brilliant comedy - not suitable for all audiences","rating":8,"date":"21 July 2011","review":"Anuvahood is a brilliant comedy film for teens and young adults. The humour is mainly aimed towards 15-20 year olds. Adam Decon is a hilarious main charter and it is good that the film doesn't try to make London look like a crap-hole where everyone is a gun-toting idiot. I think that some older generations will not find this film too funny, due to the 'slang' used and the type of humour. Overall this film is a good high quality urban comedy with tons of funny references - I would recommended this films to anyone. - Funny Characters - Funny References - 8/10<br><br>Sorry this is my first review I hope it was okay :)","user":"Ramsingh96","rank":[7,7]},{"title":"An objective opinion?","rating":7,"date":"23 March 2011","review":"Many would claim that the mark of good filmmaking, or of any art, is some kind of subtext; a message being expressed by the artist that requires some sort of analysis, some level of thought or investigation on the part of the viewer. This message may not be one the viewer agrees with, but it is always something that stirs the mind and creates a debate. It would be all too easy to claim that Adam Deacon's \"Anuvahood\" is devoid of any artistic merit not only due to its lack of any subtext or discernible intelligence, but also because it lacks narrative fluidity, realistic character development and any real purpose beyond exploiting its niche target audience and pilfering their cash at the box office.<br><br>This film has not had a good reception. \"The worst film of all time.\" \"America gets Scorsese and DeNiro. We get Clarke and Deacon.\" Film critics loathed it. They walked out en masse at preview screenings. What's the betting that the majority of them were white, middle-class and considerable past the age of 20? This is not to say that I myself am none of these, but merely that films like Anuvahood have a very clear target audience, and to classify that audience as unintelligent or unworthy of entertainment is patronising and small-minded. No, what is needed to enjoy this film is not to be a member of this niche, but simply to have an appreciation of cultures other than your own. The cameos by urban British musicians, references to grime tracks, humour based on obscure slang and scene in-jokes. This is not a level of humour to be hated because it's juvenile or moronic. These same sorts of surreal references are made in plenty of respectable sitcoms and comedies. Those who choose to criticise a piece of entertainment so clearly not targeted at them simply don't understand it. I'm sure many young black people from urban areas will feel no connection or respect for Anuvahood, but that's because the target audience is not \"black people\" or \"teenagers\" or \"city folk\", it's a culture; those who love grime, UK funky, channel AKA, the Jazzie Show, Kidulthood, SBTV, Sidewinder, Eskimo Dance, speaking in slang, cotchin in the blocks. If you don't know what any of that meant, then this film was not for you.<br><br>Do you critics not remember a time where your parents would bang on your door and ask you to turn that rubbish down? When they didn't understand what it was that made youth culture vibrant and exciting to you? When you grew up and the art you enjoyed in your youth became respectable with time and seemed superior to contemporary popular culture? Elvis' movies were awful. Clunky dialogue, wooden performances, weak narratives. A Hard Days Night and Yellow Submarine were hardly moments of cinematic triumph. But these films exist as documents of a time where the youth were excited and creative and made and enjoyed art that reflected their lives and sensibilities. The Beatles were told to cut their hair and turn it down. Elvis was told to stop being so goddamn sexy and sinful. Now Adam Deacon is being told to speak proper English and make a film about something film critics can relate to. Maybe for Anuvahood 2 we'll see him living in Hampstead and attempting to become a Guardian columnist to disastrous effect, or opening a vegan café in Primrose Hill so he can afford a holiday home in the Lake District.<br><br>That is all.","user":"hollywood_is_burning","rank":[31,42]},{"title":"Hilarious - Nice Work Deacon","rating":7,"date":"21 March 2011","review":"Anuvahood is an Urban Comedy film Directed by Adam Deacon. &lt;-- (His First Full Length Film) This film is about a boy named Kenneth (call him 'K') Fletcher. He has just left his job and now wants to be a respected gangster &amp; rapper, soon he realises that he's just another wannabe bad boy Basically a Wasteman. It's starring Adam Deacon, Femi Oyeniran, Jazzie Zonzolo, Ollie Barbieri, Richie Campbell, Michael Vu, Will Johnson, Ashley Walters, Paul Kaye, Eddie Kadi, Richard Blackwood &amp; Jocelyn Jee Esien.<br><br>SLIDER'S REVIEW:<br><br>From the title \"Anuvahood\" meaning Another Hood) don't go thinking that is going to be like Kidulthood or Adulthood. I thought this was going to be a parody but it's nothing like that, it's a funny comedy that does its job to entertain and it doesn't take itself too seriously (and neither should you). All the actors/actresses did their best to bring the audience to laughter and a good job I think they did (lots of LOL moments). As this is Mr Deacon's first film he's directing and acting I will happily give him a B+ for effort. This film does resemble the one of 'Friday' (ice cube film) because I have seen story lines like this before. Anuvahood is just the UK having a go at something similar. <br><br>The humour been displayed is wild and exciting every opportunity they had to throw in something remotely funny they did. Every new character comes with their own aura that added to the comedy. Even the serious scenes had a way of keeping it light &amp; not too heavy.The slang (lots of it), dress code, music and cinematography all fits in well together, it's really London like but the problem with that is it's going to feel like it was made for a specific target audience. Some people from other parts of the country/world may not understand it (hopefully they will).<br><br>Adam Deacon does brilliantly as K, he was a believable actor who life on the estate went from bad to worse. He was able to make the audience laugh and be on his side at the same time. His bestfriend TJ (Zonzolo) does his best to make us laugh but had the over the top sort of feeling in some scenes. You have to keep watching to understand Tyrone's (Campbell) funniness, he is loud, fast talking &amp; in your face at first but then when he gets in his strides he was pure comedy to watch. Bookie (Oyeniran) was also an enjoyable character to watch, all you needed from him was a barrel of assault at K to make you laugh. I for one was not buying Enrique's (Barbieri) accent. I didn't like his character, it seemed forced (this not the JJ I know from Skins). The rest of the cast do an applausable job on screen. Good Performances.<br><br>Cameo Appearances: Lethal Bizzle, Giggs &amp; Mz Bratt + More<br><br>#Overall: Barrel Of Laughs (Support UK Films &amp; Go Watch It)<br><br>ONE FAVOURITE MOMENT IN THE FILM: The scene where K comes out of Tyrone's block and gets approached by a gang who don't recognise him until he says 'allow me'.","user":"nosiru","rank":[10,12]}]