[{"title":"Exceeded Expectations","rating":7,"date":"28 October 2017","review":"I expected the movie to be a standard action movie with a weak plot. This movie surprised me on several levels. First the plot was above average for an action movie. Second, Jackie Chan turned in a subdued and very good character portrayal. Third,the movie was not the typical martial arts laden Jackie Chan performance. There were martial art scenes but they were not over done as in prior Chan movies. Supporting cast led by Pierce Brosnan were also very good. In summary, if your a fan of the action genre you will not be disappointed.","user":"sjspol","rank":[192,213]},{"title":"Best Jackie Chan movie in 20 years","rating":9,"date":"19 July 2018","review":"I love this movie through and through. I've made all my friends and family watch it, and I've seen it myself no less than a dozen times. It is precisely my cup of tea. Why? Well, I'm not too great at explaining myself or critical thinking on film, but I'll give it a shot.<br><br>The pacing. Starts out with a bang, dials it way back, then turns up gradually. We don't so much see a mystery unfold as we do go through a process somewhat behind the eyes of Jackie Chan's character. He takes his time, not that he bides it.<br><br>The fallible hero. Jackie Chan is old. You didn't know? Well he is. And it shows. They don't try to go the Stallone route where he somehow hasn't lost a step and can fight a tank even though he's in his 70's. When he gets hit, it hurts. No more 30 minute long fights with ladders and folding chairs.<br><br>The villain. Pierce Brosnan is one of my faves, and he turned up a good performance, in my opinion. An ex-extremist gone soft, playing politics. His presence enough would've been enough to satisfy, but he played the part well. Thankfully.<br><br>The score/soundtrack. Carpenter-esque, and it really sets the tone. Keeps it tense. People who aren't familiar with Carpenter might liken it to the score used in Stranger Things. And I think it's perfect.<br><br>I guess those are the major points. Now go watch it. It may be the last time you get to see Jackie Chan in a decent movie.","user":"TimDiesel","rank":[120,132]},{"title":"The Foreigner","rating":9,"date":"15 February 2020","review":"I loved this film. Sad at times, but was a great showcase of Jackie Chan's acting ability with a little bit of action thrown in for good measure. Political intrigue was decent and Brosnan played a great bad guy. Ending was pretty good - made me wish they would use Jackie in this character for a spin off. Could have used more of him in this film.","user":"MR_Heraclius","rank":[46,49]}]