[{"title":"Only a biopic","rating":6,"date":"15 April 2018","review":"This is a biopic film that tells the story of a Pentecostal preacher who came to the conclusion that all humans and their sins are atoned for by the Cross of Christ, regardless of whether one has a relationship with Christ or not.<br><br>The film displays good acting and production value, but the script only skims the surface of the internal and intellectual shift Pearson embraced that took him into heresy and heterodoxy. As a Pentecostal and Evangelical, he believed in Calvin's doctrines of Total Depravity and Penal Substitution Atonement. Pearson finally admitted these doctrines make God look like a monster and threw them out. He reached for an extravagant love beyond what humans are capable of and concluded that God loves the world so much that he would not send people to hell, having previously concluded that God does send people to hell - as Pearson is depicted in this film, if not in reality. However, he consulted on the film.<br><br>Pearson and his detractors also assume to have the authority to interpret Scripture and are obsessed with \"knowing\" whether every person goes to heaven or hell after death. These assumptions go unchallenged in the script, but along with Calvanist doctrines are the underlying causes of the whole story.<br><br>The film is thought-provoking and worth watching. It displays the biggest problems with Protestant fundamentalism from the inside, but could have done so much better.","user":"jamesignatius","rank":[22,23]},{"title":"Some script issues are ultimately overshadowed by beautiful cinematography and a great central performance","rating":7,"date":"16 April 2018","review":"The Christian jargon often comes off as a little wooden; maybe it's because a lot of it feels like it would've had to be indoctrinated (Carl's reasoning at the heresy trial spoke well to this), but the progressive theology is a bit ham-fisted too. Ejiofor is excellent though, as an imperfect man wrestling with tradition, conviction, and consequences, and along with beautiful cinematography and a solid score this makes for a number of powerful scenes that overshadow any kinks in the script.","user":"joelwatchesmovies","rank":[16,17]},{"title":"'Come Sunday' Is Sobering","rating":6,"date":"10 June 2018","review":"I watched \"Come Sunday\" in an irreverent mood while downing vodka martinis and exchanging acerbic comments with my fellow cinema club friends about the hypocritical nature of religion. Chiwetel Ejiofor's courageous and contemplative portrayal of Pentecostal Bishop Carlton Pearson's revelation that hell does not exist is hopeful. What is lacking is the fervor and ecstasy of the Pentecostal church due to the film's mostly subdued congregation and restrained sequences of praise and worship. Compared to the Pentecostal church I grew up in, Pearson's Higher Dimensions church in \"Come Sunday\" felt lukewarm even after Ejiofor's fiery sermons and musical accompaniment by church organist Reggie (Lakeith Stanfield). <br><br>After watching \"Come Sunday\" I walked into the kitchen of my friend who was hosting our cinema club. I noticed a card tucked neatly into a frame hanging on her wall with a quote from Chief Joseph on it: \"We do not want churches because they will teach us to quarrel about God.\" That quote along with the message of \"Come Sunday\" was just as sobering as the cup of coffee that, by that time, I was holding in my hand.","user":"lesliecolejr","rank":[10,11]}]