[{"title":"There's more to it than it meets the eye","rating":9,"date":"7 August 2018","review":"I read a lot of reviews and was surprised to see that none has discussed the part where they show young Florence on a boat with her father there are around three scenes where this scenario is show time to time bouncing back with the present time at Chesil beach and the love story unfolding, the director clearly points out why flounce is terrified of the consummating part of the marriage she was molested by her own father when she was young, this has affected adult Florence in ways she has no idea explaining this exact line was there in the movie. When she runs away from the hotel Edward (Billy Howle) thinks she is frigid being a virgin how can one be frigid on their first night, oh man worst part Edward left her not knowing of the root of the problem but was so idiotic to give up on her so easily this is portrayed with the last scene when he turns his back on her at the beach on the night of their wedding after the scene of her farewell performance where Edward regrets it all the he would've had oh the melancholy of it all just leaves you thinking about Love &amp; Lust. Is sex so important to give up on the love of your life......","user":"chandugayan","rank":[81,105]},{"title":"Should Have Been Better","rating":6,"date":"13 August 2018","review":"I've just read several of the reviews here and am surprised to see that only one has mentioned something major in the film which is that the character played by Saoirse Ronan was sexually abused by her father and this is what has caused the major conflict/situation that is the raison d'etre for what happens in the movie. The plot has been described many times so I won't go into it; suffice it to say that Saoirse's character is a very disturbed young woman and back in 1962 her issues were not being dealt with in a major or public way. If the movie (and book? which I haven't read) had gone into the sexual abuse more as well as exploring Saoirse's ambivalence about being a wife, I think it would have been better. Her character is barely explored and that is a shortcoming of the film. Especially since, as other reviewers have pointed out, not a whole lot \"happens\" in the film, the characterological and emotional issues should have been more emphasized.","user":"Moviegoer19","rank":[26,31]},{"title":"Stylish","rating":7,"date":"8 October 2017","review":"Saw this at the London Film Festival. Saoirse Ronan and Billy Howle enter the perilous territory of marriage in a slow, sleek coming-of-age story adapted from Ian McEwan's 2007 novel. I found the cinematography to be superb, the play of colours very well done in accordance to the mood. I wish there had been more development near the end, but the film was sufficiently beguiling to give it a 7/10.","user":"chrisjorg","rank":[33,41]}]