[{"title":"A great, touching, entertaining and well made documentary","rating":10,"date":"16 June 2011","review":"Born to Be wild is an amazing movie. I went to see it in Imax 3D and came out inspired and uplifted. The Film is based of an amazing true story of two real life fairy godmothers and how one adopts and raises orphaned orangutans (Dr. Birute Galdikas) and the other elephants (Daphne Sheldrick). The movie was very entertaining and funny, and Morgan Freeman did a great job (as always) narrating. I loved following the two story's and every day lives of the two women and of course the animals. The bond between the animals and humans is unbelievable, and I loved the scene were one of the orangutans started eating the noodles right of a women's plate! Like I mentioned before, this is a hilarious, touching and just plain good movie. Highly Recommended for anyone of any age! Born to be loved, Born to be free. Born To Be Wild.","user":"cinefreakdude","rank":[20,21]},{"title":"Very Well Documented!","rating":10,"date":"2 April 2011","review":"I just saw a screening of the movie today. They did an incredible job documenting this movie. It looked really cool over the IMAX Dome. I was truly amazed. A lot of laughter. Makes you think about what is out there in the world and how there is so much we can do to help others. I didn't realize that Baby Elephants can't survive on their own. The people that take their time to work with these animals are a blessing in this world. They have a lot of heart. The Orangutans have a lot of characteristics that we do. They can be humorous. They can get into trouble when they want. They cling to others for support. Make's me want to go out there and experience what I saw today.","user":"danielj-8","rank":[29,34]},{"title":"\"Born to be Wild\" in IMAX 3D","rating":6,"date":"8 April 2011","review":"When it comes to nature documentaries Morgan Freeman is a great go-to-guy for the movie studios. He has a voice that can seem soothing and pleasant to just about anyone.<br><br>Freeman narrates the latest IMAX 3D documentary \"Born to be Wild\" by David Lickley (who also directed \"Bears\" and \"Jane Goodall's Wild Chimpanzees\"). For a short 40 minutes Freeman does a first-rate job stirring up many emotions in the viewer. Well, he doesn't do it alone; he has some help from the adorableness of baby elephants and baby orangutans.<br><br>Before this film I would not be able to locate Borneo on a map very easily. Thanks to the clever direction by Lickley we see an interactive map of both Borneo and Kenya where our story is about to begin. We are also introduced to two women who have dedicated their lives to rescuing and adopting elephants and orangutans who have been orphaned because of the actions of mankind.<br><br>Daphne Sheldrick has set up an elephant sanctuary in Kenya; many of the elephants are there because poachers killed their parents (the release of this film could be really bad timing for the CEO of godaddy.com and his recent elephant hunting video). She raises the elephants with a team of zookeepers and is the only person to successfully raise an elephant from infant to adulthood.<br><br>We then travel to Borneo to see Birute Galdikas' sanctuary for orphaned orangutans. They have lost their homes and their parents due to man's rapid expansion into their territory.<br><br>In both cases we experience a cuteness factor that would overwhelm just about anyone with the warm fuzzies. We see the orangutans doing cute human-like behaviors such as drinking milk from soda bottles, bathing themselves and riding on the back of motorcycles. We also see the elephants drinking lots of milk from bottles, playing soccer and adapting to their human surroundings.<br><br>In the end, the captured animals are released back into the wild where they belong. The journey back home is guided by humans, the same species that orphaned them in the first place.<br><br>Should you see this movie? Yes, but only see it in the IMAX 3D format for its vibrant images of the animals and for some wonderful shots of both the African and Borneo landscapes. It's a seemingly flat story with not too many ups and downs or much conflict. If it weren't for the 3D this could have been a straight-to-DVD release.<br><br>I do understand that Lickley wanted us to realize that there is a threat of extinction for both of these species. However, we are not given any action steps at the end. I would at least expect a website address to pop up telling the viewers that they can do more to help these orphans.","user":"jgregg42","rank":[18,26]}]