[{"title":"Disappointing","rating":4,"date":"24 February 2014","review":"If you love the play (as I do), my guess is that you'll not be disposed to like this version. The screenwriter, Julian Fellowes, takes some pretty significant liberties with Shakespeare's original text, which consistently left me wincing when I anticipated a line, only to hear a paraphrased version. I hate to sound all snooty and say you shouldn't mess with Shakespeare (I'm sure it's not perfect) but I would think a screenwriter would set a pretty high standard for changing what the Bard wrote, and based on the number of changed lines, I get the feeling that Fellowes set the bar pretty low. It's the language of the play that makes it so wonderful to me. The general story itself never interested me until I read the play and similarly themed stories (such as West Side Story) have never captured my interest. I don't buy that the language is too hard for modern audiences: even the most opaque puns and outdated language can be translated to audiences via acting and directing. And almost everyone has probably read (or was supposed to have read) the play in high school, so it's not as if this is going to be the first exposure to the play for most people. <br><br>There were also bizarre changes or additions that didn't make any sense to me. A tournament to start the film? What did that add to the story besides having a scene with mounted knights and lances? Mercutio a Montague rather than the Prince's family? OK, not sure what that accomplished. Benvolio and Rosaline at Capulet's ball? Maybe that would have been more interesting if Romeo hadn't already moved on, but it just seemed strange. The Tybalt-Juliet scene after the ball? <br><br>One thing that puzzled me was that Mercutio never felt like an important character. His major Queen Mab speech was cut short and it seemed that there was more effort to establish Romeo and Benvolio's friendship than Romeo and Mercutio's. I feel like the director made this effort to make Benvolio a larger character, which I think made for some powerful scenes at the end of the movie, but when this is at the expense of Mercutio's character, who is one of the few really interesting/dynamic characters in the play, I felt that was a mistake. <br><br>One odd criticism that I've seen in a number of reviews is that Douglas Booth was too pretty, or prettier than Juliet, and this was somehow a problem or a distraction. This is hardly a new dynamic as I would say that both Leonardo DiCaprio and Leonard Whiting were 'prettier' than their respective Juliets (who were both lovely!) which I don't think was a problem in either of those films. My take is this has a lot to do with how R&amp;J movies are marketed at teenage girls as their prime audience and that a 'beautiful' Romeo is what you do to sell seats at the theatre. <br><br>In the end, I don't think that Haillee Steinfeld was a strong enough actress for Juliet. This is probably the hardest role in the play, covering a huge emotional range and demonstrating significant changes and maturation in the character over the course of the play. She seems to be reading lines and not adding any emotion or inflection most of the time. I just never felt that she was quite there. Booth was fine as Romeo, not great, but not bad. <br><br>And just once, I'd love to see a movie where they can't touch or kiss during the balcony scene (which is what the text of the play makes clear). Or at least take out the line 'What satisfaction canst though have tonight?' which makes no sense if they're in physical contact.<br><br>To say some positive things: the setting and cinematography was beautiful, as many have said Lord Capulet was well played as was the Nurse I think. I thought that Benvolio was well played although the actor was distractingly way younger looking than Romeo, Mercutio, Tybalt etc. I like that they kept the scene in where Romeo kills Paris as that was not in the Zeffirelli or Lurhmann versions. <br><br>Overall, I just don't think this version offered anything new or interesting. The Luhrmann version did this and thus I think was worthwhile. I don't see any reason why this would replace the Zeffirelli version as the cannon version of the movie.","user":"mike-salisbury47","rank":[24,29]},{"title":"A dummy's reply","rating":25,"date":"25 August 2014","review":"Of all the clever-clever barbs fired at the 2013 \"Romeo and Juliet\", \"Shakespeare for Dummies\" has probably given the film's detractors the most satisfaction. But, as anyone who has read my user reviews of the 1940 \"Pride and Prejudice\" and the 1999 \"Mansfield Park\" will quickly realise, I am no purist as far as literary adaptations for cinema are concerned. I suppose therefore I must be something of a dummy, but a dummy who would like to take the floor to confess to finding this recent version of literature's most famous youth-love-death cocktail rather wonderful. Not that it hasn't been well done before. I haven't seen Castellani's but Zefirelli's later version was a thoroughly worthy attempt, certainly of a standard to raise a question as to whether further interpretations were needed. I experienced serious unease fuelled by all those truly awful reviews before even the opening credits. Give it half an hour perhaps. Not that it started particularly well. A horseback contest between a Montague and Capulet reminded that we might well be entering \"Ben Hur\" country with all the boredom of that gargantuan epic. I suppose it was the entry of Douglas Booth's Romeo chipping away at a stone figure of Rosaline, his current love, in an artist's workshop that raised more than a glimmer of interest. Was ever a portrayer of the role more handsome! And this coming from a pretty 'straight' viewer! Just imagine his effect on all those Juliets in the audience! I have to admit to finding him the more engaging partner, hardly matched by a no more than pretty Juliet, who rather gabbles her lines and is, well, little more than average school dramatic society material. By now I am aware that I am hardly writing a review of something of a terrific film, so what makes it so outstanding? It can be summed up in the one word - passion. This version concentrates on the lovers to the exclusion of much else such as the groundings humour of Mercutio here played absolutely seriously as is Lesley Manville's pragmatically intelligent Nurse. For once,in Paul Giametti's outstanding portrayal, we can really feel the tragedy of Friar Lawrence's ghastly misguided solution to saving the young lovers which serves to drive the action forward to those tragic deaths presented with such moving intensity. It all culminates in a truly great moment when the young Benvolio clasps the dead lovers hands together. Not Shakespeare but nevertheless a masterstroke. As a bonus we are treated to beautifully shot locations. At one point where the lovers depart from one another on a riverbank the image is ravishing. The main quarrel of its detractors seems to be copious liberties with the playwright's text. There is no question but this is an adaptation in the same way as Kurosawa's \"Throne of Blood\" and \"Ran\" both of which are reverenced by cineastes yet contain not a line of Shakespeare. Why all the furious reactions to this version? Remembering the derision than was heaped against Powell and Pressburger's marvellous \"Gone to Earth\" when it first appeared in the early 1950's but has now achieved deserved recognition, I put it that Carlo's Carlei's \"Romeo and Juliet\" is possibly a film before its time. Sadly I shall not be around in a few decade's time to say, \"I told you so.\"","user":"jandesimpson","rank":[23,30]},{"title":"A very misunderstood film.","rating":9,"date":"5 October 2016","review":"From time to time, a film director decides to adapt Shakespeare's plays. In all fairness, it's great stuff and deserves to be taken to the screen. However, when this happens, the people (particularly those whose mother tongue is English) don't like it and have great difficulty in understanding that, when a book is adapted to cinema, it has to be adapted or adjusted. Its a necessary job, and does not spare any book or author. It can be hard to accept, especially for the purists, who see Shakespeare as a kind of untouchable \"sacred cow\", but the truth is that cinema can be based on literature but its not literature. I say this because I realized that this film was the target of massive criticism for the way the book was adapted. The writers were so incompetent? They cut something important to the understanding of the story? They have profoundly altered it? No. But they sought to adapt the text a little, for dramatic purposes. The essential was there, untouched, and this does not shock me. This is cinema, not theater, and people have to understand that the public goes to the cinema to see a movie, not a recorded play. Do you want the original text, ipsis litteris? Read the book or go see the play. Cinema is concerned in keeping the story, not the text. Almost all movies are so, this is no different. Now let's talk about the movie.<br><br>The movie is interesting, keeps the essence of the original story, but changes the dialogues and interpretation, abandoning the artificial tone of Shakespearean theater and taking a more natural posture. The idea is good, its a breath of fresh air, but I think the posture adopted is too \"XX century\" and something is missing in the way the characters act that remind us the fifteenth century. One of the most reprehensible things is the amount of kisses and touches. This does not fit the historical period depicted, much more puritanical than ours. The actors did a decent job, engaged and committed to the story itself. Douglas Booth was by far the best Romeo I've seen in the movies, much more credible than Leo was in \"Romeo + Juliet\". Hailee Steinfeld was not bad either, but her acting has seemed a little forced in some scenes. Everything else is absolutely impeccable: the bright, colorful picture is magnificent, in harmonious combination with the great scenery and locations chosen for filming, and that depict faithfully what have been Verona during this time. The costumes also fit into the historical period and are exquisite. The soundtrack, discrete but present, fulfills her role with great skill.<br><br>Far from being a bad movie, this movie will never be understood by the public who are not able to see the difference between literature, theater and cinema. Despite some minor flaws, the film is well done and does not deserve at all, in my opinion, the severe criticism it has received.","user":"filipemanuelneto","rank":[23,31]}]