[{"title":"I went in hopeful and left feeling insulted.","rating":2,"date":"30 June 2013","review":"\"Now You See Me\" has a stellar cast, a fun and intriguing premise and themes (showdown of rival magicians combined with a heist), delightful smart-assery and cunning tactics -- especially in those scenes dominated by Jesse Eisenberg or Woody Harrelson. Oh, and it has quite dazzling action sequences. All the best parts of this film are well-packaged and sold in the gripping theatrical trailer.<br><br>I took someone I loved to \"Now You See Me\" and expected the payoff of a perfect night of entertainment.<br><br>I'm not impossible to please at the movies and I actively wanted this to be a good time. I went out for entertainment and leisure and in good company and high spirits, not at all for the purpose of writing a critical review.<br><br>What's more, I'm a big fan of all of the raw ingredients in this film. I enjoy magic and I could watch Morgan Freeman or Michael Caine in almost anything (now proved.) I fully enjoyed a much better film called \"The Prestige,\" which might be regarded by some as a predecessor.<br><br>But what happened here?<br><br>After several fun scenes and a promising opening sequence that made me want to care about the characters, I discovered a film in search of a plot and utterly lacking intellectual integrity and respect for the audience. The twists and reversals weren't just surprising, they were completely unbelievable. You didn't see it coming, but not because of skillful misdirection (the art of magicians, so often implied.) <br><br>Rather, you didn't see it coming because the explanations were crooked and cooked up and merely expedient.<br><br>Especially, by late in the film when they start tracking backward to earlier events to show you how you were fooled and what was really going on the whole time -- the explanations presented are less convincing than simply believing in real magic.<br><br>!!!Spoler Alert: Stop reading here if you would like to watch this movie without knowing anything about the late scenes, reveals, and reversals!!!<br><br>For example, the \"Four Horsemen\" stage the death of one of their own by perfectly orchestrating a high-speed traffic accident on a crowded bridge. It's imperative that the car he's apparently driving flips and tumbles several times and ultimately bursts into flames. <br><br>But it's equally imperative that the pursuing detective can retrieve a stack of papers from the wrecked car. He *must* be able to retrieve the papers but not the body, all while getting away with his own life, or else the plot begins to unravel. <br><br>The timing is of course worked out impeccably, and it's carried out with no other fatalities on the bridge. And somehow the magicians have stuffed a replacement body from the morgue into an identical car just before turning it into a time-bomb. <br><br>The audience knows, emotionally, that the Dave Franco character shouldn't really be dead (as I heard one person exclaim loudly during the closing sequence when \"Jack Wilder\" shows up again,) but the way his death is apparently faked would defy an unlimited budget and dozens of trained stunt drivers and coordinators -- unless, of course, you close the bridge to public traffic. Yet it's just one more miracle that the Horsemen carry out with aplomb, at a frenetic pace and on-the-fly, with less than half-a-dozen total team members, empowered by an unlimited budget and a mystery benefactor.<br><br>All the while, apparently real traffic zooms along with presumably untrained and unprepared public going about normal business.<br><br>We are expected to believe that the way Hollywood makes a high-speed accident occur without killing anybody can be done by a handful of highly motivated professional stage magicians (read: amateurs to road stunts) and somehow this can be accomplished without completely controlled surroundings.<br><br>This elaborately and improbably faked high-speed death scene is just one example of the film jumping into an explanation of \"how it really happened\" that seems less probable and less believable than *anything* you could have guessed before being told.<br><br>And the plot problems go much deeper than buying into death-defying scenes that require an elimination of anything random in a busy public space. I couldn't buy the ultimate reveal about the real identity and motives of the Mark Ruffalo character, either. It seemed incongruous. It felt like a cheat. The way he is planted in relation to earlier events seems like an afterthought. <br><br>And I couldn't buy that underneath his deliberate blundering and willful ignorance was someone not only much smarter than he appeared, but someone so capable of perfect planning as to be damned near omniscient.<br><br>The total impression is of a promising film idea that fell on its own very expensive sword. I don't know what happened, but it looks like it got battered and morphed around and rewritten by multiple teams of writers. The total feeling is that the story got killed and Frankensteined back together multiple times. And it looks like the final edit came after the director and all concerned were out of steam and over budget. <br><br>I felt intellectually raped, to put it bluntly. I felt like the director was content to dazzle us with action and effects and to take our money while demanding our total credulity on the plot points, using the angle provided by magic in a rather disingenuous way.<br><br>This, instead of providing a coherent narrative that would allow an adult audience to cheerfully maintain a willing suspension of disbelief. <br><br>The storyline turns into a madhouse of improbabilities and then rationalizes its real business like a pathological liar. What a travesty to the promising themes of magic and old rivalries, treated so well in other recent films. And what a waste of a beautiful all-star cast, so entertaining as individuals in the early scenes.","user":"markvanderpool","rank":[448,609]},{"title":"The greatest trick ever pulled is to make anyone believe this film has a coherent story.","rating":3,"date":"24 August 2013","review":"I believe the target audience (and maybe even the writer) are all 14 year old boys who think magicians can do anything they want. I love a good sci-fi setting and I can accept some really fringe premises if the movie exploit them in a good way. This movie just relies on the audience swallowing everything and never questioning anything. If you start to pull any of the many loose ends it all falls apart faster than you can say bullshit.<br><br>I wanted to write this whitout spoilers, but the plot has given me a itch I can not scratch.<br><br>First, they stole 140 million by knowing the guys first pets name!?? Do they suggest the bank secure their assets with a simple password recovery scheme like that? I don't begin to understand. Are they seriuous? Why didn't they just say they hypnoticed him into withdrawing the money. Even thow that is not possible it is far more believable. This is maybe the most unbeliveble way to explain a heist I ever heard of. <br><br>There is not a singel interesting or plausible event in the whole film. Everything is just random. The fbi guy, did he base his whole career on this single moment? That is determenation and planning out of this world. But, I guess its a whole lot easier to say its just distraction and magic that did it all. <br><br>I would say that convincing people to pay for this crap is a far greater con than any of the ones presented in the movie.<br><br>I have seen allot of bad movies but they all have something if find interesting or good in them. Except this one. I cant find any thing positive to say. Stay clear.","user":"svenhaadem","rank":[218,298]},{"title":"Watchable but lacks depth & substance","rating":6,"date":"7 June 2013","review":"This is one of those movies that is somewhat entertaining upon first viewing but is easily forgettable and has nothing of substance to make a second viewing possible to enjoy. The plot is convoluted as we don't know what the main characters are doing or why. In fact, everything we know about the 4 magicians is revealed in the first 10 minutes of the movie and after that there is ZERO character development! The entire movie appears to have been made solely for the sake of the ending and yet it was so cliché that I was actually a little angry about the way they did it. It's unfortunate that in the filmmaker's attempts to be clever they neglected the most fundamental elements of storytelling: plot and character.<br><br>Like a magic show without magic, you may find yourself somewhat entertained but inevitably wind up disappointed in the end because they left out the most important part of the show.","user":"pinkled5","rank":[665,999]}]