[{"title":"Clean, Fun Family Film","rating":10,"date":"18 August 2014","review":"Ace Wonder is a great movie for family night! This fun film has it all, action, humor, lovable characters, and a great mystery. This is one film you'll want to watch again and again with the whole family.<br><br>Ace Wonder is a boy detective, a Sherlock Holmes wannabe, but he has a hard time coming up with a \"truly brilliant mystery.\" When his family's RV breaks down in a Podunk town, he stumbles upon a mystery involving messages from a dead man.<br><br>Derek is heartbroken upon his grandfathers death, regretful that he was unable to spend more time with him. When a mysterious message addressed to Derek appears at the funeral, he has to follow the clues. But it seems they all lead to only dead ends. What Derek needs is help, help from an expert detective. What he needs is Ace Wonder.<br><br>This is an adventure the whole family is sure to love. It's Sherlock Holmes and Indiana Jones wrapped up in a cute little kid.","user":"daughterofzion31","rank":[10,16]},{"title":"Family fun has a double meaning here","rating":9,"date":"15 September 2018","review":"I love this movie. It has a good story line. It moved at a good pace, and kept my attention. The plot was well-woven. The use of the graphic novel sub-theme was very appealing. it's really a great movie for the whole family to watch together. And it's amazingly well-done for what seems to be a private venture. I did not know that many of the main characters were not professional actors until doing some research. I tried to find out more, without much success, but the Moore family are in the film using their real names, and were involved in the production and other aspects. What ever became of Gator Moore? I hope they read this, and would consider making more films like this one.<br><br>I disagree with the negative reviews, and highly recommend this movie as good clean family fun. There aren't many films that I can say that about in recent years.<br><br>I did not give it a ten, because I reserve that honor to only a select few, but this film came very close in my opinion.","user":"agsconsulting2874","rank":[2,2]},{"title":"True detective","rating":10,"date":"19 August 2014","review":"Every young and young at heart adventurer should see this film over and over again, Ace Wonder is on his way to becoming the next big Sherlock Holmes. This film has a Dove Foundation approval making it enjoyable for the entire family to watch, a plus for those of us who like good clean movies. This flick has every emotion one could have and a plot to keep you hanging on. Gator and Derek play great leads and hold the movie together. John Moore has proved once again what a great and wonderful talent he has, kudos John. Keep up the excellent work and we all look forward to your next big hit, hopefully we see more of the Great Detective - Ace Wonder.","user":"nightowlsvideo","rank":[9,19]}]