[{"title":"how can a filmmaker not get the selling point of his own movies?","rating":3,"date":"9 January 2011","review":"Pretty much everything I have to say is already out there in different reviews, but I'm going to say it anyway. The acting is bad, the dialogue atrocious and the storyline confusing. This I wouldn't care for, if they hadn't spent so much bloody time on it. I expected to see Tony Jaa kick ass, but as many of you pointed out, there's almost none of that as well. Especially the final fight is very disappointing and if you've watched the previous Tony Jaa movies you know all his moves by now. While I appreciate the effort to make a \"real\" film instead of an action flick, it was done horribly as the cinematics are awful: numerous completely pointless close-ups and weak special effects make it look like a college project at times. Special mention goes to the Comic relief character; never have worse humorous attempts been put to film.","user":"user-876-703104","rank":[18,21]},{"title":"Boring, Messy and Unnecessary Sequel","rating":3,"date":"23 March 2011","review":"The cursed Lord Rajasena orders his warriors to beat up on and break the bones of Tien (Tony Jaa). When Tien is ready to be decapitated, a messenger from King Ayothaya arrives bringing a pardon and Tien is released and transported almost dead to Kana Khone village. Master Bua heals Tien and teaches meditation to help him to resolve the issues of his Karma. While Tien recovers, the evil Bhuti Sangkha defeats Rajasena's soldiers and beheads the king to take his power and treasure. Bhuti self-proclaims king, initiating a kingdom of cruelties. When Tien returns to Kana Khone, he finds the village destroyed and the villagers abducted. Now Tien has to fight against a powerful enemy to release his friends and stop the kingdom of fear of Bhuti Sangkha.<br><br>\"Ong Bak 3\" is a boring, messy and unnecessary sequel of \"Ong Bak 2\". The plot is confused, brutal and more dramatic but shallow, disappointing fans of the action of the previous two films. The slow- paced story presents fights too long and excessively violent and it is really time to stop this franchise. My vote is three. <br><br>Title (Brazil): \"Ong Bak 3\"","user":"claudio_carvalho","rank":[25,39]},{"title":"Disappointing","rating":4,"date":"22 August 2010","review":"Well, picking up where part 2 left you hanging, the 3rd installment of the \"Ong Bak\" movies was somewhat of a disappointment. Why? Well...<br><br>The storyline was almost non-existent, and whatever story was being told there was told in a really confusing and weird way, so it was difficult to make any sense of the movie.<br><br>It seemed like this was a showcase of how cool can we make Tony Jaa look? Let's put him in front of all these wonderful, beautiful scenic locations and have him work out his martial arts there. That was what most of the movie was about. Sure, the scenes were nice, and sure Tony Jaa sure knows how to fight and show it, but it is a very weak broth to make soup of.<br><br>The action and fight scenes were top of the line, as always with Tony Jaa movies. And there is something very dynamic and energetic to his movements and fighting style. So, if you like that, then this movie doesn't let you down in that department.<br><br>As for the acting? Well, not much of that actually going on here, to be honest. It is mostly just showing off Tony Jaa and have these really cool images of ancient Thai traditions shown off on the movie. Honestly, I liked seeing those cultural scenes, but again, not really something that can carry a movie.<br><br>I think \"Ong Bak 3\" is pretty much as weak as the 2nd part, except the story in this one is more confusing. They should have stopped after the original \"Ong Bak\" movie which was a blast of an action movie.<br><br>I was disappointed with this movie, and I was actually just sitting through it at the end to watch Tony Jaa fight and show what he can do. The movie lost me somewhere in the beginning already, because it was way too confusing and didn't really come together in a greater sense. Lots of action, but that is about it that this movie has to offer. Which is a shame.","user":"paul_haakonsen","rank":[26,41]}]