[{"title":"Its not too bad","rating":6,"date":"20 February 2011","review":"Hardly a 1 out of 10 so I'm not sure where the other guys are coming from. I would be interested in seeing what they think is a 7 or 8 rating for a movie. There are definitely plenty of other movies out there that are worse. SWAT is more like a glorified TV movie than a big budget Bruce Willis movie blockbuster.<br><br>Its worth watching if you like your cop/hostage movies. Its kind of like the new Hawaii five O TV series turned into a movie. Judge for yourself but don't let the 1 and 2 ratings above throw you out. I'd expect it to end up around the 5 or 6 mark once the figures balance out. I thought the guys and gals did a good job in it.","user":"heffmacher_2000","rank":[30,41]},{"title":"Worth a watch, but nothing more","rating":6,"date":"20 February 2011","review":"This movie I will describe like a coin - it has two sides. <br><br>The first side is the acting - on the contrary from most of the other reviewers, I found the acting very good. The characters are believable and the actors seem suited for their respective roles. I must admit that I watched this movie mainly because of the actors. I'm a big fan of Robert Patrick, hold respect for Gabriel Macht and it was nice to see Kristana Loken even in a minor role, which she played in style. The strong side of this movie are the actors and the characters - I like movies, that make me sympathize with characters, one way or another, in a positive or negative note. If you evaluate the actors' performance based on the first SWAT movie with Collin Farrel and Samuel Jackson, you might be a little disappointed, but if you watch it as a stand-alone, you might like it. <br><br>Now for the things I didn't like. The flip-side of this coin maybe some of you won't describe as something bad, but I personally am getting a little tired of a trend in recent action movies - sloppy endings. Some may say \"this is an action movie, just watch the action and don't think too much for the ending!\" But I like endings that make me smile and think to myself \"yes, that was good!\". In this particular movie, the ending is not only sloppy, but it just one more word - short. I fully agree with some other reviews that point out that maybe due to time restrictions the movie was cut short, but unfortunately the part that suffers the most is the ending. There are a few scenes throughout the movie that are just seen so many times and maybe if they were cut in order to add up a few minutes to the ending, the movie would have been better. <br><br>One other thing is the pace. The story unfolds pretty quickly, but the actual pace of the on-screen events is a little slow. Not that I find the latter as a flaw, but it kind of builds your thrill, I personally was expecting a grand finale that would blow me away. I like it very much when the good and the bad guy talk to each other, before the final showdown. Like De Niro and Pacino in \"Heat\". Maybe I'm too much of a yin-yang person, but I just would like to see something more of a clash of the titans endings in movies (literally, not like the movie by the same name). It doesn't matter if it is a happy ending or not, the thing that matters is HOW it is presented to us viewers. It may sound a little harsh, but I really felt robbed by this ending. <br><br>And something else - I really feel Robert Patrick's character (he is the bad guy) was presented too shallow. He has too little screen time to convince the audience he really is the bad guy, which is a big flaw of the script in my opinion. Patrick is a very, very, very underrated actor, especially when he plays bad guys and this movie does't utilize his talent whatsoever. <br><br>Don't get me wrong, this movie is worth a watch, if you like that genre (police, SWAT team action movies, hostages, tactics), you will enjoy it. But it just isn't something you will remember. If you're looking for something unusual, something that spans out of the box, of the cliché, you may be a little disappointed like I was. This is just an ordinary movie. It could have been great movie, but in my humble opinion it isn't. <br><br>6/10 - because good acting is never enough to save a poor story or a poor movie as a whole.","user":"moonweaver-982-670569","rank":[23,32]},{"title":"Best quote ever:","rating":2,"date":"20 February 2011","review":"I think this movie is worth a '2'. It's start is already very cliché and American. Macho and only pretty people are playing in this movie. It's overall too slick. You find the best quote even heard in a movie: \" She died for your sins, now you die for yours..\" Huh? Who made that up!? It's the confirmation of what we already knew, five minutes after the movie started, this is a bad written script and a bad story-line. It's also really unrealistic how the relationship of the main character unfolds Acting isn't great too, but that's OK. To come to the conclusion: It's a really an all-American-macho-movie. I suggest you don't see this movie, it's a waste of your time. There are plenty of movies way better than this one.","user":"barryjkoster","rank":[35,59]}]