[{"title":"Excellent","rating":10,"date":"22 December 2013","review":"First when the movie started, I was like...Okay well, it's not the kind of movie I'm used to watch but anyway, there was Saoirse Ronan in it and I've never seen a movie with her by the past so anyway just let's keep watching. I watch and when action starts, at the very beginning of the movie, I'm laughing, I think it's the weirdest thing I've seen since a long time but something catches me...Something tells me \" just watch it \". And this part of me was right. The movie is excellent! More the story goes and more you love it. It's crazy but Violet and Daisy is the only movie of its kind. It surprises you because of many weird scenes and epic quotes (no spoilers here) and the ton of the film... I don't know - there is really something in that movie. I am serious when I say these words : it's a must watch. For me, it was the first time that I was watching a movie like that and well I don't regret it. I think that it's now in my top 10. So if you don't know what to think about this film or anything, don't mind, just watch it. You have to. It's a really great film. So I give it 10 stars because it's a pure surprise and seriously, I've never seen anything like that. <br><br>PS: just don't watch trailers for this movie (it's my advice) because I just found it here, without knowing what it was and I watched it - that way you really keep the surprise a surprise.","user":"alain-leccia","rank":[33,46]},{"title":"An Interesting Character Piece - With Guns","rating":8,"date":"19 September 2011","review":"Violet &amp; Daisy comes from the most unlikely of sources. Geoffrey  Fletcher, the Academy Award winner for Best Screenplay for Precious:  Based on the Novel \"Push\" by Sapphire directs this violent yet touching  film starring Saoirse Ronan, Alexis Bledel and James Gondolfini.  Violet &amp; Daisy opens with a bang. Literally. Violet (Bledel) and Daisy  (Ronan) are dressed as two nuns and Violet is telling a joke as the two  make their way to an apartment door where Violet &amp; Daisy then unleash a  hail of bullets that startled our fully unseated audience while leaving  multiple men dead in a hotel lobby.  The scene definitely captures your attention and due to the amount of  bullets that it takes to bring down each of the men shooting back one  can easily be forgiven if you thought the movie was some kind of  comical or supernatural film where there is hardly enough bullets to  bring down a single encroacher.  But then the film takes us in a different direction. We watch these two  young girls (Daisy just celebrated her 18th birthday) as they jump  around on their bed, play patty cakes and lust over a dress in the  Barbie Sunday fashion line (Barbie is some kind of fictional recording  artist).  Needed money to buy the dresses they found in a magazine, the two hit  girls take a job from Russ (Danny Trejo) to kill a man who has stolen  from their boss. The two girls set out on the contract dressed as  painters, but when they arrive at the target's apartment, he is no  where to be found. The two girls then take a nap on the couch when  Michael (James Gandolfini) appears and puts a blanket over the two  snoozing killers.  When they awake, they are confused as to why Michael would show them  kindness when they have been contracted to kill him. This confusion,  and with a break for milk and cookies, will be the center of the film  as the two girls (particularly Daisy) develop a relationship with the  man and cannot bring themselves to complete the contract.  Michael is a willing participant in the killing. He does not fear death  and is estranged from his daughter. Michael then stole from two  different crime bosses in hopes that the monies would be given to his  only kin.  This will then unravel a story where each of the three main characters  will dig deep into their own emotions and backgrounds to reveal the  persons they have been repressing. And as the girls struggle with their  lack of bullets to complete the job and with another rival gang en  route to kill Michael, Fletcher unleashes an interesting character  study that is as awkward as it is rewarding.  Violet &amp; Daisy could not have been better cast. Bledel and Ronan look  like a young Zooey Deschanel and Lindsey Lohan and interact with each  other with a believable innocence. Gandolfini has never been better on  film. He commands a presence even while just rolling his eyes and  sitting on his favorite chair, but he is perfectly cast as the  determined Michael.  The depiction of adolescence with the injection of moments of deafening  gunplay lead to an uneven balance. Although we appreciated the film, we  had trouble understanding to whom exactly the target audience would be  for the film upon its release. It is too violent to be marketed to the  younger crowd. And it has too many comic book type elements to appeal  to an older demographic that might have a hard time understanding how  and why so many genres intertwine throughout the story.  We ourselves loved the film. We were able to extract the humour and the  violence separately and enjoyed the overall story. The two leads were  innocently conflicted and their views and impressions on life and their  past were engrossing tales that connected audiences with their  characters. The ending to Violet &amp; Daisy may surprise, but it was the  only logical development in a story that was too deep not to travel to  darker ground. Violet &amp; Daisy might not be the film that everyone wants  it to be, expects it to be or maybe even should be, but it was an  enjoyable hit man comedy that can take its place amongst the In Bruges  of the film world.","user":"gregsrants","rank":[38,59]},{"title":"A visionary film unafraid to take chances","rating":10,"date":"28 November 2011","review":"Violet &amp; Daisy is a bold and compelling new film written and directed by the Oscar-winning screenwriter of Precious, Geoffrey Fletcher. The film is violent and funny but also has an emotional core that is unflinchingly true. The heroines of the film are wonderfully played by Saoirse Ronan and Alexis Bledel. Ronan brings her amazing skills as an actress and creates one of her most original and fully realized roles in the part of Daisy. Bledel brings her signature sense of humor but also unleashes her vicious side in a way that no one has ever seen before. The chemistry between the two stars is undeniable and from the first frame we are rooting for these two lost girls and their friendship. That Fletcher not only cast these two actors but also made us fall in love with them is a testament not only to the script but his skills as a director.<br><br>The dialogue in the film is witty, whimsical and complex, reminiscent of the banter from classics of the Hollywood Golden Age such as His Girl Friday combined with the existential questioning of a Godard film. The movie is packed with twists and turns, jokes and pathos and I know that I did not get everything on the first viewing. The film is visually stunning with intricately structured shots, long takes and juxtapositions, but every shot serves the film and creates a satisfying whole. Anyone paying attention will see that Fletcher possesses a new voice that is not afraid to take chances and those who watch and listen carefully will be rewarded with a movie experience that will go far beyond an initial viewing.","user":"iyoung1987","rank":[80,136]}]