[{"title":"Way better then the ratings it gets.","rating":8,"date":"20 July 2015","review":"After reading the reviews here I was not expecting much with Cut Bank. But at the end of the movie I have to admit that I truly enjoyed this movie. I first was a little bit annoyed by the \"parcel\" at the end but the next day I suddenly figured it out and then I was even more satisfied with this movie. The stars in this movie are Michael Stuhlbarg, Billy Bob Thorton and John Malkovic. Liam Hemsworth was okay but he shouldn't have had the major role. The other actors were all good as well and made this movie better then the reviews want you to believe. It all starts slowly, but the more you get in the story the better it gets. I saw better movies for sure but I saw also a load of worse movies then Cut Bank. Certainly worth a watch.","user":"deloudelouvain","rank":[42,46]},{"title":"An engaging noir film in the tradition of the Coen brothers","rating":8,"date":"27 May 2015","review":"\"Cut Bank\" is a moody noir mystery/thriller that deserves much better reviews than the middling critiques it has received. It is evocative of Coen brothers films like \"Fargo,\" \"Blood Simple\" and \"The Ladykillers,\" but manages to be original and unpredictable. Performances by the top-notch cast are low-key, but credible. The atmosphere is suitably dreary, desolate and depressing. Technical aspects are adequate, if not inspired. <br><br>The denouement is emotionally satisfying if one puts ones brain on hold and ignores everything one knows about forensic science. The film offers a flimsy rationale based on the small town setting, but it still tests the limits of the audience's willful suspension of disbelief. However, other events are well-grounded. The motives and capabilities of the villain are a bit over the top, but not so much as to distract. <br><br>Overall it is an engaging and original noir film with excellent performances by a talented cast.","user":"ginocox-206-336968","rank":[34,39]},{"title":"Neat Small Movie","rating":7,"date":"17 April 2015","review":"I thought this reminded me a bit of Fargo but my more observant companion correctly and more accurately though it was a bit of a tribute to Blood Simple. If the movie had a weakness it was that Liam Hemsworth seemed a bit flat or lost compared to the others. The story was good, few puzzles still remain unexplained regarding the background of Derby Milton, the character whose singular unravels the plans of the main character and unleashes chaos. The women all play peripheral roles and more or less stand around and look worried.<br><br>The story felt fresh and although there was a resolution of sorts it was not too cliché.","user":"ptlcan-18906","rank":[20,23]}]