[{"title":"Tears streamed down my cheeks","rating":10,"date":"6 December 2019","review":"This is a wonderful and haunting film. It tells the story of two boys who grow up together. They are brothers through circumstances: the violinist child prodigy from the Warsaw Jewish community and the London lad who eventually befriends him when they are brought together. The story revolves around the sudden disappearance, on the day of his virtuoso concert, of the prodigy. Only near the end of the film do we discover why.<br><br>The film brilliantly deals with multiple layers and flashbacks, with perfect pacing and quite outstanding acting. The musical score is phenomenal.<br><br>This is a film about tragedy and loss, about how trauma lives on. It perfectly weaves the themes of ethnicity and religion.<br><br>It's a superb, haunting, film which I have not done justice here. In part that's because I don't want to do a review with spoilers. You have to go and see this film and allow your soul to be transported by the wonderful cinematography, script and musical score.<br><br>They don't make films as beautiful and brilliant as this very often. Go see it.","user":"Drabble500","rank":[30,39]},{"title":"Good to hear classical music in a film for a change","rating":7,"date":"7 January 2020","review":"Yes, this is a wonderful and memorable film. The director, Francois Girard, and, I suspect, the same Canadian production company were involved in the 1998 RED VIOLIN. Like that film it takes place over multiple time periods, in this film clearly stated to be 1951, 1986, and the earliest, unidentified time which can be inferred to be sometime between March and September 1939. The scene shifts back and forth a good deal and some critics found this confusing and destructive of continuity but I found no difficulty in following the story line. Memory is not linear and orderly but rather fragmented and out of sequence, particularly when dealing with highly charged emotionally traumatic experiences. This is an exceptionally intelligent screenplay where not everything has to be spelled out. It's true that a key plot point mystery is fairly predictable. Yet the story builds to a wrenching climax in a way you don't see every day in the movies.\nTim Roth plays well against type as a quiet, introspective Brit. The score composer, Howard Shore, was involved in composing the impressive music in the Lord of the Rings and does an award-deserving job here. I rate the film at 3.5/4 stars. Strongly recommended for everybody, especially any serious music student as well as anyone of Jewish background, particularly of GenX through to Millennials.","user":"drf9920","rank":[13,17]},{"title":"Hauntingly Beautiful - with a Shocking Finale!!!","rating":8,"date":"15 September 2019","review":"\"The Song of Names\", directed by the wonderful François Girard, surpassed all of my expectations! The story is about the relationship two \"brothers\", and how that relationship changes over the years as the mystery unfolds. The score, by the great Howard Shore, expertly showcases the film's haunting, mysterious tone. Acting, directing and cinematography, to name a few, were all brilliant. Certainly worth a watch, even if just for the magnificent violin solos! The film catches your attention from the very first scene and leaves you wanting more after the shocking finale. I would recommend this film to musicians, as well as anyone who loves a good character-based mystery!","user":"lizarmstrong-60293","rank":[20,30]}]