[{"title":"Psychos, torture, fish and diamonds...","rating":7,"date":"22 July 2013","review":"Well, appearances can be deceiving and I must say that I initially didn't have much expectations to this movie given the poster and DVD cover for this movie. But still, I decided to give it a go, and I am glad that I did, because this movie took me by surprise.<br><br>The movie turned out to be a really interesting movie with a very well-told story. However, I will point out that albeit the story is compelling and the movie is interesting, this is the type of movie that you watch once and never again because it just doesn't have enough to offer for a second watching. That being said, I am not saying that \"Sushi Girl\" is a bad movie, far from it.<br><br>The story is a tale of revenge and betrayal, where the audience is left in the dark trying to grasp out what is going on, and the movie tends to take turns here and there, and those turn are for a better twist and a more gory twist. So if you enjoy blood and torture, stick around for the movie.<br><br>Now what really surprised me was the people they had assembled for the cast. The main cast was really nice and they did good jobs with their given roles, and there were some great appearances in the movie as cameos as well. All together a very good ensemble of actors on the billing list. Personally, it was great for me to see Mark Hamill in this role, after having seen him flunk out with the last couple of recent movies. And seeing him in this particular pseudo-psychotic role was just brilliant. But also hats off to Tony Todd for his usual gloomy, charismatic performance. Noah Hathaway and Andy Mackenzie also did really great jobs. And for the cameo appearances you have Jeff Fahey, Michael Biehn and Danny Trejo. Of these latter three, Michael Biehn's role was just off the rails, it was awesome.<br><br>\"Sushi Girl\" is a heist movie gone bad, and it was great from the very beginning to the very end - despite it being a single shot movie (in the terms that you watch it once and never again).<br><br>I can highly recommend \"Sushi Girl\" if you want to be entertained for about an hour and a half. Just be warned that there is some torture scenes that can be quite graphic to watch for those faint of heart.","user":"paul_haakonsen","rank":[12,13]},{"title":"Come sashimi sometime","rating":7,"date":"1 July 2013","review":"It's what I would call a high-concept movie on a silly premise. You have a handful of criminals talking and eating sushi placed all over a beautiful naked woman in the back room of an abandoned Asian restaurant. Of course, not all of them are there by choice, so secrets and double crosses are to be expected. I found the movie engrossing despite its limited setting. It didn't feel claustrophobic, but it was conducive to tension. This closed room dramatic suspense was offset by flashbacks to a heist gone wrong 6 years ago. The way it was filmed and edited didn't make it feel boring or like a play either. The torture scenes seemed particularly brutal and effective to me, and I consider myself a jaded viewer. Praise to the person who did one particular makeup involving a face. I enjoyed the different personalities of the 5 main characters and their more or less revealed pasts.<br><br>Most people praised Mark Hamill's acting (Luke Skywalker), but I found him an annoying, affected gay caricature, until later on where he channelled his inner Joker and became more sinister. Your own appreciation might vary. On the other hand, Tony Todd's(Candyman) was impressive and he just emanated quiet foreboding menace. When he talks about his past to the guy tied up, he's just so good, it's like he brings himself to tears by himself. The sushi girl herself is basically a pretty accessory except for the start and ending where some acting chops are shown. I liked the story and I liked the twists that I didn't see coming. It has a definite Tarantino vibe back when he was better.<br><br>Rating: 7 out of 10 (very good)","user":"Quebec_Dragon","rank":[12,14]},{"title":"story-driven gore is under-appreciated.","rating":10,"date":"20 September 2012","review":"HOOK: members from a diamond heist gone wrong six years ago gather for a celebration dinner where sushi is served on the body of a naked woman.<br><br>LINE: presumably one would watch this based on the premise alone (what do you mean it's sushi served on a naked woman?!). ten seconds in and my mind's been taken over by the lush visuals and crazy performances. Fish (played by noah hathaway) has just been let out of a six-year prison sentence -- waiting for him in the prison parking lot is a guy twice his size, with an invitation he cannot refuse. Duke (tony todd) is the heist ringleader who's dinner invite to celebrate Fish's prison release is accepted by Crow (mark hamill), Francis (james duval), and Max (andy mackenzie). all four men are convinced Fish hid the diamonds from the botched heist and seize the opportunity to force a confession. a dinner with your four ex-con buddies in a remote restaurant on a dark, rainy night? guaranteed pee-in-your-pants freak-out, no matter how beautifully naked your dinner is served. two-thirds of the film is lavished on the dinner -- each delicious, nail biting, gum chewing moment of it. every second is punctuated by in-your-face dialogue -- mark hamill's Crow (the perfect unhinged jester) in particular gets quite a few memorable one- liners. when Crow is not making withering observations, Max is busy breaking apart the room and the people in it. Francis is the cowering conscience of the audience while Duke's even, measured menace casts the shadows overall. and you, the audience? you get to watch Fish suffer through literal torture. crazy, intense, holy-crap-they-did-not-just-do- that torture. and all the while, the sushi girl is laying on the table. not making a peep admist the cursing, the gushing blood. what in all hells is going on around here!?<br><br>SINKER: now here's the thing -- it'd be easy to dismiss sushi girl as a b-grade gore fest. which is the laziest of all lazy conclusions. the first ten minutes tell you otherwise, from the sushi girl's reaction to Duke to Fish's anguish over his son not recognizing his voice. while the film happily (gleefully) takes you to those moments where it wallows in torture pr0n, there is quite a revenge story lurking beneath all the flashy talk and flying bullets. a twist ending worthy of many repeated viewings. a movie can be pretty (which sushi girl most definitely is) but without a good story supported by convincing performances, it cannot be memorable. the cast of sushi girl gave all that and bag a chips to bring to life extreme characters that, at turns, make you laugh and then scare the bejesus of you. the film rides on these highs until it slams you with a climax that turns the roller coaster on its head -- where you're left savoring the bittersweet emotions that only the best revenge stories can evoke. i wax fancy verbage but i do not lie. sushi girl is the kind of film that everyone will reference in the future -- or at the very least try their damnedest to imitate and post to you-tube.","user":"redbean-2","rank":[40,58]}]