[{"title":"Another solid effort from DC animation studios","rating":8,"date":"30 September 2010","review":"\"Superman/Batman Apocalypse\" is yet another winner from DC Animation. Good story, great chemistry between all the characters, lots of action/fights &amp; pretty good animation. The story takes place after the events of the excellent \"Superman/Batman: Public Enemies\". I wish I could go into specifics on how S/B Apocalypse starts out but it would give away the ending of S/B PE. A meteor crashes in Gotham Harbor &amp; of course Bats checks it out. It is a ship with strange writings on it. After many awesome mishaps, it is discovered that the lone occupant of said spacecraft is none other than Superman's cousin from Krypton who is confused, scared &amp; highly destructive. Superman of course wants to give her a chance, Batman doesn't trust her &amp; smells trouble. Now before any of you here start to think \" Oh great, a Barbie movie with Supergirl\" let me reassure you, it's definitely not. She's never even referred to once as \"Supergirl\" during the course of the film. Wonder Woman, Darkseid &amp; yes, even Doomsday make significant appearances in the film (especially Darkseid who has his own evil designs for the cousin of Superman). Overall: a 8/10 &amp; one definitely worth checking out even for casual fans.","user":"BloodStone","rank":[18,21]},{"title":"A great experience","rating":9,"date":"10 October 2010","review":"As an avid reader of comics, I have a huge respect for the brilliant author Jack Kirby (1917-1994), whose work for Marvel produced some of the most memorable characters and stories from sequential art.However, even though it may sound heretic, I do not feel the same love for the complex mythologies Kirby created to DC Comics.I honestly never swallowed the stories about the \"New Gods\", because I found the characters not to be very well developed, not to mention that the stories were confusing.So, I started watching Superman/Batman: Apocalypse with some mistrust, because big part of the graphic novel it is inspired on (a compilation of the title Superman/Batman) has some similarities with the work Kirby made to DC Comics.To my surprise, screenwriter Tab Murphy made an excellent work at tuning the narrative and compressing the action in order to bring a dynamic, tremendously entertaining and even deep film experience.<br><br>The main target from Superman/Batman: Apocalypse are the comic readers, so it does not loose any time at establishing the origins of every characters, or explaining the relationships between them.So, I understand why the casual spectators may have difficulties at \"plunging\" into the movie.<br><br>Personally, I hugely enjoyed Superman/Batman: Apocalypse and I think that, with the exception of Justice League: The New Frontier, it is the movie from DC Comics I have mist enjoyed.Besides of the screenplay, the characters and the awesome action scenes, it was also a pleasure for me to hear the classic voices from Superman and Batman (in other words, the ones which were used in their respective animated series), as well as the solid contributions from Susan Eisenberg as Wonder Woman, Andre Braugher as Darkseid and Summer Glau as Kara Zor-El.<br><br>The only fail I found on this movie is that some details from the screenplay could have been better polished.But despite of that, Superman/Batman: Apocalypse is a great movie I enthusiastically recommend with the previous warning that the lack of context and explanations may make it a bit difficult to be assimilated by casual spectators.","user":"Argemaluco","rank":[22,28]},{"title":"A truly amazing movie (especially for casual fans)","rating":10,"date":"14 September 2010","review":"I am not a comic book fan. I have enjoyed watching series like the Justice League and of course the other animated movies but I have never bothered with comics. This perhaps one of the reason why for me this movie is the best animated one till now<br><br>The previous movies(except maybe for the Wonder Women one which I also found quite interesting albeit not as alluring as this one) shot your right into the middle of the action and frankly a lot of the movies focused on the near worship of Superman and Batman. Don't get me wrong the characters are good but maybe because I am not a comic book fan they get boring fast. I was really starved for some new material. Seeing another hero rise up<br><br>And this movie delvers it. We follow the journey of Kara aka Supergirl (voiced excellently by the amazing Summer Glau )from her landing to Earth to the point where finds herself and her place in life. The story is great and the action well placed. And while the story centers around Supergirl we also get to see Superman,Batman and Wonder Woman shine on their own. They compliment the story excellently.<br><br>Not to forget that while the story itself is truly great the action doesn't leave you wanting either. They are some great fight scenes each perfectly showing the abilities and strength of the characters. <br><br>Overall I would highly recommend this movie to everybody and I really hope we get to see another movie centered around Supergirl. She is a character with a lot of potential","user":"levitak","rank":[42,64]}]