[{"title":"Gives us more than the usual zombie film does.","rating":7,"date":"17 June 2012","review":"In the last year I've seen around a dozen or so Zombie films &amp; if was to compare this one to them it would probably land in 3rd place. In the beginning it was a little rough, it gave us a quick take on what the situation was for the lead character Elvis, all zombie films usually struggle in the beginning as to why &amp; how he is almost the lone survivor so I can't fault it for that. As the film progressed it started to focus on the characters more than the zombie outbreak, it reminded me of the Walking Dead series on AMC. It was nice for a change to have some character development in a film like this. You will have to be a bit forgiving as to the cheap make-up &amp; effects for the zombies as they were pretty underdone but the low budget didn't cripple it much at all. About an hour in is where this film started to pay off, giving us a dark turn of events that brings upon an urgency to act for the leads &amp; the action starts to ramp up along with the zombie population. Some people might want to turn it off early but I promise you that if you hang in there it will deliver you a solid effort and a decent ending for all zombie genre fans alike. It wasn't a bad way to kill 90 minutes.","user":"Thrill_KillZ","rank":[46,58]},{"title":"Middle of the Road Zombie Flick","rating":5,"date":"17 June 2012","review":"I sat and watched this with my wife this morning. I am a Zombie fan she isn't, so with some of the rubbish in this genre we did not hold out much hope! The positive thing is that we watched it to the end, with quite a few other zombie flicks we have not managed to do this. It is not a great movie but not terrible. The acting is fine, again not great, the storyline is very predictable. A goes into slot A, B into slot B. We knew everything that would happen from start to finish with no surprises whatsoever and we did not get anything wrong, Oh and we are not Mensa students! The camera work and settings were excellent for the budget and they used the location to the full. So is it worth watching? If there is nothing else on fine, We voted it a 5 out of 10, in reality we would have gave it 4.5 for the reasonable work they done. The reason we could not vote it higher was it was so predictable...","user":"brian-2196","rank":[48,63]},{"title":"A zombie movie with...wait for it...a brain!","rating":8,"date":"2 July 2012","review":"A lot of thought went into the script, and from the looks of it, a lot of love went into the production and performances of this way better than average zombie chiller. Suffice it to say that the story packs some real surprises, previously unexplored within the genre. The locations look sufficiently post-apocalyptic, and the humans appear to be honestly at the end of their proverbial rope. And that's a smart idea. Too many movies like this have a bunch of well-fed, good-looking actor armed to the teeth with seemingly endless supplies of ammo and enthusiasm. Dead Season does not disappoint. On the contrary, it serves up good scares, a good story and some good gore make for an nail-biting thought-provoking good time.","user":"stevek4511","rank":[27,35]}]