[{"title":"Breaking news- Flawed justice system n ineffective police turns a freight-hopper into a vigilante.","rating":7,"date":"4 February 2020","review":"I first saw this in 2011 on a dvd which I own. Revisited it recently.\nThe film is about a freight-hopper (Rutger Hauer) who arrives in a town filled with criminals, corrupt policemen n hopeless fellas. After witnessing brutal crimes, ineffective police n undergoing torture, our hobo takes a shot gun n starts delivering justice one shell at a time.<br><br>This film has two similarities with Charles Bronson's character. In Hard Times, Charles Bronson's character as a hobo arrives in a new town. In Deathwish series, Bronson's character is a vigilante.\nThe film is very violent, entertainingn hilarious.\nIt gets a 7 instead of 8 for being a bit blasphemous.","user":"Fella_shibby","rank":[26,26]},{"title":"The BEST grindhouse film. PERIOD.","rating":8,"date":"1 April 2011","review":"***1/2 out of (****)<br><br>Eisener's exploitative 80's grindhouse throwback, \"Hobo with a Shotgun\", showcasing its brutality shamelessly, is easily the best grindhouse film to ever grace the silver screen. \"Grindhouse\", \"Machete\", and \"Drive Angry 3D\" are all strong staples to the beloved subgenre, but \"Hobo\" is where its at. It's bigger, louder, and prouder. In all honesty, this is one of the goriest films I've seen in a while, and it takes a lot for me to say that because even the goriest Saw film doesn't fulfill my bloody craving. The best part about \"Hobo\" is not only doesn't it play it safe, but there's so much meaning, and depth underneath it, and is executed so strongly that the message never becomes lost or preachy. <br><br>\"Hobo\" revolves around well... a hobo. An anonymous one at that who witnesses the catastrophes of the city, and decides to fight back. <br><br>First of all, the plot is just ingenious. A hobo who's tired of getting picked on and besmirched by the townspeople decides to take a stand. Not only is it a badass story, but can't we all relate to the plot? Haven't we all been pushed around too long, and just wanted to do something. To be something truly special. Also, while the deaths are pretty sick, there's more meat on these bones. The film relies on what a film should rely on. Its characters. The relationship between Abby and the hobo is a strong one. I actually cared about these two. What does it say if a film of the title \"Hobo with a Shotgun\" has more character development than 95% of the garbage being released today? <br><br>To put the icing on the cake, the production values are sweet. This film has a superb nostalgic look, and it's one of the most colorful and vibrant movies projected on screen. But why are we here? For the deaths! And boy, do they not disappoint. Eating glass, decapitating heads, and shots to the head are not even the goriest segments. Actually, they're the tamest. Not only that but almost every five minutes there's blood. Whether a dead body in a shot, random blood, or a kill occurring. This is just a huge blood bath. And a great one at that.<br><br>Also, what I loved about this movie is the lack of gratuitous nudity. I hate how almost every grindhouse flick has to have the need to throw in random boobs or sex in the film. I know it's part of the titillation, but it's rather absurd, and feels out of context. \"Hobo\" had one scene exposing those jugs, and it actually fit the mood because of its humor. However, it was just THAT scene and wasn't littered throughout the movie.<br><br>Ignore those reviewers saying they were \"disappointed\" because it wasn't \"what they were expecting\". If you're expecting a good time, dammit, you're going to get one. Two strong leads, heaps and heaps of blood, a slick story, and some solid production values. You're going to tell me that doesn't even get you excited in the slightest? \"Hobo with a shotgun\" might just be the best movie I'll see this year. The others have just not delivered on what they promised. How sad is it to see a movie with this title can actually be the best movie of the year, when probably half of the Oscar choices will be pretentious dribble. Don't even think about seeing this film. Just do it. Go ahead, I'll wait.","user":"MovieProductions","rank":[162,242]},{"title":"Hobo with a Shotgun is a bloody good time at sundance","rating":8,"date":"22 January 2011","review":"He's a guardian angel walking the streets, a vicious protector of the weak and innocent. He is the hobo with a shotgun. He is Rutger Hauer. Hobo with a Shotgun is the story of... well, the title pretty much says it all. Bad guys led by a enjoyably psychotic gang lord named Drake dominate the unnamed city that is the setting of the movie. Drake and his two equally messed up offspring, Slick and Ivan, terrorize the people of this tortured city uncontested until the arrival of Hauer's Hobo, intent on using his saved nickels and dimes to buy a rusty old lawnmower that will surly start him on a honest, rewarding career. Sadly for Mr. Hobo, destiny has other plans, and our hero uses his mower money to purchase a old pump action shotgun with the intent of cleaning up the city. Along the way he is aided by a prostitute named Abby (a stunningly beautiful Molly Dunsworth) who has an affinity for destruction. <br><br>This films greatest strength is its oddball tone and freakishly beautiful bursts of violence that occur periodically through the movie. The chunks of the movie that involve crazy old Rutger Hauer blasting through waves of baddies in brutal fashion and the bizarre acts of violence perpetrated by the films antagonists are easily the highlights, and they never fail to delight with their brilliant, twisted gore effects. Director Jason Eisener is a master of cinematic displays of blood and guts, and god bless him for it because it takes the film to a whole other level. I would love to provide an example for your reading pleasure, but tragically spoiling any part of this movie is a crime to heinous to contemplate committing. Just know you will leave the theater feeling like a changed man after the brutal displays of carnage presented. <br><br>Unfortunately, the film is ultimately brought down by some poor scenes that stretched on for agonizing lengths. Many of these involve our homeless protagonist ranting senselessly to his lovely caretaker Abby, others involve the already hyperbolically inflated villains plotting the death of the Hobo. Perhaps what is most tragic is that Hauer, with the exception several brilliant lines in the films third act, never gets a chance to truly shine as the shotgun wielding hero, a huge disappointment considering the potential he possessed. Regardless of these flaws, the film is still an incredible experience based solely on the incredible displays of creative gore.","user":"ianfarkas9","rank":[109,170]}]