[{"title":"a must see for those who like being intrigued","rating":9,"date":"25 March 2012","review":"I can't believe I almost didn't see this movie based on the lower rating and negative reviews. What a shame that would have been! There are always plenty of long reviews, so I won't bore you with mine.<br><br>This movie was absolutely wonderful. It has some drama, suspenseful music and scenes from start to finish, and even a bit of romance (but not nearly enough to make this a romantic or \"chick\" movie).<br><br>Each of the chosen actors were perfect for their part and they portrayed assigned characters beautifully. They were very likable and believable.<br><br>I'm not going to compare this movie with any other, but if you're like me and love movies such as The Sixth Sense, Shutter Island, Inception, Dream House, etc... I promise you will love this movie as well. You also, like me, may decide to immediately watch it the 2nd time to see if there are any clues you missed preparing you for the last 15 minutes of movie.<br><br>Out of over 700 movies in my collection, only 32 have a 10 star rating. This movie comes VERY close to that category. Definitely a must see!","user":"ivanaaaaaaaaa","rank":[132,156]},{"title":"An Instant Classic Ghost Story","rating":8,"date":"2 February 2013","review":"I found \"The Awakening\" to be a breath of fresh air for the Horror/Suspense genre. With so many shaky cam, found footage, reality show type horror/suspense movies hitting the box offices and living rooms around the world with poor character development, over the top torture and gore, plots so thin they are the only transparent ghosts in the picture. \"The Awakening\" is bound to be an instant classic! It's done with just the right amount of restraint, it has a rather Hitchcockian tone to it.What you don't see is far more suspenseful and adds to it.Sometimes less really is more. There is a fine line to walk especially with a ghost story, to achieve that sense of spine tingling, skin crawling feeling and that element can only be teased from the psyche with mystery, not in your face guts or a head being lopped off - that is shock value and gross out, which is perfectly fine for a slasher pic or a grind house movie, but not a good ghost story. <br><br>\"The Awakening\" is set in 1921 England, our Protagonist Florence Cathcart a free thinking, strong willed ghost buster, author and hoax crusher opens this gem of a movie by diving right into the fray. Mediums, psychics and séances' were all the rage during that time period, which began with the religion of spiritualism. Spiritualism developed and reached its peak growth in the 1840's to the 1920's. With many patrons from the Aristocratic and famous class, like Abraham Lincoln joining his wife for a séance after the death of their young son. After WWI many bereaved souls were searching for a connection to loved ones lost either from deadly illness or the horrors of war and were further victimized by unscrupulous charlatans seeking only coin and selling false hope. Florence's main objective is to put a stop to this and shed light and truth on the subject of death, the afterlife and ghosts. But after being invited to a supposedly haunted old grand estate that was converted into a boy's boarding school, with a recent death of a student and a rumor of an old murder and sightings of a ghost, Florence finds much more than school boy pranks and hoaxes - she finds something good, something frightening and something truly enlightening. <br><br>The character development in \"The Awakening\" is done perfectly with solid performances from the entire cast. The cinematography is excellent as is the entire production tip to tail. From sets and wardrobe to the musical score. The research done for the story and time period is what really brings this ghost story to life. It's the small details and creepy little surprises that all add to the reality of the time this story is told and the ensuing mystery. I must also comment on the pacing - this movie wasted no time, it's no action packed, a scare a minute kind of movie, it's far more subtle, but it's never slow or boring and nothing is wasted. <br><br>As a true horror/suspense connoisseur (I have a degree in film production and I was a make-up artist/Stylist for print, film and T.V. for 12 years.) I'd like to comment on some of the cynical and negative reviews. One cannot simply lump all horror and suspense films together. There are many subsets of the genre (Slasher, Grind House, Mystery, Supernatural, Creature, Occult, Gothic..etc.)and each has it's own flavor so to speak. You cannot compare a movie like \"A nightmare on Elm street\" to \"The Changeling\". Though they are both considered to be horror, one is supernatural slasher and the other is classic ghost story. Even when comparing movies in the same subset like \"The house on haunted hill\" with \"The Haunting\" both of which have remakes, have huge differences, usually found in the details and presentation and should be considered unique in their own right. While it may be true that there is nothing new under the sun and we've all seen the same plots and themes over and over again - I have found there is always something new to add to the age old themes.<br><br>This movie is in my top 10 of great ghost stories - 8 out of 10 stars for \"The Awakening\".","user":"robin-72-718219","rank":[50,60]},{"title":"A ghost story for grown-ups","rating":7,"date":"20 November 2011","review":"Between 1914 and 1919, one million people lost their lives to  influenza. Society was more ignorant back then. Science and rational  thinking were not then the forces they are today. People were open to  anything, including the possibility of ghosts.  Florence Cathcart (Rebecca Hall) stands out in the London of the  twenties for being a free-thinker and a debunker of the supernatural. A  boarding school teacher (Dominic West) implores her to visit his school  following the death of a pupil, where unexplained sightings are being  reported.   Florence isn't a total sceptic. She leaves some room for belief, which  caused me to note she is agnostic towards ghosts. Essentially, there  are two stories. One is concerning the death of the pupil. The other is  more interesting and distinguishes it from a deluge of other horror  films which have vanished from my mind as quickly as the ghostly  apparitions in them. It focuses on Florence herself, and I shall say no  more as I will not spoil it for you.  This is not a scary film; there are several portents but few frights.  What there is plenty of, however, is suspense. Nick Murphy, in his  feature-length debut, also manages to sustain a melancholy mood,  crucial for his story.   It's no surprise that Rebecca is the daughter of Peter Hall, founder of  the Royal Shakespeare Company. She commands the screen in a way which  would cause many of her peers to blush with envy. Her character is a  difficult one to personify.   Dominic West, he with the simian countenance from the groundbreaking  crime series 'The Wire', is very good as the guilt-ridden  soldier-turned-teacher. Imelda Staunton is effective as the school  matron. She has that look in her eye which is trying to tell us  something.   I'm calling this a grown-up film because the spiritual element becomes  auxiliary. Guilt and loneliness take over as leading themes. Murphy has  the acuity to drop the ghost story  because otherwise it would be a  simulacrum of other period chillers  and focuses on a story of locked  emotion. The denouement is clever and original. The penultimate  revelation would have been a superb ending on its own, so having a  double-twist is all the more impressive.","user":"dharmendrasingh","rank":[106,135]}]