[{"title":"Chong and Mak's re-imagining of an immensely popular historic romance","rating":28,"date":"28 April 2011","review":"Historic romances under the pen of a polished novelist have an almost irresistible appeal to a certain segment of readers. When the written material is in turn adapted to the screen, it again has the potential of immense popularity. \"Ivanhoe\" (1952) is a case in point.<br><br>GUAN Yun-chang is arguably the number one icon in China's historic heroic figures. One local columnist has pointed out that this hero is worshipped with equal fervour by both law enforcers and the criminal underworld today. With a chuckle, he further wonders aloud to himself that when there is direct confrontation between the two, whose prayers will be heard.<br><br>While the novelist's depiction of GUAN in \"The three kingdoms\" may not be authoritative material for the scholar, it is deeply ingrained in the mass as if it were divine truth. Chong and Mak's liberal re-imagining of this and other historic figures is therefore rather gutsy as it may have traditionalist grinding their teeth. Based loosely on the set of events (popularized by the novel) generally referred to as \"Clearing the 5 passes; killing the 6 warriors\", the movie plot is a liberal mix of historic facts, novel-popularised heroism and the directors' lively re-imagining. It should appeal to the mass audience in general.<br><br>While not particularly brilliant in any way, this movie scores above average in all the subjects on the report card. The action sequences are good and should satisfy those looking for them. The character depictions may upset hard-core fans of the novel but are generally sensible and at times even inspired. The dialogue is clever if not truly intelligent. JIANG Wen, one of the best actors in China today, adds depth to Cao Cao, whose name is almost synonymous with \"vastly ambitious villain\" in the Chinese language. He is a joy to watch. Donny Yen who never disappoints in the action department has recently demonstrated that he can also act. In this movie, we see him face a new challenge of carrying, as said, the number one icon in China's historical figures. He has done a decent job but what he portrays is not quite what a lot of people visualize GUAN Yun-chang to be, from the first time they hear about this hero, most assuredly when they were small kids, from their parents. But then a coin has two sides. This depiction makes the movie more interesting than following the novel's simple template.","user":"harry_tk_yung","rank":[10,14]},{"title":"Lonely Bladesmann","rating":7,"date":"4 March 2012","review":"Donnie Yen is really good at Martial Arts, but you already knew that. Some don't think he's a very good actor though. But the role he has on hand here, is really serving him good. He plays a loner and that suits him very well. The action scenes are phenomenal as expected and the story is good enough (while you could argue there is too much kitsch in it, I think it's the right amount).<br><br>It's not a masterpiece, but I think it's a good movie overall, with great story points and turns that while you might expect them, they still come down crashing on you. What's also true, the movie does not loose much on a second viewing. I even liked it better the second time around, because I knew where it was heading and could see small touches in between the settings.","user":"kosmasp","rank":[6,9]},{"title":"A Nutshell Review: The Lost Bladesman","rating":7,"date":"30 April 2011","review":"TFor starters, Donnie Yen as Guan Yu certainly raised a few eyebrows, although you realize the filmmakers may have wanted to break conventions. I can live with that, having Guan Yu more of Donnie's physical stature, although traded off with being a little bit more nimble. While Yen's portrayal of Guan's fighting prowess is excellent par none, with the actor also taking up action choreography responsibilities, his dramatic range is undoubtedly hampered, nary breaking into a smile (which is a good thing after that very smiley performance in All's Wel, Ends Well 2011). Thankfully this got compensated by the presence of Jiang Wen as Cao Cao, adding much needed gravitas to a role that Jiang excelled in making Cao both a hero and a villain, who on the outside does and makes everything fine and dandy for Guan Yu, but harbouring deep evil beneath the facade that we see behind closed doors amongst his most loyal of generals.<br><br>And given that the set action sequences are spaced far apart, it is Jiang Wen who prevented the film from sagging in its middle act, as we see Cao Cao's dogged pursuit to build camaraderie with Guan Yu, and wonders just what it takes to have men of quality joining his ambition to rule all of China. Meanwhile we have a romantic interlude that deals with Guan Yu's infatuation with Qi Lan (Sun Li) the woman he loves but cannot woo because she is betrothed to Liu Bei. While this was inserted to show how Guan Yu is a man who sacrifices personal happiness for others, what with his saving of her skin a number of times and with his escorting her back to Liu Bei's camp, this was perhaps the weakest link in the story given Yen's unconvincing performance, and Sun Li's role being nothing more than decorative and a pretty face to build on the temptation factor.<br><br>But the second half picked up from where the first scene left off, with large action pieces to thrill audiences with Guan Yu in full battle, despite not having his famed Green Dragon Crescent Blade with him, nor the story of the Red Hare steed incorporated, which would be a nice touch to build on established mythos. Yen shows why he still has it in him as a top notch action star and choreographer with a variety of fighting styles and mano a mano battles against opponents hell bent on slaying his Guan Yu to gain instant recognizing and fame. The characters Guan Yu come up against are adapted from the infamous Five Passes Crossing, which happened because of Cao Cao's instruction to go against his own word, or that of his subordinates' defiance of orders (which is why Jiang Wen is best here as an astute politician presented with a dilemma with trying to please one man at the risk of losing loyalties of the others), and becomes almost like a computer game with the clearing of one boss level after another.<br><br>There's Kong Xiu (Andy On) refusal of safe passage resulting in a fight within a constricted passageway getting in the way of weapons in full swing (sort of reminiscing Yen's swordplay in Tsui Hark's Seven Swords), Han Fu's betrayal and his poisoned dart episode, Bian Xi's ambush with hundreds within a temple, and the governor Wang Zhi's fight with Guan Yu in a snow covered landscape, which is probably the best amongst them all despite losing plenty of backstory that builds up to the fight. Come to think of it, there was a conscious drop of background to how Guan Yu got to each stage which removes plenty of drama, and made it really look like Guan Yu going on a rampage to rid all who stood in his way. <br><br>The cinematography also was found to be left very much wanting with one extended fight sequence shot very much in the dark so much so that you can hardly see anything, except knowing that Guan Yu is dispatching a lot of goons repeatedly, and Bian Xi's episode was also quite the let down in a cheat sheet of shots, stylistically quite innovative, but with doors closed and plenty of noise coming from within before revealing the obvious winner, you would have hoped the camera was placed on the other side instead. Perhaps it will be there as a deleted scene in the DVD. And while I mentioned this isn't your usual gigantic Guan Yu, Donnie Yen's fight choreography may have confused him with Chen Zhen which Donnie also played in The Legend of the Fist (directed by Andrew Lau), having Guan execute dexterous moves as seen in that film running around in a circle and dodging arrows which seemed to have been fired from a machine gun. I'm all for reinterpretation, but adopting something so recent from one's own film (perhaps he really liked those moves to repeat them here again), is shortchanging fans and audiences, coming so recent.<br><br>Romance of the Three Kingdoms cannot possibly be made into a one off feature film, but it contains a lot of stories and characters that serve as a wealth of resource material to tap upon for translation to the big screen. This probably isn't the best and won't be the last of the lot, and despite its flaws, still managed to turn in some pure entertainment, although with the pedigree of talent involved, one can be forgiven to have expected a lot more.","user":"DICK STEEL","rank":[22,45]}]