[{"title":"I'm sorry, but this movie is complete garbage!","rating":3,"date":"4 July 2016","review":"I was looking very much forward to it, since I'm a fan of the original (nostalgia based). 15 minutes into the movie I just knew it was going to be bad.<br><br>Made by the same director that made the movie 2012, it has the same terrible drama and completely transparent storyline. I'm not even sure if there even is a storyline to this movie.<br><br>The worst part, aside from all the crying scenes based upon long distance relationships, unresolved father issues and what not, was in fact that the aliens are more primitive than us.<br><br>You would think that a race with such insane technology have evolved beyond petty and shortsighted impulse driven emotions. It's when you realize that the Queen of the aliens suddenly gets a personal vendetta against a yellow school bus while fighter planes are bombarding her, that the manuscript was written in half an hour in a coffee shop.<br><br>I really went into this with open eyes and was completely set for loving it, but no. The movie is just pure garbage. I'm sorry...","user":"henrik-thuesen-275-355055","rank":[453,552]},{"title":"Today I learned that a big action movie can be boring","rating":23,"date":"23 June 2016","review":"TL;DR: It was actually boring. There was a story here that had potential but it was let down by terrible acting, bad dialog, no story or character development at all and, ultimately, no soul to this one. <br><br>3 points for above average special effects, -7 for just an awful movie. Netflix this one.<br><br>Edition watched: 3D IMAX<br><br>In 1996's Independence Day, Bill Pullman's speech hit you emotionally somewhere. Even if that emotion was disgust, you had a reaction. All of Will Smith's one liners made you cringe or laugh. No matter how much you may deny it publicly, Randy Quaid's end put a lump in your throat the first time you saw it. There was soul to that movie, even though it was an ensemble cast, characters were developed, the story progressed and there were heroes you cheered for and aliens you despised.<br><br>None of that was present in 2016's Independence Day. All the new actors were either bad or terrible. I didn't care if the aliens won or lost. Not only were the new actors bad but some of the dialog they were forced to work with was just terrible. Jessie T. Usher's character has a few key lines that are supposed to hearken back to those emotional one liners from Will Smith in 1996, such as: \"Welcome to Earth!\". Yet Usher delivered those lines in such a deadpan, soulless way that made me wonder if he thought he was supposed to be playing an emotionless android. Then you have my favorite emotionless android actor Brent Spiner, who is someone I know to be a quality actor, yet the dialog and scenes with him were so bad I had to wonder for a second if all his previous work was done by a twin. <br><br>I could go on, but the acting and dialog were just parts of the problem. There was no character development at all. They simply tried to cram too much into this movie. From the constant pandering to a Mainland Chinese audience (unnecessary scenes that should have been used for any kind of plot or character development) to Vivica A. Fox's minuscule screen time, there was too much shoved into this 120 min movie which ended up making it a big mess that went nowhere. In the end, I formed no attachment to any of the new characters and was detached from old characters that I once cheered for.<br><br>The most damning thing though is, despite all the explosions and this alien invasion, there was no excitement. I was bored. There was a girl in front of me texting and using FB messenger and I found myself involuntarily lifting my 3D glasses and reading her text chain and messenger thread till I caught myself and put my glasses back on. Her inane chatter about how boring this movie was, her cat, the guy she was sitting next to and so forth were more interesting to me than the movie on the huge IMAX screen was.<br><br>As a huge fan of alien invasion movies, I walked out feeling like this was such a huge opportunity wasted. If you told me the basic story of this move yesterday, I would've been ecstatic to see a trilogy. Now I hope the 3rd one dies in production and they put the money to a Battle Los Angeles 2.","user":"nalandy","rank":[519,660]},{"title":"Another boring sequel","rating":13,"date":"13 June 2019","review":"Bad sequel don't watch it (unless you are a Disney Star Wars sucker in that case buy two DVDs!)<br><br>Modern Hollywood does not know how to make a good movie and they hire the likes of Jar Jar Abrams to remake everything and make endless sequels. This is another movie that truly destroys its prequel and I will not be surprised if the next Independence day appears in 2022.","user":"cheoasriel","rank":[53,62]}]