[{"title":"This is not a bad movie if you take off your critics hat","rating":6,"date":"13 September 2011","review":"First of all this is NOT a movie about Colombia. The producers may have failed on representing it but this is not the POINT of this movie. It's an action movie about a girl from Colombia and that's pretty much it regarding Colombia. Don't get all frustrated with it. Here's my quick review: <br><br>1 - Trailer: I wanted to see this movie mostly based on the trailer which I found catchy. Action and sexy Zoe Saldana sells it all. Still I went on a cheap night because I wasn't convinced this would be worth the full price entry. What you see in the trailer is what you get. A lot of action left to be seen and overall it's a good intro to the movie.<br><br>2 - Cast &amp; Characters: Ahhh Zoe Zoe! It's hard to watch her rather than just stare at her. She delivers a pretty solid performance in this movie. She goes all around sneaking up the bad guys and taking them out in creative and yet plausible ways unlike Angelina Jolie in Salt (2010) where her 100 pounds character takes out multiple 250 pounds guys in fist fights. The supporting characters are your \"typical\" Mexican (Colombian in this story!) guys that pretty much do nothing other than holding guns outside a villa and sipping on drink and cigars. Generic police guys fill the rest of the cast but I found Callum Blue quite enjoyable to watch.<br><br>3 - Plot &amp; Story: I think the story is so generic that the little twists added to the script makes them even more surprising. You always feel like you know the next move but most of the time something unexpected happens. Unfortunately, the script as a whole is a bit sloppy and poorly paced. I didn't get bored at all in this movie and though the intrigue isn't much catchy, it was enough to keep me interested. There are many laughable moments (mostly intended) which is fun but the drama is really cheesy.<br><br>4 - Theme &amp; Genre: As an action flick, this one stands right. It isn't a melting pot of car crashes and explosions out of nowhere. There is plenty of action and a good mix between Hollywood fireworks and realistic fights. The camera angles and editing sometimes get confusing but in some scenes they really add something cool to watch.<br><br>5 - Overall Appreciation: Alright let's face the obvious. There is no Oscars material here. This will get MTV Teen Choice Awards at best. It's a cheap night movie that is entertaining to watch and where you should not expect a classic in cinema. Did I appreciate it? Yes! Is it good? Not bad. I give it 6 out of 10 for Zoe Saldana, good fight scenes and cinematography. Too bad the supporting characters, cheesy drama and poor script kills it a bit.","user":"turboisturbo","rank":[61,78]},{"title":"Your run-of-the-mill EuropaCorp action flick","rating":7,"date":"23 August 2011","review":"If there is one French director the non-French general public knows about, it's Luc Besson. Even if the name means nothing to you, chances are you've heard of the films he's had a hand in. Among his most famous films are Léon: The Professional (which introduced American audiences to Jean Reno and Natalie Portman), Nikita (which has been remade into an American film and two American TV shows so far) and The Fifth Element (which nearly 15 years later remains one of the most famous science-fiction films as well as one of the 10 most expensive French films).<br><br>At the dawn of the new millennium, Besson started his own production company, EuropaCorp, which in the last ten years or so has funded its fair share of diverse movies, both in the French and English language. Nevertheless Europa (as it's known in short) is best known to mass audiences for its numerous, high-octane, medium-budget action films, most of which are written or co-written by Besson himself (often with Karate Kid screenwriter Robert Mark Kamen). Among these are the Taxi, Transporter and District B13 series of films, Wasabi, Taken, From Paris With Love, Danny The Dog (also known as Unleashed), Bandidas, Kiss Of The Dragon, Yamakasi, Crimson Rivers 2, Hit-man,... Through these films, Besson is also responsible for introducing the world to Parkour, which seems to have taken over action cinema in the past 5 years (and even making its way to films such as Step Up 3D).<br><br>Colombiana is another product from Besson's action film factory. The story starts in 1992 in Bogota, where some mob guy, Don Luis, orders a hit against a former associate of his who he considers has betrayed him, and naturally his whole family. Only young Cataleya Restrepo escapes the bloody shootout during an intense Parkour chase (what else?), and manages to reach her uncle in Chicago, to whom she swears that she'll become a hit-man and avenge her family. Fast-forward and enter Zoe Saldana as adult Cataleya as the rest of the film takes place, strangely enough, in 2007. With her uncle's help, Cataleya has indeed grown up to be an awesomely skilled contract killer, having performed 22 jobs in 4 years. However, she signs each of her kills with a message destined for her real prey, making her one of the FBI's most wanted. When the FBI decides to divulge her \"serial killer\" status, Don Luis and his men know what's up, and all hell breaks loose.<br><br>Much has been said of the film's similarity with Besson's Léon and Nikita, with many people musing that the film could just have well have been a sequel to Léon with Natalie Portman's character all grown-up and kicking butt (something fans have been dreaming about for years). Now I haven't seen Nikita, but while there are similarities between Léon's Mathilda and Colombiana's Cataleya, the two films are definitely not on the same level. Colombiana is really your typical, run-of-the-mill Besson action production, which is really not a bad thing. It is not in the top-tier of these films (where I place films such as Taken and Danny The Dog), but still a perfectly entertaining romp.<br><br>Viewers concerned with director Olivier Megaton due to the perceived lack of action in Transporter 3, his previous film, need not be concerned. The action here is almost non-stop, pretty much to the detriment of plot. While the story has potential and could make for a film with a lot more depth, whatever plot is here is minimal to the max, recycled, cliché and basically a hodge-podge of all previous hit-man/revenge/on-the-run-from-the-law films you've ever seen. There is absolutely zero character development whatsoever and if you didn't know that Cataleya's parents were murdered by Don Luis, you would have no idea why any of the characters are doing what they're doing. I'm not exaggerating, the Transformers films, heavily criticized for this reason, have more character development.<br><br>But lack of plot depth isn't really a negative here. More depth would have certainly made it a better film, but Colombiana is still entertaining as a simple, straightforward, \"dumb\" B action flick. Like all EuropaCorp films, production values are top-notch. The expected Parkour chase is kept fresh by having it unfold with a child. Zoe Saldana gives a great physical performance and spends a great deal of time flitting in and out of vents and the various hits shown in the film are all quite cool. The other actors also do fine, though Michael Vartan's character has very little purpose and is actually barely in the movie. Also this might be the only movie you'll ever see in which toothbrushes are used as weapons.<br><br>In short, know what to expect from Colombiana (which literally means Colombian woman by the way), and you'll enjoy it fine. It's a straight-up action movie, no more, no less, very low on plot, high on action, that falls straight into the heap with the scores of other similar Besson-produced films, though it doesn't possess the touches of humor that most of his other productions have. In comparison to the other hit-man movies of the year, it's superior to The Mechanic, but way inferior to Hanna (though it contains a lot more action than Hanna, which shouldn't be seen as an action film). This is no Léon: The Professional 2, fans can keep hoping that Besson and Portman work that one out at some point (interestingly, Megaton is first in line to direct if that movie does happen).","user":"Happy_Evil_Dude","rank":[141,190]},{"title":"Zoe is Great, the Movie.....Mediocre","rating":6,"date":"26 August 2011","review":"I went to a midnight screening last night at Times Square because I've been wanting to see this picture for quite some time. With Colombiana movie posters on every street corner and wall I figured it was going to be a tremendous blockbuster to end the summer with. Didn't exactly end up that way.<br><br>With some of the names behind this film, I was surprised at the abundance of cheesy bad guys, predictable scenes, and flat supporting characters. The only thing that moves this story along is Zoe Saldana herself with her tremendous presence on screen and beauty, which is breathtaking. She's very believable as a stone-cold assassin, especially the way she sneaks and crawls around with ninja like precision.<br><br>It's too bad they couldn't place Zoe and her character into a better storyline and provide her with stronger support. Without giving away the ending, there's also a final fist fight scene in the end which looked like it was filmed and edited by two high-school kids. Isn't this 2011? The technology there was very lacking or done in poor choice.<br><br>I still would recommend seeing the movie as its not bad-bad and there are some cool kill scenes, but I wouldn't qualify it as a must-see. The movie is somewhat groundbreaking only for the fact we have a Latina female as the lead role in an action film, hopefully this finally opens to the door for other darker skinned actresses in similar roles, which has been long overdue.","user":"woljm45","rank":[87,120]}]