[{"title":"The paradox of Herbert Hoover","rating":8,"date":"20 January 2016","review":"We often can learn a lot more from presidential failures than those successes whose names glitter in our history. At least that's how I've always felt and if I'm right than Herbert Hoover will fascinate people to the end of time.<br><br>The paradox of Herbert Clark Hoover is how could a man who succeeded at everything in tried and took himself from being one of those forgotten persons of humble origin that his successor so lionized could have gotten to the top job and blown it so badly. Historians will be trying to figure that out for centuries. He was in fact the man who did the most to combat famine in Belguim and later in post war Europe. He was an innovative Secretary of Commerce under Presidents Harding and Coolidge and much of what that department does today was instituted under him.<br><br>I would offer two stories as insights. The first is try to read his memoirs in three volumes. The first is about his childhood through his years at Stanford as a man who amassed a fortune in the mining trade and then his years feeding Europe. They are a good read with nice anecdotes. The second two covering his years in the Cabinet and the White House read like reports to the board of directors. Completely utterly dull much like the speeches of the man himself if you watch newsreels of him. Project well he did not in contrast to his successor who had a musical voice just made for the new medium of radio.<br><br>There is another book called the Hoover Policies which was written post his presidency by Cabinet members of his Ray Lyman Wilbur his Secretary of the Interior and Arthur M. Hyde his Secretary of Agriculture. But if you've read Hoover's memoirs 10 pages into the Hoover policies and you know this man must have micromanaged the writing. Again it reads like a report to the Board of Directors.<br><br>Secondly in the midst of the Great Depression he made no effort to communicate his individual concern for Mr.&amp;Mrs. America. He resisted mightily what later became known as photo ops or to use the presidency as the 'bully pulpit' his Roosevelt predecessor referred to it as.<br><br>There is a famous story that was brought to light by another book called Hoover Off The Record by his last Press Secretary Theodore Joslin. It concerned a pair of children who hitchhiked across the country to see President Hoover to get their father out of jail for Christmas. There was a made for TV film about the incident that starred Robert Urich as the father who is caught in a petty theft and jailed. <br><br>I can't think of any of his successors and most of his predecessors who wouldn't try for maximum publicity to show what a good man I am. Hoover did intervene and the man was freed but gave strict instructions that no publicity of any kind was to be garnered from this incident. Joslin told it in that book and at a time when Hoover was purportedly trying to refurbish his image, he cut Joslin off from any further contact from him for good.<br><br>The documentary mentions that Hoover emerged as the biggest critic of his successors policies. More than that, Hoover in both 1936 and 1940 let it be loudly known he was available to run again. He wanted vindication so badly. But the GOP wouldn't touch him and aspiring candidates treated him like a leper.<br><br>Landslide offers a good mix of commentary from both supporters and opponents and it has personal insight from a great granddaughter. I wish we had more of Hoover's voice both in live speeches and radio broadcast. Contrast it with FDR's and that illustrates better than anyone his weakness and FDR's strength as a great communicator.<br><br>If Hoover was a failure he was a failure on a grand scale.","user":"bkoganbing","rank":[1,1]},{"title":"A very good look at Herbert Hoover's political career","rating":8,"date":"11 March 2012","review":"Many of the interviewees in this documentary are liberal economists, and even they remark Herbert Hoover has gotten a raw deal from history. The truth is, Hoover had a great reputation as a philanthropist and humanitarian prior to his disastrous presidency. It's also the truth that there was no precedent for what happened during his presidency, 1929-1933. When he was sworn in, America was booming. By the time he left, unemployment stood at 25%. Every action he took - or didn't take - today is recognized as bound to have a contractive effect on the economy such as high tariffs and refusing to run a deficit even in the short term, but in 1930 there were no rules or even theories for what was going on and he as well as everyone else was just feeling their way through. You have to remember that until the banks failed en masse in early 1933, even FDR thought the concept of federal deposit insurance was a radical one.<br><br>What probably sealed Hoover's doom was his treatment of the bonus army, and many people still blame Hoover for the heavy handed treatment that was doled out. The truth is, the burning of the army's possessions and the specific actions taken were the decisions of the generals in charge, Eisenhower and McArthur. However, perhaps because he felt that he was ultimately responsible for what his generals did even if he didn't tell them specifically what to do, Hoover took the rap, so to speak. Due to the fact that polling was in its infancy, Hoover didn't know he was in trouble electorally in 1932 until his speeches on the campaign trail were greeted with eggs and tomatoes.<br><br>After Hoover left office in 1933, he was a vocal opponent of FDR's New Deal, and that didn't win him any friends with the White House's new occupants. When Pearl Harbor was attacked, he offered his service as he always had during times of crisis before he was president. His offer was met with deafening silence. Only after FDR died and Truman became president was there an attempt to mend fences, with Hoover invited to the White House to help the organization of getting food to now Allied-occupied Germany.<br><br>In spite of somewhat redeeming his image by the time of his death at the ripe old age of 90 in 1964, his is one tomb that Presidential contenders to this day tend to avoid.<br><br>I'm waxing long-winded here because this is such a well made documentary that me retelling the basic facts of the presentation won't ruin it for you. Hoover was a guy who had the bad luck of being in the wrong place at the wrong time with the wrong economic theories, and he truly felt badly for the starving victims of the Depression. He was a gentleman in so many ways that today's politicians are not and I think his story is worth a second look, if only for the parallels between what happened in the 30's and what is happening today and the fact that today's politicians should - and probably do - know better and just don't care for anyone but themselves and their own future fortunes.","user":"AlsExGal","rank":[1,1]},{"title":"Well worth seeing.","rating":8,"date":"18 September 2011","review":"This documentary is a re-examination of the political career of Herbert Hoover. In some ways, it all came as a bit of a surprise--at least in the beginning of his career. Although I knew a bit about pre-presidency Hoover, so much came as a surprise--particularly how he was seen as a great humanitarian during WWI and was such a self-made man. And, the biggest surprise of all is that in the 1920s, his biggest fan was FDR himself! Still, the majority of the film was about his presidency--a presidency that is associated with failure and a deepening of the Great Depression.<br><br>The film consisted of vintage photos and film, interviews and narration. I appreciated how it emphasized the good and bad about the man--giving you a relatively well-rounded and non-partisan view of the guy. My only objection were the repeated interviews with Robert Rubin who repeatedly said that the Depression was worsened by the government not increasing spending. This Keynesian view of deficit spending is still debatable today (especially since what lifted the US out of the Depression was WWII--not prior spending programs). I kept wondering if perhaps the purpose of his comments were more to bolster the current administration's attempt to spend our way out of a recession. Still, overall, an interesting and well made film.","user":"MartinHafer","rank":[3,6]}]