[{"title":"More to this than you'd think","rating":8,"date":"18 January 2018","review":"Looking through other reviews, I see a lot of people unhappy with the ending, but I think they fail to see the whole point of Sam's repeated day.\nIt's not about her having to solve something that would lead to a different outcome, because she was supposed to die anyway.\nIt's really about her getting a chance to leave the people she loves with good memories and tie up some loose ends before she dies. If you think of it, it's really a gift, not a punishment. She gets to tell her family and friends she loves them, implant beautiful last memories, save a girl's life (not by offering her own instead, because she was supposed to die either way) and leave the boy who always loved her with the knowledge that she loved him back. How many people get that chance?\nIf she hadn't gotten her repeat day, she would have left lousy or meaningless memories of herself to everyone. In the end, she understands this and no longer tries to find a way to get out of the loop.\nSo I get that a movie like this can leave you angry about the ending, but actually it couldn't have ended better. \nOh, and I don't think it's a movie only meant for teenagers (except for the soundtrack, of course).","user":"cristina-trsl","rank":[85,88]},{"title":"What a surprise!","rating":9,"date":"27 August 2018","review":"When I read that this film was a cross between Groundhog Day and Mean Girls I nearly passed it up. Thank goodness I didn't, as it is a truly exceptional film, sure teen films have been done to death, but for a change the film contains empathy and soul, I know it's a cliche but Samantha's journey of discovery is well realised.<br><br>The film is well paced, very well acted, and very engaging, I found it very easy to follow the story, and understand the character's motives.<br><br>So often this type of movie features great ideas, but the execution is too blunt, Before I fall is subtle, engaging and excellent all round. I'm so surprised by its sheer quality. 9/10","user":"Sleepin_Dragon","rank":[54,61]},{"title":"Haunting","rating":10,"date":"17 July 2017","review":"This is one of those 'God I miss the forums' moments. I wish I had someone to talk to about this movie, even while putting up with the trolls lol. <br><br>THIS REVIEW WILL CONTAIN SPOILERS<br><br>This is a variation of the Groundhog Day/Butterfly effect that has been done Ad nauseum in books and movies where our main character relives the same day. As expected, the point of the story is that their actions in that day evolve to the point where the lessons are learned and the day finally ends. This movie is no different. I'm haunted by this movie because of a particular lesson learned, and it's not the main one that finally ends her loop. <br><br>Sam is our main character caught in the time loop. She is part of a foursome of girls that are the popular girls and sometimes the mean girls. Their leader is Lindsay (Linds) who is the meanest of all with some deep rooted insecurities. As Sam relives her day she discovers more insight into her own life and the flaws of her and her friends. The two girls that receive the bulk of the mean girl routine become known to her and she realizes she is just following Lindsay like a puppet, not even knowing why they are mean to these girls. On one of her days journey, she lashes out at her friends in anger and disgust, particularly her bestie Lindsay. She sees Lindsay for who she is and she doesn't like it. For most people that would be the end of that. We all have those friends that we turn on when we realize their flaws and decide to remove them from our lives. Let's face it, love is usually conditional. The part of the movie that REALLY got me and I can't stop thinking about is the full circle point where she recognizes the motivation behind Lindsay's 'meanness' and shows her total compassion and love. She embraces this meanest girl of all and instead of rejection and hate she provides her with complete recognition and acceptance. This may seem like no big deal to most, but to me it stuck out like a sore thumb. Usually in movies and books the character like Lindsay end with that character getting his or her comeuppance. Instead this movie preaches love and understanding of all people.This is the part I can't stop thinking about. This is the kind of love and compassion that I would venture to say most of us want to think we posses, but really don't when it's too close to home. I found that very inspiring and it has me thinking of various people I've rejected in my life based on my judgment of them without any compassion. <br><br>Any movie that makes me think as much as this one has deserves a 10.","user":"mrocco-1","rank":[54,66]}]