[{"title":"The Armstrong Lie: An Essential Document of One of Cycling's Darkest Eras","rating":7,"date":"17 October 2013","review":"It is an unexpected honor to be the first reviewer of The Armstrong Lie. <br><br>Yesterday, I went to the London Film Festival and saw The Armstrong Lie directed by Alex Gibney. When it comes to documentaries, a world- renowned film festival is the perfect venue. There's nothing quite like a roomful of film critics, cycling writers and enthusiasts being given the opportunity to ask questions directly to a film director who had unprecedented access to his subject. <br><br>Alex Gibney is firmly established among the very elite of documentary filmmakers. He is responsible for Mea Maxima Culpa: Silence in the House of God (2012), Enron: The Smartest Guys In the Room (2005) and Catching Hell (2011) for ESPN's 30 for 30 series which are among some of my favorites of the genre. He also won an Academy Award for Taxi to the Dark Side (2007). Having already investigated scapegoating and bullying via a frightening episode in baseball's history when a fan interfered with a foul ball during Game 6 of the 2003 National League Championship Series at Wrigley Field, he was well prepared to deal with Lance Armstrong from deification, to dirty politics and the long purgatory faced by some of sport's fallen heroes.<br><br>The Armstrong Lie, Mr. Gibney told us, was five years in the making. Lance Armstrong's return to competitive cycling in 2009 culminating with his first Tour de France in four years - after winning seven between 1999 and 2005 - was the original theme. The storyline begged for a Hollywood ending and it was hard not to root for it. <br><br>Instead, we saw what needed to be done to rescue Alex Gibney's project once Lance Armstrong lost the power to intimidate whistle-blowers and trample journalists. His return from retirement suddenly looked more like that of Roger Clemens than Michael Jordan. This makes The Armstrong Lie a somewhat bipolar movie stretched between the myth we embraced and Lance Armstrong's unblinking manufacturing of the truth. It is also a vivid summary of the conflicting interests within cycling from the Union Cycliste Internationale (UCI) which appears to have more in common with the financial sector than clean sport, to its ongoing disputes with the World Anti-Doping Agency (WADA) and the US Anti-Doping Agency (USADA).<br><br>What The Armstrong Lie does exceedingly well is show the 'Armstrong Cover-up'. To anyone who has read about systematic doping within cycling, it is about much more than a two-faced one-time ambassador-at- large of the sport. Johan Bruyneel - a former Director of the US Postal Service team and until recently, of the RadioShack team - does not stand to gain from the added exposure this film gives him when for example he is shown attempting to influence a key race result. There is nothing in the Armstrong Lie that will be new to anyone who has followed the sport with passion. Still it remains an important film and I am thankful it was completed. One day, we may come to view it as an essential document of one of cycling's darkest eras.<br><br>It is also enlightening to contrast Lance Armstrong's interview by Oprah Winfrey with new material to decide for ourselves on the depth of duplicity involved, the predicament faced by anyone whose talent happens to be riding a bike for 3 weeks over total distances exceeding 3,000 kilometers, and whether it is an easy decision to fight an entire peer group and lose one's income. <br><br>The Armstrong Lie emphatically answers 'Why?' when it comes to Lance Armstrong. How someone who almost died from cancer could renew with a dangerous high-stakes game of chemicals remains a mystery. Oprah Winfrey did not directly ask Lance Armstrong that question. Neither does Alex Gibney. Why a number of exceptional athletes appear unconcerned with their own mortality is left for us to ponder on. The speculation that doping could have caused Lance Armstrong's cancer in the first place is not discussed. The Armstrong Lie follows the money. Lots of it.<br><br>A member of the audience asked Alex Gibney if Lance Armstrong had seen the movie and if so, what he thought of it. We were told that he does not like the title.","user":"sr_landry","rank":[48,64]},{"title":"A Narcissistic Personality","rating":8,"date":"20 March 2016","review":"Many were shocked when Lance Armstrong (finally) admitted to his use of steroids, which assisted in his 7 Tour Du France wins. Stripped of his titles, dumped by his multi-million dollar sponsorships, banned from all World Anti-Doping Agency governed sports, and literally taken out of the record books for all 7 years he won, most expected him to experience a deep shame and regret over his actions. Most of us, upon revealing our deepest secrets, and the lies that we chose to live, might respond in that way, but Lance Armstrong is a different kind of person, and perhaps doesn't function in the same capacity.<br><br>Oscar winning documentary film maker Alex Gibney tackles another societal dysfunction, in his attempt to tell the story of why one of sporting world's most famous names, would come out to admit his fraud to the world. It's an absolutely spellbinding story, and doesn't tip-toe around the subject. Rather, it opens up at his most publicly shameful moments, when he told Oprah Winfrey on national television (in yes / no fashion) that he had been cheating the whole time he was winning one of the most grueling competitions in the world. But there is a great deal more to this story, and Gibney delves into some of the bigger problems surrounding the sport, his issues with bullying team mates, the nature of cheating, and most importantly: Why Armstrong acts the way he does. <br><br>The American Psychiatric Association defines the narcissistic personality as: <br><br>\"In which a person is excessively preoccupied with personal adequacy, power, prestige and/or vanity, mentally unable to see the destructive damage they are causing to themselves and often others.\" <br><br>Whenever I think of this personality, a few names come to mind (Donald Trump, and Kanye West are just a few), but I think Lance Armstrong fits this description well. I don't particularly think that he, and others who share these traits, are necessarily terrible people, but it does make them capable of some truly awful actions. It's a remarkable study into this type of personality. Armstrong admits to wrong-doings, but never feels remorse for his actions. It's remarkable how he treats his own teammates throughout his career, and forces us to see him as a very driven man, yet at the same time, one capable of very criminal action. <br><br>At this time, in 2016, Armstrong faces a 100 million dollar lawsuit brought forth by the federal government for defrauding the U.S. Postal service (the main sponsor during his tours). It's expected to ruin him financially, but many don't expect a decision requiring a full penalty. Perhaps his actions do have consequences, but he's apt not to let that bother him. That being said, Alex Gibney narrates and describes the situation facing him and sport of cycling rather well. I would recommend this documentary to anyone who was interested in Armstrong as a competitor, but also to really let the depth of his actions sink in with the viewer. <br><br>One of Gibney's best, and more personal documentaries. <br><br>8/10","user":"kdavies-69347","rank":[6,6]},{"title":"gripping indictment","rating":7,"date":"3 August 2014","review":"When everyone cheats, it becomes a different contest. The powerful friends, money (125 million plus), risk and pain tolerance, influential scientists, compelling story, performance enhancing drugs, viciousness, ambition to win at all costs, willingness to bully others, . . . Armstrong has all this and more. The documentary is a powerful and gripping indictment not just of Armstrong and cycling, but of sports and humanity in general. Armstrong's doping is bad, but his abuse of power is worse. The film shows how willing people are to be fooled, or to trample on others. Despite its two-hour length, the film held my interest throughout. There are so many parallels in a short story by Nathaniel Hawthorne, wherein he writes, \"There is something truer and more real, than what we can see with the eyes, and touch with the finger.\" So too with Armstrong, cycling, sports, and all of us. This brilliant documentary helps bring such truths to the surface.","user":"Raven-1969","rank":[5,5]}]