[{"title":"Very surprising but good movie.","rating":10,"date":"5 December 2011","review":"I must say I was pleasantly surprised by this movie. I thought 50 Cent did an outstanding acting job. I initially thought his acting role was typical for what you would expect from a musical artist turned actor but by the end of the movie I was completely sold on 50 Cent the actor. His commitment was obvious as the dramatic weight loss he went through showed his seriousness and commitment to the acting craft. I honestly didn't believe he could pull this acting career off but after seeing this flick I have no doubt he can be as successful in acting as he decides he want to be. Once again outstanding acting job by 50 Cents and the rest of the crew. Would definitely watch a 50 Cent movie in the future. Highly recommended.","user":"eezyone","rank":[16,22]},{"title":"Things do fall apart","rating":7,"date":"29 September 2011","review":"The story line for this movie was excellent. The setting was believable enough to carry as a college background. I enjoyed 50 cent's portrayal of a young man dealing with life's struggles and unexpected bumps in the road. This movie brought tears to my heart. I appreciate 50 and the cast of this movie for putting together such a thoughtful message. (When life gives you lemons....). Even though there are moments where the acting was strained, I still take the movie as a whole and consider it to be great. I enjoyed the fact that it is basically a G rated type movie. I would allow my children to watch it and I would refer it just as much as some other inspirational movies. Thanks for keeping it clean.","user":"mystic_lover55","rank":[22,37]},{"title":"Did they all forget that he had CANCER!!!","rating":1,"date":"28 March 2015","review":"After watching this movie i don't even know what to say. I read the plot for the movie and thought it wad going to be a decent movie with a really good storyline. Boy was i wrong. About 30 minutes into the movie Deon Barnes (50 Cent) finds out that he has a tumor about a centimeter away from his heart. Up to this point he is supposedly the best player in college and is a front runner for the Heisman Trophy and projected to go within the top 10 in the NFL draft. <br><br>After hearing the news of his disease the movie seems to be going in a good direction plot wise. That will soon change though. At first everyone is very hopeful and optimistic for his future with football and his potential NFL career. Everyone is by his side and are doing all they can in order to help him make a full speedy recovery. However, about 10 minutes in after you find out about his cancer the characters drastically change their views on him and his situation. <br><br>All of a sudden his family and loved ones start turning his cancer into a huge burden for themselves. They all originally feel they can just ride his back and his success in the NFL in order to change their own lives around, which Deon was more than happy to help do without a second question. Suddenly they find out that he can never play another down in football ever again and his career is over, which is where everyone makes him seem like the bad guy. They start complaining about how he's the reason why his family fell apart and the reason why his mother is miserable and had to get a second job, as if he had a choice in the matter of him suddenly getting cancer.<br><br>Watching further and furtherer into the movie just made me more angry and upset about the characters themselves and the ensuing plot lines to come. Deon Barnes is now being punished for the next two hours because he was hit with the hardest news anyone would have to deal with, having a terminal disease. His family comes to the conclusion that he has basically thrown his life away, they don't want to help him at all with everything he's going through and worst of all no one is sympathizing with the main fact that HE HAS CANCER!<br><br>The movie soon takes a weird social, racial and economic turn within the storyline and it takes away from the fact of why he's in the situation he's in, in the first place. The basic theme I get from the movie is to show to young athletes that although they may have a promising athletic career ahead of them, they do not know exactly what will happen in the future so they should not forget to actually prepare for a time when a great athletic career may not be an option. I totally understand and agree with that lesson, however if you want to get that across to an audience do not give the main character and focus point cancer. Something that they cannot control and was not their fault in the first place. It seems like half way through the movie everyone just forgets that he has a terminal disease in cancer. They never address his sickness after about 15 minutes of finding out about it and everyone makes it seem like he personally threw his whole life away.<br><br>In the end i feel they could have gotten their point across with him suffering a career ending back or neck injury, something that would really only effect his football career. That would have forced him to face a true working man's life. For some reason it suddenly becomes his fault he got cancer out of nowhere and everyone seems to feel he is now a charity case because of it. Not to mention that he never asked for help from anyone while he was still in the top of his football career. He was going to help everyone he loved financially and give them a better life, and they took advantage of that. Once they realized that dream was out the window they resented him.<br><br>In conclusion, this movie had the potential to be a really great and heart filled, emotional plot, but they focused on the wrong things and took away from the main focal point, Deon had cancer. He was struck with a total life changing piece of news and everyone somehow made it about themselves instead of caring for their loved one and helping him in his time of need. They basically turn to him and say he threw his life away because he had to go and get cancer. I do not recommend this movie for the basic reason that not only does Deon Barnes' life fall apart, but the entire plot and storyline fall apart as well.","user":"corypullen","rank":[10,16]}]