[{"title":"Vermeer forgeries","rating":6,"date":"5 November 2017","review":"Han van Meegeren (1889 -1947) a Dutch painter, portraitist and restorer was one of the most successful art forgers in history; it is estimated that he duped buyers out of the equivalent of fifty million dollars in today's money. He was not successful as a painter, his work outside of the main currents of the time (impressionism, cubism); critics qualified his work as \"derivative\" and worse, although he had commercial success painting portraits of wealthy socialites. <br><br>Stung by lack of recognition and fascinated by the Dutch old masters, Van Meegeren decided to prove his talents by forging the work of some of history's foremost artists like Frans Hals and Johannes Vermeer (he was reputed to have produced more Vermeers than Vermeer himself). His methods were sophisticated enough to fool the foremost art critics and specialists of his time, although his forgeries yielded to more recent techniques involving radioactive isotopes and gas chromatography.<br><br>Van Meegeren's career had a spectacular ending in a trial after WWII where he had the choice of being executed as a collaborator and traitor during the Nazi occupation or owning up to his forgeries. Unexpectedly, at the end of the trial he became a hero to the Dutch.<br><br>This movie has been filmed in the somewhat breathless-over-the-top style of an American TV movie, and takes some liberties with the facts. It is, however, very entertaining and will teach you something worth learning, the life of a man that was tops in his profession, however questionable that profession might have been. Production values, cinematography and direction are excellent; acting could be a little more restrained here and there but is good too. Worth watching.","user":"hof-4","rank":[5,6]},{"title":"A real style copiest","rating":5,"date":"20 January 2019","review":"Seeing the film I concluded that Van Meegeren used the painting style and signature of Vermeer which received recognition as Vermeer paintings. Had he painted them under his own name, he would never have become famous.<br><br>I am no expert but isn't it strange that when a famous name paints a picture, every art critic or expert will say how good it is, but had an unknown person painted it, no one will except it as good initially until he is dead (not to step out of line). This means that art critics and experts don't know what constitutes good art and are no better than the average man. An average man will adore a painting as good art in the eyes of the beholder.<br><br>I had never heard of this painter and watched the show for this purpose. The film was more an art movie than a drama, not to my liking, style and type of movie for enjoyment. In my eyes Van Meegeren was an excellent painter, if experts accepted the paintings as Vermeer's!","user":"pietclausen","rank":[2,2]},{"title":"semi-truthful movie about a forger","rating":5,"date":"27 February 2018","review":"Movie that wants to entertain rather than question, educate or explore. In order to do so it deviates rather sharply from the truth. Now this is a strange choice, given the fact that it treats one of the most striking and bizarre criminal cases in Dutch (art) history. As a result one would suppose that the material writes itself. But I suppose that the makers of the movie were looking for a way in which to add large dollops of sex and romantic passion.<br><br>So you do get large dollops of sex and passion, complete with a Mysterious Muse, but you will have to provide your own questions (and answers) with regard to deeper themes such as the relationship between art and power, the construction of national identity through art, the limits of critical judgment, the influence of fashion on our capability to recognize beauty, and so on. <br><br>However, the movie, superficial as it is, DOES entertain. The locations and costumes are superb and the various actors do their best. Moreover, it will kindle many a dark emotion in the heart of artists (or would-be artists) who dream of taking revenge on critics, editors, managers or public.","user":"myriamlenys","rank":[1,1]}]