[{"title":"enjoyable if routine action film","rating":7,"date":"8 September 2013","review":"Great European locations are a highlight of this 2012 film, Erased, starring Aaron Eckhart. The film is also known as Ex-Patriate.<br><br>Eckhart plays an ex-CIA operative, Ben Logan, working for a European company. His wife is deceased, and he's there with his daughter (Liana Liberato), a typical teenager whose sullen behavior can be attributed to just losing her mother and being uprooted from her home.<br><br>Ben is supposed to test security systems made by the company for whom he works, but returning to the office one night, he finds that the entire company has disappeared, including the employees and his entire identity along with them. He soon finds out he's going to be terminated -- and by terminated, like in the ground terminated, so he and his daughter take off. He's determined to find out what's going on.<br><br>Shades of the Bourne saga, not as good, but still suspenseful with lots of action. I really like Aaron Eckhart and would love to see him in another leading role. He's very likable and attractive.<br><br>Entertaining without being sensational","user":"blanche-2","rank":[17,19]},{"title":"Good - probably will watch it again sometime.","rating":7,"date":"26 September 2012","review":"I recently saw this film just based on its stars, Aaron Eckhart and Olga Kurylenko. Having watched it, I wonder why it was not better promoted.<br><br>An action/suspense flick, it features Eckhart as a CIA agent whose cover suddenly disappears, putting himself and his daughter (Liana Liberato) in mortal danger. No surprise, it looks like some kind of ruthless cover-up conspiracy. Yes, we've all seen movies like this before, but this is a tense, taut, and well-made suspense movie with very good casting. Eckhart is perfect for his role as the pseudo-good guy; handsome, dapper, chiseled. Kurylenko is also great as Anna, the subtly beautiful and inscrutable former colleague and possibly lover, who has the task of bringing him in, whatever that means. Liana Liberato does a credible job as the estranged daughter who just finds out that her Dad is or was a killer.<br><br>The plot moves quickly from story setup to action, and the suspense never lets up from there. While it doesn't quite have the thrills of a 'Bourne' film, it kept me interested. And while you kind of know (or hope) how it will end, it is definitely fun getting there.<br><br>It is a good movie that I will probably watch again.","user":"shroyertour","rank":[81,107]},{"title":"solid action thriller","rating":7,"date":"27 September 2012","review":"I am a big fan of this genre, a genre that has been almost soaked of its originality, like most thriller i have watched, it didn't surpass the Bourne series but it was a series of clichés that was more comforting than worrying, Aaron Eckhart gives a very good performance as the lead character Ben Logan.<br><br>Liana Liberato gives a genuinely good performance as Eckharts estranged daughter Amy, who has been persuaded by Logan to leave her grandfathers custody in America in order to move to Belgium, to be with him.<br><br>The film starts off quite slow, but when the credits ran i was very happy with what i had witnessed, a good addition to the thriller genre.","user":"adam-quane","rank":[65,88]}]