[{"title":"Easily One of the Best Movies I've Seen This Year","rating":9,"date":"19 August 2012","review":"I came into ParaNorman with a sense of cautious optimism. I absolutely adore stop motion animation, and I genuinely fell in love with Coraline, LAIKA's previous effort, but the trailers for the film didn't capture my interest in the story in the way I hoped they would and this film also didn't have the benefit of being helmed by the brilliant Henry Selick (Nightmare Before Christmas, James and the Giant Peach, Coraline). That being said, I am extremely happy to report that ParaNorman absolutely delivers on every level you could hope for. <br><br>ParaNorman tells a story about a young boy named Norman who has the unusual ability to see and talk to the dead, an ability which has led him to be ostracized by the other members of his community, including his own family. The New England town in which he lives is famous for a historic witch execution, along with the legend of a curse that the witch put upon those who sentenced her to death. It turns out that the legend of the curse is true, and that Norman, with his ability to talk to the dead, is the only one who can prevent the curse from raising the dead. Unfortunately, Norman is unable to act fast enough and the Witch's curse begins to wreak havoc on the town. <br><br>ParaNorman is a film with many strengths. Stop motion animation is always a beautiful and fascinating process, and with new technological advances the filmmakers have been able to bring it to a level of detail and expression that are simply astounding. While the scope of the story may be smaller than something like Coraline or Nightmare Before Christmas, the scale of the stop motion sets for this town are truly incredible. The film absolutely immerses you in this world that feels like a living, breathing, place. As beautiful as the animation in Brave was, ParaNorman is easily the most visually impressive film I have seen this year. <br><br>As beautiful as the film is, it never falls into the trap of so many other animated films by simply being visual spectacle with no narrative soul. The story of the film is fun, intelligent, and heartfelt, and is supported by a great cast of characters. The odd kid who is misunderstood is a common trope in kids' movies, but what makes Norman stand out is that he's never mopey about it. He is ostracized, bullied, and rejected, but he's come to a kind of acceptance about the whole thing. He's certainly not happy about it, but at this point he's not trying to fit in, he's really just trying to keep his head down and get through the daily grind. This is part of what makes his relationship with the other characters in the film work so well. For instance Neil genuinely accepts Norman for who he is and it's obvious that this throws Norman for a loop and he doesn't really know how to interact with someone who \"gets him.\" This is never spoken, but it plays out naturally through the performances of the characters. <br><br>As the narrative progresses it takes some really interesting turns, and at times is genuinely surprising and emotional. Without spoiling anything, I'll just say that a large part of the narrative revolves around assumptions and misunderstanding, and it brilliantly uses the audience's assumptions and expectations about the genre and its conventions against them. <br><br>It's also worth mentioning that this is one of the rare films which decidedly benefits from the addition of 3D. There's some fun play with perspective, and being able to see the dimension that exists in these sets adds a lot to the experience. <br><br>I genuinely loved ParaNorman and it's easily one of my favorite films this year. It's not a movie for everyone, but if any of the trailers gave you even a glimmer of interest I would definitely recommend checking this one out. LAIKA is certainly beginning to make a name for themselves in the animation scene and I'm really looking forward to whatever their next project will be. I think I still prefer Coraline which definitely benefited from the combination of Neil Gaiman's fantastic story and Henry Selick's experienced hand, but ParaNorman is a truly fantastic film and it's definitely worth a look. <br><br>A-","user":"IllusionOfLife","rank":[75,100]},{"title":"A lot of fun, but probably not for the young ones","rating":8,"date":"6 July 2013","review":"The thing of it is, ParaNorman is pretty scary stuff for a PG movie, so you've been properly warned. This isn't some over-sanitized Disney movie. Everything from the lighting to the characters to the tense plot adds up to something you wouldn't want your six-year-old to drag you to, unless you don't mind paying for some therapy. But it's a terrific movie, with a style all its own and a madcap sense of ghoulish delight.<br><br>Norman (voice of Kodi Smith-McPhee) is an outcast. Know why? He talks to dead people. And indeed, we see them as well, chatting with our hero along his walk to school. Oh, and his grandmother (voice of Elaine Stritch) talks to him all the time while sitting on the couch in the living room. No one understands poor Norman, who's as resignedly freaked out as Haley Joel Osment in the Sixth Sense, so he has no one to talk to, not his parents (Jeff Garlin and Leslie Mann), not his sister (Anna Kendrick), and not the school bully (Christopher Mintz-Plasse) for sure. <br><br>It's only when Norman has an episode during the production of a school play (not coincidentally, about an old legend surrounding the town's dark past) that he gains a friend - another outcast, the portly Neil (Tucker Albrizzi), who teaches Norman that it's best not to let people bother you, to not let them get under your skin. Had the story ended there, we may have had a nice, tidy after-school special. Oh, but it does not! From out of almost nowhere, Norman's black-sheep uncle, Mr. Prenderghast (John Goodman), a heavily bearded, slightly loony chap, informs Norman that he - Norman! - must take the mantle of He Who Holds Off the Witch's Curse. Mr. P. has been doing it for all these years, but he thinks he's about to go. He warns Norman that it's all up to him and he must read from the book and then he dies. That was an intentional run-on sentence, for your pleasure.<br><br>Thereby our plot is set in motion! Norman must extricate said book from the dead uncle and then read it by the witch's grave in order to break the curse that no one really believes is real. They don't believe it on account of Mr. Dead Uncle has been reading from the book for his entire life, and someone before him, and so on. But now Dead Uncle is, you know, demised, and just before the witch is to rise from the ashes and wreak havoc! Oh, I should note that the curse goes like this - a little girl was suspected of witchcraft by the town elders and sentenced to death. So you can see why she might want to haunt those elders and the town itself for all eternity.<br><br>There are people raised from the dead, and the imagery is quite striking; bones, stringy hair, rent clothing, and the ability to remove an appendage and reattach it. Are these - uh - zombies - out to lay waste to the town? Or are they victims of their own device? It's up to Norman, his brain, and his innate ability to talk to dead people to somehow save the day. Despite being grounded, of course.<br><br>ParaNorman works on many levels. Adults will love the stylish, almost Gothic atmosphere; older teens will love the menace of both the zombies and the townspeople, not to mention the witch herself. There are, for an animated film, plenty of scares and dark themes - slightly offset by the themes of loneliness, friendship, heroism, and getting adults to just listen to you. For once! Ahem. Anyway, there's a sort of beauty in ParaNorman, as horror and light comedy are somehow blended to form a rich animated film.","user":"dfranzen70","rank":[15,17]},{"title":"A different kind of animated movie and approach. I really liked it!","rating":8,"date":"27 August 2012","review":"This was a rather surprising movie. It's unlike any other modern  animated movie and picks a new sort of approach, that should work  entertaining for both adults and kids.  There is plenty of 'simple' stuff to enjoy for young kids in this movie  but also the adults shall have no complaints about it. Throughout the  years animated movies often had both stuff for both kids and adults to  enjoy in this movie but I feel that the line dividing the two different  forms of entertainment is getting more and more blurry. Instead the two  things more often get effectively combined, with as a result more and  more movies get released that aren't being too childish for adults or  too mature for little kids. It's being perfect entertainment for just  about everybody!  I do admit though that I was a bit surprised to see how horror  orientated this movie was. Make no mistake about it, this is a horror  movie. It might be a bit frightening for some children but obviously  most shall be perfectly capable of handling it. Fantasy and movies can  be a great outlet and also stimulant for children's imagination, this  also includes horror orientated stuff. After all, most kids are of  course perfectly capable of making a distinction between real stuff and  fantasy.  And I do applaud this movie for not being overly fluffy or careful and  protective toward children. Not that that this is being a completely  dark, or scary, depressing movie to watch but overall it's being a tad  bit more dark and daring than just an average animated movie.  It's really having a style and approach of its own, which just doesn't  goes for its story or the fact that this is being a more genuine horror  flick but also really for its comedy and characters. The characters all  feel rich and very much alive (yes, even the dead characters!) and the  humor is more clever and often dialog orientated, as opposed to having  characters jumping around and falling and bumping into stuff. In that  regard this movie also feels far more mature than just the average  genre attempt.  And another important aspect about an animated movie; it's a really  good looking one! It's using stop-motion techniques and it shows that  this genre is far from outdated or dead. It's really something that  gives the movie an unique look and feel. I don't know, it's perhaps  pleasant that it's being something that allows the movie to feel 'fake'  and true exaggerated fantasy-like, as opposed to CG animated movies,  that are getting more and more smooth and realistic to watch.  It's also a movie with a great underlying message in it, that tells you  it's OK to be different and there is nothing weird or wrong about it  and you shouldn't just judge a book on its cover. It's still too bad  this message was lost on some people and I'm talking about those who  had a problem with its ending. It was perfectly suitable and fitted  perfectly into what this entire movie was trying to tell you for the  first hour and a half.  A surprisingly good movie in about every regard, that above all things  is being perfectly fun and entertaining to watch!  8/10","user":"Boba_Fett1138","rank":[59,78]}]