[{"title":"Premonition or Lost of Sanity?","rating":8,"date":"12 January 2013","review":"The family man and construction worker Curtis (Michael Shannon) is happily married with Samantha (Jessica Chastain) and they have a beloved deaf daughter, Hannah (Tova Stewart). Curtis works with his friend Dewart (Shea Whigham) in his team and his mother Sarah (Kathy Baker) has been interned in a clinic since she was thirty years old with paranoid schizophrenia. <br><br>Out of the blue, Curtis has nightmares and visions of an apocalyptic storm and he becomes obsessed to build a well equipped storm shelter for his family and him in his backyard. Curtis spends the family savings and gets a loan from the bank to prepare the shelter. His obsession affects his work and his relationship with the locals and Curtis loses his job. Does Curtis have a premonition or is he losing his sanity?<br><br>\"Take Shelter\" is an original drama developed in slow pace with magnificent performances. The screenplay is very well written and despite the running time of 120 minutes, the movie keeps the attention of the viewer until the very last ironic scene. My vote is eight.<br><br>Title (Brazil): \"O Abrigo\" (\"The Shelter)","user":"claudio_carvalho","rank":[44,49]},{"title":"A perfect storm of a movie, so take shelter and watch this film.","rating":8,"date":"18 May 2013","review":"A very good creepy psychological thriller. Reminds me of the Shining (1980) mixed with the Bible story Noah's Ark. Very accurate comparison. Great film, keeps you hanging by a thread with a feeling of uncertainty. Curtis LaForche (Michael Shannon) had a normal life with his wife Samantha (Jessica Chastain) and six-year-old deaf daughter Hannah. Until one day, he been having chilling nightmares about an oncoming apocalyptic storm that will end up killing his family. Those nightmares are some very terrifying and haunting scenes. I felt the one with him driving in the rain was the scariest. Second one is the birds dropping like flies. The nightmares continue to happen, as Curtis sees it as a sign that he must build a storm shelter. The only problem is money is tight, due to Hannah's health care and special needs education. He try to build it anyways, resulting in strain on his marriage and tension within the community that thinks Curtis is crazy. He starts to question himself, is he trying to protect his family from the storm, or from himself? The acting in the movie are very good. Michael Shannon did a great job. You can see it in his performance, as he fears the unknown, but yet trying really hard to stand up to his fears. Near the end he was also convinced that he was going crazy, but still in doubt. Jessica Chastain is astonishing. She acted beautifully and totally made me feel her pain as the character even though I've never been in her situation or in that kind of relationship. Totally convincing as an actress. The special effects and lighting were both good though as well as his psychological development. The musical score fits the mood perfectly. Beautifully crafted, like every single shot was given careful thought and planning by the director Jeff Nichols. I love the scene with the weird weather patterns. The movie reminded me of the movie, Melancholia (2011). Both characters were dealing with so called \"mental conditions\" that no one else could understand or believe, both had a feeling of impending doom. Both were excellent movies. In my opinion, I don't think building a tornado shelter is that out there crazy. It's not he was forcing them to live in a cave or in a mine for the rest of their lives. He wasn't forcing his family, but trying to protect them. The town people act like they never heard of bad storms in Ohio. There are always new reports of really bad storms hitting Ohio each year. Here are the faults of the film. The film is depressing. Some people might hate the ending of the film as it doesn't solve anything. There is no conclusion to the film. With the climax of the movie, it was sort of for shock value and not really need to progress the plot. The tone of the film is intensely ominous and I was very satisfied with the ending which came as a revelation to the characters and the viewers. Never have I seen an ending that leaves an impression like that. Incredible. Make you wondered if it was just another dream or real life. Overall: watch it to find out. I recommend it to anyone!","user":"ironhorse_iv","rank":[18,20]},{"title":"Is anyone seeing this?","rating":10,"date":"12 December 2011","review":"I'm going to try to be restrained in my praise of this film, but it's going to be hard, because I think it's about as close to perfect film-making as I've ever seen. I generally only write reviews for movies I've really loved, or really hated, and this movie I really loved.<br><br>This is a masterpiece.<br><br>I don't know where to begin, really. Leaving the cinema, I felt as though I'd had some kind of accident - a little as if I was in shock. I had a very strong physical reaction to this movie, in tandem with my emotional response, and in many scenes I felt my heart racing. This is powerful material and has been delivered with great skill. The pacing is perfect, moving slowly and quietly toward not one but several emotional climaxes, each greater than the last, allowing the audience to enter Curtis' world and share his emotions. The cinematography was beautiful, elegant, and achingly frightening at times; the dialogue was so real it hurt, and the soundtrack sinister and intense. Michael Shannon should win something for this role - he is Curtis completely and it's a complex and deeply sympathetic portrayal of the confusion of a good man, a complicated portrait of a man trying to BE a good man, in the face of his own fear. From the very beginning, the atmosphere is unsettled, and some of the dream sequences are heart-stoppingly frightening. The story is multi-layered, working with ideas of family, mental illness, responsibility, fear, the current feeling of the-end-is-nigh that everyone senses - when Curtis said, 'Is anyone seeing this?' I almost cried for him.<br><br>I have thought very hard about this film since I saw it two days ago and I simply cannot fault anything about it, not one thing. I know I'm going to see it many times. It left me shaken and moved and I cannot wait to see more from this writer/director. Hands down the movie of the century, so far.","user":"jadeitejewel","rank":[316,427]}]