[{"title":"A film without a story-line.","rating":2,"date":"29 December 2016","review":"Classic example of a film that had potential but which also had a producer who failed to see the importance of an actual story-line. (Which made any sense)<br><br>The story follows a family being lured to a village on the pretense of the father (a pastor) taking a job at the village church. The villagers have an ulterior motive. One of the family members is selected to be possessed by the devil, in a pagan type \"wickerman\" village ritual. The devil (occupying the body of possessed family member) is then left about its business to kill all but one of the family members. The remaining one is used in a further ritual to banish the devil back to wherever it came from.<br><br>The next family is lured to the village to continue the cycle.<br><br>All this is fine and dandy. But there is no explanation of crucial background details / any details to make sense of the plot?<br><br>Why the devil is given a sacrifice from a family to possess for just long enough to kill part of that family, before being unhappily banished again?<br><br>What happens if the cycle doesn't take place?<br><br>What is the criteria of the ritual which needs to be fulfilled? One dead, two dead? Once a year? <br><br>Maybe Just don't bother and see what happens??<br><br>Also things happen throughout the film which seem irrelevant or unexplained;<br><br>At one point the father within the doomed family is rendered unconscious with chloroform over his face and locked in a church. Why did that happen? Did they intend to save him from the devil?<br><br>At one point the other pastor of the village coughs up black blood when the possessed member (devil) is injured - I hoped this would lead to a twist in the plot which explained that he was manufacturing the whole need for this ritual due to an evil pseudo identity- but nothing more came of it.<br><br>At one point there is red crosses painted on the doors and at others scenes of sheep having their blood drained into buckets- can we assume one is connected to ther other. Can we assume the red Sheep blood crosses keeps the devil out? (Why?) <br><br>Assuming things is the theme of this movie.<br><br>all in all it's always enjoyable watching scenes of possessed people killing their family members. Even if completely random with no explanation for why it is necessary is ever given.<br><br>On a side note Can't help but notice striking resemblance between \"the devil\" and the grumpy girl from the well in \"the ring\"<br><br>:)","user":"michellegodfrey","rank":[12,13]},{"title":"Boring!","rating":3,"date":"1 October 2013","review":"Wendy (Heche) and her family have just moved into a new town where her husband is set to be the new Pastor in the church. What starts off as a nice new life in a town with great people soon turns horrific when the true intentions of the outgoing Pastor are revealed.<br><br>It started off really slow with no real character development. It went from a slow Feel good movie to a romantic until there was something like a horror. <br><br>It's all agonizingly slow build-up to one of the girls getting possessed by an ancient evil). Constant crosscuts give the impression that nobody involved could make it through a full scene without nodding off. <br><br>Even Anne Heche (not a big role) could not drag this movie out of the boring trash (not her best performance, mildly said). The music is sometimes far fetched and not in accordance with the current evnet. Almost everything seems to go in slow motion, Such as a pickup truck gliding past houses at the residential speed limit. The movie is a waste of time.....","user":"roth81","rank":[49,63]},{"title":"Oh dear, oh dear ...","rating":2,"date":"1 February 2015","review":"This is probably a film would make a passable 'first horror' film for a teenager ... however as a thirty something I found it dull, facile and utterly boring. If you like a film with some sort of pace - this is certainly not the film for you. It's a shame as the cast seems promising and the premise is actually quite interesting. The main issue this film has is it is sloooooow to the point of being a cure for insomnia. I'm assuming the idea was to give the viewer plenty of 'getting to know you' room with the characters so we really really care about them, get invested in them. Yeah -that doesn't happen here. All that happens is you find yourself watching the clock waiting to see how long it is before it ends. Adding to that is lacklustre cinematography, dull scripts and painful to watch teen led drama and all in all this film is a fail.","user":"xmaskal","rank":[12,15]}]