[{"title":"Hands down the greatest show about cars in the world.","rating":6,"date":"6 July 2005","review":"Top Gear is, without question, the single greatest show about cars on TV. What sets Top Gear apart is the attitude the presenters have. Other shows tend focus on reviewing all of the various technical details and specifications of the particular car they review... They'll give you more information yes, but they do so in a cold and clinical manner. That comes off as being a bit, well, German doesn't it? Top Gear on the other hand, refuses to take itself seriously, which is what makes it so great. Sure, Top Gear will talk about how many newton meters of torque the Mercedes AMG CLS65 has and how that makes it the most powerful production car in the world, but how will they convey that? By showing you just how many men it requires to beat it in a tug of war contest. They'll try to explain why the Cadillac Escalade, arguably one of the worst cars you can buy, is one of the coolest. They'll see how many motorcycles you can jump with a bus. Yes, you read that the right way 'round: How many parked motorcycles you can jump over while driving a bus.<br><br>But Top Gear is more than just goofing around in cars. It's witty, it's funny, and it makes you feel like one of the guys. The three presenters all poke fun at one another, at cars, at themselves, and all the while you feel like you are right there in the studio hanging out with them. Oh yeah, and you don't even have to like cars to like the show. There's something in it for everyone. For sheer car freaks, the filmed review segments of the cars have seriously high production value- You'd think you were watching a $150 million dollar film directed by Michael Bay. The are just that slick. The music selection used in the filmed segments is also top notch, with some of the coolest cuts from both then and now. The news segment, where the presenters sit down to discuss what's new in the world of cars, traffic laws, or motoring in general is riotously funny. You may not know who the Chief Constable of Wales or the British Minister of Transporation are, but trust me- You don't need to in order to laugh at them. Then there's the \"Star in a Reasonably Priced Car\" segment, where each week a guest celebrity will come on to do an interview and then race around the Top Gear test track in a budget priced sedan to see how they compare to other famous celebrities who have done the same. And for the girls that tune in? Well, there's co-host Richard Hammond.<br><br>It is the presenters (hosts) that make the show though. You'll love to hate Jeremy Clarkson, possibly the worlds most opinionated and boastful man. James May, in sharp contrast, is almost a stereotype of an English gentleman. Reserved, witty, and refusing to run on television, May is cursed with quite possibly the best narrative style and voice I've ever heard. Bringing up the rear is Richard Hammond, the youngest, shortest, and most enthusiastic of the lot. Women will love him, because he's also the cutest.<br><br>I'm not even going to mention their tamed racing driver who tests all of the high powered cars on the same track to see how they compare to one another, a mysterious creature dressed in white that is only known as \"The Stig\". Well, apart from that mention of The Stig. I won't do it any more.<br><br>But please, please please, make sure you watch the full, unedited, hour-long version of Top Gear, which in some markets is known as \"Top Gear Xtra\". There is a trimmed down 30 minute version of the show which omits the news, the celebrities, and trims the filmed reviews for time. It's still good, but nowhere near as brilliant. And avoid the horribly edited and mangled US version of the show. Arguably the best Car show on in the states, it is an affront to the glory that is the raw, hour long series that is broadcast in the UK.","user":"darrylzero","rank":[215,237]},{"title":"Simply the Best Television Program and DVD Series Devoted to Automobiles, Ever","rating":10,"date":"12 June 2006","review":"As an American, your selection of automotive programming is quite limited. On one hand there is the SPEED Channel that is not available in every market, and on the other there is the \"Powerblock\" on Spike TV that offers little more than how to add a bit of power to your Grandmother's '81 Caprice.<br><br>Even as an import, Top Gear simply blew my mind away during my first viewing of the show last year when The Discovery Channel ran a season of the show slightly altered for the US Market.<br><br>For one, the personality of the show is unlike anything I have seen before. The show's lead host, Mr. Jeremy Clarkson is rather opinionated on everything, and although he will never hide the fact that he does not like something, he himself is quite likable as a person. On the opposite side of the spectrum, there is Mr. James May, quite possibly the most British man I have ever seen on television or in the movies. He isn't offensive in any way, and although he may be known as \"captian slow,\" his presentations are quite enjoyable as they always seem to come from someone with a level head. Caught in the middle is Mr. Richard Hammond, a rather young Briton who embodies the current generation of automotive fandom. All together, the hosts balance each other out, and each offer their own perspective to the show, appealing to a wide range of people.<br><br>Outside of the \"acting,\" the cinematography of the show is breathtaking, given that it is a weekly event in the UK. Occasionally the segments rival that of some of the best television shows or movies that I have seen, and although they are primarily focused on the car and the hosts themselves, the surrounding environment often plays a large role in the different reviews.<br><br>...But then you add the great soundtracks of the reviews, the quirky setups to the different tests (such as a Bugatti Veyron racing a plane from Italy to England), and the great test laps done by the Stig... It all adds up to one of the greatest television programs, well, ever.<br><br>It truly is a shame that the viewing of Top Gear is generally limited to the internet via You Tube or Google Video here in the US, but there was a pilot filmed for The Discovery Channel in the US for an American version of Top Gear, but thus far, nothing has happened.<br><br>If you have the time, I highly suggest you take a look at the show, interested in automobiles or not.","user":"Masterchief49508","rank":[168,185]},{"title":"You don't even have to like cars....","rating":10,"date":"8 September 2006","review":"Yes, this show is about cars, but then again it isn't. Mostly it's about extremes of opinion, dreams and fantasies, dares, one-up-man-ship, and taking everything just a little bit further. And it's also entertaining - very entertaining, which is what television is meant to be, and so often is not. I'm not all that interested in cars, and my son doesn't even drive, but we both love the show, and watch it religiously.<br><br>The balance of presenters: Jeremy, the loud-mouthed, cuttingly funny, over-bearing older guy; Richard, the young, cute, quirky, adolescent one; James, the sensitive, quiet, contemplative, intelligent one; is nothing short of genius!<br><br>It seems that no expense is spared, either on the experiments and dares, or on filming, and this adds to the visual experience. This show is funny, even hilarious at times, classy, controversial, and hugely entertaining. Most people I know who watch this show know almost less than nothing about cars, and I think that says a lot about how successfully this program reaches beyond the expected demographic of young male petrol-heads.","user":"prose","rank":[102,111]}]