[{"title":"The word outrageous is not close to sufficing","rating":10,"date":"7 January 2011","review":"I feel that the Hollywood comedies these days tend to be quite identical. However, the Danish movie Klovn (Clown) is something extremely different, and quite frankly, it's hilarious.<br><br>Frank Hvam and Casper Christiansen are very popular in the Nordic countries after their TV series Klovn was a huge success and this movie seems to be the final puzzle in that series. And boy, what can I say? The series was great, but this movie is even better!<br><br>To put it short, the movie is about those friends, Frank and Casper, who decide to go on a canoe tour, which Casper chooses to call \"The pu**sy tour.\" However, the tour takes a drastic change when Frank takes his 13 year old cousin on the trip to prove to his pregnant wife that he's a worthy father.<br><br>What follows is a series of outrageous events on their journey which I'm not going to name here. However, I can tell you that most of the things in this movie is something you NEVER expected to see on film. That's why I'm so glad I saw this one, it's something absolutely new and so over the top that one can't help but feel awful but cry of laughter at the same time.<br><br>Frank and Casper are so self-centered and clueless persons that they have no idea what's ethical and what's not. They just can't seem to figure out right from wrong and that makes way for a lot of hilarious events! This is a movie that makes the audience feel so awkward, that most of the time you're saying to yourself \"no no no, he's not gonna do that, nooooo!!!\"<br><br>To put it short, this movie is something brand new and some scenes are so outrageous that you can't help but wonder what sick bastard wrote this script! But no doubt, it's one of the most hilarious movies I've ever seen. If you have the possibility to see it, you simply have to! You'll never regret it.","user":"alexanderf","rank":[73,82]},{"title":"Incredibly funny but you wonder if it's safe to laugh","rating":9,"date":"15 January 2013","review":"The film is about Frank; a gullible and dim man who is trying to prove to his girlfriend that he has what it takes to parent a child. A series of events unfold and Frank ends up looking after a 12 year old boy and taking him on a \"lads camping holiday\". He sees this as his chance to shine and to give the boy a fantastic father like bonding holiday. However there is a festival on and a college trip full of older female students so the mans friend Casper has other ideas. This is a lads break and he will stop at nothing to enjoy it.<br><br>As with most outrageously funny comedies it pushes what is acceptable and what is not to the very limit. I wont give any of the key scenes away as it would spoil the film but I will say it's is very similar to Curb Your Enthusiasm in terms of it's comic timing and style - although it steps a lot further over \"the fine line\" of what is \"acceptable\". <br><br>In terms of story it's non existent and the characters are so over the top you can't really care or feel for any for them in any way. The handful of laugh out loud scenes and dialog totally make up for it and the actors deliver them perfectly.","user":"mark-578-474474","rank":[30,36]},{"title":"The funniest movie ever.","rating":10,"date":"17 March 2015","review":"Having watched and re-watched this film many times and consistently found it hilarious, I can only give it a 10 out of 10. Yes, it is extremely rude, and if you are the sort of person who gets offended, then, yes, you WILL get offended. Yes, it does walk an extremely fine line, but in my opinion it walks that line successfully. No, you are not supposed to admire Casper and Frank, and their adolescent boy-man personas, and the way they trample all over moral and social taboos. But perhaps you will recognize a bit of yourself in them (a bit that, as an adult, you should be keeping deeply repressed!!!).<br><br>After seeing the film, i was so excited to find out that there were 60 episodes of the TV show to watch too (currently available on HULU). All are just as good as the movie. One thing in the movie that didn't come across as well as in the TV show is the personalities of Casper &amp; Frank's partners Mia &amp; Iben. They really do a lot to hold the show together, and it's men's relationships with the women that really takes they show to another level beyond what was done in Seinfeld &amp; Curb Your Enthusiasm -- though Klovn definitely owes those shows a debt. My wife definitely loves the TV show, because of the women, but was less enamored with the movie, where the women play a much smaller role.<br><br>Will it work in America? No, Not on as large a scale scale as it should. The humor is far to terrifying for your average, fearful yank. I love that Danny McBride is going to attempt a re-make, and after Eastbound &amp; Down he might be the only man that could &amp; even he will have to dumb it down. On the whole, I am much more excited about the original duo's Klovn Forever, due out in Sept 2015.","user":"chuckwheel","rank":[19,22]}]