[{"title":"Did All The Actors And Crew Write The Reviews On Here?","rating":1,"date":"11 May 2012","review":"If you only read the first couple of reviews for this movie you would think its one of the best Slasher flicks in a while, but in reality it is not only mediocre but it had perhaps one of the most laughable plot lines in horror history.<br><br>Now the last thing I expect when going into a slasher flick is originality, so it didn't bother me that this movie was basically just a rip off of every other backwoods/small town horror movie ever made. What bothered me was the unlikeable characters, terrible dialogue, and just the pure dullness of the first hour or so of the movie. <br><br>The all around feel of the movie just felt so unprofessional and all over the place. There is a point in the film where the characters just keep returning to this diner to talk to this elderly woman behind the counter (who is easily the worst actress in the film), this got incredibly repetitive and I found myself screaming \"SOMEBODY JUST DIE ALREADY!\"<br><br>I saw that one of the other reviewers on here said that if you enjoyed Hills Have Eyes and Wrong Turn that you will enjoy this film, that statement couldn't be further from the truth. The Hills Have Eyes and Wrong Turn were two excellent horror films that kept you on the edge of your seat with bizarre kills and fast paced story lines. This movie puts you to sleep for an hour than ends in a not so bloody mess and leaves you wondering why you sat through the whole thing.<br><br>Another mediocre slasher that manages to be worse than all the other copy cats out there. Avoid it, 1/10","user":"HorrorOverEverything","rank":[19,24]},{"title":"I Paid For This?","rating":1,"date":"16 June 2012","review":"Besides being mediocre, this film was a straight pile of crap. Kitchen knives with double-sided blades, shovels as a main murder weapon, and a whole damn town in on a murderous conspiracy? WTH. Oh, and what the hell kind of undergraduate major writes a thesis about a pseudo-nonfiction book and the town it concerns? Is that for the Bachelor's of Science in Utter Crap? The idea for this movie had a great deal of potential, but it was poorly realized and executed.<br><br>Also, guns. This is America, there are plenty of people exercising their 2nd amendment rights, so how is it that there is an entire town of people without a. single. freaking. gun.?!","user":"hell_astateofmind","rank":[9,11]},{"title":"drivel, sobbing victims make noise so the killer knows where they are","rating":2,"date":"12 May 2012","review":"Not another total waste of time where the young girl always sobs away her location or falls down when she could have run away. Not another pig mask to make someone look primal. Girl sees her boyfriend dead and she tries to run away like she can barely move. The killers can never run but can outrun any pathetic victim they chase. This movie started out credibly enough and contained more beyond stupid outcomes than I've ever seen. I had to write this so I could say shame on you to whoever made this drivel. Shame, shame, shame on you, you untalented lousy film maker who should never be let near another camera again or one of your movie viewers should take care of you themselves for wasting their time. to reiterate, shame, shame, shame","user":"keithhr","rank":[19,27]}]