[{"title":"WHY did they do it? I think I know why...","rating":7,"date":"25 December 2013","review":"Like so many other people my first thought after seeing the trailer was: \"WHY are they doing it? This will be pathetic!\". Our family still went to see this movie on the opening day - and me, my wife, and the kids aged 10 and 14 all had a lot of fun watching it. Yes, it had some cheesy lines and less than perfect moments but I would never call it pathetic. I liked it so much that I registered on IMDb to write my first review. The movie actually answers the \"why\" question - and somehow this answer is the best way to describe how the film makes you feel. Yes, De Niro and Stallone fully realize that they are way past their prime and will never make anything comparable to \"Raging Bull\" or original \"Rocky\". They just do not make the drama out of it, do not take themselves too seriously and do not see the roles that made them famous as some sacred ground that can't be touched. They just want to have some fun while they are alive - and may be help others have fun as well. Not a bad way to feel about getting older!","user":"vkupchan","rank":[137,169]},{"title":"Rocky Light","rating":6,"date":"19 December 2013","review":"Sylvester Stallone must really love boxing. After returning to the Rocky films this past decade, he once again enters the ring in Grudge Match. But the smart thing here is that he's kind of poking fun at himself. Instead of trying to play a younger boxer which wouldn't be realistic anymore at his age, he plays a retired boxer who really is old this time around.<br><br>The story focuses on a rivalry between two boxers who fought each other a couple of times 30 years ago, winning one fight apiece. Naturally, that situation calls for a \"rubber match\" to decide the true winner. But it never happened. Hostility remains between the two guys 3 decades later though. Stallone plays Henry \"Razor\" Sharp and Robert De Niro plays Billy \"The Kid\" McDonnen. When the two both arrive on set for a computer-simulated video game that will use their likenesses, they engage in a physical altercation which soon goes viral for all the world to see. This prompts a desire to see the two of them in the ring together once again.<br><br>Kevin Hart plays the loud-mouth promoter who puts the fight on. He plays the same type of character he always plays, but still very funny nonetheless. The same goes for a funny Alan Arkin as Stallone's trainer who also plays the same type of character that he always does. So there's nothing truly unique about the movie, but it doesn't take itself too seriously and that's kind of a good thing. It focuses on the funny for the most part, but also adds some depth to the characters when it shows the struggles they're having in their personal lives. That's part of the reason they agree to do the fight... along with a genuine grudge the two still have between each other after all these years. Some of the jokes can be lame at times, but there are some good zingers here and there when seeing the two old guys poke fun at each other. And the fight at the end of the film is done well and worth waiting for.","user":"djp2000","rank":[48,61]},{"title":"Better Than I Thought","rating":9,"date":"29 December 2013","review":"I went in hoping that I would be at least mildly entertained. Wow, was I wrong. This movie is solid entertainment with a soul. Yes there are some solid principles to live by in this movie... and some to ignore. The acting was superb. I expected Stallone and DeNiro to be somewhat burnt out. But, they portrayed vivid characters. Stallone's motivation as a character was largely a mystery until about halfway into the movie. Definitely a mirror of life today. And, it had a decent ending that was digestible. I respected their life work before. But, this movie is likely to make you a fan... or at least of the story. I did not mention the other actors. But they are all stars in this worthy story, filled with laughs, mystery, and drama. What's not to like?","user":"henri360","rank":[75,106]}]