[{"title":"An old man's attempt to pander to the youth","rating":6,"date":"12 December 2018","review":"Ready Player One is inoffensive enough to be entertaining but gets a bit stupid when thought is put into it.<br><br>Ready Player One is a very fun movie with the very experienced Steven Spielberg behind it. Visually it's stunning, full of glaring moments and Spielberg-Esque choreography and sound. The musical score too is done similarly, adding to the aesthetic pleasure of the film.<br><br>That is when Ready Player One starts to go downhill. The first major issue is the spoon-fed pop culture references (especially the 80's) to today's adolescent audience. The film thrives on them and it starts getting overwhelming and annoying after a few.<br><br>The second issue is how much watered down the film is from the book. All of the sticking points of the book are completely ignored making the books relatively dark narrative feel soft in the film which is almost insulting to the book.<br><br>The final major issue is the illogicality of the plot. How is one kid able to find all the answers to the OASIS but a whole company of man and women working together isn't?<br><br>Besides from the film being stupid and illogical it still manages to be mostly fun from start to finish is and worth of some praise for its vigorous visuals.<br><br>Final Grade: 6/10","user":"Aaron_Kyle","rank":[217,304]},{"title":"Vintage Spielberg","rating":8,"date":"16 April 2018","review":"I've noticed quite a few reviews here from book fans complaining that the movie wasn't true to the novel. As a fan of the book, let me just say that's true but it's fine. The overarching story is the same. The fact of the matter is with a nearly 400 page novel packed full of pop culture references, some things would have to be cut to make it onto the big screen. Partially it's an issue of length. Partially it's just the reality that the planets were never going to fully align to allow use of many of the properties from the novel. Yes, I loved the 2112, WarGames, D&amp;D, Joust, et al references from the novel as much as the next person, but still I felt that Spielberg captured the wonder and fun and the story of the novel accurately, even if he did so using different references. The are actually some things I even think were an improvement from the book, especially the way they re-imagined I-R0k. The bottom line is, if you're a book reader, just take this movie for what it is, an alternate version of the story, written by the same person who wrote the novel.","user":"MnemonicDevice","rank":[249,358]},{"title":"Ready Player One: Considerably better than I expected","rating":9,"date":"5 September 2018","review":"There seem to be two camps as far as Ready Player One is concerned, those who have read the books (Who tend to dislike the movie) and those who haven't (Who tend to like the movie). I'm in the latter group and am very thankful for this.<br><br>When the trailer came out I was unimpressed and didn't get onboard with the hype at all, yes I was impressed with all the pop culture references and characters but I figured it would be all flash and no substance.<br><br>Thankfully I couldn't have been anymore wrong, Read Player One has plenty of substance, emotion and charm and I thoroughly enjoyed every minute of it.<br><br>Set in a near dystopian world where people use a virtual reality world called the Oasis to escape their lives it tells the story of one player and his efforts participating in a competition that with decide the fate of the entire universe (Oasis).<br><br>The plot if fantastic and very well handled, the movie looks like a billion dollars, the cast did a decent enough job and the pop culture references though thick and fast didn't overwhelm the movie like I feared they would.<br><br>From Overwatchs Tracer, Streetfighters Chun-Li &amp; Ryu, Teenage Mutant Ninja Turtles, Iron Giant, Chucky, Freddy Kreuger, Mortal Kombats Goro, Gundam, Mech-Godzilla, King Kong, and countless more I being a big ol'nerd really appreciated this. Combined with the incredible mostly 80's soundtrack it's a sight to behold.<br><br>The movie wrapped up nicely and went in directions I didn't expect, I'm suitably impressed and would love to see more.<br><br>If it's very different than the book I understand peoples anger, for me however this was fantastic.<br><br>The Good:<br><br>Looks amazing<br><br>Solid plot and delivery<br><br>Pop culture references are charming<br><br>The Bad:<br><br>Honestly nothing springs to mind<br><br>Things I Learnt From This Movie:<br><br>I'm still not impressed with Gundam<br><br>People CAN swear in Spielberg movies<br><br>Old Simon Pegg looks like a tall hobbit<br><br>Artemis is the offspring of an elf and a porcupine","user":"Platypuschow","rank":[82,124]}]