[{"title":"Sensitively done","rating":8,"date":"18 August 2014","review":"In spite of some of the violence (not too graphically displayed in most scenes), the film was well-and-sensitively done: realistic, well- considered, edited and displayed. Although I'm not a fan of that specific genre of music, it was well-chosen for the film (nice 'trailer song'). I'm recommending it because I believe the producers and directors had a genuinely-interesting story to tell. They chose good actors, researched the history, and made action and sensitive moments believable. The time-line was a little tough to follow at first, but you eventually catch up with that. They did it well. ~Bob Shank, Tucson AZ","user":"bobshankjr-2","rank":[9,10]},{"title":"An urban tell of a kid who took the wrong path for a long time, then decides to get his life together.","rating":6,"date":"14 January 2014","review":"Whenever a film is based on a true story there are a few guarantees. The first being the story will likely be long so the writers can embellish where they need to, and the second guarantee is that for every interesting moment in the film, you are guaranteed at least 10-20 minutes of boredom. Jamesy Boy is no different, but unfortunately while other films make up for those 10-20 minutes by using jokes or drama, Jamesy Boy just gives same old same, same old.<br><br>Characters &amp; Story<br><br>The focus of the film is James (played by Spencer Lofranco) who is a troubled kid. He gets into fights a lot, usually falls with bad crowds, and he has been in and out of institutions since six years old. Reasons vary, but one time includes pulling a knife on his mom's boyfriend, for reasons not explained. Said mother Tracy (played by Mary-Louise Parker) is seemingly James' last hope and despite it all, she remains in his corner. However, a mother's love sometimes isn't enough, so James goes out into the world and ends up finding Roc (played by Michael Trotter).<br><br>This leads to James being Roc's errand boy and him hanging with this girl name Crystal (played by Rosa Salazar) who is somewhat the village bicycle, but James' main squeeze. But, as time goes on, and James realizes he can't keep up with the gangster life, he tries to trade in Crystal for Sarah (played by Taissa Farmiga) and maybe try to live a normal life. However, with one last deal asked by Roc, everything goes to hell as Crystal snitches on him and then James ends up in prison.<br><br>From there, James meets Guillermo (played by Taboo from the Black Eyed Peas) who is in a rival gang; Chris (played by Ben Rosenfield) who is the new kid on the block; and most importantly Conrad (played by Ving Rhames) who seemingly acts as some type of father figure to James. But, with all that has happened, though we see James get out of prison, and are told before the credits what has happened to the real James, you are left wondering if he will stay on the straight and narrow and prevent himself from being a statistic, or lead the life expected?<br><br>Praise<br><br>When it comes to the film, certain scenes and elements are worth praising and act as a silver lining to the overall production. For example, it is nice to see the two Middleton co-stars Farmiga and Lofranco back together and have a little bit of romance. Also, though not always, Lofranco does well in some scenes and does show why he was casted as the lead in the film.<br><br>Criticism<br><br>However, most of the film feels like a drain on your time in which you could find something better to do. And this is not said to take anything away from the real James or those who participated in the movie, but between them jumping from before James was locked up, to him when he was; watching him as an errand boy, which may include guns and drugs, but plays out so familiar that even those moments don't wake you up; and then with most of the performances not drawing you into the story nor characters, I do feel that while the story perhaps would be interesting if told by the source, the movie portrays that story with one too many flaws to really get into it.<br><br>Overall: Skip It<br><br>Though it was good to learn at the end of the movie James is doing well in his life, this to me would have been better as a documentary than as a dramatic film. For though you can see effort from the actors, there is something missing that keeps the film from having a heart and feeling like it is alive. Hence why I say to skip it. Though usually I would say something is worth watching on TV, there comes a point where a film maybe worth nothing more than experience for the cast and production crew, and background noise for the viewer. Which, sadly, is what I see Jamesy Boy as.","user":"Amari-Sali","rank":[20,26]},{"title":"This isn't a perfect movie but I do recommend this & was surprised by how good it was. A lighter version of American History X","rating":8,"date":"24 January 2014","review":"\"I don't think I let the people in my life down by making the wrong choices. I think I let them down by convincing myself I never had a choice to begin with.\" James (Lofranco) has been in and out of correction facilities his entire life since he was 8. After his latest stunt lands him in prison he looks back over his life and his choices. He sets out to straighten out his life, but it's not as easy as he was hoping. I knew nothing about this story going in. Once again though the fact that this is a true story made me more excited about it going in. While not nearly as powerful the movie did remind me a little of American History X in the the way that a person can live his life one way without apologizing but when removed from that life he realizes the error in his ways and tries everything he can to change. There are some pretty big names in this movie but the kid that plays James is a perfect choice and really carries as well as outshines everyone else. While this is in no way a perfect movie I do recommend this and was surprised by how good it was. Overall, a lighter version of American History X that I recommend. The fact that this was a true story helped as well. I give this an A-.","user":"cosmo_tiger","rank":[26,38]}]