[{"title":"Just Bad","rating":1,"date":"18 May 2014","review":"I'm not sure if I watched the same movie as the other people on this  comment section or people have no taste in movies anymore, or these  people work for the production company but this film is \"just bad\". The  comments and trailer makes it out to be this great monster movie. It  was just a mess, the writing, the acting, the effects the lack of  scares, or lack there of, and the guy from Ghost Hunters Britt Griffith  should be banned from acting because I have seen boards act in a more  exciting manner than he did. The story is all over the place from a  action to a bad, bad B movie horror flick. I just did not get any of it  and I think I even dosed off a couple of time during it. A sea monster  showing up every 30 years? Does he have a clock and a calender? I  really should have turned it off after the first 15 minutes but I  figured maybe, just maybe it would get better but it never did. The  poster kinda resembles Piranha and who ever put together the trailer I  give the one star because they got me to watch this trash. Otherwise  the movie just stinks of bad rotten sea monster.Oh and by the way where  was the monster? I was waiting for his or her grand entrance but all I  got is a few peeks and some groaning, roaring or whatever the sound  crew had in their short list of monster sounds. If you want to watch a  move about the water then you can watch this move because it stinks  like dead fish.","user":"mrlmann1","rank":[49,70]},{"title":"Direct to DVD?","rating":3,"date":"18 May 2014","review":"This entire movie (I don't know why I watched the whole thing)... was shockingly awful. I LOVE bad movies. But one moment I'm turning up the volume to hear the speech over the loud sound track, the next I'm turning it down because everyone is yelling.<br><br>I kept hoping it would get good. It had tons of potential... but it just never met that potential. What was the point of Auriel? She did NOTHING in the movie. I'm pretty sure she was just a hot piece of tail for eye candy.<br><br>The biologist accomplished nothing. Solved nothing. In 30 years, that oversize Lamprey Snake is going to come back. But good news! She gets to play the grieving adult orphan! Never mind she hadn't spoken to her father in like 20 years.<br><br>But,then again, it's a town of meth heads, so maybe there isn't really anything worth saving?<br><br>Awful movie. Even by my standards. Only gave it 3 stars because as bad as it was, it still kept me interested enough to watch the whole thing, even if I DO regret it now.","user":"dtf85901","rank":[22,29]},{"title":"One of the worst films I've seen in a long time","rating":1,"date":"21 May 2014","review":"Pro's: It ends.<br><br>Con's: It's boring, boring to the point of complete tedium.<br><br>The characters are the most, miserable, nasty and downright unlikable cast you will ever see. I literally wanted them ALL to die.<br><br>The effects, they're aren't any, a little bit of blood in the water and lump of rubber that jabs into a leg over and over as the camera shakes around all over the place, so you can't tell what you are looking at. You NEVER see the monster barring a quick flash of some kind of teeth in the last few minutes.<br><br>The plot, seriously, it actually does have a nice idea in there somewhere but the story just keeps jumping from one set of people in one location, to another set in another location, while trying to cleverly follow about 5 different story threads. It just becomes confusing and fails miserably. The actual monster plot takes up about 5 minutes of the whole film, the rest might just as well have been a dull family drama.<br><br>The camera work, sound and lighting in this film are dreadful. Shaky camera work, bad lighting and sound that at some points, is so low that you can't hear anything and then in other parts, it's loud and bellowing.<br><br>The artwork for the poster is misleading and the people named on the poster are only in it for a few minutes. James Duvall must have about 2 or 3 minutes of screen time, it's ridiculous.<br><br>All in all a really dull, boring and poorly made, horror (sniggers) film. Avoid!","user":"phantasmda","rank":[27,40]}]