[{"title":"A good start but....","rating":7,"date":"21 December 2010","review":"Been waiting for this for a long time.... and now it's here.<br><br>The Good stuff: The voice acting was superb, everyone did a perfect job. 10/10.<br><br>Ambient music and general mood of the movie is dead on, I especially like the first minutes after landing on Mithron, the setting and mood just awesome. 9/10.<br><br>The detail of the warhammer 40k world, equipment &amp; lore, is nearly perfect 9/10.<br><br>The Mediocre stuff: CGI and animation of characters notably melee combat was a bit awkward... maybe its just me, but it was fair for a first try 5/10.<br><br>The story... not bad, not good, a bit simple, expected a little bit more from Dan Abnett 5/10.<br><br>The Bad stuff: The Spacemarines! now I saw this with a friend of mine who has little or no knowledge of the 40k universe, and I had to explain a lot to him before and during the movie, and before the movie I told him about the spacemarines as being huge superhuman bad asses who kicks butt, whether its an army of heretics or aliens, after the movie he asked \"whats so special about the spacemarines?\" and to be honest I had the same feeling, you don't get the feeling they are anything special, not that I'm saying you feel like they are wimps, they just lack the Superhuman quality 3/10.<br><br>On board the Reclusiam, where are the Ultramarines serfs? who is flying the thing? are the only ones aboard the 12 Ultramarines and a couple of servitors? Here they could have put a few normal humans in, and see the Ultramarines stand head and shoulders over the tallest of the puny humans, but no instead you get a feeling that the Reclusiam is devoid of the and some computer flies the ship... 2/10 Way too short 76 mins? this is reflected in the plot of the movie which is pretty simple Buuuu! :o) I really wanted to score this high, but my personal verdict is... well 6/10 wait +1 just because it a 40k movie so final verdict 7/10.<br><br>Will I buy more 40k movies? yes! will I recommend others to buy and watch it? yes! will the fans be disappointed? no I think not :o)","user":"imglorious","rank":[71,86]},{"title":"Better than the trailers would have us believe.","rating":7,"date":"18 December 2010","review":"So here we have our first Warhammer 40,000 movie.<br><br>Immediately there are some flaws that need to be addressed: Codex Pictures, the company responsible, have created this movie out of nothing less than a love of the background. While this is not a problem (and you can tell that they're not about to make any mistakes with the lore) this does mean that they've done it out of their own pocket. Games Workshop who own Warhammer 40,000 did not put any money into the movie! What we're left with is a CGI movie which suffers from bad CGI in many places. At worst, this can mean that shots look like they're from ancient video games (Ages of Empires I's cutscenes spring to mind). At best, which seems to be just as frequent, the shots are actually quite stunning. Mostly, it averages between the two.<br><br>There you have the first fault, the second is camera-work. Yet again, this is variable and at the start of the film I thought it was awesome. However, as the film progressed I felt that the camera shots managed to spot and point out the bad CGI. And while the beginning is strong in this film, the middle seems to hold on to lingering camera shots just a little too much. This, I fear, is the reason a lot of the action is not quite as exciting as in the beginning. That, and a lack of the mighty soundtrack to accompany these scenes.<br><br>Now, before I commence with the good I must address that this film is for fans of 40k. An ingrained knowledge of the background and understanding of Space Marines and Chaos is required to get full enjoyment out of the movie. It is not to say that you won't find it entertaining as a newcomer but you may find certain mannerisms of the protagonists strange, or not understand what an astropath is, or find it difficult to believe that this elite squad is after a relic that happens to be a book... the list goes on.<br><br>Warhammer 40,000 is an established background which started rooting itself in '87. No exceptions are made to explain it's immensely vast background in this movie. As a matter of fact, it focuses on relatively little when you look at ALL of the other things that didn't make it into this movie.<br><br>Now for the good:<br><br>The first thing that springs to mind is the Story. Given reign over the script for the first 40k film is top 40k novelist Dan Abnett. He delivers. Whenever there wasn't enough happening a timely line would add depth, humour or character to the film, keeping my interest throughout. It's great how the soldiers who refer to themselves as brothers feel like a brotherhood, and that each character acts as an individual (though it may be a little hard to tell more than four apart when they don helmets) with their own personalities and motivations.<br><br>The plot is pretty strong for a 70-minute flick. As far as I could see there were no plot holes and as far as plots go this one seems straight forward but still manages to pack a few surprises.<br><br>Next for kudos is the soundtrack. Though tastes may dictate whether or not you like this soundtrack, it is very appropriate for the movie. The kind of Latin chant is very fitting for Astartes warriors and their monastic-militant lifestyles. The sound of these chants are very strong and evoke powerful emotion. The opening scene aboard the Ultramarines' Strike Cruiser is a high example of this and is used well to implement the action and dialogue.<br><br>Thirdly comes the voice actors. These voice actors are brilliant and fill the boots of Astartes perfectly. Though you may prefer the baritone thunder of THQ's Space Marines in Dawn of War II, the voices chosen make characters more distinguishable and less like generic action heroes.<br><br>Lastly a mention goes to all the parts in this movie that rang true to fans like me. With any other company such a movie would look a hundred times better but would be at massive risk of not being true to the lore. We've seen it a million times before, it's just good to see it done right.<br><br>Overall, the film starts strong, wavers in the middle and builds again in momentum near the end. It isn't perfect but with all considerations on the table - it's good - 7/10.<br><br>A Final Note: If you love Warhammer 40,000 and want to see better movies in future, go and buy this. Buy it for you, buy it for other people you know'll like it. Buy it even if you didn't like it. It took Games Workshop 20 years before they let any company make a move, and it was this one. Future Warhammer 40,000 movies with other races and new stories (maybe even Horus Heresy movies) rest with the amount of money this film makes. Codex are out on a limb here. Furthermore, if you've watched this and are able to make videos, upload a review to the Ultramarines website. They can't improve their movies without knowing what they need to improve (and I'm sure they'll be happy to hear the positive feedback too!).","user":"edcatfish","rank":[49,60]},{"title":"Brave try, solid start but flawed","rating":6,"date":"17 December 2010","review":"The background behind this film is a shoe string budget, some real fans of the genre and a writer who is well respected in the realms of fantasy literature. So with that in mind to compare this CGI film with the best of Pixar or Avatar would be unfair as it was never going to have the same \"wow\" factor.<br><br>For the uninitiated it is the 41st century and the human galactic empire is at war. Humanity's front line of defence is the space marines. Genetically enhanced super soldiers utterly loyal to the emperor encased in powered armour suits with very big guns.<br><br>This is the problem because while the movie looked better than I expected the whole (rather short) film revolves around a platoon of these humourless, quasi-religious soldiers going on a very linear mission. The script may not even be 60 pages long, nobody talks in anything other than short sentences and there are far more lines like \"For the Emperor!\" than anything approaching character development/banter and while that's fine for action scenes, as a film it makes the whole thing seem hollow.<br><br>The action is perfectly acceptable but nothing special and the whole feel of the movie is like a group going into a haunted house and are picked of one-by-one. The fact it is CGI allows some impressive vistas, a very large mother ship and some spooky supernatural going on but while every penny is on screen, you never really care about any of the protagonists so more time should have been spent on the basics- story, characters and dialogue and little less on the tech.","user":"Tostig66","rank":[58,73]}]