[{"title":"Dark meditation on middle age regret","rating":10,"date":"13 December 2011","review":"A film as powerful as it is disturbing, I Melt With You is for those of us who loved \"requiem for a dream,\" \"old boy,\" \"irreversible,\" and \"eraserhead\" for their darker truths. The four anti heroes here are the people we know if we open our eyes and look around. Intentionally bleak, it takes a cold look at a group of men who have made bad choices in their lives and come face to face with them. Not everyone is honest enough to admit the vast difference between who they said they would be and what they actually became. These characters are. And what makes I Melt With You even more disturbing is the backdrop of Big Sur. It is the ugliness of living set against the power and beauty of nature. I found this movie incredibly moving and original, but, like the movies above, it is not for everyone. Oh, the soundtrack is the best I've heard in years.","user":"richard-ames86","rank":[72,94]},{"title":"A triumph of audacity and vision","rating":10,"date":"29 December 2011","review":"In an era of forgettable films, this movie dares to go full throttle, staying in your bloodstream for days. It takes a complex and dark look at the mid-life crisis, which for many is not just a cliché. It has a punk rock, take-no-prisoners attitude that clearly makes people uncomfortable. Before I saw it, I'd read reviews about \"self-indulgent, whining white guys,\" but I think these people missed the point entirely. This movie is about paying respect to the dreams you had when you were young, however naïve they may have been. It's about pain, honesty, friendship, and a certain degree of insanity. These characters aren't heroic, if anything expect the opposite. The four actors give raw, unhinged, moving performances.<br><br>Is it for everybody? No. It's polarizing, in-your-face, and also one of the most daring and original films I've ever seen. If you're looking for a movie that makes you feel something, that makes you think about choices you (or the people around you) have made, this is a must-see.","user":"beth-mcmann","rank":[64,86]},{"title":"Amazing film! Haunting and vivid.","rating":10,"date":"14 December 2011","review":"I am very surprised to see so many bad reviews. I first wanted to see this film because of the cast and I am an independent filmmaker that enjoys the oddball films.<br><br>What I loved most about this was the soundtrack mixed with this ever depressing plot. This film is Alexander Payne on cocaine. Yes it is depressing but so are legendary film such as Trainspotting.<br><br>Much like Trainspotting and the amazing Director Danny Boyle, this film has some of the most beautiful photography around. Weird and crazy, mostly out of focus and shaky/abnormal shot help portray the chaos of this film.<br><br>If you honestly sit and watch this film for what it is (an experiment to dive into the soul and inner thoughts of middle-aged men) and not the next Hollywood Blockbuster then I think people may enjoy it more.","user":"Devon_Haines","rank":[56,76]}]