[{"title":"Not much development in this one as the Gothic Lolita in the title works fast.","rating":8,"date":"2 August 2011","review":"If you are looking for a film that has a lot of plot development, develops characters really well and has a story that makes you think then please skip this film. It does none of these things, what it does do is move by quickly from one fight to the next with a bit of back story here and there to fill in the blanks a bit. Not entirely as I was still clueless about a couple of things at the end of this one. The story is simple, a girl whose mother was killed by a strange quintet of people clad in black robes is out for revenge against said individuals. The thing that sets her apart from the normal revenge seeking girl is her choice of attire and weapon. She dresses in a Gothic Lolita outfit and uses various parasols as her weaponry. You get to see her do her thing right off the bat as she raids a gambling den and proceeds to really decimate all of those within seeking the strange mistress of the place. I was thinking at this point that we would get this scene then have a whole lot of flashbacks detailing her change to this psycho goth, but we only get a small picture and then she is off to a school to take care of her next target. Good action, I enjoyed the fight scenes better in this one than in other films of this type such as Vampire Girl versus Frankenstein Girl, Machine Girl and Tokyo Gore Police. The gore is about the same as those films, I still give the edge to this one cause it moved by so quickly was not crammed with a bunch of back story on her transformation and it did not have those strange bits of humor such as wrist cutting. While it does poke fun at things, the odd humor does not get placed front and center. My main complaints is that you really do not get enough of an idea why the girl's mother was killed in the first place. Also, while her outfit was cute I was hoping to see more outfits than just the one. Overall, I found it to be a nice bloody and fast moving revenge action/horror film.","user":"Aaron1375","rank":[12,13]},{"title":"Fun Japanese Revenge Film","rating":31,"date":"31 July 2011","review":"Gothic And Lolita Psycho is a fun, comic book style action revenge film(sort of a low-rent Kill Bill without Tarantino's genius, of course; but if you feel like killing an hour and a half with a cute actress(Rina Akiyama-voted best butt in Japan a few years ago) this Japanese revenge blood and dismemberment fest is a thrill a minute.<br><br>After witnessing her mother's killing, Yuki(Akiyama) spends her time seeking revenge on the bad guys with well choreographed fight scenes and a cool black leather outfit. The only disappointment is no nudity, only much blood spouting from necks, arms &amp; legs and every imaginable body part. Someone should have advised director Go Ohara of Ms. Akiyama,s best asset(pun intended); even so the ride is worth it.","user":"billcr12","rank":[11,12]},{"title":"Plenty of Fun","rating":7,"date":"16 April 2015","review":"Her beloved mother murdered by a vicious gang of assassins, young Yuki (2007 Best Buttocks Award-winner Akiyama) transforms herself into a Gothic lolita killing machine, wielding a lethal umbrella that can blast, slice, and chop her enemies into oblivion.<br><br>I have no idea what the \"Best Buttocks Award\" is, but Last Chance Lance of Rue Morgue sums up the film as \"the perfect combo of glam and gore that'll please perverts and gorehounds alike.\" That is pretty close to the truth. Not sure about the \"glam\" (though the fashions are a nice throwback to the best of the 1990s). The gore is there, and with a weapon that puts the Penguin to shame.<br><br>And the filming style. Maybe I just have not seen enough Japanese films, but this felt like all the best parts of \"Kill Bill\" rolled up into a fun little package.","user":"gavin6942","rank":[3,3]}]