[{"title":"Move over Uwe Boll, Ittenbach is here.","rating":18,"date":"18 February 2017","review":"Unfortunately, the version of Legend of Hell that I saw was severely cut, devoid of all of its juicy gore, which is a bit like playing Metallica's Master of Puppets with the sound turned down really low—practically pointless. Not that I think that the inclusion of buckets of OTT violence would have improved matters all that much: Ittenbach used to be content with being the king of underground German splatter, where shoddy direction and poor acting were excusable just so long as people were graphically torn apart in creative ways, but now it seems that he wants to be the next Uwe Boll, his films more ambitious in terms of scope, boasting a larger cast and barely passable CGI, yet completely lacking in narrative cohesion, competent performances, and directorial acumen—and most importantly, no longer possessing that low-budget charm of his early work. In short, Legend of Hell is a total stinker.<br><br>I won't go too much into the plot, because, quite frankly, I didn't have a clue as to what was going on from start to finish. Suffice to say that the film hops from time period to time period, and from place to place, with no semblance of logic, and introduces characters with little explanation as to who they are and what relevance they have to proceedings. There's a bad guy who wants to get his paws on an ancient scroll, an archaeologist who leans over so you can see down her top while she examines artefacts, a bald black dude who can't even roll down a sand dune convincingly, and a pair of random barbarians. The dialogue that these poor saps have to utter is trite fantasy waffle of the highest order. These guys randomly do battle with the evil denizens of the astral plane—dark breeds, head rippers, the greys, and the zombies that roam the City of the Dead—which is where the gore comes in. Unless you too are watching a heavily censored version.<br><br>In the name of fairness, I'm going to hold back on rating Legend of Hell until I can find a fully uncut version, but I really can't see it being that much more of an enjoyable (or understandable) experience.","user":"BA_Harrison","rank":[7,9]},{"title":"Little confusing, sometimes dull but plenty of gore and blood","rating":5,"date":"28 June 2014","review":"An archaeologist discovers an ancient artifact and scroll which starts a series of events that kills her several times over in various time periods, past lives and locations. It seems that the artifact and scroll are linked to a gateway to hell. Various hellish creatures pour in throughout history, it looks like the gateway has been opened. The archaeologist teams up with warriors and guides from the past to try and close the gate.<br><br>The plot is sometimes confusing, sometimes boring, if this had been tidied up it would have been a much better movie. The effects are sometimes good and sometimes below average, the acting is up and down again sometimes good and sometimes below average. You do get some half decent battles, plenty or gore and blood splattering which makes this movie at worse average to better than average but could have been so much more better.<br><br>I'm not quite sure why there have not been any more reviews or comments on this movie at the time of me writing this as the movie has been out a couple of years. Overall I have seen quite a bit better in this genre and a hell of a lot worse too and after all the searching and watching of movies like this it is getting harder to find and more good ones to watch so after 600+ it was a nice surprise to find this seemingly forgotten effort.","user":"phil-k-664-368870","rank":[8,12]},{"title":"Move along, nothing to see here.","rating":2,"date":"26 September 2018","review":"Well, on the positive side the starting credits looked good. I mean, lovely font. Also, some nice cinematography. Unfortunately the narrator speaks over them using a voice not too dissimilar to South Park (keep in mind I watched the English language version, so perhaps the German one is better). I thought it was a joke but no, it was deadly serious. It really really went down from there. Incredibly bad, stilted acting reminiscent of a bad porn film. Audio (again, keeping in mind I watched the English version) that would go in and out - at times making it impossible to hear what the actors are saying. Not that that really mattered - the storyline (for want of a better word) was simply an excuse to jump from one scene of people having their heads cut off, to another with people having their heads exploded, to another of people having axes being embedded into their heads. Don't get me wrong - people also tend to lose limbs as well, but there are a lot of heads being exploded.<br><br>If you want to see a lot of blood being splattered around, and yes at one point there's some chainsaw action, then this might be worth considering. The painfully bad acting, bad story, and bad audio (at least with the English version) amongst other things makes this otherwise quite difficult to watch unless as part of a drinking game - you know: take a drink every time someone's head explodes - although you would be risking alcohol poisoning . Plan 9 had a certain amount of charm to it. This doesn't.","user":"imdb-587-633567","rank":[3,4]}]