[{"title":"You Can't Kill Stephen King: Better than you'd imagine","rating":6,"date":"29 November 2018","review":"You Can't Kill Stephen King is a curiously titled comedy horror with the general slasher sub genre and it's actually not bad.<br><br>It tells the story of a group of friends who travel to Maine but as per the genre get picked off one by one by a mysterious assailant.<br><br>Its independent yet it looks great.\nIt's independent yet the soundtrack is excellent.\nIt's independent yet the unknown cast are fantastic.\nIt's independent yet the writing is above par.<br><br>It breaks all the usual movie stereotypes and conventions and left me fairly impressed. To be clear it has its fair share of flaws hence the not overwhelming rating but for what it is this is a passable little affair that demonstrates how talented those involved are.<br><br>It's silly, it has a very limited spectrum but there is fun to be had here.<br><br>The Good:<br><br>Great soundtrack<br><br>Very above par cast<br><br>The Bad:<br><br>Ultimately flawed<br><br>Doesn't really flow<br><br>Things I Learnt From This Movie:<br><br>Maine is so white there aren't even black bears","user":"Platypuschow","rank":[13,14]},{"title":"Better than expected","rating":7,"date":"4 August 2013","review":"With all the bad reviews and the low rating, I wasn't expecting too much going into this one - not to mention with a title like YOU CAN'T KILL STEPHEN KING, it seemed it never had a chance. BUT, I have to say I was pleasantly surprised and found it quite entertaining. <br><br>I guess it helps being a huge Stephen King fan. So, if you're a fan of the man, Stephen King, then I recommend you ignore the low rating and bad reviews. It's much better than they would have you believe. It has a nice setting, a good mix of horror and comedy, above par acting and a story that strays from the usual run-of-the-mill slasher flick. Check it out!<br><br>A solid 7 out of 10 in my book.","user":"Reaper-of-Souls","rank":[32,49]},{"title":"Stephen King would get a kick out of it","rating":7,"date":"27 April 2014","review":"O.K.the acting leaves something to be desired but what do you expect from a B-grade? I have paid to see worse movies that claimed to be A-grade.<br><br>I was pleasantly surprised to find it was not only Stephen King's famous stories getting the nod, but some of his lesser known stories as well.<br><br>If you are looking for a serious horror, do not watch this. If you are looking for an A-grade spoof along the lines of the Scary Movie franchise, again do not watch this.<br><br>If you are a King fan with a dark and slightly odd sense of humour as many of his fans do, this is right up your alley. How many stories can you find inside the story? I bet this was fun to make.,","user":"redandsparkly","rank":[11,15]}]