[{"title":"Its faithfulness to the original is its pride and its downfall","rating":7,"date":"18 February 2011","review":"Media seems obsessed with the Death of Superman. He had a death in Superman Returns, a death in \"Superman Doomsday\" and now another death in the animated adaptation of Grant Morrison's \"All Star Superman\" comic book. A seemingly successful rescue of a Dr Quintum's mission to the Sun has saturated Superman's cells with too much solar energy. This is causing rapid cellular deterioration which would eventually lead to his death. With time running out for the man of steel, Superman sets about to put all his affairs in order before he goes while continuing to defend the earth against threats from within and without.<br><br>From the get go, All Star Superman feels like a multi episode TV series compressed into a single movie. But really, that is more the fault of the original source material which in fact was meant to be 12 seemingly standalone stories with some of the plot points finally \"coming together\" in the final issues. While this worked for a bi-monthly comic book series, it does not have the similar effect as an animated movie. Here the film just feels unfocused and rushed, cramming what is supposed to be a year's worth of events into 70 odd minutes. For example, a single fade out later and superman returns to earth after a couple of months to find it take over by a bunch of long lost Kryptonians. An episodic miniseries would have been a better medium to convey the full feel of the original story.<br><br>Thankfully The production team's faithfulness to the source material is not entirely a shortcoming. The animated movie not only sticks to the \"self-contained stories\" format but also the well developed personalities and timeless characterization. Everyone is perfectly cast, bringing the characters to live in a very natural way. James Denton's Superman/Clark Kent is possibly the most lovable incarnation second only to Christopher Reeves's live action portrayal. The loyal script and top notch acting imbues Superman with just the right level of noble superhuman grandeur mixed with a down to earth homely touch. He is the hero, and the farm boy at the same time. Similarly, Clark Kent's oafish demeanor is comedic yet sincere; his interview with Lex Luthor and subsequent escape from the prison riot caused by a supervillian's escape is possibly the most fun part of the entire movie.<br><br>Here is another strength of All Star Superman. It is not a brainless hero brawl like Superman/Batman nor is it as dark and edgy as Batman: Under The Red Hood. The story plays out more like a character centered drama that is not afraid to tickle the audience with a few lighthearted moments. The main cast is given great depth and development as we get to know their reasons for doing what they do. Even Luthor gets a heart wrenching moment once you find out that the reason behind his hatred of Superman goes much deeper than just \"because he foiled my plans\".<br><br>Special mention goes to Christopher Drake's soundtrack which is by far his best work. His music covers a great range, bringing out the best in the scenes it complements; it is grand, emotional and magical. One might go so far as to say that his score here is actually better than Shirley Walker's stuff from the 90s Superman Animated series, just slightly behind John Williams. (In what is possibly a nod to \"The Mummy\", the music takes on a very Egyptian Gothic style with the appearance of antagonist Bar-El played by Arnold Vosloo, who also played the main antagonist of \"The Mummy\".)<br><br>There is action, not to worry, a good deal of it. Moi Studios once again perform animation duties, maintaining the smooth character movements seen in their previous productions; smoother than Japanese anime at least and without animation short-cuts. While some backgrounds appear lackluster, The production team's faithfulness to the source material is seen in the character designs which is a slightly streamlined version of Frank Quintley's artwork. Too bad the painted colors by Jamie Grant have been replaced with a very \"standard\" color palate. The colors here look exactly the same as........as every single DC animated production featuring Superman. <br><br>It seems like a farce that the movie stuck so closely to the comic going to great lengths to even replicate whole scenes perfectly yet cut out and streamline a fair bit of material. Perhaps Warner Premiere and Bruce Timm might consider a \"directors cut\" in which they go back and animate the rest of those scenes like the Bizzaro world, or the visit by Superman from the future. At least the plot threads established throughout the movie are woven together nicely in the end.<br><br>There are two ways to see this movie. One is that this movie is a \"All Star Superman lite\": a bite sized version of the great graphic novel for the uninitiated which will hopefully entice them to pick up the miniseries (now available in trade paperback form and an \"Absolute\" collectors edition). The other way is that it is meant to cheese off the long time fans so that the fans will go around saying \"the comic is better\" and in the end help to drive up publicity for the comic. Both ways, a perfect win-win situation for DC.<br><br>Try to enjoy this movie as it is. Of the scenes that were not cut out in production, revel in its loyalty to the original comic. It covers the full range of comedy to tragedy, heroic to humble, life to death.","user":"xamtaro","rank":[32,44]},{"title":"Way too rushed!","rating":6,"date":"22 February 2011","review":"Let me start by saying, what they did right. The whole tone of the movie is spot on. I think whoever read the comic book series will agree. The animation is great, the story is a great one. But it is all way too rushed. If you have read the comics you will get this movie, but everyone else - I imagine - will have a hard time following the whole story. They should have made this a 2 part movie or a 90 minutes feature to get a little more of a developing story. The events from the comics are all cramped into just 75 minutes. Take away the credits and it is even less. Not much room to tell the story. Still, it is quite good, but i have to judge it like a viewer who has never read the comics, that are basis to this films, So I can only reward 6 stars. Too rushed, too much left out. Sorry, could have been a fantastic - probably one of the best - superman animations, but it fell (literally) short. Missed out on the chance of making the best Superman movie ever.","user":"popinc","rank":[31,43]},{"title":"A fitting ending for both the character and a creator","rating":9,"date":"27 February 2011","review":"Many of the reviewers seemed to have missed the point that this was an adaptation of the 12-part Morrison story to an animated form. Maybe they hadn't read the maxi-series first. In any case, when you consider that the DVD dealing with the death of the mythic Superman was released the day after the death of the video author, the sad irony is magnified greater. As the final project of Dwayne McDuffie's strong career, you have to take some consolation that at least he left us on a very high note. I've seen almost all of the DC video releases and this one is definitely one of the strongest entries in the series. Not only is the adaptation of the original Grant Morrison well-written but the art-style and the music are also pure and rich.","user":"janarrah1","rank":[22,31]}]