[{"title":"Realistic View of Punk Rock","rating":9,"date":"10 March 2019","review":"One reviewer suggests that the film is about \"heavy metal teens.\" I stopped reading after that because the reviewer completely discredits himself. This is a film about, and for, Punk Rockers of all ages, whether Punk music is listened to by them or whether houses are destroyed by them. Punk is a reaction against the commonly told lies concerning America and other Western countries. Actually, all countries that lie to their people (consider Pussy Riot from Russia). Punk is an attitude, but even more than that, an ideology of freedom and seeking for, and finding, the truth. And not a relative truth either, but the Truth that sets you free. This is a good film, and comparable to the other one based on actual events, Bomb City--which also takes place in Texas.","user":"beorhhouse","rank":[4,5]},{"title":"We have been making movies about these problems for 50 years now.","rating":8,"date":"29 April 2019","review":"You've seen this *sort* of story before. Encapsulated summaries will use words like \"alienated,\" \"disaffected,\" and \"pessimistic.\" \"Middle America\" will be in there somewhere too.<br><br>I used to be on team \"Buck up, lil' cowboy,\" mocking the apparent privilege and entitlement of young adults, or kids on the cusp of adulthood when they got all moody about their lives and prospects.<br><br>But after decades of school shootings, suicides, terrorist attacks, obliteration of our landscape (aesthetically, environmentally, and economically), I give.<br><br>I kept thinking about Tuck &amp; Dar from \"Made in U.S.A (1987)\" while watching this. Those two characters existed in the same America. This film, \"An American in Texas\" is set only a few years after Made in U.S.A., but the film itself was made 30 years later and the nihilistic leads from Made in U.S.A. could have stopped for gas in this Texas town, dressed as they were in the earlier movie, and you would not have noticed any stylistic or thematic interruption. Tuck &amp; Dar's Centralia and Times Beach have echoes in the plastic plant which seems almost demonic in this film. Or maybe it's more like Dorian Gray's painting.<br><br>You can also bring up the Linklater/Bogosian film Suburbia as a discussion point here (though that was not nearly so dark as this one), and you could even go back to Easy Rider to see where things start to crack in America.<br><br>The thing that has to be understood about 1990 is it was not clear that the Gulf War wouldn't turn into a major regional war and result in a draft.<br><br>We're now used to these limited foreign adventures in which only the enlisted are involved, but in 1990 our most recent war of reference was Vietnam. The Gulf War was limited, over quickly, and was nothing like Vietnam but when it was happening, it was scary, because then - as now - it was hard to sort propaganda from fact. It turned out to be \"v1.0\" of modern warfare; these undeclared pseudo-wars on the other side of the globe where no one ever even whispered the term \"draft\" or \"rationing,\" and which a lot of Americans could even forget were happening.<br><br>An American in Texas is set against that backdrop but it is not about that time and place -- that time and place is just an excuse to talk about us, now. To talk about the lack of optimism, or if you want to use a really trite term, something like \"The Death of the American Dream.\" The same people who roll their eyes at this now are the same people who have been doing it since the 1960s.<br><br>I think the film was excellent and the performances superb. These young actors were incredible, and Barry Corbin is always a welcome presence. You've also got Jello Biafra in a small role, hamming it up (in an otherwise somber film, it's excusable - the directors clearly want you to notice it's Jello playing a Texas politician.)<br><br>This is a punk film, not a metal one. In the film, it is 1990 but this is about today, and we've been at this now for a half a century, trying to figure out what's gone wrong. I don't know that we make any progress here in figuring all of that out, but maybe if nothing else, there's cold comfort in recognizing that someone else notices it.<br><br>I can find no fault with the performances, script, or direction, and the soundtrack is excellent.<br><br>People who hate this film were probably predestined to before the script was ever put to paper. A lot of people either don't see America in these terms or, alternately, are in denial.<br><br>It just seems like we could have been, should have been, could be something more.<br><br>I liked An American in Texas. It will never have a large audience. But for me, it landed.","user":"maximumkate","rank":[2,2]},{"title":"The manipulation isn't subtle or even clever","rating":4,"date":"25 September 2018","review":"We're introduced to a handful of heavy metal teens that trash a house. They're trying to accumulate money for an apartment and a van. The boys have odd jobs. Their low-budget angst is set against a backdrop of the first Gulf War, or rather audio clips from George Bush and more prominent flags and other symbols. Nearly a half hour into the movie the boys get a gig where they rant against the new world order, as if the looming war would inconvenience anyone not already in the military by choice, and then serve mainly to punch tickets and test weapons. Then we get the \"war for oil\" speech, and the lads had to destroy another house.\nThe thing is, the movie never makes a convincing argument for the war, the local refinery, the flags or anything else believably triggering much less justifying anything else that we're shown. One of the young men is arrested with evidence of their deeds and is given a choice of prison or any branch of the armed forces for four years. We're told he is shipping out to Iraq (?) First, he could have chosen the Coast Guard, or Navy, but that wouldn't have setup the narrative the filmmakers wanted, and second, no one enlisting during or shortly after the first Gulf War would ever see anything, or likely ship out anywhere in four years.<br><br>The movie offers some interesting cinematography, but is otherwise ham-handed and lame.","user":"hughhemington","rank":[8,17]}]