[{"title":"Hidden gem","rating":10,"date":"8 November 2011","review":"So I happened to notice quite a great deal of people hold negative opinions on this movie. That's why I wanted to share my 2 cents.<br><br>Basically, the movie was what I expected it to be. Meaning: no blockbuster, no real Hollywood production, no mind-blowing action. A movie with a slice of life, just like 500 Days of Summer (come to think of it, it gets close to it in some ways, even if perhaps a little less mature). If you're looking for these exact characteristics, you may be better of looking for a different movie.<br><br>So what to expect from it? First of all: it does not aim towards shocking you. It delivers a message, apparent from the introduction we get at the start of the movie. Starting a movie with a quote is bold, yet it's also original and different. It sets the tone perfectly. So George is this high-school guy who has a different hobby, drawing. He gets so worked up in it that when he does, he loses sight of all his surroundings (anyone who's creative will relate, as do I). On top of this he holds a pessimistic view on life, basically saying 'we're all going to die anyway so what's the point'? Now I know a lot of people will consider this to be 'emo' or whatever, but it's not. Honestly. I plead guilty: I myself often think in this manner. In fact, I can relate so much to George that by the end of the movie, I sat with my mouth open, totally freaked out and overwhelmed, still am. He's the different one, the outcast, the guy nobody knows and everyone ignores. Yet people tend to forget that being quiet doesn't equal being an uninteresting person. On the contrary: this movie likes to show us the other side of the coin. So my conclusion would be that if you often feel misunderstood, or have lost motivation for life in general, this movie would definitely be the way to go, as it requires a certain mindset I believe...<br><br>What is so interesting about the movie, is that we see a great deal of changes in George's life from the moment he meets Sally. It triggers different actions and revelations in his life that are irreversible, as is often the case with love in real life too. It basically shows us that loved ones can change one's life for the better, even in a not always positive way. Love surpasses most joys of life, as it surpasses most of its burdens.<br><br>There were times when I was slightly annoyed. I was aware there were times where I would tell myself 'just do it/just say it!'. There are many awkward silences in the movie, which are automatically transferred to the watcher's feelings. I wanted to jump into the movie, help G. out, because life can be difficult, more so when you're an introvert. And even more so when love's involved. (personal rant ahead) The world of today is all about extroverts, people who are eloquent and sociable, certainly not something George can boast about. <br><br>The amount of growth George shows while struggling with his problems really makes the movie. You see him get out of his shell, while not losing his edge. It's not your typical American movie with happy ending, all's well that ends well. Again, just like life is a lot of the time.<br><br>I'd advise anyone to have a look. This movie has been a hidden gem for me and it perfectly fits my taste for movies. Be prepared for some thinking and awkwardness from time to time and when that's OK with you, you'll love it. If this is not what appeals to you, then it will probably not be your cup of tea. If you are an artist and have lost motivation and/or inspiration, you should feel compelled to absorb what this movie has to offer.<br><br>If you do enjoy this movie, don't forget to take a look at: '500 days of Summer' and 'It's kind of a funny story', which both are pretty close in terms of atmosphere to this one.","user":"louis_sound","rank":[136,161]},{"title":"Good/But","rating":5,"date":"19 May 2012","review":"This is one of those movies that starts out well but seems to disappoint in the end.<br><br>It's beautifully shot and edited, and we see many fine performances. I found Emma Roberts particularly appealing, as she has a dour, come-hither look in her dark eyes about 95% of the time. What Ingrid Bergman could achieve by looking down, Roberts does by looking almost right at us.<br><br>Freddie Highmore looks and feels authentic. His character has a lot of choices to make, many of which go against all common sense. But although he drives us crazy, he's intriguing and we want to know what's to happen to him.<br><br>Mid-movie, the characters are hit with several crises, and it gets interesting as we wonder how they'll resolve them. When resolution strikes, though, it's so conventional that it's disappointing. The expected is unexpected.<br><br>Yup, it has indie-feel and Sundance all over it. But I was hoping for a big surprise at the end from these flawed but good people; instead, they seemed to abandon what they had stood for. And what may have qualified as a surprise involving Roberts was simply unbelievable and too convenient to accept. Though I was happy for them, a simple, happy ending didn't feel right with these non-simple characters.<br><br>But then, maybe, that was the point.","user":"Jim-500","rank":[30,37]},{"title":"Another good movie made even better by the acting. Highmore & Roberts will be winning Oscars soon. Good watch. I say B+","rating":20,"date":"20 October 2011","review":"\"We all die alone, so why am I supposed to spend my life working, sweating, struggling...I have better things to do with my time.\" George (Highmore) is a high schooler who has pretty much given up. Bitter with the world and his mother he refuses to do anything and hasn't done a real day's work in his entire senior year. He meets Sally (Roberts) who sees the same thing in herself. This is a very good movie made better by the acting. Highmore, in a departure from his usual disgustingly good boy roles is excellent in this. Roberts, who is fast becoming a better actress then her aunt is, is also fantastic in this movie. The role of George is written to be a total jerk to most people he meets, but Highmore has enough \"baggage\" with him that even though he is not nice to almost everyone in the movie you still wind up rooting for him and wanting him to succeed by the end. That is a rare thing for an actor that young. While this is a very good movie that forces you to keep watching it does tend to drag in a few places, but not enough to be boring. If that makes sense. Overall, a very good movie with great acting that is a definite watch. The type of movie that all high schoolers should watch. I give it a B+.<br><br>*Also try - Happythankyoumoreplease &amp; It's Kind Of A Funny Story","user":"cosmo_tiger","rank":[45,58]}]