[{"title":"Not impressed","rating":5,"date":"23 February 2020","review":"The over the top violence makes for some great scenes but the overall appeal is not existent as the plot is super thin, the acting non existent, and characters there with no meaning (aka Lundgren). Thankfully, hopefully the series is finished.","user":"MR_Heraclius","rank":[38,39]},{"title":"Universal Soldier Day of Reckoning: Clones & confusion","rating":3,"date":"6 July 2018","review":"The Universal Soldier franchise as terrible as they've been must have been profitable otherwise they wouldn't have lasted. So with that in mind it begs the question, why would they overhaul the entire formula?<br><br>The Universal Soldier films have been brainless action flicks about the genetically modified undead soldiers but here it goes in a totally different direction and is no better for it.<br><br>It tells the story of a man who witnesses his wife and daughter murdered by home invaders. He wakes up from a coma and begins to investigate what happened to him, why he was targetted and the man who was responsible Luc Deveraux!<br><br>Yes thats right, Van Dammes character and the main protagonist throughout the franchise. So with Van Damme reprising and Lungren along for the ride yet again we see a brand new type of Universal Soldier movie. <br><br>Sadly it just doesn't work, though it starts strong it quickly becomes apparent that the writers had no idea where they were going with this new approach and it all falls apart. The plot is a jumbled mess and the only redeeming factor is the action which is more on point than usual.<br><br>Sadly its impossible to get past just how much of a baffling mess Day of Reckonings story is, what they've done to the two recurring characters and makes me very much hope this is the last addition to the franchise.<br><br>The Good:<br><br>Interesting opening scene<br><br>SFX are actually on point<br><br>The Bad:<br><br>Makes absolutely no sense<br><br>Major shift will not have please fans of the franchise<br><br>Things I Learnt From This Movie:<br><br>Upon seeing a gun mens penis's shrivel up<br><br>This movie is NOT for epileptics<br><br>Losing half of your foot won't affect your ability to walk","user":"Platypuschow","rank":[13,15]},{"title":"Confusingly Unique Entry","rating":6,"date":"31 October 2012","review":"The new Unisol film is a surprisingly fresh take on an old franchise. The tone of the movie is completely different from the previous entries that it's hard to compare to its predecessors.<br><br>Our hero, john (Scott Adkins), awakes to find intruders in his home who kill his wife and daughter. After spending several months in a coma John awakes with a memory loss, only remembering the man who murdered his family, Luc Devreux (Van Damme). The storyline then becomes less comprehensive as we tag along John as he tries to piece everything. The main problem is that nothing is answered, the back story remains hidden and the characters motivations are left unexplained. The movie also suffers from bad pacing, the first half being painstakingly slow with no action happening for the first half of the movie.<br><br>The good news are that the second half features some badass action sequences and the R rating is used fully, it's a gory movie as it should be. Even though the frequent use of slo-mo is tiring, it doesn't ruin the experience. Too bad all of it is packed in the final scenes of the movie. <br><br>The movie draws inspiration from different places, from video games to horror movies to Apocalypse Now (you won't miss it), the unique style sets this movie apart from the others but it doesn't help the thin plot or anemic characters.<br><br>Universal Soldier 4: Day of Reckoning is unique and fresh and I applaud the director for taking a different approach. Adkins does a great job and proves his more than a stuntman. JVCD and Lundgren's roles are smaller than you would expect, but it's a treat to see them on screen again. The lack of a comprehensive plot and or continuity to other films of the series is what hinders this movie from getting a higher rating.<br><br>Final score: 6 out of 10","user":"d_man1890","rank":[31,42]}]