[{"title":"Worse than Laughable","rating":1,"date":"22 June 2012","review":"This movie was horrible. Sean Bean is a good actor and there was some others in the movie that made my wife and I decide to give it a shot. It was REALLY bad. If the overall quality of the opening sequence wasn't enough to set the tone, the subsequent scene of Christian Slater playing cards should do the trick.<br><br>My only question is: surely actors have to know during the filming that this is a really, really poor movie, right? How could you not.<br><br>I'd be more comprehensive but this movie doesn't deserve any more of my time to be spent on it. Stay away. It's not even so bad that it's funny....it's worse than that.","user":"phantomias33","rank":[137,181]},{"title":"All things considering, this movie really isn't anything too bad.","rating":5,"date":"25 July 2012","review":"Seriously, this movie could had been a lot worse. At least its not being one of those cheap looking B-action movie flicks. It actually is a technically pretty well made movie, with of course also one truly great cast in it.<br><br>Believe it or not but this movie actually stars Sean Bean, James Cromwell, Ving Rhames, Christian Slater and Dominic Monaghan all in one special soldiers of fortune team. A cast list every movie would and also should be jealous of. No idea why they did this movie but I guess they need a paycheck like this, every once and a while. it was also great to see Colm Meaney as in the villain in this movie. It's funny but I was wondering not too long ago what Colm Meaney was up to now days, since I hadn't seen him in anything for years now. And then boom! His face popped up in this movie, still looking the same as 20 years ago.<br><br>Storywise, the movie was really dropping the ball toward its end, which was a shame since I really was with the movie at first. It has a ridicules concept but at least it got presented convincingly enough, also thanks to its fine actors of course. After a while you'll start to realize the movie isn't going anywhere anymore with its story. It's as if half way through they threw away the script and decided to put in some simple action sequences instead. I truly think that this movie and its story had far more potential in it, so that's truly a big waste.<br><br>It's not a particularly spectacular or involving genre movie to watch but it at least isn't boring or offensively bad, in any way or form. It's definitely being a better movie than just the average B-genre movie attempt and I hope that director Maxim Korostyshevsky continues making movies and who knows, maybe one day he'll have his big breakthrough, which seriously isn't anything unlikely, since you can definitely tell the right skills and talent are there. All he needs now is a more decent script and a bigger budget to work with.<br><br>Not a great genre movie but a good guilty pleasure.<br><br>5/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[29,35]},{"title":"Nasty","rating":2,"date":"17 July 2012","review":"What a waste of time. How could Christian Slater have signed to this project? When did he become a tacky B Grade actor? And, I'm shocked that some of the other cast, who are usually high quality actors, also signed on to this movie.<br><br>The costumes and weapons are cheap and artificial looking. The sets and landscapes don't seem to fit the plot. The plot doesn't fit the plot. The special effects, and explosions are cheap, nasty and very badly executed. The acting is shallow, the score is bad, the script and dialog totally disengaging.<br><br>I painfully watched 2/3 of the movie and gave up. I joined IMDb specifically to write a review of this appalling movie.<br><br>I will hesitate to watch another Christian Slater movie in the future.I feel sick, disappointed and ripped off. Do not waste your time.","user":"fordonfood","rank":[79,110]}]