[{"title":"Image control","rating":6,"date":"15 November 2011","review":"In Clint Eastwood's latest biopic J. Edgar, we delve into the personal life of one of the most powerful and enigmatic figures of the 20th century. We are shown pieces of a man who was scared, confused, and extremely intelligent. He knew how to cater to the media, but his personal life was shrouded in secrecy. It could be argued that J. Edgar himself wasn't quite sure of who he was.<br><br>Leonardo DiCaprio stars as Hoover. We see him evolve from a young upstart in the US Justice Department to the head of the FBI. DiCaprio portrays a man of man faults, though not entirely through his own doing. He overcame a speech impediment, grew up virtually without a father, and had difficulty expressing himself socially and sexually. Through DiCaprio's performance, we see just that, a man with a head on his shoulders, only confiding in those few people he trusted.<br><br>In his inner circle was Helen Gandy (Naoimi Watts), his personal secretary and keeper of Hoover's private files. Her commitment to Hoover knew no bounds. His right hand man, Clyde Tolson (Armie Hammer), was, on paper, not the right person to become Hoover's 2nd in command, but Hoover saw something in Tolson that made him feel comfortable. From what we see on film, Tolson was more than a friend, more than a partner. He had no title for Hoover. He was invaluable.<br><br>The center of Hoover's world, however, was his mother Annie (Judi Dench). A stern yet loving woman, she knew what Hoover needed to be successful. Her approval meant so much to him, and the thought of letting her down was unfathomable. That would wreak havoc on his private life throughout his life.<br><br>Hoover's appointment as head of the FBI would last for nearly half a decade. In that time he saw our country through several wars, the \"red scare,\" gangsters, and a presidential assassination. To compile his ever major decision would make for a great documentary series, but to compress it all into a movie under 2 1/2 hours, Eastwood utilizes recent Oscar winning screenwriter Dustin Lance Black (Milk) to pen the script. What Black does is paint a picture of Hoover not as the head of the FBI, but as a man whose image was so out of whack that he himself had trouble distinguishing fact from fiction.<br><br>The film constructed in a way that we are told the story of Hoover's life through Hoover's own words, not from a general point of view. What makes this so effective is that we aren't sure of how certain events actually transpired, making the story, and in effect history, somewhat clouded, much like the image of Hoover himself.<br><br>This image of Hoover has been dissected and speculated for years. Was he a homosexual? What secrets did he take to the grave? Was he involved in any conspiracies? These questions are touched upon, but never fully answered. What we are left with is a portrait of a man left unfinished, much like the painting of Washington we see several times throughout the film. Like the painting, Hoover is a man incomplete. That painting is a reminder to him that even though he is incomplete he can still make a difference.<br><br>Some of the strengths of the film are also its weaknesses. The story itself if fascinating, but it tends to drag on. It reminded me of The Good Shepherd. A really good story with great characters based on true events, just nothing extraordinary. The acting too is well done but, for me at least, I had a hard time not seeing Leonardo DiCaprio as Hoover, especially with the makeup. Part of it, especially with DiCaprio, is his voice. He has such a unique way of speaking and he has trouble disguising it. His character also reminded me of his performance in The Aviator.<br><br>The acting on the whole, especially Hammer and Dench (I expect nods for both and DiCaprio as well), is well above average. Eastwood always manages to extract prime performances from his actors, including when he is acting. Eastwood also continues his work behind the scenes by composing the score, his seventh feature length scoring composition. Like his other composition, there's a heavy, moody, jazzy undertone. He doesn't overpower us with large orchestral compositions. Instead he utilizes strings, piano, and a few horns to accent the images.","user":"moviemanMA","rank":[67,88]},{"title":"What is Truth?","rating":8,"date":"25 November 2011","review":"The infamous words spoken by Pilate to Jesus of Nazareth come to mind when one ponders the life of John Edgar Hoover. Was he a genius or a tyrant? A patriot or a dictator? A cross dresser or an uptight man with no sex life? Nobody knows for certain, and director Clint Eastwood does not offer a definitive answer to any of these questions, which is exactly as it should be. Life is rarely cut-and-dried, but moviegoers seem to have forgotten that fact in the face of media that state speculation as fact on a regular basis.<br><br>I find it not only surprising, but distressing, that a major criticism from those critics who panned the film is the lack of closure on Hoover's private life. Unless they are truly obtuse, they must realize that no film could possibly do such a thing, since his files were destroyed at his own bidding. All is speculation, and a fine speculation it is. Leonardo DiCaprio is superb (as usual) in the title role, never revealing more cards then he chooses to at any given moment. He receives fine support from Armie Hammer as Clyde Tolson, Hoover's Second in Command/Rumored Lover, and Naomi Watts as his endlessly loyal private secretary Helen Gandy. At a time when \"red fever\" ran high, Hoover's relentlessly tightening control on government investigations is shown in flashbacks that only underscore how supreme power can corrupt even the noblest of intentions.<br><br>In the end, the film answers none of the questions that seem so important to the very critics that disliked it, but in my humble opinion, a well made film is one that inspires debate or discussion rather than simply hand down a definitive 'this is the way it was' with an imperious gavel. With \"J Edgar\", Eastwood and his cast have succeeded well.","user":"ReinaMissy","rank":[72,96]},{"title":"Worth a look, but the wrong medium for this story","rating":13,"date":"13 November 2011","review":"Any movie Clint Eastwood makes is certainly worth a look, and Leonardo DiCaprio is entertaining in anything he does. But this version of J. Edgar Hoover's story seems superficial, and lacking meat on its bones.<br><br>That has more to do with its form – a theatrical film only two hours and 17 minutes long - relative to the length of the biography at its core. Hoover was such a complex man, and his career was so long, with so many chapters, that his story is probably better suited to a 4-to 6 hour HBO mini-series, where more of the details of his life, that this film with its short running time can only hint at, can be more completely told.<br><br>Dustin Lance Black, who wrote this film's screenplay (as well as that of Milk), is walking a very fine line here regarding Hoover's complex personality; it seems that he had a much more intricate story he wanted to tell, were it not for the confines of the feature film format. Here, broad brush strokes take the place of long chapters on Hoover's involvement with the Red Scares of the '20's and '50's, political blackmail, gambling, organized crime, and of course, homosexuality.<br><br>But if it had been made as a mini-series, it probably wouldn't have attracted Eastwood and DiCaprio, and consequently wouldn't have the high profile that this film does. That version of his story will have to wait for another time.<br><br>Eastwood chose to shoot this story in a washed-out color palette. The story jumps back in forth in time, and the closer the events of the film are to the end of Hoover's life, the more color Eastwood imbues into the scenes; the earliest moments in the time line are shown in a color scheme barely above monochrome. It's a subtle effect, but it helps the viewer keep track of where the scenes exist in Hoover's life.<br><br>That long time line necessitates that DiCaprio must be seen in various makeup schemes to convey the age of his character at any point in the story. His makeup is uniformly good; but the two other principal actors in the film, Armie Hammer as Hoover's longtime companion Clyde Tolson, and Naomi Watts as Hoover's secretary Helen Gandy, don't fare so well as their characters age. Obviously, the lion's share of the film's makeup budget was allotted to the star. Hammer, it must be said, gives a fine performance under all those old-age prosthetics. Christopher Shyer, who plays Richard Nixon in a brief scene, has the least-effective verisimilitude of anyone who has played the man in a motion picture.<br><br>But makeup alone does not a performance make. Di Caprio's ability to remain in character and \"age\" with him is remarkable, and transcends the work of his makeup artist. As he did with his portrayal of Howard Hughes in The Aviator, his skillful use of voice and body to stay true to his characterization of Hoover through the years is evident throughout.<br><br>One gets the feeling that much of this film was shot in front of a green screen, no surprise given the various eras of Washington that it depicts; but to a longtime moviegoer, there's a certain sadness that imparts to seeing that technique, once the province of the large-scale action film, used in serious dramas. There was probably no other way to do it in this day and age, but it just calls attention to itself in a way that gets in the way of one's immersion into the subject matter. Admittedly, that's my problem, not the film's.<br><br>So, is it worth a look? Sure. Best Picture nominee? In a field of ten, probably. Will Leo finally win an Oscar this time out? Well, look at it this way: Paul Newman gave his best performance in The Verdict, but the Academy finally honored him for The Color of Money. Leo probably should have won for playing Howard Hughes, but maybe he'll win for playing J. Edgar.","user":"pemolloy","rank":[70,99]}]