[{"title":"Intense but slow","rating":6,"date":"23 September 2017","review":"\"Videotape\" deals with a group of friends being killed in a warehouse. When the lone survivor of the events agrees to an interview with a camera team and hands them some video material of the events leading to what happened, new light is shed on the disastrous day.<br><br>The film is built up really slow, so slow in fact that you sometimes wish for a bit more to happen. Additionally at least some of the actors are hard not to mix up which makes parts of the material really confusing. However, in the end the tension rises a lot and the movie truly catches its audience then. In my opinion, the acting seemed really natural and especially the footage tapes seem like they could as well be real. For the interview sequence though, maybe a more modern approach without some of the retro look, could have suited the film even better.<br><br>All in all this is a nice addition from a smaller production. It delivers some innovative approaches and a satisfying second half that manages to make up for the slightly disappointing first part.","user":"blumdeluxe","rank":[4,4]},{"title":"Generously rated","rating":3,"date":"5 January 2019","review":"This film was a very, very difficult watch and I'll confess that I'm grateful that I had other things to do with my time while it ran. The film starts with a quote from Shirley Jackson's \"The Lottery.\" Other than perhaps an attempt to be artistic, I have no idea what is the correlation to this film.<br><br>So what is this film about? It was difficult to say as most of it is drunken, drug-induced or just plain unintelligent blather that you might see in an uneducated town with people who have time but nothing to do. Over time you find out that there was a pregnant girlfriend of one of the main characters ends up dead (and first appears to be a suicide). The survivor of a bad day where other friends were killed ultimately sheds light on the situation to an interviewer who came to get his story on what really happened. As to why this takes place... it's difficult to make much sense. It was hard to pay full attention at all times.<br><br>Slow pacing... glacial to say the least. To me felt like no script, just concept, with actors believing they could do method acting and getting the film to move in a direction. The problem is that this was a story that could have been done in 10 minutes but drawn out to make a feature length film. And the gimmick is immediate, with the interviewed character wearing a hat that covers most of his face. Why... because. In fact the film is so dark that often you can't see faces clearly if at all. If this was intentional as it seems, it was not a good choice and not effective on the viewer.<br><br>On the bright side, the no name actors who have never appeared in another film are actually fine. But all of them may be just saying what normally happens in a bored Texas town, just blabbing to each other about nothing in particular and provoked prolonged drivel. People drink, take drugs and engage in mindless banter on a regular basis. And that is what you must sit through for over an hour to start getting to \"the reveal\" which isn't really much to reveal, is predictable and not credible and really not interesting.<br><br>The camera work is an attempt to be artistic but is annoying, using what is attempted to be old footage using VHS, which is just like horrible attempts to use bad lighting and absurd camera angles which make you wonder (a) why would anyone ever put a camera at such a bad angle; (b) how would it even get into that position; and (c) reminding you that you're watching a really poor film and seeing part of a guys face or some other poorly positioned lens in order to set the tone... I guess. Let's not forget the use of shaky cam in order to make this really feel authentic.<br><br>I feel like I'm being exceedingly generous with my rating. The other person who rated the film a 6 sounds more like a sympathetic reviewer providing feedback, which I think would have been a very good idea when they started going down this path.","user":"imdb2-5","rank":[3,4]}]