[{"title":"Surprisingly Awesome Movie","rating":9,"date":"9 March 2012","review":"Caught a preview screening of this movie tonight in NYC. I am 26 years old now, so I was in 8th grade when the original came out.<br><br>Thought the first two were awesome but thought the third noticeably drifted away from what made the first two special.(A little too much Stifler).<br><br>For American Pie 4, when I saw the preview I was excited to see them all back together, but I didn't know what to expect. I know Hollywood loves destroying sequels and I didn't know how they were going to create a story line out of characters that really haven't been together in forever.<br><br>Fear not. I though this movie was almost as good as the original. Two hours of non-stop cracking-up, but none of it was forced. They brought back all the characters, but in a way that didn't seem thrown together or in-genuine. It was about 2 hours and 15 minutes long, but not once did I think this was dragging. They did a nice job explaining where everyone has been and it didn't really seem awkward.<br><br>The best part of it is, the story is about all 5 of the original guys, and their relationship with women and sex at their current juncture (31 years old). Each have their own issues (too married, have kids, hate their jobs, hate their lifestyle, etc.) and the movie is kind of about them all resolving their that over the course of a reunion weekend. It's the American Pie which is most similar too the first one. All the old couples from high-school (Oz/Heather, Kevin/Vicky, Jim/Michelle) re-hash their past feelings.<br><br>Another great thing about the film is that Stifler's character is written back in the style of American Pie 1 and 2, which I loved. His part is not over bearing like the Wedding. Kevin, Finch (and Oz) play much bigger roles than they did they did in the third.<br><br>There a couple new characters but none of them are annoying or take up too much of the story, all those parts are well cast. Jim's Dad and Stifler's Mom are hilarious on screen together. Jim's Dad is the funniest he has ever been- but again- not in an over the top way. All in all, it's a well-written, well-rounded film with some good plot twists. Tons of references too the old films. Literally, all of the obscure characters from the first two make an appearance at some point.<br><br>BOTTOM LINE: 9/10. If you are a fan of the American Pie films (especially 1 &amp; 2) your going to LOVE this movie. Worth the $.","user":"simonthm","rank":[211,259]},{"title":"Still Funny After All These Years","rating":7,"date":"23 March 2012","review":"I was 16 when the original American Pie came out. It was a film that spoke to me greatly. It was my generation's Ridgemont High, you might say. The sequels too, were enjoyable. But to say that the series didn't wear itself thin might be an understatement. And don't even get me started on the direct to DVD creations. However, American Reunion surprised me with a couple entertaining trailers, and nostalgia grabbed me by the balls. Having had the opportunity to see an early screening, I am happy to say that this is the series I remembered it being.<br><br>There's nothing too outside the norm for an American Pie series film. We find the original cast living life over ten years after the original film. Jim and Michelle are having a few marital issues and raising a kid. Stiffler is working a job as a temp, dealing with an a-hole boss. Finch has become a mystery of sorts. Oz is a big shot sportscaster with a supermodel girlfriend. And Kevin is a stay at home husband, slash architect. The group returns for their high school reunion and reconnect with each other and their fellow classmates. But this is a film that is as much about the audience seeing it as it is about our favorite foursome. As stated, the film isn't remarkable in the plot sense. Unlike the previous films, there isn't a big endgame to cling to. There's no goal of losing virginity like the first film, finding true love like the second film, or having a successful wedding like the third film. Instead, these characters just deal with being back in their hometown and their own individual issues.<br><br>If anything, the film is highly nostalgic. It's filled with characters and situations reminiscent of the previous films. It still manages to surprise with many of it's shenanigans, from the boys having to get out of some awkward tight spots, to Jim once again finding himself in extremely embarrassing situations. Heck we even get a few truly surprising moments that are also very laugh out loud. But for the audience that grew up on these films, it will be like a trip down memory lane. It's fun seeing all your favorite characters return, from the underused ones to all of the main cast. Even seeing characters like Oz or Vicky, whose real life counterparts haven't had much of a career since the American Pie film, are pleasant to see again. And they all do a great job of reprising these characters. Best of all, the film is hilarious, with plenty of laugh out loud moments.<br><br>My biggest qualm with the film is it's lack of a strong central plot. Nostalgia only goes so far and there's really nothing to cling to here in terms of something these characters are working for. By comparison, there was the ever present goal of the guys losing their virginity. Here, their personal issues seem meager. Yes, Jim and Michelle are having issues, but you never really feel like it won't work out. Knowing these characters, you already know they love each other. The same goes for most of the others, whom you always feel will come out on top. This despite a few surprises. And with the whole movie revolving around the up coming reunion, an event which doesn't seem to have much affect on the direction these characters take, there's never a real sense of character growth. Instead, you're just hanging out with the boys again, watching them get into trouble.<br><br>But this is okay. It's okay because the movie is funny. Much of what happens resembles the kind of humorous situations from the other films. There are some truly laugh out loud moments and the surprises will have you howling. Despite my nostalgic interest in the film, I found some genuinely fun and surprising moments. For fans, this should be a no brainer. The film is definitely worth the watch.","user":"cadillac20","rank":[137,170]},{"title":"A good concept that was done right","rating":7,"date":"21 July 2012","review":"This is a true sequel: it expands on a previous story and makes it better. American Pie was never a great film and the many reincarnations of the same story did not do it good, but American Reunion almost fixes everything, giving it a true human dimension. In my opinion, it is this film that makes American Pie a classic. I just hope they don't turn it into another franchise. Let it rest, people! You got it right, don't mess with it.<br><br>Other than that, the same crazy antics, part felony, part madness and the same awkward situations, but with a more adult touch. Everybody is married, with children, but at heart, they are still kids. That is what this film is all about.","user":"siderite","rank":[27,32]}]