[{"title":"The art of making a beautiful snowboarding movie","rating":8,"date":"2 October 2011","review":"Get into a helicopter, get dropped off at the top of the mountain, skate down.<br><br>This movie once again makes it seem so easy, yet so impressive at the same time. With a good mixture between big mountain downhill and some of the most impressive jumps you will ever see, \"The Art of Flight\" is not an educational snowboarding movie. It's a piece that shows you several athletes constantly looking to push the limits.<br><br>Whether it is skating down while avalanches are being kicked off left and right, whether they are closely avoiding crashing into rocks on a slope that's not even as wide as a car or whether they land jumps that you thought impossible, this movie will leave you in awe most of the time. Adding to that is the spectacular cinematography in beautiful places like Chile, Patagonia and Alaska. This is hands down the best looking snowboarding piece ever made.<br><br>That said, \"The Art of Flight\" could use a little more direction at points and some of the scenes seemed rather pointless. Other movies build up to a grand finale, this one merely shows you a bunch of guys on the hunt for snow - which does not make it any less of a great movie, but leaves you with a feeling that more could have been achieved. There is very little being said about the personal lives of the athletes as well.<br><br>If you're simply looking for big mountain and big air, this is not to be missed. If spectacular images of mountain scenery are your thing, this movie will make you happy. If you're looking for an entertaining movie about snowboarding, you should still go and see this. You might be disappointed though if you're expecting a big story behind it all.","user":"flyingdj","rank":[19,21]},{"title":"Amazing scenery, fantastic insight into their world","rating":9,"date":"2 October 2011","review":"The cinematography of this film is amazing. Fantastic scenes, the distant views are brilliant, fantastic slow-motion shots. It starts with a journey of small cliffs gradually taking you to some of the most dangerous conditions that these guys snow board in.<br><br>It shows what these guys really live for and why they do it. There is not much of a story this is a 'point and view' documentary about the lives of a few pro snow boarders. Very little is said in this documentary and it fits perfectly well. <br><br>It certainly gives an insight to viewers about the sort of risks they take for the adrenalin rushes these guys need to feel alive.<br><br>This is an amazing view in high definition.","user":"patrick-magee-96-913757","rank":[27,32]},{"title":"Amazing shots, nothing more nothing less","rating":12,"date":"12 November 2011","review":"Snowboarding on the most remote places on earth. Living careless, without fear and just doing what you love. That is what The Art of Flight is about. There are tons of amazing shots of going down off the most deserted mountain slopes of the planet. Anyone who likes snowboarding at all will immediately envy some of these runs these guys make. The camera gets really close and sometimes you feel a little out there as well while watching this. That alone makes the film worthwhile. The film tries to add a little more substance though as we also follow the daily routine of these masters of the snowboard. This is where we realize just how shallow this film or perhaps their lives is. They sit around waiting for the perfect weather, traveling from one remote location to the next. The vocabulary seems to consist of only \"Wooo!!!\" ,\"AWESOME\" and the like. The interviews only validate this claim and anytime it tries to go a little deeper we move over to the next footage of awesome jumps over the best snow you ever see. At the end I'm not sure if I envy their lifestyle or not, on the one end they live so careless and relaxed that it's just a dream. On the other end it seems they couldn't care less about the other things in life and are just stuck in their nonstop quest for the biggest adrenaline rush. <br><br>Anyway the footage is some of the best you'll ever see and that is enough to make this fun to watch. Don't expect anymore more then that though there just isn't.","user":"markwerf","rank":[15,17]}]