[{"title":"A Masterpiece that will leave you ... Speechless ...","rating":10,"date":"14 November 2011","review":"«We didn't need dialogs, we had faces» said the narcissistic Norma Desmond (Gloria Swanson) in Billy Wilder' \"Sunset Boulevard\", referring to the Silent Era, when she used to be big  before the 'pictures got small'.<br><br>The reason of this introduction is that after watching Michel Hazanavicius' critically acclaimed: \"The Artist\", I strongly felt this was the perfect illustration to Norma Desmond's iconic eulogy. From beginning to end, my eyes never ceased to be amazed by the communicative smile of Jean Dujardin as George Valentin, the aging silent movie star and the sparkling eyes of Berenice Bejo as Peppy Miller, the young and flamboyant starlet. Their faces occupy the screen with such an electrifying magnetism that they don't just steal the scenes, they steal the dialogs  literally.<br><br>I was awestruck by Dujardin's performance. To those who didn't grew up with French TV programs, he's one of the most popular and talented comedians of his generation. Dujardin created the character of Brice de Nice, a blonde surfer whose specialty was to 'diss people', but it was so funny it never sounded mean-spirited. He was a member of a cult comic-troop (who made sketches à la SNL) but even back then, he had a little something that made him special: a voice, a smile, a charisma in both TV and movies, in both dramatic and comedic register. There was no doubt in France that the guy who was famous for his impressions of Robert De Niro and the camel (and even De Niro doing the camel) was promised to a brilliant career.<br><br>Look closely at Jean Dujardin's face, it's like drawn with 'classic' features: the finely traced mustache who builds a Fairbanks-like charisma like the strength from Samson's hair, the dazzling smile making him look like the lost son of Gene Kelly, and a certain macho toughness reminding of a young Sean Connery. Dujardin's face is a gift from cinematic Gods, and \"The Artist\" finally lets it glide, earning him the Cannes Festival Award for Best Actor. I sincerely believe he deserves an Oscar nomination, because he just doesn't play an actor from the Silent Era, he embodies the Era with the same level of demented craziness as Norma Desmond, in a brighter and more light-hearted side.<br><br>Valentin's self-absorption echoes Desmond's cynical ego while his gaudy 'Don Lockwood' mask (Gene Kelly in \"Singin' in the Rain\") hides the more poignant face of his insecurity. He's the star of the screen because only the screen allows him to express his unique talent. While Lockwood had to adapt to the 'talking' revolution, George Valentin makes a conservative U Turn starting an inexorable descent into madness, from an outcast, to a has-been until being finally alienated by his own talkie-phobia. The direction is so clever that it challenges many times our perceptions, creating unexpected feelings of discomfort when real sounds are heard. But I was surprised to see how much it worked on a dramatic level.<br><br>And this is the strength of the film, although I expect it to discomfort some viewers: it isn't a tribute in the literary meaning of the word. It has its moments where it tricks us into the use of sounds or dialogs, but never fails to distract us from the core of the story: the romance. Very quickly, we forget about spotting the hints, the references to silent classics: chase scenes, over-the-top comical gesticulations, slapstick jokes etc. This mindset would disappoint those who expected a film with the same material as Mel Brook's \"Silent Movie\", which was clearly a tribute. \"The Artist\" IS a silent movie, featuring a beautiful romance between George and Peppy, who got her break with an idea from George, something that would make her different from the other actresses: a beauty spot above the upper lip. A clever credit-billing montage depicts her consequent ascension to stardom until she finally dethrones George and makes a has-been out of him.<br><br>If I mentioned the performance of Dujardin, Berenice Bejo also deserves some accolades because she succeeded in looking so \"old\" from our POV yet so fresh and modern in the film, with the appealing feel-good and optimistic attitude she constantly brings on screen. With her doll-face and youngish smile, she's like a cute little girl enjoying what she does. In a way, Peppy Miller embodies the film's most inspirational element: a positive message about passion and enjoyment. And this indirectly highlights George's source of troubles: being deprived from what he enjoyed the most and suffering from his progressive fading into oblivion. Along with this conflict, the evolution of George and Peppy's romance never feels forced, quite an accomplishment when we consider how slightly over-the-top silent movie stars used to act.<br><br>Both Dujardin and Bejo are indeed powerful in an Oscar-worthy level and at that moment, I can't continue without mentioning the third character of the film, George's dog. The relationship between George and the dog provides a sort of Chaplinesque feel to the movie, a mix of tenderness and poignancy, so natural and convincing I wonder if the Academy will think of a honorary Oscar. Anyway, I applaud Hazanivicius for not having reduced \"The Artist\" to a flashy spectacle with no substance, with the word 'homage' as the director's convenient alibi, and make a touching romance about two people who met each other at a pivotal time in the history of film-making, each representing a side of cinema, the old-school silent generation: Chaplin, Keaton, Pickford and the exuberant talkers: Grant, Hepburn, Davis  And I'm glad he found the true note to reconcile between these two universes at the end  didn't I tell you Dujardin was the lost son of Gene Kelly?<br><br>\"The Artist\" plays like a missing link between \"Singin' in the Rain\" and \"Sunset Boulevard\" and it's indeed one of the best films of 2011, with the absence of words as an endearing 'beauty spot'.","user":"ElMaruecan82","rank":[287,398]},{"title":"Silence speaks volumes.","rating":10,"date":"16 October 2011","review":"As I waited for two hours in a long queue to watch this movie at the Mumbai Film Festival, I wondered why I was doing so much for a silent movie, of all things. Post screening, I'm ready to brave hail, rain or the super hot Indian summer sun and stand in a serpentine queue, just to watch this movie all over again. <br><br>'The Artist' is sure to go down in history as a must-watch. For those who want to study films, for those who pursue cinema relentlessly, and also for those who just watch movies because they just like to. If you're wondering why a silent film, the movie not only answers it, but makes you fall in love with the medium. it's clearly a product of a thinking director, where every thing in the scene has a story to tell. Whether it's the ironical film posters, street signs, or just a little dog barking quietly in the corner. <br><br>I don't need to comment on the talents. The Best Actor award at Cannes 2011 has done that already. I will however mention the four-legged supporting actor in the movie. Best performance I've ever seen so far! <br><br>Enjoy this movie. Add it to your collection. This is one movie worth upgrading to from DVD to Blue Ray to ...","user":"looneytuna","rank":[200,275]},{"title":"Marvellous; one of the best movie experiences you'll ever have","rating":10,"date":"11 September 2011","review":"The Artist arrived at the Toronto International Film Festival preceded by the accolades it received at Cannes, so expectations were high, but those expectations have been more than amply fulfilled. This film is an absolute marvel - charming, witty, surprising, moving, clever and beautiful. Filmmaking is about decisions, thousands and thousands of them, and everyone involved in The Artist makes every decision to perfection. The cinematography is ravishing in luminous black and white. The musical score, on which the film, being silent, is so dependant, is subtle when it needs to be subtle, dramatic when the occasion calls for it, and never overbearing or overwrought. The screenplay (yes, silent films do have screenplays) toys with the conventions of the silent era, paying homage to some of the greatest films of the first two or three decades of cinema history. The acting is flawless, extracting emotion and humour from a simple but classic storyline. The direction displays such self-assurance, and treats the audience with such respect, that it is almost like having a dialogue with the director.<br><br>The Artist is one of the most enjoyable movie experiences I have ever had. It deserves a wide audience and all sorts of awards. I can hardly wait to see it again.<br><br>And oh yes, if there is ever an Oscar for best animal performance, the dog in The Artist should receive a lifetime achievement award for this role alone.","user":"RolyRoly","rank":[300,423]}]