[{"title":"A small contribution by everyone matters a lot.","rating":10,"date":"4 April 2016","review":"The organism survives only if the surrounding environment favours. But it takes thousands of years of evolution to find its right place. Its existence is only to restore the balance in the nature as much as fast it can. Because the organism moves one place to another and help elements to meet one another which can't do themselves, in a result the reaction happen. The extinction happens when the balance between naturally existing elements and living organism was disturbed. The Earth has seen such five mass extinctions and now on the verge of sixth only because of one species, the man. There's no one in this universe to question his supremacy, but himself in the form of scientists, environmentalist et cetera. This documentary talks one of that small topic, analysing its root cause.<br><br>From the Academy Award winning director for the documentary 'The Cove', once again, his focus came to bring the awareness about marine species that disappearing due to excessive hunting. From Japan's dolphin hunt to now the focus is on the Chinese's misbelief that causing animals like tigers, rhinos, marine animals to face the threat.<br><br>In this film, the Oceanic Preservation Society followed the source to find how and where it all begins. Since it is related to marine life - shark fin and manta ray gill trade markets were the target. That leads the crew to travel all the way to Indonesia, where a small coastal village is one of the major supplier to the Chinese consumer.<br><br>\"We have this illusion that it's the big things in the environment that count. But if you lose the small things... Everything else fails.\"<br><br>For the Chinese population density, just think what might cause if they believe in something that is not right. Since the rise of China's middle class, they can offer anything from anywhere in the world. Because of this demand the rich in biodiversity like India, Africa, Indonesia is affected due to poaching and other illegal activities. What they need is proper scientific education about their misbelief. Make the Chinese immigrants to mingle with the rest of the world, not to live and die in their own den called 'China city'.<br><br>I am not a Chinese hater, but their misbelief is outrageous, especially for their population strength, it is 5 to 10 times faster than what the rest of the world's misbelief causing threat. Every nation has its own negatives, today it is China, tomorrow it will be India and then United States followed by Europe and Africa. Now it is not only up to the world leaders, but every citizen has to care, even a small contribution means a lot. The recent Paris climate conference has brought only a small halt, especially on the natural resourcing, yet other similar fields have to come into the force in a similar treaty.<br><br>The civilisation happened when human thought he does not fit with the natural habitat anymore for his excessive brain power and left it once for all behind other species by creating his own world alongside. Animal and plant farming is the way he discovered to cope with his hunger. But what we don't know is these farming is still occurring on the face of the earth that contributes whatever the changes the planet sees. But that does not it, overpopulation is another bigger issue. There are more consumers than farmers and farm products, thus leading us to go back to wild to hunt which is seriously causing imbalance in chemical and biological world.<br><br>\"So, this is really the last line of defense, keeping animals that are extinct in the wild in a captive situation.\"<br><br>Focusing on the marine was their prime intention, but the discussion led to many other sub-topics. Unlike the director's previous film, it did not stay on one issue, but kept rotating on the various subjects by revealing the causes and the solution. At some point it lost its track, and started to advertise a fancy stuff. But that is a major way getting the attention of today's people in the digital world. Whatever you might think of me, but the truth is I was heartbroken several times while watching this film and had tears. This film is not a masterpiece, that's why it did not get an Oscars nominee except for an original song, nevertheless the voice it raised against is a true commitment.<br><br>Recently I stopped to visit zoos, the place I consider is a prison for animals who have committed no crimes. But in todays world situation, looks like the captive is the final line of defence. If there is a another world, people with much more vigilant about their natural world, I would definitely like to go for it. But earth is what we all have and we're failing to take care, when it comes time to run, you will have no place to go. Just look at the recent reports of pollution in the Chinese cities, it is what I had seen in movies like 'The Mist', 'The Road', is all coming true. The apocalypse is not too far from reality. Like in this film say, it is not too late to join hands for good.<br><br>10/10","user":"Reno-Rangan","rank":[20,21]},{"title":"The most important documentary to date!","rating":6,"date":"6 June 2016","review":"With nearly half of our wildlife decimated since the 1940s, it's not hard to imagine that the natural world is in some serious trouble. The expansion of the modernized world and the overpopulation of humans has caused nature and its species' to face extinction. \"Racing Extinction\" is a shred of hope. It sheds light on the important issues facing nature and the thousands of animals facing extinction due to climate change, poaching, pollution, ocean acidification, hunting and fishing, and the destruction of natural habitats. This documentary interviews many knowledgeable conservationists and scientists who have solutions and hope on this subject. With magnificent footage of nature and animals and devastating footage of the destruction of nature, this documentary does a brilliant job blending the beauty and the loss of the natural world with the solutions to preserving it.","user":"dom-lerose-8","rank":[9,9]},{"title":"Clear, Fairly-paced, to the point n stunning visuals make this an awesome treat.","rating":8,"date":"17 March 2016","review":"Racing extinction is a documentary about how, human interference have directly or indirectly eliminated most of the species in recent years. It describes at this pace we will be eliminating 50% of the known species by 2050.<br><br>The documentary presents us with options how we can deal with this. It shows how mindset of people can be influenced for good and right. It gives us the message of lighting a candle instead cursing the darkness. At the end it is shown how pictures or a film can prove out beneficial in making the role of human to realize their responsibility.<br><br>Change is always resisted. People don't like change. We may be fault at many things, but it's never too late to correct ourselves and in this case, it is high time!","user":"muvi-fan-73","rank":[16,18]}]