[{"title":"It's theeeee most meaningful movie i have ever seen","rating":10,"date":"18 January 2015","review":"This is for the first time I am writing a review for a movie despite the fact that i have been a big time movie buff for 20 years. Reason...I was compelled to step out of my own resignation. Of all the brilliant movies out there, this one, in my humble opinion, has the power to shift something deep inside 'most' people. Most.... but not all,,, for some people are so inured into the vagaries of life that they might lose patience with a somewhat slow pace of the movie. Well, losers....have patience...it will pay. If you are someone who values time....YOUR TIME...ON THIS PLANET...you've gotta watch this. There is no incomprehensible philosophical blabbering in this....just plain and authentic experiential learning of a psychiatrist committed to figuring out the answer of perhaps the oldest question of mankind in a non judgmental objective way. Categorically recommended to everyone with even an ounce of brain.","user":"uniqueritwick","rank":[127,166]},{"title":"French whimsy with an English touch","rating":7,"date":"7 January 2015","review":"I'd decided on the title for this review before I learnt that the source material was a French novel. That explains a great deal. Hector and the... is a deeply felt, funny, moving, insightful and whimsical look at how we (fail to) make the best of life. The film makes its points adroitly, avoiding (sometimes barely but a miss is as good as a mile)maudlin sentimentality. It's liberally sprinkled with perfect one-liners, acute observations and star cameos but the glue that holds the whole thing together is the relationship between Hector and his girlfriend. It's heartrendingly real. The version that I watched was a full ten minutes shorter than the original runtime and I'd guess that the few dots that failed to join up as needed were a result of that USA audience edit. Another guess would lead me to give the full length cut an eight rather than a seven. Here's the deal. It's a feel-good movie for which you won't need a supply of sick bags. By the end, I felt... happier. Really!","user":"johnklem","rank":[57,72]},{"title":"A rather mature film from Simon Pegg","rating":8,"date":"18 August 2014","review":"At the time of writing this review, there is a massive absence of films suitable for audience who does not necessarily enjoy titles such as Expendables III or Hercules. If you happen to be one who seeks some deeper meaning in your movie experience, this film is for you. In fact if you are not, you may still find some aspects of the film entertaining enough.<br><br>In summary, the main character Hector has some grown up problems and in order to find some closure to his past issues, he takes an epic journey. From a Simon Pegg film, you would expect these journeys to be very funny and light adventures. Sometimes these adventures are indeed funny and light but mostly they are rather serious. Issues faced include midlife crisis, relationship problems, corruption and poverty in Africa, etc. The film has a fast enough phase an it is never boring or depressing, yet it can be both funny and serious at the same time. I believe the film is currently underrated by the IMDb crowd.<br><br>If you have watched Simon Pegg films with zombies, aliens or cops and you are looking to find more of the same experience, this film might not satisfy your expectations. This film is a genuine and sometimes lightly philosophical attempt to ponder and think about what makes us human beings happy and satisfied with ourselves.","user":"drturker-bayrak","rank":[96,129]}]