[{"title":"Great nature movie","rating":10,"date":"20 February 2020","review":"It is impossible not to love this movie - one minute it will make you laugh out loud, only to break your heart in the next and it will make you keep your breath in amazement for all of 88 minutes it lasts. Mother Nature proves once again that it can effortlessly best even the best film directors, if only someone can manage to be bothered with filming the great spectacle of life in the wild. Huge thanks must be given to the Joubert couple for this movie. Oh, and yes, having Jeremy Irons as narrator was a stroke of genius!","user":"MR_Heraclius","rank":[34,35]},{"title":"One of the best wildlife documentaries to date","rating":8,"date":"12 February 2011","review":"I was one of the fortunate few who were introduced today to this cinematic dreamscape of Botswana and the incredible life of one brave lioness. The premiere in Houston, TX was presented by National Geographic and the audience was also treated to a Q&amp;A session with the actual film makers -- Dereck and Beverly Joubert. Quite an honor and special event offered to the contributors of the Big Cats initiative where the donations help dedicated researchers and animal conservationists find solutions to the grave threats facing lions, tigers, leopards, and other big cats. <br><br>This documentary provided scenes of survival that even this Big Cat Diary watcher has never witnessed. Amazing truths of the brutal life in the wild that these creatures face every day in Africa. Incredible scenes of the adaptation of the kings and queens of the jungle and their unwavering dedication to the protection of their young.<br><br>The musical score and cinematography, together with the slightly subdued drama beautifully presented by Jeremy Irons made this a truly riveting experience that I will never forget and, for which I am proud to be a continued supporter.<br><br>This is a must see for animal lovers.","user":"dblcap-1","rank":[24,32]},{"title":"Excellent film but NOT for small children","rating":10,"date":"17 February 2011","review":"I was fortunate enough to see LAST LIONS at National Geographic headquarters in DC last night. It is an excellent and compelling film. Beautifully photographed and a story that will have you grasping the armrests. Just one caveat - take the PG rating seriously. Do not bring little children. Nature can be very hard and the Jouberts do not flinch from showing this side. That said, older children and of course adults will be transported. I certainly was. Though certainly the creators' intent (and NG's, too) is to educate people about the plight of lions (50 years ago there were 450,000 in the wild, now just 20,000), you will be entertained as well as enlightened.","user":"mharding01","rank":[16,21]}]