[{"title":"Confused at the negative reviews.....","rating":9,"date":"30 January 2013","review":"I have watched this film twice now and off the back of the second viewing thought I would see what others thought of it. I was surprised and increasingly confused as I read one negative review after another. My confusion grew to frustration as I read comments like \"the only nudity is old, unattractive people\" and \"the characters aren't believable\". I feel these people have completely missed the point! First of all, if you want to see attractive people naked then may I politely suggest that romantic comedy is the wrong genre for you, I believe you'd get what you want in the 'adult' category - it's certainly bizarre and irrelevant to give this film a negative review because you don't get to see Jennifer Aniston in the buff! <br><br>Secondly,regarding the characters and all the oh-so-serious reviewers commenting on the silliness and irreverence of the plot and the character development, this is the sort of film that doesn't need to develop the characters or have a deep plot, it wouldn't work as well if it did actually. It's a light-hearted, fun movie. And it works. In my opinion it actually works beautifully, the whole film has a great vibe to it and certainly had me thinking that I might enjoy a brief dalliance on a commune! It's witty, amusing, warm and titillating at times, not for what it does show but for what it suggests about the lifestyle the couple find themselves in.<br><br>Take this film at face value and suspend your disbelief, take off your critic hat and just enjoy!","user":"ines-551-57572","rank":[31,41]},{"title":"Hilarious is you remember the late 1960's","rating":9,"date":"5 March 2013","review":"If you remember the late 1960's this movie is really funny. I laughed all the way through and this is unusual for me. To find a really funny, intelligent comedy is rare and very welcome.<br><br>There are some intense and somewhat \"uncomfortable\" moments but, to me, they were believable and gave the film some depth. I loved the way the characters dropped their facades in the final scenes - now that's a real \"truth-telling circle\". <br><br>The juxtaposition of different cultures and personalities was written brilliantly. I expect that sociologists will have a blast with this film.<br><br>I rented this, despite the low rating, because of Jennifer Aniston and Paul Rudd whom I consider to be wonderful comedic actors. It's great to see them together again.","user":"susanpstewart","rank":[23,30]},{"title":"I don't understand the hate..","rating":7,"date":"13 June 2012","review":"My room mates watched this flick, told me it was worth a watch but nothing special.<br><br>Full disclosure: I am a huge David Wain fan, I loved Stella, I watch Wainy Days, etc.<br><br>This movie is about two city types who have a run of bad luck, end up at hippie commune. Funny stuff ensues.<br><br>Not an original concept by any means but comedic none the less. Purely hilarious cast sans Paul Rudd, I'm not a huge fan but I understand why people do.<br><br>To the guy saying \"its unrealistic\": Hi, I'm movies. Have you ever seen me before? Bottom Line: If you liked The State, Stella, Michael &amp; Michael Have Issues, Children's Hospital, or the like. You will more than likely enjoy this movie.<br><br>7 out of 10.","user":"james-395-551090","rank":[28,40]}]