[{"title":"My son loved it...its a kid's movie!","rating":20,"date":"20 February 2017","review":"After seeing so many negative \"trolls\" on here about what people don't like about this film, I thought I would just throw one glaring fact out there...it's a movie for kids! And my 2.5 year old loved it! As far as he is concerned, it currently has infinite replay value. He really seems to like movies that have a great sound track...which this one does. The songs are enjoyable covers of easily recognizable pop songs from several decades, with some modified lyrics. The point is, if a film entertains your kid many times over, then the writers did something right. The plot was simple and was about what I expected. If you really hated this movie, stop being such a Bergen and lighten up!","user":"kdbtd","rank":[45,51]},{"title":"Family fun","rating":10,"date":"6 March 2017","review":"Keep in mind, this is a movie intended for kids!!! If you find singing in movies annoying, this isn't for you, but kids love it for the most part. I know mine did and I even liked it. Perfect for family night, if you are old school like I am. It is a refreshing tale of semi unique features that teaches courage, kindness and that its okay to be you. Very family friendly, cute and sparkly!","user":"sufferingsoulangelofdc","rank":[18,20]},{"title":"fun silly movie","rating":7,"date":"25 February 2017","review":"yes, this is a movie for young viewers, but it is fun. silliness and a simple story. but frankly we don't have enough of them in this movie era. the colors are great, the animation is fun and frankly as an adult, i did enjoy it. this movie is pure escape. it is fun to hear the voices of such esteemed actors playing such fun characters. Sometimes i think so many reviewers feel they must pan movies as they don't relay various critical standards.. However, this one isn't one. i like many types of movies and this is one of them. a purely fun and colorful take on things. enjoy it for what it is and don't over think it! not all movies need that. it is great for kids and adults if you look at it as being simply fun! i am well over 21 and liked it very much!","user":"sb-487-173392","rank":[16,18]}]