[{"title":"Best Killer Bear movie i've ever seen!","rating":8,"date":"17 June 2015","review":"I have seen so many killer bear movies, and none of them have really pulled it off really well. I am pleased to say that this is the best killer bear movie I have ever seen. How you can train a bear to do all of that is completely amazing! The plot is pretty good, but not great. But at the same time, it's quite simple. People are getting killed in the Grizzly Maze and when a bunch of rednecks come by and start killing the bear's babies, you can imagine it doesn't help the situation at hand. The bear is now angry, and goes on an even bigger rampage to kill everything and everyone.<br><br>The acting was good, especially from James Marsden, Piper Perablo and Billy Bob Thornton. Billy Bob Thornton plays the professional, greedy, annoying bear hunter, and to be honest, he was hardly in it. He was only in it for 15 minutes.<br><br>Overall, it was a great movie. I was never bored. I was always interested. The script was a bit weak, but the main actors did well with what they had.<br><br>Overall, I would give this movie an 8/10. The final showdown was pure genius! And Bart The Bear is the best acting bear I have ever seen! Definitely recommended.","user":"oldman007","rank":[34,48]},{"title":"\"Bearly\" watchable .......","rating":5,"date":"30 August 2015","review":"Despite the presence of talented actors Billy Bob Thornton and Scott Glenn, this hunted by a bear in the woods scenario, is so familiar there is little here of interest. If you have seen \"The Edge\" then you will know you are on well trodden territory, only difference being that \"The Edge\" is a great film, while \"Into the Grizzly Maze\" is not. Billy Bob Thornton easily has the best line in the movie \" Makes no difference to a hungry bear if it's a logger or a \"tree hugger\", they all taste the same.\" The writing is weak, the editing poor, and all of the characters underdeveloped. Not recommended and \"bearly\" watchable. - MERK","user":"merklekranz","rank":[31,44]},{"title":"Almost the Orca of Bear films","rating":13,"date":"13 February 2015","review":"When bodies start showing up in an Alaskan forest a local sheriff and his estranged brother go about find the bear before a seasoned hunter does. <br><br>It's hard not to draw comparison to other persons versus nature films, to it's credit it has a seasoned studded cast in what could have been the Jaws (1975) or Moby Dick of Bear movies. The location scenery and setting is fantastic, and there's some grizzly scenes (no pun intended) of hard to watch dead bear cubs, body dismemberment and so on. There's an abundance of kills in the forest, lodge attacks and in cars. Even with Saw V director David Hackl and with writers Guy Moshe and J.R. Reher it oddly feels only as special as AVP Requiem's brotherly love and forest scenes mixed with Abominable (2006).<br><br>Veteran Scott Glenn, excellent James Marsden, Thomas Jane as a hunter character turned conservationist who butts heads with Billy Bob Thornton's hardened hunter can't fix the lack of tension or continuity. Neither can the fine looking actors distract the fact that there's a TV air about the whole affair. The score is however great coupled with some fine cinematography and the star, bear Bart, possibly related to the late Bart the Bear and his mother from Grizzly (1976) steals the show. <br><br>It's nowhere near executed as well as The Edge (1997) or Ghost in the Darkness (1997), nor does it say more about conservation than The Bear (1988). What could have been Jaws, is more Orca - The Killer Whale. <br><br>As a killer bear film on revenge it's up in the top ten, but how many murderous bear films are there?","user":"amesmonde","rank":[34,50]}]