[{"title":"Cliché'd, but entertaining","rating":7,"date":"27 November 2013","review":"While watching this movie, I was reminded of a couple of films and TV shows from my youth, first was any of the original Godzilla films, the second, a TV show Ultra Man. The FX were way better here, but, it just made me think of them. I found the film entertaining, no Oscar winner, but, it was good. Some parts kept you on the edge of your seat, of course, rooting for the good guys.<br><br>I also had to think that mankind would have or could have thought of a better defense/offense weapon than giant robots. To bring a fight into the city would have cost trillions of dollars, perhaps Quadrillions of dollars. Okay, I'm reading way to much into it. Watch the movie, you will enjoy it.","user":"alr126","rank":[33,35]},{"title":"It's certainly not clever, but it is fun.","rating":7,"date":"10 November 2013","review":"To all the reviewers who gave this movie low ratings, I can only say this; What did you expect to see? Did you watch this expecting to see something deep and meaningful? The trailers and posters make it perfectly clear what kind of movie this is going to be. Heavy CGI, regular Hollywood 'save the planet' storyline re-run. Young eye candy super hot actors. You know the score. If you want to see something clever, this is not it and it was never going to be.<br><br>Question is, does it do the job it sets out to do? I think it does rather well, yeah OK, it's cheesy as hell and you know how it's going to end before it starts, ( the world will be saved right? ) considering it's being told in retrospect the clue to the inevitable ending is there in the first 10 seconds of the movie.<br><br>I liked the mind meld idea of the 2 pilots, and I thought they covered most bases explaining the technology behind the enormous robots (Jaegers) pretty well. It does have a few technical plot holes here and there, but the film does have a 'let's just get on with it' kind of feel. The alien creatures (Kaiju) are great and the robot v monster battles are superb. Towards the end the pace picks right up and the story starts to fall apart a bit, but by that point who cares? In general Pacific Rim is a fast paced, slick looking piece of techno-action that most Sci-Fi fans will enjoy. It's big, loud, dumb and very pretty, largely due to Guillermo Del Toro being at the helm.<br><br>It's Sunday afternoon on the sofa material I think. I know these kind of films are 'designed' for the big screen, but honestly I prefer them at home most of the time. Unless of course, you like feeling as though you are sitting the middle of a continuous explosion for and hour and half.","user":"drummer303","rank":[44,52]},{"title":"Not bad, not great","rating":7,"date":"27 November 2013","review":"Unlike some, I had no problem with the high concept of the piece: Transformers vs Godzilla. It had a lot of potential. And when the movie concentrates on what we are all here to see (giant creatures and robots beating on each others with oil tankers and smashing through skyscrapers) it is very successful. But when things get quiet... less so. Too much time spent on \"Top Gun\" like fighter pilot shenanigans. Not enough nuance in the characterizations. An ultra linear plot with few attempts to confound expectations. The acting isn't bad - and isn't required to be great in this sort of film - but it is nothing special either. Sort of universally \"meh\". Good for a Blu Ray rental.","user":"land-840-861366","rank":[33,42]}]