[{"title":"Atrocious...","rating":3,"date":"2 August 2014","review":"Green Lantern: Emerald Knights, by Christopher Berkeley, Lauren Montgomery, Jay Oliva, was a complete disaster! I don't know if a curse was put on the Green Lantern, but almost every movie starring him has been an abomination.<br><br>Unlike other Warner Brothers animated movies which offer us a complex and thrilling plot, Emerald Knights examined back story, after back story, after back story for almost every character which not only bored me to death, but it exasperated all the time that could of been used to focus on the main plot. I understand some people don't know the back story of the Green Lanterns, but character development should not consume more than half of the movie especially when the back stories were thematically unoriginal and one dimensionally monotonous. Furthermore, having so many origin stories was incredibly distracting to the flow of the movie. As a TV show this concept would have been much more successful; however, such a theme is completely irresponsible in a movie due to the time restraints of a film. <br><br>If you examine every DC animated film, you'll notice that maybe 10- 15 minutes is given for a super heroes origins, than it focuses on the main idea which will drive the bus the rest of the way. An excellent example of this structure would be the animated movie Wonder Woman.<br><br>As much as I like Green Lantern's character, Emerald Knights was incredibly mundane and ultimately scattered. For this reason, I give it a 3.","user":"crimson_knight_7","rank":[38,53]},{"title":"Green Lantern Emerald Knights: For fans only","rating":4,"date":"8 January 2018","review":"Emerald Knights has a story it does, but it makes up a small percentage of the film as most of it is short tales being regaled to the newest member of the Lantern Corps.<br><br>Some are good, some are meh, but the whole thing felt very incomplete due to this.<br><br>With fantastic voice talent including Nathan Fillion, Henry Rollins &amp; Kelly Hu the effort/budget clearly went into this but alike the original Green Lantern offering I simply don't get the appeal.<br><br>Weird aliens, bizzare powers and lore that keeps shifting.<br><br>What bugs me about all these animated movies is that they aren't connected and have no consistency. Characters who died are back, events that happened never took place etc etc and that's very evident here. They really need to make an animated universe and stick with it.<br><br>Emerald Knights isn't terrible, I'm just not the demographic.<br><br>The Good:<br><br>Opening sequence was brutal<br><br>Kelly Hu &amp; Henry Rollins<br><br>The Bad:<br><br>Contradicts the lore in places<br><br>Spread rather thin<br><br>Things I Learnt From This Movie:<br><br>The guardians are smurfs","user":"Platypuschow","rank":[5,7]},{"title":"Nice Little Film","rating":9,"date":"8 June 2011","review":"This is WB and DC doing a little warm-up for the big budget movie on Green Lantern that is coming out this month.<br><br>As always, the Animation Team probably has a better grasp on the characters and settings than the suits in Hollywood ever do.<br><br>The Green Lantern Corps faces an inter-dimensional threat, and while they wait for the final confrontation, they tell stories of the greatest accomplishments of the Corps.<br><br>The movie is probably at its weakest in the fact that they have Nathan Fillian of \"Firefly\" fame doing the voice of Hal Jordan (Why isn't he doing it in the Live Action version? Why?) but he is only involved in the wrap around story that keeps the plot moving from one section to the next.<br><br>The stories themselves are quite good, though. Each one a little gem, even if a bit predictable even for the fan who is familiar with this universe.","user":"JoeB131","rank":[27,57]}]