[{"title":"This is definitely a children's movie.","rating":5,"date":"19 October 2019","review":"I am an avid fan of the Addams family, and rewatch their movies each Halloween season. When I saw there was to be an animated re-make, I pictured it to be a mixture of the timelessness of their previous films and the entertainment of The Nightmare Before Christmas - fun for the whole family. However, as a young adult, I was not in the least bit entertained. The story line was definitely created for children, depicting the importance of inclusion/acceptance and family bond. Which I'm sure is very important for the younger generations. Yet I just was unable to connect with my long-standing enthusiasm for the Addams family during this movie.","user":"themoviedoctor","rank":[105,126]},{"title":"this is not the Addams Family","rating":2,"date":"26 December 2019","review":"This adaptation completely disregards (or forgets??) who the Addams' are, and the charm is gone.<br><br>The Addams Family are - as the song goes - mysterious and spooky. They delight in the macabre, BUT are unaware that other people find them bizarre or frightening. THAT'S THE COMEDY OF THE ENTIRE FRANCHISE.<br><br>This adaptation slaps the franchise in the face and gives us a fluffy, cheery and unrecognizable versions of the characters we've loved for years.<br><br>This family is desperate to fit in with the rest of society. They're aware of their own gags. Lurch plays pop music. Grand-mama (called Grandma in this version) even says she loves her Grandkids and has the hots for Fabio. Pugsley is just an annoying kid like any other. I don't know who these characters are, but they are not The Addams Family.<br><br>The story is flat and the villain-turned-voyeur is just bizarre.<br><br>The illustration style is taken from the original 1930's comic strips - which is a great touch - but nothing else, and I mean NOTHING else works here.","user":"Fixer-13257","rank":[70,85]},{"title":"Entertaining enough","rating":7,"date":"10 October 2019","review":"The intention here is obviously to introduce a new generation to the Addams Family. The film starts completely fresh and tells the origins of the entire family as a stand alone film. As someone who grew up watching the 90s films, cartoons, and re-runs I actually didn't mind this. They presented a straightforward well contained story that has plenty of jokes for both children and adults, which I laughed at enough of to stay entertained throughout the film.","user":"DeadMansTrousers","rank":[113,159]}]