[{"title":"Intense and thought provoking","rating":7,"date":"15 March 2011","review":"Wasted on the Young is an intense movie in the vein of Animal Kingdom but with a subject matter most similar to Brick. It is well crafted and the production value seems high for the tight budget they were undoubtedly restricted to.<br><br>The film is about a group of young people in an Australian private school whose lives are changed due to a horrific event that takes place at a wild party at the \"alpha male\" of the school's house. It is a very intense and engaging movie but unfortunately the ending was a bit of a let down and didn't really fit with the rest of the film.<br><br>The absence of any adult or authority figures in the movie is telling and the interaction between the perpetrators and victims is at times very disturbing.<br><br>It is a very interesting movie and it is a shame the ending wasn't as good as I hoped it would be but it well worth spending the time and money to see this film.","user":"roffma","rank":[25,33]},{"title":"Where it falters is in its lack of moderation. Lucas doesn't believe in any. His film travels from one extreme to another","rating":6,"date":"2 February 2011","review":"Zack (Alex Russell) and Darren (Oliver Ackland) are stepbrothers who are living under the same luxurious roof together while their parents are away. Both boys are on the high school swimming team but Zack is certified as the captain. He's involved with drugs and throwing parties though and is made untouchable by his reputation and his two friends who act like standover men. Darren is far more withdrawn. He spends most of his time studying and playing games but also manages to catch the eye of Xandrie (Adelaide Clemens). She's set to meet him at a party but he arrives late and can't find her. A jealous girl thinks that Xandrie is going to sleep with Zack so she spikes her drink and leaves her at the mercy of Zack and his goons. She is assaulted and left for dead on a beach. With the weight of guilt on his shoulders for ignoring Xandrie, Darren sets out to find out the truth, firstly consulting a security recording of the night. <br><br>I admire the courage of the Australian film industry, specifically its uncompromised approach in dealing with important social issues. People who value cinema for safe, populist entertainment often sneer at these gritty and challenging films. As such, they regular fail to excite the box office and are viewed foolishly as artistically meritless. But as important as it is for a film to challenge the realities of our society, there is fine line between a well researched critique of an issue, like in Blessed and The Combination and cheap sensationalism and finger pointing. Writer and director Ben C. Lucas cannot find the balance. There's a nastiness running all throughout his film. It's deliberately claustrophobic, filmed with harsh, dark textures and cold steel. It's effective in unsettling us through its look, its heavy ambient sound effects and clever structure too. It begins in medias res, with Xandrie's body on the beach and then goes back in time to work up to the crime. Where it falters is in its lack of moderation. Lucas doesn't believe in any. His film travels from one extreme to another, solely to inflate the drama and reinforce parents' preconceived ideas about their children. <br><br>Lucas likes to paint broad strokes and is for one blindly nihilistic in his outlook of multimedia. The social networking sites and the text messaging shown in the film regularly lead to miscommunication and rumour. The convenience and usefulness of the technology feels entirely overshadowed and overlooked. Even the possible video evidence of the crime takes a backseat to overly dramatic confrontations. Similarly, teenagers might not be the most pleasant people but there are very few who are completely irredeemable. Yet Lucas tries his best to make us think so about a number of his characters. There's a lot of mean- spirited behaviour, coarse dialogue and the needlessly excessive violence. At the beginning of a film a boy asks Zack about the party to which he responds in asking if he's looking for a corner to blow him. The boy is then punched in the face, without consequence. For whatever reason, a freakish red haired kid is also shown sending pictures of his penis to girls at school. There are multiple public beatings in this film too, with people punched and cracked over the head with bottles, a school shooting and even a more implied torture scene. It's gratuitous, not insightful, because these scenes exist only to be climactic, rather than having a willingness to explore deeper psychological experiences. <br><br>These problems are frustrating because glimpses of more rounded and developed characters are occasionally visible. Darren is understandably driven by guilt, even if Ackland can't take us to the right emotional levels, beyond his hollow eyes. Russell also makes Zack a more interesting baddie, even if he is a little heavy handed. Zack's a sport jock, but a logical one and uses common sense to distance himself from the chaos. If only Lucas didn't undermine an interesting trait straight after Zack talks himself out of a situation with a panic attack. It weakens our belief in his confidence. Clemens impressed me the most. With limited on screen time she's appropriately more conscious about the situation than anyone else and is as such, more natural, human and touching. The lack of adult characters is still a big pitfall. It's meant to ride the metaphor that these kids have no one to answer to. But their omission is never properly explained and it allows Lucas to distance them from a lot of the blame. Like so much of the film, it just makes us wonder why he's so strictly negative about today's youth.","user":"Likes_Ninjas90","rank":[28,39]},{"title":"Not Quite A Waste","rating":6,"date":"12 March 2011","review":"In a word: intriguing. In a few more, an ardent revenge film that shows substance and style in some areas, but appears to have bitten off more than it can chew in others. This little-known Australian film continues to follow the trend in the local film industry. That is, for every Kenny and Kings Of Mykonos crowd-pleaser released, many more dark and brutal Aussie films fall by the wayside only to be discovered by a handful of people each time, with Animal Kingdom being a noted exception.<br><br>The film follows Darren (Oliver Ackland), a nice-enough high schooler who spends most of his time around computers and homework. He is the polar opposite of stepbrother Zack (Alex Russell), whose priority is maintaining a reputation as Mr. Popular. Things take a sinister turn when the shy Xandrie (Adelaide Clemens, a dead ringer for Michelle Williams) is invited to one of Zack's house parties and goes missing for almost a week afterwards. By the time she returns, the school is rife with rumours surrounding her disappearance, and Darren, suspecting his stepbrother and his nasty bunch of friends, decides to find out the truth and punish those responsible.<br><br>As mentioned, cinematic style is a big part of Wasted On The Young, and may well be the film's highlight. Unique editing and camera-work during the house party scenes result in an indulgent, but not stereotypical, world that these kids inhabit. It's certainly no accident that the house used is an extremely modern one, full of glass corridors, open spaces and hidden rooms that allow the camera to almost become another character.<br><br>Wasted On The Young is rife with themes relevant to today's social landscape. Positively, these themes keep from interrupting each other because of the way they are presented one after the other, compounding the film's message. While it starts out as a critique of social networking, it soon becomes more about what our society may be reduced to in the absence of all authority, where the strong rule and the weak have no freedom. As if that wasn't intense enough, it goes on to pose a more challenging question: What happens when the weak decide they've had enough?<br><br>If that sounds like a badly concealed ad, I'll stop now. Because for all the thought-provoking ideas being presented, none of them are really driven home enough to make one think 'yes, that's the message the movie is trying to make.' The fact that it is set in a private school leads to a lack of realism regarding the whole 'no authority' angle, but once you make the connection that the setting only exists to support the metaphor, the film becomes a little more immersive. Other moments, including the climax, completely remove the moderation and consistency from a film that had remained fairly grounded in believability until that point.<br><br>The film could have dropped below the ninety-minute mark by cutting out a lot of gratuitous and unnecessary fluff during the Third Act. Fights and arguments among secondary characters were clearly included to both resolve character arcs and build the severity of the climax, but all they end up doing is ruining the pace and prolonging what has become a forgone conclusion by this point.<br><br>Nonetheless, in a choice simply between 'go' and 'don't go', I say 'go', if for no other reason than to make up your own mind on this ambitious endeavour.<br><br>*There's nothing I love more than a bit of feedback, good or bad. So drop me a line on jnatsis@iprimus.com.au and let me know what you thought of my review.*","user":"Jonathon_Natsis","rank":[19,28]}]