[{"title":"A Charming Sequel","rating":9,"date":"4 April 2013","review":"Dramatic plot twists, secret love interests, buried treasure! It's all in this charming sequel to \"Mandi and the Secret Tunnel.\" The beloved cast returns once again but this time, to stop Jim Shaw from traveling into a poisoned gold mine. <br><br>The two bumbling crooks (whose names escape me) return as well, teamed up with a bandit with a scraggly beard - who isn't all he appears to be - as they try to steal the gold from the mine. The gold is hidden, and the map is written in riddles. It's a race as Mandi, Polly, Joe, as well as Elizabeth - Mandi's mother - try to reach the mine before the crooks.<br><br>With light-hearted humor, family fun, and lavish costumes and sets, this movie gets a 9 out of 10. The plot is consistent with the first film and holds all sorts of new surprises.<br><br>Definitely worth renting.","user":"mcalester66","rank":[2,2]},{"title":"See the first one first","rating":5,"date":"24 November 2019","review":"I made the big mistake of watching this film before I saw the first Mandie film. I\nwas most confused on initial viewing of Mandie And The Cherokee Treasure. The\nproducers assumed everyone saw the first when they made this one.<br><br>Saying that this was another charming juvenile adventure film set in 1899 Tennessee with Lexi Johnson as our teen heroine. She's now reunited with the\nmother she thought dead L.A. Winters and living with her uncle Terrall Andrew\non that nice plantation.<br><br>There's a treasure hidden in a cave which has nasty sulphur fumes, hidden\nthere by the Cherokee in their diaspora. The uncle wants to get it and return\nit to the tribe and he forbids Mandie and her posse to come along. That's not\ndeterring the kids at all, nor are other and villainous treasure seekers.<br><br>Nice 1899 atmosphere recreated by the film once again. Johnson and her crew\nbear a faint resemblance to Disney's Lizzie McGuire and her friends.<br><br>Still a blue eyed blond Cherokee does not compute.","user":"bkoganbing","rank":[1,1]},{"title":"A Very Enjoyable Sequel (Rich with Scenery, Adventure and Friendship)","rating":10,"date":"1 March 2012","review":"I continue to be amazed at the breadth of quality provided by the cast and production of these Mandie movies (which are mostly based on the book series). These movies are fun for the entire family! <br><br>The scenery, costumes, mansions, train, and the wonderful use of imagery and lighting, are all high points! <br><br>The plot is full of adventure, as three different groups (John and Ned, Mandie and Polly and Joe, and the Bad Guys) all strive to complete their various goals. Ultimately this requires entering and surviving an abandoned cave mine, filled with danger and intrigue:)<br><br>It is best to view the first movie, \"Mandie And The Secret Tunnel\" before this sequel, although some background flashbacks are provided to orient the viewer. <br><br>The youthful actress playing Mandie (Lexi Johnson) continues to display the qualities of an experienced performer (attention to detail, nuanced expressions, superb articulation and presence). <br><br>Note: I believe that movies based on books of fiction, should be judged solely on their own merit. Producers should have license to adjust the plot if needed (to expand the maturity rating for a family audience, etc).","user":"FairReview","rank":[0,0]}]