[{"title":"Theron Delivers the Goods as the Unrepentant Queen of Small-Town Mean","rating":8,"date":"19 December 2011","review":"Without an iota of irony, Charlize Theron finally uses her intimidating beauty for pure Machiavellian evil, and the results are fortuitous in this dark-hued 2011 comedy, the latest collaboration of director Jason Reitman and screenwriter Diablo Cody (\"Juno\"). She's absolutely spot-on terrific playing Mavis Gary, the condescending, hateful high school girl who comes back to Mercury, her podunk hometown nearly two decades later. Mavis is no Blanche Dubois-type character whose ladylike beauty has faded into a gauzy romantic delusion. No, Mavis is still one hot babe and very much the complete narcissist she was as a teenager, emotionally stunted despite her relative worldliness having moved to Minneapolis to become a ghostwriter of a series of teen novels.<br><br>It's not surprising she finds success writing for an adolescent audience since she still defines her life with teenage-level priorities and fantasies. As she has proved with \"Juno\", Cody is thoroughly fluent with this perspective, but the twist is that this time, it's coming from a jaded 37-year-old woman. Even though Mavis is a divorcée who lives in a high-rise apartment with a toy dog and can easily get any man she wants, she is triggered by a birth announcement email she receives from her high school sweetheart Buddy Slade and becomes fixated on getting him back all these years later. It doesn't matter that he's happily married and perfectly content living in Mercury. She concocts a scheme to make herself so alluring that he will want to run away with her. Normally, this would be an excuse for broad comedy machinations, but Theron is so gorgeous that it makes her shameless attempts at seduction all the more edgily desperate.<br><br>It's a narrowly developed plot for sure, but surprisingly, what enriches the proceedings is the unexpected relationship Mavis develops with Matt Freehauf, a sad-sack former classmate whose sole claim to notoriety was being the victim of a hate crime when he was beaten up and left for dead by a group of jocks who assumed he was gay. He has been left crippled, living in Mercury with his sister making his own home-brewed bourbon and putting together mix-and-match action figures. That Mavis and Matt connect is all the more intriguing since they were at opposite ends of the social spectrum back in school, and their present-day bond is also fueled by her obvious alcoholism, a point that is overlooked by her befuddled parents who wish to think of Mavis as the flawless pretty daughter of their own deluded fantasies. The story evolves in the direction you would expect but not before certain revelations come to light in a tortuous scene at the baby-naming party Buddy and his sensible wife Beth have with all their relatives and close friends in attendance.<br><br>Beyond Theron's fearless work and intentionally deadpan line delivery, there is comedian Patton Oswalt's surprisingly affecting performance as Matt. I only know him from his recurring role as a comical sad-sack on the sitcom \"King of Queens\", so it's surprising to see the amount of texture he brings to this role. As Buddy, Patrick Wilson once again plays the sought-after himbo, but this time, his character's unshaven, small-town modesty comes across as more contrite with his character's feelings toward Mavis left quite elliptical. Elizabeth Reaser (\"Sweet Land\") isn't given that much to do as Beth, probably by intention, but Collette Wolf has a few impactful moments as Matt's insulated sister still idolizing Mavis after all these years. As he showed with \"Juno\" and \"Up in the Air\", Reitman shows a deft hand with actors playing flawed characters who try to manipulate their circumstances but fall short of their vaunted expectations.","user":"EUyeshima","rank":[132,155]},{"title":"refreshing","rating":7,"date":"26 January 2012","review":"If nothing else, 'Young Adult' is a breath of fresh air. Written by Juno creator Diablo Cody and director Jason Reitman, YA is like a distant sequel - if Juno had moved to the city, got married and divorced and started drinking. 'Young Adult' is darkly funny, confronting, a bit depressing at times and has a refreshing sense of realism. It's not afraid to show broken characters battling their own demons and the mundane and sometimes bleak suburban existence.<br><br>Charlize Theron played Mavis, a relatively successful teen fiction author in Minneapolis who's reached a crossroads. Recently divorced and struggling to write her latest novel, she receives an email from her high school flame Buddy (Patrick Wilson) announcing his new baby. Mavis convinces herself that Buddy still loves her - despite being happily married to Beth (Elizabeth Reaser) – and goes back to Minnesota to win him back. Along the way she meets Matt (Patton Oswalt), a short, fat, reclusive man still emotionally and physically scarred by a hate crime in high school, who was all but ignored by the younger Mavis despite being locker-mates. Despite her intentions for Buddy, Mavis and Matt bond.<br><br>The unlikely relationship between Mavis and Matt is, for me, is the highlight of the movie: Matt sees through Mavis' charade and isn't afraid to let her know about it, being downright rude at times, he's not the \"Mr. Nice Guy\" you may expect. The chemistry between Theron and Oswalt is brilliant. While they may be worlds apart socially and physically, their relationship is believable. After \"uglying herself up\" for 'Monster', Theron again eschews her glamorous image for the sake of a role. While Mavis is undoubtedly beautiful, she's clearly damaged and lonely, clinging onto an imagined ideal of happiness and completely ignoring reality. Her obsession with Buddy is demonstrated on her drive to Minnesota: playing an old mix tape in her car, she repeatedly plays the song that she and Buddy first made love to.<br><br>While 'Young Adult' may be a shock to some, that's what makes it so good. In a climate littered with clichéd, paint-by-numbers rom-coms with nauseatingly happy endings, its refreshing to see a movie which tackles the darker side of life.","user":"Donatien3","rank":[36,44]},{"title":"Baggage and Bourbon, Neat","rating":6,"date":"14 December 2011","review":"Greetings again from the darkness. Writer Diablo Cody and Director Jason Reitman reunite for the first time since their breakout hit \"Juno\". In that fine film, we were treated to many optimistic and sarcastic life lessons from a very likable, and easy to cheer for, teenage girl. This time around we get the caustic, childlike self-centeredness of a mid-30's alcoholic sadly trying to recapture the magic of her high school years as the prom queen dating the coolest guy.<br><br>Ms. Cody and Mr. Reitman deserve much credit for steering clear of the Hollywood traditions of redemption, remorse, and turning over a new leaf. In fact, we probably dislike Mavis (Charlize Theron) even more as the movie ends than we did in the film's first 5 minutes, if that's even possible. It takes courage as a filmmaker to have a lead character who is disliked through the entire movie, not just by the people in her life, but also by the audience. It also takes a special actress to pull this off. If you saw Theron in her Oscar winning role in \"Monster\", believe me when I say that she is equally unsympathetic here ... though she does commit fewer actual crimes.<br><br>This film is erroneously marketed as a smart comedy. While there are some funny elements, it's difficult to find much humor in someone who is so unstable and narcissistic. Wisely, the script provides us with Matt (Patton Oswalt) as the voice of reason. He sees through the Mavis mask and speaks directly in his attempts to divert her from her plan. That plan is to break up the marriage of her high school sweetheart (Patrick Wilson). Oh yeah, he just happens to be happily married (Elizabeth Reaser) with a newborn baby.<br><br>The best scenes of the film are between Mavis and Matt. She is oblivious to her negative effect on others, while he shoots her straight while avoiding his own harsh reality. See, Matt was the victim of a vicious hate crime, which left his leg (and other things) mangled. His own view of life is why he can see right through Mavis and her issues. While I so admire the basis of the script, I just believe there is a missing element. The element of hope and optimism. Heck, even when Mavis admits she \"might be an alcoholic\", her parents shrug it off and change topics. Sometimes crying out for help just isn't enough.<br><br>The film is worth seeing for the performances of Theron and Oswalt, as well as for the unique script. Just don't get tricked into believing it's some laugh riot with a fairy tale ending. Mavis is a ghost writer for teen novels, and she writes the latest as she lives this nightmare of a trip back home. My only real question ... is she mature enough to write for teens?","user":"ferguson-6","rank":[82,111]}]