[{"title":"Good plot, lousy writing","rating":9,"date":"9 September 2011","review":"This could have been a fun movie...there is a plot, the casting is good...but once again, we have a prime case of screen writers who really aren't. It's as if, in half the movies these days, and this is a perfect example of one, the writers have no clue as to how to write dialogue, so they decide to talk dirty for an hour and a half and call it good. It isn't. It's awful. If this is still the remains of trying for shock value in movies, it doesn't work anymore. It's boring. It's dull. It's repetitive. Viewers don't want shock value. We want entertainment. Somewhere out there in Hollywood land, there have to be writers who can actually write - who have imagination - who have creativity. But, unfortunately, none were hired for this movie. Blah!","user":"patsworld","rank":[103,149]},{"title":"Less than Funny","rating":11,"date":"11 August 2011","review":"Jokes are overrated. The best comedies cull humor from character flaws, and while the cast of 30 Minutes or Less has those to spare, human foibles have little bearing on the way these people behave. Instead, it's about one-liners and crass one-upmanship in a string of exponentially less believable scenarios. First time screenwriter Michael Diliberti (previously credited as executive assistant to producer Scott Rudin) blunders his way past a great premise to lowest common denominator comedy.<br><br>Nick (played by Jesse Eisenberg of The Social Network) is a pizza delivery boy who gets jumped by a pair of goons (Danny McBride, Nick Swardson), and strapped with a bomb and an ultimatum: rob a bank within ten hours or face the explosive consequences. Sounds exciting, right? Wrong.<br><br>Zombieland director Ruben Fleischer ignores the inherent tension. The homemade bomb should be a volatile, omnipresent threat, but there's never any indication that the device will actually explode. Granted, I'm not expecting Hitchcock here, but if I can't have suspense, even logic would suffice. With a whole ten hours on the clock, Nick and his buddy Chet (Aziz Ansari) idiotically ignore every safer stratagem at their disposal while playing ball with the crooks.<br><br>Part of the problem is that McBride and Swardson are portrayed as such inept villains, and occupy so much screen time. 30 Minutes or Less, at 90 minutes or less, prominently features these characters out of necessity to fulfill its own feature-length ambitions. Dramatically, it makes no sense — is Nick really the type of guy who would steal $100,000 at the behest of stooges like these?<br><br>A better 30 Minutes or Less would have ditched its emphasis on the antagonists and focused instead on Nick's foiled attempts to extricate himself from his predicament. As it stands, he seems all too willing to make himself an antihero: not just in robbery, but in voluntary crimes like grand theft auto and threatening a cop. It would have been more believable and exciting if the character complied only as a desperate last resort. That his roommate accompanies him on the heist is more asinine still.<br><br>As always, if 30 Minutes or Less were funnier, it would be easy to forgive the injustice done to its premise. The humor is hit-and-miss leaning toward the latter, and even my eager audience was rendered deafly silent by many of McBride's big moments. It isn't expressly his fault — his character just doesn't belong in the movie, and there's not much character there to begin with.<br><br>To draw a comparison, Tropic Thunder ranks among my favorite action-comedies of recent years because its characters instigate the plot, not vice versa. In that film, dramatic tension is elevated by the conflicting egos of its cast. In 30 Minutes or Less, narrative devices as lethal as Nick's bomb vest routinely hold the story ransom.<br><br>But the real robbery isn't a bank job — it's the shameless adoption of modern comedy's worst habits by Diliberti and Fleischer. From their casts of emotionally stunted man-children to their disposable pop-culture jabs and gratuitous bawdy dialogue, the irony of these R-rated comedies is that they cater to a PG-13 crowd. 30 Minutes or Less had an opportunity to distinguish itself with action beats, but the nearest it comes to Die Hard and Lethal Weapon is mentioning them. Even in a summer with little competition, Fleischer's film is light on laughs and even lighter on character. Now there's a commodity that's underrated.","user":"colinrgeorge","rank":[25,34]},{"title":"What Humour?","rating":2,"date":"14 August 2011","review":"Everyone is saying it is the funniest movie of the summer. There was no humour in this movie. I didn't hear a laugh in the whole theatre. It was so boring I was waiting for the bomb to go off so the movie would be over.<br><br>I thought from the director of Zombieland it would be a lot better. Can I have my money back?<br><br>The language and sex were a turn off. Near the end it did get a little better..only because maybe the end of the movie was in sight. Nick Swardson was the stand out character. If there was comic relief it came from him. Wait for the DVD to come out save your money.","user":"cashmere-12","rank":[49,73]}]