[{"title":"Cruelty to animals","rating":1,"date":"22 September 2017","review":"In the scene where David is with some hillbillies there's a shot of a starved dog chained up. All bones.<br><br>How can a show not care about an animal and actually point a camera and air such cruelty!! The producers, directors and David should be ashamed of having walked away of a suffering dog that was not an illusion.","user":"ahlilly","rank":[4,8]},{"title":"Some magic in here, but not a defining movie for sure","rating":4,"date":"20 November 2016","review":"\"David Blaine: What Is Magic?\" is a 43-minute documentary film from 2010, so this US American movie is already over 5 years old. The writer is James Spector and the director is David Blaine, a magician who is also the star of these 3 quarters of an hour and Spector worked with him on several occasions. Small cameos come from a couple known guys like Orlando Bloom or Eli Manning. The first 30 minutes or so is Blaine performing magic in the streets and this is an okay watch at that point. Some magic tricks are certainly more entertaining than others, but it's all good. Sadkly, I cannot say the same about the ending, where it really goes for a spectacular stunt in a desperate attempt to make this somehow really memorable, but I found it just stupid and unappealing. Magic has to do with wit for me too and catching a bullet with your teeth is rather something I'd expect from the Jackass crew and not from David Blaine. This ending is where he lost me and also crucial in my final verdict that I do not recommend the watch. Still, if you are not familiar with Blaine, it may be a decent choice to go for as it is one of his shortest films, maybe even his shortest, so if you don't care, at least it's quickly over. As for me, I believe they saved the worst for last.","user":"Horst_In_Translation","rank":[0,0]},{"title":"Sort of a Throw Away","rating":6,"date":"21 November 2016","review":"Blaine enters the Hurricane stricken Ninth Ward in New Orleans and changes some people's luck. When he returns home to New York City, viewers see him doing magic for some of his friends, including Orlando Bloom, John Mayer and the Super Bowl Champion NY Giants.<br><br>David Blaine is a great magician and has some great specials. This may not be one of them. While it has a few interesting moments, there are none of the big tricks he has shown in other specials, both before or after. And if his biggest celebrity guest is Kimbo Slice, that's not enough to draw me in.<br><br>What is really odd is the goofy residents of New Orleans who are highlighted. I like the idea of cheering people up with magic, but it almost seems like some of these residents were picked out to make the city look silly. (You know which three people I mean if you've seen this.)","user":"gavin6942","rank":[0,1]}]