[{"title":"Keep calm and keep writing","rating":8,"date":"6 May 2017","review":"In a well-mined category, \"Their Finest\" is a World War 2 comedy/drama telling a tale I haven't seen told before: the story behind the British Ministry of Information and their drive to produce propaganda films that support morale and promote positive messages in a time of national crisis. For it is 1940 and London is under nightly attack by the Luftwaffe during the time known as \"The Blitz\". Unfortunately the Ministry is run by a bunch of toffs, and their output is laughably misaligned with the working class population, and especially the female population:&nbsp; with their husbands fighting overseas, these two groups are fast becoming one and the same. For women are finding and enjoying new empowerment and freedom in being socially unshackled from the kitchen sink.&nbsp;<br><br>Enter Catrin Cole (Gemma Arterton, \"The Girl with all the Gifts\") who is one such woman arriving to a dangerous London from South Wales to live with struggling disabled artist Ellis (Jack Huston, grandson of John Huston). Catrin, stretching the truth a little, brings a stirring 'true' tale of derring-do about the Dunkirk evacuation to the Ministry's attention. She is then employed to \"write the slop\" (the woman's dialogue) in the writing team headed by spiky Tom Buckley (Sam Claflin, \"Me Before You\").<br><br>One of the stars of the film within the film is 'Uncle Frank' played by the aging but charismatic actor Ambrose Hilliard (Bill Nighy, \"Dad's Army\", \"Love Actually\"). Catrin proves her worth by pouring oil on troubled waters as the army insist on the introduction of an American airman (Jake Lacy, \"Carol\") to the stressful mix. An attraction builds between Catrin and Tom, but how will the love triangle resolve itself?<br><br>As you might expect if you've seen the trailer the film is, in the main, warm and funny with Gemma Arterton just gorgeously huggable as the determined young lady trying to make it in a misogynistic 40's world of work. Arterton is just the perfect \"girl next door\". But mixed in with the humour and the romantic storyline is a harsh sprinkling of the trials of war and not a little heartbreak occurs.&nbsp; This is at least a 5 tissue movie.&nbsp;<br><br>Claflin, who is having a strong year with appearances in a wide range of films, is also eminently watchable. One of his best scenes is a speech with Arterton about \"why people love the movies\", a theory that the film merrily and memorably drives a stake through the heart of! &nbsp;<br><br>Elsewhere Lacy is hilarious as the hapless airman with zero acting ability; Helen McCrory (\"Harry Potter\") as Sophie Smith vamps it up wonderfully as the potential Polish love interest for Hilliard; Richard E Grant (\"Logan\") and Jeremy Irons (\"The Lion King\", \"Die Hard: with a Vengeance\") pop up in useful cameos and Eddie Marsan (\"Sherlock Holmes\") is also touching as Hilliard's long-suffering agent.&nbsp;<br><br>But it is Bill Nighy's Hilliard who carries most of the wit and humour of the film with his pompous thespian persona, basking in the dwindling glory of a much loved series of \"Inspector Lynley\" films. With his pomposity progressively warming under the thawing effect of Sophie and Catrin, you have to love him!&nbsp; Bill Nighy is, well, Bill Nighy. Hugh Grant gets it (unfairly) in the neck for \"being Hugh Grant\" in every film, but this pales in comparison with Nighy's performances!&nbsp; But who cares: his kooky delivery is just delightful and he is a national treasure!<br><br>Slightly less convincing for me was Rachael Stirling's role as a butch ministry busybody with more than a hint of the lesbian about her.&nbsp; Stirling's performance in the role is fine, but would this really have been so blatant in 1940's Britain?&nbsp; This didn't really ring true for me.&nbsp;<br><br>While the film gamely tries to pull off London in the Blitz the film's limited budget (around £25m) makes everything feel a little underpowered and 'empty':&nbsp; a few hundred more extras in the Underground/Blitz scenes for example would have helped no end. <br><br>However, the special effects crew do their best and the cinematography by Sebastian Blenkov (\"The Riot Club\") suitably conveys the mood:&nbsp; a scene where Catrin gets caught in a bomb blast outside a clothes shop is particularly moving.<br><br>As with all comedy dramas, sometimes the bedfellows lie uncomfortably with each other, and a couple of plot twists: one highly predictable; one shockingly unpredictable make this a non-linear watch. This roller-coaster of a script by Gaby Chiappe, in an excellent feature film debut (she actually also has a cameo in the propaganda \"carrot film\"!), undeniably adds interest and makes the film more memorable. However (I know from personal experience) that the twist did not please everyone in the audience!&nbsp;<br><br>Despite its occasionally uneven tone, this is a really enjoyable watch (particularly for more mature audiences) and Danish director Lone Scherfig finally has a vehicle that matches the quality of her much praised Carey Mulligan vehicle \"An Education\".<br><br>(For the graphical version of this review, please visit bob-the-movie- man.com. Thanks.)","user":"bob-the-movie-man","rank":[41,50]},{"title":"A stirring, sentimental, satisfying peek into WWII propaganda filmmaking and romance.","rating":24,"date":"24 April 2017","review":"\"They're afraid they won't be able to put us back in the box when this is over, and it makes them belligerent.\" Phyl Moore (Rachael Stirling)<br><br>Phyl is spot on about the focus of Their Finest, a period piece (1940) about the British film industry's part in supporting WWII. The heart of this sometimes comic romance is Catrin's (Gemma Arterton) emergence from secretary to writer in a time when women were expected to be no more than secretaries. Of course, they would no more be \"in the box\" after the war.<br><br>Comic moments are plentiful, especially when aging actor Ambrose Hilliard (Bill Nighy at his best) is on screen. He is in a company producing a propaganda film to support the war and perhaps induce the USA to enter the war. Although seeing the inventive ways the industry created special effects and worked through themes would be a reason for a cinephile to see this film, the higher takeaway is the growing empowerment of Catrin, and all women, not just in Britain but everywhere.<br><br>She has a growing affection for fellow writer Ellis (Jack Huston—Yes, that Huston grandson), slow and so British reserved that it is one of the best romances of the year. Although I have reservations about a woman needing a man to be successful, this romance is authentic because it grows like ripening fruit, no passion or flowery bombast to speed it along.<br><br>Beyond the romance and the mechanics of early filmmaking, the art of writing is satisfactorily treated, in fact one of the first times I have seen it depicted as a communal effort. Besides, I love seeing ideas and dialogue worked out among the team without overly-dramatic flourishes but rather with the kind of quiet discovery that may have occurred with any successful team effort.<br><br>Their Finest is part old-fashioned filmmaking with sentiment and sense overlaid by a progressive theme showing the ascendancy of women in WWII beyond \"Rosie the Riveter.\" You'll cry a little, you'll laugh a little, and you'll nod your head a little in admiration of the contributions made in big wars by this marvelous art form, film.","user":"jdesando","rank":[27,33]},{"title":"Good movie about people who make good movies.","rating":8,"date":"10 April 2017","review":"It's a movie within a movie. I feel in general, a movie about movies is a good topic for a movie. People love to hear stories about how the movies works. I know personally I'm a sucker for this type of drama.<br><br>Based on a book called Their Finest Hour and a Half, which I think is a better title, Their Finest stars Gemma Arterton in a movie that takes place during World War 2 in England, when women join the workforce in order keep the world going that was coming to a halt do to the Blitzkrieg. In this case Arterton's character Catrin Cole, a woman working for a newspaper that leads to an opportunity to write a screenplay for a movie.<br><br>What I like about the movie is that it's a funny story about how a screenplay is created. They basically hired Catrin Cole to tell the story of the war from a women's perspective, namely the true story of a pair of twins who attempted to use their boat to help rescue soldiers in France, but the true story is not good enough propaganda to get the citizens of Britain into the cause, so she has to embellish what happen.<br><br>As the writing progressed, they keep getting stopped by someone, weather it was the producer or The Secretary of War to add new things so that they can appeal to the masses, a very interesting process made hilarious by the movie.<br><br>The whole film is a satire on the film industry of 1940s Great Britain that's still true today. Their Finest also has some romance in it, as Cartin becomes attracted to her fellow writer on the screenplay, Tom Buckley. The film is also a good example about how female roles in society started to shift during World War II.<br><br>Bill Nighy was as fun to watch as I was told. He plays an aging actor finding his popularity is stuck on something he did years ago, and like Catin finds an opportunity within the war.<br><br>Overall, I really enjoined the movie. Gemma Arterton made a really good lead actress and the movie altogether was a great story.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[47,61]}]