[{"title":"If \"cursed but cute\" is your cup of tea, this should serve you better than Twilight.","rating":6,"date":"6 January 2013","review":"Beautifully shot and competently acted, the romance between a young man cursed with lethal magical powers beyond his control and the spirited teenage cancer patient who gently coaxes him out of his self-imposed exile is quite a bit less maudlin than it might look on paper.<br><br>So what if the story is fairly simple and predictable? (The final act gestures towards some nuance, by finally presenting us with a fairly sympathetic antagonist; alas, this potentially promising plot-development felt rather rushed). Since this is supposed to be a fairy tale, that's not necessarily a strike against it. Simplicity can have its charms.<br><br>That probably also describes the appeal of the protagonist. Harry Treadaway's eerily enchanting performance as James Furlong made me think of Caspar Hauser and Percival – a rare example of the male ingénue, the pure fool of legend, removed from the corrupting influence of society at an early age, blamelessly guilty, fragile but fatal. How often do we get to see that in the male version? <br><br>I docked some points, because my cold, shriveled heart finds the underlying message of all-defying love somewhat pat (I also resent the implication that – Spoiler Alert – only romantic/sexual love will do the trick, while the selfless kindness of the woodsman who takes in injured little James remains without effect on the curse; if you have to go with the bromides, at least don't operate with such a narrow conception of love). Someone with a more romantic disposition however might well fall in love with this little gem of a movie. It is, at any rate, exceedingly pretty to watch.","user":"wissenDa","rank":[10,10]},{"title":"A beautiful modern fairy tale","rating":8,"date":"14 May 2013","review":"Pay no attention to the sadly low ratings given to this very fine romantic tale. Of course the plot demands full artistic license but that is the essence of a fairy story and the stretched imagination needed to accept the setting comes easily enough.<br><br>James Furlong is born into an Irish family with very strange powers. His grandfather became blind for 37 minutes each time he thought of sex whilst his father caused complete electrical failure all around him each time he became frightened. James simply caused everything to die around him whenever he was attacked or given a blow. Naturally this had unpleasant effects on those unfortunate enough to argue with him or even be near those fighting with him. Accordingly he runs into the forest and lives the life of a hermit. Until that is a beautiful young girl happens upon his forest shack and a love story begins.<br><br>The photography is nothing short of splendid and there are some fine performances from all the youngsters involved - in particular James Wilson who plays the younger James. I hope we see more of him. Perhaps my greatest criticism would be that Thomas Brodie-Sangster who is given significant billing in the production appears in very few scenes and has barely three minutes of screen time. His character, a young lad bent on revenge against the hero, was indeed interesting and could have been developed much more. What a pity the producers gave so much time to romantic love scenes and so little to the jealousy that love often brings about on those rejected.","user":"RichardvonLust","rank":[19,22]},{"title":"Just a smack, as usual.","rating":10,"date":"28 April 2011","review":"Just saw this during the Tribeca film festival and found it great. I enjoyed the poetry, the incredibly strong pictures and the really original plot. Some of you may not agree but I have been hooked by this movie from the first to the last minute and what should I say about the actors that are beautifully playing and magnificently directed. This movie is full of emotions and the love story is very well treated, showing a real, pure love which is not going pathetic as it is in many movies today. Hope this movie is going to be seen by many of you and bought in the US to become a hit, not even in comparison to some other hits, this film deserves it.","user":"aridoux45","rank":[38,53]}]