[{"title":"The Grey","rating":8,"date":"20 February 2020","review":"I'll start off by saying this movie is not made for everyone. This is about a movie based off of survival instincts between man and nature. First time watching this, It's a thrill chiller. If you're wanting a movie that's depressing 90% of the time, this is the movie for you. This movie grasps way beyond an imagination of dealing with nature's worst environments after a plane wreckage. Traveling through the coldest winter, little to no food, wounded, tiredness and cold, it's a rough marry go-round. Not only the harsh environment for the remaining survivors have to deal with, the movie decided to throw in Northern Arctic Wolves and that made the survivors a living nightmare of hell. Only reason why I gave the movie a 8 star was Ottway (Liam Neeson) was a huntsman. His job subscription should have made him an expert of dealing with the current situation a little more suitable than just trying to survive with some ideas. None of the less, excellent movie for drama watchers.","user":"MR_Heraclius","rank":[39,40]},{"title":"Good Horror but Not a Wolf Film","rating":8,"date":"26 March 2013","review":"An airplane loaded with roughneck oilmen crashes in Alaska and the survivors trek through a snow storm to survive while a pack of wolves kill them off one by one.<br><br>Some reviewers loved it. Some hated it. Those who loved it saw a competently directed action horror film in a realistic setting filled with real people facing real threats. Those who hated it saw an unrealistic depiction of wildlife behavior and unworkable outdoor skills. People who loved it thought the movie was realistic. People who hated it thought it was ridiculous.<br><br>Without giving away the story, let me tell you that this is not a story about actual wolf behavior. This is more like the numerous movies of the produced through the '70s, '80s and '90s about a group of people picked off one by one by unseen creatures lurking in the dark. In the '70s, they were natural animals like sharks, killer whales, reptiles, furry animals and insects. In the '80s they were space aliens and robots. In the '90s they were super assassins. Lately they are vampires and zombies. Now we are back to furry animals. But the overall theme is the same.<br><br>It is refreshing to see this theme played out in the Alaskan wilderness rather than on a space ship or an underground city overrun by zombies. In that sense, this movie is realistic. But the furry animals in the movie behave more like space aliens than actual wolves. The \"expert hunter\" in the movie is not actually giving you wisdom that will be useful in the Alaskan wilderness. He is more of a generic zombie hunter. In that sense, this movie is unrealistic.<br><br>So whether you like this movie or not depends entirely on what you are in the mood to see. If you want Discovery Channel, look elsewhere. If you want to see good acting in a scenic backdrop with lots of scary moments, you will like this movie. You don't have to really check in your brain at the door. Like so many Ridley Scott movies, this one is also a meditation on the nature of fate. This movie is a good piece of fiction. Just a bad documentary.","user":"dr-h-noguchi","rank":[101,129]},{"title":"A Well Crafted, Yet Highly Misunderstood Film","rating":10,"date":"30 November 2017","review":"I would like to start off this review by saying that this movie is not perfect, but the negative hype that it received was not warranted. The first time I watched this film, I was simply disappointed by the ending, because lets be honest, I wanted to watch Liam Neeson kick some wolf ass. I was mad, angry, and bitter about how the film ended. But fast-forward a few months to the second watch, and this is where the real beauty of this film presented itself to me.<br><br>Before I get into the heart of this review, I want to offer some quick explanations for my high praise of this movie. Yes, I would recommend this film to anyone looking for an entertaining and suspenseful action film. The cinematography is beautiful, the script is well written, Neeson provides an outstanding performance (along with great supporting performances from the other actors), and the music and sound is exceptional, especially in sending chills down your spine whenever the wolves howl. Watch this movie in a dark room at night with surround sound, I guarantee you will not be disappointed.<br><br>Now to the truth of the issue. THIS MOVIE IS NOT ABOUT THE WOLVES. This film is an emotional, suspenseful, and extensively metaphorical journey through the will of man to survive. Yes, wolves would not brutally hunt down humans. No, this film was not made to paint wolves in a bad light. The wolves in the film are simply a vehicle to convey one of the most masterfully crafted metaphors I have ever witnessed in a film.<br><br>This is a story of survival. Each wolf represents a different fear that the men face, all of which try to kill them. The alpha wolf represents death, the leader of all fears that man must face. Since black is associated with death, it makes sense that the alpha wolf is black to complete the picture. Each man throughout the film struggles against his deepest fear, and eventually dies at the hands of it. It becomes clear on the plane that Flannery's biggest fear is being left out/excluded, and he dies when he gets separated from the group. Burke's biggest fear is being alone, which is supported by his struggle with the death of his sister. He dies alone during the storm before Ottway tries to wake him. Talget fears heights, and dies from a fall crossing the canyon. Even Diaz, who's biggest fear simply is feeling fear itself, dies alone while waiting for the wolves to come to him, whispering to himself \"I'm not afraid\".<br><br>Now to Ottway. After almost committing suicide at the beginning of the film, I wondered why this man would go to such incredible lengths to survive. And I believe it is because his biggest fear is not having a purpose. After the plane crashes, he feels a purpose to help the other men survive. Even after they all die, he carries their wallets (essentially their souls) and feels the need to defend them against death (the alpha wolf) in the end.<br><br>I would also like to point out how the entire film is about Ottway and the men running from their fears (the wolves). But they always catch up. Even when Ottway seems to escape all of these, he ends up in the den facing death (the alpha). This is a parallel to how no matter what, every person will eventually face death. It cannot be outrun. The beauty of how a man on the brink of suicide fights death in the bleakest moment really resonated with me on the second watch, when I could truly figure out what this film meant. Ottway is essentially a Christ figure, which is supported by the cut after the credits showing him putting his hand on the alpha as it dies (he conquers death and saves the wallets/souls of the dead), along with his call to God to help him after Henrick's death.<br><br>All of this to say look closer. This is not about Liam Neeson killing wolves. This is not about wolves being portrayed as vicious creatures. This is about fear, death, life, and the human spirit. This is a metaphorical journey into the purpose of life, religion, and survival. Look past the superficial, and find the deeper meaning. You will not only appreciate the film, you will love it. I encourage you to watch this film again, to travel once more into the fray, and to truly understand the magnitude of what is being explored in this exceptional film.","user":"cam-74199","rank":[22,27]}]