[{"title":"Pretty good drama mystery","rating":7,"date":"6 September 2014","review":"Wish you were here is the story of four people who take a holiday in Cambodia but one of them goes missing. The film pieces together the mystery of where the missing man has gone. <br><br>It's a relatively small film but is well filmed nicely combining drama with the ongoing mystery. It stars the on the up Joel Egerton who is very good in this and he receives excellent support from the rest of the cast who all put in believable performances. <br><br>It held my interest throughout as it keeps you guessing as to what has happened to the missing man. The main downside is that it does maybe lose a little steam towards the end and the ending is a little flat. <br><br>Wish you were here will not appeal to those who seek action or thrills and is not a brilliant film however for those that like nicely pitched drama's this is well worth watching.","user":"MattyGibbs","rank":[6,6]},{"title":"Falls Flat...","rating":10,"date":"10 May 2012","review":"Wish You Were Here is a directorial debut for actor Kieran Darcy-Smith and written by Darcy-Smith and his wife Felicity Price. The premise of the movie is promising: four Australian friends are enjoying a holiday in Cambodia, but one goes missing after a particularly \"heavy\" night of partying. The movie is superbly shot and mostly well acted, but I was nevertheless disappointed. <br><br>We see the holiday firstly as a 10 minute sequence which moved too rapidly for me. As the movie progresses the holiday is shown in beautiful flashbacks, which give us insight into the characters as well as depicting some of the events that took place. When husband and wife, Dave and Alice (Joel Edgerton and Felicity Price) return to Sydney, they leave Alice's sister, Steph (Teresa Palmer), to try to find out what happened to her boyfriend, Jeremy (Antony Starr). Dave is uneasy and troubled, and even more so when Steph arrives home and the first of many secrets is uncovered. <br><br>Joel Edgerton is marvellous as a man wracked with guilt and tormented by secrets and lies he dare not reveal. Teresa Palmer is also very good, but unfortunately her part is underwritten. I found that I became a bit bored with Felicity Price's character, Alice, especially when we start to see more and more of her and less of Dave. About half way through, the movie seemed to become stuck, and I was wanting the original storyline to develop and to give answers to the mystery. When truth is finally revealed, it is terrifying, but it feels anti-climactic, because we've had to wait too long.<br><br>I found it hard to sweep my expectations aside and see the movie as the writers/director intended it to be: a story about the effect on family life when one spouse hides a dark truth from their partner. I was expecting more of a thriller, and even as I tried to accept the way the plot unfolded, I still found it disappointing. At certain times I felt sympathy for the characters and I felt their pain; but there were scenes where the magnitude of emotions that the characters were experiencing was not adequately conveyed, (for example, the ending). Obviously, Wish You Were Here was not as engrossing for me as it was for others, but I wish it had been.","user":"dandelionfields","rank":[34,46]},{"title":"Darcy-Smith does a fine job in knitting together a quite straightforward drama into something watchable and insightful.","rating":8,"date":"9 March 2015","review":"'Wish You Were Here' is the debut feature from Australian director Kieran Darcy-Smith. A group of Australians visit Cambodia for a holiday, where under mysterious circumstances only three of the original four tourists come back home.<br><br>Steph (Teresa Palmer) was invited by her new boyfriend Jeremy (Antony Starr) to come with him to Cambodia where he often travels to for business. Still only a few weeks into their romance, Steph wanted to be certain of her safety so she asks her sister Alice (Felicity Price) and husband Dave (Joel Edgerton) to accompany them.<br><br>Rushing backwards and forwards in time, 'Wish You Were Here' slowly pieces together the mystery surrounding Jeremy's disappearance. Just as fascinating is the reasons why everyone else has not been totally honest with each other. Alice and Dave's relationship suffers, all in plain sight of their young children. Their unabashed abandon on holiday is shown in a quite different form at home, we're intrigued as to why certain actions were necessary by each when only harm was the outcome.<br><br>Part thriller and part domestic drama, 'Wish You Were Here' is an ambiguous story which keeps you interested until the inevitable conclusion. Sometimes uncomfortable to watch, Price and Edgerton play their parts perfectly, a typically normal couple with huge unwanted responsibilities on their shoulders. Darcy-Smith does a fine job in knitting together a quite straightforward drama into something watchable and insightful.","user":"dipesh-parmar","rank":[5,5]}]