[{"title":"Disgraceful,this trilogy gets worse as it goes on,","rating":5,"date":"19 December 2011","review":"Alvins And The Chipmunks:Chipwrecked is a terrible movie,the three Alvin And The Chipmunks movies aren't well received but to be honest I enjoyed the first two,but this one is absolutely awful,in the first two they sing a lot but at the right time,in this they just sing whenever they feel like it,but the thing I hate most about this movie is the god awful Zoe,played by Jenny Slatewho is just a stupid character,although I do like The Chipmunks themselves,not so much for the Chipettes.<br><br>The Chipmunks,The Chippettes and Dave go on a cruise on there way to the international movie awards,but The Chipmunks and The Chippetes get stuck on an island (long story) and Dave separately gets stuck with Ian Hawke in a pellican suit.","user":"lesleyharris30","rank":[28,40]},{"title":"A Nutshell Review: Alvin and the Chipmunks: Chip-Wrecked","rating":1,"date":"16 December 2011","review":"For as long as the Chipmunks can be milked to draw in the holiday crowds, the sequels will never stop. After all, the digital templates are there and done up to be recycled countless of times, and the live action characters just jolly well need not be there for things to work. Pop hits between the films serve as the highlights for getting the munked treatment, and while they do sound cute initially, eventually this novelty will soon wear off. Director Mike Mitchell, who sounded the death knell for Shrek with his Shrek Forever After, happened to do the same for Alvin and the Chipmunks in coming up with something so uninspired and clearly going through the motion.<br><br>The first film as expected is the origin film, followed by the sequel which is more or less a mirror image of the first, except with the trio from the opposite sex known as the Chippettes. In the third film, with everyone - Alvin (voiced by Justin Long), Simon (Matthew Gray Gubler), Theodore (Jesse McCartney), Brittany (Christina Applegate), Jeanette (Anna Faris) and Eleanor (Amy Poehler) - all living under the same roof as Dave (Jason Lee) their surrogate dad/manager, you'd expect that perhaps things can get a wee bit more cerebral, but alas all we're getting is a rehash of characterization not already seen in the films, and done countless of times in their animated series.<br><br>Alvin is still being Alvin, Simon needs to chill and Theodore just needs to be cute. So goes for the Chippettes with vain Brittany, introverted Jeanette and Eleanor just makes a lot of clothes and costumes in this one, since they're all stuck in an unnamed island (in Hawaii on location so it seems). What was to be a family cruise vacation turned out to be an abandoned island adventure, with Ian (David Cross) the chipmunks' ex-manager and one time music executive on board as well as the nasty opposition (too weak to be called a villain or the antagonist), and Zoe (Jenny Slate), a woman stuck in the island for close to a decade, and exhibiting the very same signs of loneliness that Tom Hanks' Chuck Noland did in Cast Away, except that she has more friends other than Wilson.<br><br>Centering around the chipmunks' fight for survival amongst themselves and with Zoe, as well as Simon and Alvin's temporal transformation in character - one being French (don't ask) and more carefree while the other getting all serious and responsible, the story plays out like an extended cartoon episode, with Dave and Ian on a quest to try and rescue their cash cows before something untoward get to happen to them, which in the story, is zilch given a low threat situation, most of the time. Nothing spectacular gets to happen in the film, and it runs like on a plateau without any highs or lows, and soon you'll feel you may be better off looking at caged animals in a zoo.<br><br>Which is a bit frustrating because the story's written by both Jonathan Aibel and Glenn Berger, who were also responsible for what I felt were some of the more intelligent animated films in recent years with their Kung Fu Panda and its sequel, having the right elements balanced in terms of story, characters, comedy, action and entertainment for both the kids and accompanying adults alike, but this effort seemed to be written without much heart put into it to cater for the lowest common denominator, and it shows. Granted they also did stinkers like Monsters Vs Aliens, but when you set the bar higher, that's where you'll be benchmarked against, and that's where this proved to be a total Chip-Wreck.","user":"DICK STEEL","rank":[32,56]},{"title":"Innocuous enough, but this series has officially worn out its welcome","rating":4,"date":"2 September 2013","review":"What will they think of next... Alvin and The Chipmunks: In Space? Somehow I wouldn't be surprised... I thought the first movie was really cute, and the second movie sucked major donkey balls. What about this one? It wasn't as bad as the second sequel, but it wasn't very good. The chipmunks are very obnoxious in this one, and lack the innocence that they had in the first two. It does have a couple of funny moments near the end, but that's really about it. Jason Lee's role is reduced significantly here. He wasn't that big of a focus in the second one either, and that trend continues here. His interactions &amp; chemistry with the Chipmunks is what made the first movie so enjoyable. It just fell flat in this one. David Cross returns and his menacing act has gotten extremely stale. The Chipettes are more tolerable than the chipmunks in this one believe it or not. Spending 90 minutes with these guys has gotten to be rather tiresome<br><br>Final Thoughts: Better than the second one, but that isn't saying much. It's a mediocre film. Time to put the kibosh on this series<br><br>4/10","user":"callanvass","rank":[3,3]}]