[{"title":"Creepy Insanity","rating":7,"date":"15 March 2014","review":"The entomologist Ann (Barbara Steele) is an old lonely woman with bipolar disorder and rejected by her daughter Dorothy (Heather Langenkamp) due to a serious incident when Dorothy was a child. When Ann meets the manipulative girl Alice (Julia Putnam) in a mall, she becomes Ann's companion, receiving an allowance in return. Soon Ann finds that Alice manipulates other old women and she visits her crippled mother Olga (Camille Keaton) and she discovers that she is a prostitute that uses Alice to make money for her. Ann reacts in a violent way against Alice's mother and triggers her madness.<br><br>In the present days, Ann meets the girl Julie (Ellery Sprayberry) in her building alone in the corridor. Her mother and Ann's neighbor Claudia (Erica Leerhsen) neglects her daughter and Ann takes care of Julie. Ann brings Julie to her apartment and she does not allow her to enter in her butterfly room, where she keeps more sensitive specimens; however Julie tells to her mother that there is a girl inside the room. What is the secret of the butterfly room? <br><br>\"The Butterfly Room\" is a creepy non-linear movie with a deranged lead character performed by Barbara Steele. The timeline with many flashbacks seems to be confused to many viewers that apparently did not understand the plot and the movie is underrated in IMDb. My vote is seven.<br><br>Title (Brazil): \"O Segredo da Borboleta\" (\"The Secret of the Butterfly\")","user":"claudio_carvalho","rank":[21,22]},{"title":"Mrs. Barbara Steele is STILL one dangerously seductive and deadly momma!","rating":6,"date":"19 April 2012","review":"As soon as it got listed in the official program of the 30th annual Belgian Festival of Fantastic Films, I've been eagerly anticipating to see \"The Butterfly Room\". For obvious reasons, I presume, namely the return of horror diva Barbara Steele – the legendary beautiful and hypnotizing lead actress of such Gothic horror milestones as \"Black Sunday\", \"The Pit and the Pendulum\" and \"Castle of Blood\". The casting of Steele is the undeniable highlight, of course, but writer/director Jonathan Zarantonello's whole incentive of making a thriller solely revolving on female protagonists is enormously respectable and, in fact, quite innovative as the horror genre still somewhat remains a masculine world where women are often degraded to inferior roles. Apart from Barbara Steele, Zarantonello managed to gather the dignified horror ladies Erica Leerhsen (\"The Texas Chainsaw Massacre\"), Camille Keaton (\"I Spit on your Grave\"), Adrienne King (\"Friday the 13th), PJ Soles (\"Halloween\") and Heather Langenkamp (\"Nightmare on Elm Street\"). To defend the honor of the male sex, there's also Ray Wise (\"Twin Peaks\"). I easily daresay this is the most remarkable and jaw-dropping ensemble horror cast since many years! <br><br>The plot itself also contains great thriller potential and a worthy amount of isolated moments of greatness, but sadly I have to admit that the wholesome is too often tedious and never appears to find a stable pacing. Steele is splendid as the aging but nevertheless still very stylish and fashionable Ann, a lonely woman who reverts to her hobby of collecting butterflies and exhibiting them in a sober room where only she's allowed to enter. Ann is always eager to babysit her neighbor's young daughter and she also takes obsessive custody of a girl she met at the shopping mall, because her motherly instincts remain unanswered. But Ann's caring personality also has a grim dark side that gradually comes to the surface. \"The Butterfly Room\" is 100% American produced, but the atmosphere feels totally European, more particularly reminiscent of those typically lurid Italian gialli and psychedelic dramas. The roots of director Zarantonello and the decades of Barbara Steele's horror experience are clearly detectable. Despite the brooding atmosphere throughout, the vast majority of the film is regrettably tame, but luckily this gets compensated with a neatly unsettling and grisly denouement. Beautiful imagery and tasteful photography complete this worthwhile effort that particularly comes recommended to admirers of strong feminine horror ladies and nostalgia.","user":"Coventry","rank":[33,38]},{"title":"An American horror film with an Italian flair and a classic cast. ◆≈≈7.2/10≈≈◆","rating":7,"date":"2 July 2013","review":"Italian Writer/Director Jonathan Zarantonello, in his first English language film, has brought together a rather intriguing cast and delivered an original horror piece that should entertain fans of both vintage &amp; recent horror films. A substantial part of it's success is owed to the film's tight, well written script, but make no mistake, long standing horror icon Barbara Steele absolutely owned the role of Ann. While it may help some folks by reading further into the film's actual full synopsis, I found that even though going in blind was a tad confusing at first, especially if you aren't glued to the screen for every moment, it pays off later when everything clicks and falls so neatly into place. So I will do my usual, less is more outline.<br><br>Ann is an older, private, but elegant woman with a passion for butterfly collecting, who longs for the companionship like that of which she had so many years past with of her seemingly long lost daughter Dorothy. One day while out shopping, Ann is drawn into the company of a young, seductive and extremely manipulative young girl Alice(Julia Putnam). As Alice's motives become more clear, Ann realizes that their meeting was by far no accident and that Alice's deceptive tactics are not only being used on her, but a string of women. All of whom are also childless and for one reason or another, are all willing to participate in this warped type of pseudo parenting. The shock of this finding sends Ann into a spiral of madness resulting in some very lethal &amp; callous acts to those unfortunate enough to cross her path. <br><br>Despite this being an American production, Zarantonello manages to effectively put that familiar Italian Giallo feel into the film. The atmosphere was very creepy and the film possessed that 60's kind of look &amp; feel to it, with cinematography that was reminiscent of the horror films of old. As a bonus for horror buff's, there was no shortage of cameo's from the likes of Erica Leerhsen(The Texas Chainsaw Massacre), Heather Langenkamp(Nightmare on Elm Street), Adrienne King(Friday the 13th), Camille Keaton (I Spit on your Grave), PJ Soles(Halloween). You won't find a better psychotic &amp; violent portrayal by a women that, can you believe, is seventy-five years old. I recommend taking this old Buick for a ride if you happen to have an urge for something creepy or looking for a good late night horror flick(which in my case is every night).","user":"Thrill_KillZ","rank":[18,21]}]