[{"title":"Delightful, quirky, intelligent fun","rating":9,"date":"9 February 2012","review":"It's clear that some reviewers \"got\" this film and some didn't. As always, Stillman delivers with marvelous, laugh-out-loud funny dialogue. This is so rare that that that virtue alone sets it apart from the majority of the drivel that passes for conversation in movie scripts these days. You can't tell me that there aren't some one-liners in there that you hear and just *wish* you could have uttered yourself if only you'd had the wit (Whit?). <br><br>The characters are all flawed, some lovably so, some not--just like life. You're not meant to like all of them, and it's part of the subtle, social observation of which Stillman is capable that the unlikable characters are not always immediately unlikable. Some characters learn from their mistakes and misperceptions, some do not. Again, like life. <br><br>The thing that is so winsome about Stillman's movies is that virtue always triumphs. There is a sweetness to his choice that the good always eclipses the bad. It's almost heart-achingly sweet, because we know that that is not how things usually work out, and yet you find yourself rooting for these flawed, quirky, sometimes idiotic characters to get out of their own way and allow their better natures to win the day. I've wondered for a long time about the central role of dancing in his movies, and maybe it's that when you're dancing, it's hard to do much else, and you become one with music, rhythm, and your dance partner(s). Perhaps that's what he wants for his characters--to use dance as a vehicle to get out of their own way and lead a happier, less complicated, less tortured existence.<br><br>My favorite of his movies will always be \"Metropolitan,\" but this is an excellent new addition to his oeuvre. We've been waiting for \"the new one\" for a while, and now that it's here I find it a sheer delight.","user":"charlie-schlangen","rank":[50,68]},{"title":"It's kind of like","rating":10,"date":"14 November 2012","review":"Mean Girls' older sister that went to college, got an awesome biting, dry sense or humor; and got some wicked analytical skills to go along with it. This was just such an adorable and intelligent movie, both extolling the virtues of the undergrad experience while simultaneously panning it. At first, the movie may lose you with its irreverent randomness and quirkiness. Personally, I recommend at least one re-watch, to which it will become more clear and you'll be able to appreciate it more. This movie is one of those movies that has near unlimited replay value so that should be quite easy to do. Although nearly everyone was perfect in their roles, Greta Gerwig as Violet stands out. She's just pseudo deep in a sarcastic spirit that is tough to pull off while acting. The male characters are well done also but play in the background, which is actually kind of refreshing since many movies like this fall victim to sexism, or at least \"boy craziness\" of the presumably straight female characters. Overall, bravo, brava for this example of a deep, \"slow-moving\" comedy aimed at us young folk... not many like it these days.","user":"ColbertoReporto","rank":[24,32]},{"title":"Witty, quirky, and funny...and that's just the characters","rating":8,"date":"1 December 2011","review":"Few films recently have been able to capture my imagination like this one. With the glut of comic book films and remakes, very few people are making original films. I was not expecting much going into this film (I saw it at a festival). In fact I had not planned on seeing it, but it seemed \"different\" enough to warrant a watch. Well, I went in not knowing what to expect and came out with a big grin. I was happy I gave it a shot and was surprised by the other comment on here. <br><br>If you want to see something original, that has some break out actors, and is funny, then check out \"Damsels in Distress.\" Days after I left the screening, I kept thinking back on the funny lines and comically earnest characters. Go in with an open mind and come out with a grin.<br><br>IMDb does not allow 8.5 stars, but that's my verdict. This goes into the category of films I'll be watching again once it hits the theaters.","user":"IDwasTaken","rank":[53,81]}]