[{"title":"Cliché, predictable, but so honest and funny!","rating":7,"date":"22 November 2011","review":"This movie was all things cliché and predictable. Even though you know what is coming, the honesty with life's little quirks and human behavior was incredibly well done. <br><br>Timberlake is an okay actor. I found him to be a fresh breath in this movie. The dialogue and scenario fit his charm quite well. <br><br>I found Mila Kunis to be quite funny, and she pulled off that cute, charming, awkwardly damaged woman, perfectly. She was chic, yet easy to relate too. Down to earth, but an air of success and confidence, hidden in all the girly dreams and fairy-tales. <br><br>If you want something original and never done before, this is the wrong movie to watch. If you wish to appreciate a good spin on an old concept with stellar humor and humanity, it is worth the watch..","user":"liso1966","rank":[63,77]},{"title":"A Cliché Romantic Comedy that Pokes Fun at Other Romantic Comedies","rating":8,"date":"30 June 2011","review":"I was able to see a sneak screening of this movie almost 1 month prior to it's official release. I honestly walked in simply thinking I was seeing another typical romantic comedy with my girlfriend. To my surprise it was much more.<br><br>Timberlake plays an LA Blog Art Director who has just been recruited to work for GQ in New York by Kunis who is a headhunter. The two had great chemistry through out the movie.<br><br>What's funny is that even though it does contain the usual Cliché scenes that most romantic adult comedies contain, it does tend to poke fun at them and have some sort of realism to the plot.<br><br>Both Timberlake and Kunis are likable and really funny. Woody Harrelson was the best addition to support this younger cast. Harrelson plays a flamboyantly gay sports editor who goes from making sexual advances to JT, to offering him some pearls of wisdom with his love life.<br><br>I would have to say this movie was very enjoyable and if your skeptical about seeing it in the theaters, definitely put it on your \"must rent\" list.","user":"threephil","rank":[147,198]},{"title":"Good chemistry for sure","rating":8,"date":"26 July 2011","review":"I was expecting to have to compare this movie with No Strings Attached (or whatever that movie with Ashton Kutcher was) all the way through however I was pleasantly surprised that the story was a bit more complex despite the obvious parallels.<br><br>Yes it's the typical \"boy and girl decide to be friends only but end up loving each other\" movie .... but I must admit that it was a lot smarter in the delivery. Timberlake and Kunis have a lot of chemistry on camera ... It's shot primarily in new york so expect the clichéd new york locations ... <br><br>The complexity of Timberlake's character is slowly revealed through the show as opposed to being revealed in the first 3 minutes like most other movies.<br><br>A good watch ... not slap your knee funny but certainly entertaining to the end ... clichés and all","user":"itchywow","rank":[111,151]}]