[{"title":"A Nutshell Review: The Legend is Born: Ip Man","rating":7,"date":"26 June 2010","review":"With cult Hong Kong director Herman Yau at the helm, The Legend is Born predates the Ip Man films we've seen thus far, seizing the window of opportunity in exploring Ip Man's life as a teenager before he became the master we're all familiar with Donnie Yen's portrayal. While it's less flashy than the two earlier films, Yau will pique your curiosity with the shrewd casting of veterans such as Sammo Hung in a different role this time as Ip Man's master Chan Wah- shun, Yuen Biao as the next generation leader Chung Sok, and even getting Fan Siu Wong back as Ip Man's foster brother Ip Tin-chi, making him the only actor to feature in all three Ip Man films thus far. Credibility for the film is even enhanced with the presence of Ip Man's real son Ip Chun as the elderly but sprightly Leung Bik who teaches Ip Man (played by Dennis To) a thing or two about his brand of Wing Chun.<br><br>That scene alone opposite To is one of the action highlights of the film. And action is something this film has no lack of, ranging from friendly and playful exchanges, to fending off petty street thugs and the Japanese – yes, again, but I suppose it's set in the era before the Sino-Japanese war that this in the narrative is somehow unavoidable. While the earlier film versions had tried to stay rooted in reality with the fight scenes, for this version there's the inevitable and obvious wirework being used from time to time, which takes you into the realm of fantasy unfortunately.<br><br>But almost everyone here has a fight crafted for them, and some of the better ones include the mouth-watering duel between Sammo Hung and Yuen Biao executing Wing Chun moves while blindfolded, imparting a key philosophy about pre-emption, Fan Siu Wong's battle against Japanese exponents in the Jing Wu premises, Dennis To against Yuen Biao when the former returned from Hong Kong, and of course the brawl involving Dennis To against many ninjas, which we now associate Ip Man with (fighting against impossible odds in headcount). Various martial arts like Judo and Karate also get thrown in even if they're used fleetingly, and there's also glimpses of the variation of Wing Chun involving weapons like the 6 inch pole (well, we know the damage what Ip Man can do with a humongous one from the first film), and the staples like the wooden dummy practices and the rapid fire punches. If there's any fight scene which is a let down, it'll be the final one which was short, and the opponent never really threatening our hero at all.<br><br>Dennis To, the current Hong Kong martial arts champion, probably has his close physical features resemble Donnie Yen to thank for in winning the title role of Ip Man, since audiences all over are currently associating the Master with Donnie's portrayal. Incidentally To had a role in Ip Man 2 as Sammo Hung's disciple, so how's that for having everyone associated with the earlier films, to chip in for this one? The pressure is on for To, but granted he cannot hold a candle to Donnie Yen's charisma yet, and because Ip Man the character here is in his early days, he gets whupped a bit more here as expected since he's nowhere near the grandmaster status. Credit to To for trying, though his acting is a lot more wooden, and his fighting moves executed for the film also having a raw feel than the fluidity we've come to know the Ip Man for.<br><br>On the other hand, I thought this was more of a Fan Siu Wong breakthrough role, where he'd make you sit up and take notice of his gentlemanly portrayal of Ip Tin-chi. In Ip Man 1 he's the ruffian from the North, and shows that he's quite the chameleon in changing his outwardly appearance for a different character here. His character also seemed to be more fleshed out (for a reason of course), and action-wise given the opportunity to shine a lot more with the various styles utilized, as well as those which Ip Man had picked up from Leung Bik, putting them two on almost equal terms.<br><br>Erica Lee's screenplay transports us back to the life and times of a young Ip Man and his life in the Wing Chun martial arts school, as well as his education in Hong Kong. Unfortunately it also meant having to put in a clunky romantic web weaved between the characters, though it didn't go beyond the surface and had plenty of \"jealous fits\" coming from Rose Chan's fellow martial arts student with whom Ip Tin-chi is interested in, but for her to prefer Ip Man, who in turn is in love with Huang Yi's rich girl character to probably align this to the Ip Man films.<br><br>The story also contain shades from the earlier ones, such as those involving corrupted officials, arrogant foreigners who have to be put in their place, a jail term (this makes it 3 in a row that Ip Man gets thrown into one), and having enough twists in the story to include a short murder mystery, espionage, and a turn that will make Infernal Affairs proud as well.<br><br>It's a prequel done by another production team, so don't expect the narrative to gel so nicely into Mandarin Films' Ip Man universe since there are elements here that obviously clashes with what we treat as canon. But what you can expect, as a martial arts action film, is plenty of rapid fire, hard hitting action, and of course more of Ip Man's character being portrayed on the big screen. You'd still feel compelled to applaud when Ip Man comes to the rescue, but soon realize that it doesn't exude the same emotional intensity, but makes up for it in its variety of fights showcasing the lesser seen Wing Chun moves.","user":"DICK STEEL","rank":[30,39]},{"title":"A hidden masterpiece","rating":10,"date":"29 September 2010","review":"Based on some of the reviews, I feel this film is misunderstood.<br><br>It is somewhat harsh to compare Yu-Hang (Dennis) To's to Donnie Yen's portrayal of Ip Man because Donnie has been an actor for a long time. From a martial arts standpoint, Donnie's portrayal of Wing Chun in his two Ip Man films were often not a correct rendition of the form, as he had no Wing Chun background, but took a crash course just prior to filming and his fights in the film were often not Wing Chun. What we saw on Donnie's Ip Man films were more arts than reality of Wing Chun combat techniques.<br><br>On the other hand, Dennis To is a Wing Chun champion in Hong Kong and is not an actor by background. He might lack acting prowess but he more than makes it up in Wing Chun abilities. <br><br>Dennis was correctly portraying Wing Chun techniques in the film, especially the lesser known Wing Chun moves, such as the high kicks, use of knives and staff. Dennis is the pupil of the director of this film, who himself is also trained in Wing Chun and is the pupil of Ip Chun and he wanted a true exposition of the real Wing Chun combat techniques in this film through his pupil Dennis To, and which Dennis loyally exhibited the form to his master's delight. <br><br>The Wing Chun sparring scene between Ip Chun and Dennis is a masterpiece, so was the sparring between Sammo Hung and Yuen Biao (he was one of the doubles for Bruce Lee in Game of Death when he died). Incidentally, both Sammo and Yuen Biao are older pupils from the same master as Donnie Yen, so they are 'colleagues'. <br><br>One should view The Legend is Born: Ip Man in this context to appreciate what we saw in Donnie Yen's Wing Chun are often fancy moves and not real Wing Chun, while we saw a far more accurate rendition of its techniques here by Dennis To. <br><br>Hopefully, one can appreciate the finer qualities of this film which it truly deserves.","user":"billleung","rank":[15,18]},{"title":"Cute but not close to Ip Man I and II","rating":6,"date":"21 September 2010","review":"I was not disappointed by this movie and certainly was entertained, but this is not a close match to the sequels with Donnie Yen. This actor is good as Ip Man but not a close match to Donnie Yen who was simply amazing. I understand that this was an early period of Ip Man's life so it had to be played by another actor, but I guess I am not the only one who would like to see one more sequel with Donnie. Everything else in this movie is somehow inferior to the previous two: composition, plot development and camera. While first two parts are slowly developing the core of the main conflict this one presents them by parts step by step making the movie somehow last tense and more slow. Pretty good acting must say. All in all, pretty good entertainment.","user":"dusan-22","rank":[23,30]}]