[{"title":"Austere and unrelateable","rating":5,"date":"16 October 2014","review":"Effie Gray is the young bride of renowned art critic, John Ruskin. We open with a brief prologue and their marriage, which seems happy enough, though, as was common for that time, money and security seems to have played a hand in the decision making process.<br><br>Things then quickly go south (literally and metaphorically) when they move to Denmark Hill, not into a marital home, but Ruskin's parent's. Two things are quickly established. Firstly, that the parents exert an unnaturally high level of control on John and intend to do the same with Effie. Secondly, this is no ordinary marriage - when Effie offers herself to him, he leaves the room. The rest of the film is then concerned with her wrestling with the predicament of her in-laws interference and freeing herself from a loveless relationship, no easy task, especially for the period.<br><br>This type of film is very reliant on well-wrought characters. Yet the film seems very lacking in several crucial dimensions. The character of John Ruskin as portrayed here seems relentlessly taciturn and one dimensional, even when discussing the pre-Raphaelite movement, something which should really get his juices flowing. What exactly his problem is with Effie is hinted at but never really explored. Is he impotent? Is he gay? Is he mad, as some seem to believe? There are hints he could be gay, ie there is a scene when he seems to be masturbating in bed, another later when there is a \"moment\" between him and a young painter, and also his father seems very aware that there is something which could have held him back which they have shielded him from so he could become the famous art critic he became. Effie is clearly expected to play her part in this.<br><br>The film mainly focuses naturally, then, on Effie, yet leaves out crucial aspects. We never get enough of a sense of who Effie is, ie who she was before marriage and losing her hair (from sheer neglect, it seems.) So it's difficult to get a sense of the journey she has to go through to liberate herself from a life of misery.<br><br>There is a metaphor used for this doomed relationship when they recall a previous conversation about Diana the wood nymph turning into a tree to escape Apollo's clutches. If anything, it cruelly underscores how unlike this romantic Greek myth they really are. The type of possession Effie seems subject to is not sexual but more akin to a pretty bird in a cage. When she then hallucinates about turning into a tree later it does seem to labour this point in a slightly puzzling way.<br><br>A bit of light relief is provided in the character of the worldly Lady Eastlake (the Screenwriter Emma Thompson) who seems perceptive towards Effie and sensitive to her plight, yet is strangely surprised on learning the marriage was not consummated. She also seems to provide a broader context to the plight of women during this period, but she is a frustratingly fleeting presence, given that she is a mentor and a revelation to Effie and a catalyst for her deliverance.<br><br>The dark heart of the film is certainly Ruskin's mother, played by Julie Walters. Played as a mixture of pompous refinement and thuggery, this is easily the strongest performance.<br><br>Those who are not especially interested in the subject matter (ie art, pre-raphaelites etc) will find little to enjoy here. And the writing is not accomplished enough to be genuinely thought provoking. Still, the performances are good and it does hold your interest for the duration. Be warned, though, it's not much of a giggle.","user":"peter-stead-740-486963","rank":[36,44]},{"title":"Disappointing re what could have been an interesting story","rating":3,"date":"30 July 2015","review":"Oh Emma what a major disappointment! You didn't even bother to add some text at the end to say what happened to Effie. She went on to marry Millais and had several children with him and by all accounts lived happily ever after. The Scotland scenes were slow and boring though the rest was OK. certainly the TV series Desperate Romantics re the pre- Raphaelites was far more dramatic re Effie and Millais. It will be interesting to find out which was the real situation. Such a pity - the acting was OK and the costumes beautiful. The lighting was really weird though- going from dimmish to really dim in the same scene- if that was supposed to be some sort of filmic effect it failed. It made me think there was something wrong with my TV. I was also disappointed with the sound quality nod several times thought they were speaking in a foreign language - and I don't mean the scenes shot in Venice either!<br><br>For people who know nothing about the Ruskin/ Effie/ Millais situation, which was a very unique, scandalous and shocking situation that made Ruskin a laughing stock, it failed miserably. If you are going to pluck stuff from history it really needs to be far more accurate.","user":"scribernow","rank":[26,31]},{"title":"Sadness overcome by strength","rating":8,"date":"25 October 2014","review":"\"Effie\" is about to get married to the famous author/art critic John Ruskin. The event is full of anticipation. She's in love, content with the realization that marriage is a great achievement (in her world) and naive. As soon as she enters her new home, happiness and feelings of accomplishment disappear.<br><br>Though the heroine is mainly sad, it's a different emotion compared to Mme Bovary or Portrait of a Lady. All three women are trapped in an unhappy marriage but Effie isn't a disillusioned house wife or manipulated heiress. She's a young woman who only slowly starts to comprehend her situation. Initially, she tries to figure out why she feels unwelcome. After the people around her keep pointing out that she's inadequate, she starts to believe that she is and starts blaming herself. Due to her inexperience and without a friend for sharing her questions, she's not able to acknowledge that her life is \"unnatural\" and by the time that she recognizes that something is really wrong, she is too mentally abused  but she endures. <br><br>Ruskin and his parents made me feel angry. I wish it was because they were bad but they are actually stiflingly loving and blindly unaware of their coldness. I wanted to shake some sense in them. When Effie finally starts a divorce, my romantically polluted film mind wanted to see a glorious moment. It's kept small and shared the complexity of feelings. Yes, she was desperate and brave but I suspect that her real life it wasn't a simple emotion that drove her to this decision. It was well depicted as a necessity. Even though, it doesn't lower my respect for this lady in Victorian British Society who claimed her right as a human being. <br><br>Dakota Fanning has an interesting mixture of serenity and intensity. It served her well as Jane (in Twilight Saga) but gave her vulnerability in this role an edge. Greg Wise handsome appearance makes is hard to believe that he's terrible man and causes the right confusion. Greg Sturrage could be less nice and could show more passion but still nice to see him after Vanity Fair. And what can I write about the creme of UK actors; Julie Walters, David Suchet, Emma Thompson, James Fox, Derek Jacobi, Robbie Coltrane, other than superb as usual. I loved to see Claudia Cardinale, powerful in her grace of age. The costumes are good, not as lush as in other productions for this time period but then if you ever seen real dresses from that time, they usually are a not that refined. The scenery highlights contrast; crowded London, narrow home life and wide Scottish Highlands. I especially loved the very beautiful shots of Venice.<br><br>One day I will watch it again on blue ray because the scenes deserve high quality images. I hope that I will be as moved and angry as I was in the cinema. Well Done Effie, Well Done Emma  Thank you for this emotional experience which gave me a couple of life pointers to think about.","user":"PadmeAgnes","rank":[24,32]}]