[{"title":"Should have been a LOT better.","rating":5,"date":"8 July 2012","review":"This was not a great movie. It could have been a great movie, but it was let down in two major ways. <br><br>First off, two of the three lead characters are awful. Blake Lively makes for good eye candy, but she just isn't a good actress. She's not bad in smaller supporting roles (like her part in The Town), but she simply cannot carry a lead. Unfortunately the entire film basically revolves around her (and she narrates), so her shortcomings are brought front and center. Every time her voice-over came on, I cringed. It really was not a good choice. <br><br>Taylor Kitsch is no better. Again... good eye candy, poor acting. Very poor acting. He just has no soul, and brings absolutely nothing to his character whatsoever. He should be in a brainless Fast &amp; Furious movie playing opposite Vin Diesel, not an Oliver Stone drama. <br><br>The second major failure of this film is even more serious, and that is the story structure. We are never really given the opportunity to understand why the three lead characters (Chon, Ben and Ophelia) have such strong feelings for each other. We're told that they do, but never given any real reason to believe it. This is extremely important, because literally the entire premise of the film hangs on their relationship. If you're going to build a dramatic story around an unorthodox three- way relationship, you had better explain in more than one quick scene exactly how this relationship happened, otherwise the audience won't know why they should care about the characters. Especially when the actors portraying these characters aren't very good to begin with. <br><br>I know that I kept asking myself why these two guys share a girl, how they have absolutely zero jealousy, why they never once thought of double-crossing each other, and why either of them care so deeply for her -- to the point of being willing to risk their lives and commit horrible atrocities to save her. Where did all this love and loyalty come from? It was never adequately explained, and the entire movie suffers tremendously for it.<br><br>On a slightly more positive note, the veteran actors did a fine job. Benicio Del Toro was wonderful as a psychotic cartel underboss, John Travolta chewed the scenery to bits, and Salma Hayek was entirely believable in her role as well. Unfortunately, their competence only served to underscore the incompetence of the younger leads. It's telling that the best scene in the entire film was between Del Toro and Travolta, with none of the three lead actors anywhere to be found, and hinted at the promise this movie squandered. <br><br>A lot of reviews took issue with the violence portrayed in the film, but I didn't have a problem with that. You really can't make a movie about Mexican drug cartels without violence, so I didn't feel it was gratuitous. Unfortunately, however, it also didn't make the movie any more believable from a plot perspective.<br><br>Overall, I just don't think this was a very good film. I don't think that Stone felt entirely comfortable with what he was doing here, trying at times to be Tarantino but failing miserably. And likewise, I think that if this film had been in the hands of Tarantino or Robert Rodriguez, it likely would have come out much better, perhaps even great.","user":"tpaladino","rank":[347,441]},{"title":"Please, just make the voice-over stop","rating":3,"date":"25 September 2012","review":"There are many bad things about this movie, but let's list the good things first. The plot makes sense, kind of. It's nicely shot, and the beach looked pretty. And... I guess John Travolta looked as though he was having fun? Which is more than I could say for the poor buggers who had to sit through this mess.<br><br>Your two leads, ladies and gentlemen, are Aaron Johnson, last seen being upstaged by a preteen girl, and Taylor Kitsch, who Hollywood keeps casting as the lead in blockbusters which then tank spectacularly at the box office. You know why that is, Hollywood? It's because Taylor Kitsch has no charisma. None. The furniture was more interesting than he was, and had more emotional range. Even he's better than Johnson, a black hole of tedium from which nothing interesting can escape. These are two of the blandest leads I've ever seen, and I've seen movies that starred rappers.<br><br>But dear God in heaven, they are much, much better than Blake Lively. I haven't seen much else of her acting, so I can only think she can do much better than this. But here she's playing a 30-year-old ingénue, a woman-child who knows Shakespeare but doesn't know what 'savages' means. She's meant to be sexy and alluring, but she comes across as so boundlessly stupid that no man could seriously find her attractive. I don't think that's her fault, but the no-nudity clause that made the sex scenes in this movie so absurd? Yeah, that was her fault.<br><br>Even that isn't the worst. There's still... that voice-over. The narration that infests this whole movie, but especially the early scenes, is some of the worst writing I've ever heard. 'I had orgasms, he had wargasms' is a phrase that will live with me until I die. And now, even if you haven't seen the movie, it'll haunt your nightmares, too. You're welcome.","user":"mattbaxter72","rank":[324,444]},{"title":"Good Action Movie","rating":7,"date":"28 December 2013","review":"Reading the reviews i'm not sure why people were expecting this movie to be like an Oscar winner or something? Going in I wasn't expecting it to be an Oscar winner, if you were expecting this movie to be about a Mexican cartel and not have violence in it then you know zero about Mexican cartels and that is an understatement.<br><br>Funny thing was i was expecting this movie not to portray Mexican cartels in their real light, but after watching the movie, yup they are as ruthless as the movie portrays and glad Hollywood portrayed them like that instead of sugar coating the threat they pose to the world.<br><br>If you are looking for a violent action movie based on an American drug ring vs a Mexican cartel well you probably have one of the better movies when it comes to that. If you are looking for gone with the wind, sound of the music or something like that best look else where. Me, I highly enjoyed the movie, it delivered better than i thought it was going to deliver. People will complain about the violence but again this is about a Mexican cartel, not the boy scouts. There is nothing i hate more than a movie that isn't true to it's roots, but this movie stays true to what Mexican cartels are all about when it comes to business.","user":"nemisis_0","rank":[37,48]}]