[{"title":"Worst Stephen King Adaption of All Time","rating":1,"date":"12 April 2019","review":"Imagine someone told all of Game of Thrones in one movie that was just an hour and a half, then cut out 99% of the story. :(","user":"RussHog","rank":[125,154]},{"title":"The Dark Tower: Weakest King adaptation by far","rating":2,"date":"22 October 2017","review":"Truth be told though not terrible I've never been a fan of The Dark Tower books, I've read 5/7 and though being a huge Stephen King fan I could never seem to get into them.<br><br>Upon hearing that The Dark Tower was being turned into a feature movie however I was quite excited, until I heard the casting........until I saw the writer.....and until I saw the trailer. My expectations crumbled and I felt so bad for any real fans of the franchise.<br><br>Not only is The Dark Tower not loyal but I've never seen something encapsulate Hollywood so fiercely.<br><br>Let's break it down. We have the dark brooding hero (Who wields Excalibur no less) versus a charismatic villain. The good guy is protecting a child who is key to everything and the bad guy has lots of generic monstrous minions to do his bidding? Sound even remotely original?<br><br>Top that off with all your usual clichés, Hollywood tropes and 90 minute runtime and you have a seven book epic compacted beyond belief and smeared with cinematic \"Magic\"<br><br>I wanted to like this, I wanted to be proved wrong but this is the biggest mess since Death Note (2017)<br><br>The Good:<br><br>McConaughey is great<br><br>The Bad:<br><br>Not even remotely loyal to the books<br><br>Too \"Hollywood\"<br><br>Very anti-climatic","user":"Platypuschow","rank":[95,122]},{"title":"It has the same title as the books! Aaaaaand.... that's it.","rating":1,"date":"26 May 2018","review":"WHY does Hollywood hate Stephen King stories? Are they seriously THAT hard to put on film?? The whole POINT of this movie was supposed to be an onscreen adaptation of The Dark Tower series. Shawshank worked. The Green Mile worked. The Mist worked. With halfway-competent writers and directors (and I'm thinking \"Darabont\" here), this film should have worked.<br><br>But newwww. Instead, they stapled the Dark Tower characters onto a cheesy, embarrassing direct-to-DVD movie that sucks in its own right; one that nobody wanted to see. We wanted to see Roland and The Man In Black, and Oy! Not.... whatever this lazy crap is. This is 100% schlock. <br><br>There were actual cholos in the theater saying \"hayfoo, who directed this, ese? This ain't the story, homes. Let's sneak into \"Gigli, for real dawg.\"<br><br>(The \"Battlefield Earth\" writers are probably hi-fiving their thetans now that they're off the hook. Good job, writers.)<br><br>SPOILER: This is a horrible movie that has nothing to do with the original story. If your other half is a Stephen King fan and you want to hear them yell \"WTF??\" every three minutes, throw this one on. Frigging terrible.","user":"davestevens-04947","rank":[86,112]}]