[{"title":"The best portrayal of Marilyn Monroe to date.","rating":10,"date":"11 October 2011","review":"I attended an advance screening of \"My Week With Marilyn,\" and much to my surprise, was absolutely blown away. I was initially very reluctant to accept Michelle Williams as Marilyn, one of the most beautiful and glamorous women of all time, but she was extraordinary - luminous, even. She pulled off the role seamlessly, and turned Ms. Monroe into a layered, complex character, rather than the sex-kitten caricature we are all so used to seeing. Michelle managed to show us the real Marilyn - the woman who so desperately wanted to be loved, to be accepted, to be good at her job. The vulnerability, the mannerisms, the voice - all were pitch perfect. I have no doubt there will be yet another Oscar nomination in Michelle Williams' near-future.<br><br>I was also very impressed by Eddie Redmayne, who's character was arguably the heart of the film. He was excellent as the star-struck yet sensitive Colin Clark, who helped Marilyn through her very difficult time on the set of \"The Prince and the Showgirl.\" This was definitely a star-making turn for Eddie - I expect we'll be seeing much more of him. <br><br>The movie is similar in tone to \"The King's Speech,\" and was helped by a beautiful score and wonderful costumes. Director Simon Curtis, who devoted eight years of his life to this project, did a wonderful job capturing the essence of 1950's England. The wardrobe department deserves a nomination, as do the writers. Kenneth Branagh was superb as Laurence Olivier, as was the great Judi Dench as Dame Sybil.<br><br>All in all, one of the best films I've seen this year, and definitely the best (not to mention most authentic) portrayal of Marilyn ever to hit the silver screen. I couldn't have been more impressed.","user":"briannaweitzman","rank":[179,232]},{"title":"Candle in the Wind","rating":8,"date":"1 December 2011","review":"Marilyn Monroe, the quintessential blonde bombshell, came to Pinewood Studios in 1956 to shoot 'The Prince and the Showgirl', a light comedy directed by and starring Laurence Olivier. Colin Clark, the third assistant director on the film, was the lucky 23-year-old who got to spend a week with her. 'My Week with Marilyn' cinematises his diary.<br><br>I imagine there aren't many characters more difficult to play than Monroe. It must be like playing Elvis. But I'm delighted to confirm that Michelle Williams makes the impossible look easy. She has thrown herself into this part and has nailed the portrayal. Aside from the physical resemblance, Williams walks, talks and acts like Monroe. It's too early to say whether she'll win the Oscar next year, but a nomination seems a certainty. <br><br>Williams' performance is bolstered by impeccable turns by an enviable roster of the creamiest cream of British talent: Judi Dench, Kenneth Branagh, Zoë Wanamaker, Eddie Redmayne and Emma Watson. Especial mention must go to Branagh whose Olivier is impeccable. He accurately displays the legendary actor's sophistication and scurrility, and is bound to receive a supporting Oscar nod. <br><br>I loved the film's playfulness, for instance when Clark takes Monroe on a tour of Eton, followed by skinny-dipping in a cold river. The filmmakers do well to capture the craziness of Marilyn's world and the feeling of what it was like to be the most famous woman in the world. There are some lovely little touches – like the scene where Clark asks Monroe why she has a picture of Abe Lincoln by her bedside. Her reply, 'I don't know who my real father was, so why not him?'. <br><br>Eddie Redmayne, who has appeared in some big films ('The Good Shepherd', 'Elizabeth: The Golden Age') is well-cast as Colin Clark. Perhaps it's because he looks so much the underdog. He sort of represents every young man who would have killed to be in his shoes. <br><br>Clark has his eyes set on Monroe but resigns himself to the fact that Emma Watson's character, a costume assistant, is more his match. A weakness in the story, although I'm unclear of the veracity, is how underused Watson is and how readily she forgives his liaison with Monroe. Didn't girls have higher standards in those days?<br><br>Simon Curtis is yet another Englishman who has moved seamlessly from TV to cinema. His film astutely plays down the fact that Colin was brother to the even more famous Alan Clark, a former Conservative MP. Rightly so, I think. This film isn't about the minister or his also-famous diaries. <br><br>I'm glad the filmmakers didn't sacrifice the film's integrity by moulding it to be rated 12A (British certificate) to increase ticket sales. The two or three flashes of flesh are not only welcome, they are vital (Monroe said that 'the body is meant to be seen'). Curtis teases us like Marilyn was famous for doing. But he knows not to go too far by showing us any more than is necessary. <br><br>In summary, this is a brilliant biopic, as well as a story of what happened when a young man got close to the star he adored. It is bittersweet and evocative of a golden age of Hollywood. I was made to care for Monroe. I felt bad for her when she was exploited. Along with Elton John's beautiful song, this film has made me understand Norma Jeane Mortenson a little better. Now I see her as more than a sex symbol. She may have been blonde but she wasn't dumb. Dumb blondes don't read James Joyce or marry Arthur Miller, or come out with some of the wittiest lines a person can utter. She was like all of us, really: a human being.<br><br>www.moseleyb13.com","user":"dharmendrasingh","rank":[79,105]},{"title":"Michelle Williams Brings Marilyn Monore to the Life.","rating":7,"date":"5 March 2012","review":"MY WEEK WITH MARILYN – CATCH IT ( B+ ) A young Colin Clark remembers the time he has spend with Marilyn Monroe during the filming of \"The Prince and the Showgirl\". The movie is told through the eyes of Colin Clark and how he sees Marilyn and her estrange relationship with the director/actor Laurence Olivier. As the movie is only about some of days Colin Clark spends with Marilyn, we don't get to see the whole drama inside her life but I must commend Michelle Williams for her stellar portrayal of Marilyn because it's her performance that takes you deep into the mind of Marilyn rather than the script itself. Michelle Williams's hardcore study on her character shows in the movie and she deserved her Oscar nod. Eddie Redmayne is impressive as always but over the years I've noticed that Eddie is always good but never really leaves a strong impact. I've seen him several movies so far but he wasn't that memorable in them. Kenneth Branagh is simply superb. Julia Ormond and Dominic Cooper are alright in their parts. Emma Watson did a decent job out of Hermione, even it was a small role but it was defiantly good to see her spreading outside Harry Potter franchise. Overall, My Week with Marilyn is a good movie and Michelle Williams's performance is worth watching. Highly Recommended! P.S I would love to see Michelle Williams reprise her role as Marilyn Monroe in Marilyn's autobiography if Hollywood decides to make one.","user":"saadgkhan","rank":[33,41]}]