[{"title":"What a pick me up this was.","rating":8,"date":"18 March 2019","review":"Every year some British gem pops up in the cinema, destined to be added to my blu ray collection, a film guaranteed to lift the spirits for years to come. This is 2019's feel good film, yes you know the story, and yes you can figure out every possible turn even if you don't, but it's just such a lovely movie.<br><br>We get one man's journey of self discovery and realisation of what's important, and we get the story of ten fishermen, who's talent is harnessed against all odds.<br><br>What an assembled cast, Daniel Mays, David Hayman, and of course the wonderful Maggie Steed, but it's the poker faced James Purefoy who stands out, he is marvellous.<br><br>It has fun moments, funny lines, serious elements, and of course several heart warming scenes. All in all, it's a winner. 8/10","user":"Sleepin_Dragon","rank":[44,50]},{"title":"A broad smile from start to end","rating":8,"date":"18 March 2019","review":"A feel good comedy that has you smiling from the start to the end. Yes it's probably over sensationalised and certain puns are overused but when a film has you grinning and laughing Inbetween from first minute to last you can look past its imperfections. A thoroughly good watch the only complaint is that it didn't last longer!","user":"muamba_eats_toast","rank":[20,24]},{"title":"Charming, gentle comedy that is well worth your time","rating":8,"date":"17 March 2019","review":"This is nice gentle comedy that plays out pretty much as you'd expect but that's not to disparage it in any way because it delivers precisely what you'd want it to. The real life personalities on which the story is based will be able to distinguish historical fact from liberties taken for the sake of the narrative of course. The audience knows that happens but that doesn't take anything away from the charm of the film. Had it played out a little less conventionally and a few of the supporting performances been sharper I'd have rated it a 9.<br><br>There's some nice humour that stems naturally from the tight knit community friendships when an outsider comes into their lives, and some truly wonderful harmonies in the singing of those shanties. I'm not a folk song enthusiast but there's no denying the music is resonant and lyrical. Definitely one I'll add to my collection on Blu-ray because I think it has repeat viewing potential as one of my 'feel good' film collection.","user":"rbaylis","rank":[21,27]}]