[{"title":"If you loved UCB you'll love this as well","rating":7,"date":"6 March 2012","review":"Almost every Tuesday Instant Netflix has at least one film streaming on same day as released on DVD, this week (3/6/12) it's High Road &amp; Senna, the former I decided to watch first. <br><br>Aimless slacker/weed dealer, Glenn (James F. Pumphrey) has fallen on hard times after his band, Torigl, split up. So when one of his clients gets nabbed by the cops, he freaks out and takes off on a road trip to see his estranged father. His neighbor's son along for the ride. So now he's being pursued by his neighbor who thinks his son's been kidnapped, his neighbor's friend &amp; glenn's pregnant girlfriend in this highly-improvised Indy comedy.<br><br>Most of the film is pretty funny and I found myself entertained throughout. Most of the cast acquitted themselves admirably, with the exception of Ed Helms who did nothing for me. But yea, if you liked Upright Citizens Brigade, you'll love this film.<br><br>my grade: B+","user":"movieman_kev","rank":[15,20]},{"title":"More fun than funny","rating":8,"date":"26 April 2014","review":"I had to read about this movie after watching as throughout it from start to finish there is just something odd about it. To my surprise I discovered the film is mostly improvised.<br><br>The cast (which includes some notable names) pulls this odd ball story off with great success! For improvised dialog it all fits and shows what a skilled cast can achieve.<br><br>The movie starts with each character only focused on their personal needs and with little concern for others. Fitz (the main character)has made a mess of his life but has a girl that loves him - unfortunately for Fitz he can't see this. Through a series of 'events' Fitz escapes to visit his father. At the 'Berlin Bar' Fitz learns his lesson and heads back to his girl. The others also learn a life lesson.<br><br>This is a simple story nicely told and bravo to the actors! There are a few slow moments but the movie is most entertaining!","user":"cekadah","rank":[12,17]},{"title":"\"High Road\" Is Absolutely Brilliant!!! Unlike Anything You've Ever Seen.","rating":10,"date":"10 November 2012","review":"\"High Road\" Is The Single Greatest Comedy Film In The History Of American Cinema. Matt Walsh Has Proved Himself Time nd Time Again To Be A Great Comedic Voice, But Never As Strongly As In His Directorial Debut. The Story Is Simple, Yet Totally Original. The Hilarious James Pumphrey Stars As Fitz, A Stoner And Musician Who Is Suddenly Thrown Into A Threatening Situation When He Is Caught Dealing Weed To Someone At A Local Convenience Store And Goes On The Lam. Fitz Then Encounters Jimmy, A Sixteen-Year Old Who Is Running Away From His Domineering Father. Jimmy's Father Is Played By Rob Riggle. Fitz Reluctantly Takes Jimmy With Him After Assaulting Jimmy's Father With A Brick, Not Knowing That The Man Was Jimmy's Father. The Two Are Going To Oakland, California To See Fitz's Father After Fitz Learns That His Girlfriend Monica, Played By The Excellent Abby Elliot, Is Pregnant With Fitz's Child. Along The Way, They An Encounter A Prostitute Played By The Amazing Morgan Walsh. The Role Exists Only In A Cameo, But It Is Unquestionably One Of The Most Memorable Scenes In The Film. Meanwhile, Monica Has No Idea Where Fitz Has Disappeared To And Drives To Oakland To Find Fitz. When Fitz Finally Finds His Father, We Learn That Is A Drag Queen And Is Played By The Brilliantly Hysterical Rich Fulcher. The Following Scenes Are Both Hilarious And Also Provoke A Genuine Emotion Response In The Viewer. The Entire Cast Is Stellar, With Dylan O'Brien Playing Jimmy And Featuring Ed Helms, Lizzy Caplan, Joe Lo Truglio, Horatio Sanz, Matt L. Jones, Andrew Daly, And The Terrific Zach Woods. The Film Was Directed By Matt Walsh With A Completely Improvised Script. The Film Features Many Members Of UCB And Has A Similar Feel To What The UCB Has Become Known For. The Film Is Unlike Anything You Have Ever Seen. \"High Road\" Is Equal Parts Hilarity And Heart. Walsh's Direction Is Excellent And Wonderfully Unique. \"High Road\" Is, In My Opinion, A Perfect Film That Exceeds Any And All Expectations. It's One Of My Very Favorite Films.","user":"derekdiercksmeier","rank":[7,22]}]