[{"title":"Unexpectedly Good","rating":7,"date":"11 May 2012","review":"I usually avoid movies I know will be explicit and include crude humor because it's just not my cup of tea. So, right off the bat I was expecting this movie to be absolutely horrible... I do not know if it was my low expectations before the screening, but I actually enjoyed this movie very much. In order to enjoy this movie, however, you do have to somewhat detach yourself from thinking too much into the wealth of racist and crude humor contained in the movie. Nevertheless, The Dictator is satire, it is a movie making fun of the real world, and if you let it be, it makes you aware (while laughing) at the racist thoughts and stereotypes ordinary people have everyday. Yes, it has its strange and explicit scenes, but overall, I think it has substance and it was very funny. Put your \"Victorian\" influences aside for a night and have a good laugh. Watch it.","user":"eshin55","rank":[285,372]},{"title":"I'm at a loss as to how to describe this movie.","rating":6,"date":"19 May 2012","review":"I went to see this movie with my friend. I would consider that we both have a good sense of humor and are open to all sorts of jokes. I have seen other movies by Sacha Baron Cohen, like Bruno and Borat. I found Borat to be hilarious, but Bruno was a bit over the top for me. This movie strikes a balance between the two, but leans more towards (my personally favored) Borat side.<br><br>The comedy in this movie is both hilarious and uncomfortable at times. It has the same LOL- quality as it did in Borat, but there are scenes where the comedy is so crude that it is almost uncomfortable watching/listening to it. The movie is definitely funny, but you will not enjoy it if you do not find jokes about racism and stereotypes funny.<br><br>The plot is your typical Sacha Baron Cohen plot; a person from an entirely different culture travels to America and you watch how incompatible the two cultures are. Also, just like most of Sacha Baron Cohen movies, there is a love story intertwined. It's not the dramatic and sensitive kind of love story though. The plot itself is not very immersive, and I believe that its only purpose is to lead you to the funny parts.<br><br>I will say this though, the ending speech of this movie given by 'The Dictator' really impressed me. It made me realize how well Sacha Baron Cohen understands politics and stereotypes. You have to hear it for yourself.<br><br>If you're looking for a movie with consistent but crude laugh-out-loud comedy, but do not look for a serious and powerful plot, then you will enjoy this film. On the other hand, if you cringe at racist and stereotype jokes, you will be covering your ears virtually the entire movie.<br><br>Approach with an open mind.","user":"mtuspersonal","rank":[156,214]},{"title":"Excellent","rating":10,"date":"22 June 2012","review":"I wish there were more comedies like that - crossing over the political correctness line, but not over the line of good taste, so as to make a movie hard to watch.<br><br>The film is quite pointy, it is for a moderate audience and will make all kinds of extremists quite unhappy. The plot is well thought out and funny. It'll nail you to the screen.<br><br>I like the unorthodox character of this film, Sacha Baron Cohen's movies are definitely one of the kind. I wouldn't consider the humor crude, but it is certainly honest. Some of the unthinkable things you see are likely to have happened in reality.","user":"mihkelm1","rank":[128,176]}]