[{"title":"If this doesn't make you cry, nothing will","rating":10,"date":"29 February 2012","review":"'Courageous' is in the top 10 of my favorite faith-based movies. It really is a tremendous uplifting film that leaves you in tears from the very beginning to the very end. And it's all attributed to God. Kudos to Alex Kendrick for being in the film and giving a terrific performance! I give Courageous a 10 out of 10 My top 10 faith-based movies of all time are: 1) Ben-Hur; 2) Suing the Devil; 3) Soul Surfer; 4) Facing the Giants; 5) Chariots of Fire; 6) End of the Spear; 7) The Climb; 8) Gospel of John; 9) Time Changer; 10) Courageous You're missing out if you haven't seen these films!<br><br>God is working through these films.","user":"billfong36","rank":[117,151]},{"title":"Another Excellent Effort.","rating":8,"date":"30 September 2011","review":"Yes, it's a \"Christian movie\"...and yes, there's a \"happy ending\" and yes, there's a \"message\". So what?<br><br>In the 40 or so years I have been a regular movie goer, I've seen pretty much everything one can put into a film, from explosions to nudity to every possible combination of four letter words. And I am happy to say we didn't get any of it in this movie. So, if you yearn for a Hollywood blockbuster....pass on this one.<br><br>No, I'm no Pollyanna. I like some action and adventure. But I've gotten to where a movie with \"less\" is better to me in many ways. Yes, in full disclosure, I am proud to say I am a Christian. A Christian dad, too. I'm happy to report that this movie is what every father should see, be they \"in the Faith\" or not. It's nice to see a movie where there's a strong message of family unity. Even Disney movies have taken to trying to tell us that your average family is a broken one. That may be factual, but why can't we have some entertainment that focuses on people trying to be strong fathers? And that leads to strong mothers, and then stronger children. And in the end, a stronger community.<br><br>There's just enough humor to keep the movie moving along. It's not a short film by any means, so you do get your ticket price in viewing. There were a few scenes that might cause a jump or two, but they are part of setting the story. The movie is a nice surprise in a season of movies that will probably be forgotten a few weeks after viewing. <br><br>If you have a hard time hearing a lot about GOD and such, pass on this at the local Googleplex and wander into another film. I hope it makes you happy. But, I would gently suggest you try this movie out. Be you a man (or woman) of Faith or not. You just might be surprised. And, you just might wish to spend a little more time with your family.","user":"jwrowe3","rank":[160,213]},{"title":"Reality Movie vs. Reality TV","rating":10,"date":"23 March 2011","review":"Reality TV is not really real. I mean, I have no friends who've been stranded on an island or locked in a house (nor, as far as I know, has that happened to people who don't like me). In contrast, the movie, Courageous, truly reveals the reality of life. This highly entertaining film is about the struggles of fatherhood. Which of us guys hasn't struggled with the boundaries between work and home? <br><br>The story centers on a group of law enforcement officers and is filled with action, outstanding humor and at times, some tough emotional moments. At the show I attended, everyone cried. They cried at some tragic moments and at some moments of great relief. At my side was a good buddy who is a successful business pro and strong family man. He &amp; I both walked away with some deeper awareness of how we could be better fathers to our kids and to our brides.<br><br>So there are also some distinct learning moments that makes this film much more than just an escape from reality. How often do you have an opportunity to take someone to a movie that has trailing impact on your life? I'll suggest you get some Dads together to watch Courageous and sit down for a meal afterward to talk about what it showed you were doing well, or right - and what you could be working on to better build into your family and their future. Powerfully-told story with an outstanding cast.","user":"dan-8-256175","rank":[160,229]}]