[{"title":"Ahistorical, Shallow Male Bonding Film!","rating":5,"date":"9 July 2018","review":"It was wonderful to see Karl Marx and Engels in front of a big screen and to see them as real human beings who eat, drink, converse, and love. The film features a stellar cast with superb acting. However it's utterly lacking in vision, imagination, and depth. <br><br>The film takes place in Prussia in 1843 when in Marx's was in his mid-20s, it ends five years later with the publication of the \"Manifesto\" ; a collaboration with his friend Engels in France just before the major 1848 revolutions sweeping Europe <br><br>Instead of a stirring, sweeping, though-provoking historical film biography set in revolutionary times like the Lion of the Desert, it seemed like a barely memorable, emotionally uncompelling and intellectually unstimulating soap opera that could have been shown on PBS's Masterpiece Theater funded by the Ford Foundation. In other words, a film so absolutely sanitized, it's provokes little controversy, political or otherwise. Anyone really looking to understand the time period or know more about Marx and Engels will be sorely disappointing. <br><br>The film begins with great promise showing peasants being hunted and killed by armed police on horseback for gathering fallen branches in the woods; an act of theft according to the elite; then cuts to Marx and his colleagues having their publishing headquarters raided, destroyed, and being arrested by Prussian police for writing critical articles in the progressive newspaper, the Rheinische Zeitung. Then the film turns into a bad B rated male bonding film. \nAt first each is wary of each other as they meet in the parlor of the publisher Arnold Ruge. Within minutes of meeting, Engels tell Marx out of nowhere, You're the greatest materialist thinker of our time; A genius.\" (although we in the audience are stumped to know why) and from this moment on they become best buddies; acting like \"hip\", well-dressed, immature teenage schoolboys: drinking, smoking , running from cops, and country hopping reminiscent of the silent slapstick keystone comedy. <br><br>The Young Karl Marx could have been a deeply, moving, intellectually profound, and politically astute film like Midnight Cowboy, Cinderella Liberty or countless other films from the 70's; where deep friendship and love is set among the realistic grinding poverty, desperation, and bleakness of a major city; but it is not. According to the director he wanted modern audiences to relate to the film. So the Europe of the 1840's is transformed into resembling the superficiality and shallowness of the 21st century. Never do we seem to feel the overwhelming suffering and anguish of the workers. If the director had never experienced or eye-witnessed hunger, deprivation, seen a slum or inside of a factory at the very he could have done some research. <br><br>Marx' family is poor, but the only deprivation visually depicted is Marx buying cheap cigars; hardly deprivation unless one is smoking to quell hunger pains. Never do we see real images of poverty: People freezing without coats, wearing rags, or sick and coughing from malnutrition. Never do we see scenes such as: Marx or his wife complain about eating small scraps of just plain, stale bread 2 weeks in a row, or even a scene where Marx is seen giving his share of a tiny piece of bread to his wife or child with the look of hunger in his eyes. Scenes even true in the US today. Rather everything is purposely sanitized from the lack of horse crap and human crap on the city streets to the bums and ragged, homeless children on the streets to the regimented textile mills utterly devoid of any coughing or appearance of exhaustion among the female workers. Even the drab gray clothing and washed-out color effects dampen our ability to connect to the workers, because they make the film looks so unrealistic.<br><br>I remember the first time I entered in a textile factory as a child in NYC. I will never forget the chaotic movement and especially the \"fiber\" dust. It was so thick; it burned my eyes and nose and blinded me as if I were in a sand storm. I will also clearly remember hearing the sounds of coughing and sneezing between the noise of the sewing machines operating; and the look of sheer exhaustion that every bone in the women's bodies cried out; including those who sat for 8 hour. Let me not also forget having to step over, with the help of my mother, over drunken bodies, because the bar was only two doors down. This was not grinding poverty, but much closer to anything shown in the Young Marx. <br><br>The closest we get to working people suffering is in a fictionalized scene where Mary Burns describing how she knew someone who lost some fingers in an accident. One has to ask why did the director need to create this utterly unrealistic fictitious scene? Even today a working woman in the US would think twice before raising her voice and being fired; but Mary Burns not only raises her voice, but walks out of the factory Engel's father owns without even a second thought; especially considering her family could starve to death and she may blacklisted from ever working again. The scene seems to have been invented so Engels could later childishly get back at his father for firing her; as if doing a one upmanship: \"In your face, dad! <br><br>Marx spent thousands of hours in libraries doing research, taking meticulous notes, and writing and rewriting his works; a large portion of his life, but this is totally missing in the film. It's just not \"hip\" in today's society to show someone studying, reading lines of poetry, or listening to a beggar singing a classical aria on the street; all things that were part of life in the 1840's; even among factory workers. I rather doubt Marx composed his Labor Value of Theory between bouts of drunkenness or that Engels' major research for his History of the English Working Class came from romancing the young Mary Burns. With so much emphasis on drinking and smoking, I began to wonder ½ through the film how much funding the cigarette and alcohol companies provided.<br><br>Except for this one scene, women seem to be sprinkled into the film so it won't be an all-male cast. Their major role, following sexual stereotyping, is supporting their men; as if the time period lacked any revolutionary women. \nEven the relationship between the main characters and their significant others appear shallow. Both appear more passionate about ideas then their spouses. We never learn why or how Marx and his wife met or married; only that she was an aristocrat, The only passion shown between them is a gratuitous, unromantic, unsensual, and visually distasteful sex scene, which prevents parents from bringing children to see the film. Unless this was the goal, why was it included? <br><br>Just like the 2 women are sprinkled into the film, so are two of the biggest social critics of the time the influential social reformist Pierre-Joseph Proudhon and the Russian anarchist Mikhail Bakunin. We learn little about Proudhon's views and nothing about Bakunin at all. <br><br>Though the film ends at the cusp of the failed 1848 revolutions sweeping Europe, no where do we see or hear the sounds of chains rattling; attempting to break free. In a film made during revolutionary times, where are the workers protesting in mass? The film follows Marx &amp; Engels, but not the workers on the street, which Marx and Engels joined. <br><br>Bourgeois cinema spends millions indoctrinates the working class into believing they need to follow a messiah who will rescue them. Marx and Engels were great men, but great men don't create history. MLK for example didn't start the civil right movement. No, Great men only do the steering, because it's the workers who create history. The 1848 revolutions didn't pop-up spontaneously among individuals, but through years of organizing among the masses. However, would we really expect anything different? Do we really expect our masters to teach us our history? To give us the theories and to show us how revolutions take place and that they are indeed possible? <br><br>The film ends with Marx and Engels writing \"The Communist Manifesto,\" and reading the stirring first line: \"A spectre is haunting Europe - the spectre of Communism...\" when it cuts to music and juxtaposed pictures. Instead of hearing the International and aspiring images of the Paris Commune and Russian Revolution, we hear the apolitical Bob Dylan song \"Like a Rolling Stone\" juxtaposed with photos from Che Guevara and Castro to Reagan and Thatcher. Ironically or perhaps expected Lenin and Stalin are not included; so as to not offend the financial backers or give the workers ideas.","user":"jessicacoco2005","rank":[18,25]},{"title":"Karl Marx, his wife Jenny, Frederick Engels and his wife Mary and their fight against the horrors of early industrial capitalism.","rating":9,"date":"2 November 2017","review":"Six years ago I stumbled upon a Charlie Rose interview with author Mary Gabriel, a 2011 National Book Award finalist for her Love and Capital: Karl and Jenny Marx and the Birth of a Revolution. Intrigued, I ordered Gabriel's book. By the time I finished Love and Capital I was, as the British say, \"gob smacked.\" What puzzled and surprised me, as a filmmaker, was that this turbulent epic, utterly engrossing and deeply romantic, had attracted so little attention. Why had this story not made it to the big screen, or materialized into a blockbuster television series? Is the name Karl Marx still so anathema? Then, last Sunday, a new film titled The Young Karl Marx (Le Jeune Karl Marx) which premiered at the 2017 Berlin International Film Festival, suddenly found its way to the Amherst Cinema. <br><br>In spite of some tepid reviews on Rotten Tomatoes, curiosity lured me to the screening. I have no regrets: The Young Karl Marx (YKM) is a rare and unusual film—beautifully-acted by a stellar cast, craftily scripted, and heavily focused on political content and character. Here is how Peter Bradshaw reviewed it in the Guardian/UK: \"Raoul Peck is the Haitian film-maker who has an Oscar nomination this year with his James Baldwin documentary I Am Not Your Negro. Now he comes to Berlin with this sinewy and intensely focused, uncompromisingly cerebral period dramaabout the birth of communism in the mid-19th century. It gives you a real sense of what radical politics was about: talk. There is talk, talk and more talk. It should be dull, but it isn't. Somehow the spectacle of fiercely angry people talking about ideas becomes absorbing and even gripping.\"<br><br>At the film's center is its title character, played brilliantly by August Diehl. Bradshaw describes Diehl's Marx as \"ragged, fierce with indignation and poverty, addicted to cheap cigars, spoiling for an argument and a fight.\" This is the notoriously nasty side of the Marx persona. But as Gabriel's book, and many other biographies reveal, Marx's character is fascinatingly complex. I have often tried to imagine what Marx must have been like, but been unable to wrap my brain around his multi-sided character. Exploring the complexities of Marx, the man, is perhaps the film's greatest strength. <br><br>For starters, Marx was viewed by his contemporaries as smart as a whip. Moses Hess, a socialist and early Zionist, provides this over-the- top description to his friends of 24-year old Marx: \"you can look forward to meeting the greatest, perhaps the only real philosopher now living. He combines a biting wit with deeply serious philosophical thinking. Imagine Rousseau, Voltaire, Holbach, Lessing, Heine and Hegel united in one person, I say united, not lumped together — and you have Dr. Marx.\" Edmund Wilson described Marx as the greatest satirist since Jonathan Swift. <br><br>But he was also a pussy cat: Wilhelm Liebknecht, who was constantly in the household during the 1850s, remembered Marx as \"the most tender father: one must have seen Marx with his children to obtain a complete notion of the depths of sentiment and the childlike nature of this hero of Wissenschaft (academic pursuit). In his free minutes, or while strolling, he brought them along, played the wildest and most lively games with them— in short he was a child among children. \"Children should educate their parents,\" said Marx, and lived up to the dictum by keeping in step with the reading, entering the fantasy life and adjusting his views to meet the religious scruples of his engaging youngest daughter, Tussy. Marx tells her the story of the Passion —\"the carpenter whom the rich men killed,\" adding that much can be forgiven Christianity because it has taught the adoration of the child. <br><br>Because YKM dramatizes only a short five year period in Marx's life (1842 to 1847) a great deal of the Marx family saga remains untold: childhood and family life in Trier; Marx's scorching love affair with the baron's daughter, Jenny von Westphalen; the crucial role of his wife and three daughters in aiding and abetting him at every turn; Karl's betrayal of Jenny goes public when Lenchen, the family housekeeper, gives birth to Karl's illegitimate son Freddy, leaving it to Engels to save Marx's bacon by falsely claiming paternity of the boy, thereby rescuing Karl and Jenny's marriage. Perhaps these fascinating omissions will be addressed when the Marx family saga finally becomes a long-running television series--whenever that may come to pass. While we wait, Le Jeune Karl Marx is well worth the price of admission.","user":"eurvater-908-159430","rank":[42,67]},{"title":"It is what it is; bringing the young Marx to life though people wanting more may be disappointed","rating":8,"date":"1 July 2017","review":"'A spectre is haunting Europe, the spectre of communism'. These are the opening lines of the Communist Manifesto which ironically is the film's conclusion. We learn that the purpose of the opening paragraph in the manifesto was to be simple and straight to the point, while saying so much. That's what this film is and what it did so well, draw the viewer into a simple world of major importance and complexity. \"Substance, but no style!\" Is what I heard people say as they left the cinema. Hmm, I'm not sure if I agree...well, fully. Indeed the film had its flaws and yes, it lacked urgency to go read Marxism but what we did get was the man himself and his 'world'. The title using 'young' is realistic; a man most known for the 'birth' of communism is the premise of the film and it was super compelling. This film could have had more style sure, but what is style if there is no substance. Communism has a collaborative process so it was great to see its collaborative side through a fantastic supporting cast ushered by an intelligent screenplay, though the film may be overwhelming for some with its excessive discussion of 'Marxist' philosophy. You never see Marx in a room by himself which ignores an independent or 'hero' image that he may be associated with because he was honestly a family man who liked to chat and have a good laugh. A family man, with the help of his friends, produced the product (The Communist Manifesto) that the film ends with in its final scene and is ultimately what the film is about.","user":"williammjeffery","rank":[23,36]}]