[{"title":"Visual poetry - and a celebration of human resilience as well as an ode to the savage beauty of nature","rating":23,"date":"23 December 2015","review":"A lot has been said and written about this film, mostly about its troubled production - forget all that: it has no meaning whatsoever for the experience this film provides. A word of advice though: if you go in expecting a testosterone-fueled revenge thriller in the vein of 'Apocalypto', you'll likely end up disappointed. It's simply not that kind of film - but that doesn't mean you won't enjoy it if you watch it with the right expectations.<br><br>'The Revenant' opens with images from a dream; we see snippets of memories showing a peaceful life - and soon the loss of that peace, and the loss of life. The images change and we hear the soothing sound of gurgling water as we follow the camera via a long tracking shot over a flooded forest; it's an image that seems to imply peace, evoking nature's beauty with an almost meditative quality - before the barrel of a rifle appears in the frame.<br><br>Those first three minutes I just described (which are the only spoilers you will get in this review) set the tone for the film perfectly. It's a film that tells a story of harrowing circumstances through images that are breathtakingly beautiful; a film about survival and death and shocking acts of sudden violence - and yet a film that, despite all its visceral intensity, also has a quiet, immersive quality to it that feels almost hypnotic.<br><br>Many critics and reviewers point out the stark contrast between the film's poetic beauty and the ugliness of its violence - implying the director wants to use this contrast to make a certain point regarding mankind's interference with nature. While that would seem pretty obvious (and it probably is at least partly true), I left the film feeling I単arritu had shown me a vaster, far too complete image of the clash between man and nature to justify such a simplistic interpretation of the events portrayed on screen. Whether intentionally or not, I単arritu shows the star of his film with a complexity and honesty that we normally don't get to see in these kinds of stories. And I'm not talking about Leonardo DiCaprio here (who gives a no-holds-barred, crazy good performance and I'd love to see him win an Oscar for this film) - the star of this film is not a person: it IS nature, plain and simple.<br><br>The revenge plot - which feels almost like an afterthought or a ploy to give the film a certain structure and a proper ending - is not really the film's main theme or strongest aspect, and it certainly isn't the reason that made this film so compelling to watch for me. Such stories have been told often enough - and often better - than in 'The Revenant'. No, what really makes this film stand out for me is that I have NEVER seen a Hollywood film (any film, really - apart from documentaries) that shows nature in such an unflinchingly honest and mesmerizing way as is the case here. And the way I perceive it, I単arritu sees his human protagonists as being very much a part of nature as a whole - regardless of their destructive behaviour. <br><br>It's that refreshingly holistic approach (which some viewers might perceive as nihilism on the director's part) that I find to be the film's biggest accomplishment: it depicts the people in this story as just another species trying to survive in that perilous frontier-world. The emphasis is not really on the moral aspects of the brutal injustice that the main character suffers or how the Native Americans are cruelly exploited; we witness all that - but I単arritu keeps a certain emotional distance, as if he were shooting a documentary about predatory wildlife. And just like the bear's attack, most of the violence in this film comes as a reaction of defense. Be it self-defense, defending one's offspring or defending territory and valuable resources. Even the character that comes closest to an actual villain is driven by fear - not hate, and his most obvious character defects were caused by a very traumatizing experience. As in nature, there is a simple (if often brutal) logic to why most characters, men or beasts, act the way they do in 'The Revenant' (OK, maybe not the French - but I didn't say the film was perfect). And the bear attack is the most realistic depiction of an animal attack I have ever seen on film.<br><br>All in all, this film feels less like a story of revenge and more like an ode to the visceral beauty of nature and the relentless, savage force that is life; it provides an immensely absorbing - and touching - experience to those who have an affinity for the wilderness, but it's also a visual masterpiece and a great piece of old-school filmmaking for lovers of Cinema. It's not perfect (especially during the last third of the film where I felt the pacing was a bit off), but it's a film the likes of which we will only rarely get to see - if at all - in the future. 'The Revenant' is visual poetry of the most primal kind, and it should be seen on the biggest screen possible. 9 stars out of 10 from me.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[485,662]},{"title":"One of the Best Movies I'll never watch twice","rating":8,"date":"9 January 2016","review":"The Revenant falls into the same category as Aronofsky's \"Requiem for a Dream\" and Spielberg's \"Schindler's List\" for me, in the essence of being a terrific movie but not something I think I can sit through a second time. In all these movies there are brutal sequences that cause emotional stress and disgust just watching because it is so REAL and GRIPPING. To think that events in these movies actually happened or that they could very well happen is too much for me to think about. Not to say that I did not enjoy this film thoroughly. <br><br>The Revenant is a technical masterpiece that left me wondering \"How the hell did they do that?\" after many scenes and sequences. With beautiful cinematography and adroit camera movement this film is a visual magnum opus. It is apparent that the great minds that put forth this film are none other than the same ones that brought us Birdman: Lubezki and Inarritu. There are many long shots without cuts that are sprinkled throughout the film that add a sense of sophistication to it with the added bonus of predominantly location based shooting and natural lighting for the film , that can even make a novice film watcher raise an eyebrow at its complexity. <br><br>The camera work is not the only noteworthy aspect of the film; The actors did a superb job executing their rolls. Many are raving about DiCaprio's performance but I was more of a fan of Hardy's brutal and gritty character Fitzgerald. Granted, half the words that came out of his mouth were unintelligible but he left no doubt in my mind that he was fully devoted to his role and bringing Fitzgerald alive instead of just Hardy playing a character named Fitzgerald. He was simply amazing.<br><br>With all this said, there are still flaws in the film. At some points it was dragging on and moving too slow. It gave the impression that the film itself was cocky and wanted to show off all of its beautiful scenery and camera work too much. Then there was the \"he shouldn't be alive\" situations. Hugh Glass was a real guy that really did survive a bear mauling but in the film they make this guy practically immortal. There were too many instances where I was thinking \"he should be dead three times over right now, for me to enjoy the film as much I should have. <br><br>All in all a great film that I only recommend to seasoned and mature film viewers.","user":"mrblacktip","rank":[489,680]},{"title":"love this movie highly recommend.","rating":10,"date":"23 February 2020","review":"Finally saw this movie (yes 4 years late) and I understand why Leonardo won the Oscar, along with the many academy awards the movie and director won. It is a cinematic masterpiece. The cinematography is amazing, the whole cast (Tom Hardy is great here) is great. The costumes and weapons used (early 1800s) look so damn good. The story is very simple and not complicated. It is about revenge and surviving in the cold and icy wilderness of 1823. The action scenes are brutal and gritty, like they should be for that time period. Officially in my top 10 movies of all time. If you've never seen this film, do yourself a favor and rent it or buy it. It definitely deserves to be in your collection. Some people might not like all the spiritual stuff or reading subtitles (lots of Native American language here) but it is needed since there a lot of interaction with Native American tribes here. FINAL REVIEW 10/10","user":"MR_Heraclius","rank":[43,56]}]