[{"title":"Clever, intense Sci-Fi spectacle; offers nearly as much humor as it does excitement along with a great, unexpected turn from Tom Cruise","rating":9,"date":"27 May 2014","review":"Wow - this was unexpected. The trailers had me believe that after 'Battle L.A.' and 'Oblivion' this would be yet another bleak, action- packed, special effects driven Sci-Fi blockbuster about an alien invasion - what the trailers failed to convey almost entirely is that over long stretches, this is also seasoned with nearly as much humor as 'Groundhog Day'. That it would invite comparisons with the Harold Ramis/ Bill Murray classic was obvious, given the time loop premise, but I never expected to what extent those comparisons would actually be justified and that this film would really tap into a similar kind of comedy. Luckily, it is all the better for it.<br><br>Most unexpected of all, the main reason the comical aspects during the first half of the film work so well, is Tom Cruise's character, Major William Cage. This is easily Cruise's meatiest role since his turn in 'Magnolia' as Frank T.J. Mackey; forget his usual stern, poster boy heroes: here he plays an entirely different character – and he really seems to relish the opportunity. I won't give away too much, but be prepared to chuckle and laugh when you see a new side of Tom Cruise.<br><br>Yet while this is not nearly as bleak as the trailers suggested, it certainly isn't a comedy either. And it absolutely IS an action-packed, special effects driven Sci-Fi blockbuster about battling an alien invasion (the trailers got that right), albeit one with a funny bone and great characters. Speaking of which, the rest of the cast is also very good, especially the gorgeous Emily Blunt. It seems that no matter what she does, she always comes across as genuine and real; here she succeeds in portraying her character - a tough, seasoned soldier other soldiers refer to as \"full metal bitch\" (no kidding!) - with just the right touch of vulnerability to make her that much more believable. Bill Paxton and Brendon Gleeson are always a welcome addition to any movie, and while they are great (as usual), character-wise, they don't do anything here that you haven't seen them do before. <br><br>As for the Sci-Fi spectacle that the trailers promised, I'm glad to report that the film delivers. The battle scenes are beautifully orchestrated (not the Transformer-style blur where you can't make out anything anymore), and there are moments when the intensity of the fighting recalls the landing on Omaha Beach in 'Saving Private Ryan' - without the gore, obviously (after all, this is PG-13). The design of the aliens - the production design in general - is incredibly well done, although I would lie if I said it was something ground-breaking and new the way the first 'Matrix' was (it IS breathtaking, though).<br><br>So my verdict: With one of the most inventive (adapted) scripts for an original (mega-budget) film in a long time and the best Tom Cruise we've seen in years, 'Edge of Tomorrow' will have you chuckle and laugh nearly as much as drop your jaw in awe: this is what Hollywood should take as a blueprint for exciting summer entertainment henceforth. 9 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[826,929]},{"title":"This movie doesn't think you're an idiot.","rating":9,"date":"4 June 2014","review":"When I saw that Doug Liman was directing and McQuarrie penning, I was interested. I liked Liman's first Bourne film over Greengrass-directed nauseating shaky-cam sequels. McQuarrie is a wonderful screenwriter, and these two seemed like a perfect pair.<br><br>I got what I hoped: a movie that doesn't treat me like a 10-year old. \"Edge of tomorrow\" is smart, entertaining, exciting and fun. It's an original movie as well, not a sequel or a remake (although I hear it might be inspired by a novel or graphic novel).<br><br>Tom Cruise - who plays a slightly different character than usually - is good, he always brings his best. He cares about his projects and demands to do as much stunts as possible. His passion can be seen here too and he is again a joy to watch, but this isn't a movie for Cruise to carry. Liman and McQuarrie carry this movie with smart pacing, transitions and that certain magic good filmmakers seem to be able to harness at will.<br><br>Emily Blunt isn't a useless sidekick, but a strong and likable character. Not annoyingly strong on the surface like some feminist ball-busting fantasy, but a real character and deserves every minute of her screen time. Bill Paxton was fun to see as a hard-ass sergeant, and Brendan Gleeson was good as well - even though his screen time is limited. All the main actors work well together, if a scene is shared.<br><br>The movie flows in an interesting way and it likes to surprise you. I'm not talking about forced twists, I'm talking about that special situation where you don't know what happens next. I've missed that feeling. I didn't have to pretend to care about the movie, I was interested in every minute of it. This happens rarely. And when it ends, you're satisfied. No setting up sequels, no ambiguous crap, just a solid, fitting ending.<br><br>Unlike Cruise's last sci-fi film \"Oblivion\", this is definitely an action movie. At first glance it may look like a generic sci-fi action film - and granted, sometimes (suits, aliens) it does - but there's enough personality of its own. Action looks good and the camera doesn't shake around senselessly. Also, the action never goes into that overblown mode where your senses get tired and you just don't care anymore. Well done.<br><br>\"Edge of tomorrow\" is a thoroughly entertaining film. It's \"just\" a summer movie, but it's a smart, fun and exciting summer movie. You don't have to make excuses for its shortcomings to enjoy it. It's quality filmmaking and certainly a positive surprise.<br><br>9/10, will buy on blu-ray. I recommend this to everyone. Avoid as much spoilers as you can.","user":"Tehmeh","rank":[568,664]},{"title":"\"You see this isn't the first time that we've had this conversation. \"","rating":10,"date":"3 June 2014","review":"Why do we go to the movies? To be entertained, to laugh, to be amused, to be pulled into situations that are far from ever happening to us. The only certainty in today's film world that the film that you pick to watch in cinema is Tom Cruise. If you go into cinema and see any of Cruise's films you can be damn sure that that film won't disappoint you. Tom Cruise sure picks great projects. Frankly, I have to say that I haven't seen a bad film starring Tom Cruise.<br><br>Edge of Tomorrow is described by the director himself as \"Groundhog Day meets Starship Troopers\". The former mentioned is actually quite important since the trailers made this film look pretty dark, which is not the case. This is fun action film with lots of humor. Humor that perfectly fits this film. The time-loop allows the Cruise's Colonel Cage to remember exactly the situation he repeats over and over, which is many times very funny. At films with time-loop I am alway worried that the film might get repetitive. Well you don't have to when Doug Liman is at helm. The film has no time to get repetitive when it is moving at such fast pace. An action scene follows an actions and the scope is just mind blowing. This film packs in so much in just two hours. Other films usually keep the best scenes for the big finale. In Edge of Tomorrow all the action scenes are the best scenes of the film.<br><br>Tom Cruise doesn't act as his usual self here, he plays against type. He always tries to come up with something new in his films. So in what role you haven't seen him yet? A wimpy coward. He once again shows what a versatile actor he is. Emily Blunt, as the kick ass Rita, has never been more likable in any of her films than here. she handles the action and the drama perfectly. Bill Paxton mostly just repeats his commands and lines about victory, but he is just so great at that he ends up as one of the funniest characters in the film <br><br>To me this comes as no surprise, that Edge of Tomorrow is yet another sci-fi Tom Cruise film, which kick ass from start to finish. What roller-coaster ride! This will be hard to top in the upcoming summer season. There is nothing wrong with this film. It's got everything. Even a helicopter crash!","user":"jan_kalina","rank":[286,345]}]