[{"title":"Deeply Unsettling!","rating":9,"date":"15 January 2012","review":"This somber yet deeply unsettling film managed to give me the willies even in the less-than-ideal Horrorhound Weekend screening.<br><br>Not soon after a pregnant woman (Katie Parker) declares her missing husband (Morgan Peter Brown) legally dead, she begins to having terrifying visions that hint that maybe she spoke too quickly. Writer/director Flanagan pulls off an incredible feat with this film. He manages to reinvent the ghost story, then takes it to an unexpected, even creepier place.<br><br>Don't be fooled by the show-burn pacing, because the almost-suffocating tension had me squirming in my seat, forgetting to breathe. <br><br>It's been almost a year since I've seen ABSENTIA. What haunts me most is not the disturbing visuals or even the deeply unsettling story line. It's the mood. When I simply think about the title, I hear in my head its stark, two-note funeral organ score and my chest wells up with emotions not usually incurred by watching a horror movie: grief, loss and perhaps the most terrifying of allthe dread of inevitability.<br><br>Toss in a pitch perfect cast, including a heart-wrenching cameo from the always delicious Doug Jones, and BOOM! You've got my favorite horror movie of 2011.","user":"PatrickTheRedMenace","rank":[96,127]},{"title":"A standout horror film","rating":10,"date":"5 March 2012","review":"I don't write reviews much, in fact, I haven't done so since David Lynch's Lost Highway back in the 90's but having just seen ABSENTIA I felt obligated to share my thoughts.<br><br>This is an amazing horror/thriller. I cannot fathom how a director working on a minuscule budget can produce a film of this quality. The writing, photography and direction are absolutely first-class. The film generates a remarkably claustrophobic atmosphere and the actors, albeit amateur give incredible and heartfelt performances.<br><br>The film tells the story of two sisters, Tricia (heavily pregnant) and the other, Callie who is returning from an extended trip. The main plot involves the disappearance of the Trisha's husband seven years prior. She is just starting to heal, working to declare him legally dead and looking towards the birth of her child. Then things change.<br><br>To give anything else away would be unforgivable, but let's just say that Tricia's husband is not the only person to go missing in the neighborhood in recent times. Don't worry about that statement...this is not some dopey, clichéd serial killer film, this is something completely different. It's a mystery. Is the husband dead or alive and what is the meaning of the unusual things that Callie begins to see inside the nearby freeway underpass ? The film is hard to classify into a specific genre. It's part horror, part thriller, part scifi and utterly engrossing.<br><br>If you enjoy thrillers give this film a go. Forget the fact that it was made on a dime.. every aspect of it from the story, acting right through to a wonderful soundtrack guarantees you will have a great time with it.<br><br>I'm hoping that the director, Mike Flanagan gets noticed in a big way as a result of Absentia and someone throws him a team and a budget. If he can make a film this good on a tiny budget I can only imagine what he could do with more money.","user":"tv2-194-495681","rank":[119,168]},{"title":"Very Good Low Budget Horror","rating":9,"date":"5 February 2012","review":"If you come to this expecting something along the lines of Saw then you will be disappointed. It is a fairly slow moving, character driven, existential horror. That said, there are a good number of scares and tense, edge of your seat scenes. <br><br>It is well done - good cinematography, acting, soundtrack and story. Hopefully the director will continue the good work on his next film, from the decent way the characters were written and top notch direction (for what I guess was a small budget)this is a truly excellent movie. <br><br>Well done to all involved.<br><br>Highly recommended.","user":"ronnybrown1982","rank":[86,122]}]