[{"title":"A harrowingly realistic portrayal of torture and murder","rating":3,"date":"3 October 2011","review":"Snowtown is probably the most disturbing movie I have ever seen. (Note: To back that statement up, I have watched most so called 'torture-porn' flicks, including hard-edged foreign stuff like Martyrs and Audition.)<br><br>Unlike the vast majority of horror films, Snowtown depicts torture and murder in a way that is almost documentary-like - nothing is sensationalized, which makes it all the more horrific. You are essentially a fly-on-the-wall during a real-life murder. The strangulation scene in the bath tub is almost unwatchable - and it seems to go on forever.<br><br>I found it incredibly hard to watch and it has seriously shaken me to my core. Cinema is supposed to affect us, and Snowtown certainly did, which is why I've given it 10/10.","user":"seth_isurus","rank":[94,111]},{"title":"Chilling","rating":10,"date":"19 June 2011","review":"I don't understand why people are coming down on this film, i thought it was amazing and spectacularly represented the emotions of the people involved rather than the actions. I am glad it didn't go into all the violence into more detail even though i know the real killings were worse than depicted in the film. I think that it was not the intention of the director to have another gory wolf creek serial killer story. <br><br>I had not heard any hype about the young actor looking like heath ledger until now but had commented to my partner a few times in the movie how striking the similarity was!<br><br>I loved this film and thought it was well directed and have no idea how the actors got through some of those scenes.. well done.","user":"helraiza","rank":[77,97]},{"title":"Eye opening, shocking and brilliant... it made \"This Is England\" look like a Disney film.","rating":8,"date":"17 January 2012","review":"This is not like any other film I've seen before, I think that it would be an understatement to say that this film was chilling and eye opening. This film terrified me, and amazed me in it's brilliance. <br><br>I don't know where to begin, but when I think back to this film I remember how I'd felt while watching it, which is also something I can't even begin to describe. I never write reviews but for this one I felt I should just because I believe that a lot of people pass on watching films that don't have a rating above 7/10. But this film, definitely deserves to be watched. <br><br>At the time when I watched the film, I only found out afterwards that it was a true story. And you won't believe how little difference that made to how I already felt, because it was that powerful already. I felt terrified, and I'm not the one to be 'scared' easily, but you should've seen what it did to people who do get scared. This film like many other brilliant films has left me with something to think about afterwards, but unlike any other movie I've ever seen before, Snowtown gave me a slap across the face to open my eyes to an obvious truth. And it felt harsh to realize it, as it probably did for anyone who's seen Snowtown. It's that murderers exist, and yes it's no surprise, but this film showed me just how desensitized we all are to murders, serial killers. That's why watching this film felt like I'd experienced something. It's like that same exciting feeling you get when you watch Avatar and you're 'experiencing' the 3-D aspects, but for this you're exhilarated and experiencing something so f\"cked up and real. It made \"This Is England\" look like a Disney film. This is actually a quote that seemed to best summarize what we all felt as me and about 8 other people discussed the film outside the cinema. And we could still hear a hint of fear in our laughter then. <br><br>It wasn't just another film. I've been inspired by how realistic the scenes are, I can't imagine that it was just scripted scenes, it truly felt all real. The actor that played the killer was the most terrifying character or man I've ever seen on film. You must watch this, a lot of people have become obsessed with this film, and it definitely deserves a higher rating.","user":"gill_hathaway","rank":[38,50]}]