[{"title":"Martyrs (2015)","rating":4,"date":"7 May 2016","review":"Even though I watched the original Martyrs various years ago, it's a film which is impossible to forget. That's why I knew beforehand that its North American remake would never reach the same levels of violence, intensity and anguish reached by the French version... something I would have tolerated if co-directors Kevin and Michael Goetz had respected the spirit of that brilliant film and its overwhelming atmosphere of cruelty and hopelessness. Unfortunately, that was the first thing which got lost in this \"light\" version, which could basically be considered \"PG-13\" if it wasn't for some moderately bloody scenes, which could have been eliminated without any problem, because they don't fix all the things which were decomposed in this diluted interpretation. And that's where my comparison between both versions ends because, to be fair, Martyrs (2008) didn't receive too much diffusion, and I estimate that Martyrs (2015) will be a novelty for many spectators, so I will do my best to evaluate it on its own merits. I found it a bad film, but I will at least grant it that courtesy. To start with, I found the screenplay of Martyrs (2015) poorly written, specially during the second half, when something happens which brusquely alters the premise and introduces absurd concepts, until getting to an insipid conclusion. Among the very few positive things I can say about this remake, I can mention the decent performances from Troian Bellisario and Bailey Noble. Despite them, I found Martyrs (2015) an absolute waste of time. Even taking it as an individual horror film, it's an absolute failure. Anyway... I hope the next step isn't some remake of À l'intérieur suitable for the family schedule of Lifetime.","user":"Argemaluco","rank":[27,27]},{"title":"Yet another pointless remake that is completely inferior to the original.","rating":2,"date":"10 December 2016","review":"Martyrs (2016) is yet another pointless remake that is completely inferior to the original. Have you ever heard one of those trashy Kidz Bop covers of a pretty good song? This remake is like a Kidz Bop version of a heavy-metal song. The entire movie just put a foul stench in my mouth. It is neutered down to its core. There isn't anything disturbing, horrifying, or shocking like there was in the original. Hell, there isn't even a lot of blood in this one. It's hard to just simply describe how horrible it is, so I'll just use another analogy. Let's say the class genius is taking a test, right? So the big class goofball decides to sit down next to him and cheat off his test. He copies most of the test, but then there's the essay section. The smart kid is moving along with it, writing in his own unique way. The catch is that he writes really fast. So the dumbo has to quickly copy down everything he's writing. After they finish, the smart kid has a pretty good essay but it's not his best work. The noodlehead kid has an incomprehensible copy of the smart kid's essay, so much so that sentences are out of order, and the essay prompt isn't even answered. Even if you take the original out of the equation and call this remake an original movie, it's still garbage. One of the saddest attempts at a remake I have ever seen.","user":"PeterLormeReviews","rank":[38,40]},{"title":"A polished, well-executed turd is still a turd","rating":2,"date":"6 October 2016","review":"I have to start off by saying that I believe that the French version of the film is the most depression, soul-wretchingly horrific movie I have ever seen in my life. It is a masterpiece in the use of atmosphere, nuance, and tact in horror film-making, and will most likely not be topped as a horror film for quite some time. This Blumhouse version is NONE OF THAT. Imagine if someone told you that France has the best burger you have ever tasted. You want to eat it so bad, but you don't want to travel to France or learn to read the menu at the restaurant because you are lazy. You wait for an American chef to create the same burger, but the meat is dry, it has no lettuce, tomatoes or pickles, and the condiments lack taste. That is exactly what you are getting with this remake. It is tasteless, like New York BBQ is tasteless compared to Texas BBQ. Like Taco Bell is compared to REAL Mexican Tacos. It lacks any redeemable elements that would make it palatable for anyone over the age of 14, and who has a more refined palette. It is simply a hollow imitation of the French film. It tries so hard to shock and disturb, but in the end, it just makes you feel sorry for everyone involved. People woke up and went to work for this. They have their names attached to the credits. It will be a film they will be forced to use on their resume. It just makes me sad that production companies like Blumhouse can outright spit on real artistry in the name of profit margins. Blumhouse, you are the worst thing to happen to horror movies since the advent of Found-footage. You have ruined one of the most definitive horror experiences since The Exorcist, and your whole company should be ashamed of yourselves.<br><br>This film was absolute garbage and an insult to horror films. We will never speak of it again, and never within the same sentence as the original. A complete and utter failure, it should not be seen by anyone. It is, without a doubt, one of the worst films ever made, regardless of genre.","user":"manuelasaez","rank":[35,37]}]