[{"title":"Very enjoyable mystery thriller","rating":7,"date":"7 April 2012","review":"Entitled takes your basic movie kidnapping ransom plot and freshens it up through good acting, plot twists and accessibility.<br><br>Excellent casting. Each actor felt natural in their part and with some restraint to avoid overacting they gel nicely. The first character death is almost welcome due to the annoyance of his behavior.<br><br>Here's the best part of the movie: As the plot moves along and the viewer watches with anticipation of the stereotypical progression, we are happily dealt nice little twists. No twist is over the top or pushing the limits of belief. A subtle film noir feel is mixed with an everyman identification.<br><br>I'd like to see another movie like this one...","user":"scoup","rank":[21,26]},{"title":"100% better than expected!","rating":7,"date":"7 September 2011","review":"I watched this film with the fear that I was going to encounter yet another budget movie thrown together with a loose plot and mediocre acting. Well, needless to say, I was proved wrong on all counts. The background story was built up nicely and the plot laid out for you to see clearly, but then it twists and makes you think, then twists again making you doubt your theories of what is really going on. Liotta, Garber and McHattie were brilliant and worked perfectly together. I wouldn't mind seeing this trio working together in the future. Dustin Milligan was a surprisingly competent and believable actor which was a breath of fresh air as I don't recall ever seeing him in film before now. All in all a very good thriller/suspense that kept me entertained. Give it a watch is all I can say, hope this helps!","user":"jack000-3","rank":[28,36]},{"title":"A good cast, plot & acting make it a good movie, but not great. I liked it a lot, could've been a little better though. I say B+","rating":4,"date":"4 September 2011","review":"\"I played by the rules. I wanted to play by the rules, but that's the big lie. It's not enough anymore so maybe, just once, you gotta break them...right?\" After Paul (Zegers) gets turned down for a job and his sick mom gets a foreclosure notice on the house he becomes desperate. His plan is to kidnap three kids of rich families and hold them for a million each. When the plan goes wrong he must find a way to stay clean and get the money. This is a very surprising movie. This is the type of movie where you put it because of the cast and end up really enjoying it. I'm not saying this is an Oscar type movie, but it is very entertaining and fun to watch. This movie also had an ending that fit the movie and is one that is hard to totally figure out before the reveal, which makes it that much better. A realistic look at what a kid on the edge can do if he is pushed. Very much worth watching. Overall, a very entertaining thriller that leaves you wondering who to pull for. I liked it a lot. I give it a B+.<br><br>Would I watch again? - I think I would, to catch clues about the ending.<br><br>*Also try - Endure &amp; Hostage","user":"cosmo_tiger","rank":[50,69]}]