[{"title":"Ge kunt de groete uut Brabant krijge kut!","rating":9,"date":"23 May 2011","review":"To understand a part of this movie you have to know a little history. I went to school in the 90's in Eindhoven, a city near the place were the movie takes place. In that time a lot of people dressed as the people in the movie, drove the Sita scooters and drive around in Opel brand cars pretending to be the tough guys. Those people were called Johnny and Anita's. Sneakers, sport clothing and the haircuts you see in the movie were all over the place. Those were great times as we laughed a lot at their stupidity and general behavior.<br><br>So basically the writers/actors use that background and show us that kind of attitude and fashion is still alive in Maaskantje (the town were everything takes place). The actors behave like the Johnny's and Anita's back then, talking with an accent commonly used in that region. They are rebels, aggressive and lazy.<br><br>The story itself is about all of them losing their jobs and when the bills get too much and they also lose their social security money, they decide no longer to pay their bills. Of course it gets them into trouble and their aggressive behavior gets them even more deeply into trouble, up to the point were the authorities have to step in...<br><br>The movie looks good in all. Some stuff is funnier then other parts of the movie. Some cameo-appearances of (in)famous Dutch people. The actors are well know for their short video's from earlier New Kids and the Pulp Show and a lot of things will seem familiar looking at them and the movie.<br><br>I had a great laugh, it's an entertaining movie but don't have great expectations watching it. Over 1 million people went to the cinema to see this movie and it's a big hit in Germany too. The German translation is hilarious since the real actors dubbed it, not stopped by their lack of speaking German! It is no wonder this movie scores big time in Germany after movies like 'Manta Manta' and 'Manta the movie'...<br><br>ps don't watch this movie if you are a cop!","user":"Knighthawk701","rank":[45,56]},{"title":"Very great fun","rating":8,"date":"12 December 2010","review":"Just went to see it and I have to admit, the movie exceeded expectations tremendously. Having seen the sketches in before (and liking them a lot) I was really concerned that transforming this to a feature length movie would not work. I stand corrected.<br><br>The story is quite thin, but that's not bad. The five main characters all loose their job on the same day and then decide not to pay for anything at all any more. With the rest of the country following their example the economy collapses. The government tries to put them in prison for it (but fails horribly) resulting in what the guys do best, putting up some sketch and making the whole audience laugh.<br><br>There's one very bad point in the movie. (This is where the spoiler comes). It's the part where Reinout Oerlemans \"walks in\", declaring that the budget for the movie is spent and the cast just have to tell you the story. They really should not have done that.<br><br>Apart from that, just sit back and enjoy the ride. Oh, and if you don't like the \"New Kids\" sketches on youtube, don't bother. You won't like the movie. If you're not familiar with those, find some especially the one with \"the red one (die rooie)\" and then decide. If you like them, go see it.","user":"lpwevers","rank":[44,60]},{"title":"great movie! don't listen to those other comments","rating":10,"date":"17 June 2011","review":"First of all, I am an American. <br><br>And I enjoyed this movie very much. This is not a comedy for simpletons.. Yet they will enjoy it as well. <br><br>I think the acting was very good, (spot on!) and portrayed the characters just as they should have been. I loved how the characters dressed in outfits circa 1990's and followed failed trends of Americans. <br><br>There are a lot of smart jokes if you're quick enough to catch on, if not - there are plenty, and I mean plenty of crude humored situations as well. <br><br>I don't see how you can miss the entire story-line, but there is a story, and it comes together incredibly. Definitely different from the norm as far as stories and characters go.<br><br>I found this movie to be very clever and entertaining. I could not stop laughing throughout..","user":"travis-higgins","rank":[26,35]}]