[{"title":"A real gem!","rating":9,"date":"18 September 2012","review":"Hannah Arendt (2012) <br><br>Few movies based on historical figures manage to combine a good sense of character with a first-rate story. Hannah Arendt is an exception. It is directed by Margarethe von Trotta, who had focused on such diverse (and strong) women of history as the nun and mystic Hildegard von Bingen and the leftist revolutionary Rosa Luxemburg. Her latest film is the story of one key episode in the life of Hannah Arendt, the German-American philosopher and political theorist. But Hannah Arendt transcends the bounds of \"feminist\" filmmaking. It is a work that puts before the viewer key questions about the nature of evil, about acceptance of authority, and about personal responsibility. At the same time it is a fine piece of storytelling.<br><br>Arendt was a German Jew who had studied under the noted philosopher Martin Heidegger, and who had a romantic relationship with him that soured when the Nazis came to power and Heidegger publicly supported them. She soon left Germany for France but in 1940 was imprisoned by the Vichy regime in the detention camp in Gurs. Escaping after a few weeks imprisonment, she fled with her husband to the U.S. Throughout and after the war she was active in Jewish causes, including the Zionist movement. In the 1950s she began a career of writing and teaching, which included appointments at such universities as Princeton, Yale and the University of Chicago. She became noted for two popular books, The Origins of Totalitarianism and The Human Condition.<br><br>The film deals with one short period in her life, Arendt's reporting on the 1961 Adolf Eichmann trial in Jerusalem for the New Yorker magazine, coverage she later turned into a book. In here account she spoke of \"the banality of evil,\" evil done without thinking, because people were \"following orders.\" Arendt's suggestion was that Eichmann was evil not so much because he was a monster, but because he was a mindless bureaucrat. Although she did not disagree with the guilty verdict or Eichmann's hanging, she was critical of the conduct of the trial. Even more controversial was her submission that some Jewish leaders contributed to the magnitude of the Holocaust by their complicity with the authorities. While she recognized the futility of open rebellion, she suggested that less cooperation would at least have saved more lives. Such suggestions, especially coming from a prominent Jew, provoked a firestorm of criticism, and threatened both Arendt's career and lifelong friendships. The movie becomes not just about a single life, but about freedom of expression - the sometimes harsh clash between ideas and fixed opinions - and the great personal costs this can involve.<br><br>Still, a movie that focuses so much on one individual requires a superb piece of acting. Director von Trotta gets this from Barbara Sukowa, who played both Hildegard and Rosa Luxemburg in her earlier films. Sukowa brings to the screen not only a supremely intelligent woman, but a very principled and determined one. At the same time she portrays a woman who can be tender and compassionate, and understanding even of her detractors. To blend such widely divergent qualities is no easy task, but Sukowa succeeds in anchoring them securely in the character she plays. Axel Milberg as Heinrich Blücher, Arendt's husband, more reserved, but supportive and protective, is equally credible. Another solid performance comes from Janet McTeer as the political activist, author, and Hannah's steadfast friend, Mary McCarthy. Included also among her inner circle was her secretary, Lotte, played very sympathetically and competently by Julia Jentsch. Two longtime Jewish friends, one in New York, Hans Jonas, and another in Jerusalem (also her former teacher), Kurt Blumenfeld, are very well represented by Ulrich Noethen and Michael Degen. And a very unrepentant and unapologetic Martin Heidegger is played by Klaus Pohl.<br><br>In addition to good acting a film that deals with the realm of ideas also requires a finely tuned screenplay and talented direction so that it does not just show pictures of \"talking heads.\" Director von Trotta cooperated with Pam Katz on the script, and what they produced is obviously a labor of love. The situation of ideas against the background of such horrific concrete acts as genocide, and in particular against the showpiece trial of Eichmann, brings them into contact with the very real world. That reality is heightened by the decision not to dramatize Eichmann himself, but to show the genuine article as he appears in the TV footage of the trial. There is such genuine horror there, and yet such obvious banality, as to give Arendt's musings real weight.<br><br>In the end the film obliges the viewer to confront the questions Arendt is trying to raise. Are the roots of evil obvious or can they be far more subtle? Where does responsibility begin, and who in a society must take responsibility for the acts of the whole body? The film does not preach, but it certainly raises vital questions. A real gem! Hannah Arendt premiered at the Toronto International Film Festival on September 11, 2012. The movie will go into general release on January 17, 2013.","user":"laheyray","rank":[85,94]},{"title":"brave film with intellectual challenges","rating":10,"date":"23 January 2013","review":"Margarethe von Trotta's Hannah Arendt is a film about thinking. Moreover, it's in favour of it. It so values thinking that it offers some elegant speeches and debate, sans computer generated spectaculars. <br><br>Barbara Sukowa portrays the German Jewish philosopher during the period she covered the Adolf Eichmann trial in Israel for The New Yorker. The film confronts the controversy Arendt raised when (i) she redefined Eichmann not as a monster but as an ordinary nobody, exemplifying \"the banality of evil,\" (ii) she reported that some Jews collaborated with the Nazis, resulting in more deaths than chaos would have caused, and (iii) she said she loves her friends but not any \"people,\" in this case, the Jews. On all three counts she was condemned for abandoning her people. Today, at a remove from the heat of that moment, she was clearly correct on all counts. For more see www.yacowar.blogspot.com.<br><br>Not loving the Jews was not being anti-Semitic but refusing to emotionalize her consideration of the issues. Arendt was opposed to the blanket love of any group of people, not based on personal engagement, because such nationalist or other group identification precluded the thoughtful consideration of any issues around them. She most valued a rational, thoughtful approach that was not prejudged or proscribed by any -ism or convention. As for some Jews' collaboration, she simply reported facts that arose at the trial. (Indeed, Rudolf van den Berg's new film Suskind details precisely that collaboration.) Nor was that observation anti-Semitic, for the possibly well-intentioned collaboration in the face of horrid danger is a plausible response among any people. Arendt was pilloried for facing the facts and for rejecting myths. That's what historians are required to do and apparently what philosophers periodically have to remind them to do.","user":"maurice_yacowar","rank":[77,86]},{"title":"Missing history from \"Hannah Arendt\"","rating":6,"date":"16 July 2013","review":"The film \"Hannah Arendt\" depicts an intriguing and contradictory intellectual but avoids examining the political core of the famous controversy it recounts. Arendt stirred a furor with her 1963 writings on the Israeli government's trial in Jerusalem of the Nazi Adolf Eichmann. She characterized Eichmann, who had organized the transport of European Jews to the death camps, as a banal bureaucrat rather than a singular monster. She wrote that European Jewish leaders, too, were responsible, by administering submission to the Nazis when even futile resistance and chaos might have allowed more Jews to survive. The public attacks on Arendt are shown. She was pilloried, particularly by Jewish intellectuals, as an unfeeling Nazi sympathizer and self-hating Jew. The New School's move to fire her is also enacted. <br><br>But the film, which shows Arendt as shocked to learn that she has hurt the feelings of many Jews, including long-time friends, does not reveal that she had broken with the Zionist leaders in 1942 when they called for a Jewish state rather than the bi-national Palestine she supported. The Zionists opposed measures to rescue Jews from the Nazis other than those that herded them to Palestine. They claimed, however, that their takeover of Palestine was all about saving Jews from a unique evil -- a claim unchallenged by most liberals as well as the Stalinist left. Arendt's analysis hit the Zionists' guilty conscience and undermined the rationale for their nationalist project. The film ignores these crucial political elements, and presents Arendt's strong defender and friend only as novelist \"Mary\" without disclosing that Mary McCarthy was an anti-Stalinist and anti-Zionist who called Zionism the \"Jewish final solution.\" <br><br>Director Margarethe von Trotta's failure to explore this relevant history leaves her film interesting but superficial when it could have been brave and timely. Arendt's famous topic, thoughtless compliance with evildoers in power, needs our attention today more than ever. Fifty years after the \"Banality of Evil\" controversy, U.S. liberals and progressives are blindly uncritical of a leader who spies on millions and remotely executes foreigners and citizens in the name of national security. A militarily mighty Zionist state is still free to massacre innocents, shielded by this unquestioned U.S. power and the old sacred cow that Israel is the only safe haven for Jews. Arendt might have had some juicy comments about the \"banality of filmmaking.\"<br><br>Rita Freed","user":"freeds","rank":[102,121]}]