[{"title":"Really wish there was a second and third movie","rating":10,"date":"13 June 2019","review":"I love this movie so much. The first time I watched it with a friend, we jumped back in the movie so many times to rewatch all our favourite parts over and over again.\nI've watched it a couple of times, and I still like it so so much. I've always liked spy movies. Growing up watching Bond. This movie is fun and clever and it's just a great movie. I might just go and rewatch it right now actually.<br><br>Yes, I know this review is stupid positive. But when you find a movie that you can enjoy without finding any big mistakes or things you get annoyed about, you just have to feel happy.","user":"elin-95794","rank":[64,65]},{"title":"\"When you hear something that sounds like a gunshot, drive.\"","rating":8,"date":"29 February 2016","review":"Never watched the show, so can't compare the two, or whether or not this is a faithful adaptation of it or not, but I loved this film. It perfectly rides the fine line between straight 1960s spy movie throwback, and satire of one.<br><br>Villain is pure 1960s vamp/ femme fatale, Henry Cavill and Armie Hammer's chemistry alone makes this worth watching. Hammer's twitch as his anger reaches boiling point is a great bit of detail. Cavill really reminded me of Roger Moore's Bond, specifically from The Spy Who Loved Me. He has a suave, \"Trust me, I know what I'm doing\" attitude throughout.<br><br>Several scenes creatively have the action taking place in the background, while the focus is on the foreground. A perfect example, and maybe my favourite scene in the film, is Cavill sitting in a truck, basically picnicking, with a large sandwich and bottle of Chianti, while boat chase is playing out in front of him, reflected on the windscreen.<br><br>The film is rated PG13, but it doesn't look watered down to get that rating, ... Henchman's electrocution torture scene was both graphic and simultaneously funny- another case of the action playing out in the background, while Cavill and Hammer debate the fate while in the next room.<br><br>The plot is a bit of a mess, especially toward the end, but a great cast, sharp dialogue, and great attention to detail, and good action makes this a winner","user":"Zbigniew_Krycsiwiki","rank":[86,94]},{"title":"Man of Cool...","rating":9,"date":"12 August 2015","review":"Towards the end of the movie, Henry Cavill's Napoleon Solo asks, \"How's THAT for entertainment?\" (when teaching the movie's villain a lesson about monologuing), and my answer regarding this movie would have to echo Waverly's \"very good\", as this film manages to out-Bond the last two actual Bond films. While it might be the unpopular opinion, I in fact enjoyed Guy Ritchie's two Sherlock Holmes films and so decided to give this a chance, knowing nothing about the original TV series this movie was based on and going in with no preconceived notions. One thing that sets it apart from other recent spy thrillers is it staying set in the 60s time period and not being \"modernised\". From the opening \"spy jazz\" music, it sets the tone for what will be a fun ride. Ritchie's unique directing style fits perfectly with this slick/stylish film and he proves once again to have the right touch when it comes to blending humor with serious moments (one example being in the most morbidly amusing torture sequence I've seen since Bond's in Casino Royale). Whilst there are \"talky\" moments and occasions where the camera lingers on a shot for a solid moment, which those with impatience may grow restless during, there's also action (but not such that it's overkill) mixed with humour, some emotional beats and even the odd sexy moment. It all combines extremely well.<br><br>Interestingly, as has been noted elsewhere, the main cast aren't using their own accents for their roles, with Brit Henry Cavill playing the American Napoleon Solo, American Armie Hammer playing Russian Illya Kuryakin and Swede Alicia Vikander as German Gaby Teller. Cavill, who I found dull/a bore in Man of Steel (then again, I felt that way about the film as a whole save for Antje Traue's Faora), is far better utilised as the suave/cool Solo here (which now brings the tally of cool movie characters by the name of 'Solo' to TWO - the other being...hmm, let's think...). He oozes charm, confidence, elegance - all those words that make up the definition of 'suave' - and has some great reactions. One scene I particularly liked was him just chilling, with a sandwich and bottle of vino in a truck he commandeered, as his newly assigned partner was attempting to escape some baddies in a boat. Just when you think Solo's almost heartless, he shows he's become quite attached to the Russian with anger management issues and does something nice for him (when they're not exchanging spy bugs or ramming each other through toilet stalls Casino Royale-style). As expected, they spend the majority of the film begrudgingly working alongside each other, bantering/arguing and showing each other up. Illya might be almost superhuman in strength and have the fancy fence-cutting tools, but Solo has the expertise breaking into vaults undetected...almost. Armie Hammer's better served here partnered with Cavill than he was with Depp in The Lone Ranger. The two play well off each other and have a nice fun dynamic. It also must be noted (since everyone's pointed it out regarding Tom Cruise in M:I 5) that while this film has a lot of stunts, both Cavill and Hammer took part in them, with the latter apparently giving his stunt double \"hardly a chance to do anything because he's out there doing it all by himself\". <br><br>2015 seems the year of the Awesome Swedes, as Alicia Vikander joins M:I 5's Rebecca Ferguson in making quite the memorable impression on screen. Apart from some rough-and-tumble with Illya, Vikander's Gaby sadly doesn't get to kick as much butt as the aforementioned Ferguson, but still proves hard to look away from when she's on screen (partly because she's dressed in eye-catching 60s fashion - which, along with the film's score/use of songs, goes a long way to creating the right 'mood' for the film - but also because she's awesome in other ways). Her character, a mechanic at the start of the film, soon finds herself in the thick of the action during a great chase scene featuring her at the wheel, with Solo in the back seat and the then unknown to them Illya in hot pursuit (a fantastic sequence, with the directing, music, acting all flowing together seamlessly...and manual window winders used for great comedic effect). Vikander has interesting/fun dynamics with Cavill and Hammer, showing some different sides to her character (one instance being in an amusing dance sequence) whilst also proving smart/helpful and that there's a bit more to her than you might first expect. This trio of characters are a large part of what makes the film as good as it is. Elizabeth Debicki plays the icy cold Victoria to the best of her ability, although there's not that much going on with her that one wouldn't already suspect. Hugh Grant and Jared Harris are both good in their small parts. Playing Gaby's Uncle Rudi, Sylvester Groth is quite memorable in his role.<br><br>While in his Sherlock Holmes movies Ritchie showed us in slow detail what Sherlock was going to do to his opponents (so we could actually *see* it/make sense of it before everything sped back up and he moved in a blur), it's sort of the opposite here, where we flashback to things we might've missed, little details and such, that are later filled in for us and thus make sense. The use of split screen is also something he seems quite fond of, walking the line between being used effectively and overuse. It proves an extra flourish to an already very stylised film. I enjoyed this origin film of sorts for the team made up of our three main characters - who hopefully we'll get to see more of in a sequel, as this ended up being a pleasantly surprising addition to the spy film genre. For extra background info about the characters, as well as to learn what the acronym U.N.C.L.E. stands for, make sure to watch the stylish end credits.","user":"Chalice_Of_Evil","rank":[192,246]}]