[{"title":"Complex and ambitious and interesting, but it gets forced, too","rating":7,"date":"23 March 2013","review":"360 (2011)<br><br>In many ways this is a fabulous movie--complex, warm, chilling, even poignant. It's meant to be an almost serious look at contemporary relationships, including sexual ones with prostitutes, affairs with fellow workers, quickies with someone new, and long term loves between married husband and wife. It works overall, sometimes really well.<br><br>Because of its seriousness you might notice a few scenes where things are pushed a little hard. The main one of these is when a Brazilian girl comes on hard to a recently released sex offender in an airport after moments before being put off by him and having plans to meet someone else for a polite drink. At first it's improbable, then the writers decide to push the encounter harder and harder until it becomes extreme and sensationalist. Too bad, because in other parts of the movie the extremes--such as a prostitute getting started through sleazy photographer listing her on the web, even though she has zero experience--get pulled off with conviction. Not that most of us know the ins and outs of that world.<br><br>There are too many characters to make things clear here, but it's worth saying that Anthony Hopkins again shows how he can command a scene like no one else in the film. His monologue at an AA meeting is a short masterpiece, and his performance in general is almost enough to justify seeing the film all by itself.<br><br>Other characters are excellent, including Jude Law in a restrained part as a married businessman looking for some action on the road. (His wife has her own affair in full swing.) Yeah, come to think of it, there is a lot of infidelity going on here. The one sincere relationship is another unlikely moment, with a sweet girl going off with a somewhat mixed up Russian in a Mercedes (and she leaves her bag on her park bench for no good reason, she's not in a hurry). But hey, all of these things are happening so rapidly and with so much overlap, who knows? It even includes many cases of split screens reaching three or four simultaneous panels at times.<br><br>You start to see how the world works for some people in a contemporary way. It's sordid on some level, filled with deceit and sadness. But it's also believable, at least for this certain urban, footloose set. I assume the title means that it all comes around full circle somehow, that we're all in the same big boat. Watch with attention. The characters are all distinctive but there are a lot of them. The director, Fernando Meirelles, is ambitious, for sure, but he made of the most highly regarded films of recent years, \"City of God,\" so this is worth watching even just for that connection. \"360\" is limited and flawed by comparison, but it's better (I think) than its rating might let on.","user":"secondtake","rank":[21,25]},{"title":"a pleasant surprise","rating":8,"date":"15 July 2012","review":"I ran across 360 by chance and really enjoyed it. Yet, when searching for more information in internet the generic title proved difficult to google. After some clicking things started to unfold: the same author directed City of God and the movie is a loose adaptation of one Arthur Schnitzler's play. Although i can't say much about the latter, the former impressed me even more since i've enjoyed that movie, as well.<br><br>The cast is brilliant with famous actors popping in and out of view and blending discreetly with otherwise great performance of less known colleagues. We effortlessly move with them across cities, countries and continents as it otherwise is the case in globally interconnected world at the start of the 21st century.<br><br>The more i think about 360 the more interesting details i discover in retrospect. Probably the strongest message is that there is a good seed even in the worst of us. The other is that we all eventually get what we want but some of us also get what they deserve.<br><br>What i particularly enjoyed is that a lot of things are either foreshadowed or left unsaid. This gives room for viewer's imagination to kick in, which, in turn, is rather uncommon in the era of realism and boredom in movies with artistic tendencies.<br><br>To sum it up, the only reason my vote is two stars shy of the best note is that i understand how this kind of movie might not be everyone's cup of tea.","user":"dragokin","rank":[56,74]},{"title":"Better than expected, with its approach to \"global\", disconnected, modern life","rating":7,"date":"13 August 2014","review":"Movies linking different stories taking place all over the world are usually are praised for the interweaving plot coming together with some big revelation. Think about Babel, universally praised for mixing intercontinental tragedy. I liked it moderately, as it was a bit too gloomy, and I would not put it in my top-ten list.<br><br>On the other hand, 360 working on a similar take, was vilified almost unanimously. On a different merry-go-round we have the stories of an English businessman ready to stray with a prostitute in Vienna, while his wife is already straying in London with a Brazilian guy, whose fiancée is dumping him for said infidelity and traveling back home, etc Since the prostitute is having her photos taken by a photographer for her online advert, the movie starts and finishes with a girl entering the study, thus coming round 360 degrees. A couple of stories are quite weak, such as the Brazilian girl meeting a sex offender en route to Brazil and the prostitute's sister running away with a stranger. However, compared to Babel what is missing here is mega tragedy and that is exactly what made Babel so pretentious, with its existentialist grandeur.<br><br>Therefore, I liked 360 better because its characters are more \"normal\" – except, perhaps, the Russian mobsters – and their lives are not experiencing huge calamities. They just change or adjust slightly. I guess that was not liked by the critics (and public). Nowadays, a level of extra-drama seems to be required in ever massive doses to relieve with excitement our numbed existences  at least for a couple of hours.","user":"dierregi","rank":[7,7]}]