[{"title":"Brilliant movie! Absolutely loved it!","rating":10,"date":"28 August 2012","review":"I watched this movie not expecting anything great, taking in consideration its very low IMDb rating. It completely proved me wrong, and it absolutely made my day. It was funny, charming, and full of really great moments. I loved the fact that the movie was following more than one relationship. It has a great storyline. The characters are great, and all the couples in the movie have great chemistry between them. Even though Cedric was the funniest character in the movie, all the others always had something pretty funny to say. I loved seeing Turtle in something else besides Entourage, he's a really great actor. The soundtrack is also amazing. I would definitely recommend this to all my friends.","user":"niovi_555","rank":[21,27]},{"title":"Amazing feel good movie","rating":10,"date":"26 August 2012","review":"Don't be put off by the low ratings. So far the movie has only been rated 6700 times which isn't really enough for it to shadow the minority ratings. <br><br>I suspect there's been a lot of men who aren't into these types of movies that have been forced to watch it with their girlfriends and have then given it low ratings because it definitely leans towards being more of a soppy romantic comedy than a gritty one.<br><br>It's definitely not a 'fairy-tale soppy romantic' movie by any means. I would class it as having a realistic amount of soppyness which is what makes it good. <br><br>The main cast are pretty diverse in their personalities so most people will be able to relate to someone in the movie, but even if you can't it's got enough comedy/fun in it to keep you entertained.<br><br>I think racially this movie is fantastic and it makes a lot of very positive statements. We have a mostly black cast with a very middle class Friends(TV series)'ish feel to them with 2 white guys in the group, 1 of whom has a black girlfriend. <br><br>There's a couple of light racially inspired jokes at the expense of one of the white guys in the group which further emphasises that race just isn't and shouldn't be a serious issue in the group.<br><br>It's really nice to see a movie like this with a nice intelligent middle-class group of African Americans. Too many movies focus on the gangster element of African American culture these days, so I think this is a really positive and refreshing movie.<br><br>I definitely recommend it to everyone except those who are put off by a bit of soppy romance.","user":"bynari-1","rank":[37,51]},{"title":"Can't believe the rating is so low","rating":9,"date":"6 May 2012","review":"Friend of mine referred me to this movie to go see with my girl. I saw the rating on IMDb and was hesitant. However, he insisted, so I went for it.<br><br>The movie is funny as hell. It may run for two hours but for me and my girl it passed by quickly; there's always something going on keeping you interested or making you laugh. <br><br>I don't need to write a detailed review. If you're hesitant, don't be...it's worth it!<br><br>PS I'd really give this movie an 8, but I feel like the current rating is way too low. <br><br>Another PS: I'm not black!","user":"mohammed-helal-eng","rank":[53,80]}]