[{"title":"Not a great movie, but a must-see for fans of the classic show.","rating":7,"date":"28 January 2016","review":"Entourage isn't a very good movie. It's hard to even call it a movie because it's basically Entourage season 9 crammed into an hour and a half theatrical film. It picks up right where the show left off and continues with the same subtle banter humor and Ari Gold proving again why he's one of the best characters ever written. People who haven't seen the show will be confused, or at least bored, with the characters because they really have no development throughout this movie. There are simply too many characters to make a movie like this work. A mini-series? Absolutely. It would've been great to flesh out some of these subplots with multiple episodes. But a feature film? It doesn't quite work.<br><br>The entourage are up to their usual shenanigans. Vince wants to direct a movie, Drama wants to get his acting break, Turtle wants to go out with Ronda Rousey, and E is having a baby with Sloan. Ari's storyline is by far the most engaging. Being a studio head now, everything is riding on Vince's movie to perform well in order to save Ari's (and Vince's) reputation, and in order to do that he needs to get funds from two financiers from Texas - a father-son duo played to perfection by Billy Bob Thornton and Haley Joel Osment respectively. Oddly enough, I found their scenes to be the most interesting of the movie. Larsen (Thornton) sends his son Travis (Osment) to Hollywood with Ari to see the movie early and to ensure it's worth putting up the extra funds, and Ari LOATHES it. Some of the funniest scenes come from the stress these guys put on Ari and there are a couple classic Ari outbursts. What Thornton and Osment really bring to the movie is a reality check. Larsen only cares about money - he never watches the movies, he's simply an investor, so naturally he and Ari clash when it comes to defending Vince's artistic freedom. It was these moments where Entourage felt more like a movie. There was tension, conflict, and although the Texans are written as the villains, their motives are actually grounded and understandable, especially for a movie as extravagant and gratuitous as this.<br><br>To get the most out of Entourage, it must be seen directly after the show. It feels like the show never skipped a step. The writing is on point, the characters are the ones you know and love from before, and it has even more celebrity cameos (probably the most in any movie ever). I'd love to see an Entourage mini-series if they decide to continue this, but I was perfectly satisfied with this movie granting some closure to the group. There's even a priceless shot of the entourage walking down the red carpet with The Who's \"Eminence Front\" playing in the background. It's perfect.<br><br>If you've never seen the show and are expecting a standard raunch comedy, then Entourage might fall flat. However, if you want to make the most out of it, watch the show (it's totally worth it) and then the movie, and it will make the experience better by a tenfold. It's an hour and a half of the gang up to their usual antics, and it's a boatload of fun.","user":"lnvicta","rank":[43,50]},{"title":"A very good movie if you are a lover of the series.","rating":9,"date":"18 August 2015","review":"You probably don't understand the movie or like it if you never watch the series, but if you watched the series you probably love it, is great the last adventure of the gang, so you will enjoy a one last time of entourage in 140 minutes of memories and comedy. If you don't watch the series, you may probably see this movie and don't understand a thing, or maybe you probably don't find it funny, so my advice is very simple, if you watch the full series, you're gonna love it, if you don't you can probably say that this movie is bad, but personally i love it. The movie follow the story and doesn't miss a detail of it. PS: i love Johnny Drama.","user":"israelgodinezcastillo","rank":[93,127]},{"title":"It's for fans who miss the show","rating":5,"date":"15 September 2015","review":"It's no masterpiece, but they weren't aiming for that. It's for fans of the show who want to see the boys back together. A kind of celebration of Entourage, with cameos all over the place - fun to watch. It's lost some charm of the TV show, but it's still escapism and entertainment.<br><br>It's out of its depth as a movie on the big screen though, but it's better than nothing. It's a good way to wrap the whole thing up. I highly doubt we'll see them ever again.<br><br>This time, there's more money, more girls, and more of everything. I'm giving it 6 out of 10 because it tries to fit too much into 90 minutes which would have taken possibly a whole season otherwise. <br><br>It's clunky and heavy-handed compared with the TV show. The problem with a movie is that we don't get the cliff-hangers we got with each episode. Nor do we get to see details explored in depth. In a movie, everything is compressed into 90 minutes, and it changes the flow to something that doesn't feel right. <br><br>The writing is \"safe\". It's in 'movie-mode', and there's a formula at work. Again, less charm than the TV show.<br><br>Lastly, the movie that Vince directs, \"Hyde\" looks like a music video clip not a movie. We see only a small clip, but it looks like a trailer.<br><br>We should have seen more on set of Hyde, with Vince directing. But we don't see much at all because there's too many girls in bikini scenes to get through. They never showed Vince working his magic on set, which I think could have been explored more to gain at least some credibility and rise, even for a moment, above the juvenile materialism. <br><br>Some of the comedy is a bit weak too. But in the end, it's Entourage, so you go along for the ride, and enjoy it even with its flaws.","user":"randomStuff101","rank":[34,44]}]