[{"title":"This is as generic as it gets. Nicolas Cage makes the movie watchable, just barely.","rating":5,"date":"2 May 2015","review":"The revenge plot has been done to death. Kidnapping the protagonist's daughter has been done to death. Everything about this movie has been done before, and done much, much better. This is just another extortion movie where the former friend of a former bank robber wants his share of the heist, and kidnaps the hero's (Nicolas Cage) daughter as ransom. The thing is, Cage burned the money. So how is he going to pay this lunatic? Well, he's gotta commit one more heist for it to be all over. Sound predictable? That's because it is.<br><br>Every beat of this movie is predictable. It wouldn't be so bad if they added some depth to the characters but everything is so one-dimensional. Will (Nicolas Cage) loves his daughter and used to rob banks - that's all we get as far as character development. Vincent (played by Josh Lucas) wants money. They both were involved with a robbery gone wrong at the start of the film and Will burned the money before being arrested and jailed for eight years, but Vincent still wants his share. He waited eight years to exact his revenge. Eight. And the diabolical plan he came up with during that time is to kidnap Will's daughter and threaten to kill her if he doesn't get paid. It's like the writers weren't even trying.<br><br>What the writers do is explain EVERYTHING that's happening to the audience. They spoon-feed everything with the subtlety of a sledgehammer, and this constitutes about 90% of the dialogue: Explaining what you are seeing on screen. The other 10% is forced relationships and throwaway police banter. It's really stupid. Watching the movie on mute is probably much more entertaining.<br><br>Let's talk about the villain for a minute because he's really quite a character, or caricature rather. He has no personality whatsoever so they give him all of these weird traits to mask the fact that he's boring as all f*ck. A metal stick for a leg, long messy hair, a rugged shady look, a twisted sense of morals, and he's a cab driver. It's like baby's first psychopath. Now I don't blame Josh Lucas for this at all, in fact he makes the character watchable, but not even good acting can save the villain from being a walking, talking cliché. <br><br>The police are just stupid in this. Stupider than usual in fact. They're not even worth talking about. All you need to know is that you know what you're getting into with this movie before it even starts and it gives you absolutely no surprises or suspense. It's a by-the-numbers action thriller with Nicolas Cage. It has a few funny moments sure, most are unintentional, but if you're hoping that this would at least be a fun, over-the-top Nicolas Cage action movie, then I'm afraid you'll be sorely disappointed. Stolen is overwhelmingly and sometimes painfully average.","user":"lnvicta","rank":[72,75]},{"title":"Very familiar stuff","rating":17,"date":"17 January 2013","review":"If you are wondering, \"Why is Nicolas Cage starring in a movie that only got a token theatrical release before being dumped on DVD?\", well, from what I've heard, Cage's overspending combined with a massive tax debt has made him take less prestigious projects in order to raise money. Actually, I had high hopes for this movie, because it was a production from Millennium Films, a company that often makes high quality action movies. However, this movie is one of their rare misses. Technically, the movie is above average for a movie aimed primarily at the DVD market. However, the basic story has been told so many times before that there are few surprises this time around. Most likely you'll be impatient long before the end because at times the movie seems to be stretching things out. Also, Cage's character never really becomes sympathetic - you'll never get involved in his plight and be rooting for him. And this is yet another movie where filmmakers don't know how heavy gold bars are in real life! Let's hope Cage managed to pay off his debts with this movie so he can be free to pick more quality projects.","user":"Wizard-8","rank":[17,17]},{"title":"Nothing special, but not bad... And less than 1,5 hours","rating":6,"date":"16 October 2012","review":"The plot is rather simple and not original, but chases during and within Mardi Gras festivities in New Orleans are interesting to watch (here, adding the carnival does make sense, in most other movies it is just meant to confuse viewers and chasers). However, the \"final end\" could have been different, more sophisticated.<br><br>Nicholas Cage is good as usual, but the real star (and best villain) of the movie is John Lucas - vicious inside and outside. Female characters tend to be sketchy, although actresses do their best.<br><br>An OK movie for killing time, but it is neither Heat nor Snatch or similar. A typical Cage-related action.","user":"BeneCumb","rank":[22,28]}]