[{"title":"Freeholding the human interest from shining through courtroom theatrics","rating":5,"date":"19 October 2015","review":"While Julianne Moore needs to find more roles outside of playing older women that audiences passively watch deteriorate physically and mentally, she's so engrossing in such roles and sympathetic without being pitiable that there are no other actresses I would rather see in such roles. After completely commanding the screen with a heartbreaking, true-to-life performance in \"Still Alice,\" Moore returns with an equally devastating performance in \"Freeheld,\" concerning a veteran detective named Laurel Hester, who is dying from terminal lung cancer with her dying wish that her pension be granted to her same-sex partner.<br><br>Under New Jersey Domestic Partnership Law, however, this request cannot be granted to state employees and Laurel's appeal is scrapped by the ruling of five state freeholders. As Laurel becomes increasingly sicker, her partner Stacie Andree (Ellen Page), a significantly younger woman who works as a car mechanic, tries to manage her increasingly difficult treatments. Meanwhile, Laurel's longtime detective partner Dane Wells (Michael Shannon) works to help further Laurel's case by showing up at the town hall meetings where the freeholders are present, in addition to accepting the services of Steven Goldstein (Steve Carell), a flamboyant, Jewish gay rights activist who serves as the chairman for Garden State Equality. Goldstein winds up turning the town hall meetings into Kabuki Theater of sorts with loud protesters attempting to change the mind of the five representatives that are holding Laurel and her wishes back.<br><br>Moore and Page both give tender performances here, and their time together on-screen makes up some of the film's most endearing moments. They embody everything about a couple that one can easily get the wrong idea about, with their simple request becoming a national issue and spawning all kinds of domestic controversy that ostensibly stems from their desire to be noticed. It's easy to think this in theory, but seeing the film unfold shows that was the furthest thing from their agenda; this is a couple that wanted to live their lives and go through their days without any sort of hassle. They didn't want explosive levels of fame; they just wanted to live their lives and Laurel wanted her love to be taken care of financially when she died.<br><br>Screenwriter Ron Nyswaner is a bit too giddy to get to the meat of Laurel and Stacie's story, which results in a film that too quickly gets wrapped up in legal proceedings and courtroom altercations. Because of this, the true heart and reason for the story - Laurel and Stacie's relationship - gets lost in a sea of colorful theatrics and fragrant displays of powerful monologues and montages. In an age where good, mainstream films about gay rights and gay characters are difficult to come by, it seems unfortunate that \"Freeheld\" gets so wrapped up in colorful and overextended displays of courtroom drama that is sacrifices its main characters and their relationship with one another.<br><br>In addition, \"Freeheld\" is fairly standard Lifetime Network fare, encapsulated by a daunting and thoroughly overbearing score that hits every emotional scene to the point where pathos are artificially communicated rather than naturally felt. The important, topical subject matter at hand and the unanimously strong performances work to distract from that fact, but the unnatural amount of emotional manipulation prevails. As stated, Moore is a heartbreakingly real character here, and Page, who is by her character's side through every step, while strong in the more emotional scenes, doesn't really have much character to rely on here. The standout alongside Moore is Michael Shannon, who is destined to get the shaft here though he deserves to share the stardom. His seriousness and commitment to Moore's Laurel never feels like the \"white knight\" hero nor a bid for self-importance. Per usual, Shannon plays a real and fascinating character.<br><br>\"Freeheld,\" despite its convincing performances and significant story that really transcends politics to become a human issue, unfortunately shifts its focus on the characters for a perfunctory and predictable rehash of courtroom theatrics that cloak the human interest aspect, as a result. It's the kind of film that really makes you hope the actors got paid more than the screenwriter at hand, for their commitment and talents shine through the unfortunately bland writing.","user":"StevePulaski","rank":[23,28]},{"title":"6.5/10","rating":6,"date":"9 November 2015","review":"Even though it treads a lot, and I mean it, a lot of ground that has been covered by countless films before, especially recently, \"Freeheld\" is a well-crafted film that has committed and passionate work behind it that manage to make it come through a lot more than it could have in many other situations.<br><br>I am baffled by Juliane Moore honestly, that is the first and only thing that comes off the top of my head thinking of the film. She is so talented it is ridiculous. Because even if this is a performance that we have seen so many times before, even by Moore herself last year, she still manages to make it fu**ing interesting, new and genuine. This actress is a legend really. Right from her way of moving on screen she just lives and breathes the characters she is given and makes them so much more of what is on paper, which is also the main reason this film succeeds.<br><br>Because the film does recycle a lot. Both in ideas and style. It fits right into the streak of true story films that we have had in recent years and doesn't really emerge. It doesn't have a personal stamp, it doesn't really say anything special or new and what it says it really throws in your face without space for a more subtle or emotional narrative. As always with true story movies it gets deep into manipulating your emotions by pulling very, very easy heartstrings and doesn't make an attempt at trying to make a movie first before a recounting of the true story.<br><br>Yet, you feel that much of it, despite being standard, is truly heartfelt by the cast. Micheal Shannon is really, really good, Ellen Page doesn't always find her place on screen, but still manages to come off as the very good actress she is.<br><br>So in the end what we have is something that excites and moves in a way too conventional and seen-before way, that comes off as a pleasant experience thanks to its actors' commitment. I will never, ever watch this film again, but I will also never regret having seen it.","user":"James_De_Bello","rank":[27,34]},{"title":"True Love, believe the evidence of your own eyes","rating":8,"date":"25 March 2016","review":"One of the things that has always annoyed me about people opposing gay rights laws is the absolute refusal of the opposition especially those religiously based to recognize romantic love. It's not recognized in the holy works of religion therefore it doesn't exist. Even in this film where we are talking about two people in love. Believe the evidence of your own eyes about Laurel Hester and Stacie Andree in the film Freeheld.<br><br>I worked for NYS Crime Victims Board and in death I came in contact with a lot of ordinary LGBTQ people who in death had their lives magnified far more than what they did in their lives. Such is the case with Laurel Hester who was a detective with the Ocean County Police in New Jersey. I'm not sure she was closeted, but she certainly was discreet in her male dominated work place.<br><br>Discretion went out the window when she meets Stacie Andree a much younger woman at a softball game. The two start living together and while it's not all roses, the commitment is truly there.<br><br>And then cancer strikes and what to do about whatever estate Hester might leave. This story illustrates precisely the problem that LGBTQ people had before marriage settled the issue permanently. You could in some places get a domestic partnership certificate and have the relationship recorded. But it wasn't mandated that private industry and government recognize it.<br><br>Thus was the issue of the film as the town of Freehold and its governing body would not extend survivor benefits to Ms. Andree. They were not married, but legally they could not get married. At least without a lot of agitation and organizing.<br><br>Which is where Steve Carrell as Steven Goldstein comes in, leading the same sex marriage lobbying group. The issue as he says is so neatly encapsulated in the problem that Hester and Andree face.<br><br>Two things I liked about Freeheld that make this a special film. One was the chemistry between Julianne Moore and Ellen Page as Laurel and Stacy. They made me believe the love was real.<br><br>The second was the scenes among Laurel's police colleagues with her and among themselves. The differing reactions was a sampling of straight and male America, quite nicely documented.<br><br>Freeheld is a great film showing the need for same sex marriage as few others have.","user":"bkoganbing","rank":[15,19]}]