[{"title":"Rockwell's charisma elevates this familiar tale.","rating":6,"date":"14 March 2014","review":"Have you ever looked around at your life and realized that it didn't turn out the way you thought it would? Sure, everyone has, and while most people would just chalk it up to a healthy dose of reality, small town pharmacist Douglas Varney (Sam Rockwell) is searching for something more. He's not entirely sure what that something is, until a chance meeting with local millionaire's wife Elizabeth (Olivia Wilde) results in the type of mind-blowing, toe-curling sex that he's only dreamed about.<br><br>The fact that Doug is married should serve as a major deterrent to this sort of activity, but when his wife (Michelle Monaghan) is a highly competitive cyclist who doles out sex and respect in equal amounts (read: none at all), it's easy to see why this lonely schlub would be driven into the arms of a femme fatale. It doesn't hurt that Doug's place of business gives him unfettered access to a wide array of prescription drugs, and soon he and Elizabeth fall into a steady cycle of psychotropic carnality.<br><br>The illicit affair instills a newfound confidence in Doug, and much like Kevin Spacey in American Beauty, he begins to rebel against everything and everyone that has been holding him back all these years. The always charismatic Rockwell radiates cool from every pore as he struts from scene to scene, a cigarette drooping lazily from his lip as he schemes to beat his wife at her own game: a local bike race dubbed the Tour de Woodbury, which she has never lost.<br><br>There are a few other side plots, including an ill-conceived murder plot and a surprisingly sweet moment that finds Doug bonding with his troubled, distant 12-year-old son, but the crux of this film is Doug's transformation from put-upon loser to swaggering, cocky bad boy. Rockwell takes the ball and runs with it, and the effective (if underutilized) supporting cast gives him plenty of room to put his own stamp on this familiar story.","user":"BrentHankins","rank":[25,26]},{"title":"Nothing Special, But Still Fun","rating":6,"date":"21 January 2015","review":"A strait-laced pharmacist's uneventful life spirals out of control when he starts an affair with a trophy-wife customer who takes him on a joyride involving sex, drugs and possibly murder.<br><br>This film comes across as your standard indie comedy with a solid cast. Olivia Wilde, Sam Rockwell and Ray Liotta, to name a few. Maybe not quite A-list, but all well-established actors in their own right with plenty of talent. Through in a cameo by Ben Schwartz, who is definitely moving up in the world, and you have a strong ensemble.<br><br>The film is good, too, with plenty of subtle humor, of a dark nature, and just enough quirkiness to appease the target audience. Maybe not quite funny enough to recommend, but worth the time it takes to watch.","user":"gavin6942","rank":[17,18]},{"title":"Nice 'little' movie... \"the key to getting ahead is getting started!\"","rating":8,"date":"14 March 2014","review":"\"Better Living Through Chemistry\" (2014 release; 92 min.) brings the story of Doug Varney (played by Sam Rockwell), who is stuck in an unhappy marriage, and who has just bought the pharmacy from his father-in-law. One evening, Doug is making house deliveries of prescriptions, and one of those deliveries is to a McMansion, where the doorbell is answered by Elizabeth, a beautiful yet bored and unhappy housewife (played by Olivia Wilde). It's not long before Doug and Elizabeth hit it off, setting Doug on a path of personal discovery. In a parallel story, Doug is dealing with his 12 year old son who is going through a tough stretch himself. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: first, this is the big screen debut of Geoff Moore and David Posamentier, who co-directed and also co-wrote this original screenplay. Second, this is one of those 'little' indie movies that just could, as the movie doesn't take itself too seriously yet before you know it 90 min. have come and gone. Third, the character of Doug is of course crucial to the success of the movie. Originally schedule to be played by Jeremy Renner (who bowed out due to schedule conflicts), Sam Rockwell, whom we saw excel just last year in \"The Way, Way Back\", gives a commanding performance as Doug, and basically carries the movie on his shoulders. There are many other smaller choice roles, including of course Olivia Wilde, but check out also Ray Liotta as the husband of Elizabeth (max 15 min. of screen time), and Jane Fonda as herself at the very end (in a blink-and-you'll-miss-it role). Fourth, the movie was filmed in and around Annapolis, MD, which looks just gorgeous. Last but not least, there are a lot of great songs in the movie soundtrack, including Donovan's \"Season of the Witch\" and lots of indie music. But Queens of the Stone Age's \"Better Living Through Chemistry\" is NOT in the movie.<br><br>This movie opened today without any pre-release fanfare or hype at my local art-house theatre here in Cincinnati. The matinée showing I saw this at was surprisingly well attended, given the low profile of the movie and the simultaneous release on Amazon Instant Video. All that aside, I was pleasantly surprised by this movie. \"Better Living Through Chemistry\" is definitely worth checking out, be it in the theater, on DVD or on Amazon Instant Video.","user":"paul-allaer","rank":[30,35]}]