[{"title":"Take the Henry out of the title..you have the movie..","rating":1,"date":"14 December 2011","review":"When Henry fails yet again to hand in his homework for the umpteenth time, he has no idea that this will set off a chain of events which will see him forming an unlikely alliance with Moody Margaret, the infuriating girl next door, and his irritating little brother Perfect Peter.<br><br>Together, they outwit corrupt School Inspectors and toppling an evil Headmaster, winning a talent contest and facing his ultimate nemesis with no way out - all because he is trying to save the very school which he has always professed to hate! <br><br>Take most of Britains talent, give them an awful script and some cringe inducing acts to do, and you have this poor excuse of a movie.<br><br>My daughter loves the animated series, but she really got fed up after the second act. It's a travesty to see such talent look so awkward with the little that they are given.<br><br>And I though E. Grant was hamming it up in Hudson Hawk! He really takes the biscuit in this.<br><br>The best thing about this is Huston, giving it her all in such a mess.","user":"FlashCallahan","rank":[13,14]},{"title":"a waste of the talent as its disposal","rating":4,"date":"5 August 2011","review":"I took my 8 and 6 year old children. My 8 year old is usually quite forgiving of a bad film if she has popcorn. We watch and enjoy a lot of children's films - this was the worst for a long time, since Space Chimps probably, and made worse by that it could have been so much better with a little craft to its direction. And from a director with so much experience as an Editor, it was really badly edited.<br><br>My 6 year old thought it was OK, but there lies the problem - the film is obviously aimed, in its semi-high-school American 'teen rock' music pretensions, at a much older audience. A porous plot, even to an 8 year old, and the embarrassing potential of the cast falls extremely flat. Mathew Horne seems only to have two expressions in his repertoire and is in extreme danger of having a bit part comedy career fade fast. Anjelica Huston's Scottish accent was insulting and embarrassing - like a sheltered American impersonating Mrs Doubtfire. Horrid Henry clean cut and Americanised, really wasn't very menacing at all. I was surprised we were spared the sentimental 'son, I got it all wrong but I will always love you' ending: it would have completed the American airbrushing.","user":"lamagia_uk","rank":[15,19]},{"title":"In one word this movie is: Terrible. (I'm not using a horrid pun)","rating":1,"date":"20 June 2014","review":"There are three kinds of movies that I really can't stand. One is a movie that is style over substance with no attempt made at adding substance, two is a movie that is completely pretentious, and three are children's movies that think children are completely stupid so they don't try. In case you haven't guessed, \"Horrid Henry: The Movie\" fits in with the third category. \"Horrid Henry\" is a move that does not know what it's about and relies on all sorts of things to keep the audience's attention.<br><br>The annoying thing about \"Horrid Henry\" is that the movie has a million different things going on in it, and still almost nothing happens within the whole movie. the principal of a private school (Richard E. Grant) bribes two school inspectors (Metin and Timur Ahmet) to purposely fail a public school in order to get the student's parents to have to pay to send their kids to the private school. This has happened to several schools already and now the school that Henry goes to is the next domino to fall. Henry and a group of other students, including his arch nemesis Moody Margret (Scarlett Stitt) and his brother Perfect Peter (Ross Marron) join forces to save the school.<br><br>The movie loses focus on what it is trying to do about halfway through the movie when Henry is sent to a girl's school by his rich aunt (Helen Lederer) because she thinks he's a girl. There, he runs into Moody Margaret, and this part is supposed to be used to show they hate the girls school and decide to join forces together to save their school so they don't have to go to the girl's school. This part of the movie goes on for at least fifteen minutes, serves very little purpose to the movie other than to add some terrible attempts at comedy and lengthen the movie with something that could be done in five minutes. <br><br>The character of Henry (Theo Stevenson) is given two side-stories that tie into the movie, yet don't lead anywhere. Henry says he wants to be a musical sensation, but halfway through the movie that is dropped. Then, he has an arc where he learned how to spell 'homework' and it looks like he's taking school seriously now, but then it turns out he isn't. While he and his team do manage to save the school from closing, everything is back to the way it was at the beginning of the film other than the principal of the other school and the inspectors are arrested. No characters change and there is no lingering effects from the event. <br><br>The film throws so many visuals at you that it becomes headache-inducing and even starts to make the movie slip towards that style over substance junk that I hate so much. There are a number of graphics and visual effects in the movie that make no sense and add nothing to the plot, like when Margaret throws a water balloon at Henry, there is a random sequence of him dodging the balloon using random graphics, but it adds nothing to the story.<br><br>With a story that goes every which way without any real reason for it, dumb graphic effects, an unlikable protagonist, and a mess of a script, \"Horrid Henry\" The Movie\" is not only a terrible movie, it is intelligence insulting and just leaves you feeling tired and depressed after watching it. With so little a plot to follow and zero pacing to the story, this 93 minute piece of garbage feels like it's two and a half hours long.","user":"TheSeaLion","rank":[5,5]}]