[{"title":"Review: Drunk Stoned Brilliant Dead: The Story of The National Lampoon Is A Raucously Entertaining Doc","rating":8,"date":"6 May 2015","review":"Director Douglas Tirola boasts (somewhat cheekily) that Drunk Stoned Brilliant Dead features more bare breasts than any other documentary in history. Judging by the raucous end result that details the hard- partying genesis and spectacular flameout of the National Lampoon humour magazine, he may well be right.<br><br>From an inauspicious start at Harvard to an ignominious end (that is mostly glossed over), National Lampoon magazine proved notable and memorable, with Drunk Stoned Brilliant Dead reliving all the glory years of drugs, clubs, pubs, parties, and oh yeah, ground-breaking humour too. Focusing on the many disparate players that had a hand in the magazine (including numerous publishers, comedians, actors, hangers-on, and most importantly, the core writers that drove it all) Tirola wrangles a cacophony of voices and personalities into a digestible narrative that zips along with wit and verve.<br><br>It helps that his subjects are a motley crew of top-rate satirists, a group who at one time helped make National Lampoon the 2nd most popular magazine in the country and a world-changing counter- cultural force. Yet with the inevitable rise comes a crashing fall, exemplified by broken friendships, drug casualties, untimely deaths, and other assorted tragedies. It's an epic story and a must-watch for comedy nerds and casual fans alike.<br><br>Founders Doug Kenney and Henry Beard are the main subjects, although a litany of faces (many famous) chime in throughout on the impact and legacy of National Lampoon itself. Kenney and Beard are shown to be the initial visionaries who, along with the help of publisher Matty Simmons and a key group of art directors, launched the magazine. National Lampoon spun off a Harvard publication in 1970 and immediately showed an irreverent wit and willingness to go after any target with ruthless precision (the bigger the better). Politics, race, gender, the rich, the famous – they were all fair game and National Lampoon tore them to shreds with razor-sharp satire (like a more ribald precursor to Saturday Night Live, and later The Colbert Report and The John Oliver Show).<br><br>Behind the scenes it was a non-stop party, with the Lampoon's New York office being a hub of sex. drugs, and rock 'n' roll. The writers had free reign to imbibe and indulge in whatever they liked, so long as a magazine was produced each month. And with coke-fuelled marathon writing sessions and Kenney and Beard's dogged work ethic, they were able to keep up. It was highly dysfunctional but many of the talking head segments reveal former staff members looking back on their time in those madhouse offices fondly.<br><br>Tirola keeps the tone lively and fast-paced, using excerpts from National Lampoon's radio show and comedy albums as audio-only interstitials, and bringing many articles and illustrations to life through animation combined with vivid recollections from the folks who were on the front lines. Among them are Billy Bob Thornton, Tim Matheson, Kevin Bacon, and other actors who were related to the brand (a fresh-faced Bacon got his ass paddled in a memorable sequence from Animal House), as well as those that were profoundly influenced by the magazine and its spinoffs, like comedy hitmaker Judd Apatow.<br><br>There's great archival footage of early National Lampoon troupe members like Bill Murray, Gilda Radner, John Belushi and Harold Ramis performing, which sadly recalls that three of those four have passed away now (while the ever-elusive Murray appears only in old footage). Chevy Chase figures prominently into the narrative, as he was one of the first members of the comedy troupe and was a close friend to co-founder Doug Kenney. The making of Caddyshack (not an official Lampoon production but featuring many alumni) is recounted in detail, as is the uproar over and eventual exaltation of the classic Animal House, which helped make the careers of John Landis and Ivan Reitman (both of him appear on-camera as well).<br><br>For every interview that Tirola may have missed out on (an extremely young Christopher Guest is seen fleetingly in footage from the 70's), there's three great anecdotes that will have audiences either in stitches over some ridiculous tale, or watching raptly as the next drug trip goes bad or close friend is lost. There's a wealth of material to draw on, and to the movie's credit it remains fleet and sure-footed, nimbly picking which story to expand and which interviewee to probe.<br><br>Chase himself – once a titan of comedy but now often seen as an ungrateful blowhard – is humanized greatly and his relationship with the hard-living Kenney provides an emotional anchor for the craziness surrounding the Lampoon. The loss of life and shattered friendships are not glossed over but the film does make the needed decision to focus mostly on the main players of the Lampoon as there's only so much screen time.<br><br>The later years of the magazine become somewhat dire as much of its best writers and actors are poached by Hollywood and Lorne Michaels, but the film (and the magazine) soldier on in the face of adversity. The down slide is given less screen time and Matty Simmon's hand- waving away of the bad later years is both glib and appreciated in the context of the movie (when asked about Michaels, Simmons responds \"Who?\" with a smile). While the magazine ended in 1998, its brand and looming influence continues to live on.<br><br>The film is necessarily guided by who would speak with Tirola but in the end that turns out to be a surprisingly large number of notable individuals, recognizable entertainers, and even more names who may not be as familiar but whose contributions were great and deservedly remembered here. If a documentary's job is to be true to its subject while informing and entertaining, then Drunk Stoned Brilliant Dead achieves that goal with ease. To paraphrase the Lampoon's most famous magazine cover, \"Watch this movie or we'll shoot this dog.\"","user":"glenonfilm","rank":[29,33]},{"title":"Good Inside Look at the Satirical Publication","rating":7,"date":"25 May 2016","review":"This well presented documentary, directed by Douglas Tirola, gives us a good inside look at the highly satirical magazine National Lampoon. Founded in 1969 by 3 Harvard graduates, Doug Kenney, Henry Beard, and Rob Hoffman, the magazine published from 1970 to 1998.<br><br>In its heyday in the 1970's, National Lampoon presented dark and scathing social and political satire, where seemingly nothing was off limits. That would include its now infamous 1973 cover where a revolver is being placed against the head of a dog with the caption \"if you don't buy this magazine we'll kill this dog\". <br><br>The magazine would spin off into various other media avenues including radio, live theater, comedy albums, and finally movies, where its initial film presentation was the classic comedic gem \"Animal House\". An enormous list of talented comedians and writers would contribute to the success of National Lampoon over the years. However, this success would eventually lead to much of the talent moving on to other venues, such as SNL, leading to the eventual downfall of the publication.<br><br>Overall, the viewer should be prepared to see tons of female breasts in this movie, as well as all kinds of explicit sexual references and stories. Also, they'll be many references to the darkest kind of humor, on topics that would be considered strictly taboo by many. I thought the documentary gave me a solid inside look at an important part of American satirical humor history.","user":"larrys3","rank":[7,7]},{"title":"The Rise and Fall of the National Lampoon","rating":9,"date":"20 July 2016","review":"If you were living in your late teens and early 20's during the 70's, male (in most cases) there is a good chance you may have been a regular or semi-regular reader of the \"National Lampoon\" an outrageously funny monthly periodical of the time. A good description is that the NL was a natural progression for teenage boys when they were outgrowing \"Mad\" and developing some intellectual chops. The NL was screamingly funny, absolutely hilarious satire. I'll admit that when I first started reading in high school some of the stuff went over my head but one thing about the 'Poon compared to the lightweight so-called satirists of today, the overwhelming majority of whom are promoting a far left agenda - the NL was truly an equal opportunity satirist. I'm sure that most of the writers, being in their 20's and most with an Ivy League background were politically left but the 'Poon went after politicians and causes of conservatives and liberals with an equal vengeance, with Nixon and Ted Kennedy being 2 prime examples. While the NL made great sport of right wing iconic institutions like the military, big business, police, Christianity, the NRA and right to life, they also satirized virtually every ethnic group, liberal elites, homosexuals, the entire counter-culture movement, and women (plenty of tits!) Indeed, if someone would try to revive the NL in the spirit of the 70's I'd think the PC police would immediately begin to try to abolish its existence for being racist, sexist and homophobic. <br><br>For those under about age 50 the National Lampoon is remembered for the movies that began in 1978 with the classic \"Animal House\" and then the series of \"Vacation\" movies, plus some others over the years not worth mentioning. The success of AH would continue the siphoning of the NL's most talented writers and performers (the NL Radio Show, which ran on Saturday evenings on a syndicated network, mostly AOR stations. Included Belushi, C Chase, Radner, Ramis and the Murray Bros.) which had begun with NBC's SNL. The NL couldn't compete with the money, fame and women that movies and TV offered their creative talent and the magazine died a slow death in the 80's. \"DSBD\" is a great look at this quick rise and fall of a comedy empire.","user":"BoomerDT","rank":[10,11]}]