[{"title":"Tragic Story about the Early Days of the AIDS Epidemic","rating":9,"date":"25 May 2014","review":"The Normal Heart is powerful emotional film about the early days of the AIDS crisis. While the characters are fictionalized, the events and the struggles are all too real. The film provides a valuable history lesson for those too young to remember the politics and emotions of the early days of the AIDS epidemic. The film dramatizes the criminal neglect of both the Reagan administration and Ed Koch's administration in New York City. It shows the complexity of the struggles within the gay community as they tried to come to grips with an epidemic while still trying to challenge a culture that barely acknowledged their existence. In many ways, the film dramatizes just how far we have come and still suggests that we have a long way to go. Some scenes are simply heart-breaking. The film is well-acted particularly by Mark Ruffalo, Matt Bomer, Alfred Molina and Julia Roberts. HBO has shown again that it is in the forefront of bringing socially conscious drama to the screen and for that they should be commended. I recommend the film to all who are willing to watch with an open heart.","user":"JustCuriosity","rank":[105,121]},{"title":"\"We are all walking time-bombs...\"","rating":8,"date":"25 May 2014","review":"Heart-rending, gut-wrenching adaptation by Larry Kramer of his own successful play about the foundation and formation in 1982 of the Gay Men's Health Crisis in New York City in the wake of what was then-called the Gay Cancer (now HIV/AIDS). Dramatization of events, with Mark Ruffalo's screenwriter Ned Weeks substituting for Kramer, is necessarily a no-holds-barred examination of gay sex in the '80s and its consequences, with the gay community themselves their own worst enemy (by being asked to abstain in the wake of more information on the disease, they felt oppressed as a modern culture and rebelled). In spite of an agonizingly long gestation period for this material (which Barbra Streisand optioned years ago, but was unable to finance), director Ryan Murphy has crafted an immediate and powerful document, alternately angry, sexy, tough, moving and thoughtful. Though \"Longtime Companion\" and the cable-film \"And The Band Played On\" have covered the AIDS epidemic (and done it extremely well), that does not lessen the impact of this HBO film, which packs an emotional wallop. Performances from Ruffalo, Julia Roberts, Alfred Molina, Matt Bomer, Jim Parsons and the entire cast are superlative.","user":"moonspinner55","rank":[71,83]},{"title":"People Definitely Need to Watch This Movie","rating":9,"date":"3 June 2014","review":"I'm haunted by memories of gay friends dying in 80's when getting AIDs was a death sentence and no one seemed to care. My boyfriend's brother was one of those Fire Island boys who was so convincingly played by Mark Ruffalo (Ned Weeks). I know Mark as a comedian, but he so captured the anger that must have been felt by so many gay men who's lovers were dying and they could do nothing to stop it, no matter how much money they had. As for Matt Bomer (Felix Turner), I have to say I think he deserves an academy award for his transformation from the handsome dashing man he is, to the gaunt shadow of a figure he became due to his role's AIDs illness. What a real acting force he has become, and this role shows he is so much more than just a handsome face. Also well played was Julia Roberts depiction of Dr. Emma Brookner (Dr. Linda Laubenstein in real life who's unfunded research helped so many), Jim Parsons warm loving portrayal of character Tommy Boatwright who was the heart of the movie and showed the warmth and caring of most gay men I've known, and Taylor Kitsch portrayal of Bruce Niles which showed the reality of Gay men of that era, who feared having their sexual identity out in the public eye with all the negative consequences (harassment, job discrimination, loss of family) of that.<br><br>This is a story that people definitely need to see, to understand how this disease spread unchecked for so long. If not for the efforts of men like Ned Weeks and the Gay Activist Alliance's efforts get funding for research when no public official would even acknowledge there was a problem, who know how many more people have died and would be dying today. This is an angry gritty movie, that doesn't hold back from telling it how it was. It's also a heartbreaking story of how people treat others who are outwardly different yet inwardly the same as themselves. Which is why, whether you're gay or straight, you can relate to the sad love story told here, and the heroism of those who fought the battle to find a way to stop the deaths devastating their community. It's shockingly true that our government let this epidemic get out of control and until deaths started affecting the heterosexual community, and famous people (like Rock Hudson) did nothing to stop its rampage.","user":"mcampbelljh1","rank":[66,77]}]