[{"title":"Its funny if you appreciate B-grade Sci-Fi hilariousness","rating":3,"date":"3 February 2011","review":"OK. Debbie Gibson. Tiffany. Mutant creatures. Cheese acting. Cat fight between Debbie and Tiffany. Total crap as far as \"good\" movie standards go. However, if you're into crap sci-fi movies, and you are old enough to remember these girls from the eighties and being superstars, its a great watch. Perfect for killing some time or putting on to doze off to if you have a TV by where you sleep and need something to watch and listen to while you drift off. I seriously don't know why some of these movie snobs bother to watch these movies just to criticize. I know what good movies are, and I like good movies. This isn't a good movie. Its a movie for people who like bad movies, or just bad movie trash to doze off to at 2AM. Its great as far as that goes and I hope they never stop pumping out cheap readily available movies like this for those of us that just need something kinda funny/amusing to kill some time with. Also, Jack Frost (the horror movie with a killer snowman) is great in that regard. There's a second one as well. Also, Santa's Slay...awesomeness!","user":"bloodugly","rank":[21,27]},{"title":"Methinks You All Protest Too Much...","rating":5,"date":"30 January 2011","review":"What should you expect from a title such as \"Mega Python vs. Gatoroid\"? <br><br>This is clearly not going to be a poignant exploration of the coming - of-age struggles facing a herpetologist, contrasted with the inner conflict of a widowed before even having the wedding game warden.<br><br>This movie is clearly a \"Bad SciFi\" production (as opposed to \"Good SciFi\" that does attempt to be cinematically relevant). However, the sheer level of badness makes it an enjoyable watch. How many other movies can give you the opportunity to shout at the screen \"Oh, come ON!!!\" as many times as MP vs G? Both Tiffany and Debbie Gibson recognize their own shortcomings as actors, and revel in them, as seen in the commercial insets. <br><br>Yes, the CGI ranges from bad to awful, but it is all the more fun because of it. Yes, the underlying science is unbelievable, but it hearkens back to the classic \"B\" movie formula of human actions affecting animals. Yes, you tend to laugh at the on-screen deaths rather than feel loss (Except for Kathryn Joosten, why, oh why did you have to eat Mrs. Landingham?!?!), but the debate afterward of eaten by gator or bitten in half by snake head was worth it. Yes, it is two hours you can't get back in your life, but you knew that when you started watching.<br><br>Mega Python vs. Gatoroid is exactly what it appears to be. It makes no pretense that it is a great film, and the viewer should not demand that it tries.","user":"jmiller-84","rank":[10,12]},{"title":"It is what it Claims","rating":3,"date":"30 January 2011","review":"Now, somewhere between the non serious title and the fact that this movie went straight to cable on the SyFy Channel, one certainly should get the idea that we are not dealing with \"Gone with the Wind\" here, but with a silly monster movie. But there is still a place for that. Sometimes some of us have had it with too many serious things in life and we just want to watch something light and silly, and movies like these fill that urge. The fact that several of us voted to watch it proves the point.<br><br>The good points? The rivalry between the two main actresses at times was interesting. The rest of the movie sort of went along with expectations. And by that I mean, the acting and drama did not even get to good, the special effects did not rival Jurassic Park, and no university professor (who is not high) is going to buy the explanation for the larger monsters and how they got that way. The bottom line is, if you are in the mood for something that you know is not serious nor pretends to be serious, this might fill some time for you.<br><br>Regrets from me after watching it? Some movies that know they are not the big time sometimes reach cult classic fame with the right amount of silliness and interest such as \"Attack of the Killer Tomatoes\". I think this movie tried for that category also, but I do not feel it achieved that either. But I give it credit for being honest as to what it really was - a non serious monster movie.","user":"RNHunter","rank":[17,23]}]