[{"title":"What just happened?","rating":4,"date":"24 July 2012","review":"This review contains spoiler. Please don't read it before watching the movie.<br><br>Well, things are happening quite fast in this movie, mainly in the second half so I'm still trying to put together what really happened.<br><br>The story starts with four friends going to camp in a wood, one of them decides to make a documentary of the event (or about his friend camping as stated in the beginning). The tool of making the documentary is a hand-cam, so the atmosphere is quite the same we already know from several other films (not bad, actually, the only thing that disturbed me was the blinking light during the last about 20 minutes). The beginning is quite promising, our heroes arrive to the forest, tents up, campfire burning. (However, I don't really understand why they came by a kind-of trailer when they planned to sleep in tents... Well, I admit that it was useful for some subsequent scenes.) Night falls, strange sounds from the woods, next day a strange hairy creature in the woods, next night sounds getting worse, everyone is getting scared, they decides going home but one of them disappears. <br><br>This is the point when things are going wild and you better not even blink if you want to follow what's happening. And the point when the expected value of your IMDb vote starts to drop. Rapidly. Because from now on my perception of this movie was about like this: run- continuously bumping camera and blinking lights -dead body with neatly arranged intestines-run-some screaming (thanks God not too much)-a tractor-a strange place-please stay calm you are in a restricted area-run-hairy creature attack-run-some houses-another hairy creature attack-scream run-a huge complex-crazy zombie attack-reinforcement arrives-even more crazy zombie with hairy creatures-run-run-run-friend's head blown off-military helicopter-end.<br><br>So my biggest problem is: WHAT? I assume it was about some research lab (at a point we can see a revolving DNA on the screen-saver of a computer) doing bad-bad things to people and maybe animals and of course things go out of control and our friends here entered a place for camping they shouldn't have (this is all just a wild guess anyway). But how? And what? Too much things are happening in a very short period of time. I don't mind thinking during a film but I'm not really into putting together the pieces of some crazy puzzle when the whole picture will also be a complete mess.","user":"benegesserit20","rank":[24,29]},{"title":"Well Made Candidate in the Found Footage Genre","rating":8,"date":"25 February 2012","review":"There's no arguing that this film is well made with a tight script and good direction, however, as is the way with most found footage genre films, is that they really have to have a \"believable\" concept and storyline, leastways, the storyline has to be one that doesn't come across as instantly ridiculous.<br><br>Evidence nearly gets there, but again, the action packed last 60 minutes are just too cluttered with too much going on and too many questions left unanswered.<br><br>The worst part of the found footage genre, are the opening character development scenes - they are either hopelessly painful, or, as is the case in Evidence, seamless and pain free with some good dialogue. Far too many of this genre, fall into the trap of not scripting properly, or, leaving the cast to their own devices and letting them ad lib their way through the scenes. Evidence presents a believable introduction and leaves the viewer at ease quite quickly with the characters and their reasons for the documentary.<br><br>As mentioned the last 60 minutes have to understandably pack a lot in, trying to provide explanations whilst still delivering the \"money shot\" - Evidence gets there, just, with some questions still left hanging.<br><br>It's advisable to watch through the credits, as the story continues throughout, why this couldn't be built into the main story, you're left to wonder yourself.<br><br>A decent Found Footage film - and it should appeal to most who enjoy the sub genre, just don't go into it with too many high hopes.<br><br>6/10","user":"graeme-206-255002","rank":[39,60]},{"title":"Wow, didn't see that coming. One of the better zero budget FF horror flicks i've seen.","rating":8,"date":"24 August 2012","review":"Yet another one of those rare instances where I'm compelled to review a movie because this place unfortunately does not require an IQ test in order to review films here, because if it did, there wouldn't be so many people 1 starring a solid zero budget horror flick because they're confused by...apparently everything. How somebody could be confused by a movie like this is just laughable, it's even more laughable they're not too embarrassed to admit it in a public forum.<br><br>As I was watching it it started out as your fairly standard but fairly well paced and creepy FF horror flick, 4 young adults camping in the woods. Weird things happen, sounds in the night. It was all fairly enjoyable but nothing terribly different other then the fact it was horror and enjoyable because lets face it, 99% of horror movies are crap. The pacing is excellent, acting is serviceable, I've seen better and I've seen a lot worse, the atmosphere is excellent, even throwing in a red herring that while completely mundane just really kicks up the creep notch a few. Whoever wrote the script made some great decisions even though it's all very blair witch esque.<br><br>I won't spoil it but when you're expecting the standard but acceptable \"Everybody dies\" ending, the movie completely flips itself on it's head and takes itself in such an unexpected direction and it does it so seamlessly I absolutely couldn't wait to see what happened and where it was going to go. Once things get rolling, like a snowball it just picks up steam leaving the final reel to be pretty much non stop forward momentum.<br><br>It's not perfect, there is some spotty acting and in the final reel, the zero budget does show, as the setting isn't very convincing but the shaky camera work and atmospheric lighting do a great job of hiding things.<br><br>Don't listen to the haters, if you enjoy found footage, this is seriously a gem. I loved my time with evidence.","user":"baserock_love","rank":[30,46]}]