[{"title":"Well... I Am Visibly Scarred After Watching This.","rating":4,"date":"19 July 2013","review":"WOW! This film is rather difficult to review. It was also rather difficult to watch. Before I begin listing the numerous negatives, I'll start by saying that at least VISIBLE SCARS kept me watching until the very end. This is partly due to the fact that the main character and her best friend are rather easy on the eye and there's also a rather cute, albeit annoying, hippie chick. It's also partly due to the fact that I respect Tom Sizemore (Heart &amp; Souls, Natural Born Killers, Saving Private Ryan, True Romance) and I was desperately trying to understand his motives for lending his name to this seemingly low-grade nonsense. He must've owed someone a favour.<br><br>The opening scene gripped me mildly and I was hoping to be gripped tighter as the film went on. Alas, the B-grade acting failed to improve, the plot was all over the place, the death sequences were pathetic and (without spoiling anything) the less said about the ending, the better. By the halfway mark I began to ask myself why I hadn't turned it off yet. It's mainly because I still wasn't sure where they were going with the plot. Unfortunately I don't mean that in a good way. Even though I was rooting for the end credits to roll, during the final 30 seconds I found myself thinking, \"The credits better NOT be about to roll... because if they are... this film went absolutely nowhere!\" Then the end credits rolled.<br><br>To sum up, VISIBLE SCARS is an atrociously acted, shoddily scripted, mindless mess that begins and ends nowhere. I can't explain my reasons for rating it 4/10 as opposed to 1/10 without adding a spoiler alert. Needless to say I'm being VERY generous. Don't bother watching it unless you're a huge fan of bad horror flicks and you're totally desperate. Watch Guillermo del Toro's MAMA instead.<br><br>Check out my IMDb List for some better suggestions. \"HORROR/THRILLER: Obscure, Overlooked &amp; Underrated\" http://www.imdb.com/list/8QFZ78e4Ar8/ :)","user":"NozinAroun81","rank":[17,21]},{"title":"hilarious, perfect for the background of a party","rating":4,"date":"27 February 2015","review":"If you want a horror movie that is a perfect example of so bad its good, this is it. This movie was $1.60 and it was worth every penny. The dialogue is line a minute hilarious and quotable, the story is awful but still better than some mainstream horrors, the acting isn't that horrendous but still pretty b-level. The most ridiculous flaws that stood out actually were the wardrobe decisions! the main detective's outfits always seemed several sizes too small and his ties were never done right. People wore wigs that had absolutely no reason to be wearing wigs and just the entire cast all looked strange and unnatural. <br><br>This whole thing was all just a big basket of poorly made crap that is absolutely enjoyable til the totally shitty end. <br><br>watch it.<br><br>this has been a review of Visible Scars.","user":"j_walking1516","rank":[4,4]},{"title":"Disappointing","rating":2,"date":"23 July 2013","review":"The movie was a big piece of cow (mixed in with horse) manure. Can't believe I wasted 1:42 watching this. It's like a made for TV movie: a bit slow paced, not too bloody, acting was a bit bland, the story background on one of the characters almost nonexistent, and the fact that the \"scarring\" was hardly noticeable (or believable as to how it was acquired), I could handle all that - BUT as you near the ending I think the editing department saw that it was too long, and ended up chopping the final scenes into disconnected pieces, leaving you with a sense of what just happened? It could've been a nice little movie, if they had put a little more effort into the last half of it. In other words written an ending that made some sense. There are a lot of good examples out there to learn from, like the reviewer Tahnik stated referring to \"Mama\" as one. So let's hope things improve in the future.","user":"icruz_55","rank":[5,8]}]