[{"title":"great movie for the whole family to enjoy","rating":9,"date":"21 February 2020","review":"Much funnier than the first one, Despicable Me 2 actually has me liking the second installation in a series much better than the original. A lot of sequels add in new characters. Some serve a purpose. Others not so much. This movie adds in new characters that are important. With funnier lines, funnier actions, and tons of minion madness, the movie has us focusing less on Gru's villainy, and more on the love life he never had.","user":"MR_Heraclius","rank":[36,37]},{"title":"Delightful Family Entertaining","rating":7,"date":"1 February 2014","review":"The ex-villain Gru is raising his daughters Margo, Edith and Agnes and researching a legitimate jelly and jam business with Dr. Nefarion and the minions. Meanwhile, a laboratory in Arctic is stolen by a powerful aircraft using magnetism. The Anti-Villain league (AVL) agent Lucy Wilde recruits Gru to help her agency to discover who has stolen the laboratory and its research. They know that the thief has a store in a mall, and Gru suspects that the owner of the Mexican restaurant Salsa &amp; Salsa, Eduardo Perez, may be the villain El Macho that is presumed dead in an accident. <br><br>\"Despicable Me 2\" is a delightful family entertaining. Who can resist to Gru, Agnes and the minions? And now, with Margo growing up and interested in boys and the clumsy but heartwarming Lucy Wilde, it is a great fun for the whole family. My vote is seven.<br><br>Title (Brazil): \"Meu Malvado Favorito 2\" (\"My Favorite Wicked 2\")","user":"claudio_carvalho","rank":[22,25]},{"title":"Good animated fun!","rating":8,"date":"23 June 2013","review":"I went to see this film this morning and found it very enjoyable. I can't really remember the 1st so I can't really compare. <br><br>Despicable Me 2 is a fast paced, funny, feel good film that keeps you entertained from the 1st minute to the last. The pace of the film moves along nicely and keeps the audience attention very well. It has many laugh out loud moments, a decent mix of children humour and adult humour. <br><br>The main character Gru (voiced by Steve Carell)is likable and funny. The minions however are the main stars, they had me laughing on multiple occasions during the film. The language created for the minions is very well done as they speak in a fictional language but you can always gather what they are saying.<br><br>I found the visuals very impressive, it was very colourful and very imaginative. The action scenes we also very well done.<br><br>Would definitely recommend seeing this, no matter what your age. I am 22 and thoroughly enjoyed this movie. It's not just for kids!","user":"MUFCOK","rank":[85,118]}]