[{"title":"Strong cast (bit weak on the inside)","rating":6,"date":"21 June 2015","review":"Obviously just going through the list of names should and will get people excited (who are into the action genre that is and know their favorites). Having Dolph \"team up\" with Tony Jaa is a great move. Though it doesn't really matter which side of the law people are, based on the decisions they make during the course of the movie. Which also means, there is quite a bit of fighting ahead of you.<br><br>Ron Pearlman does a good job with his accent (playing a Serbian) and there is one particular fight scene (about 20 minutes before the movie ends) that is really good. But there are also cuts in the movie that seem to take note on the \"jump cut\" book, but don't really work. The overall story is easy to tell, the core of it is something that unfortunately is happening all over the world.<br><br>Also Tony Jaas English performance was captured a lot better in Fast 7, there are some weird lines he has to deliver here (not convincingly then). Decently made then, but could've been better","user":"kosmasp","rank":[8,9]},{"title":"Through and true a hard-hitting B-movie, this union of Dolph Lundgren, Tony Jaa and Michael Jai White is any self-professed action fan's wet dream","rating":6,"date":"16 April 2015","review":"Every inch of 'Skin Trade' feels like a B-movie, but the good thing is that it doesn't try to pretend to be more. A passion project of Dolph Lundgren who started work on its script close to eight years ago, it knows exactly what buttons to push to get its core audience satisfied even as it tries to shed light onto a matter close to his heart, i.e. that of human trafficking. So if you're expecting a very angry Lundgren on a revenge rampage, or a mano-a-mano between Lundgren and Tony Jaa, or a similar one-on-one between Tony Jaa and Michael Jai White, we can reassure you that you won't be disappointed. <br><br>A brief prologue establishes the mechanics of Viktor Dragovic's (Ron Perlman) despicable business – under the guise of offering them employment, the former Serbian national's fourth son Janko (Leo Rano) and his accomplices lure gullible village girls from Thailand, Cambodia and Laos to leave their homes and journey to the city, where they are subsequently drugged and shipped to America and Europe to be sold as sex slaves. Lundgren's Newark police detective Nick Cassidy is tracking Viktor's latest shipment in order to apprehend him and his sons, while Jaa plays a Thai police officer Tony who is onto the same case from further down the food chain.<br><br>Their paths cross after Viktor is let loose upon diplomatic pressure and skips town, seeking refuge in a corrupt general's mansion near the Cambodian border. Unfortunately for Nick, Viktor's sons manage to get to his family before fleeing town, so after regaining consciousness from an RPG strike on his house, Nick decides to take his quest for revenge to Viktor. Thanks to Michael Jai White's rogue government agent Reed, Nick is framed for the murder of Tony's partner soon after setting foot on Royal Thai soil. Of course, who's good and who's bad will become clear quite quickly, but Lundgren and his co-writers have specifically engineered enough twists and turns precisely to fulfil their audience's expectations to see each one of the marquee action stars have a go at the other.<br><br>Much of the heavy lifting here is done by Jaa, whose speed and agility has not dimmed one bit since his 'Tom Yum Goong' and 'Ong Bak' days. While his Hollywood debut in 'Fast and Furious 7' may have been overlooked because of the crowded ensemble, Jaa's lead turn here will definitely not go unnoticed. His one-on-one with Lundgren in an abandoned warehouse is the film's halfway high-water mark, pitting a lean mean warrior against a much hulkier opponent – though there is no question in our minds just who is the one that is the better fighter.<br><br>It is no wonder then that Jaa is the one chosen to take on Jai White, the latter a much worthier opponent than Lundgren skilled in the art of kickboxing not unlike Jean Claude Van-Damme in his heydays. The fight between them is brutal and ferocious, choreographed specifically to illustrate the strengths of either actor, and next to the noisy and overblown finale at a remote airstrip that it precedes, is easily the climax that the film deserves to be remembered for. Indeed, while a sizeable amount of the limited budget on which the film is made for has been reserved for explosions and other fireballs, it is the raw thrill of seeing these natural born fighters go at each other knuckle-to-knuckle that is where its charm lies.<br><br>And in that regard, Lundgren deserves more credit than what may be apparent. It is no doubt thanks to Lundgren that we get to see Jaa in such a significant capacity – not only in a movie that respects the actor's Oriental roots but also one that gives him a role with both the breadth and depth for Jaa to showcase his abilities as an actor and as an action star. It is probably also thanks to Lundgren that the likes of Jai White, Ron Perlman, Peter Weller and Cary- Hiroyuki Tagawa have come together in the same film, a combination that is any self-professed B-action movie fan's wet dream. And it is Lundgren who manages to pull a movie with so many potential clichés together in a respectable fashion – as the latter scenes demonstrate, its director Ekachai Uekrongtham has a long way to go in learning how to stage a proper action sequence.<br><br>Like we said at the beginning, 'Skin Trade' doesn't pretend to be more than what it is – and much as there is a social message in here, it never tries to drive it too hard. Indeed, it is precisely by embracing its B-movie roots that it truly delivers, not just in the fact that it makes no compromises in keeping its action hard- hitting but also by ensuring that its actors are right up there without any doubles performing each and every one of the stunts. More than sex, that is the skin trade which truly matters, and which we suspect its audience will be more than happy to partake in.","user":"moviexclusive","rank":[28,44]},{"title":"Dolph is back with a bang in this superior, conscientious action thriller","rating":9,"date":"19 May 2015","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning <br><br>Nick (Dolph Lundgren) is assigned to a task force, dedicated to stamping out human trafficking networks, and his latest assignment involves one run by Russian mobster Viktor (Ron Perlman.) During a shoot out, Nick shoots Viktor's son dead, making him a marked man. When his family are killed in retaliation, Nick goes on an international manhunt for Viktor seeking revenge, taking him all the way to the East, where he crosses paths with Vitayakul (Tony Jaa), a similarly unorthodox cop who thinks Nick killed his partner and wants revenge. Nick must convince him of the truth and bring them together to track down the real criminals.<br><br>Having enjoyed a little more publicity than your average Dolph Lundgren action vehicle (including Dolph's notable live IMDb chat with fans!) Skin Trade does indeed have slicker production values and has more hype surrounding it's release than usual. With a lively supporting cast, including Perlman, Michael Jai White, Peter Weller and Cary Hiroyuki-Tagawa, and a timely, relevant social message at it's core, it's far from a perfect offering, but it's a huge cut above what you'd usually get.<br><br>The film matches the dark, heavy themes of it's story (murder, revenge and betrayal) with an equally raw, unflinching delivery of it's action, with it's lead stars going at it hammer and tongs in a collection of brutal, hard hitting martial arts showdowns and action sequences (including a bike chase sequences down the back passages of an Asian market!) While the story's heavy themes are matched by it's clichés, it's no less solid and effective, shining a light on a modern day blight on our world in the shape of human trafficking. It's all the more impressive from Dolph, who may be on the wrong side of fifty now, but is no less a convincing action presence. Likewise, Perlman (a.k.a. Hellboy!) is an impressive villain, with a fine Russian accent. But, leaping and flying around with deranged determination, it's Jaa again who steals the show, the martial arts dynamo simply mesmerizing doing what he does.<br><br>It's a touch clichéd, and the story doesn't quite flow with the lucidity to make it great, but it's still a superior, explosive thriller with a social heart. ****","user":"davideo-2","rank":[15,22]}]