[{"title":"Quietly gripping morality tale - a near perfect movie","rating":10,"date":"23 October 2011","review":"Saw this last night. Set at a Wall Street firm on the night in 2008 when the leaders realize that changes in the market will wipe them out if they don't immediately stop selling the products that have been making them all rich, the movie centers on the moral dilemma - recognized by some characters but dismissed by others - that they face in unwinding their positions, saving themselves but shifting the pain to others.<br><br>The movie finds a way to hold the mirror up to our civilization, showing how we are all complicit in a collective 'dream' (one character says at one point, in response to another who says he feels like he is in a 'dream', 'Funny, it seems like I just woke up'). The dream is the illusion of easy, risk-managed wealth that the financial markets manufacture, again and again, since the emergence of capital markets 200 years ago, until the illusion morphs overnight into a panic. Reality intervenes, fear takes over, and the 'survivor' is the guy who first reaches the lifeboat. So there are no villains in this movie, just people, richly drawn, beautifully acted characters realized by some of our best actors who relish the opportunity to show what they can do given a killer script and enough screen time between lines to actually be the people they are portraying. <br><br>Central to the movie's success: <br><br>1) It gets across the essence of what is going on in the financial markets without bogging us down or dumbing it down<br><br>2) finding a moral question that can be resolved in a night, yet which is nevertheless a perfect allegory for the whole set of moral questions raised by an economy that works the way ours does, rewarding false confidence, recklessness, and deceit as often as industry, skill, and integrity<br><br>3) the placement of young, innocent but perceptive characters at the center of the drama, who function as our eyes and ears, who are like stand-ins for all of us who weren't there, at the heart of the dream machine, when the latest fantasy of easy wealth was exposed as a collective delusion<br><br>4) really 'gets' the trader ethos and manner - they are a kind of warrior caste, foul-mouthed, impulsive, deeply selfish, surviving by their ability to outplay their counterparts, and yet living by a warrior code that sets boundaries on what they will and will not do to one another (having spent three years on Wall Street several panics ago, it rang as true as any movie I have seen on the subject)<br><br>It's like Mamet, except you don't have to work as hard to figure out what everyone's up to. It's like Chinatown, except the 'crime' is something far worse than molesting a single young girl. These guys f****d the entire planet, for Ch*****sake. It's like the best movie I've seen in a little while.<br><br>What an incredibly sure hand from a director on his maiden voyage! Who is this guy? Whoever you are, please don't stop. I would pay a lot to see what he could do with topics like 'the decision to go to war', or 'the emergence of China/India/Brazil/Indonesia from poverty to global player'. Hell I would go see him revive Mother Goose, after this debut.<br><br>I'll calm down now. Enjoy.","user":"mgorman-6","rank":[316,370]},{"title":"Great psychological insight","rating":16,"date":"16 October 2011","review":"The movie \"Margin Call\" depicts the events that immediately preceded the Financial Crisis in 2008 within a nameless Investment Bank. What I like especially about the movie is the fact that it doesn't try to explain the technical causes of the Financial Crisis but the psychological causes - human failures, which are the real cause for the Crisis: greed, egotism, ignorance. Many scenes in this movie deal with very little dialogue, instead the body language and the unique atmosphere speaks for itself. The ensemble is just brilliant, especially Kevin Spacey and Jeremy Irons.<br><br>The movie works solely from inside the nameless firm – apart from minor steps outside. It only portraits the people working inside this company - the \"normal world\" is completely left out. The effect is a very clever one: The life of these bankers seems totally severed from the outside world, they have no real connection with normal people and seem to – speaking exaggeratingly – lack an understanding of real human values, that there could be more behind life than just maximizing and making money. They are completely left behind in their own world, which somehow got out of control. Even when the imminent truth reveals and the consequences are becoming more clearer, it always feels like they are cut off; there is a scene in a taxi with Quinto and Badgley that underlines this.<br><br>But one can also witness the cold-blooded atmosphere in the system itself, where every person could easily be mistaken as a number. A key figure of the film, Eric Dale, who gets sacked in the beginning, is confronted with two managers in a scene like from \"Up In The Air\". Either are these women robots or have never experienced something like social warmth. One widely held position is that eventually bankers themselves didn't understand their own system and products with Derivatives and Futures, etc. anymore. Almost hilarious, but sadly true is the fact that many people in these companies seem to have no understanding of Economics and just got into their position due to influence or money. When they are sitting in their conference room and discuss the incident, it feels somewhat grotesque.<br><br>Although this movie works almost completely without music, the tension is so immense - thanks to the brilliant actors - that one is forced to focus.","user":"philipp82","rank":[171,201]},{"title":"Really good. Go see it.","rating":8,"date":"24 March 2011","review":"Saw this at New Directors festival in NYC and really enjoyed and was engrossed in this film. A great cast with splendid performances. The film is very intense and although it is about a company involved in the financial meltdown of 2008, it really is about much more. I particularly liked the way the film depicts the frightening absolute and ruthless power of the corporation over the lives of people that work there as well as the implications and ripples for everyone else.How those people get sucked in to the embrace, security and pleasures of what the corporations have to offer and the consequences and vulnerabilities of those choices.The freedom and comforts that we cherish here in twenty first century USA are not as secure as we might think. Don't want to say much more, other than that \"Margin Call\" is very involving and in the end affecting and thought provoking.It packs a powerful punch.","user":"endecottp","rank":[176,210]}]