[{"title":"Surprisingly Good!","rating":8,"date":"4 September 2011","review":"This was one of those movies where you aren't really sure what to expect when it starts, and it starts out with a sexual scene that introduces us to one of the main characters. I watched this with my boyfriend and we both agreed it was a surprisingly good movie, you really feel for the main characters, and it's a bit of a \"heartwarming thriller\". <br><br>I recommend this movie if you're looking for an action movie with heart, the first 30 minutes are a bit slow-paced and you might wonder what this movie is about, exactly. However once the main characters come together, the plot gets going and there are a lot of nicely filmed chase scenes and a few plot twists that keep the audience interested, both male and female. <br><br>Ladies, despite the cover and the subject matter, I think women will enjoy the strong sisterly bond between the two main characters and the warmth and caring in their relationship as much as the men will enjoy the action and ample amount of nude scenes in the film. It was definitely not what I expected it to be!","user":"snlash","rank":[68,90]},{"title":"A gritty roller coaster ride","rating":7,"date":"4 September 2011","review":"Holly (Viva Bianca) is a call girl who is in her last night job before she's going to quit and start a new life in France with her obsessive client.<br><br>Shay (Hanna Mangan Lawrence), a 17 year old who had a troubled childhood arrives in Sydney for her first night on the job. She faces the arduous nature of the job (having no money even to eat) - giving handjob to an old man, jealousy of other street hooker and pimps.<br><br>Holly and Shay cross paths for a job. When both of them witness a murder by a crooked cop, it turns out to be a cat and mouse chase with unexpected twists.<br><br>There's a lot of nudity and sexual acts - including Holly's opening lovemaking scene with a male prostitute before the rich middle aged women. Though one may get the idea even from the movie poster that this is an erotic movie, it is more apt to be tagged as a thriller than an erotica. None of erotic scenes are meant for us to enjoy it because the Director (Jon Hewitt) doesn't wants us to; instead he wants us to concentrate on the hard-hitting storyline.<br><br>There is commendable acting by every character involved in this thriller. And cinematography aids us to glue to our seat. This is an exploitation movie in line with Irreversible (2002) with ultra violence and sex abundantly thrown in.","user":"sunrays6","rank":[35,47]},{"title":"Brilliant Film - If you give it a chance.","rating":8,"date":"16 June 2012","review":"Don't be beguiled by the low IMDb rating. This film has a lot more to offer than viewers seem to allow.<br><br>The tag-lines seem to give off a different vibe, making it more sensational; of course, this may be the reason why high expectations come out of the oven flopped. This film is NOT a \"Night of Vengeance\" - trust me when I say that the whole idea of \"avenging\" is completely bogus. If anything, it's more a story of two women living on polar-opposite sides of the spectrum, who try to survive and make a life by whatever means they have.<br><br>It details their life by a serendipitous encounter, a span of perhaps two-three nights, which builds into a climax. There is a thriller element, but it's not really the central issue. If anything, it's a side-factor which builds onto the story - onto THEIR story.<br><br>My advice is to have an open mind and absorb the story - it's not the mainstream plot development, although there is a definite construct evident in it.<br><br>Personally, I was more impressed by the cinematography and the editing. Everything felt freshly dynamic. The wild action scenes were cuttingly ragged and energetic, which was highly contrasted against the gorgeously delicate ones. I would give it an 8/10 for the aesthetics alone.<br><br>If I had to describe the film in one word, it would be \"sensual.\" Everything about the film, from the audiovisuals (music, ambiance, colours, etc.) to the dialogue stimulates your senses.<br><br>Caution: there are a few scenes of explicit nudity and violence, and other provocative scenes which may feel distasteful to the prudent mind. To be frank, I think it lends the film an honesty which is hard to find in motion picture these days. However, if this sort of thing isn't your cup of tea, I would recommend against it.<br><br>I hope this helps.<br><br><ul><li>Spreaddapoo</li></ul>","user":"spreaddapoo","rank":[13,17]}]