[{"title":"Ignore the bad reviews, Your will love it !!","rating":10,"date":"2 April 2017","review":"I do not usually write reviews but these hating reviews got me into that :D I don't get all the people complaining about how predictable this movie was. God damn it if you want some unpredictable ending go watch \"shutter island\" or \"mulholland drive\" or something that SAYS that it is a freaking THRILLER!!. This movie is a \"Romantic Comedy\" and it is just like \"Pretty Woman\", \"10 Things I hate about you\" or \"say anything\" - The movies we loved, even if they were predictable. The point is, its not about the ending, its about living in between the movie; desperately wanting for them to recognize love and chanting for there friendship and adoring their silly fights and commitments. <br><br>For all those who just want to enjoy there weekend by watching a beautiful romantic movie and smile I recommend them to do watch this and ignore all the hate and bad reviews. Have fun :)","user":"samxxx-671-826221","rank":[102,117]},{"title":"Love, Rosie and When Harry met Sally: normalcy and making a film relatable","rating":9,"date":"22 February 2018","review":"When I finished watching this film last night I had tears down my face and was helpless to my own pondering about what this film was showing. The last time I was so invested in characters in a Rom-Com was \"when Harry met Sally\" but even though the film was not as artistically proficient, it still impacted me on a far greater level. Needless to say that I experienced \"love, Rosie\" in a vastly different way to professional film critics, one of whom said:\n\"Do you really want to expose your adolescent daughter to 100 minutes of the beautiful Lily Collins accepting second-best, over and over and over and over and over and over and over again?\"\nThe reality is that we do, especially as adolescents, experience just this. <br><br>The premise of the film is simple and yet also a little unoriginal. Rosie and Alex are best friends from childhood but they fail to see the chemistry between them. It takes them 15 years from the point they leave sixth form college to realise they have been looking for one another all that time. So far so \"when Harry met Sally\" but where these two films diverge, and where my interest was piqued, was how the film sets this up. When Harry actually meets Sally, they part ways, return and then part ways again. The third meeting is the lucky one and they build their friendship to love. The story evolves around these two figures slowly building a relationship that gains depth neither expected. The key theme is how love is most stable when built upon friendship.<br><br>Love, Rosie, on the other hand, focuses on relationships, and that we often choose poorly. It begins with a run through of Rosie and Alex through childhood, establishing their chemistry through how the characters speak to one another, their body language around each other, and how they react to their choices of lovers. They are already friends, so the film instead challenges them by keeping their love apart by their own choices. To push my point home there is a scene at the start where Alex is contemplating who to take to the end of year school dance; will he choose Bethany or Rosie. This is a form of foreshadowing, but also reveals how these two characters interact. Rosie's tone shows she is hurt that he is making this choice so she tells him that she has been asked by \"the hottest guy in the year\" (the narcissistic Greg) to the dance. Neither chooses each other and it is clear that Rosie dislikes this (note that the film is from her perspective), even though she says nothing about it until at least an hour into the film. The point of this is that we see immediately that these two characters know each other, have done for a long time, and are interesting in one another but lack the courage to pursue their feelings. A contrasting scene in when Harry met Sally is the day \"date\" they have, enjoying New York, which concludes with Harry asking Sally to the cinema to find she is already going on the date; this sequence is one where they get to know each other, which contrasts with the already established friendship of Rosie and Alex. This is a highly different dynamic.<br><br>\"Love, Rosie\" focuses on a romance that is convincing consequently, for the dual reason that their friendship is convincing and realistic, and that Rosie and Alex are both very flawed characters; they are truly 3-dimensional characters because they are imperfect and make bad decisions throughout the story. These decisions are relatable too; they experience romances that go wrong or have tough times due to conflicts of character or difficult events. I can't really go further without spoiling major plot points and I've done my best to keep the review as spoiler-free as I can, but I will say that I knew the events intimately for their realism and made the film hard to watch. The story told is essentially a film of normal life, by which I mean that the events of the film are events we have all experienced in some way either directly or second-hand. In contrast to the tried and tested plot the story is highly original due to its reliance on normalcy.<br><br>We often watch films for escapism, to endulge in the ridiculousness of cinema; Star Wars, Lord of the Rings, the Martian, Inception, all these films have high stakes that we enjoy for the thrill of catharsis. Even Rom-Coms have this streak of the abnormal from the myriad of hollywood love stories in Love Actually to even the handsome stranger cliche of Colin Firth's character in Bridget Jones's Diary, we are shown love stories of sunlight and roses, of mistakes but a resolution within days or even weeks. \"When Harry met Sally\" crafts a wonderful picture of two great characters slowly falling in love, but their other love interests are left to the side and unshown. \"Love, Rosie\" shows these failed loves, and also shows how both Rosie and Alex repeatedly make the same mistake bringing home a relatable lesson; love does not come quickly, but sometimes it is found where it has been infront of your eyes all along.<br><br>Yet there is still more to this. We sometimes look for clever cinema that makes us think about ideas complex in philosophy or morality. I've lost count of the number of people who have finished inception and told me they want to know if the spinning top finished spinning. The bottom line is that this is only a superficial question that is put to the side when you realise the answer doesn't matter beyond the context of the film. What I discovered upon finishing \"Love, Rosie\" is that it is really the problems and realities of life that make us think. A flawed and imperfect life is the most normal thing for us, and this film captures the charm in the imperfection, challenging us to think introspectively about our own lives and love experiences.<br><br>Sorry about the long and rambling review. This film made me think more than I expected. THe key point is watch this film. It is charming, funny and very relatable.","user":"Billylkbrooke","rank":[22,23]},{"title":"A good romantic movie","rating":9,"date":"12 April 2015","review":"As a fan of the original book \"Where Rainbows End\", I had been kind of disappointed when people told me that there are many differences between the novel and its adaption on the big screen. However, I changed my prejudice when I finally saw it myself. The movie is romantic, with beautiful-filmed scenes (I love the color throughout the whole movie), and moving. The music sounds good (gotta buy the soundtrack!) too. And I love Lily and Sam Claflin as Rosie and Alex, as you can really feel the chemistry between them from the very first minutes of the film. Perfect casting :) I don't care about how unreal the plot is. It just feels good watching a slice-of-life movie like this once in a while.","user":"knorr102","rank":[44,55]}]