[{"title":"Cuba's string of good movies once again stops at one. A very slow paced, kinda boring movie. Not one of his best. I say C","rating":5,"date":"27 April 2011","review":"Can you have a second chance to stop a tragedy? After losing his wife and child, undercover cop John Hebron (Gooding Jr.) is struggling to forgive himself for not saving them. After a similar crime takes place he is given a second chance. After watching Cuba in \"Ticking Clock\", which I really liked, I had high hopes for this one. I was a little disappointed. The idea of the movie is very interesting, but the execution is lacking. A plot that has so much potential ends up being slow moving and never given the push it needs to make it as interesting as it sounds. This is not a terrible movie, but definitely not one of Cuba's best. It would be nice to see him get out of the Seagal, Kilmer &amp; Snipes-like direct-to-video movies though and back into main stream movies. He has the talent for them still. I give it a C.<br><br>Would I watch again? - I don't think I will.","user":"cosmo_tiger","rank":[13,14]},{"title":"So bad its bad","rating":1,"date":"15 February 2011","review":"Wow, what a trainwreck. Where to begin...I suppose by this time you have more than recognized Cuba's downward spiral but teaming him up with Slater is an even more embarrassing turn for both actors. Slater has been pawning off his creepy yet campy style for years now and occasionally pulls of an entertaining performance (Dolan's Cadallac, He was a quiet man), but here he just swims in the dreck. Horribly miscast as a priest, he can do little more but smirk at the camera and look at his shoes. Devon Bostik is laughable as a drug dealer - I mean really, Wimpy's kid's big brother is now a tough guy? Just a total mess and a shame for all involved. I had hopes that Cuba would rebound at some point, but he seems determine to join Wesley and Steven Seagal in the DTV \"worst of\" series. Seriously, don't waste your time or money on this, bad bad bad.","user":"MovieMaddis","rank":[53,75]},{"title":"Terrible!","rating":3,"date":"2 March 2011","review":"I seen the other reviews and some gave it high votes and some very poor which then forced me to watch it.. Boy should I have listened to the low votes its terrible. Acting is all over the place and not in any good way even the fake irish accents of some of the cast were enough to make me cringe. Storyline had no depth and I wouldn't even say it was good enough for a TV movie as it simple had nothing of interest in it to keep people occupied. I sit here puzzled as to why the actors even made this movie as its the worst thing I have seen in a long time. Best advice on this movie is give it a complete wide birth not only is it not worth a rental fee its definitely not worth the waste of electricity to power a TV!","user":"mattwilkie-990-581319","rank":[16,21]}]