[{"title":"Low Budget Indie Gem with a SciFi Twist","rating":8,"date":"8 April 2012","review":"Hollywood Executives could take a few notes from this film.<br><br>I came across this title by pure chance. I half read one review that mentioned \"Lost\" and Twilight Zone\" and was sold.<br><br>This movie comes across as very low budget I guess $1.7 mil is low budget these days. But don't get me wrong there is nothing wrong with low budget...you know the old cliché'. \"It's not how big it is it's what you can do with it that really matters.\" The movie is mostly shot in one ominous location which gives it a very claustrophobic and tense atmosphere. For the first half of this movie I had no idea what to expect. I was anticipating another horror fest but am happy to report it's nothing like that. About half way through the movie the characters begin to realize how they are all connected. When you find out how, it's a bit of a goose bump moment.<br><br>I really dug the moral of the story which is basically how one terrible decision can change not only your life but of those around you in such profoundly life altering ways.<br><br>The acting was pretty good, complete unknowns to me but that's a plus in this case. The script felt tight and real. While some may have to considerably suspend their disbelief I felt the premise really worked here.<br><br>Highly recommended for anyone into metaphysical contemplation.","user":"subspace2010","rank":[70,76]},{"title":"Simple and effective","rating":7,"date":"15 April 2012","review":"An indy without benefit of name director or stars, this is still one worth catching for those who prefer their supernatural in the tradition of \"Outer Limits\" or \"The Twilight Zone\". In true Serling-esque fashion three strangers arrive separately at the abandoned cabin that forms the setting for most of the story, one that convincingly fleshes out recognizable relationships between a man and two women who at first share little more in common than a need to get home. Each failed trip into the woods reveals something of their situation and each other, moving steadily toward a final revelation kept well under wraps.<br><br>Limited locale puts extra reliance on the cast and they deliver solidly. Special credit though goes to Sara Paxton, who so impressed in \"The Innkeepers\", as the petty thief skirting the edge of control.<br><br>For an obvious work of limited resources, \"Enter Nowhere\" makes excellent use of them all to come up with one of the better small films I've seen in a while.","user":"Vantec","rank":[55,61]},{"title":"Great mystery thriller. Has Cult Classic written all over it.","rating":10,"date":"4 April 2012","review":"I hardly ever leave reviews, and whenever I've felt the need to review a film in the past it has always been because they've been so bad I've wanted to try and save somebody from wasting their time and money watching it. The reason I'm leaving this review couldn't be any more different. I've just finished watching this film, and while it's never going to win an Oscar or be a massive summer blockbuster, it was a very well crafted little movie. It held my attention throughout and every time you think you've got it figured out it throws you a curve ball, and while I'm not going to give anything away, I will say that my first thought that this was a retelling of John Paul Satre's No Exit was dead wrong. What prompted me to write this review was the unbelievable low rating it has here on IMDb. I understand this type of film isn't for everyone, and it has obviously been made with a low budget, but it is well acted, well written and very well put together. And something this film has over a lot of other films of this type is it very neatly ties up all its plot threads. If you're at all curious about this film, give it a go, you will not be disappointed. I couldn't recommend it highly enough.","user":"misplacedsanity","rank":[116,134]}]