[{"title":"About standard but a nice way to wrap it up (if they do)","rating":7,"date":"17 January 2013","review":"Final Destination, when it was first released in the year 2000, was my favourite film for a number of years, so I've made a point of seeing all of the sequels. Very few film series get this privilege on my part (Saw and Paranormal Activity are some of the few that come to mind for me). And if there's one thing I've learnt along the way from the Final Destination films, it's that there isn't a lot of areas to continue to be creative in. In fact for me the only interchangeable area is really how the characters die. And fortunately that's been enough to keep some of us coming back.<br><br>So was Final Destination 5 inventive enough with the death scenes? Not in my opinion no. It all felt very 'seen it all before' and while they were able to shock us occasionally with the resulting method of death, there still wasn't enough surprise there.<br><br>I think Final Destination 5 needs to be the last film in the series. And not just because it's all getting a bit stale, but also because it was a really good way to wrap it up. At the end of the film we are treated to a twist that the whole film was in fact a prequel to the first Final Destination. And no they didn't cheat, there were indeed hints to it throughout the film. This was a nice touch and would mean that the fourth film in the series 'The Final Destination' was actually still somewhat true to its title. A really great series that I will remember for a long time, I just hope it stops here.","user":"jtindahouse","rank":[16,16]},{"title":"My review on Final destination 5","rating":12,"date":"12 August 2011","review":"I had low expectations when I entered the theater to see the 5th installment of the FD series, because the 4th movie was such a disappointment. But after watching it, I was surprised. <br><br>First off,this movie was way,( and I mean), way better then the last two movies were. It was darker and had a lot of elements from the first movie, which I loved. I don't want to give away too much, but I do want to say that the last scene of the movie will leave you speechless. It had me thinking, \"OMG, that was AMAZING how they came up with that twist.\" <br><br>One last thing I loved about this movie was that it was well planned out and thought of, unlike the forth movie which was a joke and in my opinion, shouldn't have never been made. The deaths weren't rushed as opposed to the deaths in the forth movie, and it gave more screen time to introduce us to the characters. <br><br>Note: I will say that there is one death scene in the movie that I didn't see coming, besides the ending. <br><br>I recommend you see this movie. It might have the same theme as the first four movies, but unlike the first four, it's on a much higher scale.","user":"rosst18","rank":[104,139]},{"title":"Gruesome and impressive","rating":9,"date":"12 August 2011","review":"I'm a huge fan of the Final Destination series. They aren't Oscar contenders, but they are certainly quite entertaining. However, after hearing a lot of negative feedback on the 4th FD, I decided not to watch it and hung my head in disappointment. I genuinely thought my favorite deadly franchise had finally bit the dust itself, and in a bad way. But when I heard about this fifth and final Final Destination, I decided to give it one more chance. Because hey, I hadn't been to the theater in awhile and if it sucked I'd at least have a good laugh. But, I am very happy to report that I was pleasantly surprised by Final Destination 5.<br><br>The story, as other reviewers have mentioned, really sets FD5 up to good prospects. It feels a lot more like the first FD, much darker without being too complex. I honestly liked the 2nd and 3rd ones a lot, but they were missing the creepy factor that the first installment had. This fifth episode really brings it back. The characters are surprisingly believable. Granted, you have the gratuitous hot chick and ladies man, but the characters never feel contrived or forced. Kudos to the actors for keeping this from being a $5-bin campy horror film.<br><br>The effects, even in 2D, were just as I think a film's effects should be: realistic enough to avoid the fake-factor, but not so excessive that they drown out everything else in the film. Yes, one could argue that these movies are all about death, but what always made them different for me from other horrors was the focus on build-up. The FD franchise has it's fans trained to watch for every little thing in a scene that could cause someone's demise until your skin crawls--and FD5 gives the audience this \"detective\" feeling perfectly.<br><br>To be honest, I wasn't expecting much out of this movie. However, from the very beginning, I was impressed. A few points of warning: it is very graphic, but anyone who has seen any of the other FD films should know that already. Also, you will not enjoy this film as much if you haven't watched at least the 1st FD, if not the 2nd and 3rd as well. When you factor in the story and characters, the death and mayhem we've all come to love, and one of the best plot twists I've seen this year, FD5 is very worth watching. Go on, have some fun.<br><br>But you all just be careful, now. ;)","user":"birdieleigh","rank":[89,124]}]