[{"title":"Night Night Sleepyhead !!!","rating":8,"date":"17 September 2011","review":"Rating - 7.5/10<br><br>Way More than an average Thriller, missed by decimals of being a great one. DEFINITE Watch for Thriller Lovers. Others - You won't be disappointed.<br><br>Story - Thorne is \"the\" Detective with \"a\" Past who while investigating a case of serial killing, struggles to keep from a case in his past . 3 girls have been found dead when the fourth victim Allison Willetts survives a stroke (artificially manipulated through pressure points on head and neck as in the dead victims) and is unlucky to be alive.She is completely paralyzed but can hear, feel and understand whatever goes around her. The police believes that the Killer has made his First mistake by leaving her alive. The Mystery unfolds with time of who this serial killer might be and what happened in Thorne's Past homicidal case. <br><br>I didn't really have a very positive feel when i decided to watch it(had not heard much about it) but it turned out to be one of the Good ones. I loved the Depiction of Allison Willetts, who has been paralyzed due to the attack. Thorne was a very convincing character and so were the others. All in all Great Acting with a Nice Cast.<br><br>Highly recommended if you are looking for a thriller !!! Just Watch IT.","user":"ajit-jake","rank":[37,44]},{"title":"A Dandy Little British Television Series","rating":9,"date":"17 June 2012","review":"Now and then during channel surfing late at night there appears something new and unknown that results in making the viewer wish for more. Such is the case for the series THORNE. It is a high tension thriller of a series.<br><br>'Thorne' is DI Tom Thorne (David Morrissey) who in the Sleepyhead episode enters an investigation into a mysterious serial killer. His first three victims ended up dead. His fourth was not so fortunate. Alison Willetts (Sara Lloyd-Gregory ) is unlucky to be alive. She has survived a stroke, deliberately induced by manipulation of pressure points on the head and neck. She can see, hear and feel, she is aware of everything going on around her, but she is unable to move or communicate. In leaving Alison alive, the police believe the killer's made his first mistake. And it is this kind of complex story-weaving that makes this a very tense and enjoyable series. Written by Dudi Appleton and Jim Keeble and directed with panache by Benjamin Ross, the large cast includes some very fine actors - David Morrissey is at the top of the list - that includes Eddie Marsan, Sandra Oh, Lily Loveless, Neil Kelly among others. We can only hope that this 2010 series has more parts to it and that those episodes will reach our shores and TV screens. Definitely recommended for lovers of high mystery and thrillers. Grady Harp, June 21","user":"gradyharp","rank":[21,24]},{"title":"Very British","rating":7,"date":"28 June 2012","review":"These British shows all seem locked into the same way of presenting their story lines: a good start, a nice development of characters, weak dialogue, ending in ever expanding vast plot sink holes. This one does a nice job of dangling a variety of \"suspects\" in front of you, but unfortunately falls into the \"don't ignore the first suspect\" method. It's always nice to see McElhone and Morrissey never bores, but in the end the ludicrousness of the plot twists ever morphing does it in. <br><br>***********************SPOILER********************* Tell me how does a non medical individual gather half a million pounds worth of medical equipment, set it up securely in an abandoned slum, set up electricity that would cost a fortune and would alert the authorities, off of a janitor's salary??","user":"ikanboy","rank":[15,20]}]