[{"title":"One man's determination ... six men's daring","rating":8,"date":"14 September 2012","review":"KON-TIKI (2012) <br><br>During the 20th century some individual achievements so captured the popular attention as to become iconic: Lindberg's flight across the Atlantic, Hillary and Norgay's conquest of Everest, Roger Bannister's four minute mile. Thor Heyerdahl's 1947 voyage across the Pacific was one of these events. His book, Kon-Tiki, sold tens of millions of copies, and his 1950 documentary won an Academy Award, as much a recognition of the feat as the film.<br><br>Norwegian directors Joachim Rønning and Espen Sandberg have now decided to put on the screen a dramatized account of Heyerdahl's expedition. But the obvious question is how can you make interesting the story of six men confined to a small wooden raft for 101 days? In fact by comparison to the exploit it recorded, the original documentary came across as rather bland, precisely because of such limitations. But this new film is anything but tame, and succeeds in combining striking photography of the adventure itself with a compelling look at one man's quest to show that \"it can be done.\" <br><br>The strength of the picture is that it situates the voyage within the context of Heyerdahl's struggle to get the scientific and financial support to try out his theories. He had speculated that Polynesia was settled by Inca voyagers who had used the prevailing currents to drift across the Pacific on rafts similar to the one he would build. (He proved this possible, although DNA testing suggests that Polynesians share a predominantly Asian heritage.)<br><br>Heyerdahl had developed this premise much earlier, but after World War II, he made serious attempts to secure the backing for a voyage that would test his theories. Not only did he encounter opposition from those who felt that he was wrong, but even more often he was dismissed as a fanatic with a suicidal plan.<br><br>Eventually he did manage to scrounge some backing, including private loans, help from the Peruvian authorities and supplies from the U.S. Navy. Perhaps more importantly, he found five companions who had confidence enough to put their lives in his hands. All were Norwegian except Bengt Danielsson, a Swede with an interest in migration. Erik Hesselberg was the navigator. Knut Haugland and Torstein Raaby, both heroes of the Norwegian resistance, were the radio experts. Herman Watzinger was an engineer who helped design the raft, and who recorded much of the voyage's scientific data.<br><br>Although he took along modern equipment, Heyerdahl was concerned that the raft itself should be constructed only from materials that were available in ancient times. Accordingly the raft was constructed from logs tied together with rope, surmounted by a thatched cabin and a large cloth sail. The raft itself was about 45 by 18 feet (13.7 by 5.5 m), and the cabin about 14 by 8 (4.2 by 2.4 m). The crew sailed from Callao, Peru, on April 28, 1947 and arrived in Raroia in the Tuamotu Islands on August 7.<br><br>The film succeeds by contextualizing these 101 days at sea against Heyerdahl's struggles to get the expedition underway. Although the inevitable storm and the equally foreseeable shark attack have their moments, the movie similarly attends to the relationships among the expedition's six members, their level of bonding to Heyerdahl as leader, and his own relationship with a wife who wanted to be supportive, but who found the risks unacceptable. It establishes the overall context by its early sequence dealing with Thor's honeymoon stay in the Marquesas, where he began to discover the apparent Inca connections that led to his theories.<br><br>In the central role of Thor Heyerdahl, Pål Sverre Valheim Hagen must carry the story, and he does. His re-creation of the historical character is convincing as the embodiment of determination, not quite obsessive but coming close, as he plans, argues and cajoles to try to turn his project into a reality. As his fellow Norwegian crew members Odd Magnus Williamson as Hesselberg, Tobias Santlemann as Haugland, and Jacob Oftebro as Raaby are equally credible figures: young, heroic, and willing to give Heyerdahl their trust. Playing the only non-Norwegian in the group, Gustaf Skarsgård as Bengt Danielsson is a little detached, but perhaps even more intellectually committed than the others to what they are about. For contrast and drama, the filmmakers apparently took liberties with the character of Herman Watzinger, played by Anders Baasmo Christensen. Christensen does well with the part given him, although the real-life Watzinger was almost certainly stronger and more competent than the movie shows him. Given that she must play an ambivalent role, Agnes Kittelsen as Liv gives a very effective performance as Thor's wife and the film's only prominent female character.<br><br>Gorgeous photography and great production values set Kon-Tiki off. The Pacific Ocean scenes were actually shot in the waters off Malta, the tropical ones in the Maldives and Thailand, with other locations in Norway and the U.S. used as appropriate. It is a real accomplishment that even with the limited space of the raft cinematographer Geir Hartly Andreassen never lets it become visually boring. Going from the micro to the macro, he manages to keep interesting also the vast empty spaces of the ocean, which emerges as a living character in its own right, often peaceful, sometimes petrifying, always powerful.<br><br>It must have been a temptation for the directors and principal screenwriter Petter Skavlan to fictionalize Heyerdahl's exploits and to create a stunning action/adventure tale on the lines of A Perfect Storm or White Squall. Thankfully they recognized that Heyerdahl himself was a character larger than life whose daring voyage became an extension of himself and his ambitions. In doing that they keep alive the iconic figure that he was, and give audiences some appreciation of how the sheer willpower of one individual can produce deeds that capture the imagination of the world.","user":"laheyray","rank":[83,98]},{"title":"Why like this?","rating":1,"date":"15 July 2016","review":"First time I read the book of Thor Heyerdahl when I was 10. Have been reading it 10 times since then and for me Thor Heyerdahl is a true modern hero, much like James Corbett or some other few guys, who at one side are men of science, realistic planners, believers of knowledge and studying rather than emotional Indiana Jones's. At the other side they are people with great courage, true humanists and deeply in love with nature - as human is just a part of this organism we call \"life in planer earth\".<br><br>Watching this movie was deep disappointment, especially knowing it was made in Norway.<br><br>The book about expedition has several dimensions.<br><br>First one is a planning phase. That's the most calculative part of the story and it has always wowed me, how much different planning there actually was. All the logistics - materials, people, building, money, supplies etc. Documents, approvals etc. The right crew - gotta make it work.<br><br>Heyerdahl's expedition was ultimate masterpiece of planning &amp; organizing in a very short time - they got the money, they got all the supplies. They got true balsa wood although they were repeatedly officially told to forget about it. They built this complex raft exactly like its ancestors were built 1000 years before, and they made almost nothing wrong. Its an ode to smart and patient men with hands of gold.<br><br>The second dimension was the expedition itself - process of learning ocean, of learning to control the raft, of learning to navigate, of adapting to extreme living, of dealing with your fears being far from any land, of forming a well functioning team and building friendships. Process of everyone rising to their specialty in this new environment. <br><br>Third one is being @ Raroia and Tahiti. It's a different one and is missing from this movie at all.<br><br>Unfortunately - all this good stuff is gone from the movie, replaced by weird, overly simplified melodramatic approach. Why the cheap drama? <br><br>To carry out a great idea, which is doable, but unspeakably difficult - it takes a lot of wisdom, most precise planning, cooperation. It takes learning, patience, lot of processes which are ultimately exciting to follow.<br><br>Why throw all of it away and replace it with a hollow, fictional dramatic elements, that either never took place or had never any importance whatsoever?<br><br>Whats really wowes you in the book - is their courage and confidence to themselves. In the movie there is like a bunch of scared schoolboys on a raft, when actually they were all very highly qualified scientists or specialists - handpicked by their personal qualities who made this story happen with their will.<br><br>In addition - as this movie tries to tell the true Kon-Tiki story, it's really annoying there's so many details, which are simply wrong. Herman Watzinger wasn't simpleminded refrigerator salesman - he was cooling engineer in the middle of his doctoral studies - he took care of all the thermodynamic, meteorological and hydrographical measurements. Also a true leader, tough guy, strong as a bear (citing to Heyerdahl).<br><br>Also - it wasn't Herman, who harpooned the whale shark - it was Erik Hesselberg. And he didn't do it out of fear rather than out of excitement. Also - the dance around the radio device is total bs - Thor was actually against of bringing the radio - ancient sailors didn't have any radios and also - he did not feel any appeal to the wires and electric switches whatsoever. Finally Watzinger convinced him its a good thing, they can help out meteorology stations in US etc. <br><br>Also - sharks did not touch the parrot, it was just a big wave on a stormy day. Sharks prey bigger objects than the parrot. This was really stupid moment and the following was just as ridiculous - Knut didn't catch the shark to get revenge for eating a parrot :D They used to catch sharks with their bare hands all the time for sport - the descriptions about this \"sport\" are far more exciting in my mind. <br><br>Also - Watzinger didn't splash in the ocean just wondering on the log. It was another occasion and he just went swimming. As it turned out, raft was moving so fast it simply drove away from Watzinger, although he was a great swimmer. Then they saw a shark approaching to Watzinger - and Haugland went in with the rope - barely saving Watzinger. <br><br>Also - all these stupid confrontations between Thor and crew members, where Thor acts like sociopath leader - are total bs. This whole group dynamics is just simply wrong - there was no such things at Kon-Tiki. Although Thor was a captain - Hesselberg was only true sailor on board, who did all the navigation. And as they were all grown men, there was rather a cooperative spirit on board, they were about business. In real life - it did not center around Thor - everyone got their fare share of adventures. So they all were pretty famous to the end of their lives after the expedition. <br><br>So all in all - avoid this movie, read the book! Then watch the documentary. And then watch documentary about Thor Heyerdahl's grandsons Olav's same expedition in 2012, on identical raft named Tangaroa.","user":"andriz","rank":[38,44]},{"title":"Intrepid Explorers Follow Charismatic Thor Heyerdahl","rating":9,"date":"5 January 2013","review":"As of 1/4/13, Kon Tiki is on the shortlist of 9 for Academy Award Foreign Language film; list of the 5 final nominees is expected next week.<br><br>Beautiful cinematography...including magnificent scenes of whales &amp; sharks circling the raft.<br><br>Character studies of Thor Heyerdahl &amp; his companions on the journey are intelligent subtle portrayals. Thor is one driven man, from almost drowning in childhood to landing on the beach on Roraia, Indonesia. Thor spent ten years with his theory that Polynesia was settled from Peru; not from Asia, the settled hypothesis at the time. Final proof came via the 1947 voyage on a raft using the same 1500 year old techniques of navigation and raft construction. While this may sound a bit dry, it is not. The passion of the participants is palpable. Each has their own reason for going on the journey; most simply falling under Heyerdahl's charisma. (Heyerdahl's 1950 documentary won the Academy Award, and remains the only Norwegian winner of an Academy Award to date.)<br><br>Though not cast based simply on physical looks (per the co-directors), several are magnificent specimens of blond 1940s fit men...and their bonding.<br><br>Every scene was filmed first in Norwegian, then in English; (US release of the English version seen is expected by the Weinstein group later in 2013.) Filming was 59 days in six countries. Audience reaction of the PSIFF screening was loudly appreciated followed with Q&amp;A with the co-directors.","user":"Mahler-5","rank":[37,43]}]