[{"title":"More than just about Winnie the Pooh","rating":8,"date":"30 September 2017","review":"I watched this wondering if it was going to be a dull, forgettable period piece or a tedious biopic and was very surprised just how good it actually was.<br><br>This is a really solid film with good performances and nicely directed. The plot concerns the true story of the life of the young Christopher Robin and the changing relationship he has with his parents in the 1920s.<br><br>It blends the mental trauma his father has been living with since his WW1 experience, and Christopher Robin's own traumatic childhood, both of witnessing his own parent's fractious relationship and then the deep unhappiness of having his life turned upside down when his fathers book, Winnie the Pooh, becomes an enormous and unexpected worldwide hit and inadvertently makes a celebrity of Christopher Robin.<br><br>This is a film primarily about family relationships and it is extremely well written too. Will Tilston, who plays Christopher Robin at 8 years old, puts in an exceptionally competent and sweet performance that makes you genuinely feel for the character.He finds the only person who actually understands and shares his anguish is his nanny, Olive (Kelly MacDonald). Olive too notices how unhappy Christopher Robin becomes but her pleas fall on deaf ears.<br><br>The only real flaw in any of the characterizations is Margot Robbie's turn as Daphne, Christopher Robin's mother. Whilst Domnhall Gleeson's AA Milne at least has some back story to explain why his mentally tortured writer is struggling to shake off his demons and thus oblivious to his son's reluctant celebrity status, Daphne comes across as somebody who is a bit cold and shallow and has no problems with watching her son get exploited to make the book a success. This may of course be what she was really like but the film doesn't dig very deep into her character. However this is a minor quibble in an otherwise well made film.<br><br>There are moments of humour in the script and no bad language so I expect this film will appeal to older audiences as well as families. The film is also just about the right length too if you like a good old fashioned biopic/drama. There is also a moral at the heart of this tale about the need to let children have a normal childhood, which is very much applicable even now.","user":"trevorwomble","rank":[67,79]},{"title":"Lessons can be learnt from this film, no matter how much you work, your children want you.","rating":10,"date":"19 October 2017","review":"REVIEW - GOODBYE CHRISTOPHER ROBIN <br><br>Honestly didn't know what to expect when I went to see this film. As its based (loosely) around the creation of the Winnie The Poo stories I thought it was going to be a children's film but.......<br><br>The film itself is actually and surprising very good, touching on the family dynamic of the upper classes during the 1930s to 1940s.<br><br>Very stand offish parents who seem to care about their social standing rather than their son (Christopher Robin) and how this impacts on all of their lives. <br><br>Looking at how one person can force the hand of another, in this case forcing father and son to actually spend time together and bond. <br><br>Lessons can be learnt from this film, no matter how much you work, your children want you.<br><br>Thoroughly enjoyable film on many levels. <br><br>Rating 10 out of 10","user":"markthomassintek","rank":[58,72]},{"title":"Bitter-sweet, emotional and absolutely delightful","rating":7,"date":"1 October 2017","review":"The thought of a biopic that charts the touching story of the creation of a children's tale that has meant so much to so many over the years instantly makes me think of Finding Neverland, a sweet film I'm very fond of. In many ways, Goodbye Christopher Robin is very similar – bitter-sweet, heart-warming, full of nostalgia; you could easily swap Johnny Depp for Domhnall Gleeson and Kate Winslet for Margot Robbie (although the characters differ greatly). Although this story behind Winnie the Pooh doesn't contain quite the same childish magic and glee that the story behind Peter Pan gave us, it's still a delightful, emotional story told in a joyful, touching way.<br><br>The film as a whole addresses several themes and it's really a bit of a mishmash – it's not just about the creation of the Winnie the Pooh books; it's about the impact of war, the troubles with early 20th century parenting, tricky father-son relationships, the joy and innocence of childhood, and the pain and price of fame. This all works as both a strength and a weakness of the film; in many ways it's wonderful to have such a wealth of topics and the variety keeps things fresh and interesting. On the other hand, some themes aren't fully explored to the extent they could be and it feels as though it's missing something occasionally. It never really focuses on one theme and so does tend to meander around all these topics, telling a vague story; at times it seems to be more a series of scenes with just a semblance of story. Of course this is because the story itself is fairly simple, so it's nice that they enriched the plot with so many themes; it just feels as though it could have benefited from a little more detail.<br><br>Nevertheless it's a film that's a joy to watch and brings with it a load of emotions – sniffles and tears seemed to permeate the cinema. This is down to a couple of things; firstly the characters and the story they go through together; but more than that all the references (some obvious, some subtle) to Winnie the Pooh and the rest of Milne's work. From small quotations and images, to creating a little wooden hut to house one of Billy's toys, there are plenty of nods to Winnie the Pooh and these can't fail to bring a nostalgic tear to anyone and awaken fond childhood memories. The childhood especially is heavily romanticised and anyone can identify with Billy Moon in some way, bringing to mind all the happiness and innocence we experienced as children. This is all complimented by beautiful cinematography, making the wilds of Ashdown Forest seem absolutely stunning and really strengthening the magical quality of childhood and its inexhaustible supply of imagination and charm. In fact it's this middle section where the world of Winnie the Pooh is created that is the strongest part.<br><br>There aren't a great many characters in this film, making it all seem more intimate, allowing us to grow attached to the characters – though at times this can be challenging. As excellent as Gleeson is, it can be sometimes difficult to understand and empathise with him as his character is so stiff and reserved; still Gleeson gives us a wonderful contrast to this and how time with his son helps him to loosen up and re-discover his 'inner child'. Margot Robbie's Daphne comes across as a missed opportunity. Stunning and beautiful as always, it's hard to imagine Robbie playing a detestable character, but this she manages to do and do well. It's just the writing doesn't really seem to do her credit as we aren't given a real insight into her character. Kelly Macdonald and Will Tilston do shine though. Macdonald's Olive grounds the film as the friendliest, least complex adult character and Tilston exceeds all expectations you would have from a nine year old in their first ever acting role. Sheer innocence and childishness emanates effortlessly from his big eyes and little movements. He really is the heart of the film and fortunately they make the most of him. Sadly every boy has to grow up, but Billy Moon's 18 year old self played by Alex Lawther fills the shoes of his younger counterpart well, giving us the necessary angst and emotion needed.<br><br>Perhaps not quite the early Oscar contender I hoped for and it lacks some of the magic that I loved in similar film Finding Neverland. However, this is still a great film, dripping with emotion, nostalgia and a romantic view of childhood; exploring a wealth of themes and with some excellent performances (particularly from the titular Christopher Robin) and affectionate references to a childhood classic, Goodbye Christopher Robin is a lovely, bittersweet film for the whole family. Bring the tissues – this one's going to move you.","user":"mt-95256","rank":[35,42]}]