[{"title":"You are in for a world of hurt","rating":9,"date":"26 February 2012","review":"Wow! I was not expecting this movie to be this engaging. Its one of those films that leave you sitting in silence for a while when the credits roll much like excellent Dramas like \"Requiem for a dream\" or \"Downloading Nancy\".<br><br>This one spells it out pretty clear with the line \"Henry Barthes is all of us\"... its hard to grasp how the realization that we are indeed all the same can be so painful.<br><br>On the surface \"Detachment\" deals with the crumbling American education system through the eyes of substitute teacher Henry Barthes (played by Adrian Brody) who starts a new assignment in a new school with new teachers, in a new class with new pupils like he is obviously used to.<br><br>The beginning shows him trying to get into this new class around the bullies threatening him and other pupils, making it hard to teach anything. At first it looks like all those \"good teacher turns around a bad class\" movies but its not. You soon realize that the school is just the backdrop for a larger story about a teacher who tries to do his job by taking a role outside the play. Barthes makes clear that he is hollow and words can't hurt him which is his way of coping with a hopeless situation by neglecting his private life and detaching from the world. Like him every teacher seems to have developed his individual coping mechanism. For some its cynicism and dark humor, \"happy pills\" are regularly mentioned too and for others its just swallowing their emotions until they erupt. You see the teachers coping with their daily routine while hearing an answering machine in the background every now and then with other teachers resigning or parents shouting for better grades for their kids.<br><br>Its pretty tough stuff seeing kids void of hope, interest or enthusiasm and teachers trying to get to the few who are still to be reached in the classroom. But its here where it all falls apart because of hollow politics, parents that do not care or are just as dysfunctional as the kids they raised and dropped into the public education system and idiotic social rules and conventions we are all used to. When you see the pattern in all the peoples private lives and their desperate tries of holding on its obvious that \"Detachment\" is not just about the public school system but about our whole society, about each and every one of us.<br><br>When Barthes meets a young street hooker he decides to take her in with him and do his job outside school. Its quite heartbreaking to see him trying to make a change against all odds. At times Barthes comes across like a modern day Jesus when he sleeps on the floor of his small apartment and lets the girl sleep in bed. Some might say that \"Detachment\" is too light on the teachers because most of the blame falls onto parents and politicians. There is hardly an unsympathetic teacher in this movie. Yet there are scenes that show Barthes is no Jesus at all... like when he violently shouts at a nurse in a retirement home after an incident with his dying grandfather. Barthes is indeed like all of us, cracking when he struggles to cope and lashing out to get out the pressure, just like the parents at school push their pressure to the teachers.<br><br>And this is where the detachment cracks... amidst all the failures Barthes manages to connect to the girl, as well as to an outcast girl at school. And he connects through emotion and personal attachment but soon has to realize that it does not work. The scenes of him sending away the girl to a foster home when he tells her he cannot be her family or when he has do send away the outcast girl when she tries to share her sorrow with him are gut-wrenching. There are so many honest and deeply emotional scenes in this movie its hard to keep track. His grandfathers death with his total forgiving, Barthes monologues trying to make the pupils understand why they need basic education for their own sake are as brilliant as Lucy Lius Characters breakdown in which she shouts out her desperation and sadness towards a seemingly not caring girl.<br><br>The relationship between Barthes and the girl is stunning and constantly rocked by misunderstandings... plain because you don't expect it to be non-sexual with all the pedophile stories, sexual harassment laws and stereotypes. But against all odds it is and you realize that when there are no parents (like in the haunting \"parents night\" scenes with teachers waiting and no one coming) someone else must fill this void... how empty have we become that we cannot expect someone to help out of honest interest for his fellow man... or rather child?!<br><br>\"Detachment\" is a bleak and painful movie but it has some hope and even some humor (the cynic teachers way of teaching a girl about the dangers of STD with a picture of a rainbow and a picture of a disease ridden vagina is one of those much needed lighter moments).<br><br>Its like when Barthes says in one of his many off commentaries... life is an ocean of chaos and the realization that you are the one supposed to throw the buoy while struggling to stay afloat is devastating. But its the honesty about his own struggle that makes him connect with others. Its when they realize we indeed are all the same, all struggling and they are not alone in their strife that gives them their humanity. But thats what life is... so what can you do but be honest and hope for the best.... Its all going to be OK!","user":"dschmeding","rank":[140,148]},{"title":"Touching, an inspiration to change.","rating":9,"date":"6 March 2012","review":"A story about a teacher who wants to make a difference. Very touching story with some twisted story lines about real life. It makes you see how hard life can be for a lot of adolescents. Of course, the people in this movie project some of the saddest life stories and not everybody has it this hard, but I think a lot of people can recognize some of the life problems of this movie. <br><br>Adrien Brody projects the right emotions at the right time in the movie. Sadness, happiness, joy and trauma, every feeling has its place in this movie. The use of real students and an existing school in combination with great filming gives the viewer the feeling its all real. A quality that makes a movie great. <br><br>The movie inspired me. I'm a elementary school teacher and I see a lot of kids, sometimes heading in the wrong direction. It gave me a feeling of hope and drive to help these children, even if it seems hopeless. <br><br>Please, go and see this wonderful movie!","user":"Emmytjuh_klein","rank":[141,150]},{"title":"Windswept and desolate school hallways","rating":8,"date":"26 April 2011","review":"The truth about high school is that it's worse than you remember it.<br><br>Watching Tony Kaye's enthralling \"Detachment,\" you can't help compare your high school to the one on screen. You remember the terrible teachers you had, the sterile hallways, the asinine classmates, and the absurd assignments. You can remember the \"weight that presses on everyone\" as Mr. Henry Barthes, played by Adrien Brody, tells his class.<br><br>\"If you can just hang on, everything will be alright.\" Mr. Barthes is that hero teacher that we love tell stories about. He's the Christ, the Buddha. He's meant to save us from ourselves. <br><br>The problem? Mr. Barthes is a great teacher because he has no life outside of teaching. Like Socrates, Christ, Buddha, Gandhi, and countless other mythologized teachers, Barthes is a detached island to himself, without spouse, children, or personal life. He's a lonely dude.<br><br>As a public school teacher sitting in the audience at the world premiere last night in Tribeca, I have mixed feelings about telling you that Tony Kaye has masterfully succeeded in capturing public school in a macabre and beautiful chalkboard sketch. His lush, mannerist portrait brings a gorgeous but searing light to the lonely reality of the teaching profession. Mr. Kaye's \"Detachment\" presents school the way so many of us on the inside see it: a windswept wasteland scourged of its humanity by a culture that burdens its underfunded and unfairly censured teachers with rearing, policing, and institutionalizing our children. <br><br>I hate to say it: public school really is this bad. The few great teachers that our system manages to attract are barely hanging on from year to year, knocked senseless by a society that demands way too much from them.<br><br>Adrien Brody is riveting as a seemingly serene but deeply damaged substitute teacher. His sloping eyebrows, sometimes treacly or overwrought in other performances, here convey an- inch-from-the-cliff hopelessness without ever becoming a mask. Mr. Brody's Henry Barthes is sweetly but searingly honest with his students even as sadly skulks among the halls of his school. Barthes is also furious-- enough to throw desks in his classroom and scream at a late night nurse at his grandfather's assisted care facility. In close-up, documentary-style interviews, Mr. Brody's eyes flash like lightning one moment and then become as dull as concrete the next, daring us to try to understand how one can care so much and so little. His Barthes has a teacher's countenance in this film, acutely aware of how important yet futile his work is. It's a career performance.<br><br>Barthes' determination to be disconnected keeps him the perennial substitute-- in the classroom and in his personal life. Barthes tends to his grandfather but has more than enough time to help out two young girls, a young prostitute and an overweight loner. Despite his earnest efforts, almost none of it works out well. The complicating plot lines, all involving family surrogacy around Barthes, serve the notion that teachers must be dispassionate and alone in order to perform their jobs. The story survives its few yet regrettable school clichés by sticking to this thesis. <br><br>Despite the fact that the number of big names threatens to make the movie look like a cameo-fest (Lucy Liu? Christina Hendricks? Marcia Gay Harden? Blythe Danner? James Caan? Really?), the ensemble gels together surprisingly well. After all, weren't your teachers an impossible cast of characters? Every character seems just barely above water as each trudges to the blunt beat of the school bells ringing. The performances are just fine, largely, but two are particularly successful. While Mr. Caan's grinning jester provides a refreshingly necessary gallows' humor in some of the film's darkest moments, it's Ms. Liu's imploding truth-teller that lends undeniable heft to the story. As a guidance counselor faced with yet another unreachable know-it-all teen, Ms. Liu's character finally breaks down, berating the student with a bleak prophecy of the child's future. \"You will NOT be a model! You will forever be on a carousel, competing with 80% of the country for a minimum wage job for the rest of your life!\" the guidance counselor screams uselessly at the apathetic teen.<br><br>It's grim stuff, made more grave by the undeniable ring of truth.<br><br>The ancient Greeks tell us \"we suffer our way to wisdom.\" By the end of the film, you'll hope that is true for most of these characters. Somewhere on screen, between a silent hug and the opening lines to Poe's \"Fall of the House of Usher,\" you will find a glimmer of hope. But you have to work for it. <br><br>School, as the film has drawn it, is a Munch-esque desert of detachment where the best anyone (teachers and students) can do is survive. But the fact that Barthes, and teachers like him, won't give up-- and the fact that Mr. Kaye made this movie-- tells us that hope is alive, if not well. <br><br>The hope rests almost entirely in our lonely, detached teachers.","user":"iblogamerica","rank":[72,78]}]