[{"title":"Not-so-typical witches-hunter","rating":7,"date":"22 October 2015","review":"Besides short segments taking place in the Middle Ages and another on a plane, this supernatural flick takes place in modern New York. We have Vin Diesel's character, Kaulder, a man who lost his family due to witches, still alive after 800 years and still hunting them. One would think that Kaulder would be a stereotypical stoic, somber, asocial killing machine, but such is not quite the case. I was pleasantly surprised to find Vin Diesel more smiling and \"human\" than usual. In fact, on more than one occasion, his hero actually showed restraint and compassion, which was quite refreshing. After that Middle-Ages intro, I thought all the witches would be evil, despicable, one-dimensional creatures (which would have been boring) but then again, I was fooled as we actually delved more into the modern witch community.<br><br>As far as story goes, despite the seemingly cliché setup, I'd say it was stronger than usual for that kind of supernatural-action film with a few good twists I didn't see coming. The special effects were rather good and I especially liked how the magic was so nature-oriented (as it should be for witches). One of the neatest places was that bar with the subtle light magic. I also liked the design of the old witches and that bone sentinel. There was visual stuff there I hadn't actually seen before or at least a dozen times over. Unfortunately, I found the action scenes somewhat weak in general. I know that close-in fighting is supposed to be messy and chaotic but the cuts here were sometimes so poorly done I had trouble knowing what was happening. Thankfully, it's never as bad as in that first fight in the past, and it does get better as the film goes on. So don't go in expecting to be thrilled too much by the quality of the action.<br><br>Surrounding the more-emotional-than-usual Diesel, there's actually a pretty decent cast including Michael Caine (always classy), Elijah Wood (amusing and solid) and Rose Leslie, that redhead wild woman from Game of Thrones. For me, she was the highlight acting-wise and elevated everything up a dramatic notch. As for the directing, besides the poor action and annoying flares, it was competent but not particularly memorable. The \"dream\" visions were nice, but then they usually are. I saw this at a preview screening and there wasn't much crowd reaction, however it should be noted that the film kept my (very) jaded interest throughout. I didn't have trouble with the pacing or story confusion as other reviewers did. I actually found the world of the Last Witch Hunter somewhat intriguing and enjoyable.<br><br>Rating: 7 out of 10 (good)","user":"Quebec_Dragon","rank":[114,158]},{"title":"I actually really liked it.","rating":9,"date":"7 November 2015","review":"This movie has garnered a lot of criticism, and to be honest, I'm a little surprised. The plot and CGI were good. The acting and casting was excellent. Some parts of the movie felt really similar to The Exorcist II (Boorman), and I appreciated the lucidity and metaphysics embedded in the plot. I felt like the scene changes and juxtaposing modern/mythical images did a good job of sliding the viewer into the otherworldliness of the script. Most of the criticism seemed to revolve around expectations of Vin Diesels performance. The Character is written tersely for a reason. Why do people expect someone to be Shakespeare, simply because they lived 800 years. That experience might make some people very quiet, and I found Vin Diesel's interpretation believable and appropriate. He isn't portrayed as a scholar or wizard: just a good man who happens to be cursed. Frankly, I don't think most of these people would have been happy with a 20 min monologue by Alan Rickman. The movie was a good fantasy/action movie with some clever plot elements and creative representations of traditional magical elements.","user":"judderwocky","rank":[89,124]},{"title":"Watch-able?","rating":6,"date":"22 October 2015","review":"I didn't expect much from this movie. In fact, the only reason why I went to watch it was because of Vin Diesel. <br><br>It's another one of those Hollywood cliché filled movies. Don't expect much of a storyline other than bad things happened to my family, I became a witch hunter, defied death and killed witches. It's just filled with moments you know exactly how they're going to turn out if you've seen any other movie from Hollywood. <br><br>The visual effects were good enough. And the actors played their role. The plot has so much potential. Something like knights of the round table dedicated to incarcerating witches for using black magic. It's a nice idea but poorly executed since the idea is crushed half way into the movie. <br><br>Go see it if you like 21st century shotgun + sword action and Vin Diesel. Otherwise stay way from it.","user":"ollaroncool","rank":[107,152]}]