[{"title":"No hitch in the delivery","rating":8,"date":"4 July 2016","review":"Greetings again from the darkness. A self-inflicted career retrospective  that's my most fitting description of this project from co-directors Noah Baumbach and Jake Paltrow. Rather than line-up a slew of third-party observers and collaborators, we get the famed director himself walking us film-by-film through his resume. That's right, Brian De Palma discusses the De Palma film canon  and we movie lovers couldn't ask for anything better.<br><br>Beginning with a clip of Vertigo, the doc leads with the Hitchcock influence, almost as a form of disclosure. It's as if everyone associated is saying, Yes we admit it  Director De Palma has been heavily influenced and inspired by the works of Alfred Hitchcock. Now pay attention to what he's done with his career – some really good, some not so good, some downright awful. \"Underappreciated\" might be the best label for De Palma. He was part of the \"New Hollywood\" with Spielberg, Scorcese, Coppola, and Lucas, yet they are worshiped, while De Palma is mostly ignored.<br><br>Mr. De Palma speaks directly to the camera and seems to thoroughly enjoy this opportunity to analyze (and at times defend) his career, providing a self guided reflective approach - a chronological retrospective that doesn't shy away from his inability to put together a streak of successful films. This is direct talk (describing a particular bomb as \"one of many disasters\") with no apologies from a filmmaker who has worked for five decades. He tells behind the scenes stories in a matter-of-fact manner, not always complimentary of himself, actors or the industry.<br><br>The stories and recollections are the highlight here. De Palma speaks highly of Wilford Leach (his mentor and professor at Sarah Lawrence), composer Bernard Hermann and Robert DeNiro, with less than flattering tales of Cliff Robertson (Obsession), Sean Penn (Casualties of War), and Oliver Stone (Scarface). It's fascinating to hear De Palma explain the box office failure of his version of The Bonfire of the Vanities, address the scandal of Body Double, and describe in detail the simultaneous casting (with Spielberg) of Star Wars and Carrie. Even more eye-opening is his reminiscing on the back-and-forth with director Sidney Lumet as they played hot-potato with Scarface and Prince of the City.<br><br>Brian De Palma was Columbia University educated (math and physics), and has directed some of the most creative, colorful and controversial films – some of which never received their \"due\". This may be mostly a film for those who want more inside-industry scoop, but it's a man who takes pride in the fact that famed film critic Pauline Kael was a fan of his work, and that few directors have a more varied canon of film.<br><br>His patented \"holy mackerel\" is on full display as he takes us on the journey of De Palma films, and it's a reminder that \"talking head\" documentaries can still work  provided the talking head doing the talking is saying something worth listening to.","user":"ferguson-6","rank":[14,15]},{"title":"Compelling and personal","rating":10,"date":"8 October 2015","review":"This interview/documentary on Brian DePalma's work is completely fascinating - it's not bloated with expert perspectives or critical assessment of DePalma's work. Rather we get an unfiltered story from the director himself which works its way through the last 50 years of cinema and discusses in much candor the highs and lows of a directing career. Particularly compelling are the practical steps DePalma took to stay relevant in a rapidly changing industry, as well as his pragmatic approach of dealing with hard-nosed movie executives, difficult actors and minuscule budgets. Throughout the DePalma's interview narrative is supplemented with clips from his own movies as well as other contemporary pieces, which convey the story line brilliantly. The documentary was filmed over the course of a view days based on dinner- time conversations between DePalma and Bombauch/Paltrow. Wonderful editing, amazing perspective; a must-see for any film lover or aspiring director.","user":"ujtc","rank":[23,28]},{"title":"De Palma on De Palma","rating":10,"date":"10 September 2016","review":"De Palma (2015) <br><br>**** (out of 4) <br><br>Directors Noah Baumbach and Jake Paltrow got Brian De Palma to sit down and talk about all of the movies that he has made. This documentary has De Palma basically giving a history lesson about all of his movies. He talks about his influences, their failures or things that he wish he had done differently.<br><br>If you're a fan of De Palma's work then you probably already know that he has contributed to countless interviews and special features for his movies. There's a lot of stuff out there where the director talks about his career but this documentary works because you can pretty much get everything in one sitting. I really liked the flow of the picture because it really does come across as being shot in real time and it's just like you're sitting down at a table with the director and listening to him talk about his career.<br><br>DE PALMA is certainly a must-see for film buffs because the director is quite honest with his talk. At this point in his career he certainly doesn't have to worry about offending anyone and this leads to some very good stories about issue he had on films with actors including Robert DeNiro on THE UNTOUCHABLES. Each film is given a good amount of discussion and it's fascinating getting to hear the director pat himself on the back when he thought he did a great job or pointing out things that went wrong.<br><br>None of them films are given great, full details but as I said there are countless bonus features out there that dive into each film in more detail. This film works remarkably well because of how simple it is. The camera is set up close to De Palma and he simply talks and tells stories.","user":"Michael_Elliott","rank":[10,11]}]