[{"title":"Elements cobbled together from other Spielberg films ***spoilers","rating":5,"date":"12 June 2011","review":"Super 8, derivative and disappointing at its best, can be summarized using elements from the other sci-fi/thrillers that Spielberg either directed, produced, or exec-produced.<br><br>Some annoying kids find a map (Goonies) – including a fat kid who likes to eat (Goonies) – and they come up against the military which is trying to track down an alien on the loose (E.T.).<br><br>The creature has created issues for the townsfolk who express concern at a meeting with the sheriff (Jaws) and they eventually have to evacuate because of a made-up disaster (Close Encounters).<br><br>The alien, who is a really a spider (Arachnaphobia) that has been collecting items so that he can get home (E.T.), has the ability to make a psychic connection with humans (Close Encounters). One of the kids has a seemingly useless obsession that winds up helping to save the day in a climactic sequence (fireworks here and inventions in the Goonies) however the creature is much too smart to fall for such a trick (Jaws - \"he's either very smart or very stupid\"). An old guy, who is an expert on this creature (Jaws) winds up dying while the army shoots through the town and tanks roll (War of the Worlds).<br><br>Then the characters put the story together in one long expositional scene and we are not really sure how they figured it all out (Minority Report). It seems the monster is really a misunderstood good guy (Goonies) who makes a connection with our hero (ET, Close Encounters) and then flies home (E.T), but not before a lot of missing people are returned (Close Encounters) and lots of appliances fly around (Poltergeist).<br><br>The End.","user":"mkc1218","rank":[469,624]},{"title":"When you see a bike fly, walk out of the theater and make up your own ending","rating":8,"date":"11 June 2011","review":"The film is about a town mystery looked through the eyes of children. From the early part of the movie, you feel like something powerful and dangerous is lurking around and is going to jump out on you at any moment. Ever-multiplying questions tease your brain and a suspense is building up at the back of your mind right up to the end of the story. <br><br>The acting was very convincing and drawing although the movie suffers from its mediocre ending. A few times I felt that the logic and the flow of the plot were a bit unrealistic and artificial. I wish that the story was focused more on the mystery and the children's reactions without all the insignificant distractions and one-dimensional minor characters. <br><br>After being disappointed by a series of recent movies, this one was refreshing and heart-fluttering. It flings us back to the adventure-seeking and truth-chasing time of our childhood. If you are into tantalizing sci-fi thrillers like this movie, I recommend 'Somewhere carnal over 40 winks' as your summer read.","user":"lcofeer5","rank":[273,393]},{"title":"first 80 minutes : great!!! last 30 minutes : horrible!!!","rating":6,"date":"9 August 2011","review":"I have never seen a movie which could be divided to two parts of \"absolutely amazing\" and \"boring and childish\". The first 80 minutes is awesome, I was shocked by how good this movie was as I had seen some bad reviews on IMDb but then the cheesy part kicked in and ruined the whole thing. <br><br>First thing that comes in to everybody's mind when they see the first scenes is that this movie is so similar to et! The style is the same, the theme is the same, it even happens in the same era with the same kind of neighborhood which is kinda cool and nostalgic for my generation. Super 8 seems like a fan-made dedication to Spielberg but it just didn't work quite well. <br><br>From the actor's performance perspective; Elle Fanning's performance was breath-taking, and she saved some scenes. She's got potential to be a big star in the future. Kyle Chandler on the other hand was just plain and simple awful. He made the whole thing look kinda funny and stupid. <br><br>From special effects and sounding perspective, I'd say it was stunning. One of the best I have seen in the genre in years as you would expect when you see Spielberg's name on the screen. There's this big scene at the first half an hour into the movie where you just get nailed to your sit due to the load sound which should have been annoying but it was not. It was awesome. You don't see this in Germany often but after this specific scene, the audience gave Abram an standing ovation!!! It was awesome. Of course at the end, everyone was angry because he ruined the whole thing with a very cheesy \"et-like\" ending but all in all it was worth the money, better than most of the movies in the last 6 months, I would say. <br><br>I'm giving it 6/10 because first of all, I expected so much more from the creator of Lost and second of all, the last 30 minutes is really bad and the ending is just pure garbage. They used some cgi stuff which was very impressive but didn't quite go with the theme of the movie and was really inconsistent. All in all, it doesn't deserve the crap that it's getting in the reviews but it quite doesn't deserve the praises either. It's only OK","user":"ghomeishy","rank":[224,323]}]