[{"title":"Typically Herzog, typically brilliant","rating":10,"date":"22 April 2011","review":"As much as I love Herzog's feature films, it's in his documentaries that I feel he really excels and this one is no exception. Regardless of being faced with extremely restricted access to the Chauvet caves, the subject matter and Herzog's unique angle on story telling make this one of the most compelling documentaries I've ever seen. His documentaries always have a way of moving me, be it in the passion and determination in the people he studies like Dr Graham Dorrington and Timothy Treadwell or in the sense of awe inspired by the environments he focuses on like in Encounters at The End of The World and this one was no different, right from the start I was overcome with the beauty of the caves and the drawings on the walls.<br><br>The context and hypotheses given by the interviewees only helps to deepen the sense of wonder as each section of the cave is discussed in turn by everyone from the chief scientist to art historians, to a master perfumer, and in typical Herzog fashion, many of them are quite eccentric and add some humorous touches along the way. Throughout the film, these specialists, along with Herzog's narration really set your mind racing and I went to bed last night still thinking about the cave's mysteries.<br><br>The sign of a good film is never wanting it to end and during his last visit to the cave, the film fades to black a number of times, each time left me praying that we were going to be allowed to see just a bit more. Films like this help to open your eyes and remind you that outside the boring drudgery of our 9-5 existence, there is a whole world of beauty and mystery for us to explore and by leaving us with the allegorical example of crocodiles living in a nearby artificial tropical habitat, Herzog leaves you asking questions about the way we lead our modern life that will last long after you've left the cinema.","user":"riff_17","rank":[51,66]},{"title":"The subject matter was much more interesting than the documentary","rating":6,"date":"1 June 2011","review":"Having only seen \"Aguirre: Wrath of God\", my Herzog experience was rather limited. I was excited to see this film because of it's fascinating subject material and because I had enjoyed my previous Herzog experience so much.<br><br>Now to the movie: The cave is incredible. They remark how fresh all of the art looks, and it's preservation and immediacy is truly astounding to reflect on over the course of the film. The film notes that certain pictures inches apart could have been drawn 5000 years apart. It really blows apart your comprehension of human history and time.<br><br>The narrative around the cave, however, ended up being an aimless collection of some facts, lots of speculation, and airy fluff about the \"human spirit\" that couldn't quite get to the core of what it wanted to say. You leave feeling like you've learned almost nothing about the cave or its people in the end. Twenty minutes of haunting, slow-panning shots of cave artwork would have had the exact same effect. No hyperbole intended.","user":"cgregcunningham","rank":[41,54]},{"title":"Cave art with Werner Herzog","rating":10,"date":"6 May 2011","review":"I loved this movie -- I mean, I was just enchanted. It was everything I'd hoped it would be and more. My friends whined about this and that -- the music was discordant, the camera-work was too shaky, what was the deal with the albino crocodiles, etc. etc. and so forth. Bleh. What do they know? <br><br>Werner Herzog has filmed a 3-D documentary at Chauvet Cave in southern France, location of the oldest known artwork on the planet. Surely you've seen pictures? The cave walls are covered with prehistoric renderings of bison and bears and lions and horses and woolly rhinoceroses and more -- all drawn in a similar style over 30,000 years ago with the sure hand of accomplished artists skilled in techniques of shading and placement and composition. Astonishingly, while these days we seem to move from realism to impressionism to cubism to whateverism at the drop of a decade, scientists seem certain that some of the stylistically identical Chauvet Cave images were created as much as 5,000 years apart.<br><br>And what wonderful images they are! Even on the pages of the National Geographic the lions roar ferociously and the horses neigh in terror and the rhinoceroses battle to the death while the bison gallop away in a prehistoric stampede. But Herzog has given us more than a mere magazine can manage -- he's brought life to animals in Chauvet Cave through the magic of the 3-D process.<br><br>Yes, I know, 3-D sucks. But in this film 3-D isn't just a gimmick -- the process actually pays off. Of course I'd seen 2-D pictures of Chauvet Cave, but until seeing this film I'd never understood how much the walls of the cave undulate, and more important, how the paintings take advantage of all those curvy surfaces. The muscles of the lion ripple with the cave walls; the body of the bison is placed perfectly so that as the rock turns at a sharp angle, the animal's head can be drawn to face the viewer -- in 3-D the cave seems miraculously to come to life.<br><br>Chauvet Cave was discovered in 1994 and for a time the public could visit. But it soon became apparent that human intrusions were changing the atmosphere of the cave, as mold began growing on the walls, and the precious art that had survived in pristine peace for thirty millennia was being threatened. Now the French government has wisely, blessedly closed the place to the public. Herzog and his crew were allowed to enter only for a limited time with limited gear, and from the sound of it this filmed record may be the best we'll see for quite a while.<br><br>I was fascinated by the whole thing and I wish I had a way to thank Werner Herzog personally for taking me to a magical place I regret I'll never be able to visit. I think that theme park they're planning to build nearby -- the one at which they'll recreate the cave for tourists -- probably wouldn't do much for me. This film, though, was a very welcome, quite unforgettable experience.","user":"Favog","rank":[30,39]}]