[{"title":"Unexpectedly Good, Worth The Money","rating":8,"date":"29 January 2012","review":"Basically, if you're a romantic drama type, you'll love this movie. I'm NOT a romantic drama type, and I still enjoyed it immensely. The shining star, no pun intended, for me was Channing Tatum. He added so much subtle, and sometimes not-so-subtle, comedy to the movie. The ending was also not expected but I was satisfied with it. That said though, I could have easily watched another 30 minutes of this. No one was ready for it to end and that's a good sign. The plot is what it is, being based on a true story and all. It felt like the screenwriters and director wanted to stay close to the actual events and it worked. I would have paid for this and been happy. Romance drama fans will be pleased. Non romance drama fans will be pleased.","user":"skitz1015","rank":[167,207]},{"title":"Cute and Charming","rating":7,"date":"3 November 2012","review":"In Chicago, Paige (Rachel McAdams) and Leo (Channing Tatum) have just married and they are in love for each other. In a snowing night, they have a car accident and Paige has a serious head injury and stays in coma. When she awakes, she has partial recollection of her life until five years ago and she does not recognize Leo.<br><br>Her estranged parents Rita (Jessica Lange) and Bill Thornton (Sam Neill) use the unusual situation to bring Paige back home. Leo decides to woo her again to have his wife back, but her ex-fiancé Jeremy (Scott Speedman) is courting Paige and she does not know why she had broken with him.<br><br>\"The Vow\" is a cute movie based on a true story. The cast is great, with Jessica Lange, Sam Neill and Scott Speedman in supporting roles. The charming Rachel McAdams performs a character that had completely changed her personality from a silly Valley girl dominated by her wealthy parents to a cool artist, but after the accident she returns to her previous behavior; however the role of Leo deserved a better actor. My vote is seven.<br><br>Title (Brazil): \"Para Sempre\" (\"Forever\")","user":"claudio_carvalho","rank":[26,32]},{"title":"It's a wonderful movie","rating":7,"date":"11 February 2012","review":"The Vow is a wonderful little movie. At first blush, the movie seemed like it's another 50 First Dates, but without the comedy. The only similarity to 50 First Dates is that both the female leads suffer from amnesia with their respective significant others trying to win her heart. The Vow actually comes across having a feel more like The Notebook.<br><br>It's the story of the romance between Leo (Channing Tatum) and Paige (Rachel McAdams), and who are victims of a car accident. Leo recovers, but Paige emerges with no memories of her whole relationship nor marriage to Leo, and he must now make her fall in love with him again. In her mind, as Leo says in one of the trailers for this movie, she's still engaged to her ex-fiancé.<br><br>The movie manages to avoid cheap Hollywood writing, and gently leads you down its plot. Just when you think you might know where the story is going, it heads in a different direction. Details are revealed to you layer by layer as Paige discovers them. Tatum's voice-over was somewhat annoying, and unnecessary.<br><br>In trying to remember her memories, Paige manages to gain a new life. Opening in time for Valentine's Day, this makes for a wonderful date-night movie.","user":"rudy-zung","rank":[54,74]}]