[{"title":"Original Irish Horror with a truly contemporary twist...","rating":9,"date":"25 May 2013","review":"Although this film was made thanks to sponsorship from the Irish film board, it is far from a piece of Catholic dogma. The character who plays the priest renounces religion entirely and the film's horror is an original and recent addition to the genre. It's full of good ideas and can be related to relatively recent phenomena; the urban sprawl and the creation of enormous flatblocks outside city centres, prevalent across the United Kingdom. Most frighteningly perhaps it represents the disaffected youth who hide themselves from the enormous collection of security cameras which dictate their life. Spawns of drug selling youth hide their identity behind hoodies; who'd have guessed 20 years ago that being approached by a group of youth wearing tracksuits would be such a menacing phenomenon. In this film creative use is made of this fear. The film is far from perfect, but most important is its originality, fear is created the way it should be, as suspense, and the implication of the horror created by its themes don't require an enormous spilling of blood or disgusting special effects to disquiet and disturb you. I'm glad I saw this film; it proves again that truly good additions to the genre, don't originate from Hollywood and don't require its approval to be made.","user":"Zachar_Laskewicz","rank":[16,23]},{"title":"Great creeping horror!","rating":10,"date":"8 February 2013","review":"I fell under a horror movie high one day and decided to search for the best horror films of 2012. I clicked on various different lists and this movie was featured on nearly all of them. I looked at its IMDb rating and was disappointed with its low rating so I didn't really feel motivated to see it. But I was at Wal Mart and saw this movie there on sale and I just impulsively purchased it hoping the low rating on here was wrong. I am very glad I decided to buy this movie.<br><br>A young man is left widowed and damaged with agoraphobia after his pregnant wife is randomly attacked by a group of hooded kids. The baby is saved while the wife is left comatose for a few months until she finally passes. The young man is now raising the daughter alone in his panicked agoraphobic state. Then one day the hooded kids kidnap his daughter. With the help of a badmouthed priest and his son, he must rescue his daughter and learn the truth about these demonic hooded children.<br><br>Don't be fooled by the clichéd plot. This movie is one of the more original horror films in the past 10 years. Its a shame it hasn't found a decent release in the US. I'm sure if this was given a theatrical release during the Halloween season it would've been a decent hit. This is the second best traditional horror movie released in 2012 behind Sinister in my opinion. There is something just eerie and unsettling about this film. The terror starts off within 5 minutes with a heart pumping intro. Then the more dramatic aspect takes place for about 20 minutes so that we can get to know the characters. The last half of the movie is just genius horror film making. Sure many things are questionable about this movie, but who cares? Its a great spooky film to watch in the dark alone or with a lover or friends. The cinematography is very well done for a first time director. The directing itself reminded me of Danny Boyles '28 Days Later' in some aspects. The acting is pretty good for a low budget film. There are many scenes that are just perfectly executed even though some of the characters decisions are typical Horror movie clichés. There is a fantastically creeping scene on the bus that will surely stick with most viewers long after seeing this movie. The music is great and ominous. The music that plays at the end and through the ending credits is very beautiful and creepy at the same time. The demonic hooded children are some of the scariest horror villains in a long time. Many old school horror fans will think of 'The Brood' when they see the evil kids in this film. But honestly these kids are more menacing and scary. The director is certainly someone to watch out for in the future.<br><br>Currently the film has a pretty low score of 5.3 based on around only 1,000 votes here on IMDb as I type this review. Though the movie is not popular yet among US viewers since it has only seen a DVD/Blu Ray release without any advertisement, I think it has potential to explode in popularity. I do hope that the horror fans that appreciate true good horror will spread the word on this movie and help it become the cult classic it is destined to be. Hopefully the rating goes up. Trust me, this movie is one of the good horror movies. It's honestly worth a purchase or at least a redbox rental. Give it a shot if you need a fresh simple horror movie to scare you for the night. *I've discovered that this movie has recently been available for streaming on Netflix. I hope that slowly helps bring up its popularity and acclaim.*","user":"AlukardsCastle","rank":[24,38]},{"title":"Predictable, but okay","rating":5,"date":"19 March 2018","review":"CITADEL is another grim and gloomy slice of British urban horror shot with that cheap and depressing digital look, all greys and blues and no life anywhere. Despite the predictability of the visuals, the film turns out to be not too bad, and certainly better than the similarly-themed F. Aneurin Barnard plays a young father grieving his wife's death at the hands of a group of feral children who roam his local council estate causing mischief. The story that plays out is dingy and dark, enlivened only by the presence of the reliably great James Cosmo as a foul-mouthed priest who vows to help our lead tackle the kids responsible. It's a pretty predictable little outing, but there's enough incident here to keep you watching.","user":"Leofwine_draca","rank":[3,3]}]