[{"title":"Loved it","rating":8,"date":"5 October 2012","review":"I have to say in response to another reviewers comments that the fact that they say \"muddled plot and complicatedness of the character interactions' causes disappointment only further identifies the lack of knowledge for society around people living with mental health illnesses.<br><br>I think that if it is viewed to be muddled and complicated P J Hogan has fully succeeded in communicating the complexity of living with mental illness and the perception society have when interacting with people living with these illnesses.<br><br>I thought it was raw and confronting, cushioned by humor. I loved it.","user":"chicken84","rank":[46,54]},{"title":"Mental the best Aussie movie I have seen in a long time","rating":9,"date":"28 September 2012","review":"I took my 16 year old daughter to see this movie and I was a bit unsure if it would be as good as I was expecting after reading other reviews. The comedy alone in this movie is very Australian and we both thoroughly enjoyed the movie from start to finish. This is a very offbeat and quirky comedy however there was a much deeper message to uncover as the movie went on and this added to the higher rating I have given the movie. The way Shaz goes about turning around a family who had no self respect and was looked down upon by neighbours and family was what the movie was really about. Rebecca Gibney and Toni Collette were outstanding and I will be buying the DVD when it comes out to add to my collection of Aussie movies. Plenty of laughs and overall highly entertaining.","user":"caroline-488-870439","rank":[54,68]},{"title":"Far superior than the nay sayers may let you believe!","rating":10,"date":"4 October 2012","review":"Went to see this Aussie film from P.J. Hogan today. I have to say I am actually quite flabbergasted that this film has received so many negative reviews? The film follows the exploits of a group of girls, who live with their dysfunctional and mentally disturbed Mother (Gibney), and their non-existent politician father (LaPaglia).<br><br>After their mother suffers a breakdown and is sent on \"holidays\", their father decides to hire Shaz (Toni Collette), to look after the kids while he pursues his political career. She in turn teaches them that life is not all so bad.<br><br>People have said this film is essentially a rip-off of P.J. Hogan's breakthrough film Muriel's Wedding. I have not seen Muriel's Wedding in a number of years, and really cannot comment on the comparisons, only my opinion of this film.... And I personally loved it! The film had memorable characters, quirky situations, hilarious scenes, and some truly fantastic acting from all the cast. The stand out for me would have to have been Rebecca Gibney as the crazy mother. Plus Liev Schreiber, totally unrecognizable as a warped Steve Irwin style shark hunter.<br><br>While some people may find the humour too crude, or the story too similar to Muriel's Wedding. Everyone else that likes a good Aussie comedy should lap this up! Also if you're from Murwillumbah, and/or surrounding areas, you'll be treated to some familiar sights! :)","user":"Diggler31","rank":[45,62]}]