[{"title":"Better than the numbers indicate","rating":7,"date":"25 May 2013","review":"I won't try and stretch your credulity by saying this is a must see movie. You could give it a miss and your life will be just the same as if you saw it. However... It really isn't a bad little flick if you can get past the misleading posters, etc. They say \"Action Movie\" and the reality is that it is a character piece. A definite case of poor marketing.<br><br>John Cusack plays a burnt out CIA black ops guy that is assigned to watch over Malin Akerman after screwing up a job. The movie is more about him confronting his demons than about fighting off some nameless terrorist types. He does a decent and believable job.<br><br>Malin Akerman's character is somewhat under-developed. Her acting wasn't terrible, I just think the role could have been better written. I just couldn't seem to care all that much about whether she lived through it.<br><br>The one really jarring note was the location. It is supposed to be a remote secret base, but they used one of the many former air bases scattered through England as the setting. The thing is none of those bases are all that remote and it is a large complex with bunkers and electric gates and crap like that which kind of sticks out like a sore thumb. They would have done better to set it on an island off Scotland or something.<br><br>Over all it was worth seeing but it's better to rent than to buy.","user":"erostew","rank":[47,55]},{"title":"Captivating thriller with Cusack in top form","rating":8,"date":"29 October 2013","review":"I saw that this movie only scored 5.4 on IMDb and I wanted to quickly write that it's a whole lot better than that. The movie kept me interested from start to finish. It doesn't slow down appreciably at any point. There isn't an overwhelming amount of action but there is a tense atmosphere throughout. The location is also great. A moody, grey numbers station right out in the middle of nowhere. But the main reason for watching this movie is Cusack who perfectly plays the loner, haunted, tough guy, with a conscience. He's supremely watchable in every frame. In fact, Cusack plays these types of characters better than anything else. He has that suitably detached, dangerous look, down to a tee. He also does ambiguity very well. All of this is displayed really well in the movie. Ackerman is also well cast as the enthusiastic, smart code girl.","user":"Hylton-Stark","rank":[29,34]},{"title":"Fast, Suspenseful, Secret","rating":8,"date":"4 May 2013","review":"7.6 of 10. Fast moving film that says a lot about intelligence operations and the mental state of the operatives, why they do what they do, and the risks/prices they pay.<br><br>In these, it's easy to get hung up in details of is it real or is this done exactly like that, or is the cryptography accurately handled. For the most part, this successfully portrays the details. Are there actually numbers stations? That's not the question to ask. Are there secret communications operations? Yes. Once you get past that, most people already know and accept there are secret killings, so you can simply enjoy the story (except for the product placement, of course).<br><br>Another problem with these films is they get too caught up in the message, talking, and forget about action, thrills, and the story. This does a surprisingly good job quickly setting up the plot and keeping the pace fast (best of all, without any car chase scenes or similar gimmicks). The soundtrack/score helps too.<br><br>Something like a simplified, but not dumbed down, Bourne Identity film.","user":"in1984","rank":[57,72]}]