[{"title":"Love and Hate","rating":9,"date":"2 March 2011","review":"I work. I have worked since I was 16. I worked when going to college. I worked between college. I worked after college. I worked while raising a family. I worked, sometimes 3 or 4 jobs at a time. I'm still working. And after retirement, I don't think I would be able to quit doing something, even if it meant being a greeter at Wells Fargo. I put in my overtime. I put in my dues. I will not really have enough money to live on when I retire, but that is all relative to my lifestyle at that time. I certainly will not be able to afford the house, but I will have some foreseeable comforts. I may not have worked as hard as others, but I have worked dependably and consistently. My conscience is fairly clean.<br><br>I have never been in a position to make vast amounts of money. Most of my life I have lived from paycheck to paycheck. I am not a financial planner. I can be an impulsive buyer at times but when I get that craving I make sure that whatever I get will last me. I'm probably the perfect Joe Schmoe.<br><br>I watched this film. I don't know why. Maybe I was curious about it winning an Oscar. Maybe I'm just into masochistic tendencies, but I did watch it all the way through. I sat their like the wedding guests in the Rhyme of the Ancient Mariner as he spun his story wondering how all this stuff could have happened over such a long period of time and realizing how gullible and uninformed I am. When it comes to Government, I am like an ostrich with its head in the ground: Just let me do my job, I don't want to worry about you doing yours.<br><br>I don't think I am the only one with this sentiment. However, when one of us Joe Schmoes handed over billions of dollars to the people that engineered the collapse of so many financial institutions; to realize this has already happened; to realize there is nothing to be done just increases resentment.<br><br>The documentary was skillfully done. The preface to this movie followed the decline of Iceland during their deregulation period. Within 5 short years they went from picture perfect to poverty, the only success stories probably laughed about over drinks and cigars. The movie then proceeds to tactfully follow the events from the Regan era deregulation to the panic of the collapse of insurance, banks and brokerage houses. It then moves on to the signing of the bailout then to the wake of their carnage in the world financial structure. The appalling fact of this is no one went to jail. To the contrary, they all walked off with billions.<br><br>Matt Daemon does an excellent job of narrating the facts in a flat unsympathetic tone. The directors are quick to point out those individuals that did not let an interview happen, casting a higher level of doubt to their credibility. All in all, much was exposed and even if 30% of it is true, it is disappointing it ever got to this point.<br><br>Unlike Moore, seeing this was a serious piece I appreciated the fact the production wasn't degraded by any comic relief. There was much to love and hate about this film. The production of it was crisp, clean and too the point following a well thought out introduction and ending, but you sure do end up hating capitalism by the time the ending credits start to roll.","user":"Astralan","rank":[165,178]},{"title":"Probably the best documentary I have ever seen","rating":10,"date":"31 December 2010","review":"Inside Job is an enthralling documentary about how the reckless actions of Wall Street lead to the near collapse of the financial sector and subsequently the deepest recession since the 1930s. This is the second film by director Charles Ferguson, the first being No End in Sight an equally engaging indictment of the Bush Administration's handling of the occupation of Iraq. <br><br>Ferguson focuses on the Wall Street culture and the blatant arrogance of a half dozen men as the main causes of the financial turmoil. Inside Job begins in Iceland where the deregulation of the financial system in the 1990s lead to three banks accumulating assets almost ten times the small country's gross domestic product.<br><br>It becomes clear by the midpoint of the film that Iceland is a micro example of what has become a global problem. Runaway banks have been accumulating assets through toxic loans and other manoeuvres while paying themselves lavish bonuses. <br><br>Inside Job is easily one of the most frustrating documentaries ever made. And that is undoubtedly Ferguson's intention. The film is critical of Wall Street executives, credit agencies and especially regulatory agencies for the crisis.<br><br>Inside Job includes interviews from IMF head Dominique Strauss-Khan, congressmen Barney Frank, former New York attorney general Eliot Spitzer and many others. Ferguson traces the evolution of the banks from a small, largely local service to an out of control industry. He does not hold back criticizing every administration since Ronald Reagan in the 1980s.<br><br>Ferguson argues that despite what most people think, there were many people warning of an impending crisis in global financial markets. Ben Bernanke, Alan Greenspan and Timothy Geithner ignored various signs of impending doom. Not to mention former treasury secretary and incidentally former Goldman Sachs CEO Henry Paulson.<br><br>Inside Job makes the argument that the federal regulators are as responsible for the breakdown of the system as are the executives of Goldman Sachs, Lehman Brothers and Bear Stearns. More frustrating still is the revolving door between Wall Street and government agencies.<br><br>As the banks became more deregulated, the more speculation became a problem. Derivatives, and credit default swaps, complicated trading schemes that most people do not understand is what caused the collapse of Lehman Brothers sending shockwaves through financial centres all over the world.<br><br>Credit agencies like Moody's and Standard and Poor gave firms like Bear Stearns, Lehman brothers, and Morgan Stanley A grade credit ratings within weeks before they nearly collapsed. And also having one of their executives standing up in front of a congressional committee and telling congressmen that their ratings are just merely 'opinion'.<br><br>It becomes clear that this is not a problem that emerged from the housing boom early in president George W. Bush's second term. Rather this was a systematic breakdown driven by a neoliberal ideology supported by Ivey league economic schools across the United States.<br><br>Inside Job is simply a story of bankers more interested in collecting bonuses and making more money than providing what should be an essential service. What makes it even more frustrating is that many of the key figures behind the crisis are currently on Barak Obama's staff. The film leaves us with a bitter pill to swallow.<br><br>As Ferguson notes, Wall Street has returned to normal with no federal prosecutions against any of the guilty. And one of the most poignant scenes in the film comes from Robert Gnaizda, the former head of the Greenlining Institute, a consumer lobbyist group who laughingly dismisses recent legislation to regulate banks with a simple 'Hah'.<br><br>Inside Job helps explain many of the complex terms such as derivatives and insurance backed securities that confuse those not immersed in the banking community. It is essential viewing for any citizen concerned about our broken system.","user":"winterhaze13","rank":[188,204]},{"title":"\"Inside Job\" is a stunning analysis of the greed that caused the Wall Street crash.","rating":9,"date":"7 November 2010","review":"Charles Ferguson's \"Inside Job\" is strong, fair, and rational. The director tries mightily to untangle the complex architecture of the financial meltdown that has cost millions their jobs, their homes, and their savings. If you consider skipping it because it sounds boring, please think again. My blood is still boiling.<br><br>Why does this documentary leave us sunk in despair? Because it confirms the certainty that there is no one left we can trust. The fact that much of what brought the economy to its knees was legal, not criminal, signals a financial sector run by ethical nihilists who will pursue every legal loophole to enrich themselves. Human nature, you say? Then bring back the stringent regulation that gave the industry forty years of reasonable corporate success before Reagan era deregulation. The schoolyard bullies need supervision.<br><br>America's bubble of private gain and public loss was pierced by the collapse of Lehman Bros. and AIG. Banks merged into \"too big to fail\" behemoths; safeguards were overturned; regulation of derivatives was banned; This vacuum quickly filled with money laundering, defrauding of customers, cooking the books, and stuffing of the pockets of top officers with money. Larry Summers took 20 million as adviser to a hedge fund. Lehman's CEO took 485 million, the CEO of the failing AIG 315 million. Fired by Merrill, CEO Stan O'Neal departed with a severance bonus of 161 million.<br><br>When Mortgages were bundled and sold to the bloated investment banks, lenders no longer cared if they were repaid. Goldman, Lehman, and Merrill were all players. Summers, Bernanke, and Geithner all stood against corrective measures and would play pivotal roles in the Obama administration.<br><br>Absent limits on the impulsive risk takers, Wall Street plunged into personal pleasure. There was never enough: penthouses on Park, private jets (six for Lehman alone), vacation homes, art collections, drivers, private elevators, drugs, alcohol, strip bars, and prostitution - one private supplier within spitting distance of the stock exchange counted 10,000 men among her customers..<br><br>Three ratings agencies made fortunes bestowing unwarranted ratings right up to two days before Lehman failed, later testifying before congress that these were merely \"opinions\", not guides for investors. The crowning disgrace is the corruption of the universities. Business school professors consult with companies. Glenn Hubbard, dean of Columbia Business School, takes $250,000 as a board member of Met Life. Larry Summers, back at Harvard, continues to rake in consulting and lecture fees.<br><br>The presidents of Harvard and Columbia refused comment. You will appreciate the honesty of Raghuram Rajan who wrote strong warnings and French Finance Minister Christine Lagarde, who spoke with disgust of the debacle.<br><br>It used to be that respected academics could be counted on to be the conscience of democracy. Now they are reduced to being interchangeable components in the conflict of interest chain that links business/government/university. Credit Charles Ferguson with a superb investigation and give thanks that we still have a free investigative press to wake the sleeping citizenry.","user":"fergo-2","rank":[232,258]}]