[{"title":"One of the Most Unique and Beautiful Friendships ever Committed to Film","rating":10,"date":"27 November 2011","review":"Do not look at this through the prism of \"Foreign Films\". You'd be wasting your time and miss something far too important.<br><br>Hollywood does scale like nobody else, leaving the competition gasping in its wake. France does intimacy, and brutality. Nothing is sacred. And rather than try to revive the New Wave or emulate Hollywood like most widely seen French films of late, \"Intouchables\" harnesses its core strengths - ease with intimacy, willingness to ridicule anything and brutal honesty - and delivers one of the funniest, most honest and touching films I have ever seen.<br><br>Sy is a failed robber, going through the motions and playing the stereotypical jobless émigré. Cluzet is a romantic and melancholy mind trapped in a useless body. The circumstances that bring them together are too funny to spoil here, but meet they do, and an awkward relationship quickly blossoms as they bring out the best in each other.<br><br>The film's simplicity is delightfully misleading: the script is a masterpiece of comedy writing, and however good the rest of the cast is, the central duo is magical. Sy's comic timing will have you in stitches, but it is his honesty and vulnerability that make you fall in love with the character. Cluzet isn't your typical sad-sack, instead, much of the finest pleasures in the film consist in watching him use his keen mind to mess with the world around him (a subplot about an abstract painting really takes the biscuit, you'll know it when you see it).<br><br>This is one of the most unique, beautiful and honest friendships ever committed to film. It will make you laugh, it will make you cry... a delightful celebration of everything in life that makes it worthwhile.","user":"OttoVonB","rank":[806,864]},{"title":"Just excellent","rating":10,"date":"10 January 2012","review":"I am now trying to find words to describe this movie for an hour. I couldn't.<br><br>You've seen it, or you haven't. It's monumental and outrageously good.<br><br>The cast is brilliant. The jokes lovely. The story and the idea behind the movie is beautiful. Especially when you've worked/lived with handicapped people. The music is such a perfect choice, it is unbelievable.<br><br>I hope this movie makes a plenty of people think about how good their life is and how bad it could have been.<br><br>Bottom line: Oscar-worthy. Period.","user":"n-buenning","rank":[642,707]},{"title":"Touché ...","rating":10,"date":"17 January 2012","review":"In less than two months, \"Untouchable\" became the second most successful French film by number of spectators, such an event by itself that people went then to see it, not because they thought it was good but to see what was so good in it: that's the virtual circle of success. <br><br>My biggest disappointment in 2011 was with \"The Tree of Life\", a movie I sincerely wanted to love but couldn't, and I left the theater before it ended with a bitter taste of frustration. Proportionally, my greatest positive surprise came with \"Untouchable\" because it was the opposite expectation: I was sure I would dislike it, figuring the movie manipulated viewers through the overused device of the improbable friendship. Why such preconceived negativity? Well, when a young black guy from French suburbs, darkly depicted in Mathieu Kassovitz 'Hate' and infamous for its occasional riots, befriends a rich quadriplegic, I immediately think of 'good feelings', 'mainstream populism'  unaware that I apply to myself a cynical judgment that can undermine my very way to enjoy not just this film, but any film. After all, why getting ready for hatred when it's so relieving to give the benefit of the doubt and get ready for appreciation? Especially since more than 15 millions of French people, from different ages and backgrounds liked it. <br><br>So, I saw it  and loved it.<br><br>The story of \"Untouchable\" is the kind of unintentional masterpiece that only movies can provide every once in a while, it has no other pretension than to depict a magnificent and inspiring friendship story starting as a simple job. A young man with a Senegalese background, Omar Sy as Driss, only needs a signature to prove that he attended an interview for a live-in carer job. For some strange reason, Paul, the rich man, played by a wonderful François Cluzet, gives him the job, with a one-month trial period. The reason of this choice is smoothly handled by the script: the film starts with all the job applicants, every one of them unnaturally posing and getting mixed in prepared answers. Then, Driss casually enters, without waiting for his turn or knocking on the door, he's got enough problems to deal with, unemployment, an experience in jail, being a pariah for society, and undesirable even in his own family, especially her adoptive aunt. Driss' attitude pleases Paul, because after his paragliding accident, he can't feel his body from neck to toes, and needs caring almost 24 hours per days and 7 days per week, so he really doesn't have time for bullshit either. <br><br>And this is a remarkable aspect in the script written by the two directors Eric Toledano and Olivier Nakache: it doesn't waste time cementing the friendship, the two leads rapidly get fond of each other, a feeling illustrated in the poster with both posing with natural smiles. The film shows Omar's struggle to learn how 'needy' Paul is, which provides some priceless comedic moments, but \"Untouchable\" goes immediately to the core, an eye-opening message about the life endured by a handicapped person, making all the wealth in the world pointless and the richness of heart and mind, priceless. Through Driss and Paul's interaction, the film explores the real needs of people in life, respect and understanding, acceptance and love. Maybe if it was handled by other directors, it would have been predictable but in \"Untouchable\", the complicity between the two heroes feels absolutely real. There's one scene when Driss shave the bushy beard of Paul, well, I won't spoil it for you, but the part was a clever mix of realism and comedy because anyone would have done what Driss did at one moment, and that's the secret of the film: it feels real.<br><br>Some movies can work with a good story but they need good performances, in \"Untouchable\", it's almost impossible to determine who carried the film, both Cluzet and Sy were great. And I don't get the complaints: why they didn't respect the original story where the carer was an Arab, or how they 'sugarcoated' the handicap? I even heard that in America, they were accusing the film of racism because Driss was portrayed as a sort of (I quote) 'helper monkey'? Seriously, this is getting old The way handicap is approached never flirts with an exaggerated pathos, nor the opposite, which is the most intelligent achievement. There's a sort of heart's intelligence in the way Omar teases Cluzet with his own handicap, and the film provides the extraordinary message that pleasure and thrills have unlimited media, whether they come from pot, an ear-massage or even paragliding. <br><br>Many of Paul's friends criticizes the presence of Driss in Paul's life, but Paul doesn't care: Omar is a man full of life, big, tall and strong, and when he uses violence to teach a man the respect of a parking sign, Paul admits this is the right method. Both are in the same wavelength. I wondered if the title \"Untouchable\" referred to the lowest caste in India, echoing the two men's conditions, both outcasts physically and socially, but I guess, their relationship evolves into a friendship precisely because they're both strong-minded, and together, they become even stronger, until getting untouchables ... in the noblest meaning of the word.<br><br>There are real people in \"Untouchable\", nothing works as plot devices even if some situations are so cinematically appealing: Omar inviting everybody to dance during Paul's birthday, his learning of the aristocratic world, the art of abstract painting, and the way he breaks the conventions with an unconventional charisma reaches a level of energetic comedy that reminds of the greatest days of Eddie Murphy, with Cluzet as a perfect straight-man not deprived from a sense of humor. \"Untouchable\" is simply an inspiring story of friendship with whatever defines this beautiful virtue. <br><br>And yes, it's one of the best French films ever, and certainly one of the best of 2011.","user":"ElMaruecan82","rank":[312,350]}]