[{"title":"This country needs another Cesar Chavez","rating":10,"date":"30 March 2014","review":"This movie was as accurate and as realistic as it could be when packing many years of struggle into 100 minutes. There are many lessons to be learned from La Causa. I just hope that young people see it, learn from it and connect it to today's struggles.<br><br>Some uninformed people may feel that Michael Pena's acting is weak..that couldn't be further from the truth. Pena portrayed Cesar the way he was...soft-spoken and undramatic. That was the amazing thing.. Cesar Chavez was driven by his passion for justice. He was not a politician. He was not an eloquent public speaker. Yet he inspired millions to boycott, march, strike, struggle because his cause was so moral, so real, so grass roots.","user":"larazafour","rank":[31,38]},{"title":"Hollywood Critics have it all wrong..","rating":10,"date":"4 April 2014","review":"Firstly, I disagree with the external critic reviews that bring the overall rating of the film down very much. Unfortunately, these are the criticisms that will keep Hollywood from investing in future endeavors that symbolize the Latino/Social Justice/Consciousness-Inducing narratives that the public desperately needs. <br><br>I work in the immigrant social justice movement and I work closely with a lot of farm worker justice orgs, including Chavez's UFW. I understand that there are contexts missing and that there were a lot of things at stake during that particular movement, but I'm more aware of the fact that it would be hard for the general public and the folks that really need to go and watch this film to understand the greater context and be moved by the politics that plagued the social advocates and continue to plague our movement today. <br><br>I also took my Spanish-speaking, first generation immigrant family to watch this film. They are not involved in any of my work but some of them have worked on the fields as guest workers, etc. I was glad to see that they were moved and even brought to tears by the simplicity of the film and that they appreciated that someone was acknowledging their struggle. At the end of the day, the film was entertaining, well acted, and it served its purpose to educate and inspire people like my family.","user":"goodfella879","rank":[22,28]},{"title":"Excellent Biopic on an important Civil Rights and Labor Leader","rating":9,"date":"15 March 2014","review":"Cesar Chavez was very warmly received during its North American Premiere at Austin's SXSW Film where it won one of the audience awards. Director Diego Luna has done an excellent job in bringing this important and often poorly understood civil right and labor leader to life for a new generation. Michael Pena delivers his best acting performance to date as he really seems to capture the essence of Chavez. The film is reminiscent of other films about leading social organizers such as Milk which is also set in California in about the same time period. The film focuses on the major events of his organizing including the boycott of grapes which eventually forced the grape growers to reach an agreement with the United Farm Workers (UFW). The film also emphasizes his dedication to the cause of non-violence and his efforts to work across ethnic lines. While all such films are imperfect vehicles for encapsulating an individual's life, I felt this one did solid job of capturing the spirit of Cesar Chavez. It also showed the difficulties his work caused for his family. I think this film could be very valuable as an educational tool for teaching young people about the legacy of Cesar Chavez. I hope that it is gains some popularity with mainstream audiences.","user":"JustCuriosity","rank":[30,41]}]