[{"title":"Great technical achievements for a small cinema","rating":7,"date":"29 May 2011","review":"There are few aspects the spectator should take into account before watching this film: it is an eight-thousand-dollar movie, filmed in a -seemingly- one continue shot,within four days and using a hand-held high-definition digital single-lens reflex camera. In this respect, it was the first feature film to be made in this way. What it is more remarkable is the fact that the film was produced in Uruguay, a small country in South America, with a three million population and a growing yet still incipient film industry.However, the experiment proved to be a very successful experiment. According to the producer, Gustavo Rojo and the director, Gustavo Hernandez, the film was never meant to reach an international audience. A few weeks after they uploaded the teaser on youtube they received offers from Cannes and USA's film companies. The film has received since then an overwhelming international acclaim, and it has been remade in USA. Although critics and reviewers usually point out some inconsistencies in its narrative, the film does not pretend to resolve them. If you do bear in mind these details before watching the film, you will probably leave the cinema more amazed than scared.","user":"vagalumen","rank":[19,26]},{"title":"For the most part an effective thriller/horror","rating":6,"date":"17 December 2010","review":"This horror film is remarkable for a few reasons. Firstly it's from Uruguay, a nation not known for it's film industry. Secondly, it's filmed (allegedly) in one single take, giving it a real time effect. Thirdly, despite it's apparent low budget, it is for the most part an effective horror/thriller.<br><br>A father and daughter arrive at a remote house which they are set to clean up the following day. As they settle in for some sleep, the daughter Laura hears some strange noises coming from upstairs. Eventually she persuades her father to take a look only for something to attack and kill him. From then on Laura, creeps from room to room, not knowing what or who is with her. With all the outside doors locked she finds a key giving her an escape to the outside world, where she encounters the house owner, who on seeing Laura covered in blood, goes inside to investigate and on return he persuades her to reenter the house. At first they find nothing, including the body of her father and then the the attacker strikes again, knocking down but not killing the owner, Nestor.<br><br>From here the plot turns, it appears that Laura and Nestor had a child who is no longer alive and Laura is exacting her revenge. She kills Nestor and the camera fades to black, before we are then presented with a serious of Polaroid photos that suggest an untoward relationship between Laura, her father and Nestor.<br><br>The film is for the first two parts very effective, once you get past the in and out of focus camera work outside of the house. Once inside, with the house boarded up, the only light is via two halogen lamps and a few candles. Once the noises start, the darkness becomes unsettling, we the viewer constantly scan the to look for clues of what is or isn't there. Much of the camera work stays very close to Laura and the use of mirrors helps give some sense of perspective as she moves from darkened room to darkened room. The strange sounds that fill the darkness add a sense of terror to the proceedings. The are some genuinely unnerving moments during this part of the film and there is some relief as she manages to get outside. The return of the owner Nestor and their return into the house reignites the sense of fear and we get glimpses of what may be the cause and there is a clever use of the flash from the Polaroid camera which literally illuminates an otherwise blacked out space.<br><br>Then the plot seems to twist and suggests that it is Laura who has killed her father and Nestor, the revenge she has taken for the fact her child is dead. It's this plot twist changed my enjoyment of the film. At first I didn't get it, but on further thinking it does sort of make sense, albeit in a quite clever way that there is the suggestion of untoward events and yet it is merely Laura taking revenge and the sounds are perhaps manifestations of her mind. Yet it still doesn't quite add up, how did she manage to get the body into the chair when the camera suggests otherwise? It's details like those that don't make sense. Also the outcome and reason behind her actions are not obviously explained, which further confuses me, I mean maybe I'm stupid or maybe I missed a vital plot point, or maybe in this instance what you see is literally not what you get.<br><br>The film for some may be riddled with clichés, nursery rhyme music, the use of mirrors or the don't go upstairs warning and Laura's constant snuffling for some reason reminded me of the dog Muttley from Wacky Races when he laughs. It is however a great accomplishment for reasons stated at the top and for the most part it plays as an effective and tidy piece of horror/thriller.<br><br>More of my reviews at iheartfilms.weebly.com","user":"ihrtfilms","rank":[18,25]},{"title":"shpitspingboya","rating":6,"date":"28 April 2011","review":"All done in one shot.... no. It's pretty clear the camera turns into the darkness every now and then for a reason. That and then end scene...<br><br>There are many holes in the plot, but from reading some of the reviews, i don't think many people got this film. There's nothing complex about the twist, it's nice and simple, take it as it comes. If you look for too much you'll be disappointed, but you shouldn't approach this film wanting to know all the answers.<br><br>This film is all about the atmosphere it creates, and the 'shakey' camera another reviewer complained about it there so you can put yourself in the house and 'enjoy the ride' while watching the film.<br><br>Yes, there is a bit too much of the film involving the main woman crying and walking about, and reacting and saying things no normal person would say in such situations, but watch the film again... it makes more sense when you know the twist.<br><br>This is a good film, and i'm dreading the inevitable American remake (prob) starring Hayden whatsherface from heroes.<br><br>Not done in one shot, but impressive nether the less. There are many flaws with this film, but many films will try to copy this, and many will fail.","user":"MikesIDhasbeentaken","rank":[23,35]}]