[{"title":"The real 'Facebook - The Movie'","rating":5,"date":"29 February 2012","review":"I'm still trying to figure out why this film left such a weird taste in my mouth. It's odd, coming out of a film and having NOTHING to say about it. Possibly, it's because almost nothing happens. They throw a party. It goes bananas. Stuff gets set on fire. Nothing you can't divine from the trailer.<br><br>It took me a while to realize why. There was a gaping whole at the center of this film. The message - nothing really matters, everyone should do whatever it takes to be cool, skinny, popular, etc. And there are no consequences. Self-destruction presented as empowerment.<br><br>This is nothing new, and I'm too young to be seriously offended by this sentiment, but Project X takes it to a higher pitch than ever before. It's like watching a stream of Facebook threads, links and comments fly past for 90 minutes. Intercut with whoops and heavy bass-lines. It doesn't feel like a music video. It is a music video. And about as satisfying.<br><br>It's made in the image of John Hughes films, updated for the Ritalin generation, but it moves too fast. I found myself wanting to say 'How about that scene where ... ' but realized that there were no scenes I found funny enough to bother recounting.<br><br>I know how this all sounds. Like a hater. But it's not. I just didn't care. There was nothing to care about. Nothing I hadn't seen in a dozen music videos a dozen times, but now, with a couple of fat kids thrown in. The only thing that leaves me wincing is the overtness of the film's nihilism. Screw everything. And everyone. This is the image of themselves these Socal kids are getting presented with. If it plays well at the box office - which it will, and nothing I can say will change that - it's the kind of thing we'll see more of. And more of. And more of. The same thing. Over. And over. Again.","user":"henry-305-493692","rank":[537,720]},{"title":"What did you expect going to see this movie?","rating":8,"date":"3 March 2012","review":"I know when to appreciate a movie with real meaning, and this is not the case. If you take this movie on face value - a humorous pure popcorn movie with no hidden meanings to teach you the values of life, it's pretty good. I don't see why it's getting bashed because for what it is, it was entertaining and funny. Before you go in to see this movie ask yourself what exactly you want to get out of it, if it's 1 hour and 20 minutes of mindless entertainment, then you're set. If, however you feel Project X will leave you pondering life and everything around you, this movie is not for you. Don't listen to the old people on here who knew what they were getting themselves into and still paid and saw the movie only to turn around and rate it poorly because it was below whatever expectations they have for a party movie...","user":"mr_poo_3","rank":[348,491]},{"title":"Greatest. Party. Movie. Ever.","rating":10,"date":"4 March 2012","review":"This movie is not original. It is not thought provoking. It's not well written. Hell, it doesn't even have a plot. However, Project X takes everything young people loved about movies like Superbad, The Hangover, Animal House, Van Wilder and the like, and it blends it all together brilliantly, to the point where you actually feel as though you're at the party. <br><br>The character formula is basically Superbad 2.0. Costa is like Jonah Hill's character, but even louder, more foul and crazier. Thomas is the sensible one, much like Michael Cera. JB is Fat Mclovin. That's about as deep as it gets for characters. There is very little character development. Costa becomes a little more sensitive to Thomas' problems at the end, and Thomas acknowledges his 'female best friend' as a lover in the end, but that's about as far as character development goes. Oh, and JB gets some booty. That is it. <br><br>The real fun comes from the actual party and the true host: Costa. The guy is hilarious and makes all of the negative aspects of American culture something to laugh at. He's loud, rude, crude and obnoxious. <br><br>The movie is shot in such a way as to make you feel as though you are really at the party. I read some reviews from people that stated they did not feel they were at the party. I personally got sucked right into it. The soundtrack was brilliant and created a real party atmosphere. And boy, if you like breasts, you are in luck because this movie has plenty.<br><br>The antagonist is an alcoholic neighbour named Rob, and the movie does a good job making him look like a d-bag. Even though he is right when he confronts them about shutting down the party, and the kids really should have kept the noise down, you still hate him for some reason. I suppose this movie represents that innate teenage rebellion, and Rob represents authority. As such you're forced to choose a side. If you're under the age of about 21 you will probably choose teenage rebellion. I, a 19 year old, surely did. <br><br>What I love most about this movie though is how unrealistic it is. I doubt a party this big could ever last as long as this one does. Police would be there so fast it wouldn't be able to get past 300 people. I've never been a raver, but I've been to and thrown house parties, and this movie takes my small shindigs with 20-30 people and multiplies it by a thousand. <br><br>The kids never face appropriate justice. If you're hoping to take your kids to see this to show them the negative consequences behind disobeying authority and disturbing the peace, don't take them to see this. There is no moral other than: never throw a crazy party at your house. Even that is kind of muddled, because while the house is wrecked, you leave the theatre with a sense of, \"it was worth it.\" Thomas' father doesn't even beat him, which would have been more realistic (Just me?). <br><br>All in all, project X is a very memorable experience. I would like to watch it again soon, but I have a feeling it will lose some of its glamour upon a second viewing. I had a lot of fun watching this in the theatre and recommend it to anyone who enjoys teenage rebellion, good tunes, scantily clad females, and laughing at ridiculousness. If you enjoyed Superbad, you will probably like this, as long as you don't put too much emphasis on a plot. <br><br>*Side note, before i forget: This movie took something from Animal House that i noticed right away: at the end of the film, the fates of the main characters are revealed on screen via text narration (much like in Animal House). The birthday boy, Thomas, is said to have been voted \"most likely to succeed by his peers.\" This reminded me so much of Animal House, how Bluto grows up to become a US senator. Just thought I'd throw that out there.","user":"Lucien1992","rank":[68,92]}]