[{"title":"He hates everyone equally, so it's OK","rating":6,"date":"8 February 2012","review":"Greetings again from the darkness. Dirty cops happen in real life sometimes and in the movies quite often. It can be an intriguing subject to explore ... psychological demons, ego, power-mongering, etc. Typically we see it presented as a cop torn between doing the right thing and feeling like he is owed something. Rarely do we see a cop portrayed as beyond hope ... so far gone morally that redemption is no longer even a possibility.<br><br>Writer James Ellroy (LA Confidential) and director Oren Moverman (The Messenger) present to us Officer Dave Brown, known to his fellow cops (and even his daughter) as \"Date Rape\" Dave. The moniker stems from a vice incident where Brown dished out street justice to a serial date rapist. With no proof of his guilt, Brown remained on the force and his rogue manner has escalated to the point where he is a constant danger to himself and others. This guy has no moral filter for everyday living.<br><br>Officer Brown is played with searing intensity by a Woody Harrelson you have never before seen. As loathsome a character as you will ever find, you cannot take your eyes off of him. He is hated by EVERYONE! Somehow he has daughters by two sisters and they all live together in a messed up commune where hate is the secret word of the day, every day. Most of the time no one speaks to Dave except to tell him to \"get out\". He spends his off hours drinking, smoking, doing drugs and having meaningless sex. Heck, that's just about how he spends his time while on duty as well.<br><br>The supporting cast is phenomenal, though most aren't given but a scene or two. This includes Robin Wright (who nearly matches Dave in the tortured soul department), Sigourney Weaver, Anne Heche, Cynthia Nixon, Ned Beatty, Ben Foster, Ice Cube, and Steve Buscemi. The first hour feels like an Actor's Retreat as most every scene introduces another familiar face.<br><br>Still, as terrific as Harrelson is, and as deep as the cast is, the film is just too one note and downbeat and hopeless to captivate a viewer. I also found some of Moverman's camera work to be quite distracting and the sex club scene was pure overkill. Downward spiral is much too neutral a term to describe this character and ultimately, that prevents the film from delivering any type of message.","user":"ferguson-6","rank":[57,74]},{"title":"Never takes off.","rating":4,"date":"29 November 2011","review":"This star studded movie just never takes off. It is slow and never builds up to anything. When you think it is going to get good it falls flat and just drags on. There are scenes, like the sex club, that just make no sense and you have to wonder why it was put in the movie. Sex is a theme and that can only be my guess as to why.<br><br>Would have been great to develop more of the characters instead of having them in the movie to just have them. Ice Cube was great, but only has a few scenes. You wont realize who Ben Foster is until you read the credits.<br><br>Spoiler The ending is horrible. If I was at the screening I would have booed. After an hour the movie could have ended and I was like are they ever gonna wrap this up. The story is horrible, though the actors are great and that is what the other reviews touch on. GREAT actors, horrible movie.","user":"buypluto","rank":[70,95]},{"title":"'Bear in mind that I am not a racist. Fact is, I hate all people equally.'","rating":5,"date":"16 May 2012","review":"This film would be almost intolerable were it not for the fact that it is based on incidents that happened in 1999 in the Rampart Division of the LAPD, incidents still unresolved. Writer James Ellroy examined the corruption of the police force and came up with this quasi-true story. According to Ellroy, 'I am a master of fiction. I am also the greatest crime writer who ever lived. I am to the crime novel in specific what Leo Tolstoy is to the Russian novel and what Ludwig van Beethoven is to music.' What happens on the screen in this film is best viewed with a bit of Xanax on board along with an anti-nausea medication. Oren Moverman co-wrote the screenplay and directs.<br><br>David Douglas Brown (Woody Harrelson in a one man powerhouse of a performance) is a veteran Los Angeles police officer, one of the last of the renegade cops who works out of the Rampart Division. Dave is misogynistic, racist, brutally violent, egotistical womanizer, yet he defends himself against many of these accusations as he says that his hate is equal opportunity. Though unlawful, he uses intimidation and brutal force to defend his worldview. The most notorious of his actions is his purportedly murdering a suspected serial date rapist, which is why he has been given the nickname \"Date Rape Dave\". He lives with two of his ex- wives - sisters Barbara (Cynthia Nixon) and Catherine (Anne Heche) - in an effort to keep family together, namely his two daughters, Helen and Margaret, who each have a different sister as their mother. Dave still maintains a sexual relationship with both sisters - whenever the mood suits any of them - while he openly has other sexual relationships with the likes of Sarah (Audra McDonald) and Linda (Robin Wright). His informer is retired officer Hartshorn (Ned Beatty) and street person General Terry (Ben Foster). His boss is Joan Confrey (Sigourney Weaver) who attempts to cover Dave's past deeds but ultimately must face the true rascallion he is. When Dave is caught on video brutally beating a man who accidentally ran into his police car he is faced with decisions that uncover not only his misdeeds but those of his fellow workers.<br><br>The cast is filled with fine support (Jon Foster, Ice Cube, Steve Buscemi, et al) who have very little to do, but Harrelson is in every frame obnoxiously smoking cigarettes in a chain smoker fashion. There is not real storyline to follow; we just are forced to watch the wretched life of a disgustingly bad cop with just enough slightly good virtues to keep us with him. As Catherine states, 'You know what I think? I think you were a dirty cop from day one. You were a dirty cop with a dirty mind and you dirtied all of us up by default.' And that includes the audience. <br><br>Grady Harp","user":"gradyharp","rank":[26,34]}]