[{"title":"What on earth have they done to John McClane?!","rating":3,"date":"14 February 2013","review":"I am heartbroken.<br><br>It's a sad day to say this, but it has to be said: \"A Good Day to Die Hard\" is a dud. The fifth instalment in the beloved \"Die Hard\" saga ends up as the worst of the series so far; it falters thanks to a weak characterization, even weaker screen writing, lack of worthy villains, absurd action sequences and incoherent direction. You can bet this movie will be mentioned in the same sentence with \"Rocky V\", \"Superman IV: The Quest for Peace\", \"Speed 2: Cruise Control\", \"Die Another Day\" and \"Batman &amp; Robin\". Not even the R-rating and the return of the famous \"Yippie ki yay\" line in full can save this one.<br><br>As much as I love action movies, I like mine with a side of plot and character, of which this film fails at. John McClane, one of my favorite film characters of all time, is given a horrendous treatment no beloved character should ever be given: relegated to a sidekick. This is HIS movie, not his son's! From the start he is inexplicably thrust into Russia with no back story of how the previous films over the years have shaped his character now - a key trait that was visible in the previous four films. He is reduced to a wise-cracking action supercop, and even his wisecracks are weak. However, Bruce Willis, bless him, is still McClane without a doubt, as he dishes out the bad guys with weathered-out cynicism in his eyes. He still has it in him, and in no way it is his fault that this movie turned out to be near-crap.<br><br>Rather, writer Skip Woods and director John Moore are to blame. Woods clearly missed the whole point of McClane's essence and likability - he is a vulnerable human - an everyday Joe who only stops the bad guys when \"there's no one else that can do it\". He is a reluctant hero in the first four films, he can get seriously wounded, as he is up against worthy adversaries that are cool, calculative and almost one step ahead of him. Here, McClane, in the opening car chase, and immediately causes mass vehicular damage just to stop thugs from attacking his son, shows no signs of vulnerability (after TWO major car crashes), and has no qualms about killing the bad guys wherever they pop up here. His son Jack (Jai Courtney), filling in for McClane's sidekick, has certain charisma and shows a few glimpses of character development in McClane but it is cut short by the merciless and absurd action sequences.<br><br>A good action movie has to have a good villain. \"Die Hard 5\" has none. It has three primary villains, all of them forgettable. Nothing with the likes of even Thomas Gabriel or Colonel Stuart (the Gruber Brothers must be smirking right now in hell). They're not intelligent, not menacing, not memorable. They're just dumb, die, and that's it. What was their evil plot? What dastardly deeds do they have? Weapons dealing. Oh the humanity!<br><br>The film runs at 97 minutes - the shortest in the series. Why the film was released at this length I don't want to know. Nobody complained about the 2 hour running time for each of the previous four movies. Imagine what a better movie this could've been with those cut scenes added back in.<br><br>John Moore directs with the subtlety of a car crash. He smash cuts every scene, puts heavy use of slow motion in the excruciatingly absurd climax, and relies heavily on CGI for most of the action sequences. But like all Die Hard movies, there has to be at least one sensational action sequence, and that is at the film's beginning. The only thing I really enjoyed (in a guilty pleasure sort of way) about the whole movie was a massive, destructive stunt-filled car chase throughout the streets of Moscow. It was an intense and exciting scene. Pity the rest of the movie can't hold up to this sensational chase scene alone, especially the end which essentially turns McClane into The Terminator. If you think the F-35 scene in \"Die Hard 4\" was absurd, hoo boy, wait until you get a load of this one.<br><br>At the very least, there's some competent cinematography from Jonathan Sela and a good, riveting music score from Marco Beltrami, who really knows his stuff when it comes to action, as well as incorporating Michael Kamen's themes into this one. If anything, the music is better than the movie.<br><br>There is a 6th (and according to Bruce, final) movie in the works. Here's a no brainer - bring back John McTiernan or Renny Harlin (hell, even Len Wiseman for all I care), and hire a good screenwriter who really delivers the old school action goods. I strongly believe Bruce and McClane can deliver the goods still and ride off into the sunset, instead of falling off his horse here. They just need a better story, better direction, and a more than worthy villain with a respected British actor in the role. The franchise doesn't deserve to die with this. It's too good for that.<br><br>Shame on you, John Moore and Skip Woods.","user":"dvc5159","rank":[488,562]},{"title":"Great action but...","rating":5,"date":"14 February 2013","review":"Let me start off by saying that like everyone I had a feeling this could go wrong. You have a terrible writer, Skip Woods(even if I enjoyed The A-Team) and a terrible director, John Moore. The people at Fox must be idiots because John Moore has not made one good film, so to trust him with the Die Hard franchise seemed a bad idea. The film has a lot of action if not too much, there isn't any dialog!!!! At 97 minutes it's the shortest one in the series ans it sure feels that way. Every other film in the franchise were longer, they gave you more time to explore the rest of the film. But this one feels so rushed, like okay let's go there , and then here,... The film has no structure. It's like they said \"alright guys were gonna make this as fast as possible\" Bruce Willis is fine but it's like he doesn't even talk during the whole movie, his chemistry with Jai Courtney is fine. The plot is okay even if you can see the twist coming after 25 minutes. What makes this film still enjoyable is the action even though it's disturbed by shaky-cam, bad editing and bad CGI effects. If they are gonna make another one they should bring back John Mctiernan and make the movie on a smaller scale. Back to basics!! If they make it on a bigger scale than they should make it as good as With a Vengeance.And another thing: You can't drive from Moscow to Chernobyl in a couple of hours!!!!!!<br><br>This is by far the worst entry in the franchise","user":"michaelberneman","rank":[177,204]},{"title":"Here's why it's just so bad ....","rating":2,"date":"15 February 2013","review":"As a fan of the Die Hard series I feel the need to warn others - Don't waste 97 minutes of your life on this movie! Yes, it really is that bad. <br><br>Here's a concise summary of why it's just so bad: <br><br>1) John McClane's role is really as a side-kick. Why do this to the big man .... why? <br><br>2) The movie lacks a bad guy. Does the movie have people that are bad - of course, but it lacks that McClane v Super-villain factor. <br><br>3) There's very little of the Die Hard humour we've all grown to love. <br><br>4) The movie parodies the Hans Gruber death sequence - never - never do this. <br><br>5) Jai Courtney is terrible. It's hard to discern if it's the role he's been asked to play or him, but either way he come across as a spoiled brat pretending to be Jason Bourne. <br><br>6) There's hardly any script - it's as if the script were sandwiched in post production to fit around the bangs and crashes. <br><br>7) It's not in the USA. This sounds trivial but it's not - the film just doesn't work outside of its tried and tested environment. <br><br>8) The car chase scene - oh my. If you do choose to watch the movie after reading this the good news is that yes, it does eventually end - although it may not feel this way. <br><br>So in summary, go plant a tree, play football, go for a walk, in fact - do anything but for the love of all that you hold dear - don't waste your life on this.","user":"andrewsmith1-609-479980","rank":[483,572]}]