[{"title":"well written thriller","rating":9,"date":"21 February 2011","review":"Perfect Plan is a well written thriller about a real estate agent, Lauren Baker (played by Emily Rose), who scores a superb listing from a wealthy brother and sister (Lucas Bryant, Cristina Rosato) in an upscale Chicago neighborhood. Lauren expects to earn a huge commission, and the transaction goes off without a hitch. The next morning, she reads the newspaper and is jolted by what she learns. I'll leave it at that because I do not want to give anything away.<br><br>This is a slick mystery/thriller that occasionally has a subtle neo-noir feel. All of the actors play it nicely and it was worth my time. Perfect Plan premiered on Lifetime Movie Network (LMN) last night.","user":"g404c","rank":[20,23]},{"title":"What were they thinking with the music","rating":3,"date":"25 June 2018","review":"This is supposed to be a thriller and the music sounds like something off of a 1980's comedy. This could have been a really good little movie as the story line was ok, but the music totally took away from even taking it seriously. <br><br>Reminded me of a typical Lifetime movie with a very bad soundtrack.","user":"jodib74","rank":[3,3]},{"title":"lower level TV movie","rating":5,"date":"29 July 2018","review":"The real estate market is tanking and realtor Lauren Baker (Emily Rose) is struggling. It doesn't help that her writer boyfriend Francois doesn't work. Sean Crawford comes in looking for an agent to sell his family mansion which he co-owns with his sister Rebecca. With her partner Maddie, Lauren is able to sell the coveted Chicago address for cash. Then news of the murder of the real Crawford siblings on the Appalachian Trail arrive. It's a scam and the real Garrett Crawford claims the mansion. The situation for Lauren is dire and even Francois leaves her. <br><br>This could be a murder mystery but it spends half of the movie exploring the excitement of a real estate deal. It needs to get to the reveal of the scam quicker. It needs to get to the heart of a thriller sooner. Once the investigation starts, Lauren should pair together with Garrett. This plays like a lower level TV thriller. There's no reason why that thug would leave Lauren alive. It's not the worst movie out there but I can't give this a passing grade.","user":"SnoopyStyle","rank":[2,2]}]