[{"title":"Turkish Film Brave and Bold","rating":7,"date":"12 July 2018","review":"The script and story is a direct link to how society and government views the Muslim nation after 9 11. <br><br>A captivating story of the search for a supreme leader in the terrorist organization with ties to Turkey. One of the Turkish officers is hiding a decades old secret and God sees all as is parlayed throughout the film. A direct homage to the faith true Muslims share and what we as Americans fear.<br><br>\nThe film is written by and direct by Mahsun Kirmizigul who also portrays the lead Fyrat. Good performances by Gina Gershon as the wife to Hadji and Danny Glover as Marcus. I found the fil strikingly captivating and well rounded. I give this a solid 7out of 10","user":"torstensonjohn","rank":[5,5]},{"title":"Well done.","rating":9,"date":"8 May 2018","review":"Definitely not a waste of time as some very interesting comments suggest.","user":"dagcanbarka-847-861258","rank":[5,5]},{"title":"Definitely worth checking","rating":9,"date":"6 November 2010","review":"I have to say I strongly disagree with Mz Haneke, This is a solid - almost - Hollywood quality action movie bringing up the Islamofoby issue which was probably orchestrated by certain policy makers to create a terrorist enemy that they could use whenever they need one. Story's good, most of the actors acted well, the scenery and the action scenes were very well shot indeed. The terrorist groups looked terrifying to us Muslims as much as they would to Non-Muslims and I believe what is told in the movie really touches to the reality. I watched it as I watched an episode of \"24\" and I'd like to congratulate all the people involved in the shooting of this film. And please... the multimillion dollar movie \"The Expendables\" -although I like every actor in that movie very much - were more a disappointment for me for it's storyline and acting. If that was a blockbuster, \"Five Minarets in New York\" is no less. And yes, I'm not a movie-critic, just a movie-goer but I do have a taste in films, I rarely admire much. Nice work!","user":"ukaraca","rank":[99,158]}]