[{"title":"Very well made film...dark and expressive.","rating":9,"date":"17 July 2013","review":"I almost DID NOT watch this movie due to the fact that the horrible reviews were really horrible and those people seemed to absolutely hate this film.I decided to give it a shot anyway and I am certainly glad I did. I sat down to watch the film expecting it to be bad and it was not. I loved it. The acting the was spot on, the characters flawless in their representation. The plot was extremely interesting. The movie as a whole was captivating. The only thing I hated about it is that it was over. It's not an action-packed, explode in your face kind of film. It's thought provoking, dark and highly enjoyable. I am glad I gave it a chance. It's a film more than deserving of the time I spent watching it and one I will own for myself.","user":"jojeesmiles","rank":[123,161]},{"title":"Disturbing and beautiful","rating":10,"date":"24 May 2013","review":"\"Stoker\" is a beautiful, twisted, hypnotic trance - it's meant for an audience not overly concrete in it's thinking but who have an open imagination and are able to take the plunge into the darkly poetic vision of it's director. \"Stoker\" doesn't exist in a normal, everyday reality - it's more of an alternative dream reality, hyper-aware and sexually charged. The three principle actors are superb, but Mia Wasikowska really gives the film a beating heart, as she emerges from her innocence into her latent self - a mesmerizing performance. This movie is filled with images that are as disturbing as they are lyrical and open to endless interpretation (along with a subversive wit). I've seen the film multiple times and find that my impressions change with each viewing and that it has really haunted my imagination. \"Stoker\" is one of those unique and mysterious masterpieces that I'm sure I will be returning to frequently over the years - there's much to drink in, as the well runs deep.","user":"LifeVsArt","rank":[174,244]},{"title":"Stoker: everything you love about Park-Chan Wook movies, just dialed down a couple notches","rating":8,"date":"21 January 2013","review":"As a fan of Chan-Wook Park's Korean films, particular his gross twist on a vampire story in 2009's Thirst, I was incredibly excited to see his first English language offering. Stoker, the first film made stateside by CWP, defiantly doesn't disappoint. This is largely due to the director staying with what he knows, telling a story that has all the dark hallmarks from his Korean works. However, Stoker is also less extreme then one would expect from Chan-Wook Park, as many moments of violence and depravity that could have been much more over the top are toned down. <br><br>Stoker focuses on the titular family of India, Evelyn, and Richard Stoker (Mia Wasikowska, Nicole Kidman, and Dermot Mulroney). When Richard dies in a mysterious car crash, his oddball daughter India begins to further distance herself from her estranged mother, Evelyn. After burying their patriarch, the family is visited by India's Uncle, Charlie. Charlie seems a little out there, and begins to form a sketchy relationship with India that suggests Uncle Charlie may desire more than family bonding. <br><br>To elaborate any more would spoil the film, but needless to say it's an interesting premise. The story unfolds very slowly, with few dramatic developments until the second half of the film, which contains much more wizz-bang than the somber and meticulously paced beginning. This isn't a bad thing, largely because the characters are so fascinating from the get-go that accompanying them while they go about their day to day lives is a pleasure. Even when the movie seems to be resting on its laurels early on, the performances are great all around (in particular Wasikowska's performance as distant and on-edge India). Except for a few odd holes, the script stays strong throughout, providing plenty of great dialogue courtesy of Wentworth Miller (you read that right,the dude from Resident Evil: Afterlife. Who saw that coming?). <br><br>Of course, the strongest link in the chain is Chan-wook Park. From the opening scene of fragmented shots with computer generated transitions that occur throughout the movie, his mark is clearly laid on the film. Stoker never has an ugly moment, and each shot oozes with that distinctive Chan-wook flair. My personal favorite is an early scene in a basement involving a swinging light fixture (think Once upon a time in the West). The only thing that feels absent compared to CWP's other efforts is a slew of neasea-indusing scenes whose only purpose is to shock the audience. Although Stoker has a few jarring moments (think showers), for the most part its very restrained compared to Chan-wook's other works. This is fine up until the last act, when the nature of the story demanded for a more powerful and shocking denouement then what was given. So despite not quite sticking the landing, Stoker is effectively creepy, well acted, and an enjoyable beginning to what I hope will be a long English language career for Chan-wook Park.","user":"ianfarkas9","rank":[127,188]}]