[{"title":"Stupid","rating":1,"date":"29 July 2017","review":"If you are looking for a great Christmas movie or family movie then keep looking. This film is terrible. I can not believe that anybody would like this! Its not very entertaining. I don't fault the actors they are fine. The director is the problem here. It lacks a clear point of view. There is also too many stories going on and most of them suck. <br><br>In this film Santa sees the world going to hell! Most of the children are on the \"Naughty List\". To me that was a stupid idea. The reality is that Santa would have an easier load and would be home much faster. <br><br>The film has \"A Christmas PAGEANT\" which is fine but that scene \"Goes on &amp; on\". <br><br>I dare you to watch this!","user":"bonniefrank-70119","rank":[7,8]},{"title":"Well.........","rating":5,"date":"29 July 2017","review":"BEWARE OF FALSE REVIEWS &amp; REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA.<br><br>In this film Santa's elves (Joshua Roy, Monica Eder) are trying to save Christmas. The plot line of this film is that the majority of the worlds children are now on the naughty list! Santa is about to cancel his annual ride. So our hero elves befriend a girl. Slowly there presence makes huge in her life and ripple effect takes place! The elves also learn what Christmas truly is. <br><br>There is several other minor stories that are not needed and on top of that they didn't work. So that makes this film a creative mess. It doesn't know where to focus the story line. Some people will hate the \"Christian\" message but hello \"Christmas is a Celebration of the birth of Jesus\". I am not very religious but, I don't mind a religious message. I expect them.<br><br>25 minutes of this film that could easily been cut. The dialog at times was laughable. <br><br>What I like about this film was that \"Money is not needed for Christmas\". \"Christmas is not about gifts\".<br><br>Not a bad film but not a film I would want to watch again. Safe for children but they might get bored! The film runs almost 2 hours","user":"Christmas-Reviewer","rank":[5,7]},{"title":"Not perfect, but nice qualities for a small independent feature!","rating":7,"date":"16 November 2010","review":"This film is for a young demographic (probably 6-15), however it did have some legitimate laughs anyone could appreciate. It thrives on heart and honesty set against a backdrop of small town charm. Two elves, away on assignment, team with a local Christian girl to re-establish good principled behavior within the town's cast of trouble-making children.<br><br>As far a production value, the film is carried by it's cinematography, sound, and locations, all of which are grade-A and top-tier for indie film making. Other pluses include wardrobe, make-up, and bits and pieces of the acting and dialogue. Based strictly on these elements combined, I give the film a 9++.<br><br>What holds this film back are some weak areas in the script, acting, and editing. Some scenes and dialogue dragged, causing the film to (uncomfortably) lose tempo. Based strictly on these elements combined, I give the film a 4. A lot of the real qualities came from certain departments and that is evident. Sadly, the script, tempo, and amateur acting just countered much of the positives. In evaluating the film for its total attributes, I give a rating of 6+. The lack of completeness was damaging but to the film's credit, it had many high-value elements that most low-budget indie films can only dream about.<br><br>A great feature for students/fans of indie film (lessons to learn/lessons to gain). A nice DVD for all of the kids in your extended family.","user":"trident712","rank":[1,7]}]