[{"title":"Low budget movie with a twist","rating":5,"date":"12 April 2011","review":"Bad acting, bad directing, which is consistent with low budget filming. The only reason why I rated it a 5 is due to the fact that towards the ending of the movie I was caught off guard with its interesting twist. If the acting, the directing and the script was polished, I would have scored it high and I'd watch it more than once. The quality of the film was something to be desired (sarcastic remark). While I was watching the movie, I nodded off a couple of times. I also was irritated at the director's acceptance of some actors' performance. But like I was saying about the script, if Ryan Nicholson polished up the script a little more and let a more seasoned director make the movie, it may have been a hit. Also, he could get a better understanding in directing a film.","user":"jdsalas","rank":[7,9]},{"title":"This vehicle lost it's wheels.","rating":3,"date":"26 April 2011","review":"The quality just plummets further in Ryan Nicholson's new film.<br><br>The plot is actually a good idea. A guy who drives actors and actresses to and from their filming locations finally gets to meet his favourite actress but things soon turn dark when he decides he's going to make his own movie.<br><br>The movie kicks off with some ridiculous scene which is neither explained or has any relevance on the plot other than to put some blood and guts in there to keep the gore-hounds happy. The film then just crawls along with terrible dialogue until the next gore scene is just shoehorned in to stop you from getting bored or falling asleep. The acting from the start as you'd expect in this grade of movie isn't the best. The two main leads are acceptable but everyone else is pretty bad. The film really suffers in its pacing which is further hampered by lots of static camera shots. Sometimes almost whole scenes filmed from one angle. Some of the gore effects are also spoilt by some terrible editing. <br><br>I don't know if Nicholson is trying to move away from his earlier films over the top set pieces. But the fact that they're not in here makes you notice how bad the script is. It neither stays truly gritty or goes all out over the top. So you're left wondering what the films trying to do.<br><br>I remember when I was a kid in a drama lesson at school. The teacher got us to make up a little play. They only gave us twenty minutes to come up with something. When the twenty minutes were up we hadn't come up with an ending. We thought, well we can sort something out while the other groups are showing there's. Well we were first. So we started and when we got to the ending we just started making stuff up. It was a complete mess but we got through it. The reason I'm telling this story is because the last twenty minutes of this film reminded me of that. It's a complete mess that just seems made up as it's going along. Just a real disappointment. I hope if Ryan Nicholson gets to make another film he spends a little more time actually writing a script rather than letting his actors improvise the film.","user":"Greenzombidog","rank":[5,9]},{"title":"A Disappointment From Ryan Nicholson","rating":4,"date":"17 March 2011","review":"Frustrated Teamster driver Donald Q. Cardini (Dan Ellis), abused by spoiled stars and arrogant students, who becomes a ticking time-bomb of revenge. As Don goes on the rampage, his favorite scream queen, Riversa Red (Sindy Faraguna), finds herself up for a new role in the greatest gorefest of all: real life.<br><br>A noticeably lower quality than \"Gutterballs\", which I would consider one of the greatest slasher films ever made. Was the budget not there? I do not know, but the video quality looks very amateurish, and the acting is questionable from many of the bit parts.<br><br>Sometimes ultra low budget works. One of my all-time favorite films is \"The Janitor\", which pushed the low budget to an extreme. This film does not seem to realize that to capture an audience, you need to make up for the low budget with a sense of humor. This films lacks it, with even less humor than \"Gutterballs\". And it does not help that the review copy I received seems to be the wrong dimensions (the screen is squished in).<br><br>The score is repetitive and uninteresting. This was the same man who did the \"Gutterballs\" score, I believe. However, that films had a rocking soundtrack of Loverboy and Trooper to carry it. Here, no real music to speak of, just the same riff over and over and over. Could the sound be partially to blame for my dislike of this film? Oh, heck yes.<br><br>Nudity is always a plus, and the girl with the lotion is sexier than she ought to be for what she was paid. But that, sadly, may have been the highlight of the film for me. Two minutes of young breasts. Which is either an incredible insult to myself, or an incredible insult to this film. I am not sure which, but I will probably never see this one again.","user":"gavin6942","rank":[6,13]}]