[{"title":"Never laughed so much at a romantic comedy","rating":7,"date":"16 September 2011","review":"Solid acting and a good script can make a movie with few comedians' hilarious. The reality that was portrayed in this film kept me watching and the slick jokes kept me laughing. The four main stories are brought together beautifully and the characters are impressive to the mind and spirit. Zenobia (Nicole Ari Parker), Victoria (Tamala Jones), Cleavon (Kevin Hart), and Phil (Keith Robinson) are four child hood friends who are at a crossroads in their lives. As the hands of time cannot be turned back, the 30+ year old friends try to settle into their desired positions in life. Marriage, dating, and love are all placed in a comedic light in this upbeat comedy. This film is definitely worth a visit to your local red box. Kevin Hart, and Mike Epps at times, will give you a reason to keep grabbing at your guy. The rest of the cast will give your characters to be angry with, laugh with and smile with throughout the movie. This move is a diamond in the rough.","user":"d_harvell","rank":[7,8]},{"title":"Not quite Up-To-Parr, but enjoyable nonetheless...","rating":5,"date":"29 September 2011","review":"Having just watched a slew of African-American films such as Jumping The Broom, This Christmas, Soul Food, Breakin' All The Rules, Two Can Play That Game, &amp; it's counterpart Three Can Play That Game, I thought I would add this film on my list to watch...my other reason being my interest in watching the careers of some of my favorite black actors like Meagan Good and Mike Epps.<br><br>The film itself was enjoyable...a bit unrealistic, but enjoyable. The film was well casted with some of the most humorous black actors we have in this industry today...I can't say I am too familiar with Nicole Ari Parker's work, but she did a very decent job on this film, bringing lovable, relatable warmth and humor to her character Zenobia. The amazing gorgeous Tamala Jones was a delight to watch (if I had a wife her age with a beauty and a killer bod like hers, I'd consider myself the luckiest bastard on earth). Kevin Hart is quite humorous, at times. Mike Epps is funny as ever...maybe even steals the show. The simply stunning Meagan Good was a refreshing sight for sore eyes, having just seen her in JTB.<br><br>I can't say much about the writing. I admire Russ for coming up with a storyline about four best friends in their mid to late 30's still trying to make sense of their love lives, especially with 40 creeping up on them pretty quick. I bought some of the situations that some of the characters went through, yet others seemed highly unrealistic, or if it was, the subject was approached in a very harsh, careless manner in an effort to generate sympathy for the characters. The ending of the movie kinda threw me off...way off (won't spoil it for anyone)...it just seemed thrown in there as a last minute ditch effort to complete the script and bring closure to the characters' arc. If anything, it didn't seem like quite the happy ending that they had hoped for...they just seemed to...settle with what they could get.<br><br>On the Technical side, things were even more awry. One could possibly make the assumption that to save on the budget for this film, a group of film school students were whisked away right after graduation to work on this project. Much more notable than others was the sound editing...in some parts of the movie it was fine...maybe probably easier for the sound people when working indoors, but when filming outside, a complete disaster. The ADR, if any, was abysmal...the background noises didn't quite match as they were edited (yes, I know, very picky...but believe me, quite noticeable)...in a seemingly simple scene of four characters having a conversation, in one shot, the sound seems fine, but when it cuts to another shot, the sound is way off, as though someone or something in the background was blasting tunes next door when that shot was being filmed. No effort made to edit out the clearly mismatching background noises. The cinematography wasn't horrible, but it could've been much much better. In some of the indoor locations, it seemed as though not much effort was used to make full use of the location...the actors always seemed confined/compressed to one spot...maybe to make room for all the lighting and crew in the room with them...not much movement. The editing...no comment. I just re-iterate that maybe film students were used on this one...maybe.<br><br>The casting, I had no problem with it, although I am now noticing a trend in over-using the same actors over and over again...Meagan is in practically every African-American film that has recently come out...but I guess it must be a good thing if she's trying to get some more exposure as an actress...Mike Epps as well. As well, very noticeable, the film only seemed confined to use a certain number of actors, maybe due to budgetary constraints...(this could be a spoiler, or not), but some of the secondary characters 'conveniently' kept popping up at the utmost opportune moment....maybe to help serve the story's purpose, I don't know...you'd have to see the film to know what I am talking about.<br><br>Overall, despite it's noticeable flaws, 35 and Ticking was an enjoyable film to watch. It had a few punches here and there, but it did it's job. Not quite up to par, but enjoyable nonetheless...","user":"Mystikal104","rank":[3,3]},{"title":"A Very Funny 30-Something Comedy","rating":8,"date":"7 July 2011","review":"I came across this film at the Washington DC Independent Film Festival and knew nothing of the director. I was expecting a typical urban comedy in the style of \"Soul Plane\" or \"Booty Call\", and was happily surprised that it was more intelligent and well crafted. It that respect, it reminded me more of \"Soul Food\". The main characters in \"35 and Ticking\" are well developed and believable. The humor kept me laughing for most of the film. It avoids the raunchy quality of other recent comedies.<br><br>On the downside, the ending wraps up a little too neatly for my tastes. Director Russ Parr could have left some details for the audience to fill in, rather than fixing every loose end.","user":"deaverb-1","rank":[8,13]}]