[{"title":"Please don't waste your time","rating":2,"date":"3 October 2013","review":"I watched this because it was billed as a follow-up to Harper's Island(which I loved, BTW). This however, was horrible. The story was so poorly written that you knew the entire time who the \"bad guy\" was. Acting was so bad that I was kind of hoping everyone would get killed, to be perfectly honest! The main character was not even remotely likable, neither was the bride. Both actresses seemed to be too old to be playing their respective characters. There was absolutely no character development or background, so it was really difficult to care about any of them. The only thing that made this bearable were a few scenes that were unintentionally funny.","user":"dianereneew","rank":[6,7]},{"title":"A must-watch mystery thriller","rating":9,"date":"25 January 2018","review":"Shadow Island Mysteries: Wedding For One is a thrilling mystery TV Movie. This film has a lot of positive elements, i didn't notice any swearing, the plot is decent, and the movie tells it like it is, it's a mystery flick, what we see is what we get.<br><br>This film is slightly predictable, but nevertheless still very watchable. There's a lot of TV Movies that are awful, but this one is worth watching.<br><br>If you like TV Movies and if you like mystery films, check out this movie!","user":"nadinesalakovv","rank":[2,2]},{"title":"Mystery movie with Horror Movie decisions making","rating":5,"date":"30 July 2019","review":"The setup for the movie was actually pretty decent, if a little cliched. The husband-to-be is setup to be as unlikelable by as many people as possible. Each of the main characters on the island have their own motive (excepting the hero, Claire, and the bride-to-be). The problem comes when the mystery starts kicking off. Claire really stumbles through the clues, and there is enough foreshadowing by the director that it is relatively obvious to the viewer where the clues are supposed to lead. That in and of itself isn't so unforgiveable for a mystery movie. But as the movie progresses Claire is running around like the final-girl in a horror movie (what's down this dark-alley, I better check it out alone and not tell anyone). There are also way too many instances where something happens, another character happens to come by and she asks if they saw anything and they say no. She doesn't follow up on any of it. She doesn't look for footprints in the snow, only performs the most cursory of examinations, etc. She just waits for the next clue as if nothing happened.<br><br>The really stupid part comes when she never calls the cops. Things go from might-be-a-joke to legitimate almost-gets-killed moment. She asks someone else to call the cops, because she can't carry her cell-phone in a bridesmaid's dress (even though she has a winter coat with pockets). Hours and hours later, the cops still haven't shown up. She never follows through on why the cops didn't show up, and doesn't seem to care that someone tried to kill her and will get away with it. Frankly, at times it seems like she was intentionally trying not to figure out what happened, even when the culprit is practically waving it in her face.<br><br>It almost falls into the so-bad-it's-good category. The characters are cliched, over-the-top and one-dimensional. The setup is strained. There are also things like the bride-to-be barging in first thing in the morning and syaing they have to do hair and make-up, even though both characters look like they just got out of a salon. There are also numerous plot-holes and unlikeliness elements that just don't withstand even casual scrutiny. The movie is blah, but I did watch the whole thing, so couldn't be that awful...","user":"BigGuy","rank":[0,0]}]