[{"title":"Standard Lifetime Fair - a Solid 5","rating":22,"date":"22 August 2011","review":"NO SPOILERS UNTIL THE VERY END - CLEARLY MARKED <br><br>Wandering Eye is your basic Lifetime movie by numbers but that doesn't mean that it's a bad movie, in fact I thought it was enjoyable to an extent and overall a solid 5 - but there's definitely nothing new to see here which isn't necessarily a bad thing if you love formulaic Lifetime films.<br><br>Amanda Righetti stars as the lead, Maren Abbott who is married to a Dr who is married to his work. She loves him and wants to show that but as a Surgical Resident, he rarely has time to spend with her. Desperate to be with him, she shows up in his office in her underwear (under a coat) disrobes when he walks in &amp; despite kissing, he quickly cuts it short to run off to a meeting leaving Maren feeling abandoned.<br><br>Wandering Eye is a website where married people who have lost the spark can seek out affairs with other married people leaving things guaranteed to be discrete since neither party wants to get caught and ruin their respective marriages. This website has an online call in/advice show that Maren watches via her laptop as she exercises daily. It is this webshow that convinces Maren to sign up for Wandering Eye (using an alias - Alison) and seek out the love and attention she is lacking in her own marriage.<br><br>Meanwhile, a couple is shot/murdered and their ring fingers severed (the rings were left behind) and it is revealed that the man and woman were having an affair. The man's wife and 2 kids were away in Florida leaving the woman's husband as the prime suspect for the murders. The movie wastes no time trying to get the audience to suspect the husband of the murders dropping anvils left and right complete with scary thriller music every time he comes on screen, literally. The music would dramatically change to something dark and suspenseful when he would come on screen even if it was for 20 seconds - cheesy and stupid to say the least.<br><br>Maren sets up a date with a man named Lucas, played by Frank Chiesurin, and despite being apprehensive, goes through with it. The two meet, exchange info (Lucas is married to a Dr. and has 2 kids) &amp; after Maren doesn't want to take it any further that day, leaves. A second date is scheduled (correspondence is done through the inbox of the Wandering Eye website between their private accounts) &amp; the two meet first at his hotel bar (he is from out of town) but quickly move up to his room. Drinks are poured, followed by kissing but Maren starts crying because she realizes that she can't go through with it after all. Lucas is understanding and she leaves - mere minutes after she leaves, Lucas is shot/murdered and his ring finger severed just like the previous 2 murders.<br><br>A connection is made by the police between the 3 murder victims and the website, Wandering Eye. They also realize that Lucas' date escaped with her life but have no way of tracking who she was since she used an alias, Alison and the e-mail she used to sign up for the site is web based. Once it is clear that the site is the connection, the police go to the offices only to learn, via the computer tech there that the system has been hacked numerous times meaning that any and all info of the members has been compromised. The killer is reading private inbox messages to learn about where and when people are meeting and killing them. Who is he/she targeting and why? That is the question. As the police try to save impending victims, 2 more people are murdered while on a date - shot and fingers severed making the victim count now 5 with Maren having escaped barely with her life.<br><br>In the end, Maren comes forward knowing that the police are looking for Lucas' date, despite being afraid that her husband will find out and the rest of the movie has Maren working with the police to find the killer. Things heat up when Maren receives a text from the murderer blackmailng her in exchange for her life but in reality, it is a trick to lure her out into the open since just like the police initially, the killer, too doesn't know the identity of Lucas' date which means that it's unfinished business. The killer wants to kill Maren only he/she doesn't know her real name/where to find her.<br><br>I personally guessed the killer the second he/she showed up on screen but I don't think it was overtly obvious to the point where it ruins the movie. I did think that the acting of the killer was atrocious which is what made me focus on this person in the first place. <br><br>VAGUE SPOILERS STARTING NOW - NO ACTUAL DETAILS<br><br>Wandering Eye has your usual Lifetime type ending where the good people live and the bad people die and of course despite the fact that the other 5 victims were killed instantly, no questions asked by gunshots, when it comes to the lead, Maren, rather than being killed when the killer finds her and literally has a gun to her head, instead the killer decides to take her for a ride and reveal his/her motives for the killings to conveniently be thwarted before Maren can die. <br><br>5/10 It's good for one watch but that's about it.","user":"PhantomAgony","rank":[8,10]},{"title":"Appointment for Murder","rating":6,"date":"14 August 2011","review":"**SPOILERS*** Bored and frustrated in having her doctor husband Connors Abbott, Michael Travis, away at the hospital for as much as 20 hours a day in the ER Mary, Amanda Righetti, joins, on a hunch from a number of married friends of her, this personal internet website called \"The Wandering Eye\". The website caterers to married persons like herself who feel that the spark has gone out of their marriage and want to start up a new relationship with fellow bored and frustrated married individuals. Unknown to Mary there's someone else who's also very interested in \"The Wandering Eye\" and it's not from meeting a future love partner. This person's been tracking down the websites membership and murdering them! What's so unusual in the killers motives for murder his that is victims ring fingers are cut off and the wedding rings removed!<br><br>Having a date set up between Mary and pharmaceutical salesman Lucas Manning, Frank Chiesurin, by \"The Wandering Eye\" website the two after having lunch meet up at a swanky airport hotel to get down and dirty only to have Mary in feeling guilty, about screwing around behind her husband's back, back out at the very last moment. Left alone and having a few drinks someone's enters the hotel room and bows Lucus away! It's when Mary sees on TV the news of Lucus's murder she realizes that whoever murdered him is soon going after her and decides to come clean in being the last person, besides his killer, to see Lucus alive and go to the police! It soon becomes evident to the two detectives on the Lucus Manning murder case Detectives Jackie Fizpatrick &amp; Kyle Solomon, Krista Bridges &amp; Andrew Shaven, that both Manning's, who also had his ring finger chopped off, and the previous couple Michael Hallas, Mark Lombert &amp; Ann Federman, Maxine Morin, where murdered by the same person. And what connected those murders was the victims being members of \"The Wondering Eye\" personal website!<br><br>***SPOILER*** Interesting take on the killers motives in murdering married couples who cheat on each other that has to do with his or her obsession to upholding the vows of matrimony which was very dear and near to his heart. With Mary getting away with being offed by the deranged killer he makes a determined effort to murder her in tricking the police into thinking that someone else, a former boyfriend of Mary's, is the person that their looking for. It's the killer's arrogance and self confident in his own indestructibility or in not getting caught that in the end does him in. That's by exposing himself and being a bit too talkative, when all he had to do is put a bullet in Mary's skull, that had the cops that also included Det. Jackie Fitzpatrick's ex-husband police serial killer profiler Det. Will Atherton, Allen Altman, get the jump on him! It's then where the killer soon ended up getting hit and hospitalized, and later arrested, by a runaway police car.","user":"sol1218","rank":[9,15]},{"title":"A Character With Some Backbone!","rating":2,"date":"2 April 2018","review":"In its narrative design, \"Wandering Eye\" was a routine detective-style thriller. But by the end, a very engaging protagonist emerges out of a standard psycho killer-on-the-loose plot.<br><br>The main character of Maren Abbott was trapped in a lackluster marriage with a doctor, who is such a workaholic that she has chosen to meet other men on through a website called Wandering Eye. <br><br>It turns out that the website has been compromised, and a mad killer is stalking the clients during their trysts. As part of the stock formula of this genre of film, the police are completely incompetent in tracking the killer.<br><br>That brings us to Maren, the character who steps up to do the job of the police by serving as \"bait\" to draw the killer out. In the end, there is a clever plot twist in the identity of the killer.<br><br>But more than a suspenseful crime yarn, Maren gradually develops into a character of stature. At each turning point, she makes a choice based on integrity. Her thoughtful decisions eventually have a payoff--not so much in the entrapment of the killer--but as a decent person who did the right thing. <br><br>This was a well-conceived, multi-dimensional character with an excellent interpretation delivered by the performer.<br><br>Well done!","user":"lavatch","rank":[1,1]}]