[{"title":"Better than Its Receipts Would Indicate","rating":8,"date":"15 March 2014","review":"Man, this poor movie stunk up the box office. Too bad, it was an excellent, and dare I say it? - family friendly film. I remember buying the Hot Wheels cars, I remember Snake vs. Mongoose on Wide World of Sports, and I immensely enjoyed the more or less true story about the friends, rivals, and ultimately friends again pair who helped take racing to a higher level.<br><br>Not too many big names here, John Heard has a minor role, Noah Wyle has a bigger one, but the low-lying stars, Richard Blake and Jesse Williams, and also the delightfully unassuming Ashley Hinshaw as Lynn Prudhomme, will take you back to the 70's, when gas was cheap, cars were fast, and people sadly died when things went wrong with forward-engine top fuel dragsters.<br><br>Give this nice film a try.","user":"bbbaldie","rank":[12,13]},{"title":"Pretty good, all things considered","rating":7,"date":"31 October 2014","review":"I disagree with Netflixry. My dad used to drag race, so I grew up at the race track. I majored in Broadcasting in college, so I'd like to think I also have a decent grasp of film making. Is this film on the level of Forest Gump or Titanic? No, it's not. But Snake and Mongoose didn't have their budget either. Does it have a 'made-for-TV' feel to it? Yes it does. But I wouldn't call the film horrible. In fact, my dad and I were talking after watching it, and we agreed that it's probably one of the best racing movies ever made. Will a die hard drag racing fan notice a few minor inaccuracies? Yes. But on a whole, this film was still a lot more true to the historical and technical aspects of racing than Heart Like a Wheel, Days of Thunder, or Driven. So if you're a motor sports fan who doesn't realistically expect the production value to be on the same level as Jurassic Park, I'd say it's a good watch, worth your 90 minutes of time.","user":"jrm111881","rank":[5,5]},{"title":"B-Movie Quality--But the History of it All Was Interesting","rating":6,"date":"22 April 2014","review":"If you're looking for award winning caliber acting or writing here then this is probably not the movie for you , as it has a definite B-movie stamp on it. However, I found myself engaged enough in the story, based on true events, to be quite interested throughout.<br><br>It chronicles the 20 year drag racing rivalry between Don \"The Snake\" Prudhomme and Tom \"The Mongoose\" McEwen, culminating at the NHRA U.S. National Championships, in 1978 at Indianapolis, Indiana. This was rather a friendly rivalry even culminating in a business partnership at one point.<br><br>The two men were polar opposites in personality with McEwen, portrayed by Richard Blake, being outgoing, gregarious, and always looking at innovations and the big picture, while Prudhomme. played by Jesse Williams, being a \"nose-to-the-grindstone\" type who was completely focused on winning races.<br><br>Led by McEwen's excellent marketing skills, they eventually landed the large toy manufacturer Mattel as a sponsor, and it proved to be a highly beneficial partnership for all concerned, with the Hot Wheels toy promotions. This also helped bring drag racing onto the national scene and brought a whole new wave of fans on board.<br><br>With a good supporting cast including Ashley Hinshaw, Tim Blake Nelson, Fred Dryer, Noah Wylie, and Kim Shaw the movie was also enhanced by its' interspersion of actual drag races and the national TV coverage at times. There's also a short but funny interview clip with the real Prudhomme and McEwen which was valuable to see.<br><br>Having watched drag racing on TV years ago, I found this film overall to be interesting, despite, as mentioned, the wooden dialog and acting.","user":"larrys3","rank":[4,5]}]