[{"title":"If comedy classic \"Van Wilder\" were a student film...","rating":2,"date":"12 April 2014","review":"DisOrientation is a college comedy that borrows heavily from Ryan Reynolds' turn as the titular Van Wilder but with a cocaine habit and less charm. Just like Van Wilder, our hero, Finn takes an geeky freshman under his wing who is far too awkward to be believable. A token black friend, who is literally referred to as such for a laugh, also drifts in and out but as he has nothing of importance to say or do that joke really falls flat.<br><br>Typical of this genre, our heroes are tormented by a group of stereotypical alpha male bullies who rack up the majority of the profanity in the script. This also fails to amuse as the insults they hurl sound like the stuff nine year old boys would construct out of ignorance. The rest of the film is a mildly funny pastiche of seemingly endless vomit gags and less than the appropriate amount of nudity that a sub par script of this genre would normally require. The movie does end with a legitimately funny, homo- erotic prank which I caught while channel flipping. It was enough to make me set a recording for the next airing which turned out to be a waste of time.","user":"seanc-gavan","rank":[15,15]},{"title":"Poor Man Van Wilder...","rating":5,"date":"14 December 2013","review":"I saw this at the video store, i usually love juvenile comedies like that so i gave it a shot. First thing that stroked me was how the beginning looks very close to Van Wilder. Finn wanting to remain in college even if his time should be done, trying to \"educate\" new roommates that are more the intellectual type. Of course you got a bully that want to do all he can to make sure Finn get trouble. Finn also has to pass exam if he want to remain there(yep pretty much like Van Wilder).<br><br>In any case, i am more than surprise at the reviews, i tough this movie was not that funny. It had its moment, but i would say i was not impress with most of the characters. Finn himself is OK, the blond chicks who work at the bar is alright too, but the nerdy guy is just so awkward i couldn't believe in him, he look fake as hell, and i didn't saw the chemistry between the 2 guys. The bullies are not introduced until later in the movie and really where not much interesting. All the other characters where forgivable.<br><br>Honestly i wouldn't go and say this is a terrible movie, cause it had some moments, but it was clearly not a real good movie either. Nothing really stand out of it and its just another below average teen comedy that will be easily forgot with time.","user":"destroyerwod","rank":[9,12]},{"title":"College Brothers","rating":4,"date":"3 August 2014","review":"It's nice when the German distribution gives you a summary line ... which they used as title for this movie! I kid you not. But let's not get ahead of ourselves (something the movie does quite a few times). I did expect it to be worse than it actually was. There even was one scene where I had to laugh out loud (\"why do you have a video of your parents...\" is all I'm going to say, you'll know the scene, when it comes up).<br><br>Apart from that it's the usual: a guy who's too old to still be in \"school\", gets a roommate who acts like he's 16 (weird glasses and all) and completely naive. They are actually both fish out of water types. You know where this is heading, some immature jokes (nudity, puking and much more) ensue and we are well on our way. There is a lot of heart in this, even it's most silly moments. Doesn't make it great, but might make you chuckle once or twice, especially if you're in the mood","user":"kosmasp","rank":[1,1]}]