[{"title":"Hit and Miss","rating":5,"date":"11 June 2017","review":"This film starts off as promising. There is some good dialogue and the characters are generally interesting and believable. Then somehow several of the characters are just dropped as our four mains (not necessarily the most interesting of the characters introduced either) decide to ditch their party and go find a haunted house.<br><br>Once this happens things slowly start to go downhill, not only does the ditching of these other characters make their scenes at the beginning completely pointless (why not just start at the haunted house?), but it means that things that looked like they were going to come into play later actually don't. So we get stuck with the four leads as they go through this house, and even that can't hold together long.<br><br>There is just no pacing in this movie, it builds you up and then lets you down. I did quite like their approach on what is really scary in life, but most of the time it doesn't seem like the characters should really be going through what they are, which again could make sense, but the ending undoes that too. So overall this film feels like it is chasing its own tail, almost as if it had two completely different writers that had completely opposing ideas about what film they wanted to make. There is some good here, but it is buried underneath a pile of confusion and mistaken misdirection.","user":"scythertitus","rank":[7,7]},{"title":"It's was there, then it flopped...","rating":3,"date":"8 December 2016","review":"The start was as good as any horror film, but somewhere along the way this film lost itself. There are some good scenes in this film, but they lacked to go the distance. Maybe to explain why some of the weird happenings were happening could help. I feel they rushed too quickly into things with leaving much to be desired. About half way through I was still engaged and then I felt they dropped the ball hard. I like far out ideas and things out of the ordinary, obviously I chose to watch this film. Yet with really no attempt to create any sort of understanding of what is going on, it became disappointing. One of those moments where it ends and your sitting there thinking what crap. Not left thinking or wondering about it in a good thought provoking way. I feel if someone used the same premise, and gave more insight into the what and why of this film they could make a decent film. More time and effort maybe, I can't help to think this film was rushed. As for watching I can say you can definitely skip this one.","user":"ncallinicos","rank":[4,4]},{"title":"No refunds.....","rating":4,"date":"29 November 2016","review":"A haunted attraction repays a portion of the admittance fee for every floor patrons are brave enough to complete, but nobody has ever made it all the way through to the end.<br><br>On Halloween night, four teenagers go looking for this urban legend. What they find is the titular house, the legend itself.<br><br>Once inside the house, the teens quickly realise the house is more than a haunted attraction.<br><br>The house knows the things each of the four keep hidden, and forces each of them to come face to face with them........<br><br>Another Halloween film that sounds really good on paper, but the final product is less than stellar, and quickly runs out of steam once we hit the titular house.<br><br>The main problems with the film is the atypical teenagers whom have all the tropes that teenagers in films have had for the last thirty years, and you can guess who's going to live and who's not before they even open their mouths.<br><br>Krause is okay as the skeleton, but he is far too serious to be the 'host' of the house. What we need here is a camp, sinister Captain Spaulding type character who plays mind games with the group, in a friendly but sinister manner.<br><br>And once we are in the house, you just find yourself yearning for the remake of House On Haunted Hill, which isn't the best film in the world, but it's a lot more fun, and is self deprecating enough to be on the verge of parody.<br><br>So instead of upping the ante once the house is entered, it's nothing more than one of the group seeing something a little ghoulish and the others looking at them in a concerned, but perplexed manner.<br><br>And don't forget that horror films with a simple but promising premise has to have some sort of mind-bending twist come the end, and in this instance, it's not needed, and feels totally out of place.<br><br>A wasted opportunity, which infuriates more than just an atypical rubbish lazily made horror film.","user":"FlashCallahan","rank":[5,6]}]