[{"title":"totally forgettable movie","rating":6,"date":"23 February 2020","review":"With poor plotting, inconsistent pacing and a rushed sense of chemistry amongst the new cast Pirates of the Caribbean: Dead Men Tell No Tales exposes the swashbuckling sequel as nothing more than a cash-grab that's as hollow as the ships they occupy.","user":"MR_Heraclius","rank":[40,43]},{"title":"Very disappointed with the direction they went for this one","rating":4,"date":"9 September 2017","review":"The writing is very minimalistic, character's are all former shadows of themselves. The young character leads are forgettable and character development feels almost non-existent. The lead female is an advocate for woman's rights it seems..instead of just being a really cool protagonist who 'happens' to be female. The whole cast pretty much runs around doing nothing. Jack's crew (Gibbs in particular) have been reduced to mediocre comedy relief. Quite a few plot holes as well as being historically inaccurate in parts. I did enjoy a few scenes, not enough to warrant a rave review though. :P<br><br>I've enjoyed all of the Pirates films but I think it's about time they wrap things up.","user":"kuroahhuhh","rank":[59,84]},{"title":"A below average retread of previous pirates films","rating":4,"date":"31 May 2017","review":"After not really caring for the last pirates of the Caribbean film I didn't have high expectations for this movie but I went and saw it and I was right to have these low expectations. The premise of the film sees the return of captain jack sparrow as he leads an expedition for the Trident of Poseidon while on the run from an old enemy. Johnny depp has become known for the role of jack sparrow and I think when in that character he usually delivers his best, that was until this film. He has some of the charisma and jack nuances in his performances that makes him entertaining, but this character is a shell of his former self. This is the least funny he has ever been, the least charming he has been and I ended up feeling like he phoned in this performance quite a bit. The supporting cast is pretty large but I will go over the main ones, Salazar played by Javier bardem is the main villain in this film and I thought he was a pretty decent villain. He is a little hard to understand at times but, he is pretty menacing in this film and I liked his back story that makes him also a little sympathetic but then he is menacing and it adds to his performance. Geoffrey rush is back as hector barbosa in this film and like always he is great, I wasn't the biggest fan of some of the things done with his character but rush always gives a fun charismatic performance that does make me smile. However, we get to the new characters played by Brendon thwaites and kaya scodelario who are both completely wooden and lacking. I didn't buy there chemistry at all and I didn't like the involvement of lore to try to make Them interesting because they really weren't. The story is very jumbled and a bit all over the place, similar to stranger tides there is just too many people going after this artifact that you don't even remember them all. The Salazar plot and trident plot feels like two different movies and the meshing just really didn't work. The script has a couple of laughs in it I can't deny that I laughed enough for passable. However, there was a lot of misses in this script with this possibly being the least funny of the films and definitely the film with the least drama and heart in it. The style of this film has some of the pirates action scenes that are very enjoyable especially towards the beginning of the film. But as the film progresses the action felt a bit hollow as I didn't really care about any of the characters. Overall this is the weakest pirates film in my opinion and unless you are a big fan of this franchise like me it isn't really worth a watch.","user":"alindsay-al","rank":[151,231]}]