[{"title":"Why does Pinhead look constipated on the DVD cover?","rating":2,"date":"19 March 2012","review":"To think now that there is 9 Hellraiser films is just incredible, but even sad to think how downhill it went with the series. For some odd reason, the Hellraiser series was never as popular as other horror franchises like Friday the 13th or Nightmare on Elm Street. Maybe because most of the sequels were direct to video, who knows? However, despite the downfall of the more recent sequels, we wanted more Pinhead. The later sequels took a different turn where the scripts were written and Pinhead was added in later sometimes not making it feel like a Hellraiser film at all. Then comes along Gary J. Tunnicliffe who has a vision of bringing Hellraiser back to the basics, open the box and Pinhead is coming to get you and make your life Hell. Not a bad idea, however excluding Clive Barker and Doug Bradley is where the film just went totally wrong. With a very lousy budget and short time to make the film, Hellraiser makes Ed Wood look like Steven Spielberg. After all, look at the cover of the DVD, it looks like Pinhead is constipated.<br><br>Best friends Steven and Nico travel to Mexico. They film themselves engaging in several days worth of drunken partying until one night they are attacked in their room by a man with pins driven into his skull. The boys disappear, and the Mexican authorities ultimately turn over their belongings to their parents, including a videotape made by Steven that apparently documents their final moments. A year later, Steven's parents Ross and Sarah, and sister, Emma gather for dinner with Nico's parents, Peter and Kate. Emma finds a gold and black puzzle box visible in the final moments of the video. Playing with it causes Steven to materialize out of thin air, covered in blood that does not appear to be his own. The families prepare to rush him to the hospital, only to discover that all of the vehicles have disappeared from the driveway. Attempting to dial 911, they discover that the land lines and cell phones are receiving interference and no outgoing calls can be made. Steven tells the families that he has escaped \"The Cenobites,\" and what he and Nico went through.<br><br>The problems with the film are major: the actors are either too over the top or had too much botox as the under acting was out of control. I found it hilarious that Niko's mom is \"so distraught\" over Niko's disappearance that she clearly found the time to get a good plastic surgeon and looks like a super model when she's asked to come to the house to discuss her son's possible death. Why was the sister dressed so sexy too? Not to mention I think her role was just to sit and look pouty and sexy, pout, sex, pout, sexnice stretch there. None of the characters were likable at all. Poor Pinhead, once upon a time one of the most feared villains of the horror genre. A man who took the ultimate pleasure in torturing others and making your life Hell now stands there making constipated looks with jacked up make up and a duck face while talking in a voice that sounds like he should be reading \"A Tale of Two Cities\" to me. His voice was so dull and lifeless, how could you ever take this guy seriously? From what I heard, Doug Bradley turned down the role as he would've been paid enough money to have a new fridge, well good to know what little dignity he had after the last few dumb sequels. But much kudos to Clive Barker, as he said \"this is no child of mine\" along with some words I wish I could say on IMDb but can't, but trust me it's good. The story wasn't that bad, it was the rushed pace and bad characters that really did this movie in. Please leave the Hellraiser series alone, let it rest in peace.<br><br>2/10","user":"Smells_Like_Cheese","rank":[34,36]},{"title":"Thank Goodness Doug Bradley bailed- this is a career-killing and possibly even a franchise-killing mess...","rating":1,"date":"28 April 2012","review":"In 1987, Clive Barker unleashed the first film in the \"Hellraiser\" saga onto the masses, from his literary work \"The Hellbound Heart.\" The first film was, and still is in many ways, an iconic, classic entry in the horror genre. The rest is history. At the time I am writing this review, the series has spanned nine films (with rumors of a TV-show possibly in the works), and countless spin-off media including a popular line of graphic novels and comics.<br><br>\"Hellraiser\" is a staple in horror, which is what makes this latest film so infuriating and heart-wrenching.<br><br>\"Hellraiser: Revelations\" is the latest in the series (beginning with the fifth film, all releases have skipped theaters and been plagued with lower budgets and even lower-grade actors and crews). Directed by Victor Garcia (from a script he also co-wrote), this mess of a film is DOA, with lame-brained acting, penny-pinching special effects, and a horrid plot that is essentially a lazy re-imagining of the original film. This is a slap-in-the-face to fans of the series, who have stuck by it even as the later sequels got worse and worse following the surprisingly strong second film. (Which is one of the rare horror sequels that had any thought to it, and is arguably almost as good as the original, despite obvious differences in tone and scope.) Beginning with the third film, the series took a nose-dive, although one or two entries, notably the fifth film, were watchable and enjoyable. This one, however, is the worst of the bunch.<br><br>Two spoiled young men, Nico and Steven, vanished sometime ago during a wretched trip to Mexico where they partook in prostitutes and copious partying. After murdering a prostitute, and after being given the mysterious puzzle box by a vagrant, Nico solved it, summoning \"Pinhead\" (played by a new actor... more on that later), whom dragged him to hell. Steven brings Nico back from hell via sacrifices, and later shows up to a house where he and Nico's family are having dinner.<br><br>At the house, Emma, Steven's sister, finds the box, and eventually the families begin to experiences strange and bizarre things over the film's anemic 75-minute running time, before a series of lame-brained twists that I won't spoil ends the film in an abrupt and very anti-climactic climax.<br><br>First the acting. I haven't really seen any of the actors in this film before (which I'm guessing is due to the almost non-existent budget preventing us from getting any name-actors), so I don't have anything to compare them to. But the acting was uniformly foul. All emotions by all parties seem forced, and our two leads (Jay Gillespie and Nick Eversman) are about as believable in their performances as a sheep wearing a dollar-store werewolf mask trying to blend into a pack of wolves. They simply cannot act.<br><br>Technically, the film is a mess. Garcia's shot-choices are bland, boring, and scream \"inexperienced film-school student\", and the lighting is atrocious. I was shocked to learn the cinematographer was David Armstrong, whom proved himself to be a capable DP on numerous other films, including six of the seven \"Saw\" films. Here, all of the lighting and shots seem hastily thrown together, and you could tell Mr. Armstrong didn't have enough time or motivation to work with. I study film and video production at college, and I've seen student-films shot on standard-def camcorders that look better than this from a technical standpoint.<br><br>The effects are also lousy. The cenobites looks soul-lessly designed, and their costumes looks like cheap rental-store robes. Pinhead's new design doesn't work and has too much shadow-work around his needles and creases/cuts, making him look a bit goofier than the eerie paper-white look of past films. Gore effects are phoned-in, with cheap, obvious prosthetics. The few CG-type effects are hilariously cheap looking. The set-design is bland and uninspired as well. Especially in the Hell scenes, which haven't been updated since the original film. Hell's still just a mass of swinging chains and pillars, which worked in the original film due to some excellent shots by Barker and the fact we hadn't seen anything like it before, but looks silly and cheap nowadays.<br><br>And onto the biggest complaint most people have... and a very justifiable complaint it is. Doug Bradley, whom portrayed Pinhead in all eight previous films skipped out on this one. He wasn't pleased by the script or the next-to-nothing paycheck, so he bailed. Our new Pinhead is portrayed by Stephen Smith Collins, with voice-over work by Fred Tatasciore. And good-lord, is the performance(s) bad!<br><br>I already mentioned the new makeup for the character's head didn't work as well as in previous films. But I could forgive that if the performances for the role were good. They aren't. First of all, Collins, who does the on-screen acting just doesn't look the part. He looks more like a light-weight professional wrestler with his head-shape. And his body language doesn't have any of the poetry or art of Bradley. He performs the role as though he had no rehearsals or prep-time, and is timidly being told what to do by the director off-screen. He seems in over his head. And Tatasciore's voice-over work is laughable. Gone is the booming voice of past films, which was dripping with darkness and emotion. Now, Pinhead sounds kinda like Don LaFontaine (the man known for providing voice-over work as the narrator of just about every movie trailer before his untimely death) trying to whisper with a bad Eurpoeon accent while suffering a sore-throat. It's just... awful.<br><br>This film is undoubtedly a career-killer for most involved, and it may just kill the franchise. It's beyond awful, and I give it a 1 out of 10, not just for being a bad film, but for being a tarnish on the classic original's legacy. Avoid this, I saw it for free on Netflix, and I still feel like the studio owes me a refund!","user":"MaximumMadness","rank":[38,41]},{"title":"Prequel to the next suck","rating":1,"date":"8 November 2011","review":"This was terrible. I just spoke to Doug Bradley when he was at Crypticon who had been offered the script. He said it was the worst piece of crap that he'd ever read. So he passed.<br><br>His exact words were that when he had spoken to Weinstein Entertainment about it and how terrible it was. They said \"We don't give a crap at how terrible this movie will be. We need one more in the can to secure the franchise for the reboot\". <br><br>Needless to say, because if his ridicule of the whole idea, the reboot of Hellraiser was not offered to Doug Bradley, which is too bad. <br><br>It is also rumored that it will be PG13. This movie will fail even worse that this one did.<br><br>FYI, straight from Doug's mouth, Clive Barker is NOT in support of this remake anymore. This franchise is officially dead now.<br><br>Thumbs down.","user":"tsmundahl","rank":[67,79]}]