[{"title":"Full of dark energy","rating":9,"date":"19 February 2012","review":"This movie is really a very bizarre one, even in the context of bizarre / horror movies. It is no ordinary horror however - more or less it is unusually deep trip into the darkness. Forget \"positive heroes running from demons or killers\". This is way way darker and definitely not suitable for typical viewer.<br><br>The first story almost seems lame but the darkness increases from the this very point on. When it reaches \"Vision Stains\" you may be sure you are watching something so dark it may just come from Hell itself. Yet these stories are no gore flicks, they have their wicked souls, their own twisted logic. Some of them like the \"Vision Stains\" are really hard to watch.<br><br>I absolutely do love \"The Accident\". It is basically not a horror story, but more poem or \"experience\". It is very slow, gentle, almost tender story about the dying and the meaning of life and death. It is absolutely mesmerizing, brilliant example of storytelling mixed with great soundtrack and the editing. It is pure 10/10 and alone makes the whole movie worth watching. It does not fit here however - it is not dark, not twisted and in some ways almost zen-like positive. It is really beautiful.<br><br>I could not recommend this movie for everyone - the only really accessible story is \"The Accident\" which is the weakest in the terms of gore and the most powerful in the terms of philosophy. The other stories could be way too much disturbing for ordinary viewer - not because they are full of gore, but because of twisted and elaborated evil, abuse, loss, suffering and despair depicted here. It is very powerful and dark anthology, definitely no ordinary teenager slasher movie. No fun is here, no light at the end of the tunnel. You have to have right mood to watch this anthology or you will end up really depressed.","user":"the_wolf_imdb","rank":[35,43]},{"title":"Another Anthology that is better than most","rating":7,"date":"25 November 2013","review":"I admit that while I heard quite a few good things about this movie I held off on it because I typically do not like anthologies but this one was pretty good and original. I will speak on the ones that stood out to me.<br><br>The Mother of Toads was OK but nothing special. It involves a couple and a witch. I wont say much more but honestly I thought this movie would be a let down after they started with this. 6/10<br><br>I Love You was actually pretty interesting and had a nice story. You do feel for the guy if you have been in a similar position but it goes a little crazy in the end. 7/10<br><br>Wet Dreams Has Tom Savini directing so the effects are top notch and probably the best of any of the films. I did like the story and this was my second favorite on this film. Just a little side note, you will either love it or hate it so I understand the reviews not liking this one.8/10<br><br>The next three are decent except for sweets which I hated. Vision Stains and The Accident are good however and I have to admit that this anthology surprised me in a good way. Also The Accident is my favorite and the story is amazing. Not a lot of gore or creepiness but I found it to be a great short. <br><br>The Wrap Around story is probably the best wrap around story of any Anthology that comes to my memory. While the twist wasn't to surprising, it was still a great idea. Opens a lot of doors if the franchise gets revisited. Still though some of the stories are weak IMO and it is definitely not for everyone, even some horror fans will not like it. I give it a 7 outta 10.","user":"andrewbarry6336","rank":[4,4]},{"title":"Fantastic dream state horror movie :)","rating":9,"date":"4 April 2015","review":"For the first time I've commented on a movie on IMDb.. I woke during the night, restless. Decided to watch Theatre of the Bizarre. I couldn't have chose a more perfect movie to watch in the early hours half asleep.. The overall feel and atmosphere is just hypnotic. The tales are very stylish, well paced, shot, scripted and acted and all as good as each other in their own very different ways and the link scenario in the Theatre is just dreamy gorgeous! The soundtrack does a fantastic job, just floats along with the visuals nicely, never imposes it's self. Not overly gory, a lot of the violence is implied rather than seen! {Although I seem to remember a few scenes where 'implied' was put to bed in brutal fashion!). Anyways....<br><br>I loved this movie! More of the same please :)<br><br>I could see The Theatre of the Bizarre becoming a cult classic!","user":"gerry_f94","rank":[8,10]}]