[{"title":"Actions Speak Louder than Words","rating":9,"date":"14 December 2011","review":"I am truly shocked by the people criticizing this film for lack of substance. I've seen comments about how there is limited dialogue, and therefore no character development, and hardly any story. Did we watch the same film? I'm thinking we must not have.<br><br>Shame dives into the life of a man living with an addiction to sex. The first 10 minutes of this movie effectively introduces him, his addiction, his relationship with humanity (sister included), and barely uses any words to do so. You shouldn't need a lot of dialogue when emotions are conveyed with facial expressions, effective cinematography, and great editing. This film is loaded with all of that.<br><br>Obviously films are subjective, but I feel those who say they didn't get to \"know' the characters at all must always need everything spoon fed to them. I am not a sex addict, but still connected with both Fassbender and Mulligan. I found the development both subtle and extremely realistic. Does everything need to always have that Hollywood ending? Should everything get wrapped up nicely and leave you with a warm and fuzzy feeling when you walk out of the theater? I definitely don't think so. <br><br>Anybody who does need that probably shouldn't watch any Steve McQueen films. Anyone who can appreciate a raw, subtle, and beautifully made film should go watch Shame.","user":"coolnazgul","rank":[601,731]},{"title":"Addiction up close and personal","rating":10,"date":"15 January 2012","review":"Shame, the real feel bad movie of the year, is only McQueen's second feature film to date. His first film, Hunger, focused on a man who made his life very public when he went on a hunger strike during the 1981 Irish Hunger Strikes. In Shame, McQueen dissects the very personal and often shocking sexual addiction of Brandon Sullivan (Michael Fassbender). Brandon is a well off business man. He has an apartment in New York where he leads a seemingly good life, but hides a dark secret that is on the verge of destroying him. His sex addiction has gone out of control. To make this even more difficult, his sister drops in unexpected and crashes at his place (played by Carey Mulligan). Her lifestyle begins to interfere with his addiction, forcing him to take drastic measures.<br><br>Every waking moment is spent towards achieving one goal: orgasm. We see him smile, laugh, engage socially, but when he is alone he is focused, like a junkie going through the routine of drug addiction. Brandon's tools aren't lighters, spoons, and rubber ties. He uses prostitutes, Internet pornography, magazines, or his imagination. Even at work his mind wanders off, either at a passing coworker or something he has looked up on his computer. This is far from a private matter. His addiction is slipping into the open and he knows it. We assume he is aware of his problem. At the beginning of the film we see Brandon lying naked in bed, the sheet pulled over his private area. He lies motionless, only staring at the ceiling above, breathing in and out as if he knows that today is going to be a long day. We know he's not thinking about work. He has one thing and one thing only. Sex.<br><br>Most people associate sex with pleasure. I'm sure Brandon has at one time or another had a pleasurable experience during intercourse, but he is long past that stage. During a scene on the subway he spots a woman. She's an attractive woman. She's alone. Vulnerable. She eyes Brandon staring back at her. The two have chemistry. In silence they are mentally engaging each other. His stare never wavers, he just scans her up and down. Suddenly her face changes. She gets up, showing the audience her wedding band. We can feel her shame for flirting with Brandon. He gets up and stands behind her. He follows her out of the train only to lose her in the crowd. His disappointment isn't so much in relation to not getting to know her, but that he will have to continue his search for sex elsewhere.<br><br>Brandon is a tragic character. His only connection with people is linked with sex. How will this person help or interfere with me reaching my goal of orgasm? Brandon's limit's knows no bounds. Fassbender, who also appeared in McQueen's Hunger, gives a fascinating performance. It is fearless both in the sense that it is a physically challenging role and that he accomplishes the role with such honesty. He could have played it like some debonair businessman just looking to score. Fassbender knows that his character is truly disturbed. He knows that if people found out about his condition he would be ostracized. He also knows that he needs help and won't get it. All of these factors come into play and create an incredible performance. Much like Gosling pulled off in Drive, Fassbender uses his eyes and body language to express how he feels.<br><br>Pain is a word often associated with addiction. We see videos of addicts going through withdrawals in health class. They kick, scream, shake, vomit. Evidence of a sickness in the body. Fassbender's character also shows great pain and uneasiness. During times of sheer euphoria, at least for a normal person, Fassbender gives us pain and suffering. He can't help what he's doing but he needs it to stay normal.<br><br>Along with Fassbender is Mulligan, another one of today's rising stars. Her character is rebellious, dependent, and loving. She wants nothing more than to find someone to care for her and to spend time with her brother. Her brother is too involved with his addiction and her taste in men and willingness to fall in love with them brings her down even more. She plays a girl on the edge of a breakdown and really shines on screen. Like Fassbender, she gives her all for the role, exposing her true colors.<br><br>In just two films McQueen has established himself as a major player in the art house scene. Both films are festival favorites with critical praise, but the general public isn't ready for his heavy storytelling. With hope (and some financial backing) he will continue to make the films he wants to make and hopefully garner enough praise here in the states to win over more of the public. It's going to be hard if he keeps getting NC-17 ratings.","user":"moviemanMA","rank":[324,397]},{"title":"An expertly crafted and shocking film that will divide audiences","rating":8,"date":"24 September 2011","review":"Despite having never seen Steve McQueen's Hunger, the smouldering and sensational acclaim for Shame was simply unreal. Having heard terrific things about the film, I ventured out and snagged a last minute ticket to the premiere at the Toronto International Film Festival. Weeks later, I am still trying to decipher what may be one of the most shocking and raw films I have seen in quite some time.<br><br>The titular Shame in question is what Brandon (Michael Fassbender), a posh yuppie living in New York City, must live with every day. He is a sex addict, and his addiction knows no bounds. His estranged sister Sissy (Carey Mulligan) has also just dropped by his apartment for an extended stay, making things all the worse.<br><br>The plot may not sound like much, because there really is not all that much to it storywise. Shame is more of a portrait of a man struggling with his inner demons than it is anything else. There is a story at its very core, but the primary focus is always on Brandon, his addiction and what boundaries and limits it pushes him to. I had read about some of the more \"unconventional\" and decidedly non-mainstream sexual escapades (for lack of a better word) Brandon gets himself into, but I was still incredibly surprised and downright shocked by just how far McQueen goes with this character. He is brazen and uninhibited in what he shows on screen, bravely defying the conventions of what we typically can and cannot see in mainstream cinema. McQueen does not shy away from hard truths, and does not even try to mask the explicit nature of some of the sexual acts. Seeing how far Brandon will go to satisfy and suppress himself is simply harrowing, not unlike films like Trainspotting and Requiem for a Dream were with their characters' drug addictions. <br><br>While the film and its frank depiction of sexuality are sometimes difficult to watch, I found myself mesmerized by the choreography and cinematography at play throughout. McQueen frames the film with the audience in the position of a voyeur. Early on, we see Brandon's morning routine, featuring Fassbender roaming around his chic apartment totally naked. We see him at his most honest and his most vulnerable, a man who is unable to hide the truth about himself. Later, we watch him as he interacts with his office co-workers from behind huge glass windows, and from a table across from him at a restaurant while he is on a date. McQueen uses a lot of unbroken shots to help depict this slice of Brandon's life through tracking shots and an immense amount of long shots. They help set the very somber mood, and allow the audience to continue watching as if they were an actual character peering into the events that transpire for him. McQueen also expertly uses music to help dictate the action on screen, tearing away the dialogue or sounds of the scene. It makes for an awkward feeling, but one that evokes a response with every new scene.<br><br>But for all of the shock and audacity, McQueen still managed to make a deeply troubled film that leaves a lot unsaid, and even more unresolved. He does not give out simple answers for what causes Brandon's addiction, or even the reasoning behind the troubled and strained relationship between Brandon and Sissy. While leaving some things enigmatic and up to the viewers to decide (many have already voiced their concerns regarding incest, which seem a bit too outrageous for this kind of film) is incredibly intriguing and help further propel the voyeuristic means of viewing the film, it also makes for maddening thoughts afterwards. What exactly is McQueen trying to say? What is the point he is trying to make? It all feels like it builds towards nothing outside of an unsatisfying and deludingly ambiguous climax. As mentioned earlier, it feels like the story and just about everything else came second to the portrait he wanted to paint through Fassbender's canvas. I can appreciate the film as it is, but it makes it hard to love it the way I thought I would.<br><br>Fassbender is stunning as Brandon, magnetizing the audience from the beginning all the way to the end. He propels the film, using his reactions and emotions to define the character. He makes Brandon's struggle one that is very real, and almost horrific. He is unable to feel intimacy, and watching him struggle to fulfill his urges is fascinating and deeply disturbing all at once. Watching his face through candid closeups, you can see just how much raw power went into the role. But while it is a stellar and tortured performance that more than proves his weight as an up and coming actor, I never found him to be nearly as incredibly impressive as we know he can be. I still find myself at odds with how great it was, and how much greater it could have been. <br><br>While James Badge Dale is effective in his small role as Brandon's smarmy and sleazy boss David, it is Mulligan who truly compliments Fassbender. Her role does not ask a whole lot of her, but her pained expressions and infinite desire to be loved by everyone is more than enough to make this a memorable turn for her. While the full frontal nudity was near useless, I only wish that she could have done more.<br><br>Shame is a very well done film, but one that will divide audiences. On one hand, it is an expertly crafted film about addiction that packs a great lead performance. On the other hand, it is a maddening film that answers very little it asks and sometimes shocks just for the sake of it. It is an impressive feat for a second feature, but one that I think could have been even better.<br><br>8/10.","user":"DonFishies","rank":[385,480]}]