[{"title":"Manor Madness!","rating":7,"date":"6 June 2012","review":"Plan B is clearly not content with just being a famous rapper/singer/actor, as he has now tried his hand at directing, with his debut film ill Manors being released in cinemas today. Set in East London, the film follows a series of characters from drug dealers to prostitutes to runaway single mothers as they all struggle to survive in their poverty stricken area. As you can guess, this is not a happy-go- lucky sort of film, but nevertheless it's a very good film.<br><br>The style taken is very much similar to Pulp Fiction (believe it or not), as each character gets their own little tale, and soon enough they begin to over-lap with one another, creating a sense of community, we see that everybody really does know each other, whether for good or bad. There is also a rapping narrator (played by Plan B himself) which really adds another dimension to the film, it sets itself apart from the usual ''urban drama'' with these little techniques. It's a very brutal film that doesn't hold back either, from violent murders to a woman being pimped out for £10 at a kebab shop, we see it all within 121 mins.<br><br>Whilst it is an ''urban'' drama at the end of the day, the film does what Kidulthood/Adulthood/Shank could not do and has a go at actually trying to explore the reasons behind why people join gangs or decide to riddle their body with heroin. None of the central characters have parents, and the film suggests this lack of love creates the violence, it's essentially a film encouraging us to hug a hoodie. Outstanding performance goes to Riz Ahmed, who plays a gangster with some moral fibre trying to get out the area. The only negative is that the film tries to tell us too much, there's so many characters and stories happening that it's hard to keep track and some character get lost in the shuffle. But overall, recommended.<br><br>7/10","user":"malaysian1789","rank":[40,48]},{"title":"A searing ride (slight spoilers)","rating":9,"date":"12 January 2013","review":"The film is a rap musical about the lives of drug dealers and prostitutes on a London housing estate (i.e. social housing). It is the film debut of Ben Drew aka Plan B as a director and it is a tour de force. This film has one important message relayed over and over by images and lyrics: Look what happens to children when they are abandoned, neglected or abused by their parents and adults. It is such an important message and one that society pays lip service to without reflecting upon what it means. Even in an age well versed in psychology popular thinking undermines and denies the significance of events in very early childhood. Drew makes sure that his audience 'gets' this message. Not subtle but very gritty.<br><br>The plot involves a set of characters with intertwined fates. We are introduced to three drug dealers: Chris (Lee Allan) a solitary operator and one of the 'Mr Bigs' on the estate, or 'manor', and Aaron (Riz Ahmed) and Ed (Ed Skrein) childhood friends from the same children's home, who are minor players and petty criminals. We are introduced to two prostitutes also: Michelle (Anouska Mond) another solitary operator routinely abused by all on the estate and Katya (Natalie Press) a woman from east Europe who has escaped the human traffickers that brought her to the UK. We learn through lyrics and flashback images the childhoods these characters have survived and the events that lead to their present predicaments. The plot unfolds cleverly bringing all together in a confrontation that proves fatal for one of them.<br><br>Ben Drew intends that we understand what made the characters the people they are, perhaps even empathise with them, but not sympathise as such or feel sentimentality for them. This is one of the film's strengths. So Chris is presented as an antisocial person with no care or loyalty to anyone and Ed is a thug who mistreats Michelle just because he can. <br><br>The acting is excellent from the cast, including the many minor roles. The soundtrack is fantastic and I bought the CD as I loved the music so much. The film ends with the searing track Falling Down that knots the intestines but my favourite to listen to as a stand along song is Drug Dealer (the story of Chris's life). Drew has used some young rap artists/singers guests on some of the tracks.<br><br>The finale is shocking and sad in equal measures but the ending offers hope as three of the characters seem to have enough of an awakening to turn their lives around. Fittingly this occurs because of the plight of Katya's baby, underlining the film's focus upon young children and their need for adults to help them grow into healthy adults that can contribute to society in positive ways.<br><br>My only reservation regarding the film is that if Ben Drew decides to make another film I'm not sure he has anywhere to go in bettering his debut.","user":"PoppyTransfusion","rank":[9,9]},{"title":"Underrated?","rating":7,"date":"26 October 2012","review":"Ill Manors is a film that does far more than just push the boundaries previously set by British films such as Kidulthood, Adulthood and Harry Brown, of which Ben Drew played key roles in. It bends moral boundaries to a level rarely seen before in British cinema, even when the character does things for the 'greater good', the brutality of the streets re balances the already lop sided scales back into darkness, corruption and greed.<br><br>A fantastic blend of black and white re winds, flash backs and present time, in a style similar to that of Pulp Fiction where each characters story gets told and varied perspective on events is shown, on this poor and heartless council estate in London. Narration in the form of a truly brilliant soundtrack by Plan B, and although a surprisingly low amount is used, it makes it all the more effective. The film may seem too much to handle and over worked – this couldn't be any further from the truth. What also impressed me was the micro budget Plan B had to work with, and the way he managed to produce such a professional piece with it - he saves a large amount by recruiting local musicians and up and coming actors/actresses to play key roles, though they play them as naturally and effective as any world-renowned star. Throw in some fantastic performances from the young members of the cast, and Ben was on to a winning formula. <br><br>The gritty realism will undoubtedly be difficult for some people to even view, let alone understand or relate to. The films climax is one of the most unforgettable and unpredictable I have ever seen in recent years. The extent to which this film impressed and shocked me, in the standard in which is was created, the plot, characters, and actors involved, means Ill Manors easily waltzes into my top 3 of the year so far.","user":"cjscahill","rank":[29,35]}]