[{"title":"This isn't a bad movie but it's not brilliant","rating":6,"date":"23 February 2016","review":"Triple 9 is a dark and gloomy story, which feels strongly inspired by Michael Mann's Heat. Unlike Heat, the film/script doesn't give the characters enough substance to make us care for their outcome in the film. The ordeals of the characters came and went without me feeling any real emotions towards any of them.<br><br>This isn't a bad movie but it's not brilliant. There are a few of gun battle/action periods that are really well shot and entertaining enough to keep you interested in the film as a whole. It's not too predictable but there are not enough shocks or tense moments that you would expect from a thriller.","user":"sawaugh","rank":[93,113]},{"title":"Great performances don't make a great film","rating":6,"date":"26 February 2016","review":"A crew comprising bent cops and crooks are forced into carrying out a complex heist for Russian gangsters in order to get paid.<br><br>My synopsis is skeletal: it was either that, or go into great detail about a plot which is superficially complex by virtue of the number of different groups and subgroups involved, with crossover between them. This apparent complexity hides a relatively straightforward story which, itself, is cluttered up with texture and detail which obscures the main plot line (there is an extended sequence involving the graphic aftermath of a gangland slaying, the purpose of which is to illustrate relationships between certain of the characters and introduce a couple of minor characters who have important actions later, but this scene is given such detailed attention that one is misled into believing that it has greater plot relevance than is actually the case).<br><br>A good and powerful cast work hard to bring life to a thriller which, I think, has rather less to it than meets the eye. Kate Winslet impresses by looking and sounding nothing like Kate Winslet, and pretty nearly everyone in this gives a good performance.<br><br>But I was left puzzled at the end because I never felt the film had a sense of purpose to it – the events happened and each character suffered a particular fate and then it ended. Yes, I know you can say that about most films, but the stakes in this were so high that I was expecting a resolution to the film which meant more.","user":"neil-476","rank":[35,42]},{"title":"A lot of star power with no power","rating":5,"date":"21 April 2016","review":"I am at a split when it comes to 'Triple 9'. On one end, there were few moments where I did enjoy the film. The actors are powerhouses and did what they could with the material given to them. Some plot points were interesting to me and had my attention and lastly, I am sure there is a certain symbolism behind the constant use of the color red that is shown in a high majority of scenes. On the other end, however, there was way too much I did not enjoy. From start to finish, I hardly understood any of the characters connections to anyone. They are explained in as little detail as possible. It just was not my cup of tea as far as understanding who the characters were and what was their purpose. Kate Winslet was absolutely atrocious to me. From her seemingly forced role to her forgetful \"Russian accent\" as she seemed to forget she was Russian at times speaking perfect English and bouncing back to an \"accent\". The fan- favorite star power of Norman Reedus, Aaron Paul, Chiwetel Ejiofor and company was no where near enough to save this movie and draw enough of a crowd to make this movie even mistakenly good. Too many negatives and not enough positives. This movie is forgetful to me and nothing special. A few moments do not make up for a near two hours of confusion and plot holes.","user":"Oberrated","rank":[82,106]}]