[{"title":"Surprisingly good","rating":8,"date":"17 June 2015","review":"I was in two minds as to whether I'd even bother with another Pacino film. He's been involved in a quite a few mediocre movies recently and I'd made a mental note to try and avoid them. However, I found plot summary of this movie quite intriguing and thought I'd give it a go. Incredibly this is one of his best films and I really enjoyed it from the start to the credits. Danny Collins has lived a hedonistic, excessive lifestyle for decades, but a surprising event causes him to look at his life and he makes substantial efforts to change and even to mend relationships. His quest may not be easy or faultless but it is still very satisfying. I cannot recommend this highly enough.","user":"alfredsmith","rank":[65,75]},{"title":"A Beautiful Film! Pacino Shines!","rating":9,"date":"22 June 2015","review":"Inspired by the true story of folk singer Steve Tilston, 'Danny Collins' is A Beautiful Film, that offers great emotional depth! And Al Pacino shines in the title role, proving once again that he's among the greatest we've ever had!<br><br>'Danny Collins' Synopsis: An aging rock star decides to change his life when he discovers a 40-year-old letter written to him by John Lennon.<br><br>'Danny Collins' is at heart, a sensitive father &amp; son story, that's emotionally charged. I was moved &amp; overwhelmed by Danny Collins's journey, not only with his son, but also with his friends, his profession &amp; himself. Its a fascinating character, that's been bought to life, with dexterity. <br><br>Dan Fogelman's Screenplay is top-class. Its emotional &amp; also humorous. Fogelman's Direction, on the other-hand, is simple, yet effective. Cinematography is good. Editing is consistently crisp. Costume Design is fine. Music by Ryan Adams &amp; Theodore Shapiro is wonderful.<br><br>Performance-Wise: Pacino is extraordinary as Danny Collins. He sinks his teeth into the part &amp; brings it out with flying colors. Annette Bening is sweet. Bobby Cannavale is in fine form, as well. Jennifer Garner is subdued, while The Great Christopher Plummer is impeccable in his brief bit.<br><br>On the whole, 'Danny Collins' is a winner all the way! Among the best films from 2015 yet!","user":"namashi_1","rank":[46,59]},{"title":"If it's your only outing to the theater this year, you've lucked out","rating":8,"date":"4 April 2015","review":"\"Danny Collins\" is the kind of film ripe for emotional manipulation and mawkishness, so much so that its potential to squander its wealth of talent makes one clench in their seat, hoping for a different result than the one they foresee. While there is definitely sentimentality to be found in the film, such scenes are handled with pleasant restraint from writer/director Dan Fogelman (writer of \"Tangled\" and both \"Cars\" films). \"Danny Collins\" is likely one of the few commendable adult dramas we will get this year, and it's nice to see that it's a particularly winning blend of restriction and talent.<br><br>The film concerns the title character (played by Al Pacino in his best, most subtle role in years), an aging, alcoholic, cocaine-addicted singer, disillusioned with his current state of faking it through sold out performances, playing the same old tired songs (his most famous song echoes the tune of \"Sweet Caroline\") he has since he began his career in the 1970's. One day, he decides to drop everything, cancelling the remainder of his tour in order to venture out to stay indefinitely at a Hilton hotel and work on his songwriting, something he hasn't done in several decades, much to the dismay of his long suffering manager Frank Grubman (Christopher Plummer). While staying at the Hilton, Danny tries to make right with his son Tom (Bobby Cannavale), who has gone on to marry a beautiful woman (Jennifer Garner) and lead a solid life without the help of his father, whom views him as a deadbeat, as well as win the heart of the stubborn hotel manager Mary Sinclair (Annette Bening), who shoots down every dinner request he makes.<br><br>All of this angst and disillusionment arises when Danny receives a long-lost letter from John Lennon, following an interview at a magazine where Danny references Lennon as a major influence. In the letter, Lennon tells him to be true to himself and states that the money and fame don't corrupt a person, but personal choices and vices will always be the downfall of a man. With this, Danny becomes rather tumultuous and realizes he's been stuck in a dead-end, creative funk for years, unable to produce a winning record or anything of noteworthiness for years. He uses this opportunity to take a vacation and hopefully find creative inspiration and connectivity amongst those he should've been in contact with for many years.<br><br>Pacino is always the centerpiece of \"Danny Collins,\" in nearly every shot of the film and always bearing some kind of discernible energy, whether it be boisterous or subtle. This is Pacino's most accomplished role in years, as he finds ways to create his own character and infuse him with just the right amount of life for the occasion. He is never overcome with theatrics, and plays everything in a genuine, low-key manner, something we haven't seen from Pacino in quite some time. His portrait of an aging alcoholic musician who realizes he hasn't done anything creative or for himself in years (perhaps there's some loose, real-life connection there, but that's all speculation, of course) isn't played in a manner where overacting prevails emotion and that's the key to a great deal of \"Danny Collins\"' success.<br><br>The supporting characters in \"Danny Collins\" all transcend the lines of typical supporting characters, as they branch out to become their own character and are brought to life thanks to a collection of great talent. Among the best of the lot is Christopher Plummer, who serves as Danny's best friend in the film as well as his financial and managerial guide. Plummer is just as wry here as he's ever been, never missing a comedic or dramatic beat, and turns up just in time to save the film from becoming too sappy or too dramatic. Bobby Cannavale also does arguably some of his finest work as Danny's understandably livid son, who has been left in the dark and in the working class region of the world while his father adores all the fame of show business, so he thinks, and leaves all other responsibilities unattended. Cannavale, like Pacino, acts within his own restraints of showing anger but not being overly dramatic about the entire affair, never breaking out in a fight with his father nor letting loose a monologue of vulgarities. Almost every conversation held between them conducts itself with a pleasant sense of situational realism.<br><br>\"Danny Collins\" is a surprising little film, and given how its small theatrical release is being expanded little by little, I have a feeling it will resonate with the baby boomer crowd as time goes on, giving them a little opportunity for cinematic enrichment as they're often forgotten. If that's the case, this is fine film to see, especially if you're only planning on seeing one, maybe two, films this year.","user":"StevePulaski","rank":[56,75]}]