[{"title":"Van Peebles' Heart is in the Right Place...","rating":8,"date":"16 April 2012","review":"There is something hidden underneath the surface of \"We The Party\" that I cannot decipher.<br><br>Take five teens and put them into a box of conformity and wanting. You're not the coolest, nor the most popular, but you want to be the first to win at everything. It's human nature. \"We The Party\" suffers a bit when challenging the audience to feel like they know these characters, when honestly, it doesn't come across as so with a story we've seen and heard plenty of times before.<br><br>The character development, for what it's worth, wasn't that bad for the primary cast. I felt as though Mandela Van Peebles (son of Mario Van Peebles, the film's writer-director) was a risky choice for the lead role, but he pulled it off. Mario's other son, Makaylo, who plays Obama, also has a bit of screen time as well, with slight emotional depth to his character. The character Chowder is relatable to most people, and surprisingly, Patrick Cage II conquered the role stupendously.<br><br>I felt like the other characters could have been worked on more in terms of making it about an outsider clique instead of just about Hendrix himself. It's not until the final forty minutes when I see the future potential in Mandela, who delivers a strikingly good performance alongside rapper Y.G., who manages to steal every scene he's in. In terms of casting, it was good, to say the least.<br><br>Here is my take on \"We The Party\". It had a good story going. It is an R-rated film hosting a young, predominant, African-American cast. A bit of \"Romeo and Juliet\", with fractions of \"The Breakfast Club\" and whatever other teen film which involves heavy, seductive partying and betrayal. I think \"Party\"'s downfall is that it didn't have a specific moral or subject to cling onto. Yes, we want success. Earning it is harder. But when clouded with a clichéd storyline about not fitting in, trying to get the girl, and going from zero to hero, it becomes stale. The uniqueness of \"We The Party\" is the authenticity of the actors. There wasn't a time when someone or something felt forced -- but when the story is the same, almost, it becomes unoriginal.<br><br>\"We The Party\" is definitely on my favorite list of films. I think with the proper marketing and tweaking of the story, this film could've been financially and critically successful. Mr. Van Peebles heart is in the right place, but when you start on something real, you have to be willing to lay all the cards down. The R-rating didn't sugarcoat the language, but in the real world, there's more to divulge into in the adolescent world filled with drugs, sex and violence.<br><br>I recommend this movie to anyone who enjoys a good independent film with a few laughs and character's struggle with identity. However, if you're looking for the next \"Thirteen\" or \"Project X\", this is not the film for you.","user":"jaredstevenallen","rank":[14,23]},{"title":"a 30 minute story","rating":1,"date":"2 December 2012","review":"who was this movie made for??? anyone beyond the tween and teen group will drop out of their chair trying to watch this movie. i think i hit the floor three or four times (just kidding).<br><br>there are endless scenes of monotonous 'teen' interaction and needless stagnant obsessive viewing of 'young flesh' in various stages of dress. if you are willing to punish yourself watching these sophomoric scenes of behavior you will get to the message this film so wants to tell.<br><br>unfortunately this takes almost two hours! it might have been more powerful if the director &amp; editor has whittled the footage down to at least one hour. but as it is i found myself getting very agitated watching these teens act out a life that obviously had no meaning to them outside of the script.","user":"cekadah","rank":[4,5]},{"title":"Don't Waste Your Time","rating":1,"date":"11 July 2014","review":"horrible... just horrible. I regret even bothering to watch this movie honestly. unrealistic and trying too hard. like ten different plots. There was a serious lack of character development. cringe-worthy acting. annoying music. dumb ending. and the profanity was just there to be there. It wasn't fluid at all. I honestly felt like it was an insulting and disgusting portrayal of my generation (going to 11th grade in the fall). I just couldn't take it seriously. I advise any and everyone to not waste your time and brain cells.... like this movie just didn't make any sense?? shameful of BET to put this on the air, their quality is reducing every single day.. I really wanted to like it and give it a chance, but after the first 5 minutes I was lost and uninterested.. completely turned off.","user":"totallyepic24","rank":[3,4]}]