[{"title":"Diana","rating":5,"date":"4 March 2020","review":"Diana, not making a peep upon its release nor since, is one of those movies that simply exists where neither its content nor the way it was put together, where the techniques used to convey a well-known story, brought about no great insight, revelation or even valid emotional impact that only served to re-enforce the fact there was no reason for it to exist. It seems no matter how much director Oliver Hirschbiegel thought he might bring an interesting point of view to this film his attempts end up being completely ineffective in the fact that a majority of the people interested in the figure of Diana, Princess of Whales likely knew everything this movie would be bringing to the table (or had already read it in Kate Snell's book on which the screenplay was based) and thus found no reason to watch famous people play dress-up and re-hash the events of their beloved Diana while no doubt dramatizing it as much as possible. There was no need for a film though not because we all know how it turns out, but because Diana was such a figure that the public felt like they knew so well, personally even, that it is almost a betrayal to them to see this actress portray a part of the peoples princess they might not have seen before. This is no fault of the writers, filmmakers or actors and obviously is an element they have no control over, but while it may have felt like a valiant effort, a story worth bringing to a feature film the end result is something that points to every reason why it wasn't a good idea. All of that being said, there is indeed an effort put forth here and despite the bad press it received before it was given a chance there is a Naomi Watts performance here that while she no doubt had much higher hopes for it should be recognized as what it is: convincing on what were impossible levels. The same stigma that applied to the movie applies to the person picked to play Diana and the performance they ultimately gave. What Watts is able to do is somehow transcend the barrage of images we've all seen and do what the movie as a whole wasn't able to do and that is make us believe in this material. No, I didn't necessarily enjoy the film or find much of it interesting, but it has its moments and it had enough to show there is a solid biography to be made about Diana, but this just isn't it.","user":"MR_Heraclius","rank":[42,45]},{"title":"Why one should ignore the media...","rating":9,"date":"22 September 2013","review":"Entering the cinema auditorium with a pre-conceived pessimistic judgment on the film yet determined to watch it anyways, I can only say that I am glad that I had not allowed for media and critic opinion to dissuade me from watching \"Diana.\" The film does not portray Diana in a bad way at all. If anything, it reiterates the absolute disgusting habits our press have had in terms of absolute disregard and disrespect for people's privacy. You feel a certain connection with Diana throughout the film, and see her for the \"normal person\" she was deep down. Naomi Watts' performance was spectacular, and she certainly did Diana justice. Although the film is most certainly disliked by many - i.e: the media, Islamophobes and daily mail readers... It is disliked for the mere fact that the film provides an insight into things that make certain people very uncomfortable, such as the prospect of the Princess of Wales marrying to a Pakistani Muslim, and the fact that Diana was actually a human being, with feelings, and with a difficult life. <br><br>So all I can say is, ignore the media, and make judgements for yourself. Perhaps after watching the film, you would rate it as highly as I have, or perhaps you may walk out half way through... Regardless, it's a fantastic film with a beautiful portrayal of the 'People's Princess'... Be warned: Take some Kleenex with you...The ending... is rather emotional","user":"sabz-984-446344","rank":[114,156]},{"title":"Took me by surprise - decent film!","rating":8,"date":"25 September 2013","review":"This film took me by surprise due to all the negativity surrounding it. It actually turned out to be a decent film that I enjoyed. I've always loved Naomi Watts and she pulls of a great performance. So she doesn't look exactly like Diana - what actress does? Diana was very unique looking and Naomi is definitely the right person for the role.<br><br>Naveeen Andrews also pulled a strong performance and the film had good pacing and never got dull. The film was respectable to Diana and I liked how they ended the film.<br><br>Please do not judge the film before seeing it. The British press were never going to praise this film. Well done Naomi.. you should be proud of this film.","user":"alwynhuk","rank":[94,128]}]