[{"title":"Get rid of these ridiculous English/foreign accents","rating":5,"date":"6 July 2017","review":"A film with promising actors and based upon an incredible true story, however didn't fill up to its high expectations, sadly. <br><br>Something that always troubles me, is feeling the need to speak English with an accent to show that they're actually speaking another language. It's in fact ridiculous, knowing that Johan Heldenbergh is pure Belgian (and actually speaks English with a Flemish/Ghent accent) and Jessica Chastain is pure American (her English/polish accent is just ridiculous). Either you just speak plain English or you make the movie with Polish actors. Besides that, Johan Heldenbergh, the zookeeper, (world-renown in Belgium but his first introduction in a bigger US production), was impeccable &amp; perfectly casted.<br><br>The film didn't blow me away and was predictable from beginning till the end. Fairly enjoyable for a regular weeknight if you have nothing to do, but will most certainly be forgotten the next day - not anywhere near classic holocaust movies like Schindler's list or The Pianist. Too bad, cause everything was there (especially book &amp; script) to make a much stronger impact.","user":"ph-swinnen","rank":[67,111]},{"title":"Nazi's are bad, k?","rating":2,"date":"22 September 2017","review":"So what we have here is another Nazi's are bad film. Indeed a dozen or more of these types of films are made a year. There has not been any Nazi's since the 40's, we have much more serious current issues at play right now but Nazi's are still the most terrifying threat to humanity. <br><br>The problem with these films and in some cases documentaries is that it has become self parody. Just like a Doco I saw on Hitler and how he apparently suffered from flatulence. <br><br>So now we have German soldiers killing zoo animals. Why would professional soldiers, headed by a vegetarian, animal loving Fuhrer want this to happen? The Nazi's were also the first to outlaw vivisection but in this film they are all for it. <br><br>Some other stuff happens too, we see a virtual remake of Schindler's list, the usual hiding Jewish people thing. <br><br>But most of all we see a Politically Correct Hollywood make another boring film about Nazi's.","user":"Sleeper-Cell","rank":[243,456]},{"title":"Keeping it PG-13 makes it more powerful emotionally than seeing everything","rating":8,"date":"20 December 2017","review":"I enjoyed The Zookeeper's Wife and would recommend it to most audiences. Skillful direction by Niki Caro, excellent sets and costumes, a slightly washed-out look to the cinematography which nonetheless has a full range of color, and a capable cast. The story is based on the actions of the owners of the Warsaw Zoo, who saved the lives of more than three hundred Jews during the Nazi occupation of Poland.<br><br>Nonetheless, the performance of Jessica Chastain is the single most important factor in the film. Unlike many American actors, she understands that a Polish woman of the 1940s does not look, move, or carry her features like a contemporary American. So fully does Miss Chastain inhabit her character that I never had the sense of an actress making choices.<br><br>The film is a bit long and a bit slow, like most films today, but not to a damaging extent. I particularly admired the way that the official from the Berlin Zoo who becomes a Nazi officer, well played by Daniel Bruhl, has certain scruples and personal moral standards although he embraces the Nazi philosophy. He's a villain, but not a cardboard villain, and part of the suspense of the film is waiting to see which lines he will cross and which he won't.","user":"AlsExGal","rank":[21,33]}]