[{"title":"A movie less about zombies and more about a man's journey...","rating":8,"date":"28 May 2012","review":"Someone mentioned in a previous review that there are over 700 zombie films out there. Well, this is one of the better ones.<br><br>To be honest the zombies are just a background element to the story. The real story is in the relationship of the characters and their interaction.<br><br>The special effects may not be top notch (I believe they only had a $300k budget), but the acting in superb. At no point was I taken out of the story by a poorly delivered line or unbelievably stupid plot device or action on the part of the characters. And, as low key as it was, even the setting was believable. I'm sure only a true Civil War enthusiast would find any fault.<br><br>Truly an entertaining film. A real rose amongst the thorns.","user":"aslan-937-283764","rank":[51,60]},{"title":"What a great surprise this was...","rating":7,"date":"31 May 2012","review":"\"Exit Humanity\" is one of the best zombie movies in its genre; that being a zombie movie set in a Western setting, more specifically during and in the aftermath of the American Civil War. Far better than \"Undead or Alive\", \"Abraham Lincoln vs Zombies\" and \"Cowboys vs Zombies\", \"Exit Humanity\" is a definite must if you are planning to watch a zombie/western movie.<br><br>I sat down to watch \"Exit Humanity\" with no particular expectations as I had honestly never heard about the movie prior to finding it by sheer luck. And being a fan of all things zombie, I was intrigued and just had to watch it. And now that I have, I must admit that I am more than pleasantly surprised.<br><br>The story in the movie is about an outbreak of undead starting in 1865 as the Civil War is at its last chapter. Flash forward six years, we find Edward Young in a small farm house, where his wife is dead and his son is missing in a country ravaged by hordes of the walking dead. Edward sets out to find his son, embarking on a task in a world that is dying.<br><br>I found the story to be rather good actually, and it managed to keep me interested all the way up to the very end. There weren't any particular surprise story twists or turn of events, and the movie went on straight ahead at a good pace. And that worked out nicely enough.<br><br>The people cast for \"Exit Humanity\" were doing great jobs, and if you are a movie fan, you will see a couple of familiar faces. I am not familiar with Mark Gibson (playing Edward Young), but he did a good job with his role. And I was more than surprised (and thrilled) to find Bill Mosely (playing General Williams)in the movie, as I've always enjoyed his movies. Then you also have Dee Wallace (playing Eve), Stephen McHattie (playing Medic Johnson) and Brian Cox (the Narrator). So there were some familiar faces and voices around.<br><br>As for the zombies in the movie, well most of them were really nice. Lots of good make-up and details. And there were also plenty of gore and wounds to go around to keep most of the gorehounds out there more than satisfied. And thumbs up on not having super agile zombies that run and jump around, I am most definitely not a fan of those type of zombies. Two things to point out about the zombies; I didn't get the black shark-like eyes, what was up with that? Wouldn't eyes glaze over and become milky-grayish after death occurs? And the tone of gray they used on the faces (but sometimes forgot to put on the zombies hands and necks) was a bit too gray, standing out in contrast. That sort of reminded me of the old 70's zombies movies. But aside from those two minor things, then the zombies were good, nicely put together and worked out well.<br><br>Being a big zombie fan, then I found \"Exit Humanity\" to be rather good. I was thoroughly entertained by this movie.","user":"paul_haakonsen","rank":[31,41]},{"title":"Well done zombie drama...The horror is in the story, not the action","rating":7,"date":"14 September 2012","review":"A unique and well done dramatic zombie period piece. The rustic technology free setting creates nice isolation which helps increase the tension. I love zombies, and these zombies are the best I've seen in a long time. Not just the makeup, which was great, but the acting and serious tone of the movie, help it excel. The music was wonderful, while the acting and narration was well done. The animation added an art-house feel, yet not overused. Not a typical horror film, but a serious drama about humanity. Definitely going to keep an eye on this director. I wish there was more of a scare element. I give it 7 out of 10 stars.","user":"bassplace88","rank":[15,19]}]