[{"title":"Can't believe the rating and reviews","rating":8,"date":"24 April 2014","review":"Okay, it's not exactly 'Lord of the Rings' but it's not as bad as the reviewers here say it is. People complaining about lack of depth and change in characters, most of them are deities so what do you expect. I thought the visuals, costumes, make-up etc were also excellent. It may appear as a kid's movie for some but thats a good thing, it can be enjoyed by all ages. I couldn't believe the guy that played Monkey King is the same guy who played IP MAN, wasn't an easy job but he pulled it off and other actors were also great. I'm actually looking forward to the sequel if it is in the making I would recommend it to anyone, don't believe the reviews they're just talking rubbish.","user":"xxXStarWarriorXxx","rank":[27,34]},{"title":"A faithful adaptation of the beginning of Journey to the West","rating":8,"date":"27 February 2014","review":"I just saw this film with my mother, a 65-year old Chinese woman (who has trained under some masters of kung fu), who grew up reading the stories of the Monkey King (whereas I'm more familiar with the Japanese Series, 'Monkey Magic'). My mother was delighted at how faithful this film was, with so many of the characters and substories being very close to how she remembers them.<br><br>Unlike other reviewers, we found the CGI to be quite good (a couple of bad spots, but in other places, stunning!) We thought the acting and direction was also really good. Donnie Yen is such a wonderful and naughty monkey. His movement is fantastic, whether he was fighting or being a lazy monkey. Chow Yun Fat a benevolent Jade Emperor, and Aaron Kwok a coolly evil demon king.<br><br>The film is also incredibly fun. This isn't going to win any Oscars, but if you're out to have fun, it's a better adaptation of the beginning of Journey to the West than most.","user":"sugarmack","rank":[41,55]},{"title":"Great Adaptation!","rating":10,"date":"10 May 2014","review":"Before starting my review, I would like to state that I grew up on old Hong Kong series. I have experienced many versions of Journey to the West, including the 1986 version(the one I enjoyed most).<br><br>I have seen many bad reviews on this movie due to it's over-the-top cgi, bad translations, and poor plot. With the exception of bad translation, I have to disagree with the other two points.<br><br>The CGI is a bit over exaggerated, but the viewer has to accept the movie's setting before they can actually enjoy the ride. It is not your every day thriller, but more of a mythology. Although there are a few scenes with 1-2 seconds flash of unpolished CGI, the CGI overall is not bad at all. Tying back to my experiences with Hong Kong series, most of them had aerial flights, small styrofoam explosions, and clunky lasers, but it did not deter me from how the series were overall great. As a recap, don't look at the CGI as a turn off, but enjoy it as an enhancement to your epic ride.<br><br>The plot was a well condensed version of Journey to the West series. These series were often countless episodes, which is fine because they cater to a certain type of audience. However, The Monkey King(2014) is adapted and made for younger and foreign audiences. The film gives you the typical plot with the struggle of good and evil and eventually the good winning the fight.<br><br>Yes, like other epics, the movie shows the up-and-coming of the hero(sun wu kong) that eventually triumphs evil, but the film has many underlying Chinese philosophies that can be realized with a little bit knowledge about Bhuddism, the dominant religion in Asia (where the movie was made). The end fight when Sun Wu Kong was hit on the head with his own weapon was literally a slap on the head for him to look back at his actions. That split of a second, which could be an indefinite amount of time for a deity, Chang'e taught him (with very bad translations) the costs of immortality.<br><br>Enough of the philosophy talk and lets move on into the fun winks to the audience that have had the opportunity to watch the Journey to the West series. From the 72 tricks and 3 knocks on the head Sun Wu Kong received from his master to the released of the horses in heaven, there are many scenes where the movie stay true to the original series. Off course the film had to have it's own taste on the story, but it never deviates too far from the original. Events may be out of placed, but they were in the movies at specific time slots that would make sense to the new twist on a classic story.<br><br>My tip before watching the movie is to just be open minded about the culture and have a fun time.","user":"thesimpsonatsixam","rank":[17,21]}]