[{"title":"Sketchy, but very good","rating":7,"date":"2 October 2013","review":"This is based upon a true story.<br><br>Ward Allen (Jim Caviezel) gives up the privileged life on a plantation in Savannah, GA to live free on the river so he can hunt ducks.<br><br>We start off in 1954 where Christmas Moultrie (Chiwetel Ejiofor) - the last of the free slaves from the Moultrie plantation - tells of his relationship with Ward Allen decades before. Then we go to 1918 and see Ward Allen.<br><br>We have an all-star cast with Hal Holbrook as Judge Harden; Sam Shepard as Mr. Stubbs who is the father of Lucy (Jaimie Alexander), who eventually marries Ward Allen; and Bradley Whitford as Jack Cay, a lawyer, who is the listener - and eventual writer of this story - to Christmas and his stories of Ward Allen.<br><br>I suppose we are all wondering what there was about Ward Allen to have a movie made of his life so-to -speak and further why would he give up a life of privilege to roam the woods and the river just to hunt and shoot ducks? We must listen and believe, as true, the stories Christmas tells about his friend. And, you must come to know that this friendship was pure gold. <br><br>However, this is quite sketchy. We have 3-stories and any one of which could have carried this movie, but it was decided to provide a little something of all three. It is difficult to incorporate everything especially when all three stories have a lot to say. We see Ward's relationship with his wife and this almost turned into a love story, but later that was abandoned; then we see his battles with new government rules and regulations regarding his disregarding them that got him to the courts many times (he didn't believe in quotas for the number of ducks killed or the shooting of a certain type of \"protected\" duck); then we have the relationship with Christmas and this is where the story should have been centered. It is with this angle that a great legend could have materialized. But, we get only bits and pieces here. Bummer. <br><br>It was decided to tell all three stories, sketchy as they might be, because..well, Ward Allen was \"a hell of a man's man\" and we do get this perspective from the movie. Maybe that was the point of all this. <br><br>The acting all around is very good. The best and lighter moments in the movie involve Ward Allen in court with Judge Harden who has a propensity to overlook Allen's transgressions as we can clearly see that Judge Harden is most impressed with Ward Allen, who by the way was Oxford educated and spouted Shakespeare often. Throughout there are good lines that provide some chuckles. <br><br>The cinematography is outstanding regarding the Savannah River background. The ending is somewhat confusing because the movie cannot tell us what really happened to Ward Allen or his wife after his wife was sent to a rest home. <br><br>But, to answer the question why abandon the good life for a life of hunting ducks on the Savannah River in Ward Allen's words: The river belongs to us and we to it. It was the only place he felt really free and that was most important to him. (7/10)<br><br>Violence: No. Sex: Not really, we see more of a make-out session with his wife. Nudity: No. Language: No.","user":"bob-rutzel-1","rank":[15,16]},{"title":"A colorful character and great friendship from the Old South","rating":8,"date":"12 September 2014","review":"\"Savannah\" is an entertaining film of fiction that is based partly on a book about a somewhat legendary character from the turn of the 20th century in Savannah, GA, and his lifelong friendship with a freed Black slave. Other reviewers have noted the problems with the shaky plot and script. But this film is very entertaining and a fun watch fit for the whole family. <br><br>Two things that stand out in this film are worthy of praise. First is the scenery and cinematography along the marshes and backwaters of the Savannah River. Second is the acting. The entire cast gave top performances; but like other reviewers, I especially enjoyed Jim Caviezel's portrayal of the lead character, Ward Allen. If the real educated and sophisticated yet down-home Ward Allen was half as vibrant, witty and disarming as the character played by Caviezel, he was a most colorful character indeed.","user":"SimonJack","rank":[7,7]},{"title":"Great scenery, fantastic camera work and a family friendly script!","rating":9,"date":"25 August 2013","review":"Savannah does attempt to tell the story of the friendship of two men, one returning from overseas to choose a life close to nature and his friend from childhood a freed slave and how a changing climate, culture, and society can make certain types of people and professions obsolete through no fault of their own.<br><br>It has an impressive cast with Jim Caviezel as Ward Allen and Chiwetel Ejiofor as Christmas Moultrie, together with Sam Shepard, Hal Holbrook and Jack McBrayer playing less important roles. In the center of all action is the duo of Ward Allen and Christmas Moultrie played by Jim Caviezel and Chiwetel Ejiofor. This important friendship should had have more room, more dialog. The relationship of Ward Allen with Lucy Stubbs played by Jaimie Alexander is more of a fictional drop-in and distracted from the rest of the storyline which could have disclosed more of Ward's intellectual background, the relationship with his father and his overseas upbringing.<br><br>Overall, great scenery, fantastic camera work and for those who know the book a very well written family friendly script in the European style of storytelling. Not Hollywood cinema, nothing flashy or fast paced. Enjoy the LowCountry landscape and a great sound track.","user":"fdo-316-23697","rank":[17,21]}]