[{"title":"Below Average","rating":3,"date":"17 January 2016","review":"This could have been a promising movie with a little more effort from the actors and crew members. <br><br>The script was a bit loose, there were some dynamic parts of the stories but they were not interconnected so it felt kind of hollow. Plus there was no story build ups, things just happened out of nowhere.<br><br>Acting was average, none of the actors or actresses stand out of the crowd. <br><br>The biggest let down of the movie was the climax part. It was an action sequence which was full of unnecessary pauses which made the action scene lamer than it was.<br><br>All in all in my opinion this is a movie that you can skip.","user":"niaz_islam","rank":[6,9]},{"title":"I'M NOT A GOOD MAN","rating":4,"date":"9 September 2018","review":"Contains what some may consider \"Plot Spoilers.\"<br><br>With a title like \"Born Wild\" I was expecting something more than a Lifetime style drama. CJ (William Shockley who also wrote script) gets out of prison for what seems like killing a fellow biker. He meets fellow biker Billy of the Underground biker gang.. CJ tell him that if he ever sees him again, he will have to kill him. Now normally you would think they did this for a reason, i.e. you are going to see him again in some great action scene involving biker shootouts and gang fights. My bad. This is a drama. It was done to show us what a nice guy CJ has become while he proclaims \"I'm not a good man.\"<br><br>CJ returns to his Texas home town of Banshee and visits dad (Barry Corbin) and an old girlfriend (Tanya Clarke) whose bar is in trouble and may go under. Her ex-husband (Kix Brooks) is the banker who holds the note, and he wants the deed. I was bored to tears until an hour and twenty minutes into the film when they decided to mop up this mess with everyone getting shot with bad guys only able to hit people in the arm.<br><br>A biker ex-con film that is a drama. The film has lengthy discussions about regret and time lost, which I found over dramatic and boring. If that is your cup of tea, go for it.<br><br>Guide: F-bomb, sex and nudity.","user":"nogodnomasters","rank":[1,1]},{"title":"Dull, dull, dull","rating":2,"date":"24 January 2020","review":"Well over half the movie goes by without anything interesting, let alone \"wild,\" happens. What's left is boring melodrama.","user":"dana-kellish","rank":[0,0]}]