[{"title":"Poor, hard to follow.","rating":2,"date":"30 December 2012","review":"I am a big fan of the genre, however this was a terrible effort. A sequel to a narrowly passable film. Full of poor acting, plot holes and is hard to watch physically and mentally. Shot in night vision for some part (very poorly shot) made the first half and the ending part hard to watch. A group of poor acted thugs, depicting disturbing scenes of rape and murder, this is zombie horror, somehow it begins to border on being a disturbing snuff film. Also the original idea is the hand-held camera is on too keep track of the post apocalyptic world, when under heavy zombie attack, murderous gangs and other peril i doubt there would be a semi steady handed guy filming.","user":"rawrkee","rank":[12,13]},{"title":"Spoiled by dogsh*t acting and a £50 budget","rating":2,"date":"16 November 2012","review":"Yeah, its been made with sincere enough intentions but it's b0llocks. Everyone over-acting like their lives were at stake. It's all a bit embarrassing. The characterisation is non-existent - you just don't give a sh*t about anyone and this is a big mistake in a zombie flick. Some of the set ups had potential but it's all just too amateurish.<br><br>IMDb wants me to add more lines but I don't really have anything else to add.<br><br>Apparently I still haven't added enough lines - hence this line.<br><br>And this one.<br><br>Ditto.","user":"neil-upto11","rank":[12,13]},{"title":"ruined by editing/ cinematography","rating":4,"date":"23 August 2011","review":"I think if this film had been filmed with conventional movie-making techniques it might have been enjoyable. Those of the cast who are not returning from the first movie are competent actors and there are moments of cleverness every now and again.<br><br>The thing that made it literally unwatchable for me is the shaky-cam.<br><br>I've never liked it and it is rarely used well. The editor of this movie is Drew Culingham (umbrage the first vampire). He got his money for nothing. The choppy editing combines with the frenetic camera-work to cause something similar to sea sickness. It made the zombie diaries impossible to watch for me.<br><br>I switched off before the end because the editing was so distracting that I couldn't bear to watch any more. Fans of shaky cam might enjoy it.","user":"marquisoftranbeam","rank":[21,26]}]