[{"title":"I am in love with this movie!","rating":10,"date":"13 April 2014","review":"This movie is amazingly good. I already had a taste of it with the short \"Eu não quero voltar sozinho\" and could not wait to watch the full movie. I had great expectations before even seeing the teasers or trailers... The movie is sweet, delicate and makes you feel so good! The characters are really well constructed. You can see how the actors improved and grew up. The dialogues flow naturally, and the camera works really well with the story. Although I already knew what would happen (because of the short) I was thrilled on many scenes. A really nice touch of the movie was to use small dialogues of the short. The movie makes you want to sit on the movie theatre for many hours. The music made me really happy. I was bobbing my head every time Belle And Sebastian was on, and could not hide my smile on the entire movie. The scenes are so well constructed that you forget that you are watching a movie - it has a dream-like feeling, even on the scenes where there is prejudice. Daniel Ribeiro did an amazing job, and so did the actors. I am in love with the story. This movie is for everyone who believes in love.","user":"oscarscheepstra","rank":[83,87]},{"title":"It pulled my heartstrings.","rating":10,"date":"17 July 2014","review":"If you want to feel that Oh-my-God-I-am-in-love-for-the-first-time feeling, hunt down a copy of this movie and fasten up your seat belt.<br><br>There are a lot of movies out there that pertains to the burdens of gay teenagers. However, this one seriously made its way to my heart. This is nothing mainstream, not even a hint of being a novelty film. I was jumping up and down, I cried, I laughed, I felt confused--this is a bomb;a ticking time-bomb. And the only thing that makes the ticking faster is the beat of your heart.<br><br>This is a hidden gem, a must-watch for those who are tired of mainstream movies. It is like reading a book but in a multi-sensory way and what makes this film unique is the fact that you cannot simply move on. You'll always be haunted by this movie and you'll find yourself tying the strings of your heart tighter.","user":"wintermoist","rank":[54,57]},{"title":"Simple, Subltle and sweet","rating":9,"date":"21 April 2014","review":"A simple, minimalist movie, very different from the current productions. Instead of explosions, too much talk, chop edition, grandiloquent music, Hoje Eu Quero Voltar Sozinho show the daily lives of ordinary teenagers, revealing their questions, doubts, conflicts, always in a subtle, gentle way. With very little, Daniel Ribeiro conveys much. The film speaks to teens who identify with the characters, especially the gay teens, but goes further by advocating tolerance and relativize the desire .. The world would be better if there were more movies like this one. Hoje Eu Quero Voltar Sozinho won the fipresc prize at Berlin Film Festival. The Hollywood Repórter wrote about the fist work of Daniel Ribeiro: \"A blind boy falls in love with another boy -- but it's his desire for independence that's the motor of this beautifully observed drama\".","user":"wel2005","rank":[61,65]}]