[{"title":"Could have been much better","rating":6,"date":"17 December 2017","review":"I'm a fan of the first Skyline. I thought it was a well made alien movie that had some mystique to it and an unique ending. Unfortunately, Beyond Skyline takes the most interesting ideas from the first part and completely obliterates them in the most profane way possible.<br><br>The first half of Beyond Skyline is pretty good. The main characters are introduced in a very clichéd manner but I don't think that will bother the audience. Once we peek inside the alien ship things start to get really interesting. This is where the film really shines. Lots of special effects, lots of cool environments and lots of \"what the *beep* are those things\" moments. It really builds up a nice momentum and keeps you interested. But by the time the movie is half way through, things start to take a turn for the worse. The plot starts to get lazy, the characters start to behave oddly and the whole thing starts to fall apart. It is if the screenwriter decided \"*beep* it, I'm going all in on this shit\" and just destroyed the carefully crafted momentum from the first part of the movie. This is done in a gradual but heavy handed manner. <br><br>By the time the movie reaches it final stages, you're not going to care for it anymore. Why? Because the mystique is gone and because the mighty aliens are now being slaughtered in melee combat by some very vulnerable humans. But nothing can rival the final 5 minutes of the movie. You thought slaughtering aliens in heavy armor with knives was over the top? You haven't seen anything yet!<br><br>All in all, the movie is quite entertaining but it could have been much better. I feel the story could have worked if the movie had more time to develop it in a natural way. In its current form it just feels rushed and quite frankly stupid. Nevertheless, I feel Beyond Skyline deserves a watch and would recommend it to sci-fi fans.","user":"procletnic","rank":[66,77]},{"title":"Some crazy alien stuff going on here !","rating":6,"date":"16 February 2018","review":"I can't say that I liked the movie, but I also can't say that I did not like it. Why ? Because there is a reason to like it and not to like it. I like it for the ambition put in this project, the hard work, the visuals, the actors and everything. There were parts from the alien scenery I really did like. Put I do not like the pile of plot holes that are everywhere in this movie and unlogical things that happen so often, it makes the movie even funny at some point. I gave it a 6 just because of the hard work, otherwise, 5/10","user":"undeaddt","rank":[17,20]},{"title":"Beyond Skyline: It's big, it's dumb, it's marginally better","rating":5,"date":"13 November 2018","review":"Sufficed to say I wasn't impressed with Skyline (2010) it was a big dumb Hollywood sci-fi epic that wowed with cgi but was held together by a generic wafer thin plot.<br><br>This time starring the superior Frank Grillo we see a different group of people during the invasion and their desperate fight for survival.<br><br>Once again it's big, loud, cgi filled and fifty shades of dumb but it accomplishes exactly what it set out to do and manages to do it better than the first movie.<br><br>It's mostly loyal to the first film and even succeeds in expanding the mythology further, but honestly not all too well. The majority of the film is predictible, it's full of the usual tropes and cliches and like most Hollywood films plays it very very safe.<br><br>It has its moments but you need to remember this is a take your brain out and watch movie (Even more so than ever). If you decide to foolishly think about what you're watching you're in for a bad ride and almost certainly a migraine.<br><br>If you enjoyed the first movie you might have fun here, if you want something you need to put any level of thought into stay away.<br><br>The Good:<br><br>Looks the part<br><br>Frank Grillo<br><br>The Bad:<br><br>Lacks consistency with the first film in places<br><br>Recasting previous character<br><br>Some of the coincidences defy belief<br><br>Things I Learnt From This Movie:<br><br>If your son assaults someone it's fine if they knocked them out with one punch<br><br>Aliens aren't bulletproof however any human inside devoured won't be hit<br><br>Holding enemies off while your friends escape is a pointless sacrifice if you buy them 2 seconds<br><br>More movies need brain ripping action<br><br>No noise cuts through me more than that of a brat *Ahem* I mean darling child","user":"Platypuschow","rank":[12,14]}]