[{"title":"Ambiguous Horror Movie","rating":7,"date":"4 April 2013","review":"The janitor Molly (Gretchen Lodge) marries the truck driver Tim (Johnny Lewis) and they move to the house of her deceased parents. Tim needs to drive and leaves Molly alone in the house. Soon Molly is haunted by her past and by her abusive father and she sees him in the house. Molly uses drugs again and records everything with her camera, expecting to prove that she is not crazy. Meanwhile, her sister Hannah (Alexandra Holden), Tim and his friend, Pastor Bobby (Field Blauvelt) try to help her, but Molly becomes dangerous and violent. <br><br>\"Lovely Molly\" is an ambiguous horror movie where it is not clear whether Molly is possessed by the evil spirit of her abusive father or whether she is mentally ill, after an incident with Tim and a neighbor a couple of days after her birthday. This is basically the debut of the unknown Gretchen Lodge and she delivers a top-notch performance. The screenplay is a little messy and the director fails in the conclusion, and maybe this is the reason of the bad reviews in IMDb. My vote is seven.<br><br>Title (Brazil): \"Adorável Molly\" (\"Lovely Molly\")","user":"claudio_carvalho","rank":[27,30]},{"title":"Eduardo Sánchez's new psyche-out horror flick is altogether spooky.","rating":15,"date":"15 September 2011","review":"Director Eduardo Sánchez begins his newest spooky feature Lovely Molly with a deliberate shout out the the film that brung him here, The Blair Witch Project (co-directed with Daniel Myrick). A crying woman confesses into a videocamera, capturing herself in a moment of distress and hoping to leave a clue to be discovered after she inevitably succumbs to an off-screen terror. Sánchez hasn't returned exactly to his old stomping ground of first-person documentary horror - Lovely Molly is for the most part a spooky old fashioned psyche-out horror film - but it's a nice touch in a film filled with them.<br><br>Molly and new husband Tim (Gretchen Lodge and Johnny Lewis) are ripped from sleep in their new inherited home by a squalling alarm. Someone has opened their back door and is thumping around in the kitchen, but police find nothing out of the ordinary and chalk it up to the wind despite Tim's insistence that he locked the door.<br><br>He's a truck driver, and is away from home for stretches of time in which Molly is left alone to deal with a growing malignancy, a presence in the house that manifests itself as sung voices, crying children, clomping horse hooves and slamming doors. Molly's afraid to reach out to her sister or husband for help, fearing that they'll assume she's lapsed back into substance abuse. She instead begins to videotape her encounters, and it's this footage, as well as taped footage of someone stalking neighbours and visiting an odd underground shrine of some sort, that forms the frightening backbone of the film.<br><br>As Sánchez himself claimed in a post-screening q&amp;a, the film is as much an \"indie relationship\" film and \"actor's piece\" as horror film. The entire weight of the film is on newcomer Lodge's back and she pulls the whole thing off dazzlingly well, transforming from a slight, trembling girl into a stalking, haunted and threatening woman crawling through an empty house. It's a performance good enough, combined with Sánchez's legitimate gift for crafting arresting moments of weird, totemic and animalistic horror, to transcend the film's kind of tired \"is it a ghost or a hallucination\" set-up, and take the whole thing into straight-up spooky, straight-up original territory.","user":"thesubstream","rank":[44,65]},{"title":"Gets under your skin","rating":8,"date":"28 August 2012","review":"OK, so I know the reviews for this one have been pretty mixed, but for fans of psychological horror that don't mind an ambiguous story line, I highly recommend Lovely Molly. As a massive horror enthusiast who sees EVERYTHING, I can tell you there are only a few films per year that have the ability to get under my skin, and this is one of them. Although not a particularly sadistic or violent film, Molly's (newcomer Gretchen Lodge) descent into depravity is entirely convincing in a very realistic and unpleasant manor. Her back story is left intentionally vague, which makes the proceedings much more horrific. As horror fans we all know the downfall of over exposition...once we know exactly whats going on it's just not scary anymore. To say much more about the story could hinder one's viewing experience but I will say to make sure you CRANK your surround system or watch with headphones because the sound design is a vital part of the film. Many scenes feature sonic subtleties which could easily be missed, and constant attention to detail (take note of the crackle heard every time Molly drags a cigarette). So anyways, Lovely Molly has my vote for one of the year's best in horror, and I can't wait to see what's next for both Sanchez and Lodge.","user":"edgure3","rank":[31,45]}]