[{"title":"Not a good documentary","rating":3,"date":"15 April 2014","review":"Of course there is going to be a tendency to rate a documentary about a fallen war hero highly, but this one is mediocre. It focuses mostly on trivial details of Murphy's childhood as told by family and friends, but there is not much material covering the last years of his adult life. True, most people don't live documented lives, and he worked in the shadows, but we don't hear from his fiancée or even Mr. \"Lone Survivor\" Luttrell. Several times the filmmaker juxtaposes individual interviews of Murphy's father and mother telling the same story in almost the same words, which might be cute once, but later becomes annoying. Wow, they are a married couple who have told the story several times together before, but we really don't need to hear it twice! The most interesting part was finding out that Murphy's suburban lawyer dad is himself a survivor of a hellish combat experience. The director's worst decision was to intersperse scenes of a random doctor and his parents throughout the the documentary without context. Though it may seem like there is going to be a reveal about how he treated Murphy or some momentous way in which their destinies crossed, it turns out he just received a scholarship in Murhpy's name. Nobody cares about this doctor at all, and it's silly to use a scholarship as proof that \"something good came out of it\"","user":"timlin-4","rank":[5,5]},{"title":"Thumbs up for Murph","rating":10,"date":"24 March 2013","review":"A wonderful documentary about a true American Hero. If you are looking for action, blood and guts look elsewhere, this is a story about a man who gave his life for his teammates and for his country. Peppered with candid photos and shots of his hometown, the story is both sad and inspiring. Murph was killed in action in Afghanistan in 2005 where he gave in a fierce fire fight with an overwhelming Taliban force. Murph stepped out from cover into enemy fire in order to call for backup, and was mortally wounded. Murph's call enabled the eventual rescue of Marcus Luttrell and the recovery of the three team members who died in the fight. He was posthumously awarded the Silver Star, Purple Heart, and Medal of Honor. The movie gives background on Murph's life, with moving anecdotes from family and friends. This is not a fancy Hollywood flick, but a must see nonetheless... evidence that heroism and selflessness are alive in our world today. For more detail, pick up the book 'Seal of Honor'.","user":"jess-barnes-641-742792","rank":[31,50]},{"title":"Great and powerful message","rating":10,"date":"9 December 2013","review":"When I first came across the story of Lt. Michael Murphy, it was in the book Seal of Honor. At the time I was having a lot of personal and family issues, but the more and more I learned about Michael Murphy, the ore I started to see some similarities with myself. The book helped me to make myself a better person. Then, I heard about Murph: The Protector, and knew that I had to see this documentary. I wanted to hear the words of the people that were closest to him describe a man that few people could ever measure up to. This story is one of a true hero. Not only a good person, but a patriot. Someone that our children should look up to, and an archetype that all men and women alike should strive to not just emulate, but to evolve in to. Thanks to what I learned about Michael Murphy, the SEAL motto of \"The only easy day was yesterday,\" is one that I will keep in mind forever. This is worth the watch, and it may even help to change the way you are living your life.","user":"apexfan333","rank":[18,27]}]