[{"title":"Different, not sweet and easy at all.","rating":7,"date":"14 October 2015","review":"I read reviews and expected disaster. In fact it's quite different from what one may expect. It is not a typical romantic comedy, there is a lot of satire on the American way of living, while the whole film should not be taken too seriously. It is a fun, beautiful places, good acting. Just some life reality, although shown from a little bit funny perspective. Just enjoy it, because you can. I am a real fan of Brosnan and think he delivers as usual. Handsome despite his age, keeps just a proper distance to himself and the guy he plays. All leading actors are just fine and convincing. Watch it and you will enjoy it. May by this is not an extremely ambitious and complicated movie, but don't we need some fun from time to time? In addition, the backdrop landscape is just so nice to watch. So why not give it a go.","user":"kms-91461","rank":[26,35]},{"title":"Pleasantly Surprised","rating":8,"date":"14 August 2015","review":"Now this movie does have its moments of being relatively cheesy, but it wasn't that bad. I found myself becoming more into the movie as it progressed, never mind the beauty of both female leads. I'm not typically a fan of watching movies more than once, but this one definitely goes on my re-watchable list. <br><br>A fairly predictable ending but didn't bother my interest in wanting to keep finding out what happens. <br><br>Give it a chance, you just might be glad you did.","user":"jasonpatel03","rank":[35,51]},{"title":"Average Rom-Com with some decent performances. 5/10","rating":5,"date":"14 November 2015","review":"Review: I quite enjoyed this cleverly written Rom-Com, because it had different elements that kept it interesting throughout. It is a bit predictable but the acting was realistic and the adult humour was quite amusing in parts. Its about a highly respected professor, Richard Haig (Pierce Brosnan), who teaches 18th century romantic poetry in a way that the students of today can appreciate. His father Gordon (Macolm McDowell) was also a professor at highly respected Trinity College in Cambridge, so he seeks the same accomplishments that his father achieved before he retired. He's also picked up his father's womanising ways, by falling for one of his students, Kate (Jessica Alba), who shocks him with the news that she is pregnant. She decides to move back to Malibu so she can raise there child, Jake (Duncan Joiner) and her sister Olivia (Salma Hayek) decides to move to New York to pursue her career in writing romantic books. As Richard wants to be close to his son, he also moves to Malibu and he takes a job in a school, teaching students who don't really care for his specialised subject. He then finds out that his wife is having an affair with a younger man, who she has fallen in love with, so he moves into the annex of the house to be close to his son and to keep his green card. After a while, Olivia also moves into the house because she has caught her boyfriend with another woman and while Kate and her new boyfriend Brian (Ben McKenzie) are away, she grows closer to Richard and after a passionate night together, they soon realise that there feelings for each other are more than what was expected. After having to leave America because his green card had run out, Richard spends time with his dying father, whose last wish is for his son to get back with Olivia. This film definitely has its emotional moments, with a witty script which was well put together by the director. Macolm McDowell's foul mouth character, made me laugh and the relationship between Brosnan and his son was touching. After watching Pierce Brosnan kick butt in the earlier Bond movies, I'm still struggling to take his comedic roles that seriously but you can't fault his performances which are always top class. Some of the situations that he gets himself in, were a bit silly but the overall concept of the film was watchable and enjoyable in parts. Watchable!<br><br>Round-Up: Pierce Brosnan, 62 and still looking dashing, hasn't reached the heights that he reached when he was playing Bond but he is still highly respected in Hollywood, even though his movies haven't made that much money of late. Films like the Love Punch with Emma Thompson, Love is All We Need, Survivor and A Long Way Down, haven't really blown up at the box office and some of them went straight to DVD but thats not to say that they were bad movies. I personally would like to see him play another \"Bond\" type role because of his cool persona, which really worked in the 007 franchise. Anyway, this movie was directed by Tom Vaughan, 46, who also brought you What Happens in Vegas with Ashton Kutcher and Extraordinary Measures with Harrison Ford but most of his experience has been TV. He was lucky to get Salma Hayek and Jessica Alba together for this project but they both have been out of the spotlight of late. Hayek hasn't had a major role in a movie since the terrible Grown Ups 2 in 2013 and I wasn't that impressed with Everly. She still looks great at 49 and she usually puts in great performances, along with Alba, 34, who recently starred in the Entourage movie. Anyway, this movie is a decent watch with some good performances but if your not into your Rom-Com's, then this movie isn't for you.<br><br>I recommend this movie to people who are into their comedy/romance movies starring Pierce Brosnan, Salma Hayek, Jessica Alba and Malcolm McDowell. 5/10","user":"leonblackwood","rank":[13,17]}]