[{"title":"A Competent Excercise in the Familiar","rating":7,"date":"22 March 2014","review":"THE LAST DAYS ON MARS is a surprisingly well-made film about things we've already seen before. And that's the charm that makes it worth watching. To begin with, the film is brisk (1 1/2 hours) and doesn't waste much time in telling its story. Even the few moments of quiet contemplation of life/death don't overstay their welcome. The characters don't make stupid decisions, but they do make them with little motivation.<br><br>The film is essentially a cross between 28 DAYS LATER and THE THING, but the film is aware of its influences and doesn't try to reinvent the wheel. If anything, it strips them down to the foundation and goes with a simple explanation that feels more believable than 28 DAYS LATER. The film takes the technology seriously without turning it into a spectacle. It kind of reminds me of RED PLANET in that sense, but it doesn't depend on CGI spectacle to lend undeserved importance. The film very simply suggests that the characters be taken as real people who are reacting to the situation in front of them, just on a different planet where the rules of survival are equally alien.<br><br>TLDOM is worth watching because of the skill and confidence of the people making it. Perhaps the only thing holding it back from the attention it deserves is that in spite of that skill, it doesn't have anything different to say.","user":"amnesiac12001","rank":[59,75]},{"title":"Oh God...somewhere a screenwriter is crying!","rating":3,"date":"3 November 2013","review":"It started off with a nice technocratic elegance. The feel of the props and the sets had a 2001-ish techno-realism that I found pleasing. And even better, the cast of characters: The Coldly Irate Scientist, the Astronaut with the Hidden Fear, the Cowardly Psychologist, the Brave, but Conflicted Captain...it was all a great set-up for a tension thriller when the crisis would hit. And overall, the photographic sense of realism in the martian landscape was the perfect canvass for a great thinking person's space thriller. I mean, even the acting was great!<br><br>But then, back in the Conference Room, someone on the Producer's Committee slammed both hands on the table and shouted: \"I put a lot of flinkin' $$$ into this flinkin' movie...an' I wanna see ZOMBIES!\"<br><br>And then everyone else around the table started nodding their heads and muttered: \"Zombies is Good\", \"My kid like Zombies\", \"Zombies Sell\", \"Zombies are the KEY Demographic\", \"Yeah, people pay to see Zombies!\", \"It's gotta be Zombies this season.\" \"Zombies, I tell ya!\"<br><br>And the Director threw up his hands and said: \"Alright, dammit. Let There Be Zombies!\" <br><br>And the rest of the movie went FLUSH! Down the drain.<br><br>If I wanted to see Zombies on Mars, I woulda watched \"Ghosts of Mars\"...Again! But I Won't. Because that Movie was a waste of a rental even THEN. And even THEN, the Zombies didn't really make any sense, but it didn't matter because it was all about Ice Cube running around shooting things up.<br><br>Here, the Zombies didn't matter because they didn't even TRY to make the concept make Scientific Sense once the Human Zombies (Born of Martian Microbes) started running around naked on the martian surface and blowing things up so they can go: \"Om Nom Nom\" <br><br>Don't PAY to watch this trainwreck in the Theatre. Wait until it streams for free on Hulu...","user":"Rabh17","rank":[136,188]},{"title":"Night of the Living Dead in Mars","rating":5,"date":"6 September 2014","review":"The crew of the Tantalus Base is ready to finish the activities in Mars and preparing to return to Earth after a six months mission on the Red Planet. After a sand storm, Commander Charles Brunel (Elias Koteas) summons the team composed by Vincent Campbell (Liev Schreiber), Rebecca Lane (Romola Garai), Kim Aldrich (Olivia Williams), Robert Irwin (Johnny Harris), Marko Petrovic (Goran Kostic), Richard Harrington (Tom Cullen) and Lauren Dalby (Yusra Warsama) for a last meeting. However Marko tells that he needs to fix a sensor and he goes with Harrington in a rover to the place. <br><br>The loathed Kim barges into Marko's computer and finds that he has secretly discovered some sort of bacteriological life in Mars. Meanwhile the ground collapses beneath Marko and he falls and dies in a hole. Harrington asks for help and Brunel and Dalby arrive at the spot. Brunel realizes that they need a cargo gear equipment to rescue Marko and Dalby stays at the pit. When they return, Marko and Dalby have vanished and Campbell explores the pit. Meanwhile Marko and Dalby appear at the base and the Martian bacteria have transformed them in zombie-like creatures. They attack Harrington and break in the outpost, attacking the crew. Each one that dies turns into zombie. Will the survivors succeed to escape from the zombies?<br><br>\"The Last Days on Mars\" is a patchwork of several other movies, such as \"Alien\", \"Prometheus\" and \"Mission to Mars\" with \"Night of the Living Dead\", when a group of survivors is under siege of zombies. The plot has a promising beginning, with an interesting scenario, and good performance of Olivia Williams, but her character dies very soon. The rest is the use of clichés and a predictable story. My vote is five.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[24,29]}]