[{"title":"Disgusting, Perverse, and Thought Provoking","rating":8,"date":"2 January 2012","review":"The Woman- The movie opens with a seemingly happy family enjoying a backyard BBQ with some friends. But it is apparent very soon that this family has a lot of terrible secrets they are hiding. The wife seems to be walking on eggshells around her husband, the teenage daughter is having trouble at school, and the teenage son is showing signs of being a psychopath like his father. The father may seem like the picture of an upstanding citizen but is actually a wolf in sheep's clothing.<br><br>During a hunting trip, the father finds a feral woman. But instead of calling the authorities, he brings her home to live with his family? He decides to make it a family project to clean her up and domesticate her. It is no surprise that things do not go as smoothly as he hoped. What follows is a disturbing gory end to the story.<br><br>From a woman's point of view, I saw this film as more of a piece about what is actually civilized and what is feral. The Woman could instinctively tell who was there to harm her or help her. She could easily read other people's emotions and reactions to what was happening to her. During the duration of the film, the father seems to act just as uncivilized as his captive, but displays it in a very different way than The Woman.<br><br>The movie was shocking, disgusting, thought provoking, and perverse. Horror fans will be be satisfied and cringing with the splatterfest ending.","user":"ZombiGurl","rank":[60,85]},{"title":"A really excellent, somewhat disturbing study in family dysfunction","rating":9,"date":"30 August 2011","review":"Its funny that the first major notice this film got was because somebody stormed out of an early screening crying misogyny. Funny because The Woman in fact is a long way away from misogyny, in fact I'd almost be inclined to call it a feminist film. Its an account of an average American family going about their business, except for the fact that the father is a complete monster who one day brings home a feral woman from the woods, who he decides to educate. From the very start this is unusual stuff, with the titular woman hallucinating birth then slaughtering a wolf for food, and while not especially violent given its reputation some pretty heavy territory gets explored, domestic abuse, familial corruption and a visceral take on gender power conflict. The film is anchored in Sean Bridgers' performance as Chris Cleek, family man gone very, very wrong. He gives the character a constant menace, a smile, bright face and charming demeanour, a plastic outside so almost right, so not quite all there that it perfectly suggests his inner depravity, and in his depravity he is just as slick and even darkly humoured. The character is patriarchy at its most terrible extension, dedicated to control and dominance, assured of its utter superiority and quick to cruelty. It finds perfect match in the woman though, femininity in its most feral savagery. Pollyanna Mackintosh is wonderfully inhuman in the role, conveying sheer violent animalism through her body language and freakish guttural grunts and growling. The rest of the performances are strong stuff too, Angela Bettis as the meek wife of the piece, downtrodden to the point of barely having her own personality, Zach Rand as son Brian following in his fathers footsteps and Lauren Ashley Carter as daughter Peggy withdrawing into her own shell from the horror. Everyone gels well together, drawing the audience in so the punches hurt all the more. I won't go into too much of what occurs once the woman is imprisoned, but you can probably guess some of it, and the film does a great job in stirring up a sense of intense, boiling rage at the increasing dark events. The soundtrack is an important part of this, often using soft indie rock it works perfectly alongside the whitebread setting and in the way it underlines the travails of the children, but also makes a fine contrast to the nastier stuff. I must say there was almost nothing that I didn't care for in this one and it's by far the best US horror film I've seen in years. Lucky McKee directs with a sure hand, mixing jolting savagery with cruel, calculating drama and a few moments of affecting dreamlike melancholia, although the film does get somewhat melodramatic and the intense finale goes into feverish pulp territory slightly unsuited to the mostly just disturbing bulk of the film, things are always surely handled. Arguably the film could have rounded things out better, developing its themes into something more intellectually satisfying than simply bloody violence (though the bloody violence is pretty darned satisfying) but its a minor quibble really. 9/10, really great stuff.","user":"Bloodwank","rank":[50,75]},{"title":"A feminist horror masterpiece","rating":10,"date":"28 August 2011","review":"So far I haven't been that impressed with Lucky McKee's films, but with The Woman he has become a director who has found his voice. It's a singular and deeply personal vision and for the first time in a film of his, it all comes together. I still find it difficult to put my finger on what makes the film so upsetting and I will need another couple of viewings to completely get my head around it, but this is part of the film's brilliance.<br><br>In short, The Woman is about a man who, on a hunting trip, comes across and entraps a feral woman who lives in the woods. He decides to chain her up in his basement to 'civilise' her. He involves his family, as if this were a project like building a garden shed. As the film goes on it becomes clear that the man, a pillar of the community, has been mistreating the female members of his household for a long time and the character of \"the woman\" comes to personify and externalise what has been broken in that family all along.<br><br>While the last act erupts in bloody violence, it's the emotional violence and the effect on its characters that we experience along the way, which is really upsetting. There is also some pitch black humour in the film, which only makes the film more disturbing. <br><br>There has already been some controversy when there were walk-outs at Sundance where the film has been accused of misogyny, but I don't think that's the case. This is a feminist horror film, but one that avoids trite lectures and finger wagging moralising. Just because a film depicts something, doesn't mean it approves of it. <br><br>The film sits between something like a Todd Solondz film but without the hipster nihilism and the visceral rawness of recent French torture horror films like Martyrs or Inside but without the moral vacuity or leering voyeurism. Those looking for a straightforward shocker may be disappointed, because the film constantly side steps the conventions and clichés of the genre. McKee doesn't give you fake scares to jolt you or conventional suspense sequences and it doesn't \"reward\" you with violence, when you expect it. If you are open to McKee's approach then the film will crawl under your skin and it will fester there and that's what I call a real horror film. <br><br>The film's horror lies in its characters and in the unequal power dynamic between men and women. On the surface this may look like a film about a monster woman killing people or it maybe about a family trapping and abusing a feral women, but while those are aspects of the film, they aren't really what the film is about. The emotional pay off to these genre conventions is completely different from other modern horror films and their depiction never resorts to clichés. It's a film that gives an audience what it needs, rather than what it wants.<br><br>A note on the acting some comments have been complaining about. The performances by the entire cast are amazing. Those complaining about the actors in the film don't seem to get that the performances are non-naturalistic on purpose. The acting style fits the sense of allegory and heightened reality, yet the actors still get to the truth behind their characters. In a perfect world they should hand Sean Bridgers, who plays the father, the Oscar for best actor now and be done with it. Angela Bettis' fragile frame and sad face have never been put to better use. The actress who plays 'the woman' is truly ferocious and the kids are great too, especially the teenage daughter whose slow withdrawal from the world is painful to watch. <br><br>The use of a rock soundtrack in the film is also fantastic, which gives it a raw punk power and aesthetic. There is a moment where the mother allows herself to connect and identify with the 'woman's' plight, while a guitar chord drones on and it is absolutely exhilarating.<br><br>There are things in this film which during my initial viewing I reacted against and now when I think back on it, they were absolutely perfect creative choices. Shot digitally and looking it, using slow motion, fish eye lenses and many dissolves at times seemingly at random, the film is often quite ugly looking but this only adds to it's raw, ragged punk quality. The fate of one central character genuinely appalled me and for a moment I hated the film, but then thinking back, it was absolutely the right thing to do. <br><br>I'm a jaded viewer of horror movies by now and its not often that a film gets to genuinely mess with my head and leaves me richer for it. The horror genre needs more films like this.","user":"Boris_Day","rank":[105,174]}]