[{"title":"Wonderful for the right audience","rating":9,"date":"27 March 2012","review":"i saw this with twenty something people. This was not a movie for them, but it is a most superior film for older people who have seen people live torturous lives. Why people do things that hurt themselves is a intriguing question which fascinates psychologists and artists alike. No one has come up with a satisfactory answer, not even a plausible one, and Freud leads the list of the clueless. Thus, Hester (played by a wonderful Rachel Weisz) can fascinate those of us who care about the inner working and emotional vicissitudes of a self destructive woman and who will learn about the human condition by considering her behavior. Simon Beale and Tom Hiddleston, the men in her life, are equally impressive performers playing equally limited (Beale) and troubled (Hiddleston) persons.<br><br>First, I think most people don't know where the title comes from. A song popular during the second world war (a recent event in this film), has the line \"we're caught between perdition and the deep blue sea.\" This is an apt description of the three protagonists.<br><br>This film might be quite tedious for those in a hurry to move on with their lives. The three main characters are stuck and seem to have no capacity for getting unstuck. This is tough to contemplate if you can't wait for your tomorrow's great triumph, or if you see romance as a smooth road to your personal paradise.<br><br>The rest of us are mesmerized as these troubled lives unfold on screen. Yes, the mood and physical atmosphere are almost relentlessly dark (it needn't have been); The film is completely without humor, and it is much too slow moving. These are minor difficulties. The script and performances are magnificent.","user":"howardeisman","rank":[110,131]},{"title":"A dark film kept alive by Rachel Weisz's sublime acting","rating":5,"date":"12 March 2012","review":"The main flaw with this film is the score. The entire score seems wholly misplaced against the backdrop of the story. The entire collection of violins drown the dialogue and plot in trills and crescendos, without any consequence, and leaves a bitter taste, from the start, and little hope that something impressive is going to unfold. <br><br>Having said that, Rachel Weisz as Hester Collyer was sublime. Her portray was forceful, promising and deeply crafted. Her rough emotional distance and tentative passion lends a more natural edge to an other gloomy film. It is tragic when a film, with as much potential as this one, relies so heavily on one of two characters to keep it afloat. The rest of the cast, do not deserve any special mention. They are merely stilted orbs, lacking any remarkable features, revolving around the maelstrom that is Hester Collyer.<br><br>The cinematography also deserved a special note. Intimate shots swathed in 1950's British charm holds this film in a state of timelessness. The cinematography also mixes well with Rachel Weisz's role - her melancholia so closely studied by Terence Davies, that rushes in and ebbs as quickly, is deepened and darkened by the lifeless rooms and hopeless situations she finds herself in.<br><br>Overall this is a movie that one needs to see for oneself; in order to formulate your own opinion about it, independently and isolation.","user":"groenewaldjas","rank":[41,51]},{"title":"Starts brilliantly but becomes boring. A shame.","rating":6,"date":"6 January 2014","review":"This movie starts brilliantly. Director Terence Davies creates a scene centred around a suicide attempt that is quite beautiful and frightening. It really gets the movie going and gets you interested in the story.<br><br>Rachael Weisz puts in an accomplished performance as the female protagonist at the centre of a love triangle. She is exceptional throughout and well supported by Simon Russell Beale and Tom Hiddleston.<br><br>So why didn't I like this movie more? Well, I think the answer lies in the fact that this movie is based on a play, and it shows. The scenes are long, heavy on dialogue, and not much is done with the screenplay to add something extra.<br><br>I think this would be wonderful to see in a crowded theatre where the dramatic tension could build up with the audience in close proximity to the actors. But on a small screen, it just doesn't work as well. Eventually, it becomes boring. And the oddest thing about it is why, after the fantastic opening, Davies doesn't make more use of cinematic techniques to turn this into a \"movie.\" He obviously had the ability, so why didn't he use it? A shame.","user":"craig-hopton","rank":[7,7]}]