[{"title":"Fun, so long as you don't think too hard...","rating":6,"date":"1 December 2012","review":"\"The Collection\" is a fun, gory time at the movies. A sequel to \"The Collector\", the story is about a serial killer who uses elaborate contraptions to kill groups of people but he always seems to take one away alive, and bring one of his \"collection\" to his next murder scene. After a jaw-dropping opening sequence in a club, he snatches a girl who is the daughter of a rich man. The man hires mercenaries to rescue her, bringing along the survivor from the first film. So they head off to The Collector's house of horrors to find her...<br><br>The film is pretty much non-stop action, violence, and gore. There are plot-holes a'plenty here -- the killer must be a multi-billionaire and able to control time and space to be able to do what he does, so too much thinking (heck, ANY thinking) will only damage your enjoyment of the film. But if you want to spend 90 minutes at a fun, gory flick, \"The Collection\" will do just fine.","user":"stsinger","rank":[66,86]},{"title":"Yeah....OK.","rating":3,"date":"11 May 2013","review":"The Collector is back, this time, with a few billion dollars to spend on elaborate and rusty traps that always work 100% of the time. I tired hard to enjoy this movie, but I have a thing against killers that drink invincibility kool-aid before each movie. I don't know what it is, maybe I just don't like kool-aid.<br><br>The Collector sets up a cool happening party but what the guests don't know is they are about to fall victim to some ridiculous and highly unlikely kill scenarios. The collector has hired several thousand people (you would think) to retrofit this party with many elaborate traps and machines that would make Pee Wees Playhouse look dull. All of them worked too. A 100% execution rate is pretty good considering the death traps were operated by steam, rusty wires, corroded ball bearings and levers and dominoes and magic.<br><br>The rich girl at this party finds a guy in the trunk and it is the guy from the first movie. The only person in the known universe that can kill the Collector. The chosen one. But we don't know that yet. The rich girl gets caught, but the guy from the first movie manages to escape the Collector...for some reason. It appears that the Collector controls time and space and could have made a jumbo jet crash into the guy as he ran away. Why the Collector didn't shoot death rainbows or caused a ridiculous trap to spring up to stop the escaping man, I don't know.<br><br>So worried about his rich daughter, the rich father recruits the guy from the first movie, the guy from OZ and easily killable mercenaries with automatic weapons and years of training to find the collector, save the girl and then return her. But they were no match for Collector, who aside from having billions of dollars to spend on traps and an electricity bill for an entire warehouse (which everybody thinks is abandoned BTW..including the electric company?) he also can kick anybodies butt in hand-to-hand combat because he is super strong and can dodge knife attacks and bullets and any other form of corporeal matter. He also appears anyplace at any given time. One second he is stalking somebody on the tenth floor, the next he is on the tail of somebody else on the other side of the building. Add telleportation or time-stoppage with a build in GPS system to his list of magical Collector abilities.I would really place the Collector somewhere between Chuck Norris and God when it comes to being super awesome and everything.<br><br>Eventually, because the movie needed to end the guy from the first movie somehow caught the Collector while his force-field is down and lands a knife to the leg which makes the collector weak to regular people attacks. The collector is tossed down a garbage shoot and is lit on fire.<br><br>The guy from the first movie goes outside, and looks in some luggage and sees a smouldering Collector's mask meaning the collector escaped. Of course he did.<br><br>So the guy from the first movie tracks down the collector, now working as a janitor or something and confronts him, he babbles some back story to give the movie a plot; like the collector worked at a museum as a entomologist or something and is mad or crazy or something... then kicks the Collector in a trunk where he will surely escape in part 3 because he can't die.<br><br>Oh yeah, and all the relatives of those millions of people the Collector had slaughtered in his giant factory can rest easy now. I am not sure, but I think he killed the population of California. Or maybe even all of the US.<br><br>The end.","user":"brad_mcmillan","rank":[34,43]},{"title":"Disappointing","rating":3,"date":"17 December 2012","review":"So at the start of the movie, I was thinking that this was going to be epic, especially with the positive ratings I'd seen prior to the film and the gruesome killing scene at the beginning of the movie, but then the movie kind of didn't go anywhere after that.<br><br>Now I'm not one of those people who expects a lot from a horror film, but this film had no substance whatsoever. We didn't learn ANY back story about any of the characters, the most we know about the main characters is that the female (Lisa) had gotten into a car accident when she was a child and the male (Arkin) had a wife he sent off somewhere. There were only 2 flashbacks and the only purpose they served was to show the audience her connection to the guy hired to save her. Now a back-story isn't always necessary if the characters are interesting, BUT except for the lead male, Arkin, non of the characters stood out in any way, they were completely forgettable...so when one died, no one really cared.<br><br>Secondly, there were plot holes too big to ignore. The whole point of going to rescue the lead character (Lisa) was because the police haven't been able to find the \"Collector\" but then we learn that the guy who got away (Arkin),had inscribed directions to the place he was taken, on his arm. So if this guy knew how to find the Collector, why not just tell the police so that they can go in with a trained squat team? Also, Arkin knew what the inside of the hotel looked like and he knew that there were traps everywhere, so why would the hired men NOT think out a solid plan before going in? It could've definitely had an \"Ocean's Eleven\" or \"Smokin Aces\" like quality to it, which would've made the story more interesting.<br><br>Thirdly, the person hired to rescue Lisa, only took FOUR frickin people with him. I mean this Collector guy has killed over a 100 ppl (often murdering in masses) and he lives in a huge abandoned hotel and you decide to go in with only a team of FOUR ( 5 if u include Arkin)! Not to mention that the hired team of 4 were in no way prepared nor did they seem to have a plan...they all went in and died almost instantly - barely putting up a fight. At the start of the film, you assume that the father has hired these bad-asses to help his daughter but honestly, they were sort of useless. <br><br>Lastly, it wasn't really explained very well as to what the Collector was doing with all of the victims he had in his house. From what I gathered, he took at least one victim from his massacre with him and once he got them to his hotel, he would see who could survive. Now what he did with them after they survived was a mystery...we only know what he did with the weak victims. Also despite how great the murder scenes were, the fighting scenes were amateur at best...it was VERY obvious that it was choreographed and the movie wasn't scary in the slightest.<br><br>With that said, I can honestly say that this movie could've had a lot to offer...it had so much potential, which is why I'm so frustrated. The characters could've been developed more, so when they died off we'd actually feel something...anything. They could've developed the plot more by sending out a group of trained bad-asses in the hotel to sort of level out the playing field, as opposed to the four idiots who just got slaughtered. The only silver lining was the ending, which was unexpected but considering how disappointing the rest of it was, I couldn't take much pleasure from it.:/<br><br>Despite all of this, the acting isn't terrible and the effects are pretty amazing, so if you're bored this movie isn't a complete fail...I guess...","user":"abc-tvbuff","rank":[40,59]}]