[{"title":"Ribald, funny, merciless fun at the expense of politicians and politics","rating":8,"date":"4 September 2012","review":"A very, very funny movie that's very, very coarse. If you are not amused by jokes about sex, body parts and bodily functions, effeminate men, scantily-clad women, politics, and politicians then this isn't your movie. If you like that sort of thing, then you need to see this movie now. Light, fluffy entertainment. No thinking required (or desired). Good guys win. Bad guys either lose or are redeemed. I run hot and cold on Will Farrel movies. This one's a keeper for him but the real star of this movie is Zach Galifianakis who seems to replicate Jack Black's character in \"Bernie\" but with a completely different take. This movie will make you feel better about what's coming to American politics in the next three months.","user":"steven-leibson","rank":[32,40]},{"title":"Good satire of politics.","rating":7,"date":"23 August 2012","review":"The Campaign is a good satire of politics. The Campaign shows why the public has lost faith in the USA political process. The satire of the movie shows how candidates do not answer questions, but skirt issues and use generic themes like freedom etc. The Campaign shows there is no discussion of the issues and the two candidates deteriorate the campaign into the Springer show. One has sex with the other's wife as a campaign ad. The Campaign shows that the special interests run both parties, which is the reason why there is no real debate, and interest in what is good for the community. The film is funny but has some low ball comedy on Religion, sex, and people. I give The Campaign a seven out of ten.","user":"mm-39","rank":[12,14]},{"title":"A simple comedy that does its job.","rating":8,"date":"19 August 2012","review":"After reading many reviews, i have to agree that this is a technically a bad film. The humor in this movie is very raw and crude (which doesn't bother me), and it has a very simple storyline. I was ready to give this movie a rating of a 5 or below until i stopped looking into the movie too much, and saw it for what it is. The purpose of a comedy is to make people laugh, and that is exactly what myself and the rest of the theater did for the majority of the movie. The movie is so relevant as well with the upcoming presidential elections, and i feel this movie helps take the edge of the brutality of the current Obama vs. Romney.<br><br>If you just want to see a simple movie that will make you laugh without having to think about the plot, then see the movie.","user":"gordyh96","rank":[69,105]}]