[{"title":"coulda, woulda, shoulda been better","rating":5,"date":"3 July 2016","review":"Good performances (with one exception*, noted below), good story, good staging, good photography, and good dialogue (again with one exception*, noted below), this could have been a 7/10 or 8/10 movie but for that one exception: *Marc Petey (as Aiden Magnusson) and his (lack) of dialogue. <br><br>It would be reasonable (I think) to expect Eric Petey to write some decent dialogue for Marc, and get him to deliver, but no. He mostly has none, and what he does have is mostly unremarkable. It's a shame, because that single performance (by the main character) drags down the entire movie.","user":"lioninoil","rank":[15,20]},{"title":"Save yourself the pain","rating":1,"date":"3 June 2016","review":"I like bad films. Films that are 'so bad it's good', but this? It's just bad. So awful that I stopped watching after 25 minutes and I can't remember ever doing that before. The acting is wooden, which I can overlook in films because they're entertainingly bad and have redeeming features, but this was just painful to watch. The main character is uninteresting, there are too many irrelevant characters and interactions, and it seems in this futuristic vision everyone is an *sshole. For a city sector that is crumbling the pavements are surprisingly clean, but this film is a mess. The UK DVD cover looks like it should be an action movie, the synopsis read like it had potential, so for £3 in ASDA I took a chance on it but it's going straight to the charity shop.","user":"tinatspoon","rank":[17,24]},{"title":"Anything is better than spending time watching this!","rating":1,"date":"24 May 2016","review":"This is truly an appalling movie: there is nothing to recommend or redeem it in the slightest. The acting is so wooden it makes Pinocchio look like an Oscar- winning character actor, the plot is so confusing that you don't know what the main character is doing, or why, and even understand how it ends and the scenes are basic to say the least. It's set in a future where a presumably dangerous city (devoid of any transport) is policed by unarmed cops, and all the criminals are equally unarmed. Characters appear and disappear throughout the 98 mins of cinematic torture without rhyme nor reason: distinctive clothing or characteristics make no difference to whether they stay or not and if they make any impact on the story. I've no idea how anyone can score it anything better than awful: it's certainly the worst movie I've actually sit through as opposed to walking out before the end, though I should have done to save my time.","user":"millis-57092","rank":[20,31]}]