[{"title":"Zero IQ Thirty","rating":5,"date":"4 February 2013","review":"I totally agree with the blog posted on Dawn.com regarding this movie by Nadeem F. Paracha.<br><br>Zero Dark Thirty', was quite an experience. Though sharp in its production and direction and largely accurate in depicting the events that led to the death of Osama Bin Laden, it went ballistic bad in depicting everyday life on the streets of Pakistan.<br><br>With millions of dollars at their disposal, I wonder why the makers of this film couldn't hire even a most basic adviser to inform them that<br><br>1: Pakistanis speak Urdu, English and other regional languages and NOT Arabic; <br><br>2: Pakistani men do not go around wearing 17th and 18th century headgear in markets; <br><br>3: The only Urdu heard in the film is from a group of wild-eyed men protesting against an American diplomat, calling him 'chor.' Chor in Urdu means robber. And the protest rally was against US drone strikes. How did that make the diplomat a chor? <br><br>4: And how on earth was a green Mercedes packed with armed men parked only a few feet away from the US embassy in Islamabad? Haven't the producers ever heard of an area called the Diplomatic Enclave in Islamabad? Even a squirrel these days has to run around for a permit to enter and climb trees in that particular area.<br><br>I can go on.","user":"askarali","rank":[660,992]},{"title":"High quality (little action) and realistic depiction of the hunt for Bin Laden","rating":7,"date":"17 December 2013","review":"It's not an action flick, it's a thriller. About a tough CIA-chick who has a hunch about a guy who might eventually lead them to Osama Bin Laden. It takes her almost 10 years, a little waterboarding, a couple of dead colleagues and a lot of arguing with her superiors, but she manages to follow the lead all the way to the now famous raid in Abbottabad.<br><br>It's a very captivating film (even with its 160 minutes runtime), and the big raid at the end is quite intense and realistic. That said, Bigelow's previous 'The Hurt Locker' was (even) better. But it's close!<br><br>As for the controversy whether the film is 'pro-torture propaganda' or not: it shows what (likely) happened. A very unpleasant sight for Americans, sure, but that's no reason to leave it out. Whether or not 'OBL' would've been caught without the use of torture is speculation that has no place in this movie (it's a depiction of events, not a moral study).<br><br>Some Americans might still find it hard to watch a movie that requires you to form your own opinion about the actions of your country/government/army, instead of getting one spoon fed by those very same institutions. But given the America's options in government- potential it seems a luxury Americans no longer have.","user":"DopamineNL","rank":[68,93]},{"title":"Lazy and boring filmmaking","rating":1,"date":"14 February 2013","review":"I want to thank Kate B for adding to my knowledge. Really. I had no idea that Abbottabad was an Arabic-speaking city where most of the world's camels come to take a nap as the dunes of the desert silhouette them against the setting sun.<br><br>After about the fifteenth person yells \"Yalla! Aimshee!\" you begin to wonder: couldn't they just have Wikipedia'd this stuff? It's written on that website that the national language of Pakistan is Urdu, right? Especially if one is to make a movie about an event a couple of years after it transpired, surely a little Googling would help? It's an error so enormous that it made me think, \"If they got that wrong, why should I believe they got anything right?\" It's grossly insulting and reminds me that one should never rely on others to represent oneself.<br><br>\"You don't understand Pakistan!\" White Chick screams at her supervisor at one point. And you do? I wanted to ask. You, who just said \"shukran\" at a \"bar\" at the Marriot Hotel after you were served wine in a margarita glass? Overall disappointed with Kate B's lack of effort in representing such recent events in a realistic manner. Another edifice to lazy filmmaking and needless hype.","user":"analyzepk","rank":[225,365]}]