[{"title":"lords of the ring","rating":7,"date":"31 August 2013","review":"\"The Cooler\" director Wayne Kramer's \"Pawn Shop Chronicles\" is the latest in a string of movies about a bunch of people who don't necessarily meet but have a connection. And it's a really crazy movie at that. The connection here is a pawnshop in Louisiana and a ring. My favorite segment was the first one, just because of the characters' fun-loving attitudes. There is at least one scene that tests what you're willing to watch.<br><br>Yes, it's a pretty weird movie, but I liked it, especially Brendan Fraser's Elvis impersonator. The graphic novel approach also gives the movie an impressive dimension. Just remember that it's NOT for the squeamish.<br><br>So yes, why are racists supposed to hate Jews?","user":"lee_eisenberg","rank":[25,28]},{"title":"Not for those with cognitive challenges","rating":8,"date":"23 July 2013","review":"This film is a very dark comedy, and is definitely not for everyone, as may be apparent from the previous reviews. As with James Joyce's \"Ulysses,\" director Wayne Kramer's \"Pawn Shop Chronicles\" follows several characters through their own adventures during a single day. Unlike Joyce's classic, this modern story takes place in a small, quirky southern American town rather than Dublin, Ireland. Still, for those of us with attention spans longer than that of the average house pet, the threads of the three stories that make up the chronicles can be seen slowly interweaving into an harmonious comedic tapestry. The viewer who pays meticulous attention will be rewarded, since quite literally everything in the film echoes and resonates throughout all three vignettes, and like far-off thunder slowly building to a deafening crescendo, it all comes together in the perfect ending. Well suited to repeated viewings, I feel that \"Pawn Shop Chronicles\" is destined to become a cult classic among truly discerning aficionados of modern comic cinema.","user":"painterdg","rank":[63,78]},{"title":"Strange movie, but it's a good kind of strange.","rating":8,"date":"24 August 2013","review":"This is the first time I write a review for a movie, not that this movie needs one. But it deserves it. Because the first time I heard of Pawn Shop Chronicles, I thought the History channel made a movie about a very bad reality series. But don't let the title fool you. This one the best triptych i ever seen. Just watch it, I'll guarantee it, you'll have great time.<br><br>If you are a Pulp Fiction fan, you'll definitely appreciate this movie. Excellent and out of their \"usual comfort zone\" performances from some of the most under-appreciated and underestimated actors in Hollywood. Watch the movie and you'll understand it.","user":"janssuh-2","rank":[28,33]}]