[{"title":"Sufficiently scary!","rating":7,"date":"13 September 2012","review":"This movie, though very predictable, definitely had its moments of terror. The build-up before the moments that made you jump were great, and although I was fully anticipating what was to come I still jumped several times. The plot was decent and I appreciated how the characters were written. The acting was surprisingly good for a low-budget film, I was definitely impressed by that. The apex of the film was very intense and dramatic, if slightly cheesy. The only thing that really bothered me was the very, very cliché ending. I felt as though I've seen that very ending 10 other times in various other movies, it has been so over-done that it will ruin an entire movie for me. But other than the very end, I was pleasantly surprised by this movie and would definitely recommend it!","user":"xtayler_raex","rank":[23,28]},{"title":"A lot of fun while you're watching it but it doesn't stay with you at all.","rating":6,"date":"13 September 2012","review":"'APARTMENT 143': Three Stars (Out of Five) <br><br>Another 'Found Footage' haunting movie. This one focuses on a family that recently lost their wife/mother who's haunted by the unknown, at their apartment and the house they lived at prior, and the team of parapsychologists tasked to investigate. It was written by Rodrigo Cortes (who also directed the claustrophobic thriller 'BURIED') and directed by rookie feature film director Carles Torrens. It's a Spanish film originally titled 'Emergo' but it's spoken all in English with American actors (including Michael O'Keefe of 'CADDYSHACK' fame). There's definitely nothing new or original to the story but the scares are effective and well done.<br><br>The story revolves around Alan White (Kai Lennox) and his daughter Caitlin (Gia Mantegna) and son Benny (Damian Roman) who recently moved in to apartment #143 of an apartment building after experiencing strange things at their old home. The unusual disturbances continue to haunt them at their new home and Alan asks a team of three parapsychologists, lead by Dr. Helzer (O'Keefe), to investigate what's going on. We soon learn that Alan lost his wife in a car accident and his daughter blames him for it. Helzer and his team constantly witness the drama between the two as well as weird occurrences they were told about. They're able to catch it all on video (of course) as the investigation becomes more and more bizarre.<br><br>Like I said there's absolutely nothing unique about this film but it is entertaining if you like spooky films full of shocks. The only problem is you'll soon forget everything as there's nothing memorable to the film. That's the thing about movies like this; they're a lot of fun while you're watching them but don't stay with you at all (I'm sure a year from now I'll barely remember this film). Still it's better made and more effective than something like 'PARANORMAL ACTIVITY'. Scary movie fans looking for a few scares could do a lot worse.<br><br>Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=2UY2UtXfI_w","user":"Hellmant","rank":[27,35]},{"title":"Just watched it; I'm not a professional critic but I'll give you my honest opinion.","rating":8,"date":"29 April 2012","review":"It kept me on the edge of my seat from beginning to end. I watched it with a friend who is much more sensitive and he was terrified; said he'll \"never watch a scary movie again.\" I watch a lot of horror movies and this one is a must see. It is a short film but worth every minute. It's like if you took out all of the scary moments from paranormal activity 1,2&amp;3 and just made a movie out of that footage, but this movie is still much better. In it's 80 minutes you will find the perfect blend of action, suspense, supernatural occurrences and scary images. It didn't scare me as much as the ring did but that is one of my all time favorites. The story line is original and I don't think you will be disappointed.","user":"jrdnyc","rank":[58,83]}]