[{"title":"A rare gem of a comedy these days","rating":8,"date":"28 May 2017","review":"Don't let the negative reviews put you off. I really can't understand what people have against this comedy, it is quite a breath of fresh air since comedy has changed so much in recent years and has become quite lazy. <br><br>This is a movie you really have to give a chance. These days if you find it hard to come across a new comedy movie you actually like, this movie had me laughing at more scenes than not. If you feel these days like comedy movies have lost something, like the set up of jokes and lines that are actually smart and funny then this might be the movie for you. If you like satire, sarcastic type humour that pokes fun at today's society and you are not too sensitive to swearing, you will enjoy it.<br><br>The plot is simple, but put across in heartfelt yet hysterical way. Wilson is a very blunt lonely man who has fell out of place in today's society, largely down to the fact he is a bit of a technophobe when it comes to computers and smart phones. He prefers good old fashioned human contact and he yearns for it throughout. All he wants is a regular family, which thanks to his ex wife he missed the chance on having years ago. <br><br>I'd say the movie seems to be more put towards a British audience with the style of humour, its cracks at religion and the world today and even the strong language used throughout but used intelligently. <br><br>The only reason I haven't give this movie a higher rating is due to the rather rushed ending it had. Otherwise I'd have given it a ten.","user":"kieranmtwilliamson","rank":[60,74]},{"title":"A great surprise. Which should make you think.","rating":9,"date":"14 October 2017","review":"Before i decided to watch this movie i read some IMDb reviews. It was a mixed bunch and i wanted to see it because i believed in the positive ones. Now that i have seen it, i can say they were totally right.<br><br>Wilson is the story of an ordinary man who doesn't really want to take part in our modern society, mainly because of technology taking away social interactions. The movie does well in showing us the perverted lifestyle we developed because of technologies and capitalism. It made me think about these topics a lot and even affected me personally.I shed quiet a lot of tears, i was cought off guard by the movie and that is something i do not experience a lot.<br><br>I would not describe this movie as a pure comedy, for me it is like 60% Drama and 40% comedy. In my opinion Wilson deserves a way higher rating.","user":"bloodworia","rank":[21,26]},{"title":"It's Wilson's world. We're just living in it.","rating":8,"date":"2 April 2017","review":"In 1944, legendary Hollywood producer Daryl F. Zanuck made a movie called \"Wilson\", a biopic about our highly educated, dignified and visionary 28th President – and the film went on to win the Academy Award for Best Picture. 2017's \"Wilson\" (R, 1:34) is NOT a remake of that film. Not even a little. The more recent \"Wilson\" is also not a spin-off of \"Cast Away\". The title character in 2017's \"Wilson\" doesn't have any of the qualities of that President who led us through World War I and who established the forerunner of the United Nations (except maybe for honesty). And this Wilson has much more personality that Tom Hanks' famous volleyball buddy. This Wilson is more like a less volatile cousin of Michael Douglas' character in 1993's \"Falling Down\" and is like a half-brother to Bill Murray's character in 2014's \"St. Vincent\". But, notwithstanding those cinematic comparisons, \"Wilson\", as portrayed by Woody Harrelson, is an original and unique character and one who I wish I could be like sometimes.<br><br>Wilson is a lonely middle-aged man with a lot of faults, but he doesn't mean any harm. Wilson is honest to a fault. He's impulsive to a fault. He's even empathetic to well, you get the point. You see, it's Wilson's world and we're just living in it. He'll stop a stranger walking her dog, talk only to the dog – in a cutesy animal voice – and then act confused when the woman yanks her dog away and looks at Wilson like he's a weirdo. Wilson will ride a virtually empty train, sit right next to a businessman wearing earbuds, interrogate him about his life and not feel the least bit uncomfortable when the man forcefully asks Wilson to go sit somewhere else. Wilson is also the kind of person who will go visit an old friend in hopes of renewing their relationship but then change his mind and calmly tell his friend that he had forgotten what a joyless and unkind person his friend really is. But in spite of all this, the most important thing to know about Wilson is that he just wants to be loved on his own terms, of course.<br><br>One fine day, Wilson decides to go looking for his ex-wife, Pippi (Laura Dern). He remembers Pippi as basically a crack whore – and that's how he describes her to everyone he encounters who he thinks might know her. With the help of Pippi's very WASPy sister (Cheryl Hines), Wilson is able to track Pippi down to her waitress job, where she is using a different name, but is still kind of a mess. Pippi is none too happy to see Wilson – or to endure the problems that his presence causes for her at work – but she still falls right back into bed with him. That's when she reveals that she had Wilson's baby sixteen years before and put her up for adoption. Wilson is beyond excited that he's a father and talks Pippi into coming with him to find their daughter, a surly, heavy-set girl named Claire (Isabella Amara). Claire lives with upper-middle-class adopted parents who neglect her but she's still not thrilled to meet and be stalked by Wilson and Pippi. Nevertheless, Wilson is thrilled to have an \"instant family\" and won't give up on Pippi or Claire. And with a man like Wilson driving this train what could possibly go wrong?? \"Wilson\" is wonderfully crude, funny and heart-felt. Wilson acts like we all wish we could act sometimes. Personally, I envy his fearlessness and his ability to be himself and not care what other people think. Of course, he's also a jerk, he knows it and he doesn't care, so that part not quite as admirable. In adapting his own innovative graphic novel of the same name, American cartoonist Daniel Clowes gives us a fully-drawn character who never really changes who he is as a person, but who still manages some growth. As directed by Craig Johnson (\"The Skeleton Twins\") and starring the versatile Harrelson, we get a fully realized character who is equal parts funny and obnoxious, but who still comes off as sympathetic. Besides the usual great work by the star, Dern gives a transformative performance and Amara shines in her most significant role to date. Margo Martindale, Mary Lynn Rajskub, Brett Gelman and (especially) Judy Greer contribute strong supporting performances. \"Wilson\" is an enjoyable foray into an uninhibited mind – and a reminder why we wouldn't really want to live that way. \"A-\"","user":"dave-mcclain","rank":[45,64]}]