[{"title":"Beautifully crafted and compelling film.","rating":9,"date":"12 June 2016","review":"I find it hard to understand how this excellent film is getting negative reviews from critics. It is like a breath of fresh air for thinking movie goers. It is a thoughtful, intelligent and highly entertaining look at Maxwell Perkins, an editor who as he said wanted to bring \"good books\" to the public. He did, bringing us the works of Fitzgerald, Hemingway and Thomas Wolfe who is the focus of the film. It gives a historical perspective of two opposites (Perkins and Wolfe) who working together create something substantial. Perkins is a strong main character with a noble moral center, beautifully underplayed by Firth. When did we last see someone acting nobly in a film? In contrast, to the larger than life and decadent Wolfe (I had no idea Wolfe was played by Jude Law, until after the film) Law immerses himself in the character. The fact that this is a true story makes it all the more compelling. My fifteen year old daughter who is well versed in the writings of both Fitzgerald and Hemingway encouraged me to see Genius. We both walked away exhilarated; the way you feel after seeing a really good movie that transported you somewhere else. The Director, writer, actors and composer/ scorer all did a first rate job to help bring a to bring a great film to the public.","user":"varistaylor","rank":[110,127]},{"title":"A Movie That Deserves Better Reviews - Acting is Tops!","rating":7,"date":"6 July 2016","review":"Director Michael Grandage's movie Genius about the relationship between legendary Scribners editor Maxwell Perkins and flamboyant author Thomas Wolfe has received generally tepid reviews. I for one am delighted an editor is finally receiving some screen time! Wolfe was an author whose moods, enthusiasms, and output were not easily corralled, even by someone with Perkins's experience. After all, he'd brought works to the public from other outsized personalities and authors with personal difficulties—notably Ernest Hemingway and F. Scott Fitzgerald.<br><br>It's easy to imagine the slammed door that would greet an author today who showed up with a 5,000-page manuscript as Wolfe did with his second book, Of Time and the River. The challenging task of turning this into a readable manuscript epitomizes the editor's dilemma, as Perkins puts it, \"Are we really making books better, or just making them different?\" Getting 5,000 pages down to a still-hefty 900 made it different, all right. And better, at least in the sense of more likely to be read, too.<br><br>Colin Firth, as Perkins, keeps his hat on during almost the entirety of the movie, symbolic perhaps of how his character tried to keep a lid on his difficult author. Jude Law as Wolfe is by turns outrageous, contrite, drunk, and sentimental. Pretty much like the novels, actually. His performance is consistent and always interesting. He shows Wolfe as a man with a lot of words bottled up inside him who couldn't always control the way they poured out.<br><br>It's odd to see an all-British and Australian cast playing so many titans of American literary history, including Perkins and Wolfe, Guy Pearce as Fitzgerald, and Dominic West as Hemingway. (The Hemingway scene necessitated an ending credit for \"marlin fabricator.\") The women in the lives of the protagonists are Laura Linney as Mrs. Perkins, perfect as always, and Nicole Kidman, who believably portrays the obsessed Mrs. Bernstein. She's left her husband to cultivate and promote the much younger Wolfe and is not lacking a flair for the dramatic herself.<br><br>The movie is based on the National Book Award-winning Perkins biography by A. Scott Berg, transformed into a screenplay by John Logan. New Yorker critic Richard Brody dings the script for its departures from the detailed and more richly peopled original, including the book's fuller explanation for the rupture between Wolfe and Scribners. While I disagree with some critiques of the filmed story, Brody says a lawsuit and Wolfe's unsavory political views played a part, and leaving the latter out seems a mistake. A fuller exploration of the break-up could have put some meat on the bones.<br><br>Portraying in cinema an intrinsically intellectual and abstract enterprise is difficult (The Man Who Knew Infinity struggled with the same challenge.) Like me, reviewer Glenn Kenny at Roger Ebert.com apparently had not read the book, so did not have Brody's reservations. Kenny found \"the exchanges between editor and author exhilarating. Logan's script . . . is invested in the craft of words like few other movies nowadays, even those ostensibly about writers.\" Wolfe blasted onto the American literary scene like a runaway train and left it before he could accomplish a judicious application of the brakes. Yet, he eventually realized who'd kept him on track, as his moving deathbed letter attests.","user":"vsks","rank":[49,61]},{"title":"Beautifully filmed and acted; compelling and touching look at the relationship between a larger than life writer and his editor","rating":10,"date":"13 June 2016","review":"I, like other reviewers here, cannot understand why this movie has not received greater praise. I had already read some negative reviews but wanted to see the movie regardless, because of the strong cast and subject matter. I wound up entranced by this well-written, wonderfully acted film. Compelling throughout and a truly touching ending. Perhaps most of today's critics can only get excited by superhero movies. For anyone who loves great acting and a rare look into the creative process that is involved in producing great literature, this is a must see movie. Jude Law was spectacular and very moving in his role as Thomas Wolfe, as was Colin Firth as Scribner's editor Max Perkins. Kudos also to Laura Linney and Nicole Kidman. I loved it!","user":"sdlv","rank":[74,95]}]