[{"title":"Thoughtful and prescient","rating":8,"date":"15 July 2017","review":"I was lucky enough to see this film on the big screen during the brief period that it played locally. I didn't know any more about it than the basic subject, and I'm glad about that, because the film got some strangely negative reviews in the U.S. Some critics seemed to complain that it wasn't a Jason-Bourne-style thriller. Instead, it's a careful portrait of one man, and shows how both he and his village were changed by political events in their country. <br><br>I was surprised to find out the movie was originally released in Germany in 2015, because it included so many events that are happening in 2017 America: left-vs-right street violence, religious intolerance, disagreements about which party represents workers, and government officials who think torture is the best way to get the truth. <br><br>The photography is beautiful and the storytelling clear but unusual. For example, an explosion is shown from a far-off POV, as a small part of a beautiful landscape shot, instead of up close to the blast. The production design is thoroughly convincing (though I may not be a perfect judge of the authenticity of period films set in Germany), and the settings are lifelike. When a character swims in a lake, it reminds you of just what that feels like. The violence works that way, too. Though it's not gruesomely detailed and exposed in a Tarantino kind of way, you'll probably feel it more. <br><br>The acting is excellent overall. The leading actor comes across as more babyfaced and less worldly than the real Georg Elser, just judging by their respective looks, but he creates a memorable character that is never a stereotype, yet is not merely a movie eccentric. Though the brutality of the Nazis' actions is never toned down, there are still moments when some of them display a believably human sense of doubt. A minor character has his own complete arc, from downtrodden village man to local Nazi leader to someone unsure if the party has gone too far. I completely disagree with one reviewer who thought the movie was too sentimental. It doesn't lionize even its main protagonist, and shows the problematic aspects of his violent political act.<br><br>Afterward, I read about the real Georg Elser, and I was disappointed at a few of the fictional changes. I was sorry they cut out the character of Georg's sister Maria, who seems to have been important in real life, and since everything is seen through Georg's eyes, and he has limited knowledge, and we don't hear about some of the other people the Nazis persecuted and even murdered after the bombing. But you can read about this. I never would have known the story was worth investigating further if I hadn't seen this compelling film.","user":"claudecat","rank":[21,21]},{"title":"Working class hero","rating":8,"date":"1 March 2015","review":"Unlike so many subsidised movies about the Nazi era, this one isn't superficial and moralistic. Instead it tries to, and succeeds in, painting an authentic portrait of the prewar Nazi era in a village in rural Germany. Most of all, the movie is captivating. We get under the skin of this idiosyncratic carpenter who missed changing world history, and possibly saving tens of millions of lives, by a margin of just 13 minutes.<br><br>The movie stands of as one of the few who manage to depict what it could have been like to live under the Nazi dictatorship. What would you do if one of your friends was sent off to do forced labour, or another one was pilloried for her supposedly immoral behaviour. As the benefactors of a free society, we would like to think that we would stand up against such injustice. This movie conveys how difficult, how impossible it was to be decent under the Nazi yoke. It goes much to Georg Elser's credit that he tried to do the impossible nevertheless.","user":"Karl Self","rank":[60,69]},{"title":"Intense war drama about a man whose story has been little-told","rating":9,"date":"19 June 2015","review":"Oliver Hirschbiegel directed the celebrated war drama Downfall (2004) about the last week in the life of Adolf Hitler. With his new movie 13 Minutes, he returns to the subject of life in Nazi Germany but this time events are set mainly in the years leading up to the war. More specifically it focuses on a man who tried unsuccessfully to kill Hitler in the early months of a conflict that would go on to claim 55 million lives. The man is Georg Elser, who was a carpenter who was unaffiliated with any political party. He worked alone and set up a bomb that was set to go off in a beer hall where Hitler had a scheduled meeting. The film's title comes from the fact that the assassination attempt was ultimately unsuccessful, given that the Fuhrer left the target location thirteen minutes ahead of schedule. Oddly, Elser is a man who is little known. This is especially strange when you consider how well known the later assassination attempt on Hitler by Claus von Stauffenberg is. Elser by contrast seems to have been marginalised by history, which is why this film is so welcome as this is a man who deserves to have his story celebrated. Aside from a few intimate conversations and moments, the details contained in this film are based on historical accounts.<br><br>The structure of the story is told from the point that Elser is caught just after the bombing. From here he is interrogated by the Nazis and the story flashes back in sections so that we see how this musician/carpenter came to ultimately undertake his dangerous act. In taking this approach, the film is able to not only tell a historical drama but to also look at Nazi Germany in the years leading up to the war, specifically life in the countryside. Life in German rural villages always seems somewhat idyllic as was exploited by the Heimat films of the time and so it is especially jarring to see life continue in such a place but with an ever increasing Nazi presence, initially shown by the presence of small groups of brown shirts through to large swastika flags draped all over town leading ultimately to active persecution of citizens. People undesirable to the Nazis are taken away or pilloried by the authorities and the people of the village feel powerless to do anything about it. The film considers just how hard it was to actually go counter to the Nazi system at the time, seeing that all aspects of life were geared against disobedience to the Nazi state.<br><br>13 Minutes is a very good film because it combines a little know but important story with a setting in Nazi Germany rarely focused on. The performances are universally excellent and the overall authenticity is impressive. This extends to some disturbing torture scenes which feature actual Nazi interrogation methods. It's, therefore, a fairly intense film but one that surprisingly finds new things to tell us about a period in history which has had so many cinematic treatments and documentaries. It should go some way to elevate Elser himself more into the public consciousness and ensure his actions are never forgotten.","user":"Red-Barracuda","rank":[46,53]}]