[{"title":"Alice in Murderland is Terror-ble","rating":1,"date":"12 February 2011","review":"There hasn't been many movies I wanted to see at the multiplex lately so I am forced to watched movies at home. The latest being Alice in Murderland, with an intriguing title, and hopes that it would be reminiscent of the old PC game: American McGee's Alice. Those hopes were completely crushed right after those two seconds when I pressed PLAY on my remote.<br><br>The opening of the movie starts with some woman who reveals herself to be Alice's mother looking into buying a house. The woman selling her the house looks, well, like some biker chick. She doesn't seem too friendly with her even though Alice's mother has this wholesome joy to her as if she is always happy. Then the biker chick says, \"Go down in the basement. There's a surprise.\" I was expecting to see a finished basement, but instead, it's some killer in a cloak beating her with an ax thus bringing us years later to see Alice.<br><br>We are first introduced to Alice being completely zoned out and babbling on how her mother was killed. Then we are greeted to some of the most banal dialogue like: ALICE: \"I was just thinking about my mother. She died when she was 21 and I turn 21 this Saturday.\" Then we are introduced to the characters in this movie, and THERE IS NO ONE TO CARE ABOUT! I was hoping they would all die. There's even this gay teacher who is one of the girl's uncle that's only there to serve to make the audience question if he's the killer or not; otherwise he's just forgotten.<br><br>The whole plot point is that it's Alice's birthday and they all want to go to the Glass House (Looking Glass, get it?) to dress up as Alice in Wonderland characters. What's the purpose of this? Not even the writers know as there is nothing but cat fighting, pointless dialogue, and getting high. I can't really fault them on the idea, though, as I had Harry Potter parties myself. Yeah.<br><br>So basically it's a slasher film as each of these nasty group of characters gets offed one by one. Now since we the audience has been spoiled by memorable deaths over the years, how did the deaths in this one stack up? Not one single memorable death. Sure, the killer would change it up from a knife to an ax every now and then, but they are mostly forgettable. I will say that they are pretty funny when it happens. After one swing, they turn into bloody messes. There's even one scene where after one knife strike, the victim's innards fall out. I half-expected Machete to use it as a grappling hook.<br><br>In the end, there's a really dumb twist on who the killer is (who spends a few scenes dressed up in a ridiculous looking Jabberwockey costume) and a shockingly stupid ending. This film is made by Brain Damage Films, which must really explain the writing in this mess.","user":"Fields201","rank":[43,55]},{"title":"Curiouser and Curiouser...and really BAD.","rating":2,"date":"28 April 2011","review":"So much to hate...so little time.<br><br>To be fair...I did like something about the film...the opening credits. Somewhat stylish and well done. Who knew that it would be the high point of the movie? Also...there are also a couple of people in this movie that have acting potential. Unfortunately, even the better actors in this film probably still need to keep going to acting class before they should be allowed in a movie.<br><br>As the movie progresses the acting reaches new, lame lows. The over-acting gets really unbearable at times.<br><br>And the plot?!? This has to be some sort of a bad joke.<br><br>A girl chooses to celebrate her 21st birthday at the same location where her mother was slaughtered on her own 21st birthday. Sounds credible to me.<br><br>Right off the bat, the movie says \"based on a true story.\" Uh huh. Sure it was. It could have been worse, I suppose...they could have filmed this 'true story' with an unsteady hand-held camera.<br><br>As for the murders, the gore is a bit silly. One man spills his guts out after a single stab. In one especially banal, non-murder scene, a girl gets her butt cheeks glued to a toilet seat, but manages to rip herself free, with the help of someone's GAY UNCLE (they only mention the character is gay 72 times).<br><br>The really scary part is the special effects person wanted to be identified in the credits. Why? Who would hire somebody so untalented? We learn who the killers are way too soon and with virtually no dramatic tension. And then the convoluted ending just seems like a parody of a horror film. I mean...gee...what could be scarier than the heroine becoming insane, eh? This is the type of flick that fast forward controls were created for.<br><br>As for the folks who gave it a 10....I hope you at least collected some decent money for being part of the production.","user":"scootmandutoo","rank":[18,21]},{"title":"No Redeeming Qualities","rating":1,"date":"13 June 2011","review":"With an eye-catching title, Alice in Murderland does little (if anything) to keep its audience interested for the long haul. Written and directed by Dennis Devine (Demon Kiss), Alice in Murderland opens with the introduction of Alice's mother who is murdered while house-hunting.<br><br>Skip ahead to present day and we meet Alice, the cute and adorable Malerie Grady. Alice has a birthday coming up and her good-looking girlfriends decide to throw her a theme party – an Alice in Wonderland themed party. At the party, the guests will be given costumes that represent characters from the 1865 novel by Charles Lutwidge Dodgson.<br><br>Lucky for us, all the costumes are sexy pieces of fabric that would look right at home on any stripper stage this side of Montreal. What should be even luckier for the male geek in all of us is the fact that no members of the opposite sex are invited to the party. So if you take out the male owner of the party establishment who comes dressed as the Mad Hatter, you are left with a wet dream of a bunch of party girls dressed as stripper Tweedle-Dumb and Dee, the Red Queen and others.<br><br>But uh-oh, the Jabberwocky is also running through the halls of the building, and he/she/it is intent on leaving a trail of dead rabbit-hole characters in his wake.<br><br>What sounds like an interesting premise in the mold of some of the better horror films of the early 80's, Alice in Murderland falls flat – very flat – in overall execution.<br><br>I can assert that the blame cannot be placed on the shoulders of the cast. Each of the cast that include names you have never heard of or are likely to hear again, do an admirable job in individual emoting. But the script hardly allows anyone to exploit their inner-actor. Instead, we get mundane situations and even a fight between two girls that is as unbelievable and poorly shot as any in recent memory.<br><br>Director Dennis Devine must either have hired all family and friends for the film or he found religion somewhere along the road to the distribution as there is no nudity in a movie that screams for some titty. Even a shower scene neglects to show anything below a neckline and therefore the movie fails to titillate while failing to do just about everything else.<br><br>So characters end up living or dying and there is a stupid subplot of a rift between the girls that allows for the stereotypical separation of the pack. But pleeeeease! You want us to believe that these girls are actually friends, that they have a party for Alice at the same residence to which her mother was killed years ago (that's right folks) and that a killer wearing a Jabberwocky outfit is sneaking up on them and chopping them all to bits. Sorry. But not in my fairy tale! All this made Alice in Murderland a terrible film experience. We give it a half star for not using CGI blood, but that's about it. There is no wonder, mystery and hardly any tense-ful danger in Murderland and you should stay clear of this dud.<br><br>www.killerreviews.com","user":"gregsrants","rank":[28,38]}]