[{"title":"People are far too critical of this film","rating":7,"date":"19 October 2012","review":"This is a good film. People have complained heavily about the lack of character explanation, which I do realise is conventionally the basis to any decent story, BUT I feel this film is due credit for its unconventional approach in editing, filming and character placement.<br><br>I watch a lot of horrors, searching for anything that doesn't hit upon cliché after cliché and I thoroughly enjoyed this film. It wasn't a typical 'in your face' horror, but was tense, creepy and unpredictable until the twist. Despite not being completely original in overall plot, I can easily imagine its approach to film making leaving a legacy for future filmmakers. <br><br>The camera work was clever, the acting good and overall experience was enjoyable. It was a complete mind f*ck of a film until the twist. That's how I like my films. So thumbs up all round.<br><br>Definitely would recommend this to anyone that can appreciate the fact that a film can be scary without ridiculous amount of blood, gore and stereotypical characters. <br><br>Anyway, Enjoy fellow film lovers!","user":"laurencecarpenter90","rank":[57,68]},{"title":"very nice indeed","rating":9,"date":"7 June 2013","review":"The is only my second review on IMDb but I feel it's important to offset the unduly negative reviews here. I read the reviews beforehand and was put off watching but was actually amazed at how good the film actually is. The film is superior in every way to Open Water, which is also a very good film. I feel a bit for the directors, having made such an obviously great horror film, only to not have it recognised as such. The main actor is extremely good at her job. I have seen virtually every 'woman in peril' movie but the fear experienced by her character is utterly palpable and convincing. The fear of having killer strangers in your house is done better in this film than ANY OTHER film I have watched. Far from the 'real time' aspect not working, it actually works brilliantly and is done extremely well. <br><br>PS. and no, I'm nothing to do with cast or makers of this film!! I just like watching good horror films and this is without a doubt a very good horror film.","user":"cashman-211-974435","rank":[40,51]},{"title":"Good one","rating":7,"date":"30 March 2012","review":"Directors Chris Kentis and Laura Lau give us a story about a young woman, Sarah, who is sealed inside her family's secluded lake house. With no way out, events become terrifying. The direction was fine and all of the suspense points seem to be there, albeit a bit predictable. I'm not sure who to credit whenever there is two, sometimes three, directors on board.<br><br>The cast had fine actors involved including Adam Trese, Elizabeth Olsen, Eric Sheffer Stevens, Julia Taylor Ross. Elizabeth Olsen did a good job and it doesn't hurt that she is nice to look at. <br><br>Interesting camera work on this movie. There seems to be a lot of static shots, that work most of the time. I'm sure that these are choices that the director (s) made and I applaud them for making choices and sticking to them.<br><br>This is a story based on a concept that is not very original, but what is important is the execution.<br><br>Would I recommend it? I'm not sure if this is for everyone. Some may pick it apart just a little too much. For my, I enjoyed it for what it was.","user":"TopekaLass","rank":[34,46]}]