[{"title":"A fitting, funny, sentimental and insightful chronicle of an iconic band.","rating":10,"date":"30 July 2016","review":"I just saw this at Melbourne International Film Festival in my home town, and It completely lived up to my expectations. I am a big Stooges fan and first heard of this documentary collaboration between Iggy Pop and Director Jim Jarmusch a few years back and could not wait to see it. As a fan of the band and some of the Director's work, they are the perfect marriage to tell this tale. The documentary, told by most of the band themselves but primarily Iggy, covers the bands early inception and up to the 2003 reunion. Iggy is a fascinating interview subject, as are all The Stooges that offer insight,wit and humour in recreating the journey they shared. There is a definite brotherhood between these guys, that was at times as destructive as it was touching. The tributes paid to the fallen Stooges are moving in its unique way, and the documentary as a whole really captures the lasting impact this band has had on music and their influence they have left in their wake. Any fan of this incredible band, that were a statement that pre-dated punk and shocked so many at the time, will love this film. If you aren't a fan, then it also serves as a very entertaining document on a band that are unmistakable in their impact,the fascinating characters and is a chronicle of a turbulent time in music and the world that The Stooges so brilliantly encapsulated in their sound.","user":"jc-ee-79","rank":[26,29]},{"title":"Intelligent Tribute to a Great Band","rating":8,"date":"8 November 2016","review":"If you're expecting another quirky, brooding Jim Jarmusch film, or even that Jarmusch signature here and there, you will be disappointed. Gimme Danger is still a great film, but Jarmusch doesn't do what he usually does - show that the conventional can be really far out if you excavate a little - because he gets that Iggy and the Stooges are already supremely avante-garde; they are already Jim Jarmuschy. So Jarmusch does the opposite - he brings that down to earth, and just showcases what's already naturally there rather than try to create something. Still, documentary filmmaking turns out to be well suited for at least a couple of Jarmusch creative sensibilities. There's a charming, amiable leading man (Iggy), and when Iggy speaks there's a subtly comedic element, and subtle comedy is essential in all Jarmusch films. When Iggy tells the story of contacting Moe Howard of The Three Stooges, there's no need for direction with a magic touch. Just let it be.<br><br>Ultimately, Jarmusch forgoes being a director with a Jarmusch vision in Gimme Danger other than maybe hoping to convince the viewer to believe, after watching this film, that Iggy and the Stooges are the greatest rock and roll band of all time. He made Gimme Danger as a fan more than as Jim Jarmusch the auteur director, and it ends up being a \"normal\" kind of rock and roll doc/tribute, with plenty of great music and great footage, history, and lots of interviewing.<br><br>So to repeat, don't expect Gimme Danger to be a typical Jim Jarmusch film. But if you expect it to be a loving and intelligent tribute to a rock and roll band that \"reinvented music as we know it\" according to their former manager, a band that wiped out the 60s according to Iggy, you won't be disappointed.","user":"LeonardHaid","rank":[10,11]},{"title":"They had me at Jim Jarmusch. Even more at Iggy Pop. The Stooges to boot? Holy moley.","rating":9,"date":"5 November 2016","review":"Having read (re-read actually) 'Please Kill Me\", and having read a lot about Iggy Pop and the Stooges over the years, I didn't expect I'd maybe learn too much about them from this doc. Little did I know not only I would, but that I would be laughing much of the way (the story where Ron Asheton asks Moe Howard's permission to use the name 'Stoooges' kills, but not as much as Iggy's dead serious response when he is told he *willl* play Peter Pan on Broadway by David Bowie's seemingly scummy manager). <br><br>It's also at times dark, at times harrowing, and the most welcome thing to me is how Jarmusch starts with the Stooges at their (first) end in 1973, when they were broke, Iggy was missing gigs and often showing up so wasted on heroin he could \"sometimes sing, sometimes not\", and it changes up how we usually see these kind of rock documentaries. It often will start with the adulatory remarks. Here, Iggy Pop in the 1973 footage looks like he's about ready to puke all over himself... while stage diving... while probably slathering himself with some substance of unknown origin... maybe genitals out too, who knows(!)<br><br>This was an entirely fearless band, and they created art simply by virtue of only doing what *they* liked. F*** popular taste. Hell, if one follows Pop by his word (and how can you not?) there were many, many manufactured acts (Including CSNY? please not them) and that if nothing else the Stooges acted as a counterpoint to so much of what was going on in the late 60's and early 70's while being one of the hardest bands of the era. Jarmusch does an excellent job of showing us through Pop, the late Scott Asheton and other interviews, plus plenty of stock footage and, not unlike Julien Temple with Filth &amp; the Fury, clips from old shows, movies and other rock acts (Soupy Sayles being one of them of course) that make joke of what we're seeing, or at least reference.<br><br>Even as someone who thought he knew the Stooges, or at least Iggy Pop (real name Jim Osterberg), this gives as full a picture as you can get while, at the very end, showing us just how massive an influence they had. Think about it: they couldn't play (at first anyway, they got better as they went), and yet they changed things simply by the force of what rock and roll could do and has done when it's at its most pure. The film reflects the aggression, the commitment to absurdity, and Pop's own madness in performance, which was an act depending on the night (or it was all of a piece).<br><br>FUN! And I never thought I'd see (or think about) the day when a Jim Jarmusch movie had animated sequences. Bonus!","user":"Quinoa1984","rank":[9,10]}]