[{"title":"Excellent for small budget film","rating":8,"date":"23 September 2011","review":"Better researched and more authentic than the first couple F&amp;F movies, just less action. <br><br>I don't know where I found this movie, but I was expecting it to be terrible after reading the summary, yet it was surprisingly good. The acting was better than you get from half of the big studio releases lately, and despite the made-for-TV feel, and fairly predictable story, it all came together well didn't feel hokey or anything.<br><br>Even someone who knows a lot about cars can enjoy it because they apparently had some tech people involved who weren't idiots.<br><br>I gave it an 8 because it was way better than any attempt in this genre with a limited budget.","user":"SeanDean","rank":[42,54]},{"title":"Great Movie but already done","rating":9,"date":"23 September 2011","review":"I saw this movie on the cable video store and it caught my eye. I'm a car guy and have seen the Fast &amp; Furious franchise movies amongst others. The movie starts off like F&amp;F movie, in particular Tokyo Drift, with the LA Street Race scene. The kid ruins his life and makes a turn around, I'll leave it at that and you can get more from the synopsis.<br><br>What makes this movie great is they do use a mixture of Domestic and Import cars. The opening credits have one race with a late model mustang and late model Monte Carlo, which then has your imports. There are more scenes like that including a new 5.0, the last generation camaro, and some oldies, including a street race with a Belair and a Grand National. This Definitely something that does stand out from the other movies by not having just imports or having one single American muscle car.<br><br>Also another plus is the final scenes of the movie take place at the race strip, which in my opinion and through out this movie, is trying to get the underlying message that knuckleheads need to start taking this race scene back to the track instead of the streets.<br><br>Another point which no one has pointed out is the use of the 2011 Mustang in this movie. Older car buffs might see this. 20 yrs ago the, the competition was the Late Model 5.0 and the Buick Grand National, which are seen in this movie. The director does show that this rival lives on with the new 5.0 Mustang and now with the WRX Subaru. Just a little something to note, nothing to write home about. <br><br>Overall this movie is definitely worth renting or buying whether your a fan of the illegal race scene or fan of the F&amp;F franchise. The movie holds its own and is not a let down like the Asylum movies \"Street Racer\" and \"200 MPH\"","user":"Slow-0","rank":[26,32]},{"title":"Born to race, but does it get a podium finish?","rating":7,"date":"7 May 2012","review":"Ever since the mainstream success of 2001's \"The Fast and the Furious\", street racing movies have been a recurring subject for big and small film studios alike. Despite the relative popularity of movies in this vein, they tend to draw the ire of \"gearheads\" (or petrolheads, for those across the pond) due to their questionable representation of cars, car culture, racing, and automotive technology. Whether it be nonsensical techno-babble, or impossible-to-reconcile vehicle physics, there tends to be a deluge of blind idiot errors or silly oversights that annoy those of us whose hearts pump synthetic oil rather than blood.<br><br>No movie is wholly immune to such things, but thankfully, \"Born to Race\" averts the aforementioned TFATF-esque ludicrousness. The research has clearly been done when it comes to the techno-babble strewn throughout the film. Moreover, car culture and drag racing is more or less accurately represented where other movies fall flat. The American muscle cars shown aren't the typical triumvirate of Mustang, Camaro, and Charger/Challenger (though these are certainly featured within). A Buick Grand National plays a significant role in the film, and is a recurring sight throughout, and there are scenes exhibiting an Oldsmobile 442, Chevrolet Bel Air and Nova, and even the Lil' Red Express 1979 Dodge D150 drag truck. In summation, the cars, car jargon, and car culture has a greater, more accurate representation than most Hollywood racer films.<br><br>The other large failing of many street racing-genre films is the catastrophically canned acting the leads and support dole out. While the script is nothing short of generic high school hero stuff, the acting is of an unusually high caliber. Lead Joseph Cross, of \"Running With Scissors\" fame, delivers a solid, if slightly weedy performance, and the big bad bully, played by Brando Eaton, does well with what he's given to work with. My personal favorite character, the father of the protagonist, played by veteran John Pyper-Ferguson, puts forth an excellent effort, managing to be lovable, despicable, and humorous all at once.<br><br>Where other street racer movies are a complete mess of poor acting and Wikipedia knowledge, Born to Race manages a solid cinema experience for a fraction of the cost of the big boys. I would recommend this film to any street racing/drag racing aficionados, as well as anyone who likes a decent high school hero drama-type story.","user":"dan_miller888","rank":[11,13]}]