[{"title":"A rare worthy entry into teen Dramedy genre","rating":8,"date":"15 August 2013","review":"Greetings again from the darkness. Coming-of-age teen dramas with a comedic flair that speak to that tumultuous period of life are rarely worthy of discussion. The exceptions hover film greatness: Rebel Without a Cause, Fast Times at Ridgemont High, Dazed and Confused, The Breakfast Club, and Say Anything ... Along comes young director James Ponsoldt and his adaptation of Tim Tharp's novel. While not perfect and falling just short of the level of those classics, it is nonetheless a welcome addition and quite interesting.<br><br>It's tempting to call Sutter (played by up-and-comer Miles Teller) a happy-go-lucky kid. He's the frat boy type - quick with a quip, smooth with the parents and girls, and the envy of the masses. That term would be misapplied to a kid who not only is never without his flask, but also gives them as gifts. He uses his wit and booze to dull the pain of his aimless existence. We see his lackadaisical efforts at completing a college admission form, and it's used as a plot device to track Sutter's progression through the film.<br><br>Brie Larson is terrific as Sutter's perfect match ... right up until she decides that his philosophy of living in the now (even spectacularly) doesn't leave hope for much of a future. After an extreme night of drinking and partying, Sutter gets awakened while laying in a neighbor's front yard. Shailene Woodley (The Descendants) is Aimee Finicky who recognizes the popular Sutter, even though he has no idea who she is. Slowly, the two connect on a level previously unknown to either ... some good, some not so wise (just like real teenagers).<br><br>This couple of opposites learn much from each other, and soon enough, Sutter is confronting his long last father (Kyle Chandler). No real surprises what he discovers, but it's a life lesson that must be learned. Sutter seeks more from his remaining family - a big sister (Mary Elizabeth Winstead) who escaped the grind, and a workaholic mom (Jennifer Jason Leigh) doing her best to provide hope for Sutter.<br><br>The script is co-written by Scott Neustadter and Michael Weber who also wrote (500) Days of Summer. John Hughes and Cameron Crowe proved they could present teen dilemmas in an entertaining way, and this one follows the same structure. This is a dialogue-heavy story as Sutter and Aimee struggle alone and together to figure out life's next steps.<br><br>I will say that for the first few minutes of the movie, I found Sutter to be the kind of guy that I would typically have no interest in. Tip of the cap to the filmmakers and Miles Teller for turning that around. It should also be noted that Shailene Woodley is so naturally affecting, that her character never comes across as anything but sincere. Given the state of today's mainstream coming of age stories, this one definitely deserves a look and could gather some attention come awards time.","user":"ferguson-6","rank":[107,129]},{"title":"Spectacular Moments, But Also Flawed","rating":6,"date":"22 September 2013","review":"The Spectacular Now is a film with great potential that is ultimately unfulfilled. The acting is excellent, especially Shailene Woodley's performance as Aimee, and there are moments that are truly exceptional. The scene where Sutter (played by Miles Teller) and Aimee are throwing newspapers together shortly after meeting feels genuine and provides a believable premise for how these two very different people begin to develop a bond. And the lovemaking scene between them is a wonderfully genuine and poignant depiction of the awkward but tender side of teenage sexuality, free from the typical gratuitous nudity or crude jokes.<br><br>The film has major shortcomings, though. Too much is told rather than being shown, and Sutter's character never really seems to grow. We are told at the end of the film as he is rewriting his college essay that he now suddenly gets it all and intends to change, but he also quits his job because he can't promise not to come to work \"loaded\" and crashes his car into his own mailbox while driving drunk shortly before he has this supposed breakthrough. The scene where his mother is telling him how different he is from his father and how he has such a big heart would ring a lot truer if we had seen some of this heart during the preceding 90 minutes of the film. Instead, we are left with his mother telling us at the end of the film about the kind and generous things he did in the third grade instead of being able to witness any sort of similar kindness and generosity in Sutter's behavior. It would take a miraculous leap for the viewer to believe Sutter has really changed to any material extent when he shows up at Aimee's college at the end of the film.<br><br>Shailene Woodley's Aimee is genuine and lovable, but the viewer can't help but feel she is being sucked into Sutter's destructive and self-centered world and worry for her for the consequences. Aimee's mother supposedly wants to hold her back from leaving home and going to college, even though we never meet this mother and never see the dynamic of this relationship. Perhaps the one arguably positive thing Sutter does for Aimee in the entire story is to encourage her to stand up to her mother about going to college and pursuing her own life, but again, we never see any of this transpire and are only told what happens.<br><br>There were several lost opportunities in the film to show the audience growth in Sutter's character that would have been much more effective than his telling us in his essay. If the filmmakers really want the audience to believe Sutter has learned something and grown in a meaningful way, some indication that he had acknowledged and was prepared to address his alcoholism is critical. And if we are to believe that he actually loves Aimee, and not just that she is his next best girlfriend option for now after being dumped by Cassidy, we needed to see him demonstrate that love by something more than just giving her a hip flask or showing up at her college at the end. <br><br>Overall, the film is not an unpleasant experience, and the performances are quite good, but one can't help but feel there was a lost opportunity here for this film to be much more than it is.","user":"dirtesq","rank":[42,51]},{"title":"Finally a good teen movie","rating":8,"date":"6 January 2014","review":"I wanted to see this film to soothe my wife. She usually loves adolescent romance stuff, so I thought I would suffer through it. Instead, I ended up liking it more than she did.<br><br>The thing about romance films and adolescence films in particular is that the kids are presented like complete idiots, like aliens from the planet Dumb. In order to keep up with this superficial image all other characters must act the same. The result is a complete fake.<br><br>The Spectacular Now is nothing like that. From the start it portrays teens as complex, intelligent, troubled about their past and their future, maybe laid back alcoholics or chronically shy or overachievers with low self esteem. And they all interact like human beings. It's a joy to see a film like this.<br><br>I also loved that they didn't use the cheap tricks of romance movies in general. No evil adversary to define the character as good, no ultimate goal to direct the entire film from point A to point B, no artificial accidents or catastrophes to move people out of their stupor, no highschool cliques, no Facebook or Twitter dramas. Instead, normal people doing normal stuff, trying to get over themselves and have a happy life.<br><br>The film was not without its flaws. It was a little too slow, for once. It only lasted an hour and a half but it felt like more. Also there is a somewhat seamless jump of a few years that takes the viewer by surprise (I still don't know when it happened). Also, I am a bit grumpy today, the film probably deserved a 9. Go watch it!","user":"siderite","rank":[49,61]}]