[{"title":"was that it?","rating":4,"date":"7 December 2011","review":"After having had a sneak-preview of Mercenaries, i must admit it just wasn't very good, even for a Balkaneze guy like me. <br><br>The plot seems rushed, the actors are mediocre at best, and there just isn't any substance to get you hooked on the story. The only character you can sympathize a little with, is Andy Marlow(played by Robert Fucilla). Along with Kirsty Mitchell, they did a decent job acting.<br><br>But having watched it, i was like \"was that it?\", and i started wondering if it was worth the time in the first place.<br><br>I hope somebody out there enjoys it... <br><br>because i didn't.","user":"ILYRiCaL","rank":[38,47]},{"title":"Not up to the standards","rating":3,"date":"7 December 2011","review":"After watching so many great special forces movies, all we expect from such a movie is that it to be an action packed explosive one. with that expectation I started watching this movie and I was totally disappointed.the plot is simple, a guy takes over a country and threatens the region. so the good guys have to go and take care of it.instead of sending the army they decide to send a bunch of ex SAS mercenaries. the actors don't at all look like ex SAS soldiers. instead they look a bit too girlish to portrait such tough characters.that is enough to kill the mood. their acting isn't strong enough at all to convince the audience that this is going to be something fun to watch.even the dialogues lack the punch . instead you feel like shooting yourself for choosing to watch this. sometimes the muscle flash of the gun just blinds you.give the movie a cheap look. you see hardly any action that is normal to a movie of this kind. All i can say is that it's lacks everything a good action movie should have.<br><br>P.S. The actors in the movie don't look tough at all like the ones in the poster.","user":"rukmal1987","rank":[28,35]},{"title":"Unforgivable","rating":1,"date":"25 May 2012","review":"Rather than watching this film, I felt as if i was being subjected to it. I have seen thousands of film, both high and low budget, and I can quite honestly say this is one of the worst I have watched. The only thing more terrible than the script were the actors' performances. Although, the actors aren't fully to blame as the casting choices were the true root cause of the film's problems. Not one character was believable as having served in the SAS or any military unit, they couldn't properly hold weapons or implement any semblance of military tactics.Beside from the countless military inaccuracies; the plot was unoriginal, unbelievable and totally boring. <br><br>Avoid this movie, it is absolute rubbish!","user":"belts24","rank":[6,6]}]