[{"title":"Fails Spectacularly as a Movie","rating":3,"date":"1 November 2013","review":"When you go to a movie whose book you have read several times, You expect it to compromise the story a little. But I did not expect it to fail so spectacularly on every level.<br><br>No character development. You get no sense of who any of the characters are. <br><br>The battle game is barely in the movie. Ender gets Dragon army; He says \"training begins now\" and then it just cuts to an image of Dragon moving up the leader board. <br><br>At no point do they attempt to explain why Ender is chosen to be the commander of the entire Earth fleet. They show none of his innovations, leadership ability, and he is downright unlikable at times. Everyone moves to his lunch table because he insults Bernard in class? What? That's why people will follow him to their death? Snark?<br><br>I've known for two years that they cast an Ender that's too old but I didn't expect him to be a FOOT TALLER than Bonzo Madrid. They call Ender a Third several times but don't bother to explain what that means.<br><br>The acting is awful (especially Ender, WE DID IT!!), the dialogue is pathetic. The special effects are nothing groundbreaking. The simulator scenes are pointless as you can't follow what's going on. <br><br>Command School is \"near the bugger home world\". WHAT? How did they get there in time?? The fleet left right after the buggers did! And it's Molecular Disruption Device, not a Scorch the Surface of the Planet device.<br><br>Three stars just because it was recognizable as Ender's game","user":"darmstead01","rank":[359,566]},{"title":"Very enjoyable movie that doesn't do justice to the book","rating":8,"date":"1 November 2013","review":"As a fan of the book, I really wasn't sure I wanted to see this movie. Great books hardly ever adapt into good films. But my friend wanted to see it, so I agreed to tag along on opening night. <br><br>I have to say, as a movie, it is genuinely enjoyable. The visuals are starkly entrancing without being distracting. The casting is pitch-perfect - Harrison Ford and Asa Butterfield, in particular, do a great job. The ending is particularly well done (don't worry - it wasn't really spoiled by the trailer). <br><br>The problem is, it's really just a caricature of the book. The drama in Battle School moves too quickly, the characters of Peter and Valentine are almost completely absent, and even Ender's video game is sadly underdone. I'm not usually a fan of splitting books into multiple movies, but this is one where two films would have done it justice. Also, the kids are just too old - there's an ironic moment in the movie where two officers talk about how conscripting kids under 15 \"used to be illegal\", yet all the actors playing the kids look 15 or older!<br><br>Still, it's a fun ride, and if you hadn't read the book these flaws really wouldn't be apparent. Definitely see it in the theater if you can - the battle room scenes are best on a big screen.","user":"clark44","rank":[185,287]},{"title":"Loved the book, Severely disappointed with movie","rating":3,"date":"1 November 2013","review":"I saw the trailer for Enders Game about 6 weeks ago, its piqued my interest so I investigated and wound up reading the book. I was blown away! in 6 weeks I've read 7 of the 13 titles in the \"Enderverse\". So to say that I have been staring at a calendar waiting for this movie to be released is an understatement. Right from the beginning I was disappointed with the portrayal of Ender. His distinguishing feature is his intelligence, and the slow talking Asa Butterfield almost seemed to be concentrating on his lines and being able to deliver them in an American accent rather then speaking like one of the most intelligent 12 year old's on the planet. I understand he had big shoes to fill, Ender is one of those great characters that stay with you for the rest of your life, that being said I firmly believe they chose the wrong actor.<br><br>I don't mind that they had to change things around, I realize it had to be done, however they tried too hard to take a little bit of each section of the book and put them all together with out realizing that without enough detail the smaller samples were not realistic or convincing. Ender is supposed to become one of the greatest leaders in human history as well as winning his soldiers respect to that point where they would \"follow him to the moon without a space suite\" during his time at battle school but the movie would have you believe Ender won the allegiance of his hostile class mates by cracking a single joke!? There was no character development for Enders fellow classmates, other then Petra this movie could have been written without any of them and probably would have been better off for it.<br><br>The battle room looked fantastic. The special effects in said battle room came up a little short. Maybe because I saw the making of Enders Game, or maybe because I saw \"Gravity\" a few weeks back, but the zero G stunts were not very good. Even though that was the case the look of the transparent walls of the battle room with Earth looming in the background carried enough weight as eye candy to make me want to see all the battles that Ender winds up winning with Dragon army. Unfortunately for me and those that read the book there was only one battle, a mix between 2 of the battle from the book that came towards the end of his training. This was just too rushed, I realize you can only cover so much with a 2 hour movie but this was not the way to do it.<br><br>They quickly promote Ender to command school where he will be trained to command against the formics. They changed up part of this story and skipped over some of the deeper explanation about the ansible and sending the fleet to attack the buggers planet 50 years earlier immediately following the first invasion, but i feel this lack of detail left the following scenes less emotional then they could have been. The feeling that Ender was humanities last hope, and that the following battles would determine weather or not humanity will continue on or perish came up very short. I gave this film 3 stars pretty much based solely on the last several \"simulation\" battles. the special effect for these I thought were very cool. Enders control of the battle and being able to change perspective and zoom in and out were nice. But as was the theme for the whole movie, things were rushed, a montage was used to give the feeling that the team was being run down, Enders mentions at one point how hard him and his team are taking it having to do all these simulations over the past months. However Asa Butterfields acting didn't sell it. None of Enders soldiers really sold the feeling of being completely run down to the point where (in the book) Petra falls asleep in the middle of a battle, or Hot Soup (i think it was him) goes catatonic due to the grueling schedule. Again, these 12 years olds are supposed to be the best of the best on earth trained in a military facility to be Napoleonic commanders, but come across as a bunch or little kids having a good old time playing wii at a sleepover where they stayed up past their bed time. These kids shouldn't have been smiling at all, there should have been cold calculating looks on there faces with intelligence in there eyes and barrack talk coming out of their mouths. Anyway, the final \"test\" was visually stimulating, it did have a sense of urgency, and there was a nice boom at the end.<br><br>I could go on about several other aspects of the movie that I was disappointed with (Graff, Anderson, Dap, Mr/Mrs Wiggins, Ender/Valentine, Bonzo..... all fell short) but I won't. I truly truly do not understand any positive reviews from anyone who has read this book. I can only imagine they were as hype as I was going into and let there preconceived notions of how great this movie would be take over for the time being. 7.0 / 10.0 .... way to high. Movies aren't supposed to be better then the books, everyone knows this, but as \"The Hunger Games\" recently demonstrated, they can still be good.","user":"drhanusey","rank":[240,378]}]