[{"title":"Fathers, Sons, War, Death","rating":8,"date":"16 December 2013","review":"I was a bit shocked at how much negative press Billy Bob Thornton's latest effort has received in the mainstream critical media. It's been called racist, homophobic, grating, and stereotypically one-note. Perhaps these reviewers couldn't take the time to appreciate the delicate patina glazed onto the top of this heavy Southern Gothic brew, not only by some stellar star turns, but from Thornton and Tom Epperson's sly, knowing script that bravely refuses to villainize any of the array of characters, no matter how crass or pig-headed their behavior first appears.<br><br>I have to admit, I was a bit skeptical of Thornton when he first appeared with the break-out \"Sling Blade,\" even though the short it was culled from was anything but slight. I thought he'd be one of these rural \"artistes\" who falls back on sentimentality and clichéd characters when he didn't have much to say. Jayne Mansfield's Car, however, proves that glib assessment was dead, dead wrong. <br><br>The strongest aspect of this film is it's script, which does what every extraordinary movie does well: drops you into another place and time that---at first glance, anyway---you'd ordinarily shrug your shoulders and walk away from, then gives you every reason you shouldn't: it's populated with people who are confused, conflicted, and multi-faceted to the point where they don't seem to recognize each other any more, even after living in the same house for decades.<br><br>The casting is impeccable and Thornton has an incredibly light-touch with all of them. Robert Duvall does what he does best: providing the anchoring figure of Jim Senior with an authority and gravitas that he can express with a lift of an eyebrow. His three sons are wrought over a nice spectrum of angst: Thornton's Skip, the ne'er do well middle son who did everything right but was always a bit too \"off\" to be dad's shining star. That honor went to Jimbo (Jim Jr., a ferocious Robert Patrick) who played closer to the mold but never saw combat as Skip and Carroll (Kevin Bacon) did, thus considering himself a failure. Skip and Carroll live with scars and resentments from their own tours of duty in WWII and Vietnam, respectively and their anti-war sentiments continue to draw them further from Duvall, in every sense of the word.<br><br>Even though the crux of the drama revolves around the return of Duvall's wayward recently deceased wife (Tippi Hedren, a pretty darn good corpse), who divorced him for Englishmen John Hurt 15 years before, the canvas of this film is really about the tortured relations between fathers and sons, and the cost of war and death and what it \"means to be a man.\" The War angle is particularly intriguing in that it plays out in the heart of Alabama in the late-sixties, where the malingering odor of Vietnam melts into the residues of a century of warfare, the star of which is the ghost of the Civil War.<br><br>The culture-clash aspect is amusing and well-played, but not even remotely why you should see the movie. The script ensures you know the characters so well, that all that formulaic hicks-meet-Brits stuff quickly goes by the wayside.<br><br>Thornton and Epperson's script gives each character a suitable bravura moment and most hit them out of the park, in particular Thornton, in a touching monologue delivered to Frances O'Connor in the forest and Bacon, whose hippie malcontent faces off with Duvall with quiet dignity and aplomb.<br><br>This is not a film to hang on for forced drama, but it's one you'll have a difficult time turning away from and an even harder time leaving, from the place where you so unceremoniously were dropped.","user":"bob_meg","rank":[27,29]},{"title":"One of the best character studies in years","rating":10,"date":"29 August 2013","review":"I thoroughly enjoyed this movie. The characters were fleshed out and I felt the pain and joy of each one. The attention to detail as far as representing 1969 gave me a flashback. I have always loved the leads, Robert Duvall, Kevin Bacon and Billy Bob Thornton, but I think this was an exceptional portrayal by each person. The Brits, John Hurt and his children were also played with such passion. The statement this movie made about war and marijuana use were not in your face, but makes you think and that is not a bad thing. The music was exceptionally well made. Set in a beautiful home and beautiful scenery did not hurt in any way!","user":"jonederland","rank":[25,30]},{"title":"Fifty Years, Three Wars, Two Continents....","rating":10,"date":"26 October 2012","review":"...through a handful of characters over a period of a few days.<br><br>Nails our uneasy relationship with life and death and war and heroics and cowardice and what history has to bludgeon us with. I particularly liked the ending because it punctuated the tale with a moment that really summed up Viet Nam and 1969 for me. (That's only a bit of a spoiler....) <br><br>Characters are brilliantly drawn and the movie is dark to the point that a power outage is created to emphasize it. But there's a ray of light there where people see beyond their noses and into others' hearts and across oceans.","user":"linda_ball","rank":[31,39]}]