[{"title":"Paulson was no altruistic hero","rating":5,"date":"18 August 2011","review":"Unfortunately the filmmakers felt the need to create a \"hero\" of the piece -- unlike the source book, which simply tells what happened. They chose Henry Paulson (William Hurt), ex-Goldman Sachs CEO turned Treasury Secretary. But the real-life Paulson is no hero.<br><br>The film makes a point that Paulson sold all his Goldman stock before becoming Treasury Sec, but fails to point out that he was excused from all taxes on the sale, which saved him upwards of $50 million.<br><br>The film also whitewashes Paulson's $150 billion AIG bailout, claiming that AIG owed money to almost everybody in the world. In fact, AIG's largest creditor was, that's right, Goldman Sachs. Paulson failed to negotiate a hard-nosed payout of AIG's obligations, such as offering creditors 50c on the dollar, which the creditors would have had no choice but to accept. This would have saved US taxpayers a cool $75 billion. But it would have hurt Paulson's pals at Goldman.<br><br>My point being, Paulson was thoroughly compromised, and managed to feather his own nest and that of his old pals. What next? A stirring depiction of Dick Cheney's altruistic hiring of Halliburton in Iraq? This shortcoming aside, the film clips along nicely, and it's fun to see so many name actors portraying the Wall Street titans. James Woods is a perfect Dick Fuld.","user":"kelly-ann-mchale","rank":[156,171]},{"title":"Sympathy? No","rating":5,"date":"22 March 2012","review":"The movie itself was put together very well following the chronicles of the fiasco that unfolded during the credit crunch. Where it went horribly wrong is by humanizing Hank Paulson. Making him seem vulnerable and genuine and sincere. It has recently been published that Saint Paulson tipped off 20 or so hedge funds about the coming collapse so they could unload their positions. And this film is attempting to portray him as the victim and the hero and laud him with applause for working so diligently on this problem. His colleagues at Goldman cleaned up on the CDS contracts betting on the inevitable crisis they knew was coming. James Woods did a very good job at making Dick Fuld's loathsome character believable, though.","user":"happel317","rank":[47,55]},{"title":"Where is the real story?","rating":4,"date":"8 June 2011","review":"I liked this movie when I first saw it. Entertaining, great performances, and what I thought was a great explanation of the 2008 economic crisis. Then I watched the documentary \"Inside Job\" and learned the truth. Hank Paulson was not a hero. He started the house on fire to collect his money (deregulation) and then had to scramble to put it out when he realized he was going to burn with it. This movie makes him look like a hero for putting it out. By the way he collected a nice chunk of change by selling his stock with Goldman Sachs to become the Treasury Secretary (mandatory)before the crash. And don't get me wrong, he didn't do it all alone and in no way his he solely responsible, and i'm glad him and Geitner succeeded in keeping our world from falling apart, but this movie rings way too false after you watch the real story in \"Inside Job\". I won't speculate on Mr. Sorkins (writer) motives, but he and his co-writer are way off on telling the true story of what happened. I still appreciate the performances and direction, but it's like watching a lie now. Sorry, please watch Inside Job narrated by Matt Damon by the way, and see what you think!","user":"rubbersoul-1","rank":[86,106]}]