[{"title":"Not as bad as people make it sound, a decent diversion","rating":7,"date":"5 September 2013","review":"OK, this is not Conan and it's not 'really' Scorpion King in anything but name. But having said that, I think other reviewers are being too harsh. I found this movie to be an enjoyable evening's diversion. The action sequences are fun to watch, the acting is decent (if a bit hammy in places), and the story line is pretty good. The settings are richly decorated and the battle scenes look fairly well done. In other words, nothing spectacular here, but certainly not lacking some charm. Billy Zane is evil fun as always, with the glare and voice that exude malevolence. Victor Webster does a decent job as Mathayus, giving him a good blend of humor and sad weariness. Bostin Christopher started off as a bit too buffoonish as Olaf, but grew on me as the movie progressed. And Krystal Vee is a delight as Silda, a role she fills with surprising depth. The film has enough action and plot twists to keep you entertained, just don't be looking for high cinema.","user":"crmarkie-784-893409","rank":[19,22]},{"title":"Waste of Time...Avoid at all costs","rating":1,"date":"10 January 2012","review":"After seeing the Mummy films, from which i loved, i was excited at the first Scorpion King film to show show his story. Then they had a sequel showing the upbringing of the SK, which had mixed reviews, but was watchable. This had me thinking - they should've left it at that.<br><br>Watching this new sequel to the scorpion king films, I wouldn't recommend to anyone. The acting is appalling, the fighting was very poor. Their attempt at keeping the storyline entertaining failed miserably, you would think an Arcadian would be able to fight. The main character Mathayus, was played by a non action star in an action film - don't make sense. Avoid at all costs!!","user":"kate_uk-929-522981","rank":[34,45]},{"title":"A Xena like film, nothing to do with the Mummy or the Scorpion King","rating":29,"date":"29 December 2011","review":"It was like a test: can the third part of a franchise that spawned out of another franchise that wasn't that good be any good? Can Ron Perlman and Billy Zane save it? And the test was failed miserably.<br><br>Let me explain this to you in a way that anyone can understand: if you watch this on fast forward x4, it will be a total waste of your time. At least Ron Perlman has a small role appearing at the beginning and the end of the film. Billy Zane does his usual evil smiling villain, but it is not enough. And the \"Scorpion King\", not only does he not act like one, he actually plays the entire movie as a positive hero with no baggage. The only connection remains the \"deep voiced\" words of the narrator who pretty much says: \"this is the Scorpion King! Really!\" and then disappears. And the actor... is Victor Webster! He played in Mutant X, for crying out loud, and looks like an underwear model.<br><br>Bottom line: avoid this film at all costs. Or watch it at x8, maybe it works then.","user":"siderite","rank":[39,53]}]