[{"title":"Unique","rating":10,"date":"17 April 2018","review":"Another movie that i say \"i should've watched before\". Intense romantic drama. Fascinating portrait of loneliness in a post-digital world. Amazingly original screenplay, concept, musics, especially colors and performance from Joaquin Phoenix. This made me stay with myself after the credits have finished, i found myself reflecting on my own life and relationships.","user":"enginozdil","rank":[190,200]},{"title":"I love everything about Her","rating":10,"date":"4 January 2014","review":"This is the best film I have seen all year, and I saw just about every good film to hit theaters in 2013. I think it's because it is so representational of what it's like to be human.<br><br>There are so many things that make this movie special, but I'll just mention a few. <br><br>1. The score is INCREDIBLE. The music paired with the beautiful sound design make you FEEL the movie. Sure, you see everything on the screen, which is already beautiful, but then that music hits you and the emotions just start to run. I laughed, I cried, my brain got all tingly. It was an emotional roller coaster, and the score assisted in that so well. <br><br>2. The script. I knew how this movie was going to end 30 minutes in. And unlike most who would then say that it's predictable and not worth watching, I consider that awesome, because it means that the script is tight enough to tell a good story with a believable arc. Every scene in this movie is straight up powerful! Like it will fill your heart with sadness and happiness and pain and guilt and confusion. And then rinse and repeat. For 2 hours. It moves through all of the most complex and interesting questions that we should be asking ourselves about what it means to be a human being. About what it means to be alive. This film is about all that life is. And after the screening, as well as during, I found myself questioning things in my own life that either don't make sense or don't have to make sense. Like love and thoughts and emotions. They're all so natural and yet none of us truly understand how they work. In my opinion, moreso than any other film this year, Her has the perfect mix of complex ideas, story, and character development. One of the best scripts ever written. <br><br>3. Cinematography. My personal favorite shot to see and use is the extreme close up. And that shot was all over this movie. The reason I love it so much and believe it works so well is because it allows you to see the emotions of the character so plainly. Like their face is right in your face, so you just have to look at it. And that's where Joaquin shines. He delivers such a powerful and emotional performance and the close ups are there to capture it all. They also make great use of the natural backlighting of Shanghai, and the colors all fuse to make it a really pretty movie. I'd say the cinematography is on par with Drive and/or Lost in Translation in terms of the style. It looks like every shot was photographed with the intent to make it the most beautiful shot in the film. And I admire the DP's work. He did a really great job. <br><br>More than anything though, this film just made me feel. Everything about it was so beautiful. I didn't want it to end. I felt like the film was controlling me - playing with my mind as if it were a joystick. And that's just something you don't get every day. Very rarely am I awe- stricken by a movie, and this film made my jaw drop. It is without a doubt the best film of the year, and upon just one viewing, one of my top 5 favorite movies of all time.","user":"Frank-E-Hickey","rank":[781,992]},{"title":"In a word, brilliant","rating":9,"date":"21 December 2013","review":"Science fiction has been dominated by 'space westerns' for so long that the occasional concept- based story situation hits a big number on my personal richter scale. <br><br>What does it mean to be human? And if we create near-humans what is our responsibility to them and what is their relationship to us? These themes underpinned Blade Runner and Spielberg's A.I. And Sci Fi of the 50s and 60s dealt with machine self awareness. None of the films that touched on this subject in the past presented it so thoroughly, intimately and believably. <br><br>Her is in the near future, but everything we see is within reach now: the isolation and starkness of the \"business district,\" the oppressive scale of the architecture (with thin, clumsy attempts to soften its sterility) and the need for continuous connection to remote voices.<br><br>A personal assistant that learns independently and takes initiative for its hapless user, \"Her\" is at once the ideal tool and — who knows — perhaps closer to the next level of evolution. <br><br>Pitch perfect performances and direction kept me in the story. As others have said, the locations, cinematography and even music shine in the fabric of this film. Spike Jonze is a master story weaver at the top of his game. Joaquin Phoenix is utterly credible as are all the other leads. Even Scarlett Johansson, who has not always seemed a strong actress to me performs utterly convincingly. <br><br>It's an adult-themed film in more ways than one, but especially in the best way: it makes you think about a reality that's right around the corner.","user":"BillK","rank":[445,610]}]