[{"title":"Not impressed","rating":6,"date":"23 February 2020","review":"This kind of movie is David Ayer's bread &amp; butter, and he has a good cast to work with including Schwarzenegger, Worthington, Howard and Enos. The problem is that the script isn't tight enough and I didn't believe some of the actions of the characters. Worth a watch if you are fans of the genre or the actors, otherwise skip it.","user":"MR_Heraclius","rank":[37,38]},{"title":"More story, less action. That is OK!","rating":7,"date":"12 July 2014","review":"The movie is not bad at all, not sure why everyone says it is. Especially when the review just says it is bad and gives no explanation other than implying there is no plot.<br><br>Most of the Arnie movies are not that great, I love them still, this one has a bit more of a story that it is following, with less action. That is probably why every1 is down on it I suppose, it is different.<br><br>There are a couple things going on with the main character, he is trying to get to the bottom of them both. It all unfolds nicely, but it is a bit slower than what most Arnie fans are used to. To me, that is fine.<br><br>I do not understand why anyone thinks there is no story, there is more story than action. Could of used more time with the characters, probably was part of what was cut from the original 3 hour run time, but it is still a fine movie. Meaning there are much worse Arnie movies that were more successful. This is like a better version of Eraser, which I thought was only OK back then. Give it a shot, take it as it is without some type of expectations, you will not be disappointed. Unless you are not an Arnie or cop violence fan. If that is the case, then why are you reading this?","user":"demnarchangel","rank":[82,117]},{"title":"Schwarzenegger delivers a rare dark performance in this extremely violent but ponderous cop thriller.","rating":5,"date":"3 April 2014","review":"From TRAINING DAY (2001), DARK BLUE (2002), HARSH TIMES (2005), STREET KINGS (2008) and END OF WATCH (2012) at which he either writes, directs or doing both duties, David Ayer has crafted quite a career for himself as the go-to guy when comes to movie that explores the dark side of a law enforcement. This year is no different as Ayer explores the same territory again with SABOTAGE. But what's really interesting about his latest effort is his first-time collaboration with the former '80s and '90s king of big action icon Arnold Schwarzenegger playing the kind of role unlike anything fans have seen him before... well, at least not since 1984's THE TERMINATOR or to certain extent, 1997's BATMAN AND ROBIN.<br><br>WHAT IS IT ALL ABOUT?<br><br>Following a successful drug raid to steal US$10 million from the cartel's money, John \"Breacher\" Wharton (Arnold Schwarzenegger) and his rugged team of undercover DEA task force -- James \"Monster\" Murray (Sam Worthington) and wife Lizzy (Mireille Enos), Joe \"Grinder\" Phillips (Joe Manganiello), Julius \"Sugar\" Edmonds (Terrence Howard), Eddie \"Neck\" Jordan (Josh Holloway), Tom \"Pyro\" Roberts (Max Martini), and Bryce \"Tripod\" McNeely (Kevin Vance) -- are happy to collect it later where they hide it in the sewer pipes. However, they return to discover that the drug money has gone missing. They are eventually held for investigation and everyone ends up suspended from duty. But after the authorities fail to land hard evidence against them, their superior (Martin Donovan) put them back into action. Then, one by one from Breacher's team members ends up dead in gory fashion. While trying to find out the culprit, Breacher is subsequently working with homicide investigator Caroline Brentwood (Olivia Williams) and realizes that the murders as well as the stolen drug money is actually involving one of them.<br><br>THE GOOD STUFF<br><br>As with other Ayer's movies, the action is brutal and gripping enough to capture your attention. Together with cinematographer Bruce McCleery, Ayer also manages to create some creative shots including the one where he utilizes small digital cameras from the tip of a gun barrel's point-of-view during a shootout.<br><br>The overall cast here is engaging, with Schwarzenegger gives a daring performance as the cigar-chomping John \"Breacher\" Wharton with a dark past. It's certainly nice to see him willing enough to change his usual larger-than-life action image for something radically different. As the emotionally-confused and relentless Caroline Brentwood, Olivia Williams plays her role with enough gravitas to stand out on her own. The rest of the supporting actors, including Sam Worthington (sporting a shaved head and braided goatee) and Joe Manganiello (looking good with a cornrow hairstyle), are equally adequate with their respective roles but it was Mireille Enos who steals the show in SABOTAGE. Here, Enos brings an uncompromisingly fearless performance as the tortured Lizzy who is addicted to drugs.<br><br>MOST MEMORABLE MOMENT(S)<br><br>For all the blood, sex and profanities that showcased throughout the movie, I can't singled out a moment worth placing here.<br><br>THE BAD STUFF<br><br>It's a pity that the story here is major disappointment. Written by David Ayer and Skip Woods, SABOTAGE does look promising with a nifty concept that mixes Ayer's trademark gritty cop thriller with Agatha Christie-like whodunit structure (particularly her famous novel of And Then There Were None). However, the execution is rather poor or should I say, lazily constructed, as the whodunit doesn't look interesting at all. And worst, the story drags a lot throughout the movie.<br><br>As exceptionally good as Schwarzenegger has put into his character, there's a nagging feeling that he looks wooden when he is required to deliver more stilted dialogues than usual. As the soft-spoken Sugar, Terrence Howard does little to make his performance worthwhile in the movie.<br><br>As much as Ayer loves to showcase a lot of grits in his movie, his penchant for shaky camera-work feels rather annoying, particularly when he loves to do a lot of tight close-ups. Another flaw here is Ayer's over-the-top display of gore and violence that somehow works better for a hardcore horror movie than a gritty cop thriller.<br><br>FINAL WORDS<br><br>While SABOTAGE is far from both Ayer's and Schwarzenegger's best efforts, the movie remains quite a jolting cinematic experience.","user":"caseymoviemania","rank":[107,157]}]