[{"title":"Hilariously raunchy","rating":7,"date":"30 July 2013","review":"After watching \"Bridesmaids\" earlier this year, I was actually quite surprised to see a film that I usually would have flagged as a \"chick flick\" make me laugh and leave the theatre thinking I just watched an overall quality comedy. I always found that Hollywood liked keeping this stereotypical division between these \"raunchy guy comedies\" and \"corny chick flicks\".<br><br>The one point I'm trying to make here is that, usually, raunchy comedies feature male characters as the leads, and the female characters usually either serve as the opposing party to typical stories of bromance, or as the \"background bimbos\". But, after a while, as in any movie sub-genre or trend, clichés keep coming back again and again, the same faces play the same roles in movies that are basically carbon copies of one another, and, quite simply, it gets a tad old and the competent releases among that sub-genre become a rarity.<br><br>But what if these old clichés could be completely rejuvenated if the mold was turned upside down, and female characters became the leads? Well, trust me, this film is no corny romantic comedy, the clichés one would expect to see in a chick flick are absolutely nowhere to be found. Think of a cross between \"American Pie\" and \"Superbad\", with even dirtier dialogue, morals, and situations...with female characters as the leads.<br><br>The film starts with quite a crafty opening credits sequence, which quickly lets you know that you're being brought back to the early nineties (1993 to be exact). And, throughout the film, this nineties feeling is very well kept alive, with the sets, the costumes, and such. Good job on that.<br><br>One could argue that every character is super stereotyped. That is absolutely true. And that's probably the biggest trick that \"The To Do List\" is able to pull off : The situations through which the characters go embrace their stereotypical nature while constantly pushing both the limits of good taste/morals and of what you've previously seen in similar movies. \"The To Do List\" is not trying to reinvent the wheel. No. But it's definitely trying to push the limits in many regards. Where \"The 40-Year-Old Virgin\" got a bit sanctimonious at times, this film ends up stating that sex can just be a casual thing and should be enjoyed as exactly that. Where \"Superbad\" pulled its punches when it came to teenagers experimenting, \"The To Do List\" unleashed a flurry of hay makers.<br><br>And I'm not taking anything away from these two movies, I loved them both. All I am saying is, \"The To Do List\" qualifies amongst even the cruder comedies, and surpasses them several times in that department.<br><br>That's not the only trick it has up its sleeve though. Narrative structure is clever, with check-boxes appearing every time one of the \"tasks\" is accomplished. The dialogue is top-notch and constantly drew major laughter from the crowd. The cast is impressive, and features a couple of uproarious cameos.<br><br>\"The To Do List\" is quality entertainment that does deserve its heavy R rating. In the same vein as \"American Pie\", \"Superbad\", and \"The 40-Year-Old Virgin\", this film definitely doesn't bring anything properly new, but it does innovate by reversing the mold and putting female characters as the leads. To think the result would be toned down because of that single detail would be foolish, and just like \"Bridesmaids\" did, \"The To Do List\" reminds us of that. To be quite honest, I found it kind of refreshing. Add competent direction, a solid cast, and neat dialogue, and you've got a good comedy that's definitely not for kids, but that both men and women will find hilarious.","user":"plpregent","rank":[72,95]},{"title":"Great for what it is.","rating":7,"date":"5 August 2013","review":"I think the reason so many people disliked this flick was because they went in with the wrong expectations. You hear about a teen sex comedy staring women and immediately people assume something more sophisticated and classy would be the by product. <br><br>This is not that movie.<br><br>This film is both dry and ludicrous, crass and hilarious. <br><br>Aubrey Plaza's one note characters fit this movie well.<br><br>What I liked most about the flick was that it finally gave a voice to the sexually confused teenage GIRL population. The movie was written and directed by a woman, and it's pretty clear when you're watching.<br><br>TL;DR:<br><br>It's not an Oscar winner, but it's funny. It's a very progressive movie in the sense that it reverses the normal teen comedy gender stereotypes and gives the audience an unfiltered and unashamed (however hyperbolic) look at female sexuality, insecurities and intricacies.<br><br>NOT FOR KIDS.","user":"ariasn1","rank":[63,88]},{"title":"A Pleasingly Raunchy And Sex-Positive Sex Comedy","rating":7,"date":"21 August 2013","review":"\"The To-Do List\" is an entirely raunchy, breezy coming-of-age comedy that is anchored with a solid, fearless performance by Aubrey Plaza. <br><br>It's an \"American Pie\" race-to-lose-your-virginity tale that is not only surprisingly sweet, and at times smart, but also pleasantly positive about sex - filtered through a unique female voice and fresh perspective on age- old genre tropes. It's free of the snickering, juvenile gross-out attitudes of the \"Pie\" films. <br><br>The film is uneven, wanders a bit, and sometimes plays like a series of SNL sketches than a full-on film, but is, on occasion, laugh-out-loud funny. <br><br>It should get some more love and attention when it arrives on home video &amp; PPV where it is sure to gain a word-of-mouth following.","user":"britishdominion","rank":[40,65]}]