[{"title":"Pure Christian propaganda","rating":1,"date":"17 October 2014","review":"I watched the movie and was shocked that the \"bad guy\" is a senator that is trying to legislate a bill that guarantees religious freedom and tolerance.<br><br>The \"good guy\" on the other end is a preacher that is against religious freedom and states that only Christian faith is acceptable. This is really really not up to democratic and modern standards. <br><br>This is purely a Christian propaganda film that is supporting intolerance. I do not know how anything like this is even made in the twenty-first century.<br><br>This is the worst movie I have seen in years.","user":"tbrettge","rank":[53,81]},{"title":"Great actors,sadly wasted","rating":1,"date":"24 January 2015","review":"I disagree with the reviewers who called this movie \"pure Christian propaganda.\" There was nothing remotely Christian-like in this piece of narcissistic fantasy. Generally I love Christian movies, even when the production quality is slightly below par. But this one was just awful.<br><br>Badly written (or edited), the script was extremely disjointed, and defied all logic as it jumped from scene to scene with no way to interpret what was happening. And the worst: if viewed by non-Christians, the message is one of extreme intolerance. Totally incongruous with the Christian values shared by millions.<br><br>This movie deserved a zero rating, but the lowest rating available was one.","user":"realtybytes-1","rank":[17,23]},{"title":"Another Golden Raspberry Award nominee","rating":1,"date":"27 July 2014","review":"This one's gonna compete with \"God's Not Dead\" and \"America: Imagine the World Without Her\" for a Razzie in the God 'n Country Division.<br><br>I'm amused how the lead character is described as \"The last obstacle to sweeping religious reform in America...\". In other words, a theocracy in which everybody's a Christian. How could there be anything else in This Great Christian Nation?<br><br>All you really need to know about this film is (1) Glenn Beck was a silent financial backer, according to Christy Lemire of rogerebert.com; and (2) respected character actors like Bruce Davison and James Remar must have been hungry and broke with winter coming on to take these roles.<br><br>This storyline, in capable hands, could have made for a really good movie. This ain't it, not by a long shot, though the \"Duck Dynasty\" crowd will love it.<br><br>At least I'll give it this: \"Persecuted\" had more laughs than \"Sex Tape\": One.","user":"djfone","rank":[57,93]}]