[{"title":"Nice Movie :)","rating":5,"date":"17 August 2012","review":"I really liked the movie.. i really loved the Halloween movie of buddies it was much better than this but this one is also a good time killer the talking animals sometimes look fake in this one but it has a lot of info about Egypt and it is very good for the kids :)<br><br>the animation in the movie is not good as the previous ones like spooky buddies but the story line was OK i liked the new monkey character :) but the movie get interrupted several times and i didn't liked it and also in some scenes the talking animals look a little fake but it is a kids movie and kids don't mind these things.. so if you are a kid :P or if you are watching with a kid ;) go on.. its a good time killer<br><br>my rating 5/10","user":"luckylaraib","rank":[6,7]},{"title":"Enjoyable for a young child, and that's who it's made for!","rating":8,"date":"2 March 2012","review":"I have only one question for parents who have reviewed this movie negatively.<br><br>Did your child enjoy it? <br><br>Thank you. Now go back and adjust your star rating, or just delete your comment.<br><br>The makers of this franchise are not going for Oscars, for heaven's sake, and they never were. Yes, the movie is obviously made in a studio - what do you expect, for it to be shot on location in Egypt? <br><br>I didn't mind it and my daughter loved it, and since I bought it for her, that's all I care about.","user":"clairestruthers","rank":[13,20]},{"title":"Oh my god.....","rating":1,"date":"24 January 2012","review":"well, the speaking animals were animated okay, the story is a little bit interesting. But thats all. Everything looks really unreal and cheap made. I can't believe it has 9 of 10 stars at this moment. Looks like a movies made i the late 80's, just in HD.<br><br>My son watched it, for him it was okay. But i expected something better than that, made with more love to the detail. For me it seems like it's just thrown on the market, if the parents like it or not doesn't matter, the kids in Wall Mart will cry as long as they get the DVD / Blu Ray...<br><br>1 star because at least my son liked it a little bit, but he enjoys other movies more, like all this animated movies and so on.<br><br>I also found some stuff in the movie what is not really okay for young kids, like the \"bad guy\" is acting with the guys around him and so on, also the bad animated temple cats were weird.","user":"hofmann-solingen","rank":[19,33]}]