[{"title":"The Pontefract Poltergeist.","rating":7,"date":"9 February 2013","review":"When the Lights Went Out is written and directed by Pat Holden. It stars Steven Waddington, Kate Ashfield, Natasha Connor, Craig Parkinson, Jo Hartley and Martin Compston. Film is based on alleged real life events that were recorded in Pontefract, England, in 1974. After the Pritchard family moved into their new house on the Chequerfield Estate, poltergeist activity reached such a level it has been called the most violent poltergeist haunting ever witnessed in Europe.<br><br>Director Holden, who made the criminally under valued Awaydays, helms his picture with genuine love and thought for the topic. Being related to the Pritchard family he had wanted to make the film for some time, it's a noble effort even though it never achieves all that it can.<br><br>There are two main problems that will ensure the film will stay rooted on the bottom shelves of DVD stockists and collectors. Problem one is that it is uncomfortable in mixing comedy with drama, something that practically kills a key scene in the last quarter. It's useful to understand that these Yorkshire folk are made of tough stuff, ready to offer a quip in the face of adversity, but it has to be pitched right and here it negates much of the pent-up terror.<br><br>The other key issue is that it's so stunning in its period design (this really deserves the highest praise for the makers), anyone from the 1970s is guaranteed to be spending much of the film pointing out things and reminiscing. I know I was! Garish wallpaper designs, toys like Slinky and Buckaroo, rum and pep and Babycham in the smoky pubs, The Sweet singing Little Willy and a hairy Noel Edmonds on Top of the Pops, these are just some of the things to make film fans who were reared in the 70s smile during this particular horror film!<br><br>As a tale it's creepy enough, the cold backdrop of a Yorkshire council estate suits the story no end, and in spite of a bad misstep when Holden uses CGI in the finale, the shocks and unease moments are nicely handled. While the human interest factor always remains high and there's a bit of thought within the writing to off set the normal question of \"why don't they just move house?\". <br><br>It's also well performed by the cast, with youngster Connor really shining bright, and with Holden keeping things brisk the picture never gets bogged down with pointless scene fillers. Is it scary? Away from the flares, wallpaper and hair styles that is! Well no it isn't really, it's more an effective ghost yarn than anything else. So needless to say, the blood lust gore crowd or those expecting a battle between religion and demon, need not apply here. 6.5/10","user":"hitchcockthelegend","rank":[27,28]},{"title":"Recommended -- much better than most contemporary American ghost films.","rating":7,"date":"16 November 2012","review":"I reluctantly began watching what seemed to be yet another Paranormal Activity ripoff but was gradually pulled into the storyline by Pat Holden's fine direction and performances. The mood was effective as was the music score and sound design. I'm a big fan of ghost films, particularly Robert Wise's THE HAUNTING and Peter Medak's THE CHANGELING. While this film doesn't reach those heights, it is so much more effective than any of the American ghost films of the last few years. <br><br>I'm also intrigued by paranormal films based on true stories, which this one claims to be, adding more creepiness to the viewing. Making a good chilling film is not nearly as easy as it seems, so hats off to the creators of this good little film.","user":"ricolowry","rank":[24,28]},{"title":"A few decent scares","rating":8,"date":"16 December 2012","review":"A have read a review on this site, where the poster says he or she has seen similar things in other horror films. This may be true but it is pretty hard with poltergeist movies not to duplicate, things being displaced etc, I found the setting of 70's Britain excellent,having lived through the 70's it brought back memories of collars on the outside of jackets and the humour added another dimension. The acting was realistic and unlike so many films there was a story which had a conclusion. How many times do we sit with the credits coming down and think \"is that it, has it finished?\" Personally I don't believe in ghosts, poltergeists, exorcisms, etc but this film kept me entertained which is all you can ask.","user":"Saiph90","rank":[16,20]}]