[{"title":"Highly enjoyable, not just another surf film","rating":8,"date":"6 May 2013","review":"There's been plenty of surf films and documentaries over the years, and if you're a surfer or surfing fan, no doubt you've seen them all. Drift is the latest surf film paying tribute to and giving us a glimpse into the Australian surf life when popular surf brands were just beginning.<br><br>Set in Western Australia in the early 1970's, Drift is the story of surfer brothers Andy and Jimmy Kelly (Myles Pollard and Xavier Samuel). Andy is dissatisfied with working long hours at the local mill, while trying to keep younger brother Jimmy from a life of crime. With help from their mother Kat (Robyn Malcolm), and childhood friend Gus (Aaron Glenane), they start a surf shop in their backyard garage, making custom-made wetsuits and new surfboards.<br><br>Along the way they meet and get inspiration from surfer photographer/filmmaker JB (Sam Worthington) and his Hawaiian friend Lani (Lesley-Ann Brandt). Their success and hard work comes at a price though as they deal with members of the community who are not ready for their innovative ideas and trouble from a violent bikie gang.<br><br>The acting is fine all round. Myles Pollard, who also co-produced the film, is solid as the responsible older brother. Xavier Samuel, in one of his best performances, brings charisma and energy to his role. Sam Worthington is excellent. He is perfect as the free-spirited hippie. He seemed to enjoy this role more than some of his recent work and it was wonderful to see him in an Aussie film again.<br><br>The film does a great job of bringing the 70's back to life. You gotta love JB's colourful bus and the classic kombi vans! The surfing photography is exciting and breathtaking, and the cinematography by Geoffrey Hall is simply beautiful. The soundtrack, a mix of 70's classics and more recent tunes, really adds to the cool laid back vibe.<br><br>Directed by Ben Nott and Morgan O'Neill, Drift is well-paced and there's a lovely balance between the surfing scenes and the dramas of everyday life. I honestly would've loved to have seen a few more surfing scenes. And even if you're not interested in surfing, this honest Australian film will inspire and engage.<br><br>The cast and crew looked like they had fun making this film and it shows. A snapshot into the Aussie surf life, it was a highly enjoyable and upbeat movie experience.","user":"streamofstars","rank":[30,32]},{"title":"Surfing Life","rating":9,"date":"29 March 2013","review":"Wow! Volunteered for CinefestOz and ended up being able to stay and watch the movie premiere! The opening scene creates an unexpected tension with the mother and the young brothers heading off in darkness. They drive and drive and end up at overlooking what appears to be the Margaret River beach and its seems like their fate lies in the region. It not easy fitting into a tight knit community and the boys find it difficult though they find do find a friend who's pretty good at fixing up boards. Cut to years later, with surfing still a big part in the life of the Kelly brothers, though Andy now works at the mill while younger brother Jimmy gets in with the wrong crowd. Poor Mum spends lots of time drinking tea or coffee at the sewing machine! JB is a surf photographer who drifts into the area and sets up camp overlooking the spectacular coastline. He is accompanied by Lani who both the boys begin to fall for. The movie coasts along at a slow pace mixing awesome surf photography interspersed with the drama unfolding to the final surf competition and showdown with the baddies, bank and promoter, and coming back to the beginning of the story when Jimmy saves Andy from drowning but the roles are reversed. The scenery in the film is breath taking and showcases the Margaret River region, including Augusta, Bunker Bay and Yallingup as places with pristine ocean and natural beauty. Like Red Dog, this will be an iconic Australian movie, honoring mates sharing waves, and the sentimental Aussie battler. From the speeches at the premiere, it is like a dream to the directors who have created something they are obviously stoked and proud of.","user":"jacquie-109-602428","rank":[21,23]},{"title":"Just the surfing camera shots make this a 10","rating":10,"date":"6 June 2013","review":"Totally entertaining. We all know modern day culture even the surfer culture so I'll not expound on that. Just the surfing shots in this film make it a 10. Actng is excellent. At the beginning you're told: this is based on actual events, and it isn't hard to see why. We live in a world today where evil abounds... there are some good as well as bad choices in this film. Hopefully the viewers will comprehend the better decisions and if challenged in their life with such... will make the right choices. One can put all aside and just enjoy the surfing; which makes one want to leave the cities and live the life of the GREAT outdoors!","user":"wc_ling","rank":[22,25]}]