[{"title":"Don't do it if you aren't already Christian!","rating":2,"date":"28 December 2013","review":"I have never written a review on IMDb before but felt compelled to after watching this film. <br><br>Last night I was looking for a good independent film to watch and this flicked across the screen in my Netflix options. Never having heard of the book and not knowing a thing about what I was getting myself into, I went for it. <br><br>There were early hints that I had walked myself into a \"Christianity is the bestest\" type film, but I didn't know for sure until halfway through when the main love interest professes to the main character something along the lines of, \"I can't explain it, I just love Jesus!\". I recognized this tell-tale sign of propaganda but decided to suspend judgement. I sat through the rest of the film in hopes that there'd be surprise character or plot development in the second half. Unfortunately, there wasn't. <br><br>The plot is thin and predictable. I find it remarkable that others who have reviewed the film found it thought provoking. In my estimation, those who found it to be this way enjoyed the affirmation that the film provided. Can't fault anyone there: we all like a little positive reinforcement from Hollywood every now and then.<br><br>For those of us who aren't sold on Christianity, the underlying theme of Christianity being the \"right\" belief is obvious and more than a little off-putting. In order to be truly thought provoking (to those who aren't already on board with the concept), the message shouldn't have been so obvious and cheesy. <br><br>If the hope was that this movie would help put Christianity in a better light with non-Christians, the movie misses that mark too. None of the characters exhibited a need for Jesus/the church - at their core they were smart people with good consciouses, and were clearly capable of sorting themselves out without the church. I didn't see or hear any testimony as to why either required religious support to do this, in fact the movie highlighted several good reasons to stay away from the church: priest pedophilia and some mixed up relationships amongst church members. If a salesperson is trying to sell something, they need to talk about the benefits of the product they're pushing at least a little bit, right? <br><br>All in all, this is probably a great film if you are a \"church-every-Sunday\" kind of person - this may be just the thing to make you feel great about your beliefs (basing this not on personal experience but on other reviews). But if you are that person, please don't kid yourself that this will be the movie to convince your non-believer friends that they should worship with you. <br><br>For the non-believers, regardless of your non-believing status, this movie is skippable. The plot, characters, acting and writing is all pretty thin - not a whole lot of meat to chew on here.","user":"mindyloucooper","rank":[27,32]},{"title":"A Masturbatory View of Christianity","rating":3,"date":"24 April 2012","review":"Blue Like Jazz follows the same formula used by John Moyer in his movies about Mormonism. The questioning believer is critical of his faith but eventually finds meaning in joining a church, usually through his interest in a desirable female believer. See John Moyer's the Returned Missionary. It's basically the same story. In this case, non-believers are depicted by the residents of a secular college as being raucous, injured and without direction. Christians are shown as tolerant, generous and kind. Non-believer's lives are mired in self-absorption, while the Christian character is generously giving her time to traveling to a troubled third world community. What she actually accomplishes there is not revealed. The viewer is left to wonder whether she is giving any substantial relief or is there to proselytize. While the supposed virtues of a Christian life is alluded to, the film never tackles the difficult challenges about historical accuracy and factual evidence put forth by its critics. It simply asserts that non-believers and Christian critics live empty non-fulfilling lives, and Christian's lives are wholesome, peaceful and fulfilling. This is illustrated when the main character comes to his senses, recommits to his religion, and most importantly, gets the girl. The female prize is no ordinary female, but a high quality, highly desirable, attractive, intelligent, caring, wise, and endlessly forgiving white Anglo-Saxon female. This is exactly the prize bait used by Moyer in his movies about the Mormon religion; that is until John Moyer renounced his membership and gave up the religion.","user":"jbmister46","rank":[38,57]},{"title":"A refreshingly honest film for everyone","rating":9,"date":"20 March 2012","review":"My preconceptions about what a Christian movie would be like were happily proved wrong with this movie. I thought it would be another poorly acted, cheesy feel-good film of the us-versus-them variety like so many Christian films are. But it wasn't.<br><br>This story of a college student trying to escape his Bible Belt upbringing at a godless campus deals with universal themes that will appeal to people from many walks of life.<br><br>The actors gave solid performances, breathing humanity into the characters. The writers balanced the heavy soul searching with a sense of humor. The producer delivered a final product that rivals studio films with much greater budgets.<br><br>An entertaining film that makes you think.","user":"ankawibi","rank":[28,41]}]