[{"title":"Great New Twist on Superhero Movies","rating":8,"date":"4 February 2012","review":"Enjoy trolling? Enjoy watching people get trolled? Here's your movie. Chronicle stumbled into theaters thoroughly undervalued. Although it does have its flaws, it has paved an entirely new route in the worn-out genre of superheroes. Chronicle brings all the major superhero questions into play—Where did our powers come from? How should we use our powers? In the end, however, those questions are irrelevant. This movie is not about three superheroes. It is about three teenage boys who just happen to have super powers.<br><br>This movie is quite extraordinary. All three of the main actors are unknowns. When the movie begins, they all promise to me stereotyped high schoolers—the popular one, the outcast, and the stoner. As the movie progresses, those stereotypes become worthless. These actors were up to the challenge. Each main character changes so much that you won't recognize them from beginning to end. Mix this with the unique storyline and this movie has an extremely strong core.<br><br>A good deal of this movie is enjoyable simple because it is realistic to life. The bullying is brutal. The type of things that the main characters do with their powers is exactly what I would do. That's the shining point of this movie. It is true to life. It doesn't cover up life or try to smooth it over with simplifications. This movie is beautiful with its honesty. It allows the viewer to laugh hysterically one moment and cringe the next.<br><br>The problems are minor but still present. The incredible climax is followed up with a lackluster conclusion. The father's character is rather over-the-top. I can't tell if it was the writing or the acting that made it so. These two facts won't pull you away from enjoying the movie. It's just too bad that such a good movie would end on such a low note.<br><br>This movie is worth seeing. Some people will have trouble watching it in theaters because it is a shot from the first person and can be jerky at times. If you are okay with that, I would recommend seeing it in the theatre. I saw this movie with a large audience—which appeared to add to the experience. For the average Joe, this will be an enjoyable movie. For the superhero fan, this could be a cult classic.<br><br>reillyreviews.wordpress.com","user":"FFman-847-460126","rank":[258,359]},{"title":"\"Found footage\" films have the tendency of being awful, predictable, and nothing but a cheap money grab; Chronicle, thankfully, is different.","rating":8,"date":"5 February 2012","review":"Chronicle is a \"found footage\" film that is similar to Cloverfield, The Blair Witch Project, and - the infamous - Paranormal Activity series. Those kinds of films (mainly Paranormal Activity) have a tendency of being awful, predictable, and nothing but a cheap money grab; Chronicle ,thankfully, is different.<br><br>Andrew (Dane DeHaan) is a high-school teenager who has decided to make videos of his life. Through these videos, we find out Andrew is a total outcast and doesn't have an easy life. Andrew's father is an abusive drunk, his mother is dieing of cancer, and his cousin, Matt (Alex Russell), barely tolerates him. One day, While Matt is driving Andrew back from school, Matt urges Andrew to go to a party with him. Matt then pleas Andrew not to bring his camera; Andrew doesn't listen. After being punched in the face by a drunk raver, \"the footage\" then cuts to Andrew sitting outside the party crying. Steve (Michael B. Jordan) walks up to Andrew and tells him that he and Matt have found something they want him to film. What they find is a huge hole. As Andrew is filming the hole, an odd sound is being produced from the inside. Steve, Matt, and Andrew both climb into down hole to see what is. What they find is ______________________________. Some time later, Andrew, Matt, and Steve are then shown that they've developed telekinetic powers (that's when the fun begins). Instead of using their powers to fight crime, the three - now friends - use their powers to play practical jokes on people. As their powers get better, so do the camera angles. Andrew is eventually able to levitate the camera anywhere imaginable as he's doing anything. It's pretty cool.<br><br>What amazes me about Chronicle is how well everything has been written. The writing is very well thought out and so are the three main characters. It's rare that you see this in any film. It's even rarer when you see this in a \"found footage\" film. I'd advise any writer that plans on writing anything about high-school teenagers to watch this film; These are how real high- schoolers act. They're not too immature, they're not too mature. They're teenagers. simple. That's one of the reasons why I love these characters, I can relate to them. Regardless of who you are, you can relate to at least one of the three main characters. As for the other two, you probably know/knew someone who had similar personality traits. It doesn't hurt either when the three form a strong friendship with one another. The first hour or so is a great bromance film<br><br>The effects are pretty good, for the most part, considering Chronicle is a low-budget thriller. Most of the effects are practical with uses of some green screen technology. The stunt that looked a little odd to me was the flying, but you get used to it after a while and accept it for what it is. Even though some of the effects looked a little awkward, I have no choice but to respect it, for the fact Chronicle didn't rely solely on CGI.<br><br>Dane DeHaan, Alex Russell, Michael B. Jordan give great, convincing performances. These characters feel real, so you have to give credit to the three main actors for making them come to life.<br><br>In case you can't already tell, I really enjoyed Chronicle, and I think anyone that likes superhero movies will too. Chronicle is the definition of a great \"found footage\" film. Chronicle is a fun, thrilling movie with simple, yet great dialogue that comes with a great story. Chronicle does a brilliant job at making you feel like you're part of the movie (I really felt like I was the fourth member of the crew), and that means something. <br><br>I give Chronicle a very enthusiastic 4 out of 5.","user":"Colyn1006","rank":[216,316]},{"title":"A tremendous achievement in low-budget filmmaking.","rating":9,"date":"3 February 2012","review":"The next in a long line of \"found footage\" flicks that have been flooding our cinemas over the last few years, Chronicle breaks free of the usual constraints within that sub genre to concoct a truly memorable sci-fi thriller. Retracing the steps of three teenage friends who are gifted with telekinesis after a chance encounter with something (intelligently, the movie never stipulates what exactly), the story focuses on the varying paths they take with their new found talent, but not until they have had some juvenile fun with it first. This is an amazingly accomplished debut feature for writer-director Josh Trank (who co-penned the script with Max \"son of John\" Landis); his technical veracity is utterly mind-blowing – especially when you consider the shoestring funds he had to work with – and his narrative pacing is impeccable. The icing on the already yummy cake is the marvellous CGI that allows our protagonists to fly, crush cars and stop baseballs in mid air – all seamlessly and photo-realistically. Chronicle is a tremendous achievement in low-budget, big-concept filmmaking.","user":"Troy_Campbell","rank":[231,346]}]