[{"title":"There is always an alternative","rating":17,"date":"17 November 2014","review":"I read about 20 from the currently 350 reviews here and as far as I've seen, nobody seems to mention 2 key scenes which seemed very important to me, so I'd like to add my two cents here, a different attempt of interpretation.<br><br>First key scene: the teacher scene. We witness how completely the children absorbed the doctrine of Wilford. The train manager became a benevolent deity, the system is never questioned, and the train must go on forever. The teacher is a sycophant, very much like Mason. What future do the children have if they are not allowed to think critical?<br><br>Second key scene: Wilford's monologue when he explains how sacrifices have to be made (only by others, i.e. the lower class). If the system can only continue by murder, then mankind survives by inhuman means, although Wilford sees himself not as the leader who created the train and the system, but as just another cogwheel in the machine. Therefore he expects that a younger man might replace him when he is too old, without any change to the system. He cannot imagine any alternative, but others can. <br><br>In conclusion, what matters is that the train must be stopped somehow to get out of this treadmill. Other reviewers have asked: is it possible to survive in the cold outside, wouldn't it be safer to keep going with the train. I think they fell right into the trap here that the movie makers prepared. Because just like the train is going in circles, returning every year to the same places, we are living our lives in circles, safe but in a society that loses its social qualities, as you can see quite often in the treatment of children or elderly people, for example. The revolution, as the film makers describe it, wants to break the circle and start a new life that may be less safe, but challenging and more human. I think people who ask: \"wouldn't they freeze to death outside?\" take the allegory too literal again. The frozen world outside represents the unknown, something you take careful glimpses at from the window, but whether it's 5 degrees below zero or 25 is hardly the point. The train itself was a better allegory than a ship or an airplane, because these do not strictly stay on the same tracks when they sail or fly around the planet. The polar bear at the end shows that life outside is possible, but one must try and face the unknown instead of continuing the same old evil.<br><br>I liked 'Snowpiercer' a lot as it gives much food for thought, but I wouldn't call it a flawless masterpiece (voted 8 of 10). The killer shooting through the window, the decadent upper class passengers in swimming pools or the traitor among the lower class passengers are too much of movie clichés. The question of how food is produced was answered much more terrifyingly in 'Soylent Green' decades before, in 'Snowpiercer' it was just good enough for a quick shock effect. But don't these little niggles stop you from watching this very interesting movie.","user":"unbrokenmetal","rank":[259,299]},{"title":"I Didn't Think I'd Like it","rating":9,"date":"16 May 2019","review":"I don't like movies as art. I like movies that have rules and internal logic, and the premise of this movie is idiotic from both a scientific and common sense angle. It really works though. Like it really works. If you can just suspend disbelief and accept that a train can run forever and sustain some sort of biodome indefinitely then this movie is a masterpiece.<br><br>I see reviews where people basically complain about how the premise impossible, or that the themes are cliche, and I'm totally with you guys there. Both of those things are true, so if you need realism then you probably won't like this movie. But if you can just accept the premise as it is then this movie is something really special. One of the better movies I've watched in a really long time","user":"iamtheslickguy","rank":[46,60]},{"title":"Plot holes galore","rating":5,"date":"22 March 2014","review":"The only reason I am writing a review right now, is because of how stunned I am at most of the user reviews. While its good that you enjoyed the movie, I am surprised at how most people here are overlooking some of the pretty terrible choices. I will be going through what I thought worked, and what kept me from enjoying the movie. Needless to say; MASSIVE SPOILERS AHEAD.<br><br>The good: I like the plot, for the most part. Although I find the idea of a train being humanity last home extremely weird, it makes for a nice backdrop. The tone of the movie reminds me a lot of The Hunger Games. Chris Evans does pretty good. The wagons themselves have amazing character. The Art Director should be praised the most out of the entire film crew.<br><br>The bad: Well, let me sum it up in questions. Questions keeping me from loving this: 1. Why divide the train into classes? This makes no sense. The train ecosystem would function fine with some rules regarding population control. <br><br>2. Their great plan is to have a regular uprising to kill off people and keeping the population down? WHAT? See my first point. <br><br>3. They used to eat people and babies, but are now disgusted by eating protein bars made by cockroaches? How does that work? And furthermore: <br><br>4: WHERE did all those bloody cockroaches come from? <br><br>5: If you've invented perpetual motion; why the hell use it in a train? Why not use it to power a generator in a camp, or heat a underground city? The train is death on tracks, with ice regularly blocking the path. <br><br>6: Why is everyone on this train ready to kill? Seriously, 90% of EVERYONE is ready to throw down here. <br><br>7: People take loosing their limbs SHOCKINGLY well in this movie. Like it's just a flesh wound, really. <br><br>8: What the hell happened with that one bad guy who got stabbed through his guts and choked? He just gets up? Why did the korean guy stop his girl from stabbing him? And the korean girl later misses him by 7-8 shots? Furthermore: Tilda Swinton gets a knife through the leg, but walks fine right afterwards.<br><br>9: Those weird antics of the characters. The woman in the yellow dress licking her blood off her fingers. Tilda Swinton with her strange comedic performance (although I did like the character, I found it a bit distracting), that incredibly weird Korean couple acting all over the place, things like the masked guy just smiling at Evans when they are sitting down. Sometimes I felt like I was watching Charlie and the chocolate factory. <br><br>10: The starved people of the tail takes out an army of axe wielding fighters with night vision? After apparently yelling for help through the entire train, and a kid lighting a torch, and running up to them in no time? Stretching it thin, movie! <br><br>11: The soldiers had bullets, but they weren't using them at the ONE PLACE they needed bullets? Are you serious?? <br><br>12: The shootout between Chris Evans and what I can only assume was Terminator. On opposite sides of the train, probably 1000ft from each other. Sniping with a submachine gun. Through a blizzard. Nice aim there, fellas. <br><br>13: Mr. Terminator shooting his comrades all the time. Seriously. What was to be gained from that? He did it several times. Who is this guy?? <br><br>14: The only way the train can function is to stuff small kids down small holes to keep the engine running? Really? Was the train designed to stuff small kids down there, or did it just appear to be the perfect solution? How convenient. <br><br>15: The wagon closest to the engine is the RAVE-CLUB where all the freaks go to party? Incidentally, the elementary school is next to the slaughterhouse.<br><br>16: There is no policy on drugs on this finely tuned train? Everyone just goes buck wild with this incredibly potent drug next to the engine room? And furthermore... <br><br>17: The drug of choice is basically C4? And it just lies around everywhere - again - next to the engine room? <br><br>18: Why not pay attention to what the korean guy is doing to open the doors and then open them themselves instead of having him slow them down? <br><br>19: The people with axes putting fish blood on their weapons before fighting? That was random. <br><br>20: The other wagons are TOTALLY unaffected by the explosion in the first wagons. Wow. They don't really notice until they derail. What a masterfully crafted train. <br><br>21: I know it fits with his story, but did Mr. Evans really need to sacrifice his arm to pull that kid out? He could probably stop the machine with something else than a limb and take better care of that child. <br><br>22: The people who jumped off the train still haven't been covered up by snow after 15 years in a never-ending blizzard?<br><br>Those were some of the things that stopped me from loving this movie. It just got too dumb. There was definitely something here, and I feel this could have become an excellent movie with more thought put into it. It came off extremely unrealistic. And in sci-fi, it's all about fooling the audience into thinking it could have happened. That's the \"science\" part.<br><br>All in all though - probably an entertaining movie if you'e not a nitpicker like me. Thankfully a lot of you aren't :)<br><br>EDIT: Someone corrected me in that the couple were korean, and that one of the bad guys never takes a bullet, like I thought he did. Sorry about that, but it still seems far fetched.","user":"mikkepost","rank":[1,1]}]