[{"title":"Holy crap...","rating":8,"date":"20 May 2011","review":"I'm not going to lie... I downloaded this movie as soon as it was released (legally, look it up) and before watching it I didn't have high hopes for it. A *free* horror movie? How much effort could possibly have gone in to it?<br><br>Apparently a lot.<br><br>While the actors were fantastic and the set was amazing, what truly blew me away was the sound. Just the oppressive silence broken only by drips or footsteps. Sound can really make or break a horror film and in this case I can honestly say it worked!<br><br>As a general rule, if you hate \"found footage\" movies such as Paranormal Activity, The Blair Witch Project and Quarantine then give this one a miss. Otherwise by all means have a look! It's free! I know for a fact that I will be buying the DVD as soon as possible.","user":"thehomicidal","rank":[152,201]},{"title":"Very Intense.....","rating":8,"date":"22 May 2011","review":"WOAH..... really wanted to switch this movie off as I was practically on the floor I was that much on the edge of my seat! I'm not really into he shaky camera/found footage movies as the majority of them lack creativity and seem to copy off one another and end up relying on cheap scares or the same old jump out of your seat scenes..<br><br>This was something else, I was shaking at one point and was finding myself wanting to turn it off, making excuses to walk out the room just so I could compose myself.....as wimpy as I sound, i'm a massive horror fan, but this movie had me quite a nervous wreck!!!!! I can't praise this movie enough and would definitely recommend to horror fans alike!","user":"TylerMW1984","rank":[107,161]},{"title":"Serious Chills","rating":21,"date":"21 July 2011","review":"In watching this movie it helps to forget Blair Witch et al. While structured as a pseudo-documentary and using various forms of \"found footage\", The Tunnel has more than enough individuality to lift it beyond the merely derivative. The plot contours become increasing plausible as the film develops - the movie does a fine job of drawing in the audience and creating the suspension of disbelief essential in the thriller/horror genre. The tunnel setting is inherently disturbing and disorientating. Think of it as a \"ghost hunter\" episode gone horribly wrong. Watch it alone at night and tell me you don't have to look away occasionally...","user":"peter-shoobridge","rank":[46,65]}]