[{"title":"Different movie than the trailer...","rating":3,"date":"21 October 2011","review":"I thought I went to go see Paranormal Activity 3... you know, like the one in the trailer with a seance gone brutally wrong, house on fire, jumping girls from the upper story, medium coming to rid the house of bad spirits, closet ghost knocking games, crying girls huddled in cars, mom being flown out of bedroom, and water being thrown on a ghost to reveal that its shape is actually there. But no, I ended up seeing a crappy excuse for producers thinking they are being creative and edgy by changing it from the trailer and making it a story about satanic women rituals. I've already seen that horrible remake. I wanted to see a Paranormal Activity, not \"The Wicker Man / The Last Exorcism\".<br><br>I hope someone sues the creators for false advertising by not making ANY scenes from the trailer into the final cut. That honestly makes me mad. The Paranormal movies were made on the premise of being about a haunting of demons; adding in the \"cult\" aspect just changes things. We were drawn in on the fear of the supernatural, not satanic women. I want to see the movie from the trailer, not what they decided was the best and scariest cut for theaters, because that version was terrible.","user":"jmcb002","rank":[111,152]},{"title":"Couldn't believe this.","rating":3,"date":"20 October 2011","review":"I am not a professional critic, nor am i a critic in a general circumstance. But after watching this film it really inspired me to create an account on this site to express my views and opinions.<br><br>Well i understood the story line of this film and thought it could be a great concept, going back to before all the shenanigans of the first and second paranormal activity to when Katie and Kristi were children who are influenced highly by a spirit called \"Tobi\". Which in turn gave me great expectations for this film, i was terribly mistaken. <br><br>The first hour of this film is filled with nothing more than the usual scare tactic employed in the last 2 films which does work to a certain degree but also grows old very quickly as its all be done before in the last 2 films. A slight mix up was the camera attached to a fan trick, which i did find a good idea although even that wore thin. Also took away from the fear aspect of the film was the comedy factor which they seemed to incorporate which personally i believe has no place in the PA films. I also thought that the scene in the kitchen was a ridiculous play on the scene in the 2nd PA, could have been a bit more creative there.<br><br>After the first hour passed i believed the film was beginning to pick up and bit and actually had me frightened for a short period of time. Before i continue after this is a SPOILER!!. Why this film turned into somewhat of a cult film was beyond a joke. It completely took away from the main isolated fear aspect that the film was famous for. The ending was completely ridiculous leaving and unbelievable amount of questions unanswered.<br><br>1. Where does it show you anything to do with the house burning down?<br><br>2. Why weren't any of the clips in the trailers in the actual feature?<br><br>3. It never explains what the entity actually is?<br><br>4. How did the mother actually die in the film? And where does it show that she is actually dead at the top of the staircase?<br><br>5. Why does the ghost haunt the children although it is meant to haunt the first born son?<br><br>6. Where did a cult ever play a part in any of the other films?<br><br>All in all this film was a complete let down, and i wouldn't recommend anyone to pay any amount of money to go and view this, even just to understand the story its not worth seeing, as it does not answer any of this.<br><br>P.S as well as all of this, the reaction of the people in the cinema watching this took away from the fear as a lot of laughs were had.","user":"DarnMacs","rank":[95,141]},{"title":"Only if you liked the first two.","rating":8,"date":"23 October 2011","review":"Of Paranormal Activity 3, I can tell you this much: Chances are, if the first one didn't do much for you and you found the second one to be kind of blah and repetitive, there's no way you'll like the third one. That's a fact. The setup and premise are familiar, even if the characters are not. So as such, I can understand someone's not liking this one much at all. But. I personally found the first and second ones to be pretty scary – even when, in the second one, I knew stuff was going to happen. It has to be a good film when you're surprised even when you expect something, right? So, right or wrong, I loved this movie. It gave me what I was seeking, and more.<br><br>Whereas the second film was set shortly before the first one, this film takes a look at the childhood of Katie, the protagonist of the first film. You may recall that as the first movie progressed, Katie became convinced that something was after her specifically – but she couldn't imagine why. This movie attempts to resolve that issue. And you sort of have to give credit to a movie that resolves some things while leaving other threads dangling just enough to make one wonder what the hey is going on.<br><br>It's 1988. Young Katie lives with her younger sister Kristi, her mom Julie, and Julie's boyfriend Dennis. Strange things are afoot in their house, around the same time that young Kristi begins communicating with an imaginary friend named Toby. Is it a normal kid phase, or is it something more sinister? As with the other films, cameras are placed around the house to capture anything odd that may happen during the night. (In a clever bit of ingenuity, Dennis takes apart an oscillating fan and places a camera on it so that he can pan from living room to kitchen and back.)<br><br>What makes a movie like this work for me is the same thing that made The Blair Witch Project work (and its sequel not work at all) – it feels voyeuristic, as if we were simply peeking in on some family's everyday lives. Reasons are given for the constant filming (Dennis tells Kristi, for example, that he's \"testing\" his new camera as they have a tea party.) We're automatically drawn to the video footage. What will we see? We're now ready for something – will it jump out at us? Will furniture be overturned? Or something even worse?<br><br>The mood is another huge selling point. People react as you'd expect them to. Dennis is obsessed with finding out what's causing those noises and other disturbances; Julie thinks he's completely off his rocker and becomes more testy as time goes by. People who also experience the occurrences, like a babysitter and a friend of Dennis, are stunned to the point of not wishing to discuss the matter further, hurriedly leaving as soon as possible.<br><br>Now, I can't say that everyone, even those who love to be scared, is going to love this as much as I did. For me, since we see almost everything through the lens of a camera, the terror – and the anticipation – are grossly heightened. When that door is opened, what will we find? It's not going to be pretty, but unlike a standard horror film where one can simply slough off a shock as being too fantastic, here we're so easily drawn in by and engaged with our surrogate family that we feel as terrified and mystified as they do.<br><br>Paranormal Activity 3 won't answer everything that the first two may have left unsolved, but it does offer hints as to why, in the present day, these events are still occurring to Katie and her family. We see a part of that genesis, and it's not really what I expected. I was unsettled and thankful I hadn't seen the movie at night. Okay, that might be a little hyperbolic, and when some of you actually watch the movie you'll laugh at me for being skittish. I don't care. I enjoyed the movie, and that's all I'm concerned with.","user":"dfranzen70","rank":[72,110]}]