[{"title":"I expected it to be weird...","rating":8,"date":"27 May 2012","review":"...and it was. I also expected it to be funny, and it was that too. I had not read the book previously and knew nearly nothing about the story, but if you've seen the trailer, that is pretty much adequate preparation for the strangeness you subject yourself to as you watch this movie. <br><br>Several scenes are just outright setups for jokes, and if this film was just set em up, knock em down - it would not be worth an 8. What makes this movie better than that is that it is, at it's core - psychotic in the best way possible. You never know if what you are seeing is real or not, and just when you think you couldn't see or handle anything weirder, something hilarious happens to shift gears.","user":"sinsecticide","rank":[99,128]},{"title":"Pure Genius","rating":10,"date":"19 February 2012","review":"When I heard that the director of Bubba Ho-Tep had made a new movie, I had to see it. It was a midnight movie at the Sundance Film Festival, and it did not disappoint. Buckle your seat belt if you get the chance to see this one, because there are lots of twists, turns, and unexpected surprises. If you have a hard time with a story that goes to unexpected places and keeps you on your toes, you may not enjoy \"John Dies,\" but if you appreciate absolutely unfettered creativity and a willingness to include everything but the kitchen sink, then you should run to see this movie. Here you've got mind-bending drugs, time travel, exploding monsters, an alternate universe, and laughs – lots of BIG, all-out laughs – and Paul Giammatti! Far too wacky and weird to ever be mainstream, it's the kind of movie that true film fanatics will always cherish.","user":"KM_391","rank":[145,199]},{"title":"A cross between NAKED LUNCH and BILL AND TEDS EXCELLENT ADVENTURE.","rating":7,"date":"5 January 2013","review":"This film reminded me a lot of Naked Lunch crossed with Bill And Ted's Excellent Adventure in some ways (if you've seen all three of these movies you'll know what I mean). You have a guy (Dave) and his friend (John) who end up stumbling across a drug that opens their minds (both figuratively and literally) to another world. There is some good humor here and some of the scenes make you laugh (the meat man being one). The story is obviously over the top, but that is what makes this film fun to watch. You have to go in to this movie with an open mind (being under the influence might help to) and don't take it too seriously, that being said I can see some people doing just that and they won't get it. It has elements of horror, good old fashioned special effects - some new also, some comedy, and the obligatory nude scene. As I said, some people won't like this movie, but I enjoyed it. Fun to watch, so for that and the reasons I gave earlier, I give this a 7 out of 10.","user":"Michael-Hallows-Eve","rank":[53,71]}]