[{"title":"An excellent film!","rating":8,"date":"27 March 2014","review":"I have not read the novel, nor seen the 1996 version, so I cannot base my review on any sort of comparison. Filled with newcomers, this film really surprised me. I was hooked from the first scene and my interest continued for the length of the film. This is a long film, over two hours but it did not feel like it. The performances were outstanding, especially by the actress portraying legs. With so many lousy films and independent attempts that are failures, it was a pleasure to be rewarded with this viewing. I would guess that several promising careers have now begun. Kudos to all involved with the making of this film!","user":"iraz","rank":[28,39]},{"title":"Better than original","rating":6,"date":"18 May 2013","review":"Definitely the 2012 version of Foxfire is much better than the 1996 Version and more faithful to the book. The 1996 version was set in the 90's with mid/upper class girls with intact families who didn't know abuse, poverty, and oppression against females as was so showed in the book. The 1996 version was more about girls who had little connection to each other suddenly deciding to get together and party more so than girls with history together and genuine affection for each other forming a club that became their obsession and their life, a club with a true purpose to help and protect causes, avenge wronged females, more than just cause mayhem. The 2012 did show the heart of the book as it should have, and the relationship between the girls and Maddy and Legs was better shown and fleshed out than the first movie. 2012 movie showed the girls in the proper 50's era, that they were all poor, neglected and abused and that they were oppressed for being female. The majority of the important plotting of the book was in the newer movie, as well as direct quotes from the book and dialog, and all this made this a much better and more faithful film.<br><br>The casting was also pretty accurate; Maddy, Rita, Lana, Goldie, Marianne, and V.V. were more or less accurately chosen in their portrayals and in the physical looks of the girls, and the acting was adequate. Violet in my opinion was ill chosen and portrayed. Violet in the book was a stupid, very helpless and desperate girl who was dramatic and constantly getting herself into trouble. Violet in the movie is pretty and well put together, controlled and quiet, and she certainly didn't have the emotional outbursts and dramatics of the Violet in the book. But most damaging of all to the movie, in my opinion, is the casting and portrayal of Legs.<br><br>To me, teen Angelina Jolie is the one thing about the 1996 film that completely trumped the 2012 version. In that movie, she was androgynous and clearly impulsive, passionate and intimidating, capable of softness and emotional showings all at once, as Legs should be. Angelina's acting and portrayal were not \"perfect\" to the book but her physical description was good and her persona was as well. I could understand, watching Angelina, why the girls would find her charismatic and intriguing and want to follow her and idolize her.<br><br>This was not the case with the girl who played Legs in the 2012 version, Raven Adamson. For one thing, the look was all wrong. Though I appreciated that she was not wearing makeup, as she very well shouldn't have been, she was a small, delicate-looking, very pretty and feminine looking girl with no remarkable features. Legs was in the book described basically as a wild-haired, bonier teenage Angelina Jolie, as beautiful and bold-featured but androgynous, always dressing in men's clothing and so uncomfortable with her femininity that she actually bound her breasts. 2012 Legs was a pretty little girl who looked no remarkably different than the other Foxfire girls. I couldn't see how anyone could find her to be physically imposing. <br><br>More than this, her portrayal was just wrong. She was high- voiced and matter of fact most of the time, showing little exuberance of Legs or charismatic posture or gestures or even facial expressions. She wasn't very emotional even when she was supposedly emotional, and she didn't come across to me as someone so remarkable that others would clearly see her as their leader. It was as though they put Legs's words in her mouth and told her to do the things Legs did, but she wasn't becoming Legs at all.<br><br>Some important aspects to Legs were left out as well. There was no mention of her love of heights, just a couple of times where she sat on a roof with Maddy, and she didn't win a contest for pole climbing or get shown to be respected and intimidating of the boys their age. Legs's father was not shown to be physically abusive, and there was no scene where she accused him of murdering her mother. Her mother is in fact never mentioned. Legs's baby sister was never born, and Legs's love and concern for her sister was a large part of what drove her to want to kidnap Kellogg in the first place- to be able to get enough money to provide for her and the rest of Foxfire. We never saw her inside the prison at all, so we have no idea of what really happened to her in there other than the two sentences she told Maddy about it later which did not in any way capture the horror of her experiences as the book did and how vulnerable and helpless she felt inside there. The prison major changed Legs's character in the book so that she came out shocked and yet harder afterward, and there was little show of this in the movie except that she talked to Maddy on the roof about her surprise that women could be the enemy too. Legs seemed to be the same person the whole way through the 2012 movie, and this is over the course of several years.<br><br>I feel that the lack of understanding of either the actress or the director of who Legs was as a character hurt the movie in comparison to the book. It's not a bad movie, but if you read and loved the book as I do, Raven Adamson and her portrayal of Legs simply can't live up to the Legs of the book.","user":"Jinxgirl36","rank":[15,21]},{"title":"Awesome film","rating":8,"date":"18 April 2014","review":"With so much independent garbage smothering red box &amp; Netflix, I approached this movie with expectations being real low. But almost instantly you get hooked and want to know who these characters are. The movie is a very long watch, but I forgot about the clock and just enjoyed the thrill ride. This movie has the fill and look of a big budget movie and you forget instantly that it's a independent film. I enjoyed the book and the film real gives a great visual to a perfect story. The acting was great by everyone, the fresh talent they collected for this movie was spot on. I feel this movie will launch a lot of great talent into the stars. If you have the time and your even thinking of watching this movie, do it.","user":"stevesoublet","rank":[9,15]}]