[{"title":"A Damn Good Prequel to a Great Sci-fi Series","rating":8,"date":"13 November 2012","review":"For something that was made to air over the internet and be released on disc a few months later, Battlestar Galactica: Blood and Chrome is a spectacular and valiant effort that comes out on top. There isn't much for me to say about the series, besides its great music, astounding visuals, and intense action, but that fans of the series MUST see this! Purchase the full extended cut when it's released in February; it'll be worth it, especially since the series is getting better with every segment released on Machinima.<br><br>P.S. To anyone that is or is going to watch this, try to get more viewers to see it because if there are more, then they might greenlight the full series","user":"slayerjmk95","rank":[78,102]},{"title":"BSG back again and strong","rating":10,"date":"10 November 2012","review":"First of all i want to say how thrilled i am that they got lift off with this show.<br><br>As a fan i am prejudged of course, but the first episode promises very much. It has a good atmosphere around it.<br><br>With David Eick and Bear McCreary mixed in the soup in this show, it will be without a question of a doubt very top notch.<br><br>The acting is solid, the CGI is staggering. It was a little getting used to, to the new William Adama. That's just personal, because i liked the small role of the old actor who played in the minisodes very much. His eyes in the cockpit of that viper, that one moment(the fans know what scene i mean), they where so very alike those of Edward James Olmos . But after seeing this spin off it's long forgotten. <br><br>I am hooked again. <br><br>Just one thing. Please don.t cancel this one!!","user":"nemod12","rank":[81,107]},{"title":"A non fan (more balanced) review","rating":7,"date":"10 January 2013","review":"When I was a kid I watched the old BSG and I watched all the new BSG episodes which I enjoyed (except for a few twists that felt written by the writers who also wrote \"Lost\"). I skipped Caprica because the storyline sounded to much like a soap opera to me (forgive me if I was wrong).<br><br>Blood &amp; Chrome appealed to me and kinda delivered what it was; An enjoyable BSG story, arguably not quite ready for TV. The acting was solid enough and the soundtrack and space battles were even a little even better. I do have some mixed feelings about the general impression it left on me; Although the camera work was sometimes quite similar as 2003 BSG series, it somehow didn't match it's original feel. I think it's the lack of proper CGI, original sets or maybe bad lightening. Sometimes the background seems to be moving in a way which doesn't correspond with the foreground. Sometimes the control sticks in the cockpit looked more like painted computer joysticks.<br><br>That doesn't take away that B&amp;C is enjoyable enough to keep watching until the end. If you like BSG, I'm sure you will like this. Just don't expect too much of it and you will be fine.<br><br>7/10","user":"jarlian","rank":[34,45]}]