[{"title":"Borderline incoherent, incomprehensible & one of the worst-edited films ever","rating":2,"date":"20 October 2017","review":"What happened to this movie ?<br><br>That's a much more interesting question, than anything this destroyed artifact has to offer<br><br>Everything about this project looked so good: World class cast, director, cinematographer, editors, producers, writer, all based on a bestselling thriller: I couldn't wait to see it.<br><br>Executive producer Martin Scorsese even wanted to direct it himself years ago, so it couldn't possibly be bad, because that man knows his stuff, right?<br><br>I didn't read the novel and avoided any plot description because I wanted to enjoy a good thriller without knowing too much. But if anyone tells you, that he 'understood' the plot and character motivations of this mess, then you know he's lying or he's talking about the novel.<br><br>The director Tomas Alfredson - who did such a fantastic job on \"Tinker, Tailer, Soldier Spy\", which was hard to follow sometimes, too, but did make sense - said in an interview, that 10-15 % of the screenplay were not shot. No joke. And these were pretty important pages, it seems, because the lead characters sometimes behave in incomprehensible ways. What the motivation of the killer was, is still an enigma to me.<br><br>Because key scenes were missing, the producers probably thought: \"Hey, we'll just hire the best editors and they'll solve the problem somehow!\" Thelma Schoonmaker and Claire Simpson are indeed two of the best editors in the world, but if not even they could construct something like a story out of the footage, then something went deeply wrong during the shoot.<br><br>The footage itself looks great. Oscar winner Dion Beebe is at the top of his game here and every shot is artfully composed and feels just right: Cold, sinister, grey, realistic, but still beautifully stylized. We are talking here about award-worthy cinematography, no less.<br><br>The acting is good, too, especially the beautiful Rebecca Ferguson and Michael Fassbender, who is too young for this part, but gives a decent performance.<br><br>Yes, there are some ridiculous scenes, especially the idiotic showdown, where Harry Hole survives and catches the killer by pure coincidence, but good producers could have fixed this through re-shoots. They didn't even try, it seems. They just gave up, because it was a lost cause.<br><br>How could the producers, screenwriters and director destroy a project that had so much going for it ?<br><br>This is one of the worst films of the year &amp; one of the strangest film artifacts ever released in cinemas. It could serve as an example for filmmakers how NOT to edit a film or how NOT to tell a story.<br><br>I only gave it 2/10 because of the cinematography &amp; I felt sorry for the actors.<br><br>A crime against cinema.","user":"John-564-342449","rank":[188,245]},{"title":"A disaster","rating":3,"date":"11 October 2017","review":"The Snowman is a disaster. It's not only a disaster, it's an unfathomable disaster. This film had absolutely everything going for it. I've not read the source material, that the film is based on, but it's being hailed as one the best books in its genre here in Norway. The director, Tomas Alfredson, has made some great films in the past and the cast is great. Yet the film is a complete mess.<br><br>The film actually looks unfinished. It looks like they had a version ready to go, but then some of the countless number of producers stepped in and told them to redo the whole film. Only that it wasn't enough time for them to actually make the new version comprehensible. There are scene transitions that are shockingly bad. Scenes that arrives and ends out of nowhere. Scenes that are included into the film for some reason that no one knows. Scenes that serves absolutely no pay-off, and are sort of just there for being there's sake. If one then takes a look at the trailer to the film, one can clearly see that huge parts of the dialogue and that some of the scenes from the trailer have been cut out of the film. This tells me that there are huge chunks of material left in some editing room out there, that probably would have caused the film to feel a lot more comprehensible.<br><br>It wastes no time on character development. These type of films requires that audience manages to get inside the lead characters head. We need to be a part of the investigation. We need to feel the frustration and hopelessness of the characters. There's quite simply no emotion here. There's nothing to hold on to, and nothing to make you invested. Michael Fassbender's character features a lot of traits that ought to make him an interesting protagonist, but none of it is explored. It's actually quite baffling to see how neglected it all is. The Snowman got a wide range of characters, but none of them serve any other purpose than to serve the plot. Some of them doesn't even feel needed for that sake. Val Kilmer is one of the most useless characters I've seen in quite some time. For some reason, he was even dubbed.<br><br>The whole film is entirely built around the plot, and leading up to the revelation of who the snowman killer is. Unfortunately, the film does a poor job of building up the suspense. It's quite frankly boring in huge parts and the revelation is predictable. Aside from the lack of character development and invested emotion (which is very much needed in order to care for a story), the film does a poor job in showcasing the investigation. Too many of the characters are doing things just because. Too much of the film is happening just because. There's very rarely given any reason for why things are happening. The overall plot is easy enough to follow, but in terms of logic it becomes a confusing mess.<br><br>The Snowman is a mess. It's hard to understand how they managed to mess it up so badly, but they sure did. Aside from some neat visuals and a decent (if slightly forgettable) score, there's not much to enjoy here.","user":"Bml-93","rank":[289,398]},{"title":"A true oddity of bad filmmaking","rating":2,"date":"12 February 2018","review":"How The Snowman became the film it ended up being will likely forever remain a great mystery of bad movie history.<br><br>The Snowman's director Tomas Alfredson has publicly stated that his movie makes no sense, is missing a large percentage of its script due to filming time constraints and generally has stated that this is not the film he intended to make but that's no real excuse for the sleep inducing police thriller we get here.<br><br>That The Snowman has been so universally panned and lamented is not surprising, as Alfredson is a filmmaker whose got run's on the board with brilliant vampire tale Let The Right One In and the great cold war thriller Tinker, Tailor, Soldier, Spy, but his not the only reason why so many were genuinely surprised by the downright blandness that was this adaptation of Jo Nesbø's famous series of book's.<br><br>Starring Michael Fassbender (whose literally never been less charismatic or uninterested looking and is now officially in dire need of a hit) and such co-stars as J.K Simmons, Toby Jones, Val Kilmer and Rebecca Ferguson, produced by Martin Scorsese, scripted by competent screenwriters that includes Hossein Amini and even edited by Scorsese's long time editing master Thelma Schoonmaker, The Snowman has all the talent in the world and manages to squander it in a genuinely frustrating and uninvolving fashion as we slog through 2 hours of an indescribable mess of proceedings.<br><br>The Snowman may not be the worst film of 2017 but it's clearly the biggest waste of potential and Alfredson's claims that some hugely important parts of the story weren't even filmed don't seem too far off the mark as characters come and disappear, important story strands are seemingly passed over, while the central story of a brutal killer building snowman with severed human heads whilst taunting Fassbender's alcoholic detective Harry Hole with letters and phone calls just never becomes even slightly thrilling or engaging against all the odds of it doing so.<br><br>It's a bizarre experience witnessing a film with all the elements of being something of note and just never taking hold on any facet of its being, Alfredson ads no flair or imagination from behind the camera, Fassbender sleepwalks through his turn, Marco Beltrami's intrusive score annoys from the outset, even some badly computer generated seagulls look like they've been animated by Microsoft Paint.<br><br>With everything and everyone in The Snowman failing to make a mark or even give off the vibe that they care, it makes you wonder if this was a case of no one really being truly invested in making a good film, or at the very least thinking that it would all just fall into place with the minimum effort exerted, proving that you can have all the talent assembled and still make a downright poor excuse for a feature.<br><br>Final Say - <br><br>Not 2017's worst film but certainly the most disappointing, The Snowman could've been (and really should've been) one of the year's best thriller's, that not only had audience's on the edge of their seats, but eagerly awaiting more Harry Hole adventures in what's clearly supposed to be a franchise set-up.<br><br>What we get instead is a movie more likely to lull you into a sleep, than raise any form of interest or suspense.<br><br>1 fork out of 5","user":"eddie_baggins","rank":[94,131]}]