[{"title":"Pretty good","rating":20,"date":"20 November 2011","review":"When we think of WWE we think of yelling, threats, boasting, deception and all around monkey business, so when we realized this was a WWE film we didn't expect much. To our surprise, we found this to be very enjoyable romp. Plenty of action, humor and some pretty good lines in a plot that was just a bit different. Upon the death of their father, four siblings who have a mutual dislike for each other — make that can't stand one another — are forced to work together to a greater end. This opens the door to some pretty good situations. There were some good scenic shots too, along with with pretty girls and horses. What more do you want in a DVD?","user":"cm-albrecht","rank":[22,35]},{"title":"A very funny movie how a dysfunctional family works together to get 3 million dollars. John Cena is actually funny in it. I say B+","rating":8,"date":"8 November 2011","review":"\"What are the 3 of us gonna do together for 2 years without killing each other?\" After the death of their father 3 brothers are reunited with their sister and get news about the will. They will each inherit 3 million dollars, if they can work together for 2 years. That's where the problems begin. This is a very surprising movie. Very funny and enjoyable throughout. Nothing really that amazing here but very entertaining. This is the type of movie that you can predict what happens next as you watch, but that does not hurt the movie at all. This is a different type of role for John Cena as it is more comedy oriented but enough of him beating people up to appease his fans. This is not a movie to rush out and watch, but this is one that you will not be disappointed when you see it. Overall, a very funny and entertaining way to spend an hour and a half. I give it a B+.<br><br>*Also try - Italian Job","user":"cosmo_tiger","rank":[27,45]},{"title":"The Reunion: I was bamboozled!","rating":6,"date":"17 March 2018","review":"I often watch literal pick &amp; mix movies where I have no idea what is, not even the films name. Because of this I often watch some truly poor stuff, often stuff that isn't even on IMDB and I end up adding it myself.<br><br>All was going well, then suddenly John Cena pops up on screen. Let me be clear I'm a wrestling fan so maybe I'm bias but I truly cannot stand this human being so I immediatly expected bad things from The Reunion.<br><br>It did however have Amy Smart &amp; Ethan Embry to counter balance the albino hulk so all hope was not lost.<br><br>It tells the story of four half siblings who are brought together through the death of their father and the adventure that it leads to.<br><br>The plot, not entirely original but it certainly has its moments and the writing is solid. Amy Smart alas is pretty wasted as she is a very bit part considering she's arguably the biggest name in the movie. No folks I'm not acknowledging Cena, he's a crappy wrestler who occasionally pops up in films, big wrestler....not so big actor.<br><br>This is another WWE films production and their films have been hit and miss since day one. They've done some really enjoyable ones and they've done some stinkers, this is somewhere inbetween.<br><br>If the \"Doctor of Thuganomics\" had been cast with you know.....someone who could act then maybe this would have been better. Regardless it's a decent enough effort.<br><br>The Good:<br><br>Some good cast choices<br><br>Couple of great moments<br><br>Solid writing<br><br>The Bad:<br><br>John Cena<br><br>Could have been a tad more original<br><br>Things I Learnt From This Movie:<br><br>One punch knocks out the average human being<br><br>I can't take Michael Rispoli seriously anymore, While You Were Sleeping (1995) and his shoe fetish has done irreparable damage<br><br>John Cena in a cowboy hat somehow looks even more ridiculous than usual, I'm surprised WWE aren't making garish colored ones and selling them as his merchandise.","user":"Platypuschow","rank":[8,11]}]