[{"title":"Who told Kristen Stewart she could be an actress?","rating":6,"date":"5 June 2012","review":"The movie is good (not great, though), specially because of the visual effects and Charlize Theron acting. She is great, beautiful, impressive, plays her role full of passion, as usual. Also I think there was no need for a 127 minutes picture. It could last less time, because in some moments I felt like they were just dragging it for no reason. I expected more, but all the problem is with Snow White choice. Kristen Stewart is like my refrigerator, no matter what I put in it (milk, soda, eggs, vegetables, meat), it is and it will always be a refrigerator. And so is she. She is always the same, no matter what role she is playing. If she can be an actress, so can my refrigerator. They are both cold and have no expression.","user":"marcia-varaschin","rank":[479,605]},{"title":"Bad casting killed this one for me...","rating":3,"date":"1 June 2012","review":"Well I saw huntsman the opening night, midnight showing. I went into it expecting something amazing. It was...alright. Honestly the visuals were really good. I enjoyed the how well Chris Hemsworth and Charlize Theron portrayed their roles and drew me into the story. The little girl that played Snow White at the beginning had me entranced, and everything was going great - then she grew up.<br><br>Kristen Stewart as the female lead really ruined the whole film for me. She was depressingly emotionless and despite everyone in the film's world wanting to save and protect a otherwise unlikable character due to the character's performance, left me neither identifying with nor liking the character. I felt for the little girl at the beginning, who was easily 5 times the actor Kristen Stewart was in this film. <br><br>Everyone I went with felt the same. <br><br>Throughout the film she is very quiet, and what lines she has aren't memorable at all (again, no emotion). Chris Hemsworth pours his heart out to her in one scene, and while she was asleep and ultimately it was his kiss that woke her...she goes on, cold and emotionless - feeling nothing for him. Very sad, as the first 10 minutes had me very excited for the rest of the film - but then it just fell apart when she failed time and time again to react or become a likable character. <br><br>She acts the same in the Twilight movies, as far as I understand - so I'll continue to stay away from those as well. The rest of the movie was a good production, though it dragged a little at parts. To avoid the same problem in the future, I will simply abstain from anything Kristen Stewart is in. If you want to see this, but haven't seen say - Avengers, see that instead.<br><br>I'd wait for Redbox on this one.","user":"xalterax-mc","rank":[502,684]},{"title":"Entertaining but weak plot","rating":1,"date":"4 June 2012","review":"As a huge fan of fantasy books and films, I had very high hopes for this one... Especially when people said \"oh, you liked Lord of the Rings? You'll love this!\" The verdict? I now know who *not* to listen to next time. If your tastes are similar to mine, you tend to read the books before watching the movies and you don't really follow particular actors. So, really, I had high expectations for this film - and that might've been the problem... Charlize Theron played the evil queen well but I would've loved it if the film had delved further into the queen's history as several ideas were started but never really explained (I have a decent imagination but I don't really think, as a viewer, I should be entirely responsible for thinking up ways to connect the dots). For instance, why is the Queen able to feel everything her brother feels? Why did her mother decide to give her the spell rather than both her and her brother or just her brother? And why, once we get into the meat (or the attempt at the meat) of the story, did the Queen spare Snow White's life when she didn't yet know Snow White was \"the fairest\"? And if she did know, all the more reason! Why spare her?? The Huntsman was, I would argue, the best developed character - at least in comparison to the others. At the very least, you knew enough to explain his drinking problem and his bitterness... That said, his wasn't an overly complex character to portray. For exactly that reason, it seemed more than a little ridiculous that the Huntsman *alone* carried the romantic scenes between he and Snow White. For instance, at one point, as he leads Snow White through the forest, he takes a knife to her skirts (apparently he thought they were getting in the way). Snow White stares blankly at the Huntsman and it is only once he says \"don't flatter yourself\" that you realize the emotion Snow White was supposedly showing was chaste shock. Granted that, perhaps if I was more familiar with Kristen Stewart's acting, I might have recognized what she was portraying, but, on the other hand, I'm more of the mind that I shouldn't need to know your acting style in order to recognize so basic an emotion. This kind of jarring (not in a good way) and unbalanced acting was repeated at the end of the film when Snow White is crowned and the Huntsman enters the room. Looking at Snow White, one sees only a blank yet tearful smile, but when The camera turns to the Huntsman it dawns on you that there was supposed to be some sort of moment passing between them. All in all, the chemistry existed only on the side of the Huntsman, leaving much to be desired from Kristen Stewart's portrayal. And that, of course, brings us to Snow White. The character seems to borrow much from Joan of Arc to the point that one might wonder if she wondered into the wrong film. There is an attempt to develop the character but Ms Stewart seems to be little able to carry the development of what might have been a very strong female character. The only hint of real strength comes with Snow White's battle speech which would've been fantastic except for the utter lack of build up to this newfound strength of character. So, in spite of the best intentions, this moment came across as contrived. If only Kristen Stewart had managed to keep up that pace of energy throughout the rest of the film, it might have been more believable. So, unfortunately, though I had high hopes, I actually found myself rolling my eyes frequently and feeling a bit like I was watching someone show off all his \"super awesome\" visual effects - which *was* pretty cool... Just not enough to carry a story. In conclusion, if you count yourself as one who likes a good plot, great character development, and strong female leads... Either lower your expectations or skip this one entirely.","user":"labecker-388-190157","rank":[181,268]}]