[{"title":"Will probably be regarded as a \"so dumb but so funny\" comedy.","rating":8,"date":"7 August 2013","review":"There's nothing to it, if all you're looking for witty/clever/subtle/deep humor, and you hate sexual/stupid/slapsticky type humor...you will probably still like We're The Millers.<br><br>It's not a gold mine of comedy by any means, but it did the job it told us it would do: Make us laugh and give us a fun ride. They really brought together a dysfunctional family and did it in a way that allowed for some suspension of disbelief. A lot of comedies nowadays have those hit or miss scenes where you either laugh, or you just can't suspend your disbelief and you're sitting there like \"Really? Really? She's gonna poop in the sink?\" (guess the reference). We're The Millers is pretty much a compilation of those kinds of scenes that hit just the right tone to pull it off as funny, clever and it just kinda grows on you. <br><br>The \"family\" we see on screen for most of the surprisingly high 109 minute runtime is in a lot of ways funny, in some ways disgusting, and in a few ways charming. The film just works with the pairing of Sudeikis and Aniston, as we saw for a tiny bit in Horrible Bosses, which to me is one of the funniest movies in a long while. If you liked Wedding Crashers, or Hot Tub Time Machine, chances are you'll like this one, which was written by the 4 screenwriters who worked on those films. The 2 pairs of writers who have a history with comedy throw some subtle humor in the dialog which you probably won't get if you're not paying enough attention, which allows for every comedy lovers dream: To be laughing out loud, then hearing an ever so subtle joke causing you to laugh harder, then hearing another one and another and another. The film was consistently funny in a sense that when it got me, it REEALLLY got me.<br><br>Overall, the film is just a slight bit lovable, with characters you actually kinda like...not too common for a modern comedy. More so than the story, the laughs came interspersed well enough to where I can't complain because I did way more laughing than I expected. It wasn't \"rolling on the floor\" funny, but I did have some hearty laughs out loud.<br><br>Recommended to anyone who enjoyed the previous works by the screenwriters.<br><br>7/10<br><br>EDIT: I ended up seeing it a second time and tried to pay attention to all of the funny subtlety of one-liners and witty remarks by characters throughout, and I laughed very hard at quite a few things I didn't catch the first time. I liked it more the second time and raise my rating to an 8/10. Is truly a very funny film.<br><br>8/10","user":"naregian","rank":[215,273]},{"title":"Finally!!! A solid comedy!!!","rating":8,"date":"20 August 2013","review":"I have to admit I didn't expect to like this movie as much as I did. I laughed during the whole movie and truly didn't notice how did the time pass by. For me this is the best American comedy I've seen in the past couple of years. Very well directed, very good cast. The movie is very casual but at the same time so full of content. I can't come up with any flaws in it. It was not gooey like you would normally expect. Jennifer Aniston was just marvelous as always. I also liked Will Poulter very well. <br><br>I recommend the film to everyone, not only comedy lovers (I'm surely not one of those).","user":"Iv_Genchev","rank":[186,246]},{"title":"Surprisingly Entertaining","rating":10,"date":"9 August 2013","review":"I was really excited to see this movie when I saw the trailer, because I thought it looked hilarious, and I'm a huge fan of Jason Sudeikis and I absolutely adore Jennifer Aniston, and I can guarantee that it does not disappoint. It was actually better than I was expecting it to be, because you don't usually expect much from drug dealing comedies. The plot in this was actually pretty clever, and to be honest Will Poulter's character Kenny really makes the entire movie. He played it so well, and he was perfectly awkward and strange, it was hilarious. It was definitely one of the best comedies I've seen in a while. Sure it did have some corny moments that are unrealistic, but I overall enjoyed the movie.","user":"ggibson63","rank":[211,293]}]