[{"title":"Basically a remake of the original but I did laugh quite a bit. Not as good as the first one at all but worth seeing.","rating":6,"date":"25 February 2017","review":"\"It's starting to feel like Christmas.\" Willie Soke (Thornton) has been living a whiskey filled existence since the double cross he experienced during Christmas a few years ago. When his old partner shows up and wants him to get back into the game he agrees because he's Willie. After realizing that their new partner is his mother (Bates) he second guesses the entire thing, but the chance of stealing millions changes his mind. Everything is going to plan, until Thurman shows up. This is a movie that I changed my opinion on after watching the special features, which never happens. While watching it I did laugh, but it was basically the exact same movie as the first one. No twists were surprising and even most of the jokes were reused. I loved the first one and did enjoy this but kept thinking, this is just another sequel that seemed to be made to make money off a name and that's it. While watching the features Billy Bob said that this is a movie made for fans of the original. He said the movie was made with them in mind and if they get new fans that's great but it wasn't the goal of the film. After hearing that context I have to think the movie did what it set out to do. That being said, if you liked the first one you will like this as well, nothing new but just a funny movie with heart that is worth your time. Overall, basically a remake of the original, but I did laugh quite a bit. Not as good as the first one at all but worth seeing if you are a fan of the first one. I give this a B-.","user":"cosmo_tiger","rank":[25,30]},{"title":"Billy Bob in a Santa suit. Thanks Santa!","rating":6,"date":"24 December 2016","review":"First of all, I loved the first one. My absolute favorite Christmas movie of all time. Most other Christmas movies are about magic and all that. How about some realism, dosed with cynicism, sarcasm, curses and other insults? Now that's what Christmas deserves and that's what we all deserve for Christmas. <br><br>Some of the comments referred to the first movie as *the original*. Not quite accurate, because this is no remake. <br><br>Two reasons I liked this one too:<br><br><ul><li>Billy Bob &amp; Tony Cox .. a dream combo .. foul mouthed and screwed up to the bone. I'd watch these guys just sit opposite each other and talk trash to each other for days.</li></ul><br><br>And one more thing: Of course this movie can't beat the first one. Also, it doesn't need to. It's fun. That's what any holiday should be about. I had fun watching it. Merry Christmas!<br><br>6.4/10","user":"sanjin_9632","rank":[25,33]},{"title":"For me both thumbs up","rating":8,"date":"22 December 2016","review":"I never ever tried to write movie review but for this movie I made exception.As for me it was hilarious the jokes the acting all original.people have to judge the movie by the current age and content standard we are watching over the cinema or TV.Now days its very difficult to find such a movie where you will laugh like a kid. If you want to watch this movie watch it like a dumb kid not like a rocket scientist.Don't behave like over smart ass critics looking into so much deep for something which isn't there and then blame it on the movie.This movie is for fun for few good laughs not intent to win The Oscar.Like a meal at the food truck as compare to fine five star restaurant.So for me I will rate the movie 8 out of 10 .Have fun guys.","user":"afraheemyaqoob","rank":[51,81]}]