[{"title":"An ambitious film which for the most part delivers spectacularly","rating":9,"date":"18 May 2012","review":"Saw this just now in a small indie cinema in Heidelberg, Germany and I have to say, it was a romp. In my humble opinion this film manages to be both Wes Anderson's funniest picture so far and his most melancholic. The utter uncompromising stylishness of his other work is also present here, perhaps even heightened, but in contrast to The Life Aquatic (and to a certain degree The Darjeeling Limited), the emphasis here is firmly on plot. The brave and often odd visuals never overwhelm the story and the audience never feels like they are not quite in on the joke, like in The Life Aquatic. The tone does tend to become a bit erratic, especially in the last third of the film when Anderson seems to want to pack so much into every frame that the film becomes a bit cartoonish at times (hence the not-perfect score from me). All in all, though, the plot is very balanced and the pacing is great. The two young leads are superb and the brave move by Anderson to place unknown actors front and centre pays off beautifully. The rest of the cast is on paper even more star-studded than The Royal Tenenbaums and yet Anderson never steers into unnecessary character development just to accommodate his stars. A touch here and a touch there are more than enough to paint a picture of a group of people who are eerily similar in their dissatisfaction with their lives and yet react quite differently to the two young lovers' dash (literally) for happiness. In conclusion, a must-see for Anderson fans and highly recommended for everyone else.","user":"sneakydude","rank":[272,329]},{"title":"Moonrise Kingdom will leave you dreamy and smiling, with a hint of melancholy","rating":10,"date":"17 May 2012","review":"Let's try to understand the miracle I have just witnessed. Director Wes Anderson is 12 years old, has just experienced his first love while at Summer camp, and immediately rushed to a camera to tell us, his pen pals, the story. A slightly embellished story which follows the perfect scenarios we would draw at night in our beds at this age. It has all the tiny details, the sense of adventure and the freshness of youth. How someone 43 years old in real life could do this movie is beyond me. The drawback of this miracle for the viewer is that such a jump back into the kind of idealized feelings you had in your early teens leaves you with quite some melancholy when you leave the cinema.<br><br>It could be that some people do not connect to the movie and just see it as \"adorable\" or \"cute\" and nothing more. But I suppose most people will feel connected, notably because the movie has this straight-to-the-point attitude in both the technique and the story-telling; the story is read to you, not force-fed with dramatic music and whatnot. Just like one of the characters who reads bedtime stories to the others.<br><br>You might complain about the lack of character development for some of the big names in this film (Norton, Willis, Murray - McDormand less so as she gets more detailed screen time than the others) but I suppose this is wanted: kids will see hints of the issues adults are facing, but can't understand them fully. And remember this is a movie shot by 12-year old Wes Anderson.","user":"emilson-1","rank":[317,395]},{"title":"Possibly Anderson's best film in terms of style.","rating":8,"date":"4 June 2012","review":"The year is 1965 and a remote North Eastern coastal community is plunged into confusion when it discovers that two kids have run away. Sam, a discontented Khaki Scout, and Suzy, a put-upon older sister and forgotten daughter, abscond into the forest to escape their dissatisfying existences. The responsible adults – Sam's Scout Master Ward (Edward Norton) and Suzy's parents (Bill Murray and Frances McDormand) – and the entire town set out on a frenzied search, which gets wild when the largest storm in recorded history touches down and puts everyone's life into question. What ensues is a battle between youth and age, hope and disillusionment, faith and cynicism.<br><br>In terms of story and character, Wes Anderson's previous films, especially The Royal Tenenbaums and The Darjeeling Limited, are superior. Even in the most compelling relationship in the film between Captain Sharp (Bruce Willis) and Sam doesn't embody Anderson's ability to take his characters into deep emotional places of hurt and healing without melodrama. However, the newest addition to the Anderson canon is a cinematic experience.<br><br>Moonrise Kingdom's story, co-written with Roman Coppola, takes a definite backseat to style, as Anderson saturates the entire film with a \"Norman Rockwell-type of Americana\". Stylistically, it may be Anderson's most masterful work, as the costumes, sets, and settings transport the viewer to an alternate universe, a place of wonder and adventure. The soundtrack is especially effective, as it recalls a time when things were simpler: Hank Williams was on the radio, and children listened to records instead of playing video games. However, Anderson isn't content with reminiscing about the year 1965. He takes this nostalgia and twists it, infusing the film with a twinge of sadness through the reality of life's disappointments. He doesn't reject the Rockwellian view of America, but argues that it doesn't tell the whole story.<br><br>Moonrise Kingdom is that place of beauty and passion that we all have been in at least once in our lives – the one place on earth where we believe that anything is possible. It has since been lost, but it persists in our memories in moments of nostalgia.","user":"hipstercritic","rank":[128,172]}]