[{"title":"Two immortal lovers reunite after years of separation.","rating":10,"date":"1 January 2014","review":"Yes, Only Lovers Left Alive is another vampire movie. Yes, the characters are very pale and old and romantic. Yes, it is very much full of clichés and stereotypes. However, it is also wickedly smart, beautifully shot, filled to the brim with talent and full of cultural witticisms.<br><br>Tom Hiddleston is Adam, Tilda Swinton is Eve and Jim Jarmusch is a genius. This is a director that tells us all we need to know without doubting our intelligence. He allows us to fall into the depths of the film without worrying about a perfectly neat beginning, middle and end. He even stops his characters from following tedious and predictable patterns, because after all, they're too old for that.<br><br>This is a movie for film lovers and pop culture enthusiasts. It is a vampire film that takes advantage of its time span; cultural references dating back hundreds of years can be found at every corner. Only Lovers Left Alive does not focus on blood and gore, it is not a thriller nor a horror, it doesn't even truly focus on the world of vampires. Instead, Jarmusch studies the eternal, he explores the quiet, perhaps boring, every day life of a modern, intelligent and ancient being who has, quite literally, seen it all. <br><br><ul><li>Sinann Fetherston.</li></ul><br><br>You can find a full review at MoviefiedNYC.","user":"sinann-4","rank":[261,341]},{"title":"hollow shells","rating":6,"date":"17 January 2014","review":"Wonderful imagery. style and atmosphere in the extreme. great acting. Beauty in many forms: you get a lot for your eyes. Also, depending on your taste in music, there is also a lot for your ears.<br><br>For your brain, sadly, not as much.<br><br>\"Only lovers left alive\" is filled with a lot of name-dropping, by word, picture and sometimes sound. Whether you find that fascinating or pretentious depends on your taste.<br><br>But what this movie really lacks is a story. The characters are throughout and the dialogue may be scarce, but has some dry humour and snappy lines. That doesn't save it from going nowhere. Glaring plot holes may make you cringe at times. And the pacing looks like Jarmush tried to surpass Kaurismäki in terms of slowness. If so, he won.<br><br>So perhaps this movie is best tasted in the state its protagonists enter after relishing an excellent glass of blood: dazed, blissful, and somewhat drugged.","user":"JW-30","rank":[254,362]},{"title":"A stunning love story between two undying souls","rating":10,"date":"16 November 2013","review":"This is Jim at his utter best. The balance between emotive writing and gentle quiet spaces within the script are total perfection. The characters are well rounded and very easy to empathize with, which is surprising for a couple of centuries old vampires. There is none of the usual gaudy over the top vampiric crap that usually fills these types of movies. It's a love story at heart and one that does a fantastic job of balancing itself so that the intimacy shown on screen is divine taste of these interesting characters lives without falling over the top into some strangely perverse romcom. There is humor and and satire in abundance, though it is never cheapened or thrown into the mix to fill a gap. No this film in entirety is sweet and humbling. The sets are rich and perfectly put together, the performances are flawless from each and every member of the cast no matter how long their involvement. This movie is the type that causes you to want to crawl into it's story and settle down to live within it.","user":"dance-party-kgb","rank":[182,272]}]