[{"title":"Cheesy, but not quite terrible","rating":4,"date":"7 June 2012","review":"Being a big fan of the first game, Dragon Age: Origins, I was intrigued by the idea of a feature-length film set in the same universe. Unfortunately, this movie was closer in quality to Dragon Age 2. Which I suppose I should have expected, given that EA isn't separating themselves from Bioware any time soon.<br><br>But I digress. Dawn of the Seeker consists of some decent action scenes interspersed with mostly predictable plot twists and one-liners. The 3D cel-shaded animation style works at times, but at others can confuse what is happening on screen, or look somewhat shoddy. The characters' mouth movements don't quite match the dialog, but that's sure to be a product of the Japanese dubbing rather than the animation itself.<br><br>There were plenty of times while watching that I thought about just stopping the movie and leaving to do something else, but the story and setting transitioned just often enough to keep me going. Now that I've seen it once, however, I can say with confidence that I don't need to see it ever again. It was passable, but there are any number of better anime series/movies out there that you can turn to for better action scenes. Same goes for the story.<br><br>My recommendation for anyone who is a big fan of the Dragon Age universe, meaning both games, is to rent it. Certainly not worth a buy. For anyone else: skip it outright.","user":"Archlicht","rank":[29,35]},{"title":"A wasted opportunity.","rating":4,"date":"7 July 2012","review":"I'm a pretty huge Dragon Age fan, including playing the games and all their DLC, reading the books and just finished watching the online movie/mini series Redemption and Warden's Fall.<br><br>This one was pretty bad guys. I actually liked the style of animation, that type of judgement just comes from a person's taste though. As for story... nothing you haven't seen before in anything else. I was fine with it, even forgiving and liked learning about the main protagonist (Cassandra from DA2) up until the movie just started changing Dragon Age lore.<br><br>The mages were ridiculous. They continued the already established lore of Templar's wanting to \"confine\" all mages due to their very powerful magic, except with the exception of one mage, they were all worthless. There are fight scenes with multiple mages and all they do is swing a staff at people. At Templar's. Templar's wearing full plate armor, with shields, who are trained specifically to destroy mages. Yet, half the time, the mages aren't losing these battles. And these aren't even Blood Mages! How someone thought this made any sense is beyond me.<br><br>Another huge issue with this movie is a ridiculous scene about halfway through involving Cassandra. Anyone who has ever touched Dragon Age Origins knows that Ogre's and Golem's are some of the toughest opponents to take down, involving a party of characters with different skill sets to defeat. Yet, Cassandra takes on about 20 of these creatures by herself without anything other than a cut on her leg to show for it.<br><br>If that isn't enough to make any Dragon Age fan stare at the screen utterly confused, the climax of the movie involves the writers just throwing in Dragons. Like five of them just showing up to get slaughtered by - yep, you guessed it - Cassandra. She's apparently from a clan of \"Dragon Hunters\" which is ironic because according to Dragon Age lore, Dragon's are almost never around, making that sound like a pretty useless clan. However, her elite Dragon Hunting skills of \"jumping on the back of a dragon and stabbing it,\" seems to be the only thing needed to fell one of the beasts, making it an interesting thought as to why no other person could easily call themselves a Dragon Hunter and do the same thing.<br><br>If you're a big Dragon Age fan, go for it, but don't expect to fit this thing into Dragon Age lore (even though Bio-ware claims it is), because this character of Cassandra, who starts with an interesting back story quickly develops into the most far fetched character in the Dragon Age lore.<br><br>I recommend checking out Warden's Fall on you tube though, pretty neat mini series and definitely more deserving of your time than this.","user":"Canadyan","rank":[14,17]},{"title":"R.P.G gamer review","rating":5,"date":"5 June 2012","review":"I will try to make a point here, I'm not an English speaker but i will do my best. As a big r.p.g. game fan, from Baldur's Gate till Dragon age Origins, I have to say that i didn't like this movie. I didn't expected much, the animation is OK, and the voices are somehow realistic. But the rest is a huge flaw, specially the characters and the story. Let me give you an example: Mages in this movie don't use magic to fight.... they fight hand to hand against knights!! Another example are the enemies, like the Ogres and Golems which are shown barely weak , slow(ogre) and fragile. I seriously doubt that the people involve in this movie knew the characters types and the context.","user":"hduality","rank":[39,55]}]