[{"title":"My Review Of \"Motivational Growth\"","rating":8,"date":"16 September 2014","review":"Don Thacker's \"Motivational Growth\" is a bizarre hyperbole-truly modern. Honestly I think the film will be this generation's \"Little Shop Of Horror\", just replace the singing with fun animation graphicsrife with Adult Swim quality humor. Actually take that film and shakeit with some \"Stay Tuned\" and you have the perfect horrortini for your maturing viewing pleasure. It is a story of madness in true-to-form dark, satirical entertainment.<br><br>The story follows Ian Folivor, a depressed, recluse with a strong agoraphobic agitate. The film plays out in a strange spectacle of narration, animation and melodramatic adulation of phobias. The antagonist to Folivor's tragic character is a talking mold build-up against the bathroom sink. Lets face it, single men (sometimes even gay men) are not the best of housekeepers. So it is just a matter of time before some bacteria or fungus is allowed to evolve into a self aware annihilator of humanity. Of course there is so much to this story thatI can't talk about as not to spoil the film. Let's just say that even though the premise, at times, seems predictable or flagrant, it still manages to carry some very entertaining and surprising moments. It is just a fun story, that is executed wonderfully by Thacker both with the writing and directing. <br><br>The special effects and sound track used on \"Motivational Growth\" are both very stylized, practical effects that push the story even further into the dark, satirical wasteland. The special effects offer up some truly gross and lighthearted exaggeration to the situation at hand with Folivor's condition and circumstance. The practical effects are done nicely, reminiscent of mid 80's horror comedy stuff –notably \"TerrorVision\" . The animation and graphics used actually add a sort of hallucinogenic quality to the film's overall persona. It would have went over even more had the dude's dealer been among the series of intrusions into Folivor's sacred space. <br><br>The sound track is what you would expect. It doesn't bring anything extremely new or altered to the film, but it works to create an atmosphere equal to the kind of story that Thacker is telling in \"Motivational Growth\". Fun, entertaining, satirical and creepy. The film is a very strong, indie horror comedy that screams instant classic. The downer moment in the story was the actual dramatic interaction between Folivor and his object of affection. Had it been as out there as the interaction with the rest of the characters then I wouldn't have anything bad to say about this film. Still it is a pretty stellar horror/comedy.","user":"ASouthernHorrorFan","rank":[12,17]},{"title":"I want the time spent watching this BACK!","rating":1,"date":"1 July 2017","review":"Long time ago i learned not to trust ratings, but the story sounded interesting. I was so damn wrong. I know a lot of people who give these ratings were and are still high on weed while watching the movies and writing the reviews for them. Legalized marijuana is so bad for the normal straight (as in no drugs) people who just want an honest opinion. And then you have those self-righteous hipsters who inhale their own farts and give their poops a name and a kiss before they flush them, cause ... it is a special part of them. And that's why i am here, cause of all those people with their \"honest\" reviews and bloated ratings fooled me in to watching this movie.<br><br>So, here is my review: It's so damn boring! Movie keeps you in some suspense where you keep on waiting for this epic battle between good and evil and then it's just over. The End<br><br>Who ever said this movie was anything else is either full of themselves or high on weed.","user":"bilismit","rank":[11,26]},{"title":"Wonderful roller-coaster of emotions!","rating":10,"date":"29 September 2013","review":"I got to see the movie during a small screening in Seattle and I am glad I decided to step into torrential downpour to make it to the theater! I cringed, I laughed, I cried, I got queasy, and I had to avert eyes at certain times. This movie provides quite a healthy mix of humor and horror sprinkled with occasional scenes inducing depressive thoughts. This mix was the reason why I didn't leave with just a sense of dark dread despite the movie being so damn dark.<br><br>As a side note, the puppetry is superb (The Mold felt very much real by the end of the movie) and I've got to give props for camera work on such a limited budget.","user":"alex-804-169457","rank":[6,13]}]