[{"title":"A Hard Hitting Glimpse at Future Segregation","rating":23,"date":"23 May 2015","review":"Time of Eve was playing as part of the Scotland Loves Anime festival in Edinburgh, and my mother, brother and I watched it as part of a double bill with Lupin lll vs Conan. All I can say is. Wow. Tears were flowing out of that theatre. <br><br>In the not so distant future, androids have become a part of every day life for human beings-working as housekeepers, cooks, assistants, teachers,nannies, servers or even slaves. The androids look exactly like human beings, and can act and think like them too. However, the problem is, androids aren't allowed to act like humans and are forced to display a holographic ring around their heads to show they are androids whenever they are out running errands for their masters. A young man named Rikuo Sakisaka discovers that his woman-form android Sammy who is only supposed to pick up groceries and cook, clean and make coffee has a mysterious message in her activity logs-\"Are you enjoying the time of eve?\" Along with his friend Masukazu, Masaki, he finds that \"Time of Eve\" is actually a hidden café where humans and androids can meet and not discriminate one another. The bar lady, a girl named Nagi is one of these people who enforce these strict rules. No one wears a ring and no one discriminates. Among the café regulars are a feisty hyperactive redheaded girl named Akiko, the couple Koji and Rina, Shemei an old man and his foster child a baby girl called Chie and Setoro a man who constantly comes in to read. Rikuo's eyes are slowly opened that androids are no different than he is, but Masukazu has a harder time opening up until a distant memory makes him think otherwise. <br><br>This film's style and atmosphere is very similar to that of The Girl Who Leapt Through Time and Summer Wars. It's very soft with it's colour pallet and since it's the future, everything has this very metallic and chromed look to it. The voice actors are all great ( I only saw the Japanese/English subtitled version) and they sound as though they really are in that situation. Te characters themselves are very believable-Rikuo learns that androids are people too, but he is fearful at the advancement of Sammy's programming. Masukazu is a funny, sarcastic character, however the language he uses can be a directly drawn parallel to racism to black people in 1960s USA. His eyes take an even slower time to open before he eventually remembers THX (TEX) his old robotic nanny who cared for him more than his parents and that his father shut down like a piece of junk. Sammy the housekeeping android does what she is told ans patiently awaits orders and commands from her master. However she still sees Rikuo as more than just a master. She loves him as family, and considers his kin to be her own, thus why she is so loyal. My favourite had to be Akiko who never sat still, always got excited and behaved exactly like a real human girl, as well as Chie the adorable toddler android who constantly pretended to be a cat! \"Miaow!\" <br><br>Finally, I would like to address the themes of this film. Imagine the androids are not androids, but rather a different race of people. They do all the chores and jobs humans usually don't want to do and are mercilessly picked on and seen as something that doesn't matter and is below everyone else. Ringing any bells? The fact that they aren't treated as equals and are usually the butt of awful jokes can be equated to the treatment of black people many years ago. The ring above their heads that they are required to show whilst going out can easily be equated with the Jewish people in WW2 who were forced to wear a yellow star, shaming them, telling others to keep clear. It is very heartbreaking to think that if this IS the future, it looks very bright for some and very bleak for others, just as the 60s were to many. Even if racism amongst humans or even animals disappears completely, people will still find ways to discriminate. It's a vicious cycle. Time of Eve is a title with the meaning a \"slice of heaven,\" a place where no one judges or is judged. Outside this beautiful bubble, life for the androids are hard as hell. Akiko, a carefree teenager in the café, is still a misused, poorly treated slave to her master, a schoolboy who commands her to \"Carry my Bag!\" <br><br>Once again, the Japanese Anime industry has given us something wonderfully unique and clever. This is a perfect example that we are all equals and that racism should not be tolerated. I hope others will enjoy this and feel the same way.","user":"alixj248","rank":[11,11]},{"title":"An Excellent Head First Dive Into A Surreal World of Amazingness","rating":10,"date":"15 December 2012","review":"Well where to being.... how about with... BAM!!!! This movie is beyond fantastic and is a great exploration into our own humanity and how things do indeed change over time!!!<br><br>I first randomly discovered this movie on an anime movie forum that specializes in obscure movies that most people outside of Japan will never here about or see. Boy was I sure glad after checking it out. This has quickly become my go to favorite anime movie that I have seen to this day!<br><br>The movie is very surreal in every way and becomes very believable to a creepy point. Although long and at sometimes somber and slow it completely suites the idea behind the film and doesn't hurt the film in any way but actually adds to it and makes it even just that much better! The movie is based around the concept of human emotion and understanding. A very strong moral statement on prejudice views and beliefs, which in the case of this movie, is aimed towards androids.<br><br>In a world where androids are slaves equivalent to butlers, and are strictly scolded for having any sort of feelings or wants that is besides what their owners want. Even treated as appliances, but slowly our main character discovers there might actually be the presence of feelings and a soul inside these androids that they hide and only let out in front of each other.<br><br>Touching on some very serious tones this movie delivers some amazing moral heartfelt vibes, along with a few comedic moments here and there that are quite a laugh or two.<br><br>As far as the art goes, the movie delivers nothing but amazing outstanding visuals in every sense of the meaning. This movie is by far a must see plain and simple!!! Can not wait to get a glimpse of some more amazing work by this crew of cast and director/writer!!!","user":"ohwoahitsme","rank":[31,39]},{"title":"Deep probe into human dirty soul","rating":9,"date":"1 September 2013","review":"Well... there is many things in one simple movie. But Japanese anime are such that - deep in psychology, ethic, show parts of our behavior we won't see... From one point I can say, this movie is like prophecy. We, humans, WILL DO act and treat to our future androids and robots exactly in way, we see in this movie. Heartless, selfish, careless, most of us will consider them as \"machine, what have to serve me/obey my commands\". Nothing more. But there will be many another people, who make strong relationship with their \"machine\" - and call it whatever you want. For child is very easy to bond tightly with his/her babysitter, no matter if it's made from flesh or wires... And those people will love their \"machines\" more than love humans, some of them will depend on them very much, sometimes too much. And that become a thorn in flesh of heartless people, people who stuck in opinion \"it's only machine and it's not deserve to be loved\". As I note in summary, this movie is amazing probe into our souls, reveal our wants, feelings, dreams, nightmares or worse parts of our personality. Don't be deluded with easygoing animation/drawing. Movie is very hard to understand and once you understand message and all things what include, you'll love it. Love it so much, you probably start looking some prop from movie on internet or ebay. Such a scarf or coffee pot with name \"Are you enjoying...\" Right? ;) Because that's the moment you understand message and agree with that message, and you one of those people, full of love to things WITH SOUL, no matter if they are made from flesh or wires. For those, who want to know, what message is and didn't found it yet - watch movie again. And again. Good Luck! :)","user":"magy-4","rank":[17,22]}]