[{"title":"An experience not to be missed.","rating":17,"date":"17 May 2013","review":"Have been more than 5 months since I saw the film. But it surely got to be a film which will stay with me forever. A film dealing with a philosophical paradox doesn't sound exciting but this film totally surprised me. The paradox of the Ship of Theseus is an underlying layer of the film which has 3 stories. The characters in the film deal with things that challenge their beliefs and in unexpected ways. The beauty is in the treatment which is effortlessly unpredictable without ever being manipulative or calculated. You feel tremendous empathy for the characters which seems to come for the filmmakers deep understanding of the human psychology and behavior unlike most films/narratives where the author/ filmmaker try to 'design' a character for the purpose of eliciting emotions. Here its all so natural that there seems no design and that is the best part about the performances. They are real as well as really intriguing. I found the character of monk played by Neeraj Kabi to be specially intriguing. His is an amazingly natural performance and yet larger than life in some ways. Sohum Shah was a revelation. For once I thought that he may have been casted in the film for being the producer but when you see the film, he was just brilliant. His performance is one which is so subdued that it took me sometime to realize how good he is. Aida who plays the photographer also delivers a delightful performance. I guess her role was the most difficult as she plays a character which one cannot normally find references in real life or even fiction and despite that she delivers such a natural performance.<br><br>What is most surprising about the film is its technical finesse. Cinematography is the best you'll see, the film is a visual treat. It took me sometime to realise that the film is set in Bombay not because its a Bombay which you rarely ever see in Bollywood films. It was later that I got to know that the film was shot on a Canon DSLR and I couldn't believe it. Sound design and mixing is also top notch something which is rare for low budget productions(In Indian context even for big budget films). The background score is absolutely mesmerising and only comes when needed. Particular mention should be made of the Naham Janami song which plays in the background during the monk story. I really believe that this film deserves a big screen experience and that is why am so happy that it is finally releasing in India otherwise most would have either not seen it or would have to see it on small screens which does not do justice to this film. <br><br>I can go and on about the film but at this point will end at this note that do not miss this film if you get an opportunity to see it. You'll thank me for this!","user":"ritisamuel","rank":[52,56]},{"title":"A visual expression of Theseus' Paradox...Just Simply Amazing!!!","rating":10,"date":"24 November 2012","review":"Well, I'll keep this plain, short and simple. I have no clue why this film is rated so low. In my opinion this film is an exceptional piece of art. The director keeps you hooked on to the movie right from the very start. You might be left wondering what is happening here but as the movie reaches it's conclusion, you will be left mesmerized. Each story has its own moments, its own ideas. Each idea is so subtly and thoughtfully expressed, I was left spell bound.The overall experience watching this movie actually raises thoughts in your mind about the issues discussed so beautifully. I saw this one at a film festival and in my opinion, this was the best film in the fest. 10/10","user":"NitroJ7","rank":[35,43]},{"title":"The ship of Theseus sails the high seas!!!","rating":9,"date":"25 October 2012","review":"Anand Gandhi's debut feature film The Ship of Thesues is a rare gem in the indie cinema circle which comes out with more crap in the name of struggle and rebel than anything worthy of watching.I am not even talking of bollywood here.<br><br>Watching continuum it was quite clear that the director scores high in mixing simple philosophies of the world with everyday tales.Here he takes a philosophical paradox and extends it to three different tales that connect in the end.<br><br>The acting is brilliant,such unknown actors being able to emote so clearly in English and various languages credit goes to the director.The landscapes n locations reflect the inner conflict that the characters are going through.<br><br>It is still not in the league of Tarkovsky,Malick maybe due to lack of a strong music background but is somewhere on the steps to that house of talent where even bergmann reached.It works perfectly in the first story of the blind photographer,her inner conflict of recognition vs objectivity in art is very well summarized in some dialogues that remind everyone of a coffee talk that they must have had with their best critics and fake philanderers.Even the philosophy of the title matches perfectly with the first story.<br><br>The middle story about a monk has the strongest acting seen for a long time in Indian Cinema.The shloka by rohit sharma in jain language explains all the philosophies of the monk so clearly n cleverly.His voice, argument as well as staunch beliefs are so strongly acted out and written. The comic break from the lawyer works well in giving it a break like light n shades. What doesn't work is the monks acceptance of life against the miseries of death, though it shows that the monk is free of religious beliefs in formulating his own thoughts, there is no such strong moment of cinematic epiphany that convinces the audience of a switch over. I meant a subtle one not a overly dramatic one.And also is the failure of the philosophy of the ship of Theseus. We don't think he changes or his views change due to his liver change.in fact its his mind that changes when one of his body part threatens to dismantle the whole(that his body) on which functions his unique mind.<br><br>The last story works more as a comic n funny satire on genes working against their predetermined course in India.A stock market broker as being an artistic Granny's only left grandson is funny and so is his logic for living as he wants to.But when challenged his compassion extends from mumbai to its slums to the beautiful locales of Sweden as if almost like an ode to bergmann n tarkovksy.There is also a top shot of grass blowing in the wind as if taken from a Andrei Tarkovsky film but lacks the magical music along with it.It is also illogical that the theory of ship works in this one..it doesn't.The middle n last one have in fact changes of mind due to change in body part is hard to bite.Almost like 21 grams had a heart replacement surgery making the recipient fall in love with the donors wife.<br><br>And what the film lacks is the emotional epiphanies.Though the eerie end where the different body parts of a dead person come to see his creative cognition, is by far the best fitting end ever to such a conflicting theory of body vs mind. It gave me shivers that the persons body was still alive and its mind dead and yet the new recipients could feel what the mind tried to explore in the cave. The cave almost being a metaphor for understanding the universe by the humble mind which accepts answers to easily then pose big questions.<br><br>Indias first sci-fi cum philosophy cum drama and really one of the best best Indies to ever come out.I am sure the director wouldn't cry about the struggle in finding finance rather he would ask the strugglers to search for talent within themselves.","user":"kunal_nm","rank":[11,12]}]