[{"title":"The rare film about falling in love that gets to the heart of the matter","rating":9,"date":"31 October 2011","review":"There are countless films about people falling in love, but when you see Weekend you realise just how rare films are that make a sincere attempt to catch what it really is like to fall for someone, without sentimentality, forced cuteness or cheap emotional manipulation. This is the rare love story that has real emotional truth about it. The fact that it is about two men who fall for each other is almost secondary to the way the film catches the universality of what it is like to fall in love. Weekend is not about exceptional people, just about two average, if smart and likable men, tentatively getting close to each other and it catches lightning in a bottle. <br><br>This is not to play down the importance of Weekend as a gay film. Gay issues are touched upon and some good political points are made about gay men in todays society, but it's never in a didactic way. Nothing here feels forced, there is a naturalness about the acting and dialogue, real chemistry between the two leads and a sense of lightness about the filmmaking that yet never feels trivial. Weekend catches the little moments of life beautifully and it finds beauty in the everyday. <br><br>The acting here is simply amazing from both leads but Tom Cullen as the more quiet, introverted Russell has a touching vulnerability about him and gives what I would regard as the best performance of the year by a male actor. It's all there in tiny details, there is never a moment when you don't utterly believe what goes on in his heart, it's all there in his eyes and the most subtle shifts of expression. No doubt this performance will be overlooked in favour of more histrionic turns this year, but this is what truly great screen acting is about. I think I fell a little bit in love with him myself.","user":"Boris_Day","rank":[109,120]},{"title":"This is the best low budget indie gay movie in years, and the best gay movie since BROKEBACK MOUNTAIN","rating":10,"date":"18 September 2011","review":"I just watched WEEKEND at a screening at the Oslo LGBT film festival, and am still in shock. This is the most real cinematic version of guys falling in love in recent history. I'm a filmmaker myself, and was blown away by the caliber of the writing, directing, acting, cinematography, editing, and music of this fantastic film. There's not a false note in the movie--everything rings true, even the ending (no spoilers here.) It's the rare film, like WINTER'S BONE last year, that at every turning point takes what I call the elegant decision. WEEKEND is at a higher level than all other LGBT films playing the festival circuit this year (the only other film near this level is Tom Twyker's 3.) Actually, it's at a higher level than almost all films playing anywhere this year. Where did this film come from? Apparently the brilliant mind of Andrew Haigh (writer/director/editor), who, I noted on an IMDb search, started as an apprentice editor on GLADIATOR, and then assistant editor on BLACK HAWK DOWN (working with the master editor Pietro Scalia on both. Go UCLA!) I look forward to seeing more of Haigh's work. Do not, I repeat, DO NOT miss this movie.","user":"aupairkansas","rank":[128,143]},{"title":"This is a love story. It is not cheesy. It is not fake. It is love, plain and simple. Let go of your prejudices and bias and watch the film.","rating":10,"date":"7 November 2011","review":"The IMDb summary of the film does it no justice whatsoever. This piece of art depicted the most genuine and sincere definition of love in any motion picture that I have seen. Besides the fact that the script was well-written, the actors carried the story to fruition in their slightest of gestures, glances, and articulations. You really fall in love with Glen and Russell and want them to be with each other. There are parts where you'll laugh, parts where you might tear up, and parts where you might wonder if you've ever felt what these characters feel for each other. There are some wonderful scenes cinematically as well. The ending is satisfying and resonant of real life, which is a nice change of pace when compared to other love stories. This is the movie that you should see, and I hope you will.","user":"c-chesley","rank":[102,117]}]