[{"title":"Unexpectedly charming and fun","rating":8,"date":"30 September 2012","review":"Based in part on a worryingly low IMDb rating, I went into \"Free Samples\" with some hesitance, but to my surprise it ended up as the highlight of the Palo Alto International Film Festival for me in terms of sheer entertainment value. It reminded me a great deal of a Sundance favorite from a few years back, \"Smiley Face\" with Anna Faris, due both to its snarky but ultimately sweet sense of humor and the wonderfully expressive and funny things that lead actress Jess Weixler is able to so with her face and her delivery. It's the kind of quirky -- I think one may in fact be required by law to use that word when reviewing films like this -- comedy about not all that much that understandably will rub some viewers the wrong way, but it's executed with so much giddy confidence (especially for a first feature) that it had me from the first minute and held onto me for all of the rest. Director Jay Gammill mentioned at the Q&amp;A that he's currently working on a second feature with the same screenwriter. I'm looking forward to it.","user":"ethanstraffin","rank":[30,38]},{"title":"Quirky and fun","rating":7,"date":"13 May 2012","review":"This is one of those indie type films I'm actually glad I watched. It's very quirky, and had those moments that made you stop and think. When it started, I had my doubts, but Jesse Eisenberg helped pull me into the story. It's also got some 'laugh out Ioud' moments and some 'laugh out loud about a minute later' moments when you actually process the hilarity of some of the dialogue. The cast is cool.I love the emergence of Jason Ritter, I think he's more talented than people give him credit for. I enjoyed seeing Jesse Eisenberg in a different type role and seeing Tippi Hedren in it was pretty cool too. There was one scene where I thought the comedy didn't work very well, but that's typical of most movies, I guess. Gammill and Beggarly make a good team, not sure if they're working on other stuff together, but there's definitely a market for these types of movies.","user":"katherinemtalley","rank":[16,22]},{"title":"Love Jess Weixler especially with Jason Ritter","rating":7,"date":"10 December 2013","review":"Jillian (Jess Weixler) has left Stanford law school and her boyfriend for a semester to try something new. Only she's no good at anything other than drinking. After a night of passout drinking, she has to give out free samples of ice cream from a food truck for a friend who is joining an intervention for her brother. She faces people with her acerbic wit and her pounding hangover.<br><br>I love Jess Weixler's sardonic personality. And it works great especially in the first half with Jason Ritter. They have a fun combative conversation. It's not so much with Jesse Eisenberg. She has more chemistry with Ritter.<br><br>The last half does stumble a little bit. Tippi Hedren is playing an interesting character but it's just too cliché. And when school friend Paula drops by, it hits that speed bump a little too hard. For that kind of coincidence, it could never maintain any believability.","user":"SnoopyStyle","rank":[4,4]}]