[{"title":"The action slackens but it's still worth watching","rating":30,"date":"30 August 2011","review":"\"SACRIFICE\" is Chen Kaige's third adaptation of China's stage plays. Set in the Warring States period, the opening sequences show an excited Dr Cheng Ying (played by the cool and talented Ge You) welcoming the birth of his son. As the court physician, Cheng Ying is also thrilled about delivering the child of General Zhao, whose wife Zhuangji (Fan Bing Bing) gives birth at a tragic time when the mutinous General Tuan Gu (Wang Xueqi) stages an elaborate assassination of his lord and pins the blame on General Zhao. This gives Tuan Gu the perfect excuse to wipe out the entire Zhao clan.<br><br>However, the newborn Zhou prince - and heir to the throne - is placed in the care of Cheng Ying (Ge You), forcing Tuan Gu to order all babies in the city be rounded up as hostages. In a cruel twist of fate, Cheng's own baby is killed, and poor doctor is left to raise the Zhao boy, nicknamed Bo'er, as his own. As a form of revenge, Cheng schemes to have Bo'er become the godson of Tuan Gu so that the boy may one day learn the truth and claim the throne.<br><br>The first half hour of the movie is totally riveting. The tale of Tuan Gu's betrayal is lavishly portrayed in detailed settings and sets. The assassination conspiracy is mind-bogglingly complicated, involving a killer dog, a poisonous insect and a case of harmless wine. These court intrigue scenes alternate with those involving Cheng and the birth of Zhuangji's baby, raising the movie's tempo and our pulses, culminating in Cheng's shocking 'sacrifice'.<br><br>Indeed, after this sort of build-up, what follows has to be somewhat of a lull. Still, director Chen Kaige tries to work up our anticipation with the 'revenge' plot involving Cheng, a rather mellowed Tuan Gu and the Zhao boy, Bo'er. The pace slackens a great deal here and it is Ge You's performance that keeps our minds from wandering off.<br><br>Chen keeps the revenge plot morally ambiguous (and not very convincing) but the sacrifice of one's son cuts deeply into China's audiences who have experienced the Government's one-child policy. The play \"Orphan of Zhao\" from which this movie is adapted, was a feudal propaganda that exalts loyalty to the aristocracy. Chen's adaptation offers an interesting study on how fatherly love can be used as a tool for vengeance, to cultivate pain and regret. \"Sacrifice\" is not Chen Kaige's masterpiece, but it is worth watching. (limchangmoh.blogspot.com)","user":"changmoh","rank":[11,13]},{"title":"I recommend it","rating":8,"date":"17 March 2011","review":"The story tries to teach a lessen, and the way it does it worked well and is different from other movies.<br><br>Chinese movie don't have to be composed entirely of fighting like everyone always would expect (it seems there are a few good movies coming out in China do not have excessive amount of fighting, including \"let the bullet fly\"). <br><br>The story conveys a good amount of emotional feeling, and it's not cheesy.<br><br>The message of the story was delivered well, and kept me in suspense the whole time, the storyline was very unpredictable, a job well done.<br><br>Though there were some plot holes, and I would like to see that the character was really thinking about for somethings they have done.","user":"minzhz","rank":[14,21]},{"title":"X-Change","rating":8,"date":"22 September 2011","review":"I have to admit that I am a fan of Asian cinema in general and the so-called \"Eastern\" movie in specific. Though \"Musa\" will remain my favorite genre movie, this one is pretty decent too. I do agree with another commentator that the movie switches paces after a very fascinating and fast start. I don't think it is a bad thing generally speaking, though.<br><br>While not without flaws (and story points/turns you might agree with), the story in itself is fascinating and as also pointed out by others there are quite some commentaries to todays politics. And movies are always a good medium to throw punches, especially if packed like that (playing in the past that is).","user":"kosmasp","rank":[8,14]}]