[{"title":"Solid Movie","rating":7,"date":"22 June 2013","review":"Odd Thomas was a solid movie and it was indeed an enjoyable watch. I'm a pretty big fan of the Odd Thomas books. As with any novel turned into a movie there was much of the finer details left out and a few that were never there added in. I feel they did a fair job of capturing Odd's character. I do feel the chemistry between Odd and Stormy was a bit off. I'm not sure if this was due to the casting ,acting or direction. Or the fact that so much about her character was left out. But it felt more juvenile rather than deep love of your life love. I can't help but wonder if they had given it a slightly bigger budget and focused more on some of the other characters and their stories, it would have been a great movie, instead of merely a good one. <br><br>In the book we get a lot more ghostly communication between Odd and a very diverse and interesting collection of ghosts, including Elvis. I would have loved to see more of this in the movie, as I feel it really helps the viewer/reader understand the world of the dead and how it impacts the living world and Odd himself. One of the most interesting characters in the books is his strange friend Little Ozzie and his cat, Ozzie has 6 fingers on his left hand, writes detective novels and knows about Odds unusual powers as does the Sheriff. Of course Stormy is the only one who knows everything about Odd. <br><br>I gave Odd Thomas a 7 out 10 - It's a good solid movie and a fun watch. I'd love to see it made into a T.V. series. I think that way you could get the in-depth character development and plot lines you have in the books.","user":"robin-72-718219","rank":[133,167]},{"title":"Good Adaptation","rating":8,"date":"23 June 2013","review":"Firstly, I am a huge Koontz fan and a huge Odd Thomas fan. I've been waiting years for this movie so my expectations were pretty high. I'm sure that figures into my analysis of the movie, as I have been largely let down by adaptations from novels in the past. That being said...<br><br>Overall, good movie, good adaptation. Moving a story from a book to a movie always presents problems; always there will be portions of the story and significant nuances left out. This is no exception. The casting of Odd was very good. Yelchin did a fantastic job capturing the strong albeit naive nature of Odd. I was skeptical about Timlin as Stormy, but she not only pulled it off but, in my mind, perfectly captured Stormy. I will no longer be able to think of Stormy without seeing her face. I wish we could have seen more interaction between Odd and Ozzie; in the books this is a very important relationship for Odd. Also, in the books, Ozzie is 350 or so pounds and Oswalt is considerably smaller. That being said, I think his size in the books is more of a testament to his larger-than-life character and less about his physical size, which I believe, given the chance, Oswalt would have perfectly captured. He is a largely underrated actor.<br><br>As for the story, it sticks to the book even though there are a few things left out. It would have been nice to know more of Odd's background but it would have unnecessarily stretched the movie out. Well told, with appropriate use of flashbacks, and good use (and not overuse) of narration, just as in the books. One thing I really enjoy about Odd Thomas books is the quick-paced, quick-whited dialogue. I've rarely read another author that could match Koontz in this aspect. This was transferred to the big screen very well.<br><br>As I said, I've been waiting for this movie for a while and whereas I wish they'd done it as an eight hour miniseries and captured every nuance of the book, this was a superb adaptation and an excellent movie. I really hope they make more because Odd's adventures keep getting better.<br><br>8 of 10","user":"shawn4004","rank":[131,166]},{"title":"Loved It","rating":25,"date":"25 June 2013","review":"Well I have read every book of Odd Thomas and I was worried about the movie adaptation , well I needn't of worried , it was fun great chemistry with the main actors , Willem Dafoe great as usual , the pacing was good , and the action scenes really good , OK so the ghost of Elvis is not in it , the sad thing is no cinema release that probably means no sequel and that's a damn shame as this was a great adaptation of Odd Thomas, I truly think this could have carried through a complete series of movies based on each book That said you never know the power of the fans , so fingers crossed there may be more Odd Thomas in the future","user":"johnstonlehane","rank":[77,99]}]