[{"title":"Ambiguous ending fails to satisfactorily answer ultimate question about cult leader","rating":4,"date":"2 February 2013","review":"Brit Marling, star and co-writer of 'Sound of MY Voice' was also responsible for 'Another Earth', a 2012 Spirit Award nominee for Best First Feature. Both films are similar in that they have an ambiguous ending which has sparked vast debate on the internet message boards. The ending of 'Sound of my Voice' is even more integral to the plot than 'Another Earth', since viewers are led to expect a big 'payoff'.<br><br>That payoff involves whether the film's antagonist, Maggie, a cult leader, who claims to be from the year 2054, actually is a time traveler from the future. Before dissecting the ending, it's important to realize that the film is also about the power of cult psychology. The film's protagonist, Peter, along with his girlfriend, Lorna, are documentary filmmakers who decide to risk all by infiltrating the group. I had a hard time with the idea that Peter, knowing how dangerous the cult is, still is intent on going ahead with his project. You have to suspend your disbelief over Peter's stubbornness, since the average person (working in a vacuum as Peter and Lorna do) would probably not take such a risk.<br><br>The film's main conceit during the 'Second Act' of the narrative is that even the most steadfast skeptics such as Peter, can be seduced by a talented manipulator. He and Lorna are subjected to a series of 'loyalty tests' including eating worms and poisoned apples, culminating in Maggie's ability to break Peter down emotionally during one of the sessions (she alludes to one of Peter's upsetting childhood memories). While Peter tells Lorna it was all just an act, later Peter agrees to assist in the abduction of Abigail, the young girl Maggie claims is her mother. Peter argues that he just wants to finish the job he started since so many people never do that. The scenarists of 'Sound of My Voice' argue whatever Peter's ultimate motive is, in the end he's been manipulated into committing an egregious act (the abduction of a child). <br><br>While hardly any of the mechanics of cult indoctrination can be termed 'suspenseful', Ms. Marling and her co-writer keep dropping hints that there's something a lot bigger afoot. The big 'twist' at the end has Abigail giving Maggie the secret handshake, leading to all kinds of speculation. Interpretations of the ending have been broken down into multiple camps.<br><br>One camp basically holds that Maggie is indeed Abigail's daughter and a time traveler. Adherents of this point of view point to the fact that when Abigail asks Maggie how she knew the secret handshake, Maggie replies, \"you taught it to me.\" In this scenario, Abigail has been trained to be a terrorist and later Maggie receives the same indoctrination. Maggie's aim is to save her 'mother' as well as herself from those people in the future who have abused them. Carol, the self-declared 'Department of Justice' investigator, is actually a bounty hunter from the future, who is assigned to thwart Maggie's plans, as she will prevent both Abigail and Maggie from turning away from the cult in the present and the future. Camp #1 points to the fact that if these were real Department of Justice investigators, Peter would have also had to have been detained on charges of complicity in the kidnapping.<br><br>Another camp holds that Carol is a cult follower who pretends to be a Department of Justice Investigator. The cult cons Lorna into believing that Maggie has been arrested but in reality she has been simply 'taken away' by cult followers. With this belief, Lorna is no longer a threat. The 'secret handshake' has been arranged by the man who has been indoctrinating Abigail and Maggie is in on it. Peter, the skeptic, suddenly becomes a 'true believer' in the cult, as he's been conned into the whole time travel scenario. <br><br>And another camp holds time travel is impossible and it's Klaus who's the true Svengali here. He found the drug-addicted Maggie on the street and brainwashed her into believing that Abigail is her mother. Nonetheless, Abigail may indeed be Maggie's daughter and old lost memories may be breaking into her consciousness. Something inside her is telling her to save Abigail and when Peter finally brings Abigail to her and asks how she knew the secret handshake, Maggie suddenly recalls her daughter taught it to her when she was much smaller (the man who appears to be her 'father' is a cult follower who has been brainwashing little Abigail since her earliest memories, and taught her the secret handshake). Carol is actually affiliated with the DOJ and interrupts the confused Maggie and arrests her, as she is aware that she has a criminal history. Nonetheless, Maggie may not be held criminally liable as later on it may come out that she has been manipulated by Klaus.<br><br>There seem to be a myriad of explanations to explain the ending of this film. Some people believe that such ambiguity is a mark of a great film--the fact that so many people can come up with so many different explanations as to what this film is about, is held up by some, as a sign of great creativity. On the other hand, others (including myself), feel that this kind of writing is a cop-out. Do you really have a definitive point of view you're trying to put across? Or are you leaving things intentionally ambiguous because you really haven't thought through precisely what you're trying to say?<br><br>I suppose a film such as this which engenders so much discussion on the internet deserves an extra star. But ultimately, the film never answers fundamental questions about its antagonist which should be answered, leading one to conclude that the film's scenarists do not have a firm grasp on their material.","user":"Turfseer","rank":[72,87]},{"title":"While not perfect, a very promising film","rating":7,"date":"25 June 2012","review":"Captivating and enigmatic, \"Sound of My Voice\" shows that you can effectively rack an audience's mind with a micro-budget. While many of the strange details and set-ups are left open ended, it's the kind of film that will you have talking with others trying to fill in the blanks long after you've seen it. In some ways, they plant more details than necessary in what seems to be an attempt to confuse the audience and test their attention.Overall, the actors in the film do a great job (especially Marling) and it proves to be a promising directorial debut for Zal Batmanglij. If you want something that also pulls at the mind emotionally, I would recommend \"Another Earth\".","user":"acspowell","rank":[53,64]},{"title":"The actual full explanation","rating":7,"date":"6 April 2013","review":"OK, considering this will be a series of movies, think like a movie writers and what will keep people interested and the movie makes perfect sense. Would you watch a trilogy about a crazy junkie, me either.<br><br>Here's what happened;<br><br>Abigail, the young girl is a bio-experiment, she requires those shots to survive. The \"father\" and maid are her caretakers. Her strange behavior, shots and hat are explained by the fact that she is a lab experiment. Her \"father\", who she never once calls dad, is just a caretaker, he gives her shots, and records her vitals on his laptop. He has no reason to show her compassion, it's not his daughter, and he's not molesting her.<br><br>Maggie is from the future. In the future, just like today, songs are REMAKES of older songs. So considering she said that not everybody has access to technology tells us that it's possible someone in the future re-sang the Cranberries song. She wants to see her mother (Abigail) because she knows that to avert disaster, and starvation in the world she has to destroy her mother (and thus herself) which is why she tells her followers she will have to leave them soon. She is preparing her followers in case she fails in avoiding disaster.<br><br>The DOJ agent is from the future, she isn't sweeping her room for bugs, she is running water to cleanse herself of germs, like what is done to the followers, she is shutting off the heat and A/C to prevent germ filled air from flowing into the room, and in her gift box was a vile, perhaps she is giving herself shots to survive in the past. <br><br>At the end the DOJ agent is returning Maggie to the future which is why we see the ultra bright light.","user":"breaandmelsteele","rank":[29,35]}]