[{"title":"Suspension of disbelief? More like suspension of all brain activity","rating":9,"date":"9 March 2015","review":"**** Major spoilers of the ending and plot of the next movie as well!!! ****<br><br>A meeting somewhere safe in a post-apocalypse world<br><br>Leader: We need a cure for this disease. We need it now! It's gotten out of control.<br><br>Project manager: I have an idea. Let's build a maze.<br><br>L: What for?<br><br>PM: To study survivors. We will put them inside the maze and study their brain activities under certain scenarios from a distance.<br><br>L: Are you kidding? Why don't we study it in a lab, where we have superior equipment?<br><br>PM: Right. Maybe we can read their brain activities with micro-transmitter implants. They can do voodoo magic I don't have to explain.<br><br>L: But why should we severely limit our technology? Well... fine. What kind of a maze?<br><br>PM: Enormous, at least a couple kilometers wide, with 100 ft high walls. And it will reconfigure itself periodically.<br><br>L: Reconfigure? 100ft?<br><br>PM: Yes, we will build tons of moving massive stone walls, put gigantic hydraulics, motors and generators. Energy needs and maintenance should be negligible.<br><br>L: *sigh* Where shall we build it?<br><br>PM: In the middle of desert sir, where the working temperatures are infernal, roads and rails are blocked, and transportation costs are high.<br><br>L: Not underground?<br><br>PM: Of course not, because we will need a lush forest inside the maze.<br><br>L: How will that work?<br><br>PM: We will plant some trees and hope it will rain enough to keep the green.<br><br>L: And what workforce would build it? We have enough problems with decreasing population already.<br><br>PM: We will use as many survivor people as we can to get it done as quickly as possible.<br><br>L: Then what? Who will we put in there?<br><br>PM: Teenagers.<br><br>L: Why? Do they have some significance older people don't have? Why not 20 or 25 years old people?<br><br>PM: I'll come back to you on that sir, but I feel like we should put teenagers in there... Each month one at a time.<br><br>L: Why one?<br><br>PM: Because we will brainwash the rest and study them in a lab first.<br><br>L: Why not study them in the lab in the first place?<br><br>PM: But sir, then the maze would be unnecessary, wouldn't it?<br><br>L: That's circular argumentation! *sigh* Whatever. Then what?<br><br>PM: We will open and close the maze every day and release giant, genetically modified spider-scorpion creatures every night to kill any escapees. They'll be injected with the virus.<br><br>L: Sacrificing some of the last of survivors of humanity we study and invest lots of time in would be acceptable. And we might ignore the danger of uncontrolled spreading of the virus I guess. So, do we have them creatures in stock?<br><br>PM: No sir. We have to develop the technology first and breed them as well.<br><br>L: I see. And that's the only way to study these teenagers? What about their hormones? If we put them all in one place they'll populate like rabbits.<br><br>PM: See sir? We will put only boys in the maze. There'll be no girls.<br><br>L: What?!? Why shall we halve the \"guinea pigs\" we have?<br><br>PM: You haven't heard the best part yet. We'll put the girls in the second maze.<br><br>L: What second maze?<br><br>PM: We'll build another maze just like this one, just as expensive and elaborate, and put the girls there.<br><br>L: And how long will we keep them there?<br><br>PM: As long as it takes until they escape. Years, decades if necessary.<br><br>L: What if they decide not to escape or those monsters kill them?<br><br>PM: Sometimes science needs sacrifices sir. And if they decide to stay, we'll help them escape after a while.<br><br>L: Then why do we have to wait for years? What do we do in the meantime?<br><br>PM: I'm sure rest of the world can survive the virus in safe, isolated environments until we've finished building the mazes and carried on with the tests.<br><br>L: Why don't we study those safe environments and the other survivors?<br><br>PM: But sir, a self-reconfiguring maze with teenagers and monsters is much cooler, isn't it?<br><br>L: Only in a movie! Tell me what do we do with the escapees?<br><br>PM: We'll study their biology with our equipment and develop a vaccine for the virus in our labs sir.<br><br>L: Then why don't we invest all our efforts into biological study instead? Whatever. You're not much of a scientist are you?<br><br>PM: No sir, I'm just a project manager. I worked as book author before my career switch. Trust me, I know what I'm doing.<br><br>...and on and on...<br><br>L: Sounds plausible, your idea is our best hope. It's a bulletproof plan. Our governments, economy, transportation and communication are collapsed but I'll ignore our scientists' opinions and give you as much resources as you need. I got you covered. Let's start.<br><br>Had they not tried to explain the premise, it would be much much better for the sake of the movie.","user":"cuem","rank":[106,124]},{"title":"Don't Judge A Book By Its Movie","rating":5,"date":"21 March 2015","review":"Having read \"The Maze Runner\" by James Dashner, I can say that this movie heavily disappointed me. The storyline was barely stuck to at all, and so many important details were altered, and I don't doubt that they are going to have huge consequences for them in making \"The Scorch Trials\" and so on. <br><br>But please do not let this movie keep you from reading the book. The book explained so much more that needed to be explained than the movie did. They were so different it's not even funny. So please don't judge this book by its movie. <br><br>I cant even begin to point out how much of this was wrong--no telepathy between Thomas and Teresa, no real emotional attachments between Thomas &amp; Teresa and Thomas &amp; Chuck, the Grievers were portrayed completely wrong, as well as the Griever hole; they never saw the Maze from the air, the Maze was square not round, and the Maze was enclosed in a dome with artificial weather (no rain) and was definitely not in the Scorch. I could go on, but you get my point. <br><br>Again, please do not judge the book by its movie. There's so much more explaining that happens in the book and not in the movie, so that it actually makes sense.","user":"georgiewinchester67","rank":[30,36]},{"title":"Cmoon Man!","rating":1,"date":"29 September 2014","review":"My English is so bad, I don't speak English, but i'm trying hard to write this review! so you knew my disappointment <br><br>Don't waste your time and money watching this. I keep on cursing during the movie. <br><br>They been there for 3 years, why not build a ladder, so when the runner late coming, they can climb back to the glade. The wall is still reachable, they have plenty of trees, knifes, axe, rope etc.. Even kids will build a ladder.. even you can make a HOLE on the wall very easy!! its shown when Galby make people name on wall very easy.<br><br>Newt said, \"trust me. we have tried everything\" while gardening. <br><br>You put a group of young man with no supervision and they they will become a farmer??? OMG this is insulting. No violence? c'mon... <br><br>After 3 years they send Thomas to the glade. why? never explain clearly.. because all the guys were doing nothing but gardening? Even Thomas had to sting his self and got cured so he can remember things, but when he remember things, so what ? it doesn't solve anything nor have any connection to any plot. He already found the way out before.<br><br>They have build a complete miniature of the maze while the maze always sifting. And why the... Alby is going with Minho on checking the maze? the story never explain why.. <br><br>If the sting bring people back memories, why should cast Ben when he got sting? Just keep him in the hole, ask things to him and let him died. while when Alby go sting. they keep it!!! why people whyyyy????? Even Minho risk their live to carry and bring Alby back to glade, and put Thomas life in danger because he think Alby is wounded or something. And after they all locked up Minho said to Thomas.. \"congrats, you just kill your self, Alby got sting\" what the..... Minho knew Alby got sting, stinged people should be abandon inside the maze right? just leave him!! he is the leader of the runner he should knew more!<br><br>They all good looking, well hair cut and fashion group of man in the middle of nowhere.<br><br>If you already knew the schedule of the maze to shift, have the maps, you don't have to be a runner, you can just walk. But then again there is a monster in the maze, why are you keep on coming back with just small knife?<br><br>And when a girls show at least some guys should have a joke saying something about it. I was kind of expecting it. Especially when you are a group of young men that lived in the jungle for 3 years! <br><br>I just don't understand the story of this movie.. to put all the people in to the maze surrounded by monster to study their brain? cmooooonnnnn!! I would just make a survival contest rather that build a super complex million dollar maze with AI droid monster just to see people survive. That is insulting the future man! <br><br>No bodies after the slay? OK now the monster eat people, while in the first part it only sting.<br><br>Runner sign off because Alby got stinged? while actually there has been a lot of people died before Alby.<br><br>Thomas and Minho suddenly have a long rope from the woods and its already hooked up at the top to drag Alby body to the top.<br><br>The monster fight was horrible.. you fighting a gigantic robotic monster with a stick?? <br><br>They gave 2 cure serum to the girl what for? that's not studying people mind. Just like giving an answer on your examp.<br><br>They live among a monster they should have create a defense system like a weapon or something. I would build a catapult, Arrows, Traps. I'm expecting to see hardcore life in that glade.<br><br>Alby said the 3 rules, \"Work hard, never hurt anybody, and never go trough that big wall..\" I mean you locked in jungle with a giant big DOOR open? any sane people want to know. Why cant you say, it's a freakin sifting maze and has big scary spider monster inside!<br><br>THERE IS SO MUCH WRONG in this movie.. I can FEEL that the glade citizen is a peaceful society, peaceful life, enjoy farming, gardening.. While actually they shouldn't. you live in a box among monster!! its really beyond expectation!<br><br>At the end.. the gun from the dead body. Which I should take it!!! to protect my self and friends, not kick it! so Galby, that show from nowhere can have it!<br><br>__________ Final word. The end of the movie really make me want to pour my pop corn to someone face! And the exit door was a joke!!<br><br>___________________ Movie effect on me. I really can't sleep thinking.. why would someone make such a horrible insulting people intelligent movie like that, I rather watch spongebob guys. really!<br><br>___________ Suggestion. I think its better if the creator was a maniac and love to see people suffer! and when they finally got out, they capture the creator and kill him or put him on the maze with the monster, and they can see again the beautiful world with their families. It's shitty end i know! but it far better ending than this confusing (trying to make a good unpredicted mystery ending).<br><br>PS I haven't read the book.","user":"sie_aris","rank":[429,626]}]