[{"title":"A twisted trip to Hell, via Yorkshire.","rating":8,"date":"7 September 2011","review":"No, Inbred is not a documentary about the Royal Family; it's the first film in ten years by British director Alex Chandon (Cradle Of Fear). Inbred was the penultimate film to be premiered at this year's Frightfest in London, and it's a film that seems to have divided those who have seen it as brutally as its victims bodies are divided on the screen. On the one hand, there are those who are already dismissing Chandon's rural-set gorefest as distasteful garbage, on the other there are those who were instantly won over by its dark humour and its unrelenting intensity. I'm proud to say that I fall into the latter category.<br><br>Inbred follows a simple premise. A small group of young offenders arrive in the sleepy Yorkshire village of Mortlake, for a community service weekend. The group includes a bespectacled arsonist, a cute shy girl, a weedy gang member, and an archetypal lad. They're led by two youth workers, the feisty Kate (Jo Hartley), and the endearingly dorky Jeff (James Doherty). On their first night in the countryside, the visitors make the mistake of popping into the local boozer, the imaginatively named The Dirty Hole, a pub which makes The Slaughtered Lamb in An American Werewolf In London look positively normal in comparison. It's there that they're introduced to Jim (Seamus O'Neill), the pub landlord, a man who's nearly as comical as he is sinister. The following day, while the group are stripping abandoned trains, they find themselves in a confrontation with Jim's son, which quickly and dangerously escalates. Soon the locals have turned against them, and from then on the group's quest for self-improvement turns into a quest for self-preservation as they desperately fight for their survival.<br><br>Inbred begins with a trusty old film within a film opening, one that features cult British horror chick Emily Booth in a cameo. It's not a particularly clever scene, but it's one that perfectly sets the tone for the rest of the film, droll humour coupled with extreme brutality, courtesy of the film's consistently impressive gore effects. At the beginning of the film, as the group of outsiders arrive in Mortlake and we get to know them, the film is mostly light-hearted in tone but with a palpable uneasiness simmering underneath. The first genuinely creepy moment is the haunting sequence that was featured in the film's trailer - a gang of kids prodding a bloody human scarecrow with sticks.<br><br>As the visitors begin to interact with the locals, the film ups its humour, milking plenty of laughs from the gormless, backward villagers, one highlight being the discovery of a unique pornography collection. But roughly half an hour into the film, when the first drop of blood is spilt, the rug of comfort that the humour provides is pulled out from under our feet, and we're quickly plunged into a bizarre nightmare that rarely lets up until the final credits.<br><br>It's clear to see that Inbred is heavily influenced by The Texas Chainsaw Massacre, and although it's not quite the sledgehammer to the senses that Tobe Hooper's masterpiece is, it does manage to successfully channel that film's hopeless sense of dread, allowing us to fully experience the desperation of the characters as they struggle to find a way out of their harrowing predicament.<br><br>The characters themselves are brought to life by an impressive array of performances, many of which are by newcomers to the big screen. Nadine Rose Mulkerrin is excellent as Sam, the only girl in the group; her baby-faced innocence a perfect contrast to the evil they encounter. All of the young actors are impressive, but if I had to single out one more it would probably be Terry Haywood who plays Zeb, mainly because when it's his turn to meet his maker, his hysterical begging is uncomfortably realistic. As for the adults, the always dependable Jo Hartley turns in what is perhaps the film's strongest performance as the tough as hell mother of the group Kate. And real-life Yorkshireman Seamus O' Neill who plays Jim, the ringleader of the killers, creates a villain who manages to amuse and terrify simultaneously.<br><br>It's the tone of many of the performances that is undeniably one of the film's strongest points. Usually, when a film is as outrageously violent as Inbred, the performances of the actors playing the victims, and their characters, are jokey and tongue in cheek, making us care less when they're gruesomely dispatched with. In this film however, the victims are all played completely straight, as straight as the performances in films like Eden Lake, which makes the experience of watching the film much more disturbing.<br><br>Most of the film's flaws come from the bad decisions that some of the characters make, a common complaint levelled at even the best of Horror films. Why not use that as a weapon? Why not floor it while you've got the chance? These questions popped into my mind a few times while watching the film, but not nearly enough to ruin my enjoyment of what was otherwise a gripping and powerful little shocker.<br><br>Inbred is guilty of all the criticisms that have been thrown its way. It's mean-spirited, it's nasty, it's offensive, but I must've missed the meeting where it was decided that these were bad qualities for a Horror film to possess. I enjoy subtle, slow-burners as much as the next Horror fan, but I also like to be brain-raped occasionally, and Inbred did that like a mad dog on heat. Pork scratchings will never taste the same.","user":"Precinct83","rank":[45,63]},{"title":"It's grim up north.","rating":7,"date":"10 December 2012","review":"Gory 'film-within-a-film' opening scene aside, Inbred takes a bloody age to get to the good stuff and could never be accused of being all that original, the 'city-folk falling foul of rural maniacs' plot-line borrowing heavily from many sources: The Texas Chain Saw Massacre, The League of Gentlemen, 2000 Maniacs, Hostel, Wrong Turn, and Straw Dogs, to name just a few.<br><br>However, it's all well worth the wait, Chandon finally opening the violence valves and lifting the splatter sluice gates after forty-five minutes to transform proceedings into a gloriously demented, blood-drenched piece of xenophobic craziness that more than lives up to the gory hype. True, some of the CGI is less than perfect, but with the level of nastiness set so high, it really doesn't matter: it's easy to ignore the occasional dodgy effect when people are being hideously mutilated with such regularity, enthusiasm and imagination.<br><br>Chandon pulls out the stops to entertain in the worst possible taste, with amazingly twisted characters and a catalogue of carnage that is truly staggering, including a fantastic beheading with a meat cleaver, numerous shot gun blasts to the head and torso, a horse stomping a skull, chainsaw dismemberment, and a really disgusting 'slurry pump body explosion'. The only thing he forgets to include is some gratuitous female nudity; even Emily Booth, who has a brief cameo, keeps all of her clothes on!","user":"BA_Harrison","rank":[11,13]},{"title":"Enjoyable, well acted and very, very funny","rating":9,"date":"4 September 2011","review":"I was privileged to see this film at the recent Frightfest and thoroughly enjoyed it. The acting and production values are first class, the story is great and the dark humour running throughout the film is very entertaining. (I hesitate to use the term \"black humour\" in case the reviewer who thought this film was racist is offended - eee- by-gum, talk about missing the point!). I wish more films were as courageous as this one. There are also some very nice homages to classic horror films of the past. Don't want to spoil it for anyone as the trailers do not give too much away but I would totally recommend it to anyone who wants a good scare, a good laugh, and a break from the formulaic Hollywood junk being spewed out at the moment.","user":"ian-andrews2000","rank":[50,75]}]