[{"title":"Charming and enjoyable","rating":30,"date":"30 August 2011","review":"Delightful premise. Eric Winter does a very good job playing an innocent child-like spirit in an adult body. He plays those scenes with zest and energy. The script has some cute scenes and dialogue based on that premise. Eric Winter and Alyssa Milano have excellent chemistry as best friends.<br><br>There are some clichés in this film: The fiancé is a selfish and vain man, who does not appreciate the protagonist's true self. The protagonist gave up on her dreams and took a safe boring path through life. Not every scene works but still a pleasant film.<br><br>Stockard Channing is a great performer, but this role does not use her superlative talent.<br><br>Alyssa Milano plays down her sexiness to play a regular career girl. She is quite good in this role.","user":"karenthomas61","rank":[14,16]},{"title":"Diamonds are forever !","rating":6,"date":"24 April 2011","review":"First of all, they should have considered some apt titles, than this meaningless one. Yes, there was that Breakfast at Tiffany's, and that was one classic movie. True love and diamonds are synonymous with eternity, and may be, the director wanted us to connect with the concept, that true soul-mates find each other, conquering all the hurdles and barriers. Though we do not have any of the first rate stars ,like Kate Winslet or Hugh Jackman, the trio of Milano, Winter ,and Sergei, are a pleasant surprise, who have done justice to their roles, within the limitations of the plot line, the dialogs, and their interaction with the other characters. Basically, the focus is on establishing the principle of eternal love, soul-mates, guardian angels, and the gap between the fantasy and the actual world that the people live in and have to manage .<br><br>Milano is quite good looking, graceful, and has enacted the role of a confused woman, who is facing a total stranger , who seems to know all about her.Eric Winter is charming, and unassuming, and they make a good pair; However, Sergei , a tall, handsome actor, doesn't have much to do, except showing his affluence, winning ways with the press and media, and showing off, also dominating Jane, who is a talented young woman he is going to get married with. Milano and Winter have shown beautifully, the growing relationship between two friends, meeting after so many years, yet being able to share an excellent chemistry, which grows to developing into even physical intimacy. Surprisingly, the couple engaged to get married, does not indicate any such inclinations to come closer. Hugh's character is not written very well, obviously to highlight the long lost soul-mates, and their much awaited reunion.<br><br>There is no harm in seeing this movie once, as it is simple, yet touching,on many occasions, and lastly ,Michael the guardian, coming back to be with his love, who has also ran out of an elite wedding, in search of him, and his confessing that he needs her now.<br><br>However, since Michael has learned to make his living now, that's a kind of relief to every body, seeing him as a successful chef, serving Mac and Cheese ! And that's another message, about all of us wanting to be naive like children, and enjoy just some simple pleasures of life. How ever, the movie has it's own limitations, like a very straight story line, and almost predictable responses of the groom-to-be, his lack of sensitivity, and materialistic personality. All other actors are good in their supportive roles, especially the lady psychiatrist. Musical score is nothing great, but average. But please tell me, how does Michael manage to buy that expensive diamond ring ,after all ? Keep it up, Tiffany's, and bring the lost loves together !","user":"Queen_of_pentacles","rank":[8,9]},{"title":"One of the best recent romances around, a total delight!","rating":9,"date":"7 December 2011","review":"Jane (Alyssa Milano) once had an imaginary friend when she was a little girl. An only child to a busy mother, Vivian (Stockard Channing), she needed Michael time and time again to help her in daily living. But, on the day the wee gal turned ten, Mother took her shopping for jewelry at Tiffanys and Michael said goodbye! He told Jane the rules of imaginary pals was written in stone, that is, after age ten, children needed to \"grow up\" and learn to solve their own troubles. Needless to say, Jane is heartbroken as she watches Michael disappear down the elevator. Flash forward 20 years. Now, Jane works in the theater business with her mother and is engaged to a successful but ego-driven actor, Hugh (the gorgeous Ivan Sergei). With the wedding weeks away, Jane is still having difficulty choosing a gown, flowers, a cake and more. What a surprise it is, then, that a grown-up Michael (Eric Winter) returns to help out! After realizing he is NOT a stalker, Jane accepts that he is indeed her former best friend and, wow, is he cute. Having him by her side makes it easy to choose the right dress and everything else. But, since Michael temporarily bunks on Jane's couch, having no \"earthly\" home, the two may be in danger of becoming more than pals! Meanwhile, Hugh is doing interviews, signing autographs, and focusing little attention to a supposed rival, haha. What will Jane's heart tell her in the end? This is one beautiful and funny romance, based on a book by James Patterson. Milano is lovely and comical as the lead character while Winter and Sergei are two of the most talented eye-candy actors around. For romcom fans, it doesn't get much better. Channing and all of the other cast members do fine work, too. The Manhattan setting, costumes, script, direction, and all other film amenities are most fine, despite that the film was a made-for-television movie. So, dear fans everywhere, try to grab hold of this winner, for it truly shines as brilliantly as a diamond from the well-known store of the stars.","user":"inkblot11","rank":[15,20]}]