[{"title":"A beautiful look at the classic book","rating":10,"date":"25 August 2015","review":"There is one thing you have to know before even read about this movie, and it isn't the summary: There is already a LOT of things telling the same old story of the book. How the pilot and the prince became friends, all the adventures and beyond, in other animations and endless other media. This movie isn't about those two characters only. It's about how this story can touch people since it was created, from toddlers to grandpas, in different ways and in different ages. I've seen people say out loud \"this is not little prince!\", but I say \"yes, it is!\". Want to see a pure version? Read the book. The animation and the characters are rich and lovely, the CG and the stop motion are perfect and well used. Everything is heartwarming. If you don't know the book, you'll read it after seeing this. If you do, I'm sure you'll cry a lot. And at the end of the movie you'll want a fox for you too.","user":"DigoFreitas","rank":[155,177]},{"title":"There is hope","rating":9,"date":"27 October 2015","review":"Very successful in bringing Little Prince into today. The movie made me to read the Little Prince again and learn more. The challenge between living natural and living modern became fully alive in my mind again and again. Like my childhood. I have a neighbor very similar to Aviator. He had long white hair and a very old jacket. He had a magic smile. I think he was very similar to Aviator. All of my memories of him became animated in front of my eyes while watching the movie. Maybe everyone has someone like Aviator in his or her life or must find. The snake scene was very deep like book. The movie made me to believe yet there is hope for peace.","user":"hdadizadeh","rank":[62,81]},{"title":"Growing up is not the problem. Forgetting is.","rating":10,"date":"24 December 2015","review":"I usually love the French animations, because unlike American, the stories, musics, characters that influences the thousands of year cultural history. Definitely not comparable to the Hollywood standards, but it had its own technical brilliance. All I wondered was why this film was in English language.<br><br>It deserves to be on the upcoming's big occasion (2016 February), if it is eligible for the American Academy Awards. From the director of 'Kung Fu Panda' original movie, which was partially based on the children's novel. The book adaptation is the stop-motion animation and the remaining story's the regular 3D animation.<br><br>Just remember the movies like 'What Dreams May Come' and 'The Lovely Bones', those magical worlds and breathtaking landscapes. Usually animations are associated with comedy genre, especially when a child character attached to it. This film was not even a comedy, more like those two titles I mentioned.<br><br>The screenplay wise it was a very 'Neverwas' type, except this one was an animation. But appropriate for people of all ages. The kids can realise the importance of their childhood and the older people can become kids again. The film compressed the gap and erected a bridge between the two hoods, the childhood and the adulthood.<br><br>\"What is essential is invisible to the eye.\"<br><br>I did not know what to expect from it, but I highly satisfied with the final product. The film characters had no names, but called, the Little Girl, Mother, Fox, Rose, Snake, King et cetera as what their role is and species. Barely there are only 3-4 characters where the story was focused. Obviously it had a villain, but very unusual existence time and in a crucial part of the story.<br><br>I don't remember how the 100 minutes went so fast like a ray of the light beam flashed away. The pace of narration was not a rushy, except the opening part. But once the old man character, the Aviator, voiced by Jeff Bridge was introduced, the movie turned into completely different and awesome. Yes, Jeff Bridge's voice was so good for the background narration.<br><br>This story is about an old man who refused to grow up mentally and believes the existence of the magical stars and planets. The whole neighborhood stayed away from him and his troubles, until a new girl arrives at the next door. The little girl befriends him and falls for all his stories discarding her daily routines, but later it complicates their relationship after her mother finds out what they're up to. What happens to them and how the story concludes is the remaining part.<br><br>\"She was not a common rose. She was the only one of her kind in the whole universe.\"<br><br>This story was finely fused between the reality and fantasy. Most essential storyline for the present world. In the name of education how the children were enforced by their parents to mechanical life with less time to play out and make their own friends. Especially as they were lacking the creativity to make up their own fictional worlds with their toys like the kids from a century ago were.<br><br>It might psychologically affect their characters while becoming an adult like the Aviator in this film, but as one of lines from the movie say 'Growing up is not the problem. Forgetting is', the children are losing their innocence over the adult's reality world. Who knows, someday those kids may become the greatest writer inspired by their childhood days.<br><br>If you ask me, I strongly recommend it for all. It is very encouraging film for the parents how not to raise their children and for the grown ups how not to get lost is the adult world. Most elegant flick of the year, along with a very few others.<br><br>You don't have to ignore it because you have read the book, like I said it was not completely borrowed from the original material. Instead, two-third of the film was freshly established out of the same name masterpiece. I'm not familiar with the book, so I've no thoughts that differentiate between these two formats. But definitely the film deserved all the appreciation from critics and movie <br><br>9½/10","user":"Reno-Rangan","rank":[58,76]}]