[{"title":"Masterly and All Too Rare: An Utterly Realistic Portrayal of a Sociopath.","rating":9,"date":"1 September 2013","review":"Within its first 5 minutes I could already sense that I was about to watch a masterful movie. For this is a most brilliant study of, and glimpse into, the life of a sociopath. At times, it is so 'fly on the wall', and so brilliantly acted, that I almost had to remind myself that this was fiction I was witnessing.<br><br>It's written and directed by Antonio Campos, who is admittedly not so well known as a screenwriter, having written only one other feature length movie back in 2008; A fact which is moreover, and to my belief, a tragedy for Campos - because he has most certainly proved himself with this movie, to be an exceptional screenwriter. Simon Killer is, in other words, extremely underrated. Nonetheless, as for its direction, production, acting, screenplay and musical score - all come together in an all too rare, &amp; near perfect, unison.<br><br>But why is it underrated? Basically, people cannot and just won't 'like' this movie, precisely because sociopaths are nasty people who callously make the lives of everyone they contact, worse for knowing them. Accordingly, watching a movie about such a person, even one that is as interesting and accurate as Simon Killer, is not therefore a fun or enjoyable experience for any typical audience - at least in the sense that 'enjoyable' should bring a smile onto one's face. For this movie won't endear smiles at any point.<br><br>Whereas DeNero's studied psychopath, in Taxi Driver, occasionally brought a wry smile to one's face, and was popularly received as a bit of a misunderstood 'anti-hero', Brady Corbet's Simon is not only always engaging as a character study, but he's always, also, all too steely manipulating, and disgustingly self absorbed. Frankly, of the many movies I've seen, I can think of no other movie, before this, which so realistically portrays how a sociopath engages with other people who pass through his life. And, as such, I cannot recommend this movie highly enough, particularly for those of you, who are analytically minded enough, so as to appreciate its utter brilliance. Again, I'm not promising that anyone will, or could possibly 'like' this movie. Rather, I believe a minority of others will deeply appreciate its very excellence.","user":"supadude2004","rank":[46,56]},{"title":"Unusual and challenging film...","rating":7,"date":"13 April 2013","review":"\"Simon Killer\" may the toughest film I've ever tried to categorize. It's not a horror film, it's not a thriller, it's not a romance, and it's not a drama. And yet, in another way, it *is* all of those. From the very title of the movie to the closing scene, this film defies all common conventions.<br><br>\"Simon Killer\" is the story of Simon, played brilliantly by Brady Corbet, who has just graduated from college and comes to Paris to get over a bad breakup. We never meet Michelle, his ex, but based on Simon's e-mails to her and her reply, it was not a happy breakup, and maybe even worse than that. While there, he meets a drop-dead gorgeous hooker (Mati Diop) and they start a relationship. <br><br>I could discuss more of the plot -- and there is definitely more, involving blackmail attempts and other events -- but really, it's irrelevant. The film basically invites us to watch Simon and what he does. And it's engrossing. And the question is, what IS Simon, really. He's not really a pleasant guy. Why is he doing what he's doing? Is he a pathological liar? Or just a confused kid telling small lies in a foreign land. Does he hate women and think they are only for sex? Or is it the opposite, and he gets deeply emotionally involved. \"Simon Killer\" is fascinating and potentially frustrating as it invites you to watch and yet refuses to give pat answers and instead, seems to raise more questions.<br><br>Film, like all art, is subjective, and I found \"Simon Killer\" absolutely riveting. You may find it disturbing and uncomfortable, but I think it's worth the ride.","user":"stsinger","rank":[30,38]},{"title":"Interesting but dull psychological thriller","rating":5,"date":"10 May 2016","review":"Simon Killer is the new Psychological thriller by Antonio Campos, the film follows Simon (played by Bradley Corbet) as he travels in Paris trying to forget about his girlfriend, whom he had just broken up wit, after staying together. One night as he wonders about he comes to a strip club, where he meets the stripper/prostitute Noura. (Played by Mati Diop.) Simon quickly falls in love with Noura and finds it difficult to spend time away from her and becomes jealous of the fact that she has to sleep with other men for her job. So to try and fix the situation he proposes that she should black mail one of the married men that come for her services. She reluctantly accepts, and they start their working on their trap, needless to say things do not go according to plan.<br><br>Simon Killer is a very slow film, and sometimes it's pace works and other times it doesn't. Antonio Campos tries to lull you in with a slow hypnotic pace, working mainly through repetition and dream-like passage of time. The film does a good job of bringing you in with its pace, but unfortunately starts to lose its audience around the half way point. The film becomes very tedious with its repetition and we're not quite sure who we're supposed to be rooting for. The characters motivations become muddled and you're not sure what's going on or why. This works for some films, like Caché or The Virgin Suicides, but films like the ones previously mentioned always give the audience enough to peak there interest and make them want to figure out the rest of the film. Simon Killer doesn't ever do this, so most of the film ends up being pretty forgettable.<br><br>But I should give credit where credit is due. First of all Bradley Corbet does a great job as the introverted Simon. He is able to create this character that just doesn't feel right, from the second we see him we can tell that something is just wrong. Antonio Campos also has some excellent camera work, for most of the scenes the camera is set almost completely still, and if there is movement it's typically a slow zoom in/out, or a slow pan to the left or right. The effect is something unnerving, and the cinematography in general is very similar to the cinematography in Francis Ford Coppola's The Conversation. i.e. creates a sense of paranoia. Overall I'd say Simon Killer had some good ideas, they just need to be more developed. If you're into slow dark psychological films I'd say it's worth checking out.<br><br>5.5/10","user":"willwoodmill","rank":[6,6]}]