[{"title":"The Absolute Best Movie from the Sea Int'l Film Festival","rating":9,"date":"19 March 2012","review":"I have been waiting for this movie to go into wide release since being in the audience at the 2011 Seattle International Film Festival when the director brought this film to town. The entire theater was packed and I don't know of a single person who was not having a blast. The film grabs you from the beginning and you're hanging on to the arms of your chair until the end. I'm not talking about horror...I'm talking about the sheer PACE of the movie. <br><br>The film is VERY fast-paced. So fast that when the audience was cracking up from a line or a scene, the next scene had already started and we missed the first several lines. It took me about 15 minutes to adjust to the pace, kind of like when you watch an Irish film it takes the same amount of time to figure out What ppl are saying and then once your brain gets into the groove, you're off.<br><br>I would describe this film as a mash up of Heathers, Donnie Darko, and The Breakfast Club on acid, with a Red Bull soda chaser. Super fun, destined to be a classic.<br><br>I wonder if they've waited for a release so that Josh Hutcherson can become a super mega star via The Hunger Games, in order to boost revenue. Not. A. Bad. Plan.<br><br>Go see this movie. You're welcome.","user":"jillayne","rank":[72,113]},{"title":"9/10 - Not for Most people but if you get it you get it.","rating":9,"date":"24 August 2012","review":"I wasn't going to write a review but so many people on the boards don't seem to like the movie at all. Detention is a sharp, extremely fast paced parody/homage/comedy/slasher/WTF?!?! film for people who watch a LOT of movies. I honestly don't know if it would have been as enjoyable if I hadn't understood most of the references to teen culture, movies, bands and high-school life that peppered the movie every thirteen seconds, but I got more than a few and thought it was perfect.<br><br>The editing. Wow. The editing was certainly unique and I loved the jumps and cuts that kept the story moving far faster than most movies I've seen lately. It's probably not for everyone, but again that seems to be the consensus on the entire movie. The way the flashbacks were done was especially fun. I assume the director was responsible for how the film was edited and I'm going to hunt down everything else he's done and watch it now. Assuming he's been able to get money for anything else. I don't know if this was or will be a financial success. Josh Hutcherson should give it a bump in viewership but I don't know if the people who would want to see this will be able to find it. Hopefully it will become a cult hit over the next few years, circulating among folks who appreciate this kind of thing. Speaking of the acting - it was all spot on - exactly how you'd expect people in that situation to act :) Seriously though Hutcherson and Caswell were both very good, as were the supporting characters. The Bear did a fine job as well.<br><br>If I had to describe this movie I'd say it was a cross between Brick, Donnie Darko, and Not Another Teen Movie. Would I recommend it? To those of my friends I think would get it. Will I watch it again? Definitely.","user":"Raglan22","rank":[42,65]},{"title":"A fast paced Genre jumping Comedy/Horror!","rating":7,"date":"22 July 2012","review":"This is a fast paced comedy/slasher type film. It uses references from different genre's and different movies. For me, this is part of the attraction as it jumps from one genre reference to another all while paying homage to some classic horror films. The story, although for some seeming to be all over the place, all makes more sense towards the end of the movie. I can't go in to the how or why because I will be giving away the plot, but it comes together and travels along quite quickly. It's no 'Shaun Of The Dead' (that will hard to beat), but it is different and also takes the p!ss out of the teens of our generation, and who doesn't like that? So I give this film a 7 out of 10.","user":"Michael-Hallows-Eve","rank":[31,50]}]