[{"title":"Interesting idea but ultimately mediocre","rating":5,"date":"7 September 2014","review":"The premise of Before I Go to Sleep is quite a good one. A woman wakes up each day with no memory beyond her early twenties; soon she begins to realise that some dark secrets are being hidden from her. It's sort of in similar territory to Christopher Nolan's early neo-noir Memento (2000), which was also a mystery/thriller about a character with a short-term memory loss condition. Like that one, here one of the interesting angles is that the central character has no idea if their friends really are friends or actually enemies. It's true that several aspects of the storyline require you to stretch your belief somewhat; however, many thrillers are similar in this respect, so this wasn't such a deal-breaker for me. The problem I essentially had is that while the idea may be pretty intriguing, ultimately the pay-off is somewhat mediocre and conventional. Piece by piece the puzzle is slowly unravelled but it doesn't end up presenting us with a picture that is very inspired or interesting and you sort of ask yourself 'is that it?'","user":"Red-Barracuda","rank":[104,135]},{"title":"Plot holes big enough to steer a cruise liner through.","rating":3,"date":"10 September 2014","review":"If you are going to see this movie do NOT read this review - there are plot spoilers - come back afterwards and see if I was right. OK - so it was a reasonable enough thriller with a couple of suspenseful moments but a book or a film that has plot holes as big as the ones perpetrated here tend to make you gnash your teeth in irritation. Here are some of the worst: Christine had the \"accident\" when she was 26 (she's now 40). Where were her parents, aunts, brothers or sisters for the intervening 14 years? Would not one of them be visiting her on a regular basis at the nursing home? Ben puts her into a nursing home because he can't cope any longer and eventually divorces her but who is paying the nursing home bills? When she is taken out from the nursing home by the other \"Ben\" wouldn't the real Ben have wondered why he wasn't being asked to pay any longer? The wedding album and the photographs. The real Ben would have kept all those and they wouldn't have been available for the other Ben to doctor them. The doctor: he'd have to had Ben's consent to \"treat\" his wife. How did Christine make contact with him? How would she know her own phone number? Or address? The hotel where the first assault was made. Blood on the floor and in the corridor. A woman's body covered in blood found in a nearby lorry park. Er...didn't the police make a connection? The hotel staff might well have done. I could go on for many more paragraphs but you get my drift. You may want to wait until this one is at £3 on Tesco shelves.","user":"postmortem-books","rank":[101,137]},{"title":"Well-Made Psychological Thriller","rating":7,"date":"9 September 2014","review":"I'd actually read the book before seeing this film so it was a question to ask ourselves: can we be bothered? In the event, it was worth it and I found that I was submerged in the film during the showing.<br><br>It's the sort of film that doesn't get made very much now in these days of big budgets, explosions, and cartoonish characterisations. But I'm glad it appears on the big rather than the small screen of TV because they brought in really good actors in the three leads. Particularly in the case of Nicole Kidman, she downplays her looks to come across as an ordinary woman approaching middle age, a brave choice for an actress.<br><br>The big surprise to me was Colin Firth who is way outside his normal range here and completely credible in the role. Mark Strong also is good in portraying a psychiatrist with empathy.<br><br>The film is very sombre but this is appropriate for the subject matter and really the director and cinematographer deserve a lot of credit for catching the uneasy tone of the book.<br><br>The reason I don't give it a rating higher than 7 is the unnecessary slasher scenes which could I think could have been done without so much blood and violence. Modern filmmakers should pay more attention to the work of someone like Hitchcock who suggested the gore rather than shoved your face in it. Still a mature film well worth seeing.","user":"philipmagnier","rank":[82,110]}]