[{"title":"Exciting Legs","rating":8,"date":"4 January 2020","review":"Pretty body and fun story.<br><br>This film proves it: be thin, have long hair and wear short skirts and heels and you are a goddess.<br><br>There are several quotable moments in this film too.","user":"Aaron_Kyle_homosexual","rank":[8,8]},{"title":"bad mix","rating":4,"date":"24 January 2015","review":"Molly Morris (Miley Cyrus) is a private investigator working with her dad ex-Dallas cop Sam (Mike O'Malley). FBI Agent Armon Ranford (Jeremy Piven) is working a case against the Georgian mafia and he needs her to watch over college girl Alex Patrone (Lauren McKnight). Alex is the daughter of an important witness and she may be holding some evidence. Sam continues to gamble and Molly needs money to pay off the debt. The grimy Molly has to infiltrate a sorority.<br><br>This starts off as somewhat serious. That could actually work but it goes kind of silly. The girls are either Bs or really stupid. This feels like there are two movies trying to come out on top. It's not silly enough to be Disney teen frivolity. It's definitely not serious but the camera sometimes use shaky hand held style. The styles are all wrong and conflict with each other. It's like somebody thought that Hannah Montana needs to be filmed by Paul Greengrass. If they wanted to do a realistic movie, that would be interesting to see. It would be like Veronica Mars goes to college. Also the name of the movie is horrible and somebody should be fired for it.","user":"SnoopyStyle","rank":[19,24]},{"title":"looks really familiar","rating":1,"date":"6 December 2012","review":"From the clothes, to the make-over, to the speech at the end of the trailer, where all you have to do is replace \"pearl-white Bentley\" with \"world peace,\" this movie looks like a very poor knock-off of 'Miss Congeniality.' They didn't even attempt to use a different agency investigating into whatever the actual problem was--in both movies, it was the FBI. Hairdresser and a make-up artist that insult her while she's getting a makeover for her FBI assignment? Hmm, seems familiar. A little bit. Handcuffs in her hand on the cover while she's dressed up (and for the character, that IS dressed up)also seems vaguely reminiscent of a certain Sandra Bullock movie.","user":"cra2989","rank":[47,69]}]