[{"title":"Ralph Fiennes brings the literary legend to life","rating":7,"date":"12 November 2013","review":"With The Invisible Woman being the second feature in which Ralph Fiennes tackles Charles Dickens, you may say that the thespian, already known for his love of Shakespeare, has developed a new romance with English literature. <br><br>With Fiennes at the helm, this biographical drama, based on the book by Claire Tomalin, takes a stroll into the private life of the public figure, Charles Dickens. Although The Invisible Woman positions itself at the heart of the Victorian literate, this is in fact the story of Nelly Ternan (Felicity Jones); hence the title. <br><br>The bulk of this character-piece plays out as a flashback, as the narrative oscillates between the world of Dickens and the world post-Dickens. The mysterious title refers to the young Nelly, an avid-admirer of the literary colossus, as she enters into a secret affair with her idol. She spends the best part of her youth amorously involved with the writer, but given that Dickens was a lot older, it was inevitable that she would outlive her lover. <br><br>Alone with her thoughts, Nelly, dressed in mournful black, marches along the beaches of Margate like a sleepwalker in the night, tormented by the loss of her companion; she must find a way to bring that chapter of her life to a close so that she may now move on. <br><br>The picture paints Dickens as the talented and charitable man that he was, however we are also privy to a more sinister side of the wordsmith, as we learn of his malicious actions towards his wife (played by Joanna Scanlon). <br><br>The camera takes its time, as it soaks up the brilliant performances of the cast and Abi Morgan's (Shame, The Iron Lady) masterful script provides a titillating narrative, as it transports us to the Dickensian period. Ultimately, The Invisible Woman stands as a beautifully crafted piece of filmmaking, however, it somewhat pales in comparison to Fiennes' earlier, more vigorous work. Anthony Lowery<br><br>www.moviematrix.co.uk","user":"aglowery","rank":[43,48]},{"title":"\"Ellen Lawless Ternan... that is my secret\"","rating":7,"date":"28 January 2014","review":"\"The Invisible Woman\" (2013 release; 111 min.) brings the story of how famous writer Charles Dickens falls in love with a much younger woman, Ellen \"Nelly\" Ternan\". As the movie opens, we are told it is \"Margrave, 1883\", where we see Ellen and her husband George hang out with several family friends, Ellen is asked (as apparently happens often) about her \"childhood\" (which we later learn is really a misnomer) memories of Charles Dickens. The movie then goes to \"Manchester, some years back\" (in fact, the late 1850s), where we get to know Dickens (played by Ralph Fiennes) as he is trying to turn his book \"The Frozen Deep\" into a stage play. Then comes about the Ternan clan, mother and her 3 daughters, to act in the play. One of the daughters, Ellen (\"Nelly\"), only 18 at the time, gains the immediate attention of Dickens (a married man, and 20+ years her senior), and a slowly developing courtship starts to play out. What will become of the attraction between these two in a Victorian society where the rules are strict? To tell you more would ruin your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: first and foremost, this movie is a tour de force for Ralph Fiennes who in addition to starring also directed this movie, I believe his debut as a director. His portrayal of Charles Dickens brims with energy. It is amazing to see how successful Dickens was in his day, truly getting the rock star treatment of that era. Second, the performance of Felicity Jones as Ellen oozes charm from start to finish. She is a veteran of the UK film and TV industry but not so well known on this side of the Atlantic. I think that can possibly change following this performance. Third, the production itself is done exquisitely and hence it is no surprise that this movie just scored an Oscar nomination for Best Costume Design. Last but not least, the movie does a great job bringing the dilemma between the feelings of the two protagonists on the one hand, and the demands/standards imposed by society on the other hand. At one point, Dickens asks Nelly to share a secret with him, and she informs him that her middle name is \"Lawless\". When she in turns asks for a secret from Dickens, he whispers \"Ellen Lawless Ternan... that is my secret\", wow.<br><br>I recently saw this movie at the Regal South Beach in Miami, and even though I saw it at a weekday matinée screening, the screening was quite well attended (leaning heavily towards women, I might add). It may be there there is a strong demand for this movie, which would be great, as this is certainly a movie that deserves to be seen. Bottom line: if you are in the mood for something that is miles away from your standard Hollywood fare, and learn a thing or two about Charles Dickens along the way, you cannot go wrong with this, be it in the theater or on DVD/Blu-ray. \"The Invisible Woman\" is worth checking out!","user":"paul-allaer","rank":[28,32]},{"title":"Fiennes impresses more as an actor than as a director","rating":7,"date":"7 March 2014","review":"There was a film called \"The Invisible Woman\", a sequel to \"The Invisible Man\", from 1940, but there is no connection between that film and the 2013 version. This film is not science fiction but the story of the love affair between Charles Dickens and his mistress Nelly Ternan. Nelly is \"invisible\" in the sense that Dickens, worried about the possible effect on sales of his books, is forced to keep her existence a secret, even though it is common knowledge that he and his wife Catherine have separated. Intercut with the main action are scenes showing Nelly's later life in the 1880s, more than a decade after Dickens's death, as the wife of a man named George Wharton Robinson.<br><br>I had previously always thought of Nelly as a gold-digging bimbo, a talentless actress who used her good looks to snare a famous, wealthy older man and lure him away from his wife. That is not, however, how she is portrayed in this film. It is, in fact, Dickens who comes off badly. As played by Ralph Fiennes (who also directed) he comes across as a jovial, fun-loving party animal, revelling in his fame and celebrity, but also deeply selfish, not only in the way he treats Catherine but also in the way he treats Nelly. Nelly herself, by contrast is portrayed as a rather serious young woman, who in many ways shares conventional Victorian attitudes towards sex. She is, for example, shocked to discover that Wilkie Collins, Dickens's friend and fellow novelist, lives quite openly with a woman to whom he is not married. She is in love with Dickens, but is distressed by her ambiguous status and by the fact that their relationship cannot be acknowledged. She is shown giving birth to a stillborn son in France, a detail which clearly betrays the film's origins in Claire Tomalin's controversial biography. I should perhaps point out that not all Dickens scholars are convinced by Ms Tomalin's thesis that Nelly bore his child. (Indeed, some even insist that their relationship was platonic). The fact that the issue is still so shrouded in mystery and controversy, however, does indicate just what lengths he went to in order to protect his privacy.<br><br>The Nelly of this film is therefore a complex character, far more than a mere Victorian bimbo, and it is a tribute to the talents of the lovely Felicity Jones, an actress I was not previously familiar with, that she emerges as someone both likable and entirely credible. Fiennes is also good as Dickens, a man uneasily aware that in leaving his wife for another woman he is betraying the family values he once so assiduously championed. (He even called the magazine he edited \"Household Words\"). Other good contributions come from Kristin Scott Thomas as Nelly's mother and Joanna Scanlan as Mrs Dickens. Although Catherine was the \"innocent party\" in the breakdown of her marriage, it is all too clear from Scanlan's interpretation just why Dickens felt unable to live with this dull, frumpy woman. <br><br>Fiennes the actor is fine, but I was less taken with Fiennes the director. The pace of the film can be excessively slow and the switches between the chronologically earlier scenes, taking place in the late 1850s or 1860s, and the later ones, taking place in the 1880s, were too abrupt and made the story difficult at times to follow. It didn't help that Felicity Jones (aged about 30) looks much the same age in the later scenes (when Nelly would have been in her forties) as she does in the early ones (when she would have been in her teens or twenties). Felicity does have a different hairstyle in the later scenes, but the purpose of this seems to have been to mark the changes in fashion between the 1860s and the 1880s, not to make her look older. <br><br>Another thing that surprised me was that the film did not deal directly with Dickens's death or with the immediate impact this had on Nelly's life. It struck me that this was one time when Nelly's status as the \"invisible woman\" worked in her favour; had she been openly acknowledged as Dickens's mistress she would, given the often hypocritical attitudes of the Victorians towards extra-marital sex, have found it very difficult to make a respectable marriage after the sudden, unexpected death of her protector while he was still in his fifties. (She might have found this difficult even if Dickens had obtained a divorce and made her his second wife). Possibly, however, the scriptwriters avoided any speculation of this nature because it would not have fitted in well with their view of Nelly as the innocent victim of her lover's selfishness. <br><br>The film is made in the best British \"heritage cinema\" style and will doubtless find favour with many fans of that style of film-making. I was, however, in some ways disappointed with it, feeling that its structure could have been clearer and that it could have dealt with this aspect of Charles Dickens's life in greater depth. 7/10","user":"JamesHitchcock","rank":[17,19]}]