[{"title":"Misunderstood","rating":7,"date":"25 July 2015","review":"Exceptionally well acted by James Franco. Beautifully layered storyline. Its storytelling is right on par with the story itself. Really modest in its presentation, but grand in its effect. Robert Naylor also deserves credit for some fine acting. I hope this piece of art won't be underrated, because the story really is just a plain portrait of life, without any fuss. It struck me, with all its characters in it. Please take note of James Franco reading his letter from teenager Christopher so beautifully human. And the score is beautiful! Its cinematography is well crafted, there to deliver. I can't see why people would think this is a pretentious presentation of camera styles.","user":"christianstadegaart","rank":[46,64]},{"title":"Film's message of forgiveness and reconciliation stands out","rating":8,"date":"20 December 2015","review":"According to German director Wim Wenders, \"Landscape is never only landscape. It's also a state of mind it has soul and then it evokes and reflects who we are.\" That state of mind is revealed in the chilly winter portraits of rural Quebec in Wenders' latest film Everything Will Be Fine, his first fictional feature in almost ten years. Shot in 3-D by Belgian cinematographer Benoît Debie, the film stars James Franco as Tomas Eldan, a successful novelist who is fairly comfortable but whose relationships are not nurturing, especially that with his girlfriend Sara (Rachel McAdams). <br><br>Tomas' life is permanently changed, however, when an auto accident on a snowy road causes the death of a young boy and leaves the boy's brother Christopher (Jack Fulton and Philippe Vanasse-Paquet as a twelve-year-old) emotionally scarred and unable to give and receive love. suppressing outward expressions of grief, neither Tomas, Christopher, nor Kate (Charlotte Gainsbourg), Chris' mother, are able to achieve any release, especially Tomas who carries his unexpressed guilt around with him wherever he goes, like a chain around his neck. <br><br>Though Kate, an accomplished illustrator, is forgiving, telling him repeatedly that the accident was not his fault, he internalizes his guilt and makes a half-hearted suicide attempt much to the consternation of his overbearing father (Patrick Bauchau). Franco delivers a sensitive performance as the conflicted author who is able to channel his suppressed emotions into his writing which become stronger and lead to long-awaited public recognition. <br><br>As Tomas' career blossoms, he marries Ann (Marie-Josée Croze), a woman with a young daughter, allowing him to become a father for the first time. As told in a series of flash-forwards, Tomas develops a close friendship with Kate but his relationships with Sara and Christopher (Thomas Naylor as an adolescent) build towards a series of confrontations in which long held resentments explode. Written by Bjorn Olaf Johannessen and enhanced by the strong original score by Alexandre Desplatt, Every Thing Will Be Fine, though very slow and ponderous at times, is a humane, poetic and physically beautiful film. <br><br>3-D is used sparingly but scenes such as children riding on a Ferris wheel at an amusement park and dust particles dancing in the sun create a lovely tone. Though not in the top echelon of Wenders' oeuvre, the film's message of forgiveness and reconciliation stands out, sharply contrasting with the all too prevalent cultural mindset of violence and revenge.","user":"howard.schumann","rank":[14,17]},{"title":"...or will it?","rating":10,"date":"29 December 2015","review":"Wim Winders has created so many fine films – Wings of Desire, The Salt of the Earth, Buena Vista Social Club, Pina, Paris Texas, etc – that it is a pleasure to watch his unique cinematic language again. Based on a story written for the screen by Bjørn Olaf Johannessen EVERY THING WILL BE FINE is a series of moments of reflection about the impact of an incident on the lives of characters over the course of around twelve years. It is not an action movie, it is instead a film of contemplation that digs deeply into the human psyches of all the characters in the story – and in many ways shows that 'every thing will not be fine after all.<br><br>Filmed in Montréal, Québec, Canada, the film opens during the frozen winter that surrounds a young writer Tomas Edan (James Franco) living in a tiny cabin attempting to come up with ideas for his third novel. He is at odds with his girlfriend Sara (Rachel McAdams) and while driving aimlessly after a quarrel her, he accidentally runs over and kills a child. The one child he sees is basically unharmed and he walks the child Christopher (Jack Fulton) home to his mother Kate (Charlotte Gainsbourg) who, while happy to see Christopher, runs to the scene of the accident to find her other son is under Tomas' car, dead. The accident and its aftermath deeply traumatizes Tomas. Over the next 12 years, he struggles to make sense of what happened and continue on with life, becoming a very successful writer who marries Ann (Marie-Josée Croze), but when he looks in the mirror, he sees a murderer. Christopher (Robert Naylor) confronts Tomas about the accident years later and we are privy to see how even at that stage in Tomas' life the incident has bored into his soul.<br><br>The film quite successfully shares the trauma an accident can have on all who are connected with the perpetrator – but none more damaged that the man responsible. The photography, both in winter and all seasons, is by Benoît Debie and the luminous musical score is by Alexandre Desplat. The cast is first class with James Franco probing deeply into a character so damaged it is difficult to imagine. Not a film for those seeking 'entertainment', but for those who enjoy films of beauty and philosophy, this Winders wonder is richly rewarding.","user":"gradyharp","rank":[14,18]}]