[{"title":"Unicorn City Welcomes You","rating":8,"date":"10 January 2012","review":"First off, this is a movie focusing on Voss, an unemployed tabletop gamer who has anger issues and a difficulty separating his real life from his gaming life. He is flanked by younger brother Clancy and good friend Marsha, both who are members of his guild. Requiring money to help pay his share of the rent to his older brother Seth, he interviews for a gaming director's job only to find that he needs to prove his leadership skills in order to stand out. This is his catalyst for creating a gamers utopia out in the countryside for him and his fellow gaming friends. At first life is great in this fantasy world he has created. Then his arch-nemesis ShadowHawk, shows up to tempt the citizens of Unicorn City and cause havoc in Voss's life. Voss must come to terms with his life and determine what is important and what is merely fantasy.<br><br>I know I sat down to watch this movie with some reservations. I had preconceived notions it might seem too removed for a non-gamer to fully appreciate most of the movie. I was also worried that there would be a lot of \"fantasy\" scenes to deviate from what was the true meat of the story. I was extremely surprised to find at the movie that this is quite possible the most I have laughed at a movie so far this year. Sure the gaming aspect was a catalyst for most of the actions and jokes but the real punchlines were everyday frustrations. This is what makes it possible for everyone to find a way to relate to the characters. Also you can really sense the love that they have towards their gaming life. Everyone needs something to escape from their daily lives and this is what they are passionate about.<br><br>Some thing else that I loved about the movie is, that even though it was an indie film, it didn't feel like one. The production value was definitely very high, and this goes back to my worry that there would be too many \"fantasy\" scenes which can easily eat up budget. The acting was very strong in the lead roles with a few of the supporting roles needing a little bit of work. There was definitely a sense of chemistry among the cast that seemed to fill in the cracks where there was a bit of light acting. Many indie's are also plagued by poor sound and an atrocious score. While the sound was nothing per se special, it was still strong and the score was excellent at some points and not affronting during the rest of the movie.<br><br>Basically the production team most certainly put their time and money in all the right spots. They focused on story first, and then fundamentals. More movies today need to follow their lead, and learn that in the long run I am going to appreciate this movie more because I don't need a expensive movie setup to get the full experience. I just need to sit back, relax and enjoy. I encourage you to do the same and try help bring it to your city. Click here—–&gt;Unicorn City, to go to their Facebook page where I hope you will like their page and click the widget on the left requesting it to a local theater. Help us spread the word about this wonderful piece of art and share it with as many people as possible. When they ask what it is like, respond that it's Role Models meets Napoleon Dynamite, with a dash of the Community for spice.<br><br>more reviews and geek stuff at www.dayoldstubble.com","user":"detz_all_folks","rank":[18,25]},{"title":"Overall funny film, but not flawless.","rating":7,"date":"10 February 2012","review":"The laughs build slowly in Unicorn City, a film that centers around a very small nitch of nerdy tabletop gamers who attempt to create a gaming utopia up in the mountains.<br><br>Usually the biggest flaw with contemporary comedy films is that they put all the laughs at the beginning and leave the third act with empty plot. Not so with Unicorn City, where the laughs slowly build as people figure out exactly what kind of a movie they're watching.<br><br>The obvious similarity to Napoleon Dynamite here lies in its dialog; sometimes funnier on the page and quoted by fans, than in the film. There could have been more laughs here had the soundtrack not become so invasive. The quieter the scenes are the easier it would be for the audience to pay attention to the nerd-banter. As Napoleon Dynamite proves, less is WAY more.<br><br>The majority of the laughs in this comedy come from situational and visual humor. Two scenes in particular; the pipe-sword coming out of the ground and the centaur arriving to the gamer utopia for the first time, show a unique humor that gives Unicorn City its strength.<br><br>There is some incredible acting from local talent in this piece, particularly Jaclyn Hales performance as the awkward love-interest. She is able to play such a laughable role with such honesty; there is no winking at the camera here.<br><br>The quality of the films visuals were also a big plus. The cinematography seemed more Hollywood than independent as Brandon Christensen shows us his full skills as DP. Only once or twice was the lighting obvious, which for a local Utah film is quite impressive.<br><br>However, this film is far from perfect; the plot was too predictable and too contrived to be believed (that job interview, please.), some characters lacked development, and overall, for a film about tabletop gamers, it was too clean (\"Oh my gosh!\" \"Bull Crap!\"--Come on, we all know what the dialog between real gamers are like).<br><br>But then again, it is a fantasy, and in this fantasy maybe our world is cleaner than it really is. The film is as detached to real life as the gamer characters are, so maybe., just maybe, that's the point.<br><br>Overall highly entertaining and fun for the whole nerdy family.","user":"jdmalachi","rank":[10,13]},{"title":"Amazing Independent film","rating":10,"date":"9 February 2012","review":"I watched the trailer and thought it looked funny even though I'm not a gamer. To be honest, I was still slightly hesitant about it, but with in the first five minutes I was so glad I was there.The not so nerdy to ultra nerdy would absolutely love this film. The movie posters stated that it was a cross between Monty Python and the Holy Grail and Napoleon Dynamite and they were right.<br><br>Unicorn City had wonderful comedic timing as well as unexpected humor. The storyline was was cohesive and engaging. The friends I went with said the music was a little too much at some points, but I didn't feel that way. It is an amazing independent film that could easily translate to a TV series. The characters were lovable the acting was very good. Support these amazing independent film makers and go see this movie.","user":"lynbyn","rank":[11,16]}]