[{"title":"Solid low-key mystery","rating":7,"date":"20 June 2015","review":"A three year old child goes missing in a small town where two teenage girls live, girls who had been recently released from prisoned for a previous child kidnapping and murder. Needless to say, suspicion soon falls on them.<br><br>The central idea in this film recalls the notorious British crime, the Jamie Bulger case. In this instance two young boys kidnapped and killed a toddler. It created a media storm and has remained notorious ever since. For this reason, the ideas underpinning this story are based on controversial ground but the film itself is handled in a very understated manner. It's partly a police procedural mystery and part psychological drama. Of the former, it is perhaps not as intriguing as it could be, although admittedly it does have some twists and turns; of the latter it is perhaps more successful where it looks at why a couple of damaged girls and one mother act the way they do. It's an efficient film, rather than an especially good one but it did keep my interest from start to finish.","user":"Red-Barracuda","rank":[43,48]},{"title":"Thought provoking, slightly upsetting.","rating":7,"date":"16 May 2015","review":"A CHALLENGE: Try making a film like this is modern day Britain, after what happened to Jamie Bulger in the early 90's. You'll discover quickly it's nigh-on impossible. The case is so infamous, it will probably have far-reaching effects on our society forever. And, in fact, when the producers of a horrible soap called Hollyoaks tried to develop a plot that bore only the slightest resemblance to the tragic murder over a decade later, they was so much protest that in the end they had to scrap the entire storyline. Overreaction? Or just respecting the parents and public opinion? YOU decide.<br><br>So, anyway... Here we have two socially awkward pre-teen girls, one a bit overweight, the other a troublemaker . They don't like each other very much. After getting thrown out of a party, they pass a house where a baby is sitting outside, unattended, in a pram. One of the females decides to kidnap her and keep the tot as her own, much to the chagrin of the other one. Eventually, the more sensitive child backs down, and the pair take her to their secret hideaway... Where they try to feed her nothing but pudding.<br><br>Of course, this leads to the infant getting sick, and unwilling to go for help (they don't wanna be caught, ya see?) a decision is made the child must die. Rather harsh, you might think... But not when one of the kids is clearly an unrepentant sociopath. I'll leave it up to you to find out which one, because there are a few surprises in store for the unwary. Regardless, the baby is murdered, the girls are captured, and spend the next seven years in juvie.<br><br>Flash forward to the present, and both have been released. The tearaway has got a minimum wage job, and looks permanently depressed. The fat one is even larger than before, and dreams of reality TV. Then, in the same area, ANOTHER toddler goes missing from a furniture store... And guess who the prime suspects are?<br><br>Every Secret Thing gives us two very distinct personalities, and slowly changes our perception of them, and the people in their lives, as it proceeds. The people who initially have our sympathy may not hold it at the end, as more revelations about the past emerge even while the investigation in the present is going on. It raises interesting questions about the justice system, how responsible kids that age are for unspeakable crimes and the accountability of parents in such matters.<br><br>The ending will split opinion, but I admired the realism of it. Sometimes, the people who should be punished aren't, and this is something all too common in courtrooms all over the world. Karma? What's that again? 7/10","user":"natashabowiepinky","rank":[40,47]},{"title":"More about the characters than the mystery","rating":8,"date":"10 August 2015","review":"This is an interesting little film. It's a dark story full of grim characters, most of the which are the type you hope never enter your life. You could call this film predictable (and it is to be fair) but I don't think that's where the strength of this film was ever supposed to lie. The strength lies in just how interesting the characters are. The mystery of just how evil each of them potentially is just adds to things.<br><br>For an under-the-radar film it has a pretty strong cast. Diane Lane, Elizabeth Banks and Dakota Fanning all turn in strong performances and the lesser known actors do a good job as well. It's also well directed and despite there being almost no action scenes during the 90 minute run time, the film never drags which is always a good sign. Altogether it's a fine little film that I hope a lot more people get the chance to see.","user":"jtindahouse","rank":[23,28]}]