[{"title":"A mature, insightful look at aging and youth, undermined somewhat by an ill-advised detour into semi-thriller territory.","rating":7,"date":"7 April 2015","review":"Getting older is an odd business. We know it happens to us, every day, every month, every year. And yet, it also sneaks up on us. Suddenly, we're the oldest people in the room, with the most out-of-date vocabulary, squinting and fussing when once we used to laugh and shrug it all off. Our zest for life is rapidly depleting, and time is running out. Writer-director Noah Baumbach's While We're Young is a wise, witty look at a couple caught in between generations - they're middle- aged, by any and all measures, but are still young enough to hear the siren call of reckless adventure and self-exploration. It's a shame that Baumbach's film winds up making a far less successful segue into the realm of a psychological semi-thriller.<br><br>Filmmaker Josh (Ben Stiller) has been in a state of arrested development for years. As his friends settle down with babies and careers, he's been making the same dense, complicated documentary for close to a decade, whilst his happy marriage to Cornelia (Naomi Watts) remains in the same gear as it has for ages. But Josh gains a new lease on life when he meets Jamie (Adam Driver) and his wife Darby (Amanda Seyfried), a free-spirited pair of twenty-something-year-olds who still sparkle with the possibilities of life, hope and renewal.<br><br>While We're Young is at its best when it makes thoughtful, sharp observations about aging. In the first half of the film, Josh rushes to keep up with his new young friends, dragging Cornelia along for the ride. Suddenly, they're shaken out of the rut of their lives, wearing jaunty hats, participating in mass spiritual retreats, and forcing their less flexible bodies into hip-hop classes. Baumbach skilfully juxtaposes this with Josh and Cornelia's increasing disenchantment with their old friends, Marina (Maria Dizzia) and Fletcher (Adam Horovitz), who are caught up in a frenzy of new baby worship. Baumbach's insights are nestled within his scenes and characters - tiny lines or moments will strike home for anyone who's felt out of place for age-related reasons.<br><br>What works less well is the moody semi-thriller (possibly titled Not Quite Single White Male) that Baumbach tries to graft onto his comedy about life and aging. It plays very well at first, as Jamie reveals himself to be - just like Josh - a documentarian, and one who - unlike Josh - seems to have everything work out perfectly at every step of the filmmaking process. It's a nice contrast, because it prompts Josh to keep questioning himself about whether he has, after all, squandered away his youth on something that was never meant to be.<br><br>However, Jamie's relationship with Josh takes on a more sinister tone as the film progresses. His intentions are called into question, with the shortcuts he takes and the friends he makes bordering on the questionable. It's good character work, to be sure, but ends up confusing rather than deepening the overall narrative. By the time Josh barrels toward an awkward showdown with Jamie, Baumbach seems to have forgotten the point he was making with the film in the first place.<br><br>Nonetheless, the film is a worthy vehicle for Stiller and Watts to really dig into their characters and relationship. It's nice to see Stiller really embrace a darker, deeper role that's not quite in his wheelhouse. He pulls it off very well indeed, lending great weight and an unexpected vulnerability to Josh's insecurities. Watts, too, relishes the part of Cornelia, one of the best-written roles in recent memory for a woman in her forties. The film may ultimately belong to Josh, but Watts' Cornelia isn't merely set dressing meant to evoke a life. She's a full-fledged person in her own right, tough and tender, with her own personal heartbreaks that make her the person we see in the film.<br><br>You wouldn't think it, given their wildly divergent career paths to date, but Stiller and Watts also share plenty of chemistry. He may be better known for comedy and she for drama, but it's evident here that they can each handle both with plenty of intelligence and polish. It's a delight, therefore, to watch them navigate the tapestry of their relationship, as Josh - fired by jealousy and paranoia - starts worrying at threads of it such that it begins to unravel before Cornelia's eyes. And yet, the fact that these two characters truly love and respect each other through it all is never in doubt.<br><br>Although While We're Young may not completely come together as a coherent whole, that doesn't detract from the quiet wonders of this smart, whimsical, bitingly real film. It's a pleasure to spend time with characters this real and rounded, to recognise in them the abandon of youth and the relative stability of age. In his offbeat way, Baumbach is warning us that trade-offs between the two may be less rigid than we have been taught to expect. Like the film itself, it's a welcome insight, one that's filled with both hope and maturity.","user":"shawneofthedead","rank":[80,101]},{"title":"A Puzzling and Dissatisfying Third Act Cannot Derail this Charming Dram-Com","rating":7,"date":"29 January 2020","review":"Watching people realizing they're no longer young and hip naturally lends itself well to humor, drama, and self-examination, but the subject matter alone doesn't always naturally lend itself to a neatly formed story. The writer/director has to handle that part. Good thing this movie has Noah Baumbach.<br><br>Baumbach brings a knowing touch to this film, always seeming to strike a fitting balance between humor, drama, and analysis, all without ever feeling heavy handed or condescending. He allows his characters to show viewers the dichotomy of a young, idealistic (Adam Driver and Amanda Seyfried) juxtaposed against the aging couple (Ben Stiller and Naomi Watt) who have lost a bit of luster but are a bit in denial about their quasi-happiness.<br><br>After the couples meet and become fast friends, it's the older couple who draws inspiration from the young. They slip right back into their own youthful beliefs about the world and how they should exist in it. Some of their thoughts are meaningful, while others are sappy and, well, juvenile. Despite recognizing the silliness of the young couple's lifestyle, like watching VHS tapes and listening to records just because, it's easy as a viewer to fall under their spell. Driver and Seyfried are effortlessly charming, and their exuberance and self-certainty make them appealing role models.<br><br>The epiphany about how to live life that the young couple gives to the older one is a little too easy and convenient. Something must be off. Baumbach was simply reeling us in, making us listen more closely as he continues his story.<br><br>This is where the most crucial part of the movie arrives, and it's the one Baumbach handles with less success. Just as the salient message of the movie should be coming into focus, the story instead veers swiftly towards a grumpy take on the ethics of documentary filmmaking.<br><br>The third act is a little unsatisfying, but it is certainly not enough to erase what is on the whole an intelligent, humorous and enjoyable movie.","user":"Jared_Andrews","rank":[8,8]},{"title":"Ben Stiller is more interesting when he is not playing slapstick characters.","rating":31,"date":"31 July 2015","review":"This is an obvious story. When you are middle aged, i.e. in your 40s, you can get into a routine, a rut of sorts, with almost no excitement in your life. If you don't watch out. And when you do, and realize it, you need to do something.<br><br>The script demonstrates this cleverly near the beginning, the couple are settling into bed for the night, she turns on the bedside lamp to read, he squints a bit and muses that the light seems bright. \"What is the wattage of that bulb.\" She looks, squints, \"I think it is 75 watts but it is bright and I'm not sure.\" Only a long-term couple that has settled into a boring routine would have that exchange as if it mattered.<br><br>The couple are both 40-something actors Naomi Watts as Cornelia and Ben Stiller as Josh. They live in New York, naturally, have no children, he is a filmmaker working on his second documentary but seems stuck. He has hours of film, some good interviews, but is having trouble pulling it all together.<br><br>He is just finishing a lecture and at the end meets a younger couple, Adam Driver as Jamie and Amanda Seyfried as Darby. They are just the opposite, they are spontaneous, they seem to see life and the world around them as one big playground. And he is also working on a documentary.<br><br>As it turns out Jamie and Darby didn't meet Josh by accident, he was targeted. It raises some ethical issues, especially when it is discovered that much of Jamie's \"documentary\" was actually arranged. But through it all Josh and Cornelia learn some things about themselves and some ways to look at their lives in different ways.<br><br>A pretty entertaining movie, I always like Watts and I like Stiller when he is NOT playing some slapstick role, he is actually a very effective actor.<br><br>As an aside it was nice seeing Peter Yarrow as the oldtimer being interviewed, as Ira Mandelstam. Most are probably too young to remember the singing group \"Peter, Paul and Mary\", which rose to the top in the 1960s, but he is the \"Peter\" of the group. I saw them live in Houston in the 1980s, it is nice to see him still finding new things to do.","user":"TxMike","rank":[8,8]}]