[{"title":"A Christmas gift for fans of Cirque's Las Vegas shows!","rating":10,"date":"21 December 2012","review":"I - LOVED - IT!!!!!!!!! I want to see it again! And I will...going back two or three times next week.<br><br>Yes, I have seen mediocre reviews, but there are couple of requirements to enjoying this movie: 1. You have to LOVE Cirque Du Soleil. Not just \"like\"...you have to love them.<br><br>2. Don't spend even one second trying to analyse the plot. It's about a young woman who is mesmerized with a young male aerialist and she tries to find him again when they are separated. Everything else are sections of different Las Vegas Cirque shows and even in their entirety don't always make sense. If you try to understand why this is here or that is there, you will run out screaming.<br><br>3. It helps a lot to have seen at least a few of these shows in Las Vegas because the movie selects some of the best parts from each.<br><br>4. Did I mention you have to LOVE Cirque du Soleil? I think one or two people did walk out but those who stayed applauded and stayed all the way through the end credits (which were very lengthy because they listed each LV show, each hotel, and each person on the crew of the individual productions).<br><br>The film did present some of the best moments from each show, and getting close added to it, giving us devotees a new look at it. And with the battle scene on the rotating steel plate from \"Ka\", a look from different angles was a blessing.<br><br>My favorite Cirque show in Vegas is \"The Beatles' Love\" and other fans of that production will be very happy. There are about six scenes from it (with Beatles music in the film, too), including \"Get Back,\" \"Octopus's Garden,\" \"Lucy in the Sky With Diamonds,\" \"Being for the Benefit of Mr. Kite!\", \"While My Guitar Gently Weeps,\" and the film ends with a group shot of curtain moments for the different show casts set to \"All You Need Is Love.\" Cinematography is excellent. And the 3D is spectacular! Is it just a huge commercial for Cirque du Soleil's Las Vegas shows? Yes. Do I recommend it? Yes! Yes! YES!!!!","user":"modrnknght","rank":[36,38]},{"title":"A lot of hard work and talent","rating":9,"date":"29 December 2012","review":"I was a little scared to see this after reading some of the negative reviews such as Shankru_Spam_Begone's. I did not want to see one of those movies where they give you the audience's reaction so you can be spoon fed to know if something is good or not. As another reviewer already mentioned Shankru_Spam_Begone, saw some other movie, not this one. There were no scenes of audience reaction. If you cannot watch ballet because the dialogue is weak, then maybe you will get bored in this movie. If you get bored watching the Olympics, then you might get bored watching this movie. I threw up in the theatre watching Blair Witch project (even though I was bored in it) because of the shaky camera work, and I was scared going into this one, reading here about the jerky camera. I also saw nothing like that. At a live show, you do look at many different things going on, but you cannot get the close ups like you do in this movie. Another reviewer complained that there were no scenes from Cavalia, which I thought odd, since no Cirque du Soleil shows involve animals, so why should they include another company's work that does not fit their theme? Weird comment.<br><br>I have seen Ka, Mystiere,and Zoomanity live and I liked this movie as much as that. My wife has seen a couple others as well and liked the movie more than I. I was shocked and dismayed that the movie theatre was almost empty on a Friday night but as my wife pointed out, young people would rather see CGI than real talent on the screen.","user":"Pookie Mahdis","rank":[25,27]},{"title":"enchanting","rating":9,"date":"22 December 2012","review":"I have seen at least 8 of the Cirque shows - (the most fun are those in the circus tent) - and I look forward to the shows coming to my home each year. Watching the 3D movie was a treat. Since they were able to have cameras in so many different locations - above, below- the effects are really great. I liked the fact that you could hear the smacking of the acrobats shoes on the big wheels - really got the feel and the danger of that act. <br><br>I loved the beginning from \"O\" - the water adds to the acts. You are able to really see the actors - and appreciate the talent they have. I would go again - I will buy this DVD - and I will continue to go to the live performances. Even though I am not an Elvis or Beatles fan - I liked the music. Would like to have seen some of Michael Jackson in it - that was a fantastic live show.<br><br>Thank you for bringing this to the theaters - many people cannot afford the price of the live shows and this brings it to more people. I am glad that others will be able to see it. And I will again.","user":"pamma09","rank":[19,20]}]