[{"title":"Irritating Format and Serious Miscasting","rating":6,"date":"17 September 2012","review":"If your prime reaction to a film is one of disappointment there are usually some good reasons. My principal response to this version of a great and well-known story is one of irritation. The overblown theatrical format of the film gets in the way of character and dramatic development, to the point where you're aware of a director proclaiming \"aren't we clever with the way we're staging this?\" instead of admiring the straightforward and competent telling of a story. I'm not saying all films have to be constructed in a conventional manner, but when the form overtakes the substance something has gone wrong.<br><br>Aaron Taylor-Johnson as Count Vronsky is a piece of serious miscasting. Instead of looking like a great lover and sure temptation for wavering Anna,he looks like some feeble dandy with his foppish shock of dyed curly blonde hair which makes him look quite ridiculous. How on earth Anna could fall for such a creepy-looking guy is beyond most viewers I would submit.<br><br>Keira Knightley does the best she can, despite looking most of the time like she's attending a fashion shoot. The character of Anna requires portrayal of a tragic life which she doesn't quite achieve. However, the whole film fails to convey the grandeur of Tolstoy's vision, so she's let off the hook by the film's general levity and lack of substance.","user":"phil-cree","rank":[296,381]},{"title":"One Russian's take on the film","rating":1,"date":"12 September 2012","review":"So, it is out – the film that so far has divided the opinions of the critics and audiences alike. A lot has been said about its theatrics and casting, visual effects and costumes. The trailer alone made me go to see it the first day it was released in London. Despite the misgivings about the casting of the main characters, I was hoping that the opulence of the setting, decorations and costumes would be just enough to make it enjoyable and compensate for any acting mishaps. <br><br>The film focuses is on the key relationships in the novel taking the bare carcass of the storyline. The result is a mechanical sequence of events, devoid of any depth and humanity and almost clinically cold. Many nuances of the relationships are not explained at all and, had I not read the book many times over, these would have been lost on me. All of the socio-political and ideological issues affecting Russia in the late 19th century, as well as the questions of humanity, faith, religion and the meaning of life, are largely left out. Not only this accentuates the oddly flat quality of the scenario but also, owing to the lack of context, makes certain scenes (e.g. Levin in the country) look oddly standalone. <br><br>As to the casting... Keira Knightley can be a delight to watch in the right context, i.e. when she can get away with being herself on screen (e.g. \"Bend it like Beckham\" and \"Love actually\"). However in the costume/period dramas she makes no allowances for the differences in social behaviours and mannerisms and ends up looking like a flirtatious modern girl at a fancy dress party. In the book Karenina's character is a sophisticated, mature, confident and sensuous woman of high society and rank but also a deeply kind, humane and down to earth person. It is the latter qualities that endear her so much to the fellow book characters and readers alike from the beginning and help us feel the tragedy of her situation so keenly later. Knightley's Karenina is an all-too-young, flighty coquette with no obvious emotional maturity and little sense of decorum gradually developing hysteria which left me torn between incredulity and laughter. I wouldn't normally comment on the physical appearance which should be incidental to a true acting talent but modest chest and bony back sticking out of the impossibly low-cut dress (for the 19th century) add little to the believability of the character. Vronsky, with those blue eyes, blond locks, stiff movements and bland facial expressions reminds more of a china doll than a dark, handsome, charming and intense character that Karenina falls for. Would she fall for this version of Vronsky? Doubt it and neither did I. As for the rest of the cast, the only characters that look vaguely believable (and that taken in the context of the rest of the cast) are those of Kitty and Dolly. Ironically Kitty becomes more so towards the end of the film, when Dolly loses it entirely owing to the dialogue with Karenina at the tea room.<br><br>Lastly I would like to touch upon a few details of costumes and styling which I find worth of note. I wish the costume designer incorporated the Russian fashions of the 19th century more faithfully. The façons presented with the backs cut out almost to the waist did not become fashionable (in fact, socially acceptable) until the 20th century. During the time portrayed in the film/novel they would have been scandalous. Lavish jewellery was, indeed, in vogue (although it is the understated elegance of choice so meticulously highlighted in the book that would have been true to Karenina's character). What Karenina wears in this film is unmistakably Chanel 21st century and bears no resemblance to the style or make of the time. I guess one comes to expect at least some product placements as part of the modern film industry and, in the absence of cars/phones/laptops etc in this film, one had to make the best out of what was available. Add to this aristocrats dressed like peasants (Karening in the ice-skating scene), rich landowner styled like a monk (Levin's hair throughout the film) then same landowner donned in a top hat not worn by the people from his \"soslovie\" (social stratum), Betsy and her jaundice coloured dress, Karenina at the theatre in what looks like a wedding dress and ermine stole, Karenin wearing his wedding band on the left hand (instead of the customary right in Russia), Karenina wearing multiple rings (Chanel-style, naturally) on both hands, - was someone confused as to the custom and decided to tick both boxes, just in case??! Classical waltz transformed into anything but, with peculiar hand movements that one critic described as \"beguiling\" but which looked suspiciously like mutual slapping of pesky insects and afforded a great deal more of physical intimacy in public than what was socially acceptable. Russian folk songs sang with strong foreign accent. At least no one in the film tried speaking with the Russian accent and for these small things, Lord, one should be grateful!<br><br>Overall, I wish I could call the film a drama or, at least, a parody on the 19th century Russian society but, given its omissions and disregard of the cultural or social realities, it is not. For all its pomp and pretentiousness, the film fails to make a single character or scene fully believable, forget about moving or meaningful, and the final result appears to be nothing but a parody on the original effort. Some critics called this film as \"breathtaking\". I agree, it is breathtaking, - breathtakingly awful, that is.","user":"ti-swan","rank":[497,669]},{"title":"What Did I Just See","rating":2,"date":"21 January 2013","review":"I wanted to see Tolstoy but instead I thought I saw Mel Brooks. This movie could be renamed Springtime For Anna. Except it wasn't funny. <br><br>A great cast poorly used in a pretentious adaptation. <br><br>Jude Law did well with the material given. Keira Knightley, always a pleasure to look at, was miscast in this one. Aaron Taylor-Johnson as Vronsky reminded me of Gene Wilder in Young Frankenstein. <br><br>The switch from stage play scenario to movie scenario only confused the plot. <br><br>Thank God Tolstoy is not alive to seek legal recourse. <br><br>I wonder how IMDb could give this film a 7.0. <br><br>Some nice visuals all that can be said in its defense.","user":"cmi-573-437033","rank":[52,69]}]