[{"title":"Better than people say","rating":9,"date":"18 March 2018","review":"I loved this film. A lot of people don't like this film because the plot is very confusing and hard to follow but the whole message of the film is that sometimes life doesn't wrap things up in a nice little bow and sometimes everything doesn't come together in the end. I've seen this film a few times now and I like it more everytime I see it. The first time I didn't really like it because I was trying to keep up and get my head around the plot but after I became enlightened to the theme, then I was just able to sit back and experience the journey. It is a great character study. Joaquín pheonix is fantastic and his character is great, all the characters and performances in this film are great and fun, Josh Brolin works really well and had great chemistry with Pheonix, and Martin Short was hilarious when he came into the film he was amazing. There were so many great moments and great lines scattered about like when he visits the golden fang institute. The dialogue on the whole is inconsistent as a lot of it is exposition for the plot but when it isn't that it was fantastic. This is one of the most enjoyable films because you don't need to worry about understanding the plot because you're not supposed to understand it and instead just sit back and relax. The directing is great as always from PTA, the film is really well made. My only criticisms are the film gets weaker in the last 20 mins or so and probably should've ended earlier and that some of the dialogue is just exposition. However I love this film on the whole, I love the soundtrack and the unsatisfying ending reflects the whole film, it reflects the character and how really he gets nothing done in the whole film. And it also reflects life, and how in life often things don't have satisfying endings.","user":"johnfg-83353","rank":[44,45]},{"title":"Its impossible to criticize this movie","rating":5,"date":"28 October 2019","review":"We can't criticize the incomprehensible nature of the movie because it was intentionally written that way to capture the tone of the novel. Eventhough I personally couldn't enjoy this movie, I completely understand why other people like it. I understand what they were going for but I couldn't connect with it personally. All the performances, especially by Phoenix and Brolin were top notch. Both those characters were written extremely well. There were some genuinely funny sequences too. However there are several instances where Doc relies in coincidences and conveniences to uncover the cases. This aspect felt like lazy writing.<br><br>\nI don't dislike this movie but I can't like it either. I have such a complicated opinion on this movie. PTA is one of the best directors working today. But I couldn't appreciate this movie like I did with his other movies like the master","user":"amanmsp","rank":[19,20]},{"title":"A Bizarre and Ultimately Rewarding Experience","rating":11,"date":"11 January 2019","review":"Inherent Vice is certainly one of the most bizarre movies I've seen in a long, long time. Paul Thomas Anderson demonstrates his love of Thomas Pynchon by creating a movie that in every way feels Pynchon-esque. The film is a faithful adaption of Pynchon's late 00s novel but with a few minor sub-plots (such as the Las Vegas trip and the bets/claims) removed, not that they mattered really.<br><br>Joaquin Phoenix is one of my favourite actors and this movie - much like his previous one with PTA, The Master - is reason why. Phoenix plays a buffoonish caricature that sometimes makes us wonder if he was smoking actual pot during filming. Josh Brolin also provides a fine performance. There are a handful of women in the film but it's sad to say that they don't get enough attention in the film.<br><br>The dialogue is incoherent. You may not understand what's happening in the film at any certain time. You may ask: \"what are they talking about?\" \"wait, what just happened?\" Best reasoning I can provide is that this movie - much like its leading character - is high and rambles aimlessly here and there.","user":"sharansrinivas-g","rank":[18,19]}]