[{"title":"The first was better","rating":4,"date":"13 October 2012","review":"Only a few sequels can stick the great success of the first movie nowadays. Benvenuti al Nord is not so bad but there is nothing new here. I saw many jokes and typical situations of the Italian north in Milan. Some original scenes rounded this second part up. I think in the last one there were also some ridiculous scenes but these didn't slow down the dynamic. As an Italian I understood the funny dialogs in dialect so that I spent a real entertaining time. It's much more enjoyable if you see it in the origin language version with subtitles. But I cannot imagine that there would be ever a third part. I suppose the ideas are sold out for the next one. Thumbs up for Alessandro Siani and Claudio Bisio that delivered for a second time a very convincing and respectable performance. 4 out 10.","user":"Luigi Di Pilla","rank":[12,12]},{"title":"Also the North is beautiful (but no too much \"Welcome to the North\")","rating":6,"date":"31 August 2019","review":"Sequel of \"Benvenuti al nord\", this movie is the mirror of the first one: now the southern man has to live, for working, in the North. Here he found all the stereotypes about the northerns that are counted in his original country, as in the first chapter, but reverse. In Italy, humor about regional stereotypes is well accepted and surely with this techniques the movie can have success; but about quality it is too much a repetition of the first one with also less convincing facts and a too much fast evolution of the story and the psychological positions. Siani is a kind of little Troisi, but can't reach his talent. As a lot of Bisio's film, confronted with other Italian comedies, this movie can be seen with joy and fun, but it is nothing special and surely inferior to the first.","user":"anthonyf94","rank":[0,0]},{"title":"Agreeable Italian sequel.","rating":10,"date":"10 October 2012","review":"The Italian version of the Danny Boon WELCCOME TO THE STICKS was, if anything, an improvement on the original and just to buck a trend the sequel to that one manages to up hold the standard and come up with a nice twist.<br><br>Transferred to Milan after an argument with his fellow postal worker wife Lodovini, Siani undergoes a personality swap with gung ho Northerner friend Bisio. The wife comes to the city convinced that her easy going husband isn't so easily corrupted and they are pulling the same kind of faking that the Southerners went in for, when making convincing Bisio's made up story about their harsh life. Her faith in her man is a nice touch.<br><br>The participants are largely unknown in the English speaking market but are all on top of their game and what they deliver is a good looking comedy with some nice flourishes.<br><br>The one takes play out song is one.","user":"Mozjoukine","rank":[0,3]}]