[{"title":"Formulaic Sobstory Has Its Moments","rating":30,"date":"30 August 2017","review":"\"A Family Man\" juggles two realities of the hard-driving headhunter Dane Jensen at work in a cutthroat business world in contrast to his struggles in maintaining the semblance of family life as a devoted husband and dad. When his son develops cancer, Dane's life changes as he learns lessons about his workaholic lifestyle.<br><br>Much of the action is predictable, and much of the dialogue sounds scripted, as opposed organically deriving from character and situation. When an angry Dane berates his wife Elise in front a large family gathering at Thanksgiving, he broadcasts to the entire group that he \"plays Santa Claus 365 days a year\" and that Elise takes for granted his hard work and income derived from his grueling telemarketing exploits. Some of the dialogue even seems difficult to take seriously by the characters themselves, as serious conversations typically end on a comic note.<br><br>The roles of the husband and wife are well-performed by Gerard Butler and Gretchen Mol. There is also a sensitive performance the actor playing in the kind doctor. Alfred Molina is outstanding as the unemployed engineer Louis William Wheeler. Lou's reaction in the bathroom to the news of his new job is priceless.<br><br>An interesting part of the film was the little boy's fascination with the architecture of Chicago and his bonding with his dad when they visit five of the famous buildings. Those sites included The Rookery, The Tribune Tower, The Jay Pritzker Pavilion, The Wrigley Building, and Frank Lloyd Wright's Thomas Gale House. But once again, the dialogue sounded artificial as the father and son rattle off history lessons during their visits to the various buildings.<br><br>\"A Family Man\" is a workmanlike film that cobbles together traditional elements of the film melodrama. But it does not transcend the limitations of that genre in shedding significant light on the pressures of succeeding in business and family simultaneously.","user":"lavatch","rank":[11,11]},{"title":"Well-observed story with new-quality Gerald Butler","rating":9,"date":"7 August 2018","review":"Not everyone is going to appreciate Mark Williams's \"A Family Man\"; and the level of appreciation a viewer does achieve is going to depend more than slightly on a couple of controversial matters. First and foremost is acceptance of terminal illness in a child as a justifiable plot device. The kid here - the part of Ryan Jensen - is Maxwell Jenkins, and he does a very good job. But this is heavy stuff, and might be regarded as a hammer to crack a nut, since this plot is needed to make Ryan's father focus in - at least a bit - on what really matters in life, and what really matters is not (supposed to be) work! <br><br>The father - Dane Jensen - is played here by Gerard Butler, who mostly leaves behind his typical kind of role (and his Scottish accent). Which brings us to accept/not accept number 2, and I must say I accepted. Indeed, I warmed to Butler as the character - and to the character itself - far more than I anticipated. The mother of the family (Elise Jensen) is a character (well) played by Gretchen Mol, but the real, realistic joy, interest, sadness and \"meat\" of the film - for me at least - is the way she basically/mostly fails to understand/sympathise with the nature of the 21st-century trap her husband has fallen into, not especially because he even wants to, but simply because that is how life is ... NOW.<br><br>This plotline from real life familiar to many of us goes as follows. A great many people today do jobs whose titles tell you little, and whose descriptions beg the response - \"you can make a career out of that?\" But this is the 21st century, and few indeed of us are logging or mining or making cars or even teaching or nursing or policing or being Marines or doing medical research. (A glorious contrast in the film is by the way provided as Dane comes into contact with Sikh Dr. Savraj Singh (a very good Anupam Kher), whose \"real job\" is saving Ryan's life). But many, many people are not exactly producing very much of utility, beauty or future value, but rather helping move money or assets around, and somewhow magicking income up out of nowhere, with who knows what real resources underpinning it. At the outset, the character of Ed Blackridge - that's Ed's boss - sets this scene clearly, and makes it clear that he has gone further than Dane, in that he doesn't even pretend there might be work-life balance, for work and the lifestyle that goes with it is ALL he has, and that allows him to make plenty, and saves him all those expensive items of expenditure (and precious time) associated with family, education, home and all that stuff. You might expect to find somebody playing this part with panache, and you get Willem Dafoe, who does it JUST RIGHT here.<br><br>But although Dane (a headhunter as it happens, though it could be a thousand other \"corpo\" jobs) has taken many a leaf out of Ed's book - far more than his wife would like - we know that he works in this kind of field as the ONLY way for most people to ensure better income in modern America (or other countries in fact), and even then with that income being dependent on working nearly ALL the time, and even then most likely straying beyond the threshold of morality at times. This is not actually Dane's choice, this is what the modern world does, as economist Thomas Piketty will tell you. In a conventional, old-fashioned job you will be mostly condemned to struggle at the boundary between the lower middle-class and the working class, with your income going nowhere for years and years - as it indeed has done in the US and UK for a start (hence support for Trump and Brexit), while even going backwards in countries like Italy. A person might escape that trap by working \"flexibly\" (meaning 24/7) and/or (sadly/unforgivably) by working deviously - at somebody else's cost. And that way the family (who hardly knows you) is supplied with a standard of living it takes for granted, but WOULD really and truly bemoan if they lost it (however much they protest otherwise when it suits them). But of course that does not stop them (does not Dane's wife Elise and even his kid) from taking the perceived higher moral ground, and criticising endlessly how the guy works - thereby blaming him for some law of the modern world not of his making.<br><br>In fact, Dane DOES find a way out - actually helped by Ed (a sweet twist), but in this he does not resemble the majority of the population in America and Europe (at least). There are one or two other plot subtleties, and a beautiful little sub-story about dad-kid quality time focused on the architectural highlights of Chicago - a lovely thing that (like pretty much all of the film) I can very readily understand, appreciate and sympathise with. It's great empathy from the makers. <br><br>Interesting, then, that this is seen by some as a woman's film - and doubtless the theory is that Elise gets sympathised with. <br><br>But my male take is of sympathy for Dane (if not for his crude descents into immorality and wrong business practices - which I condemn while nevertheless seeing the reasons). <br><br>\"A Family Man\" is not going to appeal universally, but - beyond its possibly-exaggerated flirtation with mawkishness or sadness (depending on your point of view) - it does really, really observe the world around us, which is a wrong world that places value on the wrong things. Who knows if that can ever now be different?","user":"jrarichards","rank":[8,8]},{"title":"A movie that speaks about everyone.","rating":10,"date":"23 September 2017","review":"Excellent movie reminding us what is really important in one's life. Will make you reflect on the \"real\" priorities and appreciate what you already have. A movie that teaches us an important lesson about living an honest and authentic life. Simplicity is a blessing when you live in the city jungle.","user":"andreangel-49543","rank":[23,31]}]