[{"title":"Made no sense","rating":2,"date":"13 August 2018","review":"This movie made absolutely no sense. The caretaker, Jocelyn, was, at her best neglectful of her responsibilities around the house and at her worst, very abusive towards and inappropriate around the man she was supposed to be taking care of. Considering the fact that she was at the house for no more that a week or two, her gradual mental deterioration and feelings of loneliness and paranoia seemed to make no sense. Overall her sporadic change in behavior as well as the noticeable and unexplained changes of the townspeople that she interacted with was weird and unnecessary. And when the movie wasn't weird and jumpy, it was just really slow and boring. Even though I've read the synopsis and descriptions on both hulu and on here, I'm still honestly not sure what this movie is supposed to be about. Everyone was weird and none of the characters (except for the elderly man) was worth caring about.","user":"socialsunshine-12645","rank":[17,21]},{"title":"Lost","rating":3,"date":"27 May 2018","review":"For the average movie-viewer, this one's a no-go. Recently ran out of movies to watch on Hulu, then all of a sudden this one comes into frame with a mysterious and intruiging description, so I watch it. Big mistake. From intro to end, the plot is wishy-washy. There was no point in time where I was able to think \"I know exactly what's going\", even after thorough review. The plot never stomps its feet down to create any certain feeling; one minute you're nervous for the outcome of a scenario, the next you're uncomfortable and in a state of unease. Overall, Without is just another pseudo-deep, kiddie pool of a movie. The film equivalent of This is America. Thank you","user":"samuraiseth","rank":[16,26]},{"title":"Beautifully acted, shot and executed","rating":8,"date":"28 January 2011","review":"I had the pleasure of watching this movie at Slamdance 2011 a few days ago and can't stop thinking about it. \"Without\" has such a nuanced story that it offers a lot, I think, upon a second or third viewing (unfortunately I've only seen it once). Joslyn Jensen's performance was mesmerizing, made more so by the excellent cinematography.<br><br>The film takes you in different directions, and you're never sure where you're going to be left until the credits roll. It tries to tell many stories, and in some ways may be overreaching with this ambition. This is okay, though, as the journey is well worth it, and gives you many things to think about over the following days.<br><br>If you get the chance, see this movie. I hope it'll get distribution in the near future.","user":"ewaters-imdb","rank":[9,21]}]