[{"title":"A true must for every heavy metal fan out there","rating":9,"date":"27 January 2011","review":"The Big Four are a legendary band of bands in the world of Heavy Metal. Formed in the early 80's, Slayer, Metallica, Megadeth and Anthrax set out to rock the metal scene with an entirely new sound: the thrash metal- sound. They are The Big Four (The Biggest Four!) of thrash metal for a reason. You will know the reason when you have watched this concert in its entirety. The picture-quality is absolutely stunning. Every drop of sweat can be seen, every tooth from the grin of every face. But metal ain't 'bout the looks! Metal's 'bout sound. And the sound is simply perfect. Play it loud, play it good, and enjoy this five-hour metal fest. The bands all sound perfect and return to all of their roots, as well to their newer stuff in the show. There is of course a setlist available, should you want to look into it.<br><br>What are the main features? Anthrax opens with their fantastically performing front man Joey Belladonna who seems to have had most of the fun that night! The band plays much of their great classics. Great decision to let Anthrax start, because they will give you a smile on your face and get you in the mood to bang some head. Megadeth follows with a legendary setlist if you ask me. Every song played by them is a one shot wonder and the band is in excellent shape. Slayer comes up next with the darker, heavier sound. Should you not be that much into Slayer, you can still very much like their performance, because they did a great job, especially front man Tom Araya who is doing a great job of vocals. And last but of course never the least: Metallica. These heavy metal giants take not one, like the others, but two head banging, string shredding and voice tearing hours to give us what we want: Metal! Metallica comes up with their famous intro song: Ecstacy of Gold. One can simply nod when hearing the enchanting sound which announces what is to come: the best metal band on the planet. The band plays its best songs as well as some of their slower ones. There is nothing but awesomeness about this DVD. If you like metal - Buy this. Period.","user":"LennyOO","rank":[8,8]},{"title":"Epic concert","rating":31,"date":"31 December 2014","review":"To date, The Big 4 has to be the most epic concert DVD I have ever seen. It brings four thrash metal bands together for an epic metal concert show: Anthrax, Megadeth, Metallica, and Slayer. Each group stands on their own as they take their turns on the stage to perform in front of a huge audience in Sofia, Bulgaria.<br><br>Joey Belladonna shines through as he sings Anthrax classics such as \"Caught In A Mosh,\" \"I Am The Law,\" \"Medusa,\" and the John Bush-era \"Only.\" Like Anthrax, the other bands made impressive performances in this concert, too. Slayer, in particular, delivers the goods with songs like \"Angel of Death,\" \"South of Heaven,\" \"Raining Blood,\" and \"World Painted Blood.\" Of all the highlights on this DVD, none are more significant than the bands (albeit minus Slayer's Tom Araya, Jeff Hanneman, and Kerry King) joining together on stage to perform to the Diamond Head song \"Am I Evil?\" <br><br>Awesome concert DVD - and one that no metal-head should be without!","user":"4-Kane","rank":[1,1]},{"title":"An epic and historic date","rating":7,"date":"13 December 2016","review":"An astonishing, amazing, incredible, kick ass show from metallica, Not just because they are a GREAT band to me, but in particularly this show stands out. A very very very good Show from megadeth.<br><br>Though....an unfair selection of the big four. Why not Iron maiden?, I don't even like maiden that much. But Slayer there...is unfair.... Im not saying is a bad band, but in my opinion there are other bands that deserved to be there before them. It is very well produced, the whole shows, excellent filming and post production, though..Lars drums are a little bit low in the mix. Curious. The documentary is from star to the end has no waste, very interesting and fun. Including slayer parts....hahahaha","user":"videosincro","rank":[0,1]}]