[{"title":"Atmospheric, but doesn't make much sense","rating":4,"date":"21 May 2014","review":"Again: Many spoilers ahead.<br><br>At first, I kind of liked this movie - the two lead characters are well played, and so is their relationship as it develops through the meandering memories and the developments in the supposedly real world. It's adequately somber. The twists towards the end were a bit obvious in my opinion - of course she was luring him to the house and setting him up, and of course these were his memories, with the distant guy watching in precisely the way the main character explains at the beginning.<br><br>Unfortunately, once you start to think about the plot, it falls apart.<br><br>He's a detective, yet he doesn't really look at any of the clues he has taken home (e.g., the yearbook) in any depth until after the case is practically closed. Nice evidence board decoration he had on the wall - he should have perhaps drawn one up for this case too. And when called, he does this oh so old stupid movie mistake of rushing in without telling anybody. When will movie writers finally stop using that?<br><br>Her side is even worse. There were signs of her interacting with the outside world, e.g., her drawing of stairs where he believes to have seen her. Was she able to occasionally escape? Apart from that, nothing of her whole back-story was explained; did she or did she not commit any crimes? Had she just been at the wrong place in the wrong time? How much was fabricated by her, how much was honest? What was with that \"Mousey\" confusion? Who was lying about what now? And finally: If she wanted to be assumed dead to get away from her parents, didn't sending the picture refute that purpose entirely? What is she living on now anyway? If running away was all she wanted, she evidently didn't need this convoluted plan to do so. When our main guy arrived at the house, the doors were already wide open.<br><br>I guess you can explain some of those aspects away with \"those were just his memories of her memories\", but frankly, I think that's just an excuse for a script which was too obsessed with its twists.","user":"SomeMoviesAndMe","rank":[71,86]},{"title":"Good (and Bad) Twists","rating":6,"date":"10 January 2019","review":"After the development of the secret experiment of persons with the ability to enter in other people´s memories, the justice system accepts the evidences presented by recognized memory detectives. John Washington (Mark Strong), from the Mindscape Agency, is a former detective that had a stroke two years ago after the death of his beloved wife and is retired. However he needs money and asks his former chief and friend Sebastian (Brian Cox) if he could find a new job. Sebastian offers a simple case of a wealthy teenager, Anna Greene (Taissa Farmiga), who is refusing to eat and to help to make her stop her hunger strike. John learns that Anna is an intelligent girl that lives in a fortress and is monitored by surveillance cameras by her family. Further her stepfather wants to send her to a boarding school, but her mother does not agree. Soon John and Anna bound to each other and John starts his investigation through therapy sessions. As far as John goes deeper, he finds past secrets that may be causing her present behavior. Are his assumptions correct?<br><br>\"Mindscape\", a.k.a. \"Anna\" is an intriguing thriller with a screenplay with many plot points, some of them good and others bad. The performances of the lead Mark Strong and Taissa Farmiga are great and the story holds the attention of the viewer. But the disappointing commercial conclusion is quite silly and the question is: was it necessary to a smart girl like Anna to plot such complex stories to get rid of her family and travel the world alone? Wouldn´t be easier to flee from the boarding school and simulate her death in another way? How could she be using her money if she was considered dead? My vote is six.<br><br>Title (Brazil): \"Regressão\" (\"Regression\")","user":"claudio_carvalho","rank":[8,8]},{"title":"Very Interesting Thriller!","rating":8,"date":"18 May 2014","review":"This movie has a 6.4 rating as of May 2014 which is slightly too low I think. I give it a 7.5 out of 10. I have noticed that thrillers, unless they are great thrillers like The Usual Suspects etc.. are scored very low because of two reasons. Firstly thrillers are general slow paced at first and build suspense and tension. Some people lose interest quickly. Secondly, some people just don't get it. Due to the audience not following the dynamics of the thriller they score it low. <br><br>The title Anna is a better title than Mindscape in my opinion because the story is a personal story about the character Anna and the main character's memory of his past love also named Anna. <br><br>The main concept of Anna is not original and there are little things in the movies that require you to suspend belief etc etc etc...like all movies it is not perfect...but I really enjoyed the movie..I think the acting was great from Mark Strong and the support cast..I didn't know that the young girl, played by Taissa Farmiga, is the younger sister of Vera Farmiga. She is excellent. <br><br>I think the story was predictable and I would have done something slightly different to make it less predictable but I can't explain further without spoiling. Having said that I still really enjoyed the movie. It is much better than most thrillers out there, some with much bigger budgets. <br><br>Some reviewers have posted on the message board that they didn't like the details..I loved the details, this is what elevates the movie above most..it may not always be believable but Hey! we are watching a movie about a guy who can enter peoples memories, what was everyone expecting...<br><br>It is a really interesting thriller that is well acted and despite being predictable it has a very clever plot versus underlying plot script...I recommend it above the majority of thrillers out there....great work!","user":"michael-yates-88-308634","rank":[76,100]}]