[{"title":"Definitely more entertaining than I expected","rating":9,"date":"1 October 2014","review":"My girlfriend and I saw this movie as part of a film festival in our city last week. We went in not knowing much more than a quick tag line, and weren't expecting much from a relatively low-budget Canadian production.<br><br>The storyline involves an 18-year-old student whose parents belong to a Satanic cult. After realizing that they want to sacrifice him because of his virgin blood, he sets out on a mission to lose his virginity by sunrise. Think \"American Pie\" meets \"Superbad\".<br><br>Having low expectations, I'm happy to say we were quite surprised with it. There were plenty of laughs and we were all chuckling a lot by the end. The two lead actors have a great rapport, probably due to them being good friends in real life, and all the others in supporting positions are just enough to keep things moving along at a good pace. A huge plus is that the movie never takes itself too seriously, and manages to poke fun at a lot of things at once. <br><br>We were also lucky enough to hear the director, producer, and one of the cast members (Annie Clark) talk about the creation of the film a bit. They were all quite personable and funny, which explains the tongue-in-cheek humour of the movie a lot.<br><br>All in all, it's absolutely worth the 90 minutes or so. It's no Shakespeare, but solid nonetheless!","user":"AwesomePlusOne","rank":[46,71]},{"title":"If you dig comedy-horrors you should enjoy this I imagine","rating":6,"date":"9 May 2016","review":"Not sure why the ratings are so low (currently 4.8) cause this is perfectly watchable for a comedy-horror.<br><br>Perhaps they expected a lot of nudity because of the title and poster (not much in that department) and felt duped and rated it low because of that, I don't know.<br><br>Sure it's no masterpiece or anything but it's never flat out dull and the characters are pretty funny.<br><br>It's about a teenage guy who's been selected as a virgin sacrifice for a satanic cult, in order to prevent that from coming true he needs to get laid or die trying ASAP, and that's pretty much the movie. <br><br>So not Shakespeare exactly and some minor flaws but if you dug 'THE FINAL GIRLS (2015)' or 'HELL BABY (2013)' or the like I don't see why you wouldn't dig this enough.","user":"Seth_Rogue_One","rank":[9,11]},{"title":"Not too Bad","rating":6,"date":"16 April 2016","review":"Seeing the low ratings on IMDb, I expected this movie to be garbage but nevertheless, I decided to watch it based purely on the plot summary which sounded interesting. This movie is far better than I expected. It's a semi humorous teen horror movie with semi adult themes similar to Fright Night with a bit of the feel of American Pie sex themes. I rather enjoyed the movie and it held my interest. If cults and sacrifice and teen sex are movie themes you like and you liked the two before mentioned films, you'll probably like this. I hate to admit, my only grip is that it wasn't more visceral and had the nudity toned down.","user":"parsonm2","rank":[7,10]}]