[{"title":"Exceptionally low-budget, but some good fight scenes","rating":5,"date":"15 July 2014","review":"\"Warrioress\" has a lot of flaws: the budget is extremely low, the continuity errors (disappearing wounds, etc.) are glaring, the story is boring, the supposed \"post-apocalyptic\" world is unconvincing, the acting is amateurish, the attempts at poetry are heavy-handed, and the ending is missing. On the other hand, there are some impressive fight scenes with Cecily Fay, Joelle Simpson and Helen Stainwey Bailey. These women have a rather wide repertoire of moves, being highly skilled with a variety of weapons, as well as with their bare hands and feet (mostly kickboxing, but there is a little grappling in there as well). If you are forgiving of the mostly budget-derived flaws, and have a fondness for women with solid, hard, beautiful muscles on display, you will appreciate parts of \"Warrioress\". ** out of 4.","user":"gridoon2020","rank":[7,9]},{"title":"Cute Girls Fighting... Don't Mind the Details","rating":6,"date":"11 February 2015","review":"You have to go into this with low expectations. It's not a great movie by any stretch of imagination. It's a low-budget B movie with an unoriginal story and pretentious dialogue. The acting looks bad mostly due to the fact that it's hard to pull off this kind of dialogue without looking silly.<br><br>While fighting in most B movies is usually ridiculous, it actually looks real and functional here. Sometimes you can see the actors are too obviously avoiding hurting one another, but for the most part, it looks good. The little warrioress Cecily Fay (143 cm) certainly knows how to move around and fight. And that's what this is all about. The whole movie is just an excuse to see Cecily fight, and fortunately there's quite a lot of that in the movie.<br><br>I won't get into the story, because there's really nothing new there. A warrioress, a quest, an ancient prophecy, blah, blah... It's all a bit silly and predictable.<br><br>If you want to watch a good movie, skip this one. But if you like fantasy, medieval-ish setting, and fighting with swords, and if you know what you can expect, it's not too bad.","user":"infernal-eternal","rank":[9,16]},{"title":"Shut up and fight!","rating":7,"date":"18 July 2014","review":"Set in a post apocalyptic era, Warrioress is a largely enjoyable low-budget British fantasy movie. I say largely because the director Ross Boyask &amp; writer and star Cecily Fay fall into the trap of padding out the movie with way too much meandering dialogue that isn't well written enough or well performed enough to be interesting. I'm sure it was John Milius who said when he was faced with writing 'Conan the Barbarian' he knew he'd be dealing with a cast who weren't trained actors, so he kept the dialogue to a minimum for Arnold, Sandahl &amp; company. These rules should apply to all movies of the fantasy genre unless there is the genuine acting talent available. Now the negatives are out of the way, though Cecily Fay and her cast may be weak actors, the same cannot be said about the energy they all put into the many action sequences in the movie. Cecily Fay who plays Boudicca, is tiny, under five feet tall, but is a trained martial artist and dancer and uses these skills effectively as she lays waste to hordes of enemies. Aided by the bigger, butch Joelle Simpson who plays White Arrow, the two women are deadly, but it is Fay who steals the show with her very convincing skills. She moves gracefully and powerfully with absolutely no wires or CGI, scampering from one killing to another like a human black widow. One favourite sequence is where she is between two enemies, so she leaps over and behind one, grabs his sword holding arm, propels him forward so the sword impales the other then hurls him to the ground where she snaps his neck and bounces up to seek her next victim! Though her character Boudicca is a heroine, she is brutal &amp; sadistic, thinking nothing about hurling a knife into the back of a terrified fleeing opponent or driving a dagger through a downed and already defeated foe. Another plus of Warrioress for fans of female action is no guy shows up to protect the heroine or hog the action, something - that used to happen nearly all Cynthia Rothrock's American movies. Apart from Boudicca's love interest, the men of Warrioress exist only to be punched, kicked, thrown, stabbed, clubbed or neck-snapped!<br><br>The rest of the cast including Zara Phythian in a small cameo &amp; Fay's main nemesis Helen Steinway Bailey also display genuine skill and grace as they pound each other mercilessly. Kudos must also go to the legion of Ms Fay's victims who also bring plenty of enthusiasm to their roles. The only gripe would be the amount of yelping and shouting that goes on as the women fight which does get a little annoying. Due to the tedium of the non-action portions of movie, Warrioress is no Conan the Barbarian or Mad Max, but sits nicely alongside movies like 'Ator', 'SHE' &amp; 'The Beastmaster' that followed them. Both Cecily Fay and Ross Boyask should look at where their strengths lay &amp; capitalise on them. Cecily Fay despite her lack of inches and real acting ability has a lot of charisma and could easily be the British Cynthia Rothrock,- but less speaking and shrieking! As for Boyask he needs to work harder at getting his actors to deliver their lines more naturally though there are no complaints about the action. The picture quality of the DVD was a little grainy, but on he whole Warrioress is pretty entertaining! Its pleasing to see a low budget British feature that isn't plain awful!","user":"kimberlymhn","rank":[7,15]}]