[{"title":"Mildly entertaining","rating":5,"date":"18 March 2011","review":"I had the opportunity to catch this film as a prerelease promo. Knowing nothing about it except that the story took place in China I thought it would be a good waste of an evening. It was. A waste, that is.<br><br>There is a long standing tradition among American film viewers that, with rare exception, any movie with the word \"dragon\" in its title is going to be disappointing. The Dragon Pearl is not one of those exceptions.<br><br>The entire thing feels like it was written, cast, and directed by a high school drama team. The story is bland and predictable, following the typical adventure theme. The characters were cookie cutter clones of every adventure movie character we've seen. The actors might as well be made of cardboard for all the emotion they showed. The poorly choreographed fight scenes rely on bad camera angles and 1 second shots to drive them along. And the film itself... maybe it was just the version I watched, but it had a grainy late-80's style to it. (Think: The Goonies.) <br><br>I missed about 1/4 of the dialogue due to lack of subtitles (Chinese and English are both spoken throughout the movie) but that should be fixed in the actual release.<br><br>The dragon itself amazed me. It wasn't very good (it looked like a plastic toy) but the amount of fluidity to its movement was excellent. It swam through the air, curling around itself, almost like a slow moving eel. They really should have textured it better.<br><br>All in all it's one of those budget flicks you won't mind watching on a rainy Saturday afternoon. Assuming there's nothing else to do.","user":"blanknamedstuff","rank":[31,45]},{"title":"A wholesome family film","rating":9,"date":"22 September 2012","review":"I recently watched this film with the kids and coming from a family of divorce was very impressed with the father/son relationship included in the plot.<br><br>The effects were great and the kids really loved the dragon!<br><br>Acting was also good was nice to see a familiar face in Sam Neil and I found Li Lin Jin's performance very impressive!<br><br>Would definitely recommend this movie to others, especially families with children and preteens. It is an exciting, humorous and original plot and had the kids on the edge of their seats the whole way through.<br><br>9/10!!","user":"buzzy-buzz-the-bee","rank":[9,12]},{"title":"Umm...So...","rating":5,"date":"7 September 2013","review":"Nothing. Happens. Even while things are happening, nothing is happening. The kids were pretty good actors, especially for a kids' film, and the sets and effects were likewise not at all grating. <br><br>That said, expect about 50 minutes' worth of movie to be crammed into about 94 minutes of your day. Prepare for exposition by narration. A retelling of the exposition...by narration. People standing around. People looking at things. People thinking about things. Repeat shots of leaves...blowing around. Suppose there just wasn't enough script for a whole movie, which was a shame. Thought it could've been great.<br><br>I would say if you have a kid who's into dragons or Asian themes, definitely give this one a shot; it's clean as a whistle content-wise. Just that I can't imagine watching this again only for the reason that the whole time I was going...come one, come on, something HAPPEN! <br><br>There are some cool shots of kids playing Chinese drums that are AWESOME. They're shown at the beginning and end credits and have nothing to do with the plot; so that's really not a spoiler.","user":"clanhamato","rank":[3,3]}]