[{"title":"Important lesson","rating":10,"date":"22 April 2012","review":"Yes, we have seen these arguments, theories and facts before, yet it seems people are unable to learn them. They rather watch Discovery Channel which instead of showing documentaries of discoveries, is a day long automobile commercial (not to mention the much worse channels out there). So this kind of documentary can't be done too many times. It must be repeated until it sinks in and people starting to make their decisions with responsibility. And it also would help if more people see it. The most positive aspects of this film are: <br><br>-Its narrative isn't too complex and strictly sticks to the essentials -it hasn't got extra ideology in it like Zeitgeist (however its style is very similar). <br><br>-It offers at the end a very good solution since not much else you can do to affect things. But if you are not an obsessive consumer and have a common sense, you have probably already figured that out. <br><br>-Woody Harrelson is a great host<br><br>Looking forward to the day when a documentary like this will be broadcast on major prime time televisions. I know it's naive because they are all owned by corporations or the state (which is owned by corporations). So the best thing is to spread the word. Very good documentary, highly recommended.","user":"alantas","rank":[44,49]},{"title":"An glimpse of where the US is heading as a democratic society in the 21st century, and how we got here","rating":10,"date":"23 February 2011","review":"Why is the world the way it is now, especially the US? From consumerism, wastefulness, the federal banking system, the war on terror and RFID chips that are to come. The people have the power to overcome the corporations and governments, their Achilles heel is that we the consumer have the buying power, and can choose what not to buy and run them out of business. What will we choose? Woody Harrelson hosts, supported by thought provoking insight by Noam Chomsky on how society is mislead and deceived by the politicians and media into shaping our thoughts, desires, and actions. No bias is shown in the documentary toward a socialist or anti-capitalist state.","user":"shuback","rank":[19,25]},{"title":"People fail to realize that something like this helps the change.","rating":10,"date":"20 February 2014","review":"You constantly see this theme portrayed throughout the conspiracy realm. I grew up with the full overwhelming belief that this was all gibberish. My ignorance has been awakened do to the fact that, I make judgments primarily on the observations of many. This film is a reference that has been repeated by other films. Without hearing these similar brushed off and I would continue to live my life without guilt. This film is amazing and continues to help burn these issues in to the brains of people without gilt. Those of you who have rated this film on the basis of copying others are only damping the processes of change. You should be rating this with strength to help those blind to see clearly and help push this nation through change. Social observation is hindered do to the rating process. Those films with low rating will never reach the eyes of many. Keep this in mind when you dampen the process.<br><br>Much thanks and love, Change will come.","user":"gtsmurfo","rank":[14,18]}]