[{"title":"Brutal but incredible filmmaking","rating":10,"date":"5 October 2014","review":"At the time of writing (October 2014) this is on release in France but not the UK or the US so I'll write this for the benefit of audiences elsewhere in the world who might be wondering whether to go and see it or not. When not extorting money from other students at a boarding school for the deaf in the Ukraine, the 'tribe' of thugs in the title spend their time robbing train passengers, people in the street or, with the help of their teachers, pimp each other at a truck stop. New kid Sergey arrives and falls for one of the young hookers...which is about all the synopsis you need. There's no dialogue, or subtitles, all the communication between the characters is through sign language. Along with a total absence of incidental music this has the paradoxical effect of heightening the sound...the sounds of footsteps, lorry engines revving for example becoming sinisterly effective. It's not difficult to follow the narrative at all, so don't be put off. The bleak surroundings of the institution combine with a dreary landscape of crumbling apartment blocks, supermarkets at night time in a bitter, dirty grey winter, to heighten the feeling of an amoral universe, a dog eat dog world where everyone is out only for themselves. There's no compassion, the one intimate relationship which develops seems to be motivated by lust, carnality and characterised by opportunism on either part. There doesn't appear to be any real tenderness there. Is the closed institution an allegory for the Ukraine, or human societies as a whole? The Tribe is a unique piece of cinema and inspired me to write, I've seen nothing in the last few years quite so extraordinary, but be warned it most definitely is not for the faint hearted. The violence is sickening, stomach churning, and made all the more shocking by the use of sound and absence of music since even if averting your gaze you remain all too aware of what's happening on screen, with no music to distance or make things ironic. The Tribe forces you to gaze, unblinking, into the abyss of total human depravity.","user":"trpuk1968","rank":[92,120]},{"title":"Shocking, disturbing and truly unique","rating":8,"date":"26 June 2016","review":"The Tribe is one of the most unsettling films of the year. It is set at a boarding school for the deaf in Kiev, where anarchy prevails. There are no words, subtitles, or even a score. The hearing viewer is left to interpret the violent chaos without auditory clues, presenting a unique challenge in understanding the narrative and the motivations of the characters. We are left to confusedly construe scenarios by their actions, and as such, are provided some insight into the helpless isolation of the deaf.<br><br>As a film, The Tribe may be interpreted in various ways: as a political allegory for the Ukraine, as a discourse on communication through violence, as an allegory to the impotence experienced by minority groups, or as an exploration of enactivism in film. Regardless, there are scenes that are shockingly disturbing, and the direction is unflinching. My only conclusion is that I'm sorry deaf people, but I don't trust you anymore.","user":"mike_diamond","rank":[11,12]},{"title":"Raw, Brutal, True","rating":10,"date":"12 October 2014","review":"Raw, brutal, without dialogue or sub-titles and a sensation at Cannes. Sergey is a newbie at a Ukrainian boarding school for the deaf and mute. Within hours of arriving at the school he is promptly and severely bullied by other students. He fights back and is rewarded by becoming part of the gang. He commits his fair share of robberies, pimping and vicious shake-downs without remorse or regret. This is until he becomes enamored with Anna, a fellow student by day and part of his pimping responsibilities at night. The substantial troubles and desperations of these young students is treated with shocking indifference, selfishness and disturbing disconnection by everyone involved. The lack of words puts the audience deeper into the emotions of the characters. The film adeptly and brilliantly provides the experience as if one is standing in their shoes. I fled with them in the night, wandered through abandoned carnival rides and truck stops with them, and felt their desperation and hunger to survive in the face of a society that abandons them. Slow moving yet with power and impact that is deeply felt. Seen at the 2014 Toronto International Film Festival.","user":"Raven-1969","rank":[63,91]}]