[{"title":"A throwback to Classic 70s Horror","rating":7,"date":"15 September 2012","review":"Rob Zombie has really outdone himself with The Lords of Salem. The film plays like a throwback to the psychedelic satanic Horror Movies of the early 70s. The movie starts out with a slow build getting to know the lead character, Heidi. Heidi, played by Sherri Moon Zombie, is a recovering addict that works for the local radio station as a DJ for a popular late night radio show. She lives in Salem, Massachusetts, which is famous for its witch trials during the 1600s.<br><br>When Heidi arrives at the radio station for her show she receives a demo record from a band called The Lords. Thinking the album must be from a new and upcoming band, the DJs play it on the show. When the sound goes out over the radio, many local women go into a trance, very much like when the tape is played in Evil Dead! Heidi has severe headaches when the album is played and from that point on starts having hallucinations. There are many flashbacks to the 1600s, when a coven of witches were having their Sabbath or Black Mass, dancing around a fire nude, praying to Satan, and playing music. The local Salem Authorities catch all the witches and put them on trial. Found guilty of witchcraft, they are burned alive at the stake. While dying, the leader of the coven curses her accuser, Nathaniel Hawthorne, and all of his ancestors.<br><br>Heidi lives in a historic building with an older lady that lives in the apartment below her. She invites Heidi for tea with her friends, but right away you can tell the older ladies have something to hide. Heidi starts a slow decent into madness after hearing the Lords of Salem album again. And that's when we get the flashbacks to the ancient evil witches and their strange satanic rituals.<br><br>Sherri Moon Zombie does her best acting to date, but she is still no match for the older scream queens that play the witchesDee Wallace, Patricia Quinn, Judy Geeson, and Meg Foster steal all the scenes. Meg Foster and Dee Wallace especially shine in their roles. One of things I like about Rob Zombie is that he casts a lot of familiar faces from the horror genre and Lords of Salem was no exception.<br><br>Lords of Salem has a real art-house artistic feel to it, which Zombie's previous films did not have. There are several shots that remind me of classic Argento films like Suspiria. The use of colourful architecture and background scenery is almost like another character in the film. The movie was visually stunning and it owes a lot of its influences to classic Horror films like The Devils, The Sentinel, Eraserhead and The Shining. The only part of the film I was not all that keen on was the psychedelic ending. It just seemed out of context, but maybe I will like it better on a second viewing. It also had way too many gratuitous shots of Sherri Moon's backside which was a little distracting from the storyline in my opinion. Unfortunately, I don't think Lords of Salem will appeal to the general public and will probably not get a wide release the way his previous films did.<br><br>In the end, I think this movie will get very split reviews from horror fans. If you can appreciate an art-house independent horror film you will enjoy it. If you prefer a grindhouse style gory action movie, you will hate it. I am sure this movie will surprise and divide Rob Zombie fans. Up until now, Zombie has earned a very well-deserved reputation for films that push the limits of good taste. For the most part I have enjoyed most of his films (yes, even Halloween 2!) For me, Lords of Salem showed that he is not a one trick pony when it comes to his writing and I really appreciate that. I highly recommend you go and see it when it comes out and form your own opinion about it.","user":"ZombiGurl","rank":[114,157]},{"title":"Frustrating","rating":24,"date":"24 April 2013","review":"I'm not exactly a Rob Zombie fan, but the three films I've seen from him (Halloween remake, House of 1000 Corpses, and Devil's Rejects) still have something in them that makes them memorable and not totally unworthy. I had no idea what Lords of Salem would be about but I expected the usual \"Rob Zombie overload\".<br><br>Much to my surprise, the film starts off pretty effectively. Although the annoying \"loud sound\" cliché is used here whenever there's something spooky in the background (HINT filmmakers- stop putting a loud noise over a great scare moment in an atmosphere such as this. It just ruins it) there was enough great build-up of atmosphere and the story was evolving nicely, not to mention many of the visual imagery really got under my skin. However, as I probably should have expected, Zombie's just not that smart of a film-maker to create a film like this. There's a really great version of this story to be told somewhere, but Zombie, as usual, over-indulges and just keeps on assaulting our senses starting in the second half that by the time the third act starts, I was honestly bored out of my mind and just rolling my eyes at all of the \"visuals\". The film just starts off great and burns out the more it goes on, and by the end it ultimately just leaves a very bad taste in your mouth and the second half just basically erases everything the first half build so cautiously to create. It feels pointless and redundant.<br><br>I've never disliked Moon Zombie, but her acting range has always seem limited. Here though, she's pretty impressive and I actually think Zombie did her a disservice. He should have just given a basic summary of this storyline to more talented filmmakers to write and direct it. Because it's definitely ambitious and definitely something that could have been truly amazing, that's what makes this film his most disappointing. I never expected anything unformulaic out of his other films, but because this started off with such potential and by the end I had to force myself not to fall asleep, it's just disheartening. A Rob Zombie film that is self-indulgent and stupid? Expected. But a boring one? Now that's a new low.","user":"Red_Identity","rank":[95,144]},{"title":"Great premise and cast, but it all fizzles out in the end...","rating":6,"date":"20 April 2013","review":"Before I begin my review, I should probably start by saying that I'm actually quite a big fan of Rob Zombie the musician (including White Zombie), and I also liked his first two movies (House of 1000 Corpses and The Devil's Rejects) very much - and I hated the first Halloween-remake so much, that I didn't even want to see the second one he directed, which allegedly should be even worse. <br><br>So, with that in mind, here's my review: The film is about a young, trendy rock-radio DJ, Heidi (Sheri Moon Zombie), who suddenly finds herself in the middle of an occult Satan-worshiping witchcraft scheme, because her ancestors did something bad 400 years ago or something.. She's sent an old, crusty LP, which she (of course) plays on the radio, even though it's just a bunch of creepy, monotonous notes, played over and over again, giving all the local women in the town zombie-like headaches. <br><br>Now, this isn't just all there is to the story, but it just as well might have been, as the plot doesn't really seem to develop much from that point on. The movie is all about setting a mood, showing creepy images, and basically just making the viewers generally uncomfortable - which it actually succeeds doing. I felt bad watching this, but strangely attracted to it at the same time.<br><br>The cast is pretty good actually, with Jeff Daniel Phillips and Ken Foree as the other two radio-hosts, and Bruce Davison as the historian who tries to get to the bottom of this whole witch-thing going on. The problem is just, that the movie doesn't really go anywhere with it's plot, and it's not really a slasher-movie or exorcism-movie, which you could expect. It's purely about making you feel miserable, and that's not (always) a good thing.<br><br>Oh, by the way... if you're expecting to see a lot of Sid Haig and Michael Berryman, think again, as they've only got small non-talking, not-interesting cameos. Meg Foster is pretty good as the witch-\"queen\", though.","user":"KnatLouie","rank":[53,78]}]