[{"title":"Fun Scary Movie!","rating":7,"date":"19 June 2018","review":"I had this one on my list to watch for a long time, but I let the low user reviews and ratings sway me. Finally last night we watched it. SO good. It is a very different kind of ghost story, but full of surprises and creepiness. There were some seriously creepy scenes and I know I jumped several times. The antagonists were just obnoxious enough that you were happy to see them have some challenges. The ghosts were scary and unexpected. If you are looking for a fun scare, give this a try. Loved it.","user":"julied3-467-5547","rank":[27,31]},{"title":"Give it a Netflix shot.","rating":6,"date":"8 June 2018","review":"This will be a short review. Just like the last 90 minutes.<br><br>I had a lot of fun with this. This is a straight B-horror movie. That's what it sets out to be and accomplishes it. <br><br>Good cast, good scenario, and good ideas.<br><br>It's not going to be a respected 'film' by any means. That's not what it's supposed to be.\nThink 'Belko Experiment' or 'Man vs'. <br><br>The cinematography was on par, the acting was solid, and it had a great original idea.<br><br>If you want a 90 min, B-horror movie. 100% yes.<br><br>I liked it very much and you will too.","user":"kderuy-82422","rank":[32,39]},{"title":"I liked it","rating":6,"date":"3 September 2017","review":"So apparently today everything has to be big, with lots of special effects, jump scares and an astronomical budget. Right? -Wrong!<br><br>This is how movies used to be done, sure it is a tad bit more ambiguous, resembles The Void a little, but I still say it succeeded! I had fun watching it, I liked the characters, the plot, the execution, I did not expect something out of the ordinary, thus I feel I received exactly what I wanted. A good little film, a nice add-on to my horror collection, I'll even recommend it for a late night run.<br><br>The Vault is a nicely crafted piece, there was room for improvement, for something bigger, surely enough, but it did not failed. Overall, a small success indeed!<br><br>Cheers!","user":"gothic-fiction","rank":[70,94]}]