[{"title":"Its fun if you let it be fun","rating":7,"date":"17 June 2018","review":"I understand why people might be down on this movie but I really enjoyed it. It had the right elements of the great party comedy. Great cast. Great party. Maybe I really enjoyed it because I was drinking along with it and wanted it to be good. But is that such a problem to have?\nIt did feel like it couldn't quite hit the punchline as well as I wanted it to. But if you want to have fun with it you will.","user":"jrthawk86","rank":[35,44]},{"title":"Bateman & Munn give a clinic in \"grounding\"","rating":7,"date":"10 March 2017","review":"If you study film, you know that entire texts have been written on the importance of \"grounding\" in a script.<br><br>The ground, also known as the glue, is the character that the viewer finds most relatable, most sympatico, when the story itself starts fray around the edges. Which is not to say that all scripts require a strong ground or glue, merely that the more outrageous scripts, the scripts with the least internal cohesion, require as much ground as they can get.<br><br>Which brings us to OFFICE XMAS PARTY, one of the more blatant examples of a \"spaghetti on the wall\" script. In other words, not a lot of fine tuning was done to get this baby ready for shooting day. The writers just took every gag they could think of, threw it against the wall, and then waited to see what stuck.<br><br>Some of it stuck, most did not.<br><br>But Bateman and Munn hold the film together by holding the attention of the viewer. In fact, they are so effortless at it that, every now and then, for just a split second, you almost think they are acting in another movie entirely, a romcom in which they are the only characters, and you are imagining the other 400 extras in this overdone extravaganza.<br><br>Is it funny? Not really. This reviewer laughed exactly once.<br><br>Is it engaging? Well, because of Bateman and Munn, actually it is.","user":"A_Different_Drummer","rank":[84,125]},{"title":"The only funny part...","rating":1,"date":"23 June 2019","review":"...is on the Netflix trailer.\nJennifer Aniston was the hook for it, because it is the only moment when she is seen on this movie (and 2 more unfunny ones).\nThe stupid characters are stupider. The \"serious\" characters\" get out of character.\nStereotypical moments (are they thinking people are idiots? Well, some of them are).\nI just stopped the thing at the minute 50' when I thought I was being insulted by its stupidity (it almost lasts 2 hours!!)","user":"elisaisabel","rank":[7,8]}]