[{"title":"A docudrama detailing the Canadian military contributions on D-Day at Juno Beach","rating":9,"date":"10 November 2012","review":"Dedicate yourself to viewing a war film or documentary over the course of the Sept 11th Remembrance Holiday W/E. Canada is a modest nation in terms of population, temperament and the size of our film and doc industry. Our story is unique, and it's been too long overshadowed by our American neighbor's mega-industry. Recently, there have been some excellent Canadian films about this nation's contributions in various wars. STORMING JUNO (2010) is one not to miss. An excellent docudrama depicting events on the D-Day invasion when Canadian troops landed at Juno Beach. The director eerily captures the Canadian personae: boys hardly men, of quiet strength, determination, ability and courage; also fear, trepidation and naiveté going to battle, with their remarkable performance against grueling odds. Veteran survivors - now octogenarians are interviewed following the dramatization. Their emotions span pride, shame, sadness, nostalgia and a sort of bewilderment. STORMING JUNO enacts specific events of the men who served in the various divisions: the amphibious tank team, the beach landing team, the paratrooper team, all set on achieving their objectives in a gripping minute by minute story.","user":"paula-shack","rank":[18,20]},{"title":"Ambitous, but compromised by clunky narration.","rating":6,"date":"4 June 2011","review":"*may contain spoilers* I saw this show at Costco the other day. I'm a sucker for WW2 movies, and when I realized it was a Canadian production, I picked it up.<br><br>It covers the D-Day landings at Juno from 3 different points of view, a Canadian Paratrooper, Infantryman, and Tank Commander.<br><br>It's of a limited budget, but with modern CGI effects and clever editing, they actually achieved a lot of bang for their buck. The action doesn't outdo Saving Private Ryan, but it still has some good moments. The CGI is well done, on par with shows like Band of Brothers.<br><br>The biggest flaw in this show was the narration. It adds very little that couldn't be explained via dialogue, and is often very annoying and distracting.<br><br>The scene for me that would have been the most dramatic (spoiler) was the tank's arrival on the beach and the tank commander's decision to take out a machine gun instead of the artillery that was about to kill him, but this moment is lost in cheesy narration. It seems that the writer forgot the key rule of filmmaking, \"show, don't tell\". Much of the suspense throughout is deflated by a narrator speaking up whenever things start getting interesting.<br><br>Nonetheless, well done in most areas and worth a watch, particularly for the documentary/interviews that follow the \"movie\" reenactment.","user":"Marlonius","rank":[15,17]},{"title":"Beach Head.","rating":6,"date":"15 March 2016","review":"Everybody knows about Omaha Beach on D Day, the Sixth of June, 1944, because that was where the landings were truly blunted. But we don't hear much about the landings by the Canadians are Juno Beach, just down the road.<br><br>This lacks the lavish budget and dramatic screenplay of \"Saving Private Ryan\" but generally does a convincing job of showing true -- not fictional -- events on and behind the flat sands of Juno, though the film was shot on the shores of Lake Ontario.<br><br>Instead of staged combat, newsreel footage of the historical events is inserted -- effectively. And the incidents shown have the virtue of being reenactments of real events.<br><br>It's not a long film and it lacks the perspective of \"The Longest Day.\" And it's usually confusing to hear narration by two participants -- a tank commander and a paratrooper -- using voices so similar that it's hard to distinguish them. \"I did this,\" says one voice, and we see a tank commander shouting orders. And without notice, we hear what appears to be the same voice saying something similar and we're way behind the lines with a tiny group of infantrymen.<br><br>An earlier attempt was made to show some of the sacrifices of Canadians in \"Dieppe\" -- the story of a disaster -- but again was hobbled by a low budget, so that much of the story was confined to military leaders arguing over the planning.<br><br>It's not a bad film. It resembles a TV documentary using reenactors.","user":"rmax304823","rank":[9,11]}]