[{"title":"Amazing story","rating":8,"date":"19 January 2015","review":"I watched Safe Haven knowing that Nicholas Sparks wrote the story, and not having read the book. This movie completely exceeded my expectations. As I write this, the tears are drying on my face. I believed the chemistry was there with the actors and the romance had a good build-up (not rushed). I like that the story was easy to follow. The actions scenes were well-directed and realistic. I like how the story incorporates action, suspense, drama, and romance, all in one. What really moved (shocked) me was the ending. It was so beautiful and I just started bawling. It was so moving. As a whole, I really enjoyed this movie.","user":"janiegun619","rank":[40,46]},{"title":"A real surprise and touching ending to this romantic thriller","rating":7,"date":"25 April 2013","review":"Director Lasse Hallström pulls off a surprise ending to this otherwise seemingly ordinary romantic thriller; in doing so, he redeemed what would otherwise have been a movie not worth a mention. Sure, the movie is sweet for the most part and the dramatic moments are nothing to brag about, but Hallström has been hiding the real love story all along; when it's revealed in the last scenes, we ask ourselves, how could I have not seen this and then you melt. But you do have to stick it out to the end. I don't wish to spill the beans so I'll keep mum about it. I understand some viewers are not going to be interested in the movie because of the cast, but the director's following is not without merit; after all he delivered Salmon Fishing in the Yemen, Chocolat and Cider House Rules, and it's his uncanny ability to tell a story like no others is what made me want to watch the movie.","user":"JohnRayPeterson","rank":[59,74]},{"title":"Missing too many parts that are crucial to the storyline","rating":3,"date":"16 February 2013","review":"Where to start?... I went to see that movie with uneasy feeling that I'm going to be disappointed and I was unfortunately right. For somebody who didn't read a book it is going to be another love story with a little thriller in it, for me it was a BAD adaptation of very excellent book. I actually knew from the beginning that movies rarely are better than book but some of them at least focus on a important details that are crucial for the storyline. This time like I suspected they missed the most important parts and replaced it with some cheap lovey dovey \"I love you\" moments. The escape part was showed fast and without pretty much explanation. OK. So we see husband that had too much to drink fighting with his wife, hits her couple of times, throws her on the floor than she grabs the knife and stabs him, after that she runs over to her neighbor and next thing we see is her buying a ticket and getting on the bus and leaving. The same time we can see her husband looking for her, stopping buses running like nothing had happened to him. No stab wounds. Nothing. The book was so much more intense. She was actually planning to escape for almost a year. Stealing money form his wallet, planning everything step by step. It was slow and nerve wracking process that made a reader chew his/her nails. In the movie everything happens so fast you don't even know when it started and when it ended. Also Katie's husband character wasn't showed like I would like it to be presented. He was psychopath, not only an alcoholic. His obsession with Bible and Bible's rules was a crucial point of that story. She didn't run away from abusive alcoholic husband, she run away from sick person. They didn't show it in the movie. They didn't show how twisted his mind was. I think sometimes, that he was the most important character in that story. David Lyons was a perfect for that role, I wish I could see more of his character on the screen that's all. Katie in a movie (payed by Hough) didn't convince me at all. She was looking healthy and pretty like she just came back from vacation, not run away from the hell. Katie in a book was scared, skinny, bitten up and tired. The process of her getting to know Alex was long. She didn't trust anyone for a long time. Josh Duhamel was a good choice in my opinion for Alex's character. He was good looking but not too good looking, he was very easy going, and acted very natural around the kids. But yet as a star of the movie his character was covering more important parts. It was just too much of him in some moments. The other thing they fail to do is to build up Jo character a little bit more. She was Katie's only friend there and they hang out together more often that they show in the movie. The very important conversation between two of them was missing in the movie and I felt like there was unfinished business out there. The turning point was oversimplified. Tierney finally found Katie and asked her to come home with him, when she declined he decided to burn the house down. In the book that process was slow and complex. From the very first time he sees them together to the last moment of his life, reader doesn't know what is going to happen. Why he decided to burn the place down with Katie in it?? Because bible says that when she cheats she will burn in internal flame. That was the reason why he started the fire in the first place. Alex again became a hero saving his daughter from the fire. In the book he didn't show up until everything was pretty much over. It was Katie who fought with Kevin and it was her who saved the kids. I give the movie 3+. If you didn't read the book it's going to be another love story out there. Nothing more, nothing less.<br><br>ps. Please excuse my English. I'm from Europe and this is not my native language.","user":"kasia-cimeries44","rank":[102,134]}]