[{"title":"Seen better movies on boxing, but a cool portrait of Roberto Duran","rating":7,"date":"29 August 2016","review":"Not exactly what I was expecting at first from a sports movie but in the end it turned out to have the heart I expect from a sports film.<br><br>Based on the story of Roberto Duran, a poor street kid from Panama who became that country's symbol of greatest as a boxing champion. It follows his career from his glory days to how his ego caused his fall to his surprising comeback.<br><br>Edger Ramirez was fantastic as Duran and Usher Raymond as Sugar Ray Lenard was perfect casting for me hands down.<br><br>Also like the connection that Ramirez made with DiNiro who played Ray Arcel. It was very natural them bouncing off one another. <br><br>But not the best boxing movie I every seen. Though Ramereiz and Raymond look ready for combat the ring fights could have been better.<br><br>Maybe not the point for the film makers as the film documents the rise and fall of a boxing champion that closely mirrors all the other stories of how success corrupts you but if you have the heart and the mindset deep within you you can come back.<br><br>Plus the film focus on how Duran's career ran parallel to the state his country was in. <br><br>Overall, as a sports movie goes it did not draw me in like they usually do but the outcome was still the same as it plays with my heart to see a man come back from his very worst.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[16,17]},{"title":"It Borrows From the Best","rating":7,"date":"23 August 2016","review":"Hands of Stone is a rise, fall and rise again story of famed Panamanian boxer Roberto Duran (Ramirez) who leapt into notoriety in the 70's after his first controversial appearance at Madison Square Gardens. By the time of his retirement in 2002 at the age of 50, he had 199 fights under his belt with 103 wins and four titles as a light weight, welter weight, light middle weight and middle weight. The film however focuses on his relationship with legendary boxing trainer Ray Arcel (De Niro) whose own exploits in the boxing world made him the first trainer to be inducted into the Boxing Hall of Fame.<br><br>Doing a movie of this nature, a couple of questions arise. How do you accurately and intimately make a film about the life and times of Roberto Duran who in addition to being a legend was also a legendary pre-fight s**t talker? How can one best encapsulate the real life of a man who at one point was the guiding light of an entire nation yet had enough of an ego to name all of his male heirs Roberto? Finally, how do you do make that movie great while siphoning off of cues and themes from inspirations like Rocky (1976) and Raging Bull (1980)?<br><br>The answer is of course you can't; but you can make a half-way decent film out of everything. And that's basically what director Jonathan Jakubowicz and Bob and Harvey Weinstein have done. It plods its course, steadily paces itself, jab at the appropriate emotional moments and ducks from the energy-sucking minutia that episodic plot-lines tend to have in abundance. Robert De Niro is fine as Ray Arcel giving a spry, worthwhile performance in the same ballpark as Billy Sunday in Men of Honor (2000). Likewise Edgar Ramirez hits all the right notes as our beleaguered hero giving the screenplay a much better performance than it honestly deserves. Ana de Armas, Usher Raymond, Ruben Blades, Oscar Jaenada and Ellen Barkin are all very good with Reg E. Cathey giving a very small but showstopping performance as infamous boxing promoter Don King. Heck even the balance of languages (English and Spanish) is respectfully and organically done. If a great film is three great scenes and no bad ones, then Hands of Stone is 50% of the way there.<br><br>Yet much like the underrated Southpaw (2015), it also has no pivotal, never forget scenes or iconic lines. The brightly colored barrios of Panama City and the glitzy sparkle of Las Vegas, not to mention the atmospherics of locker rooms inexplicably filled with smoke, don't really leave an impact. Neither do the stakes of Duran's life which, much like Billy Hope's, was and probably still is filled with conflict, inner-turmoil and a pride that manifests in nationalistic fervor. It's a shame too because if the film decided to explore that aspect of Duran's life, i.e. his relationship to Panama and its people, it could have been unique enough to recommend strongly.<br><br>Yet instead, the film doubles down on the \"success is ruination\" themes picked up by Raging Bull, while kneading out the supposed nobility of a sport in which two grown men beat the crap out of each other. Yet while watching Hands of Stone, I kept hoping they would change up the kinetic, fast-paced editing of the fight sequences with moments that were, say a little more poetic. For those of you who know what I'm insinuating, congratulations you've seen a \"great\" scene from a \"great\" movie about boxing.<br><br>The best that can be said about Hands of Stone is it does what it does predictably and well, like a cover band that's been around for years. It's energetic, it's fun to watch, it certainly has talented people who put their heart and soul into the project and it plays all the hits...yet it's not the real thing. Oh well, a tin star still shines, a discount belt still buckles and Hands of Stone is still good. Watch it if you must, otherwise watch Rocky again instead.","user":"bkrauser-81-311064","rank":[24,27]},{"title":"A visit in time through boxing","rating":8,"date":"26 August 2016","review":"Hands of Stone is a pleasant surprise for those willing to regress in time to experience the heights of boxing. Way before internet, there was a time and a place when events like boxing happened, specially when Roberto Duran fought, Panama would come to a stand still. Everyone was tuned into their television for the occasion. When he won, you would hear the country erupt in glee of victory with people sounding their pots &amp; pans. The film showcases those days in an adequate manner. Yes there is the usual clichés happening, but the film's energy transcends those usual predictable story plot point to keep you engage enough to care for the characters. The time capsule through the production design and soundtrack made this film a delight to watch. There is a vast array of subliminal messages from the director, Well come to think of it, its not so subliminal as you see in the ring corners advertising to \"Invest in Venezuela\". Im sure this obvious product placement was a plea by the director and/or the Venezuelan team working on the film for the audience to take notice of the current situation Venezuelans are living. This strategy has been duly noted. The international cast serves the film well and brings the essence of Duran journey to life. Ruben Blades vintage soundtracks adds an unequal energy to the scenes boosting the film above your usual boxing flick. Hands of Stone is better served watching it on the big screen to truly appreciate the scope of the film.","user":"sinnerofcinema","rank":[19,22]}]