[{"title":"Surprisingly Good","rating":7,"date":"11 December 2013","review":"In Montgomery County, the couple Jim (Jay Hayden) and his fiancée Emilie (McKenna Jones) is ready to go to work when there is an explosion of a chemical plant in the outskirts of the town. Soon Montgomery County is in quarantine and under siege by the army and people turn into zombies. <br><br>Jim and Emilie escape from the town, but they have a car accident and Emilie is deadly wounded. They arrive in a farmhouse, but Emilie dies. Jim receives a phone call and a man named Scott (Scott Lilly) invites him to move to the tobacco warehouse close to the house where he is. Jim meets Scott and he introduces his wife Julie (Kathryn Todd Norman) and the unfriendly and weird Alex \"Ix\" (Tori White). Along the days, they become friends while they wait to be rescued by the marines. Will they survive?<br><br>\"State of Emergency\" is a surprisingly good and dramatic low-budget horror movie. The plot has great character development, good story of sympathy and friendship, but very few zombies; therefore fans of zombies will certainly be disappointed. My vote is seven.<br><br>Title (Brazil): \"Código Vermelho\" (\"Red Code\")","user":"claudio_carvalho","rank":[20,23]},{"title":"Well Worth a Watch","rating":8,"date":"31 December 2012","review":"I'm going to keep this very short as this is the first time I have entered my own review on a film, usually just using the reviews to help me decide whether or not to watch a film, and I don't want to spoil it by giving anything away.<br><br>I agree with some of the reviews that there wasn't much zombie action, however, I would mark it up there with the Walking Dead in terms of just the right balance of story vs zombie. For me this was the perfect type of Zombie film as you just never quite knew when those moments were going to happen. Certainly had my heart racing on occasions.<br><br>Give it a go - what have you got to lose?? An hour and a half of your time?? In my opinion, it won't be wasted!","user":"zia_andrews","rank":[50,69]},{"title":"Don't expect a Zombie flick","rating":5,"date":"8 January 2013","review":"If you come into this expecting something like the Walking Dead, or any of the other hundreds of Zombie movies out there, you will be disappointed. This movie is actually more about the characters and the personalities and what they are experiencing and going through emotionally, than it is about Zombies.<br><br>Taking it for what it is, this movie is okay. It's not fantastic, but it is okay. If anything, the Zombies almost get in the way of the actual story itself, at least what little of them there are.<br><br>The movie is a wee bit confused in that it is trying to cater to multiple audiences by being a dramatic tale with some conservatively added violence, guns and gore. Doesn't quite work, but I don't think it completely fails either.","user":"djmotiv","rank":[31,41]}]