[{"title":"Surprisingly Interesting","rating":8,"date":"8 August 2019","review":"I consider myself to be an amateur \"expert\" on the Manson Family/Murders.\nThis film has some historical inaccuracies (Linda Kasabian drove the murderers on both nights). But despite a few technical errors, it is a sensitive fiction of how the women came to grips with what they had done.\nBut before you feel sorry for the Manson Girls know these facts:\nSusan Atkins had an extensive rap sheet long before knowing Manson.\nPatricia Krenwinkel and Leslie Van Houten were street-wise acid heads prior to falling under Manson's \"spell\".\nSo don't be fooled into thinking that this trio were sweet, innocent virgins. Manson ordered the killings to appear as copy-cat murders to free Bobby (who appears early in the movie and would later kill musician Garry Hinman, along with Susan Atkins)\nIt was refreshing to see a portrayal of Charlie that was not evil incarnate.\nManson was nuts, but not a 24/7 paranoid psychopath. This portrayal is probably closer to the truth.\nI enjoyed it immensely. But we will never know the complete truth about the two nights of mayhem in August, 1969.","user":"jmihalchik-67031","rank":[31,35]},{"title":"Too feminist? You need a reality check.","rating":7,"date":"23 August 2019","review":"This movie shows a side of the story that hasn't been depicted before. That is enough to appreciate the premise.<br><br>Charles Manson was a very sexist and racist man. He used, manipulated, and brainwashed both young women AND men who he could tell were naive and vulnerable.<br><br>Anyone who has thoroughly researched the Manson family will know the women were treated worse than in this film. One disturbing example is they weren't allowed to eat until after the dogs. Feminism was really at it's zenith in the late 60s. Representing feminism in the film is realistic to the time period.<br><br>These women would have never murdered had they not crossed paths with Charles Manson. Of that, there is no doubt in my mind. Many people were living in communes at the time. The members of \"The Family\" ended up in the wrong one, not knowing what lay ahead, not knowing they were being groomed by a sadistic madman.<br><br>This movie isn't excellent, but it does not deserve a 5.6. Voting it down because you don't like feminism is a very very sad point of view.<br><br>6.5/10","user":"opheliahasrisen","rank":[27,35]},{"title":"\"Charlie Says\" shows promise but lacks depth","rating":6,"date":"12 May 2019","review":"\"Charlie Says\" (2018 release; 101 min.) brings the story of the Charles Manson murders, but this time for the perspective of the three \"Manson women\" involved in the killings. As the movie opens, one of the women is taking a shower, the blood coming off of her hair and body. We then go the \"3 Years Later\", and we see the three women in jail at the California Institution for Women, on a separated wing with just the three of them: Lulu, Sadie and Katie. A graduate student at UC Santa Cruz is given the opportunity to teach these three some classes. When then go back in time, to when Leslie (later named Lulu by Manson) arrives at the remote ranch where Mason and his entourage live... At this point we are 10 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the latest from Canadian director Mary Herron, who previously brought us the worthwhile \"I Shot Andy Warhol\" and, even better, \"American Psycho\". Here she revisits the events that are often referred to as \"having ended the 60s\" (the murders took place in August, 1969). The film is based on several books, including the one written by the graduate student on specifically Leslie/Lulu, but there are certainly additional source materials on the Manson women. Indeed the eternal question seems to be: are these women victims themselves? are they just part of the gang that committed these vicious killings? The movie attempts to address that, and while at times it shows promise, in the end the movie lacks depth and what we are stuck with is something that certainly isn't a bad movie, but given the underlying facts, it feels more like a missed opportunity. Leslie/Lulu is played with conviction by up-and-coming British actress Hannah Murray. Manson is played by Matt Smith as if he's Jim Morrison (check out Smith instead in that other recent indie movie \"Mapplethorpe\"). Beware: there is a fair amount of nudity in the film, so if that is a concern for you, better stay away and check out another film.<br><br>\"Charlie Says\" premiered at last Fall's Venice film festival to ho-hum reaction, and is now getting a limited US theater release. It opened at my local art-house theater here in Cincinnati this weekend for just a one week run. The early Sunday evening screening where I saw this at was attended so-so (7 or 8 people). Maybe this will find a larger audience as it is launched on other platforms. If you have any interest in the Manson murders, and in particular the women that were involved in it, I suggest you check this out, be it in the theater (unlikely), on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[17,21]}]