[{"title":"A lot of the negative reviewers seem to have completely missed the point","rating":7,"date":"11 February 2013","review":"What a lot of the negative reviewers seem to have completely missed about this movie is that it isn't actually a crime movie - instead it's a metaphor for modern America.<br><br>That's why the film contains so many political speeches in its background soundtrack - they're meant to be there to draw the link between what is unfolding on the screen and what is happening in the real America today.<br><br>This film is rich with different layers of irony; the most obvious of which is the fact that the men being killed are being punished for simply doing what their killers do themselves day in and day out - commit crime and steal from others.<br><br>It seems to me that the mafia bosses are symbolic of the politicians who blame the business sector, and then seek to punish them, for what are actually failings of the system that they continue to prop up and exploit for their own ends. And just consider the fact that after killing several men for being thieves, these exact same mafia bosses then try and rob Brad Pitt's character of what he is actually financially entitled to from them.<br><br>The reason both Obama and Bush are heard at different times in the film is because we are meant to realize that this problem is not exclusive to either the left or the right, it is about what America, as a whole, has allowed itself to become as a nation. And also to highlight the fact that both left and right have allowed this problem to persist and grow.<br><br>Brad Pitt's speech at the end of the film is really the essence of what this film is about - a cynical examination of the death of the American dream and American idealism.<br><br>I think that in time this film will come to be more highly regarded as a clever piece of commentary on present day America - and when it is viewed in that light (rather than as a gangster film) it makes much more sense to the viewer.","user":"brendan-268","rank":[98,117]},{"title":"Speak Much...Say Little","rating":7,"date":"24 April 2013","review":"There is more wordplay than gun-play here and it is a Neo-Noir, hard-boiled, unfettered attempt at gritty realism. Some of the extended dialog scenes are pretty good but not quite excellent. There is some rambling and pointless exchanges with little pay-off.<br><br>But there are some serious, reality sound bites that give us the same thing. There is that continuous backdrop of Political rambling rhetoric that mirrors the Character's innate ability to speak much and say little.<br><br>This is an against the grain try at alternative, smart Cinema with just enough stylized graphic violence to make it obvious that this has Artistic commentary and not Documentary style Cinema Verite on its mind. Overall it is a well done and interesting kind of side-step from the usual whiz-bang editing and shaky Camera stuff that has become so common. <br><br>This is slow, bordering at times on tedious, but never a bore. It is well crafted but does not quite reach that level of great Prose transferred to great Film. But it is a good try at a very difficult, rarely achieved process that creates the best of this kind of thing.","user":"LeonLouisRicci","rank":[21,24]},{"title":"Solid, Hero-less, Unsentimental Crime Movie","rating":8,"date":"17 December 2012","review":"This movie was done in a style that was quite unique from your standard issue shoot 'em up or Scorsese gangster movie in a number of ways I found refreshing. It slowed down the pace of dialogue scenes to a relatable and believable level, made the violence far more realistic, and didn't overdo the music. Those who can't handle too much, or too realistic of violence won't like this movie.<br><br>Some might feel the dialogue makes the movie drag just a bit, but if you like realistic filmmaking, they've made it feel as if you're sitting in on actual conversations. The scenes and cuts are long but are livened up with the fairly constant scummy-ness of the characters. James Gandolfini seemed to prattle on a little too much but I suppose that was the point.<br><br>The violence can be summed up as unsentimental; much of it can be defined by the difficult achievement of not falling into played out Hollywood clichés. There are no heros in this movie as the director doesn't use cheap tricks, like voiceovers, disproportionate screen time, or happy music to convince you that one criminal is worth rooting for over the others. There is no glorification or demonization of violence, as it is depicted without the influence of music, and the audience can decide for themselves about what is being shown. There are no Schwartzenegger-style shoot outs, as the violence is usually sudden but brutal and loud. Every gunshot is closer to being as loud as real life, so you get a little jolt with every shot like being at a gun range.<br><br>The use of music is also played down and important in making both the violence and dialogue distinct. There is some music which gives the movie some energy, but overall far less than the average Hollywood film. This adds an element of suspense as the music doesn't give away what is about to happen in every scene (like a movie with ominous music when something bad is about to happen, etc.). The lack of music also allows the audience a semblance of neutrality in what they are observing; characters are allowed to be likable without being good. <br><br>This is the sort of movie you could expect if the hero was removed and you only had the villains and thugs left over--it is far less boring.","user":"chase_g","rank":[222,305]}]