[{"title":"Better than expected, fun, gory thriller","rating":8,"date":"26 May 2017","review":"I wasn't expecting much based on all the recent horror movies I have seen that are lacking that special something, but I was pleasantly surprised at how much I enjoyed this movie. Some of the acting could have been better, but overall I thought this was a fun, gory thriller. Definitely worth a watch.","user":"jwilcox-61341","rank":[22,23]},{"title":"This movie WOW!","rating":9,"date":"9 July 2014","review":"This is a movie that somehow slipped by me, but man was i glad i found it! i was searching movies that Luke Evans were in i think he's a pretty good actor but nails the roles as an intelligent villain, which he definitely was in this movie and yeah You can say he was a lil crazy too (sarcasm).<br><br>For a film in this genre where its become hard to find something close to original or decent i was very impressed with this one and was glued in from the jump i loved the cast and the characters i think everybody did a pretty good job. Yeah it had some some similarities with other movies but definitely had its own spin, not too many movies you find yourself rooting for the bad guy but i found myself doing that in this, i would like to see him play a version of Hannibal Lector.<br><br>Overall great movie for its genre good ending and twist at the end, deserves a better rating i try to rate movies for their genre but definitely watch this if you're into this genre you shouldn't be disappointed.","user":"DaTruth510","rank":[24,26]},{"title":"Not entirely perfect, but still a good, entertaining horror flick ◆≈≈7.5/10≈≈◆","rating":7,"date":"12 June 2013","review":"I've had my eye on No One Lives for a while and in that time I had forged good expectations for the film. What more could an avid horror fan want when such a solid cast gets paired up with one of the most interesting horror directors in the biz in Ryûhei Kitamura, known widely for his direction of the 2000 film \"Versus\" &amp; more recently for his 2008 \"The Midnight Meat Train\". So it seemed the film's success would likely all come down to the quality of the script put forth by first time writer David Cohen. <br><br>This is definitely one of those films that is extremely hard to review without spoiling things, so I will stick to relaying the most basic plot line as possible. After botching their last job, a crew of merciless, degenerate criminals encounter a man(Luke Evans) &amp; his girlfriend while eating at a restaurant. This spirals into a further violent meeting between the two which get's more interesting as we come to learn just where the real danger lies. The clash turns bloody as the balance of power shifts &amp; the gore begins to rain down.<br><br>Of course it helps to keep in mind that this is in fact a horror film and that you're not going to witness any award winning performances, but there are some really solid efforts given by Evans as the \"Driver\" &amp; Adelaide Clemens who plays Emma, a kidnap victim who has been hardened by long lengths of mental &amp; physical torture. There are a couple of scenes that are sure to please the sickest of fans while at the same time may seem a bit on the gory side to the average viewer, but overall I felt this was a very enjoyable, entertaining vision delivered by Kitamura. He lays down a few subtle nuances early in the film that become clear to the audience later if you pay close attention, the best being revealed near the end of the film.<br><br>As for the downside of the film, there were some real snags in the script that I felt could have been changed and yes there are a few holes in the plot, most of which were used primarily as a vehicle to exploit certain plot developments. Or in one case to present one heck of a bloody surprise, you'll know what I mean after you see it;] Despite those problems, the film still managed to rise above the average effort, but I believe that it was those weak script points that hurt the film in theaters &amp; the reason it may draw further criticism in the future.<br><br>So in the end,if you're trying to decide if this will be a good pick for your horror/gore itch then I can definitely recommend this as a top choice, but if you're looking for a smart thriller with a well developed story then this may not be your best choice, but I wouldn't let it stop you from grabbing it from your local DVD kiosk.","user":"Thrill_KillZ","rank":[69,86]}]