[{"title":"A worthy Prequel","rating":9,"date":"5 December 2011","review":"I enjoyed almost every minute of this series. I thought it was far above the average SyFy flick. The special effects, while not perfect, are very adequate. The story is imaginative and refreshing. I found myself drawn in from the beginning. Watching Bob Hoskins as Smee again was pure joy.<br><br>Every part of the story was as logical and well thought out as any fantasy could be. Often in movies I find myself thinking \"Why would they do that?\" That was not the case in this movie. Other than some mistakes made that any child could make, the characters all acted logical within the parameters of their character.<br><br>Unlike some other fantasy TV that left us with nothing but questions at the end, (Lost, I'm looking at you.) origins and motivations for almost every character and aspect of the Peter Pan story is given, and satisfactorily explained by the end.<br><br>Another aspect of the series that I like is the fact that by the end Every story line and mystery is satisfactorily wrapped up with a nice big bow on top. Yet with this nice satisfying ending the door is still left open just enough for a sequel.<br><br>The only negative aspect I can find in this is the depiction of Tinkerbell. Somehow I found it lacking, but that could easily be attributed to personal tastes.","user":"runner-15","rank":[39,56]},{"title":"Explained away the magic","rating":6,"date":"23 September 2013","review":"This is a prequel dealing with Peter Pan (Charlie Rowe) as an orphan on the streets of London. Peter and his band of thieves work as pickpockets. Their evil mentor Jimmy Hook (Rhys Ifans) gets them to steal a magical treasure which transports them to Neverland. Once there Hook join with a group of pirates led by Elizabeth Bonny (Anna Friel) in search of more magic dust. Peter lands with the Indians and the beautiful Aaya (Q'orianka Kilcher) where the people don't age.<br><br>The story lack any pace. It drags along. With 240 minutes, this is way too long. It doesn't help that they explain away the magic. It reminds me of Star Wars explaining away The Force. Why can't they leave it alone? The acting is acceptable. All the big name give the expected performance. Charlie Rowe as Peter Pan is average. As for the production, it's got TV movie level. It's nothing to brag about. It's dark and dreary. Again all the magic is gone.","user":"SnoopyStyle","rank":[9,12]},{"title":"Neverland EPIC!!!","rating":10,"date":"5 December 2011","review":"My favorite story growing up was Peter Pan and to this day i am still obsessed with it. I've always searched for a prequel to Peter's past but never found much. This was a dream come true.<br><br>The story changed a few things, pixie dust and what not but i applaud the writers courage and ingenuity in going in such a direction. The story was captivating, the graphics very good for a SYFY movie and above all it was exhilarating seeing the start to it all.<br><br>I sincerely hope they make a sequel, or a series out of it. There are so many old stories getting remakes, sequels and series but none more deserves it than this story. If you haven't seen it, go find it!! to the writers and syfy channel, PLEASE MAKE MORE!!!!!","user":"bethanyline","rank":[29,48]}]