[{"title":"\"Sure I'm no Vera Farmiga but I believe I have talent.\"","rating":6,"date":"14 June 2015","review":"I'm not sure why this one is being slammed so much. I thought it was silly, fun entertainment. Totally harmless fluff but what's wrong with that? Hailee Steinfeld leads a great cast, none of whom disappoint. Nice to see Sophie Turner in a role light years away from Game of Thrones. I thought Jessica Alba and Sam Jackson were both good. Alba seems to be having the time of her life. Rachael Harris and Rob Huebel are both hilarious. Jason Ian Drucker is a little scene stealer. He's great every time he's on screen. I loved his part in the final battle. It's somewhat reminiscent of the Spy Kids movies but less annoying and not as much cartoonery. Yes it's by-the-numbers in most respects but it's just trying to entertain, not reinvent cinema as we know it. Most of the complaints I see are from people saying the movie \"could have been more/better.\" Well you just described 99% of movies. There's always room for improvement. Why don't we just judge it by what it is not what we wish it was? I think it's a fun lightweight teenage action comedy that has appeal for young and old alike. And that's enough for me.","user":"utgard14","rank":[58,66]},{"title":"Pretty Good! Enjoyed it !","rating":7,"date":"27 August 2015","review":"Really Enjoyed this movie, this did rather reminded me of So Undercover which Miley Cyrus starred in a few years ago. However this was much better, not as cheesy!<br><br>Barely Lethal is Very much a teen movie and predominantly for a female/teen audience. Haley Stanford plays lead role of a girl who wants to be a 'Normal teenager and experience a life of school and boys' but is unable to due to her training as a child to be an assassin. Very cliché and predictable but never the less, it is great. A Feel good movie which is great for the whole family! <br><br>Good cast with this movie to, Nice to see Jessica Alba and Jaime King making an appearance. Deserves more credit, and better ratings than 5.5 !","user":"Ashleypl5","rank":[26,30]},{"title":"it is what it is...","rating":5,"date":"6 May 2015","review":"After a viewing at 1am I am pretty satisfied with the overall film, I didn't go in to this expecting a life altering message or acting that would move me, for what it is the film done the job; light, airy, a predictable yet enjoyable watch.<br><br>The main draw to this film was the cast, I enjoyed Hailee Steinfeld in Enders Game and thought the somewhat masculine performance would carry well, her commitment was visible and seemed genuine (as much as could be) in the role of a deadly teenage girl. Sophie Turner being another name that caught my eye sadly didn't live up, I feel disappointed with her acting, getting the underlining sense it was half arsed-although the American accent may have been a factor in throwing off her game as well as living up to the stereotypical 'agent' robotic personality. The acting was OK.<br><br>This isn't a film I would personally run to tell my friends about, partly due to the shame of a 22 year old man liking chick-flick-esque films but mainly due to the rushed style of structure. The screenplay let this one down, rushed and again, half arsed. The small roles such as Jaime King's annoyed me slightly too but that could be a personal thing.<br><br>All in all my verdict is, surprisingly, worth a watch. I never really swear off watching something a second time but this will be one I won't be thinking about again until it shows up on film4. Don't expect too much and you'll have a 'nice' hour and forty minutes :)","user":"danieljbarton","rank":[41,52]}]