[{"title":"High concept attempt which just about makes it to the finish line","rating":7,"date":"15 November 2011","review":"As other reviewers have said this is low budget British horror with not a big name in sight. It's Social Network meets Saw on a private jet and most of the action (maybe 85 out of 92 minutes) happens in what is a claustrophobic and slightly greenish (?) space. But I take my hat off to the film-makers for going for a high concept piece. I enjoyed the final twist and found the characters right at the end immensely creepy. It did set my mind racing...I don't think the production values were that bad. Yes, the camera is clearly Hal 9000, but then I wonder if that doesn't say more about who put it there than anything else. I was waiting for one of the characters to make a reference to the Hal 9000 likeness, and to snigger more and make a joke of 'Dave'...but then...<br><br>I think there's been a lot of over-positive reviews which is perhaps a tad suspicious from people who've only ever reviewed one film ie this one, and then a few really quite nasty ones. I think the truth lies somewhere in between. For something low budget this is fine: I think it'll gain traction when it hits the £3 DVD barrier. <br><br>I like Brit horror and this is OK. 6 or 7 out of 10.","user":"AtlanticSwell","rank":[27,37]},{"title":"OK ,if you like these types of movies ( low budget,horror)","rating":11,"date":"11 November 2011","review":"Typical thriller/horror with a modern twist. Basically low budget \"Saw\" with some modern plugins. If you like such movies ,maybe you will like this one.<br><br>For a low budget movie its a good effort.<br><br>The plot is in my opinion lacking, it leaves no room suspense to build up. Or to build any relationships between the characters or the viewer. Feels rushed. The story unfolds by itself, with little active choices.<br><br>The noname actors give a good performance, trying to make the most of it.<br><br>These other reviewers must be friends of the director or something giving it 10/10.","user":"torost82","rank":[29,42]},{"title":"Interesting","rating":9,"date":"14 September 2011","review":"Panic Button starts off with the winners of a social network's online competition boarding their private jet. But somethings odd - there's no flight attendants in sight, and an in-flight competition starts <br><br>The questions are more than merely personal - whoever's behind it wants the contestants to confront the terrible aspects of themselves, having apparently found great knowledge through the internet. Should they cause trouble, a randomly-selected person from their \"friends\" list dies. <br><br>Naturally these people aren't terribly likable but thats forgivable as their bad aspects being brought up is the main theme of the film. Its a very engaging movie. <br><br>The only bad thing about the film was towards, a couple of twists were brought up, which didn't exactly work. Definitely worth watching though!","user":"BakuryuuTyranno","rank":[40,65]}]