[{"title":"An American Icon","rating":9,"date":"16 December 2013","review":"As a fan of pinup girls I knew of Bettie Page as the ultimate starlet. Page is a legend, but I did not know the story behind the doll face. Directed by Mark Mori, Bettie Page Reveals All is a fascinating movie on the life of Bettie Page. Not only does it show case never before shared secrets, it is narrated by the Page herself. You learn of the ups and downs that she faced and how she resurfaced after many years living far from the spotlight. This movie is fun, sassy, and a good story of a legendary beauty from Tennessee Bettie Page. Even if you never heard of Bettie Page, I am sure that you have seen her influence in pop culture. The lady with dark bangs and milky skin with the hour glass figure is an American Icon. The movie also touches on some of the unexpected consequences of the conservative 50s and how Page became a renegade in her art. by Dr. Wilson Trivino","user":"abcvision","rank":[9,10]},{"title":"Bettie Page Reveals All! is fascinating to watch with all her sexy images accompanied by her elderly voice reminiscing about those times","rating":10,"date":"19 January 2015","review":"As someone who had previously watched The Notorious Bettie Page-the dramatized account of the pin-up queen-and Bettie Page: The Girl in the Leopard Print Bikini-another documentary about her, seeing a DVD of Bettie Page Reveals All! displayed on the shelf at Barnes &amp; Noble-with the revelation that Ms. Page herself was narrating from recordings of interviews she did before her death in 2008 as well as the promise of so many of her pictures and short movies she made being shown-made me want to buy it right away and view it at home which I just did. Quite an eye-opener watching all those images of Ms. Page in all her sexy glory and then hearing her elderly voice with such a fascinating account of what she went through much of her life made this quite an experience to savor. So on that note, I highly recommend Bettie Page Reveals All!","user":"tavm","rank":[4,4]},{"title":"wow","rating":9,"date":"17 July 2014","review":"It is so amazing to hear Betty's story in a very real sense. this woman lived a very full life that should be respected and celebrated. great job on the filmmaker's part...you have made Betty an identifiable person. I think many of us can relate to the things she had done and been through in life, and honestly admire. Betty lived her life in many arenas and I love that this was represented. I found it especially important that her voice is heard throughout the film. This film is the most thorough representation of the complexity and movement of Betty's life that has been presented to the public so far. It brings the viewer beyond the photos and videos ad gives us insight into the whole person who is certainly an icon. Who would have imagined that Betty was living an entire life outside of the pinups?","user":"crystal075-705-904023","rank":[7,9]}]