[{"title":"Effortless, Supernatural Fairytale","rating":8,"date":"28 June 2014","review":"I feel like the ratings are giving this movie a bit of a beating, and unfairly so.<br><br>I appreciate that this is not a mind-blowing blockbuster, but - taken in context - it is just a beautiful dark-tale. Someone previously mentioned 'pace' issues, but I didn't actually find it a fault.<br><br>The two leads are strong and believable, even facing such a fantastical race to find a reason for what is happening. I think it is cleverly wrote to piece together the mystery. <br><br>A few other reviews have mentioned 'Silent Hill', but if you are anything like me and a big wimp when it comes to horror... please don't be put off as although a bit nail-biting at times, it is far from 'Horror'.<br><br>If you don't go in expecting it to change your life, then I would seriously recommend this film.","user":"moorehart1","rank":[43,60]},{"title":"A refreshing look at the thriller genre","rating":10,"date":"20 September 2012","review":"When seeing the trailer for After for the first time, I was a bit skeptical. But the story peaked my interest. What I walked out of was a refreshing take on the genre of the thriller. I can't go into a \"scary\"movie anymore without watching either someone demon possessed (not really my thing) or girls and guys getting ripped to shreds by some mutant human. Sure, I love my Shining and even a little Evil Dead, but too much realistic gore just takes me out of the story. So, it was awesome to see a well acted, great looking film that had all the suspense I needed without the explicit gore. Lead Steven Strait did a wonderful job as our hero, while Karolina Wydra was captivating and easy to root for. What I loved most about this story was the idea of these moments that connect us that we may not even be aware of. How many people do you pass on the street that you may have played with as a kid, lived next door to, or more? Check out After. It offers plenty of thrills for the thrill seekers and yet also gives us a heart-warming story we unfortunately don't get to see in the Hollywood thriller anymore.","user":"brandonchesbro","rank":[69,109]},{"title":"A Familiar Template Executed Well","rating":7,"date":"25 May 2015","review":"I just watched the movie After on Netflix. I don't recall having heard anything about it previously, no reviews or anything of the sort. I was pleased with what I saw.<br><br>It's difficult to discuss the movie without giving anything away and there are other movies with similar premises, but this one was well-executed.<br><br>Two strangers from the same town meet one another on a bus, with a bit of abbreviated and failed flirtation, shortly before there is a severe accident. The next thing we know they are the only two people apparently alive and active in their town. There are no corpses and no signs of life beyond the two of them. Surrounding the town is a wall of black, swirling mist with lightning and thunder active within it...and the wall is closing in.<br><br>It doesn't take altogether too long before the two protagonists discuss the possibility that they might both be dead, so they aren't as stupid as the characters in a lot of movies along these lines. We get to know them both pretty well along the way, through surprisingly natural conversation and glimpses into the past, without a lot of unnecessary exposition.<br><br>I won't go into any further details, you'll need to watch it yourself if you want those, but the acting is good and the production quality is high enough that it doesn't feel like a low budget movie at all. It's always kind of nice to go into watching a movie without any idea what to expect and to be pleasantly surprised.","user":"Necroambulant","rank":[18,25]}]