[{"title":"Yes, yes, yes, yes, NO!","rating":5,"date":"17 June 2012","review":"Sigourney Weaver plays Margeret Matheson, a jaded middle-aged psychologist. If you've seen Avatar it's the same character she plays in that but with a bit less vitriol. I liked this character; a firm woman,but fair and kind when she needs to be. This is a character we've all met in real life at some point. She's compelling and extremely well acted by Weaver. In every scene you're completely hooked by the show she puts on.<br><br>Cillian Murphy's character, Tom Buckley, is a little more mysterious. He plays a Physicist (allegedly) who accompanies Matheson on her expeditions to debunk fake mediums and psychics. The character is written with little back story and what little back story that is introduced remains cryptic. The role is well acted but outshone by the better conceived, better written character of Matheson. <br><br>The film starts out well. The first scene (a prologue/intro sequence) is suspenseful and I thought it worked really well. Both Weaver's and Murphy's characters are introduced well and chemistry is established right from the first scene. <br><br>The best thing about this film is the atmosphere. Every scene is absolutely dripping with it. The direction as well is tasteful and strong. Little touches like the camera shaking a little more in every scene that Matheson is in (to show her questionable health) are very effective and add to the feel.<br><br>This 2 hour film trundles along at a steady pace, fleshing out Matheson and Buckley (sort of) and introducing a completely irrelevant love interest for Buckley. She plays little role in the story and could be cut entirely.<br><br>We follow them as they expose a Psychic as a fake. They perform surveillance in the crowd before the show, spotting so called \"Red Lights\" (employees of the Psychic who scout potential targets for the psychiching later) and hacking into the radio frequency that is used to communicated with the Psychic on stage and tell him names and other secrets to fool the audience into thinking he's actually got a gift. Looking good so far.<br><br>We are shown Matheson's inner turmoil; her sick son. Apparently in a coma for over a decade, the soft, squishy side of such a apparently tough woman is laid bare. Apparently her zeal for exposing fake psychics stems from her inability to let him go. She uses him as an excuse almost, each case shown to be a fake solidifying her belief that there's no afterlife and justifying her keeping him alive. Besides a spot of clumsy writing with some un-needed overexposition (a bit of a theme with this film I'm afraid) the time spent in the hospital room really opens up Matheson's character.<br><br>And then she dies.<br><br>Seriously, she dies. Why? I don't know. Matheson, the most fleshed out and built up character just up and dies. Such a pointless grab at an emotional scene completely kicks the legs out from under the film. There's no reason why the Matheson character couldn't have been included in the rest of the film, she just disappear. This was supposed to be a parallel of a past event in the story, where Simon Silver's (a blind, formerly extremely famous psychic (Robert De Niro)) biggest critic mysteriously died from a heart attack. However it is very, very loosely linked and barely explained.<br><br>The latter half of the film we focus on Buckley as he becomes obsessed with discovering Simon Silver as a fraud. Buckley, now apparently the main character, slowly seems to get more and more unhinged as he's apparently haunted by Silver. Birds spontaneously fly into windows near him, things go bump in the night, equipment explodes randomly etc etc. The void left by Matheson never quite goes away though, for all the wrong reasons.<br><br>Silver is eventually found to not be a fraud after a heavy duty scientific study but Buckley unleashes his trying-so-hard-to-do-an-American-accent student(Ben, Craig Roberts) on the footage from the experiment who eventually comes up with nothing. Suddenly, love interest (who I'd completely forgotten about) comes along and spots that Silver's watch and the other scientist performing the test's watch are perfectly in sync. Ignoring the fact that Silver was told to remove his watch earlier in the scene and the fact that the other (unintroduced) scientist is apparently totally alright with jeopardising his scientific career for whatever Silver is paying him, this reveal is pretty weak and totally not characteristic of actual scientific study.<br><br>Buckley confronts Silver on stage at his last show (after being beaten thoroughly to fine mush by one of Silver's minions) and the theatre goes mad. Lights explode, ceilings crack, the ground shakes, Silver's glasses fall off. This is all very exciting and you really wonder how Silver is pulling it all off. You wait for the great reveal. The turmoil subsides and Buckley flicks a coin at Silver who snatches it out of the air, revealing he is not in fact blind and is a fraud. This is where the film should have ended.<br><br>And then Silver says that one line. That simple 5 word line that completely ruins the entire film. \"How did you do that\"<br><br>Yep, you got it. Buckley, the mysterious physicist, the man obsessed with revealing Silver as a fraud, is the true Psychic. This is a twist so violent and random it finally breaks the films neck. It completely mangles the whole tone, message, moral; anything this film had is now gone. The mystery and tension evaporates like a flock of birds after a gunshot. The intrigue at how these apparently impossible events could have possibly happened to Buckley is moot. All of this in the last 5 minutes of the film. I have never known a film be more thoroughly ruined in such an thorough and accurate way. <br><br>5/10. The story is nearly there, the acting is generally good, the atmosphere created is stellar, but those last 5 minutes are truly horrifying.","user":"mueslibrekkies","rank":[203,259]},{"title":"dismal portrayal of both science and the paranormal","rating":3,"date":"5 January 2015","review":"This could have been a great film. With such an outstanding cast, and potentially intriguing plot, but unfortunately it is just stupid. I really wanted to like it, but I struggled to like anything about it. The script was banal and the topic poorly researched. Someone was just plain lazy putting the story together. Here are some examples that really irritated me.<br><br>Dr Matheson (Sigourney Weaver) is a psychologist who researches and debunks paranormal phenomena, in particular exposing frauds. Yet inexplicably she chooses not to investigate Simon Silver (Robert De Niro). Why? Because she has been riddled with guilt morning til night for 30 years after he made her DOUBT for a second. What??? What is wrong with a skeptic having doubts? Skeptics should have doubts, or at least be open to the possibility of having doubts. Scientists are supposed to ask questions and objectively seek evidence. You can't be objective if you have already made up your mind. Surely her momentary doubt should motivate her to investigate more thoroughly? <br><br>That brings me to the second problem. The head of the Scientific Paranormal Research Centre, Dr Shackleton, prior to running his experiments states publicly that he expects to find proof of Silver's powers. Not objective. And Silver himself gets to approve the team of investigators. Not objective. These are serious flaws in the design of a scientific experiment, which is supposed to be free from bias and where the researchers need to be independent of the subjects. Even the media, let alone scientists, would reject this \"experiment\" as just hype for lack of objectivity and independence.<br><br>Third irritation. Basic research would show that psychics are not a grab-bag of special powers. They claim to specialise in particular areas. But Silver bends spoons and performs psychic surgery and projects thoughts onto photographs and reads minds and levitates and moves objects. That's like making an Olympic athlete run, jump, throw javelin, swim, ski and shoot. De Niro's character would've been so much more credible had it actually resembled the behaviour of real life \"psychics\". Obviously films have licence to stretch the truth, especially with this kind of subject matter, but it still needs to be believable or it just doesn't work.<br><br>Finally, the twist at the end that apparently no-one sees coming. Could've worked, but handled very clumsily. Really just a poor copy of the ending of the Sixth Sense. By the time you get to the end you're expecting a twist of some kind, but at that point I didn't care enough to try to work out what it was.<br><br>Sigourney Weaver is the only reason I'm giving it 3/10. De Niro just looks silly.","user":"minch007","rank":[18,21]},{"title":"Lights at the end of tunnel.","rating":7,"date":"19 June 2012","review":"Firstly, apologies for the review title. I've seen too many tabloid headlines.<br><br>Red Lights was reasonably original, well-written and well-acted. Any movie that can tick these three boxes is worth a look. Although the build up to the introduction of De Niro's character (Simon Silver) represented a slightly excessive portion of the movie it was, nevertheless, interesting. I gather the ending has divided opinion quite a lot, and I admit that it could have been done much better. I've said before when reviewing movies that it's never a good sign when you have to have a character explicitly explain just what has happened in the film. It might have been a better idea to leave it without the explanation and let the audience decide. That might have stoked up debate in a good way and generated some more interest in the film.<br><br>Acting-wise i'm sorry to say i'm always skeptical when Robert De Niro appears in a movie nowadays. The man was a terrific actor in his day, but he's been in a lot of recent turkeys. He doesn't have a lot of screen-time here but his performance was fine. If he keeps choosing credible films like this one his reputation will start to repair itself. Sigourney Weaver performs with credit as usual and I always rate Cillian Murphy highly.<br><br>Definitely worth going to see this. It's above average, if only slightly.","user":"alangsco","rank":[55,80]}]