[{"title":"The performances deserved a better film","rating":7,"date":"6 September 2015","review":"Mark and Mary and son Brendon retreat to the family's remote holiday house in order to recover from a tragedy, only to find that the new neighbours have it in mind to find out as much as possible about them, kill them, and steal their identities.<br><br>This film has a good cast (albeit the two male leads are each playing the part the other should have played), good performances, and an intriguing (if underwritten) character in the baddie's \"wife\". On the other hand, it has a very slow start, a plot we've seen a hundred times, victims who annoyingly fail to take advantage when they have the upper hand, a climax which is over and done with in no time flat, and a desaturated colour palette.<br><br>Is the good sufficient to outweigh the negative? That's your decision. For me, it was borderline.","user":"neil-476","rank":[4,4]},{"title":"Deserving points for execution...","rating":6,"date":"2 July 2013","review":"...despite a somewhat suspect plot that raises a few too many questions that aren't satisfactorily addressed, \"In Their Skin\" manages to transcend its flaws to deliver a reasonably creepy psycho-thriller. Primarily it's the third act where everything falls apart. Premise: a young yuppie family has retreated to a summer home to work through the grief of losing a daughter, only to be tormented by an invasive mirror family of head cases who want to usurp their identities. We get to know our protagonists in Act I, we meet the antagonists in Act II, and things play out in the closing Act III. All well and good; classic Syd Field stuff. The cast is mostly on the ball, the lensing and lighting well done, effective helming from its tyro director/co-writer; there's much to like in this film.<br><br>However, as mentioned, things fall apart as what started out as a slow- burning tension builder devolves into a disappointingly routine assault on our protagonists, replete with numerous stupid moves on the part of characters who've apparently never seen movies like this one before. The most egregious failures involve a lack of explanation/willing suspension of disbelief concerning the antagonist \"family.\" They simply don't behave like real people; they're authorial constructs only. They have no real background, no internal consistency, and it doesn't take an audience long to figure out they have no likely future, either. One can only wonder how this trio's leader subverted his followers into his dementia.<br><br>Ultimately, \"In Their Skin\" fails to pack the punch of progenitors like \"Funny Games\" or \"Last House on the Left.\" It's not a terrible watch, but it's far from essential, or even recommended. Check out one of the two I just mentioned instead.","user":"MrGKB","rank":[6,7]},{"title":"\"Funny Game\" Rip-off","rating":6,"date":"5 August 2013","review":"Mark Hughes (Josh Close) travels to his isolated cottage with his wife Mary (Selma Blair) and their son Brendon (Quinn Lord) to recover from the loss of their little daughter. In the morning, Mark wakes-up with a family dropping wood on their porch. Bobby (James D'Arcy), Jane (Rachel Miner) and their son Jared (Alex Ferris) tell that they are neighbors that brought the wood to welcome them and Bobby asks if the HMark wouldn't like to have dinner with them.<br><br>During the dinner, Mark has an argument with Bob and expels him and his family from his house. Soon they find that their house is under siege of Bob and his family that invade the house. When Mark's brother Toby (Matt Bellefleur) arrives in the house to visit his brother and his family, Mark and Mary learn how insane the psychopath Bob is.<br><br>Michael Haneke's 1997 \"Funny Game\" is one of the most disturbing movies that I have ever seen. Living in a big city where we see violence on the news everyday, that sadistic movie really scared a lot since the plot is realistic and totally believable. In 2007, there was a stupid and unnecessary remake also by Michael Haneke spoken in English.<br><br>\"In Their Skin\" is rip-off of \"Funny Game\" with good performances but with flaws in the story. First, I do not understand how vulnerable the American residences are, with glass windows and no protection in a situation of burglary like the Hughes cottage is. But the worst is why a man in possession of a revolver inside his house would leave his wife and son alone in the house expecting to escape from an armed psychopath. But the situation is not totally impossible to happen. My vote is six.<br><br>Title (Brazil): \"Em Sua Pele\" (\"In Your Skin\")","user":"claudio_carvalho","rank":[19,29]}]