[{"title":"A Green Fairy Tail","rating":8,"date":"7 July 2015","review":"A Good script, a touching story and a simple way of telling the story. Do not expect the greatest of the movies but, can expect: simple directing, simple starring and a simple movie. It makes one think. Good job from Dakota. Must See In a time when everybody wants the new gadget, the more fashion clothes, the super car, this movie makes us think, just for a while, that we must take care of the planet, so that our grand grand Childs still can live here. Movies should do at least one of the following: entertain, make us think or makes disconnect for a brief moment in time. This movie makes us think, but both Dakota and Theo, makes us disconnect.","user":"telmo-campos-matos","rank":[22,28]},{"title":"Maybe the script isn't as vigorous as you'd expect but it has some intense purposeful emotional idea and that's what made it enjoyable in its couple of final scenes.","rating":6,"date":"7 July 2015","review":"So the movie started really slow and cold ;) just talking and talking and some weird language from \"the north\" until Chloe appears still talking about herself and the man she's met !! then things got a little interesting with the funny looking \"freaking Eskimo\" so it started to get a bit funny with Chloe steal from the Retirement home :D<br><br>So whether we agree or disagree on the importance of global warming issue ,, the movie amazingly shines a light on this making it so purposeful and it gets really emotional while Theo starts telling the story of how the \"men of the south\" and their capacity of destruction and their need for expansion effects other on the planet... but again it went back to be humors .. so the Genre is not so much Drama as it has comedy, thrill too and some emotional statements in the final scenes ..<br><br>The performance of Dakota Johnson is applaudable, Mira Sorvino and the others .. Theo Ikummaq was also so good, for him it's like just be there and here you are a rigid strong Eskimo or Enoch !! ;)<br><br>See the problem here was maybe all the monologues it kinda felt more like a documentary in some parts and the script could have been so much stronger and tighter .. but it felt like switching from talking to yourself to a regular scene again and again .:P<br><br>Overall ,, Maybe the script is not as strong or vigorous as you'd expect but it has some intense purposeful emotional idea and that's what made it enjoyable and catchy especially in the second half.","user":"Aktham_Tashtush","rank":[15,20]},{"title":"Best movie in a long time","rating":10,"date":"12 August 2015","review":"I have to say this film opened my eyes to the amount of ignorance we have toward humanity, it was well written with a great cast, it has a true meaning and those with a heart will be able to capture this meaning and see the world through the eyes of people who have genuine concern for not just the earth, but all those who exist in it. Thank you to all involved especially Theo who plays himself in the movie and Monica Ord a producer of the film and a true activist for the well-being of mankind. I recommend with parental guidance that this movie is for everyone. There is laughter and tears and I was able to bond with the characters unlike any other film I have seen in a long time . Please don't miss this one!!!","user":"sammy4474","rank":[19,29]}]