[{"title":"All I can say is WOW!","rating":10,"date":"11 August 2018","review":"A truly moving experience! This presentation has everything, love, honour, justice, vengeance, hatred, hope, hopelessness. This is filled with superb acting and I was left knowing the cost of knowledge. To what or to whom will we sacrifice our all?","user":"rfoster-06979","rank":[15,15]},{"title":"Excellence...","rating":7,"date":"4 October 2017","review":"Ben Kingsley plays 'The General', a War Criminal in some unstated country hiding from those who would prosecute him for his crimes. <br><br>His only normal human contact is that of his 'maid' (Hera Hilmar) - an, initially, reluctant participant in the relationship.<br><br>Kingsley plays his part with equal indifference and suppressed savagery - though no explicit details are given of his 'atrocities' - you become quickly convinced that this is a creature capable of committing them.<br><br>Hilmars' portrayal of a person bound by circumstance is equally ambivalent. Initially repulsed by The General, a tenuous connection rears it's head.<br><br>There's very little in the way of 'action' during the entire film - this is not a film about actions, but about the consequences.<br><br>Watching he interplay between 'The General' and 'The Maid' is both fascinating and morbid - like watching a car crash in slow motion.<br><br>I heartily recommend this film for fans of Kingsley - but if you're expecting an action packed, explosion driven extravaganza of the more modern genre, you'll be disappointed. Hera Hilmar too, plays her part with a subtlety that shows the depth of her acting experience.","user":"notom-23012","rank":[59,67]},{"title":"The effects of isolation on a hunted war criminal","rating":8,"date":"24 November 2018","review":"Writer and director Brad Siberling offers a very strange essentially two character film that immerses the viewer in the terror - and humor - of isolation, demonstrating how the presence of a companion allows connection in a world that no longer makes sense. Filmed in Serbia the actual languages and change sin viewpoints (and accents) can be confusing at times, but this not the point of the film - simply an observation.<br><br>In the opening screen remarks we are informed that War Criminals are usually caught in time, except one, this one: The General. And apparently the area of location is Yugoslavia and we meet the General (Ben Kingsley) being escorted to yet another hiding place by his handler Miro (Peter Serafinowitz). When the General is dropped off at his current safe house he encounters Tanja (Hera Mimar), a maid, who provides the responses to the General's endless chatter. Tanja is his only connection with the outside world and the various walks and endangerments they face form the crux of this mysterious story.<br><br>The acting by Ben Kingsley (sporting a confusing but consistent strange accent) is brilliant. A stylish, dense, and in many ways illuminating film about the effects of war on the individual.","user":"gradyharp","rank":[11,11]}]