[{"title":"Carefree fun","rating":8,"date":"17 August 2011","review":"Most people probably know what they are going to get before entering the cinema. So sniffy pseudo intellectuals should probably stay clear. But if you're the sort of person who liked the TV series, doesn't think they are a \"chav\" by eating McDonalds and likes fart jokes then you will really enjoy this movie. The whole audience laughed out loud on many occasions. No its not a clever plot, but they do manage to purvey a slice in time where we are all making the mistakes we all do as we move from adolescence into adulthood. The primary characters maintain their chemistry (which must only come with having now spent so much time with each other). You don't eat a cheese sandwich expecting a Michelin star, and so it is when watching this movie. Its silly, funny, cringe worthy humour. I really enjoyed it, and I imagine a good many others will too.","user":"hwangeruk","rank":[91,119]},{"title":"Does the show justice","rating":10,"date":"10 December 2012","review":"Seeing the mixed response this movie got here in the US definitely had me lowering my expectations. I finished the show in two weeks and is now one of my favorite TV comedies ever, so I was seeing this film either way. As it stands, this definitely does the series justice. Oh, it definitely wasn't anything out of the ordinary or unpredictable, but just like the show, it's able to still be completely hilarious and really touching when it comes down to it. The four characters have deeply resonated with me, and the movie just further expands their arcs in mostly successful ways. Even though the movie may not have the freshness the series has many times, it works because it still has the same humor, and the characters are definitely true to themselves. It's a riot!","user":"Red_Identity","rank":[16,19]},{"title":"Does what it says on the tin","rating":10,"date":"18 August 2011","review":"This is the first review of ever been compelled to write - it's a direct result of having read some reviews in the media slating this film for not 'moving on the characters' etc...<br><br>As a huge fan of the TV series I was very nervous about how this film would go prior to it's release I told people 'I hope it's not the usual feature film formula - they go away, have fun, fall out, and reconcile for the final party' - I must say, and it won't spoil the film for anyone when I do, that's exactly what happens....but done with such brilliance no one will mind.<br><br>As has been stated by other reviewers the film is no more than an extended episode of the TV show - but when you 4 such perfect characters that is exactly how it should be. The cinema I watched it in was packed (with people of both genders and all ages) and in stitches from start to finish. The film, like the series, is so close to the truth regarding being 17/18 and the rubbish you get up to that you can't help but be dragged into the world of Neil, Jay, Simon and Will.<br><br>A wonderful ending to a wonderful series - the world is a sadder place without this comedy and, more importantly, these four characters.","user":"shevace","rank":[47,73]}]