[{"title":"Subtle, clever and witty - brilliant!!","rating":8,"date":"15 October 2013","review":"A rousing and energetic adaptation of Tolstoy's Two Hussars, Two Jacks succeeds on the level pure spectacle, but provides an unanticipated level of depth and humor as well.<br><br>Two Jacks includes an all-star cast headlined by Danny Huston and Sienna Miller. This feature is a fast-paced, glamorous and romantic vision of Tinseltown – old Hollywood glamor meets modern day La La land. The audience is enraptured by the brilliant cinematography through fast camera work and quick edits reminiscent of European cinema.<br><br>The story is of legendary film director Jack Hussar (Danny Huston), a notorious gambler and philanderer, returning to Los Angeles to obtain financing for his next film. During the course of one night, Jack charms the stunning Diana (Sienna Miller), makes his way around the party circuit, and narrowly escapes a brush with the law, before playing a high-stakes poker game at dawn. Cut to, years later when Jack Hussar Jr. (Jack Huston) arrives in Hollywood for his directorial debut, an older Diana (Jacqueline Bisset) finds her daughter falling for her former lover's son. Jack Jr is desperate to escape the footsteps and reputation of his father, therein is where the adventure lies. The subtle and witty writing and directing shown cleverly by characters behavior rather than words captures the human spirit that remains constant with time.<br><br>A must see!","user":"jilldalejd","rank":[10,13]},{"title":"Two Jacks","rating":9,"date":"11 February 2013","review":"Writer/Director Bernard Rose continues in his series of Tolstoy adaptations with his latest Two Jacks, starring Danny Huston and Jack Huston. Danny Huston plays once successful and revered Hollywood director Jack Hussar. Upon his return to Los Angeles, Jack hopes to procure financing for his newest project. Jack with, his nightly attendance to glamorous parties and continuous smoking make him a classic Hollywood filmmaker. But he is not without a bit of compassion or clever thinking. Following a lifetime later is Jack's son, who shares both his name and passion for filmmaking. Not to mention his charm and reputation. Jack Jr. as his journey begins also aspires to procure financing for his filmmaking debut. <br><br>The two Jack's do well to carry themselves with confidence and a touch of arrogance in some cases, but not without sympathy or flaw. The cinematography speaks with an artistic new wave cinema vérité style. The color is tinted in Jack Sr. scenes giving the impression of a time in film long gone. Unfortunately, this sort of filmmaking is not for everyone. However I found this to be done due to the unique vision of the director.<br><br>For those familiar with the style or Roses previous work, Two Jacks is sure to please with its solid performances and artistic storytelling.","user":"jtcdeeproots","rank":[10,13]},{"title":"Legendary film maker Jack Hussar inspires awe and love in his fans, but will his son, also a film maker ever live up to his father's reputation.","rating":9,"date":"16 October 2012","review":"Director Bernard Rose teams up with Danny Huston for their third Tolstoy adaptation following Ivans XTC(2003) and The Kreutzer Sonata(2008) in the indie comedy drama: Two Jacks. Based on the short story of The Two Hussars, it is the tale of . Legendary film director Jack Hussar returns to Hollywood after a long absence looking to finance for his next film. He drinks freely, attends glamorous parties, romances beautiful Diana and wins his financing in a poker game. Years later, his son arrives in Hollywood to make his directorial debut, and it is clear that he aspires to live up to his father's reputation.<br><br>Rose chooses Hollywood as the backdrop for this study of what goes into creating an impression. And how apt.Danny Huston gives a rousing performance as the chain smoking, self absorbed, washed up director whose legend and persona are more revered than his actual talent. Jack Huston's portrayal of the Jack Hussar Jr. is a subtle, nuanced presentation of youthful bravado and insecurity. Unlike Joe Wright's recent grandiose, cinematic adaptation of Anna Karenina (2012), Two Jacks stays true to Rose's 'high art/ low-fi' style, fast camera work and quick edits are reminiscent of European cinema and the French New Wave. Rose's direction constantly points to the characters and keeps you engaged. Don't get me wrong, there is plenty to look at; the costumes designed by Julia Clancey are spectacular, the photography is quirky and captivating. The performances by a stellar cast that also boasts Jacqueline Bisset as the old Diana and Richard Portnow as Lorenzo, the mafiaso looking producer. <br><br>This is Rose's fourth film of his Tolstoy series and arguably the best. It is not just the alternative, indie Tolstoy adaptation, it is by far the most interesting, intelligent and entertaining. Well worth a watch.","user":"jo-ingabire","rank":[7,10]}]