[{"title":"Do Not Watch! I am Dead Serious...","rating":3,"date":"12 May 2012","review":"You know what happens when awful script meets with bad acting, right? Instead of having a fun Friday, you get mad and start thinking about how to get your 2 hours back.<br><br>This is exactly what will happen if you watch this movie. Don't get me wrong, I love cheesy horror flicks but this one is just plain awful. Dialogs are cheesy, the whole plot doesn't make any sense and it is full of logical mistakes. I'm not blaming the actors for their bad performances because when the script you are working with is so bad, the things you can do are limited.<br><br>The characters are so hollow and two dimensional that we don't care a bit when they die. Actually, we don't even care if they survive, we just want this movie to be over as soon as possible.<br><br>All in all, I strongly recommend to skip this flick and find something else to do instead. Believe me, it will be a very smart decision on your behalf.<br><br>Warning: Do Not Read This Part, If You Haven't Seen It Yet!<br><br>Why did the handy cam disappear?? If it wasn't important, then why did almighty director Alex Wright use it at the first place? <br><br>A demon is not a spirit, it's an entity. How come you don't know the difference as a writer working on a supernatural theme?<br><br>First, Joey was with Eva, and then we find out that he has an unborn baby from Sara? If he was with Eva before, then when the hell were Sara and Joey together? It's not like they are 50 years old.<br><br>Marcus was a very unnecessary character and it may shock you Alex Wright, but nothing changes in the script when you exclude this character.<br><br>I can go on forever but I will be straight to the point. Alex, you really need a career change so that you can stop wasting our time and money by shooting movies that should never exist.","user":"One_slice_of_pizza","rank":[23,31]},{"title":"Despite the Low Budget, Could Have Been Much Better","rating":3,"date":"30 July 2013","review":"The friends Marcus (Chris Olivero), Joey (Bobby Campo), Eva (Nazneen Contractor) and Sara (Devon Ogden) go to the morgue where Marcus works to record a séance summoned by Eva that is a medium. Joey does not believe that Eva is capable to summon spirits and make jokes all the time. However, Eva summons a demon by mistake and Joey is possessed by the fiend. The Christian Sara tries to exorcise Joey but the powerful demon has many tricks to lure her.<br><br>\"Seance: The Summoning\" is a low-budget movie with great potential but unfortunately it fails. Sara and Eva try to use the help of God to defeat the demon but the fight between good and evil is poorly resolved. In the end, neither God nor the devil wins the battle and the story becomes pointless. My vote is three.<br><br>Title (Brazil): \"Evocação – A Porta do Diabo\" (\"Evocation – The Devil's Door\")","user":"claudio_carvalho","rank":[9,11]},{"title":"A small dose of subtle terror can go a long way...","rating":5,"date":"14 May 2012","review":"Initially I have to say that having read some review for this movie, I was preparing myself for a boring movie, but still I am not really one to turn off movies unless they are beyond boring, and I did find the plot of the story interesting, so despite the bad reviews, I sat down to watch \"Seance\".<br><br>I don't understand why it got so bad reviews, because I didn't find the movie that bad. Sure it was not a million dollar Hollywood movie, but still it was to the point and it had a good enough story to tell. \"Seance\" is about four young people going to a city morgue, where one of them works as a security guard, to have a seance (hence the name of the movie) in order to call up the spirit of the dead. Something goes awry and something dark is called forth.<br><br>The storyline was compelling and it was good at building up suspense and thrills. Now, don't expect to be scared, because it is not that kind of horror movie. Instead, it is the type of movie that builds on brooding atmosphere and subtle terror.<br><br>Personally, I found there was a little too much Christian propaganda in the movie. But hey, dealing with evil presences, I suppose that is what people think they need to turn to.<br><br>The people cast for the movie did good enough jobs, two people stand out and carries the movie entirely; that being Bobby Campo (playing Joey) and Nazneen Contractor (playing Eva). Their performances were really great, and came off really believable.<br><br>One thing that I didn't understand about the movie was if the entity that was called forth had been waiting 200 years for a mortal vessel to possess, why did it speak 21st century American English and not 19th century American English? If they had kept it that way, the movie would have had so much more credibility. And also, a cool touch to the possession would have been if the possessed individual spoke with those voices simultaneously.<br><br>\"Seance\" is a toned down version of \"The Exorcist\" and it would appeal to today's audience, and perhaps even instill a curiosity to further explore the market for possession-style movies and return to the 'classics'.<br><br>\"Seance\" is well worth a watch if you like movies that have a brooding atmosphere and builds up subtle terror, instead of being all gory and trying to be as brutal as possible. And speaking of gore, then there were actually some nice enough scenes with blood and injuries in \"Seance\". Thumbs up for that. And the story takes place in a city morgue, that just adds so much to the setting, and that was really a nice touch.","user":"paul_haakonsen","rank":[14,21]}]