[{"title":"Interesting spin on the \"found footage\" genre...","rating":6,"date":"31 December 2011","review":"Following the craze revived by \"The Blair Witch Project\" (it had been done before with movies like \"Cannibal Holocaust\" and \"The Last Broadcast\"), \"Apollo 18\" presents itself as footage of NASA's \"last\" voyage to the moon in the 1970s, showing us the \"real\" reason why we never went back. Through said footage, we follow the exploits of three American astronauts - two on the lunar surface and one in orbit above the moon - as they discover that the moon is hiding a terribly dark secret. Apparently, there's something already there which has nothing to do with either the Americans or the Russians, and it doesn't want us there... or maybe it does, but for unpleasant reasons. This is not a spoiler, by the way; the trailer reveals as much.<br><br>The pros of this movie include, first and foremost, that it's a rather unique idea for a story. Ever since man has first walked on the moon, there really has been no speculation of whether or not the moon supported life (and no, I still believe it doesn't), and ever since Apollo 17, there has been speculation on why we never returned (though it likely has more to do with time, money, and risk than anything else). Another pro is the film's realistic look; the lunar landscape appears realistic, and the special effects are convincing as well. As for the scares, they're plentiful without being overly so.<br><br>\"Apollo 18\" is not without its flaws, though. One thing that had me scratching my head is the high amount of gravity which was shown inside the lunar landing vessel. Contrary to popular belief, there IS gravity on the moon as well as between any two forms of mass, though it's not nearly as strong as what we would find on Earth. You can see the astronauts jumping at large distances while walking on the lunar surface, but not inside the lander. Secondly, I kind of wish they had developed the lunarian creatures a little more. The filmmakers use creative camera work to keep several things hidden, which does help add to the suspense, but I still think it would have helped things more to show the lunarians a little more. In spite of these flaws, the film kept my interest.<br><br>I see a lot of people hating this movie. While they have every right to, I'm kind of lost as to a reason why. No, \"Apollo 18\" isn't a great film, but it's not terrible, either. Just take it for what it is.","user":"Htom_Sirveaux","rank":[20,23]},{"title":"here's what you need to know","rating":6,"date":"31 December 2011","review":"Okay here is what u need to know about this movie. Not worth paying for at the movies. If I had to sit in a theater for this I'd be mad but at home OK. BUT worth it for Pay per view or to rent. If you liked Blair witch and like science fiction, you will like, not love, this. If you're older and hate Blair witch, the nostalgia of the moon landings will carry you thru. pretty good movie tho not great.<br><br>my goal is to give reviews that let u know what your in for, not nitpick and discuss film techniques,directors, or show my \"expertise\" in film making. just tell ya if it's a stinker or not.<br><br>and to make my minimum ten lines it's good not great. time killer but worth watching.","user":"wolfhorse","rank":[25,30]},{"title":"Faux space documentary better than predicted","rating":20,"date":"20 September 2011","review":"Framed as leaked \"found footage\" from the era of space exploration in the 1970s, Apollo 18 is an attempt to out conspiracy the already rife conspiracy theories concerning the lunar landings. The trouble with framing something as being documentary style footage is you have to get the science right and be free from any loopholes that might break the audience out of the illusion. Apollo 18 falls short on this count. López-Gallego manages to recreate to a certain extent the lunar missions. Portrayed through the various cameras feeding live footage back to Earth we have a Big Brother style look into the doomed from the start space mission. The two man crew of the lunar lander also film themselves on 16mm cameras. Herein lies some of the flaws in the director's logic. We need to get into the character's perspective to relate. This is solely done through these 16mm cameras. They film themselves on the moon's surface as well as personal records in the module. The rest is all caught on remote cameras, the audience being allowed to see the threat before the crew do, privy to the danger the Department of Defence has exposed them to. The live footage makes sense to have been documented; however the 16mm film rolls do not make it out, they share the crews dire fate. How then are we seeing the actions of the crew amidst this found footage? It makes no sense pulling any reasonably astute watcher beyond the line of suspension of disbelief.<br><br>It seems clear López-Gallego wants us to care about the cast. We need to care for the conspiracy theory to resonate. The story very directly harks into the era of Watergate where the powers that be cannot be trusted. But his illusion of found footage does not stand up at all well. Does the story really fail on this account? No. It's actually fairly entertaining as it goes. The tension builds; the threat is revealed and played out. However the conspiracy theme and the documentary framing lend the film no real benefit and do not pay off. While there is reams of data on the films website to build the conspiracy it is not present enough on screen to sideline the notion we are victim to a none to subtle slight of hand. <br><br>What the film did do with the early footage was remind me why, as a child, I was so fascinated with space. It shows with sufficient realism what the actual Apollo astronauts did and how we as a planet reached for the stars. This is not history as it tries to suggest, but it is a reminder, to me at least, of how sad it is that we no longer pursue such epic destinations as the moon or beyond.","user":"richard-s-bellamy","rank":[77,102]}]