[{"title":"Everything about this movie were wrong!","rating":19,"date":"19 August 2019","review":"The movie was adapted from Maurice Walsh's short story. If you have read it, then you'd immediately found out the whole movie was cast with absolutely wrong cast, John Wayne was not in the least as what the short story had portrayed as the man, Sean Thornton, not even close in 100 miles.<br><br>Sean Thornton, in the story, was indeed a very quiet man, a professional boxer retired from New York boxing ring, seeking an even quieter retirement life back to his hometown in Ireland. He was a tough guy, very reserved and at the same time very humble but with a very strong mind and will.<br><br>But the screenplay writer and the director, John Ford, had messed up the whole lot and changed it into a farce-like light-heart comedy. It lost the depth of the great short story with a very deep and profound atmosphere which made the short story kind of memorable and an instant classic.<br><br>\"The Quiet Man\" and \"The Most Dangerous Game\" are the two most famous and modern classic, the reasons why both of these two short stories had become so great was the unbelievable and unbearable tension in both. Yet the movie of \"The Quiet Man\" was a loud, noisy, skin-deep shallow comedy without essence at all.<br><br>Victor McLaglen who played the Squire 'Red' Will Danaher, was definitely another wrong cast. In the story, the guy was a very tough, dark, stubborn, self-righteous, and dangerous, an egoist and willful strong minded tough guy. But the movie had transformed him into a half wit redneck-like thug. So with both important and memorable characters that made the short story so great had been molested into two shallow guys, Sean Thornton had become a loud mouth, always with an ironic sneering smile on his face guy, also a bit too old for the leading role. Squire 'Red', just a countryside rustic roughneck. Neither of them got something special.<br><br>Maureen O'Hara, who played Mary Kate Danaher, was the only cast that was kinda close to what portrayed in the short story. But in the messy shallow movie, totally ruined by the two wrong male characters, lousy directing and a deep drama-like great storyline messed up into a half farce, half comedy, only one of the cast was barely okay, would not turned this pathetic movie around into a much greater and more memorable one.","user":"LogicIsEverything","rank":[1,3]}]