[{"title":"Convincing performances by Perry and Fox prevent Alex Cross from being completely unwatchable.","rating":3,"date":"8 May 2015","review":"It's not hard to figure out what's wrong with this movie. Skeptics may think Tyler Perry was a bad choice to fill in a young Morgan Freeman's shoes but he was absolutely fine in the role. Plus, Matthew Fox as a psychopathic skinhead assassin? Hell yes. Edward Burns as Perry's detective partner? Eh, less convincing but I'll let it slide. The direction and the writing though... whew. It's amazing the actors were able to recite this dialogue with a straight face.<br><br>The story of Alex Cross is a simple murder mystery - Alex Cross and his partner investigate the scene of a crime and discover that they're after a professional killer referred to as Picasso. Then things get personal and Cross plans to seek his revenge once and for all. Standard crime thriller plot, right? The problem is when the characters start talking to each other. Honestly, it's laughable how bad some of this dialogue is, especially between Cross and his family. They throw in these \"emotional\" scenes to break up the action but all they do is make for a really awkward paced movie. It would be passable if the dialogue actually moved the plot forward but it doesn't, at all. There are some subplots that are introduced and never brought up again. Like Alex Cross becoming an FBI agent. What was the point of even including that?<br><br>The main reason to watch this movie is for Matthew Fox. He's playing a sadist who is \"fascinated by pain.\" Not very original but who cares, it's Matthew Fox playing a 130 pound untamable psychopath. The scenes in which we see him doing his job - stalking his targets, infiltrating their houses, taking out their body guards and whatnot - are the most interesting parts of the movie. He's really the only character given a clear cut motive and enough development to make him a decent antagonist. He's also batsh*t crazy, did I mention that? Yeah, he's a lot of fun to watch.<br><br>Unfortunately Perry isn't given nearly as much to work with. He's a generic detective masquerading under the name Alex Cross who acts as a poor man's Sherlock Holmes. His whole objective is to get into the mind of this madman while trying to maintain a steady family life, but instead of building tension between these two factors and having them play off one another and ultimately effecting Cross' personal life, the writer/director think it's more effective to jump from one setting to another with no lead-ins or relevance to what just happened or what is about to happen. The family scenes are cringeworthy, and even the dialogue with his partner gets really cheesy. I wanted to see more psychological warfare between Cross and Picasso. They try to do that in a couple scenes but it's so poorly written that you don't believe a word of it.<br><br>Tyler Perry's acting shines in a few scenes. He's certainly a capable dramatic actor and anyone who says otherwise is talking out of their ass. Thankfully I haven't seen the Madea movies so I had no prior opinion of Perry but he won me over with this. Mind you, some of his lines sound forced and awkward but that's completely on the scriptwriters. It's just impossible to be drawn to the character, and you'd think with a title like Alex Cross that we'd get a deep look into the mind of the title character, but instead they spoon-feed us this cheesy soapy dialogue and the occasional battle-of-wits with the villain that isn't the least bit intriguing. Also, the climax of this movie, if you can even call it that, is laughable. The fight scene is probably the worst camera work I have seen in an action movie. You can hardly see what's going on half the time, and once it ends you're just like, okay. Is that it?<br><br>Again, the leads save this movie from being a total bomb. I was admittedly entertained for a good portion of the movie despite its stupid dialogue. None of it is inventive or new; it's just your run-of-the-mill murder mystery that is low on thrills and high on cheese. Worth a one time watch if it's on TV or something, but really the main thing you'll remember from Alex Cross is the criminally wasted talent.","user":"lnvicta","rank":[88,95]},{"title":"Alex Cross fails miserably","rating":2,"date":"26 October 2012","review":"Finally, a Tyler Perry movie that is actually funny. For those who don't know, however, Alex Cross is not meant to be a comedy. It's supposed to be a serious action/drama. With all of its cheesy moments, corny dialog, and doubtful plot points, Alex Cross misses entirely.<br><br>Alex Cross stars Tyler Perry as an expert detective who is about to embark on his most difficult case. The case is to track down a deranged psycho-killer played by Matthew Fox. Matthew Fox enjoys torturing people to death and playing mind games with the detectives that are on his trail. I would like to say more about the plot of this movie but sadly, there isn't much more to tell. It's that basic. You'd think a plot where a genius detective is facing an intelligent serial killer would have more complexity, but it doesn't.<br><br>There are a lot of problems with Alex Cross. For starters, the script may as well have been written by a thirteen year old. This is probably one of the worst scripts of the year. In order to buy this script, you just have to believe everything the characters say with no explanation. The character Alex Cross never proves that he's smart. The audience is just supposed to believe he's smart because other characters say so. Cross just throws out theories without backing them up and of course, they turn out to be right. For example, when Cross and his partner (Edward Burns) walk into the first handful of murders committed by Matthew Fox, Burns guesses that this must have been the work of multiple guys. Cross replies, \"Nope. This was one guy.\" Does he bother to explain why he feels that way? Nope. In another example, Fox is on a train and Burns comes up to Cross and says, \"You need to get in his head and think like him. If you were him, where would you be?\" Cross thinks and then exclaims, \"He's on a train!\" Care to enlighten us on how you arrived to that realization Dr. Cross? The problem is, the writers clearly aren't smart enough to come up with ways for their characters to solve the case. Because this movie is so poorly written, it is unbelievably predictable. I'm no Alex Cross, but I knew exactly what was going to happen throughout the film. Literally, every scene can be predetermined by a first time viewer.<br><br>Not only is there terrible writing, but there was also terrible directing. Matthew Fox and Edward Burns are both very good actors, but they can't do anything under poor direction. Everyone in this movie is horrendous except for one person and that's Tyler Perry. I found this very surprising because I can't stand Tyler Perry's work and I thought he would be the worst thing about the movie. However, he is the only thing that can be considered somewhat decent in the movie. You can tell Perry wants to branch out but unfortunately, he can only do the best with what he was given. There were so many bad decisions made by the director. For emotion, he tries to add some family value by adding in an old sassy black woman as character. Thankfully, this character was not played by Tyler Perry. Another terrible idea was to have the camera constantly shaking because that's an action movie cliché that everyone loves (sarcasm). The camera was shaking during the most still moments. For example, the camera was shaking ferociously when, I kid you not, a woman was typing on her computer. Perhaps one of the worst decisions from the director though, was to throw in a twist at the end. Not only did he add a twist, but he made it glaringly obvious.<br><br>The only reason anyone might find Alex Cross appealing is because they get a kick out of watching bad movies or they really might enjoy seeing Tyler Perry try and do something different. Other than that, there is absolutely no reason to see this film. The acting is horrific, the dialog is idiotic, the action sequences are poorly choreographed, and the plot is 100% predictable. This movie is so bad, that you will find yourself laughing at moments when you're supposed to be either gasping or crying. D","user":"cummingsjosh7","rank":[101,143]},{"title":"A darker Cross let down by its opening and closing action sequences","rating":7,"date":"16 January 2014","review":"I'm a big fan of the 'Alex Cross' series of books. I feel they've weakened a little in recent years, but was still glad to hear they were rebooting the movie series. The most exciting part of the books for me was always the villains, The Wolf, The Mastermind, Casanova etc. and how Cross would be effected by them and ultimately track them down and confront them. This was key to the quality of each individual book to me and I felt the first two movies 'Kiss the Girls' and 'Along Came a Spider' were a real let down in this regard.<br><br>So I was glad to my find myself captivated by Matthew Fox's portrayal of Picasso. His opening scene demands your attention and his screen presence never lets up from that point on. The other thing I was always going to be interested in was how Tyler Perry went at portraying Cross. For me Morgan Freeman has always just been Cross. When I'm reading one of the books I can't help but picture him. He brought a calm serenity to the role that helped define Cross for me and I felt Perry had this as well, at least for the first half of the film.<br><br>The film really shows us two sides of Cross. At around the halfway stage, Cross's pregnant wife is shot dead by Picasso himself. This enrages Cross and sends him rogue along with his partner Thomas Kane who also has had his lover murdered by Picasso. From this point on we see a darker Cross, willing to use any means necessary to enact revenge upon his wife's killer. Perry's performance gets even better from this stage on. He nails the intensity needed to bring the audience in on the pain and drive he's feeling to achieve his ultimate goal.<br><br>The problems lie in the writing for the most part. The opening and closing action sequences just don't have any imagination. The car crash that sets up the closing one is also bizarre. Are we just supposed to believe this was a complete coincidence? Or has Cross displayed superhuman timing to achieve this, risking his friends life in the process? Incredibly lazy writing shown at that point.<br><br>It's far from perfect. The actress cast as Nana Mama was done so poorly. She had none of the charm that the character in the books has. She just came across as mean. The twist right at the end is one of the most foreseeable I can ever remember. One scene, from a big name actor, that added absolutely nothing to the story at the time = has to be a twist that he was in on it. More lazy writing.<br><br>But for all its faults its a very watchable movie. Perry and Fox are excellent and the story is entertaining, if flawed. I certainly have no objections to more additions being added to the series.","user":"jtindahouse","rank":[6,6]}]