[{"title":"It's alright.","rating":6,"date":"10 November 2014","review":"I am more of a British comedy fan than American, but even tho this movie has a 4, it is amusing enough if you want an airy story on a Wednesday night. It's not a big masterpiece, but for some weird reason I still enjoyed watching it. Even tho it's storyline if far beyond bad. During the movie I sometimes grew big big question marks above my head, since some scenes are too ridiculous to watch. But some of the jokes in it were actually really funny and made me laugh. I love vampire movies, even bad ones, and that is a big part of why I still recommend it to some people. Or maybe it is because it has a big what the f... factor in it. It is a bit like Sharknado: it is so weird and ridiculous that you have to watch it.","user":"the-awesome-von-grimm","rank":[8,8]},{"title":"A fair review...","rating":6,"date":"24 March 2014","review":"*Very Minimal Spoilers, i put it mostly cause i am not sure if it can be considered spoilers really, better prevent than being sorry* Its kinda surprising this movie only got 3 reviews considering i saw it in the video store of my local village in the Eastern township of Quebec.<br><br>Honestly i was expecting something somewhat middly funny with some teen romance but that could also make me feel for the characters. Honestly i was half satisfy in that department. Let me explain. This movie enter the category of Never Cry Werewolf, My Babysitter's a Vampire, Suck and even Decoy which use aliens, all of those funny light hearted vampire/werewolves movies. Even maybe Fright Night which is a bit more adult based, especially the remake. Its not to be taken seriously, its teen stuff, you usually get yourself in the place of the characters and think \"how cool would it be if that was me\" lol.<br><br>The thing is, this movie failed a bit to relate me over the characters. The fat dude ain't that funny or cool, the \"boyfriend\" dude ain't really a boyfriend and more or less a childhood friend with a very minimally developed relation in the movie. You never really feel for this guy. The prof vampire, i couldn't even really feel for him either as he seem to show regret killing sometimes but you see him kill and pretty much he don't care really about the guy that he killed. Or he make bad jokes about siring(and now having to kill her) the daughter of his former love that he tough he killed...<br><br>All the relations in the movie seem to be somewhat badly developed and the laughs are kinda minimal. Yet somehow i still kinda liked the movie and was not bored or anything... i would say it was borderline. The chick playing Chris was interesting and she was to my opinion the best character of the movie. The Sorority girls where also hot, and somewhat i kinda liked the movie... so i would say honestly its OK, don't expect to be impress but it ain't trash either. The fact that it don't take itself seriously at all really help giving it the free pass...","user":"destroyerwod","rank":[12,13]},{"title":"Don't expect much, but you'll probably get a bit more","rating":6,"date":"5 April 2014","review":"It's a perfectly fine movie. I hate when people critic movies so harshly for no reason at all. I went to the 'Forrest Gump' IMDb and saw the pompous things people wrote about it, and I just can't imagine why you need to be cynical SO MUCH that you are mean about light-hearted movies like Forrest and obviously silly movies like Vamp U. I just don't understand what people are looking for out of a movie with a college girl's boobs as the film cover.<br><br>If you are expect nothing, then you'll pleasantly find it's actually got pretty solid comedy, especially if you don't mistake the purposeful awkwardness as bad acting. If you are sick of browsing Netflix for two hours only to end up watching ANOTHER documentary about lions or history, just watch this.","user":"stephyoggi","rank":[11,12]}]