[{"title":"A rare example of an important movie that people need to see.","rating":10,"date":"30 November 2012","review":"Human trafficking is such an antiseptic term. It intellectualizes and softens something that is absolutely horrific. It's the type of term that lives in the world of academia and statistics. There's no emotional impact, no default outrage, no real teeth to it. I prefer to call it what it is, slavery. At this moment it is estimated that up to 4 million people internationally and up to 50,000 people domestically are held by human trafficking rings.<br><br>To put a finer point on it there are, at this moment, 50,000 people owned as slaves in the United States. Not historically, not descendants of freed slaves, but actual living breathing human beings living as slaves right now. This is not just a forced labor situation either; we are talking about forced prostitution.<br><br>Some are sold by their parents, some are recruited into domestic service jobs only to find out when they are in another country with no ability to leave what the job really is, and other are taken right off the streets in the US and forced into it.<br><br>A majority are women and almost all are under 18.<br><br>These numbers are jarring, alarming, and disgusting and nowhere near enough people are aware of them.<br><br>Eden is the true story of Chong Kim, a Korean American woman who, at the age of 19, went to a bar with a fake ID, had a drink with a very nice fireman who offered her a ride home. He pulled over to make a phone call and by the time she realized that something was wrong it was too late. She woke up in the trunk of a car and began a harrowing two year long nightmare of isolation, forced prostitution, and every type of abuse and degradation you can imagine. This is not an easy or comfortable film to watch, but it is about something so very important that I believe it needs to be seen. Much like Damian Harris's \"Gardens of the Night,\" which follows the younger spectrum of this abhorrent practice, it sheds light on a world so blackly dark and hidden from view that most people don't know that it exists.<br><br>Unlike \"Gardens,\" which shows a world so vile and reprehensible that it exists entirely behind the curtains and closed doors, \"Eden,\" shows a normalized and, in some ways, accepted trade. It's in the shadows, yes, but it is still in the light. The people who trade in it are somewhat open about it. There are parties with men in suits, fraternity parties, and underground S&amp;M clubs where this type of traffic is a normal part of business. It's an entirely corrupt world where even the law cannot be trusted.<br><br>Director Megan Griffiths does an outstanding job of finding the small pieces of humanity in a dehumanized world and contrasts them with the inherent brutality of the situation. Her direction is unflinching but not exploitative, honest but never preachy, and powerful without being manipulative.<br><br>The performances are phenomenal across the board but the film is moored by two standouts. Jamie Chung creates a heartbreakingly real woman whose sweetness and innocence are stripped away. Matt O'Leary gives an amazingly nuanced performance as Eden's crack smoking handler. He is hateful and repellent, but is also very real.<br><br>This is a rare film in that it has changed the way I look at certain things. You hear terms like \"human trafficking,\" and \"forced prostitution,\" and are justifiably horrified, but they are just abstract concepts. Seeing the reality of women forced to live in dark storage lockers, four to a room on bunk beds, and knowing that it is happening now, in my country both horrified and sickened me. Suddenly, these concepts were no longer concepts, but living breathing facts.<br><br>In a world where millionaire athletes and musicians throw the world slave around it is fairly sobering to have the reality of it shown so plainly.<br><br>I rarely use the term \"important,\" to describe films as even the most \"important\" films rarely are. Usually it really means \"self important.\" This film however deals with an issue most of us would rather pretend doesn't exist, but that is far more important than can be expressed.<br><br>\"Eden\" shows evil in its truest form. The evil that allows people to profit from suffering, the evil that exists when good people don't stand up for what is decent, the evil that exists in a world where girls (and let's be clear they are GIRLS) can be treated as disposable property.<br><br>Related Films:<br><br>Very Young Girls- Documentary about teenage girls forced into prostitution.<br><br>Gardens of the Nigh- Fiction film about a girl kidnapped into the world of child sex trade.<br><br>More at www.thefilmthugs.com","user":"DirkesDiggler","rank":[73,82]},{"title":"Disturbing subject, excellent movie","rating":8,"date":"25 October 2012","review":"It's difficult to say you enjoyed a movie about human slavery, especially the sex trade industry which does exist. To think that people like this walk the streets in our communities is disturbing and very troubling, but sticking our collective heads in the sand and pretending it doesn't happen or won't happen is being unrealistic. This movie is based on a true story, one girls journey into a living hell. The movie has all the elements of a top notch production including suburb acting, direction, and story development. This movie is not what most would call entertainment, but the story is compelling and needs to be told, and this cast of characters does a truly remarkable job in delivering a riveting, emotionally draining story of depravity and human survival. While this movie is not overly sexually graphic, it delivers the message loud and clear. Bravo to the entire production staff for making a movie that will leave you thinking about this one for a long time to come.","user":"dgefroh","rank":[37,42]},{"title":"Incredible movie that sticks with you","rating":10,"date":"6 August 2012","review":"Saw this movie at SIFF and STILL can't stop thinking about it. Script, direction, acting, and cinematography are all impeccable. The three leads are perfectly cast. Matt is desperate, hardened, and yet strangely likable. Jamie does a fantastic job as well in a role that requires serious vulnerability and emotional depth. Megan Griffith's directing is superb and the style and tone of the overall film is spot on. I was on the edge of my seat the entire time because the story is so captivating and hard to believe. I'm dying for this film to hit theaters, because it is so incredibly well done. I want to read the memoir it's based off of after seeing the lengths this girl went to to escape from captivity. Thank you for tackling this story and subject matter!","user":"jennabrett","rank":[45,54]}]