[{"title":"I enjoyed this movie","rating":6,"date":"23 February 2020","review":"The early 90s version of an action movie - non stop gunfire and fights. One very good reason to watch this series is that any movie after this seems to be excellent. The only saving grace are some really old wisecracks from Jason Statham. Skip it, if you need to.","user":"MR_Heraclius","rank":[38,39]},{"title":"Exactly what I wanted from the first film - The Avengers of action movies.","rating":8,"date":"13 August 2012","review":"While on a mission one of the \"Expendables\" gets himself killed, this leads the crew to go on a mission of revenge. But is it too much to handle? <br><br>I was severely disappointed in the first Expendable film, the mediocre action, the use of CGI blood and the unimpressive villain ruined the experience. So I was hoping that the second time around they would correct these issues. I can safely say, they did and they did it in spades. The big change is Stallone is no longer behind the camera, so he is more focused on his role of Barney and his mind isn't split between two separate places. The biggest change though is the tone, The Expendables 2 does not take itself seriously at all and neither did I, so I had a blast watching what is ultimately a parody of the action genre. <br><br>I can look past the acting, lack of story and plot because the film doesn't try to give you one. It's a simple film with a simple purpose. Get as many of these big guys into one film, make it a guys flick with lots of action and killing and they succeeded. The biggest misstep this film has is the motivation behind the revenge. The wrong person dies. A character is killed off that we have almost zero emotional connection with, it would have made more sense if it were another character that disappears early on in the film. It seems this character's sole purpose was to have these characters get their revenge on, which makes it less engaging for the viewer.<br><br>I was surprised at how underwhelmed I was by the action in the first film, here it is more stylized and fun. The film steps on the gas from the very beginning and almost never lets up. We are thrown into this action sequence at the start, which is better than anything the original had to offer. A more competent action director is behind the lens this time, Simon West who gave us Con Air and the more recent Mechanic. He understands what is needed and delivers some wild action sequences. <br><br>As I mentioned before, the film does not take itself seriously and it has a very tongue and cheek demeanour about it. It's not afraid to wink at the camera, specifically when Chuck Norris enters the screen and steals the show with the funniest line in the entire film. The film is full of one liners you would expect from an action film. During a fight, one characters exclaims, \"Let's wrap this up\" he then proceeds to take a chain and wrap it around another character's neck to choke him out. Another scene we have a bad guy get shot a dozen times by everyone and Stallone retorts, \"Rest in pieces\". Finally, my favourite, Stallone says \"heads up\" then proceeds to throw a head to some people. Yes, this movie is violent, so no fear about the PG-13 rating.<br><br>So what about the guys? Well, they all come back, some have a lot more to do than others. Lundgren is basically the comedic relief. Crews and Courture again get short shifted and feel like background characters. Schwarzenegger, Willis and Norris all have more in depth cameos and finally Van Damme shines as the villain. Van Damme really deserved more screen time. We are introduced to him, then we cut back every so often as he tries to steal his plutonium, then we have him fight at the end. He deserved more screen time, so did his right hand man, Scott Adkins. Both are more martial arts type fighters than big gun shooters and since this is a Stallone film, this is a big gun shooting movie. They get their fight sequences, but both of them I thought could have been a bit longer. Especially the Van Damme/Stallone fight.<br><br>So in the end, The Expendables did exactly what the first film should have done. It's a hilarious parody of the action genre and has non-stop excitement from start to finish. This is finally the film from these guys that I've been waiting for.","user":"Matt_Layden","rank":[236,338]},{"title":"Better than the first by a mile","rating":8,"date":"6 August 2012","review":"First off, yes, much better than the first.... thank god, more locations, funnier and better put together.<br><br>No time from opening credits, its straight into the action, which is more epic imo, and is what should have been seen in the first film but maybe due to a low budget we were subjected to a lesser affair The team work well, all of them and Hemsworth does really well as the new boy on the block and second time round and you kind of know these guys. Arnie, bruce are seen more but are not seen as much as the usual gang, and li is seen the least.<br><br>Norris is great, seen here and there, great entrance and more of a cameo, and van damme makes good his role as the villain.<br><br>The story pretty much straight forward, better than the first, but nothing special, some dialogue was hard to hear, and sly does try to be serious in some scenes which got a laugh and I don't think its how it was intended but its not that much of a big deal really as there are funny moments in the film, more so than the first film.<br><br>Fight scenes were better this time round, not too prolonged, timed well, and the one on ones didn't drag on too long. Sly &amp; van damme's fight could have been a bit longer but I guess after all the chaos leading up to that point it was sufficient enough without getting too silly, reminded me of a Rocky fight here and there....he he One liners were good, dolph was great, the girl is good also, be good to see her in exp3, locations and sets fab, cgi was not obvious and edited well.<br><br>One thing I will say is sly does have issues coming across as funny and I don't know why. He's funny in real life and was funny in rocky but its hit and miss and it shows here in some scenes.<br><br>Its not 10/10 in my book. Maybe when i see it again it may be better in my mind, but like i say a better story would of helped If there is a 3rd, I would like to see more of a story if that is at all possible, see what you think guys when its out, but it's a big improvement on the first and that's a good sign","user":"tonystalloney","rank":[218,345]}]