[{"title":"Keeping Resident Evil's tradition of excellent graphic and poor storytelling alive.","rating":6,"date":"7 January 2014","review":"Never heard of Resident Evil: Damnation before? Can't remember which movie it is since most Resident Evil movies have one spectacular word in the title but ultimately fails to deliver? Worry not, Resident Evil: Damnation is a 3D animation Blu-Ray/DVD spin-off which didn't air in cinema, so at least you won't regret paying for ticket. Using full CGI, the movie has excellent visual and wicked action scenes, although the usual problem of campy one-liner and some plot issue linger like bad does of T-Virus.<br><br>Graphic is top-notch, it's on par with some of the best CG of this gen. Facial structure and body motion have been polished greatly, and props to Capcom for making hair look quite realistic. The shiniest part is how it cleverly manipulates the lighting, every light source has different ambiance. Tone of atmosphere looks differently under many shades, be it from moonlight, sunrise, tiny light from bullet holes or even simple flashlight. Shadow dances about delicately, making the contrast of light and dark even more featured.<br><br>Monsters are eerie down to its gruesome details, especially noted in occasional switch to first person view. While there are not many kinds, the movie highlighted its monsters with dynamic speedy movement and imposing physique. The movie succeeds in capturing the intense essence of older Resident Evil games, while not as consistently as it could've been, it's certainly better than what its predecessors had to offer. Action is swift and neatly done, some are melee hand to hand combat, and silly it may be, Ada Wong fighting against female president is quite the spectacle.<br><br>At latter part, the action intensifies with remarkable pace. There are not many sequences that can rival the movie in its climatic moment, even amongst today's adventure movie or game. However, these bits are rather short compared to the dull slow build up, its graphic is not without fault either. In some larger scale scenes, motion and details aren't as smooth as the rest. The constant slow-mo might get old and it becomes very apparent from the number of stuffs thrown, it caters to 3D viewing.<br><br>Story is expectedly confusing, despite the social and political back story it tries to present. It's a shame, since the plot could've been more solid if only there's more explanation than stupid quips. Resident Evil is infamous in its regurgitation of B-movie humor attempt, it thinks that it's clever, it's most definitely not. I find it hard to believe anyone would have the time to produce corny remarks when running from homicidal nightmarish creatures.<br><br>The bad dialogue also hurts characterization, even though the movie barely has any character development to speak of. In several scenes, it tries to draw some sort of emotion, but the ludicrous script contradicts the effort. This is not some self-deprecating jokes that can be funny, it is just bad. Story severely needs more clarity, things just sort of happen, little to none explanation is given as it pushes more dramatic moments with frivolous lines.<br><br>Somber chirping tracks accompanies the movies; it's pretty good, obviously bringing more reminiscence and some tension. Dubbing is decent, there's a lip-sync awkwardness, but it is expected in multilingual film. Ending song is simply atrocious, bad marketing decision since the credit also serves as teaser for Resident Evil 6.<br><br>It's undeniably the film has some production value as quality of the visual and action are high. Capcom commendably elevates the graphic, but the use of flimsy screenplay and inane catchphrase should be things of the past. The franchise is trapped in the limbo of advancing technology and mundane writing. As it stands now, Resident Evil: Damnation is a decent DVD spin-off plagued with tiresome plot.<br><br>Rate 6/10","user":"quincytheodore","rank":[9,9]},{"title":"Good movie on its own","rating":7,"date":"19 October 2012","review":"I have not played any of the Resident Evil games, but am a fan of the movie series.<br><br>This movie apparently takes place in the game universe. I had purchased the first Resident Evil animation, but have not watched it in a while.<br><br>This movie stands quite well on its own. The plot is fairly straight forward. Mr cool guy spy had been ordered away from his vacation to check out a problem regarding prisoners of war in a war torn former soviet country. It turns out they were turned into BOWs (Bio Organic Weapons). These are basically humans that have been mutated by a weaponized virus into deadly creatures controlled by whoever has been infected with the master form of the virus.<br><br>The country is undergoing a revolution, and the rebels have resorted to using the BOWs against the army. Our hero tries to survive and fight until he can figure out who's controlling the BOWs, and discovers the rebels are not the only ones with BOWs, and there is in fact a much deadlier version right under his very nose.<br><br>Action packed all the way through. The animation is better than the first animated movie and the story and acting are great. I enjoyed every minute of it, and I think animation, horror and/or zombie fans will enjoy it too.","user":"mergatroid-1","rank":[16,18]},{"title":"Fun to watch","rating":7,"date":"18 September 2012","review":"Of note, this is a movie. It will not scare the pants off of you like the games can. Understanding that it is not the game makes the film easily enjoyable.<br><br>The CGI is VERY well done and the English voice acting leaves little if anything to be desired. The storyline is simple and recurring characters are portrayed faithfully. The fight scenes are choreographed very well.<br><br>Leon seems to have more quips in this film, but those are forgiven in the light of everything else. Thankfully, he is starting to show a bit of weariness in his plight. JD steals the show for a short bit without detracting from the mood of the film. Ada is ruthless and manipulative as ever. All in all, a fun ride.<br><br>You do not need to have seen Resident Evil: Degeneration to enjoy this film, though I would suggest you see it anyway as it is a great film in its own right.<br><br>For fans of the video games, there is a treat to be had that is not on the cover.<br><br>This film, as well as Degenerations, are considered to be canon whereas the travesty known as the live action films are not.","user":"hardandwaiting","rank":[78,104]}]