[{"title":"Fantastic!","rating":2,"date":"2 November 2012","review":"I was supposed to be be seeing either Flight or Argo today, but to my disappointment I missed both showtimes, and I was in a tight time frame where I could see anything. So my friend really convinced me to check this one out. Boy, what a great time it was.<br><br>Wreck-It Ralph is really wonderfully created. Its visual design is brilliant and its action pieces pretty amazing. The world it builds, and all of the little details from various video games, is pretty wonderful to look at and experience. Even some characters move in the precise way they actually do in video games. But what makes this gloriously colorful spectacle of a world work is the screenplay. The jokes hit all the right places, the characters are all lively and written with skill that goes beyond what we have come to expect from a simple kids' film like this. The few commercials and trailers I saw had been sure to let audiences know just how \"pretty\" this film looked, but what makes it a truly great film is that it has a great story and great dialogue to back up the visuals. The voice performances are pretty incredible, and perhaps because I recognized such people like Reily, Silverman, McBrayer, and Lynch, but even others did wonders with their characters. <br><br>Overall, the film follows a clear pattern and formula for kids, but the real surprise is that none of it made me roll my eyes or cringe. It's incredibly entertaining and enjoyable for anyone. Pretty much everything is done in a very respectable manner, and the film hits greatness in the writing, direction, voice performances, and visual design. The only real flaw in it that I gathered was the inclusion of a Rihanna song, which really took me out of the world the film created and kinda put a plaster on it from pop culture. Or maybe it's because I hate the song... Still, this is another truly great animated film that does stand out from others this year in its own way, and one that's admirable and satisfying in all the best ways. I loved it. Highly recommended.","user":"Red_Identity","rank":[239,260]},{"title":"A lot better than expected, and made for gamers","rating":9,"date":"3 November 2012","review":"Side note: The animated short Paper Man was very good. The animation was a unique blend of CGI but made to look like hand drawn animation. The only slight issue I had with it is that the short got crazy at the end and became unbelievable. Still cute.<br><br>Being a gamer, I decided to go to this movie. I knew the movie was going to be good, but I didn't expect it to be really good. The action, humor, voice-acting, plot, and animation are all great. Since this movie is aimed towards gamers, I feel like a lot of the cameos and jokes are going to fly over most people's heads, such as \"All your base are belong to us\" written on a subway wall or \"Leroy Jenkins was here\". Thankfully, the movie doesn't rely on cameos to be successful.<br><br>The animation in Wreck-It Ralph is very beautiful, and is great at expressing the video game world. I did not see it in 3D, but just from watching it in 2D I can tell that this movie would look amazing in 3D. The animators did really good in this movie because each video game world looks vastly different from another. Each world feels like an actual video game that I've played. If there is one problem that I can pick out in this movie (and many others have noted this as well) is that the plot focuses on the Sugar Rush world a bit too much. Most of the other worlds are revealed at the beginning mainly for the sake of reference, with only a few actually being important.<br><br>The humor in Wreck-It Ralph is good because it hits a very large audience. A lot of the cameos and jokes are related to video games but there are also a lot of movie references as well, puns, slapstick jokes, and some crude humor. Some people complained at the crude humor but honestly it didn't bother me because it was coming from a character who looks like she is five, so it actually made sense.<br><br>The interesting thing about Wreck-It Ralph's plot is that it has very little to do with an external conflict, but more with an internal one (which is a pun in itself because they are inside of video games). There is a main bad guy, and a huge disaster, and all of these other conflicts but these elements are back seat to the character development. I thought it was neat since most animated movies do the opposite. The voices for all of the characters were really well done. There weren't any annoying characters which adds to the movie. Another nice thing about the plot is that main bad guy is not revealed until the very end of the movie which focuses the plot on the characters, not the action or the villain.<br><br>Overall a really great movie. Spectacular animation, great voice work, emotional and even touching at times, and overall humorous. While the Sugar Rush world might get slightly stale after awhile, it is still excellent movie. Gamers, this goes to you, WATCH THIS MOVIE!","user":"FairlyAnonymous","rank":[126,138]},{"title":"Even better than I'd hoped","rating":10,"date":"2 November 2012","review":"Let me start by saying this: I am the ideal demographic for this movie. I am in my early/mid 30s, I grew up with videos games starting with the ColecoVision 30 years ago, which is, in the movie, when Wreck-It Ralph was released. I still play games. I have a four-year-old son who plays games. He knows who Pac-Man, Zangief and Sonic are, and you can bet that on top of that I know who Sheng Long, Tapper, Q*Bert and Burger Time are.<br><br>That's what makes me nervous about blanketly recommending this movie to everyone...not just that I'm obviously going to catch more references, in-jokes and cameos than the average movie goer, but that I'm going to recognize the archetypes they're playing off of and the mechanics they're referencing as the stories progresses.<br><br>It feels a bit like Mallrats, in that I'm so ideally in the target demographic for the movie's release that I'm not sure I can accurately gauge how it will be received by people outside of that demographic.<br><br>That said, I don't think you need to be a video game fan to enjoy this movie. It's a very well crafted movie with characters that are more Pixar than Disney. I was concerned that this was a \"Disney\" movie as I haven't seen a 3D CG \"Disney\" movie that can hold a candle to the Pixar and Dreamworks hits that I'm a huge fan of. And yet, for me, this movie was better than recent Pixar movies and better than Dreamworks movies, with characters and a story that felt worthy of of the Pixar name.<br><br>I even greatly enjoyed the animated short at the beginning. Again, something I would expect more from a Pixar film than a Disney film. The whole theater experience for this film was a delight, all the way through to the very, very brief bonus scene at the end of a credits, which is something you really, really need to be a gaming nerd to get. (Gamers who have seen The King of Kong: A Fistful of Quarters will definitely get it.) I went into this film with high hopes and expectations, and I was blown away. My wife, who is not a gamer at all, enjoyed the film, and when my four-year-old son was asked by her what his favorite part was, he replied, \"Um... Every part! I liked the whole movie!\" That he was able to talk to her and I in great detail about the plot and characters while I was able to appreciate the whole film to the level I did as an adult speaks volumes to me about how well this story was told.<br><br>If you played in arcades in the 1980s, if the games Q*Bert, Burgertime, Pac-Man, Street Fighter II and Sonic all mean something to you: You're enough of a gamer to appreciate all the references. If you have a youngster who's played video games, they're enough of a gamer to get the movie. And even if you aren't, while you may not relate to the subject matter the way I did, you're still in for an enjoyable story, with great characters, masterfully told.<br><br>Highly recommended, and a 10 out of 10 for me, as I expect this will be on both my son's and my short list of favorite movies for years to come.","user":"peteer01","rank":[193,216]}]