[{"title":"A Feel Good Movie!!","rating":8,"date":"15 January 2012","review":"I liked the movie a lot. I've always loved both Dolly Pardon and Queen Latifah. I don't know who thought to put those two together but for my money, it worked. Yes, Dolly has had a lot of work done. SO WHAT? She's a sweetheart and still feisty! The plot has some definite misses, it was predictable and cheesy at times, but it was fun! Yes it was a bit of a \"Sister Act 2\" combined with \"Footloose\" rip off but again I say: SO WHAT?? I enjoyed the movie. Is it going to win an academy award? Nope. But it was nice way to spend an afternoon. It had me dancing in my seat and left me feeling good. And that's exactly what I wanted it to do. We have a winner!!","user":"simplyjanise","rank":[41,51]},{"title":"Worth Seeing","rating":6,"date":"14 January 2012","review":"I originally had no interest in seeing it. The reviews were bad, the trailer looked just 'ok'. But a friend of mine wanted to see it and asked me to come along. Why not? <br><br>I'm glad I went. It was very enjoyable. It's not a masterpiece, but is a light hearted feel good movie featuring some very talented singers. Although the plot was relatively simple, it worked well and was easy to follow. The relationship with Queen Latifah's character and her family was touching and emotional. I found myself tapping my feet to the music and wiping away tears at the end.<br><br>So when I looked it up on IMDb and saw a 3.4, I was quite confused. I thought it would be in the 6,7 range. I don't understand.<br><br>If your looking for a fun enjoyable movie, see this. Ignore the rating and reviews. Guaranteed to leave with a smile on your face.","user":"bwayluver","rank":[42,54]},{"title":"Not nearly so bad as some of the reviews might lead you to believe","rating":8,"date":"15 January 2012","review":"Yes, the script was mighty thin in places and tried to tackle way too many subjects in too short a period of time (the poor economy, marriage struggles, death, teenage angst/rebellion, teenage love, etc., etc.), but despite its flaws this movie provided some fine musical entertainment, and pretty much delivered on its goal of being an uplifting movie-going experience.<br><br>I attended this movie with my senior citizen mom and my tween daughter, and all of us found some things to enjoy about this flick. There were some laughs, some moving plot points, some great musical numbers, and some fine performances, particularly on the part of the younger cast members. Some days you are just looking for some softball, \"feel good\" entertainment rather than a darker or more weighty film. This movie fits the bill if you're in the mood for some harmless, mostly mindless, fluffy entertainment.","user":"mrsluggy2001","rank":[27,35]}]