[{"title":"Predictable but entertaining","rating":7,"date":"2 August 2013","review":"'Trap for Cinderella' features Tuppence Middleton (most recently seen in the BBC's version of 'The Lady Vanishes') as Micky, a fun-loving party girl who is caught in an explosion at the South of France villa of her aunt Elinor (Frances de la Tour), of whom she happens to be heiress-presumptive. Suffering from amnesia (and having undergone reconstructive surgery) as a result of the accident, Micky discovers the diaries of her childhood friend 'Do' (Alexandra Roach, Channel Four's 'Utopia') and enters a sequence of flashbacks - and flashbacks-within-flashbacks - piecing together the events that led to the explosion and frequently unveiling her breasts. Watching with keen interest is Julia (Kerry Fox), Elinor's long-time PA.<br><br>Clever - or manipulative - editing of the trailer has made this seem like your bog-standard psycho-lesbo-revenge flick, but it isn't (although there is a touch of Sappho about it). Although written and directed by men, with all the main characters being female and only token presence from a couple of pretty-boys on the male side, it might appeal more to women than men, although if you're more interested in genre - psychological thriller - than gender that shouldn't matter. It's not the cleverest plot - without trying to I guessed most of the big reveals, which probably means most other people will too - and some plot points aren't adequately explained (eg: why Elinor made the decision she did about who gets her money, although it's pretty obvious from the preceding story). But it's entertaining enough, and the acting is agreeable, with Fox being a particular stand-out in her portrayal of scheming frustration. If I had been directing, I would have made more of the swimming pool bitch slap-down between Fox and Middleton, but then I was spoiled as a younger man by those Joan Collins/Linda Evans fights in 'Dynasty'...","user":"euroGary","rank":[35,47]},{"title":"Good low budget British movie - it deserves a wider audience - minor spoilers","rating":7,"date":"7 November 2013","review":"After being in a serious fire, and suffering facial burns, reconstructive surgery, and amnesia, a 20 year old girl, Micky, sets out to find out her real identity.<br><br>She discovers a diary that reveals a very close friendship bordering on lesbian love with another girl called Do.<br><br>Micky unravels a web of deceit. But is she the player or the one being played? The plot takes twists and turns and isn't always coherent. I found myself questioning many things that didn't make much sense.<br><br>Nevertheless, Trap for Cinderella is a good low budget British film. If you've been drawn to this movie because of the lesbian love aspect (due to the trailer), then you may be disappointed. The lesbianism is suggested, rather than being all out there. And it is all one sided.<br><br>7/10.","user":"spotlightne","rank":[11,17]},{"title":"Despite the Critics, I Thought it was a More-Than-Adequate Adaption","rating":8,"date":"4 March 2014","review":"After reading previous reviews, I can only assume that most people have not actually read the book, \"Piege pour Cendrillion.\" For most of the reviews complain about the ridiculous plot, which is not the fault of the producer, but the author of the original book. I do admit, this plot is not at all realistic. But first: realize the book this film was based on was FICTION. Fiction is not supposed to be or held to be realistic. Second: realize that if one wanted to make an adaption of the BOOK, they would not be able to greatly deviate from the novel's plot, considering they would have had to obtain the author's consent. <br><br>So if you did not like the plot, do not blame the screenwriters or the actors; blame the author of \"Piege pour Cendrillon.\" Yet I have a feeling most people have not actually read the novel, therefore, you have no place to comment, considering this is an ADAPTION OF THE NOVEL.<br><br>I thought the actors, directors, and producers gave a great performance based off of what they were given. Cheers to all involved in this movie.","user":"liveandlove-ak","rank":[25,49]}]