[{"title":"Not great at all","rating":4,"date":"13 July 2012","review":"*WARNING!! MAY CONTAIN SPOILERS* I just couldn't buy into this film at all. I really wanted to enjoy it because I like Adam Scott and I'm one of Chris O'Dowd's biggest fans. However, the script is weak and it all ends rather suddenly. I knew where it was going after about 20 minutes and I wasn't wrong.<br><br>Despite liking Adam Scott as an actor, I really didn't like his character. There was something about him which made me want to punch him in the face. Jennifer Westfeldt is average in it and I had no urge at any point to punch her. The comedic talents of Chris O'Dowd are wasted which is a shame because he could have brought a lot more to the film. The same goes for Kristen Wiig; we never get to see her at her hilarious best. Megan Fox is beautiful as ever but rather irritating.<br><br>The plot is thin and just lacked realism. It was also far too predictable and I spent most of the time guessing (usually correctly) what was about to happen.<br><br>All in all, this film is poor but it could have been so much better if the actors had been put to better use.","user":"pij_ruleroftheworld","rank":[23,28]},{"title":"Decent attempt but falls short","rating":7,"date":"5 October 2012","review":"There isn't a plot really, the story is really predictable, even though it's different. But in fact, I did not really lose interest and rather felt my time passed by pretty well. The supporting stuff have given some wonderful performances, Edward Burns as the perfect man/potential-husband, and Megan Fox as the perfect girlfriend. But the lead pair could have done better. <br><br>One thing that is horrible about the movie is the ending. One of the most horrible endings there could have been, the director tries to be unconventional but fails miserably. MISERABLY. If only the scene went differently I would actually be recommending this movie to those tired of old stuff.","user":"pranay-mehrotra23","rank":[17,20]},{"title":"bad writing","rating":3,"date":"17 August 2012","review":"the actors were fine, but as the featured reviewer pointed out the story was just bad, didn't anyone tell Jennifer Westfeldt that no one cares about spoiled over privileged Manhattanites anymore, just arrogant idiots who think they are the reason why the world turns and that everyone looks up to them. the two main characters were so badly developed that there was no connection between them and the audience, basically a spoiled guy, who has a nice job and rich parents, who is friends with a spoiled girl, who decide rather spontaneously to have a baby together yet still date other people. when the (surprise) relationship doesn't work out the way that they expect, then the two separate and try to find happiness on their own terms, but alas discover that they can't live without each other so in the end they reunite as a traditional husband and wife couple. When a romantic comedy ends with the actresses last line being \"I want you to fu*k the sh*t out of me\" well, you know what kind of conclusion to make. I really can't be bothered to write a better review because the film just doesn't merit any more of my time to be wasted thinking about this trite filth.","user":"ramblr78","rank":[15,18]}]