[{"title":"I'm a sucker for movies that start with a character about to jump off a rooftop","rating":28,"date":"28 December 2013","review":"If you're like me, the phrase \"coming of age story\" is about as exciting as the phrase \"nature documentary about corn\". That said, this coming of age story ranks among the best I've seen and kept me interested from start to finish.<br><br>At its heart is the familiar story of a teenage loner who's much too wise for his own good, living in NYC and simultaneously battling a dysfunctional family and the malaise of life. The book \"Catcher in the Rye\" comes to mind as do the films \"The Squid and the Whale\", \"Igby Goes Down\" and \"City Island\" (yeah for someone who doesn't like coming of age stories, I sure manage to see a lot of them). All follow the same basic structure: we observe a few days in the life of a troubled teen, seeing different vignettes that are not necessarily related to each other but give us insight into the character's isolation from family &amp; society.<br><br>What sets this apart from the others is the masterfully suspenseful way it's told. That is, even though there is no traditional plot line, the film leads us on with anticipation of events to come. How is this done? Well, for one it starts with a scene of the boy standing on a rooftop ledge preparing to jump to his death. How's that for a hook? It keeps us guessing throughout with references to \"what happened in DC\" - an episode which is not explained until near the end of the film. Dramatic lighting &amp; cinematography also augment the tension in a subtle way. In this way, the film presents a gnawing mystery which should keep you interested despite the lack of traditional action.<br><br>Two other things kept my interest going, the first is the playful sense of humor (seeing the absurdity of peoples' actions contrasted with the calm exasperation of the main character--sorta like you'd find in an 80s John Cusack comedy). The second is the acting of the main character himself. The 17-year-old hero James (played by actor Toby Regbo) is a very colorful character. Though his emotions are muted and his interactions with other characters are equally suppressed, we still manage to get close to him somehow. Perhaps it's because of his expressive face even when he's not expressing emotions. Maybe it's just his body language. Or maybe it's the way he connects with his little dog. For whatever reason, I felt instantly connected with him even though my own life has nothing in common with his.<br><br>Great supporting performances by every other character, most of whom play comedic oddballs or such extreme caricatures that you can't help but laugh at their every expression. The father (Peter Gallagher) had me laughing, and Aubrey Plaza (though a very small role) had me in stitches with her signature weirdness.<br><br>If you like slightly satirical films about real life, and if you don't require car chases, shootouts and sex scenes, then this is a good one. I would also add if you like films set in NYC this has some great scenery and nostalgic locations. Even if you aren't thrilled at coming of age stories, this one is worth your time, as are the others I've mentioned. \"Someday This Pain\" bears a slight resemblance to my favorite coming of age flick \"Archie's Final Project\" about a troubled teen who wants to film his suicide for a high school film class.<br><br>Now if someone could just make a nature documentary on corn so interesting, my life will be complete.","user":"rooprect","rank":[12,14]},{"title":"Review of Someday this Pain Will Be Useful To You","rating":10,"date":"27 September 2012","review":"This film was fantastic. I have almost nothing in common with the main character, but I somehow managed to connect with him in multiple ways. He embodies the tortured teen spirit that comes inevitably with an unstable home environment, and his confusion is expertly depicted through the film's witty dialogue and realistic nature. I also thoroughly enjoyed Aubrey Plaza's character; she was charming as usual and played the part very well. The cast was very well chosen and had great chemistry - each individual actor is clearly talented but when put together they are a force. I have only good things to say about this movie!","user":"davidgreen9787","rank":[15,22]},{"title":"Wonderfully, deep and feeling!","rating":9,"date":"16 July 2012","review":"This movie was one of those that managed to get really really close to me, and sometimes it even touched me deep. But that may be just all because I feel personally so connected I can relate nearly identical to the main actor's character thoughts, doubts, emotions and soul, except for the two facts I am twice as old and, unlike him, know what love feels like. Damn, the are so many scenes, dialoge I would myself already have put into a book which I never wrote because im so lazy and forgetful - to watch the movie made me feel so good, and happy to see there are now and then some inspired and talented filmmakers and actors out there who can shine. Love this flick. 9 out of 10 my rating *********","user":"Jack-Knife","rank":[20,31]}]