[{"title":"Stranger in a strange land","rating":28,"date":"28 January 2012","review":"A sequel with only a tenth of the budget of its predecessor obviously doesn't stand a chance in the comparison. Instead of Burt Reynolds as a king facing an army of 1000 Orcs in leather armour, you get some unknown young man as a king with an army of 20 extras in black cotton. The fortress looks like anyone could destroy it on a Monday morning. The dragon shows some professional CGI effects, one rare point that exceeds the expectations. Nevertheless, if you decide to do a fantasy movie when you are forced to make many restrictions, either the story and characters must save the day (like in 'Warrior Angels'), or you make uncompromising, hilarious trash (such as 'Barbarian Queen'). In \"Two Worlds\", neither of these two possibilities is accomplished, it must be said.<br><br>Movies where fantasy heroes are traveling to the modern age (from 'Beastmaster 2' to 'Masters of the Universe') are usually cheesy. They fortunately tried the other way around here and moved a modern day hero to the distant past: Dolph Lundgren. As Granger the Stranger, he has unusual things to worry about, like drinking water probably full of bacteria, and he certainly has no respect for kings and witches. Natassia Malthe gets the funniest part, which must have been a nice change for her after the Bloodrayne stuff: she is a doctor trying to find out more about the medicine of the future. The story is well paced, so the 90 minutes passed quickly, but I was left with a feeling that I didn't quite get what I expected.","user":"unbrokenmetal","rank":[12,12]},{"title":"Disappointing...","rating":3,"date":"12 December 2011","review":"Hard to say who mucked this one up. I expected more of Uwe Boll after his brilliant work on \"Dafur\". It feels like Dolph's character (Granger) never really settles in the \"other world\" he has been taken to. Maybe its because he keeps wearing his Army jacket... But while he keeps being an outsider, you don't get \"sucked\" into the movie. The whole plot is awfully slow, nothing really happened halfway through the movie. The action is unsatisfying, it seems the side-cast is just practicing. The \"Castle\" looks completely artificial and so does the Kings Crown. (its one of those 5 bucks Made in China crowns you'll buy for your kids to play)<br><br>I am disappointed to say the least. <br><br>My advice: skip this one.","user":"CC_Nemesis","rank":[27,32]},{"title":"Not worth the time","rating":1,"date":"14 December 2011","review":"It amazes me that people are still giving this guy money to make movies. He has yet again demonstrated that he should never ever ever make another movie again. The story was probably one of the worst ideas he has had yet. After the last movie with a great cast being, yet another, total let down I didn't have high expectations on this one. Even with the extremely low expectations I had going in to this one it was worse than I could possibly imagine. The acting was mediocre, and the overall plot was not interesting at all. I was ashamed that Dolf even took the part in this movie. <br><br>Save your money and don't bother with this.","user":"spaarky1978","rank":[53,69]}]