[{"title":"Worst movie ever made!","rating":1,"date":"9 June 2014","review":"Right from the start you can tell that this is going to be, at least, a bad movie with awful acting. But then it just kept getting worse and worse. The characters were not acting like normal people. Normal people would have made completely different decisions. It's completely found footage. Which I wouldn't have minded. I actually still like those types of movies, so as you can tell, my standards are pretty low as it is, and this movie was just AWFUL. From the writing to the acting to the directing, all the way around, AWFUL! I wouldn't even recommend watching this movie if you were bored. You're better off taking a nap, or picking another movie... ANY movie, as long as it's not this one.","user":"wksk","rank":[10,15]},{"title":"Found footage film ''House Swap''... crazy stalker terrorizes young couple :P","rating":2,"date":"13 June 2014","review":"The guy above who gave this movie the highest regard is obviously just jerking your chain. This movie really is terrible. It is so bad that I am making my first IMDb review post just to ensure you know it. From the absolutely unoriginal plot to the absolutely irrational choices the characters make it is poorly planned. And not just irrational in the excusable sense-- like \"they are scared so they might do something stupid like that\", but irrational in the sense any person with half a brain or better would come up with a better idea than the leads do. The acting is not the worst I have seen... it is mediocre, but not terrible, and that is probably the only thing that keeps me from calling it one of the worst movies ever, but the scriptwriter and director must be absolute morons to not see the holes they have created. I will admit that, to me, found footage is a cheap gimmick used in the vast majority of cases to get away with making garbage, and it has got to the point now where it is mostly just really dragging the horror genre down, but this, even among found footage films, is one of the poor examples of the bunch.","user":"sstetsko","rank":[9,14]},{"title":"From bad to worst","rating":3,"date":"10 April 2015","review":"Alright, before I get into the review, let me just say this: I have seen tons of horror movies, from the lesser known low budget ones to the extremely well made ones with known actors and I still find a way to enjoy most of them. <br><br>With that said, I simply do not understand how someone could give this movie a good rating.<br><br>OK, let's start with what's good (or not bad) The mood? Pretty good. The fact that it's another \"found footage\" movie? I don't even mind, I in fact am still a fan of those found footage ones. The context? Pretty great, the movie being mostly filmed in an old England house. The story? Maybe not original, but still not bad either.<br><br>The bad, now. The acting. Terrible. I've seen worse, but it's definitely not good. At some point, it will impact the mood making the story very hard to get into.<br><br>The worst. The plot. Oh. My. God. The plot is simply terribly bad. It shouldn't be allowed kind of bad. As other reviewers have already said, there were so many plot holes I stopped counting. From one bad decision to another.<br><br>****SPOILER PART - START And when I say bad decisions, I do not mean \"why didn't she hide instead of running away. kind of bad decisions. No. I mean \"let's ask the boyfriend to go get the camera instead of saving us\" kind of bad. It just did not make any sense. Why didn't they just leave? Why did they still had their camera towards the end? Why not work as a team and kill/knock out/capture the guy? Or a policeman that works alone and cannot check the house? Oh, come on. I might not live in England but I'm pretty sure it doesn't make sense over there either. One of the worst part was when they got woken up at night by a noise, they knew it was someone at that point, the guy made a 10 sec check around the house, came back in his room and started arguing with the girlfriend because she discovered that he knew about it, and went back to bed because he didn't want to argue anymore about it. OK... and the stalker/killer situation, they just slept on it? Let's just leave the crazy guy in our house and take care of it tomorrow morning... Wow.<br><br>SPOILER PART - END****<br><br>Too bad because it had some good ideas, some entertaining parts, but the bad parts were simply so stupid and so bad that it voided the better ones. Therefore, I give this movie a 3 / 10.","user":"sykopat","rank":[4,6]}]