[{"title":"\"Shadow People\" is that rare horror movie that leaves a lasting impression of fear upon you as you lay in bed at night","rating":8,"date":"15 March 2013","review":"Rarely do I come across anything in my viewing of horror movies that makes me jumpy or paranoid after turning the TV off. Most times I enjoy the film and then go on about my business with no worries. However, every once in a while a true gem of fear comes along and leaves its imprint on me as I shut off all the lights in the house and head to bed. Matthew Arnold's \"Shadow People\" had me searching the walls and windows for ghastly spots of unexplained darkness after watching it.<br><br>Participants in an experimental sleep study in the 1970s report seeing strange shadowy figures. They and several hundred other individuals die in their sleep soon after. The phenomenon was given the name SUNDS, which stands for \"Sudden Unexplained Nocturnal Death Syndrome.\" Doctors wouldn't talk about the shadows.<br><br>In the present, failing radio talk show host Charlie Crowe begins receiving calls from a teenager claiming shadowy intruders are coming for him. At first, Charlie believes the kid is mentally ill. His theory is challenged when the boy dies in his sleep. Things get even weirder when listeners of his talk show and people he tells about the mysterious shadowy figures begin dying in their sleep. Are these clusters of deaths a coincidence or are there sinister nocturnal forces at work?<br><br>\"Shadow People\" takes the sort of ideas our nightmares are made of and puts them in a visual package. Everything you've ever thought about someone or something watching you in your sleep is brought to life in this creepy little indie film.<br><br>Director Matthew Arnold shows great promise through his mastery of timing. He has a knack for setting up what you would expect to be your typical jump scare and somehow delivering it in an off-tempo manner that leaves the viewer surprised and shuddering.<br><br>I can't say I completely agree with every choice of filmmaking he used for \"Shadow People.\" The movie is presented in the manner of many true crime TV shows are. It's a re-enactment of \"true events\" with the actual people involved giving their commentary along the way. The concept is interesting but gets a bit distracting as the terror unfolds.<br><br>Many religious individuals would express their belief that shadow people are demons or evil spirits. Much like in \"The Possession\" or \"The Exorcist,\" the person has brought something into their house that allowed the entity access. I am of that mindset more so than any other concept brought up in this.<br><br>If I were to compare \"Shadow People\" to other movies out there just as a way to spark people's interest, \"The Ring\" and \"The Apparition\" immediately come to mind. By no means is this a carbon copy of either of those films. They just came to mind as I sat watching it.<br><br>\"Shadow People\" is that rare horror movie that leaves a lasting impression on its audience. The fear might wear off over time, but you'll never completely stop thinking about it. We all wake up in the middle of the night gasping for air, feeling like something is sitting on us, or thinking we're being watched. Is it just our imagination or could it be the shadow people?","user":"ersinkdotcom","rank":[57,78]},{"title":"A movie much like The Fourth Kind in the way that real footage is mixed in with movie footage. Not bad but not great. I say C+","rating":5,"date":"17 March 2013","review":"\"How do you stop thinking about something.\" Charlie Crowe (Roberts) is a talk show host who's ratings are slipping and he is worried that he may get canceled. When a young man calls in one night and tells him about a nightmare he is having he thinks its a joke and hangs up on him. After receiving a package from him he takes it a little more serious, then after the next time he calls it changes everything. Charlie is now trying to figure out what he saw. This is a very interesting movie but I wouldn't call it a straight horror movie. The movie is interesting enough to keep you watching and interested but I didn't think it was scary in the classic sense. The only movie I can really compare this to is The Fourth Kind in the way that it mixes \"real\" footage with the movie footage which makes it a little more creepy. It is a hard movie to recommend because it doesn't really fit into a specific genre but I will say that it kept me interested the entire time. Overall, not a bad movie but nothing amazing either. I give it a C+.","user":"cosmo_tiger","rank":[29,39]},{"title":"A great creepy movie","rating":8,"date":"28 March 2013","review":"I really liked this, first thing is its not a gore/blood fest ( which is a good thing) its more a creep/freak you out movie, I watched it about 2am on my own in the dark and it freaked me out, I thought it was a cool original quite scary idea, with some great writing and ideas and some great acting, it would of been easy to make this feel cheesy and cheap but it doesn't the main character does a superb job of portraying the sceptic to believer, its a shame it has a low score which will instantly put people off this movie as recently especially in this genre it's rare to find something original and so well done, I hate to admit after watching it I actually turned the light on to go to sleep lol I can't remember the last time a movie had that effect, well worth watching just don't expect a slasher or make you jump movie it's more one that freaks you out when thinking about it, which you will do","user":"cbcburns3","rank":[29,41]}]