[{"title":"Let go and just have a good time-","rating":8,"date":"31 August 2011","review":"It's a waste of time to complain that movies like this have been done before. Yes, they have and if you don't like them, don't watch them. I don't think I will ever understand why people watch a movie like this expecting something totally new and different and super high art to fulfill their overly pretentious taste and make them feel like true film critics- Please.<br><br>We watched this movie last night via On Demand. A roomful of horror movie fans ranging in age from 11 to 39- and we had a great time. A wall crawling, giggling, screaming at the top of our lungs good time.<br><br>-and that's the point! Having a good time.<br><br>I don't need to have everything in a scary movie make sense, or be explained to me. I am not in school, I am having a laugh and a good time freaking out with the poor saps trapped in the haunted mental institution.<br><br>The story was tight enough to be good, loose enough to allow for the insanity that ensued. The characters were not cliché and the ending was not totally cookie cutter.<br><br>Bottom line- this movie was fun. There were moments when we laughed at it, but there were also moments that made us freak out and want to turn on the lights. Just stop over-analyzing, relax and go with it and have fun. If you have to nit-pick a movie to death you have way too much time on your hands.....HAVE FUN!","user":"nephythys","rank":[203,261]},{"title":"True to the genre and scary, with a small 'but'.","rating":9,"date":"16 August 2011","review":"I was fortunate enough to see Grave Encounters last night, a movie I have been waiting for, for a long time. And because I know there are a lot of people out there who still have to see it, I will not spoil anything, which makes it a bit harder to review the movie at this time, but I'll give it my best.<br><br>I loved the beginning of the movie, especially as a 'ghosthunters' and 'ghost adventures' fan. It is very clear that the makers of this movie have at least watched 'ghost adventures'. The cast is legit, this could've seriously been a new paranormal show, or at least it could've convinced me.<br><br>I loved it even more that the makers of 'Grave Encounters' (I mean the show in the movie) actually prove it is almost impossible to capture evidence each episode. This while that's what's required to keep a ghost hunting show interesting all the time, and how they are planning to deal with that in case 'once again' nothing happens, this was the only time I had to laugh during this movie. After that, the lockdown (that word sounded very familiar to me ;) began and the laughing stopped...<br><br>In contrary to what other reviews said, I DID find it very very scary at times, even the parts that were already in the trailer. There were moments that I literally jumped off my seat. If you're going to watch a movie about ghost hunters, of course you can expect slamming doors and stuff like that, I don't think one of my previous reviewers are very honest about that and I actually wonder what YOU were expecting. Of course there are screaming people all the time, giving the events of the movie (or even only half of them) I would've liked to see you in a situation like that!<br><br>I do however admit that the movie made some turns towards the end that I didn't expect and would rather have seen differently. Once again, without spoiling anything because I would hate to do that, I would rather have seen the makers keeping it ehm, a little less explosive and a little less revealing. Once you see the movie you'll understand what I mean.<br><br>I would have been more satisfied if the only thing that I had seen the entire movie are slamming doors and flying things for instance. But I guess that's also a matter of what you are willing to believe CAN happen.<br><br>So my only reserves are that the only reason that this will not be a new blair witch project, is because there is too much visually revealed. Metaforically speaking: keeping ghosts invisible is usually scarier.<br><br>Overall, I was greatly entertained, this was the first movie to seriously scare me while watching in over a decade, which says something coming from a die-hard horror fan (check my history). It has been worth my wait and I hope I see more from this crew in the future.","user":"Booster77","rank":[139,181]},{"title":"Absolutely Loved This Movie!","rating":10,"date":"20 September 2011","review":"OK to save us all some time I will start with why you wouldn't like this movie. You would NOT like this movie if you are the kind of person who is looking for something \"new.\" Most of the reviews from people who did not like this movie complained about it using stuff from other movies. May I remind everybody that the horror genre has been around for quite awhile and nearly every new movie has something an older movie has used at some point. The fact that it may seem cliché to some does not make it any less scary. A person doesn't get off a roller coaster and say \"wow that was lame! It went just as fast and crazy as that other roller coaster!\" The point is while the movie may use \"common scare tactics\", I still found it very suspenseful. If you are looking for a horror movie with believable acting, a freak show style exhibit of horrors, and a \"OMG here it comes\" feel, then I definitely recommend this movie. But if you are the kind of viewer who would rather criticize than sit back and be entertained, I suggest you stay home and see if you can come up with a genuinely \"new\" horror story.","user":"phanatic1989","rank":[106,156]}]