[{"title":"Disasterously dumb","rating":28,"date":"28 May 2013","review":"This was just god awful!!! Honestly, I wasn't expecting much from this movie - direct to DVD. It's a birthday party celebration in Vegas that you'll have wished never happened! The acting is beyond atrocious, the music is terrible, the hand-held camera thing is derivative, the kills are bland and very cost effective, and the script really lame. The killer in this is soooo dumb and the characters all grind on your nerves. There is no tension, no gore, nothing scary, nothing humorous, nothing! They totally \"ATTEMPTED\" to rip off Hostel but not in a good way. It's junk like this that is so insulting, to think that these filmmakers, if you can call them that, believed that they could piggy back off of decent horror films like Hostel, and try to sell audiences cheap toilet paper is just a slap in the face. I actually feel dumber for having watched this movie. Save yourself some angst and a few brain cells and skip this movie.","user":"bgoldberg62","rank":[65,70]},{"title":"Amateurish and awful!!!","rating":19,"date":"19 May 2013","review":"Another god-awful camcorder horror movie, this time about four annoying twenty-somethings who go to Vegas as a 21st birthday celebration. One naturally has a camcorder and records everything. As is pretty much always the case with camcorder horror films the characters can't ever seem to stop talking even though they never have anything interesting to say. The endless chatter grows old fast and you want them to get killed just so they will shut up. Once the friends drive to the remote location where they will be killed off by strippers there is no logical reason to continue the camcorder gimmick so the movie switches to an equally annoying surveillance camera gimmick with some shaky hand-held camera work thrown in for no good reason since nobody is using the camcorder anymore. It's probable that the murderous strippers are hot but the movie is so poorly shot and lit that it's hard to tell for sure. Stripped has no gore or suspense and nudity that you can barely see. It's a thoroughly inept mess that nobody should waste 80 minutes of their time on.","user":"FredHowe651","rank":[24,26]},{"title":"Dreadful","rating":2,"date":"31 May 2014","review":"There really is no storyline, a group of kids go to Vegas for a 21st Birthday. The drive to Vegas is almost a waste of filming as really nothing interesting happens so it could have been shortened. There is zero suspense as it is so obvious what is about to happen and so not real, it's just silly. These kids are completely stupid as I'm pretty sure they would not have gone to so much trouble to drive to some unknown warehouse just to meet strippers. This is Vegas after all and why would you venture anywhere to find something that is right on your doorstep. At least make the storyline a little more believable. Awful low budget film.","user":"lweidenauer13","rank":[23,25]}]