[{"title":"Worst Dance(?) Movie","rating":3,"date":"20 July 2012","review":"i love dance films, even some that are short on story, but this movie is really short on story and good actors. There is nothing new here, just the same rehash of every dance film before. We have our hero, Ash, played by Falk Hentschel, but i doubt his name matters. This guy looks like Will Young with muscles, but his acting ability is worse than even Will's. George Sampson is the reason i actually watched it. He was the winner of Britain's Got Talent a few years ago. He is a great dancer and his character is the only interesting one in the whole film. If you want a good dance film, then skip it. If you want a film with a storyline, then skip it. If you want to kill a couple hours being brain dead, then watch it.","user":"anoceanroars","rank":[25,34]},{"title":"Excellent display of a fusion of dances, with a highly contagious feel-good atmosphere","rating":6,"date":"11 April 2012","review":"For people who did not manage to catch Street Dance 3D (2010), it should come as good news that this sequel has no relation with its predecessor- other than two returning acts, Flawless and George Sampson. Street Dance 2 uses the dance scene in Europe as its backdrop, introducing a number of dances and adopting pretty much the same pattern as Street Dance 3D. However, compared to the original, this movie has a greater focus, which is to showcase the fusion of street dance with a popular Latin dance form, salsa.<br><br>The storyline, albeit cheesy, has a lot more punch and is more focused, centred as it is around a distraught Ash (Falk Hentshel) who after failing terribly at a dance battle is scouted by Eddie (George Sampson). The duo subsequently comb all over Europe for the best dancers to form their dance crew, with the aim of beating the 'Invincibles'. They chanced upon a salsa dancer Eva (Sofia Boutella), who eventually became crucial to their success. In between, there is some drama here and there, including the obligatory love story. However, those looking for some sparks will likely be disappointed, as the romance is as clichéd as it gets. <br><br>Nonetheless, as mentioned earlier, the movie does have the charms a dance movie ought to have, which are essentially supported by the dance sequences and the music. For instance, the difficulty of combining salsa and street dance was brought out through how Ash acquired the steps by taking lessons from Eva. A street dancer, who is trained to express himself as freely as he could, now needs to be disciplined and take into consideration of a partner to display elegance and passion. All these are complimented with a good mix of contemporary groovy dance mixes that engages the audience into the performance.<br><br>Also, to-watch-out-for is Sofia Boutella, who makes her feature film debut here. The French hip-hop dancer takes on a whole new different dance form yet shows no sign of being an amateur and comes off as a complete natural- certainly one of the highlights of the film. <br><br>As you would probably expect, Ash will end up being the hero who overcomes and emerges from his past failure to prove his worth. The grand finale is undoubtedly the climax of the whole visual experience. The dance routines were electrifying, a definite treat for all. The joy from the triumph was also very genuine and contagious.<br><br>Still, what remains as a really shortcoming for dance movies is its limited appeal for the uninitiated- perhaps a more solid-packed storyline and drama would enable it to broaden its appeal. <br><br><ul><li>www.moviexclusive.com</li></ul>","user":"moviexclusive","rank":[17,25]},{"title":"Spectacular and entertaining !","rating":7,"date":"20 August 2012","review":"Directed fairly well by Max Giva and Dania Pasquini, this movie is not about fretting over the story or the acting. It's all about the passion of the street dance, and the street dancers. It's also about the Latin American dances like Salsa, Tango.<br><br>As the main lead pair, Sofia and Hentschel are hot, and the Director has used the canvass of beautiful city of Paris ,and specially Eiffel Tower, to catch in camera, the development of the hero as only an acrobatic stree dancer,selling pop corn, getting humiliated by Vince the invincible, to a sensitive and perfect dancer, with his heart in his dance.<br><br>Sofia is the main attraction, with her seductive,passionate and perfect body language, enormous energy, and yet an alluring femininity about her persona. She overshadows Hentscel in emotional scenes and dialog delivery. Hentscel's only plus point is his well-toned body, and amicability. But otherwise he seems to be a total miscast , with his impassive attitude, and a noticeable effort of acting. With some one more aggressive and powerful, the movie could have been even more effective.<br><br>Tom Conti as Sofia's uncle is adorable. But it is George Simpson, who really looks naughty and fresh. all other supporting team members are fit for their roles and skills.<br><br>Editing and cinematography is good. i liked the soundtrack, with a fair mix of sentimental and hip hop. This movie is a real Niagara, and you have to just be a part of the whole process,to enjoy it fully !<br><br>And don't ask how did they manage to travel practically all over the world, to assemble their crew, when they are just some lower middle class boys, without any substantial income ? The director shows only once, the duo travelling with goats, but otherwise it's the air travel all the way ! In his overambitious handling, the script writer probably forgot this practical point:)","user":"Queen_of_pentacles","rank":[3,3]}]