[{"title":"Average Crime Thriller","rating":6,"date":"4 August 2017","review":"This crime thriller/revenge action film is a straightforward story about a guy from South Africa who comes to LA to find his sister, only to learn that she was viciously beaten and murdered. He spends the rest of the film tracking down her murderers and learning why she was killed. He's easy to sympathize with; you will care about this man and what he's going through. The plot is steady and things are slowly revealed, enough to keep your interest. There is not a big plot twist at the end like some reviews have (for some reason) hinted at. Quite a bit of violence, but nothing gratuitous; it makes sense within the plot.<br><br>In sum, this film has good acting, it's a decent story, and it has a plot steady enough to keep your attention. Perfect for Netflix and chill.","user":"dudedoodleedoo-80716","rank":[44,55]},{"title":"No idea why this isn't rated higher!","rating":10,"date":"15 August 2017","review":"I know some Netflix films can be a little rubbish but they excelled themselves here. In my opinion the whole cast excelled especially Chadwick Boseman who carries his role off beautifully with a great accent that has no weak points - revenge thrillers are common but few as well acted or with a script as well written. I was engaged from beginning to end - the twist is superb.You won't regret watching this movie.","user":"nixy69","rank":[38,57]},{"title":"Hidden Among the Rags (of LA) comes a Beauty of Cinematic Excellence","rating":8,"date":"6 August 2017","review":"This movie shows you what cinema should look like. This old craft of making movies with tempo, cinematography, editing and score is deprived of all imprints of judgement, opinion or the director's indulging in his pretentious personality as many directors strive to do these days; it seems that the director has nothing to prove but only the commitment to telling a beautiful masterful story filmed with excellence and craftsmanship. The goal here is to learn what real cinema is. Everything serves the story, everything is well balanced. It's an exercise in genre and a director's pure intentions to making only cinema. You don't get pitiful emotion or euphoric fake bliss you only marvel in excellence. No shot is overrated, no emotion is fake. This is a work of a master. And these days masters are found in Europe. It brought me back to my film school days when I was in awe with the great directors of past and how they can create a work of art without the excesses of today's cinematic work that is riddled with uselessness and has no soul or beauty. Mind you, this is not a masterpiece, far from it; rather this is a lesson of what true cinema is... Watch it and be in awe...","user":"theredandwhitekey","rank":[33,51]}]