[{"title":"A Well-Executed And Powerful Musical","rating":26,"date":"26 September 2014","review":"A well-executed and powerful musical from Tom Hooper, 'Les Misérables' stood alongside 'Skyfall' as Britain's two main entries at the 2013 Academy Awards and left with 3 Oscars. Featuring some bravura performances from an all-star cast including Anne Hathaway (Oscar winner), Hugh Jackman (Oscar nominated), Russell Crowe, Sacha Baron Cohen and Helena Bonham Carter. Set against the sweeping backdrop of 19th-century France, 'Les Mis' tells an enthralling and emotional story of passion, love and redemption, accompanied by some stunning cinematography, uplifting musical numbers and flawless direction. While it does drag on at parts, 'Les Mis' is generally an impeccably crafted musical to be enjoyed by all.","user":"CalRhys","rank":[70,90]},{"title":"Breathtaking - A Musical with Heart","rating":10,"date":"12 December 2012","review":"I went to an awards screening of Les Miserables and left the cinema speechless. Tom Hooper's direction and the cinematography, costumes, art design and editing are nothing short of genius.<br><br>Hooper's idea to have the actors sing live really brings a deeper emotion to the film not seen in other movie musicals. Hugh Jackman is absolutely incredible as Jean Valjean and carries the film with spectacular grace. Anne Hathaway is magnificent in her fleeting role as Fantine - the film's sequence in which she goes on a downward spiral is one of the it's best moments, and her ABSOLUTELY INCREDIBLE HEARTFELT rendition of 'I Dreamed A Dream' will win her the Oscar by itself.<br><br>Also, a great supporting turn from newcomer Samantha Barks as the heartbroken Eponine (look out for her waist - it's absolutely tiny!), who is sure to be shot into stardom. Eddie Redmayne, Russell Crowe and Aaron Tveit are also good, and there's some great comedy relief from Helena Bonham Carter and Sacha Baron Cohen.<br><br>It will leave you laughing, crying, and feeling inspired. A great watch, sure to win some major awards this year! 10/10!","user":"antesdespues","rank":[432,617]},{"title":"Magnificent Adaptation","rating":10,"date":"11 December 2012","review":"This film is amazing. Absolutely incredible. I don't understand what people are saying about pacing issues, I thought it flowed beautifully. The changes made worked very well. And I didn't think there was any weak link in the cast. I honestly loved Russell as Javert. He wasn't traditional by any means, but what he did worked. <br><br>The cgi was not the best, but it kind of created this fantastical other world while still being realistic and grounded. <br><br>So many of the acting choices were brilliant and subtle. For example Jackman ever so slightly altered his voice with his characters aging, which I thought was brilliant. <br><br>There is no negative thing to say about this movie. However, I do see why a critic may not like it. It's not a critic movie. There isn't a lot of impressive violence, crazy camera shots, etc. the things critics seem to love. It's more grounded in the performances and the story, which it tells extremely well. <br><br>The only thing I can point out (because I saw it with my boyfriend who knows nothing about the story) there are two or three slightly confusing plots for those who aren't familiar with Les Mis. But they are either explained later on or not important enough to dwell on. <br><br>Anyways, that's my rant. Needless to say I will be seeing it many many times and cannot wait for the DVD so I can own it and watch it even more.","user":"Kaite927","rank":[355,535]}]