[{"title":"Great thriller that took me by surprise!","rating":8,"date":"8 May 2013","review":"Saw this as a preview at Pinewood Studios recently and was caught by surprise at how accomplished it is as a first movie. Director and co- screenwriter, Omid Nooshin has crafted an intelligent and genuinely suspenseful take on a (to be fair) not-so-original idea – the runaway train.<br><br>Populated by believable characters, the train journey gets underway and a clever introduction of the various relationships ensues. The number of passengers on board dwindles to an eclectic few, seemingly in real time, before this familiar and very British late train to Kent is invaded by the plot of a Hollywood Blockbuster. And this merger is the heart and soul of the piece – a 'what if?' scenario that sneaks out of nowhere, pulling the rug on what you thought you were watching.<br><br>If I had to level any major criticism it would be that the films ultimate ambitions are occasionally betrayed by its lack of budget, but don't let that put you off – a number of creative decisions were probably based around what couldn't be afforded and, in my opinion, are improved by the inability to throw lavish visual effects at the screen. What we are left with is a taut, claustrophobic thriller that's hard to second guess.<br><br>The film makers influences are easy to spot, the 'Dual' like scenario and the rattling interplay between a collection of disparate ('Jaws'- like) characters screams early Spielberg, whilst the slow build of simmering tension, as the reality of the situation takes hold, evokes the sensibilities of Hitchcock, as does the Herrmann-esque score. The setting doesn't stray from the confines of the train, which in a way becomes a character itself, although thankfully it never feels too static, nor becomes stale. This is a thriller that takes its time to present a credible realism – all the better so that when the brief flashes of chaos and action do erupt we are invested in the characters lives and the predicament they face becomes a life threatening battle for survival with, only too real, motive and consequence. <br><br>To reveal the details of some of the emotionally charged scenes would be remiss, save to say that Dougray Scott turns in a performance of restrained gravitas that recalls the promise of his earlier work. In fact the cast seem uniformly intent on selling the danger and urgency of the piece.<br><br>All in all, I found Last Passenger to be a thoroughly entertaining film that I'll be seeking out again when it's released on the big screen in the UK.","user":"Crossinski","rank":[80,99]},{"title":"Tense and Effective Low Budget Thriller","rating":7,"date":"20 October 2015","review":"The widow Dr. Lewis Shaler (Dougray Scott) and his son Max (Joshua Kaynama) are traveling late night by train to London. Lewis will leave Max with his grandparents to attend victims of a great accident at the hospital where he works. When Max accidentally spills coffee on the coat of the promoter Sarah Barwell (Kara Tointon), Lewis is embarrassed and offers to pay for the cleaning of her coat. Soon they start a conversation and feel attracted for each other. When the train stops, Lewis sees a man on the track apparently fixing the brakes. When the trains moves, he sees another man crawling on the tracks. Lewis seeks out the train guard (Samuel Geker-Kawle) and finds that he is missing. Further, the train does not stop at the stations. He tries to contact the driver that asks how many passengers are still on board and nothing else. Lewis contacts the passengers Jan Klimowski (Iddo Goldberg), Peter Carmichael (David Schofield) and Elaine Middleton (Lindsay Duncan) and they team-up expecting to stop the train. Soon they conclude that the train has no brake and the driver is a suicidal. What will happen to them?<br><br>\"Last Passenger\" is a tense and effective low budget thriller. The story takes place in a train along 97 minutes running time and is never boring. The chemistry between Dougray Scott and the gorgeous Kara Tointon is amazing and their romance is pleasant to see. The conclusion is a little confused but this film is surprisingly good. My vote is seven.<br><br>Title (Brazil): \"O Último Passageiro\" (\"The Last Passenger\")","user":"claudio_carvalho","rank":[19,21]},{"title":"Something Fresh","rating":7,"date":"8 May 2013","review":"From the start Last Passenger feels like the kind of suspense film you don't see any more. There is character development. And relationships I care about between the people on the train. I was really interested in how these strangers are getting along when along comes the threat. I still had The Birds on my mind and have always loved how the you get on the edge of your seat simply on the love interest alone, well before the birds start to attack. Versus something like Hostel where they rush to the danger, don't set up the characters, you don't care what happens to them, and you'd just like them to hurry up and live or die so you can go home. Last Passenger gets back to the Hitchcockian \"build\". I really liked Dougray Scott. I had only seen him in smaller roles but he totally owns this film. I also really like Kara Tointon who I hadn't seen before and I not sure why. She's great. Even the little boy is fantastic. He actually reminded me of the kid that played Danny in The Shining. Just a little less creepy. Anyway... good acting, cool story and a fun idea.","user":"andrewtilling-586-256157","rank":[73,95]}]