[{"title":"At last...a cure for insomnia","rating":2,"date":"5 January 2014","review":"This is one of the most tedious of movies I have ever watched. There was some tension in solving the \"who-dunnit\" (hence 2 stars rather than 1) but really not worth the effort in watching the movie. Fortunately the movie was on Sky so it wasn't something I had forked out hard earned cash for.<br><br>If you've something better to go and do...like wash your hair then it would be time better spent than watching this.<br><br>Characters are very one dimensional the script contains a lot of clichés and the acting is poor...On a positive note..the version I watched was only 88 minutes long!","user":"jmnoates","rank":[14,18]},{"title":"If we know they are all going to lie, then why bother?","rating":4,"date":"2 October 2013","review":"A game reaches tragic consequences when a group of friends decide to commit a crime and make it appear a suicide. What was supposed to be a simple fright now brings those involved in the interrogation room and each tells his opinion about what happened. Missy, the game organizer seeks revenge on Dennis who she had a relationship in witch she became pregnant and wants to tell this to his current girl friend,Casey. After the sentence is chosen they must fulfill it, namely to break into an apartment and steal something from there. Now Missy can put her plan into work but doesn't go as she wanted and she becomes a victim of the alliance between Mike and Dennis.<br><br>The film tries to show several views from many perspectives of those involved in a murder and in the end using the video recording that were hidden in the bottom of the framework where the plates with the punishment were and who has been left there for Katie, another girl involved, we find out what really happened. However I would not recommend this film because everything in it is amateur, script, plot, actors, performance, even the singer from the beginning.","user":"adi_2002","rank":[10,14]},{"title":"What to believe?","rating":3,"date":"15 August 2014","review":"As a whodunit, this doesn't work, because we don't really care for any of the characters. Except Sara Paxton maybe, but that is more to the actress than the character she portrays. Other than we have pretty young people partying and one of them having met a tragic end. But how did that happen and why did it happen? Do you really care? I'd bet good money that you don't really.<br><br>Watching people party has been done better before, this is not as exciting as it may sound. And it's not because there is no nudity (well partial nudity if you want to call it that), but because there is no real spark that does go off. Whether it's for the characters or for the viewer nothing really ever does tingle a bit. A shame, because there is some talent in front of the camera who does not have the opportunity to work their acting chops properly.","user":"kosmasp","rank":[3,4]}]