[{"title":"7 years have not gone to waste","rating":10,"date":"18 September 2011","review":"\"A Letter to Momo\" had reportedly taken the director Okiura Hiroyuki 7 years to produce. Allow me to be the first to say, the time and effort spent on perfecting this film have not gone to waste.<br><br>The art/animation in this movie is top-notch. Production I.G. with assistance from P.A. Works, Studio Pierrot, and CG by Dandelion resulted in stunning visual quality down to the tiniest details. What I especially liked, was the amount of attention paid to body language and gestures. There's so much information to be gleaned from subtleties of the visuals alone, and that's what I find most interesting about Japanese films. There was also this action sequence near the end that just blew me away. I don't want to spoil, but I have not seen such breathtaking hand-drawn animation since watching \"Tonari no Totoro\" in the late '80s.<br><br>The story begins with the protagonist, Momo, moving to a small fictional island named Shiojima with her mother. Their new house appears to be haunted, and she feels absolutely miserable about moving out of Tokyo. Being a city girl that she is, Momo struggles to adjust to the country life. Instead of playing with the local kids, she eventually befriends three Youkai in her house - Iwa, Kawa, and Mame. Momo begins to appreciate the life on the island, and come to realize the meaning of his late father's unfinished letter to her.<br><br>The character development in this movie is absolutely phenomenal. It begins with a light comedy, but through numerous adventures and mishaps on the island, we slowly learn about her past. The transition from comedy to drama is seamless, and it really makes you to care about the protagonist by the end... This film has what I call magic, something Ghibli films of late desperately lack. Although the local kids were severely underused in this movie, the three Youkai were the true supporting cast. Their chemistry with the protagonist was excellent, and the humor just comes naturally. Mame's character was especially funny in a quirky way. One can easily tell how much thought and planning has been put into this film just by watching the impeccable timing at which Mame's character was used as comedic relief every single time.<br><br>Every piece of music appears to be fully orchestrated, especially the violins stood out to build tension in action scenes. Momo's voice acting by child actress and seiyuu Miyama Karen was a perfect fit, as well as the three Youkai.<br><br>\"A Letter to Momo\" is almost like a homage to Studio Ghibli's kids movies - \"My Neighbor Totoro\", \"Spirited Away\", and \"Ponyo\". It sticks to the tried and tested formula of supernatural spirits that only interacts with kids, and somewhat predictable plot development. However, the producers have managed to merge various elements from all those films into an exciting original story. \"A Letter to Momo\" is a magical crowd-pleaser with great pacing and a heartwarming story. It's a solid movie that anime and movie fans should not miss.","user":"ethSin","rank":[48,55]},{"title":"The Aftermath of the Great Earthquke","rating":10,"date":"18 April 2013","review":"The film is a story about a girl's spiritual growth and overcoming difficulties in a new life. Momo Miyaura, a sullen 11-year-old, encounters three goblins from an old Edo-era's comic book. The goblins are Iwa, Kawa and Mame. Iwas is large, clumsy and honest; Kawa is middle, manipulative and greedy; Mame is small, slow and infantile. They are mischievous, sloppy and dull.<br><br>Their appearances are reminiscent of \"Kyoka Hyakki Yakyo,\" an illustration of goblins in an Edo-era comic book called \"Kibyoshi.\" \"Kibyoshi\" is a precursor of 'manga.' In the Edo era, various images of goblins entertained readers and told valuable lessons.<br><br>The film is set in Shio Shima, Inland Sea, an allusion to Yasujiro Ozu's classical film \"Tokyo Story.\" Momo moves from Tokyo to the small island after her father's sudden death. While she is boarding a ship, three drops of spirits come down from the sky and land on her. The drops are the goblins or guardians, which help her reconcile a sad memory about her father. She regrets criticizing her father before he passed away.<br><br>In the film, the legendary goblins and Momo develop strange but warmhearted relationships that unite the past and present, or this world and afterlife. A motif of connectedness appears at various levels and creates a poignant but cheerful story. First, it shows continuation of time in Japanese popular culture by making a connection with the funny goblins emerging from a \"kibyoshi\" and in Momo's contemporary life. The past is linked to the present via 'manga.' The emergence of old 'manga'unfolds a history of Japanese popular culture, which intertwines with her daily life and symbolizes continuity.<br><br>Second, the connectedness illustrates the relationships between the spirits and humans in a spectacular way. Various types of spirits such as orchard spirits, ocean spirits and forest spirits assist Momo. This is most memorably exemplified when the spirits collaborate to help her in the midst of a fierce typhoon. Thanks to their support, she overcomes a difficulty. Demonstrating collective forces, the animating spirits generate a harmonious and splendid message that life is working with others. Nobody can live alone.<br><br>In addition, the scene also gives us a lesson. Each one of the vigorous spirits provides her with a tiny power that is almost negligible, but its contribution is valuable and finally brings a tremendous result to aid her. It reminds us that selfishness and indifference do not bring anything good. The significant message is that everybody has a role to play in the world. The scene is a pivotal moment of her spiritual growth.<br><br>Furthermore, the connectedness with the spirits also underlines a powerful animistic note that we are part of nature, which exerts enormous power and is larger than us. Nature and humans can coexist harmoniously in this world. The connectedness is the key that keeps our lives going.<br><br>Third, the connectedness demonstrates that death is not the end of life. The goblins have been sent from Above in order to watch over the living. Their special mission is to rally round Momo and report about her life to Above. Their mission expresses a vastness of time in human life, including the afterlife. In short, the dead also have a mission to do in this world. A person's life in this world is finite, but one receives another mission to complete in the afterlife. The amicable relationships between the hilarious goblins and her imply that the deceased can also return to this world and work together with the living. The connection between the dead and the living indicates a culture of ancestor worship, emphasizing the relationships between ancestors and offspring, or the past and present.<br><br>Accordingly, the story offers a strong viewpoint that it is possible that we can be befriended by spirits or the deceased. A sense of infinite life is an unforgettably emotional moment and contributes to her psychological relief that she has another chance to make up with her father. Finally, the togetherness ameliorates her hardship. All the connectedness is linked to a process of her reconciliation with her regret.<br><br>This film would be particularly appealing for victims of the unprecedented great earthquake and tsunami that struck Japan in 2011. Many people unexpectedly lost their loved ones and everyday lives. They were totally unprepared to suffer such tragedies, let alone time to bid farewell. Later, they left their familiar lands and have been struggling with new environments.<br><br>In the film, such sentiments are clearly illustrated. Momo's father had an accident at sea and never returned. Her relocation to Shio Shima is an outcome of the loss of her father. The abrupt loss echoes Japanese collective grief and sorrow for those affected by the unbearable incidents.<br><br>Likewise, Momo's struggle is part of their struggle. Her feeling of sadness is theirs; her tears are theirs. Eventually, her achievements foreshadow their hopefulness. The story captures her shuttered heart as a reflection of theirs. It epitomizes Japanese psychology – many people hesitate to talk about their tragedy because it is negative.<br><br>The film finally offers a moment of catharsis and kindles a flame of hope. Consequently, underlining the importance of familial bonds and hopes that keep them going toward their future, \"A Letter to Momo\" is a letter to those victims.<br><br>More importantly, the story conveys Japanese Gambaro spirit that is an encouragement for people to work hard. The spiritual essence cultivates a sense of esprit-de-corps and persistence. Gambaro spirit is a sense of working hard together and for others, who will help us sometime and somewhere.<br><br>Ultimately, intersecting beings from the afterlife with this world, the film informs us of a traditional belief that invisible spirits live together in this world in order to help us.<br><br>All the deceased are our guardians, so chin up!","user":"naomi-chiba","rank":[20,22]},{"title":"Delightful slice of life anime","rating":9,"date":"25 April 2013","review":"After the death of her father 11-year-old Momo and her mother move to a remote island to live with her grandparents. Her mom isn't much at home because she has to commute to work every day and the two generally are quite estranged since the father's passing. Furthermore Momo has a hard time making friends in the new environment until one day she hears strange noises in the attic which turn out to come from three peculiar creatures that only the girl can see. They seem pretty mischievous but are they looking to hurt or to help the girl? <br><br>'A Letter to Momo' is a delightful anime that admittedly is quite a bit like the great 'My Neighbor Totoro', but it feels nothing like an uninspired rehash, in fact I liked this one even a bit better. As far as \"substance\" goes this is pretty slight but the story here is secondary to the gorgeous animation that feels very alive, every moment is lovingly animated with brilliant attention to detail to movement and the smallest of gestures. It has a captivating, consistent summertime atmosphere to which the rich sound work contributes almost as much as the animation.<br><br>This very much starts out as a slice of life drama until the monsters come into play at which point the film becomes really funny. But even though the antics of the creatures are hilarious and those guys are pretty crazy the character of the girl is well-fleshed out and she remains wonderfully real. The third act is mostly a very dramatic tearjerker. If this sounds like the film is all over the place or the tone is inconsistent, it is not. All the elements work together smoothly and it's a well-rounded experience. It is excellently paced but it does take its time and at two hours it might run a bit long. If you are a fan of slice of life anime with supernatural/magical elements this definitely comes highly recommended. Also suitable for your small ones.","user":"Perception_de_Ambiguity","rank":[19,21]}]