[{"title":"So boring it made me fall asleep","rating":1,"date":"15 April 2012","review":"This film is so boring that it actually made me fall asleep. The acting is very wooden and TBH I really can't see any point in it apart from siblings are forever arguing and no matter how much they may hate each other at some point in their life (or all) they still deep down care for that person. This whole film could have been done and dusted in about 20 mins. It had no beginning, middle or end. Yes, there were some funny bits but all in all it was just a boring peace of documentary with surprisingly wooden actors (TBH I was surprised at how wooden some of the actors considering the shows and films they have been in (Glee, jennifers body, red riding hood) and if I was a producer/director I wouldn't want any of these people in any of my films because of their acting skills. None of the actors shined and you was just left thinking \"wow was that it\" If you want a film to send you to sleep because it is so boring then watch this it will do it for you! Lol x","user":"nbg1446","rank":[13,26]},{"title":"Charming set of stories shining a light on the intricacies of sibling relationships - loved every minute of it!","rating":10,"date":"12 June 2012","review":"Just finished watching - in some ways it reminds me a lot of the British indie films I used to watch in my teens (Mike Leigh?). Not going to lie - the main reason I wanted to see this was because I wanted to see Cory play this character, but there's something truly charming about every character in this movie. Even if it takes a while to figure everyone out, there's still this undercurrent throughout the movie that no matter what crap life throws at you or between you and your family, and how much you might disagree and hate what they're doing or saying to you, it's still family, and there's really no person on earth that will ever really understand you or be willing to be there and support you through the biggest mistakes that you might be making. Essentially I got my own view of family and siblings echoed in these little stories. There are a lot of subtle and deep moments in them - each in their own way - and by the end of it I really cannot even name a favorite pair of siblings because they're all in their own way perfect in the way they are for each other. The actors all deserve an enormous amount of praise for their work in creating these characters and breathing such life and meaning into them, and Carl Bessai deserves all the praise for having the vision for this and delivering it to us in such a truly charming, often funny and so very poignant way.","user":"childliketendencies","rank":[8,16]},{"title":"Depth to a simply titled film","rating":7,"date":"23 November 2012","review":"I have to admit that I had several reservations before watching this movie but once I got stuck in I enjoyed it. Well, most of it.<br><br>There are 4 stories, thankfully not connecting. Of the 4 the least interesting, ironically because I have a brother and it should have struck a more resonant chord with me, is of Justin and Rory. I just found both of them superficial in the beginning and the brotherly relationship just wasn't done well enough by either actor to be believable, which caused me to forward most of their scenes. They felt more like close friends who lost touch than siblings and their \"plight\" was largely interesting.<br><br>The most interesting was that of Sarah, who goes from being a single child to finding out that she has a half sister and then has to deal with that, along with the prickly relationship she has with her mother. I won't reveal anything about this storyline because it's worth watching for the surprise and how it pans out.<br><br>Acting wise, it's about average for an indie film. Gabrielle Miller and Ben Ratner are very good and so is Kacey Rohl as Sarah is a standout among the cast. Amanda Crew, arguably the more known cast member, went over the top a bit but was mostly lost in her role.<br><br>As I mention in the title there is depth to the movie. It's shows the bonds between siblings, their differences and similarities, their closeness and what they'd do for one another. There's a lesson to be learned from each story and most people would be able to associate with one storyline or another and that association between the fictional character and the viewer is a good touch.","user":"caiged","rank":[2,4]}]