[{"title":"Remember Bette Davis in Dead Ringer? Deadly Sibling Rivalry ****","rating":21,"date":"21 August 2011","review":"Thrilling film which is a modern day retake on the Bette Davis-Karl Malden thriller \"Dead Ringer\" of 1964. In that one, Bette killed her identical twin sister who had stolen her boyfriend only to find out that the sister had been carrying on with another man and had killed the husband!<br><br>This version has two twin sisters in a car accident and the evil sister assumes the identity of the good sister when the latter falls into a coma.<br><br>There are numerous plot twists here. The story first begins when the sister comes out of the coma and has amnesia. The good sister's daughter has soon guessed what is really going on. We've got murder, putting drugs in pocket books, and other absolute items of intrigue.<br><br>This vicious sister is out to assume her good sister's life and will do anything to achieve it. Thrilling to the very end, this was done quite well.","user":"edwagreen","rank":[6,11]},{"title":"Just Horrible .. Skip It","rating":22,"date":"22 August 2011","review":"Charisma Carpenter plays identical twins Callie/Janna who are cliché responsible/good(Janna) &amp; wild/evil(Callie) twins. As teens they went climbing w/ their Dad &amp; while Janna was above him, his harness snapped &amp; rather than drag both to their deaths (he was holding onto the rope that also held up Janna), he let go sacrificing himself. Rebel Callie was not participating but watched the whole thing happen &amp; blames her sis for their Dad's death.<br><br>Flash forward to present day &amp; Good Janna has a child, Fiona, whose bf is motorcycle riding Kayden who she feels isn't good enough for her. Evil Callie gets a call from her friend Tricia, that the cops are on their way so Callie packs up &amp; shows up at a cabin that Janna happens to be at, at the moment. The cabin is family owned &amp; a getaway of sorts. They awkwardly interact &amp; later go for drinks w/ Trisha. <br><br>The next day Janna's car won't start so Callie offers her a ride to work. They fight, Callie drives like a maniac &amp; they crash. When the EMTs arrive, Callie is lying unconscious by the side of the car and Janna has cuts only. Fiona rushes to the hospital &amp; it's learned that Callie is in a coma. Janna is released &amp; goes home (not the cabin but real home) w/ Fiona who took time off from school to spend with her Mom while she heals. Janna is forgetful after the accident - not recalling where items are in the home &amp; is more carefree.<br><br>Janna is really Callie who took over her sis's identity - a twist obvious from the 2nd the accident happens. I assume Callie messed w/ Janna's car so she'd have to give her a ride but how she knew that the crash would leave her unharmed &amp; Janna in a coma is beyond me. Psychic? Ha. We learn later that Janna had a leg wound that she tied off but when Callie came upon her, she took the tourniquet off, letting her sis bleed out, hence the coma.<br><br>Tricia realizes the identity switch &amp; presses for the $ she is owed for items in a secret suitcase. Callie shows up at Tricia's home, tells her that they can store the items in her freezer until they can sell them. As Tricia cleans the freezer out, Evil Callie pushes her inside, closes the lid &amp; leaves her to suffocate inside. She waits for her to die &amp; then leaves with her suitcase intact.<br><br>Fiona starts suspecting that her Mom is really in a coma &amp; shares her concerns with the Dr. but they're identical, there's no way to prove who is who &amp; since Callie claims that she's Janna, Fiona can only wait for her Mom to wake &amp; clear things up. <br><br>Janna starts to get better making Callie desperate &amp; for an evil twin that means deadly so she breaks into the med closet, sabotages her sister's impending IV which causes Janna to seize which backfires for Callie since the Dr. not only stops the seizing but wakes her from her coma! Janna is now awake only she has amnesia! Oops. Fiona works hard to try &amp; jog her Mom's memory in order to get her back.<br><br>Callie admits to Fiona that she isn't her Mom but that they could pretend she is - she's more fun! Fiona freaks out but before she leaves w/ Kayden on his bike, Callie plants lots of pills in her purse, &amp; after, calls an anon tip in about teens selling drugs &amp; gives the license plate #. Stolen pills are revealed to be what's inside the suitcase.<br><br>Kayden takes the fall so Fiona is free to try &amp; get her Mom's memory back. Eventually Fi/Janna escape the hospital to go to the family cabin that is filled w/ memories. Evil Callie rushes there after seeing that Janna escaped &amp; correctly guessing where she went. Callie has a gun, shoots at her sis/Fiona &amp; wants them dead. Fiona, in her pursuit to get away from Callie, falls off a cliff but magically catches herself before she plummets to her death. Of course this is the same cliff where the twins' Dad died. Fiona is hanging by a few fingers on the edge of a rock cliff dangling- the acting here is deplorable. She doesn't even seem scared. Janna quickly runs to get climbing gear to save her &amp; finds a harness that had been tampered w/ - Callie shows up, reveals that it was Janna, not their Dad who was supposed to die &amp; that she had sabotaged her climbing equipment! Evil twin strikes again! Good twin hits Callie &amp; runs to the cliff. Rather than use a rope to pull Fiona up, like a dummy, she puts on a harness &amp; climbs down the cliff herself, next to Fiona. Callie appears, tries to knock them off but ends up falling over herself but wait! she manages to grab onto the rope dangling beneath Janna like the cliff scene w/ Janna/Dad. Janna cuts the rope leaving Callie to fall to her death &amp; then off screen saves Fiona somehow.<br><br>The cops never show up on screen so how did Fiona/Janna manage to convince them that Callie was posing as Janna since their word didn't work before? Callie was at the bottom of the cliff dead. Who's to say she wasn't murdered? Who's to say who she really was.. Janna or Callie? Also, Tricia's body was found earlier &amp; coma Callie (really Janna) was the main suspect. Fi told the cops Tricia had been at the hospital which would prove her innocence but no follow up about whether they ever found Tricia on the security tapes is mentioned. That would also help prove that Callie was not the one in the coma.<br><br>3/10 Bottom of the Barrel even for an original Lifetime film","user":"PhantomAgony","rank":[7,14]},{"title":"Perfect for that flick chick night with your squeeze.","rating":10,"date":"7 April 2020","review":"Impress your girl by recommending that you stay in and watch this movie...Charisma Carpenter and Christa B. Allen...you will not need any BlueChew and your \"all night stamina\" will be a treat.<br><br>Hugh G. Rection","user":"aocsincher","rank":[0,0]}]