[{"title":"Fun - Just Not One Of Disney's Best","rating":4,"date":"4 December 2011","review":"\"Good Luck Charlie: The Movie\" is definitely not the worst kind of family comedy, though I have to admit I personally prefer the show to this. Still, it makes a great addition to the series as a little Christmas movie. I didn't plan to catch this in the first place. Then I decided I might as well watch this after I tuned to the Disney Channel looking for some fun after some serious work.<br><br>First of all, the story is a mix of unoriginal ideas. It wasn't boring. Not at all. Just unoriginal. A vehicle going downhill with a broken brake and some typical war games, these all sound familiar. So you should not expect anything fresh or special, but it is still fun for me. There aren't exactly any particular moments or scenes that I find dull or highly intriguing, but trust me, it is not a mess. The story fits together and is presented well.<br><br>Some scenes near the end of the movies are good, and I liked the ending too. And yes, there was the surprise which I am not going to ruin here. But I do hope that Disney will maintain the consistency and keep that \"surprise\" valid for upcoming episodes on the show.<br><br>I guess there is not a single reason for me to say this is a bad movie, but it really could've been much better, so I think I will put this in the middle of the scale. This is by no means a poor family comedy, considering there are \"better\" choices out there. If you're afraid of replaying awful memories of this year's little Miss Judy Moody, don't worry. This is a lot, a lot and a lot less disturbing.","user":"TroyeEvans","rank":[6,9]},{"title":"Fun, warm and Christmassy","rating":8,"date":"30 July 2019","review":"I love the show so much and think it's one of the best Disney channel shows ever.<br><br>I'll be honest I wasn't to fond of not having the laughing track behind the comedy moments. However after. Awhile I got into it and really enjoyed the movie.<br><br>It brought me back to the Disney channel original movies of my childhood and I loved that.<br><br>I think it's great that they made the film look a little more Cinematic.<br><br>This is a great addition to the show and worth s watch for any good luck Charlie fan but defo no where near as good as the show it's self but it fits in nicely.","user":"rosswilcock1","rank":[1,1]},{"title":"Love the show, hated the movie, just awful","rating":1,"date":"2 December 2011","review":"I love the show and was looking forward to seeing the Christmas movie after watching previews for almost two months. But OMG what a disappointment. Terrible writing and boring unoriginal story, but the biggest problem was it just wasn't funny, like the series is. The few semi funny moments were in the previews, so obviously they weren't fresh. The mom who is usually over the top anyway was a total train wreck, The grandma was someone you'd like punch in the face and then kick her while she's down. It's like a Griswold movie gone bad. After about 70 minutes I finally walked away in total disinterest while my wife and kids fell asleep, so I don't know how it ended nor do I care. Yeah I'm sure it ends on a positive note, but still no ending could make up for the 70+ minutes of pure garbage I watched. Such a disappointment...<br><br>I have no idea if it was the same writers who do the series or what but this movie really hurt the show which is one of my favorite family comedies. Really too bad. 1 out of 10","user":"dcobbimdb","rank":[9,26]}]