[{"title":"A triumph of the Human Spirit: Endurance and Perseverance","rating":8,"date":"31 January 2017","review":"\"Unbroken\" is based on the excellent award-winning inspirational book (2010) by Laura Hillebrand, who has an eye for detail and description. It is a biography of the exciting life of Louis Silvie Zamperini of Torrance, California. This review includes several details that were omitted in the movie, included to clarify certain situations.<br><br>Louis Zamperini (C.J. Valleroy as young Louie, Jack O'Connell in the title role) was restless and incorrigible as a Californian youth. Bullied, he was a juvenile delinquent. His older brother Pete (John D'Leo, Alex Russell), however, began to take more interest in him and became his mentor when Louie decided to run track. Pete rode his bike as Louie ran alongside him; later he ran far ahead. By high school Louie was setting state and national records: \"The Torrance Tornado\" became the fastest high school runner in US history. At age 19 he was already in the 1936 Berlin Olympic Games even though his body was still too young (undeveloped) to win a medal. Nevertheless he surprised even Hitler when he ran the fastest last lap of the 5,000-meter race in 56 seconds. Although robbed of his chance to break a world track record and run an under four-minute mile at the now-canceled 1940 Olympics, Louie continues to train in the vain hope that war will end by 1944, the next scheduled games. <br><br>At film's beginning Louie is a flight lieutenant, a World War II bombardier on a B-24 Liberator that has just completed a successful raid on the Japanese-held island of Nauru in the south Pacific (1943). Although the airplane is shot up and crew members are wounded, the crew limps back successfully to base at Funafuti (now Tuvalu). The next mission involves rescuing a downed B-24 crew near the island of Palmyra. But Louie's crew is given \"The Green Hornet,\" an airplane that was not really fly-worthy. Sure enough an engine fails at an inopportune time and the plane has to be ditched over the vast Pacific Ocean (27 May 1943). There was no bail out because of the notorious shark-infested waters. Three of eleven crew members survive (Louie, Phil, Mac); they occupy two rubber rafts lashed together. One of them, friend Allen \"Phil\" Phillip (Domhnall Gleason) has a head wound. The scenes involving the albatross and sharks are as described in the book. Sharks constantly ran their bodies and fins along the raft bottom; the men could feel them (Yikes!). The book describes how more than one of the smaller sharks actually leaped onto the raft; a timely oar saved Louie's head. Then a twenty-foot long Great White slammed against the raft bottom, sending three men into the air. Luckily they landed atop the raft. Francis McNamara (\"Mac,\" Finn Wittrock) eats all of the rationed chocolate, the only food. Eventually catatonic, he expires. In violation of the Geneva Convention, a Japanese Zero strafes them. After a record 47 harrowing days of thirst and starvation at sea on rubber rafts, the two survivors receive both good and bad news: they are rescued by the enemy. <br><br>After interrogation at notorious Kwajalein, where prisoners were previously executed, Louie and Phil are eventually sent first to Ofuna Prisoner of War (POW) camp, then Omori in Tokyo Bay. Right away Louie is targeted by sadistic Japanese Corporal Watanabe (\"The Bird,\" Takamasa Ishiara), who constantly beats him unmercifully. Although the Geneva Convention excludes officers from work details, many are forced into labor. Not working meant that one-half of the already meager rations were cut. Getting enough food to avoid starvation was problematic because of pilferage. Foods allocated for prisoners were stolen by both Japanese military and civilians and sold on the black market. Although Red Cross relief packages had been sent to the POWs, they too were confiscated. To avoid starvation, POWs had to do their own pilfering! (At war's end 1500 unopened Red Cross boxes were discovered locked in a prison storehouse!) The book further describes how Louie and other men were used as test subjects for experiments in biological / chemical warfare. Cloudy liquid forcibly injected into arms caused dizziness and nausea.<br><br>Serendipity strikes Louie when Japanese intelligence discovers that American military has mistakenly assumed his death. Knowing that the capture of an American Olympic athlete has propaganda value, the Japanese allow Louie to radio broadcast a harmless message that he is alive and well. After that Louie gets a nice meal in a Japanese cafeteria. But Louie is soon approached by high level Japanese civilians, who want him to disparage America over airwaves. As Louie cannot act in good conscience, it is back to POW camp with Watanabe. Towards war's end, Louie is transferred to the grimy coal barges on Japan's west coast (Naeotsu). War's end and homecoming cannot come soon enough (1945). The instincts that helped Louie endure his mutinous youth had helped keep him alive in despairing situations. Although his post-traumatic stress disorder and religious conversion were skipped, closing captions briefly explain that Louie married and later returned to Japan to forgive his captors for their cruel treatment. The exception was Watanabe, the Bird; he was assumed dead. Not until 1997 did Louie discover that Watanabe was still alive; he died in 2003. The ending shows the real life footage of Zamperini as an old man running the torch for the Winter Olympics (1998), not far from his old POW camp. Louie lived until 2014, dying just a few months before picture release.<br><br>Although the movie doesn't cover Louie's post-war years, it is still entertaining. It was nominated for three Academy Awards and won several others. One should not expect the picture to be as detailed as the book. Perhaps the feature could have been extended by, say, thirty minutes; Angelina Jolie directed. The screenplay is decent enough and Roger Deakins' cinematography is excellent. Jack O'Connell plays the tough Italian wonderfully and is inspiring as a man constantly beaten down but who mentally defeats his enemies.","user":"romanorum1","rank":[20,21]},{"title":"A good introduction to the book","rating":8,"date":"10 July 2015","review":"I never compare books and movies, but one thing the book has over the movie was the distinct unpreparedness we had for war. The planes were flying deathtraps, and the supplies were totally inadequate.<br><br>Angelina Jolie had to make decisions about what to include and exclude in a two-hour film, so we missed a lot of important information that was in the book. No matter, the film itself was well worth watching. Not a great film, but entertaining.<br><br>If you want to be shocked and angered at the aircraft manufacturers, the military that failed to supply the troops ( where have we heard that before?), and the absolute barbarity of the Japanese in their prison camps, buy the book.<br><br>Come to think about it, watching the film will help you appreciate the book so much more.","user":"lastliberal-853-253708","rank":[39,45]},{"title":"Fabulous story, and troubling, but also weirdly bland, despite first rate filming...","rating":7,"date":"10 February 2015","review":"Unbroken (2014)<br><br>Heartbreaking, inspiring true story, told and directed in straight up high quality realism. There is some true intensity in the fighting scenes, in the survival scenes on the raft, and in the prison camp with its torture and hardship. And this is balanced by determination and hope.<br><br>If that sounds generic, in a way that fits—the movie follows some tried and true formulas. The beginning has us with the hero, Louis Zamperini (played by Jack O'Connell), in a big bomber heading for some targets against Japan in WWII. As trouble begins, leading to the crash which makes up the real start of the movie, we also get flashbacks to his simple Italian-American childhood. This is effective, but it's sentimental stuff. And it lets you know the kind of wholesome intentions of the movie.<br><br>There is a lot going on here, in three main sections: running, surviving on a raft, and the prison camps. That Zamperini suffers and endures is the point of the film, and in that way the narrative is very straight forward. There are villains and buddies. The skies rain bombs and the sea is full of sharks. Some people are merciless, and others kind. But in the middle, through every turn and travail, is Zamperini. \"If you can take it, you can make it,\" is a mantra in the film, and that's the message.<br><br>The direction and photography were first ratevery subtle in a spectacular way (or vice versa). It's a truly fine film, and director Angelina Jolie (in her second feature, after a terrible first try) does a really good job. The story, co-written by the Coen brothers and others, based on a book by Laura Hillenbrand, is a great bit of history, quite sensational stuff.<br><br>So why did we leave the movie feeling just so-so about it all? I'm not sure how to nicely say this, but it's really a good story, well told, lacking some quality of surprise or depth it really needs to rise above. As amazing as the photography and editing (and so on) are, it's all in service to a fairly ordinary kind of story. Not that this man's life is ordinary at all, but the way it develops and is told is oddly routine, as narrative storytelling.<br><br>Good stuff, for sure. It's a bit hard to take sometimes for its brutality--there is a lot of graphic, personal violence--and the Japanese camps are portrayed as truly cruel (which many in Japan object to). But it's an impressive movie in many ways.","user":"secondtake","rank":[58,75]}]