[{"title":"Hayride","rating":2,"date":"5 April 2015","review":"How to describe \"Hayride\" ? A rather pointless slasher flick, a genre that by 2012 had been a cliché&nbsp;for two if not three decades. Here we see a mysterious character - mysterious in a sense, because there is never any doubt as to his identity, not that it matters - murdering people left right and centre, guys as well as gals just in case there are some in the audience who might be tempted to play the \"violence against women\" card. Audience, what audience? Heck, would anyone watch this if it were not on YouTube? Seriously, as someone said of a Snoopy Green film, I saw it for free, and I still want my money back.<br><br>If you are into gore, very weak special effects, the occasional shriek of a damsel, and a mystery that can't be solved because it is really no mystery, you might find something of interest here, or as Abraham Lincoln said once, people who like this sort of thing will find this the sort of thing they like.","user":"a_baron","rank":[10,12]},{"title":"A bland ride","rating":3,"date":"9 April 2013","review":"There is a reason I don't watch many slasher movies, and movies like  \"Hayride\" are exactly the reason. It's not that I expect something new  or mind blowing, but sometimes I just wish more creativity was present.  And maybe more care. I can't for the life of me imagine anything that  would be more boring in the world of film than to sit down and write a  slasher script. What would be the point, even? Evidently there are  people who just love it, and that love making them, and \"Hayride\" is  just feeding it with the same snooze.  Besides being based on the redneck version of Haunted Houses, \"Hayride\"  is dressed in the same cloth as any other \"masked-killer-returns\"  horrors from late 70's an onwards. The movie is set on Halloween, and a  guy is returning home just in time for the Haunted Hayride. He is  bringing his girlfriend, but has made sure she understands where she's  going, telling her about his uncle, as well as his uncle's favorite  story to tell: the legend of Pitchfork. Pitchfork is said to be out  there looking for his daughter who ran away, but is the legend really  true? Pitchfork is the main focus on the Haunted Hayride. The only  problem is that the Pitchfork mask is gone, and little do they don't  know that someone else is taking upon the role of Pitchfork. Or is it  the real Pitchfork?  How did I do? Did I scare you enough? Did I build up lots of tension?  Did you start to question whether the legend is real or not? The movie  sure didn't do any of that. Now, it's not as bad as some backyard  flicks in its production, but at least those you can accept for the  fact that they are made with little care to begin with. \"Hayride\" is  low budget, sure, but it has the bland characters, unimaginative  antagonist and yawn-inducing violence that has nothing to do with  production values. There are some issues in the production values  themselves, but that's nothing new. You're quite prepared for stale  performances, day-for-night shots, pointlessly added CGI rain and blood  squirts, and so on. It's not really an issue for the movie. Of course,  it doesn't help it either.  The movie does try to give us a justified back story, and to its credit  it's not terrible. But they tell it in a really cheesy way, with an  overly stylized frame around the flashback, and it's really pushing it  in length. The story itself, that Pitchfork is out there looking for  his daughter that ran away, and killing everyone in the way, isn't too  shabby at all. It might not break new ground, but it's at least on par  with some much superior movies' back stories. And that's quite a  compliment, I think.  The kills in the movie are often nothing attention-worthy. I did enjoy  one kill somewhat: when someone wearing a cheap Jason Voorhees mask is  hit in the face with an axe, and the mask sticks to the axe. Even  that's stretching it. But I guess it's a simple thing to do, but was  creative enough to stand out in an otherwise lackluster slasher. The  amount of gore and blood isn't great, but it's enough for me to not be  overly annoyed about it, and just little enough so that I don't take  much notice.  \"Hayride\" might appeal to some huge slasher fans. We're talking about  those who also love the hell out of the post-\"Scream\" phase that ended  sometime in the early 00's. \"Hayride\" isn't much more than that, and  probably worse than many of them. It's more in style with \"Friday the  13th\" and \"Texas Chainsaw Massacre\" (if you only count the chase scenes  towards the end) than \"Scream\", but you get the point. It's a slasher  flick in 2013 (2012), and it does absolutely nothing to break the mold.","user":"filmbizarro","rank":[10,13]},{"title":"Hayride: Not as bad as they say, but still bad","rating":3,"date":"25 August 2017","review":"Starring Kindergarten Cop (1990) bad guy Richard Tyson we have this generic slasher with antagonist Pitchfork. Big well rounded masked individual with *Drumroll* a pitchfork.<br><br>Full of bad editing, cut away deaths (A real pet hate of mine) and little originality this slasher flick really doesn't bring anything new to the table.<br><br>Revolving around the men and women providing the annual \"Hayride\" a scary tractor trailer pulled night time experience and our pitchfork wielding maniac.<br><br>The ending is pretty dreadful as is the film, but it has it's merits you just need to dig really deep to appreciate them.<br><br>The Good:<br><br>Richard Tyson<br><br>The Hayride experience is kind of neat<br><br>The Bad:<br><br>Very generic<br><br>Poorly edited<br><br>Awful ending","user":"Platypuschow","rank":[5,6]}]