[{"title":"Great Metaphor for a Complex Concept","rating":9,"date":"13 October 2018","review":"This film is weird.\nThis film is hard to understand.\nHowever, this film does an outstanding job at visualizing a complex concept that I feel like many people in this world go through. (in my opinion that is self acceptance, however it can be way more than that).<br><br>If you thought this film was weird. Do yourself a favor and revisit this film later on in your life, because it will help you understand a lot of complex things.","user":"taz-41685","rank":[10,14]},{"title":"An Amazing Visual Journey!","rating":10,"date":"14 February 2019","review":"This film is an amazing visual journey. As someone who has been a fan of science fiction for most of my life, I have to say I have never seen a story quite like this. The acting is spontaneous and yet well thought out. I particularly liked Greg Bennick and his quirky acting style. The direction is fresh and fascinating. The plot will leave you guessing till the end. If you want to see something unique, somewhat experimental, and a thinking persons science fiction film, don't miss 7 Splinters In Time.","user":"hypnomezmer","rank":[7,9]},{"title":"Great - Breaks all the Rules","rating":9,"date":"16 July 2018","review":"Don't watch this if you like to be spoon fed and love predictable formula movies with middle of the road plots and no intellectual challenge.\nDo watch this if none of the above appeals and you are bored with the constant diet of mundane plot and ever more fantastical, loud and spectacular special effects to wow the audience and make up for the lack of anything else of real substance.\nDon't get me wrong, I did find this movie challenging and expect that most people will.\nThere is a common formula that starts a movie with a key event then traces the path of the characters leading to that event. This film starts with 2 key events, one a news report and the other a road incident, then goes on to demonstrate that the key events in the road incident never actually happened at all and that it was only one of a number of possibilities. The actual key event in the road incident that occurred to the characters is in reverse to that remembered by the central character, who then spends the rest of the movie trying to undo that event. This ultimately results in the key media report shown in the beginning. In even attempting to write this review, I realise I can in no way do this film justice, such are the complexities in the ideas behind it. The real plot of the movie does not get disclosed until the middle section and I can empathise with those who could not wait for it and conclude that it is some kind of acid trip; but a little patience and an open mind will give you a lot back. Sort of movie that needs to be watched a couple of times to get a good handle on the key ideas and expect it may become a cult classic with those who can come to grips with it.","user":"paj-79755","rank":[17,30]}]