[{"title":"It's alright.","rating":4,"date":"20 June 2014","review":"Not bad for a man hunt movie... but not really good either. It was a bit too drawn out and the acting was weak although not abysmal. But the protagonist had a motivation other than just surviving because he was in the wrong place at the wrong time, and although at times he was kind of stupid he was not just a clueless twit like so many 'victims' are in such movies. The \"bad guy\" was fairly well played, and at one point when he is injured, he plays it consistently which is nice. There is also one of the neatest little minor characters about half way through which i enjoyed. If you watch the movie you will know what I mean. In fact I didn't see any completely unforgivable incongruities, so all in all I say give it a watch if you have the time and nothing better to do.","user":"sstetsko","rank":[5,6]},{"title":"A good-looking low-budget that could have benefited more from better writing","rating":4,"date":"11 August 2014","review":"Not a terrible movie but not a great one either. The Backpacker in its favour is a very good-looking movie, one of the better low-budget movies I've seen recently, with rural Australian scenery so striking and authentic in atmosphere and for low-budget it's very atmospherically lit and stylishly edited with no signs of trying to be too flashy. The photography is impressive and really makes the most of the beautiful scenery. The music score has a real spooky element to it, helped by the impressive sound quality, the movie has its heart in the right place and gives off the sense that it knows what it's trying to do and be and Vincent Stone while going overboard on occasions does strike fear in one's heart. The rest of the actors are not really to his level however, Nathan Waring did come across as wooden and never makes you believe that his character is part of the military and Laura Andersen doesn't strike much enthusiasm either. You never really get to know much about the characters let alone care properly for them, like with Ben Cross you know that he is part of the military but that's pretty much it for him, we know Malek is calculating and out for revenge but his motivations are a bit vague otherwise and it's not clear why Nina would willingly go with somebody she'd literally only just met. The story is well-intended but was too drawn-out and lopsided, the first half-hour was basically just throw-away filler and it was at that point when the movie started to get going. Albeit not ever quite with enough momentum or tension, the latter of which was dissipated by some of the action that would have made things nail-biting being off-screen. The dialogue is rather stilted and could have been structured much more tightly with parts lacking any kind of expression. Overall, looks good but not as involving as it could have been. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[2,2]},{"title":"\"An Insult to One's Intelligence\"","rating":1,"date":"24 April 2015","review":"So much necessary criticism to level, so little space.<br><br>At the top of the list of things wrong with this film is that it was made in the first place: In the absence of a sensible, coherent script, there is no excuse for this film ever getting off the ground or attracting finance.<br><br>Second, it was actually released: In the absence of any pride in one's work or respect for one's audience, those involved should NEVER again work in this industry.<br><br>In equal third place are the oh so numerous problems within the film, which, to detail, would require touching on every single scene. Every single scene! We ain't wasting that much time here.<br><br>But, to give some sort of impression of the level of 'bad' we're talking about, this is a film where a stalker/hunter gives his victim/prey a mobile phone so they can \"stay in touch\" (as you do), with which the idiot victim never once uses to call the police -- or anyone for that matter.<br><br>And if keeping in touch via phone is not enough, the hunter tracks his victim -- not with a GPS, or radio-wave, or any sort of credible technology -- but with a wait for it a volt-meter.<br><br>A volt-meter. A volt-meter? Yes, a volt-meter.<br><br>There is NOTHING redeemable in this film. EVERYTHING is poor: script, direction, acting, dialogue, characters, story, logic and believability.<br><br>There is no possible future for these film-makers -- and I use that term loosely -- nor should there be. And, being an Aussie myself, this woeful attempt at film-making does Australia a gross disservice.","user":"elliottecarter","rank":[5,8]}]