[{"title":"Highly recommended","rating":7,"date":"10 October 2015","review":"What a surprise. Very impressive and very Cronenbergian.<br><br>This movie is excellent in almost every aspect, except for the plot that isn't very strong (but has a good ending).<br><br>Excellent cast (all unknown to me, except for an old Rik Mayall in a dramatic role), cinematography, score, direction, practical effects and makeup. Great filming locations and atmosphere. Very impressive acting by the lead actors (Mayall is also great).<br><br>It's too bad that the plot is not strong enough, otherwise I would have given it a higher score. Still, I give it credit for all the elements above, the originality and risks they took and the high quality result.","user":"room102","rank":[9,10]},{"title":"The film depicts a bare, rough and industrial vision of Germany which seemed to be in perfect harmony with the isolation of the main character.","rating":7,"date":"10 July 2013","review":"It was after watching The Call (2013) that I decided to browse through  Michael Eklund's filmography hoping to find other portrayals of  deranged characters. Errors of the Human Body is a title that  immediately hooked me and I wanted to know more. The poster looked  marvelous and it seemed to have won some awards and nominations so I  decided to see it.  Doctor Geoff Burton was once renowned and a beacon of hope to the  medical field, but a rare genetic condition that led to his son's death  ruined him.On the verge of being fired he accepts a job offer in  Germany. The transfer was supported by a young female doctor who was  once Burton's intern and with whom he had a liaison. Once he arrives,  he discovers what Rebekka is working on: a way to have cells  regenerated extremely fast. However, the processes which work in  amphibians seems bound to failure when tested in mammal embryos. This  is until Jarek, Rebekka's previous partner on the project, tries it  illegally on a mouse. Geoff, who was following the scene, steals the  mouse in either desperate scientific interest or a desire to protect  Rebekka's project. From there on, Geoff's mental health begins to  deteriorate as he enters a conflict with Jarek and is plagued by his  past.  I was quite pleased with what strikes first in the movie: the constant  ambient low tune of disturbing music and the quality of the medical  environment which was not portrayed in the typical scientific way, but  was filmed in a way that made it beautiful. The story is quite simple  overall but the flashback of the past along with the deterioration of  everything around Geoff makes the movie really smooth. Geoff Burton's  character reminded me in many ways of the protagonist in The Machinist  (2004).  Eklund really shines in this deranged guilt-ridden persona, although he  might now be typecast as the new crazy actor (that'll give Michael  Shannon a break). The scene at the party with loud electronic music,  bright neon colors and costumes is really a pleasure to see. In the  background, a great deal of moral issues are dealt with, but the first  plane is always about Geoff.  The film depicts a bare, rough and industrial vision of Germany which  seemed to be in perfect harmony with the isolation of the main  character. I couldn't help but wish there was more that was done with  the tools we were shown. In the end it felt like a really lonely and  caustic movie. At least it managed what Splice (2009) didn't; to make  research in medicine look good. I wish there was more and maybe this is  where the movie feels a little short in its unfolding. I think I felt  really similar after watching Antiviral (2012) where I loved the world  I was thrown in and it was visually astounding, but the story left me  wanting for more.  I liked: Constant background noises and music. Geoff and Eklund's  acting. Exploration and depiction of guilt.  I disliked: There was more to do, more to say. Some scenes seemed  unrealistic--for example, a chase scene with a mouse is far stretched--  the protagonist was after all a top notch scientist.  72/100 I'm really going to look forward to future movies by Eron  Sheean. I like his directorial work. I would recommend this to those  who enjoyed Antiviral (2012) and also maybe Upstream Color (2013).","user":"theordinaryreview","rank":[25,35]},{"title":"A Story that Hopefully will be Fixed and Remade","rating":5,"date":"19 September 2013","review":"5.1 of 10. The first 2/3 of this film are technically magnificent, then it seems to acquire the same tumor/virus this modern industrial sci-fi film centers upon.<br><br>There are defects early on that hint at the writer/director failing to understand the subject and not knowing where he's going. Characters have flaws, defects, and strengths that simply don't fit. The acting, setting, filming, and atmosphere, however, make up for it. The story, minus the little defects, is also well told and creates immersion and suspense. Then, maybe in some attempt to become more of an action/suspense film, it becomes nearly a constant cliché and nonsensical for the last third.<br><br>The filmmaker has talent as a director, but really needs help as a writer after the initial idea and plot development.","user":"in1984","rank":[20,28]}]