[{"title":"hasn't aged well","rating":5,"date":"27 September 2019","review":"Greetings again from the darkness. In this age of comic book movies and remakes, creative and artistic filmmakers are to be commended for sticking to their vision, no matter how cloudy. James Franco has put together a most unusual career as both actor and director. Here he takes on both in this adaptation of Steve Erickson's novel, with a screenplay by Paul Felten and Ian Olds. It's a movie seemingly made for movie nerds, but this particular movie nerd, while enjoying some of the homages, mostly found this to be too messy to recommend.<br><br>James Franco plays Vikar, a socially inept loner with a shaved head and permanent scowl. On that head is a tattoo of Elizabeth Taylor and Montgomery Clift from A PLACE IN THE SUN, the first movie the sheltered Vikar ever saw (11 months ago), and the one that initiated his obsession with movies. Vikar finagles his way into the industry - first as a set builder, and then under the tutelage of veteran film editor Dotty (Jacki Weaver) - reaching award winning status as a filmmaker. Along the way, the character of Vikar recalls Chauncey Gardner in BEING THERE. Is he a genius, or so simple-minded that his thoughts are accepted as brilliant?<br><br>It's 1969, and in an early scene, Vikar is interrogated by police regarding the murder of Sharon Tate. This is our first indication that fact and fiction will be blended here to make whatever points the film is trying to make. Vikar befriends Viking Man on the set of LOVE STORY, and we soon realize John Ford wannabe Viking Man (played by Seth Rogen) is a stand-in for John Milius ... a Hollywood legend worthy of his own film. The two new friends attend a beach house party where a group of up-and-coming filmmakers are brainstorming in the living room. Represented are Steven Spielberg, spit-balling a shark movie; George Lucas, yammering about robots; and a young Scorsese and Coppola.<br><br>Vikar is soon attracted to and dreaming of a beautiful actress named Soledad Paladin (Megan Fox). This shift of gears to romance from industry commentary does the film no favors. The film is at its best when Vikar is navigating the waters of a Hollywood in transition, including an old school power producer played by Will Ferrell. One of his scenes has him singing \"Lum-de-lum-de-lai\" in an odd show of power as he attempts to win the girl. Others making an appearance include Danny McBride, Dave Franco, and Craig Robinson - as a burglar who educates Vikar on the nuances of SUNSET BOULEVARD, Erich Von Stroheim, and MY DARLING CLEMENTINE. Joey King has a key role as Soledad's daughter Zazi, and she even sings on stage.<br><br>There are so many nods to Hollywood, that the film plays more like an experimental art project or trivia game than an actual story. The famed Roosevelt Hotel is featured, as is Frances Ford Coppola's (played by Horatio Sanz) out-of-control film set of APOCALYPSE NOW. A quite colorful description of John Wayne is offered up, and the silent classic THE PASSION OF THE CHRIST takes center stage. We even get Iggy Pop and The Stooges at CBGB, and the first song we hear is \"It's My Life\" by Eric Burdon and The Animals.\nA key note here is that this was filmed in 2014, and has been caught up in a quagmire of bankrupt distributors ever since. That could explain the questionable flow and editing, but we can assume the wild camera angles were all part of Franco's plan. It really plays like an experimental film and it covers a few years, though we are never really sure how many. The twist at the end is pretty easy to predict, and unfortunately, it leaves us wondering where an obsession with cinema is likely to lead us.","user":"ferguson-6","rank":[21,28]},{"title":"What a hidden gem.","rating":8,"date":"22 March 2020","review":"Im so surprised at the IMDb rating. And it actually....can give u hope. I liked all the actors and went into the movie not know anything about it. It was interesting I stayed with it. Then...it became more interesting. Then towards the end I was enthralled and even got chills one moment when I realized that there was whole other level achieved and done so sneaky that it makes u almost want to rewatch it again. But the psych level achieved was just enough to make this movie one to remember and even rewatch. Maybe not right away. But it's worth a rewatch for sure. Great movie.","user":"processuvbelief","rank":[5,5]},{"title":"Sleep-inducing","rating":1,"date":"21 November 2019","review":"I like James Franco and I wanted to like this, but after struggling to stay awake through the first 30 minutes I just gave up. Zeroville is more like Aimless-ville. If there was a plot or a point, it certainly didn't materialize in that 30 first minutes. Scenes just happen and don't seem to be connected to anything. There is no character development, and some actors like Seth Rogan are just playing it over the top. Megan Fox comes across as completely wooden. To top it all off, scenes from A Place in the Sun with Liz Taylor and Montgomery Cliff are continually cut into scenes and all this made me want to do was watch that classic. If you're having troubling sleeping , watch Zeroville.","user":"hampersnow-28905","rank":[12,18]}]