[{"title":"\"You Ate My Piano Teacher\"","rating":7,"date":"10 February 2016","review":"\"Freaks of Nature\" is a comedy/horror movie that actually works for a change! It takes place in Dillford, Anywhere, USA, where humans, vampires, and zombies live side-by-side and actually get along, that is, until some aliens decide to pay them a visit. With each \"clan\" pointing the fingers at each other and reading some sort of sell-out plan to the aliens, soon everybody is fighting everybody all over again.<br><br>Dag (wonderfully played by Nicholas Braun) is a high school virgin who is cocksure the luscious Lorelei, who keeps visiting him, will be the girl to end his virginity. Trouble is, Lorelei only \"visits\" because she keeps her dope at his house. Petra (also wonderfully played by Mackenzie Davis) is a hopeless and hapless girl who has had to carry an out-and-out lie about her character since she was 10. She unfortunately falls for the lines of a lascivious vampire who, once he turns her, stops taking her phone calls. Ned (superbly played by Josh Fadem) is a brainiac who wants to keep his straight A school record in tact so he can get a scholarship to an Ivy League school. When he feels he has nothing to live for, he decides to become a zombie. His slow transformation is a scream! Little do they know their town's future will depend solely on each one of them.<br><br>I have read some other comments about this movie that were not too nice. I think they simply missed the point of this movie. Yes, the plot was a little all over the place, but that did not bother me at all. Everyone in this film looked as if they were having a blast, so, that made it fun for me as well. <br><br>This movie is rated \"R\" and was a whole lot of fun. It never takes itself seriously, so why should we? Just enjoy!","user":"dcarsonhagy","rank":[15,17]},{"title":"Don't wait! It may be the next cult favorite!","rating":7,"date":"10 November 2015","review":"This may be the goofiest film of 2015, and I had a blast watching it! It's even more fun describing it to a friend.<br><br>When it was playing at one local Portland theater, with no local reviews and no advertising I knew I had to check it out.<br><br>No spoilers here.I'm just going to say this horror comedy combines vampires, zombies and aliens in a totally original way. Everything is played straight here, this is not just another cheap rip-off.The cast is top notch headlined by Dennis Leary and a very cute Vanessa Hutchins,a number of unknown actors and a few totally unexpected cameos. The film doesn't quite hold together because of various factors,I suspect budget was one of them. Try it, take a chance, you won't regret it.","user":"tomn-4","rank":[38,52]},{"title":"I love monster movies, so I might be a little biased, but I loved it!","rating":9,"date":"13 November 2015","review":"'FREAKS OF NATURE': Four and a Half Stars (Out of Five)<br><br>A horror-comedy flick about vampires, zombies and humans; that all live together peacefully, in a small conservative town, until aliens arrive. The movie was directed by Robbie Pickering, and written by Oren Uziel (who also co-wrote '22 JUMP STREET'). The film stars Nicholas Braun, Mackenzie Davis, Josh Fadem, Vanessa Hudgens, Ed Westwick, Mae Whitman, Denis Leary, Keegan-Michael Key, Bob Odenkirk, Joan Cusack, Patton Oswalt and Pat Healy. I absolutely loved it!<br><br>The story takes place in the town of Dillford; where zombies, vampires and humans have all been living together peacefully, for years. When aliens attack them, the three different species all start fighting again; killing each other off before the aliens even get a chance. Three outcasts teenagers (a human, a vampire and a zombie) must ban together, to save themselves and their town. They must teach their neighbors to overcome biases, in order to do so (of course).<br><br>The film is action-packed, and hilarious; it's also got a rocking 'punk rock' soundtrack! I love the premise; and it actually has a very positive and insightful message, for everyone. It's jarring how quickly it goes between clever comedy, excessive gore and smart social commentary. The cast is awesome, the directing is badass and the script is brilliant. I also love monster movies, so I might be a little biased, but I loved it!<br><br>Watch our movie review show 'MOVIE TALK' at: https://youtu.be/Rd5zIXOxTPs","user":"Hellmant","rank":[37,51]}]