[{"title":"Another great film in the MCU","rating":8,"date":"23 February 2020","review":"I always thought Captain America was a corny \"golden age of comics\" superhero that had long passed his expiration date. I was shocked by how much I liked him in his first film. I was delighted to grow to like him even more in this one. They set up the character beautifully in the first movie, but he explodes as a hero here. It's hard to fault the character or this movie. Not just the MC, but the whole cast was well written and acted here. The action is well directed and tense. Battles feel much more real than most Marvel battles. There was much less obvious CGI than most films in the franchise, and it pays off. This is one of the best Marvel films to date. Lightning in a bottle. A highlight in the MCU.","user":"MR_Heraclius","rank":[39,43]},{"title":"A Thrilling Sequel that Raises the Bar for Marvel","rating":9,"date":"23 March 2014","review":"With Rogers, Fury, and Romanoff previously established, directors Joe and Anthony Russo do a magnificent job at expanding these characters – along with some secondary characters we've seen before – providing more depth to understanding their actions and how they will affect future stories. Sam Jackson has a stronger presence this time around, validating Nick Fury as a main staple in the MCU among the big boys. Captain America is stronger, faster, and a more refined soldier, equipped with better fighting skills and understanding of current technology. Evans plays the earnestness of Captain America's black and white morality with convincing finesse in an age of grey that he has yet to find a comfortable middle. And Johansson progresses the allure of the cunning and multifaceted Black Widow, while bringing a splendid and lively balance to Rogers' straight and narrow.<br><br>Amidst such a tight and clever script, The Winter Soldier introduces a band of new characters, all of whom play a significant role, creating a more layered and conceivably real MCU. Frank Grillo brings the swolling mass of muscle known as S.H.I.E.L.D. Agent Brock Rumlow to life. Emily VanCamp surprises with her portrayal of Agent 13, whom I wish had more screen time with Cap than just two quick scenes. Robert Redford plays Alexander Pierce, a superior ranking Agent of S.H.I.E.L.D., friend to Nick Fury, and representative of the World Security Council. Pierce is a wonderful look into the higher ranks at S.H.I.E.L.D., contributing new insights as to how the organization is run outside of Fury, Agent Coulson, and Agent Maria Hill. Anthony Mackie is Sam Wilson aka The Falcon, an ex-military special-ops paratrooper and a welcomed addition recruited by Rogers to help fight the good fight. Mackie fits comfortably among the cast of veteran actors and should play nicely with the other Avengers.<br><br>Enhanced for combat and strength, The Winter Soldier's presence is terrifying when it comes to any action scene. Sebastian Stan does an amazing job holding his own against his targets and those who get in his way of his missions. My only gripe is that it is not explained how he obtains the immense power and skills he beholds. The connection between Rogers and The Winter Soldier is dealt with true care and excels the story of Captain America from the first film brilliantly. (Be sure to stay after the credits for a nice button leading into Captain America 3.) <br><br>The Winter Soldier is not just a fantastic sequel to Captain America: The First Avenger and The Avengers, it should also be recognized as one of the best sequels ever made. In fact, writers Christopher Markus and Stephen McFeely, the duo behind Thor: The Dark World, the Narnia Trilogy, and The First Avenger, have done such a great job shaping Captain America's story that this movie could almost stand on its own. There are many exciting twists and turns in this well-constructed, political action-thriller, but nothing comes as more of a shock than how important the story is at defining the direction of the MCU. What takes place in The Winter Soldier, along with an awesome mid-credits sequence tie-in, will inherently influence Avengers: Age of Ultron as well as Agents of S.H.I.E.L.D. – which should make the TV series a lot more interesting and reward fans who have stuck by its side.<br><br>Tonally, The Winter Soldier is the darkest story we've come to encounter, raising many deep-seated questions about government and soldiers of war while also taking Rogers on an emotional journey. It also has the best action choreography among all of the MCU movies thus far. Whedon's NYC battle in The Avengers is beautifully shot and written, but cannot compare to the hard-hitting set pieces found in The Winter Soldier, each building up to the bigger whole. The Russo brothers come from a background of directing television comedies such as Arrested Development and Community, and it's extraordinary how well they handle a big budget action blockbuster from cinematography to pacing. They do infuse their own style of comedy with fun references and a cameo other than Stan Lee, functioning properly within the confines of the tone and story. Henry Jackman (Captain Phillips; Wreck-It Ralph; X-Men: First Class) also composes an adrenaline pumping score that sets the right mood every time.<br><br>The biggest fault found in The Winter Soldier is that it does not address the whereabouts of other heroes or where we are in terms of the time line of the other movies. Why can't Captain America call on Tony Stark to help him out or even Hawkeye who is a member of S.H.I.E.L.D. himself. This is a recurring problem we have seen throughout Phase 2 of the MCU in Iron Man 3 and Thor: The Dark World. Marvel Studios needs to acknowledge this hiccup if they want us to continue to believe all of these characters live in the same universe together. You cannot exclude these characters once you have opened Pandora's Box.<br><br>Marvel Studios has hit this one out of the ball park with yet another gripping adaptation for fans to enjoy for years to come. By and large, Captain America: The Winter Soldier succeeds on all fronts. It is the perfect set up for future films and at the same time it increases the value of its predecessors. There is little to argue against its merits and should be regarded as one of the greatest superhero movies of all time.","user":"TyRawrrnosaurus","rank":[354,488]},{"title":"A wonderful thriller, conspiracy and adventure that delivers a great great film","rating":10,"date":"21 March 2014","review":"This film is simply exceptional in every way. The edge it has is delivering the best, grittiest action the genre has ever scene and characters that are as complex as the are fun. Why do I say that? Well...<br><br>What I love about the character is that Steve Rogers has \"I'm-a-man-out- of-time issues\" but he's comfortable with the chaos that it brings. In acclimating himself to this century he is at his best. Yes, most people would be overwhelmed but because of who he is and where he's from, he's able to cope and adapt. The serum that gives him his physical edge also gives him a mental boost. It's his emotions that are raw and unaided. Time has passed since Avengers so we don't get to see his day to day amazement and adjustment. I'm glad they skipped that stuff. What we do see is the man who once represented America and has become alien to America and it's slanted values. The passage of time. Add those struggles to a full blown conspiracy film and what results might just be the best film released all year long.<br><br>Steve Rogers is basically a John Wayne American. The world shifts to him and it's his job to tell everybody \"Here's they way things should be done.\" We saw that in Avengers and even the first film after he gathered his Howling Commandos. Now, the powers that be are a lot more flexible in terms of loyalties and how they're going to get certain jobs done. How he handles this century's gray morality is at the heart of the film.<br><br>Like most men from the 1940's, Steve keeps things to himself and keeps his emotions bottled up. (EX: the first film when he mentions his mother dying of TB and he was even embarrassed when Peggy found him mourning alone for Bucky) So, bringing The Black Widow in to this film gives him someone who is going to draw out his story, because he's never going to offer it up of his own accord. Natasha learns from him. Fury learns from him. Sam Wilson learns from him. Yet, they all give him something in return. Every character used is utilized perfectly and smartly. Falcon for example, is not in awe of the legend of Captain America. This is exactly what Steve wants in a friend and in a fellow soldier, to not have to be Captain America. Everyone fits perfectly in to the plot and allows access to different beats, tones and emotional depth. Yes, conspiracy thrillers need depth and this one has it.<br><br>Captain America is probably the only superhero left in this world of the reboot who is singularly heroic. He doesn't have this dark existential quandary like other reinventions. Plugging that resolute goodness into a morally complex story means he doesn't question what he believes, but he questions whether anybody else does anymore. He doesn't question his foundation but he questions where he has ended up and what his role must now be. The conspiracy element and structure of this story helps in that Captain America is not up on a pedestal being self righteous, he's in a corner and that makes you want to root for the guy. He believes in what he's doing and the viewer is along for a great ride sharing that belief.<br><br>Marvel movies usually establish character early. This one starts out fast but it's got a lot of character in it. The first act packs a punch but does it laying the groundwork for a remarkable third act. They take time showing the issues and you immediately empathize with Steve. Giving us good character depth means the action delivers more punch. And the action here is beyond great. This movie absolutely punches you in the face in the best way possible. The action has advanced a lot from the first film. How he now operates in the world and kicks butt is all very impressive.<br><br>So, this is probably Marvel's grittiest movie and it's also their best sequel to date. There's a dash of humor but there's mostly a wonderful thriller, conspiracy and adventure that delivers a great great film.","user":"fear_da_fro_bro","rank":[421,619]}]