[{"title":"One of the best animated features of all time","rating":10,"date":"6 March 2015","review":"I guess the title kind of gives it away, doesn't it? Still, I'm not one who's given to hyperbole when describing movies, and I'm enough of a critic that I want to nitpick to insane degrees from time to time, but I just can't do it with Song of the Sea. There's just nothing to point out.<br><br>This movie is from the same studio that brought us The Secret of Kells (2009), an almost beguilingly charming movie that brought together elements of Druidic myth, passionate Christian faith, history, and Celtic grandeur in a way that I don't think anyone had ever really seen before. When a studio with such a good first effort under their belt takes five years to come out with a second film, you can bet that it's because they're doing something magical.<br><br>The only real comparison that's able to be drawn is to the work of Hayao Miyazaki, simply because there's not another animated filmmaker out there who's as honest and earnest with their culture's folklore to compare to. Where Miyazaki-san's work is steeped in spiritual fantasy and a love for his home country not really seen since the Romantic movement, Tomm Moore is a bit more grounded in Western storytelling and keeps his myths well interacted with daily life. His stories are a whimsical blend of magic and the mundane, and it's all carried so well that you wish it could all be true.<br><br>The story of Saoirse and her brother Ben is cut from the classic Hero's Journey so closely that you can practically see Joseph Campbell's fingerprints on the screen. In the back of my mind, I was pointing out each and every plot point as it went by, like an eager sightseer out the side of a tour bus. While the story is formulaic, sure, it's executed brilliantly and engagingly. As we so often forget; Tropes Are Not Bad. It's fantastic to see the tools of storytelling so perfectly implemented. It's like watching a master painter or musician craft their art.<br><br>Speaking of which, Song of the Sea doesn't lack for anything in the artistic departments. The visuals are jaw-droppingly beautiful, simplistic in design, true to the Celtic roots of the story, and should almost be listed as a character in and of themselves. This story simply couldn't have been told as well with a different art crew, the dynamic is so tied into the feel and flow of the tale. The score is, similarly, simplistic and heartfelt. It doesn't overshadow anything. There's no bombast or leitmotif to be found, but the music is so integral to the plot that you can't imagine the movie without it. Or not even with more of it, the balance is so fine.<br><br>And to cap it all off, the voice acting is absolutely brilliant. This is what I long to hear, a return to the days when people were matched to roles that they could play, not a parade of Hollywood \"talent\" who tries to buy viewers with recognition and star power. Song of the Sea is loaded with people who can actually ACT in their voices alone, and from the adults straight down to the child actors who play the roles of the protagonist pair, every one is a standout.<br><br>Honestly, I haven't seen an animated film this heartfelt and earnest since The Lion King, which is probably one of the last times that a studio really just threw their cards on the table and said \"let's see what we can really do to tell a story\". Song of the Sea hasn't and won't gross well at the box office by Hollywood standards - which is a true shame, because I can't think of a film from 2014 that more deserves to be seen.","user":"letuotter","rank":[136,154]},{"title":"Really does cast an enchantingly intoxicating spell on anyone watching","rating":10,"date":"11 July 2015","review":"Song of the Sea is perhaps known best for being one of the films nominated for the Best Animated Feature Oscar, and after seeing the film it's easy to see why. It's a beautiful and enchanting film, and one of the strongest of the nominees of what was mostly a solid line-up (one where even the weakest of the nominees, The Boxtrolls, had a lot of fine things about it). And as well-done a film The Secret of Kells is, to me Song of the Sea is the superior film, having connected more with the story.<br><br>Song of the Sea is so wonderfully animated, the character designs have a real charm without being too cute or stereotyped, but even better are the breathtakingly beautiful colours and very handsomely detailed and at its best magical background art. The music score is equally striking, the melancholic and lilting Celtic sound fitting so well and hauntingly with the story's emotional mood. The film contains a beautifully written script, thoughtful, poignant and with many nuances.<br><br>That the story was so easy to connect with was yet another thing that Song of the Sea excelled so well at, it doesn't try to do too much, for one as layered and rich as this one, nor does it feel too slight for the running time. The atmosphere is enchanting, but it was the emotional impact that was even more resonant, it is a subject very easy to identify with and the most emotional parts were just heart-breaking. The characters are interesting and engaging, Ben starts off a little stereotypical but goes through a significant amount of character growth throughout the film that it becomes far easier to warm to him. The voice work is fine, with an admirably nimble Brendan Gleeson and a charming and emotive Lucy O'Connell being particularly strong while David Rawle portrays Ben's development and emotions very believably as well.<br><br>All in all, outstanding film and really does cast an enchantingly intoxicating spell on anyone who has the fortune to watch it. 10/10 Bethany Cox","user":"TheLittleSongbird","rank":[37,41]},{"title":"Song Of The Sea is a triumph of design and animation.","rating":10,"date":"10 January 2015","review":"From the Academy Award-nominated director of The Secret of Kells \"Tomm Moore\"This visually stunning animation masterwork, steeped in Irish myth, folklore and legend,Perfect balance of fantasy &amp; real life.<br><br>A sweet journey of love and loss through Celtic mythology with a unique animation style that I've come to love,Song Of The Sea is a triumph in design and animation,The story was rich and quite impressive as well but after you see this film you'll be thinking about how amazing and beautiful it was.<br><br>Song Of The Sea gets a 10/10 from me and is well worth to be seen in theaters.","user":"sirethan-564-474082","rank":[69,86]}]