[{"title":"Know what you're getting into and you can have fun with Dirty Grandpa.","rating":6,"date":"1 February 2016","review":"Once the credits started rolling for Dirty Grandpa, the only thing I could say was, \"Oh my god.\" It was shocking. From beginning to end the movie is shock humor, gross-out humor, crass, offensive, childish and stupid. But you know what? I laughed a lot. I'd be lying if I said I wasn't entertained throughout most of this movie. Sure, it follows a lot of road trip movie tropes and the perfunctory fight/make-up conflict near the end, but one thing about Dirty Grandpa is that it's consistent. Dirty joke after dirty joke; some of them hit, some of them miss, but they don't stop. Some of these things I never thought I'd hear come out of Robert De Niro's mouth, but the fact that it's him saying it makes it all the more funny. People will say this is a slap in the face to his legacy, but it really isn't. The Family was. Little Fockers was. This movie knows what it is - a lewd, politically incorrect road trip comedy, and it succeeds in that regard.<br><br>What surprised me most about Dirty Grandpa is the chemistry between Zac Efron and Robert De Niro. They have a great comedic rapport that actually feels authentic, which helps the more insane scenes retain some semblance of realism (as thin as it may be). The rest of the cast is enjoyable too, especially Aubrey Plaza as the overtly slutty college girl who continuously surprised me with every grotesque statement uttered from her mouth. Oddly enough, De Niro feels right at home here. It's as if his character from Meet the Parents went off the deep end and decided to go on a spring break road trip with Zac Efron. Seriously, his character is ex-special forces and everything. Efron also proves once again that he's a comedic force to be reckoned with playing the straight corporate man put in awkward social situations.<br><br>I don't know what people were expecting from Dirty Grandpa. Look at the title, look at the trailers. Are you really surprised? It was marketed as a gross-out comedy from day one, and guess what? It's gross. It's vile; it's degrading; it's shockingly inappropriate. Is it a good movie? Not a chance in hell. But the goal of a comedy is to make the viewer laugh, and Dirty Grandpa made me laugh. Hard.<br><br>Now, if you don't like offensive humor, you should stay the hell away from this. Just know what you're getting into before seeing Dirty Grandpa and you can definitely have some fun watching it.","user":"lnvicta","rank":[202,263]},{"title":"Actually funny","rating":6,"date":"23 May 2016","review":"Dirty Grandpa is a comedy film directed by Dan Mazer and written by John Philips. The film stars Robert De Niro, Zac Efron, Zoey Deutch and Aubrey Plaza. After Jason's grandmother dies and just before his marriage, his grandfather asks him to go on a road trip to Daytona Beach, Fla., and there's where Jason learns a couple of lessons from his \"dirty grandpa\". I found this movie really funny most of the time and I couldn't stop laughing at a lot of the jokes. I suppose that a lot of these negative reviews for this movie are from people who think that this movie is against their \"morals\". But it doesn't really matter, cause Dirty Grandpa has been a box office success and a lot of people liked it, including me. Zac Efron is really funny, he has shown that he's got comedic guts over and over again. I am becoming a fan of as I keep on seeing him in these kind of movies . Robert De Niro is also awesome on the role all throughout. I also really liked the supporting characters, especially Jason Mantzoukas as a drug dealer who had me laughing every time he was on screen. Sure this movie isn't nowhere near a comedic masterpiece and nor is it trying to be. It is a fun ride from beginning to end, and despite all the clichés, the jokes are what make this ride worth it.","user":"Genti22","rank":[28,37]},{"title":"Dirty grandpa is not some French love story, nor is it pretending to be","rating":9,"date":"17 April 2016","review":"I usually don't feel compelled writing a review, but when reading most reviews already posted I needed to add the following: People complained about the movie being raunchy and containing too much dirty jokes, what else did you expect.. it literally has the word \"dirty\" in the title. It is not some French romantic love story, nor is it pretending to be. It is a funny road trip story filled with a lot of \"fucks\" and childish (hilarious) jokes which if you like these kind of movies will definitely keep you entertained until the end. And, ultimately it even has a small underlying message to teach you.<br><br>If you are looking for something more serious, then please don't go and then complain after, maybe try checking out something else.","user":"fauvederuiter","rank":[134,206]}]