[{"title":"A snail with a dream","rating":8,"date":"17 October 2013","review":"'Turbo' is a snail that has a dream. He wants to race with the fastest cars in the world, but of course he is just a slow snail. After an accident where he falls onto the road, Turbo starts to turn into something fast; he has lights and nitrous speed. He is then found by a guy called Tito who has a lot of snails that he races. When he sees just how fast Turbo is he wants to enter him into the Indy 500 race (which is what Turbo wants too). He believes in him so raises the money to do so.<br><br>This film sounds like a pretty stupid idea but I thought it worked rather well. It's a whole load of fresh new characters and designs, excellent animation and lovely colours as usual with an animated film.<br><br>The story is a bit predictable of course but it was still an enjoyable film all round. Turbo and Tito are very likable characters. The supporting characters are also good too. I didn't know when I started watching it but you can tell straight away that Snoop Dogg and Samuel L Jackson voiced two of the snails; I liked them two in particular.<br><br>The race at the end is quite fast paced as well which was good and of course he couldn't do it without a little help from his friends.<br><br>It was quite funny overall. It had a really good soundtrack. Also some good quotes which you may remember for a while; 'Snailed it' 'That snail is fast'. It was a joyful way to spend 90 minutes and I think it's one that the youngsters will love, as well as the adults who like animated films in general.<br><br>One of the better animated films released this year (UK). Wreck it Ralph is my favourite but I enjoyed this as much as Monsters University.<br><br>8/10.","user":"tr91","rank":[31,36]},{"title":"A lot of (mostly) innocent fun","rating":7,"date":"29 June 2013","review":"I was lucky to see Turbo at a preview today, and had a great time. I don't want to give anything away, but suffice to say that I greatly enjoyed the movie. The plot's cute, the characters amusing, and there are some hilarious one liners. (As well as a few somewhat more risqué jokes for the adults, although they'll fly over most kids' heads.)<br><br>It's not going to rival Pixar at their best, but it's a lot of fun. I will say, though, that this isn't a film I'd bother with 3D for. It takes a back seat, and is little more than a gimmick. You won't be missing anything at all to watch in 2D.<br><br>But other than that, heartily recommended!","user":"Michael-96","rank":[59,73]},{"title":"Tito, not Turbo, is probably the better champion in the film","rating":13,"date":"13 July 2013","review":"In the traditional plot device for the kiddos, this is about the little snail that could. You don't get too many surprises.<br><br>The treat though is the clever parallel between the two sets of brothers. Tito, not Turbo, is probably the better champion of the film because his character has no superpowers. Rather, it's his naïve yet genuine idealism that's the driving engine behind the movie. In fact, the human characters capture my sympathies more than the quirky mollusks.<br><br>The film should be noted for its effort to present multiculturalism, especially with shout outs about the scene in Southern California.","user":"EBWired","rank":[28,34]}]