[{"title":"An unconventional dramady showing truth in some of life's absurdities","rating":8,"date":"8 July 2012","review":"After viewing this I was shocked at the current rating of just 3.7/10. I'm sure it will start to climb up from that over time. I was never a fan of Jesse Eisenberg but he did a decent job with this. I admit the script could have been better and a few scenes could have used a re-shoot, but in the end the project deserves a decent review so I'm giving it one.<br><br>The story involves a struggling drug addicted mother Penny portrayed by Melissa Leo, her young daughter Nicole and her college age son Eli(Eisenberg). It begins with Eli beginning what proved to be a very ruff day for him, his plan being to drop off mom at rehab and head to a piano audition for a prestigious music school. Simple enough, but when mom finds out the rehab won't accept her because of a clean urine, her &amp; Eli are sent off on a mission for drugs to get her a positive drug screen to get her accepted. Again the simple becomes complicated as her drug supplier Sprinkles played by Tracy Morgan is all out &amp; Eli &amp; his mom are sent out on a mission with Sprinkles &amp; his brother Black to secure his resupply.<br><br>I guess it's fair to say this was a feel good movie of sorts. Don't expect to be ROTFLOL, although it does have it's funny moments. Every character involved has their flaws but overall they are decent people. Please don't dismiss this as junk from the rating, yes I doubt the film will be winning any awards &amp; there certainly wasn't any Oscar worthy performances but it does have redeeming qualities. I was glad I watched it(and I'm normally not a fan of Eisenburg or Morgan)so I recommend giving it a shot. It is at least worthy of a 7/10","user":"Thrill_KillZ","rank":[44,58]},{"title":"I simply enjoyed watching it!","rating":6,"date":"19 July 2012","review":"Well, there are so many movies out there you can so easily do without. That however doesn't mean that some of them are still being some good and fun ones to watch, of which this movie is a perfect example! <br><br>Most people will probably never see this movie, also mostly because this movie is being a low-key and independent production. But really, that doesn't mean that this movie isn't worth checking out. It's nothing to run out for but I see this as a perfect movie to watch on a rainy afternoon or as a way to kill some time with. It's well made, occasionally funny but above all things it's being a very light movie to watch, making this movie easy to digest and simply pleasant to watch, despite of some of its main dramatic themes.<br><br>That's probably the reason why I enjoyed watching this movie; it never gets an heavy or too serious one. It manages to find a pleasant balance between its drama and comedy elements, by mostly inserting comedic ingredients and oddball characters.<br><br>The setup of the movie is very simple, when things slowly are spiraling down for a young piano student, played by Jesse Eisenberg. He gets in more and more trouble with his family when simply trying to take his mother to a rehab clinic. It's fun to watch the situations he gets in, as he meets more and more people along his way.<br><br>It's really a movie that is mostly being carried by its characters and the actors who are portraying them. It might seem like an odd choice for Oscar nominated and winning actors such as Jesse Eisenberg and Melissa Leo to be in this little film but I can definitely see why they wanted to be in it. It's simply being a true actor's movie, in which they are truly able to shine, without having the pressure of a big budget and high expectations and Hollywood producers constantly breathing down their necks.<br><br>I'm only taking off a point on its rating because of its sudden ending. Things didn't really felt wrapped up, at least not to me it didn't. The ending pretty much came out of the blue and I wish they did something more with it.<br><br>Not a must-see in any way but it's simply a movie to have some good time with!<br><br>6/10 <br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[23,32]},{"title":"a drama with levity","rating":8,"date":"26 December 2012","review":"i kept overlooking this movie because one of it's stars is tracy morgan. never thought he was funny, never! and as this film is marketed as a 'comedy' surely the morgan character would not be funny to me. turns out not to be the case. he doesn't play a funny role!<br><br>first, this story is not a comedy!!! second, it's a drama with moments of levity. third, why it is listed as comedy is a mystery to me.<br><br>the struggle of the main character 'eli' to follow his piano playing dream, control his out of control mother, and trying to bring some level of normal life to his sister is the theme of this movie. eli has his own problems, but between his domestic obligations and his academic quest he has little time to address them.<br><br>what we get is a mere look at what he must do in 24 hours if he is to remain sane and true to himself and take advantage of a great opportunity to start a career as am accomplished piano player.<br><br>this movie may have it's weak moments but i doubt anyone can clearly point them out. i became very wrapped up in the eli character and his suffering with his mother and her 'supplier' friends, dealing with 'family', and becoming attached to a girl who obviously cares for him.<br><br>this movie is well worth watching! but please do not expect a barrel of comic laughs. if you approach it expecting that you will be disappointed and end up missing a very well performed story.","user":"cekadah","rank":[17,23]}]