[{"title":"It's not about the war, its about change in perspective . . .","rating":7,"date":"1 January 2014","review":"Hence \"How I live NOW\". I was hesitant to rent this due to some poor ratings but glad I saw it. This is not a big budget movie, but I found that there was enough action to keep me interested and enough military \"gear\" to make the visuals plausible. Some have written about technicalities of the war and inconsistencies thereof, but I think that misses the point. The main character's perspective is dramatically changed by her experiences and she matures dramatically throughout the film. Some have also bagged on the romance, but first love is overwhelming and single focused. It is a simple straightforward film that didn't get too cute. Don't overthink it and you will enjoy it. The feel of the country house makes me want to move to Wales, although I am sure it is only that nice in weather for two weeks a year.","user":"pcleary99","rank":[66,80]},{"title":"From romantic sop to gritty realism, focused through the lens of pop veneer","rating":7,"date":"17 December 2013","review":"Daisy (Saoirse Ronan) is a young, broody, moody, American girl who is sent to stay with extended family in the English countryside. At first cynical about her summer arrangements and outwardly cold towards her jolly hosts, slowly she begins to thaw to their hospitable nature and thus begins to discover something within herself in this new setting – a home away from home. But just as she finds her place in the world, an unthinkable event occurs and everything is thrown into turmoil. In a World War III type scenario, she is taken away from those she now considers family in the first and with only the companionship of her young cousin Piper (Harley Bird), she must journey back across the warn torn English countryside, to the place she wants to call Home.<br><br>It's a curious pick n' mix type story that in some ways feels like two genres melded together. The immediate narrative feels very much like a teen 'chick flick', but this is played out over a dark backdrop that at times feels course and close to the bone.<br><br>To me, the running commentary of Daisy the American girl, outlining her disciplined set of rules and paranoia, felt a little cheesy in its attempt to force home the difference between English and American culture. So too do some of the romanticised elements of country living, such as the young fourteen year old cousin (Tom Holland) who drives without a license, or the dashing older cousin (George MacKay) who raises eagles and will suck the dirt out of a bloody cut. It's a pity because I felt some of the subtler signifiers, such as the character of the motherly aunt (Anna Chancellor), or indeed the setting of the old country home with it's beautiful but cluttered wood interior and the backdrop of rolling English countryside, spoke a thousand words that other forced elements could only ever hope to convey. In this way I felt the scenario in itself, a city girl living in the countryside, should have been self explanatory. <br><br>If you can manage to overlook some of the hammier elements of the narrative, the movie really gets interesting in the build up, and realisation, to war. Movies about atrocities of war generally maintain a degree of separation for the Western World viewer because of differences in geographical location, time or culture. Whereas, where zombie movies may deal with scenarios in a world as we know it, again we feel separated by the fantastical suspension of disbelief that has to be made in order to accept a universe where zombies can walk the Earth. How I Live Now is set in a time, a world, a space that is starkly familiar to our own and so the degree of separation --that this could really happen to us!-- is only a small leap of faith. Indeed, the detached manner of the news reporters add a level of verisimilitude as they sound very much like reports we might see on our own t.v. screens on any given day. And so the rate and horror at which we see State structures deteriorate after the bomb is dropped, can be felt vicariously.<br><br>By actually detaching itself from the politics, How I Live Now manages to depict a faceless horror to war that is far more disturbing than if we had all the answers at the ready. We are never quite certain, for example, what spurred the bomb in the first place: if it was an invasion from abroad or a movement from within. Are the government forces that split Daisy from her male cousins simply making poor decisions on her behalf? We are left wondering who the real enemy is, but that doesn't really matter anyway, as soon we learn that even in a war of 'sides', those caught in the middle can only become victims. The pile of bodies that Daisy shifts through is a scene that echoes real life atrocities and dumps the reality at our door. The story is powerful in this way, because even though it speaks through a 'pop' veneer, still it touches upon the human condition. Our heroine cannot hope to change outcomes outright, but rather, in a grim reality, try only to traverse a topsy-turvy environment haphazardly.<br><br>So overall, does the movie work? Perhaps not entirely for the reasons I stated above. The over romanticised elements may prove too much for some. Again, we have some Lassie Come Home moments in the later half of the movie which bordered on cheese for me. And yet I can't help but feel drawn to this flick – I have to give it kudos for its attempt to nit 'realism' and romanticism together. It's a quirky number with genuine flavour and thus, despite my criticism, manages to stick out in the mind while other more generic movies fade away from memory.","user":"GrowMagicBeans","rank":[56,71]},{"title":"Moderately gripping but ultimately flat.","rating":5,"date":"21 February 2014","review":"There are movies where you automatically suspend belief to enjoy them - Godzilla, War of the Worlds , Star Trek. This is a movie following a similar trend. Maybe this is because ultimately this is adapted from a young adult novel and therefore lacks the coherency and demand for detail.<br><br>As an adult viewer I therefore found this an unsatisfactory view but not so unsatisfactory to stop viewing it until the end. However by the end I came away with the frustration of a weak and implausible storyline, inaccurate facts and a a lack of sympathy for the characters.<br><br>Some people on here rave about Saoirse Ronan but I really do not know why. Her character was initially unlikeable but in theory we should have grown to like her. I did not. There was no clear flow to her character improvements, rather there were sudden developments like her falling in love with her cousin (which was most disbelievable.) Her acting bought little to this character who could have been so richer. On the other hand she does nail the disinterest teenager very well.<br><br>The other supposed main character \"Eddie\" was frankly as flat as cardboard. I felt no empathy towards him and really was quite disappointed he was still alive at the end.<br><br>Given that I could not develop any feelings towards the two main characters this movie was doomed to fall flat.<br><br>The backdrop of a war was equally frustrating. I totally understand that the war was not the major feature of this ;'coming of age' movie.but it did need some credibility to it. Some form of bomb, possibly nuclear hits Paris. Clearly the country is already on heightened alert, given the military presence at the airport where Saoirse lands. These are adolescent children who really would know more about what was going on in the world than conveyed. Instead we are forced to believe that they live some lord of the flies existence. (The 14 year old driving the land rover out of London was highly improbable.) The build up to war is good. You do sense the tension caught in the late night telephone conversations the mother has and the snippets of information from the radio. Oddly the family don't seem to use a television much.<br><br>Then we get the nuclear explosion. This really annoyed me. We know that the family live a long way from London. Near the beginning the boy who picks Saoirse up from the airport says a bus takes 8 hours to get to their house. (Hint that these are American script writers as really they must mean coach.) SO they a probably 200+ miles from London and yet are hit by a substantial blast wave and hear the blast. Inverse square law suspended here. Oddly on the television we see news reports showing the fires with commentary that maybe 100s of thousands died. Given this is London that would imply a relatively small nuclear device as a megaton device would kill millions. Now I was prepared to forgive the blast wave error as it made a poignant visualisation point. However the immediate development of fall out was pathetic. Oddly the fall out was never seen or mentioned again.<br><br>There are hints this is a terrorist type attack yet later we hear that parts of the country are under enemy hands. At one point we do see the 'enemy' who look rather unsoliderish and ragtag. This and the speed of the 'invasion' are improbable to say the least.<br><br>The family (without adults) are evacuated (no rationale reason why.) And soon we discover the girls farming on a communal farm. Wow that was set up rather quick. Our lead female appears defeated already and submissive. There are hints of terrorism again with reference to poisoned water supplies which again is implausible given real life military history.<br><br>The rest of the film revolves around our American lass escaping with the young girl, seeing small snippets of a decaying society (all men are rapists apparently) and trying to return home. It really does not work and the fact that Eddie has lived and is found by them in the woods stretches plausibility.<br><br>In the end we are left with them living on the farm successfully. Seemingly the terrorists or invaders are giving them a wide berth? And we are meant to hope that Eddie finds himself eventually and they live as a new nuclear family.<br><br>Suspend belief, try to ignore the incest and the needless naked running through the forest dream scene and the unlikely ending and yes there are enjoyable parts of this film. But overall its weaknesses overshadow the noble attempt to convey modern war through a teenager's eyes.","user":"andreandpaula","rank":[29,39]}]