[{"title":"Awful Thai Bourne clone","rating":2,"date":"10 August 2015","review":"THE VANQUISHER is possibly the worst Thai film I've ever watched, and I've sat through some of their dodgy horror and ghost flicks in my time. This low budget action film is basically the Thai version of THE BOURNE IDENTITY. It stars Sophita Sriban (wooden) as a member of an assassin squad, working for the CIA, who is betrayed and left for dead by her own team leader (the equally wooden Jacqui A. Thananon).<br><br>Years later, the hunt for Middle Eastern terrorist Wajib sees the two cross paths once more as they become caught up in a needlessly complicated storyline involving the CIA, a crusading police squad, hired mercenaries, and a gang of evil Japanese ninjas. The plotting is completely confusing and doesn't seem to make much sense, leading me to scratch my head for the most part.<br><br>If you thought the writing was bad, check out the action sequences. They're hideously conceived and directed in the most awful way imaginable. Occasionally a scene of gob-smacking awfulness comes along (the CGI train, for instance) to distract you from the general inanity of it all for a few minutes, but only for a few minutes. But then you're back in the B-movie universe of Thai cinema, where the actresses struggle to speak their English lines phonetically and have zero inflection in their voices. It does pick up slightly - very slightly - in the last half an hour, but this is never anything less than a complete dud.","user":"Leofwine_draca","rank":[5,5]},{"title":"All action and no brains...","rating":4,"date":"24 June 2012","review":"First of all, I must say that oddly enough the DVD movie I bought from Amazon is titled \"The Vanquisher\", and not \"Final Target\", so I had to do an actor search on IMDb in order to find the right movie. (And I will go with \"The Vanquisher\" title in this review.)<br><br>There is no doubt about it that this is an all out action movie from start to end, and the action was actually quite good and full of adrenaline. There was a lot of sword fighting in the movie, which was nice, aside from the slightly overdone sword sounds. And being a Thai movie, of course you have martial arts in it as well, and that too was also nicely made and choreographed. And finally, lots and lots of gun fights with all manner of weapons, ranging from handguns to LAWs.<br><br>Now, that being said, then it must be said that there is almost no storyline here in \"The Vanquisher\". There is something about terrorism and four different groups/factions chasing after something. And that was about, and to make matters worse, then there was absolutely no coherent red line in the storyline, the movie was jumping all over the place, trying to tie four different angles into the storyline, but failing miserably. So basically, it was all just about showing as much action as possible in 89 minutes.<br><br>\"The Vanquisher\" keeps jumping back and forth between Thai, English and Japanese language, which was a nice enough attempt, in theory. But the end result in the movie made it confusing and a messy one. Especially the English, sure I can relate to Asians pronouncing English oddly (as I used to live in Hong Kong), but when put in a movie, at least make a proper effort. Most of the times, is was like they just said something they had been instructed and taught, having no clue what they were saying at all.<br><br>The language was one barrier in the movie, but the scripted dialogue itself just added to the abysmal horror. The dialogue was so forced and unnatural, halting at times, it was really gruesome to sit there and witness at times.<br><br>What makes it worth to sit through \"The Vanquisher\" is the non-stop action, and of course the cat-fights (which I am sure there is a massive audience out there for).<br><br>Put your mind on pause and just lean back and enjoy the adrenaline-packed action ride, because \"The Vanquisher\" is nothing more than just that.","user":"paul_haakonsen","rank":[7,8]},{"title":"Disappointing","rating":3,"date":"25 May 2012","review":"Ever since I first saw the (quite impressive) trailer for this movie, I was looking forward to watching it. Well, I finally watched it, and it is a big disappointment. The \"story\" is incomprehensible, and for some reason the dialogue keeps switching from Thai to English and back; it is painfully obvious that the Thai actors have very little idea about what they're saying in English. After a totally wasteful hour, there IS some action in the movie, but it is hampered by clumsy editing and liberal use of shaky cam; some of the action scenes are virtually INVISIBLE. And the less said about the embarrassing CGI explosion effects, the better. 3/10 (or * out of 4) may even be a generous score, but I have to be a little generous, for the incredibly hot Nui Ketsarin. Not only does she have - by far - the most beautiful face and the most athletic and voluptuous body out of all the women in the film, but she also seems - by far - the most comfortable one in the action genre. I want to see more of her.","user":"gridoon2020","rank":[1,1]}]