[{"title":"powerful stuff","rating":8,"date":"17 November 2013","review":"If you watch this, do so with an open mind, and I mean WIDE open.<br><br>It's incredible. While I was watching it I had the thought in my mind of something I read quite recently where some well known voice had derided addiction as disease. He (at least I think it was a 'he') stated that addiction is not a disease as with addiction one can choose to give up at any time, whereas with disease one can not. I.e. If I am an alcoholic, then I can stop drinking and get well, with some will power and support perhaps. If I have cancer I can't simply decide not to have cancer any more. Although this is true in some cases, as in cancer, it's certainly not true of all cases. Addiction is a disease, same as cancer, only it's a different type of disease.<br><br>This film takes a deep, raw look at addiction, from a very interesting perspective. It's a kick in the face of the usual crap which deals with addiction.","user":"ged_b","rank":[7,10]},{"title":"Great movie but not for everyone","rating":8,"date":"27 October 2013","review":"I saw this movie today and it is an amazing film if you can finish it. I do see the fight club similarity and once you understand what's going on it totally makes sense.Seeing addiction personified also helps if you are or know someone who is or was an addict.I found Danny easily able to relate to and once you descend into his madness you can empathize with him. It's almost like someone took the scene from Trainspotting where Marc is going through withdrawal and focused on that. The last two minutes are what makes this movie, how Nicky speaks to you honestly and tries to help you.This films belongs right up there with the likes of Trainspotting.","user":"dawnandmike-829-386543","rank":[4,6]},{"title":"Trippy and insane","rating":4,"date":"2 November 2013","review":"Wow i don't even know where to start... this movie is unlike no other and can only compare to requiem for a dream and fear and loathing in las vegas, those would be the only 2 movies I've seen that are comparable. i gotta say its a pretty tough movie to get through but once you get past the first 15-20 mins its gets more clear, interesting and you start getting a better understanding of the movie and whats going on... (some may be lost). this movie is very crazy and trippy. i did enjoy the ending and it explains the movie more if you were lost...watch this if there aren't many other things to watch, if you enjoyed the 2 movies i stated above you might enjoy this one... it says its a comedy though i didn't find many funny scenes but if some of you are into the dark insane crap","user":"ruskiypotz","rank":[4,7]}]