[{"title":"Wasted potential","rating":6,"date":"4 September 2019","review":"Chappie is the third film from Niel Blomkamp, the director of District 9 and Elysium. Like Blomkamp's previous films Chappie is filled with messages regarding the Earth and its future but unlike District 9, the messages in Chappie ultimately come off as inadequate.<br><br>Chappie has its moments and some great ideas but unfortunately, not a single one of those ideas are fleshed out properly. Chappie's biggest problem is its writing. The characters, their conflicts and interactions, a lack of consequences, rushed and ignorant decisions are what's saving Chappie from being a great film.<br><br>The ending is weak and like the rest of the film, it has no consequences. Not a single point is proven and not a single character dies, for no longer than a few minutes at least. This film handles death like a minor inconvenience after which characters pretend as nothing happened.<br><br>Chappie does, however, have its positives which are mainly the acting and the VFX. Sharlto Copley's motion-capture performance is easily one of the highlights of the film. Hugh Jackman, Dev Patel and Sigourney Weaver also do a fine job with their characters.<br><br>Overall Chappie isn't a bad or unwatchable film by any means however it is a big decline from Blomkamp's District 9.<br><br>Final Grade: 6-/10","user":"Aaron_Kyle","rank":[145,184]},{"title":"Way better than the critics want you to believe","rating":9,"date":"6 March 2015","review":"I thoroughly enjoyed Chappie. I usually don't write reviews, but after seeing the brutal rating this movie is getting I felt compelled to write this review.<br><br>Chappie is a funny, entertaining, and surprisingly sentimental movie about a sentient robot being raised by gangsters in Johannesburg. Most of the criticisms I've seen about one- dimensional characters and illogical character choices are valid, but Chappie's character, the CGI, the humor, and the overall aesthetic of the movie more than make up for these shortcomings.<br><br>Please go see this movie and make up your own mind. I almost didn't go last night because of the negative reviews, but I'm so happy I did. I'm very excited to see this movie again. You leave this movie feeling like you've become friends with Chappie, and I hope the bad reviews don't prevent the sequels from being made.<br><br>If you like Neill Blomkamp's directing and style you will love this movie.","user":"samwturner","rank":[831,1]},{"title":"We need a sequel.","rating":10,"date":"10 April 2019","review":"If there was ever a movie that needed a sequel more than another, it's Chappie.","user":"rdoubleoc","rank":[37,48]}]