[{"title":"The stuff Academy Award winning films are made of...","rating":26,"date":"26 October 2011","review":"Many critics could argue, perhaps convincingly, that \"In the Family\" could be edited from its almost 3 hours to 2 hours, however, the pacing of the film doesn't suffer from its length. And by taking time to develop the almost mundane everyday life of a gay couple raising a young son, the film is actually a bold political statement that speaks directly to every person who thinks being gay is somehow a non-stop sex fest. Because of that, the film makes a very strong point even before the issues at the heart of the movie become front and center. It's a family friendly film where sexual orientation is almost an afterthought of the movie and that is what sets the tone and makes it groundbreaking. That is a long winded way of saying that anyone who thinks the film should fit into a typical 2 hour movie formula, is missing the depth of the story and the emotional impact the pacing creates.<br><br>Many Asian-American actors would say they hate doing accents because they are connected with stereotypical roles, but Patrick Wang's southern accent probably wasn't what Asian-American actors had in mind and in this case it is a testament to Patrick's incredible acting abilities. I am one who thinks directors should direct and not also take on the demand of acting in their own films because both can suffer, but Patrick Wang's acting and directing are both amazing. He has embraced this film heart and soul and it's evident in its emotional complexity and perhaps this is a case where it could not have been as successful without Patrick in both roles. <br><br>In the film the downward spiral starts with the confrontation between Joey (Patrick Wang) and Chad's sister over the will and is a riveting scene that doesn't leave the viewer rooting for anyone, but actually feeling the pain and the point each is making about the circumstances. But for Joey it is the most devastating because everything in his life is gone overnight; his partner, his child, and his home. The loneliness and destruction of his life is powerfully and beautifully created by Patrick's acting and directing making this a heart wrenching film that shouldn't be missed. And the film's conclusion? Emotionally brilliant.","user":"AsianTalentHollywood","rank":[20,25]},{"title":"Groundbreaking, heart moving film.","rating":9,"date":"30 January 2012","review":"Patrick Wang focuses the image in a way that allows the viewer to imagine the other spaces not shown on screen. He also carefully selects each frame to reveal or obscure what is relevant to each moment. I have no other term for it but 360 degree acting. And included in this acting ensemble are architecture, objects, sounds, the movement of dust.<br><br>What startles too is the amount of time taken to get to know people. I can tell that the actors know this time will be taken, that their portraits will unfold in a more natural way because I saw them relax and actually find responses that at times startled them (themselves). Perhaps this is the greatest homage to actors an actor/ director/ writer can give.<br><br>In the accumulation of moments, I felt like I knew this house, I knew what it was to spend time with these people, with this young boy 'Chip', and so when moments such as the trial opened up or we see Joey (Wang)'s shoulders and back of head while he's making a book, emotion came up in me in a subtler way. My experience was less one of spectator and more one of someone who was a friend of this character. At one point, I did utter aloud in reference to Chip, 'please let him come home' in my living room viewing this film all by myself!<br><br>I was reading an interview with Alexander Payne in Film Comment recently and he said something like 'we have no idea yet what a film could be'. I think that Mr. Wang has taken his opportunity and really produced something he himself understands and we all must see. I'm thrilled that the film has been made.","user":"interbini-1","rank":[10,15]},{"title":"As a movie 6/10. As social advocacy 10/10","rating":6,"date":"13 February 2014","review":"Joey Williams (Patrick Wang) and Cody Hines (Trevor St. John) are an interracial gay couple raising Cody's son Chip (Sebastian Banes) living in the American South. When Cody dies, his family and Joey slowly come apart resulting in Joey losing Chip.<br><br>The best thing about this is that it's not a melodrama where somebody is a cartoon villain. It is heart breaking at times. The ending is a tear jerker. The story is important, and compelling.<br><br>However, it must be judged as a movie and not as a social advocacy. For a first time indie, Patrick Wang does a great job of writing and directing. The biggest problem is the lack of editing. At 169 minutes, it is insanely long. There are long moments of nothing scenes. Patrick have these unthinkable long unimportant takes. It begs to be chop in half. It is possible to allow people time to sit and think. But it is not a good idea to force people to sit through nothing. When this movie works, it breaks your heart. When it doesn't work, it's unbearably boring.","user":"SnoopyStyle","rank":[7,11]}]