[{"title":"Come for the inaccurate uniforms, stay for the inaccurate everything else","rating":2,"date":"9 March 2012","review":"This \"documentary\"'s only positive quality might be as a comedy. But then, it's hard to laugh when you can barely stand the shaky cameras, the overtly jarring editing and supreme close-ups that would make even Stanley Kubrick cry out \"enough!\" <br><br>Bad cinematography aside, there's the acting. Apparently all men from the 1860's were jittery, ugly, and maniacal. Yes, War is Hell, and it makes demons out of normal people, but the people in this program are caricatures. This may have something to do with the fact that they hired a cast of Europeans, who do not speak a lick. They only grunt, yell, carry on, and generally make fools of themselves. <br><br>It's puzzling why the producers cast their gaze to Europe for reenactors. Apparently they didn't get the memo that the last Civil War movie was a dud, and that American Civil War reenactors are just dying to help someone get it right. For FREE. Movie producers have a ready-made cast of extras, who only want the privilege of portraying Civil War soldiers ACCURATELY. <br><br>And this documentary is horrendously inaccurate, not only in the minutiae of what the soldiers were wearing or what they looked like (Monty Python's rule about high-ranking people not having crap smeared all over them does not seem to apply here), but also in more important ways. Such as how cannons operate, or when the Federals reinforced the Round Tops, or who was making the decisions about the Federal left flank.<br><br>There is growing research about \"negative knowledge.\" This is the idea that what some people say can actually DETRACT from the sum of knowledge in the world. This program fits that theory. It can only misinform, and one would do well to ignore this unqualified disaster.","user":"geoffawhite1978","rank":[19,25]},{"title":"Valiant attempt, but inaccurate.","rating":4,"date":"21 April 2017","review":"This is entertaining. I will not deny that. However, the factual errors are outrageous. One of the former reviews accused those who don't like it as armchair historians. I have my Master's in History, and have done my theses on Gettysburg (particularly cavalry actions there). I must say that this is highly inaccurate. Watch it if you want to see blood, gore, and action. It is great at making the story intense. Just do not take it for the gospel.","user":"mattvoelkel","rank":[3,3]},{"title":"Not History- Hogwash","rating":1,"date":"11 August 2012","review":"It seems very clear that others who have left glowing reviews of this \"film\" (I have to resist the gag reflex to call this such a thing) Like other reviewers who have stated quite accurately how horrible and inaccurate this presentation is, I add my thumbs down to the growing disdain. As a former re-enactor of the Blue and gray and a proud American, I was incredibly disappointed by this Farb- filled festival of feces. For those who don't know Farb is short for Farby which is a term we re-enactors use to describe inaccuracies in a re-enactors impression of a soldier or collectively in a camp or in a film. The most famous in \"Glory\"- a film I love when a young actor wears a \"Swatch\" his wrist as he waves to Morgan Freeman. Another example would be modern glasses or the scarf you can get at 7-11 with a paisley print. \"Gettysburg\" in this instance is an offense and \"much offense too\" as Hamlet said. The characters NEVER marched in the correct formation in the battle style of that day. And was all style but no substance. I am not only a former reenactor, but I am also a filmmaker myself and I was disgusted by the total lack of focus, and it was evident that the director and the brothers' Scott had no idea how Civil Wr Soldiers fought or spoke. The late Anthony Minghella , director of Cold Mountain, filmed in Romania and he had advisors like Michael Kraus, Don Toriani and the late Brian Pohanka to ensure historical accuracy. Pohanka and Kraus also worked on Ron Maxwell's Gettysburg and Ed Zwick's Glory. This \"film\"(again I gag), should be destroyed and forgotten and the same for all the DVD copies. This is not censorship- it is a mercy killing for the sake of honoring the men who gave the last full measure and ought not to be offended in such a way. This director is about to finish work on \"Killing Lincoln\" A friend of mine is in it, I hope that the director has done his homework.","user":"casjedi","rank":[8,11]}]