[{"title":"A Hero without Principles","rating":1,"date":"10 May 2014","review":"The Amazing Spider-Man 2 has technical merits. However, these merits are impossible to enjoy in a film drowned from beginning to end in the sickening narcissism of both its purported hero and supposedly tragic villains.<br><br>I give you The Amazing Spider-Man: a hero with no principles and no goals. He sometimes cares about a girl and sometimes wants to know what happened to his parents, but day-to-day he really only cares about doing what he wants to do--which happens to be helping people, it seems, because it gives them \"hope.\" And what luck! He gives them this just by being himself. Not by being a better person. Not by sacrificing anything else in his life for the greater good. Just by being strong and smart and doing exactly what he feels like doing because that's how he feels. And look: by being himself, other people want to be like him. What a wonderful message for a self-obsessed age. And watching the box office dollars roll in, it would seem that this is just what everyone wants to hear.<br><br>Ah, but lovable doe-eyed Petey gives up Gwen for the greater good, right? No he doesn't. He gives her up because he can't face the guilt of having contributed to her father's death--his guilt, and his unquestioned inability to give up being a famous public figure, lead to his need to break up (And his principled stand on this issue is so strong that he will renege on it whenever he feels randy). We never see Peter torn between helping people and helping himself. We see him torn between two paths to self-gratification: the adulation of public heroism (and public vilification, which is a kind of adulation) and the love of a single woman. What about Aunt May? No, not her--she's just in the way of Spidey laundry.<br><br>This is the major problem with the reboot: The overshadowing death isn't Uncle Ben's. It's Captain Stacy's. And Captain Stacy didn't die because Peter was self-absorbed. Captain Stacy died because Peter existed. So the standard for Peter being a good person or bad person has nothing to do with his character--it has only to do with his presence. During an over-the-top car chase in the first act, rather than stop a massive truck from smashing through a set of cars (which Sam Raimi has shown us he could have done, assuming equivalence between a truck and a train), Spidey ducks out of the way only to come back after the carnage. This is a hero who says, \"I'm here for you--until it's inconvenient for me, then you're on your own.\"<br><br>The long and short of it is that this Spider-Man is in no way heroic. Superheroes are heroic because, while they could decide that they are unconcerned with our struggles, they still feel a moral obligation to help the average Joe. This Spider-Man seems to feel obliged to help only because, as someone superior to everyone else, the world's problems must naturally fall on his shoulders. Not because someone died due to his inaction--because he's exceptional. And helping inferior people is what exceptional people do. Sometimes. When they're not busy dealing with exceptional-person stuff. Like obsessing about parents who unjustly abandoned them while feeling no responsibility whatsoever for the uncle they themselves abandoned.<br><br>Add to this a pair of villains who go from being apparently well-meaning if somewhat imbalanced individuals to homicidal maniacs due to a single rejection episode, and you have a two-hour cesspool of poorly justified destructive self-obsession. <br><br>Electro could have been a tragic Frankenstein villain. Instead, because a group of random people roots for Spider-Man over him in his first public appearance, he decides everyone should die. Yup--that's his motivation. You don't love me because I'm me? Well, I'll kill you all. Thank you, Columbine.<br><br>Harry's the same. After a five-minute meeting in which Spider-Man refuses give him his blood--which he truly believes, based on a single night's research on a single computer file, is the only thing that can save him from a horrible death that won't happen for another 40 years--Harry decides that Spider-Man needs to die right now. And everyone who dies in the process of saving his own old-age skin is perfectly okay. This despite Harry having been Peter's best friend only 48 hours before--though not because they have a long history together, but because they talked for a few hours and remembered how they were friends eight years ago. And it's not like either of them developed any other close relationships over their entire time in high school and college. (Let that be the only mention I will make of this film's preposterous set of causes and effects--and its Attack-of-the-Clones-inspired need to intellectually dictate emotional importance rather than meaningfully display it.)<br><br>The original Spider-Man had a single moment of narcissism. Count 'em: one. Only once did Peter Parker step up for glory, himself, and his own objectives, and he immediately paid for it with the death of one of the only three people he loved. This new Peter Parker steps up for himself every day as a part of his playground vision of a hero, and not a single screenwriter or billion-dollar audience member seems to care. This Spider-Man says the world should glorify you for being you, and if that doesn't happen, it's the world that needs to change, not you. And that is what truly terrifies me.","user":"tinulthin","rank":[421,606]},{"title":"Too much, too unbalanced and a waste of talent","rating":5,"date":"25 April 2014","review":"I can't say I went in to the theater with high hopes. I did enjoy the first installment of this unnecessary reboot, almost anything seemed like a step up from \"Spiderman 3\", and Garfield felt way more natural than Maguire, and Emma Stone is always welcome. But after seeing the first trailer I thought it seemed like a total mess, and I wasn't convinced by Electro one bit. Unfortunately I was spot on, I hoped to at least get an enjoyable time at the cinema with my friends, but ended up feeling quite uncomfortable and laughing throughout most of the film. <br><br>Garfield and Stone has their chemistry and does their best with the incredibly thin script and cheesy one-liners, but their potential quite beautiful scenes together gets lost in the over-full and messy plot. I can't buy an emotional scene that is interrupted by heavy dub-step and a blue electric guy.<br><br>Oh Jamie Foxx, how did you go from Django to this? Before he goes all CGI-Electro he tries to play the nerdy unseen scientist (with a worse comb-over than Christian Bale's 'Hustle'-look). As Electro it's hard to say how much is his fault, and what can be blamed on the rest, I'd go with the rest. You don't sympathize with him nor do you believe how fast he becomes this super-villain. <br><br>Everything that Dane DeHaan did so well in \"Chronicle\" just feels unnatural and (maybe not misplaced, but wrong) here. And his character development is way too rushed and quite unnecessary for this film, it just becomes another sub-plot standing in the way of what really matters. <br><br>Sally Field does good work as Aunt May, but leaves no lasting mark. Paul Giamatti's Russian criminal is just in the way and only gives a couple of dreadful and laughable scenes. And then there's the mad German scientist named Kafka and I rest my case. <br><br>The action and visuals isn't bad, but still doesn't make up for the low \"trying to be Marvel\"-comedy and horrific soundtrack, a soundtrack that almost itself destroys the film throughout the exhausting 142 minutes. And sometimes it feels like the movie is taking us as an audience to be stupid, with pointers to what is going to happen. I would like to say that you might enjoy it if you just try and see it for what it is, but it's hard, but hopefully possible! It had an interesting start, with a glimpse inside the past and Peter's parents, but it's left underdeveloped, as is almost everything else, to make room for all its action and villains.<br><br>It's amazing how the difference between two big-budget superhero-movies can be so huge, if you put this against \"Captain America: The Winter Soldier\", a great and, opposed to this one, original film. <br><br>Oh how I wish that Marc Webb could have continued with a \"(500) Days of Summer\"-esque movie instead, he could keep the sub-plots starring Garfield, Stone and DeHaan, and it could very well be a great film, and probably not such a waste of talent.","user":"MartinOnMovies","rank":[622,997]},{"title":"Spider-Man more on his plate than he can handle in this sequel","rating":7,"date":"28 July 2014","review":"I'm an unabashed die hard fan boy for Spider-Man. There I said it. You can call me a homer for anything Spider-Man. I wasn't a happy camper when I heard they were rebooting the films that I fell in love with. The first two Raimi films for me were great. The sequel still holding up today as one of the best superhero movies of all time. The first Amazing Spider-Man was a bit jarring for me. I walked out of the film not knowing what I thought about it. I enjoyed Andrew Garfield's Spider-Man but his Peter Parker didn't click with me. I also had some nit picky things about the film as a whole (Gwen instead of Mary Jane, lackluster villain). But watching the film a few more times I realized that I liked it.<br><br>I do research on films that I'm excited for. This film came out weeks earlier in the UK and Europe. And the reviews were mixed which was sinking my high hopes. I didn't like the fact that there were three villains (More on that later). But it seemed like they were choosing the right actors for parts and surrounding the film in talent. After much heart and headache reading people thoughts and reviews for me, I'm okay with saying I liked much of this second Spider-Man film.<br><br>Andrew Garfield is Spider-Man and it seems he's embraced the part much more this time than in the first film. His Spider-Man is having fun being the savior of the city. He's making the quips, the jokes and the all around energy of his Spider-Man feels directly out of the comic book. I am finally sold on his Peter Parker. Director Marc Webb finally lets the smart but dorky Parker shine in a few scenes that are hilarious and engaging.<br><br>I'm still not an Emma Stone fan but she is a good counter to Garfield's Parker. They have excellent chemistry. You can tell that these may be Webb's favorite scenes to shoot. When they are on screen this huge summer tent pole film because a small drama about two people with a unique love story. <br><br>The villains, there are three of them but not really. Let me explain. Rhino played basically as a cameo by Paul Giamatti is really only on screen to show Spider-Man in action at the beginning and end of the film. His main adversaries are Jamie Foxx's Electro who starts off as a man who is saved by Spider-Man. He then becomes a obsessed fan only to in perfect comic book fashion have a horrible accident that grants him superpowers. Foxx is okay, I wouldn't say he is awful. He has some good moments and contrary to what has been written I think he only has one cringe worthy line.<br><br>Dane DeHaan is one of if not my favorite actor working this moment. His method style works so well in many of the films he's in and here it's perfect. His Harry Osborn is less cartoon-y than James Franco's from previous films. He's creepy, spoiled, arrogant but dealt with a lot of adversity. His chemistry with Garfield feels genuine. It doesn't feel forced like it could have been. They are long time friends who have been distant but because of new circumstances are forced back together.<br><br>The action is fun, fast and so Spider-Man if that means anything. The way they use his spider sense was very cool. I want to see more of that. The small nods to the comic book are fantastic. There are nods here and there to the upcoming sinister six film which doesn't cloud the film. It's just there in the story that this is apart of a large story in the future. I was trying to count the nods to the comic books. The only issues I had with the film was Peter's search for what happen to his father was kind of just there to fill time. Also the great Sally Field as Aunt May got only a few scenes. She was great on screen but mostly wasted.<br><br>Because this film is dividing fans I think I've pinpointed the problem. I'm a fan of the comic books and this film feel like a few issues of the comic books aka a mini-series. There are multiple stories, with multiple villains and a lot going on. I'm okay with the finally product and eager to see the film again. For Garfield's performance, the chemistry with Stone and the action scenes this film is a fun ride for any fan of the neighborhood web shooter.","user":"JohnnyPHreak","rank":[44,71]}]