[{"title":"very painful","rating":1,"date":"24 January 2013","review":"I don't normally write film reviews but just had to regarding this, i can safely say this is the worst film i have ever had the misfortune to watch, in fact it was that bad i had to turn it off an hour into it, the acting is diabolical as well as the script, it came off as if a child had written and directed it, a huge killer Bigfoot that walks around the forest tearing people up which you don't see much of and some dippy sheriffs who thinks its a serial killer, its so corny it makes you cringe, it could of had potential if more money was available and they got actors who could actually act, a complete waist of time so watch it at your peril!!! you've been warned.","user":"bear22771","rank":[21,33]},{"title":"This was, uhm, something else...","rating":3,"date":"31 December 2012","review":"Well, what can be said about \"Night Claws\"? For starters, then it really seemed like a movie that should have been made in the late 1980's, because it had that distinct late 80's horror feel to it. And is that good or bad? Well, in a sense it was nostalgic, but entertainment-wise, then it made the movie come off as a joke.<br><br>The story in \"Night Claws\" is about some Big Foot creature terrorizing a forest. It is a vicious and bloodthirsty creature that kills just about any sentient creature that ventures into the forest. Why? Well for no apparent reason. It just kills because it can. There is very little meat on the storyline for this movie, which made it even more hard to sit through and not fall asleep.<br><br>Let's move on to the acting. Where was it? The people in this movie were so unenthusiastic that it was just downright ridiculous. The performances put on by the actors and actresses in this movie was just horrible to behold. There wasn't a single memorable performance here.<br><br>So what worked for the movie? Well, oddly enough, the Big Foot wasn't actually that shabby to look at, the few times you actually got to see it, which was far in between, mind you. And the music wasn't too bad either, though at times it sounded like something from a horror musical of sorts.<br><br>I am giving \"Night Claws\" a 3/10 rating solely based on the design of the Big Foot creature and the 1980's feel there was to the movie, because everything else was not really worth mentioning.","user":"paul_haakonsen","rank":[11,17]},{"title":"Hunters of the beast","rating":2,"date":"2 January 2015","review":"Bigfoot walks around in the forest and kills two young people. Although they have been torn into pieces with incredible strength, the sheriff believes a human killer must be to blame, even if the claw marks seem a bit weird. Several tourists and hunters enter the forest so the beast gets plenty of opportunity to kill more people. Besides, one of the hunters has a personal revenge business going on, for which the beast's attacks will provide enough distraction.<br><br>Hard to believe this movie was shot in the 2010s, it is totally 1980s. Which is good. Instead of CGI creatures, you get an old-fashioned monster (tall guy in a hairy suit) walking around, and there are several familiar actors from 80s trash movies (Reb Brown as the sheriff, Frank Stallone, Ted Prior). Simple minded fun mainly for the older supporters of the genre, probably young audiences will like it less.","user":"unbrokenmetal","rank":[5,8]}]