[{"title":"middling TV","rating":5,"date":"25 June 2017","review":"Amelia Davis (Mena Suvari) writes a newspaper column called Ask Amelia advising her female readers to stand up against their abusers. She starts a blog and is befriended by Jenny Reardon who wrote to her and escaped from an abusive relationship. A year later, she gains some success and is being courted to sell. She is approached by the dashing Carlo Rossi. Detective Hank Wilson tells her that her abusive ex-husband Darryl Devine just got paroled. She is attacked by a mystery masked man.<br><br>This is a TV movie that runs like a Lifetime movie. The flow is a little clunky but the story is generally fine although not that original. There is a good mystery with good twists. The production is straight forward TV. Suvari is the only truly compelling actor in the cast. It's a middling affair that I can't quite recommend.","user":"SnoopyStyle","rank":[1,1]},{"title":"One Of The Better TV-Movie Mysteries","rating":7,"date":"31 May 2017","review":"Though this is a TV movie, so no big budget to play with, the writers Michael Ades and Scott Abramovitch along with the Director Tristan Dubois give the audience a multi-layered tale of stalking and twisted vengeance.<br><br>The premise of the story is pretty basic; Amelia Davis (Mena Suvari) starts a blog after being the victim of spousal abuse and builds a fanbase and following of other similar sufferers of abuse, and tries to help them find a way to leave their violent relationships. However, she is attacked one night and the possible perpetrators are numerous. Could it be her ex, who she helped imprison, though is now out on parole; could it be her new boyfriend who may not be as clean cut as he makes out; or could it be a stalker fan. Once the story gets going the twists start coming thick and fast and each is as believable as the other. It had me guessing right up to the end when it suddenly became painfully obvious who it was... and that the ending even has a twist in its tale.<br><br>Dubois does an exceptional job with the pace of the movie, slowing it down for the more dramatic scenes and screeching it up to maximum to build excitement. This is a well-crafted piece.<br><br>The acting is above average, though the best character is Carlo Rossi who is brilliantly portrayed by Joseph Mesiano. He gets the gets the swarthy, suave, sexy, smooth, smug, and smarmy personality just right as you are never too sure about him and his motives.<br><br>It's all of this which kept me entertained and away from the stop and delete buttons when it came on the telly. To be truthful, I really enjoyed this film and couldn't find much wrong with it at all. So if you like mystery movies this is one to watch. Though, it's not one you would watch over and over again because once it's been solved there's not much else to bring you back to the film. I would watch it again, should I ever forget the outcome...","user":"stephenabell","rank":[1,1]},{"title":"Bad but not terrible","rating":2,"date":"25 May 2015","review":"This is a generous two because I appreciate that they were trying to bring awareness and a sense of survival to domestic abuse and because the sex scene is hot. Otherwise I found the acting bad, the plot a little hard to believe, dialog cheesy and characterization eye roll worthy. The best friend is the bad guy. There was no hint of that whatsoever and for a twist her motives were not a hundred percent clear. Her husband threw a lamp at her so technically she did kill him in self defense. It was nice that they portrayed the fact that women do abuse men but it should have been done better. But is was a TV movie so it is my fault for expecting more.","user":"sarabibliomania","rank":[1,1]}]