[{"title":"By no means a 'B' movie...","rating":6,"date":"4 August 2012","review":"Whether we like it or not we DO often judge movies by the title and/or cover art promo-poster at first. I expected a true 'B' movie here, but what I got was considerably beyond it. It is an intelligent, albeit formulaic plot line, but it also has very intelligent dialog, shot extremely well, and directed substantially better than MANY \"Blockbusters\" we end up paying far too much for.<br><br>Here you have the many clichés and standards of an average budget action flick, but what this movie does is engross you from beginning to end. I would NOT consider this a 'B' movie by any means. It stands aside as a well thought out and inspired piece of film making on the merits of writing, casting, crew, production values and certainly Directing!<br><br>Cuba is truly outstanding here. Best performance in years(I believe). Dolf is...well, still Dolf at his best average, but good casting and acting all around. I recommend this because it surprised me as to certain nuances of actual quality of direction and cinematography AND script writing that is rarely shown in movies of this genre. <br><br>Note: Many people and critics complain of not being able to 'follow it'. That is likely because a LOT of the story and scenes here are INTELLIGENTLY executed and THAT takes a disciplined attention span to pay full attention to what is going on. <br><br>On a side note; and part of what makes the 'Love' interest in this movie so good, is that, like 'Remains of the Day', you can truly feel the wistful melancholy of the 'Inapproachable' aspect of 'Togetherness' that, as much as we want it to be, it has another more romantic aspect regarding the questions that it leaves behind.","user":"transientdreams","rank":[37,51]},{"title":"No one in the chamber when this movie is on","rating":4,"date":"12 November 2013","review":"Another movie filmed in Romania, even in Brasov the town that I was born and live for twenty-five years but still this fact doesn't save this not even the few cars explosions in it. It's just the same scenario with mobster that seeks revenge for the death of their sons, customary shooting, a few tender scenes involving some beautiful girls that plays the role of the lover of one of the mobsters. It has the same elements seen in 6 Bullets and Assassination Games with Jean-Claude Van Damme, movies also shot in Romania.<br><br>So, in conclusion it's not worth your time this filling movie with the same scenarios and story that we are all ready use to.","user":"adi_2002","rank":[8,9]},{"title":"It's a decent action movie. Judge it accordingly","rating":8,"date":"4 August 2012","review":"I read the posted reviews posted about this one and they're massively wrong.<br><br>I'll keep mine brief:<br><br>The movie is rooted in the action and the characters and story are plot devices aside from the lead. The staples are all there (accent heavy thugs, withdrawn lead with a moral dilemma, back story dealing with his obsession with the female lead) and the female lead is gorgeous. I liked that it never resorted to objectifying her. <br><br>This is a hit-man movie. It's not aiming for realism over entertainment but it's not out right silly either. The shooting scenes are well done. The fighting scenes could use a little work since there were points where the use of a stunt double was too obvious. It's a hit-man in Prague playing sides in a Russian mafia war. That's about all you need to know.<br><br>Once the action gets going another player/hit-man is introduced. Dolph Lundgren steals his scenes with a great character that could have been developed more but is fun as it is. <br><br>A more menacing bad guy would have been nice. There are quite a few nasty Russians in this but it's all implied. Some scenes dedicated to showing them as bad people would have helped establish them as such. Don't just allude to him torturing someone. You've got the R rating so stretch your legs Mr Kaufman and let's see the guy tied to the ceiling getting killed so I know the guy doing it is more than just an angry Russian. <br><br>I gave this 8/10 because I judged it based on reception as a fan of action movies. If you like movies about professional killers you can put this on and not be disappointed. It's not Collateral but it's still fun to watch. Go into it remembering that it's a straight to DVD/VOD action movie and have a good time. <br><br>I look forward to seeing what the team behind this does next since this is a big improvement over their previous efforts. As long as they keep learning and striving for more their next movie could be something very cool to see.<br><br>Pros: *good shooting scenes especially with the long range guns *good acting *great locations *coherent and easy to follow plot *fun characters<br><br>Cons: *the script had weaknesses in the dialogue *the shots could have been more stylized *the texture of the film should have been adjusted by the DOP to reflect *the location and set pieces. I mentioned Collateral: compare the club scenes specifically to see what I mean. *the gun play (too many machine guns! don't double fist pistols!) *underdeveloped characters<br><br>8/10 for an action movie","user":"GeorgeWHAMMYBush","rank":[29,41]}]