[{"title":"Intermittently funny, but not the riot it could have been.","rating":6,"date":"14 September 2016","review":"Tina Fey and Amy Poehler are two of the funniest comedians working right now. Sisters feels like the vehicle they need to play out any absurd fantasy they wanted to with no shortage of laughs. In that regard, Sisters is fairly hit or miss. The chemistry between the two of them is electric, and there are a handful of good laughs scattered amidst the almost two-hour runtime. The problems stem from the writing itself. I have no doubt most of the comedic scenes in the movie are improvised, but the forced drama is what drags out the movie. It had no reason to push the two-hour mark. An hour-and-a-half of these shenanigans would have been perfect. By the time the party is over, it feels like the movie could've been wrapped up in the next five minutes, but it continues for another 20 or so minutes with no laughs whatsoever.<br><br>The party scene itself is great, though. The entire plot is based around this party that the sisters want to throw in their childhood home before their parents sell it. Once all the supporting cast shows up, including the ever-hilarious John Cena in another eccentric tough-guy role, it becomes a riot. The scene itself takes up about half the movie's runtime, thankfully. It's the stories surrounding it, like the forced drama between the parents and the whole arc of the sisters having to get their act together, that drags the film down. It's roughly half comedy and half drama, with the comedy elements hitting and the dramatic elements missing.<br><br>When compared to other female led comedies like Bridesmaids, Sisters doesn't really hold up. It's not as funny, it's far too long, and the dramatic beats don't work. But as its own vehicle for Fey and Poehler, Sisters shows a lot of promise, and hopefully they will have a better project together soon.","user":"lnvicta","rank":[29,36]},{"title":"Just dreadful","rating":1,"date":"28 December 2015","review":"This one is truly awful.<br><br>I'm not so sure when I've seen a movie that I disliked more. The only reason I didn't walk out within ten minutes was because I was with two other people. In the end, they hated it just as much as I. All of us, BTW, work in film and publishing. We saw the film at a WGA screening in Beverly Hills 12/27/15....<br><br>Where to begin? The characters are insipid. No one on the screen (I'm speaking here of the characters, not the actors) whom I/we could like. The language was self-consciously profane,meant to be funny but only repetitively offensive. The plot, a big party that destroys a family house, lowbrow and irrational. The more I watched these characters the more I disliked them, their friends and their families.<br><br>There's such a thing as a \"smart dumb comedy\" (e.g., The Wedding Crashers, but this was not it. <br><br>Toward the end of the film there is a massive sinkhole on the family property. If only this whole project had gone down there. Works like this are the problem with the American film industry. They seek the lowest element of audience stupidity and occasionally, as in this case, achieve it.<br><br>To be AVOIDED! A mess!","user":"nhc-42056","rank":[90,136]},{"title":"More like blisters","rating":5,"date":"11 January 2016","review":"Another 2 hour flick!!! After sitting for 2 hours and having about a total of 12 minutes of a few smiles and giggles, your butt is going to be blistered with frustration.<br><br>Sisters is not a bad movie! It isn't an unfunny movie. It's a good movie but - for me - Amy Poehler, Tina Fey just didn't pull the laughs out of the bag as they do in skits on television. Plus it's two hours long and all you get out of that two hours is occasional smiles &amp; giggles. You get tired of sitting and waiting for the big moment of really laughing, which unfortunately never showed up. The big long party scene becomes just that - too long - and the sight gags and shenanigans of the 40 plus year old participants never jells into fun for the viewer.<br><br>Sorry but this flick is just another example of Hollywood cashing in on hot popularity. This time it's the team of Amy Poehler &amp; Tina Fey being offered, no doubt, a fantastic payoff to appear in a rather bloated production of a very thin plot line of a story.<br><br>I'm sure it will be on DVD very soon!","user":"cekadah","rank":[57,84]}]