[{"title":"Great idea, poorly acted","rating":5,"date":"2 November 2015","review":"Not a terrible movie, but certainly not great. I thought the idea was very promising for a horror movie. Storage units are creepy. I'm not sure what happened to Mischa Barton, but somewhere along the line she has completely forgotten how to act. She was just horrible in this. She was constantly over acting and obvious about it.<br><br>The movie itself was fairly decent, not a lot of special effects to ruin it, and a pretty decent twist to the story that I didn't see coming.<br><br>Not a bad movie to watch if you are a fan of horror, but don't expect too much.","user":"tmdarby","rank":[15,18]},{"title":"You've probably seen this before","rating":2,"date":"10 October 2015","review":"I thought this could've been something scary. There actually were some 10 minutes where I was quite scared, but after that first moments of suspense, the rest got too generic and predictable. I did watch it through to the end, although I was tempted to quit more than once.<br><br>The storyline is pretty old and I bet you've already seen it in a few other movies yourself: <br><br><ul><li>A group of people are trapped in some place or another (in a cottage in the woods, on a boat, in some old castle or warehouse) - Someone or something evil is set loose </li></ul><br><br><ul><li>group tries to escape but mysterious things prevent them form escaping </li></ul><br><br><ul><li>instead of staying together, some girl will separate from the others and follow a creepy noise into a dark place (\"hello? is there anybody out there in that creepy forest / tunnel / cave? Maybe the psychopath that killed my boyfriend / husband / friend 10 minutes ago?\") </li></ul><br><br><ul><li>another girl will try to run away, being chased, then trip over nothing, and stay there screaming while \"the evil\" hunts her down etc. </li></ul><br><br>You know those ingredients - you've seen them often before.<br><br>The only thing new here to me was the setting in an underground self-storage, which I thought had some original ideas that served those few scary moments.<br><br>I feel kind of sorry for the director. It feels like this is the desperate (but futile) attempt to fulfill his lifelong childhood dream of producing a super scary blockbuster. In a \"i can do it\" and \"nobody can stop me\" brute force way, he tries to patch up all those holes in the illogical and inconsistent story just to quickly get to the end.<br><br>If you don't watch this - you won't be missing out on anything...","user":"Bumble7","rank":[22,30]},{"title":"Wasn't all that bad.","rating":4,"date":"11 October 2015","review":"This right here is a combination between Creep and Blood Shed, heading more towards the second one sadly, Creep being quite an OK horror. Still why the hate? Between a big budged horror with known actors and a little poor project, lately, indies are doing far better than those massive productions. At least here I have no expectations and often enough I end up impressed.<br><br>So, I'm going to jump straight to the bad part. The kills! You just don't get to see too many, and when they do happen, they are kinda hidden, masked, budget clearly didn't help a lot so they made the best of it I guess. Considering this is a horror movie, of course we would like to see some nice kill shots but it is just not the case here.<br><br>Secondly, the acting, was bad. It is quite amateurish like, either over the top or just no soul whatsoever. The dialogue itself is another minus to the movie, rather lousy job here.<br><br>Overall, I graded it a 4, it does provide some tension, has a better plot than most, it did kept me waiting for more and it worked fine for one late raining night. I love horror, so I tend to be a tad bid tolerant to this genre. <br><br>Cheers!","user":"gothic-fiction","rank":[14,18]}]