[{"title":"A very good movie with an art house type quality. Casting is perfect & I recommend but not for everyone. I say B.","rating":7,"date":"3 April 2013","review":"\"You have me to get you started out\" Charlie Rankin (Dorff) has just got out of prison and stops in to see a man called \"The Buddha\" (Dafoe) who was writing him in prison. He is told about someone he is to murder for him. When the murder goes wrong Charlie begins to worry about what will happen. Him and a woman named Florence (Monaghan) begin to hang around together and Charlie thinks it will help, but he isn't sure of anything anymore. I have to start by saying that I did enjoy this and I recommend this movie but it is not for everyone. While not a total \"art-house\" type movie it is in that vein. The movie is more of a character driven type movie then I was expecting, but I really think that helped the movie. Dorff is good in this and Defoe has a strong and powerful presence even though he is only in it a few minutes. This is not really a fast paced movie but it will keep you watching right up until the end. I liked it. Overall, not a movie for everyone but well worth checking out. I say B.","user":"cosmo_tiger","rank":[26,40]},{"title":"Tomorrow Your Gone a.k.a. Boot Tracks is a \"B-flick thriller\", recommended only for a fan of...","rating":3,"date":"18 February 2013","review":"Tomorrow You're Gone a.k.a. Boot Tracks is a Thriller that centers on Charlie Rankin (Stephen Dorff), who prior of getting released from prison gets a message from his \"mentor\" - \"The Buddha\" (Willem Dafoe) to kill somebody... But the murder goes wrong and Charlie gets seriously effected by it... meanwhile Charlie begins to have some serious hallucinations because of his past and because of what he's doing... On a way he meets these mysterious girl Florence Jane (Michelle Monaghan) who reminds him of someone he used to know and together they embark on a mysterious journey...<br><br><ul><li>Tomorrow You're Gone is a typical B-class movie, directed by the director of \"Down in The Valley\", David Jacobson and starring Stephen Dorff, who does his usual thing, Michelle Monaghan and Willem Dafoe in a small but efficient part as he gives the movie more class...</li></ul><br><br><ul><li>I wouldn't recommend this movie to everybody, but as long as you're a fan of any member of the cast or if you like these kind of movies...then go for it, if not just \"forget about it\" cuz it's not worth it.</li></ul><br><br>PS: it's only 88 minutes long..","user":"Atdheu90","rank":[18,29]},{"title":"\"The eyes are the windows to the soul--You gotta learn how to draw your curtains\"","rating":6,"date":"20 March 2014","review":"TOMORROW YOU'RE GONE is no thriller, which is not, of course, an entirely bad thing. It's a strange, dreamlike, and fairly uneventful film about Charlie Rankin (Dorff) being released after a four-year stint in prison, intent on wreaking vengeance on those who put him there and performing \"hits\" against adversaries of \"The Buddha\"(Dafoe), another former--now dead?--inmate who acts as his ethereal mentor. He also meets \"Florence Jane\" (Monaghan) the girl of many-a-guy's dreams, but not Rankin's, who just wants to be friends with her. Florence Jane, it would seem, is a sort of guardian angel figure save, perhaps, the \"guardian\" part. Much of it is open to interpretation, and much of it simply doesn't make a whole lot of sense.<br><br>More thematic and atmospheric than action-oriented, TOMORROW YOU'RE GONE is well-filmed and well-played, and much of the script (especially Florence Jane's) is quite memorable without being overly pretentious: See the quote from \"The Buddha\" used as my title here. TYG also has things to show and tell us about the futility of vengeance, the destructive nature of bitterness, and various other things.<br><br>If only the plot were better. . .","user":"doug_park2001","rank":[5,6]}]