[{"title":"Rip-off of \"Groundhog Day\" is actually very enjoyable","rating":7,"date":"30 November 2017","review":"I HAVE REVIEWED OVER 400 (C H R I S T M A S ) MOVIES AND SPECIALS.<br><br>SO PLEASE BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I REVIEW MOVIES &amp; SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY \" C H R I S T M A S \" MOVIES AS I CAN. <br><br>In this film Amy Smart plays Kate. The character finds herself reliving Christmas Eve (including a blind date with a man named Miles) over and over again. She must discover how to break the cycle – should she attempt to win back her ex-boyfriend Jack, or should she pursue Miles, or something else? <br><br>I love everything this movie did. I love the fact when Kate realizes that \"she will relive the same day over and over again\" she decides to feast on every dessert imaginable. <br><br>This film also had lots of heart and its one of the better Christmas films. I will watch this again.","user":"Christmas-Reviewer","rank":[23,26]},{"title":"Groundhog's Christmas Day","rating":7,"date":"31 December 2011","review":"I liked this move. It is sweet and good hearted. But it is, more or less, a remake of \"Groundhog's Day.\" And that's not saying that is a bad thing,<br><br>Kate is stuck in a past she cannot shake. She had an ex-boyfriend that she feels she missed the bus on when he is moving on with his life. A death of a mother. Her father dating a very sweet woman she disapproves of for no other reason than it isn't her mom. So she wishes that she could fix things. Well, in movies like this, some magical force fulfills this.<br><br>Now she's an unwilling participant in re-living this one day.<br><br>Ordinarily, I would say, the repetitive nature of these incidences would be aggravating and painful to re-watch. I dismiss them since we're suppose to be going through the same process as Kate. She has a blind date with Myles (Mark Paul-Gosselar's character...who inexplicably doesn't have a listed name in IMDb). His character is really improbable conglomeration of everything sweet a girl would want in a guy. He doesn't exist but only to be tolerably normal. Then the onion begins to peel. Because most of us need a lifetime to discover the person in front of us. Kate is in purgatory to be sure. And so...which could easily derail us into not caring, OR worst turning against Kate. Director James Hayman skates so fine on that line, he finds the joy in being able to repeat her world. Well, entertaining to us anyway. I think the message is clear...which was clear for \"Groundhog's Day\"...we're resigned to a lot of things in our lives, until we break the pattern. And that pattern is to give into what sometimes the world wants for us. It's not giving up, it's embracing it.<br><br>Yeah, I'm a sucker for this movie. So, if you venture to watch it, keep this in mind...great performances. Mark-Paul Gosselar is surprisingly low-key. He's every man. A good center. Nothing spectacular in his life...just so simple. He has dreams, but they don't interfere with his good deeds.<br><br>You will feel good you took the time to watch.","user":"statuskuo","rank":[32,39]},{"title":"A bit more depth than your average holiday rom-com","rating":8,"date":"6 December 2014","review":"This was a surprisingly fun and charming holiday movie.<br><br>It does hit the familiar tropes of the groundhog day trope of repeating from the same moment, and the romantic element.<br><br>However, the heroine very quickly figures out her repeats don't have to keep repeating exactly the same. She learns about life, and herself, and uses the days to try things she was afraid of, and get to know people in her neighbourhood.<br><br>Although there are some leaps and it's not entirely clear just how many repeats she gets - or, despite the title, whether she gets 12 dates with the same fellow - this is a charming movie with a bit more depth than the average holiday rom-com.","user":"JaynaB","rank":[14,17]}]