[{"title":"Actually pretty enjoyable... when stoned","rating":7,"date":"30 June 2018","review":"This movie is a stoner movie. Not a movie about stoners but a movie for stoners when they're high. I was high as a kite when watching this and I loved it, all the songs in it were so perfect and it wasn't such a fun chilled movie to watch in that situation. Probably boring though if not stoned","user":"cyorke-34660","rank":[9,10]},{"title":"You either like these kinds of movies or you don't","rating":9,"date":"16 March 2014","review":"I think a lot of the other reviewers missed the point of this movie... the mediocrity is what makes this movie good. The jokes are dumb and the movie plays bad stereotypes and that's why it's funny! This movie isn't about character development or conflict... its ridiculous and just for fun. The fact that we have \"slow burnin\" the animated joint chiming in at random points in the movie just adds to the ridiculousness. Honestly if you look at the cover and saw that you were going to watch a movie where 40 year old snoop dogg is playing a high schooler of the same age who just hasn't graduated yet, you should expect what you're about to watch.<br><br>This is the kind of movie you watch when you want to just relax and watch some low class comedy. Invite some people over, talk through the movie, drink or whatever, and just enjoy something stupid for a while.","user":"danleppert78","rank":[13,16]},{"title":"A Huge Cloud of Fart Flavored Pot Smoke","rating":5,"date":"4 July 2012","review":"I am a fan of both Snoop Dogg and Wiz Khalifa. So when I heard that they were collaborating to make a stoner comedy I was excited. But unfortunately (in my opinion) this is one of the worst movies I have ever seen. Here's some reasons why I think this.<br><br>The first problem is at the beginning of the movie, when we're introduced to \"Slow Burn\". A poorly animated cartoon joint that, really, looks like a white banana. Slow Burn delivers some of the dumbest and unfunny dialogue I've ever heard. Slow Burn then proceeds to tell us that we have to get high to enjoy this movie. Now, it's no lie that weed makes some terrible movies more enjoyable. But relying on the intoxication of your audience for a films enjoyment is pathetic.<br><br>The next issue came when I began to uncover what the overall plot was. A cool kid helps a nerdy kid become cool. This story has been reused 1000 times over. When put into the right hands, this plot could possibly become effective, but usually this is not the case.<br><br>Now I could be wrong about this, but, while watching, it seemed that the overall point of the movie was to sell music. When you make a movie specifically to sell something or some things (\"Jack and Jill\") it will usually not turn out well. Especially when it's obvious.<br><br>I could go in depth about how bad the acting was or how flat the jokes fell, but I'm not trying to write a book. Which is sad because this is a movie that I've been anticipating as a fan of Wiz and Snoop, and a fan of stoner comedies. But good stoner comedies have good characters that you like and care for. I could care less if Mac &amp; Devin don't graduate (or for that matter DIE).","user":"fender918","rank":[38,57]}]