[{"title":"Look Beyond the Controversy","rating":8,"date":"1 October 2012","review":"For as long as there have been schools, there have been good teachers and bad teachers, involved parents and uninterested parents, naturally gifted students and those students who struggle. Perhaps there is more good than bad today, then again perhaps not. It can't be ignored, though, that there are schools, and even entire areas, where students are failing at an alarming rate. Teachers alone can't fix this. Parents alone can't fix this. Even most students alone, barring the most motivated and gifted among us, can't fix this. It takes good teachers, involved parents, and students who have made a commitment to excel, to fix this problem. That's what we get in Won't Back Down.<br><br>You might hate the supposedly anti-union message, or turn up your nose at the idea that a child is scarred for life by one bad teacher, but neither of these are reasons to disregard this movie. First of all, while the movie does spotlight the downside of teacher's unions, there is plenty of union-love as well. And secondly, one bad teacher certainly can make the difference between a child who loves school and a child who dreads it, even if it's only for one year. And one bad year of school, especially elementary school where every learning experience is a building block for the later years, can be devastating.<br><br>I am highly sensitive to movies with a heavy-handed political agenda. I honestly didn't feel that here. I didn't take this movie as a guide to removing unions from schools. What I witnessed was the idea that if parents, teachers and students band together to make their school a better place, they can hope for a brighter future. Student by student, school by school, we can improve education in America. That people want to fight over whether teachers should be protected rather than whether students should be given an opportunity to excel, well that's really the crux of the problem, now, isn't it? <br><br>Beyond the controversial topics addressed, I found this film to be very satisfying. The plot was well-developed, Viola Davis and Maggie G played well off of each other, the children were very good in their roles, and the pacing was steady. It's always inspirational to see a group of people with very little in common come together for the greater good, and if nothing else you will definitely get that here. How can we not enjoy watching parents engaged in the school system and rallying to secure the future of their children? Don't watch this to pick apart (or champion) charter schools, watch this to remember just who education is supposed to benefit. Watch this and remember that good teachers could use a little encouragement, bad teachers should be called out, the system needs to be challenged every now and then, and children will respond to their environment, whether it's positive or negative, in ways that will surprise and sometimes amaze you.","user":"truiz1","rank":[48,59]},{"title":"\"Wanna take over a school with me?\"","rating":8,"date":"3 October 2012","review":"Is this movie corny, clichéd, sentimental, etc? Absolutely. Are some of the characters one-dimensional bad guys? Yep. Is it financed by someone with a lot of money who has his own opinion on the subject? Sure. This is true of most of the movies coming out of Hollywood, including \"Trouble With the Curve,\" which isn't getting half the flack this movie is. If you want sophistication and nuance, go see an art house film. If you want to see a heartfelt film that raises questions about education and the future of America's kids, you may want to give this a shot. Some characters are pro-union, others just want what's best for their kids, others change their minds while others don't. Some bureaucrats in the movie are willing to help; others flatly refuse. That's also true in real life, and all these viewpoints are represented in \"Won't Back Down.\"<br><br>Maggie Gyllenhaal plays a blue-collar single mom who decides to try and get support for radical changes for her daughter's elementary school, after trying and failing to get her daughter a better quality education in the current system. Joining her are Viola Davis, a veteran teacher who is beaten down, but not yet fully defeated, and Oscar Isaacs, a hunky \"Teach for America\" type, who doesn't want to focus on politics, at least at first. Other supporting players include Rosie Perez, Marianne Jean-Baptiste and Holly Hunter, who all do a great job with an admittedly TV-movie of the week type plot and script, and I, for one, didn't check my watch once during the film.<br><br>The standout here is Davis, whose mother was a well-loved teacher, and who goes home and digs out some new material with which to challenge her young students, even before she agrees to the takeover plan. \"We're all going to work a lot harder around here,\" she informs her class. \"Including me.\" It's easier, in my opinion, to play the stereotypical young idealist crusader, whether teacher or parent, but how many movies flesh out the role of the crusty veteran? One message of the film, is that you don't have to wait for someone to change things for you. Even when everything around you is going downhill, an \"average\" person can still summon the strength to make a change in the quality of someone's life, whether big or small. And that's a message that's always welcome, if you ask me.","user":"zoerobe","rank":[18,24]},{"title":"Film with a heart made for those who have one","rating":8,"date":"7 October 2012","review":"Reading some of the reviews here and elsewhere I was getting a feeling some people simply saw another film under the same title for I don't have another plausible explanation for the shortsightedness and narrow-mindedness of some.<br><br>The film is stunning in its emotional impact, immaculately written and stupendously directed, with incredible one-shots, meticulously motivated hand-helds, color nuances (overlooked by many) and above all breathtakingly thorough and subtle work with the cast. In the world of \"block-and-shoots\" and gimmicky self-indulgent \"me-me-me's\" this rare old school picture stands out and certainly makes many uncomfortable for it appeals to something buried under layers of tweets, pretense, status, rat races and such - the human heart. Human connection. This is the most life-affirming American film I have seen in over a decade without it getting too preachy, cheesy or boring. No chemistry between Maggie and Viola? That comment is beyond me. They are so different, they are so raw and painfully believable on their own, that their union gains power via this deliberate diversity of their characters. There is not a single face in a single frame that is not totally \"there\", the committed \"non-background\" nature of supporting cast and extras makes an incredibly detailed background, full of nuance, ever breathing and alive. As is every shot of the film.<br><br>The last comment I will afford regards the union matter. First if all - if someone really believes this movie is about unions (or against them) - I have nothing to tell them. They will be as deaf to my voice as they are to the writers'/director's which tells a story of mother's love, standing up for your rights, having hope and faith and moving mountains if necessary - if the loved one needs that. The school is just a background for all that to unfold, a setting, a subplot to me. Performances are Oscar-worthy, I could go on for pages and scene by scene describe the beauty and power of them (alas, only 1000 characters here). And one more word on the union issue - what makes this film so impactive and real is how valid both points are and how the film's creators made sure that nothing about that is black and white and took time to support and justify both.<br><br>So, if you are not ashamed to cry in a theater, if you are ready to embark on an emotional journey, if you are not afraid to think and doubt - go see this brilliant work of art.","user":"briankomendant","rank":[26,41]}]