[{"title":"How Can Someone Put Money to Make This Garbage?","rating":1,"date":"1 March 2012","review":"In 1974, in the Glenville Sanatorium in West Virginia, three dangerous lunatics escape from their cell, release the other inmates and kill the doctors and staff.<br><br>In 2003, a group of college friends from the Weston University rides their snowmobiles to the cabin of a friend. However, they get lost in a storm and reach the abandoned asylum seeking for shelter to spend the night. However, the three cannibal maniacs are still living in the place and they are hungry for human flesh.<br><br>How can a producer put money to make garbage like \"Wrong Turn\"? This question was drumming in my head while I was watching the stupidities of the bunch of friends along 94 minutes running time. For example, the lesbian Afro-American girl returns to look for her bar that she lost in the snow while the three weirdos are driving their snowmobiles to hunt them down. Or voting to decide whether they should save Daniel that is being eaten alive by the crazies or not. The abandoned sanatorium is absolutely clean and everything is operative in the building.<br><br>The survivors never grieve the loss of their friends that are slaughtered by the maniacs. But maybe the worst situation is when they overpower the sadistic loonies and a girl convinces the others to not kill the monsters that have eaten their friends \"like a fondue\". Last but not the least, the acting and the lines are very poor. My vote is one (awful).<br><br>Title (Brazil): \"Pânico na Floresta 4 – Origens Sangrentas\" (\"Panic in Forest 4 – Bloody Origin\")","user":"claudio_carvalho","rank":[40,52]},{"title":"It stinks and is truly stupid.","rating":22,"date":"22 November 2011","review":"Somehow I missed Wrong Turn 3. I really liked WT1 it was good and sort of like a Hills Have Eyes meets Deliverance vibe. WT2 was pretty good with Henry Rollins running the \"Survivor\" reality show in the backwoods. Then I saw this movie...<br><br>The movie starts out great with the deformed inmates overrunning the asylum. I love insane asylum movies, throw in a freakshow and I am there dude.<br><br>The \"college\" students look to be thirtysomething. The college victims are six hot pornesque chicks and three or four dopey guys. I must agree with the other comments. It is 2011, everyone has GPS on their phones. These guys aren't going to even have a google maps printout to the cabin? The height of stupidity occurs when the college kids manage to capture the whacky hillbillies and have them locked in a jail cell. The last remaining guy throws kerosene everywhere and is set to burn the cannibal freaks but the lead chick puts a stop to it saying that it is immoral and that they shouldn't sink to the hillbillies' level. Mind you, this is after she has witnessed the freaks pull the head off of her friend, after they rolled out her boyfriend's head like a bowling ball across the assembly hall and after she's witnessed the freaks slicing off pieces of flesh from her other friend, while he was alive, and flash frying it with potatoes and onions and eating it in front of him while the other are filleting him alive.<br><br>Of course, they escape the cell and mutilate everyone. Honestly after that stupid lead chick decided not to kill the crazies, I wanted all of the college kids to get eaten.<br><br>Good setting, bad movie, bad acting all the way around. Don't bother watching this one. If you liked the first two, this will be a big disappointment.","user":"anchovyd","rank":[27,35]},{"title":"Awful!!","rating":1,"date":"18 August 2012","review":"Hmmm where do I start. <br><br>My brother and I are HUGE horror fans, and we loved the first two Wrong Turn movies, part three was okay, and we were so excited to see part four. It sounded interesting, with the back story and the isolated mental institution. But ten minutes into the movie we realised this was going to be more of a comedy.<br><br>The lesbian sex scene at the start...one question, why? Maybe it was just thrown in there to get male viewers hooked. Who knows. <br><br>I couldn't care less about any of the characters. They were all as stupid as can be. The only one that wasn't was the girl that tried to ski to safety, I would have done the same thing no matter how cold it was. <br><br>They were in a huge building with about a thousand places to hide, yet they spent a good chunk of the movie hiding in the same room, even after one of the inbred freaks had found them and drilled a gigantic hole in the door. They might as well have left the door open. <br><br>Then the remaining few decided to be brave or noble or whatever and save their poor friend who was tied to a kitchen bench and being eaten alive. But considering the killers were distracted and seemed to have forgot for a moment that there were remaining kids roaming the building, it might have been a good time to try and find a better hiding place, or find some weapons, but anyway. Kudos to them for being decent for a mere moment. So they all run into the kitchen, cause a huge stir, which causes the killers to snap out of their distracted state and start chasing them. They eventually corner the baddies in a cell and seem to finally have have the upper hand, but the dopiest dopey main girl (whose name I can't even remember) objects to killing them. Ummm are you for real? I would have set the cell on fire and basked in the warmth. Which reminds me, who exactly is paying the electricity? And what happened to their friend being eaten alive in the kitchen? He is never mentioned or seen again, despite them all having risked their lives to save him.<br><br>Ugh so disappointing. Hopefully if they make a fifth movie they will get some decent actors, and some characters who aren't quite so dumb.","user":"blondeems-452-74374","rank":[8,9]}]