[{"title":"Great Mix Of Action And Comedy","rating":24,"date":"24 January 2013","review":"Quentin Tarantino, one of the most iconic directors of the 21st (and late 20th) century, why? Simple. Because of masterpieces like this. Tarantino defies the laws of film, he shoots them in his own way, however he wants. Tarantino has always focused upon the action thriller genre from Reservoir Dogs up until Inglourious Basterds. However, Django Unchained is Tarantino's first look at the Western genre, his first attempt at it and he executed it beautifully. The scenes were shot perfectly alongside an amazing soundtrack as well as his own small cameo.<br><br>Django Unchained tells the story of Django (Jamie Foxx), a slave who is soon picked up by bounty hunter Dr King Shultz (Christoph Waltz). The story follows on as Shultz takes on Django as his \"deputy\" during their tasks of bounty hunting, in return Shultz says that after winter he will help find Django's lost wife, Broomhilda. This takes them to a huge plantation in Mississippi owned by Calvin Candie (Leonardo DiCaprio), from here they plan up a scheme on how to get away with Broombilda.<br><br>The cast boast out amazing performances, particularly Christoph Waltz (also famous for his previous collaboration with Tarantino on Inglourious Bastards as Colonel Landa). Both Foxx and DiCaprio's performance are both equally amazing. All three are able to add some light-hearted humour in the mix to make sure it doesn't stay too serious, as well as having comic actor Jonah Hill play a member of the KKK.<br><br>There's a reason the film has been nominated for 5 Oscars.","user":"CalRhys","rank":[246,361]},{"title":"Brutally hilarious and quite messy, but a total blast from start to finish","rating":8,"date":"23 December 2012","review":"I only had one thought on my mind for this Christmas: see Django Unchained. Quentin Tarantino's latest opus, a Western set two years before the Civil War, concerns a former slave named Django (Jamie Foxx). He is freed by bounty hunter Dr. King Shultz (Christoph Waltz) in order to help him with a bounty. Quite quickly, Shultz takes Django under his wing and trains him as his partner. But he made him a promise: that he would rescue his wife from a plantation owned by the ruthless Calvin Candie (Leonardo DiCaprio). And rescuing her is not going to be all that easy.<br><br>What pains me the most about Django Unchained, as a die-hard Tarantino fan, is just how sloppy it all seems. I enjoyed every minute of it, but I could never shake the feeling of how messy and thrown together it all feels. Portions of the film feel episodic (the search for the Brittle Brothers, mentioned heavily in the trailers, begins and ends practically within minutes), and some scenes just seem to play out just for the fun of it. Another scene from the trailers involving a lynch mob with bags covering their faces seems added for comedic purposes, and has no real point of actually existing. More than any of his films before it, Django feels like Tarantino simply making a movie for sheer pleasure and with no outside motivations or controllers. <br><br>The film threatens to go totally off the rails at any given moment, and lacks any real sense of direction or focus. It may sound ridiculous, but the loss of editor Sally Menke confirms a sneaking suspicion I always had about Tarantino – he needed a steady right hand to help encourage him as to what was needed and what was not. I do not want to criticize Django's editor Fred Raskin, but it is obvious he is no Menke and that works against the film heavily. It lacks the polish we have come to expect, and is practically stripped of the glossy/cool texture so prevalent in Tarantino's work up until now.<br><br>But then maybe that was his intention all along, and perhaps Tarantino is airing out his frustrations with life and film in general. Django is deliberately shot on film (or at least from the print I saw), and looks very gritty and messy at all times. It is significantly more brutally violent than anything he has worked on before (the borderline cartoonish Kill Bill included), and has a very go for broke attitude about itself. The film seems to revel in how brilliantly it can splatter all the blood and gore (done through the use of squibs and no digital!), and how uncomfortably numbing it can make the violence. I know he does not care what people think of his films, but this movie especially seems like an emphatically raised middle finger to the establishment. And for all of my complaints about how messy it all feels, I was never once bored or felt like the movie was dragging itself out. The staggering 165-minute running time shockingly flies by faster than you might ever imagine.<br><br>Acting wise, Tarantino stacks the deck with a number of recognizable character actors young and old for roles that vary in size. Most have very few lines, if any at all, and seem to just stand by, just as content as the audience is to watch the action unfold. It is a little off-putting, especially with how important some of these characters are initially made out to be. Washington as Broomhilda von Shaft (one of the most subtle references he's ever dropped) does well as the helpless victim and frequent dreamlike object – but she never really gets to show off any of her acting prowess outside of her facial reactions. They are increasingly effective, especially during horrific flashback scenes. But her work here feels ridiculously stunted in comparison to the other leads. Samuel L. Jackson, much like Tarantino himself, seems to just be having fun in his role as Candie's adviser Stephen. He plays on every ridiculous stereotype he ever has been associated with and then amps it up to a near ludicrous state. He is frequently hilarious, but the role seems to border on parody more than anything else.<br><br>Surprisingly, Foxx takes a very long time settling into the leading role. It may just be the character, but it is quite clear from the on- set that he is not very comfortable in Django's shoes, and leads credence to why Will Smith, amongst so many others, dropped out of the picture so quickly. But once he finds his footing, he does a fantastic job walking the thin line between empathetic and sadistic. It is not an easy character to play, but Foxx makes it his own, bringing a sense of style and grace that are virtually absent from the rest of the film. And of course, he gets all the best lines.<br><br>Waltz and DiCaprio are the clear standouts however, nailing every nuance of their sadly underwritten characters. While Waltz plays the straight man, DiCaprio is delightfully unhinged and vicious. Both are playing directly against type, yet are strangely comfortable in the roles. Watching them act circles around the rest of the cast, Foxx included, is the true highlight of the film. I just wish they were both given additional emphasis and more to do. <br><br>For all of its numerous faults, I had a blast watching Django Unchained. It is hilarious, it is a lot of fun, and is wildly enjoyable. I genuinely think it could have been a lot better if there was more focus and direction, but this is very clearly a picture Tarantino wanted to make on his own terms. And for that, I applaud him for the effort. It is not his best work, but certainly not his worst. <br><br>8/10.","user":"DonFishies","rank":[667,1]},{"title":"Tarantino-gasm!","rating":10,"date":"26 December 2012","review":"Merry Christmas to all you Tarantino fans out there. I hope you made a Tarantino checklist so here we go.<br><br>Witty dialogue, check. Excessive profanity especially use the word 'nigger', check. Excessive violence including testicles getting blown off, check. Soulful musical score, check. Sometimes non-linear narrative, check. Shots of women's feet, check. Very great character driven plot, check. An actual spaghetti western, even though it takes place in the American South, check.<br><br>There are four standout characters played by the top billed actors.<br><br>Jamie Foxx plays Django, a freed slave who becomes a bounty hunter. Even though he is the titular character, he gets downplayed when in the presence of the other actors. Still he delivers a solid performance, in fact hes very convincing. We all know Jamie Foxx as this golden voice RnB singer and comedian with a very clean cut image. He was able to pull off the whole transitioning from a timid slave to a menacing bounty hunter. Not only that he had the whole look down too, with all the facial scarring and the messy hair.<br><br>Christoph Waltz plays Dr. King Schulz, a German dentist turned bounty hunter who frees Django so he could help pursue his previous owners who are targets. Waltz is a very charismatic actor, and thats how he does this role. Presents every line with finesse.<br><br>Leonardo Dicaprio is in his best yet. He plays a plantation owner, Calvin Candie, and is the owner of Django's wife. This is a very different role. We've seen Leonardo in gritty roles before but never did he play this lecherous antagonist. We were all used to Leo being this teen idol, who looked like a member of Hanson. Here he's this Southerner with discoloured teeth and a scruffy beard.<br><br>Finally Samuel L. Jackson who plays Steve, a house slave who you could say is the secret antagonist here. For all the screen time that he has he dominates. Sam usually plays boisterous roles as a tough guy, but it was very interesting seeing him play a devious and manipulative old man.<br><br>The only gripe here was that this film was a little too long exceeding the three act structure, but its an epic western film so I'll excuse Tarantino for that. Yet again he made another great film with a lot of flair and carried well by the four big hitter actors. Well done Mr. Tarantino.","user":"arnieiam","rank":[405,655]}]