[{"title":"A slow burning drama that just doesn't get going","rating":5,"date":"18 February 2018","review":"I had high expectations for this. Though I wondered why, considering this movie was shot in 2014, it took so long to release. And that it was finally released when Bill Skarsgard rightfully got recognition for his role as Pennywise in IT. It could be to do with the fact that Battlecreek is a let down.\nI am a fan of most of the actors in Battlecreek. Bill Skarsgard has proved he has acting talent. Unfortunately, I felt the actors were let down by poor directing and what may of read well on paper, didn't portray so well on screen. It probably also didn't help that Bill and Claire literally had 5 days from being cast to shooting the movie, and the was lack of chemistry between the the two main leads, didn't help at all.<br><br>The movie didn't know what or where to go, it was drawn out and never got going, neither did it actually go anywhere at all. Was waiting for something to happen throughout, but there was no fuel to get it going. It lacked that punch. Then you ended up with a rushed ending, after half of the movie failed to pick up any pace.<br><br>If you are expecting a love story with warmth and heart, you may be disappointed. And it becomes apparent why this movie sat on a shelf for a few years.","user":"flowerstardust1979","rank":[13,15]},{"title":"Great movie","rating":9,"date":"19 October 2018","review":"Came across this movie by accident took a chance and watched it thought it was going to be sh@t but was a brilliant storyline and acting was great fair play to the actors I never heard off job well done","user":"tolso-63816","rank":[4,7]},{"title":"Not Much of a Battle","rating":3,"date":"20 March 2018","review":"Almost without fail their are two signs of a cheap production. One is an opening prolonged scene of a car driving down a road. OK, that's out. The second is no subtitles - check; poor audio level &amp; in this case it seemed to be dubbed in after the movie was filmed (hollow, distant sound) - check; poor enunciation w/added southern dialect to be slightly less understandable - check. Third is lots of camera focused talking heads time - check. \nScript - small town (w/the typical small town issues) local young male is introverted because of a slightly noticeable skin problem; falls for girl (when her car brake down in said small town) who's running away from abusive boyfriend. 95% of film run time is just talking heads until the final few minutes when old meets new love interest. At that point I'm script redundantly script bored and could care less about the outcome which, of course, is predictable.","user":"westsideschl","rank":[3,5]}]