[{"title":"It failed to bite through the skin and leave a lasting mark...","rating":4,"date":"3 January 2013","review":"First of all I must say that it is nice to have a vampire movie that is not tailor-made for a teenage girl audience with sparkly vampires and big hair. However, that being said, then I will flip the sword around and say that this vampire movie is far from being amongst the more interesting or appealing of vampire movies that I have seen.<br><br>The story is about a family of vampires who flee from USA after having made it to the news with a video of them killing humans. The vampires find themselves in England where they seek the help of another vampire family, but is blood thicker than water?<br><br>Having sat through \"The Thompsons\" now, I must say that I am filled with an overwhelming sensation of that this storyline was utterly and completely unnecessary. The story left no lasting impression on me, nor did it manage to rise above mediocrity in its concept and execution.<br><br>It should be said that the people in the movie were actually doing a great enough job with their given roles, though it is not award-worthy material here, far from it.<br><br>For a vampire movie, then there were surprisingly few effects in the movie. One good thing, and an interesting thing, about the movie, was that the vampires here were not immortal nor undead. So that was an interesting approach to the mythical vampire creature.<br><br>\"The Thompsons\" is the type of movie that you watch once, then shrug your shoulders and forget about the movie. It failed to make a lasting mark, despite having enough fangs to bite deeply with.","user":"paul_haakonsen","rank":[14,19]},{"title":"Like slowly pushing rusted nails in your eyes.","rating":1,"date":"19 October 2012","review":"Where to begin? This movie doesn't do anything right.<br><br>The main character is a whining emo sun walking vampire. After slaughtering a bar full of people he and his too dumb to breath sister and brothers vampires manage to set themselves up in Europe somehow. There they meet up with a family of uber-vampires who have killed gazillions of normal people and vampires like them but who fail to kill a single one of these retards, they just like to push them and play with them. They do this while being, like, super-serious. The retards then kill them using vampire-skills against vampires who are as superior to them as they are to normal people. <br><br>The end.<br><br>Did I mention the 'lovestory'? Well, for no reason the youngest of the uber-vampires rescues the emo vampire and kills her brothers. Probably because he is so cool or something.<br><br>It tries to hide the lack of story by jumping around in the time line every 5 minutes. OK, moron is in a box, how does he get out? No, how does he get in. No suspense. <br><br>It's like watching a sad Monty Python killer bunny for 80 minutes without it trying to be funny.<br><br>I have no idea what kind of audience will be entertained by this crap. Even stoned retarded goth kids in puppy love will vomit.","user":"Ratatosk73","rank":[18,29]},{"title":"Not the same, but not good either","rating":5,"date":"16 October 2012","review":"If a sequel tries to tell you a new story instead of rehashing/repeating what part 1 did, that is a good thing. Unfortunately this sequel is not only predictable (almost from start to finish), but also just above mediocre in general. That means it's not really bad, but it won't get your blood pumping either (no pun intended).<br><br>Since the main characters are established in the quirkier and better Thompsons, you'd expect this to go different places. And in a way it does, but that only is true in geographic terms. There's not a real story behind it all, it's a simple \"match\", that you will either like or you might find it too simple. Whatever the case, if you can bare with the characters (because you saw the previous film or just simply because you like the actors), than this is indeed watchable. Otherwise ... don't bother.","user":"kosmasp","rank":[13,20]}]