[{"title":"Amerian Hustle with the benefit of hindsight","rating":7,"date":"12 November 2018","review":"The performances are the safeguard for this movie to have a very long life. I couldn't care less about the characters but I loved the actors playing them. They, the characters, make choices that are as coarse as their wardrobe. Thank God for the people wearing them .Christian Bale is absolute perfection. His character is disgusting and irresistible at the same time. brilliant performance. Amy Adams is superb and Bradley Cooper an unnerving hoot - also the brief moment with Robert de Niro is simply delicious but it is Jennifer Lawrence who made me want to see the movie again as if to confirm what I seem to remember. Yes indeed. She is spectacular. A performance of such maturity - her laughter alone belongs to one of the great ones of yesteryear. - Totally present. A character actress/star.","user":"janiceferrero","rank":[47,54]},{"title":"Looks Like I'm the Only One Who Didn't Like It","rating":3,"date":"23 December 2013","review":"With a current user rating of 8.3 and with ten - yes, 10 - ratings of 100 from the critics, I feel crazy not liking this movie. Critic Richard Roeper writes that \"I can't imagine anyone who loves movies not loving THIS movie.\" <br><br>I wanted to leave the theater and do something else after 45 minutes. No one else felt this?<br><br>When flipping through a friend's screen writing book recently, I read that the most important thing a movie has to do is have a main character that the audience sympathizes with, a main character that the audience roots for. Even in a complex case - such as the protagonist of August Wilson's wonderful play \"Fences\", whom we both detest and sympathize with - the audience must be drawn into actually caring about the main character.<br><br>This film didn't have a protagonist (that's not a fault - Shakespeare's \"Twelfth Night\" doesn't either), but still I could not have cared less about any character in this film. What was very strange, and a little unsettling, to me was that I felt this immediately, within the first five minutes of the film. <br><br>Another thing you'll learn from screen writing books is that amateur screenwriters use too much dialogue. This movie is a classic case in amateurish, dialogue-heavy scenes. Constant, ceaseless dialogue really bogged down the film for me. This film didn't have a single bone of subtlety in its entire body. Dialogue, dialogue, dialogue.<br><br>I saw in one of the trailers that this is a comedy - really!? I chuckled twice, and one of the occasions was in the film's first 30 seconds. There were several jokes that not a single person in the movie theater laughed at. <br><br>So, in summary, I guess I'm the only person in the world who didn't care for this one. Contrary to Mr. Roeper's assertion at the beginning of this review, I love movies but I strongly disliked this one. My favorite movie is Stanley Kubrick's \"Barry Lyndon\" - so maybe that explains it.<br><br>jacobnunnally.blogspot.com","user":"jacobnunnally","rank":[638,908]},{"title":"Don't be \"Hustled\" by the reviews. \"American Hustle\" is okay and nothing more","rating":6,"date":"24 December 2013","review":"Despite it's stellar cast and great production creds, \"American Hustle\" is little more than a sinners-with-a-heart of gold story. YAWN!!! It plays like a particularly sad Woody Allen movie without the jokes. The film is definitely not a comedy, though Jennifer Lawrence provides not only the best character but most of the few laughs the film has. <br><br>Christian Bale and Jeremy Renner are particularly effective in their parts. Bradley Cooper does a solid job with the most complex character in the film. Amy Adams is fine, but not award worthy for a change. <br><br>Watch \"The Grifters\" if you want a devilishly clever con-film, because it is 1,000,000 times better.<br><br>Honestly, the NY Film Critics Assn. must have gotten a con-sized pay off for calling this the best film of the year. Is it awful? No. But neither is it memorable. Fun soundtrack, great costumes, hair/make-up and photography can't make up for a plot which is dull and characters who are so uninteresting.","user":"peibeck","rank":[504,738]}]