[{"title":"Underrated and Funny Animation","rating":7,"date":"17 February 2013","review":"In the outback of Australia, the coward white koala Johnny is bullied by the other animals because of his color. When Johnny meets the Tasmanian devil Hamish and his friend, the mute photographer monkey Higgens, he is invited to join a traveling circus and Johnny leaves the wilderness to be an attraction in the sideshow.<br><br>While traveling to Precipice Lake, the wagon car of Johnny, Hamish and Higgens releases from the train and they crash in the desert. They walk together to the new location and stumbles with an oasis with a billabong, and they see a pack of dingoes attacking the animals. Johnny accidentally frightens the wild dogs that return to their boss, the evil crocodile Bog in Precipice Lake and Hamish introduces Johnny bragging that he is hero The Koala Kid. They are welcomed by the locals and Johnny is worshiped by the little Charlotte despite the disbelief of her sister Miranda. But when Charlotte is wrongly kidnapped by the dingoes, Johnny has to prove to himself that he can beat Bog and rescue Charlotte. <br><br>\"The Outback\" is an underrated and funny animation by Kyung Ho Lee with the cute story of a needy white koala that is rejected by the other animals and discovers that he can be brave to defend and save his beloved friends. The voice of Rob Schneider is another attraction in this entertaining adventure. Fortunately I did not care to the ridiculous IMDb User Rating and I saw a good animation. My vote is seven.<br><br>Title (Brazil): \"Outback – Uma Galera Animal\" (\"Outback – An Animal Gang\")","user":"claudio_carvalho","rank":[15,17]},{"title":"Non Australian","rating":1,"date":"2 June 2013","review":"The animation is the only thing decent in this movie! None of the voices even go close to Australian accents. The scenery is inaccurate and the wildlife depicted are a far cry from Australian creatures. The creators of this movie would have done a much better job if they had hired some great'Australian voices like Geoffrey Rush, Hugh Jackman or Nicole Kidman. To hire New Zealand and American actors to depict Aussie accents is an insult to Australia. They should have also visited Australia to get a more accurate view of the scenery in the Outback! Do yourself a favour and watch Crocodile Dundee instead if you want an Aussie fix.","user":"mark-701-467758","rank":[4,4]},{"title":"Great animated movie for the children...","rating":5,"date":"13 August 2013","review":"\"The Outback\" was an enjoyable animated movie, although it just didn't really become all that it could have been. As such, then it was a watchable and enjoyable movie, albeit mediocre in story.<br><br>The story in \"The Outback\" is about an albino koala named Johnny (voiced by Rob Schneider) who wants nothing more than to fit in and be like everybody else. He meets up with the Tasmanian devil Hamish (voiced by Bret McKenzie) and a photographer monkey named Higgins (voiced by Frank Welker). As the carnival they work in has packed up and travel to a new city, the threesome's wagon becomes unhooked and they get left behind. They start off through the Australian outback in order to catch up with the carnival, but get caught up in a conflict between a crocodile and his dingo goons and the residents of a billabong.<br><br>Storywise, then \"The Outback\" was fairly enjoyable. Mind you, it wasn't spectacular or overly inventive. But still, it was a good watch for the entertainment that it was. However, \"The Outback\" is not one of those animated movies that will have you dazzled and blown away in awe.<br><br>The voice acting is adequate, although the dialects were a little bit overdone at times. But they had some nice enough people on the cast list for voicing the various characters. It was especially nice to have Tim Curry voicing a character as well.<br><br>\"The Outback\" is great fun for the children, but as it goes for entertaining adults, then the movie is good enough for a single watching, because it just doesn't offer enough depth or have enough leverage to withstand multiple viewings by adults - for children, it is a whole other matter, as the storyline is fun and the characters are cute.","user":"paul_haakonsen","rank":[3,3]}]