[{"title":"Truly feeble","rating":2,"date":"19 October 2012","review":"What a load of crap ... Whoever Mr Vain is that wrote and directed this feeble excuse for a comedy, he needs to go and get a job in Wal-Mart or something, cos that might be more within his capabilities Trying to remake The Hangover was pointless in the first place as several others have done it since, and lets be honest, the original was no classic itself Here we have inept acting ... A feeble script ... Attempts at gross out humour ... And all of it failing hopelessly due to no idea from the director, I was going to say regarding timing, but I've decided it is more a case of regarding anything But with a script this pathetically bad ( yes, it was also written by Mr Vain ) there would really be no hope for anyone And no its not so bad its good ... Just a complete waste of everybodys time","user":"boydwalters","rank":[27,35]},{"title":"Disgusting and Bgrade at the same time","rating":1,"date":"27 October 2012","review":"It worries me that anybody could watch this, clearly writers have a lot to answer for pumping out such trash. This didn't entertain me on any level and i will watch any genre, but come on people badly written, not funny and just wrong!!!!!. This movie should be rated R if a there are some things that should never go to print this is one of them,it is a re hash of a storyline told many times before and has been done soo much better in movies such as \"The Hangover\". Joey Fatone you poor bugger,how bad has it got after being in a world class group you have to stoop to this garbage, seriously you may as well go and start a porn company without the faeces. The movie is an attempt at cheap toilet humour, and by toilet humour i mean they scraped the bottom of the toilet and put it on film.","user":"dragonspit2011","rank":[18,24]},{"title":"In between the few jokes I wasn't laughing...","rating":3,"date":"18 August 2013","review":"\"Mancation\" was actually anything but funny, and I can say that I honestly didn't laugh a single time throughout the entire movie.<br><br>I should be said that director Frank Vain is trying to put together a comedy here, but it just failed miserably. The jokes were far between and when they were there, the punchlines were off and the comedy just wasn't there.<br><br>The story in \"Mancation\" is about Vince (played by Matt Kawczynski) who just have gotten married to the boss's daughter. Upon their wedding day he comes home and finds her in bed with the bridesmaid; it turns out that she is a lesbian, and has been so all throughout their relationship. Together with his brother Leo (played by Stephen Medvidick) and his two friends Brady (played by Joey Fatone) and Adam (played by Jake Matthews), Vince travels to Atlantic City to meet up with his high school sweetheart.<br><br>Right, storywise, then \"Mancation\" did have potential, just a shame that the storyline wasn't fully brought to justice given the bad jokes and lack of comedy throughout the entire movie. It should be said that the people cast for the various roles were actually doing good enough jobs, it was just the script that was working against them.<br><br>The only memorable scene in the entire movie is the controversy stand-off between Adam and Igor (played by Derek Lindeman). It wasn't actually funny, but it was so bizarre and disturbing that it stood out in an otherwise stale and irrelevant movie.<br><br>If you are looking for comedy, then your money would be better spent on something else. There really isn't much to come here for, truth be told.","user":"paul_haakonsen","rank":[7,8]}]