[{"title":"Not the best ones of the Marvel package.... ! boring.","rating":7,"date":"21 February 2020","review":"'Black Panther' is a popcorn movie nothing more nothing less. Although It trys to grasp at the idea of western colonialism and racism, it only scratches the surface never really deciding were it stands. Although this has been championed as one of they greatest diverse films it is not and I would recommend you to check out '12 years a Slave' , 'Get Out' or 'Moonlight' who do a much better job than this meager attempt. The plot is by the numbers the direction is nothing special. Chadwick Boseman's acting is rather stilted and you can never attach to his character. Michael B Jordan is a one note villian who also struggles, phoning in a performance spouting monologues about messages that never really click. But where the movie really falls on its face is the third act which is cgi heavy and looks like its out of a video game. Black Panther by no means is terrible its below average and the concept of Wakanda is an excellent and well excuted idea. But this movie just needs to go that little bit deeper and seprate itself from the tired superhero formula.","user":"MR_Heraclius","rank":[56,67]},{"title":"I liked it at first.","rating":5,"date":"21 October 2018","review":"I am between a 5 and a 6 on this. It was vastly overrated by the professional reviewers. I am sure their reviews were politically motivated. I loved the cast but I agree that characters were superficial and not defined as they should have been. I also feel more humor was needed in the movie. This can't compare to other Marvel movies. It's a one shot deal for us. We don't need to hear any more preaching.","user":"janmanuel2","rank":[849,1]},{"title":"Overrated and overhyped","rating":1,"date":"18 February 2018","review":"I went to see Black Panther along with my friends, and following the hype train we were excited to see it. However, following the showing we were all dissapointed by a mess of a movie with little plot and little thought which only served as a pit stop for infinity war.<br><br>The critics have vastly overrated this movie due to its groundbreaking cast, but the movie itself is not at all groundbreaking. Littered with all the boring Marvel clichés I have come to know and hate, such as their inability to kill off any hero's to add gravitas to their story, or the one dimensional villain who only exists for one movie so you know they will kill him off before the next, Black panther is also plagued by new problems no one but me seemed to notice. For example, the CGI was awful in the action scenes: whenever someone was even prodded, they would go flying across the screen in the most outlandish fashion, and the plot was torn straight out of the Lion King, as well as having the biggest waste of Martin Freeman since those Vodafone adverts.<br><br>Overall, I believe my dissapointment for this movie is fuelled by the marvel cinematic universe, as I feel sick of the movies they are pumping out like an industrial machine, as they all feel the same with little originality. I can only hope the bubble will burst sometime soon, and bring back true standalone movies which don't need a cinematic universe.","user":"seanmartin-97794","rank":[2,3]}]