[{"title":"'Barricade' Review: Board up the windows and beware confusion","rating":2,"date":"26 September 2012","review":"*spoilers*<br><br>Sometimes nothing sounds better than a nice vacation to a cabin in the woods. But always remember to make a plan. I plan in case something terrible happens. A plan in case you get DUN DUN DUN.A FEVER!<br><br>In Fido director Andrew Currie and WWE Studios' Barricade, Terrence Shade (Eric McCormack) has decided to get out of the city and take his two kids to a remote cabin. This cabin is in fact not even a cabin. It is a huge house in the middle of the woods. Yet, every single person in the films calls it a cabin.<br><br>A year before this lovely family vacation began Terrence and young Cynthia (Conner Dwelly) and Jake (Ryan Grantham) lost their wife/mother. All she wanted was to have a white Christmas at the \"cabin\". But, Terrence kept making excuses to get out of it. A workaholic, Terrence is pretty much one of the most annoying characters I have ever seen. At one point he tells his wife that being a mother is her strong suit while \"mine is paying the bills,\" implying that he really wants nothing to do with his two children.<br><br>It doesn't take long for trouble to arrive after the family reaches the cabin. Strange and unexplainable occurrences have all three on edge. Terrence glimpses a spooky girl outside a kitchen window, which was the ONLY time I jumped during the film. Cynthia says something is in the attic. Jake spots something in the trees that surround the cabin. We catch brief glimpses of someone/something but it's hard to make out exactly who/what it is. Things quickly go from bad to worse. A sudden blizzard traps them in the house. Everyone comes down with a nasty fever. And all three are convinced that something is after them. So they try to barricade themselves in the house. Cynthia (somewhat inexplicably) wonders if maybe that's exactly what it wants.<br><br>Barricade is a frustratingly run-of-the-mill horror movie. It's certainly not the worst thing I have ever seen. The performances are solid enough. The isolated setting, while familiar, is effective and the cabin sufficiently creepy. At 75 minutes sans credits, it sure doesn't overstay its welcome. And despite an over-reliance on boo scares (people popping out of nowhere, things leaping from off the screen), it could have been much cheesier.<br><br>It just doesn't add up to much or do anything particularly interesting. Frequent flashbacks to happier days are filler. The matter of whether or not the freakiness is all in Terrence's head is telegraphed early on and there are no surprises. No real suspense is ever generated. The end result feels completely inconsequential. You watch it, and you're not bored, but you're not fully engaged either. When it was all said and done, all I felt was confusion. My exact words were \"what the hell happened?\"<br><br>Barricade is not something that I would suggest you run out and purchase. But, if you happen to find a copy of it lying on the street, and then you get really bored, and then you get all of your laundry done and eat dinner and can't quite fall asleep, watch Barricade.","user":"james-slipnbleed","rank":[46,57]},{"title":"A film using confusion & doubt to creep you out.","rating":6,"date":"29 September 2012","review":"Major Spoiler****************The whole film is basically given out by here so Spoiler Beware******************* Frankly the only reason I am doing this is due to the frustration of reading all of these negative clueless reviews where no one can seem to figure this simple plot out. It seems like people either got this film totally or not at all. A widowed father played by Eric McCormack rents a cabin in the snowy mountains along the way they stop at a store for supplies and meet the care taker there(he runs the store) The caretaker has the flu &amp; the dad &amp; his two young children all contract the flu from him. In the first 24-48 hours things go from good to bad as they get sicker &amp; sicker. The dad who isn't used to taking care of the kids because his wife used to do that stuff(but now dead), so he struggles especially when they all become terribly ill. High fevers plague them all &amp; dad starts washing down Clonzapam(same as Xanax) with a bottle of whiskey to treat himself. As his temperature rises &amp; the drugs take affect he starts to become delusional &amp; paranoid. He starts to lose track of time(Clonzapam+Alcohol) and he wakes up after sleeping all night &amp; all day to find out the storm that he knew was coming has buried his car completely, he didn't have the energy to uncover it. His kids randomly drop hints of hearing things in the house and seeing a figure outside so dad's fragile mental state starts to spin out of control with paranoia &amp; fear so he boards up the house completely. They think something is in the attic, they here constant noise up there so he locks the latch to it. Evidently the caretaker came to the house to check up on them &amp; dad in his drug, alcohol &amp; fever induced delusion locked him in the attic because he was the reason his family got sick &amp; he believes both of his kids Lay dead in bed due to the flu they had so he ties him up &amp; puts him in the attic(he blacks out &amp; doesn't even remember putting him up there), thats where the noise was coming from. Also on the way there he hit a large wolf, due to that being in his head it just adds to the danger he feels from the outside. In the end the cops break the door down to find the missing caretaker &amp; at that moment dad finds out his kids were only sleeping &amp; they all get taken away in an ambulance, with the police saying he will be charged for what he did. Everything else in the film is on account of the father's weak grip on reality &amp; his drug,alcohol,stress &amp; fever induced craziness. The only thing unexplained is in the last ten seconds when the curtain is pulled back from the window, that is unexplained, everything else is completely explained, causes &amp; effects, all of them. If you saw a scene that you didn't understand it's because it's being shot by his perceptions, not the true reality, just a fever alone will make you hallucinate never mind combining it with the pills &amp; alcohol. Even though I pretty much knew what was going on it still managed to creep me out quite a bit throughout. It was new original film that used confusion to get into your mind questioning your beliefs &amp; it wasn't a terrible film by any means, the acting by Eric McCormack was good, I had no problem with it. He sold the role enough to show he has lost his head totally. It was well funded &amp; had good production value, TV quality at the very least. I would recommend it to someone as a decent film 6/10","user":"Thrill_KillZ","rank":[29,39]},{"title":"Do you know what happened here?","rating":3,"date":"27 September 2012","review":"Admittedly I created this account because watching this left me so confused I'm hoping for answers, this is my first review so please be gentle... <br><br>I didn't get into Will &amp; Grace but enjoyed Perception and this seems like one of Dr Pierce's psychotic breaks but without the insight or resolution. I get the premise; recently widowed husband takes kids on the Christmas winter break they both remember from times past and never got to enjoy, but the variables are too many to make it coherent. At a certain point, the story reaches a crossroads and seemingly takes all directions simultaneously. Maybe he's mentally unstable and missing his medication, maybe the house in the middle of nowhere is haunted, maybe he's psychotic and wants to reunite the family. All are reasonable plot lines for a thriller/horror but a story needs to be more than just a beginning. Perhaps I've missed the point, Technically I thought the young actors were good and gave effective, understated performances that did them credit, Eric was (I think) good but I'd give a more informed opinion if I knew what the hell he was talking about. Cinematography was far too dark, far too early and the establishing shots left me as lost as the plot. If anyone can shed some light I'd be appreciative...","user":"richpurdon","rank":[21,29]}]