[{"title":"Ruby Sparks writes its own take on the love story","rating":7,"date":"2 August 2012","review":"In a world full of remakes and sequels, it is becoming more and more rare to get something truly original. When something does finally come along it is always hit and miss. Backed by a strong cast including Paul Dano, Steve Coogan, Antonio Banderas, Annette Bening, and Elliott Gould, Ruby Sparks attempts to be that latest independent film to bring audiences something new and creative. Can a film with an idea that seems to be based on both fantasy and reality come together to deliver that refreshing film or be just another lost opportunity? Ruby Sparks follows a writer dealing with writer's block as well as a desperate attempt to find love. When the female character he is writing becomes real, his life spirals into various directions trying to determine where his writing will take them. While the story basis for this film comes off a bit unrealistic, the way it is handled makes you buy into the story. For the first half of the film it is pretty funny and creative delivering one of the more entertaining original films in sometime. As it moves forward and towards the inevitable darker tone it seems to slow down a bit making some moments drag a little. Everyone gives a great performance, but Paul Dano really steps up delivering a quirky uncomfortable innocence to the lead that makes it all work. Some of the characters decisions could have been looked at as a bit creepy, but thanks to the way he handled it comes off as a bit more enduring. This is easily one of the more unique romantic comedies to come along in a while stepping away from the normal format and instead taking a left hand turn creating something new.<br><br>This is a funny touching film that does get a bit heavy at times and while not a long movie does feel a bit too long at times due to pacing. As a whole, it still manages to work on most levels and accomplishes what it seems to set out to do. If you are ready and willing to take a break from the big budget spectacles of Hollywood, then give this character study a chance you will be pleasantly surprised.<br><br>http://www.examiner.com/movie-in-dallas/bobby-blakey","user":"rgblakey","rank":[72,84]},{"title":"Charming and thought provoking","rating":10,"date":"16 December 2015","review":"This is a movie that you can either love or hate, based on how you see it.<br><br>On one side, it is a fantasy movie with \"Groundhog day\" accents (no, the day doesn't repeat again and again). <br><br>On the other side, it is a beautiful metaphor which if you recognize, it is impossible not to give it a 10. Not because it is perfect. It has charm but it is a bit slow paced at times and the execution is not amazing.<br><br>But rather because ... it feels so familiar. It is one of those movies describing what we've done, what we've felt, like it is our story. It is a different setting, different people, different circumstances but it is our personal story, at least for a large majority of people.<br><br>This is why I like it and this is why I've decided to write this review. It made me think. It made me feel. It made me remember some parts of my life. <br><br>It made me go over the plot holes and the \"how the hell this can happen\" type of scenes but rather, just think ...<br><br>\"Would I do the same?\" and most importantly ...<br><br>\"Have I've done the same?\".<br><br>That's why you should watch this movie.<br><br>The plot is not that important. The underlying message of this movie is. While I don't like romantic comedies so much, I can place it next to two other movies \"If I stay\" and \"Tres Metro El Cielo\". And while these two movies may seem as a \"How to boost your estrogen level in 90 minutes\" types of art, they also carry a very profound lesson.","user":"razvan-rogoz","rank":[16,17]},{"title":"Sweet, quirky not just romantic not just comedy","rating":9,"date":"27 July 2012","review":"The unique Zoe Kazan wrote and stars in this quirky, fascinating, and original film about a writer with writer's block (Paul Dano, Kazan's real-life main squeeze) who invents the girl of his dreams, writes about her, and watches her become real.<br><br>While this film has been billed by reviewers and marketed by publicists as a \"romantic comedy,\" in many ways it's not. It's both more and less. Less predictable, certainly, as the endings of modern romantic comedies are notoriously pat. More ... what? Strange? Edgy? Depressing even (at times)? Maybe all of the above. But ultimately upbeat.<br><br>The gifted Paul Dano has created a character - a young woman - who is exactly who he wants, or at least so he thinks. It's not until he meets his ex at a party 2/3 of the way through the movie that the audience really begins to understand what's going on. And it's not just hearts and flowers. But no spoilers here.<br><br>That Kazan pulled off both this original idea AND the ability to end it in a way that made sense yet left unanswered questions that should be unanswered is testimony to her screen-writing talents. Her roots here are strong: both of her screen writing parents and her famed grandfather Elia. But Zoe is also extremely appealing as the film's title character, showing a range of acting skills that could make her a star.<br><br>And for fun, we get Bening, Banderas, and Gould, all enlivening the proceedings.<br><br>Original movies are hard to find, and when you find them, often hard to watch. This film is both original and very watchable.","user":"richard-1967","rank":[89,111]}]