[{"title":"No One Will Ever Notice","rating":4,"date":"13 January 2016","review":"This highly elaborate production purports to show the events of the Great Mutiny in India, eked out with the Colonel's beautiful daughter. Although I am fairly adept at accepting the screen conventions of the era -- just before the entire industry was turned on its head -- there are a number of problems for the modern viewer, particularly one who has read a little on the subject -- even though it mostly seems to be from George MacDonald Fraser's highly entertaining FLASHMAN novels.<br><br>For one thing, we need to accept that the natives of India consisted of Caucasians in white robes and burnooses waving scimitars around (representing, no doubt, the Muslims who later formed Pakistan) and Africans in loincloths waving pointed sticks and occasionally tossing globular bombs into the fort; and that the Regular British troops always fought in full dress uniform -- although at the end they were mostly wounded, with an invariable bandage around each heads. Finally, just as the savages are about to break into the fort, the Colonel puts his pistol to his daughter's head to make sure they don't violate her purity -- and misses.<br><br>To the modern eye it looks ridiculous, but the canny film makers of the period knew their audience and their taste for melodramatic balderdash. I'm sure this one was very popular, until the changes that D.W. Griffith began to make at Biograph the same year forced the people in charge to adapt.","user":"boblipton","rank":[4,4]},{"title":"An Indian rebellion, silent film-style","rating":5,"date":"19 January 2017","review":"THE LAST CARTRIDGE is an attempt to make a war film in a low budget and in a ten minute running time to boot. This is a silent black and white short kindly restored for modern viewers, and like pretty much all fare from this era, its historical status alone makes it an interesting watch.<br><br>The film is set during an Indian rebellion and sees outnumbered British soldiers attempting to hold off a violent uprising. There are burning buildings and a shoot-out which is pretty well staged given the era. The film features American actors dressed up as Indian soldiers and some random native characters who jump around a lot; I'm not sure of their context. The ending goes for the melodramatic approach and works quite well.","user":"Leofwine_draca","rank":[2,2]}]