[{"title":"I thought it was good myself","rating":8,"date":"15 January 2012","review":"Previous to this Treasure Island, I saw three other versions of the classic Robert Louis Stevenson story, the 1950 film, the Muppet film and the 1990 TV film. Of the three the best was the 1990 one, though all three have many good merits with the performance of Long John(especially Robert Newton's) being the main good asset in all three.<br><br>This Treasure Island I did enjoy compared to the mix of treasures and disappointments that were on Christmas TV, but I personally don't consider it in the same league in the above. I don't think it is perfect, and I can understand why some have been disappointed, while most of the camera work is good and fluid, some of it in the sped up action scenes looks odd and somewhat frenzied.<br><br>Dr. Livesey is also a much less interesting or likable character compared to his novelistic counterpart. Dr. Livesey in the book was one of my favourites but his rather \"wimpy\" persona here made me quickly irritated by him. The sound is serviceable, though I do agree that it is sometimes hard to hear what the actors are saying.<br><br>However, the locations are really striking and effort is made to make them authentic. The costumes are likewise sumptuous, and the music while not exceptional is suitably rousing. The story, complete with an interesting opening that was a welcome addition to the storytelling I thought, gripped me throughout and the script is witty.<br><br>Casting-wise, I thought it was fine, likewise with the acting. Dr. Livesey may have been disappointing, but I blame the writing more than Daniel Mays. It is not a great performance by all means, but Mays is much better than he was in his miscast role in the awful Outcasts, and tries his best. If anything for me, Elijah Wood was the weak link in the cast as Ben Gunn, I can't place my finger exactly on why it is, maybe the wooden delivery of the lines or the lack of charisma but his performance came across as bland.<br><br>However, while he was deserving of more considering his calibre, Donald Sutherland does a good job playing Flint. Toby Regbo is appealing also as Jim, Phillip Glenister is excellent as Captain Smollet, and while like Livesey(though not as badly affected) Trelawny is not as interesting as he is in the book Rupert Penry-Jones, ever the conscientious and reliable actor he is, gives his all to the role and it works.<br><br>I do agree with those who say that Eddie Izzard steals the show. Long John is such a delicious character to portray, but also one that can easily fall into caricature. Izzard I admit I wasn't expecting to work, I worried he would be too hammy as well as the falling into caricature trap. But no, there is a sense of menace to him, but also some humanity as well, not to mention a good deal of humour and understatement; he mayn't quite erase the performances of Robert Newton, Charlton Heston and Tim Curry, all great performances in their own right, but it is a worthy take and enough to make this Treasure Island even more enjoyable.<br><br>Overall, I enjoyed it. Is it great or outstanding? No. Is it good and worth watching? I think so. I understand the disappointment of some, but as much as I love the other three versions and the book, I did try to judge this on its own terms and found it helped to enable me to enjoy it. 7.5/10 Bethany Cox","user":"TheLittleSongbird","rank":[36,46]},{"title":"Very good if you haven't read the book","rating":4,"date":"9 January 2012","review":"This was a valiant stab at televising the much treasured (no pun intended) book by Robert Louis Stevenson.<br><br>The costume design, the locations and acting were all superb. Eddie Izzard is by far the best Long John Silver that has ever graced our television screens. Toby Regbo is very well suited as Jim Hawkins.<br><br>The program opens with a nice little addition to the book, setting the background up surrounding Flint's crew nicely and explaining the loss of Long John's leg - setting hopes high for the rest of the program.<br><br>Unfortunately there are two massive letdowns for anyone who enjoyed the book, namely Trelawney and Livesy. The acting standards from Jones and Mays is high, however the scriptwriters seem to have read a copy of Treasure Island from an alternate universe, where everything is exactly opposite to the original.<br><br>Trelawney, has been rewritten from having been a kind, generous adventuring man (if not a little too open at times) to being a two faced, selfish, greedy, penny pinching landlubber. Livesy has been taken from being possibly the most gutsy, daring swashbuckler in the Empire - to a pathetic, quivering coward who is ashamed of what he's become. Unfortunately, this is beyond dramatic interpretation - and seems more like the writers ate the book and defecated this script.<br><br>If you can get past these huge inconsistencies and open rewriting of the story (or you haven't read it/seen the original), you are in for a treat - with soaring production values and wonderful acting. If you are a fan of the original, steer well clear as you will most likely spend 3 hours yelling at your television.","user":"DukeMcAwesome","rank":[26,33]},{"title":"Another Ruined Classic...Why call it Treasure Island?","rating":1,"date":"17 January 2012","review":"This whole production was SUCH a wasted opportunity. <br><br>Good cast, good sets, good locations...and then an attempt to update a classic story by meddling with the plot. Bad idea. <br><br>The story is SUPPOSED to be about a boy (Jim) who gets dragged into the excitement of the pirates lives and is tempted away from the good side represented by Squire Trelawney (a thoroughly decent, albeit naive man), Dr Livesy (brave through and through) and his legitimate crew by the persuasive and morally ambiguous Long John Silver. When he realises how black-hearted the pirates are, he rejoins the 'right' side and helps save the day. By making Trelawney a villain (typical modern twist that anyone in a position of power must be corrupt and evil) and Dr Livesy a coward they ruined the whole message of the book.<br><br>Once they'd succeeded in destroying that aspect of the plot, they compounded matters by having the survivors tip all the gold into the sea at the end, having seemingly suddenly realised that material goods are evil. <br><br>Oh and killing off their newly formed 'evil' Trelawny in a ham-fisted attempt at showing that greed doesn't pay. Are you kidding me?! In one scene they destroyed the entire point of the film - all those people died for nothing then?! They might just as well have stayed at home... Rubbish. Absolute rubbish. <br><br>Oh and having Jim free Silver at the end - Nooooooo! He ESCAPES - he's LONG JOHN SILVER - he doesn't need a boy to free him..!!!!<br><br>Oh and finally Long John Silver is supposed to DISAPPEAR - you don't know if he makes it back to his wife or not - its left hanging there...with Jim liking to believe he made it...a far more satisfying end!<br><br>Maybe one day the screenwriters will actually read their source material....there's a reason why a classic is a classic...<br><br>As it is, you have to wonder why they even bothered giving it the same name as the classic tale...after all, it bore no resemblance to the contents of the book.","user":"mattnation","rank":[35,47]}]