[{"title":"Keeping the Faith...","rating":7,"date":"19 October 2014","review":"This was a long time coming and rumours that it was going straight to DVD point to the level of expectations by the industry and producers. Thankfully the film largely delivers .. and the Soul fraternity pushed the distribution industry into showing it . it certainly portrays the sense of excitement and adrenalin that came with the scene. Sadly by the time the lead characters get to Wigan they become emersed in a drug fuel binge and feuds and rather dark , rather than celebrating the joys of embracing such a powerful force . The female characters are sadly rather superficial but there is no denying the quality of the new young acting talent. As a committed Soulie for over 20 years I loved it .. but Im biased. I so much wanted the general public to embrace this film in the way they did with ... say The Commitments , sadly Im not sure they will. There will always be arguments about the sound track..personally I would have liked a touch more diversity and some Jackie Wilson,Major Lance ,.Congratulations Elaine on getting more recognition for one of the few truly grass roots led music scenes often overlooked in this country.","user":"Keepthefaith01","rank":[24,26]},{"title":"Bloody brilliant","rating":9,"date":"20 October 2014","review":"So I saw Northern Soul the film﻿ tonight for the 2nd time. The first time I saw it was at the premier and it wasn't in a proper cinema and the sound was so bad that you couldn't pick out the dialogue.<br><br>I am so glad I went back. I realise that I am biased but it's a bloody good film. I happen to have been lucky enough to be an extra in the dance scenes and have waited 2 years to see this film make it to the big screen. Many times along the way I thought it would never come.<br><br>Elaine Constantine, the director, captures 2 things really well: the 70s and the passion for northern soul.<br><br>She paints a great picture of growing up working class in the 70s and doesn't give in to the more comedic ideas of 70s fashion. This is all very real and there's not one Chopper or Space Hopper in sight.<br><br>The film is dark and gritty but the soundtrack is amazing and her dancers are spot on. Elaine's experience as a photographer is very evident throughout as is her passion for the subject matter.<br><br>She brilliantly captures the look on a dancer's face when they are lost in the music, when it's just you, the music and the dance floor.<br><br>There are several cameos in the film and all are played down and the young leads really shine. All the cast do a superb job. I love the fact that James Lance is a great soul dancer and he picked up the moves to better understand his role but you never see him dance in the film. You can feel that love, that dedication throughout from all involved. This was a labour of love and it worked.<br><br>Although the film sinks into a very dark place she really lifts it with the final scenes.<br><br>A great British picture and I was proud to be allowed to be part of it.","user":"iamchrisallan","rank":[21,23]},{"title":"Before house music, there was northern soul","rating":7,"date":"28 October 2014","review":"Before the emergence of the house and rave music scenes in the late 80's, there was Northern Soul. This phenomenon happened in the north of England where several clubs emerged where DJs played obscure American soul records. It may not sound like much now but I am guessing it meant a lot back in the mid 70's, particularly when you take into account the state of music in Britain at the time. Watch re-runs of Top of the Pops if you need proof that popular music in the UK was pretty dire on the whole at the time. These northern soul clubs offered up something energetic and joyous. From the perspective of today when everybody can get access to any music at the click of a button, it's amazing to think that some of the songs back in the day only existed on one solitary record owned by one DJ; so if you wanted to hear it, you had to go to see his set. The competition between DJs became intense but sadly such a retro scene was always going to have a finite existence because eventually there were no more obscure soul records left to find. Its details like these that I find most interesting about the northern soul movement, a music scene I am too young to remember.<br><br>The film itself is strongest in its early stages when it focuses on the music scene more. It's such a specific phenomenon, it's fascinating in itself. Unfortunately, it does lose steam a bit in the second half as it concentrates more on the inevitable dramatic down-side that the narrative in these types of films seem to demand. In truth it's not entirely unreasonable to broach the subject of drug abuse as by all accounts a few northern soul fans died as a result of this and the scene was fuelled to a large extent by narcotics just as the dance music scene of the last twenty-five years has also. It additionally portrays 70's Britain as a beige hell, with fashions, haircuts and décor all of a remarkably appalling standard; in fact everything seems to lack any joy at all, aside from the music itself. But there is much humour in the script to alleviate the grim state of affairs somewhat and the young cast do good work alongside a selection of well-knowns including James Lance, Ricky Tomlinson, John Thomson, Lisa Stansfield and Steve Coogan. All-in-all, Northern Soul has a fairly generic story-line but it is made more interesting on account of the interesting scene it is based around.","user":"Red-Barracuda","rank":[17,19]}]