[{"title":"Fun, unpretentious slasher","rating":6,"date":"8 October 2012","review":"If you like a some low-brow comedy to accompany your bloody B-rate slasher, then the Creep Van will deliver! *NOTE: The version found on Netflix is NOT the raunchier, uncut, extended version that I viewed online.*<br><br>Despite a couple of shoddy performance moments and an unmistakably low-budget vibe, Creep Van manages very decent gore and a few laugh-out-loud moments. The humor is fairly original, as is the storyline. The characters and kills are curiously quirky. It is written nicely, and the film makes the most of its' budget by employing traditional stage effects and camera trickery rather than CGI tactics. The soundtrack and sound FX, though mostly absent, worked well enough and weren't a distraction.<br><br>The pace is fine, however it's hard to keep track of time that passes within the film. Has a day passed, or a month? Contemplating this was a bother. In fact, there are a number of missing or incomplete components within the story that were slightly bothersome. They did not however, impede My overall enjoyment. I was glad to have watched it, and would watch it again. <br><br>There are a number of topless scenes, hilariously bizarre sexuality, and other graphic moments that make this film inappropriate for those under 17 and for those with a big stick up their ultra-tight posterior.","user":"hi_im_manic","rank":[17,20]},{"title":"Creep Plan","rating":14,"date":"14 October 2012","review":"\"Creep Van\" is impossible to rate because the movie often makes little sense, indeed, its often nonsensical.<br><br>The best comparison is to say it was watching the average YouTube video; the people making it obviously thought it was much funnier than the movie actually was. Often absurd, and occasionally I laughed, but often in disbelief or at the absurdity of the events on screen, rather than because it was funny.<br><br>Another description would be Troma without the talent. Or, if you've seen any Syfy movie where the monster kills bystanders long before interacting with any central characters, the van's screen time is generally limited to things like that.<br><br>Otherwise there's much nonsense, like a drug dealer screaming into his phone before finishing with \"of course I'll tell Mom I love her\", the martial arts girl beating up perverted engineer before both get turned into roadkill, etc.<br><br>It's stupid, but you'll probably be tired of it before it's over.","user":"BakuryuuTyranno","rank":[16,23]},{"title":"bad story, great gore effects","rating":6,"date":"8 November 2012","review":"I have seen Gag (2006) from director Scott W. Mckinlay and it wasn't my thing. It has taken a while, 6 years, before he made another full feature. <br><br>It's a different flick than Gag, Creep Van moves away from torture porn towards B-movie slasher. The effects used are really well done for a low budget but the acting wasn't always convincing. I guess it's a bit due the script not always being that good. When the killer appears the flick is okay and delivers for the horror fans and even the gorehounds. But it is in between that it sometimes become boring or even laughable.<br><br>The cameo from Lloyd Kaufman is funny because he's searching for Mr Kaufman. If you are into bad slashers from the seventies and even eighties then this is your thing, bad story, gruesome killings, gratuitous nudity.<br><br>Gore 2,5/5 Nudity 1,5/5 Effects 3/5 Story 2/5 Comedy 0/5","user":"trashgang","rank":[11,16]}]