[{"title":"Not as bad and not as good as most reviews","rating":6,"date":"16 June 2013","review":"I will not write about the movie, many others did it before. I only write this review to help others make a decision whether to watch or not. If you want a traditional Hollywood (predictable, sugar-sweet) movie in this genre, probably it's nothing for you. It is absolutely nothing stunning or smashing about this movie but it's much better than the 1-3 point reviews. Then again I agree with one reviewer that some review are false or absolutely ridiculous, this movie is NOT 10 or even 9, maybe if you never so a movie before and are exalted about the story and think it's a documentary like some people thought about \"The X files\" if not - then not! But still some funny moments with some good laughs. I rated 6 to get it little higher but actually it's a very strong 5, for me 5,5 :-) I recommend you to watch it, why? It's better than most Hollywood productions that are 100% more predictable. Thanks for reading!","user":"marcus_ferm","rank":[9,9]},{"title":"Fake reviews = terrible movie.","rating":3,"date":"14 March 2013","review":"Okay, so six reviews of this movie...all written within a day of each other, all written in the same voice, and all the reviewers have only one review to their names. If these \"glowing\" reviews aren't enough to make you suspicious, let me be quite clear. This movie is TERRIBLE. It's basically a series of gross-out jokes, ridiculous injuries and tired clichés that could have been written by a group of high schoolers. In fact the entire film has a very amateurish feel to it, which makes it impossible to connect with any of the very thin storyline. Mena Suvari must owe someone in England a big favor, and hopefully this erased her debt, because even this poor excuse for a comedy is far out of her league (which is saying a lot considering she was in American Pie). This \"rom com\" is not romantic, not funny and really not worth your time.","user":"michaeltomorrow","rank":[26,31]},{"title":"Terrible Screenplay","rating":1,"date":"9 May 2013","review":"Another reviewer suggested that the glowing reviews this movie has gotten here are fake, and just looking at them, I did think that they were very similarly worded. The other thing that might tip you off is that they give the movie a very high rating, while the overall rating of the film is only 3.4. I decided to check out the movie myself, and although it has its moments, they are too few and far between to rescue this shipwreck. This movie is about as bad as American Pie: The Wedding. I kept wondering throughout what planet the screenwriter is from, because humans on this planet do not talk or behave the way the characters in the movie do. The acting is fittingly wooden, as the actors were probably cringing internally at the awful, stilted dialogue they had to deliver. I want my hour and a half back.","user":"miltruiz506","rank":[11,15]}]