[{"title":"The movie involves a tried & true western idea & doesn't hold back the grit. One of the better westerns in awhile.","rating":6,"date":"8 January 2014","review":"\"Some say the legend of Duke Donovan began to eclipse the man.\" After Marshall Duke Donovan (Brooks) is thrown in jail as an accomplice in a bank robbery he learns that his former partner is plotting to kill his wife. After getting help he escapes and begins the trail of saving his wife and clearing his name. This movie continues the western tradition of \"the other side of the story\" that every one is told. Movies like Blackthorn, Young Guns 2 and (the one that did it best) The Man Who Shot Liberty Valance are examples of this. When the entire country seems to know what happened but when someone who was involved tells what they know everything changes. Since the plot of the movie involves a tried and true western idea and because it was R rated and didn't hold back the grit this is one of the better westerns in the last few years. Of course most of the recent westerns were Hallmark Channel westerns but even taking those away this was a good western. Even the bad acting didn't affect the way I felt about it. Overall, one of the better westerns that have come out lately. I give it a B-.","user":"cosmo_tiger","rank":[10,17]},{"title":"A Cool Movie With Some Depth","rating":9,"date":"14 November 2013","review":"So I saw this movie last fall at the Austin Film Festival when it was called \"To Kill A Memory\". They had a special showing. Kix Brooks was there with the Director and some of the Actors. In short, the film really surprised me. Not so much because they pulled off a cool movie on a small budget, but because the film wasn't your typical western. It was told as a flashback and really took you on a journey. After the festival, I wondered what had happened to it and was happy to see that it will be out as a limited theatrical in January. Their website also says it'll be out on DVD as a 2 disk set with the soundtrack CD included. The music in the film was awesome!! Kix Brooks talked about doing the music for the film at the festival. If you're a fan of country music, or great music in general.. you'll love this. Coincidentally, I reviewed another film the director did a few years ago called the Gundown. I liked it because they dared to try and make a movie on a shoestring, but this movie is a cut-a-bove it. Give it a shot, you won't be disappointed. Great Cast, cool locations. The indi-film spirit is alive and well with this film.","user":"HistoryProdADM","rank":[10,19]},{"title":"Country and Westerns....","rating":10,"date":"14 November 2013","review":"I live in Nashville Tn and work in the music business and we always laugh when someone refers to our genre as \" Country and Western\" - we prefer simply \"Country\". But with the lead character being skillfully portrayed by veteran Country Star, Kix Brooks and with a killer soundtrack featuring Kix, Randy Houser ( who also appears briefly in the film) and the angelic voice of singer / songwriter Leslie Satcher... I gotta say I'm rethinking Calling it Country and Westerns! Although this was a low budget film, it was really entertaining. Well cast, well directed and full of great performances- it is a really commendable effort from all involved- with extra kudos going to the lead character Duke Donovan - played by Kix Brooks.<br><br>There is a great twist in the plot and I found it thoroughly entertaining from start to finish!!<br><br>Check it out, it's a great watch and if you like Westerns - then you'll really love it! Here's hoping for another installment of Duke Donovan in the future!","user":"lstroud-1","rank":[10,20]}]