[{"title":"Dancing for a cause","rating":6,"date":"26 July 2012","review":"Strength of will and right attitude are the main ingredients for getting what you want. It is not always about being in the right place at the right time. But also making sure those two will meet you half way. <br><br>\"Step Up Revolution\" has for once broken the stigma created by movies where every teenage- dancing character has one and only thing in their minds: fame and fortune. This time they go a bit deeper in search of something more than self assurance or rebel behaviour, trying to bring justice to their people instead of thinking the world revolves around them. The music is not so catchy but the well choreographed flash-mob style performances are quite interesting. It's a good entertainment for dance lovers or anyone in the mood for a good time.","user":"blogurious","rank":[37,55]},{"title":"Bad","rating":3,"date":"18 November 2012","review":"This is the worst Step Up movie I've ever seen.<br><br>We've got a guy and a girl from different worlds who fall in love. Check. We've got a competition to win. Check. And then we've got everything else.. The crew has like 50 people in it and they all hope that winning $100k will change their life. That's $2k a person. Wow! And by the way, they drive cars that are worth like $100k each. And those tools they use to create so called \"ART\" cost thousands of $$$ too. So nice to be poor in America! The main conflict among a boyfriend, a girlfriend and a boyfriend's best pal comes out of nowhere. The pal gets upset without a reason and messes everything up, then a girlfriend gets angry with her boyfriend with no reason too. And how everything turns out is even more amusing.<br><br>Cheap movie, bad script. I give 3 out of 10 just because there were a few nice girls and an Ocean :)","user":"facebook-36-777259","rank":[13,17]},{"title":"Step into dynamic dancing and anemic story.","rating":29,"date":"29 July 2012","review":"When I stepped into the theater to see Step Up Revolution, I expected cutting-edge dance. I got it and maybe better than I expected with robust routines blending 3-D performance and modern art to tell a story that moves from public display to public mission.<br><br>\"The Mob\" is a flash mob secretly doing percussive urban choreography at different times in Miami to publish the dance on YouTube and win $100K for the most hits. The opening sequence using vintage low-riders in a traffic jam is spectacular, a muscular routine using very physical dance and very physical automobiles for an enjoyable fusion of art and pop culture.<br><br>Look, this is not Flashdance or Dirty Dancing, and Emily (Kathryn McCormick) is not Jennifer Beals, nor is Sean (Ryan Guzman) Patrick Swayze (or Channing Tatum from the first installment), but they are attractive performers given simple dialogue but dynamic modern film dancing that uses creative camera angles and minimal CGI to tell a pleasant formulaic story. In other words, I was entertained by the dancing and found the screenplay clichéd.<br><br>Emily's dad, Mr. Anderson (Peter Gallagher, the only true actor in the lot), plans to build a giant complex right in the hood of the dancers, a place romanticized for the purposes of the story but in reality a poor wharf community. The Mob, along with Emily, fights to preserve the area using flash mob to tell their story to the city to stop the construction. The set pieces are uniformly exciting and executed with such energy as to evoke the passions of youth and protest.<br><br>The story and the dialogue are pedestrian, but that dancing is so magnetic that I might go back and see the first three films in the series and maybe Footloose and maybe even West Side story and Strictly Ballroom.<br><br>If for nothing else, Step Up Revolution keeps alive the romantic dance movie genre with some steps even Fred Astaire wouldn't recognize. Now that's revolution.","user":"jdesando","rank":[19,27]}]