[{"title":"Everyone at the Rig SIte have the right to STOP THE JOB","rating":10,"date":"29 September 2016","review":"I am an engineer working offshore in North Sea. I have seen the movie this evening in UK. Is really a good movie, congratulations to all involved you done a great job showing a little bit of ''life in offshore rig''. Looks like in this movie is BP fault but in real world at the rig site everyone has the right to STOP THE JOB if something is wrong or something is going on against the procedures. I have work before in BP rigs in North Sea and I stop the job when I wasn't happy with what is going on I had all the support from the Service Company that I am working for and also BP company understood my concerns. If you are a engineer, roughneck, derrick-man or whatever you are at Rig Site if you think that something is going wrong and against the procedures STOP THE JOB. I do it and I will do again better to lose my job than to see people dying.(Thanks for reading my review)","user":"alaanazrem","rank":[447,550]},{"title":"Must be seen in the theatres! (IMAX if possible)","rating":9,"date":"29 September 2016","review":"I usually don't write reviews but saw mostly negative reviews on here so far and that ain't right.<br><br>It is not a perfect movie and it's not artsy, or profound. However it is very entertaining, has wide appeal, will make you laugh, have you on the edge of your seat and might even make you cry. It's a slow build at the beginning but the tension soon rises and you will then be hooked. The effects appear to be realistic and mostly practical made with a production value that appears to be one of the most expensive films ever made (which alone is impressive given it is not a sequel or superhero movie).<br><br>Mark Wahlberg works as an everyman lead, but it is Kurt Russel who steals the show. Maybe the performance of his career, and the strongest aspect of the film in my opinion. Malkovich is also amazing as the villain, stealing every scene he is in. The two of them along with the incredible story done with top notch sets, effects and sound is exactly why you have to pay the money to see this on the biggest screen possible.<br><br>If you need a film to be a character study or you want senseless action from start to finish then you might be one of the people who is disappointed. But if you are looking for a gripping story with great tension and action that can be enjoyed by a wide range then go see this film.","user":"audiodave_82","rank":[149,197]},{"title":"Gripping and realistic, Deepwater Horizon works both as an enlightening documentary and a fun blockbuster.","rating":7,"date":"1 October 2016","review":"Deepwater Horizon is a movie that succeeds on two levels: as an action-packed blockbuster and as an honest depiction of a tragic disaster. It's the story of the BP oil rig that exploded and contaminated the Gulf of Mexico. The way Berg directs the sequence of events is well paced and purposefully developmental for a good chunk of the movie. It takes about 45 minutes before the crap hits the fan, during which we're allowed time to get to know the characters - their quirks, their personalities - so we can empathize with their situation. The stakes feel real, as they should (and were), which is a testament to the directing and the acting. Mark Wahlberg and Kurt Russell dominate in their roles, Russell given the opportunity to remind us why he's one of the biggest stars ever. The supporting cast is excellent, including John Malkovich, Gina Rodriguez, and Dylan O'Brien, who have chemistry and rapport between other characters (Malkovich and Russell sharing a couple intense moments where not a word is said).<br><br>The disaster itself is portrayed brilliantly. The tone remains frantic and the stunning special effects work puts it over the edge. Once things go south, it's a nonstop adrenaline rush till the end. The only reason it's not rated higher is because it's merely a depiction of events, nothing groundbreaking or revolutionary in regards to storytelling. But it didn't have to be. This was a tragic event and the gritty realism shown here is as refreshing as it is intense. If you're in the mood for a deeper-than-average thrill-ride, look no further than Deepwater Horizon.","user":"lnvicta","rank":[101,136]}]