[{"title":"Genius movie...","rating":10,"date":"4 August 2012","review":"I saw a screening of this in Portland and it is seriously one of the funniest films ever made. It reminded me of Airplane or Naked Gun. Partly because Barry Bostwick turns in a Leslie Nielson-esque performance, and more importantly, you believe him in the role of FDR. Don't get me wrong the dialogue is out of control and everything is played over the top, including the effects and werewolf costumes, but the cast seems to revel in it and act it out as if the words were Shakespeare. The surrounding cast around Bostwick really rose to level that he was playing his character, especially Ray Wise, Bruce McGill, and Ross Patterson. The filmmakers manage to pull off the low budget aspect and use it to bolster the film, so much so, that it seems like it was specifically written for that type of vibe. The film itself is extremely crass and involves blatant racism, but no one is safe from it. I for one LOVED this film and think it has the potential to be an instant cult classic, but I'm sure some people will be offended.","user":"babyfro","rank":[43,57]},{"title":"Are you in a Great Depression? Franklin D. Roosevelt says, just new deal it with this movie. It's funny enough to watch.","rating":5,"date":"21 June 2014","review":"Indeed, FDR: American Badass is serving up a new deal of stupidity, here. Directed by Garrett Brawith, the movie is an over the top spoof that is trying to capitalize on the new trend of mixing historical characters with the horror genre that was made famous by author Seth Grahame-Smith. Seth Grahame-Smith is most famous for 2010's Abraham Lincoln, Vampire Hunter that was turn into a movie in 2012. Seeing that, Abraham Lincoln, Vampire Hunter was being made into a movie, Screen Media Films &amp; Common Thread went the Asylum Productions route in making a mockbuster. The film was apparent intention of piggy-backing on the publicity of that film with a similar concept. Instead, of having Abraham Lincoln fighting Vampires during the Civil War. This film has Franklin D. Roosevelt (Barry Bostwick) fighting werewolves during the events of World War 2. While, the movie, Abraham Lincoln: Vampire Hunter had a way bigger budget, I felt that FDR: American Badass was a better movie with a lower budget. The reason why, is that the movie didn't really take itself serious, like Abraham Lincoln, Vampire Hunter. Trying to make the movie seem like it really happen, just insult the intelligent of the viewers. Both movies are not historical accuracy, but having Abraham Lincoln save the slaves, due to vampires is an insult. That's more an insult, than having Axis of Powers being all werewolves. While, the movie has a lot of racism stereotypes of Germans, Italians and Japanese. It wasn't too extremely in bad stereotype taste, in my opinion. I did find humor in the idea of putting werewolves' blood in wine &amp; beer. Then, everybody dissing sake. Another funny moment is the idea of Italy wanting to invade Ethiopia, which they did, in real life. I did find the accents by the foreign werewolves a bit annoying. The action scenes were so limited in budget. That, the fake looking CGI, awful make up, fake blood, and silly sets just add to the ridiculousness value to the film. At least, the movie didn't go into really dark humor with mentions of Holocaust, the bombing of Hiroshima, or other tragic events. Another reason why people probably could see this movie is due to all the cripple jokes. If you can't stand cripples jokes. Just walk it off. The movie doesn't make FDR in shame of his disability. He embrace it, and makes it work in his favor. They make FDR, a stand-up guy! Barry Bostwick really does a good job as Franklin D. Roosevelt. While, he's looks more like Burgess Meredith's Penguin from the 1960's Batman series. He's a more convincing actor to portray FDR, than Bill Murray as FDR in 2012's Hyde Park on Hudson. Most of his set up jokes were pretty funny. Others were lame, like his legs. The supporting cast was pretty bad for the most part. I was really disappointment, because some of them are really good season actors. The crude language was mostly misses, as it felt out of place for the most part. The way, the actors deliver the lines felt like they were just reading off their lines. I guess, they just there to pick up their paycheck, and didn't put much into it. The only other character that was funny was Southern gentleman, Cleavon Buford (Ross Patterson). His character really remind me of Val Kilmer's Doc Holiday character in 1993's Tombstone mixed with Will Ferrell's Hot Tub Lovers skits from Saturday Night Live. I love the scene where he recalls the time, he fought against a werewolf. Another one is the scene, he jump out of an airplane. While, the sexualized jokes from him and his wife, were way too dumb. Just the way, he delivers it, is funny enough as he has no clue, what he's saying. One thing that was oddly place was the nudity. There is boobs fan-service for the male audience. Not much, for the women viewers to look forward to, as the women characters are just sex object here. Even Eleanor Roosevelt (Lin Shayne) was bitchy, and unlikeable. Honestly, they could had add more to her character than being whinny. I did find the potty humor, just unfunny and tasteless. I thought, at less, they could had cut those scenes. Another are the hip hop lingo radio fireside chat and dumb marijuana trip with Abraham Lincoln (Kevin Sorbo). I just couldn't get into. I did like the clever trust the American Eagle of Justice joke. Another thing that bugs me is the pacing. The movie really had a lot of padding scenes. They could really cut the whole helping Great Depression as its plays no factor in the film. Its takes forever to get to the World War 2 plot and they never resolve it with the ending. It was awful, how rush, the ending was. Overall: The movie is indeed, stupid and knows it. I wouldn't say, it's the best comedy ever, but if you just need a movie to be playing in the background, while you do something else. Check this out if you're on your last leg.","user":"ironhorse_iv","rank":[5,5]},{"title":"Completely ridiculous but great fun","rating":7,"date":"28 September 2012","review":"From the outset this film looks cheap and you might consider not bothering to watch it based on that but if you stick with it the great cast suck you into it's unbelievably ridiculous world. Barry Bostwick's performance Carry's the film. There's a lot of modern street talk that he manages to pull off, even though some of it is borderline to silly but at the same time he turns in some great speeches that would be worthy of a far more serious film. <br><br>There's not much point in explaining the film, it's far to daft to attempt an explanation but it works, that's mostly down to the cast, the production, direction is excellent too, given the low budget nature of the film they made the most of what they had.","user":"turkmick","rank":[22,31]}]