[{"title":"Very Likable Comedy!","rating":8,"date":"17 June 2014","review":"Admission is the latest Tina Fey vehicle and the end result turns out to be a charming and rather likable comedy. Granted, some parts are rather bland and contrived which you can thank the screenplay for, but the charming actors, subtle direction, and an interesting story is able to elevate this movie to be the charming movie it is.<br><br>Paul Weitz directs a film about an overworked Princeton admissions officer named Portia Nathan who on her recruitment trips, meets the highly intellectual Jeremiah takes to the help of an old college classmate named John. Against all odds, she decides to do what she can to get Jeremiah enrolled in Princeton despite his high school mediocrity.<br><br>As mentioned before, this film has very likable actors and the chemistry fluidly bounces off with each other. Tina Fey is great and she reminds me of her role as Liz in 30 Rock. Paul Rudd is the perfect man for her because of his charm and he was excellent. Nat Wolff as Jeremiah is very sweet and has come a long way since his Nickelodion series. Finally, I loved Lily Tomlin's character as Tina's mother because she was a hoot! <br><br>Overall, Admission was destined to be a so-so movie, but it wasn't so in my eyes. It's not a laugh-out-loud comedy but it's not meant to be despite a few moments when I chuckled. There is a fair amount of drama and romance here to be effective. It's a small movie, but I had a good time with it. I rate this film 8/10.","user":"g-bodyl","rank":[7,7]},{"title":"I admit I liked Admission.","rating":21,"date":"21 March 2013","review":"The amusing Admission is the first successful comedy of the year and a reasonable look at the admission process for an elite college--Princeton. Tina Fey as Portia and Paul Rudd as John turn in pleasant performances as an admissions executive and a progressive school teacher respectively. Rudd is amiable here and usually successful in his film career, while Fey's efforts up to now have been mediocre (Date Night, Baby Mama).<br><br>As an Alumni Admissions interviewer for over 30 years at Georgetown University, I find much of the story ringing true from the overachieving candidates nurtured by ambitious parents to the underachieving but brilliant and risky individualists. Portia must struggle with the boxed-in role of continuing the Princeton tradition (read stereotypes) or breaking away to push for a student who calls himself an \"autodidact\" with low grades but perfect scores on achievement tests for courses he never took.<br><br>Amid the plot's fierce applicant battle for a slot, Portia and John dance to the usual romantic formula of disliking each other to . . . Well, you know the drill. However, it's their reactions to the admission process that provide the authentic tension as he has developed students with independent minds, and she is used to the cookie-cutter candidates who lack the passion of those independents.<br><br>Director Paul Weitz knows something about family dynamics and children with his About a Boy, In Good Company, and Little Fockers among the more obvious examples. Signing up Lily Tomlin to play Portia's feminist mom was inspired; like the ubiquitous aging Alan Arkin, Tomlin should now have plenty of work.<br><br>Admission requires no small amount of sympathy for the messy business of growing up and getting ahead—Weitz navigates the vagaries of family ambition well. If the double-meaning of the title seems too precious to you, don't worry, the rest of the story is almost unambiguous.<br><br>Although Admission is mostly about applicants to an upper-tier college, it also poses the unethical means some might employ to gain entrance. Even Portia is not blameless, a touch I found in the film's favor while it deals with the unreal segment of our population smart enough to be considered for admission.","user":"jdesando","rank":[53,70]},{"title":"Very underrated movie, in my opinion","rating":9,"date":"4 July 2013","review":"I was really surprised at the review ratings for this movie.At first I considered not watching it because of the average rating, but when flipping through it it appeared like a movie to consider watching, after all some ratings, for me, have been way off. I am not into really bad slap stick comedy or bad acting, or in mediocre been done before scripts. I began watching the movie and almost regretted it, after a slow start, and after a few over acted comedy parts, but upon finishing it, I was glad I stuck it out. The overly comic parts were far and few between, and turned out to be a little of the comic relief that balanced the emotional and some what unique script. The acting by Tina,Ben,Paul,and Travaris was actually good (they gave Tina a bit much of the overly comic parts, but what can you do). Overall, I was impressed with the movie and its \"differentness\". <br><br>I would recommend this movie to those who aren't overly critical on every detail and aspect of a movie, to those who like sensitive movies that overcome pasts and trials and fight for people and ideals, and to those who can weigh the value of people who are not perfect or who do things perfectly, but who change and grow and fight to do better.","user":"aandrewdorst74","rank":[40,54]}]