[{"title":"Delicate Subject Makes For An Unforgettable Film","rating":8,"date":"21 November 2012","review":"\"The Sessions\" is a sensitive and poignant film with an outstanding performance by John Hawkes as poet Mark O'Brien a childhood victim of polio that left him paralyzed from the neck down and dependent on personal attendants and an iron lung that enables him to survive the nights without suffocating. In voice and facial expression he manages to perfectly capture the life of a severely disabled man who likes to push against boundaries and retains a sense of humor--he tells someone that he believes in God because he needs to blame someone. This role is quite a departure for Hawkes who gave terrific performances in films like \"Winter's Bone\" and \"Martha Marcy May Marlene\" where he was Jennifer Lawrence's loner brother and a deranged cult leader haunting Elizabeth Olsen. Helen Hunt is memorable as the sex surrogate to whom O'Brien turns to help him achieve his dream of sexual intimacy with a woman. A professional as well as a wife and mother she doesn't hesitate to take exception with the notion that she is some kind of prostitute and clearly she isn't. William H Macy is the local parish priest whom O'Brien a devout Catholic relies on for advice and encouragement. There's plenty of wry humor watching Macy trying to figure it all out as he knows he's in uncharted waters. Based on a magazine essay director/writer Ben Lewin handles this unusual subject matter with great sensitivity and intelligence. This isn't some Hallmark TV movie it's a mature, honest film that isn't going to insult your intelligence. Definitely worth seeing.","user":"georgep53","rank":[69,74]},{"title":"Touching, Intimate and Adult Film","rating":10,"date":"10 October 2012","review":"John Hawkes continues to amaze with his chameleon-like embodiment of unusual characters. This time, he plays Marc O'Brien, a 36 year-old polio victim who has spent his life horizontal in an iron lung. Based on a true story, O'Brien is a poet and a romantic, who has never had a sexual experience. After consulting his priest, ( William H. Macy perfectly embodies the Berkeley radical father), he contacts a therapist and hooks up with a sexual surrogate, Helen Hunt. Their \"sessions\" form the heart of this tender film, and take both the audience and Marc on a journey of self-awareness and discovery. Hawkes is simply amazing. He imbues the character with innocence, hope and wry humor in what can only be described as a tour de force performance. Hunt is equally skilled in her role, combining professionalism, playfulness, sensuality, and compassion in series of sessions which require full nudity. Both actors are courageous in their pursuit of truth and humanity and achieve Oscar caliber performances, thanks to the sensitive direction of writer/director Ben Lewin.","user":"barbaras2050","rank":[84,94]},{"title":"Will Make You Laugh, Cry and Look at Life More Positively","rating":8,"date":"22 November 2012","review":"The Sessions tells the inspirational true story of Mark O'Brien (John Hawkes), a poet/journalist who has an iron lung and is paralyzed from the neck down due to polio. At age 36 he decides to finally lose his virginity and – with the support of his friend/priest (William H. Macy) – hires a sex surrogate (Helen Hunt).<br><br>John Hawkes (Winter's Bone, Martha Marcy May Marlene) has been gathering accolades for his performance in The Sessions – and with good reason. He not only delivers on the physical demands of such a role but he manages to encapsulate the emotions of a man with a broken body but a good heart. It's an impressive performance that should see him at least receive an Oscar nomination come next years awards. Hawkes is almost matched by Helen Hunt. She bares all in a brave role that depicts a woman struggling with her job and her emotions. These two performances are some of the best (so far) this year. William H. Macy also gives a good performance as a likable priest that O'Brien is able to confide in.<br><br>As a whole, the film doesn't shy away from much. The sex \"therapy\" sessions are depicted as realistically as possible and are both funny and touching (no pun intended). Ben Lewin's direction is simple yet it manages to adequately depict O'Brien's world without sensationalizing it. It's an all round simple tale that is well told. This is an adult drama that will make you laugh, cry and look more positively at your own life. There aren't many films that do that these days.","user":"gt-thereelword","rank":[56,62]}]