[{"title":"Big Film","rating":8,"date":"18 January 2013","review":"Watched this at the Cinema months back and hadn't seen it since, so I decided to buy it the other day on DVD. A brilliant film, not entirely original but a fresh take on a done subject. 'Offender' stands comparison against the great British films of today, such as 'Kidulthood', 'Adulthood', 'Harry Brown', 'Ill Manors' and so on. After a blistering opening sequence, the film continues to impress with its bleak vision of prison life. Joe Cole stars as Tommy, the good young lad who thrown into hell when his girlfriend is assaulted. He's out for revenge. Need I say more. With his moody baby face and mental transformation, Joe Cole is sensational as Tommy. You can feel his pain and anguish and you want nothing more than for him to get his revenge. The other performances are good too. English Frank is both laughable and menacing. The soundtrack is superb at times, the settings feel genuine and the violence is swift. While this isn't cheery stuff, it's sure to impress and entertain certain viewers. Cole really delivers and I hope he goes far after this. ****/*****","user":"seany_c","rank":[15,19]},{"title":"Good Brit young offenders film","rating":7,"date":"28 November 2012","review":"This will appeal to those that like the genre,which i do if made well,and this is made well.<br><br>Am not sure why it scored so low but can only assume reviewers either were not of UK or were expecting such high things from it that they felt disappointed when did not reach those expectations?<br><br>For myself i found it professionally made,interesting to watch and very enjoyable, but then i am from UK and like i may not associate with low life's from other countries i could see the realism of the characters since they are based in UK and i have seen the types being portrayed on a daily basis and can vouch for their realism and appreciate the film more because of that i suppose.<br><br>Is not an all action film sidelined with a love interest like Bourne trilogy,but then neither is it boring-its gritty,believable,and well made,and i recommend watching it.","user":"FFAxDAVID","rank":[33,49]},{"title":"grows on you, powerful","rating":8,"date":"10 August 2012","review":"its an update on scum but very different from recent film dog-pound it actually goes beyond both those due to a truly stunning performance from lead actor Joe Cole who is a newcomer.<br><br>Cole is amazing, he has intensity and focus and emotion that reminds me paddy considine sometimes, and also tom hardy in Bronson.<br><br>the rest of supporting cast are strong especially the evil prison warden. lots of shaky camera work and a good soundtrack.<br><br>very violent sometimes too violent in places, and the ending of this film flips it on you. but after having left it just grows on you and you think more and more about the lives of the two main characters at the end, and what must have happened to them beyond where the story left off, the sign of a good story always if it rattles round in your head as you leave the cinema.<br><br>its not really comparable to a Prophete that was a very different film, but this film becomes the new Scum for this century and thanks to actor Cole who will be a star it is powerful enough to be better than Winstone's film from the 80s.","user":"ambam12","rank":[24,42]}]