[{"title":"It wasn't as bad as people make it out to be...","rating":5,"date":"14 May 2012","review":"Having read nothing but bad things about this movie, it was with a certain level of disinterest that I sat down to watch it. But still, I did because I am a fan of all things zombies (and have seen/read a lot of bad zombie stuff in my time). \"Humans Versus Zombies\" wasn't as bad as people had it made up to be.<br><br>Sure it is a low-budget production, but the director, Brian T. Jaynes, managed to do well enough with whatever funds and props were available. I think for a low-budget movie, \"Humans Versus Zombies\" was actually in the better end of the scale. One thing was so bad about this, yeah, we get that the director is into zombie stuff, but the excessive usage of zombie materials (t-shirts, books, posters, etc.) everywhere in the movie was just a little bit too much. Yeah, we get the point; you like zombies, but tone it down a bit for the next movie, yeah?<br><br>The effects in the movie were fair enough, not top notch million dollar Hollywood budget here, but still, it worked out well enough. The zombie make-up was adequate, and some of the scenes with gore was actually quite good. Personally, I am not a fan of agile zombies running around, but hey, that is a matter of preference.<br><br>\"Humans Versus Zombies\" did suffer from a really bad dialogue script. There were moments where my toes were curled up in frustration and disbelief at what people said in given situations. But hey, the actors worked well enough with the script they were given to their characters. And as for the actors, then people actually were putting on good enough performances for a movie of this range - just don't expect award winning acting here.<br><br>Now, the movie was actually fast paced and high on adrenaline, which was working in its favor. Let the movie get started, because the beginning was a tad slow. The intro sequence, with the CGI effects, was actually really good. I liked that quite a lot.<br><br>The best thing about \"Humans Versus Zombies\" was the ending. Oh, how I just love those kind of endings. It is so non-Hollywood, with no happy endings and everyone living happily ever after. I will not reveal the ending, but having said what I just did, you can add two and two together, right?","user":"paul_haakonsen","rank":[15,19]},{"title":"A better than expected low budget zombie movie","rating":6,"date":"29 March 2012","review":"After getting the opportunity to watch this movie I decided to write my very first review on IMDb. Not because I found the movie to be exceptional in itself but because the previous reviews puts the movie in an unfair light.<br><br>Mostly it's about expectations, if you watch it expecting some multi billion $ academy award winning production you will be disappointed but if you watch it expecting the kind of movie you often get when you watch a movie that has a 3 star average on IMDb you will have a much better experience. I was expecting a 3.<br><br>Humans Versus Zombies is not the best zombie movie ever but it's also not the worst movie ever made, it's actually pretty average, or at least not much worse (I watch anything with zombies in it, at least once, so I've seen a lot of really bad zombie movies..this is not one of them). The script is decent which in zombie land means that someone actually made an effort here, it's coherent enough to not be intrusive but it wont win any awards. Pretty much everything used in the movie is in the range of below average to average, the script, the acting, the effects, etc.<br><br>Don't let \"average\" discourage you from giving HVZ a chance though, this is one of the movies where the cast and crew makes good enough use of what they have to make you wonder what they could have done if given a larger budget to work with. There are people involved here that know what they are doing, making a movie with average tools often yields a terrible result but here they've done a much better job than you might expect.<br><br>Most of the acting is in the range of average to slightly above average, very little of it is actually bad (there's a few of the supporting actors and a few scenes where the acting is... less than stellar, but most of it is OK). Dora Madison Burge's (Tommi, the gamer girl) performance in some scenes was definitely above average and Brad (Chip Joslin) was hands down my favorite character who if this had been a big budget Hollywood version definitely would have been played by Jack Black (not that Chip did a bad job, on the contrary, Brad wouldn't have sucked if Chip hadn't played the character the way he did).<br><br>The effects were so so but they too were used effectively (ie with moderation, no long scenes zooming in on fake looking zombies or gore), there was some obvious CGI used in a scene (I wasn't looking for CGI so there may have been more that I didn't pay attention to but if so, good job then.) but it made sense where it was used and the scenes were shot in a way that made it not matter whether you'd notice the CGI or not (ie, this movie obviously is not a made for TV SyFy movie...SyFy shouldn't be allowed to use CGI at all, ever.).<br><br>If you watch the movie with reasonable expectations you'll most likely enjoy it. It's not Shaun of the Dead so don't expect it to be, it's not Resident Evil so don't expect that either. Expect an entertaining zombie movie that is far from perfect but also could be much much worse. <br><br>Speaking of SyFy, the previous zombie movie I watched was Zombie Apocalypse, a SyFy original! Humans Versus Zombies is a much better movie.","user":"ravenleft","rank":[26,36]},{"title":"Did a zombie make this film?","rating":1,"date":"28 March 2012","review":"The first 4 reviews actually misled me into watching this movie. Anyone giving this film more than 2 stars is obviously in cahoots with the production.<br><br>Overall: unbearable. The quality of the production itself is decent, but even with all the rogue pop-culture references and randomly-placed aerial shots, these just don't even begin to make up for the story and acting.<br><br>Acting: terrible, with the exception of the \"Brad\" character who is pretty much the sole source of comedy in the film - so he doesn't count.<br><br>Plot: terrible. The very beginning was somewhat interesting, enough to lure you in, but then it becomes incredibly dull for the majority of the movie. If you enjoy endless, pointless, and mind-numbing teenage conversation mixed with a flat plot development - this film is for you.<br><br>This film was so bad, in fact, that it rubbed off on the film we decided to watch afterwards. This is what I get for choosing a film with such an unimaginative title like \"Humans Versus Zombies.\"","user":"hunter-epic","rank":[31,45]}]