[{"title":"Do yourself a favor - make sure you see this movie","rating":9,"date":"2 September 2011","review":"Caught \"A Separation\" in Amsterdam last night, fully unprepared for its greatness. I hadn't been swept off my feet for a while, but this Iranian Hitchcockian drama sucked us in for 123 minutes and left us very, very impressed.<br><br>I'm mainly writing this review to assure every non-Iranian IMDb-reader that you absolutely SHOULD see \"A Separation\". I will be shocked if this movie doesn't win an Academy Award. The acting is great, and the script is probably the best I've seen in five years. The genius of Asghar Farhadi's story is that it piles on the tension and drama without resorting to fireworks, trickery or shock and awe plot effects. It also manages to perfectly balance the plights of several protagonists. Very few screenwriters have this capacity.<br><br>If this movie reminds me of anything, it is \"Ladri di Biciclette\" (Bicycle Thieves), which has a similar seemingly \"simple\" story setup. But then \"A Separation\" is much more developed, much more complex, much richer. Go see it.","user":"krisrox","rank":[653,719]},{"title":"A Perfection","rating":10,"date":"5 July 2011","review":"If mainstream cinema leaves you soulless, see this film. <br><br>If you have a modicum of intelligence, see this film. <br><br>If you like great acting and directing, see this film. <br><br>If you like great writing and editing, see this film. <br><br>If you have an interest in law, see this film.<br><br>If you are a parent, see this film. <br><br>A Separation is not harrowing or depressing. Fear not as I did before. If you don't like subtitles, you will forget they are there. Do not read any more detailed reviews. Go without preconception. A Separation deserves all the plaudits it is getting and deserves a much wider audience. Minimalistic and economic, a Separation is one of the finest, most chiselled pieces of cinema of this millennium.","user":"tait_tait","rank":[1,1]},{"title":"thoughtful, brilliant film","rating":10,"date":"2 December 2011","review":"This is the first Iranian film I've seen, and I'm recommending it to every-one I know. It is so well-crafted; the twists of the plot throw up new moral dilemmas for all the protagonists, which are explored sensitively and without judgement - so refreshingly unlike mainstream American films. I felt sympathy for all the characters, even the threatening Hodjat, full of misplaced rage which often erupts volcanically. And as a footnote, the film felt like an intimate view into a society that our news media portray as monochromatic and extremely foreign. (I am writing this a few days after the UK embassy in Tehran was ransacked)","user":"jsrees","rank":[289,334]}]