[{"title":"This was fun, nothing more should be expected","rating":9,"date":"9 July 2013","review":"I don't get the hate for this movie based on the reviews so far, as it certainly isn't trying to be an Oscar contender.<br><br>This is a well done found-footage film with a welcome twist.<br><br>My only complaint has to do with the cop story in the beginning. The hints at a deeper backstory for the haunted-looking cop were completely pointless, as he ultimately served no purpose other than to provide a small detail that is of some significance later on.<br><br>From that point on, however, the movie takes off, and other than the red-herring police story, the film was enjoyable, fast-paced, and worth watching.","user":"smoke0","rank":[39,55]},{"title":"Is someone tampering the evidence?","rating":7,"date":"9 February 2014","review":"What a start this film has. A frozen picture of a crime scene, taken by a low flying drone camera, like nothing I've seen. A bit was resembling the 2001-film Swordfish, but still this was amazing. It immediately lit my interests immensely. Some obviously CGI, but still a haunting start!<br><br>This is another take on the found footage genre. But different. Some kind of meta theme in the footage as well. This is evidence found on a couple of phones and video cameras at a crime scene. At the start of the film we get a glimpse of what have happened, but what lead up to it. No one at the crime scene is alive to give any explanation. The tape shows a group of youngsters arriving at a desolated place with a lot if abandoned trucks and houses.<br><br>Like most found footage, this is both annoying and exciting at the same time. A genre difficult to immediately like, but still interesting in many ways. <br><br>The fourth outing from American director Olatunde Osunsanmi, and the first I've seen. Though there's a lot of cameras around, there's a lot of not so likely here towards the end, before whole film takes a twist, making it more likely after all. <br><br>Smart film, with an interesting plot. A good, twisting found footage flick, most of all recommended to the fans of the genre.","user":"OJT","rank":[21,30]},{"title":"Let me wake up and write my review","rating":3,"date":"1 July 2013","review":"This film is a mess. By the time all the details have been revealed, I could not have cared less. I generally will watch found footage films, even though I am often disappointed, however I don't remember being less interested in a found footage film than I was in this one. I was interested in seeing this film, I enjoyed \"The Fourth Kind\" (the director's previous effort) and I like the actors in the film.<br><br>I found myself unable to get involved in the plot and it just did not generate any suspense which is vital for a found footage film. Whatever kind of film you are making, you are trying to tell a story and if you lose viewers at the beginning it's awful difficult to get them back interested. Hopefully, the director's next effort will be more successful. All I can say is skip this one!","user":"iraz","rank":[51,87]}]