[{"title":"Wow... the action in this film was mind blowing!","rating":8,"date":"22 February 2020","review":"This is no doubt one of the greatest action movies I have ever seen. This is a violent movie with very little dialogue so know that before going in. The hand to hand fighting in this film is the best to ever be put on the big screen. This movie seriously blew me away. The one flaw would be that it doesn't have the greatest plot but it's enough to keep the action interesting. Please do yourself a favor and watch this movie!\n..............................................................\nTHE RAID: REDEMPTION QUOTES\nLet's clean this city's mess!","user":"MR_Heraclius","rank":[40,41]},{"title":"Possibly the best martial arts film I've seen","rating":9,"date":"1 April 2012","review":"After seeing the trailer, I knew I had to see this movie. Rarely our my high expectation met but The Raid surpassed it. If your seeing this movie, it's because you want to see action and The Raid hit every mark. The action is a mix of shootouts, hand to hand weapons, and mostly good ol' fashioned fists.<br><br>The Raid proves again how far behind American action films are. I've seen other great foreign action films like Ong-Bak, The Protector, and Ip man but The Raid surpasses them by highlighting a martial art style not shown in any recent films. Its brutal and never lets up. It's not your typical ultra clean fighting that has been done to death but something that looks real and desperate at times as people try to survive outnumbered.<br><br>Story wise it isn't anything great but at the same time it's better than most martial arts films due to interesting twists and being incredibly well paced to before you know it its over and you want more.<br><br>If your a fan of action films, there isn't any better out there now or any even close in decades past.","user":"bebop987","rank":[220,248]},{"title":"Non-Stop Crowd Pleaser","rating":8,"date":"12 September 2011","review":"The Raid, a new non-stop cornucopia action film, comes from the most unlikely of sources – Indonesia. But don't let the country of origin fool you. The Raid is jam packed with some of the best action sequences we've seen in years and audiences are sure to walk away with an adrenaline rush punch to the gut that far exceeds their forked (over) entertainment dollar.<br><br>Starring a bunch of actors we can guarantee you have never heard of and written and directed by Gareth Evans (another name you are surely not to recognize), The Raid offers big time action sequences chalked full of gunfights, knife fights and enough hand-to-hand combat to rival any movie in recent memory.<br><br>The idea behind The Raid is remedial. A group of well armed police officers enter a 15-story apartment complex overflowing with a group of better armed drug dealers and bad guys intent on holding their ground. The police are lead by an over anxious Lieutenant who leads his squad of mostly rookies into the apartment complex where they are quickly over matched and out gunned. Their objective is to find the drug lord who resides on the 15th floor and bring him to justice. Easier said than done.<br><br>Bodies on both sides of battle fall to the ground like rounds from a Gatling gun in an Arnold Schwarzenegger movie. The police – those that survived the opening shootout – are split into two groups with Jaka (Joe Taslim) fighting alongside the Lieutenant and a rookie officer, and Rama (Iko Uwais) who tries to protect an injured officer while battling the hordes of oncoming baddies.<br><br>What ensues over the course of the next 80-minutes is a rip-roarin' blast of gratuitous bloodletting. The gun battles are more intense than the bank robbery scene in Michael Mann's Heat, the apartment hallway battles make the scene in Oldboy look like a Pixar film and the cops are as overmatched as U.S. Army Rangers were against an entire Somalian town Black Hawk Down.<br><br>Director Gareth Evans clearly wants you to leave your brains at the door and celebrate in violent beatings and fight sequences that were stylishly choreographed and continue with such relentless regularity that you almost want to pause the projector to catch your breath before the next group of bare-fisted bruisers hit the screen. Our two main leads take more body blows than John McClane did in all four Die Hard films and their resilience and ability to be beaten to a pulp and yet have the ability and the strength to continue fighting is beyond this reviewer's comprehension.<br><br>If there was but one small issue we had with the film it was that everyone who lived in the apartment complex had the fighting skills of an UFC righter or karate expert. Young, small, big or tall, they hall knew how to deliver a multiple high-kicks or at least take one and get right back up for more.<br><br>There is a small twist in the film that is clearly evident a reel before the actual reveal on screen, but it hardly takes away from the fun filled excitement leading up to the plot turn.<br><br>The sum of all its parts makes The Raid a must-see for anyone appreciative of non-stop battles where machetes are luxury and where a broken fluorescent tube can send a packed theatre into jubilant applause. It may lack the sophistication of The Departed, but it catered to an audience that couldn't get enough by the half-way mark and then was left gasping for air like a prized fighter in the 12th round towards its conclusion.<br><br>www.killerreviews.com","user":"gregsrants","rank":[319,367]}]