[{"title":"It is light viewing and a decent story","rating":7,"date":"20 June 2016","review":"I really don't know why people are writing comments slating this film.<br><br>It is not a 'hardcore; horror that is likely to make you seek therapy for the rest of your life, but it is not dull or unwatchable either.<br><br>The production is good, the acting is good, and it is the kind of film you can watch when you just fancy a 'movie night' with friends or family.<br><br>The story is engaging enough to make it interesting.<br><br>All these pseudo-intellectual ramblings criticising the film are just that - pseudo-intellectual.<br><br>It is probably not the best film you will watch in your life but is it also very far from the worst.","user":"mjsreg","rank":[76,100]},{"title":"Not THAT bad 7/10","rating":7,"date":"5 June 2016","review":"So another example of how IMDb user reviews and ratings have slated another reasonably good film. Clearly everyone has different expectations when it comes to horrors, and for me personally, movies like Insidious, Paranormal Activity, Sinister and Dark Skies etc tick the box. And this was one I would gladly add to that list. Unfortunately with most new movies, the story lines and scares are nothing original and this one is no different. If that is enough to put you off then I suggest you don't watch this. I on the other hand, take a movie for what it is and I was not in any way disappointed. The cast, acting, script and effects were all decent enough and it was all a bit predictable but who cares.... I enjoyed it. Unlike 90% of the reviewers here who seem to be wannabe critics and outright movie boffins, I on the other hand am just a NORMAL person. This film is worth watching if you are not going to dissect every scene from the start to the finish merely to find faults. 7/10","user":"ajp-06126","rank":[81,113]},{"title":"Not so scary darkness","rating":4,"date":"16 April 2018","review":"With some talent in the cast, a cool cover, that it did look fairly eerie and that boasted one of the best concepts for any film seen recently by me, 'The Darkness' potential was pretty big. Also appreciate the horror genre and have liked films in similar vein, so watched 'The Darkness' oddly enough with the genuine want and intent to like it. <br><br>It does pain me to say it, and it is going to sound repetitive being a common thing found in recent viewings and mentioned, but 'The Darkness' managed to be a big disappointment for me and from the sounds of it many others. Big potential, executed in a way that while not terrible rarely rose above mediocrity overall. There are moments and good things, but they were too far and between and not enough for a film that did little with such a good idea. It may annoy people with me saying this a lot recently, but it is hard to not say anything when wastes of good ideas and talent is a bugbear of mine and something that has featured rather too heavily in my recent film viewings.<br><br>Kevin Bacon and Radha Mitchell are reasonable leads and David Mazouz is more than up to their level. So the acting is better than average on the whole and somehow manages to rise above the material that was not worthy of them.<br><br>'The Darkness' does have an atmospherically spooky look, an eerie music score and a few unsettling moments. <br><br>Unfortunately, the creepiness and suspense not just doesn't come consistently, there is nowhere near enough of either. There is an over-reliance on scares, mainly of the jumpy kind, but few come off effectively. Again a few unsettling moments, but too much of them are easily foreseeable and derivative.<br><br>Furthermore, too much is over-explained, there is far too much exposition (much of it clumsy and rambling) and too much is given away too soon. The characters aren't very interesting, not to mention very clichéd that it makes the distinct lack of originality even more obvious, making everything really predictable. The script is lazy and underwritten, with too much reliance on the scares, which are not strong enough to come over successfully, the ending is a very \"that's it?\" one and the intrusive and obvious sound effects telegraph the outcome of the scares early on in the build-ups. <br><br>In summary, not terrible but mediocre and a waste of potential. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[6,6]}]