[{"title":"Psychologically entertaining with a first-rate screenplay","rating":9,"date":"16 December 2012","review":"I see this movie as a look at life through the perspectives of different generations. Aging may bring wisdom, (well, at least to some) but it also brings a whole new array of problems; problems that cannot be understood by those outside of a highly specific age range. There may be some communication between generations. We can learn from both those who have gone before us and those younger than us, but this learning is more at the intellectual than emotional level. Thirty-five-year-old Jesse (Josh Radnor) is introduced to classical music by 19-year-old Zibby (Elizabeth Olsen) but their perspectives on life challenge their chances to unite in a more personal way.<br><br>The film, in some ways, is like the Canterbury Tales (which is mentioned in the movie), only instead of traveling to a city while relating different tales, the characters are traveling through life with different perspectives. We have youthful optimism and idealism, age with its cynicism and bitterness, and middle-age with its realism. There are also perspectives from mysticism and despair. This is more of a psychological movie than an action movie. Although I never lost interest in the story, I am well-aware that this is not what most younger moviegoers are looking for and it is they who will be disappointed in this film. So be it. When today's hottest action films are replaced by those which have better special effects, films like Liberal Arts will endure because they will stand on their own merits, outside of time.<br><br>I found the acting good and the screenplay excellent. The interaction between the characters was believable. I cannot imagine anyone other than the writer, Josh Radnor, playing the main role. He plays the part of a man trapped by middle-aged angst to perfection. However, this is not simply a dry intellectual drama. There is a good deal of humor, some great lines, but it is humor that is witty more than physical.<br><br>As a classical music fan myself, I liked seeing Jesse discover this genre. I also liked the scene where Jesse tries to bridge the generation gap mathematically, but I can't say more about that here. In short, this is an enjoyable movie, but those looking for goofball comedies or bloody fight scenes should go onto something else. Don't worry. This film will still be around for you to discover when you are ready for it.","user":"SteveMierzejewski","rank":[73,84]},{"title":"Great movie for college students and grads","rating":8,"date":"7 June 2012","review":"*This review was previously submitted as an assignment in my film class, which is the reason for its formality and structure.* <br><br>\"Liberal Arts,\" written and directed by Josh Radnor, deals with the often-crushing reality of post-college life and the pedestal on which the seemingly idyllic college years are placed. Though the film often runs the risk of becoming an intellectually preachy vanity piece, its genuinely smart writing and relentlessly likable cast elevates it to an honest, enjoyable study of college and its aftermath.<br><br>Radnor stars as 35-year-old Jesse, a college recruiter with an unmarketable English/history degree who is nostalgic for his own days at a picturesque Ohio university. When an old professor (Richard Jenkins) invites him back to campus for his retirement dinner, Jesse finds himself drawn to smart, peppy student Zibby (Elizabeth Olsen), despite his discomfort at the age difference between them. While exploring their latent relationship at his alma mater, Jesse encounters his most influential former professor (Allison Janney), a clinically depressed student (John Magaro), and some realizations about his own aims in life.<br><br>Given the subject matter and setting, it's expected that the characters will pride themselves on their intellect and sophistication, and this gives way to some contrived, artsy dialogue, such as a letter montage (never easy to pull off) between Jesse and Zibby in which they wax poetic about classical music, which sounds smart in writing but comes off as unconvincing and pretentious when spoken, accompanied heavy-handedly by poignant New York scenery. However, the witty, laugh-out-loud dialogue usually keeps the film and characters from feeling like they take themselves too seriously, making determinedly highbrow scenes like this clash uncomfortably with the generally self-aware tone.<br><br>Radnor writes his character into enough glamorous situations (all the significant female characters sleep with him or try to at some point) and makes him sound over-educated enough that the film could have easily felt like a shameless vanity piece, but he plays Jesse so affably that there's not much room to mind. It's quite believable that his character would attract even young girls, with his naturally youthful looks and self-deprecating charm. Olsen does well with an even more challenging character; Zibby comes dangerously close to the \"manic pixie dream girl\" archetype of indies, but Olsen plays her with a sweet innocence that never feels fake and, when called on for dramatic moments, she is every bit a real college girl – wounded, vulnerable, and ultimately clueless about where she's going in life. Zac Efron flits in and out as a wisdom-dispensing stoner who may or may not be a figment of Jesse's imagination, offering some of the best laughs in the film.<br><br>Arguably the best performances, though, are given by Jenkins and Magaro. Jenkins plays the professor every student wants; like the film itself, he doesn't take himself too seriously but is utterly devoted to the school. He delivers some of the best acting in the film when he pleads for his job back mere days after retiring. Magaro is strangely touching as a college student perhaps closer to the norm than the Zibbies of the world: miserable in school, there solely to please his family, and constantly on the brink of a mental breakdown. In his limited screen time, he creates an oddly heart-winning character despite his sullen demeanor.<br><br>\"Liberal Arts\" is an enjoyable, cleverly written film that should strike a note with college students current and former. The witty writing and earnest cast make its few pretentious missteps easy to brush off affectionately.","user":"Chocolate_Swan","rank":[66,81]},{"title":"That's how he should have met your Mother.","rating":8,"date":"9 April 2013","review":"First of all, I have to say, Josh plays himself. At least it is the same Josh that is in \"How I met your Mother\" and his other great effort Happythankyoumoreplease. Normally that would be a criticism,but he is so likable and so watchable you don't care. Sort of like James Stewart. Also, I guessed that he wrote it himself as the dialogue and the emotions (or lack of) were very realistic. The only thing that wasn't believable about Elizabeth was her age as they probably should have made her character a little older. Otherwise, she was outstanding and her personality was seductive giving credibility to his infatuation with her. Richard Jenkins was great as usual and Zac offered some oddball humor. I loved the movie and all the characters which is a nice change with some of the depressing movies out there.<br><br>Oh, and watch the deleted scenes. I'm not going to argue for their inclusion but they are enjoyable.","user":"quitwhileyouareahead","rank":[30,36]}]