[{"title":"Awful awful awful awful","rating":1,"date":"20 April 2015","review":"This is bad. Very, very bad. The story plays out as if written by children, with endlessly long and pointless scenes filled with wandering dialog and incredibly wooden acting. There is no atmosphere whatsoever, and no sense of plot, suspense, story arc, or any of the other most basic elements required of a film script. Yet as bad as the acting and story are, the lighting, camera work, direction, set design, and basically every other aspect of the production are worse. The lighting in particular is just awful. Every scene is difficult to look at.<br><br>The reviews giving 8, 9, 10 stars are all written by people related to the film. Dead giveaway: every one of the fake reviews recites a list of credits. No real review would carefully note the names of some of the worst actors who will never grace the silver screen again.<br><br>I challenge you to make it to the end of the film. I don't think it can be done. Truly terrible.","user":"TeeBoned","rank":[12,15]},{"title":"A story that never gets off the ground","rating":2,"date":"21 November 2017","review":"THE IDEAL is a terrible little indie shot in and around a high school. The story follows a couple of students as they are tasked with doing some special work for one of their teachers, but mystery soon arises at the school. This is the type of film that flirts with the fantasy and horror genres but never gives them a full-blooded exploration. Instead it's talky and endlessly dull, with the usual stilted acting and filler. If you want to see some genuinely spooky high school films, check out the excellent South Korean WHISPERING CORRIDORS series.","user":"Leofwine_draca","rank":[2,2]},{"title":"Do not operate heavy machinery while watching this film","rating":1,"date":"28 April 2015","review":"It can cause drowsiness and lapses in consciousness. If you struggle with insomnia, watch The Ideal and be prepared for some serious snoozing. Rarely does a film create such a deep and unbroken monotonous boredom leading downward to an unavoidable state of comatose catatonia. It seemed as though even the actors themselves were drifting into intractable stupors from having to act in this hypnotic bit of sedative celluloid. I gave it one star as a film. I would give it 10 stars as one of the most effective sleeping aids I've ever encountered. Not to mention that Alex looked more like a 30 year-old CPA than he did a believable high school student. And how in the world was the actor who portrayed his father billed as? Loser farting father? Man alive!","user":"tim-arnold777","rank":[3,5]}]