[{"title":"Very entertaining","rating":8,"date":"13 May 2015","review":"This is not a documentary so don't expect it to be accurate or even the slightest bit true. It is based very loosely around Princess Elizabeth and Margaret going out into the crowds at Buckingham Palace on the night peace was declared (VE Day)....that's where the similarity stops. Rupert Everett as the King is such a bad choice, but again, it's not meant to be taken seriously. I liked the character portrayed as Princess Margaret and also the Queen Mother... they are likable and funny. The whole story is quite well written and very funny in places...as long as you don't take it too seriously and try to work out fact from fiction. All in all I thought it was very entertaining.....","user":"cammic","rank":[52,58]},{"title":"An enjoyable film painstakingly and lovingly realised. Highly recommended.","rating":8,"date":"20 May 2015","review":"I'd been looking forward to A Royal Night Out's release since first seeing the trailer a few weeks ago. Now, after seeing the film, I'm happy to report that I wasn't disappointed. The action begins slowly, but once the royal sisters become enmeshed in London's VE night revelries I found myself being carried along by events in ways that were at times funny, at times exciting, at times emotionally moving - even at times with feelings of national pride - but always with interest and anticipation. One 'bonus' I hadn't expected was that the story would also feature elements of a very touching love story. This latter, for me, endowed the story with a certain 'fairy tale' quality. (But it is a film of fiction ... so, why not??) The three leads - Elisabeth, Margaret and Jack - are all excellent. Supporting actors and actresses of the cast provide additional variety and entertainment and play their parts with apparent enthusiasm. A lot of work obviously went into recreating the crowd, traffic and London scenes of 1945 and clothing styles seemed authentic to me. All in all a worthwhile undertaking painstakingly and lovingly realised. Go see this film. My bet is you'll be glad you did. Highly recommended. 8/10.","user":"geoffgee","rank":[32,40]},{"title":"A jolly jape....what fun","rating":8,"date":"16 May 2015","review":"16 May 2015 Film of Choice at The Plaza Dorchester Tonight - A Royal Night Out. On 8 May 1945 all of Britain was celebration Victory in Europe and behind the doors of Buckingham Palace two daughters were asking their parents if they might be allowed to join in. The two daughters were Princess Elizabeth, heir to the Throne and her sister Princess Margaret. This store is rumoured to be based partly on fact and I would very much like to have heard it was all true. With Rupert Everett starring as King George and Emily Watson playing his wife Queen Elizabeth this film is a rather jolly jape depicting what could have happened if the two princesses had been allowed out on the town for the whole night. Everett and Watson were uncanny as the King and Queen, and the girls bore more than a little resemblance to the Princesses ....although costume, deportment and hairstyle helped enormously. The plot was a little like I imagine that day to be, uproariously out of control but most joyful. My favourite line in the whole film was when Lilibet was asking Jack the airman to assist her to make the most of 'an opportunity to be ordinary on the most extraordinary day of her life'. I wonder if the Queen has seen this and if so, was she a little wistful.","user":"Figgy66-915-598470","rank":[29,37]}]