[{"title":"very engaging kids film with natural warmth and jeopardy","rating":8,"date":"15 October 2016","review":"Our young family watched Phantom Boy today at the London Film Festival and really enjoyed the experience. The film has been dubbed into English and the dialogue runs smoothly - doing most of the story-telling in a nuanced, personable and fluid way. <br><br>It unfolds as a, perhaps slightly old fashioned, detective story. Leo's ability to travel out of his body is a very useful device to access remote places and to eavesdrop on others actions to help the story along. This also acts an intermediary or buffer to the film's action, helping to flag up wrong-doing, violence and other risks in a mediated manner, which works well for young viewers. <br><br>There are hints of the seriousness of Leo's Illness via the private worries of his parents, some physical violence and threatening use of guns but the emotional challenge is not overwhelming and the narrative pace carries you through. <br><br>Both our kids said they would want to see the film again and it will probably become a DVD favourite at home, for some time to come. The animated style is more hand-drawn in appearance and not as glossy or heavily automated as major studio animated films can be. This give a certain lightness of touch and warmth to what would otherwise be rather gritty, noir-ish city backdrops. <br><br>My only criticism would be the speed with which the story was established and characters introduced. A few minutes more focusing on Leo's arrival at hospital and the discovery and use of his special powers would have pleased me.","user":"stuartwhyte300","rank":[8,9]},{"title":"after Une Vie De Chat, another inventing cartoon by Felicioli and Gagnol.","rating":8,"date":"18 October 2015","review":"Phantom Boy is a real cool title for this cartoon directed by the duet Jean-Loup Felicioli and Alain Gagnol, who directed the happily surprising Une Vie De Chat in which we could recognize references and fast action from American classic movies (Night Of The Hunter and others).<br><br>In Phantom Boy, we recognize references to french popular cinema, from Fantomas to Le Passe-Muraille. And this story of a sick kid is over- charged with emotion, he is fighting against illness by fighting against a dangerous future and totally insane master of the world, and we unfortunately do have some very sad examples in the world.<br><br>So thank you to the directors for their very courageous Phantom Boy, the young kids who saw this movie learned a lot about Life and they just can't wait for their next movie. These kids recognized some scenes and characters from Une Vie De Chat, they are real young movie lovers.<br><br>Last remark : Phantom Boy is another great french inventive movie with no review on IMDb. So sad.","user":"happytrigger-64-390517","rank":[12,15]},{"title":"The supernatural 'eye in the sky'.","rating":7,"date":"4 January 2017","review":"From the directors of 'A Cat in Paris', but this film set in New York City that narrates the story of a boy with an extraordinary power. If you had liked that film, you probably would like it as well, but a little lesser. Except this is not about the art of theft, but a cop trying to catch a most dangerous criminal. It is so weird to see the New York turned into kind of a province of France as everybody in this speak French, but expected it as it's a French film.<br><br>A very interesting storyline. The characters were well designed and developed. But most of the film was focused on the boy, the cop and the main villain with a dog's perspective. There's a little part of a reporter as well. So I think it should have been called 'A Dog in New York', but the dog is on the wrong side where the most of the story was narrated from. The theme was not fresh, but the way they used to tell the tale makes all the difference. I mean you can compare it to 'If I Stay' kind of plenty of other films. Except it turned into a crime-thriller.<br><br>A young boy named Leo, who is hospitalised for the serious illness, has a special power to leave his body and take an invisible form, and come back again safely within some time frame. On the other side an honest cop trying to hunt down a criminal who is threatening the peace of the city gets a backlash after met with an accident. Now the cop and the boy join the hands to thwart the villain's latest attempt to bring disruption. The mission was not planned well, so how they fight the crime and its result brings to an end to the film.<br><br>\"I'm not hungry. It's a shame because my dad's pasta is the best in the world.\"<br><br>This is a PG film, that means it's aimed for all the ages. But particularly for the grown ups, there's nothing much to enjoy other than cool presentation. That does not mean for all the grown ups. The sketches and the animation technics were same as the previous film. They tried to reach bigger audience worldwide from the success of their previous film, but seems not achieved that goal. As the film had many great features like the characters and the story, they have fallen short to surpass as an overall film. Even anytime I would pick 'A Cat in Paris' over this, but that does not make this one's a bad film.<br><br>It kind of looks like the supernatural version of 'Eye in the Sky'. I'm not talking about the actual film, but the concept of drones to watch over the criminal activity. In here the boy acts as the main communication device. He who one day wants to be a cop, helps to solve the crime. I think the end should have been a little better. Especially from the boy's perspective about how his tale ends were very intentional. Perhaps a bit of emotions at the end would have given a better result.<br><br>I advertise the 2D animations too much on my blog whenever I review them, because they are rapidly fading away art. So my big thanks to those production houses and the filmmakers who still believe in it. If you are an animation film fan, you will enjoy it, no matter you loved it or not at the end. In a simple way to say, it is a fine film for the families with kids aged ten or under. It might look like a typical detective film, but entertaining with a few good moments. So check it out if you get a chance to access it.<br><br>7/10","user":"Reno-Rangan","rank":[2,2]}]