[{"title":"Worth Watching Just So You Can Say You Saw the Worst Child Actor in History","rating":3,"date":"3 June 2013","review":"After Earth (2013) <br><br>* (out of 4)<br><br>M. Night Shyamalan's big-budget vanity project for father and son team Will and Jaden Smith turns out to be much worse than the trailer. In the film, the father and son crash land on the planet Earth a thousand years after the people were forced to leave it. With daddy's legs broke, the young kid must go out into the scary landscape to retrieve an item that will allow them to make contact with their own world. AFTER EARTH is without question one of the worst sci-fi summer blockbusters ever made. Part of the blame can go towards the director but his handful of haters can't put everything on him. The incredibly bad screenplay also deserves a lot of the blame but so do the Smith boys. I seem to say this after each of his films but it's clear young Jaden has yet to take an acting class and just keeps getting passes because of his dad. I'm sorry but he's just not got a talented bone in his body and he certainly can't show any type of emotion, which is something the story here called for. The fact that he can't act to save his life really kills every emotion that the film goes for and it turns these scenes into something rather laughable. Mr. Will Smith doesn't come in any better. Although I liked his more quiet, laid back style, it just doesn't work considering the screenplay has him sitting around simply talking to the kid. Where Will deserves a lot of blame is getting his son these type of roles, which he can't do and which will eventually make him one of the most laughable actors in Hollywood history. The first couple films he did were just embarrassing but no one has given him the word that he can't act and apparently no one has seen fit to get him into classes so it's really just getting worse. Still, Shyamalan didn't improve the film any as there's really no drama, no suspense and no tension. It also doesn't help that the screenplay is full of cliché moments as well as being 100% predictable. I will say that some of the visuals were good but certainly not good enough to sit through this thing.","user":"Michael_Elliott","rank":[783,1]},{"title":"Believe the critics!","rating":6,"date":"6 June 2013","review":"This film is about a space craft that crash-landed on a dangerous planet called Earth, and the only two survivors have to struggle to stay alive.<br><br>The first few minutes of \"After Earth\" already look not so promising, and it only goes downhill from there. Acting is consistently bad by Jaden Smith, he is so annoying as a teenager who constantly freaks out. Will Smith is supposed to be a fearless commander, but his supposed bravery makes him so wooden as if he was a wax statue.<br><br>The plot is simply ridiculous. There are so many plot holes that are so obvious, that they simply should not happen. For example, if Will Smith is such a great commander, how could he not command people to wear seat belts when they were about to hit a meteor shower. And the masks are not even connected to anything!? The whole story, from the macro level to the micro level is very poorly written and makes no sense. The supposed emotional climax is so weak, that I wonder if that scene is really supposed to make me feel proud of what is shown on the screen.<br><br>\"After Earth\" is a terrible mess. This time, believe the critics.","user":"Gordon-11","rank":[393,545]},{"title":"Kitai Litter","rating":3,"date":"4 June 2013","review":"This film is not recommended.  Father doesn't always know best, the latest result being After Earth, a  vanity project that Will Smith has concocted for his son, Jaden. This  wobbly sci-fi tale of survival will certainly test both Mr. and Mr.  Smith's star power. Director M. Night Shyamalan, the man who  continually keeps falling from grace, one film after the next, is still  tumbling further from his talented beginnings, although here the  director crashes and burns.   This is not to say that After Earth is hopelessly clichéd, it's just  hopeless. Shymalan's well- made film has some striking imagery, mostly  of panoramic vistas, but his ill-conceived screenplay (co-written with  Gary Whitta) keeps this exercise in filmmaking rather earthbound.  Adding to that, his main star and one of the film's producers, Papa  Smith, pushes nepotism to its limits with this unoriginal dreck. (He is  also given story credit for this silliness.) It's not just that this  film has no Will power, it just has too much of it, both on screen and  off.  Will Smith plays the fearless Cypher Raige, a no-nonsense military  commando sent on a mission with his newt of a son, Kitai, played by  Jaden Smith. Cypher is disappointed with his son's lack of achievement  as a cadet and their relationship is a bit strained, just like the  acting. The Smiths obviously look the part and act the part with the  same stilted delivery. Like father, like son. Unfortunately (for us),  they crash land on the apocalyptic Planet Earth. Cypher is injured with  two broken legs, but pain is not an option. However a better script  would have helped matters. Kitai must now go into rescue mode, wearing  his amazing technicolor space suit, fighting beasts and creatures along  the way to becoming a man.   On his journey of self-awareness, Kitai contends with imminent peril:  giant baboons, poisonous leeches, carnivorous tigers, and such. He  needs to deal with the fluctuating below-freezing temperatures and an  active volcano too. Life is hard. Kitai even battles a monster called  the Ursa, a predator that hunts by sensing fear. (If the creature could  instead sense the smorgasbord of bad acting on its plate, the Ursa  would never go hungry again.) The elder Smith underacts and speaks in  annoying solemn platitudes while the younger Smith overacts in a  squeaky nasal voice that only a teenager can tolerate.   The art direction is mind-numbing. The futuristic sets are bargain  basement knockoffs of Disney World's Tomorrowland, circa 1960...very  unimaginative with an overabundance of Rubbermaid-influenced interiors  and enough flowing linen sheets to make one think that Bed, Bath, and  Beyond had given the filmmakers a cut-rate deal for some product  endorsements. All of the special effects are barely adequate and not  the least bit compelling. After Earth has a strange lethargic  listlessness throughout its short length. The film never builds any  real tension or suspense. It's just so dull and unrelenting in its  stupidity.  After Earth is the type of film that gives the sci-fi genre a bad name.  Shyamalan and the Smiths might want to use other aliases after creating  this debacle. Let's hope they refine their own survival skills when  making another film. After Earth is strictly Ursa Minor.   So dear moviegoers, heed the film's tag-line: \"Danger is real, Fear is  a choice\". You have been sufficiently warned about the real dangers in  viewing After Earth...Fear not, it's still in your control. GRADE: C-","user":"jadepietro","rank":[420,595]}]