[{"title":"As dark as it gets","rating":7,"date":"22 March 2017","review":"I have read a few reviews regarding this movie and all of them have said it's dark, violent and not for the faint of heart. Those definitions are fine, however I still do not think this is enough to describe the tone of the movie. I would describe it as ruthless and depressing. This does not mean I didn't enjoy it, as you can tell by my rating, however the point of a review is to warn a potential viewer of what they are getting themselves into and this movie is as dark as I have seen. It is unlike any western that I have ever seen as it is not traditional. It's so unique that I would have given this a bit of a higher rating if it wasn't so hard to watch. I do not want to ruin any of the plot as it made the movie more interesting for me just based on what I had seen in the trailers. I can see why it was set in the western time period due to the realism of the material. A movie like this set in our times would have been impossible to make, and if they did it would not have been executed as well as this. The acting was quite impressive. It truly feels like each actor really threw themselves in their roles, which is incredible for some as there are some twisted characters in this film. Which brings me to Guy Pearce who played the role of 'The Reverend'. He plays such an awful man that I have no idea how he would have been able to shake this off after filming was completed. I cannot remember the last time I hated a character as much as a despised him. Dakota Fanning was also amazing in her role. She was convincing from start to finish with many different emotions throughout the movie. She also needed to use facial expressions more than dialogue in the movie, which cannot not be an easy task to complete, but she nailed it! When I had first seen the length of the movie I was concerned it would have major passing issues, it did not. The story grabs you from the beginning to the end, I couldn't stop watching. I had no idea how it would end and could not wait to find out. The most impressive part is it really did not have a lot of action, just characters that grabbed your attention whether good or bad. It was well written. So if you are not of the faint of heart and can handle a very dark, ruthless, depressing story that is still entertaining from start to finish see this movie, you won't regret it.","user":"dpbertrand-126-427929","rank":[178,216]},{"title":"Very dark movie","rating":8,"date":"25 December 2018","review":"Outstanding performance of all actors.\nDifficult, authentic scenes of very high quality.\nMovie has very dark story for strong stomach.\nI almost wasn't able to see it whole.\nI need a beer, before bed.","user":"peterkarapk","rank":[19,21]},{"title":"A super powerful film that depresses deeply","rating":11,"date":"11 April 2017","review":"This film tells the story of a woman who cannot speak many years ago in a small town in the United States of America. She endures the many horrors that life has put her through, and it all started because of a priest.<br><br>The long runtime put me off watching it for​ a few weeks, but I finally got myself to watch it. I can honestly say that every minute of the film is worth watching, and every minute of the film affected me right to the core. I won't spoil any of the plot, so all I'll say is that. I cannot imagine so much misfortunes can be bestowed upon a person, yet the presentation of this horrid story is so very believable. It feels like I'm watching someone's life up close, and what happens to her makes me sick right to the core, right from the start to the end. The events portrayed are truly horrifying, and I'm still paralysed by Shock and disbelief minutes after watching it. Acting is great by Dakota Fanning and Guy Pearce, they make their characters shine. I cannot imagine a monster as sick as this character in the film. I am still having headache and palpitations from the evil character. I honestly can't remember when was the last time I felt so sick because of a film.<br><br>Watch this film if you have the chance, but watch it alone and when you feel strong enough for a very depressing emotional challenge.","user":"Gordon-11","rank":[80,107]}]