[{"title":"Enjoyable Stylized carnage","rating":7,"date":"3 December 2012","review":"A film based on a thin story with lots of funny violence and it gets it right. Just the right amount of character development, not to overbearing/tear filled/long like say Expendables. Just enough to care a little about the characters. Does not take itself seriously at all or try and tackle any issues like race or religion. Good quirky interesting characters on both sides. Just enough plot, character development and side story's to keep you interested but not make you feel like you wish they would just get on with it. On the down side nothing really original here either but whats their is well put together.<br><br>This is no masterpiece or anything subtle but it's a very enjoyable way to kill an hour and half.","user":"franciscraven","rank":[58,71]},{"title":"If you're a film nut you have to see it!","rating":9,"date":"4 April 2013","review":"'THE BAYTOWN OUTLAWS': Four and a Half Stars (Out of Five)<br><br>This is one of those movies that really caught me by surprise. I had heard a little about it upon it's limited release (in theaters) but it of course wasn't playing anywhere around me and the synopsis (and lack of hype) didn't peak my curiosity in the film. It's about three vigilante redneck brothers 'for hire' who agree to help a woman get her godson back from her asshole ex. They find an assortment of crazy mercenaries after them when they rescue the boy and try to bring him back to his godmother. It stars three mostly unknown actors in the leads (Clayne Crawford, Travis Fimmel and Daniel Cudmore) and was directed and co-written (with Griffin Hood) by an actor turned director making his feature film directorial debut (Barry Battles). The film also features some bigger stars in supporting roles like Billy Bob Thornton, Eva Langoria, Andre Braugher, Zoe Bell and Michael Rapaport but it was made on a budget of just $4 million and not given much publicity or attention at all. I loved it and think it's sure to be a cult favorite for many years to come. If you're a film nut you have to see it. <br><br>The film is set in Alabama where brothers Brick (Crawford), McQueen (Fimmel) and Lincoln Oodie (Cudmore, who you might recognize as Colossus from the 'X-MEN' movies) work for the local Sheriff (Braugher) murdering criminals, vigilante style, in order to help keep the crime rate there the lowest in the state. After botching one job and not getting paid they find a woman at their door, named Celeste (Langoria), offering the boys $25,000 to rescue her godson Rob (Thomas Brodie-Sangster) from her asshole crime boss ex, Carlos (Thornton). The brothers take the job and retrieve the kid but fail to kill Carlos as Celeste instructed them to. They then find all kinds of assassins 'for hire' after them as they try to get Rob safely home to Celeste. They oddly bond with the boy at the same time. <br><br>The movie really struck me as effective in the way it introduces it's three lead characters as disgusting villains and then instead makes you care for them, more and more, throughout the film. Their relationship with the boy was really well done and all four lead actors are really good in the film. If this movie had better backing it could easily make Crawford, Fimmel and Cudmore stars but with their charisma and talent I'm sure they can find other work to help them do that. The rest of the cast is all exceptional as well and Barry Battles really makes a name for himself with this film. For a debut effort it really is an exceptional production all around and I can't wait to see what he does next. It's got a lot of heart, it's funny, tons of excessively violent action, lots of sex appeal (including a gang of hot female biker assassins) and is just a really fun time at the movies! A lot of people will label it a cliché driven Tarantino-esque B action film but it's much more well done and creative than that gives it credit for.<br><br>Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=IHU1MR5VpzY","user":"Hellmant","rank":[26,30]},{"title":"Excellent action packed movie","rating":10,"date":"27 February 2013","review":"I loved this movie. It is an escapist movie you can watch and just relax while watching it. It is definitely worth the watch if you want a good action movie. It has plenty of gratuitous violence. Thumbs up from me. The lead actor did a wonderful job. Billy Bob Thorton is always good. Check it out. You will not be disappointed. No real brain power needed. For an action movie this is a plus. I am not a movie buff, but I do enjoy a good mentally relaxing movie and this one fits the bill. The acting is good and the action is definitely not true to life, but what action movie is. If you enjoy Quentin Tarentino movies then you will like this film. I would say it is a cross between a Kill Bill and Deliverence, but with out the hard core southern stereotyping. No \"squel like a pig\" or racist behavior. Just some classic shoot em up action.","user":"contactwilliamjones","rank":[31,37]}]