[{"title":"Red","rating":6,"date":"21 February 2020","review":"Not as funny as the first, but still quite entertaining. The formula should however not be repeated too often.","user":"MR_Heraclius","rank":[39,40]},{"title":"Entertaining","rating":6,"date":"4 April 2014","review":"Red 2, like the original Red, is not meant to be taken seriously. In many of my other reviews I come down hard for ridiculous plot lines and lack of believability, but this flick was never intended to be taken seriously on any level. It is a comical take on action/spy movies and so it matters not what liberties are taken.<br><br>If you enjoy Bruce Willis being Bruce Willis, you like non-stop action and you are in the mood for some mindless entertainment, it is worth a watch. No thinking required.<br><br>Personally, I enjoyed the original Red and I like watching the \"old codgers\" play it up on the action scene. Yes, Helen Mirren is certainly getting old, but she still exudes sex appeal (which has little to do with age or looks) and she is amazingly credible as an action hero. I'd love to see her star in some serious action/spy films.<br><br>Malkovich is his usual self and plays a small uninspired role. The surprise for me was Anthony Hopkins. He didn't have too much to do here, but more than I thought. He could have fluffed his way through a film like this, but he took the role as seriously as any other and his performance enhanced the film.<br><br>The humor in this one is not side splitting but it works. They could have hit us over the head with tired, old-timer gags but they were smart and didn't really go that route in this sequel. Overall, I have seen far, far worse in this genre.<br><br>Just remember this is an over-the-top kind of movie. It's not even close to a typical action comedy. This one has more unbelievable fights, gunfire, chases and general absurdities than five garden variety action flicks combined. I usually don't like super-action movies with nothing but explosions and bullets every two seconds, but in this film the action works and the light comedy keeps pace with it.<br><br>Watch Red 2 when you want to shut down your brain for a little while and relax with some good old American, explosive, violent, unapologetic, save-the-world, comedic entertainment.","user":"vipcorp-954-708527","rank":[35,39]},{"title":"Enjoyable action flick taking the good from the first","rating":7,"date":"28 September 2015","review":"My quick rating - 7,1/10. The over the hill spies are at it again. The first movie was thoroughly enjoyable and I have to say this sequel is on par with the first. Quality action scenes edited together very well to keep the motion going without getting lost. Actors put in enough character to drive the spy-game storyline through enough to make you care about it and not just sit back and watch guns blaze. Anthony Hopkins character was exceptionally well done and was a needed jolt into the flick for sure. It is a rare occasion that you can say the sequel may have been better then the first but.....<br><br>Well, I will have to let you decide that one. All and all a well made picture.","user":"jackmeat","rank":[12,12]}]