[{"title":"Divergent is a tedious experience","rating":5,"date":"17 April 2014","review":"SPOILER: The main problem from Divergent is that its premise is too far-fetched, improbable and illogical. If the story had been ingenious enough to justify so many conditions and unearthly circumstances, there wouldn't have been any problem. But no... this is simply another juvenile tale about the typical main character who must overcome her insecurity when she finds out she's \"special\", and her actions escalate until she practically saves the world... without forgetting, of course, the \"unexpected\" romance in the road to her destiny. Well, I'm speculating about saving the world. Divergent is based on a series of \"young adult\" novels I haven't read (and I will never do so), and the producers obviously expect to shoot sequels, so this first film establishes the (absurd) post-apocalyptic world, the bland characters and the obligatory conspiracy in which NOTHING IS LIKE IT SEEMS (translation: everything is exactly like it seems, from the predictable villain to the gallant who starts being a hateful lout, until he softens himself and shows his romantic side). In other words, a simpleton and innocuous teenage fantasy made for female spectators; and another attempt to create the saga which will inherit the crown from The Hunger Games... something which isn't precisely bad. Divergent was made for a very specific audience, and I sincerely hope that the female fans of the novels are left satisfied by this film. For the rest, the production values are pretty high, the special effects are competent and the cast is composed in a big part by attractive multi-cultural young people who seem taken from a catalogue of Urban Outfitters (what a luck for the post- apocalyptic world). I don't know how the casual spectators can take Divergent; in my personal experience, it bored me very much (specially during the \"exciting\" conclusion full of action), but I'm very far from belonging to this film's objective audience. Each one will know his/her posture and tolerance to this kind of film; I personally regret having wasted my time and my money on it.","user":"Argemaluco","rank":[258,366]},{"title":"How Did Veronica Roth Approve this Movie?","rating":22,"date":"22 March 2014","review":"I have read all three books written by Veronica Roth. I came in with expectations of character profiles and I reviewed the characters on IMDb. I understand that all book-to-movie adaptations make it difficult to fit in all the elements and are not perfect. It's impossible to portray the book word for word. Despite knowing all of this, I came in with a low expectation.<br><br>As I suspected, the tall and beautiful Shailene Woodley is definitely not the small and weak Tris we imagine while reading the book. A lot of the character profiles were 'off.' However, Shailene gave an excellent portrayal of how she developed from a shy dependent girl to a confident fearless warrior.<br><br>The opening to the movie indicates we are in 'Chicago,' and that we are separated into the five factions because of the war. There is no explanation of why the war happened, where and who with. Just that we have the huge fence to keep each other safe and we don't know what's out there.<br><br>Elements were definitely rushed and lacked intensity. The characters that were not featured in this movie are revolutionary figures in the second, making it impossible to have a movie without them. Key characters were left out or barely mentioned. Drew, Edward, Molly &amp; Susan don't exist in the movie. There's no relationship at all with Susan and Caleb, as they left her out. Peter's entourage is completely removed. Edward has a couple brief mentions in the movie including the capture the flag game and on the leader board. Otherwise, the entire eye stabbing scene doesn't exit. We don't see Peter for who he really is. The intensity of taunting Tris and making it difficult for her at Dauntless headquarters is glossed over. We see Peter make a name for himself when he beats Tris in the fight. Molly has barely two lines in the movie. One of the lines Molly has complimented Tris. In the book she's part of Peter's entourage and they hate each other. I find that Peter is too soft in the movie and he isn't enough of a jerk. In the book he's way more nasty.<br><br>Elements of the Dauntless training were not victorious as they're supposed to be. There was no focus on how vital Dauntless training is and that they do it well. There was no desperation to survive the training like there was in the book. You saw the rankings change, but the intensity in the fights and the will to survive was never built up.<br><br>Members of the family have the choice to visit on visiting day. This scene was replaced with Tris' mother sneaking into the Dauntless compound to be updated about her progress in the Dauntless training. She warns her about doing too well and asks her to remain in the middle of the pack. It's not revealed that the mom isn't going to visit Caleb, nor does she ask Tris to visit Caleb and ask him to find out what's in the serum. Instead, Tris on a whim visits Caleb. <br><br>The movie was way too focused on the romance of Tris and Four. Four softens up to Tris way too easily. He's supposed to be edgy and guarded. Details about Four were supposed to be revealed in his fear landscape. Four seems unfazed by his fear landscape. This scene is so critical in the book, it's the first time we are supposed to see how vulnerable Four really is. Four never tells Tris to call him Tobias. In Tris' fear landscape, she sacrifices herself for her family. In the movie, she faces her family and the gun is aimed at them.<br><br>I can't even talk about the ending. It was completely changed. I might have appreciated the ending if I hadn't read the books. There were elements of the ending I quite enjoyed, but it's still very rushed. I understand that they needed to end the movie with no cliffhanger, but my sister who had not read the books still had questions about the ending. <br><br>Overall, I rate the movie as a C+. Other discrepancies include Tris taking credit with Christina after the win in the Capture the Flag scene, Will dying at the same scene as the mother (rather than in the Dauntless compound), Tris not showing her displeasure with Four and yelling at him, as well as Peter not begging for his life to be included with Tris, her dad, Caleb and Marcus. As well the initiate who jumps from the train and falls to her death, Al's crush on Tris, Four getting drunk, and overall many scenes that never showed the struggle of being that character. Near the end when the dad, Caleb, Marcus &amp; Tris have to catch the train to the Dauntless compound, there's no struggle from any of the characters jumping on or off the train. Dad and the others jump like they have done it a million times and Caleb never complains. When they jump into the netting below, Tris asks each of them, 'you good?' 'you good?' There was a lot of odd phrases that Tris never used.<br><br>There were quite a few memorable scenes including the aptitude test, the fear landscapes, the simulations, the tense moments Tris and Four had that were very true to the book including the capture the flag scene, as well as the zip lining experience. ﻿","user":"K_92","rank":[109,159]},{"title":"Most predictable movie ever- I cannot believe Andreea Negoita liked it.","rating":2,"date":"7 April 2014","review":"As I said, the movie was extremely predictable. I knew what was going to happen before it did and I honestly felt like I was watching it for the 3rd time! There were no twists, no suspense, no surprises. I could not believe that there would be so many clichés and unrealistic scenes. Instead of an \"action/adventure film\" I saw a boring love story. I can't imagine how unbearable it must have been for those who read the book..<br><br>*SPOILER* The following scenes are examples of why the plot was so obvious and boring: <br><br>We knew that Tris would not go into the same faction as her family, we knew which one she'd choose, we knew that she'd fall in love with Four, we knew that she wouldn't get kicked out of training, we knew that Four would find out that she was a Divergent but wouldn't tell anybody etc... Moreover, the scene where Tris and Four fight is so unrealistic and again, the fact that he started fighting on her side was way too PREDICTABLE. <br><br>*END OF SPOILER*<br><br>To me, Divergent looked like a bad version of the Hunger Games and I am really surprised that so many people liked it. Unless you are a teenage girl who finds Theo James hot and unless you have never read any books or watched any other movies in your life, I see no reason why you would want to waste 2 and a half hours of your life watching Divergent.","user":"aker995","rank":[241,366]}]