[{"title":"Hilariously bad with every southern stereotype in the cracker barrel","rating":1,"date":"21 August 2011","review":"This southern Gothic wannabe was adapted from an original novel, but it's hopelessly derivative. I haven't read the book, but boy did I watch the movie. It's so filled with clichés and stereotypes, at times it played like a \"Airplane\" style comedy. It takes place in a town called Innocence. How ironic! I especially enjoyed hearing the actors slip in and out of their bogus, Honey Chile southern accents. There are also several prized clichés- talk about runnin' barefoot, eatin' craw fish, chasin' fireflies, huntin' possum, guttin' trout, and of course, deep dark family secrets. All that was missing was a trailer park with a tire hanging from a rope tied to a tree. The story involves a world-famous violinist from Innocence who returns back home to her late grandmammy's place after experiencing romantic disappointment. She soon catches the eye of the town's hunky womanizer, a rich guy named Tucker, who looks more like an Abercrombie &amp; Fitch model than the scion of wealthy southern gentry. Well, shuck my corn! Of course, she and Tucker fall in love. Problem is, the friendly neighborhood serial killer is offing various white trash ladies who were romantically linked to Tucker. So, is our fair maiden next? Will he kiss her or try to kill her? It's up to us to figure it out while we get to meet a wide array of southern stock characters amid hot sunny days and steamy humid nights. I have to admit, I enjoyed all the badness. If you keep your sense of humor high and your expectations low, you may enjoy it too.","user":"highwaytourist","rank":[21,26]},{"title":"Carnal Innocence- Where's Ann-Margret's Knowledge? ***","rating":7,"date":"15 June 2011","review":"Interesting, intriguing film dealing with a series of murders in a small Mississippi town. The town seems to be nicely integrated and with the exception of a black man being beaten up in one scene, all people seem to live in harmony. In fact, the head of the police is a black gentleman.<br><br>Shirley Jones, as Della, has a small role here. At the very end, she has a strong,emotional scene once the killer has been revealed. Ironically, one of the victims of the murderer is a woman who resembled Shirley so much in her Oscar winning role as Lulu Baines in 1960's \"Elmer Gantry.\"<br><br>Our leading man, Colin Egglesfield, ought to change his name. He will be the object of every joke regarding eggs should his career evolve.<br><br>This story has everything going for it. You play a real guessing game in determining who the murderer is and I guarantee that you will not come up with the answer. <br><br>We've got lust, cheating on spouses, revenge, and so much more.","user":"edwagreen","rank":[17,22]},{"title":"A Good Nora Robert's Adaptation!","rating":13,"date":"13 September 2011","review":"Up front, I enjoyed this movie. According to my wife, the Nora Roberts expert in our family, the writers and producers did a pretty good job of following the book's story. The actors were attractive and competent, even though Colin Egglesfield's attempt to look like Tom Cruise was rather vain. Gabrielle Anwar was her lovely and seductive self, and it was great seeing Shirley Jones on the screen again. However, there were some glaring irregularities with the production we couldn't help but notice. Granted, when adapting a novel for television, the writers and producers are under pressure to clean them up and make them politically acceptable for family viewing, especially for Lifetime and Hallmark audiences. But sometimes these efforts border on the absurd. For example, take the character of Sheriff Burke, the elected sheriff of the small Mississippi town where the story takes place. In the novel, Nora's facts are believable. The sheriff is a typical good old white boy who is married to an attractive and socially prominent white woman. But in this production, the sheriff is a black man who is married to an attractive and socially prominent white woman. I don't think the times have changed that much - certainly not in rural Mississippi. Next, have you ever looked at a scene and wondered what's wrong with this picture? There is a July 4th celebration in the story, complete with whooping and hollering and good old country music. But as you look at this scene in this production, you can't help but notice what's missing – confederate flags. Excuse me, in Mississippi those good old boys are going to wave flags, both American and most surely confederate. Finally, there's the matter of the Mississippi heat. This story takes place in the summertime in Mississippi, which is hot, humid and all around sticky. Yet the sheriff and FBI dude walk around outside in the heat with a clean shirt and tie, buttoned at the top yet, and not a spot of wetness showing through their shirts. There is also a scene where the hero and heroine are lounging romantically in front of a roaring fireplace. A roaring fireplace in Mississippi in the summertime is not romantic, it's insane! But even with these nick-picky faults, the movie was good and we recommend it highly.","user":"jimmullinaux","rank":[17,23]}]