[{"title":"The End(?)","rating":5,"date":"22 November 2013","review":"As Adam Green says, this is the last part of his own vision. It was always meant to be a trilogy (though obviously you never know if you can actually make 3 movies, depending on how successful your franchise is). But of course, who knows what the studio might decide to do with the franchise? There might be a couple of Hatchets coming our way (recently Saw 8 has been announced to be in development ... they always come back, sooner or later).<br><br>Concerning this recent output, it is what you'd expect it to be. It wasn't directed by Adam Green, but he was still very much hands on (writing and contributing in general for the production of the movie). Unfortunately it doesn't reach the fun factor of the first one. It does reach the gore factor of the previous ones, in case that is what you're looking for solely.<br><br>There will be a few surprise appearances (if no one spoiled them for you) and you might chuckle here and there (Adam Greens wife is in it too and he's not being gentle with her ... in the movie that is). A recurring actor appears in this, this time with a better excuse than in part two (one of the better jokes of the script). A fun little watch, nothing more, nothing less","user":"kosmasp","rank":[9,9]},{"title":"Pretty entertaining","rating":6,"date":"15 June 2013","review":"Hatchet III is better than Hatchet II which took itself way too seriously. Hatchet I had a great first half and an equally underwhelming second half. Part III actually is funnier than Part I but the gore scenes run out of creativity towards the end. Still, the first half hour features a great mix of gags and gore including a glorious cameo from Adam Green himself.<br><br>The cast is a smörgåsbord of actors from horror movies which we watched before and loved. Zach Gilligan is hilarious as a sheriff who is given absolutely no respect. Derek Mears kicks ass and I was chuffed to see Old Jason vs New Jason. Caroline Williams could probably be termed as a supporting protagonist considering the impact she has on the story although her lion's share of screen time is spent in service of a subplot which could be considered as padding. Then there is Danielle Harris who manages to kick ass in a glorified cameo. Kane Hodder is a total beast who owns pretty much everything in his way. Sid Haig has an unnecessary cameo but is pretty funny. There are other funny cameos which I won't spoil.<br><br>Overall, this is a watchable movie. It's still not great but it's entertaining and a decent way to spend 1.5 hours.","user":"jackthehack","rank":[8,9]},{"title":"Everyone has already seen this movie in all of its previous incarnations","rating":2,"date":"7 July 2014","review":"They had the money to shoot the film well, like they got a real cinematographer who understood lighting and framing. They had the money for quality post-production work like with editing and cleaning up the footage, it doesn't look cheap, well it doesn't look sh*tty cheap. The effects are also not terrible, so they had money for that and some one who knew what they were doing. I guess the movie's only obvious problem is the story. All that money and all of the resources gathered to assemble this movie and the film makers forgot the most important part, STORY. Folks, do not ever go cheap on story, throw all your money and efforts at the story, hey and here's a novel idea, make that story be original, y'know, unique, the pay-out is always worth it.","user":"jessegehrig","rank":[3,3]}]