[{"title":"Makes you think!","rating":8,"date":"23 September 2013","review":"This is a movie in which you debate with yourself, where would you draw the line in search of justice against greedy corporations, if that corporations inflicted on you the kind of damage they did on the characters of this movie. Knowing that it was inspired by actual actions that some corporations have taken, just makes us think even harder on whats going on in our world. The acting is very good, everyone plays their character very well. You just have to feel sympathy for all of the character especially \"Doc\". I recommend anyone who wants to see a movie which gives you something important to think about to watch this. Very well done. 8 out of 10!","user":"beyonder-3","rank":[49,55]},{"title":"\"The East\" is simply just a solid, taut and investing thriller that values telling the story of its characters, while keeping the political stance to the side.","rating":8,"date":"26 July 2013","review":"I generally get tired of films pushing politics throughout their story with all this left-wing, right-wing crap, that because of the focus of the group of people who make that type of film, so becomes an entanglement of an unnecessary debate with audiences and critics, that the film itself becomes lost. The East tells its message straight and clear and understands that most will agree with a majority of its ideas, but never loses sight of the story and the characters its wants to portray.<br><br>The East follows an operative for a PI firm who is handpicked to infiltrate an extreme anarchist group who focus their sights on major corporations for the crimes they have committed on humanity. I agree that that basic synopsis probably will make a few shy away from seeing it, but I don't believe anyone will come out of the film in a heated debate with the next person on its political issues, however timely. It has a great perspective instead on what we as individuals value most. It never allows itself to succumb to any political wash-over, but instead takes a side for the characters and where they stand as people that manages to invest us in the emotional elements rather than just straight ideals.<br><br>Brit Marling plays the operative at hand and also co-wrote the screenplay with up-and-comer, Zal Batmanglij. They both worked together and the equally excellent Sound of My Voice last year and its apparent that they have continued to build their ground in their respective fields, each finding a voice to be heard away from the mainstream flow.<br><br>The East is simply just a solid, taut and investing thriller that values telling the story of its characters, while keeping the political stance to the side and also having fun tangling the audience up its in web.","user":"swp_1988","rank":[87,110]},{"title":"Stunning and unpretentious","rating":8,"date":"22 June 2013","review":"The East is the kind of movie that makes you want to join the fight, raise your voice and be heard.<br><br>The good. Extremely immersive. A incredible story with lots of emotions, conflicts, opposing moralities, and a stupefying journey. It is gripping and you will not be left unmoved.<br><br>The actors. Brit Marling and Ellen Page both give us a great performance. I was disappointed by Alexander Skarsgård, I thought that he was the weak player of the cast. The rest of the cell was pretty solid: Toby Kebbell, Shiloh Fernandez, Aldis Hodge, and Danielle Macdonald. And I should mention the nice work done by Patricia Clarkson as the director of the private security firm.<br><br>The bad. The ending is rushed. It feels like there was missing material at the end of filming and they couldn't go back to get what they needed and had to edit it with what they had.<br><br>The ugly. Nothing.<br><br>The result. A must see for anyone.","user":"AvidClimber","rank":[83,108]}]