[{"title":"Best dialog I have experienced in years","rating":10,"date":"27 December 2013","review":"I believe it is a travesty that this film has such a low score on here. The only thing I can attribute it to is that today's viewers have an attention span of a raccoon trapped in a treasure chest. I suppose the fact that I am a very big fan of this type of film--and what I mean by that is chock full intelligent dialog--may also have something to do with that. There are two other films that have always been in my top 10 favorite films list because of this attribute and they are 12 Angry Men, and The Man From Earth (not to be confused with the man who fell to earth.) Basically a few people trapped in a room for most of the movie discussing a monumental mathematical proof that has huge implications for just about everything and everyone on the planet, and the moral responsibility they have as they are in cahoots with the government through funding. If you have an attention span, love existential and philosophical discussions, or just enjoy movies that make you think then you will love this film as I did. Please help this film get the rating it deserves.","user":"karmabandrocks","rank":[27,36]},{"title":"very interesting and realistic topic well articulated (if you understand what it's talking about)","rating":7,"date":"14 September 2013","review":"This film is about a four theoretical computer scientists who have just proved the conjecture P=NP in the context of a classified research project funded by NSA, DHS and the like. Such a discovery (which incidentally and just to pacify you is not believed possible) would have an enormous impact on our current digital world, in particular would make cryptography breakable and -therefore- terminally undermine the very foundations of any form of security and privacy on the Internet. The entire spectrum of consequences is hard to predict and, surely, in \"capable\" hands such knowledge would be quite a powerful weapon. This is rendered well in the film, as is the ensuing conscience struggle for the scientist: to comply with the government's demand of absolute silence, or make the result public at the risk of being branded as traitors? <br><br>When (s)he says that this film attempts to present a certain \"travelling salesman problem\" as if everything else depended on it, I suggest user \"qqwe qweetr\" does not understand what (s)he is talking about. Indeed the situation depicted by the film is plausible, even possible (though extremely unlikely), the screenplay and the dialogues are competent, and the whole package is intriguing if you understand the context. Given that, the film is not a particular good piece of cinema, sounds a lot like a theatrical piece, and surely most details (and therefore of the plot) will go over the head of the typical viewer. However, for a film made with $10,000 this is quite an achievement. Chapeau!","user":"vdmsss","rank":[19,25]},{"title":"Technically accurate, dialog is a bit too vague","rating":8,"date":"23 September 2013","review":"As a graduate student in the field of theoretical computer science, I feel that I understand P vs NP as well as the makers of this film could hope for any viewer to understand them. I felt the treatment was more technically accurate than almost any movie I have seen about a mathematical topic, but it still fell short on a few key moments.<br><br>Warning, the following contains spoilers.<br><br>First, I was confused when they mentioned PSPACE in a few parts of the film. It made it sound like not only had they proved P = NP, but the main character had proved P = PSPACE, and was using this as his back door algorithm. I don't think this was the intent of the movie, but in any case it was a bit confusing. <br><br>A second scene puts the main character in his office with a student and his colleague, and he mentions that he has an algorithm that goes on proving theorems and proving more theorems. It is a well known consequence of P = NP that finding mathematical proofs become trivial, for there is an obvious algorithm to check a purported proof in polynomial time. The world's most renowned mathematicians would have known this as well, and it doesn't make sense that it would occur as some kind of \"revelation\" to the main character and remain a secret he could use as leverage.<br><br>Finally, I felt that some of the phrases used to describe general things (like the field of research, which is theoretical computer science or TCS) made the dialog a bit awkward. <br><br>That being said, the movie had absolutely palpable dramatic tension. The lines were witty and sharp, the acting was very believable (and the characters actually had distinct personalities). Their power struggles were very exciting to watch. The color was also very well balanced. None of the Hollywood teal and orange crap that has become so standard and ugly.<br><br>In all, I enjoyed the movie and the fact that it gave serious consideration to the most important problem in my field (and treated it fairly). My main criticism is that the plot should have more direct clarity. It's nice to leave a lot up to implication. But mathematicians are rarely indirect, and the best lines of the movie were the pointed, thought provoking comment.","user":"kun-jeremy","rank":[12,15]}]