[{"title":"A film about dealing with loss, childhood and motherhood","rating":7,"date":"24 January 2013","review":"Writer/Director Francesca Gregorini brings a unique and entertaining voice to her new film Emanuel and the Truth about Fishes. This is a darkly comic yet dramatic film about a young misfit girl who befriends her new next-door neighbor who is a single mother with a newborn.<br><br>This film is about, among other things, dealing with loss, motherhood and relationships with mothers. Not being able to be a mother but wanting to, not having a mother and wanting one. It may not sound exciting, or it may sound like a set-up for a romantic comedy of sorts, but this film has elements of horror, mystery, surrealism and gets quite intense at times. The film while it is dramatic and has many moments of the above is surprisingly comedic which helps balance the darker aspects of the film. Few films can pull off the level of comedy and heart- breaking reality that this film employs.<br><br>I knew fairly early on that I was going to like this film, the way it played perfectly with the audience's emotion and the striking production design. It is amazing how fresh and different this film feels, there is always an undercurrent that something is wrong which latches you to everything on screen.<br><br>I was emotionally invested in our main protagonist Emanuel (played by Kaya Scodelario) and in-turn with the single mother Linda (played by Jessica Biel). Between this and Wuthering Heights, I think Kaya Scodelario is an actress to keep an eye on. I've never been a Jessica Biel fan, until now, she is perfect in her role as 'the perfect mother'. The family dynamic too feels authentic with great supporting roles by Alfred Molina and Frances O'Conner.<br><br>The only thing that doesn't quite work in this film is the ending; it ends a bit abruptly and offers some emotional satisfaction but in terms of 'reality' feels like more should have happened to find a resolution for the characters. Maybe that's the point though, in difficult situations like these there is no neat bow to tie and make everyone feel perfect and the dissonance at the end is a manifestation of that. Other reactions may be more mixed but thematically and emotionally it was engaging and I appreciated it a great deal.","user":"Trentflix","rank":[56,71]},{"title":"beautiful and simple but intelligent film.","rating":8,"date":"18 February 2014","review":"On reading the reviews for this film, I was expecting a slow paced and emotionally confusing story, but having watched this film I feel it has gone hideously unappreciated. The beginning is a little slow, and it's hard to connect to the characters initially, but the bond created between the teenager and woman is both unique and thought provoking.<br><br>This film has lovely dynamics, and deals with the issues of loss and emotional wellbeing in a very poetic and intricate manner that cannot go unappreciated. <br><br>I addition to these points,the music is also very well suited. <br><br>All in all, this story is very quiet, poetic and special, and if you are someone who appreciates the relationship one can build with a film, then definitely waste no more time and watch this.","user":"donnie-baybie","rank":[16,19]},{"title":"Sensitive and Touching Story of Loss and Friendship","rating":7,"date":"13 August 2014","review":"The bitter and introspective seventeen year-old Emanuel (Kaya Scodelario) is a troubled girl that lost her mother giving birth to her and she feels guilty for her loss. She lives with her father Dennis (Alfred Molina) and her estranged stepmother Janice (Frances O'Connor) in a house in the suburb. Emanuel has not gone to college and works in a drugstore with her colleague Arthur (Jimmi Simpson). She uses to flirt with the teenager Claude (Aneurin Barnard) in the train she uses to go to her job.<br><br>When her next door neighbor Linda (Jessica Biel) offers Emanuel to be the babysitter of her newborn Chloe, Emanuel accepts the job offer but she does not see the baby that is sleeping. But Emanuel and Linda feel connected to each other and Emanuel visits Linda in her leisure time to help her with Chloe. When Emanuel finally sees Chloe, she realizes that her new friend is living a great illusion but she keeps her secret. When Linda dates Arthur, the touching truth about her is disclosed. <br><br>\"The Truth About Emanuel\" is a beautiful movie with a sensitive and touching story of loss and friendship. Emanuel and Linda are troubled women bonded by their losses. The beginning of the story is ambiguous and the viewer is never sure whether what Emanuel is seeing is her insane perception or reality until the moment that her stepmother visits Linda. I believe the water is a metaphor with the amniotic fluid that connects Emanuel and Linda and rebirth, but I did not understand the meaning of fishes. The performances are great and despite the bad reviews, the viewer may like it like I did. My vote is seven.<br><br>Title (Brazil): \"A Grande Ilusão\" (\"The Great Illusion\")","user":"claudio_carvalho","rank":[18,22]}]