[{"title":"We loved this film","rating":9,"date":"15 March 2013","review":"We really enjoyed this charming feel good film. The characters, songs and performances combine to take you on a whirlwind journey that doesn't fail to deliver. Laura and Ronan are refreshingly natural and there is real chemistry between them. Magda is an absolute hoot and the film just looks and feels great.The music is especially enjoyable and it's great to see a musical with fabulous original songs rather than relying on a collection of cliché sixties hits or old number ones. This films feels original from the ground up and that's one of the reasons we liked it so much! As well as the leads there is a great supporting cast cameos that are truly delightful.","user":"phil-633-815050","rank":[20,24]},{"title":"Small doesn't mean it can't still be beautiful","rating":8,"date":"15 November 2013","review":"I loved this film. I don't generally do musicals, but I do tend to like anything that is different from a lot of the mainstream bilge pumped out by Hollywood. I'm a big fan of Australian cinema precisely because it produces quirky, charming films like this. I agree it's unlikely to ever win any Oscars, but that is possibly part of its appeal. The \"stars\" are not A-list but who cares. Like champagne, the film is light and frothy and lacking in substance but, if you accept it for what it is, it's still thoroughly enjoyable. I saw this film on an international airline, so hopefully its gradually picking up a worldwide fan base and rightly so. Be proud Australia - your films are much better than you give them credit for!","user":"fishingguru","rank":[6,6]},{"title":"Laura Michelle Kelly is really a GODDESS and she should keep up with the acting and singing!","rating":7,"date":"26 August 2013","review":"A musical comedy about the history of Elspeth Dickens, who loves to sing and would like to be able to achieve fame thanks to her vocal capabilities. The problem is that she is stuck on a farm with her ​​twins. The installation of a web cam on her computer and the Internet allow you to embark on her journey to stardom, but there will be a pretty high price to pay.<br><br>Goddess is an original totally new musical very fun to watch and entertaining. It deserves a better rating than just a 5. The musics are OK but what it is extremely important about this title is the stand out of Laura Michelle Kelly which perform fantastically. It definitely IS a must watch for those who love musical genre. Definitely not a let down but it equals several other musicals plus all with its own style (australian \"british\" humor). Againg Laura M. Kelly was just great with her performance and she totally should be seen more often on screen moreover if she sings on it. 7 out of 10","user":"e-pappalettera","rank":[6,6]}]