[{"title":"Better than I expected.","rating":7,"date":"23 February 2020","review":"Redemption isn't quite as interesting as it wants to be and is somewhat unfocused, but thanks to a surprisingly ambitious screenplay and one of Jason Statham's better performances, it works as a perfectly watchable thriller.","user":"MR_Heraclius","rank":[37,38]},{"title":"More than an action movie","rating":10,"date":"10 May 2013","review":"It's been quite a long time, perhaps for the first, that I was engrossed with Jason Statham's movie, not due to the sheer number of cracked skulls, but with his character and the ones around him. Hummingbird is another entity compared to his usual martial arts filled carnage, although his trademark of hurting people certainly didn't disappear. Jason Statham as Joey Jones, takes on a deeper and more emotional role, which with the help of director Stephen Knight, surprisingly works well.<br><br>Agata Buzek as Cristina, a love interest role which couldn't be any farther than Jennifer Lopez's in Parker, is an altruistic nun who cares for Joey in his darker times. She is not the typical cinema beauty, yet she is humbly charming. Her acting is impeccable, often giving eerily sympathetic moments that could silence the audience. Statham benefits from her presence as well as he gives more to acting than the majority of his movies. That doesn't mean he will be getting awards soon, but it is a good direction on his part.<br><br>Cinematography utilizes London cityscape in a very rustic fashion, it's the opposite from the well-advertised side of the city. Streets and alleyways seem more in touch with reality, nothing grandiose about them, while prettier settings ooze some illusion of eminent cosmetic. With sleek scene transition between them, the movie appears to be very grounded. Story and script are great, despite having a few coincidental twists. It's somewhat a stark contradiction from the grimy visual, a bits of fantasy to escape the harsh prospect. Smart ways to evoke more mature theme is appreciated and it makes Hummingbird more subtly artistic.<br><br>Statham's character is a vigilante, a crowd-pleasing broken man whose past never lets him go. He does this part to his best, enough to at least differentiate him from his other tough guy role. However, people who purchase ticket to see Statham delivers knockout punches or staggering kick might be slightly disappointed. The action is brutal and punishing, but there's considerably fewer scenes from what might be expected from his type of movie, although these few are choreographed and done well in a more street brawl kind of way. Having a genuine martial artist couldn't hurt either.<br><br>The movie takes some time to get its rhythm, and while it's commendable for Statham to try this new change, he's still rough in acting department. That being said, Hummingbird is clearly superior than most of his movies. It doesn't rely simply on muscle, but it takes the audience to a more private look into these likable characters. I feel that the role of Joey Jones could be played by Jeremy Renner or Tom Cruise. If Jason Statham can continue in roles like this, he'd be bigger than just the guys who beats people up.<br><br>Rate 7.5/10","user":"quincytheodore","rank":[160,186]},{"title":"Don't mind the wining folks: this is a good movie","rating":8,"date":"28 June 2013","review":"I never write reviews, but this time I was compelled to...<br><br>Don't bother reading the negative reviews from people moaning about how they miss Jason Statham being chased in a car or beating the crap out of everyone. If you want that and that only, then just go watch Transporter I, II and III.<br><br>If you want to see something different and refreshing, then simply don't miss this one. The story is good, there is plenty of action, and developed characters.<br><br>With a closed mind, expecting to see yet another copy of Jason's previous work, you'll be disappointed. But with an open mind, you will enjoy watching this very much.<br><br>This change of plan is simply the best thing Jason has done yet. He's convincing and manages to create quite some depth in his character. AND he still kicks ass. I can't see another actor having pulled this mixture of action, drama and psychology off better then Jason. He actually played a convincing 'human being' that has to take a hit like everyone, and he did it very well.<br><br>Amongst the better action/drama flicks of 2013.<br><br>8/10","user":"regg147777777","rank":[178,209]}]