[{"title":"This should have been released in theaters","rating":10,"date":"6 August 2011","review":"I absolutely love this movie. Phineas and Ferb always reminded me of the Saturday morning cartoons of childhood past. The regular episodes are somewhat silly and hilarious, but this movie is a true summer blockbuster. It's full of well-done action sequences mixed with doses of good humor. The songs are great, ranging from hard rock to disco, compared to some of the ones in regular episodes, which seem forced at times. Plus, the plot isn't too complicated but not your average children's made-for-TV movie plot line. The pacing is a bit fast though, and comedic timing is lost through hurried lines and lack of pauses. The animation, although much better than normal TV episodes, is a bit sloppy at times, is at times sloppy. If you're a long-time or even a short-time fan of this series, the movie will make you laugh at references to previous episodes. In short, I absolutely love this movie. If it was released in theaters, with crisper animation and better comedic timing, it might be one of the best things Disney has released this decade.","user":"ItsACaptainDan","rank":[19,22]},{"title":"Phineas and Ferb Strike Again","rating":10,"date":"6 August 2011","review":"Going into it, I figured this movie would be pretty decent, seeing as it's Phineas and Ferb. But alas, I was wrong. It was GREAT. 'Across the 2nd Dimension' stayed extremely true to the show. It has the same fun, wild, free spirit and takes you for one heck of a ride. You get to experience an entirely new dimension of the Phineas and Ferb world, one where Doofenshmirtz isn't so doofy. At first it seems cool, but the gang later realizes how grateful they are for their own dimension-and their platypus.<br><br>Spoil anything I will not, so give this one a watch. Trust me, you won't regret it. It will have been well worth your time.<br><br>A must see for die-hard fans and casual fans alike. A solid 10/10.","user":"catarinaloss","rank":[12,14]},{"title":"Phineas and Ferb have done it again!","rating":10,"date":"10 August 2011","review":"Step-brothers Phineas and Ferb have had a lot of great adventures over the course of their summer (ex. Traveling through time (twice) Building a Roller Coaster and going around the world in a single day) but this one seems to take the cake. There's a good helping of action, and enough jokes to keep viewers young and old laughing. I was very impressed by this Disney Channel production, because, not only was it so much better than any of the other original movies but it was even better than a lot of the actual episodes of it's own TV series. Which is saying a lot because the TV series is groundbreaking entertainment with phenomenal writing and animation. I never thought I'd say this but: Bravo Disney Channel!","user":"Spritedude23","rank":[11,13]}]