[{"title":"More accomplished and satisfying than one might expect.","rating":8,"date":"11 March 2014","review":"YOU'RE NEXT is, unabashedly, yet another \"nuclear family and/or rich yuppies besieged by masked psycho killers at vacation home\" slasher, right down to the obligatory \"last girl\" element. But while the movie's schema is completely typical, its execution—smart script, decent cast, solid direction by Adam Wingard—is exemplary.<br><br>The major detail YOU'RE NEXT gets right is to provide actual motivation for both the villains' kill spree and for the heroine's ability to survive the abattoir (other than being yet another innocent virgin with gumption). This alone is enough to place the film at the pinnacle of its sub-genre. Moreover, director Wingard and screenwriter Simon Bennett demonstrate a talent for side-stepping annoying clichés. The assembled victims numbers ten instead of the usual half-dozen, with not one idiot teen in the lot; the squealing, screaming, helpless characters are winnowed out with audience-considerate dispatch so the more fit and bright can make the best of their situation. Meanwhile, refreshingly, the murderers are NOT portrayed as unstoppable killing machines until the final ten minutes: one even gets short of breath and needs a time- out! <br><br>The pacing and shock effects are crisp; the moments of black comedy are sparingly, intelligently planted. <br><br>All told, far more accomplished and satisfying than a genre fan has any right to expect.","user":"m-a-elsewhere","rank":[99,128]},{"title":"Bloody and bloody good fun.","rating":8,"date":"13 February 2014","review":"You're Next is directed by Adam Wingard and written by Simon Barrett. It stars Sharni Vinson, Nicholas Tucci, Wendy Glenn, A.J. Bowen and Joe Swanberg. Music is by Mads Heldtberg and cinematography by Andrew Palermo.<br><br>The Davison family and partners meet up for a family reunion at a remote holiday home and quickly find that their inner issues are the least of their worries.<br><br>The splinter of horror that encompasses home invasion, that most terrifying of subject matters, has had enough filmic entries to actually fill a house! So when another one comes along with good hype and a promise of reinvigorating the formula, it's cause for horror film fans to start salivating.<br><br>You're Next doesn't reinvent anything, but it consistently and confidently keeps the formula well oiled and proves to be one of the better films of its type. The set up is standard, a big old country house in the woods, a whole bunch of likable and dislikable people, and of course some outside assailants about to unleash hell on everyone in the house. Refreshingly this is not a roll call of pretty teenagers being stalked and slashed, this is an assorted bunch, young and old, all shapes and sizes, and the family bickering that precedes the carnage is a smart move, because once family members start getting killed there's a genuine sense of grief and regret coursing through those yet to be sliced and diced.<br><br>It's nice to find that Wingard has great respect for his target audience, he's made a film for fans of the sub-genre and inserted a darkly comic streak that pays off royally. It's often very nudge nudge and wink winkery, but always in the right places. The director also proves to have a devilish eye for a murder scene, with some of the killings here high grade in blood, physicality and originality. Elsewhere the makers give us a great heroine, a truly resourceful gal that fights back with a ferocity that's both sexy and frightening, and while the revelation of why these events are happening is hardly original – or that the back story given for our heroine's skills is just silly – Wingard plonks it all together with such bloody verve it hardly matters.<br><br>Some less than good acting from a couple of the cast, and the overuse of shaky-cam stops it from going through the roof out into the genius stratosphere, but this is a cracker of a home invasion horror and well worth a night in with the lights off and the volume tuned up loud. 8/10","user":"hitchcockthelegend","rank":[57,89]},{"title":"Innovative and gore-filled gem","rating":9,"date":"8 July 2013","review":"\"You're Next\" is a home invasion/survival film in the vein of \"Funny Games\", \"The Strangers\" or again \"The Last House on the Left\". As in the latter cited, you'll find here the usual bunch of people being assaulted by strangers in a remote house. In that \"You're Next\" brings no novelty, bu does a great job at delivering the great tension and suspense associated with this specific genre of horror. Where the film truly excels, is that it adds some really clever elements of crime and comedy to the genre, making it really unique. The film does a fantastic job at giving you true/false hints about who could be involved in the invasion; and you really spend an hour wondering if it's true and who could it be, just like in these great Italian giallo. Second, the film, which starts on a serious tone, gradually and subtly incorporates comedy elements in it. Towards the end it is hilarious, but never overrated or absurd, keeping the film on the horror track at all time. There is also great deal of gore in the film, and gore-hounds will find their lot of brutal kills. The main actress, and the character she plays, also needs to be mentioned for she is, at the image of the movie, a real bad-ass! You're Next is both true to the genre and innovative. The balance between horror, crime and comedy is perfect. A great surprise and amongst the best 2013's film so far.","user":"raoulpeltier","rank":[138,245]}]