[{"title":"A lot of wasted potential","rating":3,"date":"9 March 2013","review":"I started watching this film really hoping that it would be everything that it claims it is: a stylish revenge tale to rival The Godfather itself. In actual fact, this is not a revenge tale and gets no-where near to The Godfather. A film essentially based around the rise and fall of a Brazilian pimp, it seems to me like it's confused about it's own nature and motivations as well as those of the characters; I was never sure if it was intended as a glorification or a condemnation of the Brazilian sex industry lifestyle. Also, characters seem to disappear without explanation and core aspects of the plot seem to be forgotten within a matter of minutes. There is a lot of potential in the characters and plot of this film, but due to poor scripting and the short runtime (100 minutes is not enough time for a crime epic) and Boca is almost unfinished in this sense, the film is a mess and exploration into motivation, generally turning the pace down a notch and stretching the runtime could have made this a film worth watching. Unfortunately, there are too many basic flaws to make this a decent film in my opinion.","user":"tankymctankus","rank":[5,5]},{"title":"A Good Crime Story","rating":17,"date":"17 March 2012","review":"The Storyline that is listed just about Explains the Story. About a man from a Sao Paulo neighborhood, notorious for it's Bars, Nightclubs, and Local crime figures.<br><br>Story starts in early 50's and continues to the mid 60's; Hiroito, the man in this story is shown growing up, and how he eventually gets involved in a Life of Crime.<br><br>From what I read after I watched this film, Hiroito did some time in Prison, and went on to write a Book about his life. That Book is what the Movie is based on.<br><br>I can't believe No one has bothered to Review this so far. The Movie, to me, was a good 'crime story'; he was known locally, and made quite a name for himself (criminally speaking).<br><br>I kind of hope that Hirohito will eventually Post here, and give his impression IF the Film was true to his book.<br><br>Since I knew absolutely nothing about the MOVIE, except the Storyline, I nevertheless took a chance and spent an hour or so and watched.<br><br>Not sure if the Actors in this film are known or unknown, but they were all convincing to me, as far as portraying their Characters.<br><br>Hate to give anything away (SPOILER)- but I wonder what Hiroito was thinking, when he saw the kid he Rescued, playing with other kids??","user":"suzishuz75","rank":[7,11]},{"title":"A decent 'real crime' story from Brazil","rating":7,"date":"12 November 2019","review":"This film tells the story of the rise and fall of Hiroito de Morales Joanides as, during the late fifties and early sixties, he gets involved in Sao Paulo's criminal underworld. His activities are centred on the once notorious Boca do Lixo area where he is involved in prostitution and drugs. He is quick to shoot those who cross him. Inevitably it is only a matter of time before the police, a rival criminal or his growing drug habit end his reign as the 'King of Boca'.<br><br>It is rare that I feel a film needs to be longer but in this case I think it could have done with more time. The story is interesting but often feels rushed; we move from one key incident to the next without learning enough about the general background... of course it is possible that many of things I would like to have been told would be known by the average Brazilian viewer who is presumably the main target audience. The film has a good look, the tint gives it a feel of the era and the cast does a fine job making it easy to believe in the characters; most notable of these is Daniel de Oliveira as Hiroito. As I had no idea how the story concluded the tension rose nicely towards the end. Overall I'd say this was a decent film that fans of the genre looking for a different setting might want to check out.","user":"Tweekums","rank":[0,0]}]