[{"title":"Benedict Cumberbatch only plays villains","rating":6,"date":"8 November 2013","review":"As I walked into the theater with my wife, she asked me again what this film was about. I said, its about Wikileaks. I told her about Assange and the mission of Wikileaks. I had already had my own formed opinions about Assange, but refrained from sharing it with her. I was curious to see what her reaction was and what her opinion of Wikileaks and Assange was after the film.<br><br>The film was not bad. It was sort of an attempt to make a Facebook style film about Wikileaks and although it nowhere measured up to the quality of \"Social Network.\" Its attempt was commendable and all-in-all, it was not a waste of the 18 Euros we spent to see it.<br><br>However, what really bothered me throughout the entire film was Cumberbatch's portrayal of Assange. I could see he was trying very hard to mimic Assange to the best of his ability, but I either don't think he had it in him or he was purposely playing Assange a lot crazier than he appears in real life. I have seen lots of interviews with Assange, who in my mind, comes across a bit like a mixture between a politician and professor. Cumberbatch, on the other hand, came across as a sort of eccentric nut.<br><br>The next thing that bothered me is where the film decided to stop. Basically, it skimmed over the current scandals, making Assange sound like more of nut than Cumberbatch's portrayal. The last five minutes especially sunk into me the feeling that the film unfairly portrayed Assange.<br><br>And my suspicions were confirmed. I asked my wife what her opinion of Assange was as a good or bad guy, and she seemed to indicate she was leaning towards bad. The last few minutes of the film, basically sunk that message in loud and clear.<br><br>My conclusion is, that, this film is a good example of the new way of being critical. Pretend to be fair and at the last minute, throw up a bunch of negative facts.<br><br>I believe that combining the positive portrayal of the U.S. state department with the crazy portrayal of Assange, was neither fair nor accurate. History will probably judge this film as just another propaganda piece of the corrupt powers that be.<br><br>If I were to write this film, I think it would have been much more interesting to concentrate on the incidents of human rights abuses rather than on the Assange himself. It would have also had the positive effect of encouraging, rather than discouraging whistle-blowers. This film does not seem to inspire anything.<br><br>Assange was right about the film.","user":"muthink","rank":[185,220]},{"title":"Should Be about the Truth","rating":5,"date":"9 August 2016","review":"\"The Fifth Estate\" is a film made by Dreamworks apparently with the intention of showing Julian Assange as an egocentric villain and seems to manipulate the truth about the role of the Weakleaks. On the contrary, his unfaithful and ambitious partner Daniel Domscheit-Berg a.k.a. Daniel Schmitt is depicted like a rational adviser and the hero, destroying the whistleblower information and data of the Weakleaks to protect the \"innocent spies and informers\". The film is based on a book written by Daniel Domscheit-Berg; therefore totally partial about the truth without showing the side of Julian Assange. I am not expert in this subject and I have just the common sense of reading and listening to the news about Julian Assange and the Wikileaks. But the film seems to be manipulative and depicting one side of the truth only. Therefore as a documentary, it is worthless; however a thriller, it is engaging and has good performances. My vote is five.<br><br>Title (Brazil): \"O Quinto Poder\" (\"O Quinto Poder\")","user":"claudio_carvalho","rank":[40,46]},{"title":"The Fifth Estate is only one side of the story","rating":1,"date":"19 September 2013","review":"THE FIFTH ESTATE is based on two books, both written by people who had personal and legal disputes with WikiLeaks.<br><br>These are personally biased sources and are now outdated by three years. They tell only one side of the story.<br><br>These authors had an interest in portraying Julian Assange as dishonest or manipulative for competitive, personal and legal reasons.<br><br>It is hard to imagine how a film which aims to dramatize only their version of events could genuinely aspire to being fair or accurate.<br><br>The film does not tell the story Julian Assange or WikiLeaks staff such as Sarah Harrison, Joseph Farrell or Kristinn Hrafnsson would tell. Hopefully, soon, their story too can be told.","user":"StoneOcean","rank":[411,559]}]