[{"title":"Should be titled Resident Evil: Boss Battles","rating":6,"date":"3 February 2013","review":"PREMISE: Alice. Kills stuff. PLOT: Alice. Kills stuff. <br><br>Viewers hoping for a coherent narrative are advised to try Capcom's Resident Evil cartoons; viewers completely new to the series really have no choice but to let the images simply break over them like tsunamis. Despite 2 or 3 pages of exposition, series writer/director Paul W. S. Anderson clearly assumes that anyone rejoining him at this point is so familiar with both the movies and the various R.E./BIOHAZARD VGs that new characters (Ada Wong; Leon Kennedy) can be ported over from the games, and old characters (Rain; Carlos) resurrected without explanation (Jill Valentine, Albert Wesker and Luther West are back; Claire and Chris Redfield make cameos). Happily, I AM that geekish, so enjoyed the merry-go-round. <br><br>The CGI FX, which are virtually non-stop, are more varied, energetic, and original than in previous sequels. No more mutant dead dogs, thank goodness, although Anderson remains overly-fond of his tentacles- bursting-out-of-the-mouth shots.<br><br>The movie is less a script than a series of levels, as Alice, Project Alice, Leon, Ada and their ad hoc teams are dragged through artificial environments adapted from previous installments, from games (notably the new Manhattan and Moscow sets), from any spin-off that isn't bolted to the ground, even from absolutely unconnected franchises (e.g. DAWN OF THE DEAD). Each setting—all controlled by The Red Queen--has its own horde of character clones infected with different strains of the T-Virus and/or Plaga Parasite and its own boss monster adapted from one or another of the games. <br><br>If...and only if...that paragraph made the least bit of sense, then this movie's recommended.","user":"m-a-elsewhere","rank":[25,28]},{"title":"The extreme worst of all Resident Evil series","rating":1,"date":"13 September 2012","review":"I love Resident Evil series. Despite the mediocre reviews it gets in the past, I still go to the cinema on its release and always looking forward for the next sequel. <br><br>But RE5 fails beyond believe. The storyline is utterly crap. The action are cheesy, the actors are cheesy, the whole movie is a joke to the RE series. I am completely disappointed at how the whole movie turns out to be.<br><br>*spoiler alert* The whole movie is set on one giant Umbrella underwater laboratory and Alice and friends is trying to break out of it. Along the way they encounter some zombies and finally got out. And that's literally about the summary of the whole story!<br><br>They try to use music to intensify everything.. but it becomes very cheesy. Especially towards the end before the final fight when Jill walks out of the submarine.<br><br>The Red Queen is total crap. Cheesy, stupid.. <br><br>The fighting scene itself is very cheesy and unrealistic. They hardly get hit by a bullet even when they were standing in open view. But it seems like their bullet always managed to hit the enemy. Even the one bullet that hit Alice, didn't even do her much harm. What a load of crap.<br><br>At the final fight, it was obvious some of them had had their bones cracked. But they were still standing and fighting as if their bone is not really a necessary part of their body. They look pretty healthy for someone with broken bone!<br><br>When Alice beats Jill.. it was so obvious from the beginning that that's what needs to be done. But the scriptwriter must've made Alice so dumb that she did not realize that from the beginning. Sadly, the viewers are not as dumb as the scriptwriter.<br><br>And on the final scene when Leon touches Ada's thigh.. THATS AS CHEESIEST AS IT COULD GET! I could almost cry looking at that scene. What the f... *sigh*<br><br>I apologize for using a lot of \"cheesy\" word in my review. But it is exactly how I feel when I see it. It's like a bunch of amateurs movie makers trying to make action movie.<br><br>All in all, I wouldn't even rate it 5 for effort. Its a total lazy movie writing. I still want to see RE6, but I seriously hope they do not FAIL as big as this one. <br><br>What a load of crap this movie is.","user":"jsoetandi","rank":[222,293]},{"title":"Here's what went wrong!","rating":1,"date":"26 December 2012","review":"This is what happened when the crew decided to make this movie. Paul S. Anderson met his crew and asked them:<br><br>\"OK people let's get some ideas about what this movie will have.\"<br><br>Staff#1 \"-hey, how about we make it like the new games and make it a shoot fest?\" <br><br>Paul S. Anderson- \"Sounds good, Done!\" <br><br>Staff#2 \"Wouldn't it be cool if the zombies could drive cars and motorcycles and carry weapons and chainsaws?\" <br><br>Paul S. Anderson- \"Sounds good to me, Done!\"<br><br>Staff#3- \"you remember when Claire and Alice fought that giant axe guy in the fourth film? How about this time we let Alice fight two of them?\" <br><br>Paul S. Anderson- \"Good idea, Done!\" <br><br>Staff #1-\"You know the fans want to see other characters so why not introduce a few more like Leon, Ada and Barry?\" <br><br>Paul S. Anderson- \"Sounds good, Done!\" <br><br>Staff#2-\"Aren't we going to have too many characters running around? How about we kill off one or two?\" <br><br>Staff#3-\"We'll kill off Barry. Anyway he's an expendable character in the game.\" <br><br>Staff #1-\" Yeah but make it a heroic death. Let's have him go out in a blaze of glory brandishing his famous magnum. Fans like that sort of thing\" <br><br>Paul S. Anderson- \"Sounds good, Done!\" <br><br>Staff#2-\" Hey I was watching Aliens the other day,wouldn't it be cool if Alice became a mother figure to some unknown little girl who gets kidnapped by a lichor and Alice has to save her like Ripley did?\"<br><br>Paul S. Anderson- \"Sounds good but we'll have to rework the lichors somehow. Done!\" <br><br>Staff#3- \"People liked the characters from the first film. It would be cool if we could bring them back somehow. It's a shame they got blown off with raccoon city.\" <br><br>Staff#2-\"Hey if they can clone Alice why not her friends?\" <br><br>Staff#3-\" You're so right man. But where did hey get the DNA?\" <br><br>Staff#2-\" Does it matter?\" <br><br>Staff#3-\" It's just another Umbrella mystery. What do you think Paul?\" <br><br>Paul S.Anderson- \"Sounds good, OK people let's make this movie.\"<br><br>In the bathroom next to the meeting hall you hear a toilet flush. The fourth staff person comes out.<br><br>Staff#4- \"Hey guys, sorry I'm late but I have a great idea for the story. If ties up all the loose ends. Umbrella finally falls. The cure for the plague is found and the world is saved. I also worked on a great script and intelligent dialogue. I even have a great idea for coaching some of the mediocre actors into believable ones.\"<br><br>Paul S. Anderson- \"What are you talking about? We just worked out some great ideas. Lots of action, explosions, new characters. We have everything the fans want. As for acting? Did you see the first game? The lame voice acting did not deter its fans. These actors will do plenty fine for the fans. C'mon let's make this movie!\"<br><br>And this is why this movie turned out the way it did.","user":"lorenzon","rank":[40,50]}]