[{"title":"Highly Underrated","rating":8,"date":"8 September 2014","review":"The Words opens with author Clay Hammond (Denis Quaid) giving a reading for his recent best-selling book, The Words. Hammond's reading takes us into the life of his character, Rory Jansen (Bradley Cooper), a young author struggling to publish his books make ends meet. <br><br>One night, Jansen discovers an old manuscript hidden in an antique briefcase that his wife Dora (Zoe Saldana) purchased for him on their honeymoon in Paris. He reads the yellowed first-draft of the novel, marveling at the unknown author's talent. <br><br>Jansen struggles with what he should do with the masterpiece he's found. Eventually, he decides to type the entire novel on his laptop so he can \"feel the words flow\" through his own fingers. <br><br>When his wife sees the novel on his computer, she—in typical Hollywood fashion—assumes he wrote it and praises him for his depth and creativity before he has a chance to tell her the truth. <br><br>From here, the film skips back and forth between the fictional Rory and Dora Jansen, and the story of their creator, Clay Hammond. <br><br>Rory publishes the manuscript under his own name and struggles with the repercussions, while in \"real life,\" Hammond flirts with a young college student named Daniella (Olivia Wilde) at his sophisticated book reading. Despite the film's fluctuating story lines, The Words' plot is addictively intriguing and surprisingly easy to follow. My family doesn't often sit down to watch a movie without a magazine or iPad in hand, but this movie kept us all riveted. <br><br>It's also worth noting that we had our eyes glued to the screen in the absence of explosions, sex scenes, or significant amounts of humor. The film's mysterious and captivating plot line—along with simple but genuine characters—were enough to hold our attention. <br><br>The story expands when the true author of Jansen's novel (Jeremy Irons, the \"Old Man\") approaches Jansen and reveals his heart-wrenching account of the loss of his manuscript and family. His tale transports us to Paris during World War II, adding another captivating plot line to the already multi-layered story. <br><br>In addition to an elevated storyline, the Old Man's account in the movie adds a deeper visual element to the film. A relatively low-budget, low-key film, The Words clearly made the most of its production site in Montreal, Canada. Shots of present-day New York and 1940s Paris are both believable and idealistic, effortlessly transporting viewers from modern day to war time. <br><br>As Bradley Cooper's character becomes a liar of extraordinary proportions, I still found myself rooting for him throughout the film. Jansen's shortcomings raise many stimulating questions about truth and integrity, while his struggle for achievement and creativity makes him highly relatable (especially as a writer). <br><br>While the movie held my interest the majority of the time, I felt much less invested in the real-life storyline of author Clay Hammond's and student Daniella. The only thing that kept me interested in the seedy, wealthy author and his adoring fan was the question of how they tied in to Rory Jansen's story. <br><br>And that is, perhaps, the great mystery of the film—why does Rory Jansen matter to Clay Hammond, and vice versa? <br><br>The pursuit of an answer to this question, along with stimulating questions of integrity and consequence are what make The Words a must-see movie for anyone who desires meaningful conversation at the end of a film. It makes us question our motives and beliefs, and it gives a sympathetic face to the \"struggling artist\" stigma. Considering I'd never heard of the movie until I rented it, I'd say it's highly underrated.","user":"chandlerneal","rank":[47,50]},{"title":"Surprisingly Amazing Emotional Story","rating":10,"date":"10 September 2012","review":"The Words draws you in with its beautiful cinematography and engaged dialog. I was especially impressed with the layers of the presentation. Most films these days will spoon feed you a flat story and leave no room for personal interpretation. The Words layers a complex open-ended plot that demands viewer involvement. I was surprised with the simple surface story presented as each deeper layer was uncovered. Sometimes it came as a subtle hint when other times it hits you straight in the face. The film has the flavor of Memento or Inception; which is refreshing these days. Bradley Cooper surpassed my expectations. I never once saw his type-cast Hangover/Limitless ticks or mannerisms. He was completely in touch with the character and never fell back on default techniques.","user":"mjblack13","rank":[147,180]},{"title":"A very good drama, that falls short at the end...","rating":8,"date":"10 February 2013","review":"Although I give this move 8/10, it still falls short at the end. One of my favorite movies of all time is \"The Man from Earth (2007)\" and I am so reminded of that film when watching this one.<br><br>There is a story, within the story, within the story. But what they miss, in my view, is to really plant that seed of doubt firmly in the mind of the audience. As the credits starts rolling up the screen, you feel that the movie ended way to soon. That you got cut off mid sentence. <br><br>All the intricate parts are there, the storytelling is really breathtaking but they still fall short. If they just put a little bit more effort into the \"real\" story, it would have made such a difference.<br><br>Hey, but still... A really good movie that I enjoyed so much, but noting more. Worth every buck-","user":"drmagoo-605-365654","rank":[18,19]}]