[{"title":"A movie that qualifies as strong meat a.k.a. be ready to digest a lot of reality and face the true face of a world unknown to people living in a happy bubble.","rating":10,"date":"16 March 2016","review":"This movie undid something inside of me. It's that part of you that holds on to hope that people can be good, that there is hope for humanity. I knew the basics of it when I went to watch it: that it is about investigative reporters looking into a story of abuse in the catholic church. And it uncovered so much more than just that. Honestly, this movie should be seen by anyone who seeks the true face of the world. We don't live in a pink bubble of happiness. F*cked up things happen to people all the time; worst thing is when it happens to the innocent. The little ones who can't protect themselves. When they are robbed of their faith and their hope and their future. Sitting in the film theatre on the last row, I was brought to tears as in front of me a long list of places where victims spoke out was scrolling. I was both shocked and mad. I felt sorry that people can fail so miserably. \"Mike Rezendes: They knew and they let it happen! It could've been you, it could've been me, it could've been any of us.\" Indeed. When we witness darkness and we shut up and we don't do anything about it, that's when we fail. A poet once wrote, \"You can join the millions talking in the dark. Or you can stand up and scream light, out into the night.\" So choose to stand up. In your profession choose to eradicate the oblivion of evil. This movie is a masterpiece. From the dedication of the actors to their roles, to the script, the director and the cinematography. The score? Fantastic. Howard Shore did it again!","user":"miriam-seraia","rank":[201,238]},{"title":"It Could've Been You","rating":10,"date":"25 March 2016","review":"I've rated almost a hundred movies and I've only ever given out six 10s on this website. I don't rave about many movies and I am tough to please when it comes to film, but this film is absolute brilliance. It is flawless. This one earns its 10 and it is one of the best films I have ever seen. <br><br>Everything about this film is brilliant. The camera work is great and the score is underrated. However, what makes this film is an absolutely genius screenplay that is acted to perfection. This script will rock your world. I am not Catholic. I didn't grow up in a deeply Catholic area, but this film still affected me greatly. Everyone should see this movie for that reason. That is something that you have to see for yourself. <br><br>However, I'd like to focus a little more on the technical aspects. Beyond the fact that the subject matter is heavy and extremely important to American and world culture, this movie does everything else right. The acting is absolutely phenomenal. This is particularly true for Ruffalo and McAdams. I adore the subtlety with which they both act. It is brilliant. There isn't much more to say. This film is pure brilliance from its opening frame to its closing moment. For both cinematic and cultural reasons, this is a film that every person should see.","user":"trevorj-67694","rank":[134,163]},{"title":"Fantastic Movie Filled with Sadness","rating":10,"date":"28 November 2015","review":"Going into the theater to see Spotlight, I had read the rave reviews and knew I was in for something special. This movie did not disappoint! Being from Boston, this movie really made me think about my life growing up, as a lot of \"what ifs\" came to mind. \"What if\" I went to church every Sunday...\"what if\" I was gullible enough to have a priest lure me into his lair. Spotlight goes straight to the heart of this amazingly sad (and apparently never-ending) saga of the Catholic church and the amount of abuse priests have inflicted on hundreds of victims. The acting is all-around fantastic, from Mr. Keaton to some actors that I am not familiar with, which is an aspect of this fine movie that makes it so profound. Tense throughout, I was saddened to hear that this abuse is an epidemic and probably will never be stopped. The exclamation point was when a member of the audience stood up and told the rest of us \"...I am a survivor...\" WOW...","user":"boatsfra","rank":[85,103]}]