[{"title":"went Around the Point & Missed it Completely","rating":2,"date":"30 July 2014","review":"I looked forward to watching an Australian film, about Australian problems, in our most-known Australian city.<br><br>What a let down.<br><br>I should have been warned by the inclusion of Cristina Ricci as a token American, who supposedly knows how to fix urban Aboriginal \"at risk\" (from what ?) kids' problems, laughably by teaching Hamlet.<br><br>Written and directed by Sarah Spillane, who allegedly lived for years in Redfern &amp; is now Los Angeles based, the film meanders around very clichéd subjects such as disaffected youth, a family member in prison, racial problems, and stereotypical police and teacher roles.<br><br>No depth, no great character development or logical behaviour sequencing &amp; progression, technically lukewarm to pass-mark for lighting &amp; sound, weak dialogue and almost no use of real-life dilemmas.<br><br>Even the title has a twee, American \"did you see what we did with that double meaning in the title ?\" about it. Very un-Australian, and very off-putting.<br><br>Anyone brought up on a diet of American rebellious youth movies and TV could have written this tripe, which bears little to the reality of the subject matter. Gangsta rap and hand gestures have absolutely nothing to teach Aboriginal kids, other than \"violence is the answer\" and separatism cures race rifts.<br><br>To round out how far the movie misses it's own point, a ridiculous lesbian scene with Australia's most useless, no-talent, celebrity lesbian, Ruby Rose, is tossed in for no apparent reason (and no sub-plot storyline introduction) and should have been left on the cutting room floor.<br><br>It has no utility and is not germane to the poorly expressed storyline.<br><br>There are enough real and important issues arising from Redfern to make several concise and insightful full-length features, and this is not one of them. It unfolds as a \"US garbage morals and message\" movie, superimposed on an Australian scene and for the most part ignoring Aboriginal reality.<br><br>Australia has entirely different problems between indigenous and white settlement, than American \"White\" and \"Negro\" race problems. Using a US cookie-cutter outline on an Australian problem smacks of opportunism and only serves to further differences between Aboriginal and non Aboriginal people - useless at best and dangerous at worst, creating an American style sub-culture and ghetto mindset which will only repeat, not break, the cycle of loss and alienation.<br><br>The standout acting in this film is from Mark Coles Smith, who has screen presence and a cheeky, engaging and charming smile, who could sell ice to Eskimos, and if utilised correctly will see great things for him in years to come.<br><br>Stay in Los Angeles Sarah, and write American crap over there. Don't try to parasite from the back of troubled people to a comfortable life as a movie \"director\".<br><br>Two stars for providing local employment. Try a LOT harder next time.","user":"adrossan","rank":[25,39]},{"title":"Another unusual role from Ricci...","rating":7,"date":"14 August 2014","review":"Christina Ricci is a very difficult Hollywood actress to categorize. While she has been involved in quite a few projects that are very commercially oriented (such as the god-awful \"Sleepy Hollow\"), she also has chosen many odd projects with far less mass appeal (such as \"Pecker\" and \"Pumpkin\") and has deliberately avoided the typical starlet persona. So, I wasn't all too surprised to see her, of all things, in a micro- budgeted independent film from Australia...yes, Australia.<br><br>In many ways, Around the Block is a lot like the old Sidney Poitier film \"To Sir, With Love\" combined with \"Hamlet\". I know this sounds strange--but the similarities become obvious as you watch the film. Like \"To Sir, With Love\", the main character in the film is a well meaning and super- idealistic foreign teacher who has come to work with disadvantaged city kids. Some might find this sort of idea a bit paternalistic--like it takes some American-type to come save the poor children of the world. And, while this might be one interpretation of the film, there is far more to it than this. This is because the teacher herself is a bit lost--and the movie is bound to turn a few heads with Ricci and the subplot involving her struggle with bisexuality. Again, I see this as Ricci walking to her own drummer in playing this character--and her rather steamy sex scene with a woman she meets in a bar will probably offend a few folks and inspire others. I definitely do NOT remember this sort of plot element in To Sir, With Love!<br><br>As far as the \"Hamlet\" element goes, you get it in double doses. First, this teacher wants to put on a production of this Shakespeare play using the inner city students from her school--and there is a widespread belief that these kids could never appreciate the play or rise to the occasion to successfully put on the play for the community. Second, the kid playing Hamlet, Liam (ably played by Hunter Page-Lochard) is in a position to recreate the play in his real life. This is because his father is in prison--and the jerk is pressuring his sons to avenge him by killing the man responsible for his incarceration. I liked this angle, as it made me realize for the first time that in the classic play, Hamlet's dead father actually could be seen as THE villain in the play, as he destroys his son in order to achieve revenge. On top of these themes, you add a lot of hip-hop culture and discussions of lost Aboriginal youth and you have this film.<br><br>So is this melange about two characters searching for a sense of identity any good? Well, I liked it. It managed to take familiar topics and make them quite unique and original. It also gives you insight into bigotry and dissatisfaction that folks outside Australia might not even realize exist. It's answer to all this might seem to be a bit simplistic, but at least it does address these problems and challenges the viewer. In other words, the film might offend you but at least it gets you to think and won't bore you.","user":"MartinHafer","rank":[12,17]},{"title":"Hamlet meets Hip Hop in Australian Setting","rating":7,"date":"4 August 2014","review":"The film depicts life down under in Spillane's birth city of Sydney. She focuses on a white American teacher, played by Christina Ricci whose character of Dino Chalmers is trying to make a difference in the inner-city suburb of Redfern. She gets a class of Aboriginal teenagers to perform Shakespeare's Hamlet with her lead being Liam Wood, a 16-year-old Aborigine who has a talent for dancing and acting. Unfortunately, his future is threatened when he gets in trouble with the law and police.<br><br>Spillane was herself a teacher in Redfern from 2001 to 2005 at an Aboriginal arts college where she instructed students of all ages, including teenagers. She wrote the screenplay in 2004 after learning about a real-life Aboriginal teen who also got into trouble with the law and police.<br><br>Spillane's film has this racial tension rippling in the background, or on the side. Her aim is more to take a step back and not focus on the specific incident, but rather examine the neighborhood and show the situation, which led to the racial tensions, or the needless death, much in the same way Spike Lee did in 'Do the Right Thing' (1989).","user":"marlonwallace","rank":[10,14]}]