[{"title":"It's difficult to warm to 247°F","rating":3,"date":"15 October 2012","review":"Four friends gather for a weekend trip that turns into a nightmare when three of them end up stuck inside of a sauna.<br><br>There's not much to go on other than that for a synopsis but movies banking on a claustrophobic vibe have tackled even bigger challenges. One only has to think about Buried, featuring Ryan Reynolds all alone and six feet under. A good screenplay featuring rich characters and interesting conflicts could probably have carried 247°F but unfortunately, this wasn't the case here.<br><br>247°F features cookie-cutter protagonists who follow the usual formula but without much savvy and no heart. Of course, you've got the prototypical troubled girl as the main character. Her carefree hot female friend. The cynical jock who is the hottie's insensitive boyfriend and of course, the more down to earth dude who may or may not hook up with our heroin.<br><br>Georgia is a country that more and more international productions are turning to for cost-effective shooting, so I suppose they might as well turn to making their own movies. This one has the look and production values of a typical American straight-to-video. The problem here is the story, the screenplay. The movie begins by highlighting the past of Jenna, a now quiet girl who survived a car accident but lost her boyfriend. 247°F takes place three years later, as a medicated Jenna still struggles to get past that tragedy. Unfortunately, the screenplay and direction never make this gripping.<br><br>One could hope the story would finally take off once the three characters get stuck inside but this is not the case either. There is no character development, not much in the way of interesting conflicts. No smart thinking and not much drama unfolding other than the three of them successively losing their temper or arguing pointlessly. All of this intersecting with a few scenes featuring people on the outside going about their business. Will the three find a way out? Will someone on the outside help them? Those two questions are what 247°F is all about but unfortunately, the screenplay doesn't build much suspense. The audience is simply left waiting with very little sense of anticipation being built up.<br><br>Scout Taylor-Compton is adequate as Jenna. The other protagonists are played by standard B-movie actors probably picked because they are nice too look at. The music score is decent. There are no major faults as far as cinematography... but as a whole, this is below average film making with no heart, because such a story demands a much richer screenplay.<br><br>It should also be mentioned that despite this being listed in the horror genre, there is very little here that qualifies the movie as such. (I personally did not mind and I did not lower the rating for that, but think it deserves to be mentioned so that others won't be disappointed)","user":"Siamois","rank":[46,56]},{"title":"Kids Trapped in a Sauna... No More, No Less","rating":5,"date":"14 October 2012","review":"Four friends travel to a lakeside cabin for a carefree weekend, the fun turns into a nightmare when 3 of them end up locked in a hot sauna. Every minute counts and every degree matters as they fight for their lives in the heat up to 247°F.<br><br>The most interesting thing about this movie is that it was filmed in Georgia (the country, not the state). I was not aware that people filmed movies in Georgia and used a Georgian crew, but I will assume this is a cost issue. But yeah, beyond that, not much going on here.<br><br>Tyler Mane has gained a horror following due to his part in Rob Zombie's \"Halloween\" and he does alright here in his limited role. Scout Taylor Compton has also been on the rise since \"Halloween\", even more than Mane. The reason is not entirely clear to me. She is a decent actress (I enjoyed her in \"Wicked Little Things\") and a growing icon, but of all the actresses, she seems to get the strongest following at the conventions... odd.<br><br>But seriously -- just kids trapped in a sauna. Is it scary to slowly cook to death? Certainly. But is it entertaining to watch for 90 minutes? Not really. This could have been 60 minutes or even 30 -- a good episode of a television show, but a bit too simple for a full-length film.","user":"gavin6942","rank":[42,52]},{"title":"Kids go on relaxing weekend at a cabin. Drunken argument leads to danger. Kids stuck in sauna...we watch them sweat..wow. I say C-","rating":4,"date":"16 October 2012","review":"\"I want to go its hot. I want to get out of here.\" When a group of friends decide to get away for a weekend at an uncle's cabin they think they will have fun and relax. The night of a party the friends choose to sit in a sauna for a few minutes before leaving. A drunken argument turns dangerous and three of the friends are locked in the hot sauna with the odds of them getting out getting slimmer with every temperature change. I have to admit that the plot seemed a little weak to me going in but after watching ATM I decided to give it a chance. After watching this I have to say I should have stuck with my original theory. The movie had little development and when they got to the sauna it seemed to stop and is was about an hour of screaming, crying and repeating the same thing over and over. A few scenes at the end got a little cheesy but this movie is geared toward older teens and for that it does work. This is not my type of movie but I'm sure there are some that will love it. Overall, a very weak movie that seemed to have no point. I give it a C-.","user":"cosmo_tiger","rank":[24,30]}]