[{"title":"Lame and Unfunny Comedy","rating":2,"date":"11 May 2016","review":"The comrades Craig Thompson (Matthew Albrecht), Jerry (Jarrod Pistilli), Lance (Isaac Harrison) and Tom Alexander (Dru Lockwood) travel to the Buck Wild Farm in Texas to spend vacation hunting deer. Soon they discover that the owner Clyde (Joe Stevens) was bitten by a Chupacabra and has infected his slut daughter Candy (Meg Cionni) and neighbors that now are zombies. Will they survive?<br><br>\"Buck Wild\" is a lame and unfunny comedy of horror. The screenplay (or the edition) is disconnected and senseless, and in the beginning, Clyde sees his daughter shagging with her boyfriend on the garden and he throws his pipe wrench on the head of the man. Then he is bitten by the Chupacabra and the scene is entirely forgotten. The film is so bad that after 96 minutes running time, there is no scene that makes laugh. My vote is two.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[8,9]},{"title":"A beginner level zombie movie which stumbles, doesn't run, with a goof-ball script and pot-shots of humour","rating":4,"date":"23 February 2014","review":"Knowing nothing of BuckWild, I was left guessing in the first 10 minutes as to it being a student film or a spoof. Firstly due to the try hard accent of Jarrod Pistilli; a down town \"New Yawker\" hardman crossed with Tackleberry from Police Academy type, who supplements his Soprano accent by referring to everyone as 'boss'. Such was my distraction that I was continually thrown outside of the film. Suitably frustrated, I started looking up IMDb to see what the deal was. <br><br>Secondly and unfortunately not being a bullet to the head, the lingering, painful, un- comic like labouring of the main 'badass' local gang leader as he likes to be referred to but is otherwise as delightfully English as a cup of tea, could be a splendidly abstract contrast to the other small town America characters and therefore improve the films comic sensibilities. However, both inadequately portrayed characters just serve to further underpin this peripheral comedy zombie flick.<br><br>Bashing over; Joe Stevens ( Gilbert Grape etc) plays a typical booze addled aggressive hick land owner who is only slightly upset by the generous and ever compromising affections his daughter gives to any arriving fresh meat. Despite the limitations of such a backwards character, Joe's delivery offers respite and a safe house to film viewers from the continual onslaught of bad acting. Against the low production values, the film steps it up with confident editing, comic book transitions and timely cuts from graphic violence and lengthy zombie close ups, (I imagine as a result of a limited budget and to keep its humorous momentum).<br><br>The story does not need explanation as it doesn't break the \"run its a zombie run\" mould and can be confidently summed up as a survivor tale with guns, over\\undersexed teenagers, hash brownies and the ubiquitous \"car hitting something on a darkened road scene\" - which to the seemingly vision impaired central characters, happens no less than 3 times in this movie. <br><br>As a B horror zombie comedy (aren't they all?) a blend of its inadequacies should charm enough to lift it out of the pile. I can say, having survived this until the end ;the goofy dialogue, semi fresh takes and comic playfulness (some unintended) eventually starts working, just. In particular, the scene with a doped up zombie giving relationship advice is rather funny. Yes, a \"doped up Zombie giving relationship advice\" - enough said.<br><br>See it with your pals","user":"jamesakinghorn","rank":[9,15]},{"title":"Wow this is Bad","rating":1,"date":"21 July 2014","review":"The \"plot\"<br><br>A hunting vacation goes horribly awry for 4 friends after they accidentally shoot the lease's land owner.<br><br>I know this was supposed to be a comedy spoofy movie but there really isn't much humor. Just bits and pieces that make no sense.<br><br>For example the movie starts with the tart daughter having sex in the tulips. Daddy seems to kill the BF (never quite sure about that) and then he goes in the shed and is attacked by what looks like a zombie chubracabra.<br><br>Cut to next scene and the dad is fine and the movie starts.<br><br>Nothing makes sense, which might be OK if there was actually some funny moments or if the direction was tight.<br><br>It's not. It's a meandering movie that is confusing and horrible.<br><br>The acting is passable. The story is not.","user":"arfdawg-1","rank":[3,5]}]