[{"title":"Good enough for a Netflix horror movie","rating":6,"date":"4 July 2018","review":"I see reviews here from people who saw this in the theater. If I saw it in the theater, and paid actual money for it, I'd probably give it a 5 as well. But I watched it on Netflix while doing my hobby. For that it's perfectly fun. It's not a great horror movie. It relies on pretty predictable jump scares and quick shots of creepy things. You can see the \"twist\" coming from a mile away. But it's not terrible. It's acted well-enough, has decent pacing, and the production quality is good.<br><br>If you're like me and have watched pretty much every other horror movie on Netflix, then you'll probably enjoy it well enough. If you want a great horror movie, though, then you'll want to keep looking.","user":"dingane","rank":[9,9]},{"title":"Demonic","rating":4,"date":"10 September 2015","review":"Demonic is a film \"presented by James Wan\"... but not directed by him. Anyway, regardless of the director's identity, the main problem of Demonic is an atrocious screenplay which makes a useless effort to repeat the success of \"haunted house\" movies from the past. It wasn't a bad idea to combine supernatural horror, \"found footage\" scenes and police investigation in one film. However, the combination is done horribly in Demonic. The main plot of Demonic follows the police investigation from detectives Lewis and Klein, who examine the scene of the crime and interrogate the only survivor, trying to determine what happened at an abandoned house. Another narrative level is composed by the witness' flashbacks, in which we see the classic \"ghostbusters\" routine putting cameras on the wall and searching for supernatural manifestations in the dreary rooms and corridors. And finally, we have \"found footage\" passages taped by the previously mentioned cameras. That combination of formats and chronologies isn't done in a compelling way at all, and then, we have the obligatory twist at the end, which I found absolutely improbable and lacking of any sense or logic. I'm not going to reveal it, but it feels arbitrary, like a desperate maneuver to leave us with a final surprise, even if it has nothing to do with the rest of the film. I went to see Demonic with low expectations, but the presence of the solid actors Frank Grillo and Maria Bello gave me the slight hope that the film would surpass them... but the truth ended up being the opposite. Surprisingly, the performances from Grillo and Bello feel as insipid and listless as the ones from the rest of the cast, and Will Canon's direction is equally apathetic. The fusion of supernatural and police subjects had potential, but Demonic does it so badly that I felt it like an absolute waste of time, specially because I watched it at the cinema, where I couldn't use the \"fast forward\" button to minimize the unbearable boredom I felt while I was watching it. On the other hand, \"Grillo &amp; Bello\" sounds like an excellent name for a restaurant; if they decide to stop acting, both have that good alternative.","user":"Argemaluco","rank":[23,30]},{"title":"Not Great, But Pretty Entertaining","rating":5,"date":"13 May 2015","review":"This wasn't a bad movie. I had no expectations for this to be good at all. However, I was surprised. It wasn't great, but it was pretty original, and the acting was well done.<br><br>My big problem with the movie was all the jumping back-and-forth between the past and present scenes. They should've just stuck with the people going to the house, and then they could've dealt with the aftermath with the police. It was confusing for the first few times.<br><br>I gave this a 5-star rating. If you're in the mood for a fairly original story that actually does have some jump moments that are well executed, you might want to give this a try.","user":"chrismackey1972","rank":[20,29]}]