[{"title":"Predictable sentimentality","rating":6,"date":"23 May 2018","review":"Estranged father and Son going on a road trip isn't entirely new material. Ed Harris as the father , Ed Harris as he is always delivers. Jason Sudeikis for some reason always looks like a Mister Know it all in many of his roles, it makes one wonder if he has other facial expressions or emotional depth, he always appears to be the same person in all his roles. <br><br>If you're a baby boomer like me, you will feel the nostalgia we have pre-selfie era. There is something magical with how the old cameras worked and the placing of the film roll. Indeed those were the days.<br><br>You'll know what happens in this film, predictable as it is there are still some charming elements in it.","user":"NikkoFranco","rank":[7,7]},{"title":"Nothing new, yet compelling.","rating":6,"date":"28 April 2018","review":"How much does a movie's originality in terms of storyline play into it's ultimate, overall quality? Should a film be seen only in terms of the movies that have come before it? <br><br>From it's title and poster to the actual film itself, Kodachrome sets itself up to be THAT kind of a road trip movie. The kind that features Hollywood jaw lines gazing into the setting sun as your quintessential bright red convertible speeds through a quiet countryside. This is accompanied with that melodious Indie track that rounds out the scene. Kodachrome is most definitely about something; it has meaning, it has purpose. The performances are affecting. The direction is largely unobtrusive and contents itself with letting the script do all the talking, exuding a tenderness that pervades and persists throughout the entire film. <br><br>Yet, all of these accomplishments are left denied by the aforementioned screenplay which not only resorts to a fundamental premise that is unoriginal but dialogue that routinely divulges into the perceived cliches of the 'road trip' movie. Characters repeatedly break into melancholy monologues about love, life and art, making biting observations on the human condition. From afar, the plot unfurls predictably and there is nary a moment where the viewer is surprised. Also, as a movie where the narrative is driven by the praise for tradition film format and analog technology, and despite having been aptly shot in 35mm film, photography as an art form itself does not play a more central role in dictating the nature of the storytelling. Given it's narrative simplicity, the experience could have been unique if the origins and vitality of preserving the old art form were entwined into the story, serving as an effective case for the preservation of the film format. <br><br>While these are my qualms with the movie, there is no denying that it is constructed with care and an eye for detail that could easily have been left out. The characters are fairly well realized through whom the movie commendably balances the humour with the drama. The performances manage to convey the gravity of the story and the simple confidence with which the movie progresses is sure to engage most viewers. Ultimately, Kodachrome stands as an undemanding, welcoming road trip movie; you won't feel new feelings, but you will revisit old ones, much the same way you might look at some personal Kodak photograph of old.","user":"LiveYoLifeLikeYouMeanIt","rank":[27,34]},{"title":"Not your typical road movie...","rating":9,"date":"21 April 2018","review":"This isn't your typical road movie. When a nurse (Elizabeth Olsen) shows up at Matt's work to tell him that his father is dying, he couldn't care less. They haven't spoken in over a decade. But wait, there's more! Zoey wants Matt to accompany Ben (Ed Harris) to the only lab in the country that is still processing Kodachrome film before it shuts down in a week. He basically gawks at her and tells her to get lost, but she's persistent, to the benefit of all involved. <br><br>In 'Kodachrome', we're taken on a beautiful journey of years lost and bitter roads not traveled. The character arcs are believable, for the most part. Being a father, I got a bit teary-eyed at the \"climax\" of the movie (spoiler alert: You will never see it coming!). <br><br>The cinematography is excellent. They weren't afraid to let the action play out in darkness. Not everything is perfectly lit, and that lends to the authenticity of the film. The restitution at the end of the film feels well deserved: Just leave it to a road trip to have an estranged father and his down-and-out son come to terms with their past, as well as confront questions about their future.","user":"bills-steven","rank":[40,54]}]