[{"title":"It's no 'Second Coming', but no 'The Stone Roses' either.","rating":6,"date":"14 October 2012","review":"'Spike Island' is clearly a labour of love: love for the '90s, for Manchester, and for the Stone Roses. These are loves which I share with the filmmakers. However, I have a feeling that this is what carried me through a great portion of the film. From the outset the cinematography is slick and fun, the cast are likable and solid, and it goes without saying that the Roses soundtrack elevates the film whenever it is utilised. The major downfall of the film is the script. <br><br>It's not terrible by any means, and is wonderfully funny and charming throughout. Unfortunately, it feels like a first draft for what could have been an excellent final film. It suffers from trying to cram in too much, which ultimately has the opposite effect and leaves the viewer feeling like we haven't really covered anything. All of the characters, even the protagonist, are extremely thinly sketched, each with different a Coming-of-Age cliché stuck to them in place of actual character development. The setting has been painstakingly reconstructed, and in a sense the aforementioned scantiness leaves us with an impressionistic, unfocused but very accurate glimpse of the time and place. Which is nice, but cannot sustain an entire feature film. <br><br>A major plotting fumble which could have been corrected in a redraft is that it drags on for far too long after the actual gig has taken place. This is the focus and the high point of the film. Afterwards it just feels like a slow decline in which you can't see the bottom, as the film wraps up the myriad plot strands which it never successfully committed us to in the first place. <br><br>The adulation also gets a little cringey at times, even for a film which was made with the purpose of adulation: lines like 'I feel like they made the record just for me.' 'Don't be daft, they made it just for me.' really could have been rewritten. I don't often roll my eyes to Stone Roses praise. <br><br>I've focused a little more on the negatives of the film than I wanted to, because after a single viewing those unfortunate flaws are what have left the biggest impression. The overall experience was positive, though. The timing of the release couldn't have been better. I'm glad the film was made, and I'm glad that I saw it. At the premiere, no less, where there was a lot of goodwill and anticipation from everyone, myself included. It's just a shame that I couldn't love it as much as I wanted to.","user":"Utsuro","rank":[35,39]},{"title":"Does Mat Whitecross' film Bang the Drum?","rating":7,"date":"2 March 2015","review":"It's May 1990, Great Britain, and The Stone Roses are about to play a monumental outdoor gig at Spike Island in Widnes, Cheshire. A bunch of teenage acolytes of the band, aspiring musicians themselves, embark on a journey to Spike Island whist at the same time embarking on personal journeys of the real life kind.<br><br>Us Brits do like ourselves a coming of age drama set to the backdrop of musical importance. Mat Whitecross (Sex &amp; Drugs &amp; Rock &amp; Roll) taps into the era of Baggy Manchester, of a Northern Britain dominated by pills, thrills and romantic bellyaches. To many of a certain age The Stone Roses were \"their\" Beatles, a power pop foursome that rocked it big time, their influence on the British music industry is still being felt today. This in spite of their relatively short life span. Re: The Sex Pistols at Winterland, see The Stone Roses at Spike Island (in other words it was a pretty awful gig all told).<br><br>However, the band are secondary to the teen angst narrative threads, to the scallywag japes and sexual growing pains. As Messrs Ian Brown and John Squire weave their chordal magic in the background, a bunch of spotty Herbert's with mad mac haircuts and iffy accents try and make sense of it all, of life, death, loves and hates. Music binds them together, but does anything else?<br><br>It's all very formulaic stuff, but for those of the time, or for those with a love for how music can define your life, or at the least shape its direction, then this hits the requisite chords. It's funny at times and the cast are ebullient enough to carry the clichéd and thin material home, but come the finale you will be remembering the soundtrack more than the story itself. 6.5/10","user":"hitchcockthelegend","rank":[6,6]},{"title":"Disappointing.","rating":3,"date":"15 October 2012","review":"The only reason you would go to see this film is if you're a Stone Roses fan, that much is obvious. Fortunately for the director this is just enough to carry you through a disjointed, underdeveloped and cliché riddled script. The intended demographic is clearly people like me, 40 + year old men who lived through the period and hold dear the Roses and whole Madchester scene. Yet the film plays like a film aimed at teenagers, with set pieces used merely as an excuse to overlay a Roses classic. Although the characters are likable their development is soap opera at best, their dialogue hugely clichéd and dishonest and when the script does enter interesting territory it is quickly dismissed to cover another bullet point on the 'coming of age movie' tick list. The Stone Roses reformation has been such a wonderful thing for thousands of fans all over the world. This film actually annoyed me as it belittles real emotion and makes honest affection appear contrived.","user":"mrkbrwn-502-73177","rank":[24,45]}]