[{"title":"A film for all ages","rating":10,"date":"3 December 2013","review":"I saw Angels Sing on November 16, 2013 in Philadelphia. I happen to know a little about how this movie came into being, which is a story of perseverance and courage unto itself. What I like about this movie is that it affirms the importance of love between father and son and how such love requires care and effort to come through.<br><br>Unlike run-of-the-mill movies that dish out plenty of sex, violence and guile, this movie is made for all ages, and especially for people who like to sing.<br><br>It is a movie for young people who have yet to understand the meaning of family love. This movie could remind otherwise jaded adults that love is possible only if one can give it. For this reason alone, I give it a ten.","user":"jchanamm","rank":[38,50]},{"title":"Enjoyable, hug-your-family Christmas movie!","rating":7,"date":"30 December 2013","review":"Angels Sing was a lovely, whimsical comedy-with-tear-jerker moments. <br><br>Yes it was predictable, but it was a lovely Christmas movie which I am now going to add to our ever-increasing Christmas movie family extravaganza!<br><br>Having all the musicians in the movie could have been a bit more prominent, (I would have loved to hear HC Jr show us some of his amazing Christmas singing), but nevertheless I loved the music, which was fresh and not the overdone usual Christmas classics.<br><br>Give this movie a chance! I think you'll be hugging your family on the couch, and making up your own version of the 12 Days of Christmas!","user":"chris-ywam","rank":[14,17]},{"title":"Very enjoyable, even to a Grinch.","rating":8,"date":"15 December 2013","review":"Sentimental? Schmaltzy? Sure. It's a teen movie. We've all seen the story before. Adults may like the characters and the songs. And this Austin Tx movie is chock full of musicians. You mostly hear parts of songs. In the end, I wanted to look up some of them. The musical part has a quirky, organic feel. I'd be happy living in this town! (I wish there was a bonus track, of how the musicians and cast were chosen. Some of the artists are on youtube) I expected little when I rented it. It was Christmas, and the cast looked interesting. I was afraid it might be too churchy. I had no problem with the sentimentality. And the religious aspect was likely turned way down, from the book(?). Some will hate the movie, some will be filled with joy. We built a fire, poured some wine, and really enjoyed the movie! (my wife loves Christmas. I'm more of a Grinch! But I do like holiday lights...)","user":"jondoe888","rank":[18,23]}]