[{"title":"Delivered","rating":6,"date":"20 April 2013","review":"This Direct to Video rides the trend of the teaming of two, count 'em, Action Stars for the price of one and it is better than one would expect. It looks pretty good and shows-off some stylish non Action camera work and a strong if padded plot that is not bad.<br><br>There is enough here for Fans and maybe even enough for Slummers who dropped in just to make fun but found it reluctantly enjoyable. The Story Thread keeps things strung together as it weaves familiar fisticuffs and gun battles together with some mildly interesting supporting Characters of note.<br><br>This is probably as good as this type of thing gets and while it is attractive in a wet, dull, and gray way, it may have included one meaningless sub-plot too many (the wife or the brother, take your pick). But in the end it succeeds in its business to kick, punch, and shoot its way onto your Big-Screen TV with just a little more added story and umph than expected.","user":"LeonLouisRicci","rank":[21,24]},{"title":"A definite step up from the other Austin films I've seen","rating":6,"date":"27 March 2013","review":"I watched THE PACKAGE last night and was surprised by it; mostly because the earlier Austin vehicles I had seen (HUNT TO KILL, TACTICAL FORCE) were really bad. Austin is still really stiff (both acting and physically) but the director plays upon these traits better than the previous helmers. Also, director Jesse Johnson handled the action scenes a lot better than most, not resorting to the shaky cam crap that a lot of DTV action guys use. Of course, the highlight for me is Dolph Lundgren, who delivers another juicy co-starring role much like he did in the Cuba Gooding, Jr. action flick ONE IN THE CHAMBER last year. While I'd still like to see Dolph get back in the directing chair, these smaller roles are good enough to fill the time in between.","user":"udar55","rank":[13,14]},{"title":"Another Steve Austin movie, this time with Dolph Lundgren...do I really need to say more? I say C.","rating":5,"date":"8 February 2013","review":"\"I need a package delivered to the German.\" Tommy (Austin) has an easy task. All he has to do is deliver a package to a man named the German (Lundgren) and his brother's debts will be wiped and he will be free. What starts as an easy task takes a deadly turn when he finds out what the package is and then is followed by another gang who wants their hands on it too. I know what your thinking Steve Austin and Dolph Lundgren in the same movie...how can that be bad?? Well, sorry to disappoint but this is not all that impressive. I do have to admit that of all these generic B action movies that seem to constantly come out at least Austin's movies are entertaining, mainly because of the little jokes he says. This is no different. Really nothing to say except if you like Austin's movies you will like this one as well. Overall, not as bad as I expected. I give it a C.","user":"cosmo_tiger","rank":[34,43]}]