[{"title":"The Nut Job","rating":3,"date":"18 October 2014","review":"The most expensive movie co-produced in South Korea...apparently, and Canada had their fingers involved too! So would this explain why the movie is so poor? This whole fiasco is based on an animated short which revolved around the main character Surly Squirrel (sounds like a crap Disney character).<br><br>Park creatures are the focus of this animal based adventure, well park creatures and some woodland creatures it seems. So its kinda like 'Over the Hedge' but just nowhere near as good or funny. For some unknown reason the movie is set in 1959 although I had no clue to this whilst watching, I just thought it was the artistic style for quirkiness. All these little mammals live in or near a big tree within a park, winter is coming and they gotta collect nuts to survive. I kinda always thought that was a squirrel thing but in this movie raccoon's moles birds etc...All seem to want nuts too.<br><br>Believe it or not that's pretty much the entire premise, creatures after nuts. The gimmick being after accidentally burning down the big tree whilst trying to nab nuts, Surly Squirrel is outcast into the city to survive as punishment. There he discovers a basement full of nuts but the basement is also the HQ for some bank robbers who are attempting their own heist. Hence the movie being called the Nut Job because it deals with a bank job and a similar job for the creatures trying to nab these nuts...such a clever play on the 'Italian Job' movie...oh geez...face in palms cringe time. Oh and I guess Surly Squirrel is caused this down to the fact he's miserable mean and selfish right? (*groan*).<br><br>OK the movie looks good of course, I can't fault that but its hardly a surprise is it. Everything is animated beautifully and looks glossy. All the characters are well designed, they all look as they should (cartoony versions of animals) and the voice acting work is solid. The nameless raccoon character looks to have been designed around Liam Neeson's face as they both have similar facial expressions and a big conk which work well. Various other characters are as you'd expect with the stereotypical dumb clumsy characters, fat ugly characters, tough large characters and the one main attractive female character (attractive on an animal level).<br><br>Most of these characters are all reasonable enough accept for Grayson Squirrel who is the park hero...but is actually very incompetent and cowardly (you're suppose to laugh now...this is the funny character). This guy is annoying and pretty pointless really, he serves no real purpose and could be easily hacked out of the movie. Naturally Brendan Fraser voices this highly annoying and pointless squirrel and we've seen this act before from Fraser.<br><br>One problem with this movie is there are too many character I think, you're never really sure if you actually like any of them because most of them are so fundamentally unlikable and boring. Well that and incredibly cliched predictable and stereotypical of every animal animated movie ever! The plot is so utterly drab and it goes nowhere! they wanna steal nuts, OK so steal them, what's the big deal. The stupid thing is they're animals...they could probably grab nuts and all sorts from anywhere in a city and in the end they don't actually manage to get them anyway! Half of them got flushed away in the river and can you count wet soggy nuts a score? The actual bank heist sub-plot going on with the humans just seemed so redundant, who cares? I didn't. It didn't really bare any influence or relevance on the animal plot going on around their feet.<br><br>Christ this movie was dull! I mean seriously I was getting up and doing other things. The plot is so slow, so dull, so unadventurous. The characters are so basic, so flat, so completely lifeless and cliched its painful, the fact the movie tries to be funny also sticks out like a sore thumb and bombs hard. Grayson Squirrel is clearly meant to be the pant-wettingly funny aspect of the movie and he sucks ass! whilst the main hero squirrel Surly is just depressing. Oh and Hollywood people...its kinda creepy animating these cutesy creatures with human expressions and body movements.<br><br>What was that soundtrack about?! I'm guessing the use of horrendous 'Gangnam Style' track is down to the fact the movie was co-produced in South Korea. Was that really necessary? Oh and was it remotely necessary to have an animated PSY in the end credits doing that stupid dance with all the animals!! Good God that was terrible, switched that sh*t off quicker than you can say that song will date this movie badly in years to come.<br><br>3/10","user":"phubbs","rank":[11,14]},{"title":"A time well-spent.","rating":7,"date":"5 April 2014","review":"A very positive movie, which, while borrowing heavily on Over the Hedge, is still a worthy standalone sight. Perhaps some characters are a bit naive or predictable... or outright annoying, but the whole composition is alright. The is movie is about crime, friendship and consequences... of both. It's beautifully animated, quality-voiced, has sufficient humor... and doesn't have revolting moments. Well, except for PSY, hehe.<br><br>Overall it doesn't have the qualities of an outstanding animated picture. It doesn't have unique plot, or music or some spark... But it does it's best to entertain, and that is already a step up from an average animation. Perhaps a critic less obsessed with animals or cuteness would judge it for less, but compared to many other movies, it at least doesn't have that much bad in it to go below the rating of 5. Six, perhaps seven out of ten - is the reward for entertainment without anything groundbreaking.","user":"Wirxaw","rank":[23,34]},{"title":"Nice work, animators!","rating":17,"date":"17 January 2014","review":"The Nut Job looks fantastic. Try to ignore the trailer, and if possible, the inconsistent soundtrack, too. Pay attention to the subtle nod to the 50's, present in all the background details: The rooms, the cars, the human characters. It looks great. The attention to visual detail is spot on. So kudos to the people in charge of making this look the way it does.<br><br>The story itself has promise: A nut heist that runs concurrently with a bank heist, the squirrel storyline paralleling the human one. As you can imagine, there are cheap jokes and nut puns a plenty, but at least the younger children in the theatre will be entertained. Any flaws present in the Nut Job have nothing to do with the way it looks. And if anything, that's what saves it.","user":"bev-spritzer","rank":[39,65]}]