[{"title":"Meandering, lifeless, and without any bite","rating":4,"date":"21 December 2011","review":"Though not the worst zombie movie ever made, \"Steve Nile's Remains\" disappoints and bores. For one thing, if a creative's name appears in the title, he or she should earn that place in the marquee with a script that goes somewhere. Sadly, neither the story, nor the characters in it do much more than shuffle around, running away from zombies.<br><br>Worse, one doesn't really care what happens to the people left alive in the zombie apocalypse. They're largely uninteresting at best, awful and selfish at worst. Even if the script had given them rich personalities, the actors are unconvincing and often wooden (especially Evalena Marie). The directing is methodical and the camera work uninspired.<br><br>The plot is, in essence, DAWN OF THE DEAD in a hotel. It's largely influenced by (if not derivative of) Steven King's FIRESTARTER and THE STAND, as well as Justin Cronen's book _The Passage_. About the only innovative aspect of this of this movie is who survives. But really, by the end, you just won't care.<br><br>Watch it if you're folding laundry. Or really loaded.","user":"jet66","rank":[28,37]},{"title":"It doesn't get more ordinary than this","rating":4,"date":"30 April 2015","review":"REMAINS is yet another zombie movie, not quite as low budget as the very worst of the genre (DEADHEADS or THE ZOMBIE CHRONICLES) but pretty low budget all the same. I mean, the budget is enough to reasonably execute the premise and bring to life a ruined city and its environs, but not enough to provide a halfway decent script or memorable actors.<br><br>The storyline involves a group of survivors holed up inside a casino after a zombie apocalypse. The casino setting is featured heavily in the film's poster and box art, but is severely underutilised; they could have been in any old building. This is an action-focused narrative with lots of shoot-outs and run-ins with fellow survivors. It's all low rent and rather cheesy, but not unentertaining.<br><br>The story is based on a comic by Steve Niles and has some fun with zombies, making them more human than seen elsewhere. There's an undercurrent of black comedy running throughout, but it hurts that the human characters are less than interesting and you never really feel involved or care about what's happening to them. REMAINS is mildly watchable but entirely forgettable.","user":"Leofwine_draca","rank":[4,4]},{"title":"Funny Trash","rating":6,"date":"27 November 2013","review":"On the day of the celebration of worldwide peace, there is a nuclear accident and people are turned into zombies. In Reno, a group of survivors are trapped inside a casino: Tom (Grant Bowler), his girlfriend Tori (Evalena Marie), the gay Jensen (Miko Hughes) and the stranger Victor (Anthony Marks) clean the place and stay inside with supplies for a long time. When Tom hears a transmission in the walkie talkie, he believes that help is coming and the use a searchlight to indicate their location. However, Tori suspects that the group under the leadership of Ramsey (Lance Reddick) is not what they think they are. Would her feeling be accurate or is Tori paranoid? <br><br>The trash \"Remains\" is a funny zombie movie despite the bad reviews. The plot is uneven, with good but also bad moments but the result does not disappoint at all. There is a hook in the conclusion for a sequel. My vote is six.<br><br>Title (Brazil): \"Devorados Vivos\" (\"Devoured Alive\")","user":"claudio_carvalho","rank":[11,15]}]