[{"title":"An emotional rollercoaster for loners of any age","rating":9,"date":"28 June 2018","review":"Though this film fits the coming of age genre the struggles that Nadine, the main character, is going through are not purely 'teen problems', As a 20 something year old this film deeply resonated with me and though similar to Nadine I was a socially awkward, defensive and pessimistic teenager it wasn't just the teenage me who could find the character relatable. I've noticed in the low rated comments one of the main reasons people didn't like the film is because the main character isn't likeable. And though I loved the film, I would agree; she isn't likeable. And the film is more realistic and better off for it. In real life we aren't always likeable people ourselves and the film almost acts as a tool to allow us to step back and really look at our current or teenage selves. Nadine does realise and understand towards the end and throughout the film her erratic and selfish behaviour is a result of her self loathing because she knows she doesn't want to continue being that way but she's stuck in this endless cycle and doesn't know how to get out. The valuable lesson from the film and her journey within it is that we often bring misfortune and unhappiness on ourselves in the way we handle and respond to bad things in our lives. <br><br>I think this film will speak to anyone who has felt alone in the world, lost without purpose or anywhere to fit in. If you like films about people rather than action and you watch a film to be taken on a journey (albeit an emotional one) rather than to have an enjoyable couple of hours then this may be the film for you. It helps that is has an excellent cast, each actor fitting their roles well and bringing them to life.<br><br>Another positive note I took away from the film is the way it handles and represents mental illness/ distress as it does so without labels and in a subtle way without needing to bring it to the forefront.","user":"jessicabamford-92078","rank":[103,107]},{"title":"What 'Lady bird' wanted to be.","rating":8,"date":"21 December 2018","review":"I've spent a lot of time over the years trying to figure out the humor I like and movies like this pin it down for me. I like awkward humor. Nadine is all kinds of awkward and that's what makes her relatable and adorable. You empathize with her and the problems she's going through, and through the eyes of an adult, of course you laugh at how overdramatic she is, but in a FUNNY way. It makes for some comedic relief between her and her teacher delightfully played Woody Harrelson, who just ignores her neuroses. What makes the film a pleasant experience is the way she is played by Hailee Steinfeld. There's a few minutes here and there where they venture into 'I will punch you' category, but nowhere near the insufferable 'lady bird' I had to turn off after ten minutes. Definitely a recommended film for those who empathize with growing pains.","user":"katiefanatic-791-306918","rank":[43,53]},{"title":"Recommended","rating":18,"date":"18 November 2016","review":"John Hughes is an unmistakable touchstone of the coming of age 1980s high school dramedy. Films like Sixteen Candles, The Breakfast Club, Pretty in Pink and Ferris Bueller's Day Off chronicled the adolescent experience of growing up, dealing with teen angst and self-actualization while mixing in a dash of old fashioned screwball comedy which at once provides relatable laughter for the viewer while making the dramatic pills easier to swallow. All of those undeniably come to mind when watching the directorial debut of Post Grad screenwriter Kelly Fremon Craig, The Edge of Seventeen, a coming of age high school comedy about a socially awkward and unhappy teenage girl named Nadine (Hailee Steinfeld from True Grit) whose best friend enters a relationship with her hunky older brother (Blake Jenner from Everybody Wants Some). And yet it is Amy Heckerling's Fast Times at Ridgemont High that The Edge of Seventeen finds its closest antecedent in, providing at once a funny and sympathetic rom com and a decidedly darker, more explicit look at budding female sexuality in a world adorned with dumb horny males who care nothing for the heroine's plight and emotional crossroads. At times its unbearable watching Nadine suffer while at the same time the film doesn't deny her own complicitness in the creation of her teenage misery. At first on the outset this looked like another Juno/Ghost World lovechild but as it progressed I was surprised how funny, charming, touching and well thought out this portrait of adolescent fear, anxiety and depression really was. Sure we've seen this movie done to death, but The Edge of Seventeen provided a fresh spin on the proceedings that kept it from blending together with what came before it.","user":"darkojedi","rank":[60,76]}]