[{"title":"Not A Bad Ride","rating":7,"date":"23 February 2012","review":"IMDb have provided a blurb so I'll just give you my opinion. I only review movies if no one else has done one yet.<br><br>Meeting Evil could be very vaguely described as \"Changing Lanes with more carnage\". I'm not sure why this film went straight-to-DVD. It's probably because the plot is a tad all over the place. Sometimes it's hard to understand Luke's actions and Sam's intentions. Some viewers may find this frustrating while others will simply consider it to be part of the fun. On the plus side, it's quite fast paced. You're barely 5 minutes into it before Sam pounds on Luke's front door and the thrills begin. Sam Jackson is quite clearly having a field day as the full-blown psycho who despises people with a lack of common courtesy. Luke plays the hero/victim and his character isn't exactly likable, but hopefully you'll be able to relate to him in some small way. He claims to be a nice guy and he's obviously accustomed to people treating him like a doormat. He's cheating on his wife... but then again she's cheating on him too. By the end of the film I still wasn't sure which one of them cheated first. They might've explained it when I tuned out for several seconds. I'd never heard of Leslie Bibb who portrays the no-nonsense wife and she gave a good performance so she's officially on my radar now.<br><br>I originally intended on giving this film 6 stars but when I think about it, I found myself empathising with Luke's character and hoping that either Luke or Leslie would lay their vengeance upon Sam at the climax. On that level it worked for me but if anything, that's just a testament to Sam's performance. If you're in the mood for a thriller and you can't find anything that tickles your fancy, you might as well let Sam Jackson take you for a ride. Let's face it, he RARELY steers us in the wrong direction. It also helps if you consider yourself to be a fan of Luke Wilson. If you hate him, you'll probably find this film to be average at best. I very much doubt it will change your opinion of him as an actor or a human being. Countless actor's could've played that role... but they didn't... he did... and he did a good job.","user":"NozinAroun81","rank":[102,138]},{"title":"Great move for a Sunday Night","rating":8,"date":"30 June 2012","review":"I just knew that this movie went straight to DVD and I sure can't understand why!!I saw some reviews that were saying that they didn't understand what was going on as being a bad thing,well in this case it wasn't cause it was the purpose of the movie,it was to make you wonder what was going on,and put your imagination to work. The acting was very very good,there were no weak actors ,the plot was brilliant in my opinion and the ending was also very good,leaving space to the watcher to take its own conclusions despite the one given by the story itself!! This movie kept me watching really wanting to know what was gonna happen next and it was extremely entretaining,which is what i look for in movies!! (Don't think bad of the review cause there are a few mistakes in it,English is not my first language)!!","user":"mork_blasphemy","rank":[43,60]},{"title":"Now That We've Met, Perhaps You Can Tell Me What You Want","rating":6,"date":"4 May 2012","review":"I'm sure that \"Meeting Evil\" is a lot of things. If only I knew what they were. What I can say is that the film is not boring; you're involved with it from the very first frame to the last. Unfortunately, it's next to impossible to tell what you're involved in, be it a crime drama, a psychological thriller, a biting commentary on American society, a supernatural horror story, a religious fable, or some bizarre combination of all of the above. Adapted from the novel by Thomas Berger, the film seems at odds with itself, trying to send a message while at the same time keeping it at arm's length from the audience. This is surely one of the most frightening and stylish unsolvable puzzles I've come across in quite some time. I'd recommend it, except I don't really know what I'd be recommending.<br><br>I can easily describe the sequence of events, but I don't think I can say what it's actually about. A realtor named John Felton (Luke Wilson) has just been fired. The timing could not be worse; his credit card payments are past due, and his picturesque house is in foreclosure. He keeps this from his wife, Joanie (Leslie Bibb), who, along with their son and daughter, unsuccessfully attempts to surprise him with a cake and candles. She leaves with her children, saying that they're going to the park. John pours himself his second glass of scotch. The doorbell rings. John opens the door and finds a man in a neat black suit and fedora standing there. This would be Richie (Samuel L. Jackson). He says his car has stalled and that it needs a push. John offers to help.<br><br>As John pushes, Richie sees to it that his car backfires on John's leg. Seemingly apologetic, Richie offers to take John to the hospital. But first, they stop at a gas station. Richie is met at the window by a rude young woman who chews gum like a horse. Richie goes inside the convenience store for a minute, then gets back into the car. Rather than continue to the hospital, he drives John to a local bar, where he's offered a drink. Before entering, John goes across the street to a cell phone store, where the overweight cashier wolfing down on donuts refuses to let him make a local call. John goes back to the bar and runs into his arrogant former boss. Richie suggests that they both teach him a lesson. John thinks it would be better to just let it go. Richie disappears for a minute. Just as John is about to leave, he runs into his former lover, Tammy (Peyton List). Richie returns, claiming to have also paid a visit to the cell phone store.<br><br>Richie's car has been towed away, as he parked in a handicapped spot. John becomes the designated driver in Tammy's car, Tammy being just a little too tipsy to drive herself. On the road, John is nearly run over by an insane truck driver, who slams the breaks, gets out, and is ready for a confrontation. Richie, taking control of the situation, gets the behind the wheel and proceeds to ram directly into the truck driver, spattering the windshield and the asphalt with his brains. It's at this point we discover that everyone in the convenience store lies dead in pools of their own blood. John eventually picks up on this. Richie seems to be daring John to do something about it, rather than walk away like he always does. And so begins a killing spree, one that the police soon pick up on. Not surprisingly, John becomes their primary suspect. Meanwhile, a little girl stands in a field with her dog. When the police arrive, she flips them off.<br><br>Exactly who is Richie? A serial killer? The Devil incarnate? He seems to know an awful lot about John, despite the fact that personal information was never shared. All we really know about him is that he's evil. He would argue that the world is evil, and that he's killing people who are already dead. Ultimately, he's about as impenetrable as all the characters in this film. The most frustrating is Joanie, who in a split second transitions from doting housewife to confrontational firebrand. When she's being questioned by a police deputy, for example, she unleashes a quiet yet powerful stream of insults. What makes the scene even more mysterious is that she has both her children present, and she covers her son's ears before letting the deputy have it. Her reasoning: She wanted to teach her daughter how to defend herself and have her son remember how a man should speak to a lady.<br><br>Accusations of affairs and other indiscretions are introduced into the plot without ever being followed through. And yet we wait in sheer suspense for the inevitable moment when Richie reenters John's life, this time with Joanie present. In terms of physicality, it climaxes pretty much as we expect it to. In terms of theme or resolution, we're left with an entirely new series of questions. What is the message here? That we must stand up for ourselves in a society of rude gluttons? That the people we love may or may not be who we think they are? The more I try and process \"Meeting Evil,\" the bigger my headache gets. I honestly don't know whether to marvel at or be furious with the filmmakers for making something so narratively difficult yet so stylistically absorbing.<br><br>-- Chris Pandolfi (www.atatheaternearyou.net)","user":"Chris_Pandolfi","rank":[22,29]}]