[{"title":"Not among Allen's greats, but still a lot of fun","rating":8,"date":"9 November 2012","review":"While not great Woody Allen – it's neither profound, moving nor funny enough for that title, it is quite enjoyable. <br><br>The film is made up of four intercut short stories, that share little other than the fact they're set in Rome. Some have fantasy elements, some are more absurdist, others more straightforward character farce.<br><br>But somehow, though they don't make much of a logical grouping, the whole thing is lighthearted and fun enough that it seems grumpy to pick on it. <br><br>Sure some jokes fall flat and some ideas seem unfulfilled, but a lot of it is wonderfully acted and cleverly written. And at a time when so many comedies are aimed only at 15 year olds, even 2nd tier Woody, simply telling playfully comic tales, is a welcome sight.","user":"runamokprods","rank":[55,68]},{"title":"All of your heart's fantasies played out in Rome with love, celebrities, death and opera","rating":9,"date":"17 July 2012","review":"\"To Rome with Love\" is a fantasy film; a comedy about people living out their fantasies. The great thing about it is that it's subtle enough that you don't recognize the fantasy element in all of the relationships until later on in the film. The obvious one is when native Roman, Leopoldo Pisanello (Roberto Benigni), becomes a celebrity over night. \"It's better to be a celebrity than an unknown.\" And as Benigni shows, way funnier too.<br><br>It's the type of film where everybody gets to see themselves as famous, or supremely interesting, or a guiding angel, or married to a hooker, or the object of a movie star's affections, or on a romantic rendezvous with a thief, or having the ability to change the world with one simple idea. It will take you to wherever your heart desires. And then you'll realize why it's often advised to think with your brain rather than with your heart.<br><br>Half Italian and half English, we follow two relationships involving Romans and two relationships with Americans in Rome. A young, Italian, married couple get separated and the young man finds himself living out every other young man's fantasies while the young woman finds herself living out her own fantasies.<br><br>Hayley (Alison Pill), a New Yorker transplanted in Rome, falls in love and gets engaged to a successful Roman lawyer. Her parents (Woody Allen and Judy Davis) make the trek across the ocean to meet their in-laws. But Allen's obsession with death and equating retirement with death causes him to create a national disaster (or success story, depending on how you look at it).<br><br>Jack (Jesse Eisenberg) is an American architect living in Rome with his girlfriend. First he meets his architecture idol, John (Alec Baldwin), who sees Jack as the younger version of himself. Or more accurately, Jack sees John as the older version of himself (the joke works better that way). Then Jack meets Monica (Ellen Page) who is his girlfriend's best friend and is the object of all men's fantasies.<br><br>Page also gets to play the role of the self-obsessed, pseudo-intellectual — commonly referred to as \"the pedantic one\" in most Woody Allen movies. Other than Allen himself, Eisenberg and Baldwin play a sort of tag-team version of the self-deprecating, neurotic hero, although this time with a touch of confidence.<br><br>Confidence is not to be confused with optimism because as funny as \"To Rome with Love\" is, it also has Allen's usual undertone of pessimism. Death is going to come sooner than you would like, but not soon enough. And even if you do get to live out your heart's fantasies, they may not lead to everything that you hoped for. This film is the comedy version of death and negativity, and can provide you with the simple joys in life.","user":"napierslogs","rank":[79,113]},{"title":"A movie for fans","rating":8,"date":"20 July 2012","review":"As time passes Woody Allen is able to transform himself and his movies. Don't get me wrong, it is obvious that we are seeing a Woody Allen film from the initial credits, but he still can surprise us. <br><br>We see different stories through out the film. Some show aspects of the Italian lifestyle and culture, presented from a beautiful Rome; that city that Allen wants to present to us, his Rome. But other stories present again the issues that have been important to him, those problems that for centuries have raised for humankind: love, infidelity, death, success, fame, happiness; those issues that Allen simply loves to discuss. <br><br>The cast is charming and I want to highlight a sincere Roberto Benigni; Jesse Eisenberg, that resembles perfectly the young Woody Allen; and the beautiful and talented Ellen Page, with a powerful character that makes you impossible not to fall in love with her.<br><br>I have the huge bias of been a Woody Allen fan and that is probably why I enjoyed so much this movie. It is thrilling to see him acting again. See all that neurosis again in the big screen. This movie surprises, can be as surreal as Buñuel would be and also as real as Allen is with daily problematics.","user":"juanpimartinez","rank":[68,100]}]