[{"title":"Better than you'd think!","rating":8,"date":"5 December 2011","review":"Formulaic, cheesy, cliché'd and wonderful. Maybe it is all of the afore mentioned, but it is Christmas! Surprisingly well cast with Amy Acker stealing your heart as the rich girl gone good, and a nice turn by Haydn-Jones as the love interest. Gina Holden is excellent in the evil queen personage and Olivia Gowan is not allowed by director Jason Priestly to over act (which is sometimes the problem with made for TV productions) and she does wonderfully. Appreciative nods also must be given to Peter Creery in the role of matchmaker...<br><br>A sweet movie not to be taken seriously, and something you can watch with your child or your girlfriend.","user":"DaysofOdumba","rank":[29,37]},{"title":"Cupid Plays Santa","rating":6,"date":"30 December 2011","review":"Pretty and perky Park Avenue shopper Amy Acker (as Crystal Carruthers) finds a \"Dear Santa\" letter blown away from a mailbox. The letter is from an adorable little girl named \"Olivia\" (Emma Duke) who is asking Santa to bring her widower father a new wife. Feeling adventurous, Ms. Acker decides to investigate. She finds Olivia's father even more adorable. The handsome and dreamy-eyed David Hayden-Jones (as Derek Gowen) runs a soup kitchen for the homeless, and Acker is mistaken for a volunteer...<br><br>Strangely, Mr. Hayden-Jones does not seem notice Acker looks at him with desire. He is engaged to scheming Gina Holden (as Jillian), who steals the movie. But Patrick Creery (as Pete Kennedy) scores points by wearing a pink chef's uniform (pink, get it?) and other accessories with bemusement. Stubborn James Dugan (as Frank McCourt) does well with his small homeless role. Actor-turning-director Jason Priestley samples some \"Breakfast at Tiffany's\" (1961); it's dumb, but funny and easy to swallow.<br><br>****** Dear Santa (11/26/11) Jason Priestley ~ Amy Acker, David Hayden-Jones, Gina Holden, Patrick Creery","user":"wes-connors","rank":[17,21]},{"title":"\"Sleepless in Seattle\" meets \"Legally Blonde\" meets \"Arthur\"","rating":8,"date":"12 December 2011","review":"Somehow, despite the formulaic plot (rich, but nice, girl about to be cut off from family money unless she becomes more responsible (i.e. married and productive), finds widower whose child is seeking a new wife for him, while using knowledge of high fashion and society's upper echelon to overcome obstacle of snobbish former girlfriend attempting to work back into widower's life), this is a delightful story that actually works well. The characters interact in a relatively believable manner, so even though we can pretty much guess at how it will end within the first five minutes, it's fun to watch it play out. I wouldn't mind seeing it again!","user":"carolfs","rank":[17,21]}]