[{"title":"The narrator goes mad","rating":20,"date":"20 June 2013","review":"DePalma's first film in five years is purely for the fans, a throwback to his sensual thrillers of old; Sisters, Obsession, Dressed to Kill. So right off the bat, this probably excludes the majority of casual viewers who will find this too messy and too illogical to be of substance. Younger viewers who simply pick this off a website, will probably see the visual tricks he pulls as weird, lame stabs on ordinary technique. <br><br>The problem is that DePalma has not changed as a filmmaker, it's the film norm that has absorbed and extended so much visual language that was considered somewhat radical in his time, so when Tony Scott films are marketed as ordinary action, of course he'll seem far less sophisticated. Same thing happened with Hitchcock near the end, when guys like DePalma where coming out.<br><br>But oh what sweet, sweet DePalmaesque inanity this is!<br><br>What DePalma is saying is always in the camera. He seems to say: this is a movie, the result of illusory placement of the eye, so why not go wild on placement? Also: the eye, by its very nature, causes narrative dislocation. He is intelligent, not in what the dislocations mean but in the fact they are shown to be at work, which now and then fool as depth in just the same way they fool the characters.<br><br>You'll see all sorts of fooling the eye here. The car crash in the company garage, first filmed as dramatic with lachrymose piano cues and the second time as comedy. Scenes filmed with dutch angles and unusual shadows to register as dream but they are real. A split-screen that lies about its timeline. A scene set-up to be viewed as hallucinative dream but it's a flash back. And later we know it was an untrusted narration.<br><br>Many others will make a more streamlined, more exciting thriller, but no one is so committed to expose cinematic illusion like DePalma. He doesn't hit deep, because the illusion is not wrapped around character but around plot, that is always the tradeoff with him. A tradeoff I am willing to make, because I can find more introspective filmmakers elsewhere. There is Wong Kar Wai, Shunji Iwai. Lynch, who brings illusion alive.<br><br>But then you have an ending like this. It is utterly nonsensical as story, but the narrator has fooled us so much we'll fool ourselves thinking it's more than madness.","user":"chaos-rampant","rank":[76,99]},{"title":"Not that passionate","rating":6,"date":"3 July 2013","review":"This is just an OK film which means it's a bit disappointing from a director who has a reputation. It works as a - not very thrilling - thriller, and Noomi Rapace does a good performance. Plus the film delivers some intense scenes and good photography in front of very cool, emotionally empty sets.<br><br>What doesn't work so good: It starts as a kind of 21st century version of an 80s erotic thriller, but never gets erotic. In fact, the title is ridiculous, because it never even gets passionate - everybody tries to be in control and nothing happens instinctively or out of reflex. (The slow, controlled ballet sequence strengthens this impression). Also, Rachel McAdams is good at bitchy, but I couldn't believe in her as a tough enterprise lady. And finally, the twist, when it finally came, was exactly what was hinted at ...","user":"IndustriousAngel","rank":[41,51]},{"title":"It's OK","rating":5,"date":"10 November 2013","review":"Watchable De Palma time killer that borrows heavily from the director's earlier works...which in turn borrowed heavily from Alfred Hitchcock. Whole lot of borrowing going on. Still, that has little to do with judging how entertaining the film is and more about judging its artistic value.<br><br>My first impression of Rachel McAdams is that she was miscast but I accepted her more as the film goes on. Noomi Rapace is fine. I assume both women were intentionally directed to act in a somewhat peculiar manner by De Palma. It bears pointing out for those misled by the poster, trailer, or press for this film that it's not really the sexy lesbian thriller it's made out to be. That stuff only plays a peripheral role in the film and you never get any particularly sexy scenes between McAdams and Rapace as one might be led to believe by the marketing.<br><br>Still, it's an entertaining enough movie. Not De Palma's best but far better than his last two films.","user":"utgard14","rank":[27,35]}]