[{"title":"It's God's plan...","rating":10,"date":"30 June 2017","review":"I have a mind of my own, at least I want to think so, but, I was influenced enough to give Game Change a miss. I was told this was a hatchet job - I must admit that the comments came from Republicans mostly - I finally saw Game Change last night, It literally blew my mind. Hatchet job? What are you talking about? I felt for her, the film humanizes her and somehow explains without partisan hysteria, how we got there, that in a way is to explain how we got here in 2017. Julianne Moore is superb, superb! Not a single false note or cheap shot. I also felt for John McCain, the American hero who told us that Sarah Palin was ready to to be President. The torment in John McCain through Ed Harris's eyes is more eloquent that any line of dialogue. As is Nicolle Wallace, played brilliantly by Sarah Paulson. Her torment is also so real you can touch it. A special mention should go to Woody Harrelson, es Steve Schmidt, extraordinary. Writers, directors and everybody involved deserve oodles of praise. They told us a piece of recent American history about a woman who thought her Vice Presidency was \"God's plan\"","user":"Kopelson-Group","rank":[57,61]},{"title":"We All Lived Through \"Game Change\", & It's Hard To Believe We Did","rating":9,"date":"6 March 2012","review":"There will be a lot of people who see \"Game Change\" and will absolutely hate it. No doubt, Sarah Palin, if she chooses to watch it, will probably be one of those people. I can't imagine a Democrat hating the movie. Either way, you can't talk about \"Game Change\" without feeling the bottoms of your shoes slightly thump against a soap box.<br><br>I personally don't know how accurate \"Game Change\" is. The film is based upon one-third of the 2010 bestseller of the same name by John Heilemann and Mark Halperin. Their book, detailing the entire 2008 Presidential election and allegations thereof in both parties, had been criticized for relying on too many anonymous sources and lacking explicit sourcing.<br><br>This movie, written by Danny Strong and directed by Jay Roach, takes the most intriguing segment of the 2008 election, namely the nomination and introduction of Republican Vice Presidential candidate Sarah Palin, and lets the ridiculousness of the events surrounding her expose itself.<br><br>Like \"Recount\" (2008), the previous collaboration between Roach and Strong, what is most astounding about this movie is not the events in it, but that we actually lived through them not too long ago. To paraphrase Hannibal Lector, anyone labeling this movie as exploitation only needs to see the barrage of CNN and Fox News footage in this film to remind themselves that the past is real.<br><br>\"Recount\" told the story of the chaotic 2000 election returns, and how little Al Gore and George W. Bush actually had to do with the transpired events, contrary to popular opinion. \"Game Change\" shows the interactions between those in and out of the spotlight, and how candidates in an election can be the cause of their own undoing.<br><br>The film centers around Steve Schmidt (Woody Harrelson), Senator John McCain's chief political adviser during his 2008 campaign for President. After winning the Republican nomination despite being last in the polls in 2007, McCain (Ed Harris) finds himself relying on Schmidt and other political advisers to find a V.P. candidate. Behind in the polls against Senator Barack Obama, he agrees to choose a female running mate to put him at an advantage against the first African-American nominee for President.<br><br>National Campaign Manager Rick Davis (Peter MacNicol) does his homework on a viable female candidate via a YouTube search in the only really inconsistent part of the film. You see him watch videos of female Republican politicians ranging from then-Hawaiian Governor Linda Lingle to Maine Senator Susan Collins. What you don't see clearly is Davis' rationale behind not choosing one of these women. Why would Senator Collins not be a better choice than Sarah Palin? Of course, being originally from Maine, I am biased.<br><br>What you learn from this movie is that while the Republican strategists did some homework on the then-Alaska Governor, they should have done more. This fact becomes apparent when Governor Palin (Julianne Moore) does not know, among other things, that the British Prime Minister is the head of government in Great Britain, not the Queen of England.<br><br>In what could have been a farcical portrayal of a politician of whom it's easy to make fun, Julianne Moore is astonishingly great as Sarah Palin. Like Al Pacino as Dr. Jack Kevorkian in \"You Don't Know Jack\" (2010), Moore is so believable as Palin that you would swear Palin was playing herself.<br><br>More than having the \"You betcha!\" accent down pat, Moore never has one wavering moment where you think you're watching the same actress from \"Boogie Nights\" (1997) or \"The Kids Are All Right\" (2010). She nails every aspect about Palin from her firm belief in her politics, her reactions to the press, her ill preparation for the notorious Katie Couric interview, and her butting heads with political advisers. It's all completely believable.<br><br>While there was less pressure on Harrelson to play a public figure, he also did a great job as an adviser whose recommendation to nominate Palin truly seemed like a good idea at the time. Harrelson's Schmidt more or less regrets his decision to convince McCain, only to try to make the best of it later on.<br><br>Also equally effective is Sarah Paulson, who plays senior adviser Nicholle Wallace. In the scenes where she tries in vain to help Palin properly prepare for the Katie Couric interview, it's like watching an A-student try to get a D-student to study for a final exam. Considering how the real Palin bombed that interview, that scene could not have been far from the truth. Paulson really reflects Wallace's frustration well, and is believably too tired in the end to say she told her so.<br><br>Ed Harris, while not doing a dead-on imitation of John McCain, effectively reflects the frustration and regret McCain must have felt after choosing Palin as a running mate. McCain may have been capable of dealing with the failing economy and foreign relations, but Palin clearly was not.<br><br>While Palin may not have been the sole contributor to McCain's defeat, she undoubtedly threw an anchor off the side of the Straight Talk Express. In the end, Harrelson, as Schmidt, probably would not answer \"no\" to Anderson Cooper's question of whether he regretted putting Palin on the ticket. His actions and reactions throughout the movie answer that question already.","user":"D_Burke","rank":[162,202]},{"title":"the ugly American","rating":9,"date":"12 March 2012","review":"This film is a fascinating look behind the scenes of the most failed act of political cynicism in recent American history: the selection of Sarah Palin as John McCain's running mate for his 2008 presidential campaign. We are introduced to a candidate, John McCain, and a campaign, lead by Steve Schmidt, that is on it's knees. They are desperate and in need of a break, and they throw a Hail Mary pass to Alaska Governor, Sarah Palin. But she is only the first in a series of Hail Mary passes to come. Woody Harillson gives perhaps his best performance ever as Steve Schmidt, a man who is rearranging the deck chairs on this flailing campaign, as fast as he can, before it disappears below the surface. Ed Harris turns in his usual masterful interpretation of a complicated-underneath, but simple-on-the-surface, character, as John McCain. But it is Julianne Moore that is the steel girder of this narrative. She is the embodiment of what we now know to be the Palin phenomenon with all of it's cartoonish qualities and, by equal measures it's dire, and potentially catastrophic, possibilities. Moore delivers, subtly, the Palin we all know, overflowing with unfounded, unearned, unqualified, confidence. <br><br>The script is very well written and the pace of the story is exact. The final tableau of Sarah Palin standing on stage with McCain at his concession speech, hearing the crowd swell with the mention of her name, was reminiscent of Glenn Close gasping for air as she rose from the bathtub in the final scene of \"Fatal Attraction\". As Palin winks her cash-register-eyes you can almost see dollar signs in her pupils, and hear a \"ka-ching\" sound foreshadow the future. It will send a chill up your spine. <br><br>My only complaint about this film has nothing to do with its production values. It's a great film and will be well rewarded, deservedly, when the Emmys are handed out. My complaint about this film has to do with its politics. Sarah Palin was MUCH worse than she was portrayed in this film. Forget \"anonymous\" sources. Just look at the public record. The writers, in an attempt to appear \"fair\", intentionally leave out the most egregious information gaffs in both the Gibson and Couric interviews. No one can forget the moment when Charles Gibson asked Sarah Palin about the \"Bush Doctrine\" and she had no idea what he was talking about. Or when Katie Couric asked her if she could recall \"one Supreme Court decision\" with which she disagreed (Roe v. Wade!!!) and she couldn't name one. Those were iconic moments in this chilling brush with cataclysm. But their omission was not the worst offense done by the editing that no doubt softened Palin's image. The worst was how her gaffs WERE introduced to the film viewer. One of them is parroted to us through the infamous SNL skit with Tina Fey, on a hotel television, as a cringing Sarah Palin watches. This omission from the direct storyline (as it really occurred), and indirect delivery through the \"liberal\" media (SNL) made Palin look less clueless than she actually was. And made the \"lame stream media\" look predatory and cruel. They were not. Result: undeserved sympathy for the central character, Sarah Palin.<br><br>Sadly, this is what HBO does. They play things down the middle even when the facts have clearly crossed over the median and are speeding the wrong way into oncoming traffic. When \"what do you read\" is considered \"gotcha\", we're way out of balance. And HBO manufacturing an artificial balance where there was none before? Not good. There are not always two equal sides to a story. HBO's dilution of the real story as it unfolded, in an attempt to seem \"unbiased\", does a disservice to this otherwise brilliant film, and to history.<br><br>Game Change shows us the worst in political gamesmanship - the unbridled cynicism that lead an all male campaign staff to choose a political bimbo to be \"a seventy-two year old heartbeat away from the presidency\". And it shows us the worst in American political celebrity in the form of Sarah Palin with all of her race baiting and blind religious ideology that substitute for facts in her view of the world. She is oblivious to the geo-political winds that howl around this planet. Yet she would not hesitate to invade Iraq all over again because \"Saddam Hussein attacked us on 911\". Yes, seven years after 911 she was still unaware that that was a lie because her faith and her convictions substituted for the facts. This, I think more than anything, is what this story comes down to. The world is complicated and dangerous and the levers of power should not be in the hands of someone who is uninformed, reckless, and misguided. The stakes are simply too high.","user":"hughman55","rank":[135,171]}]