[{"title":"Decent Attempt but its not \"Tess of the D'Urbervilles\"","rating":6,"date":"30 July 2012","review":"Trishna – CATCH IT (B) Trishna is loosely based upon critically acclaimed 1800's novel \"Tess of the D'Urbervilles\". This is a story of young girl whose life is destroyed by the circumstances and love. Tess of the D'Urbervilles is a beautiful novel and the story is more complex than Michael Winterbottom decides to adopt in his adaptation. Here the director only chooses to pick up the poor girl and a rich man who first makes and then destroys her life. He left many key characters and moment from the magnificent novel, which I think would have made this movie more interesting. Otherwise Trishna seemed more like an erotic version relies on sex only. Once you become aware of the novel you will understand that the director chooses an easy way to make this an erotic bonanza. We never gets to hear why Trishna doesn't leave from sexual abuse later or at least tell him that she is felling like a sexual victim but sadly we never get to hear her point of view. She does what she was told by men in her life from her father to the man she falls in love with. Freida Pinto is truly a Revelation, starting from Slumdog Millionaire, then to Red Woman in Woody Allan's ensemble YOU WILL MEET A TALL DARK STRANGER to Immortals with Henry Cavill to Rise of the Planet of the Apes with James Franco and now in Trishna, she has proved why everyone wants to work with her. Riz Ahmed is superb; he is charming, passionate and evil in one body all together. On the whole Winterbottom successfully adopted the Indian atmosphere and also was able to take out brilliant performance from Freida Pinto and Riz Ahmed but I think he failed to do justice to the Thomas Hardy novel \"Tess of the D'Urbervilles\" because it was never about eroticness it was about a young girl destroyed by her circumstance. If I forget it's based upon this novel than it's a very nice movie.","user":"saadgkhan","rank":[19,21]},{"title":"Doing Hardy proud in modern India","rating":9,"date":"6 June 2012","review":"Filmmakers never have been able to resist indulging their love for the good ol' English canon by churning out their own rendering of classic novels. Last year was no exception, with the likes of Cary Fukunaga's Jane Eyre and Andrea Arnold's Wuthering Heights hitting our screens. But while these were both pretty decent efforts, overall they provided little more than an opportunity for the well-versed viewer to compare them to previous outings and mull over their treatment of the source material.<br><br>As such, the classic novel adaptation has become little more than a type of genre flick, in which we are invited to watch a director wrestle with a well-worn story. Transposing Thomas Hardy's tragic novel Tess of the d'Urbervilles from Victorian Wessex to modern day India, as Michael Winterbottom has done with Trishna, appears on the surface to be little more than another gimmicky relocation of a classic tale. This film, however, manages to do justice to Hardy's themes whilst carving out a discernibly different kind of work that can be watched and enjoyed with fresh eyes.<br><br>Hardy was writing in a period of dramatic ideological and economic transition. Victorian censoriousness was still grappling with post-Reformation libertinism while the Industrial Revolution was encroaching upon and modernising the rural world. Tess is a heroine caught in the crossfire of warring moralities. Winterbottom deftly reinterprets the character as Trishna (Freda Pinto), a teenager from a poor family, who is torn between the traditional values of her homeland in rural Rajasthan and the social and sexual liberation she later finds in Mumbai.<br><br>Winterbottom has stated that he chose India because it currently bears similar ideological divides to those of nineteenth century Britain, but he in fact paints a more complex and modern picture. Far from being the 'pure woman' of Hardy's novel, whose downfall took place in spite of her moral rectitude, Trishna is a conflicted character who is grounded in the old world but drawn to the bright lights of the new.<br><br>In place of the pious Angel Clare, who Tess falls in love with, and the rakish Alec d'Urberville, who robs her of her virtue, we are given Jay Singh (Riz Ahmed), a conflation of both characters. A British-born rich kid, he comes to Rajasthan to work for his father's chain of hotels and takes a shine to Trishna. The two begin to fall in love, but he unwittingly leads her to disgrace herself by succumbing to his advances. Growing tired of hiding their relationship, he suggests they leave for Mumbai, where they can live together, free from scorn.<br><br>Although perhaps a little insensitive, Jay is every bit the honest and loving Angel Clare of the narrative, until a return to Rajasthan leads his darker, d'Urbevillian side to show itself. Managing one of his father's hotels, a former harem, he revels in subordinating Trishna to his depraved appetites, until she is forced to take revenge.<br><br>Unlike Hardy's novel of black-and-white morality embodied by wholesome heroines and seedy villains, these modernised characters have internalised these conflicts. Winterbottom's adaptation insists upon its modern setting, and refuses to impose Hardy's hundred-year-old dynamic onto it. Trishna's downfall isn't a journey from honour to disgrace, but a process by which she is isolated between two different notions of piety, and taken advantage of by her malevolent lover. Not only does this prevent Winterbottom from casting aspersions on traditional or indeed modern values, it also makes for a far more convincing appropriation of the novel.<br><br>Although Winterbottom is given a writing credit, the script was apparently little more than a set of vague outlines from which the actors were expected to improvise the dialogue. Luckily, the leads are more than up to the task, and their off-the-cuff performances lend well to portraying a tentative courtship between two different cultures. The early scenes in which Jay has to overcome the language barrier to get Trishna's attention are a naturalistic joy, yet even as things take a more dramatic turn, Pinto and particularly Ahmed remain startlingly believable.<br><br>Their improvised riffs help to cast the characters into entirely different moulds, while the embrace of the Indian aesthetic allows the setting to stake new ground within the story as well. Whether Winterbottom is diving head first into the throng of the city or nestling the camera in the rugged hills of the countryside, his loose and intuitive style takes each locale as it is, capturing it with intelligence and warmth. The soundtrack, featuring a selection of original Bollywood numbers, bounces off the visuals wonderfully, whilst the incorporation of an on-screen translation of the Hindi lyrics proves a novel and expressive addition. Rather than treating India as a mere stand-in for old-world England, Winterbottom attends to it dutifully, helping to create the film's distinctive flavour.<br><br>Whether you've read Tess or not, love a good adaptation or usually find them cosy, generic tripe, there's plenty to enjoy with Trishna. Instead of just guising an old story in contemporary garb, Winterbottom truly reinterprets it and in doing so finds resonance with a modern audience. Most impressively, it is an adaptation that stands firmly on its own two feet, and graces us with some inimitable and elegant performances.","user":"intern-88","rank":[22,27]},{"title":"Something completely different","rating":8,"date":"14 September 2011","review":"I was lucky enough to attend the world premiere of Trishna at the  Toronto International Film Festival. Here is what I thought of it:  The story is based on one of the most celebrated pieces of literature  of all time, Thomas Hardy's \"Tess of the d'Ubervilles\". Director  Michael Winterbottom takes this classic tale and adapts it for modern  audiences by changing the setting to contemporary India. Does this  work? Surprisingly, it does, and this is coming from someone who hasn't  ever read the novel nor seen the 1979 Academy Award winning film  adaptation from Roman Polanski, \"Tess\".  The titular character, Trishna (Freida Pinto), is a humble, soft-spoken  young woman and the eldest daughter of a poor, rural, Indian family.  While working at a nearby resort to help pay the bills, she is swept  off her feet by a young British businessman, Jay (Riz Ahmed), who finds  himself in India to manage a hotel at the request of his father, a  wealthy property developer. When Trishna's father is severely injured  in an automobile accident, Jay asks her to work for him, and she shyly  accepts. Their feelings for each other grow the more they spend time  together. However, Trishna isn't easily torn away from her beloved  family nor her traditional life nor her ambition as a dancer, and she's  in for some drastic changes when she moves to Mumbai with her lover.  To be honest, I really didn't know what to expect from this film. I  entered the theatre only knowing two things about it: (1) the story is  based on a classic novel and (2) it's set against an Indian backdrop.  Never would I have guessed-- even at an hour and a half into the film--  that this simple premise would progressively turn into something a lot  more shocking, to say the least (the last 10 minutes made the whole  audience gasp simultaneously).  This is a unique kind of cinema that really transgresses the boundaries  of conventional filmmaking with the way it develops a seemingly simple  story and with the many reactions it gets out of the audience as it  unfolds. I guess you could call the film a little deceiving, because it  never goes in the direction you imagine it would go. But I'm not  suggesting that there's a plot twist at the end, so please don't go  expecting that.  What makes the ending so shocking, then? It's all due to the gradual,  subtle buildup that does a great job developing the characters of  Trishna and Jay as their relationship becomes increasingly odd and  discomforting for the viewer. I don't know if I was alone here, but as  I was watching the film, I was kind of going through what Trishna had  to go through-- emotionally, of course. I believe this confirms that  Freida Pinto still has what it takes to deliver a solid performance  since her \"Slumdog Millionaire\" fame. The acting isn't anything amazing  or noteworthy, but there's no denying that she does a good job in her  role, despite being a little inconsistent in some scenes of dialogue  between her and Riz Ahmed, the male co-star who plays Jay. He was  surprisingly decent for a relatively unknown industry newcomer, but--  once again-- nothing extraordinary.  To be honest, if it weren't for this ending, the film's many flaws  would be significantly more distinctive and visible for me. I just  can't get over how well everything is tied together in the last few  scenes. This is where Michael Winterbottom finally achieves in putting  his point across; in making sense out of the film as a cohesive whole.  Apart from the unique structure and progression of the story, \"Trishna\"  has many other memorable elements. I was particularly blown away by the  beautiful, on-location shots and nearly candid cinematography that gave  us a very realistic perception of life in India, and the  clearly-defined division between both social classes. I loved how a  great deal of non- actors were used in the production of the film (for  instance, Freida Pinto claimed that her character's family was in fact  a real family in rural India who cooperated with the crew).  Throughout the entire film, there's so much absorbing beauty in all the  outside locations in India that you won't believe your eyes! For the  mere fact that what you're seeing in the background is completely real,  you should be as blown away as I was while watching the film! It's  breathtaking! This exquisite imagery is backed up by a powerful  original score from Mike Galasso that complements the Indian  countryside and the Mumbai cityscape without ever sounding too  traditional or foreign. Music plays a key role in enhancing the emotion  of this particular film.  Despite all of these admirable aspects, this film is far from being  perfect (though the concept of perfection is, in itself, flawed). I  still question the pertinence of certain scenes in the film, as well as  the strength of the narrative structure. Will \"Trishna\" stand the test  of time? Will it live up to its original power upon multiple viewings?  I'm inclined to say \"no\" to both of these questions, despite being very  affected by this piece of cinema. It was clear that most of the  audience wasn't very impressed by such avant-garde cinema, but I'm sure  I wasn't the only one who admired it in so many ways. To me, this film  feels like a one-time experience; an interesting artistic vision  capable of marking you and staying with you for some time.  So, go ahead! Whenever you get the chance to see this film, I say \"go  for it!\". It's something refreshingly unconventional that you might  find yourself drawn by for the same reasons as me! I recommend seeing  \"Trishna\" because of its ultimately shocking, thought-provoking nature.  Come on! You have nothing to lose! (Except a small sum of money,  perhaps.)","user":"Copyright1994","rank":[23,34]}]