[{"title":"Sincere and enjoyable feel good movie","rating":8,"date":"22 June 2012","review":"When a man puts a classified ad in the newspaper asking for a companion to time travel with him, a magazine writer and two interns go find him to find out his story. Aubrey Plaza plays Darius, one of the interns who at first seems pretty disinterested in the whole situation, ends up being the one who has to pretend like she wants to time travel. She expects to be working with a total nutjob, completely off his rocker, but instead she finds that Kenneth, the man who put the ad in the paper, is actually an incredible insightful, sweet, and softhearted person and that time traveling is more a facade for finding yourself and it's more of a metaphor for fixing old mistakes. It's a surprisingly touching film that has a lot more to offer than one might have expected.<br><br>Great dramadies are few and far between these days. They are usually too unfocused, can't find that perfect balance between comedy and drama, and try too hard to be profound when it comes to taking a look at the human condition. Safety Not Guaranteed finds a way past all these things. It has a clear and poignant focus that drives a heartfelt and oddly moving story. It's a great blend of comedy and drama as it tells a great story on a very human level, but also delivers its own pleasant brand of comedy. It's more clever comedy than laugh out loud comedy, but it fits just right for what this movie is trying to accomplish.<br><br>Safety Not Guaranteed could have easily been a sham and it could have gone too far overboard on its profundities. Instead, the excellent script keeps itself at bay and manages to tell a story that is more sincere than one would expect and feels more real than a dramady that is trying to be the most realistic of human stories. There's nothing here that will floor you or blow you out of the water, but it truly is a lovely and heartwarming story.<br><br>Normally feel good movies aren't my thing, but Safety Not Guaranteed is sincere enough and of a quality that makes it an absolute joy to watch. That being said, I don't know that I'd watch it again, and I wouldn't call it a masterpiece, but it's great for one viewing and it's an hour and a half well spent. I would certainly recommend it to anyone with a heart.","user":"KnightsofNi11","rank":[158,191]},{"title":"Safety Not Guaranteed...3 out of 4 Skittles","rating":8,"date":"6 September 2012","review":"LOGLINE: Mark Duplass (Puffy Chair &amp; Humpday) plays Kenneth, the local small town weirdo who bags groceries and places a classified ad seeking a companion for time travel. Aubrey Plaza (Parks and Recreation &amp; Funny People) plays Darius, an intern sent in on assignment with her co-workers (Jake M. Johnson &amp; Karan Soni) to secretly pose as potential time travel candidates and get the scoop for the entertainment magazine.<br><br>Obviously the guy is an insane wack-jobor is he? As Darius gets in closer with Kenneth and slowly finds out more and more about him, she isn't so sure anymore. Can this guy actually do what he claims, or is he so far off his rocker that he has lost all sight of reality? Writer Derek Connolly weaves in and out the possibilities of what is true and keeps the audience guessing until the film's final second payoff.<br><br>Actors Duplass and Plaza are so great radiating weirdness off of each other. The two form an unusual friendship that rings true in every detail. Jake M. Johnson (New Girl) and Karan Soni add several laughs to the bizarreyet hilarious story. The film had many chances to lose sight of believability, but finds a way to stay on course.<br><br>The film's ending left me torn. No matter if you are the kind of person rooting for Kenneth to be vindicated, or believe he is crazy all alongthe story keeps you hooked until the credits roll. Safety Not Guaranteed was a breakout hit from the Sundance Film Festival, and contains the spirit of what independent films strive to be. It's authentic, creative, unusual, and a breath of fresh air. It's fun to see what independent filmmakers come up with when they aren't restrained by the annoyance of making every viewer happy. If you are up for something differentdo yourself a favor and see this one.<br><br>For more quick reviews check out www.FilmStallion.com","user":"FilmStallion","rank":[93,115]},{"title":"Why I keep watching Indie films, is for the few Gems like this.","rating":7,"date":"4 September 2016","review":"Very slow, but its worth it. Great ending, but the last words of the ending could have been better. These two things helped bring the film down a couple notches. Plus it also didn't stay true to the ad in the paper, which had inspired this story-line. Add in a small plot hole near the end, and a 9 of 10 movie becomes a 7 of 10. But they can be forgiven for these small sins. You've got to give credit to the producers who made this on a 4 thousand dollar budget, and made 4 million out of it. Who am I to nit-pick that kind of success? It's these kind of shoestring budget movies, few as they are in this quality, that makes Hollywood look like an idiots playground. Even with its problems, its well worth the watch, based upon the total package of being a sci-fi love story that works. This came out in 2012, near the same time as \"The Adjustment Bureau\" film. Sadly, these two didn't start a trend. Like all good films, it makes you think, after the final credits roll. I myself have always said, that regrets are for people with time machines. After all, we were who we were back then. But I'm also a sucker for a good film, or even just a good love story, that tries to answer those regrets.","user":"alanpgini","rank":[14,15]}]