[{"title":"Jacob -","rating":5,"date":"11 May 2012","review":"I do not write reviews or rate movies generally, but my family saw this at Texas Frightmare and the director said during the Q&amp;A after the film to rate it here if we liked it, so, this is my first and here goes. I liked the movie overall. It was another slasher film like many before it. Nothing new, but it was entertaining. The kills were effective and I enjoyed most of the movie. The little girl actress Grace Powell did a really fine job. Without saying too much here, she really had a few people in tears. I didn't like that we were expecting to see Michael Biehn, James Hampton, and Parrish Randall more and they were not in the movie enough. We've been big fans of Michael Biehn for years. James Hampton we've loved since forever. He is a solid actor who is also a nice guy that we've met before at the convention. Parrish Randall is the guy to have in a Texas horror film and he is another really solid actor. This is my only issue with the movie. Maybe those actors could not do more time in the film. The scenes they had were really good and just made me wish there was more of those guys. Some of the other acting was kind of just okay and what you will see in this kind of film more times than not. I liked that there was not a lot of profanity and nudity in the film. My son is 12 and likes horror films but sometimes the language and sex in a film make it a tough call for parents, so it was good to see a horror film that he could watch without me or his mom having to have concerns there. The Jacob character was really a good one for this kind of horror movie though. He had that larger than life force and power that a killer in this type of movie should have and he was more than scary enough. Overall, yes it was another slasher film, could have been better, but it was still fun to see. I give Jacob a 5 for what it did bring though and I am glad they showed it at the convention.","user":"bill-blane","rank":[12,16]},{"title":"An Accidental Comedy","rating":2,"date":"8 July 2013","review":"I saw this crud last night on Netflix last night and developed intense nausea for the next 12 hours. Seriously, what the heck were the director and editors thinking? The whole movie screamed KMart budget starring the people of Walmart Cast. The acting was downright insulting and often times hilarious with over-exaggerated facial expressions and deadpan deliveries. If that wasn't bad enough the voice overs were off as if the whole movie had been dubbed and dubbed horribly, it was very distracting and just echoed the lack of acting talent the cast possessed aside from Sissy and perhaps the Sheriff. I've seen better acting at 1st grade school plays, the acting was seriously that terrible along with the uninspired dialogue between the characters. Perhaps the budget went more toward the makeup and blood splatter which was a bit better than I was expecting considering how cheap and amateurish everything else was. The plot.........*sigh* Jacob gets mad, Jacob hurts people....something about demons thrown in (it wasn't explained well at all and made absolutely no sense), comedic violence ensues....FIN. Please save yourself the pain and agony this movie will cause, avoid it like the plague.","user":"NYAmicas","rank":[9,14]},{"title":"A little disappointed, not what I expected from the best in town","rating":3,"date":"3 January 2012","review":"I guess I'm not on the local bandwagon in Houston. The movie had its good moments and a lot of bad. First off, the writing for the film was shallow, filled with parts of never ending dialog which slowed the delivery. The elements of the real story never surfaced on screen &amp; I was left to hope that the violence would pick things up, which it did. Some of the actors in the film made me think, 'why was that person even in the film?' Many of the actors brought to the film lacked any real acting talent to give substance to undeveloped characters. There were parts in the film where the lighting was just plane awful. Another thing was the sound, it was not there when it needed to be.<br><br>If the movie was presented as a rough cut, then why was it released? The heart of this film could make it a local masterpiece? Surely, there are other ways to fund and promote this film project. This film is far from perfect and perhaps far from the solid leadership required to present a completed film to it's local fan base. The producers in charge of marketing and presenting this film failed to bring a real winner to Houston after all of it's hype. I surely hope this film has mild success in it's distribution.","user":"growler2022022","rank":[15,27]}]