[{"title":"Not as advertised 2/10","rating":2,"date":"12 January 2014","review":"Lords Of London (2014)<br><br>Plot: Unconventional British gangster movie directed by Antonio Simoncini. London gangster Tony Lord (Glen Murphy) is forced to reflect on his past misdeeds when he is transported back to 1950s Italy, where his mother and father originally met and fell in love. Knowing the damaging nature of his father (Christopher Hatherall)'s future wrongdoings, Tony takes the opportunity to stop his mother (Serena Iansiti) from leaving Italy with him and changes the course of history as a result...<br><br>Review: It really gets on my nerves when people put a picture on poster to promote a movie, which has totally nothing to do with the film. Ray Winstone is only in a couple of scenes, and he doesn't hold a gun in none of them. Also the whole film is set in Italy so I don't know why they changed the title from Lost in Italy, which was more appropriate, to Lords Of London. Anyway, I found the movie to be quite boring and sketchy. It's one of those films which go back and forth in time, which I hate, and it doesn't really make much sense. After watching the guy wall around the town over and over again, without anyone actually noticing him, I just got bored of the whole thing and I lost interest. The storyline needed a lot more work, but the actors weren't that bad. Personally I thought that the film was a massive disappointment and I was totally misled by the poster.<br><br>Round-Up: Ray Winstone is really good when he is playing the old swearing, angry, cockney gangster roles, but he was wasted in this movie. He should have played the lead. I liked the old Italian guy, who brought some light to the movie, but the storyline was appalling. I think that I'm right by thinking that the main character was in limbo, but I don't know why the director had to make the whole think so complicated. If he was trying to be clever with the storyline, then he done a really bad job. Anyway, that aside, the music seemed like it was done on someone's phone, which does start to become a bit tedious whilst watching the film, and the ending could have explained what the hell was you watching the last hour and a half.<br><br>Budget: $3.4million Worldwide Gross: N/A<br><br>I recommend this movie to people who are into there flashback and forth type of movies about a guy who wakes up in Italy. 2/10","user":"leonblackwood","rank":[62,77]},{"title":"Terrible movie","rating":1,"date":"15 January 2014","review":"Wow. This was one of the worst movies I've ever seen. Basically you figure out the whole story within the first 10 minutes of the movie (not kidding) and then spend the rest of this 90 minute snooze fest waiting for the main character to figure it out as well. <br><br>Main characters that behave unbelievably stupid and take painfully long to figure out the obvious are nothing new, but this one might seriously be a contender for worst of all time. To add insult to injury, the director probably thinks his audience is equally retarded, as the same hints at the big mystic truth get repeated over and over again in more and more obvious fashion until even a braindead monkey would understand what its all about. Since that is basically the whole film, you are looking at 90 minutes of countless repetitions of the same scenes in minor variations.<br><br>This wouldn't be as bad as it is, if these scenes weren't completely boring and meaningless once there is no mystery left which they help to uncover (which again, you basically have it all figured out 10 minutes into the movie, guaranteed!) I really wonder how this could win awards. Also this has not much to do with a Gangster film, the title poster is VERY misleading. This is my first review, I actually made an account just to warn people of this extremely bad movie.","user":"luiser-898-616536","rank":[19,25]},{"title":"Doesn't do what it says on the tin","rating":1,"date":"19 January 2014","review":"Totally misleading title and description.If,like me,you see Ray Winstone and like the sound of the title do yourself a huge favour and steer well clear of this movie.It thinks it's very clever but it's far from it.Actually now that I'm sitting here about to describe how bad it is,words fail me so I'm going to recommend that you watch it then you can share my pain.It's about 90 minutes of your life that you will never ever,ever get back.The acting I can't fault and the setting is lovely but nothing can save this movie.Slow and boringly paced,lack of direction,decent idea but badly executed.I could go on but I have stuff to do for the next couple of days.","user":"jonny-666","rank":[16,23]}]