[{"title":"A Complete Embarrassment","rating":4,"date":"9 August 2013","review":"If you haven't read the books, the review is not for you. This movie is enjoyable and entertaining for an action movie, and there are funny parts as well as suspenseful parts. If you have read the books, however, here you go. I'm just going to cut straight to the point here - this movie was a joke. From the acting to the attempt to bring Rick Riordan's world to life, everything was wrong. So wrong, in fact, that after the movie finished I sat there in stunned silence thinking, \"That's it?\". I didn't go in this movie with high expectations since the first movie was such a disaster. However, I thought that since Annabeth's hair was blonde and the trailer looked promising, this movie would be at least better than the first one. I was wrong. Let's just start with the actors; the only two that impressed me with their performances were Leven Rambin as Clarisse and Stanley Tucci as Mr. D. Even though Leven didn't look the part, her sarcasm and fieriness matched the Clarisse in the books. Mr. D was perfect, I only wish he had been in the first movie. The rest of the actors were either horrible or just mediocre. Logan Lerman was a bore as Percy, barely able to be the witty smart-aleck from the books. Brandon T. Jackson was simply a comedic relief and nothing else. I saw none of Grover's personality in him. Douglas Smith, while a good actor by himself, didn't play the Tyson I imagined. He was smart, spoke clearly, and was even attractive with two eyes. Come on Thor Freudenthal, can you cast anyone who isn't remotely good-looking? The worst was Alexandria Daddadrio. She conveyed no emotion, her lines were monotone, and the way she played the damsel-in-distress, Percy-obsessed girl was so unnatural. Since when is Annabeth the one who needs saving? Anyways, I know that book-to-movie adaptations are incredibly hard to cast, so pushing aside the disappointments with that, lets just go to the storyline. The beginning was good. I thought it was sensible, for time's sake, to cut out the whole dodge ball game at the beginning of the book and introduce Tyson in another way. The flashback to the original trio was good, the bull fight was just how I imagined it, but Grover shouldn't have been there. He should've been already away, looking for Pan. I don't understand why they had to have him in camp; this was honestly such a simple thing they could've done to please the fans. Chiron's exile from the camp was also a simple touch they could've added. Once they go on the quest however, everything turns into a big mess. Grover getting captured by Luke? Finding Clarisse in the stomach of Scylla? All of a sudden, Clarisse is agreeing with everything Percy says? Then, the most disappointing part of all, the entire Circe's island scene was skipped along with the siren scene, which was a major development point for Percy and Annabeth's relationship (but I guess they don't need any development since they had them almost kissing at the end of The Lightning Thief). The dramatic and highly unnecessary amusement park scenes with Luke were so ridiculous they had me laughing. Why did Kronos come out in his full form, and why on Earth was Percy able to defeat him with a simple slash of his sword? That made no sense at all and I'm sure that even non-book readers would be confused at how a sword, even a \"cursed sword\" could immediately defeat the most powerful Titan with one cut. Also, has nobody realized that the Iris message has been completely ignored in this movie and the previous? Why leave out a form of communication so vital to the books? Lastly, something that wasn't necessary but would've added a lot more comedy to the movie than Grover's lame one-liner's were the \"party ponies\" who rescue Percy at the end. The reviving of Thalia was well done, although I don't understand Clarisse and Percy's sudden bonding. In the books, those two hate each other for all five books, and I can never remember them exchanging a smile or an understanding nod. In conclusion, I felt almost as though the director was trying to stray as far as the book as possible. Why couldn't they have curled Annabeth's hair, had Tyson have slow and slurred speech, added the search for Pan to the story, and so many other little things that may have made up for the scene skipping and melodramatic almost- deaths. If you love the books, I say stay as far away from this movie as possible, unless you want to go home with a yearn to reread the entire series just to remind yourself of the characters and story and get the awful portrayal out of your mind. That's all I have to say.","user":"hastebahar","rank":[80,112]},{"title":"A perfect recipe for a terrible movie","rating":3,"date":"10 August 2013","review":"I just watched this movie earlier, and I did go into the movie screen expecting not a lot as I hated the first one.<br><br>*NON-SPOILER* The first thing I noticed in the movie was the terrible CGI, that stuck out like a sore thumb among the background. And the next thing I noticed was the mediocre acting, worsened by the dozens of cheesy, humorless and cheesy one-liners throughout the movie.<br><br>*SPOILER* The story was downright predictable also, as it ended as most generic action/adventure movies ended, the bad guy releasing they had done bad and the main character killing the main baddie.<br><br>*NON-SPOILER* The only good thing in this movie I could think about was the locations the characters found themselves in. The locations ranged from cities, to woods to the middle of the ocean.<br><br>The main character, Percy Jackson is supposed to be the half-blood son of Poseidon (a water god) and barely uses water AT ALL throughout the movie to his advantage. *SPOILER* And an even particularly silly scene where they are about to be swallowed by a large water monster thing, the water powers Percy has don't actually 'work'.<br><br>All in all, this movie is a complete waste of money, complete with cheesy one-liners, boring story, tedious acting and just an all-over negative viewing experience.<br><br>3/10","user":"cawleyjack73","rank":[53,77]},{"title":"Nope, Nope, Nope.","rating":1,"date":"28 August 2013","review":"Just for the record, I have read all the books multiple times and I understand that the movie won't follow the book completely.<br><br>But they could at least follow the story line a bit more.<br><br>So, the beginning of the movie starts out at camp. I actually didn't mind the very, very beginning of the movie. I thought it was fun. It all went downhill from there.<br><br>The next few scenes slightly follow the book in a way that it is good enough to pass.<br><br>Then you get to the oracle where Percy learns his destiny. THEY DIDN'T EVEN FOLLOW THE MYTHOLOGY! They said that Cronos swallowed all of his kids EXCEPT Zeus, Poseidon, and Hades. Then they chopped him up. Those who don't know, he swallows all of his kids except Zeus who is taken away until he's old enough to trick his father into throwing up all of his kids and they - depending on the version - castrate, or chop up their father.<br><br>They then proceeded that at the demigod's 20th birthday (I can't complain too much, Logan Lerman can't pass as a thirteen year old) he shall either save or destroy Olympus.<br><br>Setting out on the quest, to save Thalia's tree, with Annabeth, Tyson AND Grover, who we know is in Polyphemus' lair, stalling their marriage. Grover is kidnapped and sent to Polyphemus who we later see, slightly following the book, dressed as a woman, pretending to be a maid. <br><br>They don't know where Luke is, who is the one who captured Grover, so they go to see his Dad, Hermes, at the Demigod post office.<br><br>They learn he's on a boat, they leave, find the boat, and they're stuck. When they do escape, they go into the sea of monsters and get swallowed by the first monster they come by in the book. Meeting Clarisse down there. They escape together and finally get to an island.<br><br>In the book, Polyphemus lives on a nice island that has green grass and is completely healthy, thanks to the fleece. You've got the flesh-eating sheep and all that jazz. <br><br>In the movie, they get to the island that is an abandoned amusement park. They go down this roller coaster for a few seconds until they get stopped by rocks, which marks the entrance to Polyphemus' lair. <br><br>Fast forward, they have the fleece, and locked Polyphemus into he lair with a boulder. They meet Luke and his men, including Selena Beauregard (I might not have spelt that right) who practically saves the day in the fifth book, and they shoot Tyson who falls into a chasm. <br><br>Finally, they're tied up and Luke uses the fleece to revive Cronos. He succeeds and Cronos swallows Luke and Grover. <br><br>Percy's blade saves the day and they put Cronos back in the coffin. Grover is back and Luke is thrown into Polyphemus' cave where we assume he's eaten.<br><br>Annabeth is stabbed and she dies. Then is revived by the fleece. Tyson is back and they head back where the camp is waiting.<br><br>The rest makes sense, they go back to normal life, but alas, Thalia has been healed and is back.<br><br>I hope to god they don't make another movie. There isn't a way for them to make another one and still have the same outcome that they have in the book unless they do some crazy thing that barely passes for OK. I don't know what Rick Riordan was thinking when he helped - if he helped - with the making of this movie. <br><br>DO NOT SEE IT IF YOU HAVE READ THE BOOK. It's a waste of money and time.","user":"abes3933","rank":[21,29]}]