[{"title":"There and back again... A nasty, nasty flick...","rating":6,"date":"8 August 2015","review":"\"The Toolbox Murders 2\" has an interesting history. A sequel to Tobe Hooper's remake of the grind-house classic, I'm not sure the film ever got a formal release. It did get a digital release on Amazon (which I own!) and was a sleazy, incredibly gory, horrific work about a woman who gets kidnapped and abused by the killer from the first flick. Somehow, the director got Brian Krause and Bruce Dern (!!) to make appearances, and Dern's is actually more than just an extended cameo!!<br><br>Apparently, the film's reception wasn't good (not surprising) so it was pulled back, re-cut, new scenes added, and rechristened \"Coffin Baby\" after the nickname of the murderer. \"Coffin Baby\" had most of the graphic violence cut out and made a major change in plot -- our main victim was no longer a totally innocent woman but someone who committed a horrific crime and \"Coffin Baby\" had become sort of an \"avenging angel.\"<br><br>Now we finally have the official release of the film. Released on DVD and Blu-Ray under it's original title, \"Toolbox Murders 2\" is the original cut that I had seen long ago. And folks, this is a nasty piece of work.<br><br>The \"plot\" is simple. At the start of the film, the killer (dubbed \"TBK\" in the credits) carves up a woman in her house. The woman's sister Samantha goes to the crime scene, and while waiting in a police car to be taken to the station to give a statement, TBK grabs her and takes her back to his house of horrors.<br><br>And horrors it is. For the next 80 minutes or so, Samantha is starved, tortured, forced to watch as TBK murders and mutilates a jaw- dropping amount of victims. He also cooks and eats some of his victims. We see every thing in graphic detail, including watching poor Samantha start to lose her mind as she desperately tries to escape.<br><br>And that, friends and readers, is the entire film. As bleak and reprehensible as the film is, it's carried by the extreme gore and the performance of Chauntal Lewis as Samantha (Chauntel lost her hand in an accident a year or two prior to this film, see if you can notice!). <br><br>Overall, I think most people will find this film unwatchable so it's hard to totally recommend it. But if you want to see the bleak side of extreme horror, check it out.","user":"stsinger","rank":[7,7]},{"title":"Only if you like special effects......","rating":3,"date":"2 April 2013","review":"1. For Cinematography. 2. For great body parts. 3. For Bruce Dern.<br><br>Anything else you can add....please do. I like watching movies. I like Horror, Sci-Fi and the unspecified Weird Stuff. I will watch a movie just because someone put a story (I hope) into film.<br><br>With all that being said....I can't say much else for Coffin Baby. The plot or the title got lost somewhere. To contradict myself....there is a plot. But it is so basic it will inevitably put one to sleep. The victim needs something....can't put my finger on it....oh yes, I have no fingers. Don't get me wrong...I love weird, but this is not that kind of movie. The shades of gray are a good touch. But then early on into the movie one realizes that shades of gray and another body is all one is going to get. I can't possibly spoil the movie with this review. You will have to watch and see for yourself. I've seen bad movies. If you're like me...you will sit down and watch it just to say you did it. That will be the end of the story.<br><br>Bruce Dern is Bruce Dern...he can't play a bad role. I just like the guy because he creeps me out just being on film. I seem to be the first to review Coffin Baby. Looking forward to jumping back from time to time and see who watches the film and who comments....and what they say. Please don't hesitate to jump in here. Hmmmmmm...finger lickin' good......Q(:-}","user":"twomainiacs","rank":[22,34]},{"title":"strong on gore weak on story","rating":5,"date":"14 September 2015","review":"I just came across this flick because it's second title was The Toolbox Murders 2. Do I need to say more? Linking this flick onto the 1978 classic...Sure, he do uses a toolbox but that's the only link so you can guess what I'l going to to write about this little stinker.<br><br>The flick never got my attention for the story itself because it's full of plot holes but why I never pushed the eject button was the gore added. If you do like extreme gore then this is a must see because it's rather explicit and gorehounds will love it. <br><br>If someone can explain why the story involved the Black Dahlia murders then I will be happy to listen. The \"coffin baby\" itself is a bit weird too. Towards the story they are trying to give the victim the Stockholm Syndrome but somehow it didn't work because she do wants to escape naturally. She do gets used by all the horror done in the cellar but still...her face never got dirty...<br><br>And then there's of course Bruce Dern. It takes over an hour before he comes in doing what he does best, looking scary. <br><br>Gorehounds, don't hesitate and go for it but if you like strong stories forget it.<br><br>Gore 5/5 Nudity 0/5 Effects 4/5 Story 1/5 Comedy 0/5","user":"trashgang","rank":[3,3]}]