[{"title":"The perfect blend between character-driven drama and fun, edge-of-your-seat spectacle!","rating":11,"date":"11 May 2014","review":"I must admit, the trailers didn't have me convinced - and after the sour taste 'Jack the Giant Slayer' left in my mouth, I was sceptic. I really dug Matthew Vaughn's approach with 'First Class' (who had a tough task rebooting the franchise after the lacklustre 'Last Stand' and the generic, dull 'X-Men Origins: Wolverine') and I wouldn't have minded him returning at all. But as it turns out, Bryan Singer (yes, I dare speak his name) still has a few tricks up his sleeve. For its sheer scale and epic storytelling alone, 'Days of Future Past' is fantastic.<br><br>It's a shame there's so much controversy surrounding this film, but I guess whoever chooses to deprive himself willingly of such a pleasure must be fully aware that he does so at his own expense. Because this is the kind of film that made me fall in love with movies in the first place.<br><br>Yet (despite my 10-star review), it's not perfect. And it's not 'The Usual Suspects' with mutants - how could it be; this is simply not that kind of film. But I have to say that pretty much my only gripe with this movie is that it has too many characters and that some of them don't get enough screen time (or actually, there's not too many characters: there's just too many great actors playing those characters – but then again, that's half of the fun). Of all the X-men films, this has the most complex plot – and also the most interesting. Different time-lines are tricky to do and can be rather hard to follow, but thanks to a (very!) clever script with a great part for Logan, we never get lost. And that's the best news: sorely missed in the last instalment (except for a hilarious cameo), the franchise has Hugh Jackman back. And of him at least we do get to see a lot, since he really leads us through this film (giving his best Wolverine performance yet along the way). If Logan can be called the heart of the X-men, then Charles Xavier must be the mind while Magneto and Mystique provide the - slightly twisted - soul, and seeing them all together again brought a broad, stupid grin to my face (which only got broader whenever Quicksilver appeared on screen - for reasons you will have to find out for yourselves). <br><br>What really sets the X-men films apart from the ever more derivative comic-book adaptations – at least as far as I'm concerned – is that I always genuinely cared for the characters, and 'Days of Future Past' is no exception. I love loud, spectacular action movies as much as the next guy, but if I don't get to care for the protagonists – what's the point? The reason I gave this 10 stars, and what is so exceptional these days, is that what we get here is a complex, smart Fantasy/Sci-Fi thrill-ride that respects its origins as much as it embraces the future, while never - ever - forgetting that its first job is to entertain the audience. For finding that perfect, rare balance between character-driven human drama and no-holds-barred popcorn action spectacle, 'Days of Future Past' deserves my 10-star rating (which is a first for me: I've never given 10-stars to a comic-book movie).<br><br>So my verdict: If you like to get your minds blown by something with true heart and soul, this massive 'mutant' of a film is upon you, and all you have to do is give in to the X-citement. Enjoy the ride.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/","user":"gogoschka-1","rank":[458,611]},{"title":"X-Men","rating":9,"date":"12 February 2020","review":"Seamlessly blending old and new elements of the franchise together in one delightful package, X-Men: Days of Future Past combines emotional drama, exhilarating action, and surprising humor to create a wholly satisfying experience that ranks among the finest in the franchise.","user":"MR_Heraclius","rank":[41,49]},{"title":"A stunning achievement – a blockbuster movie packed with at least as much heart as spectacle.","rating":9,"date":"16 May 2014","review":"With its mind-boggling premise and jaw-dropping cast, X-Men: Days Of Future Past blasts into cinemas bearing the weight of great expectations. Surely this mash-up of X-Men past and future has the potential to be the best superhero blockbuster our world will ever see? Well, yes and no.<br><br>To be strictly objective, Days Of Future Past can occasionally come off as a little too earnest, its enormous cast of characters getting somewhat lost in the grinding of its narrative gears. But, when it works (which is most of the time), Days Of Future Past comes pretty darn close to nerdvana – this is a smart, rich film that effectively mines its source material (both the movies and Chris Claremont's classic 1981 storyline in the comic books) and its incredible cast for emotion, power and depth.<br><br>Flash forward to the bleakest of futures. X-Men we have known – led by perennial frenemies Professor Charles Xavier (Patrick Stewart) and Erik Lensherr/Magneto (Ian McKellen) – are being hunted mercilessly by a horde of intelligent, death-mongering robots known as Sentinels. With little hope for survival, the desperate X-Men decide to send Wolverine (Hugh Jackman) back in time to the 1970s. There, he must find the younger Charles (James McAvoy) and Erik (Michael Fassbender) – several years estranged after the traumatic events of X-Men: First Class – and get them to change the future before it can happen.<br><br>Sounds simple enough? Not really. Days Of Future Past frequently threatens to fall foul of its complicated puzzle-box of a narrative, one that involves time travel, quantum physics and a swirling mess of characters, action and motivations. There's Dr. Bolivar Trask (Peter Dinklage), creator of the Sentinel programme, whose assassination in the past by Charles' pseudo-sister Raven (Jennifer Lawrence) brings about the dystopia of the future. There are prison breaks, astral projections, and several grisly mutant deaths. Truthfully, this incredibly ambitious mix of character, plot and spectacle could very easily go horribly wrong.<br><br>What's so impressive about director Bryan Singer's return to the franchise is how well he weaves all the disparate threads of his narrative together. This is emphatically not the Singer who gave us mediocre misfires like Superman Returns and Jack The Giant Slayer. Rather, this is the work of the Singer who made his mark with films like X1, X2 and The Usual Suspects, all of which featured a masterful blend of wit and wisdom, character and story.<br><br>In Days Of Future Past, Singer skilfully plays on the schism that opened up between Erik and Charles at the end of First Class to add welcome depths of emotion to the high stakes already in play. The deep, difficult relationship between the two men has always been the fulcrum of the series, and Singer allows it to breathe and grow. With the help of McAvoy and Fassbender (not to mention Stewart and McKellen), some of the best actors in the business, the director makes it possible to believe that resentment can give way to forgiveness, and vice versa, often in the blink of an eye. McAvoy, in particular, gives a shudderingly good performance as a man called upon to help others when he's lost his own way.<br><br>With such an enormous revolving cast of characters, Singer even manages to give many – though not all – of them their hearts and souls. (Alas, Storm/Ororo, we will never know ye!) Thrust into the unlikely role of mentor to the broken, heartsore Charles, Wolverine must find a different sort of strength and ingenuity within himself. Jackman plays the role beautifully, anchoring the two timelines with charm and gravitas. Though still something of an awkward fit for her part, Lawrence, too, plays Raven's dilemma very well, as she wavers between Charles' offer of hope and Erik's often bloody single-mindedness.<br><br>But Days Of Future Past doesn't just mire itself in the toss and tumble of its characters' emotional journeys. Singer throws in a few crackerjack action sequences, opening the film with a heart-stopping massacre that very effectively underscores the dire threat posed by the Sentinels of the future. Crucially, Singer also finds the time and space within the darkest shadows of his story to have a little fun, judiciously tossing quips and sight gags into the mix – particularly in a tour de force prison break sequence, in which the preternaturally speedy Pietro Maximoff (Evan Peters), better known to comic aficionados as Quicksilver, literally runs away with the entire show.<br><br>Make no mistake about it, this is a behemoth of a film that won't go down well with everybody. Newbies will almost certainly find themselves lost, bewildered, and perhaps even bored. Singer's tale sprawls in so many directions that, if you're not at least marginally invested in the characters, it could prove to be a trying experience.<br><br>But, for everyone else, ranging from casual fans to enthusiasts and obsessives, Singer and screenwriter Simon Kinberg have crafted something truly remarkable. Steeped in history and lore, both of the cinematic and comic-book variety, Days Of Future Past feels like a dark love letter to the spirit of that original band of mutants and the message of hope, tolerance and humanity that has always accompanied their attempts to find their place on Earth.<br><br>Most remarkably of all, Days Of Future Past practically radiates a bravery and freshness that you'd never expect from the seventh film in a blockbuster franchise. Instead of playing it safe and sound, Days Of Future Past mashes up past, present and future, sweeping up a lot of what has been taken for granted in the X-Men cinematic universe and, well, chucking it out of the proverbial window. The ending of this film truly opens up an intriguing plethora of narrative possibilities that stretch in any and all directions. On the strength of this outing, that's something to be anticipated, rather than feared.","user":"shawneofthedead","rank":[338,467]}]