[{"title":"Excellent family movie","rating":10,"date":"24 April 2015","review":"Not much to say except I'm really annoyed by the critics sometimes. This movie is solid. Has a vintage old-time feel to it. Well acted. Deals with the problems of the times (racism, bullying, war, alcoholism, death) in a dramatic, humorous and clever way.<br><br>Great story. Whole family loved it. They dealt with faith in a reasonable way. They pulled heartstrings without being saccharine. The critics are just so dead-set on hating any movie that deals with faith, especially the Christian faith. This movie soft-pedals that faith - but it definitely is a strong element.<br><br>Wholeheartedly recommend this movie to families who want to be able to go out together for a movie, and be inspired and entertained at the same time.","user":"crowfam94","rank":[119,149]},{"title":"Life Changing Messages of LITTLE BOY","rating":10,"date":"25 April 2015","review":"It is difficult to express in words the absolute beauty of this film.This movie truly grips your soul as you experience with Little Boy the meaning of relentless, mountain moving faith, the courage to face one's fears, the ugliness of bullying and racism, the power and beauty of forgiveness, and the great hardships that war brings to families. This movie had me crying one moment and laughing the next, but most of all, its impact has remained with me long after I left the theater!It has truly inspired me to never give up and to keep believing when there is no evidence to encourage me to do so. As a middle school teacher, I was blessed with the opportunity to take all of our students to see this film. It was incredible to watch the student's reactions to the film! They were cheering, laughing, and crying all throughout just as I was! Their comments after give tribute to this movie's life changing messages! I have several \"little boys\" who are often picked on for their \"fun size\" (a name they have given for their short stature), and the common reflection for each of them was \"Little people can do great things.\" and \"Size doesn't keep you from greatness\"! I am truly praising Jesus for this powerful, inspirational, film that has already blessed me, my family, and my students beyond measure! God bless you for making such a beautiful film!","user":"heaven_rd","rank":[79,109]},{"title":"Don't let the critic reviews decide on this one","rating":7,"date":"30 December 2015","review":"This isn't a perfect movie - but it's a very, very good one. I hardly ever write reviews, but after seeing the really terrible critic reviews this movie has received, I thought I owed it to any potential watchers to let you know that I believe the Metascore is very misleading.<br><br>This movie really has no fatal flaws - the story is well-built, the acting is very good (much better than I expected), and the filming is beautiful. The tone of it really gives the right feeling of the time that the movie is set. The involvement of religious themes is only objective, and is viewed from different perspectives.<br><br>The only thing I'm missing is a bit more development in a few of the supporting characters, but that didn't really take much away from the overall impression i was left with. Pretty much everything else works really well in my opinion.<br><br>So if you're considering watching it, please do! It's a beautiful movie that is guaranteed to make you smile (:","user":"rebeccadamhaug-73685","rank":[22,27]}]