[{"title":"This is a case of 'must be the cast who gave the reviews and ratings'","rating":1,"date":"25 December 2018","review":"The worst piece of junk you'll likely ever watch. It looks like it was filmed in somebody's backyard. It may be ok as an acting class exercise but to be presented to the public is a sham. You've been warned.","user":"t-unknown-one","rank":[16,20]},{"title":"My Review Of \"Tales Of Poe\" Anthology","rating":9,"date":"10 March 2015","review":"Somewhere between the mystical feel of Jean Cocteau's \"Orpheus\" and the Gothic horror of Roger Corman's \"The Tomb Of Ligeia\" sets a modern classic out of step with what is typically taken in by today's horror film.\"Tales Of Poe\" by Bart Mastronardi, and Alan Rowe Kelly calls back to the classic days of horror's love affair with Gothic horror as a genre. The film is a fantastically macabre exploration into the iconic works of Edger Alan Poe, from a modern perspective that pays homage to the Father of modern horror. The film contains Poe's three, more recognizable, stories of the macabre starting with the chilling tale \"The Tell Tale Heart\".<br><br>In Mastronardi and Kelly's retelling, the story takes on a true scary story personality that steps into a methodical tempo of dark story telling. There is an element of 'AHS: Asylum\" and \"Tales From The Crypt\" that puts the horror in the head of a psychotic admitted into a Psychiatric Hospital for women. I have to say that I liked the more visceral, tactile perspective that goes for shock and thrills of a good scary story. \"The Tell Tale Heart\" classic themes still reside in this revision, only they exist only to give reference, not point. Mastronardi and Kelly have their own interpretation that is chilling, and intense in a very unique way.<br><br>The second in the anthology is Poe's The Cask of Amontillado as told in \"The Cask\". This short continues on that tempo reminiscent of the Gothic style, but without a doubt there is an atmosphere of murder mystery theatre. The actual style chosen by the directors differ greatly from the style shown in \"The Tell Tale Heart\". Here there is a more contemporary noir feel that pulls you into the story. \"The Cask\" is a bit of a melodrama that swims in the macabre, but in this retelling of the story the horror short carries a more recognizable value found to be in the vein of \"Tales From The Crypt\".<br><br>The final tale told in \"Tales Of Poe\" is the notable \"Dreams\". By far the most advanced of the short films, Mastronardi and Kelly create a whimsical journey of dark fantasy. Told as contemporary fairytale of sorts, \"Dreams\" takes on the classical prose of legendary journeys through the underworld, that supernatural sliver between life and death. It is heavy in surrealism with a nice, controlled element of the experimental film. That same dark, haunting tempo continues here with a noticeably mesmerizing pace. \"Dreams\" fits comfortably somewhere in between William Hjortsberg, Ridley Scott's \"Legend\" and Neil Jordan's \"The Company Of Wolves\" in vision, creativity, and fantasy. Every scene holds a surreal cult of personality and yet moves in rhythm as one really artistic piece.<br><br>Overall, \"Tales Of Poe\" succeeds in bringing forth a deservedly embraceable revision to the great Gothic horror stories of Edgar Alan Poe. There is enough that separates this tribute to the world of Poe from the other Poe stuff out there without loosing the substance and signature of the original tales. The anthology is a strong, above par indie film that has quality production value, original concepts, and real flare for the macabre that is addictive. The special effects are unique to their own stories, with the diversity shown in these three updates, that horror fans of all subgenres and Poe fans will connect with. The soundtrack and effects set the tone perfectly in creating a suspenseful, dark overture to the blend of classic and contemporary. Definitely check out \"Tales Of Poe\", the film stands out in style and step from the current horror tastes circulating out there now.","user":"ASouthernHorrorFan","rank":[7,19]},{"title":"Awful","rating":1,"date":"15 January 2019","review":"The most tedious thing I've ever seen. Just awful filmmaking.","user":"fhm-65706","rank":[2,4]}]