[{"title":"Romantic Comedy takes place in London","rating":10,"date":"8 February 2014","review":"I went to see Call Back Queen not really knowing what to expect. It was a nice surprise! It had some good laughs in it. I really enjoyed Amy-Joyce Hastings performance. Director Graham Cantwell and Amy-Joyce Hastings were at the movies and the audience were able to ask questions. It was great to hear some of the character development like one based on his grandmother. Questions were also received by Amy-Joyce Hastings. She was charming. I think she has a great future in film. This was Cantwell's first romantic company. I think he should do more. I like the name chosen for the film. The title caught my eye. That is why I ended up going to see it in the first place. Anyway..worth seeing.","user":"delpha7","rank":[4,9]},{"title":"Great performances and great direction from Graham Cantwell","rating":9,"date":"31 August 2017","review":"A superb film.<br><br>Great performances and great direction from Graham Cantwell.<br><br>Loved the colour grading and overall production values are top class.<br><br>Great filmmaking and superb casting, directing and written.<br><br>Be sure to watch this!","user":"oriordansinead","rank":[1,3]},{"title":"A Rom Com set in London about about a gorgeous young Irish Actress's trials and tribulations","rating":9,"date":"5 September 2015","review":"Graham Cantwell is one of my favourite film makers and I loved his first feature, Anton. Kudos to this Irish Director for very successfully jumping to the entirely different genre of Rom Com with a bang. Amy Joyce-Hastings, as the lead, is very lovable but out of luck when it comes to getting cast; she is no doubt like many young actors in London - struggling to get by while waiting for the next job! The film has an array of brilliant characters and I found myself rooting for all of them. Kate transcends the world of the big budget fantasy franchise, a short student film (which proves a raucous experience!) and some other mad work for survival. The Irish living in England theme is the underbelly of the film and is brilliantly and comically done. Ger Ryan is outstandingly hilarious and true to life as the young Granny to the director of the student short. The film is experiential when it comes to showcasing London. It is aesthetically stunning and full of light and sunshine which makes everything and everyone in it look ethereal! Go see this film or get it on VOD for anyone in the mood for a great Rom Com, an insight into the mad world of casting and film and a homage to London.","user":"lccanavan","rank":[1,4]}]