[{"title":"What a disappointment.","rating":5,"date":"24 June 2012","review":"With the singularly compelling premise of a mysterious group offering to take over the roles of recently deceased people to provide relief for their loved ones, it came as quite the shock to me that Greek writer-director Yorgos Lanthimos's follow-up to his 2009 Oscar-nominated \"Dogtooth\" (one of my all-time favorites) ultimately failed at living up to its concept.<br><br>Throughout the entirety of \"Alps\", I felt I was gazing in awe at a beautiful seed sadly incapable of germination. The film barely got anywhere while maintaining an incredibly slow pace and irritating visual style consisting of incessantly restrained deep-focus cinematography. There was so much potential wasted on scenes far too peculiar and insignificant to add any depth to the story or further develop the characters. Seldom did anything rightfully earn its place in the film; the multiple sex scenes seemed to be there with the sole purpose of being extremely awkward and obscene, while all the attempts at absurd humor felt slightly forced and weren't as effective as they should have been due to the narrative's intermittent solemnity.<br><br>This brings me to the film's greatest problem, which was that— on top of struggling to find its own voice and tone in its ridiculously irrational approach— it never really figured out what message it wanted to convey to its audience. Evidently Lanthimos was trying to say something about human nature and the craziness of consumer society, but he didn't succeed in delivering his thoughts coherently this time around. I hate comparing, but I must say I found the profound social critique that seeped through the bizarre surface of \"Dogtooth\" to be far superior in elaboration.<br><br>The end result of \"Alps\" was a confused, detached (albeit well-acted, especially by Aggeliki Papoulia) jumble beyond anyone's realm of comprehension, so overwhelmingly filled with unjustified senselessness that the most I could do was simply sit and stare at the screen, patiently awaiting some real substance, only to be disappointed by sheer staleness.<br><br>I suppose I somewhat admired \"Alps\" for all that it could've been following its eccentric uniqueness, but I can't see how anyone in their right mind could have truly enjoyed it.","user":"Copyright1994","rank":[64,89]},{"title":"In praise of altruism","rating":9,"date":"28 October 2011","review":"The title Alps refers to a fairly mysterious secret society of the same name in Yorgos Lanthimos' follow up to the hugely successful Dogtooth. I entered the film not knowing much about it, and I think that's the best way for the movie to unfold for you, as a mystery. I think mystery in general is Lanthimos' best gift here, Alps is a movie that really lets you take your own view, leaves pieces of the jigsaw out and sparks all sorts of different thoughts. I think I also felt that there's a seedling of hope and compassion in the movie amongst an existential debris of pragmatic, valueless and selfish individuals, which to my mind makes it a lighter experience than Dogtooth (although most critics have said otherwise). I think it's sad that, what I think are quite serious films, are mainly sold by relating to their shock or comedy value. The sequel-itis contagion requires a sequel to be darker, so to some extent people have spun this film as Dogtooth 2 - RABID! There's an aesthetic inversion in the sense that Lanthimos has Dogtooth containing characters trying to escape from an artificial environment, and in Alps characters are trying to create them. They're both about \"existential malaise\", but other than that, perhaps should be treated quite separately.<br><br>\"Winter swimmers never feel the cold.\" is a phrase that comes up in the movie. I think that a lot of folk here have got inured to soulless living. The people who the society focus on live out the past, and only value others in terms of what they can give to them, or how they make them feel, they're devoid of altruism. As in Dogtooth there's scenes of characters apeing iconic dream factory roles, the folks here are small compared to the objects of their obsession. People are trying so hard to be better than others, that they end up alone.<br><br>Difficult to talk exactly about the movie without spoilers, but I think my take was that the main message is that redemption comes via self-sacrifice, that people should grow up and be adults (western societies have pushed back the assuming of adulthood later and later). As in Dogtooth, there's a specifically Grecian comment about the old feeding off the young (though perhaps this will resonate elsewhere).<br><br>The character that I want to hug is Monte Rosa (Aggeliki Papoulia), I think she takes a beautiful journey, the journey to altruism.","user":"oOgiandujaOo_and_Eddy_Merckx","rank":[41,58]},{"title":"Think Guenirca, not Saving Private Ryan","rating":8,"date":"12 July 2013","review":"What happens when people insist on controlling one another? When they see the other only in terms of roles and obligations, not as individuals? When the primary interaction between those with power in relationships and those without is that the powerful take what they want, insist on conventional behavior from others and deny the weaker ones their desires and opportunities. When those denied must submit or die? What are the effects of even small acts of kindness? What is the effect of really seeing the other. Satisfying individual needs? This movie aims directly at the intellect and the gut, using a strikingly unusual metaphor as storyline. If you read the other reviews, you'll see it leaves many disappointed, irritated and confused. If you love patterns and puzzles you may enjoy this. Eventually. During the movie I was repeatedly briefly enraged, mostly just puzzled. Immediately after watching it, I wondered why the director thought he was entitled to waste 90 minutes of his viewer's lives with such coldness, sterility and artifice. By the time I woke up the next morning, the pieces began to fall into place. The actions and interactions of the gymnast and trainer during the first and last scenes, and the reason that the two scenes differ, encapsulate everything. After a lot of thought and piecing together, I see the movie as a brilliant piece of art. Unpleasantly, disturbingly, heart-rendingly brilliant.","user":"lisuebie","rank":[16,24]}]