[{"title":"Not as bad as many make it out to be","rating":17,"date":"17 February 2014","review":"First some background, I'm a guy, a shoot 'em, blow 'em up, Clint Eastwood luvin dude. I do appreciate however a good romantic story. Also, I have NOT read the book, heck, never even heard of it until now.<br><br>So that said, here is my take. The haters seem to fall into three major categories.<br><br>First, there are the \"loved the book, hate the movie\" types. Since I never read the book, I can't speak to this, other than to say, \"Sorry, it's not the book, it's a movie\". I always tell my kids that the medium of film is radically different than that of pulp and what \"works\" in one doesn't necessarily work in the other. Given that, one should go into a movie with an open mind, even if you've read the book.<br><br>Second, there are the \"I never read the book, the movie didn't make sense\". Now that I can talk to. I never did find myself all that confused. I think falls in large part to the fact that I never assumed the movie was supposed to be based on reality. I mean come on, given the rather obviously \"fantastic\" aspects of the story, it's not meant to be taken seriously. You're given an overarching concept (basically the power of love to do amazing things) and if you buy in, then the particulars are not really all that important. If you can't get beyond that, or simply don't buy into the central conceit, then you won't like the movie because it rides that wave for all it's worth.<br><br>Third are the folks who thought the movie was too schmaltzy. Now that I would at least partially agree with. That said, again, the movie doesn't try to hide the fact that it wears it's heart on it's sleeve. It's fair that if one does not go for that kind of thing, then you won't like this film.<br><br>All that said, I thought it was a \"good\" romantic film. My personal criticisms fall mainly on the somewhat wooden acting and the overall lack of \"feel\". That's right, despite all I said above there was just something about the film that just never really drew me into the characters. For some reason I never really felt truly emotionally invested in the characters. I didn't hate them, I did care, just not nearly as much as I thought I should. I also thought some of the acting was a bit forced and this might have contributed to not being able to lose myself in the characters. Almost like the actors did a good job of \"acting\" like the characters but never quite crossed into \"being\" the characters.<br><br>So if you're willing to accept the movie for what it is, an unabashedly romantic film that weaves religion as an integral part of the story, then I think that you will enjoy the film. It's not perfect by any sense of the imagination, but IMHO it's not nearly as bad as some folks are making it out to be.","user":"binaryDigit","rank":[172,197]},{"title":"Martin Scorcese was right.........","rating":26,"date":"26 February 2015","review":"I give this movie a 7, but only for the acting (several of my favorite actors and actresses are in it) and because I first saw this movie before having read the book. After having read the book, and having enjoyed it, I can say that the movie is light years different from the book and only uses its most basic outline. Certainly I understand why this is the case, trying to film 700 pages of dense and descriptive prose in 2 hours is impossible.....especially when so much of it is fantastical in nature. The movie is not a total failure, but it IS a total failure of adapting its source novel. Scorcese turned down filming this because he said it was \"un-filmmable\". He was right.","user":"CoolBrz","rank":[18,19]},{"title":"I loved this film!","rating":9,"date":"18 February 2014","review":"I went to see winters tale this weekend and I had so many different emotions when I watched it. First, Colin Farrell is wonderful...he's really great in this roll as a thief but also as a man who falls in love. He really makes you believe he's this character. Of course all the other actors and the surprise cameo all really worked well together. <br><br>Not gonna lie I cried a few different times in the movie, I laughed, and felt so many other things while watching. I'm also a secret hopeless romantic so this movie is great for my fellow love story lovers. Honestly I knew from the previews it was going to have a spiritual and magical story line which I really liked. It's nice to watch films that make you think afterwards and during. So don't go expecting to see a typical story line, because that's not at all what you will get. <br><br>When you go see this movie which I definitely recommend, have an open mind and just appreciate what you're watching, honestly it's moving!","user":"sheena2381","rank":[96,127]}]