[{"title":"Lots of screaming girls and tough guys","rating":4,"date":"8 December 2011","review":"It's your usual 'young people get trapped (this time underground) and have to fight for their lives against mutants' movie.<br><br>It's all very much in the Wrong Turn vein. You know, the cast are good looking. There are lots of pretty, short-skirted females screaming the place down. The guys run around all tough and are, funnily enough, the easiest slain.<br><br>But underground it's dark, and thus we're often faced with a too dark picture. Half the time I couldn't see what was going on.<br><br>The ending couldn't have come quick enough as I was becoming increasingly bored with this movie. It's 'b' rated stuff, nothing special.<br><br>4/10.","user":"spotlightne","rank":[20,23]},{"title":"utter rubbish","rating":1,"date":"12 December 2011","review":"Be warned this film is nothing at all like The Cave or The Descent. Both films had a story and employed actors. This tripe has neither. An elite special forces team goes into the base at the beginning and is wiped out. Years later a bunch of morons at a rave get trapped and somehow don't. The 'actors' look slightly bemused as people lose heads and arms and don't even seem that bothered shouting out their lines as if reading them from a card with as much emotion as a baseball bat. A copse of trees could out act this lot. A series of running about scenes interspersed with explanation scenes to keep you from complete boredom later we have the pointless last couple of minutes that may or may not signal a sequel. Not the worst movie ever made but has a damn good try at it. Awful from beginning to end.","user":"doorsscorpywag","rank":[11,14]},{"title":"Unfinished","rating":2,"date":"8 December 2011","review":"Being in the \"biz\" it was more or less evident to me that this film was unfinished and it's a shame that it was released this way since it had the potential to be a decent B horror flick.<br><br>Aside from some unremarkable acting (which is excusable when dealing with low budget horrors) the score and cinematography were competently executed. Make-up and special effects were decent aside from one horrendous CGI shot of snow. Where we get into trouble is in the edit.<br><br>An unforgivable number of scenes were disjointed and leaves the audience wondering \"what is going on,\" \"where am I now\" or \"who am I looking at?\" I've seen such scenes before in what we call an assembly or rough cut. This is when the editor takes his/her first stab at a complete edit. It's usually after this that the production team gets a clear idea of what scenes need to be re-shot or what extra shots are needed to make the edit work or flow.<br><br>For whatever reason (lack of funding, actor availability, location no longer available, etc.) this was clearly not done which makes the film extremely frustrating to follow.<br><br>I recommend staying clear of this one. I'm a huge fan of horror films but I ended up fast forwarding the last 10 minutes just to get to the end because my brain got tired of trying to fill in the gaps.","user":"jfilmer-544-494694","rank":[23,34]}]