[{"title":"should be crucified.","rating":1,"date":"21 July 2014","review":"Where can one begin ? With this pile of pus, anywhere.<br><br>What a load of tripe. This isn't dark, gritty and sleazy, it's dumb, gross and stupid.<br><br>Acting - zero.<br><br>Story - zero.<br><br>Believability - zero.<br><br>Camera steadiness - 1.<br><br>Lighting - surprisingly, good.<br><br>Corny Crappiness - gazillion.<br><br>No originality, no skill, no interest, tired, clichéd, done a million times before with much better effect. Scratch that, with ANY effect.<br><br>Another example of why digital cameras should be sold with a license and a public listing as to where to serve the budding film-maker with a writ for wasting our precious time.<br><br>If you want to make films, make a name for yourself, be a director, *source talent*, starting with yourself, including script, story, acting and above all else, grab the audience and make the film something *memorable*, but with bloody orginality, not with a ridiculous script and hammy actors. Serving up excreta and expecting the public to make you a household name just gives the public a reason (and the right) to sling the poop right back at you.<br><br>No matter how small the budget, there is no excuse for a crap product and if you want to go somewhere &amp; be somebody, put in some effort and TALENT, rise about the efforts of a 7 year old with school friends, a towel, and some tomato sauce, making a film in mummy &amp; daddy's backyard.<br><br>That goes tenfold for anyone that writes gushing meretricious drivel, praising a thimble of flea dung as the next \"Michaelangelo of Movies\", in order to hoodwink some poor fool into watching 90 minutes of dross for some hidden reasons, like you were an extra on the film, know the friend of someone who once knew someone who went to school with one of the make-up girls, or were promised $10 if you write a good review for pure puke.<br><br>Tosser.","user":"adrossan","rank":[14,19]},{"title":"Maaan it was bad!","rating":4,"date":"23 July 2014","review":"I dunno why exactly, but I gave this one a 4! Usually I don't do this with such bad movies, but it had some good parts in it. Now, even before beginning to explain myself, I'm gonna say one thing: I do NOT recommend Cross Bearer! To no one!<br><br>So, the acting was not as bad as I expected, usually you get much worse than this. The gore was kinda OK I guess for such a low budget horror, nudity fully present, some natural acts, good decisions, interesting \"mask\" design and a plot that ties itself in the middle of the movie. The camera work is actually better than most such productions, so all in all, there are some good things here, but if you see it, you'll understand why this should be avoided. It still is a bad production, weak plot, horrible main actor, well the killer that is, annoying at its best.<br><br>Therefore, Cross Bearer will remain a No-No, hope you people will trust the reviews and stay away from this one. If not, you're only going to waste time.<br><br>Cheers!","user":"gothic-fiction","rank":[11,17]},{"title":"Another reason for people to hate horror","rating":2,"date":"22 July 2014","review":"I enjoyed some of Cross Bearer because I'm a fan of practical make-up effects, but other than that? I waited a long time to see a real dud of a film.<br><br>There are times I'm fooled by a movie with some cool looking art-I admit it. I saw Cross Bearer's cover art, and I said \"I have to see this\". So I waited, waited, waited, and finally I was able to see it. What a disappointment. Not only is the acting cold and wooden, the writing is just bad. This is a typical horror film, and if you've seen enough horror you know this is just a rehash of so many other better films which were executed at a higher level than this. Even as far as slashers go, this is just weak. Like I said, there are some effects worth seeing, even a little decent cinematography at times, the look and feel of it, but you can't go for all style over substance, you just can't! <br><br>This is not old school horror, this is also nothing new- I don't recommend seeing this. At least not if you have something more promising to watch. If you want to see another run-of- the-mill slasher, the same thing you've seen time and time again, then go ahead. I give it a 2 out of 10, only because some of the effects were enjoyable, and I also liked how they didn't go for something too ridiculous for a mask; it was a simple look, and I kind of dug it. Other than that? Skip it.","user":"fathersonholygore","rank":[7,14]}]