[{"title":"Well done!","rating":8,"date":"29 March 2019","review":"Movie that takes place in the 30s it was truly well done and very well thought out. This movie created the mystery of bonnie and clyde and the drama and havoc the created throughout the south. The true story of these 2 retired rangers made this all the more appealing. Kevin costner was a magnificent choice for haymer! Harrelson was perfect as his partner. I really enjoyed the big names in this movie down to Kathy bates. Very happy with the detail this film portrayed.","user":"ethancdowns","rank":[285,336]},{"title":"Yes!","rating":8,"date":"29 March 2019","review":"We all saw the movie <a href=\"/title/tt0061418/\">Bonnie and Clyde (1967)</a> directed by <a href=\"/name/nm0671957/\">Arthur Penn</a>. In France, we all heard the eponymous song (<a href=\"/name/nm0000003/\">Brigitte Bardot</a> and <a href=\"/name/nm0006092/\">Serge Gainsbourg</a>, 1968). The Highwaymen is a mirror version with two retired Rangers in pursuit of the infamous outlaws <a href=\"/name/nm1352425/\">Clyde Barrow</a> and <a href=\"/name/nm1369634/\">Bonnie Parker</a>, considered as Robin Hood and his beloved wife by the plebs. A dead or alive hunt, in the 30's. Knowing that dead is a priori more practical, we suspect from the outset, even if we do not know the story, that it will probably be the chosen solution. In many aspects, I perceive the atmosphere of <a href=\"/title/tt0105695/\">Unforgiven (1992)</a> directed by <a href=\"/name/nm0000142/\">Clint Eastwood</a>, with its predictable and ineluctable ending, with cars and heavy machine guns instead of horses and Remingtons.<br><br>The actors, the photography, the costumes, the cars, the atmosphere of the post-1929 Great Depression, the rhythm, the dialogues, the soundtrack, ... This is an excellent movie! As a synthesis: 8/9 of 10.","user":"FrenchEddieFelson","rank":[168,201]},{"title":"Entertaining and engaging, skipping the prior sympathetic bandit myth telling","rating":29,"date":"29 March 2019","review":"This is an extremely well put together, engaging and entertaining telling of the pursuit of Bonnie and Clyde. Woody Harrelson is at the top of his form. He's played the part of the hardbitten lawman before, but it keeps getting better. And Costner does almost as well. The interplay is absorbing and extremely well written and acted.<br><br>In western culture we love our bandit myths and legends, which for some reasons celebrate some fairly nasty characters. Knowing the real story of Bonnie and Clyde, as opposed to the myth created by the contemporary news media and J. Edgar Hoover, always made Arthur Penns near worshipful portrayal of these two blood drenched spree murderers jarring. Bonnie and Clyde were bloodthirsty sociopaths, who in fact ambushed and murdered a fair number of people, including shooting unarmed store clerks in the back. Bonnie and Clyde were not \"sticking it to the man\" robbing big business like banks as much as they were in fact robbing and killing owners of small stores and then committing cold blooded murder of policemen trying to stop the mass murder spree.<br><br>The ultimate \"ambush\" of Bonnie and Clyde was not some planned execution, it was the result of the simple fact that those two had, withing seconds of being stopped, routinely murdered police who stopped them. They also did most of their murders with simple revolvers and sawed off shotguns, and almost none of the guns used were machine guns (a documented invention of Hoover's FBI; of the twenty or so people Bonnie and Clyde shot exactly one was shot with a machine gun). Hoover was fixated on above all else a) trying to prove that his agency's high tech of the time was the best avenue, despite all evidence to the contrary, b) distracting from, even to the point of denying the existence of, organized crime that Prohibition he supported had created. Hence his spinning of \"celebrity\" criminals like Dillinger and Bonnie and Clyde, which also fit his narrative that we needed a national police force.<br><br>In fact FBI in fact made a mess out of their pursuit of Bonnie and Clyde, and it was old fashioned policing by two standard state lawmen that put an end to their violent spree.<br><br>So watch this film to see great buddy cop tension, and character interplay. Seriously as good as True Detective level. And a subtle subtext of well done but not over the top critique of Penn's worshipful portrayal of these two hyperviolent criminals in his 1967 film. The bumbling lawmen myth attached to to the 1967 film is also blown away. Bonnie and Clyde's murder and crime spree ranged over an area of 600,000 square miles, and it was old fashioned hard-bitten police work that got them.<br><br>Lastly the period work is another very well done element. Not just the visual elements, but the the dialogue. Instead of the fictitious Hepburn-Tracy like, now laughable, staccato dialogue of the 1967 film, we get a much more accurate laconic way of speaking at that time. More is said in fewer words between Harrelson and Costner.<br><br>Give it a watch, you will not be disappointed, although your prior positive views of the one-dimensional 67 film, may change.","user":"random-70778","rank":[190,233]}]