[{"title":"A largely forgettable mystery drama with a good twist at the end","rating":4,"date":"7 July 2015","review":"I am a huge fan of Sara Paxton and that's pretty much the only reason why a watched STATIC. I hate to say it, but this movie is lame. It's not suspenseful and scary the way a mystery thriller should be. It's more like a drama with some light thriller elements. Why this movie is tagged \"horror\" on IMDb is beyond me. Also, the movie poster is VERY misleading. I expected something completely different judging from that poster. Something like RAMPAGE (2009) or THE TALL MAN (2012) or whatever. Also, Sara Paxton only has a small amount of screen time, which is a shame because she is a great actress when given something to work with. Anyways, the plot of STATIC is quickly told:<br><br>Jonathan Dade (Milo Ventimiglia), a novelist, and his wife Addie (Sarah Shahi) live in a large house in the middle of nowhere. We soon learn that their three-year-old son died in an accident some time ago and that they are having a hard time to forgive themselves and move on. One night, a strange woman named Rachel (Sara Paxton) comes knocking on their front door saying that her car broke down and that she was being followed by strange figures wearing gas masks. Jonathan and Addie are so kind to take her in for the night. Some time later, intruders come to the house and take Rachel away. Then they come after Jonathan and Addie...<br><br>The plot doesn't offer much. For the better part of an hour, you basically see Jonathan and Addie fleeing from largely invisible intruders wearing freaky gas masks and hoodies. The couple run from one room of their house to the other, hear some noises, argue a bit, then go to the next room and do the same. Then they leave the house, run into the garden, then into the garage, then into the forest, and back to the house again. During all that running, they hardly make any contact with their intruders. You can figure that it gets boring pretty soon.<br><br>The movie only gets relatively interesting about ten minutes before the credits start rolling. When it is revealed at the end that Jonathan and Addie are ghosts, my initial thought was that we have seen endings like that so many times since THE SIXTH SENSE (1999), it's not really original anymore. The good twist comes a little bit later when you realize that Rachel and her crew are something like ghost hunters who clean haunted houses from spirits that won't leave. That is a pretty clever ending, I give the movie that, but other than the enjoyable ending, STATIC just doesn't offer much. I'm sorry to say.","user":"the_bluesman","rank":[8,8]},{"title":"Static actually has pretty good reception --^--6.8/10--^--","rating":7,"date":"23 May 2013","review":"Static comes to us from a completely unknown source by way of Todd Levin, this being his directorial debut, he also was one of three people credited for the screenplay. For a first effort it was a promising start, of course having an experienced cast in Milo Ventimiglia &amp; Sarah Shahi to work with certainly didn't hurt. The film had very good cinematography and sound that worked to create a tense, creepy atmosphere quite early into the film.<br><br>The film relies heavily on the acting of Ventimiglia &amp; Shahi who play Addie &amp; Jonathan, a grieving couple who recently lost their beloved son Thomas to an accidental drowning death a short time ago. Not far into the film, in the dead of night, they are awoken by a hard knock on the door. It is here we meet a desperate woman named Rachel(Sara Paxton) who claims that while tending to a flat tire, someone had attacked her and was still in pursuit, but when Jonathan goes out to look he can see no one, but just to be safe the couple agrees to let her stay the night. It is at this point that strange happenings begin to occur and we are left guessing where exactly the danger lies. The first half of the film closely resembles The Strangers(2008), but there is more than meets the eye as the details slowly bubble to the surface and the story takes a hard turn in a new direction.<br><br>The plot does consist of familiar ideas, things we have witnessed before in other films, but the film presents them in an intriguing way, making for an entertaining thriller. It had great atmosphere, good tension and fine performances by the film's lead characters, they both held my attention well throughout the film. The ending was a bit frustrating, as I'm sure some will agree, but was still an acceptable answer to all of the mystery &amp; motives. Not a bad way to spend 80 minutes.","user":"Thrill_KillZ","rank":[41,54]},{"title":"A dull and murky derivative","rating":3,"date":"16 December 2015","review":"STATIC is another murky and derivative 'home invasion' shocker that manages to rip off a half dozen or so films over the course of its running time. It's a rather insipid work that tries hard to build a creepy atmosphere but fails throughout thanks to sub-par direction and poor script writing. If you want to see this kind of film done properly, try the magnificent French thriller THEM.<br><br>The protagonists in the film are a young couple grieving the death of their only child. These makes them as mopey and self-centred as it gets, and they make for imminently unlikeable characters. Milo Ventimiglia and Sarah Shahi are undoubtedly talented performers but they can do little with what's on offer here.<br><br>The fright scenes in particular are rather dull and murky and too predictable when films like THE PURGE and THE STRANGERS have done it all before. Plus, the cinematography is way too dark, and the film as a whole has a grey and washed out look that makes it depressing to watch. The twist at the climax turns out to be nothing more than another rip-off of a different movie.","user":"Leofwine_draca","rank":[6,7]}]