[{"title":"Learning to let go","rating":7,"date":"12 September 2015","review":"I viewed this movie from the standpoint of a parent of an adult child as is the main character, Jackie. In my view this is what the story is about, how a parent lets go and enjoys watching her child make their way as an adult. In doing so, she is able to move on to becoming a more authentic person as well. I've always been a fan of Helen Hunt and although her appearance has changed, she still brings us her ability to make us feel we are watching a woman bravely dealing with what life is bringing her way. The film present a great contrast between their lives in New York and California. The son, Angelo, travels to CA to visit his dad. I'm a little surprised at how quickly the son, Angelo, adapts to the different lifestyle. Luke Wilson as Jackie's love life is a good match. His calmness contrasting with her franticness plays well.","user":"debvee60","rank":[12,12]},{"title":"Interesting mother-son relationship","rating":7,"date":"15 May 2015","review":"My impression is nearly everyone is responding to this in stereotypical ways - seeing the mother as impossibly overbearing and interfering.<br><br>Actually mother and son have a great relationship. They argue intensely and in detail about what his stories should be like - and about life and their relationship in general. This is very well portrayed. And most of us should be so lucky to have such a relationship. <br><br>So she takes it too far - but hardly in a Tennessee Williams way. And they argue intensely about that too, and work their way to a successful conclusion.<br><br>Sure, it's all a little too Hollywood pat and neat in the end.<br><br>But you have an unusual portrait of an unusual and very good mother-son relationship - and a very passionately involved mother. She's very OK. <br><br>I enjoyed it a lot.","user":"tintner-22191","rank":[19,23]},{"title":"Not a bad ride","rating":6,"date":"2 May 2015","review":"Helen Hunt looks vastly different in this movie. It's only relevant if you are a fan of Hunt's before this movie.<br><br>I found the movie very relatable as Helen hunt plays an overbearing single mother whose college aged son, drops out to surf in California and she follows him from New York in order to connect by learning how to surf herself.<br><br>It's a drama driven by Helen Hunt in center stage and a coming of age story that not only focus on a boy trying to figure out his life but a mother trying to let go of the boy becoming a man, so in a lot of ways it's her coming of age story as well. <br><br>Not the best movie about surfing I've ever seen but I think I've only see two (Point Break and Johnny Tsunami), but it's one of those movies that really grounded on real life emotions and dealing with real life things.<br><br>It was a good Helen Hunt movie.","user":"subxerogravity","rank":[22,28]}]