[{"title":"If you're expecting anything at all, you'll probably hate this movie","rating":8,"date":"27 November 2014","review":"The first and only IMDb review I read for this movie said to go into it blindly, so I did without even reading the rest of the review. Going into it blindly is the best advice anyone could give. And if you read the rest of this review, don't worry I won't expose a thing. I won't even tell you what genre this film is (because as far as I can tell it isn't any genre).<br><br>I'll be honest and say I hated the first 12 minutes because it seemed indulgent &amp; pointless. Also I'm not really a fan of hand-held camera work. But luckily I have a tolerance/attention span of exactly 13 minutes because that's when a story began to develop. And ultimately I realized even those \"pointless\" 12 minutes had a point. It sets up a very subtle yet pervasive metaphor, the soul of the whole movie.<br><br>Slowly, so slowly that you might not even notice (which I'm sure was the filmmakers' intent) the film starts to get under your skin. And although the only quantifiable storyline for the first 40 minutes is a girl and her dog, it's done so convincingly and, yes, suspensefully that I was hooked. And that, my friends, is all I will say about the plot because you shouldn't expect anything more.<br><br>Now a few notes about technique... The directors did something very interesting by never taking the camera off the lead actress throughout the whole movie, not once. Also the camera would sometimes run long, continuous shots without cuts. While this method may sacrifice momentum and some viewer interest, it adds tremendous realism, almost like a documentary feel. And we begin to connect with the heroine even though she doesn't say much. And of course the difficulty in staging the rest of the action while always keeping her in the shot must've been no easy task. The final 22 minutes is a very impressive achievement, all done in one continuous take with a lot going on, and I mean a whole lot.<br><br>People have called this film \"experimental\", but there's no experiment about it. This is a fully finished product with a great style, a novel approach, and certainly the most memorable ending I've seen in ages, ending on an image which I can't decide if it's chilling, hilarious or beautiful.","user":"rooprect","rank":[8,9]},{"title":"Very Pleasantly Surprised","rating":10,"date":"7 May 2012","review":"Go into 'Entrance' blindly.<br><br>Don't look up anything about this movie, not even a plot summary or trailer. I had no idea what kind of movie it was, so when it all came together in the end it was an unforgettable experience.<br><br>'Entrance' is a very creatively and craftily made no-budget movie. It is the best film of its kind that I've seen in years.<br><br>This is an incredible effort that I would recommend to anyone looking for something that is atypically effective and defies the norm.<br><br>The shot composition in 'Entrance' is outstanding, the directors certainly know how to frame a shot. The acting is superb, there was a great suspension of disbelief throughout that normally doesn't happen with such low budget efforts. These filmmakers have a bright future ahead of them, and I can't wait to see what they do next.<br><br>Great stuff all around, enjoy!","user":"theshape31","rank":[42,69]},{"title":"It just wasn't worth the long wait for something to happen","rating":2,"date":"7 May 2012","review":"This film follows this woman aimlessly going about her life, doing this and that, certainly nothing profound or exciting happening.<br><br>For the first sixty minutes this is like a bad romcom without the romance &amp; comedy. It belongs in the drama section, although there wasn't really any drama either.<br><br>Then at her moving away party suddenly some stalker shows up &amp; starts doing bad things off camera to her friends. It was less than 70 minutes of actual movie time and there was very little suspense,tension or horror. The long wait for something to happen just didn't pay off.<br><br>Honestly watching grass grow is a fine alternative to watching this. If you do choose to watch it you risk having the same senseless feeling that I had. This gets a 2/10","user":"Thrill_KillZ","rank":[26,45]}]