[{"title":"King Arthur","rating":7,"date":"12 February 2020","review":"Let's be clear: this contains very few aspects of the actual Arthur legend. They probably should have just gone for a wacky original medieval fantasy film instead. That being said, I didn't expect Ritchie's style to work this well here. And he hasn't been this crazy since Snatch. Some montages are so breathless, fast and innovative as far as editing and soundtrack go, it's a pleasure. Sure, the plot follows the genre conventions more or less, and the finale is a bit heavy on CGI. On the other hand the assassination attempt sequence is fantastic and the portrayal of magic pretty cool. Hell, I had fun with this.","user":"MR_Heraclius","rank":[49,55]},{"title":"The reviews does this movie no justice. it doesn't have to be the old story with no creativity.","rating":9,"date":"12 May 2017","review":"I believe this movie would have been a master piece of a series due to \n the huge amount of event packed into 2 hours, but this is no criticism \n on how great the movie is and how the numbers of this site doesn't do \n it justice. 90% of the negative reviews comes under the lame excuse of \n \"that's not how king Arthur is supposed to be\". If you actually want a \n movie where you know everything already starting from the story, \n characters and twists then I'd call you the stupidest ever. Yes this \n isn't your typical king Arthur movie, and that adds even more to the \n awesomeness of it.amnt saying the movie is flawless, no movie is, but \n it was great starting from acting, animation, story, music tracks, \n everything. Again would have been better off it was a series and I \n hope there would be a sequel including the knights of the round table, \n sure Lancelot and some dramatic betrayal or even Arthur's betrayal \n himself to the kingdom.","user":"mohamed-elbahnasawy","rank":[712,1]},{"title":"Brilliant!","rating":10,"date":"19 May 2017","review":"Hadn't seen a trailer or heard much about this, aside from the face David Beckham was in it (he had like two lines and they were fine so not sure whey everyone was so fussed about that). The movie was really really good. It was intense, exciting, bonus points for a super attractive lead! <br><br>Everyones acting was really good, especially Jude Law (who was maybe too convincing) and Charlie Hunnam(?). The little boy called Blue stole every scene he was in. <br><br>Guy Ritchie did a cracking job, the music and camera angles plus general style of the film made it interesting and quick paced with some witty banter.<br><br>Did have a couple of general questions, why did building a taller tower mean he had more power? Where was Merlin? Who was Maggie? Was this Mage girl actually Merlin? How did he not remember what happened he was like 8? The three women in the basement, who were they? <br><br>But all in all I loved it, and would probably watch it again :)","user":"KayOne111","rank":[139,208]}]