[{"title":"Achingly Beautiful","rating":9,"date":"18 June 2011","review":"This film is an achingly beautiful Australian story that I hope all Australians see.It tells the story of an Aboriginal community in all of its daily life and daily struggles. The film is a junction point in the life of Daniel. His family life is dominated by parents using alcohol and drugs, a family life that has been destroyed by the removal of children from their families. School is a daily struggle. He develops a friendship with the local drug dealers and the film is about the story that unfolds from there.<br><br>The film is important because it weaves a personal story of a community into the wider indigenous Australian story. The themes that this film is dealing with are immense yet at no time do they overwhelm the film. Themes of loss of language, cultural identity, substance abuse, education, the high suicide rate and incarceration of Aboriginal people in Australia are all deftly woven into the story without you even realising.<br><br>The director Ivan Sen is a marvel - to have extracted the performances that he has from the residents of Toomelah is simply extraordinary. In speaking about the film he revealed that Daniel was never present during any of the traumatic scenes. Furthermore he revealed how he spent time in Toomelah before writing the film and that almost all of the dialogue is taken from conversations he heard while he was there. Writing the film was about putting a structure to the film and weaving the dialogue into place.<br><br>While to many of us the community of Toomelah may be confronting, as Ivan Sen the director pointed out that this is very much in the perception of the viewer. Toomelah is also a place of great beauty. Ultimately it painted a real picture of the despair of these communities because of the lack of hope and opportunities. The film, for me, was all about what does the future hold for a young boy growing up on an Aboriginal community. In this sense the film is both bleak while offering a gleam of hope....<br><br>I highly recommend this film, get out and see it whenever you can.","user":"sqwander100","rank":[19,21]},{"title":"A story of alienation, violence and hope","rating":30,"date":"30 October 2011","review":"Toomelah used to be a mission for aboriginal Australians. In the far north of the State of New South Wales, it was too far away to attract any attention from the state capital, Sydney, although it was right on the border of Queensland. Not until a community nurse resigned after exposing the abuse of children was any help offered, when the Australian government started an \"intervention\". Housing, sewerage and water supply were improved. To-day, the location of this film is still an aboriginal settlement. Its people are keen on education for their children, but substance abuse remains a problem.<br><br>Ivan Sen, who had been brought up here, walked the 15 Kilometres from the nearest town, Boggabilla. This is rich agricultural country, with cotton cropping. Sen's movie (yes, he does the script, the filming, the music) ignores the wealth of this sub-tropical demi-paradise. Poverty and neglect are apparent. Young Daniel carries the picture with very little to say. He is the observer, the cadet druggie. His father is alienated, devoted to methylated spirit. His mother tries half-heartedly to get him to go to school, but his disruptions force his expulsion. His Nan is his only consolation. He tries to relate to a visiting aunt, but she lives in the past. A violent episode, triggered by Daniel, brings resolution and redemption and hope.<br><br>This movie is well worth a look. The music is good. Sen is \"handy\" with the camera. I think perhaps that he could have used a tripod and a focus-puller. Sen edited the film himself. A few more seconds of cutting would improve it.","user":"brimon28","rank":[12,16]},{"title":"Sen brings a verite, documentary-like realism to the material","rating":6,"date":"9 June 2012","review":"Ivan Sen (Beneath Clouds and Yellow Fella, etc) is probably our most important indigenous filmmaker, and there is something personal about his new film, which is set in Toomelah, the mission where he was born. Toomelah tells a loosely fictional story of Daniel, a troubled young boy who is bored with school and is hanging out with the wrong crowd. With an absent father, the only real male role model he has is the local drug dealer Linden (Christopher Edwards). Daniel gets caught up in the struggle between Linden and the violent Bruce (Dean Daley Jones), who has just returned to the town after a stint in prison. Sen finds a community in crisis, and while he explores a number of important issues about aboriginal communities, he doesn't present any easy or comfortable answers. The film follows territory explored in other indigenous-themed dramas, like Samson And Delilah, Yolngu Boy, the recent Mad Bastards, etc, which offer an indictment of the treatment of aboriginal people. Sen doesn't pull his punches in exploring the depressing life on the mission, and its cycle of despair, dysfunctional families and crime. Shot on a very low budget Sen brings a verite, documentary-like realism to the material with hand held camera and largely unscripted dialogue. The cinematography is striking and captures the natural beauty of the location. The cast comprises of non-professionals, drawn from within the community itself, and their lack of experience sometimes shows in the hesitant performances from some of the performers. Many in the cast are also related to each other, which brings another dimension to the material. However, young Daniel Connors is a natural and gives an impressive and earnest performance as the angry young boy trying to find his place in this remote community.","user":"gregking4","rank":[4,6]}]