[{"title":"It's nice to see someone other than Jason Statham still consistently making cool B action films!","rating":8,"date":"20 December 2012","review":"'EL GRINGO': Four Stars (Out of Five) <br><br>Eduardo Rodriquez directed this Scott Adkins action vehicle for After Dark Films (as part of their expansion into the action genre). It was written by Jonathan Stokes and produced by action master Joel Silver! It costars Yvette Yates, Erando Gonzalez and Christian Slater. The film is a great throwback to spaghetti westerns and other old school action films and continues to showcase the remarkable talents of Scott Adkins as a new leading man action hero.<br><br>Adkins plays a DEA agent (who is never named, in true spaghetti western fashion) who is setup and attacked in the middle of the dessert. His partners are killed but he manages to escape (after killing the gunmen who attacked him). He stages his own death and flees into Mexico with a bag full of drug money. He runs into hostility there wherever he goes as the locals don't seem to want him in their town. He finds a little help from a local bar owner (Yates) but soon finds a ton of opposition from the local corrupt sheriff (Gonzalez), and his drug cartel thugs, as well as his old DEA boss (Slater), who tracks him down.<br><br>The movie is a pretty impressive style over substance indie action film. Rodriguez's directing is cool and the script is fun. There's of course not a lot to the story but the action is almost nonstop and Adkins really shines as an action force to be reckoned with. It's nice to see someone other than Jason Statham still consistently making cool B action films. The movie was made for just $7 million but it's definitely not short on explosions or gun battles. This is the stuff that the action films of yesteryear were made of; just good old action loving fun!<br><br>Watch our movie review show 'MOVIE TALK' at: http://youtu.be/Ie33IbZzmi0","user":"Hellmant","rank":[25,30]},{"title":"Why should i watch El Gringo","rating":7,"date":"18 May 2012","review":"If you like action this movie will not disappoint the story is nothing that hasn't been done before but it is put together quiet well, and the acting is as good as it gets for a low budget movie... of course its not a masterpiece but i feel it deserves a chance. Reading some of the reviews i felt that they forgot to mention that this was a movie meant to entertain people and it does just that, i was very entertained by the end of it and not only was i entertained but i found myself with a silly smile on my face from laughing hard most times and then end up getting angry the next scene, this movie is like a roller coaster never a dull moment. I highly recommend it simply for its high entertainment value, don't go in expecting Quentin Tarantino.. but were you to sit down and watch a movie simply because you enjoy watching a movie than this will not disappoint i assure you.","user":"deadmanwalking695","rank":[38,51]},{"title":"If you can get with its groove, it's okay","rating":14,"date":"14 July 2014","review":"It's hard to believe that major Hollywood producer Joel Silver got involved with this movie, since it was destined to go straight to DVD. Actually, I didn't think that this movie was terrible. Certainly, I can see why some people might not like it. The direction and the editing is often very flamboyant, when a less-is-more attitude in these departments would probably have worked better. Also, the movie is VERY bloody and violent, which will probably repulse some prudish viewers. But I have to admit that I wasn't bored while watching the movie. There are a few action sequences that really deliver the goods, for one thing. And the crazy direction and editing, though sometimes annoying and pretentious, did make me curious as to what strangeness would come next. I would say that if you have a taste for direct to DVD movies, and are in the mood for something in a much different style than usual, then you'll probably find this movie an acceptable time waster.","user":"Wizard-8","rank":[4,4]}]