[{"title":"Creative and Interesting Monster Movie","rating":8,"date":"6 August 2013","review":"Most of the people tearing this movie apart and faulting it seem to base that on the fact the movie has some plot-holes and illogical jumps between sequences. I can agree with them, but a compelling seamless story with lots of character development and deeper meaning does not necessarily make for a good horror flick.<br><br>I enjoyed the movie as a whole, even as a cynical and self-proclaimed Horror Genre veteran. The first hour of the movie may have you wondering \"Why is this even rated R?\" \"Where's the monster?\" \"Where's the gore\" but all those questions are answered in the last 20-30 minutes, so be patient - and it will deliver.<br><br>There are no crazy Asian-ghost-girls and the movie does not rely on CGI at all. There are a handful of bloddy and gory sequences that do unfold towards the movie's end, one-upping the beginning of the movie which may have you wondering if you're watching another \"Disturbia\" (throws-up) or \"My Soul To Take\" (the worst wes craven produced movie by far)<br><br>It takes some time to get warmed up but the movie does deliver on the goods towards the end, and of course, any film involving fictitious monsters/demons living under beds is going to come across as silly and illogical on some level. You can tell the director wanted to engage the audience and give them some frights and fun, and it's production quality seems a lot higher than you would expect with a non-theatrical release. I can honestly say this is the most fun watching a new non-Hollywood horror movie in the last year, and that's out of dozens.","user":"bradleybean86","rank":[20,23]},{"title":"This well crafted creature feature lulls you, lures you in then hits you hard","rating":7,"date":"8 August 2013","review":"'Under the Bed' opens with dark, moody undertones that establish a sense of foreboding which fade almost unnoticeably into the slightly upbeat homecoming of the teen lead and his reunion with his kid brother under very tense circumstances. With the young ages of the two protagonists the plot leads you into a false sense of security believing that the film is perhaps targeted at a younger audience and will thus treat the viewer with kid gloves. However, such is not the case, and for serious horror fans, the third act will not disappoint.<br><br>The film is well made. Settings are clean and all of the actors give believable life to their respective characters. In particular Peter Holden is convincing as the father of the two boys who plays well a man who seems to want to be a good parent, but who has much road left to travel along the process of healing from a tragic event that took the life of someone very close to him and ripped apart his small family.<br><br>Jonny Weston's performance as 'Neal' brought to mind Jason Patrick's struggling teen role in 'The Lost Boys'. Weston really projects the fear and turmoil and disgust of a young man forced to live for years on the edge an abyss. He's jumpy, outwardly disturbed and exhausted from lack of sleep.<br><br>The film is essentially divided into two acts - the first which runs for around two thirds of its length and the second which makes 'the reveal' and brings resolution. I enjoyed this structure as it provided plenty of time to introduce and develop the characters, and tension was slowly increased along the away, although I was expecting a shock in some form to happen sooner than it did.<br><br>Additionally, while the premise has been used before, normally such stories involve parents who prance around as if completely unaware that something horrible is happening to their children. Here we have a father who cannot ignore the psychological and physical turmoil his sons are experiencing and so he must react and does so in what seem like extreme or last resort parenting efforts. I found this to be refreshing in light of the usually clueless parent characters in similar films.<br><br>I also agree with one other reviewer of this film in that the negative reviews seem misplaced. In 'Under the Bed' we have a film with dark, tense atmosphere populated by characters on the edge of breakdown, harried by a presence which cannot be explained by the laws of what we understand to be the natural order. In other words - a really good journey into horror, which takes us far away from the overpopulated genre of slasher films and into the living nightmares of two children who just want to lead the normal lives they haven't had for years.<br><br>I highly recommend 'Under the Bed' to horror movie buffs searching for their next fright fix. Make some popcorn, turn off the lights and let yourself be drawn in. You'll never see \"it\" coming. <br><br>Five out of ten stars for overall quality, plus one for character development and capable acting, and one more for no use of CGI to convey horror.","user":"mecheart","rank":[7,7]},{"title":"Bogeyman done right","rating":7,"date":"23 July 2015","review":"This movie is way under-rated. <br><br>The monster in this movie is awesome, first off, it's one of the better (if not best) original monster creations in recent horror movies. What's more is this movie remembers a time when a monster could be set up, through darkness and shadow play. Teased at, only to be revealed in the climax of the film. It's an art that has been forgotten by most in the genre. And this movie knows how to use gore without overusing it, another balancing act long forgotten. <br><br>There were a few things that didn't make sense, the biggest being what the dad is so mad about through the whole movie. The only reason for this (plot-wise) being that he pushes the children into confronting the monster. <br><br>We don't really get any sense of the motivation of the monster, but what are you gonna do? Sit down and try to ask him why he wants to eat you? We all know the tropes that are widely used to explain back-story in these films, but this movie sidesteps those, and I don't find it that detrimental to the film as a whole. <br><br>Overall, this movie isn't a masterpiece, but it's worth watching with a bag of popcorn.","user":"jaceodemedici","rank":[6,6]}]