[{"title":"What a waste of actors' and viewers' time!","rating":2,"date":"29 April 2013","review":"My wife suggested we go see this movie, after all, you have to work really hard to spoil something with De Niro, Keaton and Robin Williams in it, right?<br><br>Well, apparently not. Just throw together a completely meaningless plot, fill it with a couple awkward sexual scenes, remove any hint of real feeling or nuance, and then fill what's left with numerous clichés that are worthy of a B porno flick - and you will get some idea of what \"The Big Wedding\" is like.<br><br>It's another one in the long and sadly ever-growing line of Hollywood fiascoes, built on the premise that it's enough to throw together a bunch of star actors to get a blockbuster. It's not. The feeling you get is that the film's budget was spent on securing the big hitters, and then a couple of hundred bucks that were left were given to some sex-obsessed teenager in high school, to write the plot. <br><br>As a result, this movie which claims to be a comedy, is a farce, a farce of what a comedy should be. After watching for a little over an hour, I left without finishing it. It was super boring, predictable and entirely unimpressive. Don't waste your time watching this grotesque concoction of nothing.","user":"derza77","rank":[141,193]},{"title":"The Big Trash","rating":17,"date":"17 August 2014","review":"Given the premise (deduced from the trailer) and the title I was thinking of skipping 'The Big Wedding' but it's got Hollywood's finest actors like Robin Williams, Susan Sarandon, Diane Keaton and Robert de Niro. Surely, the film is at least worth a watch for their performance, right? Well, a more appropriate title for the movie would have been 'The Big Disaster In the Name of a Movie'. Yes, it's messy, silly and...not funny. 'the Big Wedding' was sold as a romantic comedy wedding flick but the 'jokes' appear forced, desperate and lack originality. Moreover it pokes fun at Catholics, free spirited people and divorced couples. The aforementioned talented actors are wasted which is a real shame. The younger cast's performance ranges from average to poor. The set and outdoor sceneries provide some nice eye-candy. Loaded with clichés, pretending to be funny and wasting talents, this expensive film is kind of...well, trash.","user":"Chrysanthepop","rank":[15,19]},{"title":"More Like a Sitcom, and A Bad One","rating":3,"date":"26 January 2014","review":"Most of the other reviews are spot on. Get a bunch of big name stars plus some up and comers, throw them all together in a worn-out plot device of a wedding with lots of family issues, throw consistency and logic out the window, and hope for the best.<br><br>Deniro and Keaton play long divorced spouses whose adopted son Barnes is marrying the daughter Seyfired of a stuck-up family. Sarandon is Deniro's long-time live-in mistress who's catering the reception. Williams is a drunken, but conservative priest throwing out one-liners. Daughter Heigl just broke up and turns out to be pregnant. Son Grace is a 30-year old who you just know is going to fall for his step-brother's hot sister, who's visiting with his non-English speaking birth mother that everyone bends over backwards for for some reason, like Keaton and Deniro pretending they're still married. Everyone involved is horny beyond belief so sex is the main topic. That's the plot, if there is one. This is one hot mess.<br><br>Actually, there are a few laughs in this movie if raunch is for you.","user":"SeamusMacDuff","rank":[5,5]}]