[{"title":"As a teacher of philosophy I can assure you that this movie is definitely not philosophy","rating":4,"date":"17 March 2015","review":"Let me start by saying that I loved the concept of this movie, and the way in which they tried to bring this classic thought experiment to life. However, from both a philosophical and filmmaking perspective, the execution of this story was hugely problematic.<br><br>I am writing this review as someone who has been a passionate reader, student and teacher of philosophy for many years - and as someone who still regularly uses this very thought experiment as an educational tool.<br><br>1. At one pivotal point in the movie we are told that philosophy is not morality.<br><br>Not only is much of philosophy dedicated to questions of morality, but this entire film is built on a thought experiment that was created to endorse a particular moral philosophy - that of utilitarianism (consequentialism in particular). Such a basic and fundamental error of fact is absolutely unforgivable in a movie that is supposed to be all about philosophy.<br><br>2. The final iteration of the thought experiment is meant to show us that utilitarianism is a flawed moral philosophy, and that there are other ways of responding to the scenario it has set up.<br><br>However, our main protagonist is still using the moral philosophy of utilitarianism when she executes her new, and supposedly non utilitarian solution to the crisis - the only difference between what she does in the final round, and what the group did in the previous two rounds, is that she makes judgments about the worth of people and chooses them based on traits she deems to be of value rather than the trials that the class formerly deemed to be of value.<br><br>The key point though, is that she has still judged people's value based merely on the attributes they posses.<br><br>3. The group suicide at the end of the third solution to the thought experiment is not only more like homicide (in that she is the one who decides that everyone else will die), but it is also, once again, utilitarian in nature.<br><br>She has deemed that their life no longer has value based solely on the fact that they do not posses the necessary functions for rebuilding their brave new world (which is, ironically, exactly what the teacher was trying to get them to do the first two times, and exactly what she was supposedly avoiding with her third and final solution to the problem).<br><br>From a filmmaking perspective; the suicide bomb was also a very weird and contrived way to achieve that plot point - it was an event that completely violated the very rules which the film had created for itself up until that point.<br><br>It's one thing to completely change the parameters of the thought experiment as you go (to suit the plot development), it's another thing altogether to start conjuring up fantasy outcomes - an action which was not previously allowed/possible. <br><br>If she can conjure up a bomb for convenience, then why wouldn't she conjure up a life- saving text book, or a washed up (and functional) escape vessel instead?!<br><br>4. The 'thought experiment inside the thought experiment' that we had presented to us in the third and final round was:<br><br>a) completely out of tone with the entire rest of the film (it suddenly goes from dramatic thriller to an American Pie style slapstick comedy).<br><br>AND:<br><br>b) not actually a thought experiment at all - instead it was merely a sexual fantasy (thought experiments involve scenarios that are meant to be philosophically pondered and possibly solved - but what we saw was neither).<br><br>5. The remembering of the code in the third and final round of the thought experiment, by spying on the teacher at the end of the second round, was a complete violation of the laws of the universe the film had created (as well as a violation of how thought experiments work).<br><br>Even if you change or add to the parameters of a thought experiment in subsequent variations of it, what you are effectively doing with this action is creating a brand new thought experiment to be pondered and debated.<br><br>It's effectively a reset, where everything goes back to the beginning, except this time some of the fundamental parameters have changed so that different logical arguments are brought into play.<br><br>But having a character do something like steal a code from a previous discussion of the thought experiment, and then use it in a brand new discussion of a band new version, is nonsense at both a philosophy and filmmaking level - if she has the code, why is she also suddenly alive again when, at the end of the previous thought experiment she was killed in the process of acquiring the code.<br><br>6. The ending of the movie is terrible, and it really deflates what has been a solid effort at filmmaking up until that point.<br><br>a. We, the audience, despite not having been given any reason to do so, are suddenly expected to care about a creepy (and almost certainly illegal) affair that the teacher is having with a much younger student.<br><br>b. The nature of the character of the lead female suddenly undergoes a totally inexplicable 180 degree change, for no good reason, just so that a contrived ending can be executed <br><br>c. She ends by stating: \"you are a very good teacher Eric\", despite the fact that he is sleeping with students, has just been caught trying to publicly humiliate a male student he is jealous of, and has just finished threatening to strip her of the A+ grade she has earned simply because she refuses to join him in humiliating the male student he is jealous of. (And that's not even discussing the fact that he gave a female student he was sleeping with an A+ grade in the first place!)","user":"brendan-821-654855","rank":[57,64]},{"title":"Had a lot of potential but ultimately it was a let down","rating":5,"date":"20 January 2014","review":"The concept of this movie seemed promising; a philosophical thought experiment where you must decide who should live and who should die, all presented in a way that was both entertaining and involving for the audience. In the end though, I came away feeling that the script had been written by two people: the first 2 thirds were written by someone who did a crash course in philosophy and had only a vague understanding of the ideas they were trying to explore, and the final third was written by someone who manages to pull off the challenge of being unbelievably self-righteous despite their IQ of 70. <br><br>At the start, it (very) quickly glances over some other thought experiments which involve conflicts of rationality and morality (5 people tied to one train track, 1 person tied to parallel track, train coming down track with 5 people, but you have a switch that will change the track the train goes down to the one with only 1 person on, do you flip the switch?). They're well known to anyone who's familiar with utilitarianism, but anyone who's not covered them before will probably be left confused as to how the movie concludes immediately after asking the question that the switch flippers are murderers and offering no explanation as to why. But it's at least getting people warmed up for actively participating in the thought experiment rather than just being passive observers. <br><br>The main thought experiment, deciding who should get to live, is pretty interesting at first. Rationality and logic will be most peoples tools for deciding; the people who bring the greatest benefit to humanity should live. The movie then tries to test the boundaries of how far you'll stay rational for the greater good in situations which you may find immoral. Can 'bad' actions be justified if they're for the greater good (e.g. dropping the atom bomb to end WW2)? While this is good in concept, the script and characters fail to pull it off in a convincing way. The characters put up fights on grounds of morality in such petty issues that they come across as just being whiny children throwing a tantrum rather than humans stretched to the limits of what they'll do in pursuit of the greater good and finally drawing a line in what they can bear to justify to themselves as 'the rational thing to do'. <br><br>It was the final third that really ruined the film though. Up until then it may not have been great, but it was at least trying to explore philosophical problems. But at this point the self-righteous writer who can barely spell philosophy, let alone comprehend it, takes over. They completely ignore every concept of right and wrong the film has previously been exploring. The writer goes off on their own tangent with their view of what's 'good', which doesn't seem too bad at first, except it appears to be written by someone who has never actually stopped to consider why they judge something as 'good'. There is neither rationality nor logic behind their ideas, no concept of the greater good, in fact, you'd be hard pushed to find any interpretation of morality where the final writers 'good' may fit in to. It's just selfish, unbelievably stupid and defies any kind of logic. The writer isn't trying to write a thought provoking script, he's trying to write a 'feel good' story that ignores reality and is completely unrelated to anything previously discussed in the movie. I believe the writer was trying to convey something along the lines of rationality and logic not being the gold standard when it comes to morality, but he failed in showing anyone why this might be. His attempt to show this may have actually being so poor that, inadvertently, he actually reinforced the importance of rationality. <br><br>I think the movie does deserve some credit for presenting a story that will get viewers thinking about some interesting concepts, for that I would still recommend it for people unfamiliar with philosophy, but if you are familiar with the concepts covered then I don't think it's worth watching as it will add nothing new to what you already know and will probably end up just irritating you.","user":"Miike1","rank":[203,245]},{"title":"Wasted potential","rating":3,"date":"1 May 2014","review":"I admit I had very high expectations for this movie, simply because I love riddles and movies that stimulate one's brain. Sadly, it was a huge disappointment.<br><br>At the beginning, the movie seemed pretty promising and I rather enjoyed it till about the middle. That's when things started taking the turn for the worse. For all the logic that movie tries depict, it truly lacks that very same logic badly. There were so many absolutely illogical and dumb scenes I can't even begin to name them. What was a highly interesting scenario with great potential became just another one of these movies you are likely to forget pretty soon. <br><br>I enjoyed it while it lasted, with the exception of the ending (I'd rather they just deleted it all together), and the acting was pretty great, too. Over all, it's entertaining to a certain degree but don't expect anything mind-blowing. The movie doesn't live up to what it promises.","user":"valsna-885-781431","rank":[35,40]}]