[{"title":"Powerful, intelligent documentary","rating":9,"date":"3 January 2017","review":"Powerful, intelligent documentary around the huge effort to head off the start of the Iraq war, and the lingering echoes coming down from the protest marches of tens of millions in hundreds of cities of around the world on Feb. 15, 2003, the largest world-wide protest ever. <br><br>While the first half of the film shows how that wonderful show of massive human unity failed in the short term to stop that terrible war based on false evidence – a truth which is a terribly sad to re-visit - the 2nd half of the documentary combines anger and optimism in equal parts to show that those efforts made were not in vain in the larger picture. <br><br>From showing how the protests in Egypt against the Iraq war laid the groundwork for the successful uprising against the Mubarek government 10 years later, to the recent turn where the UK Parliament refused to give support for U.K. military intervention in Syria –- members of the government openly afraid of repeating the errors of 2003. <br><br>As the film points out, the fact that tens of millions of people were right that the war was unnecessary, the fact that Tony Blair is now seen as having been part of one of the biggest military disasters of the last 100 years has made members of government scared of repeating that debacle (hence also Obama's reticence re Syria). But if those millions hadn't raised their voices back then, if no one had seemed to care, then the fear and 2nd guessing that governments are showing now might not have happened, and further needless military adventures may have ensued. <br><br>At a moment when it feels like peaceful protest and citizen empowerment movements are all but pointless and impotent, the film is a welcome balm pointing out that the reality is more complex, and giving up in despair is neither wise nor called for. <br><br>The fascinating and moving interviews and commentators include John le Carre'. Stephen Hawking, Tom Hayden, Noam Chomsky, Archbishop Desmond Tutu, Jesse Jackson, Ken Loach, and most amazingly Colin Powell's Chief of Staff from the Bush years Lawrence Wilkerson, who says he would like to see Bush, Cheney and Rumsfeld tried for war crimes - even if it meant he'd be put away too – and would gladly testify against them. An astonishing moment.","user":"runamokprods","rank":[5,5]},{"title":"Hugely Significant Film Making","rating":8,"date":"19 August 2015","review":"Brilliantly seamed documentary, anyone who cares about global humanity should watch this. Some documentaries are said to change the world, this one makes subtle yet hugely significant changes in us which could have its part in changing the world. It is important to come back to these events that seem to disappear for the majority of us, not too long after they happen. It is important to reflect on our history and review the stance we did or did not take at the time. We Are Many is a reminder of the atrocities we can choose to or not to take part in and says that if we choose to respect life, there is probably millions of other people that feel the same way. <br><br>Thank you to everyone involved in the film!","user":"imagematters2010","rank":[19,27]},{"title":"Brilliant documentary- First war where protesters were against war before it even began","rating":10,"date":"10 October 2016","review":"It is wrong to assume that this documentary is just about the activists and protesters around the world; Archived footage of George Bush, UNHCR comments It shows the resignation speech of phyllis Benis - Institute of Policy Studies<br><br>Phillip Sands, Professor of Law University of London; Explains the document (legal memorandum) of Lord Goldsmith declassified tells the British Prime minister 'you cannot use force without a further security council resolution'<br><br>It also includes veterans against iraq war and their perspective during 2004,2005,2006.","user":"apparition-05824","rank":[7,10]}]