[{"title":"Getting a Bad Rap","rating":8,"date":"13 July 2013","review":"Brilliant! An awesome political movie; if you didn't like Rob Lowe before this, you will! This isn't a political drama where the stage is set on the candidate being in your face; the main focus. You won't see all the bells and whistles, big budget fight &amp; gun scenes, and worn action dialog. Rather, this is a political drama built around dialog and characters. The main characters aren't the machine; moreover, the main characters are the cogs that run the machines. The reason comparisons to Primary Colors or Game Change doesn't work is because only thing in common/related is the political storyline. After watching there is a slight bias; however, Worth a DEFINITE watch!","user":"phillybug_23","rank":[17,22]},{"title":"It's dangerous to believe your own nonsense","rating":24,"date":"24 June 2017","review":"The first rule of satire is remember that it's satire. Because there are three types of political movies. One, the Mr Smith Goes to Washington true believer movie; two, the anti political nihilist flick like The Parallax View and lastly, the satire. The two points you have to include in a satire are a, humor and b, a broad sense of farce. The problem this movie has is that it started with the goal of being satire but halfway through it drank the Kool Aid and capitulated to becoming Mr Smith. By the end, the people we're supposed to be poking fun at have become moral crusaders for the forces of good and all the things we were poking fun at have become virtues. It's neither one nor the other but a watered down mixture of both. The dirty tricks and outright crimes they commit are swept away as nothing more than data points on the road to moral supremacy. If your cause is just then not only do the ends justify the means but the dirtier they are the more virtuous the end. So without understanding how or that it is this movie becomes the most nihilistic of them all.","user":"xhidden99","rank":[3,3]},{"title":"Campaign spin","rating":4,"date":"13 January 2016","review":"There have been recent political campaign movies such as The Ides of March which had a more heavyweight cast. There are classics such as Robert Redford in The Candidate. Knife Fight reminds me of Sidney Lumet's Power from 1986 which also had a high calibre cast but a tepid reception by the critics and at the box office.<br><br>Rob Lowe plays Paul a highly sought after, cynical and ruthless election strategist. He declares, 'To win in politics, you have got to be the person who is willing to bring a gun to a knife fight.' Which is something Sean Connery said in The Untouchables before being shot a 100 times!<br><br>Paul can deal with any political disaster presumably such as those handled by the campaign team who dealt with Bill Clinton when he ran for Presidency the first time round, when his team realised that their was hardly any woman left in Arkansas that he had not slept with. In fact Chris Lehane, one of the co-writers was an aide to Clinton and Gore.<br><br>Paul deals with winners and over the years he has become jaded, cynical and has little time for people who are altruistic.<br><br>Things change when he takes on a doctor who runs a free clinic as a candidate for Governor and who tweaks the last shred of idealism left in him. Otherwise there are the usual politicians running for elections who are philanderers or are caught in some embarrassing situations that Paul needs to spin out.<br><br>The film is underwhelming and never strongly registers as the script is limp. Lowe underplays his role but apart from Carrie Ann Moss's idealistic character the rest of them are shallow and mean and they are supposed to be liberals as well.<br><br>As a political satire it does not work as it is not funny or biting enough. Even with story of the doctor you can guess the twist rather easily.","user":"Prismark10","rank":[3,4]}]