[{"title":"Great, Great Zvyagintsev again !","rating":10,"date":"23 December 2011","review":"First I'd like to say that I really understand the point of all disappointed Zvyagintsev fans after his two previous films:Izgnanie and Vozvrashchenie .These movies were \"global\", not only Russian, but \"for all people\". <br><br>This movie is strictly Russian and thats why people did'n like it. In my opinion this movie shows the real greatness of this wonderful director Andrey Zvyagintsev. He could continue making \"global\" movies \"for the world\". like Iñárritu or for the end of it like LvT, but he is a Russian and he made film about the moral situation in Russia.<br><br>In 2009 Zvyagintsev was offered 8 million $ from producer Oliver Dungey to make a film for the end of the world like \"The Sacrifice\"1986 .I guess that LvT took the money and did \"Melancholia\".Instead Zvyagintsev did \"Elena\", and this is the end of the world for him: \"the end of the world as we know it\" as Charles Foster Kane is saying.\"Elena' is the end of the \"moral world\" as we know it, at least for Zvyagintsev.<br><br>This film is about existential values, no other values exist in post-communist, pseudo-religious Russia.There are only TV values.We can only hear the \"TV preachings\" throughout the movie and actually see the screen just at the end when the family stays at the apartment of the killed man.So what happens: A rich man is killed by his wife who is a former nurse, because he do not to put her in his will and the family of her unemployed son with three kids will stay without support.<br><br>\"The last will be first.\" says Elena just before to kill in cold blood his husband. The mother will do everything for her child and grandchildren. Love is evil,like Zizek says.In the name of love ,millions of people has been killed.The love towards one is hatred towards somebody else.The main principle in universe is scarcity, Sartr says.There isn't enough love nor yet enough money for everyone.So what we people do? We kill.We kill for money,we kill for love ...we kill for oil!\" A time to kill and a time to heal. A time to tear down and a time to build up.\" like they say in the Bible. <br><br>This movie is a mixture of \"The Shop on Main Street\"1965, \"Crimes and Misdemeanors\"1989, \"Uzak\" 2002 and \"Cargo 200\" 2007 so before to judge \"Elena\" please watch these movies first.<br><br>I think that \"Elena\"it is a real 21-st century film.It is film about \"The banality of evil\". Evil which is part of us all, the evil of everyday life. It is an open question of the moral values of the contemporary society. The question is coming from Russia and from all the former communist countries : How to live now ,when the \"evil empire\" of communism is dead. Where is the moral superiority of the capitalism? In the \"world with TV Religion\" is it OK to kill an old and ill man and to take the money in the name of children? <br><br>GREAT GREAT FILM.THANK YOU ZVYAGINTSEV.","user":"peppyaiolov","rank":[76,92]},{"title":"Well done worth seeing.","rating":8,"date":"16 September 2015","review":"Most of the complaints about the movie fail to realize that sometimes, in more artistic works time, lighting, limited dialogue are used to create a mood. This move had a very interesting message, and in order to demonstrate the predicament that Elena is in. I could relate to her and how she felt that she was used and that her step daughter takes things for granted. While Elena is a very modest women who is looking out for the best interests of those around her.<br><br>I did enjoy the film, and as with most foreign films I enjoy the lighting the music and the overall feel. This goes a long way in order to transport us to another time and place. I actually felt for Elena right from the start of the film.<br><br>You must see in order to understand but I hope you get as much as I got out of it.","user":"nikkd","rank":[9,10]},{"title":"Fascinating ambiguity","rating":10,"date":"1 February 2012","review":"This movie is great, slow but beautiful, but the ambiguity is the best part, all the themes are condensed in the first and final frame, think about it, what is worth? the welfare of many aside his flaws or the coldness and sterility of few.<br><br>The atmosphere is hypnotic.<br><br>All the characters have reasonable grounds, all are ugly but very real.<br><br>The synthesis to show the decadence and disillusionment of Russian youth is strong<br><br>the performances are outstanding overhanging the main female character which we do not know if understand or condemn and even though the couple has some reason the mother instinct is prevalent, is simply a game of survival.","user":"es_dp","rank":[37,53]}]