[{"title":"Redemption in a glass","rating":9,"date":"10 June 2012","review":"I've always liked Ken Loach's films, but this one is special. Set realistically in Glasgow, it could be set in virtually any major city in the UK with only minor tweaks (kilts apart). As with most of Ken's work, it's essentially about the infinite redeem-ability of the human spirit, given half a chance.<br><br>Comparisons are being made to the Full Monty, but I don't quite see that. If anything, it's a far better Trainspotting, with jokes to replace the parts you hardly want to watch. It's hilariously funny and if you don't blurt out at least one guffaw during the film, you are dead from the neck up. At the same time it is not a \"feelgood\" movie as such, because it faces the stark realities of the situation of the main character head on. Their lot is fairly hopeless and unlikely to get much better.<br><br>Inevitably in a film designed to fit within the constraints of the medium, it compresses far more than is sensible. More development of the way Robbie comes to understand his options would have been better, as would his growing relationship with Big Harry. You can forgive that, as otherwise it would have been a 10 part series for TV. Budgets are tight and we all know that this would never have made it.<br><br>I raise a glass to Ken, we need more like him. A man who reminds us so well how the world can be a better place, rather than just telling us how bad it is. That's really the Angels' Share, after all.","user":"rhjones004","rank":[55,66]},{"title":"A Film with Heart.","rating":7,"date":"30 May 2012","review":"My main conclusion after watching The Angel's Share is that I haven't seen enough Ken Loach films.<br><br>Obviously I was interested to see The Angel's Share given the Scottish setting and the little bit of hype that the film has received here through its appearance at the Cannes Film Festival. I wasn't disappointed by any aspect of the movie and would recommend it to anyone.<br><br>The characters are real and the acting is hard to fault. The film strikes a great balance between highlighting the mistakes the main character, Robbie, made in the past and not being overly sympathetic, and at the same time recognising that he deserves a chance to build a better future and put it all behind him. The inclusion of the scene where Robbie is confronted by one of his former victims and the victim's family was inspired.<br><br>All of the performances given are believable, but i'd reserve a special mention for John Henshaw, who plays Harry. There's an almost intangible sadness to the character where you know he's also trying to make up for earlier mistakes in his life, although the film never goes into details. Very understated and poignant in parts.<br><br>Above all, this is a film with heart and has something for everyone.","user":"alangsco","rank":[45,56]},{"title":"Fools rush in...","rating":7,"date":"7 July 2012","review":"Yesterday was my birthday and this was the film my wife and I decided to go out to watch, even if it seemed almost all the other screens at our 'Plex were showing \"Spider Man\". I think we made the right choice. It probably helped our enjoyment being from Glasgow enabling us to play \"Spot the Location\" as you invariably do in these situations and of course our familiarity with not only the \"types\" portrayed in the film but also their what I'll politely term vocabulary and vernacular.<br><br>What it is at heart is a caper film involving four young offenders who as part of their \"community pay-back\" sentences get taken under the wing of a good-hearted middle-aged \"minder\" well played by John Henshaw and learn that they have a penchant for whisky-tasting after a sponsored visit to a distillery. From there, they hatch an unlikely plan to steal for a private collector extracts from a rare cask which takes them up to the islands on an intrepid mini-\"Mission Impossible\", which after some ups and downs ends happily for all.<br><br>The film displays Ken Loach's by now usual mix of naturalistic realism with everyday settings and improbable plotting with attendant unlikely coincidence along the way. The film starts with a couple of violent scenes to fully convey the tough environment from which the protagonists are seeking a way out but changes into a different film altogether when the four decamp to the Highlands to carry out their ingenious theft. That dichotomy in retrospect seems a little forced at times and the coincidental nature of the plotting which affords them their once-in-a-lifetime opportunity stretches credulity as it settles into almost Ealing-esque territory but it's carried off with some flair and conviction with a nice human touch at the end to send everyone home out of the cinema with a \"feel-good\" smile on their faces.<br><br>The ensemble acting is as usual with Loach of a high standard. Paul Brannigan as the brains behind the misfits shines but each of the four comes across with their own personality. The dialogue is sharp and up to date with some funny set-pieces thrown in too, particularly those involving the wrong bike and how a recovering junkie slaked his thirst.<br><br>Overall, once you suspend disbelief at the plot development and denouement, this is an easy film to settle down and enjoy. My wife and I certainly did, happy birthday to me!","user":"Lejink","rank":[32,39]}]