[{"title":"'Good Vibrations' Excellent movie, highly recommended viewing, Not just for old punks and hippies!","rating":10,"date":"9 June 2012","review":"It's the morning after the night before, and I'm feeling more than a little fragile as I may have overdone the celebrating a bit. I very rarely drink at all, but I got caught up in all the reminiscing and nostalgia last night. My head is splitting and I'm croaking like frog, yeah! As you've probably already guessed it was a killer night. <br><br>The'Good Vibrations' movie has been a longtime coming - jeez, the film has been in the pipeline for around 13 years and it's been over two years since the excellent 10 minute fund raising pilot film was made and then screened one Sunday afternoon in Feb 2010 at the 'QFT'. Understandably I couldn't wait to see this film. <br><br>I'm absolutely delighted that the 'Good Vibrations' film is here at last, and not only is the movie making its high profile red carpet debut it's also launching the 'Belfast Film Festival. For the first time ever there's a big screen erected especially for the premiere in the historic Ulster Hall which is celebrating its own 150th birthday this year. There was TV coverage all through the glorious day on the local news bulletins. which is not surprising as this is the true (ish) story of a most unlikely Belfast anti hero &amp; the hottest ticket in town for quite some time. Requests to attend the premiere far out stripped supply so two more screenings were quickly arranged (&amp; sold out) to cope with the overwhelming demand. <br><br>It was great to catch up again with the ex punks / Harp Bar regulars from that time as we were the kids that lived a confrontational and exciting lifestyle during a very dangerous time. We did hang out in the Good Vibrations shop, we pilfered the posters from the staircase wall, and we did buy our 45's, fanzines etc etc from the man of the moment himself. <br><br>The writers and producers totally understood from the get-go just how important this movie was going to be to a generation of kids who stood together studded shoulder to shoulder before and alongside 'Terri Hooley' kicking against the pricks, they treated Terri and the punk's tale with empathy, respect and some very dark humour. Certain scenes in the movie were laugh out loud, while others like Gordi Owens visiting the shop for the first-time and then the subsequent 'Rudi' gig in The Pound just lifted my heart, it was so vivid and evocative of that great time. The sinister side was Terri's beating by two skinheads, which was very realistic, vicious and hard to watch gritty film-making. <br><br>Now the important question everyone is asking \"did the 'Good Vibrations' film live up to all the hype &amp; expectation?\" Of course it did, and as you'd expect it has an exceptional soundtrack. <br><br>There was a long and well deserved standing ovation for all the main players who were all brought on stage together and seemed genuinely taken back &amp; moved by the ecstatic reaction to their little independent film which is now set to go global. Richard Dormer is a revelation, he is so realistic and believable. He actually does Terri better than Terri himself does, and if justice is done this will be recognised as an award winning performance by the movie industry movers &amp; shakers. <br><br>My son Steven ($$) and I can't thank Lisa Barros D'Sa, Glenn Leyburn, David Holmes &amp; Chris Martin enough for giving us the opportunity (even though we weren't actors) to participate in the film, they are four really talented and very nice people, we are very grateful indeed. '$$' and his pal Chris Smith (plus my authentic punk era 'Rudi' logo emblazoned leather jacket) got the chance to reprise their roles from the original pilot film, only this time on the hallowed Ulster Hall stage. '$$' also spent a very long day back in September 2011 down in Dundalk filming his part as the 'Rural Punk Kid', which is in the finished movie. I was more than happy to be in there as my teenage punky self in a 1979 'Something Else' TV clip with the real 'Rudi' and to be included in the end credits vintage punk photo reel.<br><br>Yeah! I've really only commented on the musical aspects of the film here because of word limits, but Terri's non punk private &amp; personal life during this time period is also featured heavily throughout. <br><br>Congratulations to everyone involved with 'Good Vibrations', you've delivered a movie we can all be proud of.<br><br>For anyone who hasn't had the pleasure of meeting 'Mr Hooleygan' he is a real one off character, a storytelling socialist press darling anarchist local legend, and possibly one of the worst business-men ever. But through thick &amp; thin and with eternal optimism he has kept the 'Good Vibrations' name alive as a legendary brand. The actual 'GV' record shop still exists and resides in its current form on Royal Avenue in Belfast City Centre, and rumour has it the record label is set to return. The fact that regardless of the location he's still out there doing it 36 years later is his two fingered salute to the world, because he's never let the bastards grind him down. <br><br>31.5.12 was the real celebration. 'God Save Terri Hooley'.","user":"punkyjoe","rank":[35,42]},{"title":"An interesting life...","rating":7,"date":"31 March 2013","review":"War, poverty, desolation.<br><br>When everything looks dismal and negative, how can one escape and persevere? Through music of course.<br><br>Terri Hooley had the answer to the misery of his time. By opening a record shop and encouraging locals to create new music he provided an antidote to the gloom and became instrumental in establishing the Belfast punk scene.<br><br>Some thought he was mad, but creativity and madness go together and without any regard for consequences he just stormed ahead driven not by materialistic ambition but out of love for music.<br><br>An inspiring bio faithfully brought to the big screen, that effortlessly brought a much needed smile to the audience.","user":"cinematic_aficionado","rank":[10,11]},{"title":"no matter what color your hair, no matter what your religion","rating":8,"date":"17 February 2013","review":"'It didn't matter what color your hair was, or whether you were a Protestant or a Catholic, it just mattered that you were a punk.' This was and probably still is the motto in life of Terri Hooley, the man who inspired the film Good Vibrations directed by Lisa Barros D'Sa and Glenn Leyburn, whose screening was occasioned by the British film festival.<br><br>We are introduced in the atmosphere of the 70s by a number of newsreels of the period. While the flower power, pop, hippie movements were winning over much of the world with their message of peace and non-violence and with their music times were tough for Northern Ireland where the religious conflict entered in a violent phase which was going to leave more then 3000 people dead on all sides. Terri Hooley comes from a political involved family, his father was an idealistic Communist, and Terri loses an eye as a kid in a hate act. His great passion is however music, and with music he tries to bridge the gaps between communities, to bring together people around good and beauty, to what should be normality in a world of conflict and violence. And then the opportunity shows up, as he discovers the young people trying to escape the constraints of the society but also of the conventional culture and express themselves and their feelings in in the visceral and straight roughness of punk music. Hooley will help the emerging Northern-Irish punk bends record and distribute their music, and transform Belfast in one of the punk capitals of the world. Suddenly the city known in the news only for conflict and violence becomes a point of cultural interest, a stage for new and innovative music which crosses communities, religions, and haircuts.<br><br>Good Vibration is a simple and direct film about the power of music, about the capacity of doing good in evil times, about the beauty and necessity of escapism. Actor Richard Dorner draws a passionate portrait of a man who lives for music, who believes that music can bridge and heals. It is not an idealized portrait, as family life falls victim to Hooley's passion, and this aspect is not neglected. It's not a perfect film, some of the supporting characters could have been developed for example, but overall it's, well, a film that passes good vibrations. And there is a lot of music of course, I have never been a fan of punk, but I may become one.<br><br>According to the news a few months ago Terri Hooley was attacked and abused in his neighborhood in Belfast. Even if 30 years after the troubles the situation in Norther Ireland is much better than it was, healing and reconciliation may have their chance, sequels of the past still show up and the balance is still fragile. The Good Vibrations shop of Terri Hooley opened and closed a few times. Life has ups and downs, but good sometimes prevails.","user":"dromasca","rank":[15,19]}]