[{"title":"better than IMDb rating indicates imo","rating":7,"date":"3 September 2013","review":"after watching I was surprised by its low IMDb rating (5.6 currently). I liked it, it held my attention, felt on its own it was entertaining and was one of those I think to myself \"I'm glad I watched that\". I'm not a film critic or film-making buff so don't know mechanically what makes a movie good, it's more a thing of you know it when you see it.<br><br>to be fair before writing this I read some of the less favorable reviews and can see they have their points. but in imd-land the mid-5s kinds of movies are getting into the range where a movie is clearly not well-thought of and it's hard to see how that can be true of this one. also I don't watch previews/trailers or really read much besides the brief IMDb synopsis at the top so maybe my lack of expectation helps.<br><br>I watched this because I like dennis quaid, he's one of those actors that on the screen I find easy to like and his performances are usually good. this isn't the kind of role I'm used to seeing from him (the clever/charming/gregarious kind of guy) but I thought he played it quite well.<br><br>the overarching theme seems to be there's no overarching theme. it was more or less an hour and a half of stuff involving people that happened to be in iowa, some of which happened to be farmers. it didn't seem to me it was pushing any kind of viewpoint, we just get to witness some unusual things that can make one think \"what would I have done in that spot?\" it almost had the dryness of a documentary in that there's no crescendos (musically or otherwise) trying to tell the audience what to feel where. to me the movie was more about what's inside the characters rather than what happens externally when they interact. from that standpoint I wasn't put off by some of the disjointedness other reviewers rightfully point out.<br><br>I did notice in hindsight once the movie was over that much of it seemed formulaic and had many of the kinds of twists every other movie has, but what struck me was being engrossed enough that as it unfolded I didn't really notice until it was over with.<br><br>bottom line for me is it was entertaining and worth the time spent watching it.","user":"mdixon","rank":[11,11]},{"title":"unbalanced unfocused script sinks it","rating":5,"date":"16 April 2013","review":"It's a story where the characters aren't sympathetic and seem to create all their own problems. None of their problems are all that involving either. So what's to care about? The script is poorly structured taking to long to set up the situation while at the same time failing to set up some key characters that come into play in the rushed final part of the film.<br><br>Quaid is very good, sometimes a bit mannered though he's supposed to be playing a kind of obnoxious salesman so that's part of the film can be accepted as being done on purpose. I heard the director speak after a preview screening and he mentioned the influences that kind of create the problem with the film. DEATH OF A SALESMAN meets THE LAST PICTURE SHOW with some Robert Altman thrown in. If you know either of these classic pieces of writing you might guess this isn't up to either of those standards and it's not. If you don't know those films it won't make it a better film. The film wastes too much time setting up the characters all of whom are unlikable selfish jerks for much of the film. The key dramatic incident comes too late--and won't be revealed here--and is left dangling at the films end. The one son, played with no depth, by Zac seems to be the focus of the story for too long and then is kind of pushed back and other characters take over. Aside from him there is little to fault with any of the acting. <br><br>One other key character, Quaid's Dad, appears out of nowhere in the film--you'll actually think he's been dead for years and years the way people talk about him until he suddenly shows up, and Heather Graham's character just pops up and pops out of the story with little logic aside from some kind of possible sexual interest, though there is no nudity in the film and the story doesn't go in that direction ultimately. Both of these characters need more thought on a screenplay level.<br><br>Some odd details here and there successfully touch on Robert Altman but those are just minor details of how modern farming works amid a messy script.<br><br>There is just little to hold your interest for far too long in the screenplay. Digital photography is OK but has a bit of a video edge to it and doesn't do the actors any favors in close up either. The film could use more and a better music score. The film ultimately is forgettable.","user":"HEFILM","rank":[28,38]},{"title":"Quaid shines along with Efron...","rating":7,"date":"10 April 2013","review":"Writer/Director Rahim Bahrani, responsible for the indie hit, Goodbye Solo (2008) puts some of his best cinematic qualities to use in his newest film At Any Price starring Dennis Quaid and Zac Efron. Bahrani's take on mid-western culture is at times fascinating though has many instances of feeling like a Lifetime movie of the week. Layered with narrative vices and escalating tension, the true savior of the film is the powerhouse performance by Quaid.<br><br>Telling the story of the Whipple's, a farming family whose agriculture business is threatened by an impending investigation of their fields and the procedures they follow. In the midst of the ordeal, the relationship of a father and his rebellious son (Efron) is tested to their max. Bahrani's interpretation of modern-day Iowa and the communities that surround is an interesting examination of American values that he respectfully caresses however; he does tend to lean on the clichéd dialogue of family melodrama with short cuts and unrealistic story developments that don't do him or his characters any favors. Dennis Quaid is an interesting anomaly of an actor that hasn't made his due with the major awards. After fearlessly diving into a character that's self-centered, wretched, and downright degrading, Quaid outdoes most of his earlier works of cinema. The journey that he takes pitiful Henry down is a testament to his dedication to the craft. Magnificently portrayed and later moderately redeemed, the performance stands as one of the best turns of the Tribeca Film Festival and the first quarter of 2013.<br><br>Zac Efron is a horse of a different color. Efron has struggled in his attempts to serious acting like last year's The Paperboy (2012) and Charlie St. Cloud (2010). Efron puts forth his best effort as an actor so far as the young, rebellious Dean. He's going through an interesting transition as Efron is discovering his abilities and becoming aware of his boundaries as an actor. Dean lets loose when he needs to and still gives off a sex appeal that doesn't feel forced and very much accessible for the viewer.<br><br>Co-stars Heather Graham has seemed to have gotten stuck in the same, type-casted, underdeveloped female role that doesn't hint at any of the promises that were made in when she came into our cinematic minds in Paul Thomas Anderson's Boogie Nights (1997). Newcomer Maika Monroe shows hints of promise in her limited role but is held back by contrived conversations and confined emotional abilities. It's also great to see veteran actor Clancy Brown still delivering strong work in his later years. A brief but memorable turn that reminds us about the talents of a wonderful character actor.<br><br>Overall, the story is respectable and tolerable. Bahrani is a noble director that may be able to shine in brighter and more ambitious projects in the future. The true gem of the picture lies in the multi- dimensional performance of Dennis Quaid and the surprising effectiveness of Zac Efron. Cinematographer Michael Simmonds also manages to acquire some graceful and ravishing shots of the serene farmlands of American agriculture. A technical merit worthy of a mention. A commendable and skilled work.<br><br>At Any Price is simply gratifying. A must-see of the Tribeca Film Festival. Check out the trailer below. The film opens in theaters on April 24th.","user":"ClaytonDavis","rank":[23,31]}]