[{"title":"Cleaning up","rating":8,"date":"12 April 2012","review":"The movie says: Don't clean up the mess, as in let the world see what happened. As you can tell by that, the movie is based on true events. Very harrowing and very powerful. The performances are pitch perfect. Small events enroll and you can see that something big will happen. The movie emphasizes that one scene is very important (one event if you wanna call it that) and it gets repeated. Now don't judge the movie on the bad cgi in that scene, if you can.<br><br>And as the other reviewer has said, it might have its flaws, but its message is very clear and it should have played at the big screen at the Berlin International Film Festival. The other reviewer also stated there's another movie called Summit, which I know will seek, which seems to be reveal even more of what happened, but more in a documentary style. This one reminded me a bit of the American movie \"Battle in Seattle\" ...","user":"kosmasp","rank":[22,23]},{"title":"I never cried in a film before","rating":10,"date":"13 March 2012","review":"Seriously. I walked out of it somewhat disorientated and still shaken. I saw 'Diaz - Don't clean up this Blood' about a month ago at its Berlinale Screening and it still haunts me. I could tell that most of the audience shared my feelings and some even left the cinema, because they couldn't bear what they were seeing. Nevertheless the applause was extraordinary. <br><br>We have all seen our fair share of violence and cruelty in the movies. But this is a completely different pair of shoes. The non-fictional background of the film plot concerns me personally, both as a human being and as an European citizen. It's hard to imagine this happened ten years ago in a Western European country and yet it DID happen and it could - and probably will - happen again. That's why it is so important to deal with the topic of police violence instead of ignoring it or playing it down. The film crew and cast did a great job capturing the horror of this disastrous event. And that's what 'Diaz' mainly seems to be about: re-creating and contextualizing the occurred violations of human rights in 2001 in Italy as authentic and accurate as it can be done in a feature film. <br><br>It obviously wants you to be shocked, but with good reasons: it describes shocking incidents, which should not be trivialized. If you do some research, you'll find out that the film indeed does not exaggerate anything. But it does NOT inform you about the political background, you have to inform yourself. And I think you will, after you've seen it.<br><br>'Diaz' is not entirely flawless, but it could be a film of great significance, provided that it motivates the audience to read up on the subject.<br><br>If you're interested in a less gripping, but much more informative approach on the matter, check out the documentary \"The Summit\" (2012).","user":"catacomb-kitten","rank":[42,48]},{"title":"Diaz raid in Genoa in 2001 shown with violent visuals in full force. Much more than a documentary due to personal stories behind the dire event","rating":9,"date":"5 November 2012","review":"The film \"Diaz – Don't clear up the blood\" had its world premiere in Berlin, as part of the Berlinale 2012 film festival, in front of a full house with an estimated 1,750 viewers. The screening ended with an overwhelming applause, that lasted for an unusual long time. A considerable part of those involved in making this film was present. In his introduction the director mentioned that several victims of the raid were among them. He admired their preparedness to relive the dire event.<br><br>The film title has two parts. The first (Diaz) part refers to the name of the school where the raid took place. The police thinks it is a nest full of \"black bloc\", allegedly being the core of demonstrations around the G8 summit in 2001 in Genoa (Italy). The second (Don't clean...) part refers to a hand made sign that was written on the wall after the raid, actually asking to keep intact what was left behind. That included large blood stains all over floors and walls, very useful as indisputable contradictory statement against the police PR.<br><br>A clever scenario circles around what happened, rather than treating events chronologically. An important feature of the film is that we were introduced to miscellaneous persons having specific roles later on. This served as a binding element, elevating the film above a simple documentary. As the director said: due to these minor roles, you better remember the events afterwards. We see for example an elderly tourist, who got detached from his bus tour and was only looking for a place to sleep. Another example is a journalist from a right-wing magazine, taking leave to report from the inside out. Many more such personal stories develop along the line, working out exactly as the director mentioned.<br><br>We were also offered an impression how average policemen stand in this. The tone is set in a scene where we see how a police car gets lost in some neighborhood they better stay out. They are immediately surrounded by angry citizens calling them \"murderers\", the result of a recent event where one person was killed in the course of a demonstration. The policemen feel threatened but escape unharmed.<br><br>Also from a law enforcement viewpoint, but on a different level, we observe several decision makers (district attorney, police commanders, city council, etc). They had to depend on biased reports from police officers, finally deciding to proceed on very weak grounds, but \"we must do something\". Various evidence was planted to support their decision, or declared solid evidence later on. Benign empty bottles were allegedly stocked there for making Molotov cocktails. The PR aftermath from the police was evidently biased too, Best example were remarks about prepared wounds, said to have already existed before the raid, with express intent to blame the police later on. Of course, speaking of obvious bias is easy for us to say; we had ample chance to see the general picture from both sides.<br><br>The actual raid is visualized in full force, about halfway the two hours running time. What we see before and after this core scene, continuously circles around it by showing whereabouts of victims and bystanders, and how they got involved. All are clearly innocent of the bad things the police attributed to them. They all happened to be at the wrong place at the wrong time. These personal stories, however small and trivial in the context of what is happening, work very well to elevate this film above a dry documentary that only states facts.<br><br>I could not help wondering how useful it is to show the raid in every nasty detail. One important reason is that pictures speak one thousand words. We can expect the impact on the average viewer to be much greater than only words. A second reason could be that the film clearly shows the needlessly exaggerated amount of police power put into force, just for a relatively small unarmed group. A perfect illustration was the scene were everyone was standing with hands above their heads, apparently believing that an explicit show of being unarmed and defenseless would suffice, but the police bulldozed over them regardless.<br><br>We witnessed a meeting of city council and law enforcement decision makers, giving a clear insight how it could come that far. The proof that lefties (not my words) were gathering was very thin (long hair, hoodies, what further proof do we need?). Also noteworthy was a statement from the police commander that he would be unable to control his men once in action. After that we saw a rather sketchy briefing for the policemen in the field, merely amplifying already dormant feelings that Diaz housed very illegal, near-terrorist actions. After such a biased preparation the heavily visualized police brutality within Diaz becomes a bit more understandable. The instructions to the policemen conveyed an image of illegality, with adversaries determined to plan demonstrations and other unlawful actions.<br><br>Part of the final credits were some statistics about policemen and other officials convicted for involvement in the action. That is how \"the system\" works, but I'm certain it took years to come to final convictions. And above all, it leaves us with doubts whether it will improve future decision making. And last but not least, it won't repair the (internal and external) wounds of the victims having to live on with the consequences.<br><br>All in all, an impressive document about the raid, providing very useful insights in what happened before and after. The various personal stories bring it to a much higher level than just a documentary. Also very interesting is that we see both sides, and the mechanisms involved how things like this get out of control.","user":"JvH48","rank":[17,18]}]