[{"title":"Cute-sy and punny...not bad actually","rating":7,"date":"30 October 2013","review":"I found the first movie unique and fun...the second was a bit less surprising but it was saved by the puns haha<br><br>Some of course might not like the lines but for me it was funny when needed :D <br><br>Everything was cute of course and was perfect for its intended audience (I watched this with at least 100 kids in the theaters...and all of them loved it..so much giggles and kid noise) <br><br>I was happy they didn't put much romance on it a hint as with the first movie but not overpowering to make it romantic<br><br>Storyline- hm well of course it is predictable and there aren't twist and turns you just know this will happen..it's a kids movie it should be simple with bright colors and lovable cute characters<br><br>and Cloudy 2 gave that.","user":"star_hazard","rank":[29,37]},{"title":"More Sugar, Less Vitamins","rating":6,"date":"6 August 2014","review":"Cloudy with a Chance of Meatballs Uno was a surprise success. It took great leaps away from the source material, but managed to be cute, funny, colorful, and heart-warming.<br><br>Well, at least the sequel is three of these things.<br><br>Cloudy 2 is filled with tongue-in-cheek puns, and honestly has some of the best 3D animation I've seen. Its true! Its better than the first, with attention to detail. All the food animals are bright, creative, and adorable.<br><br>The movie is just as fun as the last, perhaps even more...but, like most animated sequels, the plot and character take a nosedive. The first focused on love, inspiration, and family relationship. The second is the typical friendship shtick and has a strangely pro-vegan message. I mean, some of these food animals have human-like intelligence, but a lot are no different from chickens and cattle. :V <br><br>The characters are worse-off from the original. Brent, Manny, and Earl have no role in this film. Manny and Earl were at least funny, but Brent just spouted his \"UH OH!\" shtick. Flint and Sam are still friends, but it doesn't even seem like they're dating. Chester V is a stereotypical villain, although his physical, noodley actions were amusing.<br><br>If your looking for humor, cutesy things, or something to entertain the kids, its fine. The story isn't good, but its tolerable enough. If you're looking for the relationships the first one had, you might want to skip this.","user":"DonaldDooD","rank":[6,6]},{"title":"Too Cloudy This TIme","rating":6,"date":"18 October 2013","review":"The review: I wanted to like this movie. My oldest loved the first \"Cloudy\" movie, and I concurred. It had a very unique plot, some funny characters, decent supporting characters, and although lacking a main protagonist, everything worked well. Things don't work too well here.'The film picks off immediately where the last one leaves off. After saving his home island, Flint Lockwood (Bill Hader) wants to start a lab with all of his friends but is quickly swayed by a childhood hero of his who is a scientist with some uterior motives. This character (not just the voice or the appearance, but whole \"protagonist\" idea seems way out of character for this movie, at least when compared to the first one. In this movie, instead of out of control food, the danger is apparently \"foodamals\" which are mutated pieces of food that are also living. This just never really clicks for me. About halfway through the \"foodamals\" do start to get a little amusing and the rest of the movie is \"alright\" but fails compared to the first one. The protagonist here seems so out of place and annoying, it was really difficult for me to get over.","user":"moviescoundrel","rank":[6,6]}]