[{"title":"Highly watchable, and will be appreciated as a 'proper film' by older viewers","rating":8,"date":"21 May 2014","review":"The Two Faces of January is a gripping and highly watchable film which I would highly recommend. Set in the sixties, it is undeniably \"old school\" – a twisted tale of murder, treachery and double-dealing, based on the novel by Patricia Highsmith, where you half expect Alfred Hitchcock to appear in cameo at some point.<br><br>Viggo Mortensen (Lord of the Rings) and Kirsten Dunst (Spiderman) play Chester and Colette Macfarland a rich and affluent couple touring the sites and sounds of Europe, with us first catching up with them in a glorious looking Athens.<br><br>Appearing to be relaxed and happy together, they hide a dark secret that is about to catch up with them. Oscar Isaac – so fabulous in Finding Llewyn Davis earlier this year, and about to hit mega-stardom in the Star Wars reboot – plays American rogue Rydal, who seems to stare intently at Chester. Is he part of the impending storm, or just an innocent caught up in events he can't control? Tensions rise, not just because of the plot pressures but also because of the obvious sexual tension growing between the charismatic Rydal and Chester's lovely and much younger wife.<br><br>The compelling story – albeit somewhat predictable in places – takes in some fabulously atmospheric locations in Athens, Crete and Istanbul.<br><br>This is the feature directorial debut of Iranian-born Hossein Amini, who also wrote the screenplay – this being his forte have written a range of films including Drive and Snow White and the Huntsman. And what a good job he does, orchestrating location, lighting and music to great effect. Some of the editing is also very tight, cutting away from scenes at crucial points to maintain the story's mystery.<br><br>The trio of actors also bring great star power to their roles. Mortensen and Dunst are very watchable, but it is Isaac that again really shines in his role. In turns enchanting, brooding and cowed like a cornered animal, he plays the perfect James Stewart character in this Hitchcockian homage.<br><br>In the coming blitzkrieg of summer blockbusters, here is a jewel of a film that will be particularly enjoyed by older viewers who remember when story and location were put far ahead of CGI-based special effects.<br><br>(If you found this review helpful, please see my other reviews and 'Follow the Fad' at bobmann447.wordpress.com. Thanks.).","user":"bob-the-movie-man","rank":[126,154]},{"title":"Enjoyable period piece","rating":7,"date":"24 May 2014","review":"I agree with an earlier reviewer that this film derives much of its effect from being set in 1962. The period feel is beautifully communicated and the plot needs to work itself out in a world where places like Athens, Crete and Istanbul were not just exotic but isolated, where holidaying Americans would still be surprised and interested to meet other Americans, and people on the run could hope to hide away. The chemistry between the three leads, who are all well played, does lack fizz and there is a clumsy and rather hackneyed third act. But the film is never less than engaging and all the better for not resorting to surprise twists. The music tries too hard to be exciting, almost as if the director thinks the visuals need some extraneous help to keep the audience interested. I think he is wrong - there is enough going on here, including some fine acting and cinematography, to appeal to audiences who like films with substance, a trajectory, and a sound sense of place and time.","user":"hou-3","rank":[61,72]},{"title":"A pleasure to watch","rating":7,"date":"29 September 2014","review":"I have to applaud Hosseini's directorial debut. \"The Two Faces Of January\" takes us mostly to the 1960's Greece, with three main characters in focus.<br><br>Beautifully shot, this visually stunning period-piece (if I can call it that) relies on story and characters rather than trying to impress with extravagant plot twists and special effects. The narrative is very well balanced and restrained from the hyperactive traps of modern cinematic storytelling.<br><br>Good acting from everyone involved and my compliments to the music composer too, for providing a very fitting soundtrack. <br><br>This is classic film making. Nothing innovative but very beautiful to look at, a fitting choice to watch on a lonely evening.","user":"spaceman88","rank":[44,51]}]