[{"title":"What would Ayn say?","rating":4,"date":"13 October 2012","review":"After paying $11 to see ATLAS SHRUGGED at a local Cineplex, I felt compelled to write this review for IMDb. The earliest review for this movie I read for this movie appeared to have been written by someone who hadn't even seen the movie yet! (It was also posted the day before the theatrical release) In fact, the extreme polarization of the majority of IMDb users appears to be strictly along political lines, since most gave the movie either a 10 or a 1! It seemed obvious to me that neither perspective was likely to be accurate or helpful in assessing whether this movie would be worth seeing.<br><br>For full disclosure, I would consider myself to be a political moderate and a longtime fan of Ayn Rand's work. While I do agree with many of Ayn's sentiments about socialism, I do also resent the fact that her work is now being appropriated (and attacked) as some sort of political manifesto. Therefore, the film should be judged solely on its merits and faults – NOT because you're a liberal or a conservative.<br><br>The original 1957 novel was intended as Ayn's most extensive statement on her philosophy of Objectivism and is considered by many followers to be her masterpiece. I would instead judge it to be an important, but flawed masterwork. ATLAS SHRUGGED is her love letter to the America that inspired Ayn to become such an advocate for individual freedoms, liberty and capitalism. It can also be viewed as a dire warning that allowing more government and socialist policies could transform our nation into the Russia she so bitterly left behind in 1925.<br><br>The main problem I found with the book was that the characters were unrealistically polarized in their attitudes about the individual's role in society. As a result, I often found them a bit rigid, cold and lacking in any sort of personality that the reader might empathize with. Instead, Ayn entirely expected her readers to embrace the heroes in her work for their ethics, virtue and idealism alone. What she didn't anticipate were the mediocre actors that would wind up portraying her heroes and villains This \"character weakness\" in her original writing is greatly magnified in this theatrical rendering,especially with the B and C list acting talent that was enlisted. To make matters even worse, budgetary constraints forced the producers of ATLAS SHRUGGED: PART 2 to recast almost ALL of the main characters?! Having watched PART 1 over a year ago, this wasn't entirely bothersome since most of the original actors weren't all that memorable to begin with. However, I can see this change being a bit more perplexing if I were to view both parts back to back. Samantha Mathis did an acceptable job with the Dagny Taggart role, but most performances were fairly unmemorable. The only semi-familiar faces I could pick out were Diedrich Bader (best known for The Drew Cary Show) and Arye Gross (from Ellen).<br><br>Many of the core ideas of the book, such as \"The Strike\" that part 2 covers, are presented awkwardly. Therefore, the reasoning behind the actions for the strike might seem hokey or incomprehensible to those who are unfamiliar with the original book. Also, the story has been given a bit of a modern face lift which I don't necessarily take issue with. The signs advertising gasoline for $42 a gallon at various points in the movie are both chilling and somehow humorous at the same time. I say humorous only because the story seems so fantastical at some points that I couldn't help but question the credibility of this ominous vision of the future. But more often I found myself struggling to remember what was originally in the book versus what was added by the screenwriters. Regardless of who is to blame, the results are a blemish upon my memories of the original book.<br><br>The decision to chop the book into 3 parts with widely staggered release dates has only served to make this controversial and often difficult book into a confusing mess. And by presenting the story in such delayed and mismatched parts, it's far less likely anyone other than a devoted Rand fan would bother to see all three parts. I actually made a point to see the movie during its opening weekend for fear that it would leave theaters quickly. (ATLAS SHRUGGED PT. 1 lasted only a few weeks in Atlanta and was next to impossible to find on the Internet for the following 6 months.) ATLAS SHRUGGED PT. 2 (and the series as a whole) is a disappointing and confusing representation of the original book. While I was initially thankful that someone finally managed to bring this book to celluloid, that feeling has now turned to regret. I felt very conflicted about the movie after leaving the theater and my friends (who were less familiar with the book) were fairly negative, even though they were politically sympathetic to the ideas in the movie.<br><br>Although I will probably watch part 3 (IF it ever gets finished), I can't see giving this movie anything more than a 4/10 score. I can't really see a casual viewer with little knowledge of Ayn Rand's work or the original book getting much out of this production. This alone should be considered the film's most grievous failure.<br><br>But as Ayn Rand would say, don't trust anyone else's mind before your own. If you are a fan of her books, then take the time to see these movies and find your own perspective. Her ideas alone are worth discussion and maybe someone else can be inspired to do this book justice.","user":"robbit-5","rank":[99,136]},{"title":"A decent follow up to part 1","rating":8,"date":"12 October 2012","review":"I just came back from watching part 2 and up front, I will say that I was disappointed that the original cast was unable to return for part 2. That being said though, once the movie started I didn't really care about that anymore.<br><br>I thought Dagny being portrayed by an older actress was actually more in-line with the way I viewed her when reading the book, and the same goes for the other actors, like Eddie Willers, etc. I'm unsure how I feel about DB Sweeney portraying Galt himself since I never considered him a very strong actor, but that's a moot point in part 2 anyway.<br><br>As others have noted, the special effects in this aren't exactly top quality, but they're passable. It reminded me of the type you'd see on a SyFy original movie or something along those lines... not bad, but not great.<br><br>Overall, it was a good movie. Let's face it, if you liked the book, you'll like the movie. If you hated the book (or never read it, but hate the very idea of it), you'll hate this movie too. But that hatred would have nothing to do with the movie itself, but about your views of Rand's philosophy.<br><br>I'd give the movie a technical rating of 5-6 because it wasn't too bad, and some of the cinematography was actually pretty well done. Content I give it a 9 because I appreciate where Rand is coming from, so let's call it an 8 out of 10 overall.","user":"imdb-20212","rank":[76,120]},{"title":"Better Than Part 1","rating":10,"date":"12 October 2012","review":"Just finished watching this. Moves better than part one for sure. The acting is better as well. Some of the graphics still show it is not a high budget movie, but they didn't detract from the story.<br><br>They did a great job of connecting the story to today, as is quite easy to do with the subject material. The signs held outside protests were from today...<br><br>As with the first one, some of the 'bigger' concepts and ideas the characters were discussing went by fast and for people not familiar with the work already, those parts will be hard to keep up with.<br><br>And to be clear, for all who have actually watched the movie, there is no need to wonder why they made a sequel... It isn't a sequel, it is Part 2.","user":"AngryPatriot","rank":[89,146]}]