[{"title":"Not bad, but not really about the Dyatlov Pass Incident","rating":5,"date":"5 March 2013","review":"The Dyatlov Pass Incident itself is a super intriguing incident and it is weird that no one else has made a fiction film about it before. I highly recommend reading up on it, if you haven't already.<br><br>This film on the hand is not... super intriguing, or indeed even recommended if you're looking for a theory about what happened on the Mountain of Death. It's not a terrible film, but it's not about the Dyatlov Pass Incident. Halfway through the film I decided to put what I know about what really happened aside and just watch the film.<br><br>It is a found footage film. Sort of. The camera stays steady mostly and it's easy to forget that it's supposed to be found footage, which, honestly, I find to be a good thing. No need for sea sickness medication.<br><br>The good: The middle part of the film is visually stunning, the views are just breathtaking and I found myself at one point craning my neck to see more. It's definitely the best part of the film.<br><br>The bad: The story wobbles all over the place and leaves loose ends. Touch of Russophobia, but no more than the average Hollywood film.<br><br>Overall: Fun little flick if you don't take it too seriously. Take it about half as seriously as it takes itself and discard anything it tries to tell you about the 1959 incident, and you'll enjoy it.","user":"sunniva_reilly","rank":[151,179]},{"title":"Decent build up to disappointment","rating":5,"date":"16 June 2014","review":"Thought the first half of the film was pretty good, was like Blair Witch in the snow, going through the motions of interviewing people, getting a bit of a background on what they are trying to do.<br><br>When they set of on their own and the 'strange' things start happening, it kept you intrigued, but then when you find out what is really going on.. you find out why films like Blair Witch decided not to reveal their monster, because it was truly disappointing. <br><br>Not only that, but the whole story at the end was just a bit silly, too out of context with the build up of the film. And the fact that this is meant to be an explanation to the disappearance of real people is pretty weird! <br><br>First half of the film is solid enough though, worth a watch if you like found footage horror films.","user":"MikesIDhasbeentaken","rank":[35,42]},{"title":"In Soviet Russia, you do not find the footage...the footage find you!","rating":7,"date":"7 July 2013","review":"Five conventionally good looking American students get a grant to go off and make a film about the The Dyatlov Pass Incident, a genuine mystery from 1959 in which 9 climbers died under mysterious circumstances in the Ural mountains. Why these students did not try to find a mystery somewhere a bit warmer with a beach is really beyond me, but they go anyway. Off they all trot to freezing cold Russia to have sex in tents and trudge up a mountain, when predictably things start going all bad n' wrong. <br><br>The Dyatlov Pass Incident is a found footage movie, based on a real mystery. I will say right now that I am a massive found footage fan – I mean who isn't?. The inevitable comparisons to The Blair Witch Project are in some ways fair and in other ways miss the point entirely. Similarities can be drawn in terms of content. However his film's plot is based upon real events where The Blair Witch was not merely a film, it was for the greater part a media event based around (for the first time) web, print and TV marketing. This generated an entirely fictitious and carefully constructed mythology giving the film the appearance of being factual long before it was given a general release. This pure marketing genius made The Blair Witch Project something very special because it used social psychology and the media circus as cinematic tool to add weight and authenticity to it's entirely fictitious plot. There is no other film that can be compared to the Blair Witch Project in this sense as what it did was really bordering on media propaganda to achieve it's ends.<br><br>Because this film is based on real events in this sense the makers have lost control of it's plot as a device of terror and mystery. It suffers from the fact that you can go away, Google the incident and spend hours and hours reading about it. This is in many ways, more fun that the movie itself. It is also true that real people did die and that not a great deal of sensitivity is paid to this by the film's makers which was a little bit naughty.<br><br>Next lets get down to the money shot- the scary monsters. The obvious difference between this and The Blair Witch is that after a lot of delayed gratification you WILL eventually see what it is that lurks around in the darkness. Whether or not this makes the film more or less scary is really debatable. Watching this I felt that monsterly comparisons to The Descent were apt because you do defiantly get to see some monster and the monsters are on a 1-10 scale of creepiness about a 6 (don't worry.. you won't be decorating your pants like you did watching The Descent but they are okay monsters)<br><br>So this is your usual screamy-wobbly-camera-running-about sort of found footage film and pretty average though the last half hour has some serious giggles. Yes it is based on something real but I'm not entirely convinced that this makes it better. The original mystery is pretty interesting though and certainly worth checking out.<br><br>Any horror fan is going to enjoy this, it may also appeal to people who are interested in conspiracy theories (get your tin foil hats on people!) It's not anything genre breaking, clever or psychologically scarring but The Dyatlov Pass Incident is good entertaining fun and as good a found footage romp as you are likely to find.","user":"sandiglendinning","rank":[42,55]}]