[{"title":"This movie tells it like it is. Someone in Hollywood finally did their homework.","rating":9,"date":"3 October 2013","review":"I write this review from the viewpoint of someone who is in recovery from sex addiction. I have attended 12-Step, anonymous \"S\" meetings (SLAA, SAA, SA, etc) for 23 years. In that time I have seen it all, so I can say from experience that \"Thanks for Sharing\" tells it like it is for those of us who struggle with sex addiction in recovery.<br><br>The movie itself follows multiple addicts whose recovery stories weave around each other. There are no plot twists, just a series of seemingly random, real life events and situations which plague addicts, and how addicts in recovery deal with them, sometimes successfully and sometimes not, but always making progress and learning how to live life.<br><br>The movie depicts a surprisingly complete spectrum of victories, failures, and facts of recovery: meetings, sponsorship, relapses into addiction, a \"crash\", a \"crash and burn\", job loses, near relapses, just-in-time phone calls, phone calls which went unanswered at critical times, suspicious girlfriends, wary wives, male addicts, female addicts, addict parents having to confront the affects of their addiction on their own children, addicts having to deal with their abusive parents, starting a healthy relationship with another addict in recovery or with a non-addict, the confusion caused by sex after long abstinence from sex, multiple addictions, and, above all, a message of hope and freedom. It's all there, and it's there in a surprisingly compact story.<br><br>The movie importantly points out a critical difference between sex addiction and substance abuse, and that is that substance abusers do not have their \"drug of choice\" manufactured within their own bodies, and that recovery from sex addiction is not about abstaining from sex forever but is about getting into a healthy relationship with sex.<br><br>\"Thanks for Sharing\" evoked strong feelings in me because I have \"been there and done that\". There were a couple of scenes where persons new to recovery were staggered by the new hope that was shown to them. I cried at those scenes because I *remember* that exact feeling from when I first started going to meetings. And I cringed when characters with long-term abstinence relapsed or nearly relapsed. I myself once relapsed back into active addiction when I was not able to get in touch with my sponsor, a reality eerily similar to one situation in this movie.<br><br>There were some mild sex scenes; R-rated stuff. It would be hard to make a movie about sex addiction without depicting at least some sex. These scenes were not gratuitous but were an integral part of the story, so I had no difficulty with them: I just shut my eyes to stay connected with the story rather than be distracted by the view.<br><br>My only negative remarks on the realism of this movie are that the meetings depicted had more of a \"flavor\" of an NA (Narcotics Anonymous) meeting. One is MUCH more likely to be hugged at an NA meeting than at \"S\" meetings since recovering sex addicts tend to have a lot of issues around body contact. Then there is the manner in which people were depicted as sharing at meetings. I can't really put a finger on what the difference is but the dialog was much more like the way people share in NA meetings.<br><br>But the above are minor observations compared to how much the movie got right. Someone really did their homework to get so much right. And someone really put some effort into keeping \"Thanks for Sharing\" from becoming a \"sexploitation\" movie. Last but not least, the cast, writers, and director did a really good job of creating credible characters in an accurate story.<br><br>I wish I'd seen this movie sooner so that I could have added my review sooner.","user":"JeffBatHome","rank":[73,81]},{"title":"'It's like trying to quit crack while the pipe is attached to your body.'","rating":9,"date":"16 February 2014","review":"'It's like trying to quit crack while the pipe is attached to your body' Stuart Blumberg is a director who takes chances (The Girl Next Door , The Kids Are All Right, Keeping the Faith). Using a screenplay he wrote in conjunction with actor Matt Winston he approaches a subject rarely touched upon (or even known about to the general public) – sex addiction – and with the very capable assistance of a superb cast of actors he brings it off. The film may disturb some, especially those easily offended by the degree of self indulgence that story addresses, but stay with this story to the end and be enlightened and touched by the triumph of the human spirit over seemingly insurmountable odds.<br><br>The story centers around three sex addicts who must attend 12 step meetings, have a sponsor, and refrain from onanism or frottage or viewing pornography, sharing their shortcomings at eh meetings of fellow addicts. Adam (Mark Ruffalo) is an environmental consultant whose has been 'sober' for five years and has as his sponsor Mike (Tim Robbins), a small business owner married to the supportive Katie (Jowly Richardson) with whom he has a disowned alcoholic son Danny (Patrick Fugit), and who is sponsor to the obese foolhardy voyeuristic frottage obsessed ER Doc Neil (Josh Gad) whose mother Roberta (Carol Kane) has no clue about her son's debilitating condition. The three men – Adam, Mike, and Neil - interact in needy ways and each faces a crisis he must address: Adam finally meets a girl to whom he can possibly relate, breast cancer survivor Phoebe (Gwyneth Paltrow); Mike must deal with his son Danny's return to the nest; Neil becomes tied to Dede (Pink) who is a sex addict of the first order and desperate to change. It all works in at times confusing ways, but always with a focus on the fragility of the addicted human being – no matter the source of dependency.<br><br>The film has its light moments, but it is certainly more of a drama than a comedy – except for the fact that 'all of life in the human comedy.' It is good to see a capable group take on a controversial subject and deliver it well.","user":"gradyharp","rank":[35,39]},{"title":"It's really not a comedy","rating":7,"date":"6 October 2013","review":"Calling this a romantic comedy brings to mind the kind of thing that would have Lisa Kudrow or Jennifer Aniston alongside Patrick Dempsey or Ben Stiller.<br><br>Yes, it has several \"boy meets girl\" moments, but the overall premise of the movie has romance as a side issue and is definitely not a comedy.<br><br>On the whole, I enjoyed it, although bits of it were tough to watch, with some strongly adult themes and it definitely wasn't what I was expecting. Anything that focuses on addiction isn't going to be a walk in the park, but selling it as a romantic comedy is misleading and does the film a disservice.<br><br>The main cast were great and their characters were interesting. More importantly, the film didn't suffer from the current trait of being too long for the storyline.","user":"umrat","rank":[39,44]}]