[{"title":"Beautifully Brutal, Unrelenting.","rating":9,"date":"5 February 2013","review":"Jennifer Lynch has created something here that is nothing short of breath taking. From the tone and mood to the color and performances, this film is a must for any fan of dark reality. This film could happen. <br><br>Vincent D'Onfrio gives a brilliant performance as a serial killer with a chance to be a mentor to his captive. I loved this film, it is just so sad that Hollywood does not recognize films like this when awards come around. This film is honest, unrelenting and touching. This is how horror films should be made. Horror, not gore, not slasher. This film kept me glued to my seat on pins and needles wondering how everything was gonna play out. I was not let down. Jennifer, thank you so much.","user":"RobertLThorpe","rank":[56,66]},{"title":"A great movie with a huge twist.","rating":8,"date":"26 September 2012","review":"This film is well done. The parts are played well, and the movie is intriguing from start to finish. D'Onofrio is great as the serial killing cab driver. I think Jennifer Lynch has done a great job with the script and the actors. But after seeing 'HISSS', you hoped that she had improved, and in my mind she has done so easily. The story is very good too, I was watching wanting to know what happens with Tim. And then there's the huge plot twist at the end, you do not see it coming! It was what made the film worth seeing through to the end. If you're like me and love a good twist, then this movie is well worth seeing. So I give it a solid 8 out of 10.","user":"Michael-Hallows-Eve","rank":[61,74]},{"title":"A difficult watch, but worth it.","rating":7,"date":"9 January 2013","review":"Bob, a cab-driving serial killer who stalks his prey on the city streets alongside his reluctant protégé Tim, who must make a life or death choice between following in Bob's footsteps or breaking free from his captor.<br><br>Be prepared, this film is not for the faint of heart or the more sensitive viewers. Chained is the most unsettling film of 2012 that grips you by the throat and doesn't let go, as well as a kick in the stomach. Dread consumes this twisted, dark and provocative crime/thriller. In the vein of Henry: Portrait Of A Serial Killer, this film takes you inside the mind of a ruthless killer, the character study is a very disturbing, heart shattering and shocking. Filled with depravity! The performances were powerfully tense and keeps you glued to the screen and on the edge of you seat. Vincent D'Onofrio, who you may know from Law &amp; Order, plays Bob, a serial killer cab driver and gives one hell of a chilling performance. You feel horrible for but hate him at the same time, a killer that's a product of his environment. Eamon Farren plays older Rabbit, which is the name Bob gives to him after he abducts him and his mom when he was a young child. Now he is chained to a wall with no way out, but to only buddy up with his captor enough to be freed from the chains. Eamon gives a captivating performance and you root for him to escape the horrors and at one point having you shout at the screen to fight back and get revenge. Harrowing film! Director, Jennifer Chambers Lynch who directed the equally startling film Surveillance, has crafted yet another distressing, graphic and wicked film. The rawness of her films is now very much signature to me, she always has a way of getting under your skin, keeps you in suspense and hits you hard with a shocking conclusion. Her film will make you think twice about calling for a cab! Very much interested to see what she throws at us next, I won't be surprised if it leaves me in the fetal position, shaken out of my mind. She is that good! Overall, this film is definitely not for everyone as it's blood curdling, but the performances are some of the best of 2012 from this twisted genre. The story will keep you in cold sweat, wondering and guessing if poor Rabbit will make it out OK and has one hell of a shocking ending that will leave you breathless. A tough watch, but worth it! 7 out of 10.","user":"mdnobles19","rank":[22,25]}]