[{"title":"God with out caring or love","rating":2,"date":"3 September 2019","review":"First: I want to say is the acting in the movie was good. For that I gave it 2 star alone.\nSecond: If god is alive and well (and I believe he is) then he would look down upon the events and in this movie and say\"this is not what I am had in mind when I told you to go forth\"\nFor a church to belittle or ridicule a person for telling people that making the crossing across the Oregon trail during winter is wrong, is NOT what god had in mind when he said \"sacrifice leads to heaven\".\nGod gave us a brain and intelligence to know that when something is right, and something is wrong. To rise up people hopes just so they can drag half way across the US to the promised land and die while on the journey is wrong.\nBlind trust in god is one thing, throwing your life away because the church leaders vanity is at risk is another.\nGod gave man life, not so it could be thrown away on the journey, no one should have made.","user":"LasVegasBartender","rank":[2,2]},{"title":"One star too many","rating":1,"date":"24 January 2013","review":"A lot of the LDS films out there are plain bad. This one takes the biscuit. It is meant to be an uplifting, emotional story where they combine stories of two of the more infamous LDS Handcart companies and track their journey west. It was meant to showcase the faith of those who undertook the journey, and make me wonder how I can exhibit such faith in my life.<br><br>Instead, it taught me the opposite about faith than we are taught about on Sundays. It also made me furious at the LDS church for their treatment of the only sensible character, Levi Savage. There is not really a point to watch this film if you aren't LDS. There is also no point watching it if you are. Pick an old classic, or just read a book. You will regret it less.<br><br>If you are looking for a churchy film to watch on a Sunday evening, or at a church event, don't bother with this one. The tears you shed at the end will be for the 113 minutes you will never get back.","user":"jamestheklein","rank":[22,48]},{"title":"A Film That Inspires!","rating":10,"date":"3 June 2011","review":"T.C. Christensen's \"17 Miracles\" is something of a miracle itself. An independent film telling the true story of one of the most amazing pioneer migrations stories ever is beautifully written, directed, acted, edited and photographed to say nothing about the excellent musical scoring. Produced for less than $1 million dollars it achieves what no amount of budget can necessarily buy: a spiritual honesty that pays tribute to the people who followed their faith using wooden handcarts to carry their meager supplies as they attempted to journey to the Salt Lake City valley. While members of the LDS faith will mostly be familiar with the Martin and Willie handcart trek, most will be overwhelmed at the number of challenges and miracles that are depicted in this film. One can not leave from viewing this film without having a greater respect for these faithful pioneers and a deeper reverence for our Father in Heaven. \"17 Miracles\" is my kind of motion picture -- one that is an experience and uplifting. Highly recommended. If you have the chance to see it in a theatre DO! If not the DVD and Blu-ray are now available thru Deseret Book Company. This disc is certainly a must to own! Addition: Just saw the film for a third time in the theatre and find myself even more impressed with it then upon the first viewing. While all of the acting is outstanding special mention should be made of Jason Wade who plays Levi Savage. This handsome young actor could be the new Robert Redford. He is a very sensitive actor who has great range and power.","user":"blue-7","rank":[26,62]}]