[{"title":"A Fine Goodbye for Philip Seymour Hoffman","rating":8,"date":"26 July 2014","review":"The final moments of Anton Corbijn's latest film A Most Wanted Man are both gratifying and poetic. Starring an impeccable cast that includes the late Philip Seymour Hoffman, Rachel McAdams, Willem Dafoe, and Robin Wright, the film is based on the novel by John le Carré, and is a tension-driven and smartly paced thriller ride that makes a mark as one of the year's best rides.<br><br>A movie that is more in the vein of an extended episode of \"Homeland\" than a full-out feature (which is not exactly an insult), is tightly wound, fish hooking the audience with its clever storytelling abilities. Corbijn creates a meticulous and subtle picture that unravels itself with suspense and excitement. The movie challenges the audience in attempting to follow each detail and fully understand what is going on. That might be a turn off to many. Like many of Carré's books that have been translated to film like Tinker, Tailor, Soldier, Spy and The Constant Gardener, there's an aura that exudes from the screen that you want to take home with you. There's so much to the story that happens before the film and starts and long after the movie ends but you're satisfied with that. Adapted by Andrew Bovell, the Australian screenwriter may have penned the film of his career.<br><br>The elephant in the room is the performance of Philip Seymour Hoffman. It's very hard to not want the film to end because you are very aware that this will be one of the last times you see a new film by this actor. One of the greatest actors to have ever lived, Hoffman shows exactly why his omission from our world is such a loss. Subtle, electrifying, and profoundly real, Hoffman's \"Gunther Bachmann\" is an intriguing force that demands the audience's attention with the simplicity of a tone or look. While the tween world waits on the arrival of the final two installments to The Hunger Games, this film felt more of his goodbye to the film community that has appreciated him for over two decades.<br><br>One of the pleasant surprises of the film is the beautiful and talented Rachel McAdams, which immediately makes you think, \"where has she been?\"<br><br>While she has been making her rounds in independent films like Passion, About Time, and To the Wonder, her role as \"Annabel\" shows a deeper talent that is aching to be realized by the right director. Internalizing emotions and releasing only when called upon, McAdams turns in her one of her strongest turns yet. Not your A-typical \"damsel in distress\" or \"unbelievable tough chick,\" McAdams reinvents a character that could have just laid on the screen with no emotion. She relaxes herself into the role, working well off some of the screen's most gifted performers. It's a magnificent work.<br><br>With no real arc or allowance to his character, Willem Dafoe unfortunately distracts for much of the film. Feeling like he's part of the Osborne family again, his role is rather underwritten and a bit of a mystery but not one you're aching to learn more about. Robin Wright utilizes her sensational appeal and charismatic nature to sprinkle a dash of brilliance to the film's narrative. As \"Issa,\" Grigoriy Dobrygin keeps the viewer at a distance, never allowing his true motives to unleash. He constantly asks the viewer to question our own judgment. He is very impressive.<br><br>With a gritty yet polished aesthetic, Corbijn knows exactly how he wants his film to look and feel. Using Cinematographer Benoît Delhomme keeps the tension at the very brim of explosion. Composer Herbert Grönemeyer, who also has a role in the film as \"Michael,\" lays out a soothing, relentless score that is both memorable and undeniable. <br><br>A Most Wanted Man is smart and precise, an espionage thriller that stands out as one of the best of its kind in quite some time. It's confident in its approach and doesn't shy away from its central purpose. It's a morality tale that engulfs your conscience with terrifying and difficult questions. I don't mind being asked them every now and again. It's one of the year's best.<br><br>Read more @ The Awards Circuit (http://www.awardscircuit.com)","user":"ClaytonDavis","rank":[177,226]},{"title":"John le Carré wrote it; Philip Seymour Hoffman performed it","rating":8,"date":"16 August 2014","review":"A Most Wanted Man (2014) was directed by Anton Corbijn. It's based on a novel by John le Carré. The film stars Philip Seymour Hoffman. Basically, that's all you need to know about this movie.<br><br>Philip Seymour Hoffman is Günther Bachmann, a self-described spy. (Actually a counter-intelligence agent.) He's involved with a Chechen immigrant who has been tortured. There's money going from Hamburg to terrorists, but no one knows how this money gets there. Somehow the Chechen is involved. On and on it goes, with the German police opposing Günther, the CIA opposing Günther, and everyone betraying everyone else.<br><br>Günther is burned out and, essentially, has no life other than being a spy. As far as we can see, he never takes time off, he is interested in nothing other than work, and he has no friends and no colleagues he can trust. Hoffman portrays this part perfectly. No one could have done it as well.<br><br>A Most Wanted Man is pure Carré, and pure Hoffman, and that's why you should see it. If you're not impressed with Carré, or not impressed with Hoffman, there's no point going to the film.<br><br>We saw the movie on the large screen at the wonderful Dryden Theatre in Rochester, NY. However, it will work just as well on the small screen. No scuba shots, no mountain skiing shots--this isn't James Bond. If you know what to expect--gritty shots of Hamburg, Germany--you won't be disappointed, and the movie will work for you.","user":"Red-125","rank":[120,156]},{"title":"Brilliant farewell to one of the greatest ever !!!","rating":8,"date":"25 October 2014","review":"This film is all about how bureaucracy works. How the spy agencies tackle and deal with problems that arise. Different agencies have different and sometimes contrasting ways to deal with the same problem and this leads to a dilemma which I think is the main theme of the film. The movie addresses the question of whether it is better to come up with the quick solution by nabbing the ordinary low-lives who become terrorists by getting influenced by others or is it worth the patience to let them do what they are supposed to in order to get to the real bosses and masterminds and get to a solution that is more significant and I think it addresses it brilliantly. The director develops a very tensed atmosphere throughout the entire film and never succumbs to the pressure of coming up with flashy over the top action sequences and the screenplay is very realistic. Now let's come to the acting. There are many supporting actors like Rachel Mcadams, Willem Dafoe,etc who are good. But this film is Philip Seymour Hoffman's vehicle. He is stupendously brilliant as he always was throughout his career. This film allows him to go out with a bang and show the world why he was one of the greatest. He plays a character who is a chain smoker and who uses this addiction to hide from the failures and struggles of his past career. Hoffman never puts a foot wrong. While the film was more or less brilliant, there were one or two minor scenes which seemed slightly unrealistic and Rachel Mcadams' German accent was sort of on again off again. But apart from these I can't find any flaws. Some people who want every spy thriller to be like James Bond have called this boring, but for people who like gritty,realistic stories about spies and national security, this will be a rewarding experience.","user":"avik-basu1889","rank":[71,90]}]