[{"title":"Predictable & not very entertaining","rating":2,"date":"10 July 2012","review":"I thought it could be interesting when I saw Vinnie Jones, whom I'm a big fan of &amp; Dominic Purcell(Prison Break)listed as the lead cast but Vinnie Jones doesn't even make it past the first five minutes &amp; Purcell couldn't have said more than twenty words in the entire film. It's just another straight to video release with little action, no suspense and characters I could care less for. The acting was mediocre &amp; the script was bad. No thrilling action sequences, it's obvious to the viewer that this was just another low-budget cookie cutter type action flick with a plot so thin I had to fight the urge to turn it off . If there is anything to be said, it is don't get suckered into paying to see this. It didn't seem like anyone really tried to make an effort, especially the writer/director Brandon Nutt whose last picture sits at a 2.7 rating. I think that says it all. For this a 2.5/10","user":"Thrill_KillZ","rank":[90,108]},{"title":"OK if you are not expecting james bond","rating":6,"date":"31 July 2012","review":"clearly a low budget film and the staging and stock shots evidence this. but for what it is, it works. tough guys, good looking girls, and lots of action. i liked the flight attendant, the journalist and the pilot.... that's the guy i want in the cockpit on my next flight. I am up for a sequel and this movie sets the stage nicely for one. Only difference I would like to see is on the budget. spend five times what was spent on the first movie (whatever that amount was ) and you will have a good picture. I am not saying you need to be on location but get staging the has the rounded appearance and proportions of an airplane not a hotel lobby and cast situation actors conforming to the purported location.","user":"rjeffrey-smith33","rank":[7,8]},{"title":"Bad... in the worst sense of the word!","rating":1,"date":"12 July 2012","review":"Without doubt, one of the worst movies I've ever had the misfortune of subjecting myself to! The movie starts bad, with Vinnie Jones playing a part that's completely out of character, and from there, it just gets worse... much worse! <br><br>I won't talk about the glass bowls and decanters, etc, placed on the tables of a plane that's about to take off, instead, I'll talk about the worst plot, worst acting, and worst movie I've probably ever had the misfortune of watching! Actually, I'm lost for words... I'm trying to think of a few fitting, critical remarks about the movie, but it was so bad, that I'm struggling to comment, without adding spoilers and resorting to profanities! All I can say is, if you feel the need to watch this movie, but have a couple of spare needles in the house, I'd strongly suggest holding the needles over a flame, then inserting them into your eyes, because with hindsight, I would rather stick red hot needles in my eyes than watch this movie!<br><br>One of, if not the worst movie I have ever watched, and giving it a score of 1 out of 10, doesn't even start to describe how bad it is! Do yourself a favour and buy some needles... or you'll wish you had!","user":"CharlieHound","rank":[27,43]}]