[{"title":"entertaining Christmas mystery","rating":21,"date":"21 December 2011","review":"\"Deck the Halls\" from 2011 was shown as part of the TNT Tuesday Night Mystery series, though it's unlikely it was produced for that reason. The story concerns the kidnapping of a successful businessman, Luke Reilly (David Selby) and his driver, and the attempts of his detective daughter Regan (Scottie Thompson) and an amateur detective (Kathy Najimy) to get them back and discover the perpetrator.<br><br>First of all, what a cast: besides those mentioned above, Jane Alexander played successful mystery writer Nora Reilly, Regan's mother. Scottie Thompson was a new actress for me. She's beautiful, has legs that go up to the ceiling and did a great job.<br><br>Secondly, it was fantastic to see David Selby again, and he looks wonderful. <br><br>Kathy Najimy plays Alvirah Meehan, who won $40 million in the lottery. She and her husband are ongoing characters in Mary Higgins Clark's books. Alvirah is a former cleaning woman who loves to solve mysteries. There were several references to past cases, It would be great if TNT would produce more of her stories.<br><br>This is by far my favorite of this Tuesday night series. It was light with good acting and a good story. Highly recommended.","user":"blanche-2","rank":[9,9]},{"title":"Finally, a watchable TNT Mystery Movie!","rating":10,"date":"24 December 2011","review":"After the first couple of movies in this series, I gave up on the next two in the second week, but had to check out \"Deck the Halls\" expressly because of Kathy Najimy's participation. Besides that, it looked like this one might actually be a MYSTERY rather than an over-long romance flick with a bit of mayhem thrown in, as the first week's movies were. Turns out I wasn't at all disappointed! Now I might actually check out a few more entries in this series--if the trailers interest me.<br><br>The first reviewer gave a great rundown of the main characters, played by Najimy, David Selby, Jane Alexander, and the delightful discovery (for many of us who viewed her first in this movie), Scottie Thompson. But I wanted to add my compliments to the excellent supporting cast. Luciana Carro delivers just the right amount of fun and fear in the role of Selby's chauffeur, and the policemen who enjoyed various relationships with each of these strong female leads were a delightful change from the hard-boiled misogynists that are normally found in these types of crime novels/movies.<br><br>I concur with the other reviewer: We need to see more of Alvirah Meegan, Regan Reilly, and their entire circle of friends/colleagues. And please, if this is really a pilot (one can hope!) and it becomes a series, stick with all the actors you've got here. There's not a clinker in the bunch!","user":"allworkpeace","rank":[5,5]},{"title":"A fantastic Christmas family film for any ages.","rating":8,"date":"4 November 2012","review":"This film was wonderful. Definitely a film to watch with the family! I really enjoyed the drama of it. At points it was sad, as the daughter lost her dad only so close to Christmas as well.<br><br>Sometimes I didn't understand what was happening as everything was happening so fast and sometimes I didn't know who the characters were so I had to come onto IMDb to find out who they were. I've watched many Christmas films but the idea of a Christmas/Mystery film was a fantastic idea.<br><br>I watched the film near Christmas time and it definitely got me into the Christmas spirit. It was a very entertaining mystery story and overall I'd recommend anyone to watch it, any age. <br><br>I have given this film an 8 out of 10 for it was an entertaining film but some of it went too fast for me.","user":"tasha-beth","rank":[1,1]}]