[{"title":"Fantasy Sequence, Jules","rating":8,"date":"30 June 2017","review":"I haven't read the rest of the reviews but how does this rate 4.5?<br><br>As one reviewer said, it's The Breakfast Club in the House of 1000 Corpses...and I'd add Come Back To The Five And Dime, Jimmy Dean. <br><br>Bernadette, a lovely psychotic psychologist, plans a party murder mystery party for her friends...and then drugs them so they can't move. From there, she exposes their lies and hypocrisies. Sure, the fact that she's engaged in deception to know all that she knows and has her own hypocrisies doesn't make sense...that's why she's psychotic. In the course of the night, she shows the hidden videos of the \"friends\" cheating on each other, raping each other and spying on each other, while keeping their secrets. Throw in some mushrooms and general trippiness and what's not to like? <br><br>The rock solid script takes you through the various sins with some excellent group dynamics and ensemble acting. Towards the end, Jules (the blond bombshell who's tripping) goes into a full blown hallucination which throws out an even more unsettling vibe with a gasp-inducing consequence. <br><br>Everyone is spot on in their roles. Bernadette plays her insanity with a subtleness and restraint that could have thrown the movie off the rails. This provides the perfect contrast in the rare moments when she does flip out. Jules, too, shines in her role and brings depth to her party-girl persona. When I first saw her, I thought she was too pretty bring off the role but she fearlessly takes on the drug trip aspect and sells it brilliantly. <br><br>All in all, it starts up quick and maintains its pace providing an amazing ride!","user":"paul-day-clone","rank":[7,8]},{"title":"Incredibly enjoyable, this movie has a lot of heart, and a lot of blood to go with it.","rating":8,"date":"1 December 2012","review":"Among Friends is a new movie about a group of friends who get together for a dinner party which turns into a violent, horrific and ultimately hilarious ordeal. Bernadette (Alyssa Lobit) organises a 1980's themed murder mystery for her BFFs, who unsuspectingly arrive in anticipation of nothing more than a playful evening of cocktails, drugs and the possibility of hopping into bed together. What they don't realise is that Bernadette has a bone to pick with each one of them, and before long the party becomes a trial, with their deliciously manic host serving as judge, jury and executioner.<br><br>Featuring cameos from the likes of Kane Hodder and Michael Biehn, in addition to being the directorial debut of Danielle Harris (Rob Zombie's Halloween, Hatchet I-III), Among Friends certainly comes with a genre pedigree. The writing, construction and shoot of the film was overseen by an almost entirely female crew. Elements of The Perfect Host (2010) and The Last Supper (1995) are combined with a unique and energetic method of delivery. Harris' direction is sharp, frenetic and delightfully sinister and the performances from Lobit, Brianne Davis, Jennifer Blanc-Biehn and AJ Bowen are particularly noteworthy. <br><br>A Day-Glo descent into Hell, Among Friends is a brilliantly funny, acerbic examination of friendships, lies and betrayal. Gory, gleeful and gorgeous, it manages to consistently digress from stereotype, creating a very unique feature in the process. It's as if the Breakfast Club had a get together twenty years later at the Firefly homestead from House of 1000 Corpses. Incredibly enjoyable, this movie has a lot of heart, and a lot of blood to go with it.","user":"cjmccracken","rank":[18,34]},{"title":"Good movie, terrible ending!","rating":4,"date":"27 January 2014","review":"Among Friends has some great things going for it. The story is interesting, the actors (for the most part) do a great job, and some of the directorial decisions make this a fun ride. The movie does borrow from a handful of other movies. Saw, Would you Rather, and Deranged being among them. But the movie distinguishes itself and is better than some of the movies it shares similarities with.<br><br>However, as much fun as I had with Among Friends and as invested as I was with the characters and their situation, the ending kills this movie. Simply because there is no conclusion. The movie just ends. There's no reason for a film maker to not create an ending for their movie. As the viewers we've invested the time into getting to know the characters and anticipate how the story unfolds. It's the writer and director's job to make sure that the story has a satisfactory conclusion. Not always happy, not always straightforward, but an ending that makes me glad I invested the time into watching the movie. Among friends doesn't have this. I just felt frustrated, cheated, and completely unsatisfied.<br><br>In conclusion, I can't recommend this movie. It's frustrating how much potential was displayed and then squandered.","user":"TheContorted","rank":[6,11]}]