[{"title":"For the little ones","rating":4,"date":"17 December 2012","review":"First of all I have to say I'm glad that this movie was made in Germany. It's always good to have different genres being represented in a country and I think the effort put into this pays off (partly). Especially the little ones will love this. It's a simple story, simple moral tale, simple characters and things that the young ones can relate too. Learning by being entertained sort of.<br><br>Interesting choice for one of the bad guys, whose better known for his leading role in a TV series that I never watched, but still many recognize as the good guy with the dog. Talking about dogs: Yoko is not a dog, but I guess you knew that from the picture on the cover. Watch with children or have low (very low) expectations and let the kid inside of you out.","user":"kosmasp","rank":[6,11]},{"title":"Really only for young audiences","rating":4,"date":"1 January 2016","review":"I am a grown-up man who likes to watch films that are mostly intended for young viewers. This especially refers to quality animation films, but there are also many pretty good live action films for kids and teenagers out these days, especially here in Germany. And there are famous actors in there too. \"Yoko\" for example has Tobias Moretti, Jessica Schwarz and Justus von Dohnányi, all 3 very established. However, the script here does not do their talent justice. It is not a bad film by any means, but I personally was underwhelmed. My main problem with these 98 minutes was a personal one. It may only be my perception, but I just wasn't too impressed with the title character. He looks like a mix of a yeti and a polar bear and Yoda and a gremlin. Pretty strange. They obviously intended something cool and cute at the same time, but in my opinion they did not succeed with either. I wish they would have gone 100% cute. However, if you like his looks unlike me, then you will probably enjoy the film more.<br><br>There are a couple good moments, I'll give them that. However, it still felt very generic to me and the emotional moments about protecting Yoko never fully delivered for me on a dramatic level. There was definitely potential for more. Emotion by the books is never a good thing, the only somewhat unexpected aspect of this film was von Dohnányi's change of character at the end. Certainly not what I expected. The kids actors were mostly fine, especially the girl in the lead role. However, her acting and the acting from the successful guys I mentioned earlier cannot make up for the mediocre script here in my opinion. Not a complete failure, but far from as good as it could have been. Oh yeah, and the music, I mean the pop songs, included in here were probably the worst thing about the whole film. Downright cringeworthy. Not recommended.","user":"Horst_In_Translation","rank":[0,0]},{"title":"Nearly a direct lift of another very famous film's plot","rating":2,"date":"23 June 2014","review":"Potential Plot Spoiler: Yoko is nearly a direct lift of Steven Spielberg's E.T. the Extra-Terrestrial plot line with a cute yeti from the Himalayas instead of a cute alien from another planet. The yeti, who ends up accidentally transported from its igloo home in the Himalayas to a temperate climate populated by humans, is seeking to get home, and is discovered by a preadolescent child. In the meantime, all the adults are either evil, trying to capture it, or they just don't understand and don't \"get it\" leaving the kids to their own devices. OK for a very young children's film, and by young I mean very young in the 5-7 or 8 range. It's quite sappy and highly predictable. Only 2 stars for incredible lack of originality with just enough difference to evade a Spielberg E.T. plagiarism lawsuit. If you've seen E.T. the Extra-Terrestrial, you've seen Yoko. If you haven't, see E.T. instead as it's a better executed timeless classic.","user":"j-a-lind","rank":[0,1]}]