[{"title":"A sequel that didn't need to be made...but I'm glad it was!","rating":9,"date":"16 June 2019","review":"As far as conclusions to beloved franchises go, Toy Story 3 is hard to beat. The film tugs at the heartstrings, as we learn that Andy's toys are no longer his, and cuts deep with the realisation that growing up means letting go.<br><br>Naturally, I had a lot of trepidation heading into Toy Story 4. It wasn't so much about whether the film would be good or not, as Pixar have been pretty reliable in that regard. Rather it was about whether, despite the best efforts from everyone involved, Toy Story 4 would be able to shake off feeling unnecessary. Well, I'm happy to report that not only is Toy Story 4 a triumph, but the film's heartfelt finale feels like a proper send-off for Woody and his friends and proves that it was a story that needed to be told.<br><br>The best way to summarise is that Toy Story 3 is the end of Andy's story, while Toy Story 4 is (likely) the end of the toys' story.<br><br>While essentially a roadtrip film, the story focuses on the toys finding their place in the outside world for the first time and it's hard not to draw the analogy between young adults moving out of home. The film captures the feeling of uncertainty but also the new found possibility that leaving a place of comfort entails and it's a joy to see the series mature along with the kids who first watched Toy Story back in 1995.<br><br>It is also, undoubtedly, the funniest Toy Story film, largely due to a bevy of hilarious new supporting characters. Forky is a definite highlight while Keanu Reeves steals his scenes as Duke Caboom and Key and Peele bring their expert comedic timing to a pair of carnival-prize plush toys who are attached together by their hands but bounce off each other like rubber balls.<br><br>Thanks to a consistently funny script, the film is a blast to watch when it's not making your eyes well up, but either way the film will likely leave you crying. If you're still skeptical about the film, let me just say that, nine years may have passed between sequels, but the series' heart is beating as strong as ever.","user":"DJKwa","rank":[816,1]},{"title":"Beautiful picture boring story","rating":2,"date":"2 July 2019","review":"The picture is amazing! Really one of the most beautiful animations I've seen yet. The story however was boring and disappointing, when comparing it to the previous films.<br><br>In a previous Toy Story Buzz says: \"The important thing is that we stick together\". - in Toy Story 4 Buzz loses all his previous personality. He listens to his \"conscious?\" Seriously? It was funny and very concrete thinking as Buzz often can be at times. But let's not forget who Buzz was in previous films. He began as believing he truly was a space ranger. When he finally comes out of that he realizes he's not a ranger but a toy. When he finally figures out his importance and value in his family of toys, he becomes as loyal and committed to Andy and the rest of the group as Woody is. Together they get rid of Sid, fly to the van, and conquer all sorts of missions in the next movies. Buzz takes the lead in toy story 2 to help track down and save woody. But in Toy story 4 it's like he's a drone. All he can do is listen to his little toy commands. He's straight up clueless in this film. At one point he actually abandons woody at the antique shop when the odds were highly against them, because his push button told him to??? Really? That's not the buzz we know and love!! The buzz we knew almost died with Woody in a furnace! He would go to the ends of the earth for his buddies. They were a team and a family. But not anymore. Now Buzz is a drone with little thoughts for himself anymore. He does whatever his buttons tell him to. \"Goodbye Woody, sorry if you die in the antique shop, but my conscious told me to quit\". That's all it took? Really? Ok?<br><br>Woody was a fearless leader in all three movies. Until this one. Yes he still had a heart of gold. But, he went from Bo Peeps hero and Sharif that she looked up to, to his whipping boy. She straight up tells him at one point that he's essentially stupid and doesn't know what he's doing and needs to get in line and follow her. Really? Woody went from her hero to her little\nBoy. He literally follows her around apologizing with his tail tucked between his legs. Goodbye Woody, it was nice knowing you... now you're this wimpy cowboy doll who lets all the girls beat the crap out of you and basically tell you, you're worthless - you aren't played with anymore (you stick to the closet while the cowgirl is the new sheriff in town), another doll unapologetically rips your pull string out, because she feels this is the only way to get her own worth - so you just turn over and take the abuse, the love of your life says your basically washed up and need to follow her lead because of how stupid you are. This is not how I imagined Woody going out of the franchise.<br><br>If only the Gabby doll would have showed an ounce of remorse for what she did to woody, it would have driven home the sacrifice he made for her to allow her to take his pill string and start a new life of her own. No, the villain takes what she wants and never shows a bit of gratitude to woody.<br><br>These new carnival characters feel like they were pulled out of the new pets movie. They had some great comic relief at points, but felt like they were in the wrong movie. They felt really out of place.<br><br>The kaboom guy was another completely random and useless character. It felt like he was another insert to try to make people laugh, as though that was his only purpose for the film.<br><br>We never get to see bulls eye, Rex, and the rest of the gang. They literally were extras in this film unlike the other three movies.<br><br>Forky was a creative spin on things and added some great comedy. But, really the emotional connection to the characters we poorly done in this film. I was literally bored and just waiting for the next thing to happen. I didn't care about the end clips when the credits rolled. This story was so weak.<br><br>It was a poor way to say goodbye to our beloved characters. We didn't even really get to say goodbye to most of them, they were hiding in the RV the whole time.<br><br>I thought this would be a tear jerker, but I don't really care that Woody is not a part of the gang anymore. They took away all the elements that bonded these characters together in the first place.<br><br>The franchise should have ended at 3.","user":"erikpaulh","rank":[526,856]},{"title":"I haven't cried in a movie theater in such a long time, but boy did I for this one","rating":10,"date":"21 June 2019","review":"I've been watching, and rewatching all of the Toy Story films for years now and have loved them all, and never wanted them to end, because I could never see an end to such a beloved series of films, but everything eventually has to finish out, and Toy Story 4 does it beautifully. I'm a guy who usually doesn't cry in movie theatres, heck it's a rare sight to see me crying, but I was bawling at the end. They did leave it to make other films, which I hope that they do, but if they left it like this I wouldn't be sad, because it closed all the emotional doors that needed to be closed, for me personally, and even opened some I had never knew could open before. Highly recommend 10/10.","user":"dussaultjulien","rank":[281,461]}]