[{"title":"Keeps you interested up to the end but unfortunately not the best ending","rating":7,"date":"3 May 2012","review":"I must say I liked the movie. Would I watch it again? No. Up to the very end the movie was very interesting and it has been thus far - by my standards one of the best movies that you see 1:20mins only one actor acting.<br><br>Acting was good to great. Special attention was given to verbal communications to convey meaning and a big thumbs up for that.<br><br>Cinematography and editing was very good, too. It does not get boring or repetitive and the movie maintains an edge right close to the end. Very clever script actually.<br><br>I would spoil the movie if I continue to speak about the ending but If you haven't read many reviews (that could spoil the end) and like mystery flick I would recommend this movie.<br><br>7/10 for the clever movie but loses some point for the ending.","user":"kuklei","rank":[42,54]},{"title":"Movie gets almost totally ruined by its ending.","rating":5,"date":"18 February 2012","review":"Now, I do admit that I'm not the biggest fan of claustrophobic movies,  as I would call them. The sort of movies that are being almost  completely set in a small confinement. Movies like \"Phone Booth\",  \"Buried\", \"Panic Room\". It's not like I hate those movie but it's just  so that you can only do so much with its concept, before things are  starting to feel stretched and worn out or just incredibly far fetched.  And boy, is this movie far fetched!  To be honest, I really wasn't hating on this movie at first. It was  simply fine enough for what it was and I was somewhat entertained by it  all. Not that the movie ever becomes truly tense or exciting with its  story but it was all really good enough to keep me interested and  wanted to see where it was going with its story and mystery.  However, the further the movie started to progress, the more ridicules  and unlikely things were getting and the more obvious it started to  become where the movie was heading at. I still was hopeful and wishing  for it that the movie would be doing something different and more  clever but unfortunately no. The movie did the worst possible thing it  could had done, in its final 15 minutes or so. I don't know what is  worse about it; that it actually ended on such a bad note, or that I  could see the ending coming from miles away already. I'm serious, the  cop out ending almost ruined the complete movie for me and I felt so  let down and angry by it all. It gets all the more worse once you start  thinking back about the entire movie. All of the things that happened  in it suddenly start to seem even more unlikely and just plain  ridicules when you do so and it makes you never want to watch this  movie again.  But I need to be fair. Since I still enjoyed the movie for most part, I  just can't rate it as a complete train-wreck, no matter how tempted I  am right now. The movie has its moments, especially at its start, when  you still have no idea what is going on.   But still, I obviously can't recommend this movie to anyone! As a  matter of fact, I would urge people to never see it, since chances are  you will be just as let down and angered by its lame and just horrible  ending, just as I was.  5/10","user":"Boba_Fett1138","rank":[61,83]},{"title":"Dorff - One Man Show","rating":7,"date":"20 July 2013","review":"Make no mistake about it, Stephen Dorff owns this film. He did such an excellent job. Since he plays the only visible character for about 93% of the film, I can confidently say it's worth a watch despite the glaring flaws of the film. He's just that entertaining here.<br><br>First off, I've never seen Buried, so my review will be unbiased in regards to that film - just keep that in mind. Overall, I thought the concept of Brake was pretty clever: Secret Service agent gets kidnapped; locked in the trunk of a constantly moving automobile by a group of mysterious terrorists; physically and mentally tortured by unconventional methods in order for them to get what they want. (As if any method of torture is conventional.) Will his character break (not BRAKE)? What exactly do the terrorists want and who are they? Will everything go according to plan along the way? You'll have to watch to find out. <br><br>A lot of people have complained about the ending (or multiple endings) and the ability to predict some of the plot twists, like, before the prologue. (No, just kidding.) Seriously, it was way too easy figuring this movie out. That said, I still enjoyed it. Listen, with a plot of this nature there are only a few ways this could have ended - either the terrorist will get what they want out of agent Jeremy Reines (Dorff) or they won't. Everything in between is just a waiting game of HOW they intend to get it out of him, WHAT it is they want, and IF Dorff's character will make it out alive or not. When it comes down to it, the ending (or multiple endings) does provide you with the answers. What more do you want people?!<br><br>Indeed, the plot is more than a bit far-fetched and I couldn't help but wonder why in the heck would anyone go through this much trouble to get something when there certainly were simpler (and probably more effective) methods to get the job done. I don't know, maybe they could have injected him with a truth serum or something. But then if that happened this wouldn't be called Brake; it'd be an entirely different movie. <br><br>There are some other issues. There were a few revelations that the writer, Timothy Mannion, intended to be relevant towards the climax of the film but he came up short big time. They made no sense in context to what had happened earlier in the film and added no value to the outcome of the film. Also, for Reines to be such a highly trained and alert Secret Service agent, he was often too naive in certain circumstances when even Stevie Wonder would have seen the writing on the wall. No fault of Dorff's though, as once again, this is more a reflection of poor writing than anything else.<br><br>Dorff was brilliant! That's why despite a cop out ending, sloppy writing, and plot elements so implausible that even M. Night Shyamalan would shake his head in shame, I still can't give it less than 7 stars. And that says a lot about Stephen's performance.","user":"Marc_Action","rank":[10,11]}]