[{"title":"Absolutely abysmal","rating":2,"date":"28 April 2013","review":"Regarding an alien invasion of France, this film is utterly dire. It has a wimpish protagonist who every chick in the film seems to have the hots for and every female character in it is either shallow, vapid or both. It gives no real explanation or backstory, but simply belts along, yet manages to be utterly devoid of tension or suspense and has stupid plot holes. Even at 70 odd minutes it still feels too long and is basically a sequence of weird occurrences and mediocre fight scenes. Also, the CGI sucks.<br><br>I don't even really have the heart to go into any more detail except to say that it's a total turkey and didn't go down well at all with the audience at the Edinburgh Dead by Dawn festival where I caught it.<br><br>2/10, a boring annoying film that doesn't seem to have a clue about what it actually wishes to say and a film to be avoided. Truly dreadful.","user":"Corpus_Vile","rank":[35,51]},{"title":"It could be a little worse, could be a little better.","rating":6,"date":"13 July 2013","review":"Okay so the story does start off interesting enough (Cowardly kid with a crazy past) and the premise is actually quite interesting as well as the story (not quite \"Zombies\" but something else) The problem is that they didn't use the budget well enough. Sure the effects are pretty good but there's occasionally some bad camera styling (it's enough to be noticeable) and the music and sound effects are very much below average. It's a shame who they got for the lead role because you can clearly see his lack experience, yet his fellow actors actually do quite a decent job. It does get a lot more interesting near the end of the movie but it doesn't give itself enough time to explore the possibilities well enough.<br><br>So in conclusion: If you enjoy cheesy zombie movies/ Creature movies then you may like this. If you don't mind the low-budget feeling horror flicks then you may enjoy it. If you're someone that only enjoys top-end effects and amazing acting then I don't recommend this movie for you.<br><br>It's a lot better than some of the horror-zombie-creature flicks as of late but it isn't genre defining, nor is it anything new. I gave it a slightly above average score solely for it trying to do something different. It may not have succeeded in doing something different but at least they tried and that's more than can be said for most movies these days.","user":"gamer2236","rank":[13,20]},{"title":"That's it?!","rating":5,"date":"3 April 2013","review":"I was tracking this movie for a few month already, as it was only shown on a film festival in 2012. The trailer also looked very promising. It showed some action and different stages of a beginning mutation, which suggested an interesting background story. Recently I finally saw the movie and was surprised about the length of about 70 minutes. The actual movie then had a completely different setting than what I expected. Some lone wolf goes to a weird party where it all starts, no background story and the protagonist undergoes a sequence of weird happenings. Just when the movie could have it's climax and the protagonist could go and search for answers or a safer place, the movie comes to it's end. In my opinion they could have made much more out of the setting and the background story. I was left very uncertain and it is like i missed the later half of a very interesting start this movie made.<br><br>PS. This is my first review, be forbearing.","user":"oscar-mayer232","rank":[9,13]}]