[{"title":"A Believable Portrayal of a Disturbed Teenager","rating":6,"date":"12 February 2013","review":"Not a typical horror or gore movie. Instead, this is a great pleading for why it is necessary to pay attention to your children, instead of ignoring the unpleasant things because they don't suit you. It's not one I would watch again, but it was definitely worth one trip into the minds of this family, the very kind of family we read about after some tragedy, and notice everyone says \"They were such a good family. They seemed like such sweet children. Well, the older one was a little odd, but isn't any awkward girl just a little odd?\"<br><br>This line is added to convince IMDb's review writing parameters that I have typed enough about this movie to satisfy everyone, including the fact that I was not privileged to see this at any kind of festival and have no obsession with following any particular directors, actors or producers outside of common knowledge.","user":"fureetutawk","rank":[44,54]},{"title":"Masterful","rating":8,"date":"11 October 2012","review":"In Excision, a high school misfit goes to great lengths to win over her domineering, conservative mother. Although it's presented as a horror film - and opened the Spooky Movie International Horror Film Festival - it's a psychosexual thriller, rife with imagery set against a pastiche of normative teenage angst and desperation. It is a brilliant, provocative, unsettling film.<br><br>Pauline (AnnaLynne McCord) is the misfit. Scarred with acne and and overall unkempt look and poor posture, she is the poster child for unpopularity. But, like many cinematic rebels before her, she looks upon the idea of being liked almost with disdain. The opinions of others don't influence her.<br><br>Pauline aspires to be a doctor, but she is anything but a model student. She challenges her teachers and plays her classmates against each other for her own gain. She has no friends, and her therapy consists of visits to the local priest, whereupon she notes the hypocrisy of his understanding her moral issues when he's by definition pretty repressed himself.<br><br>She's part of a nuclear family. Dad Bob (Roger Bart) is a success at something, but he's under the thumb of his controlling wife Phyllis (Traci Lords). Sister Grace is the favorite of the family, partly because she's so nice and good and sweet but also because she is suffering from cystic fibrosis.<br><br>Of all the people with whom Pauline interacts on a regular basis, she cares only for Grace. She despairs of her sister's imminent death and wishes the same on her mother. Typical for a teenager, to an extreme perhaps. <br><br>Throughout the movie, Pauline sets particular goals for herself and then completes them, in opposition to her attitude toward school and life in general. When her mother forces her to be (at an advanced age) part of a cotillion, Pauline understandably ruins the affair. But when she wants to pursue a career in medicine, she goes to the library (cutting school) and researches her sister's condition.<br><br>You may well ask what the title implies. Something is being excised. We've already established that Pauline wants to be a doctor, but what is to be excised is something I cannot reveal here. On a less literal front, Pauline wants to excise her mother's influence from her own life and the pain and suffering from that of her sister. <br><br>This is not a movie for the faint of heart. It is not dripping with blood and contains no projectile vomiting, but Pauline's dreams - which include impromptu surgeries that equate to intercourse in her mind - are erotic, disturbing, grisly, and symbolic. <br><br>McCord nails the role of Pauline. Dolled up for the cotillion, she looks almost presentable, but even when she's her slovenly self you can see her beauty - eyes, wit, intelligence, smile - even if no one else in the movie can. McCord sells the film by subtly morphing Pauline from an outcast to a sociopath; at first, you take her for just another weird kid in the hall, but over time you see her as clearly losing her grip on reality.<br><br>And I didn't think I'd say this, but Lords is really good - in an ironic role - as the pushy, moralizing mom. Traci, you've come a long way, baby.<br><br>It's very hard to believe this is writer/director Richard Bates Jr.'s first film, feature or otherwise. The writing is tight, and he gets a lot out of his cast - which includes John Waters and Malcolm McDowell. It's a stunning debut.<br><br>I wasn't sure how the movie was going to end, although it was clear I was being led in a particular direction. I wasn't misled, but the conclusion is still a knockout; leaving just enough unresolved to be satisfying. <br><br>Excision is thrilling, a movie that will resonate with anyone who's felt unloved and with anyone who likes tales of revenge and redemption. It wisely picks a course and never goes too over the top with its set pieces. It's not a mild-mannered film, but it's also not an overwrought, ham-fisted gorefest. It's cleverly nuanced, achingly acted, and a mind- blowing masterpiece.","user":"dfranzen70","rank":[66,96]},{"title":"Deliciously Macabre","rating":13,"date":"13 June 2012","review":"This film played as part of the 2012 Sydney Film Festival's \"Freak Me Out\" section. Director, Richard Bates Jr, set out to make a movie that he and his friends would have loved to watch in high school. This he's achieved and so much more.<br><br>From the outset, Excision seizes your attention, with its deliciously macabre imagery and malevolent audio track. Unfolding amidst the perfect banality of middle class suburbia, the stage is set for a savage assault on your sensibilities.<br><br>Annalynne McCord is fantastic as Pauline - the slouched, ragged, blemished, sociopathic, vexed atheist, sangrephile*, virgin with surgical aspirations and necrophilic fantasies.<br><br>In fairness, the entire cast is impressive. You need to keep in mind that this film is the debut feature for a 25 y/o and he claims that persistence worked a charm in signing the talent -- including an Academy Award Winner! <br><br>But it's the fantasy sequences that will leave you truly in awe of Excision. Pauline's dreams are tantalisingly lurid, so utterly vile -- yet shot so beautifully. Luminous and vibrant, these scenes impact and leave a stain that won't come out in a cold wash. In fact, at least one person passed out at the screening I attended -- for real.<br><br>Far from wallowing in this depravity, Excision succeeds in exploring complex relationships, themes of religious zealotry and how problematic being a self-taught expert can be. All this and a killer soundtrack to boot.<br><br>I have to add that I had the extraordinary privilege of enjoying the greatest Q&amp;A session in Sydney Film Festival history! Richard Bates was \"slightly intoxicated\" and proceeded to share some outrageous stories with us all. It caused a slight scandal, but, given the content of the film we all came to watch, his conduct was completely acceptable. Moreover, it was rare to see a person be so genuine and hysterically funny.<br><br>With his next project in the works, Richard Bates Jr just might be a name to keep an eye out for. I mean, if Peter Jackson can start with Bad Taste...I'm just sayin'... ;) <br><br>More importantly, for those of you with a taste for twisted film making - Excision is a must see.<br><br>*sangrephile - I made this up because I couldn't find a word for someone who loves blood &amp; isn't a vampire!","user":"ozraw","rank":[88,131]}]