[{"title":"solid thriller","rating":8,"date":"2 July 2016","review":"I enjoy John Le Carre, but none of the adaptations of his books have really blown me away. I am happy to say that I was pleasantly surprised by this movie. I came into this movie without many expectations, as I have not read the book and I hadn't heard anything about the movie. <br><br>Ewan McGregor and Stellan Skarsgård star as a British professor and a Russian mobster respectively, and both give great performances, especially Skarsgård, who plays a man who you know is a bad person, but you can't help but like. Naomie Harris and Damian Lewis also feature, and while both are good in their roles, I felt like Harris, who plays McGregor's wife, wasn't given much to do.<br><br>I really enjoyed the cinematography, and you could tell that Anthony Dod Mantle worked hard to make sure every shot was interesting even when what was going on in the shot was pretty basic.<br><br>The story is nothing you haven't seen before, but I found myself really captured by the great acting and interesting dialogue.<br><br>B+","user":"jmccarty-194-747783","rank":[43,53]},{"title":"Unwilling willing","rating":7,"date":"20 February 2017","review":"Sometimes you get into a situation without really doing anything. And then you have to ask yourself where to go from there. Something like this happens to Ewan McGregors character. Someone with a past, but also someone with morals. And someone who seems to be struggling with his life, so he may be welcoming whatever gets thrown at him.<br><br>This is based on a novel which I haven't read, so I can't compare those two. I can tell you that the movie is more than suspenseful enough and it seems very much rooted in reality (of course heightened at certain points of the story). There are many obstacles and you may see a lot of things coming before they happen, but the movie is played very well and is more than decent enough to enjoy","user":"kosmasp","rank":[8,8]},{"title":"Citizens on Patrol","rating":6,"date":"15 July 2016","review":"On any other day, a British espionage thriller would make for a good change of pace from the summer blockbuster season. Based off a John le Carré novel, and it makes it even more intriguing, seeing that the master of spy fiction that brought us \"Tinker Tailor Soldier Spy\" and \"The Spy that Came In from the Cold\" is still up and sprightly, churning out novel after novel like it was nothing. I guess the secret to longevity is indeed to keep on working on your passion.<br><br>Now comes another film adaptation of his work – this time with actors of caliber (Ewan McGregor and Stellan Skarsgard, among others) and double the predictability. I have not read Le Carré's original source material, but my guess is it will be far more intriguing than what was presented here.<br><br>The film, telling the tale of how two ordinary British citizens (McGregor and Naomie Harris) naively help out a turncoat Russian mob enforcer (Skarsgard) and getting in the crosshairs of a ruthless MI6 agent (Damien Lewis) in the process, ticks the right boxes, and nothing more. It becomes an engrossing watch throughout, where characters scheme and plot while other innocents are naively caught in the crossfire.<br><br>Everything is fine and dandy – technically well-made and paced, the performances are spot-on and the story is a good tried-and-tested formula, though post-Brexit it seems unfortunately dated already, and the dialogue relies too much on the four-letter word, a jarring contrast a from Le Carré's usual classiness. The key word here is 'perfunctory'. It functions, and nothing more. Might be good with a cup of hot afternoon tea.","user":"dvc5159","rank":[28,34]}]