[{"title":"Starts out strongly, fell apart and ended with a whimper","rating":7,"date":"31 August 2013","review":"I watched this movie thinking that this movie is actually one of those light-hearted family comedy-drama. I was pleasantly surprised that it served more... much much more. <br><br>As the plot summary already contained, this movie is the coming-of-age tale of Lucy, a smart 15-year old girl who's a product of teenage pregnancy. Her father is pretty much absent most of the year because he has to work as a lumberjack somewhere. And while he is an absentee father, he is very much committed to provide for his family. As her dad (played by James Marden) grew up in an orphanage, he has a longing to have a traditional family where the mother stays at home while the father goes away to find livelihood. Her mother, having deprived of living a single life being married at an early age, tries to live the single life ---while trying to hold on to her family --- with disastrous consequences. <br><br>The first half of the movie started out fantastic, taking its time to establish the main players in Lucy's life which is mainly her parents and her best friend since they were kids, Kenny. Contrary to one of the user reviews here, Lucy and Kenny are not \"unreal\". Although they were not your typical average teenagers driven by raging hormones, these type of kids exist (I would know, I'm one of them). Their belief system were mainly shaped by the family they were born in. Kenny, a product of divorced parents looks forward to a relationship that will last but is very pragmatic which pretty much stops him from going for things he really wants. Lucy, having parents who were unprepared to be parents, has to overcompensate for her parent's irresponsibility. However, as any teenager who goes through self-discovery, she eventually started exploring her sexuality and romantic relationships unguided. And as any teenager who goes through bouts of angst and anger, she also started unraveling. <br><br>All of these drew me in. Sarah Bolger, who plays Lucy, embodied the part so well that it's quite hard not to fall for her--- flaws and all. Claire Danes and James Marden, for the most part, were effective and sometimes brilliant. <br><br>However, the movie started to fell apart when it tried to do too much. And instead of focusing on one theme... it started adding in heavy sub-plots that didn't go anywhere or if it did, it didn't come to a satisfying close that will eventually support the main plot. And when you start stacking more and more, it's bound to fall apart. Not that the sub-plots were bad. Had this been a TV mini-series, it would have been more effective because these sub-plots could have been explored at length. But considering the medium, it just weighted the movie down... hard... <br><br>And it's an extreme disservice because the first half of the movie was really good. There were some well put together which showed moments of brilliance. As much as I want to remember the movie for it, I can't erase from memory the last 30 minutes and especially that ending that wasted great talents like Peter Fonda. And suddenly, the movie ends with a whimper... as if the writer just ran out of paper to write on. In coming of age movies like this one, it's important that the main characters have to come face to face with the need to evolve and move from point a to b. And although the ending somehow shows us that Lucy finds peace in surrendering to her fate. It felt abrupt and forced. <br><br>Honestly, I would give this a movie a 6/10 but the 5.5 rating is I think too low for a movie that actually showed a lot of promise. So never mind the last 30 minutes of the movie, I still fell in love with Lucy so I'm giving this a 7.","user":"myc4971","rank":[15,15]},{"title":"A film about people","rating":7,"date":"22 August 2013","review":"On the surface this seems like a simple, predictable film. It doesn't have a grand storyline nor does the plot build up to a single defining moment. <br><br>Essentially, this is a film about flawed characters who make flawed choices. They don't always say the right thing or solve all of their problems. They are simply human.<br><br>Danes is wonderful as the now 'grown up' teen mother, struggling with her own identity crisis as her daughter - the same age as her mother was when she was born - is too exploring her sexuality and considering her future. Bolger plays the role with enough restraint to avoid the teenager stereotype, whilst Marsden, although his scenes are brief, is so believable as the absent father.<br><br>I can see where this film could be seen as shallow and it's true that there are a few stronger issues that are touched on but not really developed (consent, domestic violence to name a few). However, in a way I appreciated how the plot continued on without delving into the complexities and our characters continued to make the impulsive and flawed decisions that make them as human and realistic as you or me - shaped by these things that have happened to them, but not defined.","user":"Breezeblocks","rank":[27,33]},{"title":"Had potential","rating":6,"date":"31 August 2013","review":"Firstly, I need to say that I enjoyed this film, I did. It held my attention and I felt satisfied afterward. Yes, it was mildly predictable in places but not annoyingly so.<br><br>What did frustrate me though was the lack of depth. A couple of other reviewers mentioned this so I'm glad I'm not alone: There were so many issues that I thought were going to be explored further and just.... weren't. Even the ending, although mildly cathartic, left me with unanswered questions.<br><br>Still, taken at face value, the film was... nice. <br><br>Hmm... I'm realizing this review is a bit 'meah'; not really negative, not really positive, but that's a direct reflection of the film's content, so sorry!","user":"niobemalcolm","rank":[18,21]}]