[{"title":"Good - Probably would watch it again sometime.","rating":7,"date":"15 September 2012","review":"This is a Jean-Claude Van Damme action flick.<br><br>I've seen a number of his similar films over the years and feel that they have all been better than average. Meaning that if you like action movies, Van Damme delivers with ones that you will probably watch again sometime.<br><br>Like Assassination Games (2011), this one features his son and daughter (his daughter also produces). No, his kids won't win any acting awards either, but they turn in credible performances for their characters. For his part, Van Damme acts better than I have ever seen him act before as a troubled ex-mercenary who has built a reputation finding and returning kidnapped children. He also seems to have built one for leaving a lot of bodies behind, including innocents. Unlike most of his other movies where he does no wrong, this one has him a lot more fallible and even negligent. His realizations have him showing lingering regret that really spices up this plot.<br><br>While this film is vaguely similar to Taken (2009), there are more differences than similarities. It also shows what amoral lengths the family of a kidnapped child might be willing to go to to get their kid back.<br><br>This is a good action flick with some thought provoking moments about consequences and choices. I recommend it.","user":"shroyertour","rank":[43,46]},{"title":"I was TAKEN by surprise!!!","rating":8,"date":"19 September 2012","review":"Let me be as direct as possible: this movie rocks!!! I know most people are expecting a cheap movie with flat dialogues and average acting but this film will certainly surprise many. <br><br>OK, you won't have Academy Awards performances but the actors did a good job. The action is well executed and the plot line captivating enough. <br><br>I believe that Joe Flanigan made his character believable and convincing enough. Plowman was also decent as the mum looking for her kidnapped daughter. <br><br>Overall I give \"6 Bullets\" a solid eight. It is good fun. Van Damme is BACK!!!","user":"bitea2002","rank":[48,56]},{"title":"JCVD has another hit on his hands","rating":8,"date":"13 September 2012","review":"Jean-Claude Van Damme shines as Samson Gual, an ex-mercenary haunted by tragic accidents of his past job who seeks to redeem himself when he's approached by a MMA fighter who seeks Gual's help in getting his fourteen year old daughter back after she's abducted by sex traffickers.<br><br>While a bit hokey in places and some of the acting by the bit players leaving much to be desired, all the major characters do a very adequate job and the action scenes are very good. I found myself enjoying this \"Taken\"-esque film quite a bit. JCVD indeed has another winner on his hands.","user":"movieman_kev","rank":[43,51]}]