[{"title":"\" FATAL FLAW 😱 \"","rating":6,"date":"12 July 2019","review":"A ( - M I C R O - ) REVIEW<br><br>This is a Vivid, Exciting, Suspenseful, tremendously-Engaging &amp; to a certain extent \" S p r a w l i n g ( ⭐ ! ) \", EVEN... PRODUCTION. Sadly, it is also a { \" TRAGICALLY PERFECT :'( :'( :'( \" } example of how a COLLOSSALLY-SIGNIFICANT \"Error-in-scripting\" can cost an otherwise entirely enjoyable film..... practically 'HALF it's weight in REVIEWS-&amp;-REVENUE', ALIKE .<br><br>\nSo here are a Group of \"True-Believers\", who go out on an ( essentially ) 'Blair-Witch style' DINOSAUR-revealing expedition in DEEP, unexplored Congo -&gt;- ' GET THIS ' -&gt;- \" ⭐ WITH HARDLY A WEAPON TO BOOT ! ! ⭐ \" . THE CLOSEST THING to a weapon seen over the course of the ENTIRE picture is -&gt;- now get T H I S -&gt;- \" A..... B O O M - M I C ( D: ! ) . But Other-than-that, these 'EXPLORER-researcher-thrillseekers' are THOROUGHLY, THOROUGHLY, THOROUGHLY unprepared for any manner of DANGER..... { &amp; in This-particular-instance : danger of the most OMINOUS KIND ( :O ! ! ) IMAGINABLE, no-less } .<br><br>\n\" ⭐ SUSPENSION OF DISBELIEF ⭐ \" :\nWhen it comes to films, \"Suspension Of Disbelief\" tends to be a ~ P A R T I C U L A R L Y ~ delicate thing. You, as the esteemed-Director, could have EVERY SINGLE ONE of the pieces of your STORY in place, i.e enough of your \"Ducks-In-A-Row\" to COMFORTABLY ( - ! ) give your movie its proverbial \"Wings\". But then just N E G L E C T -&gt;- { for WHATEVER reason ( ..&amp; the reason was ENTIRELY beyond my comprehension in the case of this particular cinematic endeavour... ) } -&gt;- THAT \"ONE VITAL PIECE; &amp; all of a sudden you now have a veritable 'House-Of-Cards', ...( instead ⭐ ! ).. of a SOLID, ENDURING MOVIE .","user":"RADIO-1S_MR-MOVIE-MAD-AMI_104-FM","rank":[14,17]},{"title":"Predictable and Lame Lost World","rating":3,"date":"23 July 2013","review":"A British expedition formed by the lead researcher Jonathan Marchant (Richard Dillane), his assistant, a doctor and a TV crew, travels to Congo to seek evidence of a dinosaur. A local guide and the helicopter pilot join the team and the group heads to the jungle. During their trip, they find a stowaway in the helicopter, the son of Jonathan. Soon the helicopter is attacked by flying creatures and crashes in the jungle in the beginning of the last journey of Jonathan Marchant and his team.<br><br>\"The Dinosaur Project\" is a predictable and lame dinosaur movie, a combination of the clichés of \"The Lost World\" with the exhausted style of the \"reality\" of \"The Blair Witch Project\". It is amazing that the viewer can predict what is going to happen on the next scene, and most of the dialogs are ridiculous. My vote is three.<br><br>Title (Brazil): \"Projeto Dinossauro\" (\"Dinosaur Project\")","user":"claudio_carvalho","rank":[22,29]},{"title":"Great Movie","rating":8,"date":"8 September 2012","review":"The movie has a very fun story to it, which leaves a lot of space for action and playing around with.<br><br>Yes, some of the acting was cheesy, some of the story was cheesy, but all in all the story was very entertaining.<br><br>I think they should have dropped the POV style of filming, because as a normal movie it would be great.<br><br>Fun shots, lots of action, and a cool story.<br><br>There are also very original takes on the whole dinosaur-man connection which I haven't seen in any other movie.<br><br>CGI was really well done, which is pretty rare in movies that seem low budget.<br><br>I think for some reason people are just hating on the movie for no good reason (there is no reason why this movie deserves 1 star...)<br><br>The ending leaves lots of space for a sequel, and I cant wait to see it.","user":"ejehuda","rank":[44,64]}]