[{"title":"Thor","rating":7,"date":"24 February 2020","review":"Is this a huge stepup from the original \"Thor\" movie. No, unfortunately not. Is it another watchable, fun superhero movie; yes, definitely. It's a really good movie and if we look at the way Alan Taylor directs this movie, it's actually not that much different from what Branagh did back in 2011. Chris Hemsworth is good as usual and Tom Hiddleston is more wonderful than ever as Loki, but the villain Malekith, played by Christopher Eccleston, unfortunately, is a bit of a disappointment, mostly because of the lack of motivation.","user":"MR_Heraclius","rank":[40,44]},{"title":"All style, no substance","rating":4,"date":"10 November 2013","review":"The acting was solid. The production value was superb. Everything else was really poor.<br><br>The back story and character motivations are laughably sparse. Most of the characters are completely one-dimensional, with the possible exception of Loki. The plot is the most boring and typical of all action plots - some \"bad dudes who happen to be really ugly\" decide to \"destroy the world for no reason other than being evil\" and \"only our hero can save us all\", etc. Moreover, it was lazy writing - whenever an absolute miracle needed to happen, it conveniently did, every time. <br><br>Of course this is a mindless blockbuster Marvel movie so we shouldn't expect much. But the thing is that these kinds of films CAN be made with a reasonable plot, pacing, and character development. The writers were obviously just going through the motions to cash in on the surefire moneymaker sequel, and from a business perspective it is hard to fault them. But it says a lot about the sad state of Hollywood in 2013 that this film currently has a 7.7 on IMDb.","user":"ff9000","rank":[456,614]},{"title":"Even more shallow than the first.","rating":3,"date":"6 December 2013","review":"The plot barely exists for this film. Generic evil people try to take over universe, Thor stops them, the end. Which might have been alright but there was very little action in this mindless action film. What little fighting we got was poorly orchestrated and repetitive.<br><br>The dialogue is wooden and adds nothing. The characters with the exception of Loki have no depth and only exist as an assortment of clichés. Hiddleston makes for a great Loki but that is literally the only good or interesting thing in the entire film.<br><br>Thor continues to be the worst Marvel movie franchise and Hemsworth is possibly the worst actor to ever star in multiple major movies.","user":"redpandarevolution","rank":[169,252]}]