[{"title":"Just fights !! nothing more","rating":4,"date":"14 January 2013","review":"I was having high hopes for Kill'em all, but was left disappointed at the lack of creativity and enjoyment of this movie. it had what seemed to be an interesting plot, the idea behind it sounded cool and intriguing, but the delivery of that idea was below what is expected. the plot involves a group of highly professional assassins who got kidnapped and locked into a bunker together by a madman who forces them to play his game and fight each other to escape, for no clear reason, probably for his own sick entertainment. the fight scenes in the film were impressive to some extent, some well choreographed fight scenes that involve mainly martial arts, but they add nothing new to the hundreds of action films out there.<br><br>the lead actress had some impressive moves and a cool sexy outfit, very delicious to look at.<br><br>generally, the acting was just awful, very rigid and lame, those people seem like professional athletes, but just don't cut it as actors which really harmed this movie big time.<br><br>the script and dialog was just as awful if not the worst i've ever seen in a movie, just awful writing, that nothing smart comes out of those actors, lame and boring dialog that i just screamed please shut up once a conversation starts !<br><br>Add to that a lame villain that looks like an Asian version of Blofeld of the Bond films, minus the cat. a bold villain in a grey suit with some good fighting skills actually, he also have an army of psychopaths and ninjas that ultimately fight our heroes. \" one might ask why don't he just use his ninjas to fight each other for entertainment ? \"<br><br>the effects were also below average when explosions were involved, something that can be made with a simple editing program on your laptop.<br><br>so generally, a boring film for the most part, low grade B film with only some good fight scenes as its positive, otherwise,atrocious acting and an avoidable B film that adds nothing new or special out of all the hundreds of B action films out there.","user":"med77_99","rank":[19,25]},{"title":"Lo-fi action-fest","rating":9,"date":"12 July 2013","review":"Raimund Huber's Thailand-based assassins-trapped-in-a-killing-chamber movie is low on budget but high on action, as stunt coordinator Tim Man delivers eye-popping fight scenes by the truck-load.<br><br>The film boasts Gordon (KILL BILL) Liu as the villain, Joe (JAGUAR LIVES) Lewis in his final role, the scrumptious Zom (CHOCOLATE) Ammara as the heroine (who uses a couple of bricks to beat one huge bad guy) and loads of masked maniacs &amp; ninjas! But it is Tim Man who really stands out, as the vengeance-seeking Kid, who cuts a swath through the hordes of attackers, getting his vest coated in blood!<br><br>The film ends with a great showdown, as Zom &amp; The Kid battle it out with top bad dude Snakehead (Liu).","user":"kenfreelance","rank":[8,9]},{"title":"All action and no brains...","rating":5,"date":"19 February 2013","review":"\"Kill 'Em All\" is a hang-over movie, plain and simple. There is almost no storyline connected to this movie, and it is basically just martial arts and action from the very first moment of the movie right up to the end credits.<br><br>The so-called storyline is about a group assassins who are captured by a mysterious man and forced to battle against one another, with the loser forfeiting his life in defeat. But the small group of assassins manages to break free and will now track down their capturer.<br><br>Yeah, that was basically the entire movie wrapped up in a couple of lines.<br><br>The martial arts in \"Kill 'Em All\" wasn't all that bad, but there are far better martial arts movies available. Some of these so-called assassins could have used a bit more training and coaching, because their fighting skills didn't really come off as believable or good enough for supporting them as assassins.<br><br>As for the acting in the movie, well it was next to not existing. This is a martial arts and action movie and acting is put in the background. No doubt about it.<br><br>\"Kill 'Em All\" is good for some fun when you need to unhook your brain and just watch some senseless action.","user":"paul_haakonsen","rank":[11,14]}]