[{"title":"Pompeii","rating":4,"date":"4 March 2020","review":"Let's start with the positive: the movie looks great, the visuals and effects really work. Little else does, though. The cast acts wooden, the story is predictable and boring, borrowing many elements from Gladiator and the end is cheesy as hell. Overall a real waste of time.","user":"MR_Heraclius","rank":[42,44]},{"title":"It all depends on your attitude","rating":7,"date":"6 March 2014","review":"You can take this movie from two different sides.<br><br>As somebody who is very much interested in history and geography and has studied both for many years, this movie is obviously full of mistakes and wrong stereotypes. It is almost as inaccurate as the \"Spartacus\" series. And this is never an original movie. We have all watched movies with very similar story lines about the evil Romans who want to control everything, the poor gladiators who stand up against them and the forbidden love between a rich young woman and a foreign slave. I can understand why many people are rating this film down. If you really want to watch a sophisticated movie about that time, go for the classic \"Ben- Hur\".<br><br>What I think is strange is that all these stereotypes were highly predictable from the trailers only. I am asking myself why people even went to watch this movie if they were going to hate it for the reasons mentioned above. Some people just want to bash a movie and seem to have a very sad life if they waste their time watching movie they dislike so much.<br><br>I went to watch the movie for something different. I wanted to watch a colourful movie with impressive sets and costumes and stunning 3D effects of an exploding volcano. I was eager to watch a fast pace flick with a lot of fighting scenes, some tension here and there and maybe a few love scenes with beautiful actresses. And I exactly got that. <br><br>In addition to this, the acting was just good enough and included a few interesting characters. I really liked Adewale Akinnuoye-Agbaje and Jessica Lucas in this film even though they played stereotypical characters and could have had more screening time. If you are going to watch this movie for Carrie-Anne Moss or Kiefer Sutherland, please do not. They have been much better in other movies in the past.<br><br>In the end, it all depends on you. If you want to watch an original and profound movie and learn something about the Roman Empire, just forget it. If you want to watch a effect ridden action adventure, you are going to like this. It is not the movie of the year but I surely had a great time watching it.","user":"kluseba","rank":[321,402]},{"title":"3D first, Movie second","rating":4,"date":"26 February 2014","review":"The movie Pompeii was obviously thought-up and directed around the 3D effects. The plot, acting, and script must have all been after-thoughts to the 3D fireballs shooting off the screen, 3D ashes floating in front of your eyes, and the 3D objects being hurled around by tidal waves.<br><br>It was watchable, but don't be expecting a fabulous plot that you haven't seen dozens of times in other better movies. The bad writing had most of the actors come off sounding like lifeless wooden statues that would say and do very unbelievable things just to keep the story going. Everything was very predictable. So predictable, in fact, there were a couple of moments I could have sworn I did see it before!<br><br>This was a good example why I typically do no like 3D movies. Having some good 3D effects is not a valid excuse for making a bad movie!! This definitely could have been much better!","user":"imwalt","rank":[161,212]}]