[{"title":"A Giant Slap to the Face.","rating":2,"date":"3 January 2015","review":"Being the guy from the other side, i was immediately insulted by Hollywood choice to Capitalize on a tragedy, because in no way, shape or form, Hollywood would respect the victims and show what actually happened. if you want to see what actually happened then go watch a Documentary called \"Ghosts of Abu Ghraib\", this movie on the other hand was a poorly executed, yet over-dramatic bullshit that never happened with a \"Based on true events\" sticker slapped to it.<br><br>Shockingly, it was the debut movie of the Actor/Director/Writer Luke Moran, who also took the leading role in this movie, which bring the first question, why in the world would your debut attempt at Hollywood picture be something really hard to interpret, because, in one way or another, it has to be a political movie, it has to play it safe and make sure not to insult both sides, and it has to deliver a powerful message about the American policy in Iraq, there's no way around it, however, this movie managed to find a way around it, by doing absolutely nothing.<br><br>It's the story of Jack Farmer, an American solider deployed to Abu Ghraib prison for an initial period of six months, after arriving in place, the movie slap you in the face with the poor living conditions of the American soldiers, with no electricity or clean water, and with bombs falling on them the entire time, which is the movie \"building up\" for what it should happen next, so, after working in motor pool for a period of time, Farmer apply to serve as an MP (Military Police) as to the fact that the prison is understaffed, during this time he develop a good relationship with an inmate in which the inmate told him that he's an innocent man and was arrested during a massive arrest after a bomb went out and killed 18 civilians. three days prior to go home, he receive an order to stay for another six months in Iraq, but with a two weeks vacation to home in the upcoming months, while serving as an MP, he try to defend his inmate friend and offer him food and question the people doing the torture/investigation and get told that \"as a solider, he shouldn't think, his job is to follow orders\", so, he find himself unable to change anything. the movie cuts days very fast, in a way that wouldn't let you develop a relation with the main character, and it failed miserably to show any character development at all during the entire movie. cuts to few days later, the lieutenant tell Farmer that he won't be leaving for a vacation because he can't lose him and his inmate friend confess after being brutally tortured that he did commit these crimes and he did bomb people, and from there, the movie drops to zero, as they suddenly show Farmer being mean and loud on inmates abusing them and yelling at them, with no decent back-story as what have happened.<br><br>The movie is 1 hours, 20 minutes, in which nothing ever happened, the entire movie was about one American solider and one Iraqi inmate, there are no characters in this movie, it might as well, removed the inmate and all you have left is a story going nowhere, you have no idea where the inmate/solider relationship is going, and the movie had little to absolutely no dialog, and some horrible effects, close-ups and flashes poorly executed and overall amateur production value, it was a poor attempt at anything really and it failed to show any value, and we can all agree on that.<br><br>However, since i like to dig deeper, i won't give this movie any credit, which i usually do for debut/indie films, not only it wasn't anything about anything, it managed to be even worse than that, because, when that one, honest/innocent looking inmate was shown as guilty, then, that just goes to justify the soldiers actions, it even tries to victimize the soldiers, and show you that when they show compassion, they get stabbed and betrayed, which is downright misleading, and brutally insulting to the actual innocent people who were imprisoned there during massive arrests in Iraqi streets, and to add insult to injury, they show you that even the most decent solider can be so easily brutalized and then get convicted of war crimes for \"just doing his job\", hell, the movie never addresses the people whose in-charged of the torture, or the people who approved the torture, and it vaguely implied that torture is the best way to get information out of inmates, it even showed so little torture of inmates so the audience won't feel very sorry for them, and even if they did, then showing that man being guilty is a brutal justifications of the tragedy that happened there, seriously, f**k this movie.<br><br>Overall, a poorly executed movie with no value whatsoever, and brutally insulting to the victims who were tortured to death in that prison, the movie never achieved a valid point at all, instead it victimized the American soldiers and showed us that torture is the way to go, hell, this movie was discredited by people who served there as MP's who watched this movie and said that it was misleading, so, how bad is it? Insultingly bad.","user":"osama_sarm_1000","rank":[10,15]},{"title":"Not What Really happened","rating":4,"date":"3 August 2014","review":"This movie is full of misinformation, holes, and downright misleading. I was one of the soldiers of the 72nd that opened that prison in 2003 (March-November). The very first unit to step foot in that prison. This is in no way what took place. If you are looking for a some kind of historical documentary, as I was, look some place else. All this is, is some Hollywood magic and creative writing for entertainment ONLY. You don't request to just be an MP, then go working a prison. It is a job you have to train for, just like civilian law enforcement. I guess I am bitter due to the fact that I was there, I dealt with the inmates, the working environment, and the constant threat of death or physical harm, by the inmates and outside insurgents. We did not have friends on the other side of the wire. They wanted to kill you, not have a cup of chai. The inmates would clap and cheer at seeing American soldiers hit by mortar fire in the compound. If you called this movie \"Prison X\" and made no mention of Abu Ghraib, then at least, you wouldn't be feeding a line of crap to the public about something you have no clue about.","user":"cparkinson8239","rank":[16,28]},{"title":"Don't try to watch this film","rating":1,"date":"13 September 2014","review":"This is an awkward film. It's twisting the reality. It's all a lie showing that the US army always have good intentions. While the reality they were devils entered Iraq to steal the oil, kill, rape, and destroy everything. That honest soldier shouldn't have gone to Iraq in the first place. Because he went there just for money. He chose to build his life and destroy the life of the others. Also, it does not make sense that Iraqi detainee was a scared coward guy and he was the one who bombed people. They did not show any scene about what media showed in showed about the crimes the USA army committed in Iraq. This movie is trying to block the reality from USA citizens to justify the crimes committed.","user":"libyanasalafi","rank":[28,54]}]