[{"title":"This is NOT a Sci-Fi / Horror movie","rating":5,"date":"15 March 2015","review":"I was excited when I first heard about a sequel to MONSTERS. Then, as I often do when trying to keep up with all the films I eagerly await, I lost track of it and all-of-a-sudden it became available. Being a big fan of the original, I couldn't wait to see it. Now that I've watched it, I can't stress how much of a disappointment it was.<br><br>MONSTERS: DARK CONTINENT is NOT a Sci-Fi / Horror movie. It is a war movie disguised as a Sci-Fi. And it's not even a very good war movie at that. It's somewhere in the middle. Very average. The biggest, of very few, somewhat redeeming qualities was the special effects. The monsters looked great! To bad they were overwhelmingly used as backdrop props, looking like a herd of buffalo at times.<br><br>I'll never understand why this wasn't just strictly a war movie. It could have been an above average war movie if the money spent on the monster effects had been used for a bigger war setting or better actors. There was just no need for monsters to be roaming in the background of a war movie, never really posing any threat to the characters. I don't know what else to say. Very disappointing.","user":"Reaper-of-Souls","rank":[121,152]},{"title":"The real monster is inside","rating":6,"date":"16 March 2015","review":"I remember only vaguely the first Monsters movie and my review from back then said that I liked it a lot. As in that one, the alien monsters are just a backdrop - although in this film I would say that they are superfluous. The story is about a group of kids from Detroit who join the army, go in some Arabic desert and fight both monsters and insurgents.<br><br>The big big problem with this film is the length. It two hours long. From those, a quarter is just presenting the characters in a pompous way that doesn't really say anything about them, another is about hooting manly and being manly shouted at by their instructors, then the rest is about how they didn't absorb any of the training at all and how their manliness doesn't really do anything for them. I am being a bit mean.<br><br>I guess the message was that monsters are everywhere, from the people setting a dog on a little alien forcing it to defend itself and kill the dog, to the American forces mindlessly killing civilians, from the Arab insurgents who kill soldiers, to the maddened soldier who needs to kill everybody that even looks like an enemy. As usual, the alien monsters are just minding their own peaceful business.<br><br>Bottom line: the movie failed in a number of ways: bad character exposition, pointless length, stupid soldiering, a plot that has no need of the aliens. The (valid) point that it wanted to make was lost in all this noise.","user":"siderite","rank":[80,101]},{"title":"Deserves every lost dime of it's poor box office performance","rating":1,"date":"13 January 2016","review":"What a load of pretentious, art w*nk nonsense this film really is.<br><br>It's bad enough that the story is paper thin and the characters are as unlikeable as an upset stomach (one minute gangsta tough, the next screaming like babies) but the direction is shocking.<br><br>It's like a frustrated art student trying out every possible style of image capture. Long shots, close shots, lens flare, angled, shaky cam, slow mo and none of them working.<br><br>One pointless scene of a helicopter taking off showed it's ascent from at least 10 different angles - outside looking up, inside looking out, inside looking inside, outside different angle etc etc.<br><br>Every character must have had at least two shots of them silent screaming from the Dummies Guide to filming internal angst.<br><br>Things aren't explained, geography is not established and you can almost feel the makers telegraphing their contempt to the audience that 'if you don't get this, you're too stupid'.<br><br>It's not engaging, thought provoking or entertaining. And when it's finished all you can contemplate is the utter pointlessness of the whole film.<br><br>I know many complain of studio execs interfering with a film but you really have to question who greenlit this laughable project or signed off the finished product for general release.<br><br>Whoever it was can't tell the difference between a movie and a flickerbook of cool filtered Instagram pics.","user":"Paynebyname","rank":[41,52]}]