[{"title":"A beautiful dark dream","rating":8,"date":"12 February 2013","review":"In few words Imaginaerum is a dive into a man's surreal dark dreams with superior strengths in terms of powerful images and music and some minor weaknesses in character development and acting. What may appear as another childish adventure at first quickly develops into an emotionally demanding journey dealing with very adult conflicts on a metaphorical and artistic level.<br><br>In detail Imaginaerum starts off rather associative. Really strong pictures and music (reminding me of Tim Burton movies) guide the audience from the very first second deep down the rabbit hole. The Scenery is especially impressive considering the budget of the movie. While technically being a convincing and easy show, scene jumps and plot appear rather cryptic at first. The movie succeeds at creating a rough and positively incomplete idea of the plot in your head quickly and developing that idea scene by scene throughout the whole movie without letting anything become too obvious or boring. The basic ideas appear metaphorical, yet decipherable and believable. I might add that Imaginaerum demands much (but not too much) of the viewer rationally as well as emotionally: It requires active thinking to follow the central plot and it is necessary to apply yourself to the emotions of the movie to understand the scenes. Not doing so will greatly decrease the value of the experience (and may result in questionable reviews some might have read so far).<br><br>The only downside to me is that there was unutilized potential of even deeper character development. They all started interesting but ended a little abrupt. In addition I was not totally convinced by some character acting. In some moments I got that \"There is an actor playing a character\"-feel which shouldn't come up. Surprisingly it didn't affect emotion and meaning of the movie too much so I can overlook that weakness easily. Having mentioned weaknesses I also want to mention that there were many great moments in terms of acting as well. For example I really enjoyed the great performance of actor Tuomas Holopainen!<br><br>Imaginaerum as a \"band-movie\": I don't consider myself a Nightwish fan even though I don't dislike their music. I was positively surprised that Imaginaerum, in contrast to other band movies, did not make it a 2 hours narcissistic music video. A few times the band is on screen but only adding positively to the atmosphere.<br><br>As being someone who enjoys strong images, demanding plots and artistic implementations I totally recommend this movie to my friends and to you. I advise parents to be cautious showing Imaginaerum to children, as some scenes \"can be disturbing\" (as other reviewers already mentioned) and the movie as a whole may be hard to understand. I personally recommend this above 12 years of age.","user":"dashannes","rank":[65,70]},{"title":"Imaginaerum is not an easy movie to wrap your head around, but if you stick with it till the end, I guarantee you will shed a tear or two.","rating":8,"date":"23 November 2012","review":"Imaginaerum is one of those movies that will leave you confused for the first hour in to the movie. The bits and pieces of the soon fading memories of Thomas Whitman will confuse you and give more questions than answers. The last quarter of the movie will offer some explanations, but some will remain and the gaps in the life of Thomas Whitman are left up to the viewer to imagine. <br><br>The special effects are beautiful, but cannot compete with Hollywood movies with multi-million dollar budgets. Actors do their jobs pretty well, but some of them are not as convincing as you would like. Especially the young Gem Whitman leaves something to be desired. Francis X. McCarthy on the other hand is very convincing playing the role of the old demented song writer Thomas Whitman.<br><br>If you are a Nightwish fan, you'll get a kick out of this movie. If you have never heard of the band called Nightwish, you might enjoy it anyway if you are one of those people who like the fact that not everything is clear at the very beginning. <br><br>Overall, the movie is very touching once you get into it. It's not one of those \"leave your brains at the door\" movies because you really have to think and try to identify with the characters. With this movie, you can't expect things to be handed to you on a silver platter. Though something else might be...","user":"sini-raisanen","rank":[79,89]},{"title":"Imaginaerum: Who put these tears in my eyes?!","rating":8,"date":"5 August 2018","review":"Imaginaerum was a random pick &amp; mix movie I went into knowing nothing and was immediatly struck by how good everything looked. This Finnish made title looks like a AAA Hollywood movie except here the rest of the quality matches.<br><br>Otherwise known as the Nightwish movie as it was scored &amp; soundtracked by the Finnish band, this is a dark fairytale that really took me by surprise.<br><br>It tells the story of a man in his final hours living a bizzare fantasy in his head while his embittered daughter deals with his condition in her own way.<br><br>It is a true visual treat that though very fragmented and not the easiest movie to follow does in fact have an outstanding payoff and all comes together in the end.<br><br>Looking great, sounding fantastic and with a story that comes together this beautifully my one criticism was that I wanted it to continue for longer.<br><br>A wonderful movie worthy of anyone and everyones attention.<br><br>The Good:<br><br>Visually stunning<br><br>Fantastic soundtrack<br><br>Devastatingly well written<br><br>The Bad:<br><br>Should have perhaps been longer<br><br>Couple of weak moments that damage the flow<br><br>Things I Learnt From This Movie:<br><br>I should start listening to more Nightwish","user":"Platypuschow","rank":[15,15]}]