[{"title":"This was far better than expected.","rating":7,"date":"25 April 2015","review":"After loads of recently bad Bigfoot movies I was kind of dreading another disappointment but actually this was pretty good. There were no surprises plot wise but the action kept to a good pace and you actually get to see the monster which lets face it is the money shot of any horror. The filming was good and the acting fine. <br><br>I'm a bit of a fan when it comes to monster movies and have felt bad recently posting rubbish reviews so I'm really glad this movie did what it promised and was an way watch.<br><br>Probably not going to make it to the Oscar list but definitely worth a watch if you're into Bigfoot killing college kids, which lets face it is a winning formula.","user":"rpaleschi","rank":[20,23]},{"title":"Not Bad, Not Great.","rating":5,"date":"24 October 2014","review":"I've seen several big foot movies. The best of them all was The Lost Coast Tapes. Exists is a good big foot movie, and unlike The Lost Coast Tapes, this actually shows the monster. That could be a good or a bad thing, depending on the costumes and special effects used. The Lost Coast Tapes did a great job while not showing the creature, and Exists does a good job showing it. There's not really much imagination needed when you think of what big foot looks like; tall, hairy, ape or man-like.<br><br>I gave this movie a 5-star rating. The acting was pretty good, as were the big foot costumes. When the camper is thrown down the hill, it looks like the people were really inside. <br><br>Some things annoyed me, such as in the cabin, there was a perfectly good cellar that the people didn't use until they had absolutely no choice. With a monster that is huge and powerful and looking to kill, I think they all would've moved down there immediately after finding the cellar. <br><br>Also, when going through the woods, trying to be undetected, Todd kept talking, and Dora wouldn't stop calling for Matt. Morons. One last complaint. I am so sick of the camcorder POV for these movies. Virtually the entire movie was through the camcorder. They could've done this movie just fine without doing that. Still, all-in-all, I was entertained watching it.","user":"chrismackey1972","rank":[28,36]},{"title":"The Bigfoot Project","rating":7,"date":"26 October 2014","review":"Eduardo Sanchez, the creator of The Blair Witch Project, once again reunites himself and his crew deep into the woods. Instead of being attacked by a ghostly witch we never get to see, we are introduced to bigfoot.<br><br>After seeing the trailer I was so wanting to see this movie, even though I already knew what to expect, the typical found footage movies. It's nothing short of cliché and repetition. However, this film did actually scare me a little bit and kept me on the edge of my seat.<br><br>As a found film footage it doesn't really bring anything new to the, except for a few things, which are pretty good. It's one that will keep you jumping, keep you entertained and definitely keep your heart racing in several scenes. I liked the several Blair Witch throwbacks that were sporadically throughout the film. It was a really cool way to give homage to the movie that made his career.<br><br>I have read mixed reviews on this, and as always I don't want people to take my word for it, experience it for yourself and see what you think about it.","user":"NotAnotherMovieCritic","rank":[27,35]}]