[{"title":"Pretty good if you expect a B movie","rating":7,"date":"15 February 2015","review":"This movie is really bad, I mean really, really bad. You can see the microphone on a character in one scene, you the budget for the special effects was an after thought, and the acting from a few minor characters is atrociously bad. There are a few scenes that don't fit into American culture, such as a girl committing suicide straight up Japanese Kamikaze style, and a doctor going wacko when he is otherwise sane and logical. <br><br>However, I watched this knowing it was going to be bad and it was enjoyable. Danny Glover delivers a convincing enough job, Masuka from Dexter as his sidekick makes me think some real science is going on. The story becomes rather silly and the action and suspense becomes more comical than scary, and then it becomes a rather enjoyable B movie, with a dialogue going on between me and my family watching it, guessing which ridiculous thing would happen next. <br><br>I think the producers knew this would happen to some extent, what with the toxin looking like a beehive pollen floating in midair, and the gas tank to a Tahoe being able to open with no breaking and entering tools. <br><br>Overall a solid cast, and if you're in the mood for a light and digestible film, watch this. It reminds me of something they would show on cable called \"Dinner and a movie\" in the late 90's, where they would show OK horror or thriller movies, along with commentary.","user":"misterphilipj","rank":[75,78]},{"title":"Fun Drama/Sci-Fi Hybrid suitable for all ages","rating":8,"date":"9 March 2015","review":"When I saw the poster for Toxin, I was expecting a B-horror movie with over the top gore and effects. This film stands out as solid entertainment and is more of a drama/sci-fi hybrid. The storyline with Dean and his grandmother is very endearing. Dean sets out to help his ageing, hoarding grandmother get her place cleaned up. She comes across at first as the typical crazy woman, but soon develops into a wonderful movie stealing performance. Fluctuating between lucid and disoriented she is able to overcome her hoarding with the help of Dean. There's a hint to a spiritual theme of living in the present moment that plays out nicely at the end of the film. A film needs to have a message. This one does and it seems the other reviewers missed it. Dean may seem like the unstoppable protagonist as critics have pointed out, yet he failed to save the most important thing in his life, his grandmother. The loss of her and how he copes with it ties into the loss of his friend during battle. The lesson Dean learns helps him cope with loss. The film ends with a powerful image of a Buddah that Dean leaves on his grandmother's headstone, which was a perfect visual image to seal their journey together. Interspersed throughout is an entertaining sci-fi take on pharmaceutical companies and the dangers they can be to society. If you are expecting actors to make good decisions in a horror movie, then don't see this one. If you don't mind actors making entertaining decisions, see this movie and have fun with it.","user":"michellefratis","rank":[28,37]},{"title":"Complete Rubbish! 1/10","rating":1,"date":"29 April 2016","review":"Review: What a complete load of rubbish! The acting was awful and as soon as the annoying teenagers came on screen, I completely lost interest. All I remember was this stupid virus that was killing everyone but apart from that, I haven't got a clue about the plot. Danny Glover, who was playing a doctor who was making the virus, has really gone downhill lately and Vinnie Jones plays the usual cockney hard man who is working for the baddies. My expectations for this film were pretty low from the get go, so I'm not surprised that it turned out to be so awful. I won't go on about the film anymore because it just not worth the time or effort. Rubbish!<br><br>Round-Up: This awful movie was written and directed by Jason Dudek, who brought you Open Mic in 2001 and Legacy in 2008. Its not really surprising that his movies are unheard of, because if there anything like this one, I doubt that they will ever get an audience. Maybe he should just stick to watching films except for making them? Same goes for Vinnie Jones!&nbsp;<br><br>I recommend this movie to people who are into their drama/sci-fi/horrors starring Taylor Handley, Danny Glover, Vinnie Jones, Margo Harshman, Beverley Mitchell and C.S. Lee. 1/10","user":"leonblackwood","rank":[5,6]}]