[{"title":"It's Still Alive!","rating":8,"date":"25 November 2015","review":"\"You know this story. The crackling lightning. The mad genius. An unholy creation.\"<br><br>And so opens up the lastest interpretation of Mary Shelley's legendary novel-turned-pop culture myth. So, what does this version add to the time-tested tale? Surprisingly, a fair amount.<br><br>An amalgamation of various film versions (taking most of its cues from Universal and Hammer), this film tells the origins of Victor Frankenstein through the eyes of a nameless hunchback who, after a quick and very nasty surgery, is dubbed Igor. It tells the story of how the world around Victor reacts to his experiments, from the conniving entrepeuneur to the over-zealous man of faith trying to stop him. <br><br>And how does it all hold up? Again, surprisingly really well. The chemistry between Daniel Radcliffe and James McAvoy sparks the film up quite a few notches while Andrew Scott, Jessica Brown Findlay and Freddie Fox all make good work of their admittedly under-developed supporting roles.<br><br>The direction by Paul McGuigan is energetic and lively, even if the pace is a tad too frenetic at times. The use of practical effects for the monstrosities that our heroes bring to life are impressive to behold and everything is boasted by a powerfully theatrical score by Craig Armstrong and some beautiful production design by Eve Stewart. <br><br>As I said, pacing is a tad too fast and certain bits of writing could've used some tweaking, but the cast and enthusiastic direction definitely make this a more than worthy entry into the Frankenstein mythos that I will gladly welcome into my collection as soon as it makes its to Blu-Ray/DVD.<br><br>I'm pleased to say that it is very much alive.","user":"gojiseb","rank":[95,134]},{"title":"Better than it has any right to be, this revisionist spin on the classic Mary Shelley creation finds its heart in the men behind the monster","rating":7,"date":"26 November 2015","review":"\"You know this story. A crack of lightning. A mad genius. An unholy creation,\" intones Daniel Radcliffe's Igor Strausman, who warns us at the start not to expect a literal re-telling of Mary Shelley's beloved horror classic. Instead, as imagined by writer Max Landis, this latest spin focuses on the relationship between the titular mad genius – played by James McAvoy – and his trusty associate Igor who becomes instrumental to his dream of re-animating the dead. Yes, though Victor first meets Igor as a nameless hunchback at the circus, the latter is in fact a gifted physician whose knowledge of the human anatomy makes him invaluable to Victor's plan of assembling various organs into an outer shell and introducing life into it.<br><br>But even before that, Victor recognises something special in the filthy clown with the rat's nest of a hair who rushes to the aid of a trapeze artist Lorelei (Jessica Brown Findlay) following a near- fatal fall during a show and manipulates her bones in order to save her life. So Victor decides to give the destitute sad-sack a new lease of life by first busting him out of the circus, where at his cavernous home cum laboratory, he proceeds to drain the fluid from the young man's massive abscess, fit him with a back brace, and give him the name of his absent flatmate Igor whom Victor says is a morphine addict who has not been seen for months. Igor is indebted to Victor, and so without much question, assists his 'saviour' in his experiment to bring life to a homunculus stitched from animal- part discards from the local zoo.<br><br>If you're waiting for the iconic hulking man-monster to appear, let us warn you that you'll have to wait until the very finale, which takes place on a very stormy evening in a remote Scottish castle right next to the sea. Indeed, this is less a movie about Victor actually creating his monster and what happens afterward than about the process leading up to that pivotal moment, which its director Paul McGuigan centres on a debate between theology and technology as well as an emotional complement in the bond between Victor and Igor. To introduce the former into the narrative, McGuigan interrupts the scientific proceedings with the entry of a moralistic Scotland Yard detective (Andrew Scott), whose past has not only made him a man of unwavering faith but also obsessed with stopping Victor's experiments he perceives as Satanic.<br><br>It is also this said inspector who causes Igor to question Victor's research, especially in the wake of Victor's Royal College of Medicine presentation of his first hodgepodge Prometheus which unsurprisingly does not end well. Not unsurprising too is how Victor is constructed as both the emotional and moral centre of the film – though he starts off subservient to Victor, Igor struggles with the ethical implications of using science to achieve immortality, which ultimately leaves him conflicted with the dilemma of sticking by the person who had rescued him from eternal ignominy or following his own conscience. Igor also finds his heart with Lorelei, who makes a somewhat amazing recovery to help Igor find his centre of being.<br><br>Though the romance is contrived, McAvoy and Radcliffe are actors with charm and gravitas, and they make good use of both qualities to keep us engaged in their bromance. McAvoy overdoes the mad-genius bit on more than one occasion, but is on the whole appropriately brash and obsessed to play the brilliant, extroverted yet socially bizarre Victor. At least Radcliffe complements his partner with a nicely understated performance, which expresses his character's anguished, good-hearted and conflicted nature at various points. Next to Victor, Igor is a much more straightforward persona, but Radcliffe does what he can to make us empathise with the latter's plight.<br><br>On his part, McGuigan keeps a tight balance between horror, drama, romance and even a few spots of comedy, while ensuring that the pace doesn't sag. No stranger to Victorian-era London from directing several episodes of 'Sherlock', he forgoes more handsome evocations for a more grimy and downbeat vision of 19th-century London that is more befitting of the grotesqueness of Victor's creations. Oh yes, despite the rating, you'd do well to note that some images are absolutely not for the squeamish, in particular because the film does not shy away from displaying the various organs of the body which Victor uses to assemble his unhuman work of science.<br><br>As an origin story, you could do much, much worse than 'Victor Frankenstein', which is loud and messy all right, but has a quieter, more grounded centre on its arguments of faith versus science as well as a compelling relationship between its two lead characters. That's provided of course that you're willing to accept a revisionist take in the first place, with Frankenstein played as a soulless hulk that is prone to violence but nothing more and relegated almost to an afterthought right at the end. Like we said, this isn't about the monster as we typically know it, but the journey leading up to its creation, one that is undeniably intriguing in itself.","user":"moviexclusive","rank":[63,95]},{"title":"Weird Movie","rating":5,"date":"16 July 2017","review":"\"Victor Frankenstein\" is a weird movie using Mary Shelley's notorious and famous character. There are many versions of this adaptation of the novel to the cinema, but this one rewrites the story in a totally different situation. The result is entertaining and intriguing in the beginning but becomes boring and annoying in the end. My vote is five.<br><br>Title (Brazil): \"Victor Frankenstein\"","user":"claudio_carvalho","rank":[22,30]}]