[{"title":"First rate","rating":9,"date":"12 November 2012","review":"It's hard to fault this movie. Literally. I was going to rate it as an 8, but I have to give it a 9 because I can't think of anything about it to criticise.<br><br>The plot is rather simple. Frank is a confused older man who is finding it difficult to take care of himself. He is given a robot medical assistant who is programmed to do only one thing: help Frank. Frank resists mightily at first, but soon Frank improves remarkably and takes up his earlier vocation: stealing jewels. It turns out that the robot's programming does not extend to obeying the law...<br><br>This film is interesting, surprising, heart-warming, intelligent, thought-provoking, amusing, understated, well written and well directed. It delivers first-rate performances by first-rate actors.<br><br>It defies categorisation. Is it science fiction? A heist movie? A family drama? A melancholic feel-good story about aging? It has no shootouts, no car chases, no superspies, no superheros, no martial arts scenes, no demented villains. What it does have is character development, good writing and a nice story.<br><br>Kudos to Schreier, Ford, Langella and Sarandon.","user":"Laakbaar","rank":[126,132]},{"title":"Funny and sad in equal measure","rating":8,"date":"16 November 2012","review":"It seems like once a year or so an Alzheimer's movie comes along and knocks me for a loop. I don't know what it is; I've never had any personal, real-life experience with the condition or its unfortunate sufferers, but there's ripe material for crafting warm and moving stories which invariably end with me in tears. In the last few years I have been devastated by films such as Away From Her and Barney's Version, and while Robot and Frank is certainly comparable, it's a lighter, less harrowing take on a tragic side of aging, and ultimately results in a much more enjoyable experience.<br><br>Frank Langella plays Frank, a divorced senior living a life of solitude in rural New York. Between visits and video calls from his children (James Marsden and Liv Tyler) concerned about his seemingly deteriorating mental state, Frank fills his time with visits to the local library to flirt with librarian Jennifer (Susan Sarandon), and by shoplifting decorative soaps from the store occupying the former site of his favourite restaurant. He is a man of the past, and his little moments of defiance in the face of change establish his character early, so when Hunter (Marsden) arrives with a new robot caregiver, Frank is understandably offended.<br><br>As much as Frank's memory regarding the day to day seems to be fading, his former 'profession' as a cat burglar remains at the front of his mind, and the robot's insistence on finding a project to keep him mentally engaged opens a window of opportunity for Frank to focus his mind and retreat back to the glory days of his youth. The planning and execution of heists sees a charming relationship forming between Frank and his robot companion, complemented by a sweet potential romance and stark moments of sadness.<br><br>There's a clever subtext running through Robot and Frank as well, commenting on the loss of personality in the digital age, and the disposable nature of modern life. The more we come to rely on technology for everything, from our reading material to our aged care, the less we ourselves are practically capable of, giving rise to a generation of privileged, ironic, but purposeless people ('yuppies' as Frank calls them). What Robot and Frank highlights is not just the fragility, but also the value of a mind filled with life experience and skills. There's no substitute for the complex intelligence of our brains, and even the most sophisticated technology has more to learn from us.<br><br>Robot and Frank feels like a film aimed at an older generation, but there is so much to enjoy for anyone who might be occasionally frustrated by our cynical modern world. There's a great balance of laughs, romance and sadness with a fun sci-fi twist, right down to the subtle Star Wars reference.<br><br>tinribs27.wordpress.com","user":"markdroulston","rank":[83,91]},{"title":"Robot and Frank...3.5 out of 4 Skittles","rating":9,"date":"6 September 2012","review":"Robot &amp; Frank opens nationally this week only at a limited number of select art-house theaters across the country, and most likely won't get the larger release it deserveswhich frankly is too bad. The film uniquely crosses across so many genre borders and can best be described as a dramedy meets a heist thriller. Robot &amp; Frank is incredibly charming, funny and moving.<br><br>Writer Christopher D. Ford pens his rare tale set sometime in the ambiguous near future. He doesn't worry about flying cars or futuristic fashion, and keeps this tale grounded in a plausible future that is easily believable. First time director Jake Schreier reveals a mature ability to find the perfect pacing that develops the characters with ease and exact timing that turns the comedy bits into gold.<br><br>Frank Langella (Frost/Nixon, Good Night, and Good Luck) is nothing short of exceptional as the title character of Frank. He is hilarious and poignant as the surly ex-con who is starting to lose his mind, and radiates a million emotions across his face without saying a word. If this film could possibly find a larger audience, Langella would have a good shot at punching his Oscar card again.<br><br>The smaller supporting cast plays in perfect to establish Frank's present and his past. Susan Sarandon (Thelma &amp; Louise, Dead Man Walking) radiates a beautiful sadness playing a lonely librarian and one of Frank's only connections to the real world. Liv Tyler (Lord of the Rings, Armageddon) and James Marsden (X-Men, 27 Dresses) are solid as Frank's grown-up kids who don't have the time to care for their father and his worsening condition. Best of all is Peter Sarsgaard (Jarhead, Garden State) who brings a perfect sense of comedy and real life validation as the voice of the robot. His dry wit steals the scene on numerous occasions.<br><br>Robot &amp; Frank is one of the best films of the year. It's a mystery why bigger studio distributors are so afraid to fully get behind a film like this and push it out the mass audience, especially when you think about the $80 million that was spent on advertising costs for a film like Battleship alone. Robot &amp; Frank is funny, exciting and touching. What else does a movie need?<br><br>For more quick reviews check out www.FilmStallion.com","user":"FilmStallion","rank":[121,137]}]