[{"title":"One of the most fascinating documentaries about visionary film making; funny, charming and a must for Sci-Fi fans","rating":10,"date":"27 May 2014","review":"If you love Sci-Fi films, you have to see this. Or no: If you love films you have to see this. Even better: If you love art in general, you absolutely have to see this. This documentary had me grinning at first and drop my jaw soon later; the grinning was induced by the witty, charming narration by Alejandro Jodorwsky himself (a natural born story teller, if there ever was one) – the jaw dropping came by way of hearing the most incredible anecdotes about how one person got some of the most famous and daring pioneers of their respective arts to participate in one single project: Jodorowsky's 'Dune'.<br><br>In 1975, Alejandro Jodorowsky got a group of \"warriors\" together to make the film version of Frank Herbert's 'Dune', and the way he did this (or the way he tells he did this) is so outright unbelievable and entertaining that it simply must be true (actually, there's an amazing story for another film right there). Can you imagine Salvador Dali, Orson Welles and Mick Jagger all starring in a Science-Fiction film scored by Pink Floyd? Watch this Documentary if you want to know how this - nearly - came about. Or did you know that Dan O'Bannon, Moebius, H.R. Giger and Chris Foss all made fantastic designs for a Science-Fiction film that was NOT 'Alien'? Watch this documentary If you like to know more.<br><br>Telling the story of arguably the most influential Sci-Fi film never made, this documentary is a pleasure to behold and essential viewing for Sci-Fi geeks, film fans and lovers of art alike. 10 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[77,86]},{"title":"Makes you imagine as if you had seen the film","rating":10,"date":"14 June 2015","review":"I love good documentaries and this is one of them but one thing to keep in mind about most of them is their need to steer and corral you into a point of view. The point of view of this one is that Jodorowsky's Dune wasn't made because of inflexibility and lack of vision by the Hollywood studio machine.<br><br>The film ended with me thinking that was an unfair judgment. Two key factors would kill this film even today: One was the demand by Jodorowsky that the film be 15 hours. Imagine if the original Star Wars trilogy was made all at once into a 6 hour film. We'd certainly enjoy it but would many 13 year olds who fell in love with the first film be able to handle sitting for 6 hours straight even with an intermission? Also, three movies made 3 times more money than one.<br><br>This film COULD have gotten made! If Jodorowsky started out from the Planet Caladan and ended on Arrakis just after the Baron had killed Duke Leto and Paul had escaped, for instance. The budget would have been reduced and even if Hollywood had rejected it, he could have filmed from a private investor (no doubt Salvador Dali and Orson Welles could have made some phone calls) In the end, ironically, the studio execs were right: Jodorowsky simply wasn't practical enough of a director to get the film cut. He was ingenious in negotiating and compromising with the biggest egos of all time including literally Orson Welles and Dali but couldn't figure out a way to make this project viable to a simple minded Hollywood exec? His genius could have manipulated such a simple mind if he had allowed himself to.<br><br>So it's thoughts like that which make this documentary into one of the best thoughtful experiences ever. Even if you disagree with my conclusion, the vision of what this film could have been, and why it wasn't, is as engaging as any of the three Star Wars \"prequel\" films. What I think the film could have been like is a 100 times better than what Lynch's Dune turned out to be.","user":"mark-4522","rank":[8,8]},{"title":"A documentary about a mad visionary","rating":7,"date":"24 July 2014","review":"This documentary chronicles the exceptional history of the 70s movie version of Frank Hebert's Dune by Alejandro Jodorwosky, a film that was never actually made. It gives you a short filmography of Jodorowsky and then leads you through his vision of the movie he was going to make. However, Jodorowsky's Dune would not have been a movie version of Frank Herbert's novel, but rather a re-imagination of the basics of the book in the mind of an avantgarde director who himself said that he wanted to make movies for people who wanted to experience LSD, but didn't want to take the actual drug, and Jodorowsky acknowledges the former fact with the words: \"I was raping Frank Herbert... but with love.\" People in this documentary keep saying that the film would have been ahead of its time. This may be true in some way. However, I am more confident in saying the following: It would have been one of the worst movies ever made. They show you Jodorowsky's finished costume designs and storyboards, and it looks intriguingly weird at best, and boastfully horrible at worst. The colors you will see are truly like an LSD trip. Some of Jodorowsky's crew went on to make Alien, and his costume design and color scheme (i.e. use all the colors there are) can be seen in Flash Gordon.<br><br>Jodorowsky says that when he saw David Lynch's 1984 version of Dune, he was glad because the movie was so much more terrible than what he would have produced, even though he felt sorry for Lynch. Yet I believe that there is no way on earth that Lynch's movie could ever be worse than Jodorowsky's vision. Jodorowsky's film would have been a bastardization of Herbert's work for the sake of an attempt to, for lack of better words, \"enlighten the world\" according to Jodorowsky's own understanding.<br><br>However, his casting choices were, admittedly, inspired: Mick Jagger as Feyd Rautha? Udo Kier as Piter De Vries? Hell yeah. His own son as Paul? Well, I don't know him, but Jodorowsky made him undergo rigorous physical training for 2 years before the movie was to go into production, and then it never did!<br><br>The best scene in \"Jodorowsky's Dune\" is when the Chilean-French director rants about Hollywood film making and how money controls everything. Amazingly honest and true.","user":"maxkaemmerer","rank":[18,21]}]