[{"title":"Love Luv","rating":8,"date":"20 April 2012","review":"I want start out by saying that one of the things that I love about going to film festivals is that there are no trailers and you are really not sure what to expect when viewing a film. When it came to Luv, I was looking forward to seeing it because there was a lot of \"star\" power contributions involved. It made me realize that there are actors that are out there doing it for the money and then there are actors who are truly craftsmen, who do it for the art of performing. I am in awe of director Sheldon Candis for assembling such a powerhouse cast including Danny Glover, Dennis Haysbert, Charles S. Dutton and Lonette McKee. The film illustrated the relationship between Woody (Michael Rainey Jr.) and his uncle Vincent (Common) and takes the audience through one day in their lives. The film does a formidable job in demonstrating that no matter what you do or how much you may want to change, the past always has a way of catching up with you. The last time that I saw Common acting in a film was when he played Scott McKnight opposite Queen Latifah in Just Wright. I have to say that over the course of time and in the many films that Common has been in, his acting skills are improving as he diversifies his roles. Also, I have to give him props because he got involved in this independent film, so he obviously loves acting (maybe more than singing). The director stated that these actors basically did the job for a buck and a turkey sandwich (smile). Michael Rainey Jr. was brilliant as the thirteen year old nephew enlisted in tagging along with his uncle through the realities of a hard life in an urban environment. The youngster quickly learns that sometimes you have to do unconventional things in order to make it through life and that relationships have a way of changing over time. Woody eventually changes from a shy, studious and reluctant kid into a self-assured, confident young adult. All the lessons that Woody learns are not pleasant ones, but are necessary for life in the streets of Baltimore (or anywhere else for that matter). I think that this film is definitely worth seeing and may even give some young adults a much needed reality check. I am giving this film a green light.","user":"cattjones","rank":[33,40]},{"title":"Chix Chat on Film Review: A training day in Baltimore","rating":8,"date":"20 April 2012","review":"The star power in this film immediately captured my attention. Scene upon scene brought a new recognizable well established actor on screen, which is so atypical when viewing Indie films. The film LUV is a fictionalized account of actual events that occurred in the writer director Sheldon Candis' life as he spent time with his uncle. I was fortunate in that the viewing of this film was a film festival DIFF 2012 at which Mr. Candis was in attendance and could provide some insight into how the story evolved, and his adventures in casting. I was very impressed with the screen presence of Woody (Michael Rainey Jr.), who coincidentally was similar enough in appearance that he could have been a child Sheldon. Ninety-five percent of the story takes place in the span of one 'training day', where Woody accompanies his Uncle Vincent (Common) as he conducts a day of business. The first thing that struck me as odd was the upscale automobile that Vincent was driving, and I immediately took some leaps and bounds to conclusions, oh and I jumped too. My assumptions turned out to be correct as the day progresses it evident that the lessons that are imparted onto young Woody will inevitably lead to a loss of innocence. The story was relatable because although the setting is Baltimore which I have never visited, the harsh reality of a relative passing down their knowledge is not always a legitimate vocation or trade. I was not surprised at how quickly Woody caught on to what was happening with Vincent's encounters, in some cases his realization was slightly out of sync with mine. My hoping that no harm would come to young Woody kept the level of intensity in this film high, because I knew how easily situation after situation could have gone wrong. I was completely emotionally invested in this film from the moment that Woody and Vincent began their day together. As more and more of Vincent's past became apparent so did the fact that Woody should be nowhere in the vicinity of this guy. There could have been a bit more character development for the roles played by Charles Dutton (Cofield), Danny Glover(Arthur), and Dennis Haysbert(Fish) and the ladies in the film Lonette McGee (Grandma Beanie)and Meagan Goode were little more than just fleeting images, but this was a good film none the less. I am in love with LUV and give it a green light.","user":"EmmaDinkins","rank":[23,30]},{"title":"Take an emotional journey to find yourself in LUV","rating":7,"date":"2 January 2013","review":"There are some movies that come along and offer way more than they let on. At the same time it becomes a bit of a concern when a film with a great cast gets a smaller release because there are varying reasons on why. The latest film to be something more than it lets on is Luv that features a great cast including Common, Michael Rainey Jr, Dennis Haysbert, Danny Glover, Charles S. Dutton, Michael Kenneth Williams and Meagan Good. Could this be a package to deliver a film fans will in fact love or will it be obvious why it got a limited release? <br><br>Luv follows a young boy who spends the day with his recently paroled uncle who is trying to right his life, but along the way hits some violent unexpected snags. Now the young boy must follow in his uncle's footsteps of learn to be his own man. On the surface this film seemed like it was going to be just another forgettable drama with little to offer, but as it progressed it became so much more. While it could be viewed as just another drama about the seedy underworld, it is really about two people and their struggle to change their lives while finding their way alone, all while having each other. This film takes place over one day and delivers a really powerful message for both sides of the spectrum. One you have this young boy trying to grow to become a man, but are torn between the problems in his life and wanting to learn the things his uncle has to teach him. Then you have the uncle who is legitimately trying to clean up his act and teach his nephew how to be a man, but is pulled back into his old life as his past catches up to him. This cast is great and it is amazing to see this many great actors in an independent film. They all really poured themselves into their roles to bring these characters to life. Common has really grown as an actor and carries this movie like a pro. The rest of the cast mesh together nicely to deliver this powerful story.<br><br>There are some moments here that make you wonder why this kid is being dragged into all these situations, but as everything unfolds you realize it is part of what makes him grow as a man, whether they are good or bad. This was one of those movies that really delivered a surprising finished product to something that didn't offer a huge appeal other than the cast. It's these kinds of movies that remind you how to love film. It's not one of the best around, but there is passion and depth to this film filled with a cast that clearly did this for the love of the project and it shows in the finished product.","user":"rgblakey","rank":[13,16]}]