[{"title":"Decent sub thriller","rating":7,"date":"14 July 2013","review":"I've read the reviews of others and I was surprised to see such a strong polarizing. People either loved or completely hated the film. I am no expert in Russian Navy protocol, subs or war in general, so that is probably why I liked it. I didn't like it too much, though; even if it has a stellar cast, it is rather average and that is how I will rate it. However I see it as a decent sub movie.<br><br>To summarize a few reviews, people hated the American actors that pretended to be Russians without Russian accents. That is so ridiculous that I will not even deign it with an analysis. If you can't like a story unless sugar spooned to you, then it's your problem. Then there were people that reported erroneous depictions of Russian life, beliefs and reality in the 60's. I can't argue with that, but then again, the slip-ups were minor and one can easily ignore them if having good intentions. The rest of the film was pretty much a combination of Red October and The Abyss (how come nobody noticed that? :) ) which were both movies I liked.<br><br>Bottom line: I considered this film a reasonable achievement, even before I learned it was an independent film with only 18$mil as a budget. I personally liked it and can't account for many negative issues with the movie. Is it awesome? No. But I had fun watching it and was not bored at all.","user":"siderite","rank":[52,60]},{"title":"No, it's not \"Das Boot.\"","rating":6,"date":"21 April 2014","review":"Much is made of perceived weaknesses in \"Phantom,\" most notably the absence of Russian accents. This doesn't bother me, certainly no more than watching anything by the BBC in which everyone, regardless of character nationality, has an accent found somewhere in the British Isles. I'm not familiar with the minutiae of Soviet era submariners, so I can't suitably critique the proper etiquette or uniform details. Looked accurate enough for me to accept it. If you're willing to look past that, you'll be able to enjoy a competent, if slightly derivative, submarine flick. Frankly, it's worth watching for the performances of Ed Harris (the sub captain) and William Fichtner (Harris's second in command) alone. They carry the movie, and, in my case at least, kept me watching through to the end. David Duchovny, as the rogue KGB agent is a little harder to accept, but I suspect that has less to do with his performance than my own inability to not think, \"What the hell, Mulder?\" every time I see him. The supporting characters do their best with what they have, and honestly, I admire anyone who can work in even a mock submarine's space. Ultimately, this movie is about sacrifice, whether on the part of the family separated by military service, or the things one is willing to do for the sake of one's nation. If you've actually read this far into the reviews, or even this far into this one review, I think you'll be engaged enough that it won't be a waste of your time to watch \"Phantom,\" especially if you can see it via whatever instant service you use. Like it says above, it's not \"Das Boot,\" but really, what else is?","user":"lewaynelwhite","rank":[11,11]},{"title":"Well Worth the price of a Ticket","rating":8,"date":"3 March 2013","review":"First off, I am not a fan of Independent movies and find most boring or to artsy. I heard about Phantom for the first time when I watched a late night TV talk show. My interest was peaked so I went to see it an the local theater that shows this Independent movies. From the opening scene, I was hooked. My only issue was that unless you had seen other movies of this type, with the cast speaking English right from the beginning, you did not know that this was supposed to be Russian. But if you listened you could hear that they were talking about Russian locations, but the people that went with me had to ask me about 15 minutes into it if this was supposed to be Russian Navy. This movie hooks you and draws you into the life aboard a WW2 Era sub. Having actually been on this old sub as it sat in mothballs, I can tell you that there is no room for camera gear and how they filmed the inside with crew boggles me. Duchovny and Harris were spectacular in this movie and made the movie believable. The story line was very interesting and I was sad to see the movie end, but being based on a true story really peaked my interest and now I need more information. Please go see this movie, support this filmmaker, I am not associated with any of the movie or players, but for a Non Independent film watcher to love an Independent movie is really saying something.","user":"Ranbud","rank":[114,152]}]