[{"title":"Aims for complexity but is unnecessarily confusing – end result isn't \"oh wow\" but \"oh for f's sake\"","rating":20,"date":"20 November 2013","review":"I was quite looking forward to Trance; I had heard a critic say that it was a real effort by Danny Boyle to get out from under the \"national treasure\" status he had obtained by how well he opened the Olympics in 2012 and that as a result Trance was very much against that image. He was correct because this is a very graphic film in many ways but before that we get to the plot. The plot is simple – an art robbery goes wrong for some reason, with the painting lost when the inside man hides it but forgets where he hid it due to damage inflicted during the robbery. The gang go to a hypnotherapist to try to get it out of him and from here it only gets messy.<br><br>I can see what the plot was trying to do because it is constantly twisting and turning as minds are messed with; actions may or may not be programmed; events may or may not be happening and those who appear in control may or may not actually be in control and, even if they are (or aren't), they soon won't be (or will be) because everything will change in a minute. I guess the aim is that the film was aiming for a narrative similar to that of Inception or Usual Suspects, where the story the audience is being told may not be the real story at all. At the end of both these films the effect is to be impressed by how well it did it and I'm sure for many like myself there was the desire to watch it again to be able to see the film in the new context you have. With Trance I did not have this feeling, when things did fall into place I only felt that it was such a messy pile that it had fallen into and I had not enjoyed or been engaged in the manner in which it got there or indeed where it got me at all. You can sense it wants to be smarter and more thrilling that it is, but where Usual Suspects is slick and stylish on its journey, this really just bumbles and blasts it way to the finish hoping it can carry you with it by force alone.<br><br>This force comes in the style of Boyle's direction and mostly it is good from this point of view – it is a good looking film but it does really feel like he is forcing the excess for the sake of it rather than it being part of the film. So the very extreme scenes of gore felt like the complexity of the story – there for the sake of being there. Of course this is not to say that I didn't appreciate the extreme (almost \"no holds barred\") nudity from Rosario Dawson, but again even for the teenage boy in my head, it felt forced and unnatural (the use of her nude – not her as a nude). The cast go along with it the best they can. McAvoy is good while Cassel always has a mean presence. Support cast is decent but I am really not sure about Dawson. It is not that she herself is not good, it is just that the film asks too much of her character and it is clear that Dawson doesn't always know who she is be – in any one scene she can be what is required, but in terms of making it one whole character or making links between these scenes, she cannot do it. I do not think the fault is all her – I guess the relationship with Boyle didn't help with this aspect, but for sure her performance seems unsure and a bit erratic.<br><br>Trance will try to bluster and bully you into thinking you're watching something really smart and well structured, but this is not the case. The film is confusing for the sake of it, excessive for the sake of it and ultimately tries to ride this to a satisfying conclusion but in the end you will not be left with feeling that you immediately want to see it again but rather the lingering doubt as to whether you should have bothered in the first place.","user":"bob the moo","rank":[88,111]},{"title":"Danny Boyle continues on his campaign to never repeat genres - Trance falls just short of greatness","rating":8,"date":"11 April 2013","review":"Danny Boyle continues on his campaign to never repeat genres by giving us a stunning psychological thriller that crosses so many boundaries I'm not sure I'm entirely comfortable even using the word thriller - the only thing for certain is that it is definitely psychological. Borrowing elements of film noir this exhilarating ride is just short of greatness. Just as you could imagine from the title; Trance is a visual, aural and intellectual dream-like experience. <br><br>Trance stars James McAvoy as Simon, an auctioneer who gets mixed up with the wrong group of thieves. Simon's auction house is selling a painting £27 million (Roughly $41 million) when a thief by the name of Franck (Vincent Cassel) breaks in and attempts to steal it. Before Franck can do so he and his crew notice the painting has gone missing and Simon is the only person that knows where it is. Unfortunately for Franck, Simon suffers a serious blow to the head during all the chaos and cannot remember where it is. After trying to divulge the location from him proves unsuccessful they turn to a hypnotist (Rosario Dawson) who can unbury any memory and that's where the audience joins in this psychological trip to find the painting. This film will leave you as hypnotized as any member of the cast was I assure you.<br><br>Dawson and McAvoy deliver excellent performances; they handle their roles with such control that every little subtle facial movement reveals more than it should, especially within Dawson's character. Vincent Cassel alongside them brings the story to full force and together with Danny Boyle they all bring Joe Aherne's gracefully twitchy screenplay to life.<br><br>Boyle interestingly enough stuck to his 18A rating not willing to dilute his story so he could hit a broader audience; the man isn't afraid to have graphic imagery in his film like other directors who have attempted the genre in a similar way (i.e. Chris Nolan, Inception). The cinematography is - as always with Boyle – beautiful and in fact rather charming in its own sense. He handles the camera with such precision it's impossible to question his cinematic choices. The coolest aspect of the film being his declaration of war on the senses with a chaotic soundtrack and fast paced editing.<br><br>The film however is not without flaws. The film so heavily relies on tricking the audience that it's actually very easy to get lost and unfortunately lose interest in the film. While I didn't particularly feel this way I can see why others would have. While I've always been fascinated by the idea of an unreliable narrator to tell your story, when you're switching between three perspectives trying to decide which one is reliable it can sometimes take too much focus away from your plot. <br><br>Besides that Trance is an intellectual delight with enough twists and turns to keep the majority of people interested. Its performances, style and tremendous attention to detail is enough make a very balanced film. If you love movies similar to Memento this is definitely something to check out.<br><br>7.5/10<br><br>Be sure to check out my review site: thejoshlreviews.com, and my video review of this film here http://youtu.be/xpCWBi5N6ew","user":"thejoshl","rank":[119,162]},{"title":"A disappointing example of technique in search of effect","rating":5,"date":"14 April 2013","review":"Trance is an extremely convoluted film by director Danny Boyle, not necessarily because of the narrative structure but how the film is stylistically pronounced. There are audio-visual red herrings used to mask over the absurdity of a plot that switches from a heist movie to an internal psychodrama. However, once you overcome the deliberate sensory overload, the story and characters don't make enough sense to hold any emotional investment. Despite Boyle's experience and imprint as a deeply stylised filmmaker, Trance is a disappointing example of technique in search of effect. <br><br>The film starts off with humour and an energetic heist, but the story and the character motivations are extremely convoluted, buried deep beneath the (electronic) sound and fury. Simon (James McAvoy) is an auctioneer (or is he?) who describes the changing methods of stealing art over the years. It turns out that he is actually part of a job himself and in the chaos of a raid on an auction he snatches a Goya painting. As he escapes, he is hit over the head by crime figure Franck (Vincent Cassel). <br><br>Due to the blow on his noggin, Simon can't remember where he hid the painting. Franck tortures him for the location but this fails. Simon is then instructed to see Elizabeth (Rosario Dawson), a hypnotist who Franck and his men believe will be able to work his mind and reveal where the painting is. Simon must lie to Elizabeth about what he is actually trying to find. <br><br>Aside from the heist, there's very little here that's believable or clear. There's an early scene for example, where the thugs wire up Simon with a microphone and listen in on the sessions from their car, which doesn't ring true. One of the major problems with the film's plotting is that there is little time establishing who the characters are. The screenplay by Joe Ahearne and John Hodge is hesitant to revealing the inner life of the main players only so that they can withhold a huge plot twist at the end. It's not a gamble that pays off because the 'gotcha' moment feels more like a conventional thriller twist rather than a psychological insight into Simon's character. <br><br>Failing to establish the characters properly weakens their credibility and motives and makes them seem more like plot devices existing in a vacuum instead of real people. You will be wondering why Elizabeth strives so persistently to help Simon and when those answers are revealed late in the film they're improbable and unsatisfying. The narrative twist will remind you a lot of Inception, which Trance draws heavily from in the way it plays with memories, but it is without the same clarity or the emotional investment, failing to earn its story turns from the start.<br><br>Realising the generic hide and reveal structure of the narrative, Danny Boyle has employed an aesthetic resembling a music video to disorientate the viewers. I was impressed with the bravery of his formal choices in 127 Hours (2010) but it's like he's forgotten how to be calculating as a filmmaker. The stylistic choices he makes either lack purpose or overstate the theme. Camera angles are frequently tilted sideways and a neon lit colour scheme is employed to remind us tiredly of Simon's confusion. The blaring electronic soundtrack also raged so loudly and needlessly that I stuck my fingers in my ears at one point. <br><br>If these superficial techniques weren't distracting enough, the film also tries its hand at melding the real and the fantastic together in overlapping scenes, so that we're not sure if we're in a dream or not. The film becomes very messy, super violent, and not much fun. I found it so confusing that it took me out of the story and I didn't care one iota about the characters. If there is a point to their story, the film is about the way that people try to suppress trauma and personal responsibility in their minds. Yet for a movie striving to be psychological, it is the personal and human weight that is notably missing.","user":"Likes_Ninjas90","rank":[39,53]}]