[{"title":"Best Ozon in years!","rating":9,"date":"12 October 2012","review":"Often funny, sometimes disturbing and sensual, the movie can be enjoyed at face value, but the heart of the movie lies underneath that appealing veneer, it's about creation and the required necessity to live your life fully to feed it. The budding writer enters the lives of a family, the same way a writer should embrace life itself, with a healthy dose of curiosity and nerve, precisely what his teacher is lacking. Add to that a fascinating and intricate observation of the blurring of lines separating reality from fiction in the feverish midst of artistic creation. Deep stuff, but all wrapped up in a neat bundle, Ozon making sure to leave almost no one on the side of the road, so to speak. So in conclusion it's smart and yet playful, intellectual but never pretentious. Well, in other words, it's a very good movie about potentially boring subjects. Highly recommended in those times of idiocracy!","user":"doomgen_29","rank":[83,96]},{"title":"Fact or fiction?","rating":9,"date":"20 February 2013","review":"Francois Ozon's delightful, delicious new comedy \"In the House\" is a wonderfully clever and very funny treatise on the written word delivered in very cinematic terms, on the thin line between fact and fiction, truth and lies and the individual's need for attention.<br><br>The central characters are two misplaced males destined, perhaps, to be together and who find each other almost by accident. Germain is a middle-aged (and bitterly cynical) schoolteacher, (a terrific Fabrice Luchini), who one day finds that an essay handed in by handsome young loner student Claude, (Ernst Umhauer, excellent), has all the promise of a blossoming literary talent simply because it deals, in a well-written way, of course, in 'truths', (it describes Claude's infatuation with a fellow student and his family and what might go on 'dans la maison' in which they live), and the essay ends 'to be continued'.<br><br>He shows the essay to his wife, (a lovely performance from Kristin Scott Thomas), and, on the one hand, egged on by her and, on the other, despite her misgivings he takes Claude under his wing, so to speak, encouraging him to produce more 'to be continued' episodes on what goes on behind the walls of his friend's family home. As someone says, it can only end badly.<br><br>The brilliance of Ozon's conceit is that what we see and what we hear aren't always the same. Sometimes if Germain thinks 'a factual' description of events is not worthy of his talents, Claude will change it in the next scene and as Claude's 'literary career' progresses some of the things he writes has no basis in fact whatsoever so that we, too, are left wondering what's real and what isn't.<br><br>It is, of course, a hugely sophisticated comedy where a subplot involving Germain's wife's preoccupation with the art gallery she runs is used to counter-balance Germain's increasing preoccupation with Claude, a preoccupation his wife thinks may even have a sexual basis. Without giving anything away, the film itself ends with the words 'to be continued'; if only ...","user":"MOscarbradley","rank":[38,45]},{"title":"a perfect balance between suspense and entertainment","rating":8,"date":"7 May 2013","review":"There are certainly many meanings underneath the veil of comedy of this movie. Indeed, defining \"Dans la maison\" a comedy would be reductive, in the same way as thriller sounds out of tune. And it's really difficult to assign a precise category to it. It's a multifaceted movie, showing different levels of interpretation. From the point of view of the teacher, it's a subtle reflection of a middle aged failed man, who has to come to terms with his failure as a writer, and his incapability to inspire enthusiasm in class of bored students. From the point of view of the wives, it's a refined portrait of middle aged unsatisfied women, and their need to find any kind of escape or consolation. But above all, the movie offers a lucid and intelligent gaze on people's voyeuristic curiosity, on how much we are ready to do in order to see what happens behind closed doors and walls, and here the pair teacher-student works perfectly, and develops through the quick-paced writing of a story where the boundaries between reality and fiction become more and more faded, thus making it intriguing and engrossing. On this aspect, the movie is also a reflection on the process itself of artistic creation, which can seduce the reader or the viewer with an incredible power of attraction. A movie which certainly offers a perfect balance between suspense and entertainment, supported by a talented young and mature cast, involving the viewer till the utmost, and moving us to an unpredictable and gripping finale.","user":"yris2002","rank":[35,42]}]