[{"title":"German Comedy that's actually funny (yes, there IS such a thing!)","rating":9,"date":"25 November 2012","review":"FRAKTUS is a Mockumentary about the Reunion of an 80's Elektro-Pop-Band that resembles KRAFTWERK quite a bit. One could call it a German version of \"this is Spinal Tap\". Sounds dull? No, really, you should give it a chance -- This is one of the frustratingly rare gems of German comedy! <br><br>Only two other German feature film comedies (that I know of) come to mind which worked as fine as this one: Loriot's \"Papa ante Portas\" and Helge Schneider's \"Texas\". FRAKTUS could be located right in the middle between those two very different films, because the former is a work of almost mathematically crafted comedy and the latter a spontaneous collage of improvised scenes. FRAKTUS is a mixture of those approaches, and miraculously it all blends together in the most hilarious way.<br><br>The Movie was written and the Band Members are played by a German Trio of Radio-Comedians/Novelists/Actors/Singer-Songwriters and what not called \"Studio Braun\". Those Guys are mostly just called Comedians, but in Germany that comes close to an insult. One could better describe them as all-round-Artists of the Unexpected and the Psychedelic. They don't seem to care about making an audience laugh, they even dare to be hated (and by many they are!). So everything they've done so far is quite the opposite of mainstream comedy.<br><br>I don't know how the movie works with subtitles, but also for a non-German audience there should be much to enjoy. The Soundtrack itself is a work of genius. It's crafted so well that it singlehandedly tells the story of a band's journey from experimental music to pure remix- crap. The huge amount of mock artwork, album covers, Tour Posters, Photos etc. featured throughout the film also deserve credit for being a spot-on emulation of the early 80's underground style. But the biggest achievement of the movie is the portrayal of the three main characters, which seems to happen casually but is all the more effective. Needless to say they're all not very likable. They can't stand each other but try to overcome that for what they think is the greater good. And that maybe is the most German thing about the movie.<br><br>To sum it up: FRAKTUS is one of those movies I will frequently re-watch for the rest of my life! I strongly advise you to go see it!<br><br>9/10","user":"queasy-1","rank":[24,26]},{"title":"If you can do not read anything about this \"movie/documentary\"","rating":8,"date":"16 July 2013","review":"I mean it! I just went into the Berlin International festival without knowing one thing about this and I was more than positively surprised by the result/movie. Let's just say that it is a comedy and it works on many levels, even if I wasn't sure for a long time. It is actually Germanys answer to another international movie that is considered a classic, which I won't name, because that it would be obvious what we have on our hands here.<br><br>The people involved in this gave their all and while not everything works as neat as they might have thought, this still is really well executed and made my day. If you like to have a few laughs and be somewhat entertained, this could be your movie. And if you know German show business there might be something extra in it for you","user":"kosmasp","rank":[7,7]},{"title":"Pretty creative idea that is not always working out in execution","rating":6,"date":"13 March 2017","review":"\"Fraktus - Das letzte Kapitel der Musikgeschichte\" or \"Ute, Tasche, Vogel\" or just \"Fraktus\" is a German movie from 2012, so it has its 5th anniversary this year. The director here is Lars Jessen and he is also one of the writers. This is probably his most known work, even if you must say that a whole lot of other writers and directors apparently worked on this one according to IMDb. This is a fake documentary along the lines of \"Stromberg\", only that it is about the apparently quarreling band members of a fictitious band that was very successful back in the day. And now they may be up for a huge comeback. Or for a huge failure? Anything can happen. And this is one of the biggest strengths of the film. Honestly, there have been so so many German comedies (usually with lots of drama and romance too) from the last decade that were so entirely predictable and this one here makes for a nice change to that regard. I think the entire concept is pretty interesting. It's also nice they got so many familiar faces (i.e. people from the music industry) to play themselves in here, even if admittedly they all basically say the same and are interchangeable. But honestly, if this was really a documentary, then they would be as well. So it's all good.<br><br>Another smart decision here is probably that they cast people for the band members who are not really known here in Germany, at least no big name actors. It clearly was the makers' attention to let the audience feel that this documentary is as real as it could be. If you don't know that it's all fake, you would actually believe on more than just a few occasions that this was an actual documentary. Could it all be true? Oh well, if you know a bit about German films, you probably recognize Devid Striesow, the most (only?) familiar face that isn't playing himself in here. But it's not a negative deal-breaker for any reason as he also plays his part well. Yes the film does go over the top at times, also in the band members looks to be honest that did not really fit the music style you find them I must say. Or that scene with the news report about an apparent lunatic running amok and so on. It's far from a perfect movie, but the idea is so good that it's not too difficult to look past the flaws it has. It drags on some occasions too admittedly and would have been better at 80 minutes perhaps. Actually it runs for 95, but this includes roughly 10 minutes of credits already. In terms of awards attention, it \"only\" got in once with the German Film Awards, but that's not too bad either I guess. It's definitely one of the better German films from 2012 and certainly worth checking out, even if the concept here had a lot more to offer than they finally delivered. I may be a bit biased as electronic music never has been a great thing to me, but it's still easy to enjoy the movie, even if you prefer rock, pop, country music or whatever. So all in all, I give it a thumbs-up. Nothing too outstanding, but a pretty solid achievement. Just not on the same level as Stromberg for example.","user":"Horst_In_Translation","rank":[0,1]}]