[{"title":"Just another misguided vanity project...","rating":3,"date":"24 October 2014","review":"...from people who likely don't know any better, and even more likely don't care one way or the other, \"Dear God No!\" can't help but live up to its name in any discerning viewer's mind. Ostensibly an homage to 70s grindhouse features, this bit of pitiable excess fails to show any genuine respect for the genre or for filmmaking in general. Wooden non- actors swell the cast while reciting lines that might impress middle- schoolers with IQs in the room temperature range. The camera-work is---to be kind---in focus (well, usually), and the rest of the production values aren't much better. Costuming (and the lack thereof for most of the females) is probably the film's only strong point.<br><br>Needless to say, the script is abysmal, direction is non-existent, and did I already mention that the actors can't express themselves out of a paper bag? The corpse of Ted Sturgeon is shaking its head in despair. This one's a time-waster only, kiddies; not even the rampant nudity can recommend it. You've been warned.","user":"MrGKB","rank":[8,9]},{"title":"Don't be fooled by the great cover","rating":3,"date":"14 April 2013","review":"Well what can I say about this one. Being a huge fan of 70's and 80's slasher, exploitation and grind-house cinema I was quite excited when I saw the cover of this DVD at my local DVD store and had to buy it.<br><br>I went home that night with high hopes expecting something along the lines of Fathers day or Hobo with a shotgun - was I disappointed or what! While this film had a few slightly funny moments, especially a scene at the end where I had to laugh out loud, I cant say that there was too much else that I enjoyed about this film.<br><br>While I appreciate the shoestring budget that they probably had when making this film and I know that I could not do any better, I still found the acting far too cheesy. I know they were trying to get the feel of old exploitation films, however the acting just came across as a high school film studies class project.<br><br>This film could have had a lot of potential, however the cheesy acting, the effects and the over use of nude scenes for no reason let it down.<br><br>If you take out the nude scenes from this movie ( that added nothing to the plot or film) the film would only be 75% as long. Having a topless stripper dance on screen is great, however to have one dancing in a movie for 5 minutes straight was 4 minutes too long and seemed to me as a way to make the movie more appealing to someone who thinks that boobs in a film make a great film.<br><br>I know the things that I did not like about this film are exactly what fans of this type of cinema including myself normally like and are after in a film, however it just did not work for me.<br><br>I'll at least give it one thing, I watched it to the end, which is more than I can say for a few troma films that I have bought in the past.","user":"MaxJenky","rank":[15,20]},{"title":"I blame Tarantino.","rating":5,"date":"13 April 2013","review":"It was fun for a while, but now I'm getting rather tired of the fad for 'grindhouse' movies, which see directors deliberately striving to replicate the flagrant content and gritty style of 70s and 80s exploitation films. They may boast memorable titles and cool retro poster art, but they rarely prove to be any cop, their grungy affectations and knowing outrageousness being poor substitutes for real talent.<br><br>The latest effort to proudly fly the 'grindhouse' flag is 'Dear God No!', a violent biker flick from writer/director James Bickert, who is so intent on achieving his desired aesthetic and meeting his quota of bad taste and debauchery (thereby ensuring marketability) that he seems to forget about trying to make a decent film.<br><br>The most disagreeable aspects of the film are not the sex and violence—after all, those who willingly watch this type of film expect, nay DEMAND such excess—but rather the acting, script and direction. Performances range from the bad to the diabolical, the plot is all over the place, and Bickert's visuals display little in the way of originality (unless lingering on a stripper for so long that it actually becomes boring counts).<br><br>My rating: a generous 4.5 out of 10 just for the OTT splatter and rampant sleaze—file somewhere between equally disappointing 'grindhouse' efforts 'Run! Bitch Run! and Nude Nuns With Big Guns.","user":"BA_Harrison","rank":[10,13]}]