[{"title":"Visually stunning, but without substance","rating":6,"date":"18 June 2016","review":"In a way, this film is a perfect example of form following function. What better way to show how empty and perverse the model scene in Los Angeles is, than to make an empty and perverse movie about it? If Nicolas Winding Refn wanted to make this point, he has made it loud and clear.<br><br>But the question is: did he really want to make this point? Or did he just want to take his cinematographic capabilities one step further, by taking the visual aesthetics to the limit, without bothering about the rest? 'The Neon Demon' is visually stunning, but lacks substance. The story about a 16 year old model being literally devoured by the fashion industry, is nothing more than a vehicle for the visual exuberance of the film. It is like a 'Vogue' magazine: there are many pages, but they are all filled with glamorous pictures, and very little text. You can browse through it, but it doesn't have a message, other than an endless display of beauty.<br><br>To accentuate the perversion of it all, Winding Refn had added some horror elements, which almost seem ridiculous, especially at the end of the film. There's also an irritating and very prominent soundtrack. The acting is mostly unnatural and pretentious. But if you like browsing the latest edition of Vogue magazine, perhaps this is the film for you.","user":"rubenm","rank":[302,426]},{"title":"Utter drivel and, what's worse, boring drivel.","rating":2,"date":"5 August 2016","review":"This film starts promisingly with an eye-catching and unsettling image: then the first dialogue (or should I say \"direlogue\"?) scene starts, and two things happen. One, the dialogue is awful. Two, the instruction in Acting 101 \"Make the most of your pauses\" has been translated here into \"Leave 5 seconds silence before replying to anything which has been said.\" The self-consciously clever-dick direction, at its worst, leads to an interminable sequence which is supposed to represent a catwalk show in which nothing happens (and it doesn't happen repetitively, too) for what seems to be half a day. Refn thinks he is being clever in his direction: he isn't.<br><br>The first 80% of the story is trite and obvious: the final sequence is ludicrous. Refn again. Perhaps it's supposed to be a metaphor or some sort of metaphysical commentary. It's still ludicrous.<br><br>Lesbian necrophilia and cannibalism? I was too busy being bemused (when I wasn't being bored) to be outraged.<br><br>If I had been even slightly engaged, I would have been left with a bagful of unanswered questions afterwards. As it was, I didn't care enough to be bothered, although I will chuck one out, just for fun - what was the point of the mountain lion in the motel room? What did that add to the narrative? As expected, the Refn Fan Club is full of the usual \"If You Didn't Understand This Parable Of Modern Existentialism It's Because You're Too Thick\" nonsense, to which I reply Emperor's New Clothes.<br><br>If you don't see just one film this year, please make it this one.<br><br>It's a stinker. And a boring, tedious stinker at that.","user":"neil-476","rank":[284,410]},{"title":"One of the strangest movies I've ever seen - and I'm okay with that!","rating":7,"date":"28 March 2018","review":"Going into this film, I didn't truly know what to expect. All I knew was that the promotional images really captured my attention, due to the pretty colors, with up-and-coming actress, Elle Fanning in the center. A \"nymphet\" Tumblr blog I follow also re-blogged images from this. It's some kind of horror (I read the sex/nudity descriptions in the parental guidance section here prior to viewing) that has very mixed reviews.<br><br>Much of the the first two acts is relatively slow and realistic. It's got great visuals, despite two scenes with annoying flashing lights. The trip-hop soundtrack by Cliff Martinez is also ear-catching. But, boy, was I not expecting such a final act! Thinking back on it, there's a decent amount of foreshadowing leading up to it. As the track titled, \"Are We Having a Party\" played over, my eyes were widened as I realized what had happened to Jesse (Fanning). In spite of its disturbing aspects (notably, a scene involving necrophilia), I ended up really liking The Neon Demon. I appreciate how it chose to make audiences uncomfortable rather than the usual \"lesbianism is hot~\" excuse (ie Birdman). There are critics who hate and/or have called this misogynistic, and I can completely understand why; but that doesn't wane my enjoyment of it. <br><br>On the official movie discussion on Reddit, users have called this \"David Lynch meets Black Swan,\" which I also happen to agree with.<br><br>It was great to see Abbey Kershaw on-screen again after her debut in Mad Max: Fury Road - also kind of funny her playing an aspiring model, considering she already works as one in real-life; can't wait to see what else she and Fanning have to offer in future projects!<br><br>Learning that the director, Nicholas Refn, was born colorblind is very surprising, since his movies are so awashed with vivid colors. I'm planning on watching Only God Forgives and Drive next (the latter generally being considered his best work).","user":"Dominik528","rank":[9,10]}]