[{"title":"Better than the rating suggest","rating":7,"date":"13 October 2012","review":"This movie was far better than I expected. A easy thriller to get into, with a lot of action and intriguing twists and turns. The lighting and cinematography was very good, and the characters were intriguing.<br><br>The acting and special effects could have been better, and some may wish it to be more scary, but I don't think anything about this movie was poor or cheesy. Especially considering a cast of so few \"big name actors\".<br><br>I was never bored or disappointed. As action-thriller it did all I would want from the genre, it surprised, thrilled, was nice to view, and engaged me enough emotionally to care what happened. I was well entertained and think a rating of 5 or lower is very harsh when you compare it to other films with a similar rating.","user":"danishdonjuan","rank":[47,57]},{"title":"A fun werewolf flick that you don't have to think about!!","rating":6,"date":"12 October 2012","review":"Is this film going to win any awards?,no. Will it keep you entertained for 90 minutes, yes it sure will.<br><br>If your looking for a popcorn, creature feature then this will certainly fit the bill.<br><br>There is a story (just about), plenty of blood and guts and a werewolf!!! I grant you it's a CGI Monster so it's not all that but it does fit in with the film.<br><br>The film kept my attention throughout and I genuinely enjoyed it. Visually it reminded me of Van Helsing and the like but thats where the comparison ends as this is pretty good!!<br><br>Recommended.","user":"justind071","rank":[34,44]},{"title":"Nice little movie","rating":5,"date":"19 November 2012","review":"Nothing special, but more than a decent effort. Plus a few good actors are thrown into the mix. Stephen Rea being one of them. Acting is good overall. Nice make-up FX and nice story support that. There is not too much blood mind you and no nudity (just in case you were looking especially for those things, either because they interest you or appall you).<br><br>You can't or shouldn't compare this with a big budget movie though. It's what it's supposed to be: A nice little snack, an appetizer let's say, no pun intended. It is predictable and does not really make a secret of one of the (supposedly) big mysteries of the movie, but it still works nice enough","user":"kosmasp","rank":[17,22]}]