[{"title":"Unexpected Finish","rating":6,"date":"15 January 2013","review":"When I started watching this film I was trying to figure out where it was going for the first hour. And with a film that approximately 1hr37mins that's pushing my limits on clarity (or as the politicians call it, transparency). On the other hand what fun would it be it we could figure out what was going to happen next (but I do like to know what's happening now).<br><br>All the actors do a good job. James Woods is always great and he maintains his standing in this film. Dorff is believable as the alcohol/drug abusing detective, although I don't know if many police departments would allow his attire, demeanor and foul odor to continue for very long. I like Walton Goggins in this although I don't think there was enough of him. That broad toothy smile of his is a trademark but we did not see any of that in this flick.<br><br>Even after the film discloses part of the overall plot and what you think is the missing piece there is still a finish that surprises. Otherwise, this would be a humdrum movie.<br><br>One concept that was used extensively were flashbacks, especially at the beginning, that left me confused about what the actual storyline was or which storyline I was suppose to follow. But I got past it and enjoyed the movie.<br><br>This film is worth a watch.","user":"johnboyblues","rank":[43,61]},{"title":"A good police drama that would have been better as a TV show. Acting & cast is great, just a little too slow in parts. I say B","rating":7,"date":"22 January 2013","review":"\"Today is the day I die.\" Detective Callahan (Dorff) is a good cop with a checkered past. While out protecting someone he gives chase and does what he has to do, when the person he is chasing turns out to be a cop he wonders what is going on. Things begin to become confusing to him and he is struggling to do his job and fall back into his old ways. This movie starts off very exciting and gripping and stays that way for about half the movie. Then it starts to slow down a little. I think the problem with this is that it is a really good idea for a TV show but when stretched out into a full length movie they have to drag some things out and that really hurts the pace of the movie. This is still worth watching though and keeps you interested for most of it. While not amazing this is still better then most of the movies like this that have come out. Overall, worth seeing but would have been better as a TV show like \"Blue Bloods\" or \"NYPD Blue\". I give it a B.","user":"cosmo_tiger","rank":[15,20]},{"title":"Bad Cop Gone Good","rating":7,"date":"3 February 2013","review":"Deep in Characters this is quite an Engaging, but Bleak and Cold, look at another Tortured Cop who seeks a Second Chance. It is a Rich Story-Line that Requires the Viewer to pay Attention with Twists and Turns and multiple Flashbacks.<br><br>It has a Crisp and Clear Look and the Performances are (except for the ever intense and intemperate Dorff) Stiff, but Credible. Police Cover-Ups and Stripper's Uncovered are Nothing New but this, based on a True Case, Fine at a Bad Cop Gone Good Story.<br><br>This Barely Released Movie is Worth a Watch for its Rich and Layered Production that Demands some Respect Despite some Indifference from the Money-Men and Critics.","user":"LeonLouisRicci","rank":[9,11]}]