[{"title":"A great little film that proves that they can still be made...","rating":8,"date":"23 May 2012","review":"OK, It's not an epic, and it certainly could have some smoother edits, but as jaded as I can be after roughly 5000 movies I think that this is a very good film.<br><br>First remember the genre'. The story is well paced and shot nicely. They have resisted the urge to cut too fast, and this gives actors the chance to embrace a scene, making it believable. This is better than many big budget, big name parades that present themselves as quality but miss the mark. Fun,engaging and well acted,Wes Chatham,Devon Sawa, Sarah Butler,and Adam Mervis do a lot to develop believable and vulnerable characters within the constraints of a compact but well written script. I look forward to following their promising careers. Butler in particular is need that one big opportunity and she'll light up the screen. Sarah Butler deserves kudos for being extremely endearing quickly and adding real weight to the tension within the story. Devon Sawa, a winner.He just is. I've always been Neal McDonough fan and he has the talent and charisma that makes the viewer hope for more screen time.<br><br>A very good movie. AND I am a very jaded reviewer.","user":"roadstar06","rank":[17,24]},{"title":"Average in every aspect","rating":5,"date":"27 July 2012","review":"I think anytime you watch a movie about something in which you are knowledgeable there is an excellent chance you will be disappointed. Movies when people click on a keyboard for 2 minutes and crack the CIA firewall or alien codes! Or when Japanese import cars are red-lined but seem to continue to rev higher and go faster with nitrous. Or football movies where people are diving left and right, but never at the ball carrier.<br><br>This film is no different. The fight scenes weren't bad. Not even close to real, but better than other movies I've seen. The acting wasn't bad. The plot wasn't bad. Bearable, entertaining, but nothing exceptional.<br><br>The plot has the lead actor fighting THREE fights to pay off a debt of his loser friend. After TWO fights, against virtually unknown local fighters, an MMA organization seeks him out and offers him a contract fight. The representative of the organization says they've been tracking his career. What??? His first fight was with no training after 10 years in prison. The second a few weeks later. Thousands of fighters across the nation, and they take notice of a guy with 2 wins in as many weeks against local nobodies??? Good grief.<br><br>His third fight is against a guy twice his weight that moves like an 80-year-old. Look, it isn't the UFC, but there are still weight classes! I won't reveal any more and risk spoiling the end.<br><br>Bottom line... worth watching over regular TV... but nothing beyond average.","user":"djo_34","rank":[6,7]},{"title":"No, it's not in Philadelphia","rating":7,"date":"16 October 2017","review":"The Philly Kid is a film about the Mixed Martial Arts fight game and if you think it's set in Philadelphia as I did you will be wrong. It is set in New Orleans and curiously enough nobody in that whole cast speaks with anything remotely resembling an accent you would find in New Orleans. You might as well have set the film in Philadelphia.<br><br>Other than that this is a pretty good film in the tradition of such fine boxing films like Champion, The Set-Up, The Square Jungle and the more recent Split Decisions. Young Wes Chatham and his friends Devon Sawa and Kris Von Damme are just out for an evening and truly and innocently get involved in a cop killing. Von Damme is dead, Sawa is wounded and Chatham does 10 years for something he didn't do.<br><br>Chatham was at one a promising college wrestler and when he gets out he finds Sawa in heavy to some gamblers. He learns the mixed martial arts game and agrees to some fights to get Sawa out of debt. He also falls for Sawa's sister Sarah Butler. <br><br>Like those other cited films The Philly Game is very honest and lucid about showing all the crookedness and double dealing that goes on. It's realistic and at times very brutal. Chatham has to navigate between gangsters, crooked promoters, and one bad crooked cop.<br><br>The fight scenes are as realistic as when I've looked in on real mixed martial arts matches. My favorite scene is when Chatham is drugged during a match and still comes out on top. All due to a fighting heart and an old wrestling maneuver.<br><br>The Philly Game did not get much notice coming out, but it's an undiscovered diamond in the raw if you look.","user":"bkoganbing","rank":[2,2]}]