[{"title":"Not good","rating":5,"date":"6 November 2017","review":"This movie reminds me the French \"Taxi\" movie series (from Luc Besson): bad action scenes, bad acting, bad script, bad camera work.... <br><br>I don't know how Scott Eastwood got involved in this movie. Because he can have a pretty good acting career like his father by selecting better projects.<br><br>Ana De Armas is not good either (before her big break in Blade Runner 2049). Surely because of the crappy and unoriginal script.<br><br>And I don't know how this movie got funded. Surely it can be a nice TV movie, so forgettable.","user":"laurentdelvigne-446-586973","rank":[20,23]},{"title":"Everything is B movie standard","rating":5,"date":"3 July 2017","review":"On the plus side the rare and vintage cars are quite beautiful and the scenery in the South of France is attractive even though Marseilles is not the prettiest town in France. The cast is OK but B movie caliber. The girls are semi hot and the villains semi menacing. Scott Eastwood is alright but he doesn't quite have enough charisma to make up for the rest of them.<br><br>The story seems pretty predictable until a twist saves things then it doesn't seem like such a ho hum movie. The car chase is rather slow because the cars are delicate and can't be damaged. In fact I was more anxious about the cars being dented than anything else. This movie doesn't attempt to be a Furious type movie.<br><br>Not a must watch by any means.","user":"phd_travel","rank":[25,32]},{"title":"Over-BAD","rating":1,"date":"23 August 2017","review":"Do not waste your time with this movie. -Directing is bad: car chases are slow and the director does not give the audience a single frame that would surprise or be exiting to watch, a lot of editing mistakes, bad special effects (like the Porsche 911 that catches fire after a crash...). French companies were in charge of the special FX (umedia VFX and Digital District) and while they must have put a lot of effort to do their job with a budget...the result is laughable. -Acting is very bad: Scott Eastwood CAN NOT ACT. So does the rest of the crew... - Cars: We're talking about a car movie...and the cars were just ridiculous except for two... - Bad script: very predictable (if you didn't see the twist coming at the end...you're not very bright) - I would like to ask Mr. Scott Eastwood and the movie producers to refund my tickets for this movie!","user":"Alexfromparis","rank":[31,41]}]