[{"title":"It's not as simple as it seems ... *spoilers*","rating":8,"date":"11 February 2014","review":"This movie was almost too much for me. I couldn't go through it at once. I had to stop it around 20 minutes before the end, and continue three days later. No, it wasn't scary, no it wasn't too sad, it wasn't bad, and it wasn't too special, either. It seemed shallow on the surface, but getting deeper and deeper as you peal the layers of the main characters - Wallace/Arthur and Charlotte/Mike. They were too dysfunctional, yet too perfect for each other. It is sometimes weird how not opposites, but similarities attract. And that attraction is much stronger, although with a string of weirdness. It's a way of approving yourself, finding comfort and finding accomplice in being yourself ... Two reasons made me stop. Firstly, the conflict in me caused by the depressive tone of the movie versus the fact that I liked Wallace and Charlotte and on some level justified their actions, especially Wallace's. And second because I knew they have to get apart. That was the only answer. That was the right thing to do. <br><br>However, I was happy to see growth in both characters at the end, and the stable and rightful personality of Wallace overpowering his weaknesses and momentary confusion, as well as influencing Charlotte to find that better person in herself. <br><br>I didn't really like Anne Heche's character. She was cold, dull and in a way stuck to a routine. Although Wallace seemed boring on the outside, he wasn't with Charlotte. He was daring, funny and passionate. He was in the here and now. Minus the crimes they did, Wallace deserves such kind of relationship.<br><br>I'm giving this movie an 8/10. It made me think, it made me re-think some of my personal stuff, it made me more grateful for what I have, even if only for an hour and a half, it made me realize that you can become whoever you want to become, but you can never escape from yourself.<br><br>Line that will stay with me: \"It's a lot easier to love a dead man, isn't it?\"","user":"Jelena555","rank":[17,18]},{"title":"Just for the chance to see Firth and Blunt, this somber yet touching film is worthwhile","rating":7,"date":"12 August 2014","review":"Arthur Newman (Colin Firth) is trying to live a new life. He was formerly a struggling golf pro and shipping manager with a nice-looking girlfriend (Anne Heche). But, things were not going well. He was also estranged from his almost-a-teen son. So, since he lives near Jacksonville Florida, he fakes his own death by drowning and takes off. Newman, a fake name for his newly acquired life, is on his way to Terre Haute Indiana to become a posh country club golf pro, with made-up credentials, for the most part. But, on the long journey, he stumbles upon a lady, Mike, er, Michaela, (Emily Blunt) who may be suffering more than he is. She is drunk and Arthur views her being taken to jail by the police. Giving a made up story, Arthur springs her from jail and stays with her until she is sober again. Tentatively, they strike up a friendship, as Mr. Newman learns that Mike may not be her REAL name, either. In any case, Mike agrees to go to Indiana with this handsome man. Along the way, they strangely break into houses that are temporarily empty, try on clothes, take pictures and pretend even more. But, as Arthur soon learns, Mike does have some truly intense baggage in her past. Will they succeed in forging new lives without consequences? This somber, touching film is dead serious most of the time. Oh, the scenes from the dress-up days have humor and there are occasionally funny lines. But, mostly, this movie deals with very complex issues and is not really a light-hearted flick. Naturally, Firth and Blunt, excellent thespians both, do fine work and look great together. Also wonderful is the changing scenery, the supporting cast, and the courage to tackle the anything-but-fairy-tale life of its two main characters. No, its not a movie to watch when you, the viewer, have some sobering problems in your own life. But, fans of these two British thespians will want to try this one, too.","user":"inkblot11","rank":[14,15]},{"title":"Different, if not entirely unique","rating":7,"date":"15 February 2014","review":"I watched Arthur Newman simply because I found it by accident. While it's not the best film I've seen, I do believe everyone did a credible job with very little material. Colin Firth and Emily Blunt are good, doing the best they could with the somewhat underdeveloped characters. However, I feel the characters are presented as such on purpose, to make of them what we personally will.<br><br>The film moves slowly, but is in no way boring. An experienced film buff would be fine with its pace and be relatively engaged in the story line as well.<br><br>Arthur Newman is not for a generic audience. It requires a specific taste in films to be enjoyed for what it is - a thought-provoking story","user":"shanki-k","rank":[19,22]}]