[{"title":"A truly bizarre story","rating":8,"date":"30 November 2012","review":"A 13 year old boy disappears from a small town in Texas, three years later Police in Spain alert authorities in the US, against all odds it appears that child has been found....or has he?<br><br>I watched this 'movie' not knowing very little about it, and after 10 minutes or so I was puzzled, is this a mocu-mentary or based on a true story? surely it couldn't be as the story was so bizarre!!<br><br>Filmed in the same style as the TV show 'Banged Up Abroad', part interview clips with the real people, part reconstructed key moments with actors, this is a quite astonishing story and well worth a viewing.","user":"rjwilliams5150","rank":[27,29]},{"title":"The less you know about the story, the more you'll enjoy it","rating":8,"date":"9 August 2012","review":"This is the documentary, of the many I saw during the Perth Revelation Film Festival 2012, that has stuck to my memory, and the one that fascinated me the most.<br><br>The documentary revolves about the vanishing of a 13y.o boy, Nicholas Barclay, for his home in Texas in 1993, to be found in Spain with an apparent amnesia six years later. What happens after the young man call the Spanish Police is the core of the film.<br><br>The movie mixes interviews with the protagonist Frédéric Bourdin, Nicholas' family, American FBI and Consular officials, and has very atmospheric re-enactments done with Spanish actors and settings narrating the events occurred in Spain. The story is build up like in a thriller, and it will keep you glued to the screen, wanting to know what is going to happen next.<br><br>Layton has given the documentary the tone of a mystery movie in the re-enactments, but also in the interviews through the use of the chiaroscuro, camera positioning, hues of the film, and the tempo and way the events are presented - everything serves to build up suspense and mystery, and make you doubt and question yourself. Is this a real documentary or a mockumentary? Are we being fooled? The story is fascinating and amazing per se, but the way it is presented, is marvelous from a cinematic point of view as lets the viewer munch on a few philosophical themes: self-identity, reality and perception of reality, the connection between emotion and perception, and the use of cinematic narratives in documentaries based on real events, among other things.<br><br>One of the main downs of the movie is that Nicholas' family is somewhat ridiculed and vilified for the sake of the storyline. After all, we need of good, bad, stupid and clever characters in a story to create an interesting film. In the first place they are portrayed as ignoramuses; however, they are a suburban family living in a poor area of the USA, with little or none education; you cannot expect much of any person grown in this social environment anywhere in the world. In the second place, they are ridiculed for failing to detach themselves from their emotions and see something really obvious for the spectator; however its a characteristic of human nature and behavior to attach emotion to our thoughts and to interpret what we see according to our own personal individual viewfinder. We do so, all of us, every single day, in our daily lives, so you cannot expect traumatized and emotional people to see things as clearly as we see them from our seat in the cinema. In the third place, the movie implicitly blames the family, by letting some of the characters doing so, for the vanishing of Nicholas, without providing any evidence for it.<br><br>Still, this is a terrific documentary. The less you know about the whole story at the beginning, the more you will enjoy it. This is a documentary that attracts people to the genre because reinvents it. A proof that a documentary can be amazing, intriguing, entertaining, and thought provoking.","user":"Imdbidia","rank":[90,105]},{"title":"Interesting...","rating":8,"date":"23 June 2012","review":"I saw this film at it's European premiere last night at the Edinburgh Film Festival and I was very surprised. The first 1/3 of the film is a well stylized documentary but then this story, which goes from implausible to downright absurd. If the story wasn't true, you would find yourself thinking that the director was trying to string you along and at the very end pop out and say \"naw, I was just kidding\". There are so many parts of it the require you to suspend belief only to remind yourself it was reality.<br><br>While there maybe no new information, the ability to portray complex situations from the perspective of the participant remind us all that truth and the human condition are relative. You are left with unanswered questions, doubts and just shaking your head. Well polished, well executed and well edited, there are few documentaries that can suck you into them and actually wonder what is next.","user":"me-47-164358","rank":[72,87]}]