[{"title":"Decent attempt at making a movie differently","rating":5,"date":"1 September 2014","review":"Plot was refreshing. Paul's acting specially toward the later half was good. The camera usage laced inside the car was very unique. Not seen many movies with this kind of attempt. <br><br>What screwed up the movie for me was the numerous logical errors right from start. Car company gives a rental without checking and cleaning out the vehicle? Why would a person in a new country rent a car...instead of using a taxi or Super Shuttle or whatever? In 2011 who does not have a smartphone which has GPS capability? Who does not come prepared to a new country without specific instructions to reach the US Embassy? Paul takes so much time to decide to spray his car. If you are a criminal on the run the first thing you would do is to ditch your vehicle and try using another. Or just hire a cab to get to US embassy.<br><br>A different Director would have made this a great movie. Sorry I cannot go beyond 5 in rating this movie","user":"sendmailtojk","rank":[9,9]},{"title":"Casey's Movie Mania: VEHICLE 19 (2013)","rating":5,"date":"7 May 2013","review":"A low budget indie thriller with an interesting concept, but VEHICLE 19  suffers from sluggish pace and short of adrenaline rush.  The first thing that attracted me to watch this low-budget indie  thriller called VEHICLE 19 is its irresistible concept -- the movie is  shot entirely from inside the car. Now that's what I called a great  novelty. However, South African director Mukunda Michael Dewil fails to  capitalize his own concept. Instead of a fast-paced thriller normally  expected from this kind of movie, VEHICLE 19 sputters as it moves  along.  Somewhere in between, director Mukunda Michael Dewil manages to stage  some claustrophobic moments and worthy action scenes within the  confined space of a car (and limited budget). Paul Walker is fairly  adequate to put on a (mostly) one-man show as a brooding and manic  anti-hero.  It's a shame that Mukunda Michael Dewil's script is lackluster. More  than often, the movie loses its momentum whenever it tries to elaborate  the storyline. The pace is patchy, while the movie's overly-stylized  look is too distracting for its own good.  Overall, VEHICLE 19 only works in certain angles. The rest of them are  as rusty as a beat-up engine.","user":"caseymoviemania","rank":[35,43]},{"title":"Falls at the first hurdle","rating":3,"date":"11 May 2014","review":"One reviewer says this film has a \"nice plot\", but the plot of Vehicle 19 is actually its greatest downfall, and, as movies generally succeed or fail or their plots, this movie is a bit of a bummer.<br><br>What I am about to say might, for some films, be a plot spoiler, but as I've established the plot is poop, I don't think I need to worry.<br><br>So, Paul Walker arrives at Jo'burg airport, picks up the wrong rental car and subsequently discovers a silenced gun has been left for the rightful renter for the purpose of killing the female lawyer currently tied up and gagged in the trunk. Hmm. Someone has gone to the trouble of kidnapping this woman, sourcing a silenced weapon, bundling her into a rental car, but doesn't bother with that extra step of killing her. (This is a little like that old James Bond moment when the baddies always but always fail to actually kill him when they have the chance.) Instead, they have hired someone from abroad to fly in, pick up the car, take it somewhere remote and kill the woman. Come on, people, this is one of the most violent countries on earth; you couldn't find someone local to do the job? <br><br>This is, therefore, one of the most contrived plot openings ever, and its discordant noise reverberates throughout the entire film. Paul Walker's character makes some equally idiotic moves with the sole purpose of progressing what remains of the plot, ignoring common sense at every turn in a sterling effort to place himself in as much danger as possible.<br><br>You get the gist.<br><br>The final scene is a direct rip-off of Clint Eastwood's The Gauntlet, which is a far better get-this-lady-to-safety film than Vehicle 19 could ever hope to be.<br><br>It's rather sad. As much as I really like Paul Walker as an action hero, and mourn his untimely passing, this is a pitiful epitaph for the man.","user":"emjaypeps","rank":[13,15]}]