[{"title":"Surprisingly pleasant in contradiction of critical reviews.","rating":9,"date":"17 July 2014","review":"Wow, after reading the reviews that are at the extremes, I really didn't know what to expect. But I like to judge controversy for myself and so when the title came up at the $1.50 Theater we went. Surprisingly, the smaller auditorium was about ½ full. What a delightful movie, so far and away from what I was set up for by all the disparaging - bordering on hateful comments and low ratings. It makes we wonder if the low raters even saw the show, or have hearts of stone; their reviews discredit them. The movie is about a local minister, in a small church, who works several jobs to make ends barely meet, married with two small children. His parish loves him and life is marginally good. But then his four year old son gets a burst appendix, and their whole life gets turned upside down for fear their son will perish. The minister screams at God, his faith tested to the core. A pray chain is set up at the church, in the town, and the boy narrowly pulls through. Everyone is relieved and life gets back to normal. Or so it seems. But then the four year old begins innocently to reveal to his father, that he had had an out of body experience, and provides details of heaven, like seeing his father screaming at God in the hospital chapel. Over time, the boy continues to relate more material so that the father consults a psychologist who discredits the actual encounter as normal memory tricks. Somehow the news leaks out of the family, to the church and community, and public controversy ensues. What to believe? Yet still more and more facts come out from the child that could not be known to the child except from his encounter; that then convince the minister of heaven's reality, from his son's innocent testimony. The minsters faith waivers, but then finally returns to belief. The movie is a real tear jerker. The plot moves quickly and steadily; the acting is superb, the child priceless. It ends well, a happy ending and faith is explored. For me, it was a pleasant surprise and in all a fine little low budget movie that witnesses faith with honest reason and doubt. Definitely worth the $1.50 and the time.","user":"rhhdvh","rank":[59,90]},{"title":"Sorry I Waited to See This","rating":9,"date":"28 June 2014","review":"I loved this film. <br><br>I knew the basic plot going in, but was pleasantly surprised on how well the film was put together. There was comedy, drama, real-life all wrapped in one film. The acting was solid. Greg was great, Margo was awesome, Thomas and Nancy were solid and I was in love with Kelly. Conner was great at just being the innocent child.<br><br>I loved the scenery, the rural life, the wide open spaces, the cinematography and the family life complete with it's struggles. Add to that the trauma of a nearing losing a child then having a unique heavenly experience. Rather than simply preach to us, the film shared the real human flesh struggles of a man that was a minister, but still a man. <br><br>Even if not based on a true story, it would be a great movie.","user":"mdgordon","rank":[59,96]},{"title":"The Great \"What-If\"","rating":8,"date":"3 March 2017","review":"After reading the book on which this film was based, I was excited to see what this adaptation would be like. I was not disappointed, as director Randall Wallace tells a story that doesn't go over-the-top, yet still manages to capture the wondrous story of Colton Burpo and his family.<br><br>For a basic plot summary (in case you haven't read the book!), \"Heaven Is For Real\" recounts the experiences of young Colton Burpo (Connor Corum), who has a near-death experience and claims to have see Heaven, Jesus, and many other experiences that a boy his age should not have known about relating to passed-away relatives and such. Father Todd (Greg Kinnear) and mother Sonja (Kelly Reilly) don't know what to think: are these experiences real, or did they come from the adrenaline-fueled memories of a preachers son?<br><br>Basically, if you enjoyed the book, I can't see why you wouldn't enjoy this film as well. It is well- acted, filled with emotion, and touches on the same emotional issues that the book delved into. Besides feeling a bit rushed in the end, \"Heaven Is For Real\" didn't leave me feeling like I was missing any key pieces of the story.<br><br>Of course, whether or not you believe in God and/or the Burpo's story is central to the emotional components of the film. I believe, and thus it perhaps has a more profound impact on me. I'm not without my doubts, but after reading the book and watching the movie I can't see why this would all just be \"made up\". But that's a bit off topic for this review. Regardless, one can criticize the subject matter if they wish, but I don't think the adaption/presentation deserves any of that criticism.<br><br>The bottom line? The story of the Burpo family is quite interesting no matter which way you look at it. It poses one of the great \"what if\" questions of the universe: what if you could prove that heaven exists? Would it change the way you lived your life? This film does an excellent job of posing those questions while also telling a tale of family, love, and friendship in the process.","user":"zkonedog","rank":[4,4]}]