[{"title":"Catwoman: The best DC Showcase I've seen","rating":7,"date":"31 January 2018","review":"Warner Brothers deliver yet another DC Showcase, this time about Catwoman who is by far the most well known of the hero choices thus far.<br><br>It tells the short story of Catwoman in pursuit of Rough Cut who appears to be smuggling more than just diamonds this time.<br><br>Fluid, action packed and well paced this is everything a short should be.<br><br>I'm a fan of Dushku but I question how much she was paid for this 14 minute short considering she speaks about 3 lines total!<br><br>Good stuff.<br><br>The Good:<br><br>Very well animated<br><br>Eliza Dushku<br><br>The Bad:<br><br>Very little dialogue yet has an expensive voice cast<br><br>Things I Learnt From This Movie:<br><br>Kevin Michael Richardson needs to learn some new voices","user":"Platypuschow","rank":[5,5]},{"title":"Catwoman foils a smuggler's plot and rescues an old friend.","rating":8,"date":"2 July 2012","review":"Okay, did we all watch the same show, here? I've seen several complaints about the quality of the animation, and I keep wondering what part are they complaining about? The car chase, the multiple fight scenes, the pole dance (!), it all looked great to me, far above the usual quality of US animation. Example: check out the backgrounds and you see people actually moving, not just static figures. <br><br>Granted,character development wasn't superb here, but from a pure action perspective this was a great debut for our favorite pussycat antihero. I mean, how much character development can you cram into a short? Which is my one complaint and the reason why I only gave it an 8. I wish it would have been longer.","user":"psych58","rank":[5,5]},{"title":"Don't Listen to the Other Reviewer","rating":10,"date":"3 December 2011","review":"This DC showcase Catwoman short is dark, gritty and absolutely fantastic. Thank you Paul Dini once again, you are a master at your craft. I personally love this short and was totally impressed, I think I like it even more than the feature. I read a comment that this should be made into a Catwoman animated series and I for one would definitely watch that. I don't no how this is rated in the 6's on IMDb unless people are rating it a 1 because they expected something for little kids like Batman: Brave and the Bold. I actually think this is the best animated DC product since Batman: Under the Red Hood, and really hope they continue to make more in this style. Adult, Dark &amp; Gritty, with some sweet action throughout (something Year One could've used a little bit more of in my opinion along with a new voice actor for Batman (sorry but Ben Mackensie from Dawson's Creek just doesn't cut it for me, personally if I couldn't get Kevin Conroy, I would look into getting someone like Crispin Freeman to voice Batman). OK back on topic, I'm going to comment on what the previous reviewer said about DC comics and the Catwoman short being sexist (LOL), OH No they showed Catwoman stripping partly (no nudity) in a strip club. It's rated PG-13, GET A LIFE. I swear you see a lot more degrading things watching Miley Cyrus or Lindsey Lohan.","user":"Kubrickisdaman","rank":[14,21]}]