[{"title":"Forever repeating our mistakes","rating":8,"date":"10 July 2012","review":"Same guy, same place, same characters, but different combinations. Same day? Maybe. Is this the same day in different combinations, or different days that show how utterly repetitive life is? There is room for debate there. If you've ever kept a diary over a period of years, then gone back to read them, the most shocking thing that many people find is not how much they've changed, but how much they haven't. You make similar decisions and similar mistakes. The situations are always slightly different, with some minor variable, but the results end up in the same place. This film is an examination of that idea. It's may not be for popular tastes, but it's good stuff, reminiscent of Eric Rohmer and the French New Wave.","user":"kikiteka","rank":[22,24]},{"title":"The Koreans Have Done It Again","rating":9,"date":"16 January 2012","review":"The Day He Arrives is a very interesting look at relationships and the emotional barriers that are put up by both men and women. I'm a big fan of directors who use long takes in scenes and it's really strange here because almost every scene is done in one take even though there's a barrel load of dialogue in each of them – it must have been very hard for the actors but that just brings out the superb performances from each of the cast. Throughout the film we see the same sets and the same supporting characters over and over again – some not related to the plot at all – but unlike most filmmakers the repetition is explained through dialogue and story which makes this quite unique. It's also interesting to take note of the voice over which chimes in every time the main character receives a text message, further delving into the main character's mind – something which you don't normally see in any film with any of it's characters. Another great technique used by the director is the zooms – they happen halfway through takes and they never really focus on anything except the characters, we rarely get a shot of one character on their own and I don't think there's a single close up in the film. Regardless of that we still feel the characters' emotions as we would in any other film and in that respect the director is doing something very special with these techniques. I look forward to seeing more of the directors work. http://destroyallcinema.wordpress.com/","user":"eraserdead","rank":[24,28]},{"title":"A man has similar experiences day after day.","rating":7,"date":"8 May 2012","review":"This genuinely weird Korean film seemed like a fusion of \"Groundhog Day\" and \"No Exit\" but in a style that married Eric Rohmer and Woody Allen. I don't really know if I liked it or not and kind of admire it for that. A Korean film-maker, who has forsaken the art world for a simple life as a rural school-teacher, returns to Seoul to reunite with friends. The first night is an enthralling experience of great, drunken conversation on the nature of chance and identity, with much drunken lust thrown in. Each following day becomes a less satisfying copy of the first. Time has stopped, and only the director seems (semi) conscious of it. I would interpret this work as a kind of confession. The director's development has been entrapped by his vanity even as he strives for a life of modesty. Whatever else, it captures Seoul, and drunken satisfaction- be it intellectual or amorous- very nicely.","user":"treywillwest","rank":[17,22]}]