[{"title":"Infinitely Bipolar","rating":1,"date":"1 January 2016","review":"Living with a bipolar father proves difficult for two young girls when their mother has to move away to study in this comedy-drama blend set in the 1970s. The title comes from the youngest daughter misnaming her father's condition as \"polar bear\" - thematically relevant as the overall film is about the two girls learning to accept their father's behaviour beyond their own preconceptions, appreciating what he does do well. From such a description, the film might sound overly sweet, and in a way it is, only ever seeming to skim the surface, focusing only on how embarrassed the girls are by their father's inability to integrate into society. There are a couple of moments in which the girls genuinely seem afraid of what their father might do, but the film never tugs at the full experience of living with someone with mental issues; as others have said, Mark Ruffalo comes off as more an everyday eccentric than a manic depressive. That said, Ruffalo's performance is the film's best asset, frequently communicating a genuine interest to bond with his daughters and care for them in small, subtle ways. His facial expressions and movements convey more than his dialogue and it is easy to feel for his frustration at not being able to be everything that his daughters want. It is much harder to reconcile the film's blanket negative attitude to the US public school system throughout, but it does act as an acceptable symbol of all that the girls' parents are worried about, and the film does offer an acute portrait of parents doing what they can for their offspring, even if it falls short in other areas.","user":"sol-","rank":[11,11]},{"title":"Mark Ruffalo Will Make You Bark with Pleasure","rating":9,"date":"12 September 2014","review":"This incredible actor is given full reign in a film which capitalizes on his ability to be both sweet and intolerably infantile. I am a fan!<br><br>I laughed a lot and I really appreciated insight into the world of bi-polar craziness depicted with an even hand and so much love. It was also a skillful depiction of a chaotic 1970's childhood.<br><br>This is the director's first feature film, but she knocked it out of the park. Although I would say that casting Mark Ruffalo as a Boston WASP is improbable, it worked for me. The scenes of his extended family are worth the price of admission alone.<br><br>Zoe Saldana makes the move possible as she loves everything about Mark Ruffalo that anyone does. I do not know Mark Ruffalo, but I know that he is smart, good-looking, interesting and an exceptionally warm person. The miracle is that this film-maker can tell the story of a difficult youth without any rancor and with insights which are subtle, heart-breaking and hilarious.<br><br>The children in this film give it great authenticity. I vote for them!","user":"juliasf","rank":[55,65]},{"title":"Infinitely Personal With Wide Appeal","rating":9,"date":"1 October 2014","review":"Maya Forbes writes and directs a personal story of bittersweet childhood living in livid conditions with her sister, mother and eccentric bipolar father. A landmark first feature that has enough laughs but loads of conflicting emotions.<br><br>Zoe Saldana is a strong presence with her loving/loathing/longing and everything in between character. The ideal mother of her time and circumstances and the wife a man would fight for.<br><br>Mark Ruffalo is at the centre of it all with his charming, childlike and exuberant portrayal. He masters the manic episodes, the frailty, the fears, the hopes, the joys and the underlying deep love for his wife and kids.<br><br>The kids, one played by Maya Forbes's own daughter, are really adorable and act at a very high calibre. Creative, funny, aware and awkwardly accepting their weird family antics with a touch of rebellion.<br><br>Ultimately most of the credit is due to Maya's inventing and passionate storytelling in its form, content, message and lasting meaning. A film that is very human and difficult, but finds glimpse of beauty in little things that we should all hold dear. <br><br>An easy but complex crowd-pleaser with much meat and mastery for the critics and film aficionados.","user":"christian94","rank":[47,55]}]