[{"title":"Someone Marry Barry is hilarious!","rating":10,"date":"11 February 2014","review":"This is just a straight up fun film. Tyler Labine and Lucy Punch together are amazing. They keep you laughing the entire time. If you need a laugh go this this immediately! Damon Wayans Jr., Thomas Middleditch, and Hayes McArthur also put together solid supporting roles. Ed Helms (of Hangover fame and the TV show The Office) had a very funny cameo. What makes this comedy different and special is the endearing love story. When you push aside all of the inappropriateness and lewd behavior, Barry and Mel are very cute together and that comes out in their strong performances. It is a take on the old saying, \"there's someone for everyone\". Very very fun film. A must see.","user":"madroseproductions","rank":[34,50]},{"title":"Very trashy but entertaining comedy","rating":7,"date":"14 February 2014","review":"I see there aren't many reviews for this movie yet. Therefore I should let you know that this is a funny but very crude comedy. Definitely not for the kids. You don't even need to be a prude to be offended by this; I think any normal person probably *should* be offended by the antics of Barry, a chubby party animal, and his socially inappropriate girlfriend Mia, played by Lucy Punch.<br><br>Tyler Labine handles the lead role with confidence, and whose career looks ready to blast off. Lucy Punch is also very effective as Barry's partner in crime.<br><br>The film loses a lot of steam in the second half. But there's a steady drumbeat of funny situations to keep you entertained, sort of like watching The Simpsons. Have fun.","user":"joshua-303-92778","rank":[28,41]},{"title":"I Could Be That Someone","rating":5,"date":"9 June 2015","review":"Tyler Labine has always been a hot spot for mehot, so very hotso, frankly, even in his worst movies, he still brings a charm of someone who wants to be there, does his best and always entertains me. Add his charisma and undeniable likability and humor, the always wonderful Damon Wayans Jr (whom I've loved since the criminally cut short Happy Endings show) and the very funny Thomas Middleditch, you have one cute movie. Completely predictable and clichéd, the crude to a fault Someone Marry Barry is still hilarious at points and has solid performances all-around. It's not trying to be anything it's not and never takes itself too seriously, even when it veers into familiar, sitcom-gone-dramatic territory. For fans of both THAT ANNOYING FRIEND genre and Tyler Labine films, you'll sink in and enjoy your stay-at-home-movie-night.","user":"thesar-2","rank":[3,3]}]