[{"title":"Much better than expected!","rating":6,"date":"4 February 2018","review":"Ready for another mainstream comedy that many critics seem to abhor but yours quite enjoyed, if only because of his undying affinity for its leads?<br><br>Well, here it comes, Owen Wilson and Ed Helms offering their on-screen usual - a jovial freespirited guy vs. stuck-up and rigid but successful in life type - based on which they have managed to build quite long and successful screen careers, at least judging by the number of movies released.<br><br>And on their journey together, they will meet, of course, a motley bunch of colorful characters played by Glenn Close, J.K. Simmons, Katt Williams, ex-NFL quarterback Terry Bradshaw, Ving Rhames, Christopher Walken et al.<br><br>So far, so formulaic, I know. But guess what. Although the two leading men really do their usual schtick, and the approach is the usual too, \"Father Figure\" actually works.<br><br>I may not be that big on sugarcoated finale, but this may be this one rare instance of unasked, unneeded mainstream comedy where critics are actually wrong and have underestimated the project just because how generic it looks on the face of it.<br><br>You see, \"Father Figures\" may be a generic and mainstream by form factor, but there's something better beating at its heart.<br><br>Looking bad, I can't call it inventive or LOL-filled, exactly, but at least the makers have hit the bullseye at what they were aiming for.<br><br>Which means screwball comedy for the 2017's crowd: two chatty guys having an adventure together, meeting a bunch of interesting people on the way. Without an inner pressure to produce laughs but to involve the viewer in their lives.<br><br>And most of the events and people did feel more interesting than usual in this (sub)genre because of the surprisingly character-based approach where most everybody gets room to breathe and introduce one's natural charm to the audience, which is a huge win for the movie as a whole.<br><br>And the cast really has a huge amount of charm to spare, especially Bradshaw whose performance is so natural and enjoyable that I hardly believed this man is a retired sportsman who has only done a limited number of small movie roles.<br><br>All in all, looks like everybody had fun and also believed in the material. I only did not care about the rather soulless section with Christopher Walken - but it's short and you can't always get everything, can you?<br><br>By the way, this is the directing debut of one Lawrence Sher, a long-time comedy cinematographer who filled that job also in \"The Hangover\" trilogy (starring Ed Helms).<br><br>I am afraid to check how many times I have used the words \"mainstream\", \"generic\" and \"the usual\" in this review - this doesn't bode well for the movie, surely - but it's actually not bad.<br><br>Yes, there are many better comedies out there, but \"Father Figures\" may have just enough charm and heart to win you over for a 113 minute joyride.","user":"kaptenvideo-89875","rank":[57,79]},{"title":"A nice saturday night flick with the Mrs","rating":7,"date":"11 August 2018","review":"Too many serious critics so it seems.<br><br>After a long week at work if you want a feel good film watch this with a bottle of wine. kind of old school but with a lot of heart. Decent cast. Some good chemistry. And some twists along the way. Very heart warming...Not an oscar winner but a weekend feel good film!","user":"wildmike101","rank":[20,25]},{"title":"Not nearly as bad as people make it out to be, A good comedy.","rating":8,"date":"11 January 2018","review":"Its a comedy, so nothing serious. I didn't even have intentions on watching this in the theater. I went to see the new Star Wars but the theater had issues playing the movie. They offered us a refund, but my girlfriend and I still wanted to see a movie so we stayed and watched this. Neither of us knew what to expect, so we were skeptical, but as the movie went on we had a good time with it. If you like Owen Wilson movies then you will like this movie. I don't really understand all the hate, I follow a lot of movies so I had to get on her to give it some credit.","user":"rpmyfz450","rank":[62,93]}]