[{"title":"In response to the 1 out of 10 from an earlier reviewer...","rating":9,"date":"18 February 2013","review":"I've just finished watching 'Lore', and found it to be a deeply moving story, beautifully shot on film (which is becoming a rarity), with a breathtaking performance by the lead, Saskia Rosendahl.<br><br>I wasn't planning on coming on here to write a review, but after reading other people's views and comments, I was quite stunned to see one reviewer giving it only one star out of ten, claiming it to be 'Holocaust Denial: Trash!'. Having read this reviewers comments, it seemed to me that the reviewer had missed a crucial element in the film, and her reaction seems to concentrate on a revelation from the final third of the film which, if the earlier reveal isn't taken into account, could have caused her reaction. <br><br>The following comments contain a good few spoilers, so please don't read on if you have not already seen the film.<br><br>In the aforementioned reviewer's comments, she mentioned the scene where it is revealed that the papers carried by the character Thomas were not his own, but those of a Jewish man named Thomas Weil. It is mentioned by one of the children that Thomas had told him that was not Jewish, but carried the papers because \"Americans like Jews\". If basing the theme of the film on this scene alone, I can almost see why this reviewer came to her conclusions, as she appears to have assumed that Thomas was NOT Jewish all along.<br><br>However, earlier in the film, we see Thomas notice Lore looking at the numbers tattooed on his wrist, which he then covers with his sleeve. Thomas is a survivor in every way. He has survived the camps, and has adapted to continue his survival. Although it is never explicitly explained, using another persons papers may have been easier than not having any papers at all, and the revelation to the younger children may have been because Thomas knew the young boy would not follow him to safety if he had thought Thomas was Jewish. <br><br>For Lore, it is evident from the moment she sees the tattoo that she knows Thomas is Jewish. Even after the revelation that the documents are not his, she still knows. This explains her actions in the final few scenes, a reaction against her earlier beliefs and strict upbringing. This is what makes it all the more powerful. <br><br>The reviewer also references one other scene, of other passengers on a train discussing the photographs of holocaust victims, and one of these passengers claiming that they are faked circulated by the Americans. Is the inclusion of this scene intended as 'Holocaust Denial'? I think not. When Lore overhears this discussion, she is already fully aware that the photographs are real, and we know this because earlier in the film we see her tearing away a piece of a photo, which is later revealed to contain the image of her father in full uniform, witnessing the atrocities. At this point, she is unable to deny either the events or her fathers involvement.<br><br>The reviewer I have mentioned stated that she was hoping for a classic example of the 'Bildungsroman', or coming-of-age story, and personally I feel this is exactly what director Cate Shortland has given us. A tale of a young girl who has to come to terms with the end of adolescence, the end of a brutal war, and the gradual realisation that all she has been led to believe may not be true.","user":"edula","rank":[69,77]},{"title":"Gripping tale of the human urge to survive","rating":8,"date":"17 March 2013","review":"You'd think that, 68 years after the end of the second World War, every perspective would have been covered by the numerous films that have been made about it. But 'Lore' proves that it's still possible to make a movie about an unknown aspect of the war. <br><br>In this case, it's the situation in Germany just after the victory of the allied forces. It's a very interesting perspective, because things get turned around. The Nazis are no longer powerful rulers, but hapless losers, afraid to get caught by the Americans. And the Jews, although still despised by most Germans, are the ones who get things done with the allied troops. <br><br>The movie shows a country in an almost apocalyptic state, with dead people and destructed buildings everywhere. Citizens can't trust each other and are willing to do anything for some food or transportation. The powers are constantly shifting; an ally can suddenly turn into an enemy. <br><br>It's in this utterly destructed and disheartened country that a family without parents is finding its way, led by Lore, a girl of approximately 16 or 17 years old. Her parents, high-ranking Nazis's, have left her to hide from the Americans, and it's up to her to lead her younger sister and three little brothers (of which one is still a baby) to her grandmother in the north of the country. They have to beg for food and shelter, sometimes paying with the jewels her mother left behind. <br><br>Australian director Cate Shortland is very good in capturing the mood of desperation and defeat. She uses faded colours, almost like a Polaroid picture, and shows lots of close-ups. Not only of faces, but also of hands, feet, clothes and shoes. It accentuates the oppressive atmosphere in post-war Germany, and the terrible fate of the children. The story gets a twist when the children meet a young man, who for some reason is willing to help them. The relationship between Lore and the young man is ambiguous, for several reasons. <br><br>'Lore' is not easy to watch. There are several disturbing and gruesome scenes in the film. But it's a gripping tale of the human urge to survive in almost inhuman circumstances. And most of all, it reminds us of the utter horrors of war. This war, and any war.","user":"rubenm","rank":[39,43]},{"title":"Slow steady emotionally dense, sad, and utterly gorgeous movie","rating":9,"date":"25 August 2013","review":"Lore (2012)<br><br>A gorgeous, depressing, rare film about a family of Germans who need to survive the chaos and poverty of the end of World War II. This is a really terrific movie even though it has a single, basic, ongoing, sad arc--moving from place to place in search of food and safety as the Allies, mostly unseen, take over administration of the country in 1945. What it manages to say is not just that war is bad, or that people have the ability to survive anything if they must, but that beliefs and politics are stubborn and irrational.<br><br>It's this last part that comes through it all as the shining purpose. It's one thing for this band of children to beg for food or walk though forests weary and assaulted by marauders. But to have them run into others who, like themselves, don't know where to turn or what is going on, and still have a devotion bordering on worship for the fuhrer is mind blowing. But believable. <br><br>The filming--scenes, light, color, moving camera, and the sheer range of all of these from scene to scene--is stunning, absolutely terrific. As you might grow weary of all the weariness, you never grow weary of the movie because it's so rich in other ways. And it's never dull, either, as characters come and go and their motivations turn on a dime. How it ends, both literally and emotionally, will stay a surprise, and yet when it happens it makes such perfect sad undramatic sense. <br><br>There are all kinds of war movies, and this is an important insight into one of the least explored aspects to it all--the terrible aftermath. It's an Australian production, mainly, shot in Germany in German. And it's a really special, thoughtful, beautiful film.","user":"secondtake","rank":[27,30]}]