[{"title":"This Black Rock should sit in the bottom of the lake where no one can find it.","rating":5,"date":"16 August 2013","review":"First off, this is a very formulaic set up. That is not a bad thing, when I want an action movie, I want the action movie formula; when I want a horror movie, I want the horror movie formula. Black Rock follows the horror/survival/thriller genre of movie to the tee. Fine.<br><br>There are skinny unarmed women, who meet ex military armed soldiers and without giving away any 'twist', things get bloody quickly. The characters are roughly sketched with some solid acting, but we never really get to know or care about the characters. No problem, not what we are here for.<br><br>Where the movie falls apart is two fold: First, the best part about the movie should the Black Rock Island, a small (how small?) island with waters too cold to swim in. It is a great idea for a terrifying setting. However, it is rarely used to any effect. What makes the setting worse is the characters can both hid for a day, yet be almost on top of each other at the same time. At points the island seems to be miles long covered with dense forest, and at other points characters are hoping from one side to the other in a couple steps. This is confusing and a missed opportunity.<br><br>Second, when good horror/thriller movies set up the conflict, it almost always the strong terrorizing the weak, but the weak figure out some trick to save themselves. We as the audience need to believe that they can succeed, or be able to imagine that we could come up with a plan to survive. Unfortunately, this movie puts Labron James and (pre ankle) Kobe Bryant in a 2 on 2 basketball game with two 12 year old girls in wheel chairs. We as an audience need to believe our two heroines in wheel chairs have a chance, but we can't. The odds are so stacked against them that if they lose we are bored and if they win it is unbelievable. That is true of this movie as well. We are bored seeing boots crush ants and roll our eyes and almost laugh when that tears the booted leg off at the knee.<br><br>A long analogy, but the problem is that it is only through total incompetence and baffunery of the antagonists that the heroes don't just die 20 minutes into the movie.<br><br>Once you get past these two rather large disappointments there are other hard to overcome plot holes, like the sniper who can take out a moving target in the dark from atop a cliff with a head shot one minute then barley knows which end of his gun the bullets come out of the rest of the movie.<br><br>There is also a rather odd nude scene part way through that neither makes sense logically or in the story. The point of this still escapes me, but it was at least the only interesting character progression of the film.<br><br>All in all, it is a laboured film. It is too bad, because I looked forward to this film and was excited about the premise. The parts are there, but so much more could have been done with it. Characters flushed out, plot holes filled, more time taken with the mood and setting. Unfortunately, this Black Rock should sit in the bottom of the lake where no one can find it.","user":"fxdx4","rank":[26,34]},{"title":"A Black Rock to remember","rating":3,"date":"19 November 2012","review":"Great actresses, but a very weak script. Maybe the script sounded good, I can't say, but the end product isn't good at all, which is a shame. Cardboard characters with \"problems\" and issues that are apparent from the first minute. Which might leave the viewer wondering why and how this could come this far.<br><br>It tries to defend it's positions on the issues at hand, but the movie never really succeeds. And don't get me started on that incredible (in all the wrong senses) ending! The something goes wrong scenario isn't new either, so you might not care about the believability of it all. If you care just a little though ... Well, you've been warned. A shame, but logic never entered in this ...","user":"kosmasp","rank":[61,95]},{"title":"A Collection of Clichés and Moronic Decisions","rating":3,"date":"26 September 2013","review":"Sarah (Kate Bosworth) travels with her friend Lou (Lake Bell) to spend the weekend camping in the remote Black Rock Island that was part of their childhood. When they arrive to get their motor boat, Lou sees Abby (Katie Aselton) waiting for Sarah and they decide to give up traveling to the island. Lou and Abby were friends in the past but after an incident with Abby's boyfriends, they have been estranged for many years and do not talk to each other. However, Sarah convinces them to travel with her to Black Rock.<br><br>When they are resolving their issues, they meet their former schoolmate Henry (Will Bouvier) that is hunting with his friends from the army Derek (Jay Paulson) and Alex (Anslem Richardson) that worship Henry and Abby invites them to have dinner and drink with them on the beach. Abby gets drunk and she flirts with Henry and he makes a move on her. There is a tragic accident with Henry and his friends decide to revenge him.<br><br>\"Black Rock\" is a movie with a collection of clichés and a history based on moronic decisions. The plot is OK with Sarah trying to make up the situation between Abby and Lou and then the girls inviting Henry and his friends to recall the old times at school. However, Abby's inappropriate behavior and comments, despite she is drunk or not, does not make sense since the guys are strangers and ruins the story. The decision of the deranged Derek and Alex of killing the girls can be accepted, but the two clumsy guys armed with rifles being defeated by unarmed girls, missing or failing the shots is an absurd cliché. My vote is three.<br><br>Title (Brazil): \"Terror na Ilha\" (\"Terror in the Island\")","user":"claudio_carvalho","rank":[26,42]}]