[{"title":"I Enjoyed This Movie","rating":8,"date":"18 October 2014","review":"I really enjoyed this movie, but I must give a disclaimer... I never read the book, so I can't base my rating on how accurately the movie follows the book. I found that this movie had a lot of twists in it and wasn't as predictable as most other romance movies. (Also, it didn't hurt that James Marsden is great to look at.) I thought the actress who played young Amanda was really good, and I loved seeing the story as the two were growing up &amp; also in modern times. I'm not sure why this movie has gotten so much hate... I thoroughly enjoyed the movie, and would even pay to see it again if I get the chance.<br><br>I was not a fan of The Notebook, and would much rather watch this movie instead of The Notebook. Sure, the movies probably don't follow Nicholas Sparks' books super detailed, but they're good to watch if you're in the mood for a heartfelt love story.","user":"s-quinn_2010","rank":[54,72]},{"title":"Something Unexpected","rating":8,"date":"17 October 2014","review":"This is not a typical Nicholas Sparks adaptation.<br><br>Yes, this film is cheesy, this film's corny, this film's cliché. But to judge this film based on that alone is to completely ignore the context and conventions of its genre. It's not a ground- breaking film by any means, but it is ground-breaking if we're talking about Romances, specifically Sparks adaptations.<br><br>Anyone complaining about the typical formula (i.e., girl meets boy, girl's family doesn't like boy's family, the two lovers persevere, etc.) clearly hasn't seen this movie. Amanda (the female protagonist)'s father does fall into the typical mold of a disapproving, upper-class father who wants the boyfriend out of the picture so his daughter can have a bright future. But unlike a slew of other Romances (and even Sparks' own adaptations), he's in the film for a very, very brief amount of time. In fact, I'd go so far as to say he's not at all crucial to the film. If anything, his part was intended to play to the demographic and nothing else, which while regrettable, should say something about how this film stands up on its own without relying on clichés<br><br>I noted that film deals with real-life issues. We see issues of class, family, and self-esteem illustrated much better than most Sparks adaptations I've seen. Sean Bridgers knocks it out of the park with his downright of patriarch and sociopath Tommy Cole, father of protagonist Dawson Cole. The Cole clan in particular - a gang of drug-dealing(?), abusive, sickos really deserving of the title \"white trash\" - brings this film to life. They represent a segment of society that we rarely ever get to see on screen. This film, unlike some of Sparks' other works, does not cast a glowing light on the White South, and instead we get to the gritty, shameful parts that actually made me forget what movie I was watching. On top of all that, we get to see the consequences of trying to break away from the most perverted \"families\" that are present in every-day life. We get to see how that cycle of anger, shame, and ostracism fuels the dirty (and violent) blood feuds that still exist in the underbelly of this country. Luke Bracey shows us what it's like for a young person dealing with this life, to have their ambitions silenced, and the true pain that comes with leaving one's family.<br><br>Above all, this film speaks to regret. (Spoilers ahead) All the tragedies and hardships that meet the protagonists, unlike previous Sparks adaptations, actually don't pull them together. We do see some of that smarmy \"Life's hard but we still love each other anyway\" stuff throughout the film, but for once we get to see that narrative broken. Dawson's and Amanda's relationship gets tested, and for a while it goes on, but ultimately Dawson's predicament proves too dark for their relationship to hold out. It seems cliché for him to cut if off while in jail, but isn't that what we saw in The Hurricane (1999) and other great films? This is a film about love, and the sacrifice that Dawson makes is really believable considering that. After taking separate paths, both characters have to deal with that regret and questions of \"what if?\"<br><br>The issue of casting is one that shouldn't be ignored, but one that can't rightly be criticized too much in the case of Marsden. The late Paul Walker, the original choice for Adult Dawson, would have bared more resemblance to Bracey, but we can't fault Marsden or anyone working on this film for having to deal with that circumstance. Marsden pulls it off in the end. Does he do it as well as Walker would have? We may never know, and it's pretty disrespectful to even ask the question, as many reviewers are doing. This film is what it is. <br><br>The end (spoilers ahead) really tripped me up. Yes, it's so cliché that I couldn't believe it for a minute, but this film is about coincidences and fate, so after considering that, it's not fair to judge it based on statistics. This is a realm that crosses from the sordid into the miraculous. But really - and this is something I didn't even notice until after walking out of the theater - what really tested the limits of this genre was that this wasn't a happy ending. It was a bittersweet and somewhat cheesy ending, sure, but it wasn't happy. They don't end up together. The last notes are in a way quite comforting, but unresolved. Maybe some people don't like that, but I sure did. What happens to Amanda's son? Yes, he lives, but how does he feel about his parents' divorce? Did they even divorce? What happens to Aaron? And, by the way, Robby Rasmussen deserves a damned Oscar for playing two characters so well. What about Amanda? We aren't sure if she ever really moves on. What are her regrets? Does she have any regrets left at all, or maybe a whole new set of regrets?<br><br>This film takes some getting used to and some further consideration beyond what's happening on the surface. On the surface, it's just another Romance, but it takes a little more thought. For being so panned for its formulaic nature, this film challenged a lot conventions not only followed by Sparks, but by the whole genre of Romance. It's interesting, to say the very least, and is well worth the watch.","user":"nickharlow2","rank":[47,62]},{"title":"Two movies for the price of one","rating":5,"date":"8 February 2015","review":"... which may not necessarily be a good thing.<br><br>Oddly, you divide the two almost at the midway point, that is, the one hour mark.<br><br>The first movie is a really sweet love story about lost love. It features a lot of flashbacks but luckily the actors playing the flashbacks and the actors playing 'real time' are all very competent, do a great job,the script works well, and the audience has a fun ride.<br><br>If the first hour were a movie on its own, I would give it a very strong rating.<br><br>However almost at the turn of the second hour (two hours BTW is much too long for this story) the connection between audience and viewer (this important factor discussed in many of my IMDb reviews) starts to fade as many story complications set in. And the script becomes lost in the various arcs.<br><br>I will not go into the complications but let me say that by the \"climax\" of the last Act the viewer may wonder if he/she dozed off and woke up in front of the TV watching an episode of JUSTIFIED. Enough said.<br><br>If the second hour were a movie on its own, I would give it a very low rating.<br><br>As an entire movie as it now stands, this film can be a rough ride for the viewer, and that is not a good thing.<br><br>Notes: <br><br>* always happy to see Michelle Monaghan, an actress under-used these days. Real star quality.<br><br>* Liana Liberato has a nice career ahead and better still actually looks like a young Michelle Monaghan, which is more than I can say of the casting choices for the male leads <br><br>* here is a tip for casting directors. FACIAL RECOGNITION SOFTWARE. Help you avoid the problem of casting two actors playing the same role (one in flashback) WHO LOOK NOTHING AT ALL LIKE EACH OTHER","user":"A_Different_Drummer","rank":[28,37]}]