[{"title":"Spellbinding,dark and family secrets galore....","rating":6,"date":"16 February 2016","review":"I only started to watch this for Amy Manson (Being Human),and was not expecting much. This is a cerebral thriller, although some scenes were too sadistic for my taste. The characters are well cast and take \"dysfunctional family\" to a whole new level. I found it a bit confusing once secrets were revealed and may watch it again (granted, I was tired). This is worth your time- don't watch if depressed- it is very dark. Manson exhibits incredible on-screen,smoldering intensity which makes her characters strong and intense. This one is not exception. I love movies with dark secrets and strong female protagonists (despite all she endures, her strength comes through).","user":"wildsparrow16","rank":[41,50]},{"title":"Much Darker Than Expected","rating":6,"date":"22 February 2016","review":"The premise of this sounded very interesting and I watched it back to back with Sand Castles which has a similar premise - and this one falls short of the other in my opinion. <br><br>It was surprisingly darker than anticipated and went in a direction I did not expect. Definitely not for the faint hearted, I feel as if it missed a trick by sacrificing on dramatic realism in exchange for shock factor, and the result is you feel very uneasy watching it rather than suspenseful of the unknown.<br><br>It's visually interesting, with great set design that immediately makes you feel uneasy. It is further enriched with excellent performances from its cast, most notably Amy Mason in the lead, who is sublime.<br><br>Definitely worth watching, it portrays a very dark, suspenseful tale, even if it does feel very disjointed and forced in places. Not the film I expected, which left me more deflated than surprised come the end. Can't help but feel they missed a trick, creating a psychological horror rather than a thriller.","user":"jamieg-38196","rank":[24,29]},{"title":"A taught, well acted chiller that deserves to be more widely seen.","rating":7,"date":"12 April 2016","review":"This movie brings to mind the hey day of early seventies low budget British shockers from the likes of Amicus, Tigon, and Hammer. The days when all you needed to make a film was a spirited cast, a largely unknown bolstered by a single \"name\" performer recognisable to Americans (in this instance James Cosmo), and free access to a down at heel stately home.<br><br>It's hard to classify this movie in terms of genre, neither truly a thriller nor a horror. – it's more of a \"creeper\" than anything else. The sense of unease is ramped up throughout the convoluted twists and turns of the plot before plunging into true horror in the final third.<br><br>I think this has presented a problem for the marketing department and I feel that they may be making a mistake in the way that they are presenting it. Many people will feel mislead and disappointed that this isn't the horror movie that the posters suggest, which is a shame since it's more than that, it's a taught, well acted chiller that deserves to be more widely seen.","user":"mrjaded","rank":[16,21]}]