[{"title":"Exactly what I'd hoped for from Terrence Malick","rating":10,"date":"6 August 2018","review":"I have to echo others who've pointed out that this is not a documentary. It is an abstract feature film, a poem, an epic non-linear meditative piece about the wonder of nature and existence.<br><br>I was almost put off purchasing this by some negative reviews (I missed the theatrical release and could only find a Dutch import available on bluray) but if you are in any way a fan of Terrence Malick you should really appreciate this as much as I did. It reminded me as much if the nature scenes of The Thin Red Line as it did moments of The Tree of Life.<br><br>The narration is subtle, infrequent and not at all irritating as some have suggested. The words are few and far between and serve to bind the images together to deliver a message of wonder, respect, at times despair, but ultimately peace over our place in the world. I know that sounds pretentious but I really did find it profound and inspiring. The images committed to film are also some of the best I've ever seen and it is a privallege to have it captured and to witness it. <br><br>I accept some people will find this film insufferable, but if you have an appreciation for visual spectacle and/or poetry and/or existential thought and meditation then this film is made for you.","user":"urban_mike","rank":[10,11]},{"title":"Bland. Boring. Forgettable.","rating":17,"date":"17 September 2017","review":"Stretching the breathtaking genesis sequence from 'The Tree of Life' to 90 insufferable minutes, Voyage of Time is a total misfire from Terrence Malick.","user":"CinemaClown","rank":[24,35]},{"title":"A pretentious pseudo-philosophical film","rating":19,"date":"19 September 2017","review":"This film is a collage of scenes from astronomy, physical geography, marine biology and anthropology.<br><br>I've watched many Terence Malick's recent films, so I know what to expect. It certainly does contain many visually beautiful scenes, that I would marvel at when I watch the National Geographic or the Discovery Channel. However, I'm not watching these channels. The narration tries to make the film sound deep and profound, but ultimately it isn't. It's a pretentious pseudo-philosophical film.","user":"Gordon-11","rank":[28,44]}]