[{"title":"Bottle Rocket in Hampton Bays ... with Superheroes","rating":8,"date":"21 November 2012","review":"It's a lot like Wes Anderson's Bottle Rocket, only set in the northeast, with down-and-out superheroes and less than super powers. Not-so-superhero Fridge clings to his super identity even though the world has moved beyond him and his ilk. He and fellow traveler C-Thru are temporarily holed-up at a Hampton Bays inn, tasked with nothing less than reviving the fortunes of the underfunded SuperCorp superheroes collective. But Fridge is more concerned with his relationship problems and the charming desk clerk. The whole thing is winningly underplayed and sincere. It could almost work as a modest stage comedy.","user":"matthew-bonness","rank":[14,21]},{"title":"Genuine and original","rating":5,"date":"29 May 2019","review":"I have only one wish regarding this movie. In my opinion, I would have liked a bigger budget for the costumes. But, that is not to say that this movie was anything other than flawless just the way it was. A little humor, a good story and an excellent cast for an intimate tale of identity loss and reclamation. Love lost and found, jealousy, and redemption. In the end, whomever was responsible for this will undoubtedly have a future in film making. Bravo ! Or, as a no longer fat man in an overcoat might say,","user":"whowatchesthewatchmanskids","rank":[3,3]},{"title":"it was okay but a little boring. Not a comedy.","rating":25,"date":"25 May 2014","review":"I think the movie had some interesting ideas, I liked that it dealt with secret identities, it dealt with friendship, and they even had a mystery in the story. I also liked all the actors in this. <br><br>Sadly the problem is that it takes too long to get going. I did not laugh once. I wish this was made as a serious movie and not a comedy because sometimes when it was dragging a lot it was because of the attempts at comedy. Seems like if you tried to take out the \"funny\" parts, the movie would only be half as long. They should have developed the characters more, or explore their back stories more as well, You don't really know anything about these guys. <br><br>They had an interesting concept and some pretty good ideas but that gets lost on the way. I don't understand why it says it is a comedy.","user":"reaseltbim","rank":[6,8]}]