[{"title":"Good","rating":7,"date":"22 February 2020","review":"Pain &amp; Gain honestly has too many flaws to name, but for some reason I think this is a pleasure to watch. It can be extremely funny and entertaining. Especially if you are into fitness than this movie is for you.","user":"MR_Heraclius","rank":[39,42]},{"title":"Cult classic","rating":9,"date":"29 August 2014","review":"Let me start this out by saying I hate Michael Bay. I hate Michael Bay. OK, OK, he's not the worst director in Hollywood. He's got his s**t together, and people are willing to pay him to glue together the worst movie ideas and turn them into a semi-watchable blockbuster. However, Pain &amp; Gain isn't one of these movies.<br><br>\"Wait, how does that make it good?\" You ask? Well, my position is that Bay actually cared about this movie. He pitched this movie for years, even when he was a more struggling director, and nobody would buy it. Eventually, this movie was made on a measly budget of $26 million. Not exactly peanuts, but nowhere near the budget Bay is used to. I believe this encouraged him to put some real thought into it.<br><br>First of all, this is a dark, dark comedy at its core. It's Fargo ramped up to eleven and edited into the pace of a 2-hour-long seat-edging action thriller. The movie manages to go from serious, to gory, to slapstick all in a matter of minutes, and somehow still manages to work. It'll be impossible to keep yourself from cracking out in laughter, even though all of the characters are completely unlikable and self-absorbed. The movie constantly mocks gym jocks, self-help optimism, and class privilege. The acting is superb. All of the cast was well chosen, from Dwayne to Shalhoub and especially Wahlberg. And that shocking fridge horror moment comes with the realization that it all actually happened. Yes, unlike Fargo, that disclaimer at the beginning of the movie is an honest one, and the actual events are even more outrageous than this movie itself.<br><br>Most of the criticism seems to come from this movie being made as humor deriving from a true event, but I don't think it could have been done better any differently. All of the changes made to the events were understandable in order to make it watchable as a movie; Adding extra humor in order to balance the absurdity, merging a few characters into one much larger one, or even actually *toning down* a few parts to make them more believable. There are so many memorable moments that are permanently affixed to my brain, unlike other Bay films which are utterly forgettable. That makes this a cult classic, and easily one of my favorite movies.","user":"Adrian232","rank":[65,82]},{"title":"Flawed but greatly entertaining to watch","rating":7,"date":"17 March 2015","review":"It's nice to see Michael Bay take a little break from explosion-fueled action movies, and do a dark comedy based on events that took place during the fall of 1994 to summer of 1995, in Miami. In this film, Mark Wahlberg, Dwayne Johnson, and Anthony Mackie play a trio of bodybuilders of a Miami fitness center, who kidnap a millionaire named Victor Kershaw, and extort him for money. Their plan is to take his money and his house, and then murder him. While their attempt to obtain his wealth succeeds, their plan of eliminating goes terribly wrong, and unleashes a turbulent chain of events.<br><br>I honestly enjoyed this movie, it was fun to watch at times. However, I can't say I enjoyed every single bit of it. Some parts, such as the kidnapping, were exciting to watch. Then there were other scenes that didn't quite make much sense. I sat through a few scenes where I thought \"what's the point here?\", then the movie would suddenly get exciting again. Aside from this, this movie is very quotable, and had some memorable lines by Mark Wahlberg and Dwayne Johnson. The two showed some good comedic chemistry in many scenes and it made the film more enjoyable.<br><br>Some people may be offended by this film because it's a comedy that takes horrific events that occurred in real life and turns them into comedic situations. However, I kinda like the idea of the film being a comedy. I think the director made this film a comedy because of the characters and their stupidity. Mark Wahlberg plays Daniel Lugo, the owner of the fitness center (Sun Gym) and the leader of the gang who does the kidnapping. Then, Dwayne Johnson, who plays Paul Doyle, a member of the gym, and Anthony Mackie, who plays Adrian Doorbal, a friend of Daniel Lugo. These characters were not very smart and their attempts on kidnapping, stealing, and murder often lead to unwanted results. The characters' stupidity is kinda what made the movie entertaining and somewhat funny.","user":"Screen_Blitz","rank":[16,18]}]