[{"title":"A Look of the Sixties","rating":6,"date":"13 April 2013","review":"Paul Raymond, the Grand Master of 70s pornography and the self proclaimed King of Soho, is the central character in this biopic by Michael Winterbottom, based on Paul Willets book, Men Only - and yet Winterbottom's film is as much about the people around Paul Raymond as it is about the man himself.<br><br>The film begins with Paul Raymond - played here by a superb Steve Coogan - mourning the evident loss of his daughter Debbie, reflecting on his life and relationship with her via an old video recording. Hounded by the media outside his Mayfair penthouse he is a shadow of what he once was, grey, tired, backlit. The film then flashes back to the humble almost-beginnings of Paul Raymond, telling in turn each significant phase of his life and success - from the era of the Raymond Revue Bar and the notorious (but unsurprisingly successful) Pyjama Nights theatre show right through to his later success with the Men Only magazine. <br><br>Winterbottom and his production designers capture beautifully the design aesthetic of the era - the penthouse flat, which Raymond brags was designed for him by Ringo Starr, is particularly noteworthy - and together with the excellently chosen soundtrack and crisp cinematography capture a real sense of the colour and hedonism at the heart of this man's life in the 1960s, 1970s and beyond. In fact the style, design and structure of the film reminded me very much of both Boogie Nights and Goodfellas.<br><br>Coogan is on top form, and while some people many see his performance at Paul Raymond as just a pastiche of Alan Partridge, I for one don't. For in the same way that the well known and well loved radio journalist from Norwich is something of an alter ego for Coogan, the idea of Paul Raymond himself is just an act, a face that the man wears for the public (and often for his private life). From the outset when we discover that his real name is Geoffrey Quinn we see a man who is forever hiding behind something, keen to portray himself as something very different to his real existence. His ignorance of both his legitimate and illegitimate sons; his outwardly normal and happy relationships with women(which both eventually break down); his twisting of words and meaning to justify his business - here is a man who spends his life stripping away the veneer of respectability in public life with exhibitions of voyeurism and pornography and yet one who keeps his own very private and personal existence hidden from view, the only seemingly genuine emotion and touching moment when he watches old video footage of his daughter. Despite the hordes of women, despite the money, despite the power Paul Raymond never seems genuinely happy. Everything is a mask for a hollowness that is only filled ultimately by the presence of his daughter.<br><br>Imogen Poots pushes to the fore as Raymond's wayward daughter Debbie. The film is as much about the destructive life she leads than that of her father - in fact you could see her downfall as paying the price for his father's sins. Encouraged into areas where she had no talent (Imogen Poots off-key singing was at the same time humorous and tragic) and tempted by the drugs and easy-to-sleazy lifestyle around her father it is inevitable that it would be she who's fragility and delicacy is torn apart. The only character for whom Paul Raymond feels any lasting emotion is the one character he drives to the edge of destruction, ultimately watching as she crashes and burns over the edge. <br><br>The actress plays the part masterfully and I choose the words \"fragility\" and \"delicacy\" quite deliberately - she manages to never loose that school girl naivety and innocence, even when playing Debbie at a much older age. It's quite an affecting turn from Imogen Poots, who's talent and beauty will surely mark her out as a very big star in the future.<br><br>Other cast members are also effective - Chris Addison as the somewhat slimy Tony Power; Anna Friel as Raymond's first wife Jean; Tamsin Egerton as the club dancer with whom he runs off. There are also a series of cameo performances from familiar faces that give this film a genuinely British feel, of the like normally associated with older, classic British movies. Perhaps it's the accompanying soundtrack and design styles in play but this feels like The Italian Job, or Alfie; or Blow-Up. Simon Dee wouldn't look out of place driving off in his sports car with a blonde in the passenger seat (in fact there is something of a homage to the credits of his 1960s TV show Dee Time in the film).<br><br>I was fortunate enough to see this at an advance screening of the film at the Bradford International Film Festival, where the screenwriter Matthew Greenhalgh fielded questions from the audience. Challenged about the sexual politics of both the film and pornography in general Greenhalgh seemed somewhat overwhelmed.<br><br>But this isn't a film about feminism, or the rights and wrongs of pornography and its politics. The film-makers are showing us a classical tale of rise and fall, and of how even someone who essentially uses people for the pleasures of others can still have the redeeming feature of love, even if he doesn't realise it until it is far too late. This film is not just about Paul Raymond's life and career but also about his relationship with his daughter and how she was ultimately sacrificed to the lifestyle he chose. I'm sure there is a film about the politics of pornography in this story but to have entertained us with it wouldn't have been half as interesting - or successful as I feel this film ultimately is.","user":"jonrosling","rank":[17,20]},{"title":"An interesting look into the life of someone I knew nothing about","rating":9,"date":"29 April 2013","review":"I didn't know what to expect from The Look of Love. I like Steve Coogan so gave it a shot. In my opinion it's well worth a watch. <br><br>The film is a biopic about Paul Raymond played fantastically by Steve Coogan. For those unfamiliar, like I was before seeing TLOL, Paul Raymond was an entrepreneur who owned a lot of property and strip clubs in London and was at one point Britain's richest man. It's amazing how such a rich guy can go so unheard of, with people my age anyway, yet have such a big empire in London just years ago. S'pose they're not going to teach you about the strip clubs and nudey plays in second year history at school. It made for some really interesting watching.<br><br>And not because of the more or less constant boobs in case that's where your mind immediately went there. There is admittedly more graphic nudity in this film than I've ever seen in a film ever but because there is so much of it you kind of get used to it. The novelty of 'tee hee, boobies' fades away pretty quick to make way for a pretty fascinating life story.<br><br>My journalism lecturer always said there's nothing more interesting than writing about a famous person 'on the slide' out of fame and power and there's certainly a lot of 'sliding'here. He lives such an extravagant lifestyle with the drugs and ever changing woman you know it'll all catch up with him some day. The whole second half that looks at the unusual relationship between him and his spoilt daughter is pretty captivating. To give you a taste of what their relationship is like, there's a scene where Paul catches his daughter snorting coke. Instead of telling her off and getting angry he insists she mustn't just buy her drugs off the street and to only do the very best. It's a look into a life of excess and irresponsibility which makes for an intriguing watch.<br><br>There are a lot of British actors , mostly comedians, in the film.There's actually so many big British names it's almost distracting. There's Coogan obviously who naturally steals the show. But then there's cameos from Stephen Fry, Simon Bird, David Walliams, Matt Lucas, Dara O'Briain - the list goes on. All do a good job, even if some are only in it for a matter of seconds, but celebrities like Dara O'Briain don't really come across as fully fledged characters. It just takes you out the film for a few seconds and makes your brain announce 'oh look, it's him from Mock The Week'.<br><br>I don't like to talk about cinematography too much as I'm a complete novice but I could tell it's good here. Parts where they talk about Paul Raymond's men-only magazine feel like you're actually flicking through a 70s style dirty mag. The fashion of the time is very prominent with bright zig-zagging colours in his clubs and houses sucking you into the era nicely.<br><br>It might not be for everyone is a possible problem- 3 people walked out of our screen halfway through due to what I assume was it's increasing amount of graphic porn scenes. Similarly big action, life changing drama fans may feel a little underwhelmed. If you show a bit of interest and follow the relationship between Raymond and his daughter however you'll find this film to be a surprising little gem.","user":"chrismartin181-1","rank":[30,42]},{"title":"Fun filed and charming","rating":30,"date":"30 April 2013","review":"Charming, witty, intelligent. Had to have it all, but at what cost?<br><br>One is almost tempted to pronounce Paul Raymond's story as predictable. Rags to riches story, got corrupted and suffered the consequences. Yet there is something different about Paul Raymond, who came to London from Liverpool with nothing and reached the very top. <br><br>By different I don't mean just the fact that he was probably the first entrepreneur to acquire wealth almost exclusively from the \"adult entertainment\" industry but he founded it since his peak coincided with the beginning of secularisation of Britain and he introduced a very daring sort of entertainment in a highly puritanical society. Being spirited as he were, neither the criticisms or the bad press affected his stamina; he just marched on conquering bigger heights.<br><br>With the above in mind, it does not become too challenging to picture an audacious, notorious individual. Or so Steve Cogan aimed to have us believe. I could not envisage an actor better suited for the part. Ultra cool and a charmer, Steve Coogan was Paul Raymond. Mr Raymond was apparently so charming that his shared his extramarital bravados with his wife and for the 1950's (or so) this is spectacular.<br><br>The movie places us inside his life and we follow his ups and downs, although we soon become aware that he is a man in mourning. Perhaps a side effect of the poverty he came from, his no limits lifestyle and the way he indulged it to his beloved daughter obviously must have played a part.<br><br>It might go down as just another bio of a sale made man, but this film had an added dose of personality that undoubtedly mirrored its central character and the flamboyance he exhumed.<br><br>One of the better recent British films.","user":"cinematic_aficionado","rank":[16,22]}]