[{"title":"The 'Cliff Notes' version of a great book","rating":5,"date":"3 April 2012","review":"Scott Turow is an amazing writer because of his ability to give full, rich, textured lives to most of the characters in a book. In his fictional world of Kindle county, even the peripheral figures have great,textured back-stories. He has great insight into human nature. It's too bad that you can see almost none of this in the TV movie version of Innocent.<br><br>I watched this movie shortly after reading the book. The book was fascinating and absorbing. While the movie was competently made, it lacked most of the detail that makes Turow's books so rich and interesting. The recorded version of the book is 14 hours long, and none of that time was wasted or boring. The movie was probably less than 90 minutes, if you take out the commercial breaks. There was no way for them to compress so much character development and plot into such a small space. And in my opinion, it was wrong to try.<br><br>Unfortunately, though the movie isn't awful, I can't think of any reason to recommend it. There are some good performances, but the script is just too skeletal to do justice to this story. <br><br>I hope that the next time Scott Turow gets an movie offer on one of his great books, that he holds out for a miniseries instead.","user":"susenet","rank":[6,6]},{"title":"A competent and enjoyable courtroom drama but nothing more","rating":5,"date":"13 January 2013","review":"This is an efficient movie with some neat twists and turns in the solving of a crime. It is largely inoffensive because it is constructed to the well worn formula of finger pointing to a murderer and then seeing just how many things can change your mind before the credits roll.<br><br>The acting is reasonable but not sensational with the victim, Barbara (Marcia Gay Harden), being the best at everything in the back story played out throughout the film. Nothing sticks out as faulty, but it is not especially memorable either.<br><br>If you like courtrooms and enjoy trying to work crimes out then it is worth a rental.","user":"perkypops","rank":[2,2]},{"title":"Not Proved","rating":6,"date":"1 December 2011","review":"This made-for-TV version of the Scott Turow novel is a competently made but not particularly inspiring translation to the small screen. With Bill Pullman and Alfred Molina in two of the leading roles, the acting is fine, but for some reason there seem to be a lot of English-as-a-second-language characters. Molina and the woman who portrays the judge play them with accents.<br><br>One of the issues of courtroom dramas on screen is that they take place in a small space and there isn't much real movement going on. Typically, this is covered by an active camera, and that happens here, with short editing cuts and a camera that moves. Injudiciously applied, it becomes frantic, even hysterical, and that happens occasionally here.<br><br>Even so, the central story is a solid one. If you have any taste for this genre, it's a couple of hours well spent.","user":"boblipton","rank":[8,14]}]