[{"title":"If all you saw in this movie was sex, I pity you.","rating":10,"date":"10 April 2017","review":"So many people wrote how \"disturbed\" they were by \"this shitty sex movie\". I divide them into two groups: <br><br>1. First group decided to watch the film because they love sex, porn, and the title \"Nymphomaniac\" sure sounds like their kind of thing. Then they went to cinema (or Internet), watched it, and were disappointed because \"they had to listen to a lot of boring dialogues before there was a sex scene\" (to which they could masturbate to if they were alone). Then when a sex scene would finally come, it wasn't as exciting as it \"should have been\". So they were disturbed at how much this movie didn't fulfill their expectations. <br><br>And they are right, it didn't. Because it's not a shitty, cheap movie, meant to get them turned on. As unbelievable as it sounds to them, the purpose of both the film and the sex scenes go much deeper. And if only they had bothered to pay a little more attention to the \"boring dialogue\", perhaps they would have noticed that the meaning of the movie - and the real story - goes on in that conversation. And the sex scenes were not as sexy as they \"should have been\", according to them, because it's not about turning people on. It's a film for you brain, not your genitals. And that is precisely why people from the group one were disappointed. Good.<br><br>2. The second group are the people who were \"disturbed\" because there were too many explicit sex scenes. I have nothing to say about this except: Are you serious??? Have you looked up the definition of the word \"nymphomaniac\" before you decided to watch it? And again, they missed the purpose because for some reason unknown to me, they were too focused on the \"filthy\" sex scenes in the film named ~Nymphomaniac~ that they missed to actually watch it. <br><br>The point is: If you focus on the ~sex~, you won't like this movie, nor get it. Therefore, if you want a cheap turn on, just go watch porn, and let artists like Lars take sex to a different level, a little above the primitive urge. <br><br>Because the reason Joe was \"a horny bitch\" is a little different than yours.","user":"locasuscelli","rank":[177,269]},{"title":"The Work of a Genius !","rating":1,"date":"28 March 2014","review":"You will, I sincerely hope, not be offended if I were to speculate that you were enticed into inquiring into this movie and, for that matter, even reading this very review, because of the movie's title, yes? And the title obviously reflects on the movie's content which is focused on the reproductive arts. And, I shall further speculate that were the movie instead titled, say, \"Existentialism\" or such, and the story concerned a group of nuns who begin to question their faith, you wouldn't be reading this at all, would you?<br><br>Of course you know that von Trier is a celebrated director, but you didn't quite get around to seeing his masterpiece Dogville, did you? Nor, I suspect, have you seen his quirky 2007 cinema, The Boss of It All. In fact, the only reason you are even remotely interested in \"Nymphomaniac\" is that it depicts venery in an explicit manner. Confess! It's all true, isn't it?<br><br>Wait! Keep reading! Don't go away! It's OK! I know you're not like that, because you have standards. You would never watch or read porn. That's so . . . so . . . so &gt;degrading&lt; and low-class. But since you're a mature adult, very open minded and not bound by the strictures of organized religion, you have no objection to serious cinema with erotic content, do you? I mean, as long as it's tastefully done?<br><br>I'm here to assure you that \"Nymphomaniac\" is &gt;not&lt; pornography, because none of the actresses (or actors, mustn't be sexist here) have had any breast augmentation, nor do they wear cosmetics in the manner of slatternly women. For that matter, rest secure in the knowledge that absolutely nothing arousing occurs during any of the movie. No pleasure whatsoever, so it's safe. Your dog could watch it and not begin to look at you funny.<br><br>That's why von Trier is, without question, an absolute genius. Sex is one of the few natural pleasures we enjoy here in this vale of tears, and just as the finest minds of industry have ruined the joys of victualry and turned the simple act of eating into a problem, the brilliance of of von Trier is that he has ruined sex. \"Joe,\" the protagonist of the movie, has sex frequently, but she doesn't enjoy it at all, and von Trier does his best to make certain that you don't either. <br><br>If you think about it, that's not such an easy feat. Suppose that you were given a camera, a crew and a group of attractive actors who don't mind nudity and simulating sex acts and were told to make a movie depicting venery, it would be difficult for you to make something completely unpleasant to watch. But von Trier has accomplished something you could never do: in this movie, no one has any pleasure. ex is presented as something perverse and unpleasant. \"Joe\" only engages in it because she's emotionally disturbed, or because her domineering girlfriend made her do it, or because of some Freudian mumbo- jumbo, and she obviously dislikes each experience, starting with the first brief penetration that hurts her. <br><br>&gt;SPOILER ALERT!&lt; Don't fall for the brief scenes near the end, of her actually enjoying her three lovers. Those are fantasies she tells in response to having Bach played for her. The music of J. S. Bach is the sublime representation of empyreal purity, and Bach fathered twenty children, so it's good, clean, church-sanctioned, procreative sex, not the naughty fun kind. (Ooo, look! He's bathing her! How lovely! How clean! How innocuous! What movie is this?) But as soon as the music stops, she announces, while in union, \"I feel nothing.\" <br><br>The hypothetical sex movie you would write and direct would be unlikely to have acting that is as bland, tedious and affectless as the acting in \"Nymphomaniac,\" but that's the way Lars von Trier wants it, because viewing good acting would be a pleasure to watch, and he wants to drain anything enjoyable out. I can imagine him shouting direction, \"No! No! Make it even more lifeless! More monotonous!\" <br><br>An obvious exception to this is the salient performance by Uma Thurman, but in that scene, the fine actress is introduced for the sole purpose of making a deliberately unpleasant situation even more disturbing. It goes on for an excruciatingly long time, because von Trier wants to rub your nose in the message: sex ruins lives and makes people miserable. The scene is comedic, but only in the way slapstick is.<br><br>Von Trier is not the first director to make a movie depicting sex as repulsive. The late Ken Russell also wrote and directed movies with that effect. Like this movie, Russell's movies were also promoted by ads and posters featuring an enticing shot of a woman in ecstasy, but that was just to lure you in. The movie itself taught you a lesson of rue. It is, after all, the glorious puritanical heritage of those of us of Northern European descent. We're not like those filthy people down there in the tropical climes, going at it like they was rabbits. Shame, shame, double shame on their gratification and pleasure! No wonder God punishes them!<br><br>All the enthusiastic reviews here are written under the pretense that there is some profound message embedded in this movie (especially the bedpan scene). The profound message is that sex must be presented strictly in terms of social isolation and as a manifestation of emotional disturbance. \"Joe,\" represents all the repressed feelings of guilt and shame metastasizing deep within you. After all, if sex were depicted in a uniformly joyous light, you'd have to go to some sleazy site where they'd rip-off your credit card information.","user":"rondo898","rank":[291,501]},{"title":"Wondering if you should watch this film?","rating":1,"date":"18 March 2014","review":"Don't. Your time is far too valuable.<br><br>This film features unsimulated sex of pornographic actors digitally edited onto the parts of the real actors. So if you're looking for smut, you should instead watch a production from the \"Silicone Valley\" (or wherever it is the porn industry heads out of now). At least you won't have to labor through pretentious dialogue just to see some real action. It gets painful--the dialogue. There's a part in the movie where Skarsgard's character tries to rationalize the protagonist's nymphomania via the Fibonacci sequence. It really doesn't add anything meaningful to the plot, it's just von Trier trying to convince you that he went to college. No, I'm only half kidding. Read the spoiler.<br><br>*SPOILER* Assuming you don't heed my warning, and still decide to waste your time watching this film, then I won't won't give away too much, but Skarsgard's dialogue is supposed to build you up so you can be shocked by the, like, totally ironic ending of Vol. II...As if you couldn't see that coming, or as if you'll even care at that point. Just be glad it's over so you can go back to watching real porn ;) *END OF SPOILER*<br><br>And if you're looking for a film that debases contemporaries and challenges social taboos, well...I guess you can say this film does that, or at least attempts to. It's all pretty shallow, though, and really comes off as an excuse to feature unsimulated sex in a movie full of renowned actors. I would not feel so strongly about this if the actors' performances weren't so laughable. I might have even forgiven von Trier if the characters were redeeming or at least believable. For start, LaBeouf's character speaks with an accent not of this world. And Slater's performance as the aged father is comparable to a parody straight out of SNL. Without giving away spoilers, I'll just say I couldn't find one character I could sympathize/empathize with, because they were either too dull, too deplorable, or too comical.<br><br>Want to see a real art film? Un Chien Andalou, because this isn't art. And from a contemporary film's standpoint, there's really nothing to justify the extremes it has to reach in order to tell its story.<br><br>Don't do it. Or do it, I don't care. I did my good deed for the day.","user":"Anon_A_Mouse","rank":[317,549]}]