[{"title":"Predictable","rating":3,"date":"30 January 2013","review":"I started watching this with high expectations. However it became very clear that the lead character (Detective Hatcher)was pretty arrogant, unlikeable and was a law unto himself. I actually wanted to like the film as I had a cold and wanted to watch something good.<br><br>The premise was good - judges wife shooting an intruder - was it a simple burglary or something more sinister. But too much time was given to the lead characters, particularly Hatcher, and the judge's wife. Little time was used to develop the other characters especially the villains. So much so that I started to route for the bad guys.<br><br>When Hatcher started acting like the normal run of the mill rouge cop that always knows better, especially irritating because he was decorated which would suggest that he played by the rules. It then got pretty ridiculous with a phantom death and a sting that, you may not have seen coming, but knew it was heading in that direction. I especially thought the climax where Hatcher slept with the victim and then how he extracted confessions - by shooting at the ground around the villain and then holding a gun to his head saying he was going to kill him, was completely unbelievable and way over the top. Such confessions would be completely thrown out by any decent judge and sleeping with a victim/witness and conspiring with the victim to 'entrap' the villains would not be allowed. What I can't understand is that while Hatcher kept everything from his partner all the way through the movie, his partner followed his instructions without question at the end to entrap the villains.<br><br>I thought the two leads were miscast and Hatcher acted like an arrogant top dog rather than a detective sergeant whereas the lead lady was very wooden The judge and the main baddie were actually better actors. The judge actually showed come passion and I could believe a little more in that character. 3 out of 10 although I think that is high.","user":"lloyd150","rank":[7,8]},{"title":"More Romance than Thriller","rating":1,"date":"1 December 2011","review":"Ricochet, an adaptation of Sandra Brown's best selling novel of the same name, is part of TNT's new venture - creating made for TV original, crime movies. I have not read the book nor had I heard anything about it prior to watching therefore making this review truly just about the movie since I went into it blind with no expectations or knowledge of the plot.<br><br>The beginning of Ricochet is promising and not only held my attention but drew me right into the mystery. In the middle of the night, a judge's wife, played by Julie Benz, is in the kitchen of her home and hears a noise coming from inside the house. She grabs a gun stashed in a cabinet and walks towards the sound only to open a door, say 'Who the hell are you?' followed by gunshots. The police - more specifically partners Det. Hatcher (John Corbett) &amp; Det. Bowen (Kelly Overton) arrive on the scene and find a man dead on the premises who appears to have been caught in the act of a home invasion/looking through property &amp; was shot in self defense by the judge's wife, Elise Laird or so she says. The police immediately question Elise about the incident with her husband, Judge Laird, played by Gary Cole, by her side who was home at the time but upstairs.<br><br>Elise ends up contacting Det. Hatcher privately and proclaims that the dead man was sent to kill her by her husband but when asked what his motive would be, she is secretive and doesn't feel like she can tell him until she truly trusts him. Was the shooting self defense as she claims? Did the judge really hire someone to kill his wife? If so, why? Is Elise a cold blooded murderer? What does a local mobster named Savage have to do with everything? The movie presents a solid mystery as far as what is actually going on and why. I don't feel like the full truth surrounding what really happened was predictable or easily guessed from the start of the film.<br><br>However, what I did find predictable as well as very cheesy was any and all interaction between Det. Hatcher and Elise Laird. I found that I knew the camera shots the film would use as well as the looks they'd give one another before they even happened as the movie set up a romance between the cop and the female at the forefront of his investigation as he was anything but professional. Their scenes together were far from original or entertaining &amp; I always seemed to know what would occur between them before it did. There is one scene where he comes home, turns on the lights and she had been sitting in the dark waiting for him - I saw that coming a mile away and I'm almost certain it was supposed to be a big twist/reveal for the audience only I never bought the lie the movie was trying to sell anyway so it wasn't. At times this felt more like a boy + girl 'steamy' drama than a true crime thriller namely in the 2nd hour where a full 15-20 minutes is actually dedicated to the two alone getting to know each other. That portion almost took me right out of the movie. <br><br>I also found Det. Hatcher to be extremely unlikable. He wasn't as charming or as funny as he seemed to think he was and thought his antics of keeping secrets and lying to his partner, Det. Bowen really frustrating. He'd be deceptive, get caught, act sorry and then 5 minutes later keep new information from her and while I understand that he was protective of Elise because of their 'special connection' I found his actions annoying. I don't know if this is a recurring character in Sandra Brown books or not but if he is, I personally would never read one with him in it.<br><br>Acting wise this film is not the strongest. Julie Benz was above and away the best here - I felt that she nailed the mysterious, sexy, secret holding, femme fatal character of Elise Laird perfectly but everyone else around her turned in mediocre performances with John Corbett bringing up the rear. In my opinion, he over acted a lot with poor line delivery which is odd since usually I think he's perfectly fine. <br><br>If you like mysteries with romance thrown in then you will probably thoroughly enjoy Ricochet because a gritty, crime thriller this is not. Had this adaptation run on Lifetime instead, I don't think anyone would have questioned it, it would have fit right in although I do feel like the actual mystery in Ricochet was a bit better than you usually see in original Lifetime films.<br><br>5/10 Solid watch. Started out very promising but the unoriginal male cop falls for the beautiful female he's investigating routine really downgraded the film once that dynamic got underway.","user":"PhantomAgony","rank":[11,14]},{"title":"Disaster!!!","rating":1,"date":"31 January 2013","review":"I normally hate any review I ever see with a score of 1/10, No film is that bad, BUT this is so bad its a disaster. The Lead character (Hatcher) is terrible! All over the place, with some of the worst acting you are likely to see. A chubby guy acting half tough bad man, half lady love machine. Just so bad!! And don't start with his partner. Even worse. The Film is the sort of CSI feel you see on TV every night. The way two detectives hound and disrespect a judge is ridiculous. The story is also way off anything nearly believable. By all means watch this 89 minute Cop flick but it is a howler and I m pretty sure you will agree.","user":"jshee76","rank":[9,11]}]