[{"title":"Uplifting Brazilian Film of slums, corruption and friendship","rating":7,"date":"25 July 2015","review":"Set in the rubbish tips of Rio, two friends – Raphael and Gardo- discover a wallet that has ended up in the trash. They know it is a windfall but then the cops turn up offering a large reward and Raphael thinks there is more to this than meets the eye. So they enlist the help of a diseased sewer kid called Rato and go off to discover its secrets.<br><br>There is a lot packed into this extremely well made film. Martin Sheen appears as a Priest who is helping the poor and Rooney Mara brings some glamour amidst the rubbish of the slum. There is violence here too and some scenes that should not be in a film that describes itself as a comedy. But that said this has a bit of everything. The young boys carry the story and are all excellent – the cinematography is rather special too especially making the flotsam and detritus floating on a polluted river seem almost beautiful. It is a bit overly sentimental but no where near as much as say 'Slumdog Millionaire', and it is totally forgivable once taken in context.<br><br>I did though really enjoy this film, it is in Portuguese with a fair amount of English and it runs to 114 minutes – all of which is put to great use. I also saw someone in the credits called 'Wellington Pingo' which is the best name ever - probably. This is for those who like a bit of grit, dirt, strong storyline and a rollicking ride – completely recommended.","user":"t-dooley-69-386916","rank":[13,14]},{"title":"It's a nine!","rating":9,"date":"5 March 2015","review":"I'm Portuguese and i speak reasonably well English. So i was able to watch this movie with no subtitles. Thanks God! The subtitling was awful, translating Portuguese to English. How can i resume this movie? Tropa de Elite meets Da Vinci Code? Weird no? No, nothing like that. This is an amazing picture of poverty, hope, friendship and trying to do the right thing, no matter what. It's hard to me to explain why i loved this movie. But i have no trouble to explain the main message: Brazil is a corrupt and dangerous country, not because of the common thieves, of the poor people, but because of the corrupt police and the rich and powerful people. A poor thief could steal a couple of bucks, a rich one could steal millions.","user":"ricardo-pinheiro","rank":[34,42]},{"title":"You'll find yourself talking out loud in the cinema","rating":10,"date":"2 February 2015","review":"A brilliantly exciting film from start to finish. The three boys are a triumph, and the way the film handles them, and uses their emotional closeness, their friendship, is a credit to Director Stephen Daldry and his crew, as well as to the three boys themselves, recruited from the streets of Brazil. The story jumps from one level of excitement to the next in a series of clever set pieces that, at the same time as they increase the tension to almost unbearable levels, answer the questions raised by the mystery; what exactly is the significance of what the boys find, as they comb through the giant mountains of trash, trying to earn enough to eat from recycling plastic and tin? The chase scenes through the favelas are exhilarating. Literally, you find yourself talking out loud. The film is a celebration of Andy Mulligan's stunning novel of the same name.","user":"sam-228-602271","rank":[28,37]}]