[{"title":"Good for who just watch movie for fun, not good for those who analyze movies","rating":8,"date":"13 October 2014","review":"I have just spent 2 hour on buses and 1 hour on foot to a cinema to watch this movie, and it totally worth it.<br><br>It is fun and I love it.<br><br>I admit that there are something in the movie that is not logical or not realistic, but it can still be called a good comedy as long as you do not take all the things so seriously. <br><br>Someone also mentioned that they are attracted by the trailer and are disappointed after watching it. What I shall say is that trailer does not exaggerate the fun point of the movie, I saw more fun spots in the movie which didn't shown in the trailer.<br><br>If you just want to have fun, it is a good choice, but if you want a very logical/classic/perfect story, do not try this one.","user":"user-132-973672","rank":[106,137]},{"title":"Let's Be Cops is that stupid cop movie that most critics aren't gonna like, but I did","rating":7,"date":"24 September 2014","review":"Everyone has played cops and robbers at some point. This is the most basic of imagination games a child could play not matter what part of the world or even time period they came from. It about the thrill of chasing the bad guy or being the bad guy and trying to evade the good guys. You could stage a robbery or stop a kidnapping, but this is something I could easily believe every one has done. But like most growing people, these games end as adults decide to start playing with something that truly interests them and make a career out of it.<br><br>But sometimes the cops and robbers game is fun enough that the adult wants this to become their life. They'll ask for information on what the next step is to becoming a real life officer. Either they'll be scared away from the complicated paperwork and academy, denied because of something they have or done, or they possess the will to go through with it and make it a career. But you occasionally hear about those bad apples that think its funny to impersonate an officer. Like the characters in Let's Be Cops, their most likely stupid and don't think about the consequences on the people they fool.<br><br>Justin (played by Damon Wayans, Jr.) and Ryan (played by Jake Johnson) are two best friends that have lived in Los Angeles hoping that their lives here would be better then in Ohio. This is not the case as Justin is a video game designer whose more of an assistant then a creative mind and Ryan is a bum friend whose football days are long behind him and living off of a commercial payday that has kept him stable. They head out to a college reunion as cops thinking it's a costume party. Not only is it a masquerade party instead, but they have a hard time fitting in with their more successful classmates.<br><br>Just as they decide they might go back to Ohio, they discover something on the city streets; people are giving them double takes, the tallest of men start to slouch and the hottest of women give them smiles. The two quickly realize that people think that their cops. Ryan wants to play around with this more, now getting the respect that he's wanted after college, though Justin is more of a weak coward whose more concerned with going to prison. The two eventually get good enough to deceive the L.A.P.D. and start doing detective work for a Russian mafia.<br><br>Every summer there's a movie that I'm gonna find is a surprise that I didn't expect; Let's Be Cops is the surprise. It was a movie I remember laughing at even though a lot of the gags were stupid, reminding me of something like Surf Ninjas. ButI kind of like Surf Ninjas. So why am I forgiving here and not of something like Teenage Mutant Ninja Turtles that was full of dumb jokes?<br><br>First of all, the jokes feel like timeless jokes, as to say that they didn't rely on modern day or pop culture things that could be dated in a few years. Second, the characters are likable. Both Justin and Ryan feel like those recent college buddies that still need to find better interests, but they put so much passion in what their doing that you really want to see where they go with this. Third, I feel like that the movie is in on the whole joke of cop clichès and that most of the jokes, especially the jokes that aren't funny, are intentional.<br><br>I'll give this seven fake police badges out of ten. Let's Be Cops is that comedy that will become a hit on television through repeated viewings at midnight with teenagers and college students. I can't say it's for everyone, but this is something you need to turn off your logical brain to enjoy.","user":"RforFilm","rank":[77,107]},{"title":"Very very funny","rating":8,"date":"21 September 2014","review":"Let me just start by saying that this isn't an over the top blockbuster film like everyone seems to expect from every movie that comes out now. For some reason people have these attitudes towards movies that aren't packed with insane plot holes and story details wrapped up in a cgi blanket to attempt to blow your mind. This movie is really a funny movie, no matter what anyone says. My girlfriend was having a bad day and I was low on energy to try to entertain so we went to see this for a few laughs. It didn't disappoint. I didn't go in with high hopes that there would be any real reason to like it very much but it came around within the first few minutes of the movie. We both left feeling better and like it was worth it, (and I am an adult so the 'teenager type jokes' that one reviewer referred to are unfounded). Jake Johnson really sells the image of a guy just looking for any kind of change in his life and Damon Wayans Jr. is and actor that really puts a lot of work into whatever role he is in. I don't want to ruin any of the movie with bits and pieces that I enjoyed more than the others so I am leaving you with this. If you have a desire to get enjoyment from a film without becoming emotionally invested in a story that lasts 3 movies or longer with hints and clues popping up all over the place eluding to a next installment of whatever series, (and enjoy comedy of all types) then I would recommend this highly. Not artistic, not over done, not offensive to the degree some say, just straight up good comedy. Waaay better than the terrible Seth Rogen movie \"the Neighbors\". Hope this helps.","user":"blueovation","rank":[61,97]}]