[{"title":"Great film with an exceptionally positive message","rating":7,"date":"3 June 2012","review":"The film Hardflip is packed with skating, an awesome and talented cast, and great music, but what really makes this film incredible is the message it carries, to let go of Fear and Pain while embracing Forgiveness and Faith. This film has the ability to resonate with many teens and Parents alike by focusing on issues that many deal with in our society. Randy Wayne, John Schneider, Rosanna Arquette, and Christopher Michael do an amazing job in this film along with featured pro-skaters Christian Hosoi and Brian Sumner. If you enjoy a film that will lift your spirits high than this film is one for your Blu-ray/DVD collection.","user":"chris-zappia","rank":[14,33]},{"title":"Great film for everyone!!","rating":10,"date":"21 June 2012","review":"Amazing film for everyone. Great for those looking for cool tricks and undeniable action. Makes you think and feel at the same time as you see the damage of estranged relationships and the power of rebuilding them through forgiveness and what can be accomplished. The viewer is taken on a journey of real life circumstances and how they can turn your world upside down. The strongest way to open a heavy, shut door, is through an open heart of forgiveness - moving forward to all the possibilities life has to offer. The skate scenes are electric and leaves you saying, \"I want to try that!\" and with faith, hard work and dedication, YOU CAN! Believing in yourself and the forgiveness of others is a life-changing lesson that all can benefit from.","user":"mrs_gib","rank":[11,29]},{"title":"It was OK, but not great","rating":7,"date":"1 March 2015","review":"This was an OK movie. It wasn't great, it was...OK.<br><br>The cinematography was pretty good, but it could've been more.<br><br>The acting was OK too, though Caleb is one angry looking dude- for the whole movie! He's a young guy with a good future ahead of him I think though.<br><br>The story was a common one- a broken family goes through a hardship which brings estranged members together again. Not original, but it worked for this movie.<br><br>The one aspect that may or may not appeal to viewers though is the Christian (or religious) message within. Early on you get an idea where the storyline is going. Towards the end, it's in your face a bit, but not offensive.<br><br>That is probably the one aspect that will not win over many people- you either are already a Chrisitian, or you are open to the message, or you can just ignore it and watch the movie, or it'll be a deal breaker and you'll hate the whole thing because of it.<br><br>For me, it didn't bother me, but I'm sure for others it may....","user":"haphazard72","rank":[1,2]}]