[{"title":"More of the same.","rating":3,"date":"3 January 2013","review":"(Minor spoilers follow.) To me, Vincent D'Onfrio's character symbolizes everything that is wrong with this movie. The character is pure evil, but is presented without any context. What filled him with so much hatred? How did he gain such a powerful position? There's no context to him at all. He's a strictly one-dimensional bad guy. (I should add that Mr. D'Onofrio's acting is fine, but the script gives him nothing to do except be despicable.) On the other side of the equation we have a heroic firefighter who witnesses a horrific, senseless crime, yet lives to tell about it. So of course, he becomes a target himself.<br><br>Do I really need to say any more? You've seen lots of movies like this already. You know how it's going to end. When the script calls for him to tell his U.S. marshal girlfriend one quick sentence about firefighting, you know perfectly well that he'll say that line again, during a fire, before the end of the movie. You even know which bad guy will die last when the hero faces the insurmountable odds of ... oh, why bother explaining? You've seen it all before. There's no reason to see it again.","user":"newleaf","rank":[23,27]},{"title":"I've seen worse films with big stars in straight-to-video actioners. Formulaic and predictable, but watchable.","rating":5,"date":"20 November 2012","review":"Similar recent action flicks with decent actors that were worse:The River Murders(3/10), Set-up(3/10), Takers(4.5/10), and Elephant White(4/10).<br><br>Donofrio is actually really solid as the villain here.<br><br>The story is very straight forward, but the brutality of some of the violence is quite nice. They really earned the \"R\" rating here, and that's always a nice thing when it comes to films like this. After all, there's nothing worse than the clean PG-13 version of these types of films.<br><br>I thought some of the power struggles between the villain and the cops came off pretty well. We get the sense that the villain here is practically untouchable, and that aspect of the film has a realistic edge.<br><br>The films has it's issues though. The lead character is poorly developed and a budding romance is glossed over like a 2 minute cliff-note.<br><br>This is borderline 5-6 for me, but I'm sticking with 53/100! That doesn't round up to 6; 6 really would be generous.<br><br>I was blown away by how many big supporting faces were in this film. Somebody dished out quite a lot of money on this cast. Too bad the script squanders the cast with suspect writing and a mail-list of decent actors that have one line in the film.<br><br>I actually felt like I got my money's worth here, but I only spent .50 for the 3rd choice out of the redbox.<br><br>Considering the excellent cast - it's a bit of a disappointment. BUT, considering the straight-to-video action write-off nature of the release - it wasn't half-bad. It was only 44% bad:)<br><br>You might like this if you liked:Death Sentence(about even, I thought Death Sentence was severely over-rated, 5/10), Set-Up(much worse), Elephant White(worse), Law Abiding Citizen(about even)or The Last Lullaby(better).","user":"witster18","rank":[48,62]},{"title":"Dull, predictable, cheesy. Leave it to burn.","rating":2,"date":"14 March 2013","review":"There are so many places we could go with puns on a title like Fire With Fire. But don't bother.<br><br>I attempted to erase the memory of the dull Broken City with this, but instead succeeded only in killing an entire evening. And when I got home, my wife had eaten the final slice of my simnel cake. Some nights are like that.<br><br>Fire With Fire opens with a cringeworthy scene that sets the expectation depressingly low. We are left in no uncertain terms that the film will be overacted from the outset, that it is scripted for morons, filled with pantomime villains and cheesier than my nephew's feet. Like Broken City, the screenplay is by a man (on this occasion Tom O'Connor) who has absolutely nothing else to his credit on IMDb.<br><br>I stumbled upon this, having been unaware of its existence. It arrived without fanfare, drowned by the other Bruce Willis vehicle, A Good Day to Die Hard, and will likely sink without trace but for pillocks like me who see it and then review it. I sincerely hope Willis is as embarrassed about his presence in it as he seems to be about the aforementioned Die Hard 5. I'm not actually sure what he did in Fire With Fire other than run around a bit and then try to hide from the camera when he realised how bad it is.<br><br>Fireman Jeremy Coleman (Josh Duhamel, who previously 'delighted' in the execrable Movie 43), escapes a hold up in a convenience store by über villain Hagan (Vincent D'Onofrio). Seen as a major witness in a trial to rid the world of Hagan, Coleman is placed in the witness protection programme and whisked away to a far off state where he is allowed to keep his forename and does nothing to alter his appearance. He is placed in the care of US Marshall Talia (Rosario Dawson) who caters to his every need. Predictably.<br><br>And then the baddies come after him again. Predictably. Baddies which include Britain's greatest acting export, Vinnie Jones (who, mystifyingly, has 71 film and TV credits to his name compared to just 57 for Sir Kenneth Branagh. Explain that!). Yes, that's the level we're at here and it doesn't improve one iota.<br><br>In a moment of tenderness, Talia asks Coleman how he gets people out of fires and he delivers his next line ins such a way it might just as well have a great big flashing neon sign that states 'REMEMBER THIS LINE. I'LL SAY IT AGAIN AT THE END OF THE FILM WHEN I, PREDICTABLY, SAVE YOU FROM A FIRE.' The thing is, when we get there, he gets it wrong! And even the fire from which they escape looks like the cheap special effects (i.e. from a gas canister) on Casualty.<br><br>Oh, in case you didn't get the whole title thing, it has a double meaning: Coleman has to beat the baddies at their own manner (i.e. with guns) and he's a fireman and there's a fire. Geddit? Shall I explain it again just in case you didn't follow? Well, Coleman, you see, is And that's Fire With Fire.<br><br>Please, god, let there be another 10 star film out there for me soon.<br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[24,29]}]