[{"title":"Made For Teenagers","rating":4,"date":"26 November 2017","review":"Only good thing to say was the production values. Keaton cashed in on a film beneath him. Hollywood wasted another book which could easily have been scripted far better, and been the basis of sequels. <br><br>Apparently all that is needed to find an international terrorist cell is hang around outside their bank. And then allow a hormone driven nearly man to punch anyone he wants and they spill the beans. Pathetic<br><br>Another grown up not going to the cinema for a while now. There is little else to add.","user":"johnyysmith","rank":[134,204]},{"title":"Entertaining action flick","rating":7,"date":"15 September 2017","review":"After reading a few of the negative comments, I was apprehensive about seeing this movie. Glad I trusted my instincts and the previews. Let me make this very simple, as most other reviewers already provide you with a movie synopsis. If you enjoy movies like Die Hard, Jason Bourne, John Wick, Taken, etc. - you'll enjoy this movie. I do enjoy those movies, and I did enjoy this movie. It is exactly what it sets out to be, an entertaining action flick.","user":"peppertreelane","rank":[78,115]},{"title":"What a crying shame","rating":2,"date":"18 November 2018","review":"There are two elements to consider: (a) Is this close to the book and (b) is it a decent film?\nThe answer to (a) is that it isn't even close. I am a great fan of the Mitch Rapp series and whilst I am not for a minute suggesting that the books are classical literature they are a fabulous and entertaining read. Almost nothing in this film has anything to do with any of the books. The only saving grace is that they didn't make the mistake of casting Tom Cruise (like they did to play the 6' 5\" Jack Reacher!) in the role of Mitch Rapp; I think that Dylan O'Brien did alright but i wasn't convinced - I think they could have done better but maybe so could Mr O'Brien with an even slightly passable script and director. Generally I found the casting pretty dire.\n(b) Was it a good film? No. Plain and simple. It was pretty weak - even ignoring the divergence from the book.\nA crying shame that a book series with such good potential for being turned into a great film series has been massacred by this film. Shame on the script writers, shame on the producers and directors. Had author Vince Flynn been alive I'd like to thank that he would have vetoed this rubbish.","user":"rrome66","rank":[45,67]}]