[{"title":"some stories were VERY GOOD, some were BAD.","rating":5,"date":"1 July 2013","review":"When you watch \"The ABCs of Death\", you're really watching 26 f**ked up short stories that either leave you thinking it was good, or a total piece of crap. About half of these stories are good and the other half suck. The good thing about this is that even if while you're watching one and you think it's horrible, it only lasts about 4 minutes, then a whole new tale begins. There's a lot of graphic scenes in this gritty movie that you might not want to watch if you have a lite stomach. However, for all the gore loving horror freaks out there, I would definitely say its worth a see. I'm not sure of I'd ever watch the full thing again, but there are certainly a couple scenes that I would show my friends/family, and re-watch a couple times. Overall I give this movie a 5/10. Better than what I thought I would give it before I turned it on.","user":"craigjpeters","rank":[32,34]},{"title":"Excellent premise - Poorly Executed.","rating":3,"date":"1 February 2013","review":"26 Directors. 26 ways to die. What comes next is 123 minutes of WTF which left me feeling like I had done a bucket load of drugs. <br><br>It started of promising with the intelligent \"A is for Apocalypse\" which starts out with a wife mercilessly trying to kill her bed-ridden husband. Has she snapped? Finally had enough? Not at all - it has a bittersweet ending that had me thinking this was going to be a worthy ride. <br><br>Then I got lost - B &amp; C were either predictable (B) or just nonsensical (C). \"D is for Dogfight\" brought me back in - very well short with great lighting and no dialogue telling the story whatsoever. \"E\" features a spider on a revenge mission against the poor sap who tried to squish him. Then it gets to the first WTF moment - F. I don't really know what to say about F. But it featured nothing that I would have considered \"horror\" unless films about lesbians with fart fetishes terrify you. When we come to G - no clue as to what happened here, I guess it was a movie about someone drowning? I don't know.. Our second WTF moment comes in H - let's just say it features a man-dog being seduced by a Nazi woman cat and then a whole lot of electricity. The feature for the letter I was uninspired. By this point i'm starting to get a bit bored - but we're only a few shorts in - there still must be plenty more to come - it's got to get better... hasn't it?<br><br>Third WTF moment arrives in J (another Japanese segment) .. I don't even know where to begin. K see's the movie step into animated territory with the charming cartoon of a turd that just won't flush.. I won't spoil what happens but for the first time, I actually laughed. L is when things started to get serious. A twisted tale that repulsed me by the end. I'm reluctant to say it's one of the better shorts - but it did get a strong reaction from me - so I guess that's a good thing? M is probably the weakest short across the whole collection, which is disappointing as this is Ti West's feature - and whilst the subject matter is still somewhat taboo today - it was a cheap shot - and i'm curious as to know Ti spent the $5000 dollar budget on. N was another amusing entry - and had me laughing by the blood spattered end. <br><br>O was another one of those WTF moments... Then we got to P and I have to say this short upset me - as an animal lover, I found a particular scene of this short hard to watch. Not a fan. Q took us on a different direction - and was a short in the perspective of the directors of the short, p****ed they have the letter Q and decide to shoot a live duck as part of their segment.. another amusing effort but by this point in the movie... I have admitted defeat and realised that the opportunity to show case 26 of the best and well known horror/sci-fi directors has been completely wasted. I've seen nothing revolutionary or anything different to what we've seen in countless horror movies before. <br><br>Another WTF moment comes in \"R\" - i'm still not sure I really got what was going on, but it looked like there was a man who had \"film cells\" hidden beneath his hideously scarred flesh. I could be wrong, but by this point - I didn't really care. \"S\" features junkies and didn't come across as a segment that would really feature in a horror anthology. Nothing particularly horrific about it. \"T\" I had already seen before - Lee Hardcastle's excellent twisted claymation tale about a man-eating toilet. This is actually my favourite short across the whole segment just for it's creativity and fantastic claymation blood n guts - but it's the ending that really wins the points from me. \"U\" was another uninspired - been there/done that short filmed in a POV perspective. \"V\" was where it got interesting again. But this was again purely for the fact it took on a complete different style - more sci-fi than horror but very clever. W is another WTF moment which I suppose is appropriate considering the segment is actually called \"W is WTF\" - clearly the directors know what they were doing when it came to producing a segment that would incite the viewer to exclaim loudly \"WTF?!\" - but that's really all it was - poorly animated, poor special effects and just as much absurdity as you could possibly squeeze into 6/7 minutes. Not enjoyable at all. \"X\" was disturbing and probably features the most blood- shed out of all the shorts combined. A sad and graphic story about a fat girl who just wants to be thin and takes it to the extreme. \"Y\" was just... I don't even.. paedophiles, deer-hunting and licking up the sweat of young kids off of a gym bench... yeah, says it all really. Not one I enjoyed watching at all. And finally, another WTF moment courtesy of Japan when we come to \"Z\"... all you need to know - giant penis with a blade, girl shooting vegetables out of her vagina - close up of tits and a man ejaculating rice. <br><br>So when the credits rolled... I really didn't know what to say. My brain had been assaulted by 2 hours of perverse sexual violence, graphic gore and cliché story telling. If that's you're thing - well I guess there's a lot you can enjoy - lots of sex, drugs, violence and ridiculous bodily functions. If however, you like your horror with a little more intelligence - then I would steer clear of \"The ABCs of Death\".","user":"fury21","rank":[52,68]},{"title":"A Bonkers Collection.","rating":7,"date":"19 April 2013","review":"A collection of 26 short films from 26 directors from all over the world, each using a different letter of the alphabet for their theme, The ABCs of Death is an ambitious experiment in horror that, although far too much of a mixed bag to prove wholly entertaining, still offers enough for fans of outrageous cinema to enjoy. Whatever your taste in horror, there will most likely be something here to cater for it, and with each segment being an average running length of just 4 minutes, if you don't like the current tale it's not long before something different comes along.<br><br>A large proportion of the films are either frustratingly weak (guilty parties: Adam Wingard, Andrew Traucki, Simon Rumley), utterly perplexing, regrettably mediocre (Angela Bettis, come on down) or just plain bad (yes, Ti West, I'm looking at you—again!), threatening to make the film more of an 'Eh?-to-Zzzzzz' of horror than an A-to-Z (yeah, OK, I shoe-horned that line in, but it was too good to waste!).<br><br>Thankfully, the good stuff—the really wild stuff—makes it all worthwhile and then some: Marcel Sarmiento's 'D is for Dogfight' is beautifully shot in slow motion throughout; Xavier Gens' 'X Is for XXL' is wonderfully gory, just as one might imagine from the man who gave us Frontier(s); Thomas Cappelen Malling's 'H is for Hydro-Electric Diffusion' comes across like a live-action cartoon on crack; 'L is for Libido' is fap-tastically depraved; crude claymation short 'T is for Toilet' may lack the finesse of a Nick Park film, but is tons gorier; and words cannot do justice to the insanity on display in Yoshihiro Nishimura's 'Z is for Zetsumetsu'.<br><br>Even if, like me, you only really enjoy (or even understand) a handful of these twisted works of art, The ABCs of Death is a commendable effort and easily worth a couple of hours of any degenerate's time; while I can't see myself watching the whole thing again in a hurry, there are certain chapters that I'm sure I'll revisit many times over in the future.","user":"BA_Harrison","rank":[38,51]}]