[{"title":"Well, I found something to like.","rating":6,"date":"3 April 2015","review":"Reading the other reviews for this, I have to smile ruefully. Saying a film has absolutely zero merit is completely understandable - expected - with soulless box office cash cows. I mean, it isn't really - considering people have toiled tirelessly and put in insane hours to create it, and at least one person in the cast is probably insanely invested in it and will cry their little heart out when they read the reviews - but it's understandable. Because it's just a product.<br><br>When it comes to little hopeful offerings like this one - an idea some budding director has probably had for years, worked so hard to get made, and probably never expected it to - it's not only a little cruel but stupid.<br><br>Because you can tell the director of this little film, Rita Merson, cared a lot about making it. \"I watched 'Pretty Woman' and it was all over,\" says Merson. \"I became a connoisseur of the romcom.\"<br><br>She made this with a recently broken heart. That went into the making of this film. As cliché as it is, getting your heart broken is still one of the most intense, multi-layered and transformative experiences of grief and longing in existence. So, no. I have a heart, and that automatically makes this film something to me.<br><br>That doesn't mean it's a very good film. It doesn't pretend to be. It's warm, strange, neurotic and often desperate, but it doesn't try to make any great Statement about love and music and self-discovery. It does what you want a little romcom to do - tell a story and make you laugh and feel things. And it does that just fine.<br><br>I was sometimes frustrated watching it. It was light. Sometimes frothy. The subject matter, under the hand of a more indie director who takes themselves a little too seriously, could have given something a little more raw and meaningful.<br><br>But this was sweet. The lead actress was wonderful to watch, very different. Her neuroticism, meant to make you fall a bit in love with her, worked. She wasn't too adorable. I liked her, and her voice, if it's hers, and forgave her for seeming to know absolutely nothing about music or authenticity.<br><br>Sometimes the dialogue was hilarious. Never inspired, never Nora Ephron, but original and laugh-out-loud. Almost every encounter with the doctor, who wasn't bad himself.<br><br>I'm just saying. It had a heart. It made me feel things. It was fun. It was warm and sparky. It cheered me up. And her voice is very good.<br><br>So thanks, Rita Merson.","user":"TheInbetweener","rank":[20,24]},{"title":"One of the Worst","rating":1,"date":"15 November 2014","review":"...movies I've seen in a long time. While watching, I asked myself \"how did this movie manage to get made? Who was the writer/director sleeping with?\" I'm normally not that critical of films... I get engaged in them pretty easily and can suspend disbelief like a child. But when I can't, I know a film is really bad. In this one, which first hooked me with the title, a chipper young woman who is about as unlike \"Woodstock\" as Martha Stewart, decides to return there where she last was at age 4 and actually owns a house. She leaves her expansive NYC apartment (it's inexplicable how she can afford it) and, after her meek attempts at standing up to an emotionally abusive fiancé and bosses at her job fail, she drives up to Woodstock via the scenic route which most people don't even use. She enters this house in Woodstock that, despite covered furniture and a bit of debris, looks freshly painted. She then goes to a bar, her bright red lipstick still shining, gets drunk and meets Mr. Right, who is handsome, nice as can be and is also a doctor. She meets a couple of Woodstock people, e.g., Rumer Willis dressed in short shorts, cowboy boots, dyed red hair and a nose ring, and gets back into song writing. There are meager attempts to make the town look like Woodstock, which in reality, is colorful and unique. To me, this movie felt like one of my short stories which was rejected over and over because it was a good idea but not well executed, which led me to the original question of how this movie managed to get made.","user":"Moviegoer19","rank":[12,20]},{"title":"it tries to be good","rating":5,"date":"21 August 2018","review":"Catherine Brown (Allison Miller) is stuck in her life which has her silently screaming. She has long abandoned her dreams of singing. She lost her parents early in life. Her boyfriend Garret (Jason Ritter) is a self-obsessed actor. She hates her job as a musician rep and then is forced to wrangle hard-partying Jody Sinclair (Brittany Snow). When Jody accuses her of assault, she gets fired. She comes home early to find Garret cheating on her. She's sleeping on her friend Ryan's couch. She decides to go upstate to live in her childhood home in rural Woodstock. Emily (Rumer Willis) is the tough local bartender and Noah Bernstein (James Wolk) is the cute doctor. On the drunken first night at the bar, she proclaims her love to Noah. Coffee shop owner Lee Ann (Katey Sagal) nurtures her music dreams.<br><br>Miller and Wolk are a perfectly cute rom-com couple. They are both photogenic and sweet-natured although they are more like sidekick material. I want to like this very much for them. This is director Rita Merson's debut. The newcomer doesn't have all the skills to make this work. The timing is not there. The jokes are lacking. I'm surprised at the number of solid actors in the cast. Even the minor roles have familiar names. It doesn't make this good and may actually hinder the small town feel needed for Woodstock. It feels like Hollywood trying to pretend to be small town. The same can be said of the record company. It's some kind of Hollywood facsimile of a record company from the recent past. A lot of this movie falls flat despite my desire to root for the couple. Even at its best, this is a formulaic rom-com. It's not until Forever Sex when I finally get my first laugh. I still don't understand Emily's motive. This tries to be a fun quirky rom-com. It tries.","user":"SnoopyStyle","rank":[2,2]}]