[{"title":"A young man tries to bring his friend back to reality, only to find that \"reality\" is not just open to interpretation, but malleable and ever-changing.","rating":18,"date":"18 December 2013","review":"In spite of some worn clichés -mysterious found footage, missing researchers, and a mystic medicine cabin obligatorily set on an Indian reservation, with Resolution, independent writer/director Justin Benson brings us a breath of fresh air. The film is technically adept on its small budget, and presents a real genre-bender of a plot. Resolution builds slowly as a crime drama, becomes a psychological suspension, then morphs into a puzzler riddled with paradoxes. It releases in a brief climax of occult horror.<br><br>In the story, yuppie Michael (Peter Cilella) travels to a remote squatters' shack, where his addict friend Chris (Vinny Curran), bristling with firearms and contraband, has holed up, resolved to kill himself with drugs. Michael restrains Chris, and forces him to withdraw \"cold-turkey\" over the course of a week.<br><br>A progression of weirdos make the scene. Chris's low-life cohorts (Kurt David Anderson and Kyler Meacham) drop in, demanding drugs. A tightly-wired Native American property owner (Zahn McClarnon) and his menacing gang show up to evict the occupants. A scheming real estate developer (Josh Higgins) creeps in, mistaking Michael and Chris for the deed-holders, and a doomsday religious cult is engaging in shenanigans a little too nearby for comfort.<br><br>Michael strives to maintain control over the situation to buy enough time to get Chris straightened out, and back to civilization and rehab. Despite the threat posed by oddball interlopers, the real tension is yet to come.<br><br>Someone...or some THING is watching -and recording everything Michael and Chris do. But how? The surveillance indicates a presence that looms closer and closer, yet Michael can't detect the observer.<br><br>Looking for clues, Micheal discovers strange footage shot by a missing anthropology team, then locates a laconic neighbor, Bryon (Bill Oberst Jr.), with an uncomfortably unorthodox existential philosophy. From here the story plunges into perplexing paradoxes. Chris's sleazy drug buddies and the landowner converge for a showdown. Mind-bending events knock Mike and Chris away from objective reality and any sense of control over their destinies.<br><br>Resolution is talky, but intriguing. The long-winded plot is better suited for an hour short. Aside from establishing an initial setting and circumstances, the first half of the film doesn't bear vital relation to the engaging concepts of the second. It's still pretty good. Unsettling developments keep us watching. Plot twists reveal a honeycomb of passages down which to venture. Rather than choose one of them and proceed, the filmmakers offer a twisted experience based on the fact that these alternate routes exist.<br><br>Part of the fun of Resolution is thinking about the various possibilities and what they mean. In our minds, we DO pursue them, trying to predict the outcome, but just when we think we know what's going to happen, Resolution throws us a new twist. Throughout it all ripples a nerve-jarring undercurrent of menace, indeterminate, and incipient. Mike and Chris's safe return to the outside world is increasingly unfeasible.<br><br>There's some subtle cinematic artistry in Resolution which reinforces the exposition. In the scene in which Michael is conversing with Byron, Byron discusses his views about narrative and story. As he explains to Michael, Byron holds a mirror. At first, the mirror is angled so that Micheal's reflection blends with Byron's face. The effect is to project Byron and Micheal as melded together, depicting a dual entity. But Michael cannot see it. Only we can see it.<br><br>Byron angles the mirror so that we see another mirror on the wall behind Michael, producing the illusion of endless repetition. It illustrates the concept of how a painter records a scene. There is the scene, and the painter painting it. But there is a larger scene. For us to see the painter painting the scene, there must be another painter, painting the painter painting the scene... and so on to infinity. This is a pivotal moment in the film. Resolution carries distinct, though not fully developed sub-themes about the evolution and structure of folklore, myth and story, and these are tied into the paradoxes.<br><br>Filmed in a half-completed lodge under construction, illuminated by hook lamps, and without background music, intimate camera-work increases a sense of realism, almost like seeing a documentary. The technique is effective because Resolution turns out to be all about deconstruction and the plastic nature of reality. By the time we realize this, we've accepted the actuality of what's transpired, only to have the drop sheet yanked out from under our feet.","user":"pameladegraff","rank":[27,33]},{"title":"A horror junky who thought he had seen it all. Thank god for Resolution","rating":10,"date":"27 January 2013","review":"For the incredibly stupid front page reviewer here (it's not even a review really, just whining with no substance by somebody who doesn't seem to like or recognize horror.), I'm not affiliated with the film in any way, feel free to look at my other reviews. I'm just a horror junky that thought he had seen every horror movie worth watching, and now that i've seen this, maybe I have.<br><br>This movie is really creative. Without giving away too much it definitely broaches other themes that have been covered by other movies, it reminded me a bit of Inland Empire and 13B, in theme only, not content and while it's a somewhat familiar theme it goes in a very different direction with it. It's very well paced and does absolutely amazing jobs of foreshadowing and just piling on the atmosphere and dread so well that at one point I almost didn't want to see what was going to happen, the ending completely took me by surprise.<br><br>It's clearly a zero budget indie movie but you would hardly know it to watch it, it's well shot and the cinematography is really good. My only issue is a script one, I thought the main characters dialog and decisions dealing with the crazy events of the film were oddly nonchalant and downright frustrating at times but then again it would have made the movie impossible if he had done what most sensible people would as a reaction to some of the events which is to call the cops lol.<br><br>This is absolutely fantastic psychological horror. Bravo to the directors and everybody involved with this. I rarely gush like this in these reviews but there's a reason Resolution has gotten so much hype from horror specific movie sites. It's THAT good.<br><br>Since there's no plot synopsis, i'll give a brief one. A man is invited by his ex best friend to his cabin out in the boonies. He knows his best friend is pretty much a rock bottom meth addict and he's rebuffed all his attempts prior to get him into rehab so he shows up with a stun gun and a pair of handcuffs, chains him to a pipe in the dilapidated shack he lives in and is going to stay with him while he detoxes. Strange people live around there and every day he feels he's being lead to strange things like records, books, journals and old film. Things get more weird from there.","user":"baserock_love","rank":[123,174]},{"title":"Atmospheric, twisty strange little flick with a lot going for it","rating":8,"date":"12 September 2013","review":"I really, really liked 'Resolution.' It's not an easy film, and it doesn't provide easy answers. I will take strange/atmospheric/well acted/creeping dread over cookie-cutter Hollywood horror crapfest any day of the week. 'Resolution' seems to be about two guys who are at the mercy of a storyteller that wants a story to be told. Where is the story coming from? Is it on their minds? Is there a puppetmaster behind it all? Or is it just some freaky meth-withdrawal side effect kind of thing? I don't know, and I actually really appreciate the fact that this movie doesn't tell you in clear cut answers. In a way it reminded me of 'Upstream Color' in that there is a lot to think and wonder and imagine about in this film. After I've done that for a few days I'll watch 'Resolution' again. I hope this writer/director gives us more.","user":"ELB-6","rank":[29,41]}]