[{"title":"A Discourse Into Soul Collecting and Demonic Enslavement","rating":8,"date":"27 December 2014","review":"\"...and they descended upon the earth to strengthen their ranks.\" - Opening quote, Borgman<br><br>\"My name is Legion, for we are many.\" - Mark 5:9. (Signs reading \"I am\" and \"we are\" in the play towards the end of the movie.)<br><br>Camiel Borgman is a greater demon of hell, but not the Antichrist or Lucifer as other reviewers may cite. \"Camiel\" and \"Borgman\" is actually his job title, the etymologies of these names elude to the purpose he serves for Lucifer; his real name is given at the beginning of the movie, \"Anton\", which is believed to be a lie in an attempt to gain admittance to the house. I will discuss the importance of his real name later. The etymology of \"Camiel\" is 'acolyte', defined as a youth serving in a religious service or procession, and \"Borgman\" is 'a man who takes toll; a landlord'. So his literal job title based on his name's etymologies is \"Acolyte Landlord\", or one who collects tolls for another. These 'tolls' are the souls of Anton's victims and the master in question is Lucifer.<br><br>Anton's actions and behaviors are most closely aligned with that of such mythical creatures of an alp or incubus. He is seen as a magical being, as noted when Isobel comments on a magician visiting her. Anton's demonic predilections include manipulating dreams, noted by his dream-weaving over Marina while she's asleep, seducing others into slavery-like obedience, noted by Marina's and eventually Richard's change of heart towards Anton, inciting murderous intent, like with Isobel finishing off the gardener with a huge rock slab after Anton gestures towards him with a slight wave, and generally being the catalyst that draws out the '7 Deadly Sins' of Christian immorality in others. Numerous examples of the latter include wrath, greed, sloth, pride, lust, envy, and gluttony throughout the movie, especially with the husband, Richard (wrath: beating Anton to a pulp at beginning, greed: trying to take over his friend's company, etc.) At the intersection of all these sins committed by others is Anton, either directly or indirectly influencing their actions, satiating his demonic appetite, and advancing his evil kingdom.<br><br>As a greater demon, Anton has enslaved lesser demons who serve him unconditionally and are constantly striving to win his favor. These servants are represented by his two \"friends\" at the beginning of the movie and the \"mother/daughter\" pair later on. Case in point: when Anton and the 2 women drive past Ludwig and Pascal, Pascal phones Anton to ask why they fell out of \"favor\" with him. Later in the movie, his servants put on a play to entertain and honor Anton. Additionally, Anton's 'hounds of hell' are there to usher in his reign, but he chastises them for arriving too soon.<br><br>The souls of the children and young babysitter of the family are coveted by Anton, as only children is Anton interested in. This is why, at the beginning of the movie, he chooses the household based on the fact that it has children's toys in the front yard. His minions and he gradually win them over through manipulation and seduction. Once they \"drink the Kool-Aid\", a sign of ultimate obedience and recognition of demonic sovereignty, the children's backs are branded by the mark of Lucifer (which is shown that Anton also bears) and their souls are culled from the earth, depicted as entering the forest at the end of the movie.<br><br>The story of the 'White Child' that Anton narrates to the children is a parable in which Anton is the cripple, \"Antonius\". The story is of an angel (white child) falling from heaven (above the clouds) and into the depths of hell (the bottom of a deep lake with a terrible beast in it). In the story, Anton volunteers to save the mother's child after all others would not. The villagers wrongly placed their trust in Jesus for the salvation of the child, which Anton chastises them in the narrative, stating, \"Jesus is only concerned about Himself\". The etymology of \"Anton\" is 'priceless', so placing one's faith in Anton is synonymous with placing one's faith in something that is priceless, an obvious parallel to two of the '7 Deadly Sins': idolatry and greed. The moral of the story is the same as the moral of the movie: that we should put our faith in Anton, not Jesus. After all, Anton Camiel Borgman is by etymological namesake the Priceless Acolyte Landlord.","user":"cheezburgerz","rank":[97,109]},{"title":"The movie undoubtedly makes one wonder about his/her own inner dark side.","rating":8,"date":"25 May 2014","review":"Borgman is not a vagabond or a homeless, but the evil, the Antichrist itself. He emerges from under the ground with his followers when the local priest and some helpers try to destroy them. They manage to escape and set out on a journey to capture new souls. Borgman is not interested in money or wealth, not interested in seducing women or hurting children. He could get it all if only he wanted to. His only interest is to bring out the evil residing in all humans - men, women, children. He manipulates, sedates or kills people when it is necessary, but it is not a goal, just a tool for him. When he finds a potential follower, he marks him or her with a stigma on their backs. He does a perfect job with an upper-class family turning the family members, the babysitter and her boyfriend against each other, uncovering their worst thoughts and desires. Borgman ends up by capturing new followers, and abandons the beautiful house by cleaning up any traces of his terrible deeds. The movie is surrealistic, full of symbols related to the Bible, and lightened up with lots of spooky humor. It does have a clear plot and a full ending, and undoubtedly makes one wonder about his/her own inner dark side.","user":"jukkajukka","rank":[93,116]},{"title":"Metaphysical absurdism in a grippingly tense film","rating":8,"date":"14 November 2013","review":"'Borgman' tells the story of a drifter (Jan Bijvoet) that slowly but suddenly takes control of the lives of a young, wealthy family living in a beautiful mansion somewhere in the Netherlands. The movie begins with a scene in a forest, where Borgman, i.e. the drifter, and some of his associates are chased from their underground hiding places by a group of holy workers (lead by the-always-inspiring Pierre Bokma). Soon after their escape, Borgman alone seemingly randomly knocks on the doors of the houses of very wealthy people, asking if he can use bathing facilities in their house. In attempt to do good after a brutal beating by her husband (Jeroen Perceval), Marina (Hadewijch Minis) helps Borgman by giving him temporary shelter in the garden shed. That was all that the intimidating but darkly intriguing character of Borgman needed to unfold his diabolical plans...<br><br>Although Borgman is a layered surrealistic film, and probably therefore sometimes slow and hard to understand, its message is clear and the story is continuously compelling. Especially intriguing are the biblical aspects, which are always subtly present in the background, and which give the film a dark, tense character. Not being a religious person, the movie does trigger an interest in the spiritual, or better, meta-ethics, which won't leave you alone for several days afyer having watched it. The excellent performances of Jan Bijvoet and Hadewijch Minis are crucial in delivering the very strong script.<br><br>I highly recommend this film to anyone who seeks a tense thriller. Because, aside from the absurdist aspects, from start to the end the movie is very exciting.<br><br>8/10","user":"bartverberne16","rank":[88,129]}]