[{"title":"Not what you think (probably)","rating":9,"date":"24 May 2017","review":"After reading a couple of negative reviews about this movie, I get the impression that the people who found it insufficient or boring completely lost the point. Levinson didn't try to pull a \"Fincher\" with this one. In other words, \"Wizard of Lies\" is not a documentary, touching on each and every aspect of this infamous case in every detail. This is more of a psychogram (i.e. character portrayal) of the members of the Madoff family. With that in mind, the movie touches wonderfully on the dynamics of an ultimately patriarchal family; the \"castration\" of the sons, the absolute dependence of every member of the family on the father, and on what happens when this father goes down in a big, BIG way. If you are interested in learning about the greatest financial fraud in the history of the USA (some say of all time), then visit the Wikipedia page or watch a documentary. This movie will not cover your needs. If you want to watch a beautifully directed, acted and edited psychological drama, then \"The Wizard of Lies\" is right up your alley.","user":"ecthelion79-709-719725","rank":[70,82]},{"title":"Surprisingly fascinating... even when you the story well!","rating":9,"date":"23 December 2017","review":"I was somewhat surprised by this biopic, since I'm well-acquainted with the modern Ponzi scheme story and the $65 Billion ripoff committed at the private investment firm. But even for those familiar with the general story, the documentary film provides a fascinating portrait of the Madoff family and the key characters. Overall it reminds me of an epic Greek tragedy.<br><br>The principal crime committed by Bernie Madoff is clearcut. Officially, Madoff run a phenomenal hedge fund, but in reality it was just one big hoax and pyramid investment scheme. All ROIs were fictitious and existing investors were paid by the money provided by subsequent investors. Aside from defrauding rich individuals of European royalty, Madoff took advantage of the fact that he as a jewish investor had excellent contacts to other wealthy American jews, which allowed him to swindle countless of the latter of all their retirement savings. All in all, in the end it led to countless tragedies and suicides on both continents.<br><br>The financial thriller behind it has been well-told by previous accounts, particularly 'No One Would Listen' by Harry Markopolos (i.e. the financial analyst struggled to expose the fraud for many years). It's also true that the ramifications would have been much more limited if the SEC would have done their job properly.<br><br>However, what this biopic does is following Bernie Madoff and the effects of the exposure on his own family, i.e. particularly his wife Ruth and his two adult sons. It seems as his family was completely unaware of the fraud and the movie does a good job in explaining how his sons never got the information from their dominating father. Later, when it all blew up the fraud also wreaked havoc on the lives of his wife and sons.<br><br>In the end, it was all for nothing. The family members would lived longer and happier lives without massive fraud committed by the Bernard. While the portrait of him is by no means completely unsympathetic, he remains seemingly oblivious even to this day to the devastation he caused in so many lives, including to those nearest to him.<br><br>The main roles played by Robert de Niro and Michelle Pfeiffer are brilliant, but also the less-known actors playing his two sons.","user":"DrWillhelmWonk","rank":[18,19]},{"title":"Portrait of a Sociopath","rating":8,"date":"20 May 2017","review":"Richard Dreyfuss claims first portrayal of this monster, but he made Bernard out to be somewhat approachable, as he talked through the fourth wall and joked about the art of selling a scam. He was good but too likable. DeNiro is one of our great acting treasures and his take is nothing nice at all. In fact, it is impossible to like this man. He is evil here, and while one can have some sympathy for Ruth and her sons, the entire tragedy, almost out of Shakespeare, is well done. It bounces around a bit to the past and present, but easy to follow and under the direction of Barry Levinson, moves smartly. But don't watch this if you want a positive evening - hard film indeed. Shot of whiskey portrayal of a monster.","user":"reisen55","rank":[77,100]}]