[{"title":"Wow","rating":8,"date":"3 May 2013","review":"This is a movie that stays with you. It's a real movie about people, and a place--not car chases and explosions. I don't agree with the mixed reviews and complaints about the length of the movie. Matthew McConnahey is well-cast. All of the actors do a good work; Reese Witherspoon, Sam Sheppard. Tye Sheridan and Jacob Lofland do a great job playing the child characters. The Mississippi river is like a character in the movie, which evokes Huckleberry Finn, as others have noted. The settings are magnificent. In a sea of manufactured movies, it's nice to see something that was crafted by human beings. I would recommend this movie to those who are interested.<br><br>The audience in the theater I was in seemed absorbed.","user":"TruthSpeaks","rank":[275,306]},{"title":"Exquisite Piece Of Filmmaking","rating":14,"date":"14 February 2015","review":"An exquisite piece of filmmaking from writer-director Jeff Nichols, bolstered by powerful performances from Matthew McConaughey, Reece Witherspoon, Sam Shephard, Tye Sheridan and Jacob Lofland. 'Mud' is a beautifully shot film that blends crime, drama and romance into a heartfelt plot that follows two young boys who encounter a fugitive in need of their help. Set against some of the most unique and stunning locations ever used in a film, 'Mud' is reminiscent of flicks including 'Stand by Me' and 'Night of the Hunter'. Starting off relatively slow, the film steadily urges the viewer into a riveting tale of love, hate and redemption, with McConaughey giving one of his finest performances ever. A realistic and gripping coming-of-age tale that not only stands as being one of the best films of 2012, but one of the best dramas of the past decade.","user":"CalRhys","rank":[70,79]},{"title":"Beautifully filmed Coming-of-Age tale on the Mississippi River","rating":9,"date":"10 March 2013","review":"Mud was very well-received by a packed house at the Paramount Theatre for its Regional Premiere at Austin's SXSW Film Festival. The crowd particularly loved local favorites director Jeff Nichols and the always shape-shifting Matthew McConaughey. (How is it possible that McConaughey hasn't even been nominated for an Oscar yet?) Mud is a charming, entrancing film that has almost lyrical quality as it unfolds along the rural backwoods of Arkansas's Mississippi River. The story revolves around the adventures of two young teenage boys who meet a mysterious drifter appropriately named Mud. Mud is hiding out an island in the Mississippi River awaiting the arrival of his beloved Juniper. The story has elements of drama, thriller, and romance. While the film is slightly too long and the story has a few unnecessary and distracting subplots, its overall eloquence and is absorbing. So like the Mississippi, the story meanders a little too much. The River setting becomes a character in the film that shapes the drama playing out along it. The two teenage actors are excellent, but the film is tour-de-force for McConaughey who is its heart and soul. Highly recommended for those who like serious drama and appreciate natural beauty.","user":"JustCuriosity","rank":[149,177]}]