[{"title":"This Is Not for Everyone","rating":8,"date":"29 January 2013","review":"There is little doubt that this movie is not for everyone. If don't believe it just look at some of the reviews, lot's of 1's and lot's of 10's, me I am somewhere in the middle, (towards the 10 end). It is not for everyone because it is QUIRKY and I do mean quirky, with lesser talented actors I could well be one of the people giving it 1 star, however the acting was excellent. I have been big fan of Sam Rockwells, since the Green Mile and in Seven he is hilarious. Colin Farrell, was great and as usual Christopher Walken was superb. Mickey Rourke was originally cast in the Woody Harrelson part, and while he did a good job, I think the character might have been better suited to Mickey Roarke. There something about Woody playing a character that is way over the top, that feels like he's playing it way over the top, none the less he was still funny.<br><br>This movie was full of hilarious one liners, and some very smart dialog, the plot was at the same time funny and ridiculous. I read a few of the reviewers that slammed this movie and most of them were bashing the plot or the lack thereof, this is not a great who done it, and I will agree the plot was paper thin, at best.<br><br>If you see this movie you need to see it for the acting and a fun way to spend 110 minutes. If you are looking for a movie that makes some kind of a statement or makes you really think about your life, then don't see this movie, you will be disappointed.","user":"richcarter1962","rank":[102,132]},{"title":"A story, about a story, distracted by a Shih-Tzu, with guns","rating":10,"date":"6 October 2012","review":"My friends and I went to the San Diego film festival this past week and were fortunate enough to get into an early screening of Seven Psychopaths, by Martin McDonagh. The film was very satisfying to me personally, weaving an original story around rich characters. Story is something that I take into great consideration when viewing a film as it has lost a foothold in many films today. In terms of presentation, I felt this movie to be a combination of Guy Richie, Quentin Tarantino, and The Coen Brothers. It's hilarious, dark, gripping, precise, quirky, demented, gory, and British. The frequent narration and character introduction of the movie gives it a constantly evolving lure and makes you feel like you're sitting by a camp fire listening to something unfold. Even though their is a thick layer of narration and Peckinpah darkness, it's fun as hell, with the acting a huge aspect of that; if you want to experience a great story, that discovers a point to the whole mess these characters undertake, and have a blast at the same time, then go see this awesome movie!","user":"freestylerja16","rank":[231,337]},{"title":"An intricate film with genuine laughs centered around a solid script","rating":10,"date":"15 October 2012","review":"When I was driving to the theater, I was doubting my choice in Seven Psychopaths, because the trailer made it seem like so many films I'd seen before that looked edgy and wry, and showed so much promise in the previews yet fell short because of flat characters and muddled plots. This one, however, did not let me down.<br><br>I suggest that you see this film purely because it tries to do more with a movie than anything you've seen in a while, and it manages to actually succeeds on all levels, while dangerously romancing the clichés of toying with clichés, movies about writing movies, and gangsters with a soft side. Every time the story started to get even a little generic, wild cards came firing in from all sides.<br><br>The actors played their parts well, but Rockwell gave the best performance. I was impressed by Woody and Walken's abilities to shed their skins and get deeper into character than I've seen them be in years. <br><br>This is a writer's film--the subplots (really, borderline vignettes) about the various psychopaths that Marty encounters are well done, their back stories unfold at different paces, and their details that connect them to the central plot are creatively deployed, while the momentum of the film clearly hinges in the here and now and does not make the mistake of merely chaining together several subplots to produce one \"dog\" of a story.<br><br>I enjoyed almost everything about Seven Psychopaths. 10/10 to offset the 2 that someone without a brain will rate this.","user":"nathanialwest","rank":[220,323]}]