[{"title":"Daniel Patrick Carbone's portrait of youth, innocence, and life is profoundly real...","rating":9,"date":"24 April 2013","review":"No film at the Tribeca Film Festival or any film in recent memory has captured the cultural and significant impacts of tragedy in the minds of adolescence than Daniel Patrick Carbone's Hide Your Smiling Faces. Engagingly suspenseful, this tale about two brothers, after a tragedy occurs in their rural town, must confront their own demons that include relationships, nature, and morality. Tommy (Ryan Jones) and Eric (Nathan Varnson) are confronted with morally conflicting views of life and as the two try to siphon their own processes surrounding their tragedy, an underlining beauty exists that I'm not sure I fully understand after the film. Hide Your Smiling Faces lays it on and lays it on hard as these two boys encounter several instances of adult situations through the eyes of young children. Writer/director Carbone isn't troubled to ask the tough questions of youth and as the boys battle through their layers of guilt, innocence, and even sexuality, Carbone explores the soul of youth and comes up with a phenomenal portrait that stands proudly next to classics like Stand by Me (1986). The dynamic Nathan Varnson and purely magical Ryan Jones are simply perfection in their roles. Varnson, who is very reminiscent of Hunter McCracken's powerhouse turn in The Tree of Life (2011), is somberly brilliant and he arranges emotion after emotion on top of his youthful persona. His execution is truly dazzling and it's a inspirational performance that stands as the stone pillar of the film. Ryan Jones is equally effective and mounts the single finest scene of any film seen this year so far with absolute precision. Diverse and adaptable in any given scene, these two boys carry the entire framework of the film and are the most beloved trait for you to take home. Daniel Patrick Carbone is a jack of all trades who not only writes and directs the film with an infinite amount of passion but manages to edit the film to a subdued aura that is both pleasing and smooth. Not to mention his intention to give the audience several instances of apprehension that can give a person with a pacemaker an early trip to the grave, Carbone places guns in the hands of children, puts them near the ledges of a bridge, and even puts them face to face with the dangers of nature. While suicide even plays a prominent theme, Carbone's subtle approaches to how one can interpret the death of a loved one are astutely profound. It's damn near perfection in every sense. His filmmaking style and imagery are very Malick-esque and his deep-rooted appreciation for nature is, well, appreciated. What makes him a true professional is he doesn't just lay it on us for the sake of art, he believes in the message that the Mother Nature is trying to convey. Surveying the decomposition of an animal becomes a stapled foundation for the child in all of us to stand on. I found myself richly tearful, examining the mutation of emotions as they manifest themselves into different behaviors. You can't ask more from a film. Not to mention, an eighty-minute endeavor such as this. Hide Your Smiling Faces is a magnificent portrait and Carbone's paintbrush laid strokes of love, anger, confusion, and a rainbow of emotions to indulge the audience. It's one of the most pleasant surprises experienced at a festival thus far. <br><br>Read More @ The Awards Circuit (http://www.awardscircuit.com)","user":"ClaytonDavis","rank":[26,37]},{"title":"The Sense of Living","rating":9,"date":"22 August 2014","review":"With excellent performances from Ryan Jones and Nathan Varnson, \"Hide Your Smiling Faces\" is another of the remarkable and recently seen films about children and adolescents, adding it to a list that includes \"These Birds Walk\", a documentary about street kids in Pakistan, who find refuge in a home created by an old humanist; and a science- fiction motion picture dealing with education, and sold as a horror movie, called \"The Tall Man\", which is in reality a terrifying parable of the destiny of children these days, that made me think of the education methods in totalitarian societies and reminded me of \"Invasion of the Body Snatchers\". \"Hide Your Smiling Faces\" is the gentle one, although it does not lack elements of tension in environment, family and relations among the young persons. It belongs to the category of observational motion pictures, in which you deduce and obtain information (and, from an aesthetic angle, pleasure from the viewing experience) in a very quiet way. Even its dramatic peaks are handled in a wise tone, with a quiet touch, when danger is present: I refer to the final scenes involving Jones and Varnson, with elders and the force of nature (I can't be more specific, for I would spoil your viewing experience). In a jaded world where violent images are what bring \"artistic fulfillment\" to most persons, motion pictures like this one, although rarely done, are the kind of productions that are needed every now and then, to remind us all what we are, where we belong and what in the end is the purpose of existence.","user":"EdgarST","rank":[9,13]},{"title":"No plot, no questions answered. Poor excuse for an \"art\" film","rating":2,"date":"26 March 2015","review":"Honestly, I've seen plenty of offbeat art films where there is no concrete plot and the movie is really about the angst and emotions of the characters. But even then, I expect something to happen. I expect to see some character development, some questions answered, some conclusions.<br><br>This film offers none of those. It is 90 minutes of some kids rambling around after the mysterious death of one of their friends. We never know what they think, how they feel, or how the events affect them. We never know what to think of their parents, or the dead boy's father.<br><br>I'm sorry, there is just no plot, no story, not even a thread of one, to hold this thing together. Count how many times one of the characters answers a question, \"I don't know\" in this film. Every question is answered this way, so you can't form any opinions about any of the characters.<br><br>I'll leave you with one final thought. The way the scenes cut from one to the next, with no connective tissue between them, they could be shown in almost any order and it wouldn't make any difference.","user":"mmagliaro","rank":[7,15]}]