[{"title":"This quadriplegic was in tears","rating":10,"date":"14 January 2019","review":"I'm so thankful to Kevin Hart, Bryan Cranston, Nicole Kidman, Neil Burger and the rest of those involved in this remake! Movies entertain us but they are even better when they can educate, entertain, and make us laugh at the same time. There have been no movies with big celebrity actors showing that a quadriplegic can actually live a regular life and have happiness. There were 2 big movies that came out and the quadriplegic chose suicide at the end. Instead of being looked at like a regular person, we are looked at with pity. Yes our life is hard! It's not easy being completely dependent on others for everything! It's been 22 years and I don't have millions of dollars or a fully accessible house or a nice \"patty wagon\" like Bryan's character had in the movie but I have God and family and friends and I live a good life! I still got a bachelors degree and I still found love and I was able to be a mother! We have fun and choose to laugh ALOT despite our circumstances. I hope everybody learns something from this movie!\n#TheUpside #stillstandingalwayssmiling","user":"ejp9718","rank":[522,658]},{"title":"Not the 10* French classic, but a fun and moving movie nonetheless.","rating":7,"date":"18 January 2019","review":"So, the movie-going audience for this film will divide into two categories: those that have seen the original 2011 French classic \"The Intouchables\" that this is based on, and those that haven't. \"The Intouchables\" would have got 10* from me, no problem.<br><br>This movie joins a list of standout European movies - for example, \"The Girl with the Dragon Tattoo\"; \"Let The Right One In\"; \"Sleepless Night\"; etc. - that have had Hollywood \"makeovers\" that don't match up to the originals. And this is no exception. However, it's still been well made and deserves respect as a standalone piece of movie-making.<br><br>Based on a true story, Phillip Lacasse (Bryan Cranston) is left both paraplegic and widowed by a string of bad luck. Not that money can buy you everything, but his care arrangements are substantially helped by him being a multi-millionaire (\"Not rich enough to buy The Yankees; Rich enough to buy The Mets\"). This is from success in investments and writing about such investments.<br><br>Depressed, cranky and with a \"DNR\" that his diligent PA Yvonne (Nicole Kidman) seems unable to comply with, Phillip lashes out at anyone and everyone and so dispatches his carers with monotonous regularity. Dell Scott (Kevin Hart) is on parole, with the requirement to seek work. Due to a mix-up, he finds himself in the employ of Phillip: with the suspicion that he's been hired because he is the very worst candidate imaginable, and thus the most likely to let Phillip shuffle off this mortal coil. But the two men's antipathy to each other slowly thaws as they teach each other new tricks.<br><br>Those who have seen \"The Intouchables\" will fondly remember the first 5 minutes of that film: a flash-forward to a manic police car-chase featuring our protagonists (there played by François Cluzet and Omar Sy). It drops like a comedy hand-grenade to open the film. Unfortunately, you can't help but feel a bit let down by the same re-creation in \"The Upside\". It has all the same content but none of the heart.<br><br>After that rocky start, the film continues to rather stutter along. Part of the reason for this I think is Kevin Hart. It's not that he's particularly bad in the role: it's just that he IS Kevin Hart, and I was constantly thinking \"there's that comedian playing that role\".<br><br>However, once the story gets into its swing, giving Cranston more of a chance to shine (which he does), then the film started to motor and my reservations about Hart started to wane. Some of these story set pieces - such as the one about the art work - are punch-the-air funny in their own right. Cranston's timing in delivering his punchlines is immaculate.<br><br>There seems to have been some furore about the casting of Bryan Cranston as the role of the disabled millionaire instead of a disabled actor. Lord save us! He's an actor! That's what actors do for a living: pretend to be people they're not! It's also worth pointing out that François Cluzet was an able-bodied actor as well.<br><br>As already mentioned, Bryan Cranston excels in the role. Phillip goes through such a wide range of emotions from despair to pure joy and back again that you can't help but be impressed by the performance.<br><br>On the female side of the cast, it's really nice to see Nicole Kidman in such a quiet and understated role and it's nicely done; Aja Naomi King does a nice job as Dell's protective ex-girlfriend Latrice; and there's a nice female cameo as well, which I won't spoil since I wasn't expecting to see her in the film.<br><br>As a standalone film it has some laugh-out-loud moments, some feelgood highs and some moments of real pathos. The audience I saw this with was small, but there was still a buzz in the room and sporadic applause as the end titles came up: God only knows that's unusual for a film! The director is \"Limitless\" and \"Divergent\" director Neil Burger, and it's a perfectly fun and innocent night out at the flicks that I commend to the house in this month of celluloid awards heavyweights.<br><br>(For the full graphical review, please check out One Mann's Movies on the web or Facebook. Thanks).","user":"bob-the-movie-man","rank":[208,262]},{"title":"Truly inspirational!","rating":9,"date":"23 June 2019","review":"A real relationship between two people with very different problems who find each other's friendship the key to happiness.<br><br>One of the best movies I've seen a long time. Highly recommend. Great acting by all.","user":"bluebeag","rank":[30,37]}]