[{"title":"A ludicrous third act holds down an otherwise intense, realistic thriller.","rating":6,"date":"7 May 2015","review":"The Call was an interesting watch. I don't think I've ever seen a movie build up so much tension in the first couple acts and just spiral out of control so badly in the final act. Did anyone like the end of this movie? I don't know, I tried to wrap my head around it but I just can't. Anyway The Call is about a 911 operator Jordan played by Halle Berry who gets a call from a girl who has been kidnapped by a serial killer. Turns out this is the same killer that Jordan had dealt with a few months earlier who ended up killing the girl she was on the phone with. Jordan took responsibility for her death because she inadvertently got the girl caught by calling her back on the landline which allowed the killer to hear the phone ring and ultimately find her. Since then Jordan stepped away from being an operator and took on teaching until the day the call came in about the same guy with the same MO and Jordan is the only one who can talk the girl through this delicate situation. <br><br>I love the premise of this movie - it's heavy on the dialogue but it doesn't go overboard with the drama. Everything is down-to-earth and realistic for the most part. It feels like you're genuinely watching a 911 operator help someone through a kidnapping and this is largely due to the acting by both Berry and Abigail Breslin who plays the girl in the trunk. The first couple of acts are fairly slow on action, but there are plenty of nail-biting scenes and overall tension building that keeps your eyes glued to the screen. Now, the third act kicks things into overdrive in every possible way. I won't spoil anything if you haven't seen it, but it essentially goes from Halle Berry the psychologically unstable 911 operator to Halle Berry the idiotic superhero. She starts doing things that are horribly out of character and it lessens the believability to the point where the tension falls flat. It was still fun to watch and I don't think it ruined the movie by any means, it just dampened what could've been a really effective down-to-earth thriller.<br><br>The antagonist of this movie is a mixed bag. The actor Michael Eklund is great in the role. He has played creepers before, namely the Dollmaker in Arrow which I thought he was fantastic in. Here he's your standard psychopath, or at least he starts out that way. As the movie progresses you find more things about this guy and his motive becomes really confusing. We discover that he has a shrine to his sister who died of cancer in his room, and there are pictures of what looks like an incestuous relationship between he and his sister before she died, and then it turns out he's a hair fetishist who scalps his victims while they're alive to preserve their hair and puts it on a mannequin head, presumably to keep the memory of his sister alive. All of his victims are blonde girls like his sister was so that's the only reasonable motive I can think of, but they explain it so poorly and throw all these weird character traits at the guy that it just gets confusing and weird. I'm sure the filmmakers just wanted to make him as creepy as possible so yeah I guess it worked.<br><br>Again, I really enjoyed The Call and was invested throughout, despite the drastic tone change in the final act. Seriously I have no idea what the writers were thinking with the ending but wow. There are many things you can pick apart about this movie but I rate things on how much I enjoyed them and I thoroughly enjoyed The Call. I'm not sure I'd ever watch it again, but it was gripping in the moment and I recommend it to any fan of serial killer movies or psychological thrillers.","user":"lnvicta","rank":[98,111]},{"title":"2nd Half Lost the edge","rating":6,"date":"28 December 2018","review":"The first hour was decent - a 911 operator on a call with a kidnapped teen. While artistic license was taken here too, I was able enjoy the movie. But, while I'm pretty good at suspending disbelief, I just couldn't get over the police storming into the empty house and then leaving. It had a \"taking my ball and going home\" feel to me. I would expect another team to come in and start scouring the home looking for evidence or clues to find the teen, or at least learn more about the abductor. But no - everyone just up and left leaving it open for Jordan to go back and investigate on her own.<br><br>The ending was also pretty stupid. First, if Jordan so easily found the trap door, it's pretty likely someone else will find it (since the police know the location, they should be back....or maybe not.) Also, the other victims could potentially never be found. Jordan was in a bad spot earlier with a bad decision. Really bad ending.<br><br>It really seems like two different people wrote this movie.","user":"Jenna1992","rank":[15,15]},{"title":"Good thriller with a couple of weak spots","rating":7,"date":"14 March 2013","review":"I enjoyed this film quite a bit: it kept a good pace of tension which makes for a good thriller. The acting is good (no academy awards), and it did a good job of giving a glimpse into the operations of 911 call centers which is a fresh topic - and it did so without dragging the pace.<br><br>The main bad guy becomes ever more creepy as the plot progresses which helps build the tension. The ending takes an interesting twist which, in the moment, doesn't feel quite as out-of-character as others describe - mainly due to a good segue shot that probably took more than a few takes to get right. <br><br>The weak spots consist mainly of some CSI style technology leaps that only technology morons would buy into, and a single bit of clumsiness that just feels scripted. Unfortunately the CSI technology leaps are very popular in Hollywood (to my dismay) and the bit of clumsiness is key to the plot progression.<br><br>If one or two minor transgressions make you feel like you wasted your money, wait for it to show up on Netflix. If you enjoy a good edge of your seat thriller and can overlook the transgressions, go see it!","user":"hotsocket","rank":[124,172]}]