[{"title":"Technically reproach-less","rating":8,"date":"19 October 2012","review":"In 1810 Napoleon sent Marshal Massena (who was famous then and called \"the dear son of the victories\" I think that by Napoleon himself) to invade Portugal for the third time (French army had been defeated there twice before). The Franch army now entered the center of the country and marched to the south with relative facility despite having been beaten at Buçaco by the Anglo-Portuguese troops who began to withdraw to the south till they reached the Lines of Torres Vedras a huge mass of fortifications built in secret by Wellington in the previous one and half year behind which they entrenched themselves always under Wellington command. The French army after being before the Lines for some time realized they were unconquerable and retreated for good. This movie is about that but who is hoping to see a historical movie may be somewhat disappointed because though the story develops itself having that war as a background it is much more about the personal adventures and misadventures of its characters not only the main ones but some minor ones too. It is very good from the technical standpoint I mean the scenes, camera movements, sequences, angles of view, framings and visual details are very good indeed. The acting is also excellent with a luxury cast with such actors like John Malkovich (as Wellington)and the Portuguese Nuno Lopes. The reproduction of the epoch atmosphere in sceneries and costumes is also excellent. The main flaw that can be appointed to this movie is that the story somehow lacks a thread, losing itself among scattered and diverse episodes although very well shown and developed. And in terms of social usages (certain love scenes for instance) and language employed there is some inadequacy to early 19th century seeming much more as belonging to our contemporary meanings and values.","user":"valadas","rank":[24,32]},{"title":"The Horrors of War","rating":7,"date":"13 October 2012","review":"Like The Mysteries of Lisbon this film was adapted by Raoul Ruiz from a novel by Camilo Castelo Branco. However, after Ruiz's death it was directed by his widow Valeria Sarmiento. It depicts the retreat of the Anglo-Portuguese army under the Viscount- as he then was- Wellington to the Lines of Torres Vedas and the civilians forced to retreat with them as a result of the scorched earth policy imposed by Wellington. Malkovich's Wellington isn't much like the original. Malkovich is twenty years too old for the part and looks nothing like the original to begin with. He is shown almost entirely in his relations with a French exile painting his portrait, complaining about too many corpses and not enough panache in pictures of battles and wondering whether being known for inventing Beef Wellington is a compliment. About the only suggestion that Wellington was a military genius is the repeated emphasis that he had ordered the Lines to be built over a year before and had anticipated his eventual retreat to them before the start of the campaign. There are only two curious scenes which suggest other aspects than buffoonery to his character: one where he watches through a telescope an aide has given him an idiot boy stagger through the retreating mob of civilians looking for help. Does he know the human cost of his policy and escape it in absurdity? The other- his last appearance- where he gazes at a portrait of Bonaparte. Does he want to look like Bonaparte? Does he want to be Bonaparte? Is he getting into the mind of his opponent like Montgomery with Rommell? It's impossible to say.<br><br>Fortunately, Wellington himself is a small role. The main emphasis is on individuals caught up in the retreat- a Portuguese sergeant, his wounded lieutenant, the Irish widow (with a cut-glass English accent unfortunately) of one of Wellington's soldiers, a Portuguese whore, an Anglo-Portuguese girl with a taste for incest, an at-first-unidentified French soldier, the French general Masséna's transvestite mistress in a hussar's uniform, the idiot boy, an aristocrat fleeing with his library and searching for his vanished wife, an apparently unscrupulous pedlar...these are just a few of the characters involved. On the one hand, they are often so interesting that we'd like to know more about them; on the other, they never stay long enough to bore or annoy. A plot does emerge gradually with quite a few characters involved, but it is the line to connect the various events- a series of horrors and atrocities, some recounted in a grimly comic way. I've never seen any of Sarmiento's films so I can't say how this differs from the way Ruiz would have directed it- the grim humour, or its openness, is hers rather than Ruiz's, I think, and a certain lightness of touch. One astonishing thing is the effects obtained from a fairly small cast and a small budget; we are never aware that we are watching 'armies' of a few dozen people. One complaint- the Portuguese T.V. version is three 60 minute episodes; the film is 151 minutes long- only thirty minutes shorter. Given that, why not let us see the lot? It would still be shorter than The Mysteries of Lisbon.","user":"allenrogerj","rank":[13,17]},{"title":"The production is very good, but as a movie it disappoints!","rating":6,"date":"5 April 2013","review":"Set in a very hard period of Portuguese history, the French invasions (It was the last time Portugal was invaded by a foreign army), LINHAS DE WELLINGTON is a movie that essentially worth for that: history! <br><br>It's not a history lesson or something, but in my point of view the strong features of this film are just characterization and production. I mean the settings, the costumes, the all ambiance created portraying this period of history (beginning of the XIX century) are very good, and above the normal standards of Portuguese films/productions; but all the rest is not that good and it's even a bit disappointing I must say! <br><br>In my opinion the movie is too long extended (it wasn't needed over two hours and half to a plot like that! At parts it even seems to have all those minutes just to be more similar to the epic movie that tries to be, but it's not! The musical score also falls in this fallacy) and it's very slow paced (even a bit boring at parts).<br><br>There're no action scenes (absolutely needed to a movie that aspires to be connected to the epic genre, I think) and the plot is divided for so many characters that (as some other IMDb users said) we almost don't even know who are the most important to this movie! The Duke of Wellington is terribly portrayed by John Malkovich, not because of his fault (he's a great actor by the way), but because the way it was chosen to portray such important figure Not to mention the roles of Catherine Deneuve or Chiara Mastroianni (among others) which just appear in the movie just to make a presence and put their names in the cast <br><br>So, for too many reasons, I think this movie tries to be something bigger than it really is It's missing here a lot of things to make it a really epic and remarkable film! Before I watch it I was expecting one of the best Portuguese movies ever but after 30 minutes of watching it my illusion vanished It's one of the best in production though (very nice costumes and sets).","user":"mario_c","rank":[16,23]}]