[{"title":"An Amazing Movie","rating":9,"date":"28 July 2016","review":"I heard about Big fish &amp; begonia (Da Hai) in 2013 and I was shocked by the 5-minute trailer at that time. At first sight I thought it was a Ghibli movie again, but then I learned about that the core story got some inspiration from some ancient Chinese proses, such as \"A Leisurely Tour\" by Chuang-tzu and ShanHai Jing. As a Chinese, I know I can't describe my feeling perfectly in English, but I just want to say that Big Fish &amp; Begonia (Da Hai) is a very moving and wonderful movie which can make me cry every time. It tells a story about salvation, love and growth. It's totally Chinese, from these good pictures to the touching story. I hope one day the movie can be released in some other countries, so that more and more audience can enjoy its beauty and be moved by it.","user":"d-57774","rank":[38,50]},{"title":"One of the best animations among these years","rating":10,"date":"18 July 2016","review":"It's not only a movie about love,but also a movie about dedication and toredeem.It's not clearly said what it want to show,but if you see the second time,it will be better.So i think it's a good movie. Some people who only see the movie one time is hard to make a gooe comment,because it's so obscure that hard to see.Da Hai is not like the movies made by Hollywood,it like a novel more,which want the viewers to watch twice or more in order to understand it.When I see some people think the love story in the movie is very unpleasant,I really want to tell them:it's better for you to see the twice time,because it never tell a love story,but a philosophy story.","user":"i-73517","rank":[29,42]},{"title":"One of the most amazing films I have ever seen, animated or otherwise","rating":10,"date":"25 March 2017","review":"The standard for animated excellence is usually boiled down to how well it compares to a Ghibli film. No other studio makes animated films with such vision, creativity and originality. I was shocked to find a similar work ethic in this Chinese film, and I have to say, if they keep it up, we actually might have another contender to the throne. This movie does so many things right, that I could go on and on taking up valuable site space, so I'll just condense my review to as simple a review as possible; Watch this movie by any means necessary. The animation is beautiful the story is touching, the music is transcendent. It is a marvel of modern storytelling, and it deserves to be seen by everyone with a pulse. SEE THIS MOVIE.<br><br>Seriously.","user":"manuelasaez","rank":[25,37]}]