[{"title":"Visually outstanding achievement. Underrated by critics and worth the watch","rating":8,"date":"31 December 2014","review":"Automata' (2014) is a critically underrated and atmospheric science- fiction thriller in the same vein as 'I Robot' and 'Blade Runner'. It boasts excellent visual effects, as well as an engaging and intelligent story. While it borrows from other science fiction it does so successfully, especially the atmospheric and decaying world we're thrusts into from the beginning.<br><br>The story centers around Antonio Banderas's character, Jacq Vaucan - a world-weary insurance agent for a robotics corporation whose job is to investigate robots violating their protocols which are one: harming any form of life, and two: they can neither repair themselves nor alter another robot in any fashion. On the trail of a robot Vaucan discovers a robot stealing parts in an apparent attempt to alter itself. This leads him to the clock master - a fixer who may have just succeeded the second protocol.<br><br>Automata is a throwback to thoughtful science fiction. It's not for the feint of heart but if you're engaged and buy into the world and the premise then you'll be rewarded. The film surprised me in a lot of ways - especially for such a relatively small budget but imagery is fantastic and the effects are mostly practical, and built with little computer generated imagery save for some backgrounds and action scenes which make it that much more realistic.<br><br>It's slower and probably has less action but if we're comparing it to what it will inevitably be compared to, 'I Robot', Automata is a better movie. More thoughtful, grittier and executed a whole lot better visually. It's not a perfect flick by any means but it's worth watching and deciding for yourself.<br><br>7.5/10","user":"pootc","rank":[135,161]},{"title":"A Blader Runner based on Asimov, rather than Dick, and made by Europeans","rating":9,"date":"11 October 2014","review":"I am myself to blame for only looking at IMDb ratings and the occasional movie trailer from the mall screens, but I still can't believe that this is not a movie that everyone is talking about. It's great!<br><br>A post apocalyptic movie made by Spain and Bulgaria, it shows an insurance agent (the only people who actually do any motivated detective work :) ) trying to find out what is going on with robots behaving strangely. Two laws are restricting said robots from harming people and from altering any robots and it appears someone has found away around these hardcoded rules.<br><br>The film reminded me of Blade Runner, obviously, but it went a slightly different direction, more akin to Sector 9. The gruesomeness of the dirty city and the violent slums outside it is clear and uncompromising - think Brazil meets Cidade de Deus. The acting is good, slightly overemotional in the case of Antonio Banderas - but he is Spanish, so we understand, and completely balanced by the coolness of the Blue Robot (Javier Bardem, lol). I couldn't really find a problem with the direction and the script was great!<br><br>So, bottom line: a wonderful film. It shows that it is not the highest budget movie in the world, but it more than compensates through story, details, acting and even casting. I thought McDermott's character was a very good one to explain the overall attitude of humans towards robots and it felt like they could have added some more to it. If you liked Blade Runner you will love this movie! See how a little European vision can change how a movie feels to you.","user":"siderite","rank":[232,314]},{"title":"In the unending parade of bland, horrible movies this stands out as a gem","rating":9,"date":"19 October 2014","review":"I watched this movie without any preconceived notions. In fact, I didn't even know what it was about. I was VERY surprised. Rarely does quality come out anymore. Most movies are all flash and no substance. This however was vastly different.<br><br>The movie has a lot of depth that makes you think. I wasn't so sure about casting Antonio Banderas in it however. He did fine, but I think it could had easily done as well or better with another actor. The end result is, however very well made. If you're looking for a Michael Bay film you will be disappointed however. I sincerely wish more movies like this were made. I know it's not going to be everyone's cup of tea, but it is different from the rest. You will be pleasantly surprised.","user":"starfleetengineeringcorp","rank":[165,223]}]