[{"title":"A feel good movie","rating":7,"date":"15 September 2016","review":"This isn't going to win an Oscar or an Emmy but I really enjoyed it. It's a silly funny movie. Nothing to take to serious. It's been years since I've seen Alicia Silverstone. If your going in expecting to be wowed you might be disappointed. It's about two people who are splitting up and who both really love their dog. Who gets dog. And it's nice to see Ryan Kwanten in something else besides true blood. They both do well in the movie. If you've watched Marley and Me with Owen Wilson and Jennifier Aniston and you liked it. Then it's a good indication you'll like this one as well. For what it is... I think it's a good movie. You'll walk away from this feeling good.","user":"skyloche","rank":[17,26]},{"title":"Entertaining and fun. Great family movie. Fun to see Alicia Silverstone back in action!","rating":10,"date":"4 October 2016","review":"Our family very much enjoyed this movie. Great shots of Chicago. Very cute dog. Great chemistry between the lead actors. Has a \"Mrs. Doubtfire\" feel and good message. We liked the story line and appreciated the wholesome humor that appealed to both our kids and us as adults. Will definitely watch again. My kids loved the hockey scenes. You frequently see this category of movie made anymore. Dog lovers will love it. Funny supporting actors brought levity and humor to several scenes. Look forward to more movies like theses from these writers - did a great job of making it all funny and believable. Surprised that this movie didn't make it to theaters. Would have loved to see something non-animated that appeals to kids and adults alike.","user":"stacybuss","rank":[13,21]},{"title":"Rom-Com Becomes Tedious","rating":2,"date":"27 October 2016","review":"Unfortunately, I wasn't able to find a whole lot of humor in this romantic comedy, starring Alicia Silverstone and Ryan Kwanten. Having marital problems, they're in the process of separating, yet they equally love their dog Wesley and can't seem to reach any compromise as to where Wesley should end up. Thus, they begin a custodial court battle for their dog, which, in my opinion, just seems to drag on and even get quite tedious.<br><br>Although the leads' passions for Wesley seem genuine, this weak scripted movie never seemed to gel into a funny or enjoyable film, and by the time the predictable ending occurred I really wasn't that interested anymore.","user":"larrys3","rank":[5,7]}]