[{"title":"So stupid","rating":1,"date":"4 July 2013","review":"This is the stupidest movie I have ever seen. The \"deadly\" snakes in this movie consist of non-venomous king snakes and corn snakes. Harmless. Corn snakes do not even live in the desert. Either the people who made this movie are retarded or their budget was to afford snakes that are not family pets. Also, when the snakes are in the scene, a rattling sound plays. These snakes are not rattle snakes. Maybe it would have been more believable if they used rattlers and if the lady didn't walk through the desert for 10 hours with nothing more than a few dizzy spells caused by the deadly little king snake. The plot made no sense. The girl had an Ipod and could research snake bites but not send an email for help?","user":"jaynellekenney-729-163638","rank":[22,27]},{"title":"Everything including the end sucked","rating":1,"date":"18 September 2018","review":"It would have been kinda ok if the snakes were poisonous. But they were all harmless and don't even live in the desert.\nHow is it that everyone died almost instantly from being bit by the snakes but she made it.\nAlso why the heck show a snake on the cover that is not even in the movie ( false advertisement ) and the ending was completely stupid couldn't have even showed them being rescued and having the money .\nThis is one of those stupid movies you continue to watch just to see if there is a good part at all and there wasn't...","user":"leapordgirl","rank":[3,3]},{"title":"Waste of Time","rating":1,"date":"24 December 2013","review":"OK, the writer, director and producer should all be left in a desert without water or food for two weeks for creating this piece of crap. It is their job to entertain us, not bore us to death to the point of praying the snake will catch up to Helen and Lily and end their lives. What person throws away their cell phone in the desert? Is she to stupid to turn it off if she doesn't want to talk to her husband? How does a man get shot in the back, with the bullet exiting his shoulder (you see the blood and bullet hole when it happens) then carry a suitcase full of money with the bad arm, later pouring water on what appears to be a scratch on his bicep. Another guy gets shot three times and shows up later without a sign of any wounds to have a climatic fight. Even Lily had more sense then the mother when it came to making decisions. I guess all the drugs the Mom does at the start of the movie sets us up... she is a world class loser. Skip the movie... it's a waste of time.","user":"thomas_mills","rank":[5,6]}]