[{"title":"A big flying turkey - SPOILERS","rating":3,"date":"4 May 2015","review":"Oh dear.<br><br>Takashi Shimizu has proved he's a capable director with the iconic Ju-On films, and the inferior but still entertaining American remakes.<br><br>I honestly can't explain how 7500 manages to be so irredeemably terrible.<br><br>It has a good cast, though nobody puts in anywhere near their best performance, probably due to the utterly idiotic script. The interpersonal stuff is actually decent: the couple stuck on holiday together after breaking up due to repeated miscarriages have some real pathos to them, and the two featured flight attendants have interesting personal lives that invite you to care about them.<br><br>On a technical level, the film gets almost nothing right. We seem to have two flight attendants looking after an entire 747 full of passengers, a paramedic who gives up CPR after about thirty seconds, and a pilot who decides not to turn back and make an emergency landing but instead to proceed with the remainder of an eight hour flight after a passenger dies after only an hour in the air. The whole film is packed with this kind of idiocy. Oh, and low pressure? It makes plastic bottles POP, not SQUASH, you IDIOTS.<br><br>All the technical errors in the world could be forgiven, though, if 7500 simply worked as a horror film. This is its greatest failure. The scares are either out of nowhere cheap shocks or built-up moments of supposed terror that provoke a sigh and an eye-roll instead of a scream.<br><br>Then there's that ending. Oh god, the ending...<br><br>Okay, from here on there be SPOILERS...<br><br>.<br><br>.<br><br>.<br><br>.<br><br>Still reading? Okay, the SPOILERS begin now...<br><br>On what planet is that \"they were dead all along\" twist still even remotely original or appropriate? Memo for you, Hollywood: Carnival of Souls was made FIFTY YEARS AGO. This is not a shocking revelation any more. STOP USING IT.<br><br>The only way to make this ending work is to do something new and clever and daring with it, like Shyamalan did with Sixth Sense. Rewatch Sixth Sense and you will see that it is littered with clues, and even knowing the twist there is a wealth of cool details to discover.<br><br>7500, in contrast, has nothing. There are literally no clues to the twist ending. It literally comes out of nowhere. Even the attempts to insert some logic into the random string of deaths makes no sense.<br><br>We're told the shinigami will come for prematurely dead souls after they have let go of whatever is holding them on earth. Appropriately, then, two different characters are seen giving up something important to them, and then dying soon after. If this was carried through the film, giving it some structure and sense, then it would have been a much better movie.<br><br>But no - most of the characters die for no apparent reason.<br><br>Oh, and the revelation of the big \"they've been dead all along\" ending is also delivered without any thought or sense. For most of the film they can't see all their own corpses, then suddenly they can. Why? I have no idea. It's like a large chunk of story was edited out.<br><br>What a bad, bad film, and a terrible waste of a group of actors I have seen do much better work, made by a director whose best work is in the rear view mirror and shrinking fast.","user":"DexX","rank":[26,33]},{"title":"Fairly entertaining","rating":6,"date":"5 September 2014","review":"Not too bad. Not very scary either, but entertaining. <br><br>It's not a waste of time but might be a waste of your money depending on what you pay to see it, and what the alternatives are. <br><br>The ending was truly shocking - I did absolutely not expect such an unoriginal resolution. <br><br>-1 for that.<br><br>Not much more to say, and I don't see why IMDb requires 10 lines of text in the review. <br><br>Not all movies are made by David Lynch and needs to be analyzed to death.","user":"imdb-872-221442","rank":[57,79]},{"title":"Disappointed","rating":2,"date":"9 July 2015","review":"I waited years to see 7500, after numerous delays I thought I'd never experience it. The trailer looked promising, and rather terrifying too. Finally, I've seen this supernatural thriller set on a plane, and I am wholly disappointed. 7500 looks cheap, the dialogue is so unnatural it makes for unintentional laughter and the characters have no backstory or depth. Praise however goes to Nicky Whelan, whose performance is very real and rather amusing at times as a clean freak chatterbox who feels the need to boast to any passenger in her proximity. I've met people like this in real life so this character is relatable and plays a good foil to the supernatural element...An element that fails thanks to some of the most shopworn and cheap jump scares ever put to film. Without an eerie atmosphere or dread, this flight is grounded.","user":"james1080-272-547223","rank":[15,19]}]