[{"title":"I quite enjoyed it","rating":7,"date":"2 June 2012","review":"Well I did!<br><br>After watching the trailer and reading some of the website previews I kind of knew what to expect. Yeh its a bit cheesy and a little homo erotic, but I think it was supposed to be that way. I certainly didn't watch it to be blown away by special effects and if you removed them you still have some pretty interesting characters.<br><br>The film is a bit of a slow starter but by no means boring, tension between characters is quickly established. It was great to see the Australian bush and there were some beautiful locations. The ending is pure '50's sci fi and I hope they make a sequel! It was a fun way to spend an evening.","user":"cityjak","rank":[21,24]},{"title":"Ultimately weak Aussie genre hodgepodge","rating":3,"date":"7 April 2013","review":"The worst type of movies that exist are the ones that initially look like guaranteed \"this-can't-possibly-go-wrong\" entertainment, but then ultimately turn out to be dull, dumb and embarrassingly incompetent disasters. I was tremendously looking forward to see \"The 25th Reich\", even though just solely based on the fact it's an Australian B-movie production with an awesome poster and a terrific sounding two-line plot synopsis. Moreover, thanks to the marvelously eccentric \"Iron Sky\" last year, I'm always interested in seeing more Sci-Fi Nazi-nonsense. But, as said, sadly enough \"The 25th Reich\" isn't nearly as fun as it looks, mainly due to its completely incoherent content and the hopelessly failing attempts to insert satire and homages to the genre's glory days. Apparently based on an obscure novel, the film revolves on five American soldiers on Australian soil in 1943; assigned to trace and capture two escaped black panthers (yes, that correct). Through a series of bizarre events, they end up getting catapulted back in time 50,000 years and stumble upon the ideal weapon to beat the Nazis: an abandoned alien spaceship! But it would also make a forceful weapon in the hands of the Germans as well, and there happens to be a traitor in the platoon. Personally I was astounded how a B-movie featuring Nazis, Jewish allies soldiers, time-traveling, Aussie wilderness locations and – most importantly - giant robot spiders turned out to be so underwhelming and bleak. Admittedly a few aspects of the story are greatly inventive and a small number of sequences (like the animated opening credits) are sublime, but overall the film is a forgettable misfire. The cheap but charming set pieces stand in sheer contrast with the lame CGI special effects and the odd rape sequence is totally random. I read the film already built up a minor but loyal cult following, and I certainly do admire writer/director Stephen Amis for the worthwhile attempt, but this isn't my idea of retro cult/trash.","user":"Coventry","rank":[11,12]},{"title":"It is what it is so laugh, drink your beer and watch it","rating":6,"date":"1 August 2012","review":"There is a particular genre of movie which has always been made and hopefully will always continue to be made. They are usually low budget but we love them anyway (maybe because of this). <br><br>What The 25th Reich reminds me most of is movies like \"Them\" (the 1950s scifi about giant ants). Its tongue-in-cheek fun. <br><br>The 25th Reich doesn't have giant ants by the way.<br><br>It has good guys, bad guys, and hillbillys (I think he was a hillbilly?) its a good old fashion scifi with a few unexpected moments thrown in which make you laugh (or wince). The special effects were better than I expected (I wasn't expecting much), the cinematography was good, the music was good, the acting was just the right level of hammy (I thought)<br><br>Is it a classic? Nope. Did I enjoy it? Heck yes :)","user":"gambit70","rank":[15,20]}]