[{"title":"Begins with a promising setup and eerie setting, but quickly falls victim to shoddy camera work and predictable horror tropes.","rating":4,"date":"6 June 2015","review":"Chernobyl Diaries a hollow shell of a movie: It has a good premise and the perfect backdrop for a horror flick, but with absolutely no substance. That's the best way I can describe it. The vacant radiation-laden Chernobyl is a wonderfully creepy place for a horror movie to take place. It sets up with a group of friends touring Europe and one of them has the bright idea to go on an \"extreme tour\" so they make a quick pit stop at Chernobyl. They see an abandoned ferris wheel, they explore the empty buildings, they see the remains of dead animals - it sets up an effectively creepy atmosphere. One of the girls takes a picture and something odd can be seen in a window. Weird, right? Well apparently not weird enough for her to say anything. After they snap a few pictures with the beautifully bleak backdrop of dead trees and industrial smoke stacks, they go back to the tour van. Then the entire bottom of the movie drops.<br><br>From there it's cliché city. Cars not starting, people going places they shouldn't, people splitting up when they shouldn't be - everything gets so dumb so quickly it's unreal. You stop caring about the characters after a while because they're making stupid decisions so there's no one to root for. The only character with any personality was the tour guide and he is hardly used, so we're left with six unlikable people struggling to find their way out of the city while getting picked off one by one. It simply isn't interesting. There are no scares and there is little to no suspense. It's just \"shhh I hear something...\" and then \"oh no, something's around the corner\" and then they get attacked and it's like 'well yeah, of course that's going to happen'. It's too predictable for it to be scary, and it's too disjointed to make it unsettling. It's just watching and waiting for these characters to die so the movie can end.<br><br>The disjointedness mainly comes from the directing. The first shot leads you to believe it's a found-footage movie, but it isn't. It is just shot that way - shaky cam, quick movements, no clear view of anything really. It just makes no sense because we know someone's holding the camera and it acts as a person, but the group of people are oblivious to it so it's like an invisible, mute character that allows us to see through its point-of-view. I don't know why they thought it was a good idea to film it that way because it gets noticeably worse as the movie goes on: The more stressed the characters are, the worst the camera work gets. It's incredibly annoying.<br><br>Which leads me to believe the only thing the writers had for Chernobyl Diaries was its premise - a group of kids stranded in Chernobyl. Then they were like \"well, now that they're stranded in this creepy, radioactive, vacant city... let's just have them run around and get killed off one by one until the end.\" It's just lazy writing. The entire third act feels rushed, not to mention the horribly anti-climactic ending. Chernobyl Diaries is a flop; uninspired, boring, and worst of all, completely unscary.","user":"lnvicta","rank":[84,95]},{"title":"Great Idea Poor Execution","rating":5,"date":"27 June 2012","review":"This COULD have been a great film. The idea behind it and the setting builds tension and the first half of the film isn't bad. The second half lets it down. Poor cinematography means half the time you have no clue whats going on. Many of the shots are just to dark to be able to see around the characters leading to confusion as to what exactly is going on. The ending is also half done. It was like the writers just shoved it in there as an extra with no thought.<br><br>Its sad because its well acted and has some good startle scares unfortunately most of these are in the trailer.<br><br>Wait for the DVD,","user":"brababe","rank":[125,150]},{"title":"Kill them already!!","rating":4,"date":"12 July 2012","review":"Straight to the point: Chernobyl Diaries has some of the worst acting/script/motivations I have seen in a movie, along with incredibly predictable 'scares'. YET, it has probably the best untapped location of any horror.<br><br>From the offset, you're introduced to some 'cool' kids who'll annoy the hell out of you immediately. Nothing is believable, none of the characters connect with you or each other. I hated the characters so much I was literally waiting for them to be lynched by the monsters. The only characters/actors I appreciated was a tour guy who takes them to Chernobyl and a hippie Australian who tags along with his hollow girlfriend.<br><br>Not surprising (and this was the reason I went to see the movie) was the fact the movie improved ten-fold when they arrive in Chernobyl. The location is astonishingly eerie and you can easily believe the myths of mutants living there. Here the film actually becomes scary to some extent and you feel yourself tensing up.<br><br>Until of course, the actors interrupt your concentration with some appalling, predictable stuff.<br><br>And so the finale winds down with your typical 'running blindly (literally at the very end), being chased by hordes of evil freaks'. And characters don't die so much as get whisked away into the darkness. Whenever the movie builds up to something scary, it's always undone by a disappointing result, leaving you a little bit deflated each time.<br><br>So that's what I thought. I would love to recommend this film for the location alone, but I could never, ever, recommend you see this film for anything else.","user":"audacity10","rank":[64,83]}]