[{"title":"Great","rating":9,"date":"23 February 2020","review":"A film rich in symbolism and meaning, with a superb performance by Geoffrey Rush. Better than average cinematography and a twist that keeps you thinking and considering the message long after the film has ended. (Tell me the statute Rush hides behind isn't a brilliant allegory for the entire film! Brilliant!) The music gets high marks as well. Highly recommended -- even if you're only looking for a good caper movie.","user":"MR_Heraclius","rank":[43,44]},{"title":"Art Into Life","rating":10,"date":"21 May 2013","review":"Great movies have the power to make you think and this movie had me thinking for so long I couldn't sleep on the night I saw it. It is a tremendous film with a deeply unsettling message and even now, 24 hours after seeing it I am haunted by the end.<br><br>It's a fairy story and nightmare rolled into one. It's not what happens that's important it's how it happens. the story is great but the plot is even better.<br><br>Forget the bad reviews and make up your own mind. If you subscribe to the notion that Life imitates Art or Art imitates Life go see it. You won't be disappointed.","user":"dgilligan17","rank":[216,257]},{"title":"Capolavoro!!!","rating":10,"date":"14 January 2013","review":"I still can not describe my state of mind at the end of the film, a mixture of devastating feelings that left me breathless, a state of mind that only the greatest movies are able to leave, and this is one of those movies ! Inside there is so much stuff to talk about that in a comment like this is highly simplistic! If you love art, psychology, suspense, love stories, in short, if you love life, this movie will surprise you. A great cast of characters and works of art (TONS!) complete the work and make it an unmissable, different from all the other great movies of Tornatore. Beware then by those who want to associate this film with a film of Hitchcock because it means dismantle and destroy the film, this film is much more! Thrilling is only one small part of a masterpiece of international cinema! Absolutely a must see!","user":"jerryos","rank":[318,390]}]