[{"title":"Moby dick + deadliest catch meets space","rating":6,"date":"14 December 2018","review":"This is obviously B-movie fare. The actors, the story, even the whole idea is very much not top of the line.<br><br>BUT the production values are surprisingly good. I was frankly amazed at how well the CGI and sets stood up compared to the rest of the movie. The creatures are not as well made as the rest of the CGI, but still a fair notch above standard B movie quality.<br><br>If you are a scifi geek the world it is set in is enough to see it. The story itself is kind of lame. 5 stars for sets, CGI and space. 1 star for all the rest.<br><br>PS\nThe guy saying that the effects are bad obviously wrote his review based on the poster and name of the movie.. No way he watched it.","user":"IamJustTellingyouWhatIthink","rank":[44,50]},{"title":"A suprising indie movie","rating":4,"date":"27 May 2019","review":"I wanted to watch a movie on night and came across a low budget space movie I haven't heard of.<br><br>I must say this movie was pretty good for what it is, for an indie film it surprised me how well the sets and locations looked, The interior of the ship looked believable and the scenes in space were pretty well shot.<br><br>The plot is moby dick in space with the whale being a gigantic alien creature modeled after the cosmic dragon in Chinese mythology, which was pretty interesting. The plot was a bit all over the place and their was a weird slasher bit towards the end of the movie that was pretty dumb.<br><br>The acting isn't great but not so bad that it detracts from the movie, all the characters feel like they fit and are believable.<br><br>It's worth a watch and I think the imdb rating is a bit low especially if you are a fan of sci-fi.<br><br>It's a completely passable space movie that's pretty average that will keep you invested and not bored.","user":"danfurtado-11221","rank":[5,5]},{"title":"Good effort from Ken Locsmandi","rating":7,"date":"15 December 2018","review":"Ken Locsmandi has a long and impressive background as a special effects master. Beyond White Space (BWS) was a very ambitious project for a first time director, since the story is essentially Moby Dick.<br><br>I personally love the idea of rebooting classics into the SF genre. The only problem is that they will inevitably be compared with the classics - very risky.<br><br>Moby Dick already has several excellent cinematic incarnations, most recently Heart Of The Sea. These have been big budget, big name productions able to attract seasoned directors and actors.<br><br>The special effects in BWS are top notch, as to be expected from Locsmandi. The acting however is hit and miss. This has to be laid on the director, since the actors do prove they can hit their mark occasionally.<br><br>I have a feeling too much of the budget went into CG, not filming the endless live takes of inexperienced actors required to hit the mark every time in the final cut.<br><br>Perhaps he should have cast at least one seasoned and proven actor to lead the others. It likely would have improved the overall performance. The acting seemed rushed, impatient even.","user":"dcerisano-27495","rank":[22,31]}]