[{"title":"Excellent comedy, truly original film, not 'just another movie'","rating":10,"date":"8 March 2013","review":"I truly enjoyed this movie. It has an original plot and it isn't over done. Juno Temple was wonderful, and although I'm not normally a film buff, I was so impressed with this film that I couldn't help but put a review in.<br><br>The plot was so unique, and included enough history that you really start to wonder... <br><br>A great dark comedy - it's not a stupid comedy, it can really make you think. How far would YOU go? What would YOU do if you had possession of the teapot? If a movie can make you think - actually think about what you'd do - it's a successful film, in my opinion.<br><br>Great film - great cast! This is one I'll purchase to keep in my home to watch again!","user":"barb-627-568728","rank":[59,75]},{"title":"As Ramaa Mosley's debut film, \"The Brass Teapot\" shines.","rating":8,"date":"13 April 2013","review":"Ramaa Mosley's debut film \"The Brass Teapot\" stands out as an enjoyable indie flick. Having been a fan of Juno Temple for quite some time, it's nice to see her breaking out into larger roles.<br><br>The acting in the film superb, and the plot plays out well. The film is quite enjoyable all around, and makes you question your moral integrity when you put yourself in their position.<br><br>The temptation of money is a powerful one. How far would you go to get all the money you have ever wanted?<br><br>Ultimately, it's an enjoyable film that you should check out given the chance.","user":"uzumaki_naruto_the_hokag","rank":[34,43]},{"title":"Surprisingly good","rating":8,"date":"18 March 2013","review":"I read the plot for this one and thought that it sounded a bit lame. But it was, in fact surprisingly good! It was certainly original - even though we could guess what would happen at times, when it did happen it was much more entertaining than expected.<br><br>The stars, Juno Temple and Michael Angarono were a great combination. But the plot didn't rely solely on its central characters to provide the fun - there were a couple of great sub-plots in there - the sister and her husband were an excellent addition to the storyline, as were their snooty friends.<br><br>I thought that the inventive ways in which the characters tortured themselves was hilarious, for me the only danger seemed to be that at some point the plot would get too dark and lose its sense of humour. But I'm glad to say that it didn't'. Im scoring this an 8 because I really did enjoy it all the way to the end!","user":"JenEvans1","rank":[19,25]}]