[{"title":"hilarious, entertaining, over-the-top!","rating":10,"date":"31 August 2013","review":"I am not sure why this film has received such low reviews. The film opens up with Mrs. Wattlesbrook (Jane Seymour) holding a fake lamb and talking about Austenland, which I think greatly sets the tone for what type of movie this is going to be. Going into the film, I knew it had received a low score thus lowering my expectations greatly so I wasn't expecting much. It turns out I didn't need to lower my expectations, this film totally went over and above.<br><br>The critics and everyone leaving a low score have no sense of humor! It's over the top, exaggerated, hilarious, ridiculous, it's supposed to be that way! None of it is believable and once you allow yourself to enter the world of Austenland, you'll enjoy the film. <br><br>The theater possibly has a lot to do with the tone. We had a great audience, everyone was cracking up, loud uproars in all the scenes, it was hilarious. Miss Elizabeth Charming is hysterical! I really enjoyed Jennifer Coolidge's performance, she really did her usual thing and it was wonderful. <br><br>Lady Amelia Heartwright, Colonel Andrews, Captain George East all are so ridiculous and entertaining. The actors all did an amazing job. I honestly have not laughed that hard in a film in a long time. I'm talking laugh out loud, bursting, crying, snort kind of laughing. Even my husband enjoyed himself and found many of the scenes very entertaining.<br><br>I know I haven't talked much about the actual movie but bottom line: it's HILARIOUS. Go in with an open mind, allow yourself to be silly, let go of how \"unrealistic\" it is, and you'll be in for a treat.","user":"heyitsdan","rank":[89,99]},{"title":"For some ladies, like me, going to Austenland is twenty times better than Disneyland","rating":8,"date":"20 September 2013","review":"Jane Hayes (Keri Russell) has been most unfortunate in love. Her boyfriends up to this moment have left her cold to romance. Perhaps, it might be observed, Jane is rather selective in her search, for she is looking for the second coming of Mr. Darcy. A fan of Austen since she was thirteen, her small apartment is decorated in the Empire fashion, with a large cutout of Colin Firth in his role as Darcy. So, when a former flame comes to her place of work, telling her that he is her last, best hope, Jane hatches a desperate plan. She will sell her car and use all of her savings to buy a trip to Austenland, a dream adventure place in jolly old England. When she arrives, flush with excitement, she gets a small dash of grief. The snobby manager (Jane Seymour) chides Jane for buying the basic package, gives the American a plainer room than the other guests, and gives her the moniker Miss Erstwhile, which Jane instantly dislikes. Nevertheless, the place is lovely and the actors quite intriguing, especially one, Mr. Nobly (J.J. Field) who has the Darcy role. Alas, he brushes her off, true to the book. Thank goodness fellow guest Miss Charming (Jennifer Coolidge) becomes her bosom friend and provides great comic relief. Yet, when Jane receives criticism at dinner, she bolts out to the grounds where she meets someone who turns her head. This is Martin (Bret McKenzie), hired to take care of the horses and play a servant. Though there is really no mingling between guests and servants, Martin soon becomes Jane's special savior time and time again. Could he be the romance she has waited for all of her life? But, wait, could Mr. Nobly actually be paying more attention to our Jane? Things are becoming muddled! This lovely movie will be a joy to Austen's fans and beyond. How many superhero films have to be released, however, to merit a ladies' flick like this? Quite a few, Hollywood seems to be saying. Therefore, it is this viewer's hope that all women will rush to the closest theater to embrace Austenland in a big way. It has sumptuous costumes, a clever script, a wonderful setting, a skilled direction and enough references to the great lady herself to please most everyone.","user":"inkblot11","rank":[44,53]},{"title":"Great Fun. Remarkable Directorial Debut.","rating":9,"date":"19 January 2013","review":"I saw this Austenland premiere at Sundance yesterday and I was thoroughly entertained. While not a completely original romcom premise, there is enough that is fresh in the storyline to keep you engaged, and at one point even with a whodunit flair.<br><br>Director Jerusha Hess (co-writer of Napoleon Dynamite) has a really remarkable debut. The movie is smart, funny and paces nicely. Keri Russell is at her girl-next-door best, but Jennifer Coolidge feels like she has been cut loose to reveal her outrageous, campy silliness in all its splendor, and Brett McKenzie (of Flight of the Conchords fame) is surprisingly believable and impossible not to like as mostly a straight man. I expect this performance will catapult McKenzie's acting career. Other cast members, including J.J. Field and Jane Seymour, are solid. <br><br>Most of the cast was at the premiere and came on stage for the Q&amp;A. Now many casts at Sundance say they enjoyed making the movie, but you could tell there was something different with this group. They sounded like the REALLY HAD FUN. McKenzie was hilarious live (something few actors are) and I only wish Coolidge had been there. Their enthusiasm was certainly buoyed by just having seen the movie for the first time and I'm sure being surprised by how well it turned out. But also, quite a credit to Hess to create an environment where good spirits flow. The positive energy definitely found its way to the screen.<br><br>I had the good fortune to run into Jerusha Hess in the parking lot afterward. She seems like a very genuine and engaging woman. I expect she will be highly sought-after from here out. A new Nora Ephron. In fact, there was something about this movie that reminded me a little of Mixed Nuts.","user":"baho2","rank":[74,96]}]