[{"title":"Not impressed","rating":6,"date":"23 February 2020","review":"Actually quite enjoyable, if you can ignore the story line. The old characters are back! I love the incorporation of death fight of female convicts, driving through town and even female driver like in the original film; I enjoyed the actions and gore a lot, it's just silly campy fun that doesn't lack good laughs. It's a pretty good sequel and also quite well filmed for a direct-to-DVD sequel, I strongly recommend all the fans of the series to check it out.","user":"MR_Heraclius","rank":[37,38]},{"title":"In Terms Of Being Fair","rating":6,"date":"27 January 2013","review":"If you didn't like the original mainstream Death Race or its sequel, don't bother watching this. Now if you liked what the b-movie sequel brought to the table then this movie may be worth watching only to see the loose ends get chained up, literally... while also being slightly hard to watch.<br><br>Carl \"Frankenstein\" Lucas(Luke Goss)is finally able to get out of prison if he wins \"one last race\" except since the Weyland company is bought out by a whole new boss, Lucas is now expected to perform in a slightly different race with a slim promise of freedom.<br><br>All the characters from the prequel are here and while its fun seeing them together there is a lot of cheesy moments where a lot of the tension from the last film is distastefully undone and the audience is left wondering \"well what next?.\"<br><br>The main villain is a one dimensional prick. There is a lot of unnecessary use of the F-word in odd dialogue. I mean the dialogue is bad at times. The action is pretty much summed up as South African local ,slo-mo impacts, choppy cuts, some strangely incited explosions, and death... While I can nitpick the movie's logical flaws all day, you can't ignore the bad acting and behaviors of most of the disposable characters. It leaves the audience going \"why would ____ do this?\" many times over. <br><br>Dialogue, concept, and execution are poorly done. The only thing it does right is finally connect the previous films- if not through insane conditions. Its entertaining at least if you turn off your brain and watch the conclusion unfold.","user":"pkrayden","rank":[20,26]},{"title":"A worthy sequel","rating":7,"date":"7 December 2013","review":"Don't be put off by the IMDb score, or any negative reviews, this movie is a more than worthy successor to Death Race 2, and has earned its place in the franchise.<br><br>Lots of subtle humour, stylish action and surprisingly memorably characters, all combined with sufficiently varied and suitably over-the-top set pieces make this feel more like a cinema release than a direct-to-video offering.<br><br>Sure, the plot gets a bit silly at times, and there are clichés and stereotypes liberally scattered throughout, but I still found the new setting, the new (if often short-lived) characters and the tidy wrapping up of the story arc to be effective and entertaining.<br><br>Dougray Scott shines as the enthusiastic antagonist, relative unknown Jeremy Crutchley provides a great Russell Crowe-esque caricature, and even Luke Goss manages to steal some good moments.<br><br>All of the actors look like they're having lots of fun, and I too thoroughly enjoyed the movie. Dig it up and give it a go. Watch all three movies back to back for the full experience!","user":"Damage666","rank":[10,12]}]