[{"title":"Weak carbon copy of the original film.","rating":4,"date":"15 January 2014","review":"I noticed that Lawrence D. Cohen, who'd adapted the Stephen King-penned outsider's revenge novel for the Brian De Plama original, is again credited with this adaptation. Did he actually re-write this or did they just re-use his old script? Either way, I was shocked at just how closely this followed the 1976 film. Much of the same dialogue, many of the same camera movements (the pan shot up to show the bucket; the camera beginning to spin around Carrie and Tommy as they dance, etc.) plus weak copycat shots of everything from the fire erupting behind Carrie to the blood falling on her from multiple angles (laughably overdone in this one) are all recycled here once again. They even cloned the silly \"getting ready for Prom\" montage and if you think the one here is any less corny than the one in the original, you are mistaken. It is one thing to adapt a famous novel that's already been filmed and try to update it for the times, but it is a whole other thing to weakly emulate another director's visual style when you are doing so.<br><br>What few \"new\" things have been added here are sadly not to the overall betterment of the core story. Including cyber-bullying in the mix is - in theory - a good way to update it, but it isn't elaborated upon enough to make it the least bit interesting and is presented almost like an afterthought instead of it being an integral part of the story. Images of Carrie's locker room humiliation being projected in front of everyone at Prom were simply carried over from THE RAGE: CARRIE 2 (1999), where they project embarrassing videos of Rachel at a party. In other words, this movie does absolutely nothing fresh or new with the concept. Nothing.<br><br>Moretz's \"blossoming\" from an outcast to someone who could possibly be accepted by her peer group didn't come off at all. The transformation for Sissy Spacek in the original film was dramatic as she went from awkward, mumbling Plain Jane to a nice-looking, appealing Prom date. Here, Moretz looks exactly the same before and after. Her fresh-faced, squeaky-clean appearance throughout the film makes it's a hard swallow that Tommy (vacantly played by Ansel Elgort) could look at her wearing a dress and then suddenly be like \"Wow!\" when he barely paid her any mind before. I thought both Spacek and Angela Bettis in the 2002 version pulled this off better. Both actresses also actually modulated their performances; something young Moretz simply does not yet have the gravitas or skill to do.<br><br>It's not just Moretz who pales in comparison. Julianne Moore is one of the best actresses working today, but she simply cannot compete with Piper Laurie's go-for-broke, thoroughly unhinged portrayal in the 1976 film. Moore is simply too low-key and restrained to make the part the least bit memorable; the same exact trap Patricia Clarkson fell into in the 2002 version. Whiny-voiced Judy Greer is just plain awful as the gym teacher and is absolutely no match for Betty Buckley's mixture of strength and compassion. A key scene in the original film (Buckley's character discussing her own Prom night disaster with Carrie used as a sort-of 'calm before the storm') has been removed from this one for no good reason. The fate of the character has also been altered; stripping this of an important element of horror and tragedy. None of the young actors portraying the bullies are able to broadly paint their personalities on screen in a memorable or notable way. Portia Doubleday probably comes closest in her portrayal of ringleader Chris Hargensen but she still doesn't seem quite as nasty and vindictive as Nancy Allen.<br><br>There was a haunting elegance to the direction, score and photography in the original film and all of that is absent here. This film's ordinary visual presentation, point-and-shoot cinematography, generic music score and CGI effects do absolutely nothing to spruce up the familiar story. In other words, what exactly is the point? Like many other soulless cash-grabs remakes, this will be completely forgotten here in a few years while the original film will forever live on as a genre classic.","user":"capkronos","rank":[59,77]},{"title":"Not terrible, but you will probably find yourself bored and disappointed","rating":4,"date":"19 October 2013","review":"First off, let me start out by saying this isn't a terrible movie. It certainly is not one of the worst horror movie remakes out there, but I can't help but feel disappointed from the 2013 version of Carrie. First off, this movie does not really add anything new to the mix. It's basically a copy of the original 1976 film, just with a modern setting. I generally am less critical of remakes than most, so the fact that I didn't like this should indicate that it just wasn't that good. I found myself bored throughout a lot of the movie. I've already seen the original, so why do I need to pay to see the exact movie again?<br><br>The director really should have gone out of her way to differentiate this film from its predecessor, instead of making a near shot-for-shot remake like 1998's Psycho. One example of a remake that attempts to add something new to the mix is Rob Zombie's Halloween. While that film was pretty weak also, at least it tried to inject something new to the storyline. The only thing I can say that was better about the 2013 Carrie is that the gym teacher lived. I never understood why she died in the 1976 version since she was one of the few people that was nice to Carrie, so her survival made more sense in this movie. Other than that, the original far surpasses this version. If you haven't seen the original, you might like this film as you have nothing to compare it with. However, some that haven't seen the original still might find themselves bored. One last criticism with this version is the prom scene. You'd think with the special effects improvements between 1976 and 2013, this version's killer prom sequence would blow the original's out of the water. Not the case, as the original killer prom scene was much better in my opinion<br><br>Overall, this wasn't a terrible film, but cannot even remotely compare to the original. Those that haven't seen the first film might very well enjoy it, but for those who have, you most likely will leave the theater disappointed. This remake was completely unnecessary, and adds absolutely nothing to the mix. If you've seen the original, then you've basically seen this as it's a hollow copy of it.<br><br>Final Rating: 4/10","user":"Darrellbjones","rank":[85,120]},{"title":"They'll All Laugh At... What Exactly?","rating":2,"date":"20 October 2013","review":"Take away the telekinetic powers, the hyper-religious mother and a bucket of pig's blood on the noggin, the original CARRIE, a suspenseful Stephen King adaptation directed by Brian De Palma, is really about a high school girl who doesn't fit in. That fact is obvious just by looking at Sissy Spacek's Carrie White, who seems as though she's never belonged to any campus clique judging by her distant, dazed expression.<br><br>While Spacek was a natural beauty in earlier films like BADLANDS and PRIME CUT, she was turned into a homely outcast But Chloë Grace Moretz doesn't have any problem whatsoever: Lose the permanent scowl and she's cuter than most of the girls, even the popular bullies <br><br>So it doesn't quite work when sympathetic Sue Snell, played by an elfin Gabriella Wilde, talks boyfriend Tommy Ross into escorting Carrie to the prom. Sappy scenes bordering on awkward TWILIGHT romance gives the impression he's one lucky guy with two lovely girlfriends But Carrie has a load of trouble at home in the form of crazy mom Margaret White....<br><br>Without further comparing this to the original, Julianne Moore, filling the famous Piper Laurie role, tries her over-the-top best with spooky long hair and an icy disposition, but acts more like a kooky soccer mom in dire need of xanax than the main ingredient for her daughter's deep rooted problems<br><br>Enter Carrie's freewheeling use of telekinesis Her ability to easily manipulate elements, like a young Jedi or a Hogwarts pupil, makes you forget she's a troubled girl who can't control ominous powers. In one scene, as her schoolbooks float jovially around the bedroom, you'd think she discovered a quick way of finishing chores or perhaps a time-filling substitute for not having a Facebook or Twitter account. <br><br>And then, once we arrive at the inevitable doomsday prom, when Carrie goes to town with hellishly lethal vengeance, you'll wonder if this entire remake occurred just to witness a group of young people being slaughtered care-of computer-generated effects...<br><br>If that's the case, the maligned 90's sequel THE RAGE: CARRIE 2 covered this unnecessary ground already.","user":"cultfilmfreaksdotcom","rank":[88,127]}]