[{"title":"Could've been a great film. Despite some intriguing story elements and a promising first act, it sadly ends up being OK.","rating":5,"date":"2 October 2016","review":"Just to clarify one thing: I don't hate Tim Burton at all. In fact, I kinda love his work. He has a very unique and imaginative vision, seems to have a tasteful choice for actors (besides Johnny Depp as the Mad Hatter), and can really pour his heart and soul in some of his films like \"Edward Scissorhands\", \"Corpse Bride\", and \"The Nightmare Before Christmas\". But, just like any director, he has his missteps also. Some of his recent work is very lackluster and, at times, flat-out bad (Planet of the... BLAHK!).<br><br>But I was still excited for this particular project of his. I haven't read the book, or knew much about it, but when I saw the trailer I got my hopes up. Maybe this will be his big comeback! Asa Butterfield is an actor I like, the imagery is appropriately dream- like and the source material seems to fit his style perfectly. It even has the screenwriter from X-Men: First Class!<br><br>So I went to see the film with a few of my friends in a theater of around 15 people and 25-30 recliner seats. I couldn't wait to see another great Tim Burton movie!<br><br>And for the first half of the film... I genuinely enjoyed it! Sure, it does take some time for Jacob to reach Peregrine's home, but once he does... I couldn't help but smile like an idiot. The world that Jacob enters is fascinating, the visuals are exceptional, and every one of the peculiar kids are very interesting side- characters. I wanted to learn more about the girl that could lift boulders over her head! There is also this kid that can project his dreams into film... how cool! The first act always left me with questions that I was excited to hear about when the plot kicks in.<br><br>And then the plot kicks in...<br><br>That is where the movie starts to run out of steam.<br><br>I could tell there were a lot of story elements in the book just from watching the movie, because in the second half a lot of it felt crammed in. Whenever I try to follow the story as best as I can, there's always this one subplot that makes precious little sense. It also doesn't help that the villain is weak and his motivations are somewhat vague.<br><br>The climax is pretty abrupt and Burton sadly delves into a few clichés that aggravate me. A lot of it felt by-the-numbers at that time, and I was sorely disappointed.<br><br>That's not to say that this was a bad film, because it isn't. The acting (especially from Eva Green) is competent, the whole film is imaginative in its story and visuals, and somewhere buried beneath lies a great film with lots of creative ideas and appealing whimsy. But the plot is messy, the main character is bland, the pacing is at times uneven and, in the end, it's just another average YA adaptation that had loads of potential.<br><br>VERDICT:<br><br>+ Visuals + Well-cast, especially for Eva Green + Imaginative + Sense of wonder in the first act + Solid directing + Interesting side characters<br><br><ul><li>Villain - The hero is underdeveloped - Plot is messy - Pacing is uneven - Unconvincing love chemistry</li></ul><br><br>SCORE: 5.5/10","user":"RockoDaFoxxo","rank":[193,260]},{"title":"I enjoyed the movie","rating":8,"date":"12 October 2016","review":"I am not very familiar with Tim Burton's work (only watched a handful of his movies), neither have I read the book, so I will review this movie as it is, without comparing it to the usual craftsmanship of Mr. Burton nor the characters or events as depicted in the source material.<br><br>I found the movie entertaining, and at no point did I wonder \"How long more is this going to be?\" Any movie that never prompts me to ask this question automatically gets a 6 out of 10.<br><br>Many reviews mentioned about huge plot holes in the movie, but I never really understood what the plot holes were that make this a terrible movie. I thought the story was quite easy to follow, even with all the time loops, and makes sense in the make-believe world that we are watching. I usually have trouble making sense of time- travel stories, so the ability to simplify complicated concepts and making it easy to understand for me deserves another star for intelligence. Though probably it wasn't easy enough for a seven year-old to comprehend.<br><br>I also thought the soundtrack was quite good, I actually stayed till the credits finished rolling to enjoy the music. This, along with the camera work, gets another star to make it 8 out of 10.<br><br>To be honest, if the voting score is in increment of 0.5, I would be more inclined to vote it 7.5 out of 10. I don't expect character development for all the \"peculiar children\" in a movie like this (that would perhaps be more fitting for a drama series), but the acting can be improved. Eva Green has the best \"on-screen presence\", but she doesn't appear until 30 minutes into the movie, so a bit of patience is necessary. Also I found the editing a bit too abrupt at some points, but that's about all the complaints I have.<br><br>I am quite satisfied with the movie, considering the amount of bad reviews I have been exposed to. :)","user":"si_anu","rank":[96,137]},{"title":"Whatever happened to Tim Burton?!","rating":4,"date":"2 October 2016","review":"Tim Burton strikes me as a pretty peculiar man so he was the right fit for Miss Peregrine's Home for Peculiar Children, a film based on the novel of the same name by Ransom Riggs. Burton has disappointed me recently and I haven't really enjoyed one of his films since Sleepy Hollow back in 1999.<br><br>Jake Portman (Asa Butterfield) is a boy who doesn't really have anyone close to him, except for his grandfather. When tragedy strikes at home and Jake is left feeling more alone than ever, he goes on a journey to Wales to find out if there was any truth to the fairy tales he was told by his grandfather as a child.<br><br>Stumbling across Miss Peregrine's Home for Peculiar Children, that his grandfather visited regularly when fighting in the war, Jake soon meets its inhabitants and Miss Peregrine (Eva Green) herself. Hearing her speak of the danger the the children could be in, Jake makes a connection between that danger and the cause of the tragedy at home.<br><br>This is very much a family film however, where I think it will lose both adult and child audience members is the fact that it really is quite a boring story told in such a dull way. Tim Burton has made fantasy films before but there is no sense of awe or wonder as there was in something like Edward Scissorhands. <br><br>The screenplay from Jane Goldman is massively disappointing considering the work she's done on the likes of Kick-Ass and Kingsman in recent years. I enjoyed some of the film but for large parts I was bored thanks to some incredibly drab characters.<br><br>The film certainly has a visual appeal but even that was ruined by a final act that descended into utter stupidity. Up until then, I thought the effects were really quite good. Then came the moment a crew of skeletons fend off the enemy creatures from the children. All I will say is that the skeletons in Jason and the Argonauts looked better.<br><br>Coming to the performances, Miss Peregrine's Home for Peculiar Children makes a massive error in having Asa Butterfield in the lead role. He hasn't done much of note in his career so far and I just found him so bland in this film. Samuel L. Jackson's villainous turn is just laughable but the film's biggest crime was not having enough Eva Green, an actress who would have done the film a massive favour.<br><br>The use of time travel is something that hindered the film for me as well. Events towards the end don't get explained very well at all, leading to utter confusion as the film drew to a close. I'm sure I won't be the only one who thought so. Overall, this is just a totally forgettable film from Tim Burton.","user":"bartonj2410","rank":[132,202]}]