[{"title":"What about Cherry...?","rating":4,"date":"23 January 2013","review":"\"About Cherry\" does try hard to deliver, but it just doesn't punch hard enough to make a lasting mark.<br><br>The movie trots ahead at a fairly slow, but steady, pace, which makes the movie seem to go on for a very long time. Especially where there aren't any particular peak moments in the movie.<br><br>\"About Cherry\" is about a young girl who leaves her dysfunctional family behind and moves to San Francisco with her friend. Here in the new town she starts making pornography for a living and earns good money, without heeding the dark side of her job. With her family ties and friendships on the line, Cherry balances a fine line which could easily tip her over.<br><br>The story is average, although it is quite painted out in stereotypical aspects, and it is to the point where it starts to become a daytime soap show; alcoholism, pornographic business, drug abuse, family problems, and so forth.<br><br>The problem with \"About Cherry\" is the characters in the story, as they are unfathomably one-dimensional and just doesn't really show much personality or give you enough of them to make you care. You just sit throughout the entire movie with a shrug and occasional shake of the head.<br><br>Be warned that there is an excessive amount of nudity and sexual references in the movie, obviously as the movie does revolve around the pornographic industry. Personally, I didn't care much for it, because it was done to the point where it was too much, bordering on being softcore pornography at times.<br><br>Personally, I did find that most people in the movie did fair enough jobs with their given roles, but only a couple of them managed to stand out in the movie, and those were Dev Patel (playing Andrew), Heather Graham (playing Margaret) and Lili Taylor (playing Phyllis).<br><br>I am sure if you are fans of anyone in the movie, then you might find some greater enjoyment in this movie, or if you have some kind of fascination with the way the pornographic business works, then this might be something for you. But if you are watching this for entertainment, as I did, then you will not walk away with a 'wow' sensation, because the movie just doesn't rock the boat.","user":"paul_haakonsen","rank":[39,45]},{"title":"Just had to write a review after reading a few others...","rating":10,"date":"8 March 2013","review":"For those of you who are not in the adult industry (I am) and have reviewed this film as not representative of what life is really like in the industry... How do you know? It's like me writing a review about a movie that has a medical theme and saying that it's not accurate because of the experiences I have had with doctors...<br><br>There is every type of woman and man in this industry. Most often media portrays us to be drug addicts and low lives. In About Cherry, it is shown that there is not one outcome. The film shows that a woman can make a healthy choice when presented with less favorable situations. All too often we only get to see those whose lives fall about, and thus the film perpetuates the stereotype of the Sex Worker. We are not who you think! I read quite a few of these reviews and I am aware that as soon as a film comes out to show a woman in the sex industry to be strong and come out on top, it gets trashed. The reason being it challenges those stereotypes that people hold on to so very strongly. Not long ago, gays and blacks were portrayed the same way in the media. ie... the villain was always some crazed lesbian or cross dresser. We love to vilify that what we don't understand.<br><br>Whether you like the film itself or not, is one thing. But please don't tell me it's not realistic until you've worked 10 to 20 years in the industry and know what your talking about.<br><br>Sorry, I know this sounds like a soap box, but it's so very crazy how many people will talk about an issue they know nothing of. I liked About Cherry. If nothing more than for the message. But it was entertaining, honest, and offered up a side of the sex industry that most don't see... and besides, it has Heather Graham in it, how can you go wrong with her?","user":"kristendiangelo","rank":[96,120]},{"title":"Not sexy, Not dramatic. Not much of anything at all.","rating":22,"date":"22 August 2012","review":"Someday a movie is going to be made that will take us inside the adult film industry to show us the reality of what goes on there, and what happens to the people who operate within it. When that film comes, let us hope that it answers the most basic fundamental questions that we the audience will have: How and why does someone get into that industry? What is their home life like? How does it effect their married life? What about their children? Are they worried about raising children while explaining what mommy does for a living? Are they worried about AIDS? How do you move into other profession while still carrying the stigma of being a \"porn star\" along with you? What happens when you reach the inevitable age when you are no longer sexy and photogenic? What then? That movie is still to be made because clearly \"About Cherry\" answers none of these questions. Here is a movie that promises sex but plays like a dull soap opera with a little nudity thrown in here and there. It claims to be a portrait of one woman's journey into becoming an adult film star but comes off as slow, uninteresting and anti-climactic. It doesn't have any characters for us to care about nor any of the \"good parts\" that a lot of moviegoers will be hoping for.<br><br>The movie stars Ashley Hinsaw as Angelina, a twenty-something who lives at home with her alcoholic mother (Lili Taylor) and her mom's abusive boyfriend. That situation is hardly explored at all. We see the mother hugging the toilet and the boyfriend stomping about the house like an angry bear (we see him only in shadow). Then we briefly meet Angelina's little sister whom she cares about but not enough to get her out of this unhappy household.<br><br>One day, cash-strapped Angelina gets a slight suggestion from her current boyfriend (Jonny Weston), that she try a nude photoshoot with a company that runs a porn site. Why not? It might be an easy way to make money. She does and with the money packs up her things and heads for San Francisco with her best friend Andrew (Dev Patel of Slumdog Millionaire).<br><br>In The City by the Bay, she goes to a lavish party where she meets two people. First is Francis (James Franco), a lawyer with cocaine addiction, who gives her expensive dresses and takes her to lavish parties. He soon becomes her new boyfriend. The other is Margaret (Heather Graham), who directs porn films and suggests that Angelina might perfect to star in her next film. It isn't long before she finds herself embroiled in the business under the name Cherry.<br><br>What happens next is exactly what you expect. Angelina gets involved in the adult film industry and starts making money. As she does, all kinds of problem begin stirring up in her personal life. The problem is that they are all problems that we can predict before the movie starts. It is a surprise that Francis has a problem with her profession? Is it a surprise that mom comes to visit, finds out about her new career and abandons her? Is it a surprise that questions arise about Angelina's real age? Is it a surprise that she catches Andrew having a good time with one of her movies? Do you care about any of this stuff? It is difficult to care because none of this stuff is the least bit interesting, especially a badly written subplot involving Margaret's relationship with her lover Jillian that breaks up over questions of Angelina's age. Their breakup scene, in which they have angry sex, is silly and awkward and disturbingly voyeuristic.<br><br>\"About Cherry\" comes from first-time director Stephen Elliott who co-wrote the screenplay with real-life porn star Lorelei Lee. Their script is a mess. They want to comment on the scummy world of the porn business but Elliot employs a soundtrack that romanticizes it. The movie off-sets a few fleeting sex scenes (very few) with dramatic moments that contain long passages of meaningless dialogue.<br><br>As for the sex, there are only a handful of scenes showing Angelina in front of the camera but they are all shot in a sleazy voyeuristic way that goes nowhere runs way too short to be of any interest. Yes, there is some nudity and Miss Hinsaw is very attractive, but we get the sense that the director has gotten caught up in the moment and forgotten that he is suppose to be making a point. The end of the film, when Angelina's world has completely come apart is - much like the rest of the film - one of the most confounding conclusions you'll ever experience.<br><br>American films that explore sex with even an ounce of maturity are so rare that it is heartbreaking when an attempt goes bad. Here was a movie that had the potential to ask a lot of questions and explore a subject that we might have found interesting, but blows the opportunity at every turn. We are not far into this movie before we realize that \"About Cherry\" isn't really about anything at all.","user":"The_Film_Cricket","rank":[55,68]}]