[{"title":"Just magical","rating":8,"date":"15 December 2014","review":"The Young and Prodigious T.S. Spivet (2014):<br><br>This is the new film from the French Terry Gilliam, Jean-Pierre Jeunet. You may best know him as the director of Amelie, City of the Lost Children and Micmacs. This time, we have a sweeter and simpler affair: a young prodigy in Montana, the titular Spivet, has invented a 'perpetual motion machine' thereby solving an enigma that has baffled scientist. The discovery is so hot that it even attracts the attention of the Smithsonian institute, who wish to present the boy with an award, unaware of his real age. So, leaving home and his oddball family behind, T.S embarks on a journey across America to receive his prize.<br><br>The Short answer: It's really, really good! The Long? Well, where to start? Well given Jeunet pedigree, the visuals are up first, in all their vibrant, almost Technicolor-esque splendour. What's more, this is quite possibly the best use of 3D I have ever seen in a film. The depth of field is phenomenal, and really adds to the storybook feeling of the whole movie. It's sort of like a giant pop up book, which is fitting as that's how we transition between the different parts of the story. Whether it be out on the Montana ranch, looking out of a train or even in the Smithsonian itself, there is always something coming to the fore or floating out, and it's great fun.<br><br>Of course, there are other areas. The cast is top notch, with a pretty solid youngster as our lead. He captures the quirks and brainpower of our inventive young lead, alternately able to sell inspiration, determination and even fear a few times, reminding us T.S, for all his brilliance, is still a child. In supporting roles we have the likes of Helena Bonham Carter as his bug-studying mother, Callum Keith Rennie as his cowboy pop, and even Jeunet regular Dominique Pinon as a lively hobo T.S meets on his travels. This is just a shortlist of the people here, but every one does well and their own vibrance and sort of exuberance contrasts nicely with T.S's very straight forward, matter of fact behaviour and logic.<br><br>However, all this is but dressing without a decent script here, and well, we have a fine one. It's undeniably Euro-quirk, despite being a Canadian co-production, with a lot of visual gags and little sprinkles of off-quilter and slightly dark scenarios that are played with a slightly humorous bend (not many movies can make people shooting themselves, a cowboy with a lick fetish and even mourning trauma somewhat amusing, last I checked). However, amidst the silliness, there is a good deal of heart. For all his ingenuity, the film very much still presents T.S as a kid; he makes mistakes, he gets scared he misses his family as he goes on his adventure. The film wisely doesn't make him invulnerably just because he's our lead. What's more, there is a strong element here about dealing with death and letting go concerning a tragedy in the Spivet family, and while at first is somewhat there for amusement, the film does take it more seriously as it progresses, and once again, shows how people would react under that circumstance: some bottle it in, some cry and some regret and take blame. For a film with such a bright colour palette, it can get very dark and touchy a handful of times, and it's all the better for it.<br><br>Naturally, how much oddball quirk you can take will affect your enjoyment, and there are a few times where the pacing does slow down a little more than needed. Regardless, if you're burnt out by X Men and Edge of Tomorrow, and need something smaller and more out there, give this a shot. It may even leave you a little teary eyed at points, but regardless, if you can get to it, check this film out. It's inventive, touching and refreshingly with a few surprises. Can't ask for more than that.","user":"KingProjector93","rank":[22,26]},{"title":"Award Deserving Story with or without 3D","rating":9,"date":"29 March 2014","review":"8.5 of 10. Genius kid invents a perpetual motion machine, goes on adventure. Simple but without a well-developed plot and quirky characters like the one Helena Bonham Carter plays (and continues to set her characters apart from every other actor on the planet), this would be heavily dependent on 3D to be worth viewing in theaters.<br><br>What starts out as seemingly just a nerd on the ranch family comedy, develops into a more complex tale. Then when it seems to have reduced to a road-trip, self-discovery story, it once again expands and delivers more.<br><br>The other key character in this is played by Judy Davis. There are, however, an ongoing stream of brilliant characters to provide fun and suspense in what really shouldn't be promoted as just 3D kid action.","user":"in1984","rank":[34,50]},{"title":"Jean-Pierre Jeunet visually masterful take on Reif Larsen novel","rating":22,"date":"22 October 2013","review":"Only a director with the creativity and imagination of Jean-Pierre Jeunet would attempt to bring to the big screen in English the best-selling novel by Reif Larsen \"The Selected Works of T.S. Spivet\". The book, described by author Stephen King as a combination of \"MarkTwain, Thomas Pynchon and Little Miss Sunshine\", is illustrated with charts, lists, sketches and maps to help recount the adventures of the quirky, gifted 12-year-old boy of the book's title . Jeunet has faithfully reproduced the visual elements of the novel to recreate the offbeat world of T.S Spivet and the use of a 3D format is perfectly suited to breathing life into T.S.'s illustrations which Jeunet's does by drawing on his trademark mix of poetry and fantasy. But the plot does not lift from the page and the young boy's eventful journey seems flat and doggedly two-dimensional.<br><br>The adventure starts off promisingly enough. T.S.Spivet (Kyle Catlett) lives on a farm in the 'Big Sky Country' of Montana with his amateur entomologist mother (Helena Bonham Carter), his cowboy father (Callum Keith Rennie) and elder sister (Niamh Wilson). A phone call to the ranch from the prestigious Smithsonian Institute in Washington informs the young Spivet that he has won a prize for one of his inventions. Since the death of his twin brother in a shooting accident, Spivet's mother and father have sidelined the surviving son. Feeling neglected and un-loved, T.S. decides to travel on his own to Washington to accept his prize. The journey takes him across America on a freight train and into a series of encounters with a gallery of colourful characters.<br><br>While the scenes in Montana are a triumph to Jeunet's bold, sweeping breadth of vision, once Spivet hops on the train, the action, conversely begins to falter. The characters he meets could have come straight from a cartoon strip – ageing sailor Two Clouds (Dominique Pinon) is a dead ringer for Popeye – and they add little or nothing to the narrative or the tone of the film.<br><br>As the lead actor, Catlett carries a lot of responsibility for one so young. No one can deny he is as cute as a button – with his oversized trousers and constant puzzled look – but he lacks the range of emotions needed to create real empathy. This may explain why a film about grief remains oddly unmoving until a a scene towards the film's finale which seems unashamedly designed to pull the heart strings. This latest Jeunet is undoubtedly a glorious visual treat, but it lacks the magic and mystery of 'Amélie' his most successful film to date. I","user":"prescottjudith","rank":[43,65]}]