[{"title":"Captivating film","rating":9,"date":"5 January 2017","review":"I'll keep this relatively short. I'm a 60 year old, very hard to please Brit. This film, pleased me very much indeed. Hence, the 9 out of 10 score. Those who marked this film down, really do require a reality check. I'm not usually given to writing film reviews, but on seeing this film's current low rating - I felt compelled to write something positive, in its favour. The acting and special effects alone, stand on their own. The film, may well be 105 minutes long, but it's 105 of the best spent minutes I've had, this millennium. I won't delve into the film's storyline, as that has been adequately explained by others. If you want to be engagingly captivated, in a futuristic, make-believe World - where anything seems possible - then this is the film for you. I for one, would love to escape the current mess of a World we live in - to experience the alternative dimension, on offer, in Tomorrowland: A World Beyond","user":"adewhitaker-81691","rank":[100,121]},{"title":"Visually stunning retro sci-fi","rating":8,"date":"25 March 2017","review":"In an age of dark, grim visions of the future Disney's Tomorrowland is a delightful throwback to upbeat adventures of the 60s and 80s, a retro sci-fi film for the whole family to enjoy.<br><br>Casey Newton (Britt Robertson) is a bright and optimistic high school student who does not share the pessimistic views of elders. When Casey discovers a mysterious pin that shows her fantastic world and sets out to find the futuristic city with the help of a jaded inventor, Frank Walker (George Clooney) and Athena (Raffey Cassidy), an English-accented Audio-Animatronics.<br><br>Tomorrowland is a deliberately old-fashioned film both its tone and visuals: the film was loosely based on the Disney ride of the same name - considering that Disney were able to turn Pirates of the Caribbean into a billion dollar film series. Bird was a wise choice to direct and co-write, The Incredibles had a 60s style sci-fi look to it and he brought that look to Tomorrowland. It was bright and colourful with its showing of various technologies, from robots, jetpacks, lasers and a steampunk rocket.<br><br>Brad Bird has already shown himself to be a capable action director with Mission Impossible: Ghost Portrayal and with Tomorrowland he had much better CGI. There are some cool fight sequences, especially with Athena - it is awesome to see a little girl beating up fully grown men and giant robots. Tomorrowland is visually spectacular especially when we get to see the city in all its glory for the first time. Bird certainly brought out a sense of awe, whimsy and wonder.<br><br>Tomorrowland also has a great trio in the leads: Clooney, Robertson and Cassidy are terrific together, having many witty moments together when they are travelling and there is a zip in their interactions, like when they use a knock-out tool. Although Robertson's look too old to be a high schooler she pushes off the necessary enthusiasm. But it was Cassidy who stole the show: she was a revelation as Athena, playing a character who was older than she actually looked and at times acts a Terminator. She personally reminded me of Saoirse Ronan when she was younger, just with dark hair.<br><br>Although Tomorrowland had a talented director at the helm it also had a screenplay with Damon Lindelof's fingerprints, a man who has poor reputation as a screenwriter. As an adventure Tomorrowland is excellent but when it goes to the science fiction the film gets bogged down with mumbo-jumbo about time particles and destiny. This part needed to be expanded and more refined. When it's revealed that Tomorrowland was a place for exceptional people to come to where they would not disrupted by government or civil society. Essentially this is similar to Ayn Rand's Atlas Shrugged, a controversial sci-fi work that abdicates the philosophy of Objectivism, or if you prefer it's the ideology of Andrew Ryan in Bioshock. The prologue at the 1964 World's Fair could have been cut and it would have made the reveals more impactful.<br><br>Tomorrowland is a good of romp of a film, providing plenty of laughs, action and visual spectcle. It was rated a 12A in the UK but it is on lower scale of that rating and could easily be enjoyed by children younger than that age.","user":"freemantle_uk","rank":[35,44]},{"title":"A fantastic sci-fi experience","rating":10,"date":"19 September 2015","review":"I very rarely write reviews for movies, but after watching Tomorrowland I've never seen a movie that's been so unfairly maligned by negative reviews,especially considering that this movie was an absolute joy from beginning to end. After watching it, and reading truly horrible, reviews I'm starting to think that somebody hired a few live bodies to slate this movie for their own specific reasons. <br><br>The script, actors and directors captured the feeling of endless possibilities perfectly. The FX were fantastic, there were no lulls in the plot, George Clooney did his thing perfectly, the child actors were incredible, and there were just enough twists and turns to maintain the pace.<br><br>Please, please watch this movie and make your own mind up - the negative reviews almost put me off, but I'm so glad I actually took the chance. <br><br>Actually there's one proviso here - and is probably something consistent with most of the negative reviews: If you lack imagination, or the yearning for a better world, then you'll hate this movie. Or you want to raise kids who aspire to be nothing more than reality TV actors. Or if you're a reality TV actor. Or your kids can't read or write because you don't think it's important. Or if you think science is dumb. Or if you can't embrace hope.<br><br>As for me...I loved it. I'll be watching it again and again :-)One of the best movies of 2015, and now on my \"favourite movie\" list.","user":"niall-roche","rank":[281,402]}]