[{"title":"laugh riot , go for it","rating":9,"date":"19 March 2015","review":"It is funny all the way , never a dull moment . They managed to sneak in touching moments too . These penguins are wily &amp; go-getters . Nobody can mess with them . Kowalski is tech support , skipper is leader (obviously) , rico is worker &amp; private is sincere eager follower . They can and do outwit everybody . I remember in 'madagascar 3' where skipper said 'you only get one chance at first impression' after hippo lady could not break the door . Some people are saying it as hard selling and by-product of successful 'madagascar' franchise . But , this is thoughtfully scripted . Full entertainment for family . Dialogues are glib and mocking .","user":"inanisumeet","rank":[24,27]},{"title":"Fun Bond villain adventure","rating":8,"date":"4 April 2015","review":"Skipper, Kowalski and Rico rescue an egg but they drift out to sea. The egg hatch into Private and the gang go off to adventures together. Ten years later, they break into Fort Knox to get the Cheezy dibbles from the vending machine. They are abducted by Doctor Octavius Brine who was Dave the octopus. Dave lost his fans at the various zoos to penguins and now plans to take revenge on them using the Medusa Serum. The penguins have to stop Dave with the help of the animal spy agency The North Wind.<br><br>The Penguins are the funniest thing in the Madagascar franchise. The core story is fun. It has a lot of great references. It takes cute unexpected turns and has great cartoon action. There are big laughs and funny throughout. I like it even better than the Madagascar movies.","user":"SnoopyStyle","rank":[17,19]},{"title":"It's amazing!","rating":10,"date":"22 July 2015","review":"This is masterpiece. Being 20 years old guy, i still like to watching this cartoon. Sometimes my 40 y\\o father when have a time watch this. It's really funny cartoon where are different stories, like about love, about friendship, about action, about moral values! Each character full of their life way!<br><br>Skipper-Team leader. Always keeps team in healthy shape. Always says what to do and how to do. He use his \"King slap\" to calm down members of team. It's really funny and by this he emphasizes his leadership. And it is ridiculous in my opinion, is when he says the name of the operation. \"Okay guys, we start operation \"******\" Let's go!\" (c) Skipper. Ahahahah :D <br><br>Kowalski-Brain of team. He always have plan. Always! True scientist! His inventions strange but very interesting :D Scientist's language very funny. When Kowalski start to explain something, it's line OMG, wut :DD Which makes it really funny :) In many movies\\cartoons in every team must be clever guy, i think in penguins it depicts the most fun, cool and exciting!<br><br>Rico-\"Mad KABOOM Guy\" I gave him this name :) Very strange one, which makes him very special in this team. He can only speak a few words, and the rest he can only make sounds. That's what makes him special :) Really funny guy :) YOu should watch him and u will understand me :))<br><br>Private-cutie of team. Very friendly one :) He always finds in people's kindness and honesty (with Skipper all the way around). When Skipper see potential enemy, Private meanwhile trying friend with him :) Hahaha :) So cute one ;)<br><br>What about another guys in Zoo. I just wanna say Dreamworks have very good taste!!! All personage are amazing! I cant imagine them in another taste's! Keep doing Dreamworks! I love you!!<br><br>10\\10!!!!! &lt;3<br><br>PS. Sorry for low English :)","user":"flexsorproduction","rank":[17,20]}]