[{"title":"A glorified mix of behind-the-scene and mockumentary with little scare or thrill","rating":5,"date":"3 March 2015","review":"Adam Green would probably better off making Hatcher 4 or actual documentary of his work. Digging Up The Marrow is an average found footage film with reliance of authenticity as film makers find an odd conspiracy theory. It gets a bit too meta with inside joke and backstage production, but there isn't much excitement since more than half of the content is simple bantering. What few scares it has are only half effective and numbingly too late.<br><br>Plot involves a real production house, they are called by a strange old man claiming that he has seen another world filled with monsters. Adam Green and his colleagues investigate this story with generous amount of interviews and vague camera shots. Since it's a mockumentary, genuine reaction might contribute more, but as the story progresses the yelling and debating become stale incredibly fast. Script is more true to life, yet it's often too sporadic to form any suspense.<br><br>The better part of the film is behind-the-scene features. It's nice to see more of the assembly parts of filmmaking, be that artistic design, editing process or a few nit bits from comic-con. Whereas the horror plot isn't that appealing or convincing in any way. Unfortunately, there is hefty amount of the playtime that's allocated for this horror tale which lacks real tension. There are a couple of good moments, but even those are expected gimmick other found footage films have already done, and ironically the film itself is aware of this.<br><br>Camera work is not great, it predictably uses first person view or some manners of CCTV. The most agonizing part of this subgenre, shots in the dark and shaky cam are also presented here. Although some of the effects could build the atmosphere, but halfway point after hearing multiple banters the film becomes tedious.<br><br>If it's a complicated way to show passion for the work, there has to be better ways to convey that message. A montage of authentic production from old films would be more fascinating than pseudo horror like this.","user":"quincytheodore","rank":[17,19]},{"title":"Odd, experimental horror movie or \"Documentary\"","rating":6,"date":"27 February 2015","review":"Adam Green, the upstart horror fan boy filmmaker behind Frozen and the Hatchet movies, directs this mockumentary about his love of monsters and how it leads to a strange old man called Decker (Ray Wise of Twin Peaks and Jeepers Creepers 2). Green plays himself as himself, not as a cartoonish parody as he did on his now defunct TV series Holliston. And we follow Green and his trusty cameraman as they record Decker's ramblings about the secret, subterranean society of monsters that lives beneath our world. Decker (a name presumably referencing David Cronenberg's legendary monster hunter from Clive Barker's Nightbreed) even claims to have found an entrance to this other world, a hole in the ground near a cemetery which he calls the Marrow.<br><br>Digging Up the Marrow is a fast paced, entertaining little movie that functions as a sort of subversion of the done to death found footage sub genre. But that also brings me to my main problem with the movie. I just am not sure what Adam Green intended to do here.<br><br>By playing himself, and having several other notable genre names cameo as themselves, people like Kane Hodder and Tom Holland, it seems that he wants to blur the lines between fact and fiction. However, by casting recognizable character actor Ray Wise as the fictional character at the center of all this, he completely ruins the illusion making it obvious from the start that this is wholly a work of fiction. So why make the movie in this fashion? I honestly have no idea.<br><br>But, I did enjoy watching the movie and Green does manage to prove at least two things here. The first is that he actually can \"act\" although he is playing himself, he plays himself as a likable, slightly awkward dreamer whose desperation to believe leads him down a rabbit hole into increasingly dangerous situations. The second is his wholehearted and rather admirable dedication to practical special effects. There is no cheesy CG here and what you see is obviously tangible and quite well designed to boot. Digging in the Marrow may feel a tad disposable, more like a time killing side project than a true feature, but it's still more entertaining and engaging than a lot of low budget crap out there. So check it out and have a good time.","user":"Kolobos51","rank":[15,17]},{"title":"Adam Green and Ray Wise are a modern day Ed Wood and Bela Lugosi","rating":8,"date":"30 October 2016","review":"On paper it would be easy to write off Adam Green's 'Digging Up the Marrow' as being shameless self-promotion and yet another forgettable entry in the redundant found-footage genre. But it's actually very entertaining, witty and fairly creepy.<br><br>Adam Green, the director of 'Frozen' and 'Hatchet', is contacted by a man who claims that he can prove to Adam that monsters are real, are in fact living in a metropolis beneath the earth, and that he has found one of the entrances to this world. Adam and his crew agree to meet with him and to film a documentary, because Adam, in the Agent Mulder tradition, Wants to Believe. The man, who claims to be an ex-Boston police officer, turns out to be a bit of nutcase, and very scrupulous about how Adam and his cameraman conduct themselves out in the woods around the entrance to this monster world.<br><br>Must say I had a great time watching this. Some very funny scenes and it was cleverly delivered by Green and co. Ray Wise was simply brilliant and was an interesting character. I found something really appealing about the film, the vibe it had that gave it the feel of a real cheap, personal project, Ed Wood style. I can see this becoming a Halloween favourite of mine.","user":"Coffee_in_the_Clink","rank":[5,5]}]