[{"title":"Watch out - you're going to like it whether you want to or not!","rating":9,"date":"5 October 2012","review":"We two 50+ grandmas went to see this film on the spur of the moment because we enjoy musical movies. We were probably the oldest people in the audience which ranged down to younger teens but everyone, regardless of age, was laughing and having a grand time. Much less schmaltzy and self-serious than Glee, but wonderful vocals and dancing and personality. You can't help but fall in love with the hilariously quirky characters, especially Rebel Wilson as the irrepressible Fat Amy, Elizabeth Banks as Gail, the sexually frustrated female announcer, and Hanna Mae Lee as Lilly, the wackadoo who releases the most shocking comments in a voice that barely exceeds a murmur. Fun, feel-good and highly entertaining.","user":"penwah2","rank":[172,244]},{"title":"It has been years since I have seen a movie that I had such low expectations for...","rating":8,"date":"15 September 2012","review":"That I loved so much. I scored free tickets to a Denver Screening awhile back and was just going to have my wife and 13 year old daughter go , but I watched the trailer and really thought Anna Kendrick was terrific in 50/50 and very good in Up in the Air so I thought, what the heck, I'm going too. Was I glad that I did. I laughed like crazy and loved the a capella singing. This film is really raunchy and just skirts around an R rating several times, but it is just so fun.<br><br>I am pretty confident that it is going to be the surprise box office hit of the fall and it is so much better than the films that it is bound to be compared to like Mean Girls, Bring it On, and even Bridesmaids. <br><br>Speaking of Bridesmaids Rebel Wilson almost steals the show with every scene that she is involved with being hilarious, and in a lesser movie her scenes most certainly would be worth paying the price of admission alone, but there are so many other talents involved. Elizabeth Banks has never been funnier. Skylar Astin as the love interest is also terrific though he needs to change his name, because for me the name Skylar brings only one thing to mind and she is married to Walter White.<br><br>This is no Oscar Winner, I am certain that I will see a dozen or so better movies this year, but none will having me laughing and smiling as much.","user":"somf","rank":[133,198]},{"title":"Turn off your brain and just enjoy....","rating":7,"date":"18 June 2017","review":"The most important thing you might wanna know about this review is that I am certainly NOT in the target demographic group for this film. As a 53 year-old man, I am not the type to ever watch \"Pitch Perfect\" in the first place and did so only because my daughter insisted that it was a good film and I would enjoy it. And, fortunately, I did enjoy it quite a bit. Now I am NOT saying I think it's a great film, it certainly has its faults, but it is fun and entertaining.<br><br>The film is about a capella singing....certainly not the sort of thing most of us enjoy or even care about...though the film manages to infuse the subject with enthusiasm. And, you'll soon find yourself moving along with the singing...and much of it is very infectious. And, the film is about most every stereotype I could think of when it comes to young adult films---you have the bossy and nasty leader of the group, the lesbian, the fat girl who is funny and the rest of the clichés (such as the final big number where not only do ALL the ladies know the lyrics BUT also the choreography of a song they NEVER practiced). But, it manages to make it enjoyable because it SAYS that these are stereotypes at times and the music is pretty cool. I could have done without all the vomit, however. Overall, this is a very watchable and enjoyable picture.","user":"MartinHafer","rank":[5,5]}]