[{"title":"Why is there no \"0\"?","rating":1,"date":"16 February 2013","review":"I cannot believe how mad this movie made me!!!! Every character in it was so detestable there was no possible way Bloody Mary could of killed them enough times. The acting was unacceptable. The violence, which is why we would usually consider watching this in the first place, was almost laughable in quality. The pacing of the movie was unbearable. The only good part of the whole movie, Ron Jeremy, was such a small part.<br><br>I don't understand how anyone that had any part of this movie can even show their faces in public. I'm ashamed that I even watched it, for free. If I paid to see it, I would probably be catatonic right now.<br><br>In closing, I never expected to this movie to be great, I had low expectations going into it. But I did expect to be entertained and I was miserable the whole way through. Please please please avoid this trash!<br><br>This piece of s**t will be banging on my rib cage for a long time :(","user":"flipmode-ca","rank":[26,35]},{"title":"It pains me, real bad.","rating":1,"date":"12 July 2013","review":"This is going to be a short review since, well, nothing happened. I know the film is really low budget, but that doesn't mean make it like sh-t, my god it kills me to see films that lack heart and passion. I'm just saying, give me this films budget and I'll make the best damn film I can. Anyway, I always thought this was a porno, well it opens with porn, but slows way down after. If you think Mary's death is a spoiler, than you have problems.<br><br>The film opens with one of the worst lesbian sex scenes I've ever seen. Literally that is the first thing you see, by the way they show everything. It even has some stock BS music playing over it. So a religious guy comes in and kills the two women, you know because murder isn't a sin. A guys fantasy right in front of him doesn't even faze him. And after that there was no script, just people talking, and occasionally bloody Mary walking around naked. She eventually puts panties on, but nothing else. Who would be afraid of that if they saw her. She's like Michael Myers, just slowly walking around, creeping in corners. Nobody would ever be afraid of her. And that's all that happens. This seriously started out as a ten minute porno, but some jacka** made it into a feature length film. It's trash a** garbage. I could remake it, and you know, put some effort into it, and actually make it a horror film, even though it is a p-ss poor story.<br><br>Sorry for the language, it's just better helps describe this trash heap. Since when is there a prohibited word feature when I'm trying to write a review, I hope that doesn't effect my older ones.","user":"DustinRahksi","rank":[9,13]},{"title":"Bloody Mary 3D","rating":3,"date":"22 January 2015","review":"How to begin a horror film? A gratuitously lengthy steamy session of naked lesbian sex in 1904? When hubby comes home unexpectedly and catches wifey at it...how many redblooded males have fantasised about this sort of thing, especially with a stunningly attractive blonde and redhead? But not this guy, instead of joining in, he murders them both. Fast forward to the present day, and the plot is revealed. This is actually a well-known urban legend, that of Bloody Mary. Call her name when you stand in front of the mirror, and if you give the wrong reaction when she appears, it's curtains.<br><br>It's also very silly, but if you don't mind a bit of blood, the naked Mary is looking remarkably fit considering she's been dead for over a century. What else is there to recommend it? Well, the soundtrack is not bad, nor are some of the one-liners, like: \"We needed something quick and cheap; for some reason I thought of you\".","user":"a_baron","rank":[6,8]}]