[{"title":"Why the hate? This was funny, and it had heart.","rating":8,"date":"26 April 2017","review":"What's the matta wit you? I am puzzled by all the negative reviews. Yes, it's not The King of Comedy, or Goodfellas. But this movie was funny. De Niro's character Jackie was a 3-dimensional and human portrayal, and doesn't deserve to be dismissed as \"another De Niro phoning it in\" performance. The scenes where he performs stand-up comedy were genuinely funny. The relationship he has with his brother (Danny DeVito) were warm and convincing.<br><br>It may not be a timeless masterpiece, but if you're at the Red Box or looking for your next movie night rental from the couch it is worth seeing.<br><br>For what it's worth, I think Dirty Grandpa was raunchy and hilarious, and Grudge Match was also funny and had heart - with touching performances by both De Niro and Stallone.","user":"johnnybiscotti","rank":[58,81]},{"title":"De Niro In Decent Film Shocker!","rating":8,"date":"25 April 2017","review":"I'll be honest, I wasn't expecting too much from this one, due to some withering reviews on here and also De Niro's recent track record.<br><br>His character, Jackie Burke, is an insult comic who had a hit many years ago with a sitcom. He's good at what he does, but as he nears seventy the work doesn't come like maybe it once did, possibly due to his short temper and habit of always doing his act on everyone he meets.<br><br>As the film went along, I found myself genuinely liking Jackie, due to sharp writing and a very on form De Niro. Leslie Mann is also impressive (as usual), and there's a plethora of comedy guest stars who never get in the way of the leads.<br><br>Jackie's journey is handled very well, and there's a real progression to the narrative, ending with a sweet, on the nail and laugh out loud final scene.<br><br>A really good watch, especially for anyone with an interest in stand up comedy, it's nice to see the nearly living legend return to form in such a nuanced, understated way.","user":"alan_holloway_2","rank":[34,53]},{"title":"The Comedian: Above par for what it is, below par for DeNiro","rating":6,"date":"29 April 2018","review":"The Comedian has a damn impressive cast, De Niro, Keitel and Mann. Immediatly I had high hopes, alas they weren't met but the film isn't a complete bust.<br><br>It tells the story of an ageing comedian on the road to comeback. His foul mouth and controversial style doesn't appeal to everyone and to make matters worse his considerably younger on/off girlfriend is harbouring a secret that will change everything.<br><br>Everyone is on form and there are laughs to be had but much of the film feels like a structureless art piece and simply doesn't flow.<br><br>One thing I truly liked was how much I empathised with DeNiro, how much I found myself relating to him and yet hoping that isn't what I have to look forward to in my old age.<br><br>The Comedian is more a drama with some comedic moments than a comedy, but considering its subject matter it's still head and shoulders over the likes of Funny People (2009).<br><br>The Good:<br><br>Cast are great<br><br>The more I see Leslie Mann the more I like her<br><br>Some funny moments<br><br>The Bad:<br><br>Weirdly paced<br><br>Things I Learnt From This Movie:<br><br>DeNiro has reinvented himself like no actor before him<br><br>I hope I never hit an time where I need to go for a number 3","user":"Platypuschow","rank":[8,10]}]