[{"title":"Great premise, uninspired result","rating":5,"date":"16 October 2013","review":"A film that has clearly started with a high concept - like Speed but playing a piano rather than driving a bus - and the plot has been fitted round that. Having started from that fairly ludicrous premise, you might hope that the film would either embrace it and not take itself seriously, or find clever twists to add. Unfortunately it does neither. It's short enough to avoid being boring, and competently shot and acted, but really has very little to offer.<br><br>It's hard to think of the target audience for this - a run of the mill thriller based around classical music? - and I am mystified by its inclusion at the London Film Festival.","user":"reev0","rank":[65,89]},{"title":"Thriller, horror, suspenseful, none of the above!","rating":3,"date":"11 October 2013","review":"My wife and I just saw this at the Sitges Festival and were unfortunately very disappointed in the movie. Elijah Wood is the focal point of the film and frankly, the script nor his ability were able to carry the movie to an even reasonable level of interest for us (let alone tension, suspense or anything near the edge of the seat). A critic stated this is Speed but with a piano. I say it is Speed at the relative pace of a piano. This really comes down to the story at hand and can a single scene movie keep someone interested to the point of being called a thriller? I really do not believe so and especially feel that way after seeing the film. The movie was just flat out boring. Very disappointing start to the SFF.","user":"markhopski","rank":[48,70]},{"title":"A plot which never started, didn't develop and ended spiritlessly","rating":2,"date":"16 October 2013","review":"I kept on expecting something to happen. It didn't. The plot was thin to the point of idiot transparency. The build-up was muddled and didn't have a great deal to offer. You just couldn't understand why this main character was actually going to all the bother of performing again.<br><br>And coincidentally he didn't. The plot just didn't develop. It started with the basic bones of the film story and just stuck there. No great suspense moments, no breath-holding divulgences, no way was the audience anxious for any of the characters' safety. It just deadlined into nothingness.<br><br>The final denouement (read the threatened consequence of the film) had no purpose either. The resulting closure of the film happened as if the director, writer and financiers had become bored with it as well and the plug was pulled firmly.<br><br>I say don't bother unless you are a die-hard masochist. Shame, but Mr. Wood is better in a hairy costume, hooves and a tail. He doesn't deliver and my favourite in the whole entire cast was the Piano itself. <br><br>Even The Piano looked embarrassed.","user":"dmustard-501-827814","rank":[46,67]}]