[{"title":"The Amityville Haunting: Just no","rating":2,"date":"21 November 2017","review":"My Amityville binge has led me to this, a found footage movie set in a world where Amityville has been recognised, made into movies and books and yet another family moves into the infamous house anyway.<br><br>As with all found footage films very little happens and this is 80 minutes of sheer unadulterated boredom.<br><br>What makes it worse (If that's possible) is that it's not even the Amityville house despite being said multiple times that it is. Both inside and out that becomes blatantly apparent and really is seven shades of stupid.<br><br>So we have shaky cam, we have night vision cam and we have the obligatory handicam filmed by someone who absolutely positively has to record everything for some reason.<br><br>In true Amityville style people change, folks turn on each other and yet somehow this is the worst one yet.<br><br>The Good: <br><br>It ended, that bit was good <br><br>The Bad: <br><br>That had to be the least sexy sex scene since the zombie humping in Braindead (1992) <br><br>NOT the Amityville house <br><br>The \"Warning\" real footage thing is getting dumb<br><br>Things I Learnt From This Movie: <br><br>The fact that there are no opening credits, no closing credits and therefore everyone involved is uncredited screams volumes <br><br>Someone should really trademark Amityville so Joe Talentless can't keep adding it to his film","user":"Platypuschow","rank":[8,8]},{"title":"Amateur-ville Haunting Cameras","rating":23,"date":"23 December 2011","review":"Actual found footage that documents the horrifying experience of a family that moved into the infamous Amityville haunted house.<br><br>Opening with words in \"1974\" blah, blah \"Defoe murdered his family\", blah,\"Lutz\" blah, \"32 years later\", blah blah \"what you're about to see is real\". Then an aeroplane blonde graces the screen under torch light. After quick bloody death, your taken to the POV of a budding mini Steven Spielberg as he films his family.<br><br>It's indicative of Paranormal Activity and the recent Grave Encounters found footage films. With security camera's installed it's all be done and at one point it becomes a found footage within a found footage film. <br><br>Both female leads are effective enough, it's not an awful film, the acting is at times naturalistic but the issue is that this style of horror has already been done and done better with more imagination. Every line is a cliché , opening doors, accidental deaths, the wife that doesn't want to live in the house, no one believes the children, spook- less dark images, moving objects and so on. <br><br>At the midway mark as the 'boyfriend' vanishes and the police turn up you can help roll your eyes as the acting and script take a turn for the worse. The son becomes annoying due to the unnecessary explanatory dialogue and the father goes laughable loopy as he goes head to head with the entity. There are a few moments in the closing scenes where director Geoff Meed slightly redeems the film but it's too little too late.<br><br>The problem with The Amityville Haunting is that it perpetrates to be real and pushes the fact right to the end but nothing feels credible. The sound design is pretty effective if somewhat miss-placed missing the mark at times. <br><br>Overall, less effective than the Paranormal Activity series, clearly not much has improved since The Blair Witch Project.","user":"amesmonde","rank":[16,18]},{"title":"Surely that was meant as a practical joke?","rating":1,"date":"25 December 2011","review":"This movie was one of the worst waste of times I have ever had to sit through. Already from the very beginning, it was painstakingly obvious that this was going to be another delve into the likes of \"Paranormal Activity\" (which I didn't enjoy either).<br><br>But this movie? Come on! They take the Amityville name and then hype it up with one of these oh-so-great-and-oh-so-spooky documentaries, making it into a modern day version of the \"Blairwitch Project\". Yeah, great. Oh wait, except for it didn't working on any level.<br><br>The movie was an endless stream of really bad camera work, interrupted by this blackening-out screen and static sound whenever the entity was about to make something happen or make an appearance. What was up with that? I got thoroughly frustrated by the crappy camera work and the static sounds just added fuel to the fire called irritation with the movie.<br><br>\"Amityville Haunting\" is one of the most uneventful and frightfully boring movies I had ever had to sit through. Nothing even remotely scary happened throughout the entire movie, and I actually dozed off once or twice.<br><br>I am not a fan of movies of this caliber, and I didn't particularly enjoy any of the \"Paranormal Activity\" movies either, but checked them out because of the hype that was surrounding them. \"Amityville Haunting\", however, is just a cheap imitation of those movies, and then it is wrapped in a casing called \"Amityville\", a name that us horror fans will recognize from the early 80's.<br><br>\"Amityville Haunting\" was a sad excuse for a movie, and I wasn't the least bit entertained. If you are looking for a horror movie for the evening, or hoping to have at least a single scare, please, oh please, do pick another movie, because \"Amityville Haunting\" is just not worth it.","user":"paul_haakonsen","rank":[26,32]}]