[{"title":"Witch Hunt","rating":5,"date":"18 December 2011","review":"Ex-history teacher and soccer coach James Van Der Beek (as Jack McBraddon) heads for \"Salem Falls\" on his way to begin a new life in California. Out to put a dark secret behind him, Mr. Van Der Beek almost kills the alcoholic father of attractive local Sarah Carter (as Addie Peabody) in an accident; the older man's on a binge and driving his lawnmower recklessly. Grateful Peter MacNeill (as Roy) is unharmed, Ms. Carter invites Van Der Beek to stay in town and gives him a job at her \"Do-or-Diner\"...<br><br>Romance between Van Der Beek and Carter develops, but that dark secret from his past surfaces. Also, troubled teen Wiccan practitioner Amanda Michalka (as Gillian Duncan) wants to seduce Van Der Beek. She and her girlfriends are who we see in the opening. Missing in some cast lists are dad Rick Roberts (as Amos) and James Thomas (as Jordan McAfee). This \"Lifetime\" TV-movie is engaging, but loses points by not adequately explaining how a certain character's semen came to be identified.<br><br>***** Salem Falls (11/19/11) Bradley Walsh ~ James Van Der Beek, Sarah Carter, Amanda Michalka, Peter MacNeill","user":"wes-connors","rank":[5,5]},{"title":"Just too slow and not enough tension","rating":5,"date":"1 April 2014","review":"Addie Peabody (Sarah Carter) has a drunk father who causes former teacher Jack St. Bride (James Van Der Beek) to crash his car. Jack is trying to move on with his life after a bad experience. Addie owns the diner and offers him a job. She can't let go of her dead daughter. Three girls Gillian Duncan (AJ Michalka), Megan Saxton (Allie MacDonald) and Chelsea (Zoë Belkin) are a covenant of witches. Gillian lusts after Jack thinking he's stuck in town because of a spell they performed. Gillian's father Amos (Rick Roberts) is on the rampage to get rid of Jack.<br><br>AJ plays it like a swooning teenager instead of something more dangerous. There are a lot of possibilities in this movie. I don't know what's in Jodi Picoult's novel. This could be a good thriller. This is more of a slow clunky romance with a horny clingy teenager causing criminal troubles. The pacing is way too slow for the first half with no tension at all. Once Rick Roberts gets involved, the movie improves a bit. It's too little too late. As a crime drama, it's a little too soft. Everything is done with such a soft touch. There isn't enough for me to recommend. And the ending twist is too twisty.","user":"SnoopyStyle","rank":[5,6]},{"title":"Good Cast, Lots Of Twists!","rating":10,"date":"23 November 2011","review":"I was channel surfing this week and found this little gem! Good little mystery with good casting, locations and lots of twists and turns. An interesting look at what happens to someone once you're labeled. Some of it was pretty predictable- beautiful diner owner, evil head of the town, self-absorbed teenagers. It did have lots of twists and turns to keep me interested through the rest of the movie. It also asks how much would you give up if wrongly convicted? I sure didn't see the last big twist coming, that's a whopper! Don't miss the last 10 minutes, as a major secret will be revealed! You'll kick yourself if you do, if you ever find out what it is...","user":"oliversboise","rank":[6,8]}]