[{"title":"Decent rescue movie that I don't think I'll watch again.","rating":6,"date":"1 February 2018","review":"Reading and watching the reviews for The Finest Hours, I knew I'd be going into it not expecting much, and I wasn't disappointed. Everything about the Finest Hours is \"Ok\". Acting, directing, editing, music, story, is ok. But everything being ok in this movie makes me not care all that much about the true story it's based on.<br><br>The story revolves around crewman Bernie Webber, who is sent out with 3 others to rescue the crew of the SS Pendleton, which has been split in two by a massive storm off the coast of Massachusetts.<br><br>Story short, they head out, save almost everyone, and return home safe to carry on with their lives. The film starts with the build up of Webber and his future wife Miriam. Sorry to the people who wrote the script, but I'm just not invested in these two. Keep it focused on the rescue mission, stop flashing back to Miriam every 10 minutes. At the end it shows the towns people putting every light they can on to help the survivors home, and we get scenes of multiple people in town other than Miriam and how they feel about their loved ones being in mortal danger, but show more of that. Have scenes of Miriam and how she feels, but make it even with the other family members. Focus a LOT more on the crew members than Miriam is all I'm saying. <br><br>Other than than I liked Casey Affleck's character. I enjoyed his scenes helping the other crew mates to survive, and was overall invested in them making it through. Overall, a movie I won't watch again. It's not bad, but it's not \"The Founder\" it's not that engaging because the script and the directing ultimately don't know where to go with it. Shame because this true story could be handled so much better.<br><br>I give it a 6 out of 10","user":"Ingrouille181","rank":[7,7]},{"title":"Good ol' fashioned disaster-and-rescue drama is better than the \"experts\" would have you believe","rating":7,"date":"31 January 2016","review":"\"The Finest Hours\" (2016 release; 117 min.) brings the telling, \"based on a true story\" we are reminded, of a daring rescue attempt at sea. As the movie opens, it is \"Wellfleet, MA, November 1951\", and we get to know two Coast Guarders who are out on a double date. Bernie (played by Chris Pine) is immediately smitten by Miriam *played by Holiday Grainger). The movie then shifts to February 17, 1952, where Bernie and Miriam are attending a party, and they decide to get married in April. Later that night, as a nor'easter is bearing down, the Pendleton tanker is in serious trouble, and before we know it, Bernie is ordered to assemble a crew and go out to find any survivors of the Pendleton. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is a big budget movie from Disney Studios, directed by Craig Gillespie (\"Lars and The Real Girl\"; \"Million Dollar Arm\"). If you have seen the movie's trailer (which as been inescapable in the theaters in recent weeks), you know exactly what you are in for: a bigger-than-life, against-all-odds rescue attempt of the crew of the Pendleton tanker, which has split in two, by a four man crew of the Coast Guard in Chatham, MA. Don't ask me how the Pendleton's remaining half tanker doesn't sink! I think it has something to do with the boat's balancing tanks, but in the end it doesn't matter, as we are here to witness some of the wildest open sea disaster scenes you'll ever see. In a sense, this reminds of \"Titanic\", except that the action scenes are pumped up and on steroids. Chris Pine (as Bernie) and Casey Affleck (as the Pendleton's main guy) are fine, but to be honest, they and the rest of the gang are all second fiddle to the special effects. I know that it's all CGI, yet it looks so darn realistic! The movie has a great orchestral score, courtesy of veteran composer Carter Burwell (his score for \"Carol\" received an Oscar nomination). Also make sure to stay through the movie's end titles, as we then get a bunch of period pictures from the Boston Globe and other news sources with the real life people from the events (and likely the source of the costuming for the film). Last but not least, this is released both in 2D and 3D, but just know that the movie was shot in 2D and then converted into 3D (I saw it in 2D). Bottom line: \"The Finest Hours\" is a good ol' fashioned disaster-and-rescue drama that is much better than the \"experts\" would have you believe.<br><br>\"The Finest Hours\" opened nationally this weekend, and the Friday evening screening where I saw this at here in Cincinnati was attended okay but not great. somewhat to my surprise. Regardless, if you are in the mood for an effects-heavy but very realistic disaster-and-rescue movie, I encourage you to check this out, be it in the theater, on Amazon Instant Video or eventually on DVD/Blu-ray (although a movie of this kind just begs to be seen on the big screen). \"The Finest Hours\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[87,121]},{"title":"Enthralling story of courage and survival","rating":7,"date":"31 December 2016","review":"February 1952. Bernie Webber is a boatswain/Petty Officer at a Coast Guard station on the coast of Massachusetts. A massive storm is in progress out to sea, damaging two tankers to the point that they appear likely to sink. On one tanker, the Pendleton, the chief engineer, Ray Sybert, is using all his ingenuity, resourcefulness and experience to keep the ship afloat and buy time until help arrives. Unfortunately for him and his crew, the Coast Guard have sent their best crew and rescue boat to the other stricken tanker. When the Coast Guard discover the Pendleton's situation, Webber and a 3-man crew are sent to help. The odds are stacked against Webber - just leaving the harbour in those seas will require large amounts of skill, courage and luck. Then they have to find the Pendleton, without a compass, rescue the crew and somehow make it home safe.<br><br>An enthralling (true) story of courage and survival. Compelling viewing - once the danger strikes, you're glued to your seat. What makes it so interesting is that they don't just focus on the efforts of the rescuers but also on the rescued. I found the Pendleton crew's story much more interesting than that of Webber and co - the ingenuity, resourcefulness and (reluctant) leadership of Sybert was amazing. This is helped by a great performance from Casey Affleck.<br><br>Not all good though. Many of the characters seem like cartoon stereotypes - the negative naysayers, the clingy girlfriend/fiancée, the inept commander. The romantic angle was overplayed and not that necessary. It did add depth to Webber's character but not much.<br><br>Performances vary. Casey Affleck is the stand-out as Sybert. Chris Pine is okay as Webber. Eric Bana is pretty weak and gives the worst American accent I've ever heard (I think it was supposed to be Southern but it varied so much and seemed so unnatural it was hard to tell). Holliday Grainger is a bit overbearing as Miriam, though that might have been intentional on the director's part.","user":"grantss","rank":[10,11]}]