[{"title":"Bad acting and directing. Hilariously crude writing.","rating":5,"date":"24 September 2014","review":"Overall this movie was bad, not compelling, completely predictable (pun intended). The acting in it was fairly bad, as well as the directing and overall production of the movie. That sounds like a recipe for a 1 or 2 out of 10. But no, the writing and jokes in the script, although VERY crude, are hilarious to a certain audience. If that script had landed on the doorstep of the complete cast of This Is the End I think it would have been a success. The script and jokes therein are the only reason to watch this film. If nothing else, you can take away the one-liners and jokes from this crude and hilarious could-have-been. Jeff Tetreault needs a broader audience and larger scope of people to work with. And yes, I did have to look up him name on IMDb.","user":"chasequailman","rank":[6,8]},{"title":"An impressive first-time feature.","rating":8,"date":"7 April 2014","review":"I ordered this film on iTunes and was surprised at the layers it holds within its \"raunchy- com\" feel. What surprises the most about Bad Johnson is its versatility: it can be a dude's film, a sex comedy, a date movie, and many other things. Most important, however, is the genuine plight of this man with his sexual drive, and trying to come to terms with it as he finds an authentic, and committed relationship in his life. <br><br>Despite the comedic surrealism of the film's plot, Bad Johnson tells the story of many people today, both men and women and everyone that has dealt with some sort of hindering addiction. This works in delivering both the hilarious element of a detached penis, a man's worst night, but it doesn't shy away from telling a true and relatable story about an addiction, and a closer look into the modern-day womanizer. <br><br>As for the comedy, Jeff Tetreault's first feature film is an impressive debut that takes into consideration both the story and the necessary gags. Looking forward to seeing more work by this up-and-coming writer. But what really takes the prize here is the fantastic cast. All actors are in-tune with the comedic elements and the timing: Jamie Chung delivers the angry girlfriend stereotype brilliantly, Nick Thune is equal parts terrifying and hysterical, Katherine Cunningham is a newcomer to look out for, and Cam Gigandet steals every scene with a natural charm and a previously unseen versatility for every kind of role. <br><br>The film has its silliness, and its slips in over-doing some of the jokes, as any first feature will have (and especially one of the comedic genre)—however, I was surprised at how much work went into the making of this film. <br><br>Definitely worth it, a fun and impressive first-time feature.","user":"fmarquez1994","rank":[20,38]},{"title":"Interesting storyline, but not a great movie...","rating":4,"date":"25 August 2014","review":"It should be said that \"Bad Johnson\" at least is a different kind of comedy. And when that is said, then it should be said that the movie was kind of a slow-paced and actually disappointing comedy.<br><br>Why? Well, for starters, then I didn't laugh a single time throughout the movie. And the little comedy that was incorporated in the movie just didn't really punch through on any scale.<br><br>The story is about Rich (played by Cam Gigandet) a guy who cheats on just about every woman that he goes out with. Until one day when he makes a distressed wish to be distanced from the source of his trouble between his legs. Waking up the next day, Rich gets a call from someone he knows intimately and things starts to go awry.<br><br>I will say that the idea behind the movie was interesting, but just a shame that it wasn't executed skillfully on the screen.<br><br>The acting in \"Bad Johnson\" was adequate, but the lead part could perhaps have been given to someone more enthusiastic and involved in the role. Cam Gigandet didn't really bring anything to the movie in any way.<br><br>\"Bad Johnson\" was a stale experience as comedies go, and I wasn't really properly entertained. As such, I am rating the movie a mere 4 out of 10 stars.","user":"paul_haakonsen","rank":[9,15]}]