[{"title":"Highly underrated, should be at least 6.5 rating.","rating":8,"date":"22 January 2013","review":"Okay, sure, it's not a groundbreaking horror film (what is nowadays?), but I found myself enjoying it. I usually don't watch films below a 6.0 IMDb rating (yeah, yeah, I'm a ratings wh***, shut up). But I was really in the mood for a horror movie and decided to give this a try. Yeah, it's a traditional story and somewhat predictable, but the modern \"offbeat\" characters kept it interesting. I agree with the user that says it starts off a bit weak/slow, but the rest of the story kept me intrigued. I've seen (modern) horror movies that are far worse than this that have higher ratings so give it a try if you enjoy modern horror.","user":"kuronox","rank":[33,41]},{"title":"Very scary and well put together","rating":8,"date":"8 July 2012","review":"This movie has gotten a lot of terrible reviews here, so I feel the need to add another positive one. If you love horror movies and don't confuse \"gory\" with \"scary\" - and if everything doesn't have to be spelled out for you in an unrealistic expository scene - don't miss this gem.<br><br>Most horror movies either insult the audience a little by over-explaining, or they leave many elements simply unexplained (which can be a plus too.) This one actually gives you all the clues you need to put it together and get the answers. Really, it's all there - if you are observant, you don't need the characters to spell it out for you. I found the characters and dialog very believable (for a horror film, of course.) And a HUGE plus - no fake scares. Plenty of real ones. My boyfriend screamed out loud once, and I don't think I've ever heard him do that. I give it 8/10 because while I'm not likely to put it in my top ten films of all time, it was an immensely entertaining movie.","user":"dld2012","rank":[89,122]},{"title":"A Low Budget Horror movie, but with out the cheese!","rating":9,"date":"6 August 2015","review":"It's a low budget horror movie, but not cheesy in the least. There is no cheesy fake blood and gore, no sex crazed teenagers, and no topples bubble headed blond's running from a psycho killer.<br><br>No cheap thrills here, just a very complex and layered plot with plenty of twist and turns. The movie never once lost my attention nor did I ever get lost in the plot. The movie moved slow enough to build likable characters and to build up suspense, but also wasn't so slow that it lost my interest.<br><br>I loved watching Annie as she went through the motions of loss and anger and then fear, and then ultimately the courage to discover clues and dig up old family secrets.","user":"gpailkids","rank":[14,16]}]