[{"title":"Sleepwalking has never had a better ending.","rating":9,"date":"6 April 2012","review":"My wife and I saw this film at this year's SXSW festival, as it was our top priority to watch as we have loved Mike Birbiglia for a long time now- and so excited that many more people are getting to know him (or at least getting closer to pronounce his last name correctly). The entire narrative of the film is based on several of his true stories pulled from his memoir and a one-man show of the same name. I would recommend anyone seeing this movie to read his book afterwards, as it has many verbatim moments and great stories from his childhood that were not in the movie. In regards to this the movie itself, we found it simply terrific. Full disclosure- I am a huge comedy nerd; so that bias most likely does have to be factored in before taking my opinion, yet I believe this story is compelling and entertaining for absolutely any adult.<br><br>The film starts with Mike in his late 20's in a relationship with his girlfriend (Abby) since college. The issue of why they are not married at this point is immediately brought up, and it becomes the central issue for him to come to terms with. Before you immediately typecast this plot as a typical \"white people problem\" indie, the terrifying events that unfold due to this dilemma both in real-life and subconsciously will keep you completely engaged in what will happen next. The film does flashback a few times when he and Abby meet, but most of the storyline is within about the ages of 28-33 and when the real decision making that goes into becoming an actual adult becomes an ultimatum. While being barraged with questions of \"Why are you still a bartender\", \"Why aren't you married yet\", Mike timidly avoids trying to have a real answer and only wants to stay in his own world. However, because of not addressing these on the surface, he is forced to deal with them in his dreams. This begins with Mike waking up Abby by kicking a hamper declaring \"There is a jackal in here!\". This would soon to prove to be the most abstract and least disturbing sleepwalking instance that he would experience. As he becomes further entrenched into a new, unstable career and uncertainty with his Abby, his episodes become clearer and force him to finally make a real choice in his relationship, stand-up, and this debilitating sleep problem. <br><br>Birbiglia had included his brother and \"This American Life\" host Ira Glass to help with the adaptation of his life up to this point. I think they really understood what was relatable for anyone in relationships, and scared about what to do next. Almost every scene was tightly edited to show this, and the performances were deeply funny and heartbreaking. Since there was very little money to put into this project, he relied on many of his friends and friends of friends to call in favors to come in. This included many admired comedians like Marc Maron, Kristin Shall, David Wain, Hannibal Burees and Wyatt Cenac who all do a great job in representing the struggles of the stand-up process and the bleakness of working on the road.<br><br>The few problems I had with the movie revolve around the length of it. It may have been about 75 minutes. In no way are you wasting any money to see it, but being such a huge fan of his memoirs, I felt there could have been more time to bring up a couple more events that make the start of his comedy career more compelling. Many of which revolve around his parents who are featured only a brief time, but it is understandable that there is only so much you can do to illustrate an auto-biography. <br><br>Overall, I feel that this is one of the most honest and self-aware films you will see. Even if you have read the book and seen the show, there are still so many wonderful idiosyncrasies that Mike Birbiglia wanted to explore before finally put his past behind him- and focus on his rising career. At the screening he did a Q&amp;A with us, and one of his answers made me appreciate it 10 times more. That was, when you see the film and he gives the epilogue, that entire scene (as well as all of the forth-wall) was done in post-production. It is almost unfathomable to think that this conclusion was not thought of at the beginning of writing the movie because it really was the thesis of the entire story, and it was truly one of the best endings I have ever seen. Even for that reason alone, I would implore anyone to see this movie.","user":"john-kelmer-336-137197","rank":[32,45]},{"title":"Mike Birbiglia","rating":7,"date":"26 August 2013","review":"Matt Pandamiglio (Mike Birbiglia) is a loser struggling comedian who's actually more of a comedy club bartender. His girlfriend Abby (Lauren Ambrose) is too good for him. Abby pressures him to marry her, and he starts walking in his sleep under the stress.<br><br>Mike Birbiglia's semi-autobiographical one-man show is turned into a movie. It has the air of real life. However I just couldn't shake the question that probably everybody asked while watching this movie. \"Why did she stay with this loser?\" Mike probably played up his loserness too much at the beginning. His acting at the start had no energy at all. It just made it hard to understand why Abby would ever stay with him. There is an imaginative explanation based on real life. But it still isn't quite satisfying.","user":"SnoopyStyle","rank":[5,6]},{"title":"A bit boring","rating":4,"date":"8 December 2012","review":"I apologize for the low quality review which follows, I have no time but in regard to the reviews found here, I thought we need something more honest before people go out and watch it.<br><br>So, this is nothing you would watch in cinema.<br><br>This is more like a movie to watch on a Sunday morning when everybody is lazy and there is nothing of value to do. <br><br>The story is a bit boring, and the main character is boring too which comes surprisingly because he actually plays a comedian. <br><br>This film is listed as comedy, but we didn't have a single laugh while watching it. The whole movie is really flat, no climax or variation whatsoever. Nobody even tried to follow up to the film after we were done with it. <br><br>I am already having a tough time writing something here, as I can't remember something worth mentioning. So overall I think this says enough.","user":"p_imdb-238-926380","rank":[31,64]}]