[{"title":"A group of Romanian communists robs the National Bank. But why?","rating":10,"date":"10 March 2014","review":"Unless you have at least some basic knowledge about Communist Romania, this movie might seem very far away from a rating of 10. As the story unraveled, it sucked us into an atmosphere that most of us feel is long gone, and nevertheless, so close to us. It's the period when the first cracks in an apparently perfect egalitarian world started to appear. Robbing a bank with guns in a communist country is like robbing a supermarket of its toilette paper. Money then and there was useless unless you could justify its origin. And that is what makes this story so strange for us. But there are many, many other layers to the story. The cast is great. The historical background is fascinating (at least for us, Romanians). And the cinematography is far above average. This movie was like a breath of fresh air. One full of poisonous gases, as seeing the movie, you will discover that there are many things about the human race that will upset you, but at the same time, air that provokes an uncontrollable laugh. Some people in the audience didn't appreciate the jokes. I did, because I considered it was the only way not to make the most depressing movie in the world. A masterpiece that will most probably be considered as such many years from now, when people will start making movies about our not so egalitarian society.","user":"zoranov","rank":[52,72]},{"title":"Romanian director wins BIG","rating":10,"date":"6 April 2014","review":"I was so completely entertained by this little film. I understand the historical data is highly accurate and appropriate for the Romanians that have lived in that exact period - which I respect so much . The amazing cinematography traps you along with power-house performances from Farmiga and Strong, the story is simply amazing and unique ( i think we all crave for unique stories nowadays). Caranfil's directing took me by surprise because I have never expected this level of craft from a director also trapped in a country where films at this scale are only a dream. I loved every single one of the shots and the editing was also amazing. I really hope Caranfil will make more movies like this - keeping the amazing dark, funny and artistic tone. ( See The Rest is Silence - it maintains that unique blend of tones ). One of the best non- American films i've seen in the last couple of years.","user":"andreea_bur94","rank":[45,66]},{"title":"Excellent ! ! !","rating":10,"date":"15 July 2014","review":"It is always gratifying to find a film you do not know anything about and it becomes one of your favorite movies.<br><br>Director/writer Nae Caranfil has taken an obscure incident in Soviet occupied Romania in the late 1950's and has offered it up to the 21st century cinema to give us a most pertinent message for today's world.<br><br>That message is not robbing the bank! The message is to be found in how the system (society) can single out certain groups and marginalize them into committing a desperate act --- and not really have any reason to do this act but to just fight back.<br><br>The entire cast is perfect in their individual roles, the script is intelligent, the photography beautiful! This film should a 10 in anyones book!","user":"cekadah","rank":[40,62]}]