[{"title":"True Identity Theft","rating":7,"date":"19 April 2013","review":"Greetings again from the darkness. This is no typical movie, so these will not be typical comments. In 2004, Shane Carruth became something of a cult hero with the Sundance Festival crowd when his debut film PRIMER won a Grand Jury Award. Nine years later, we get his follow-up ... the ultimate artsy, indie film for those who thrive on analysis and prefer to avoid a story ending wrapped up with a neat bow.<br><br>These comments will not give you much, but I can tell you the screening had many viewers who left frustrated and confused. The fragmented narrative can be a bit disorienting and it avoids the usual staple of a resolution at the end. The audience knows more than the characters, yet the audience is baffled while the characters just continue on.<br><br>The first segment of the film is when it's at its most traditional. We see Thief (Thiago Martins) perform some type of worm/parasite procedure that slowly brainwashes Kris (Amy Seimetz) or leads to mind control or loss of personality ... just depends how you prefer to describe it. We then see The Sampler (Andrew Sensenig) help her overcome thanks to a blood transfusion on his pig farm. Yes, really. Finally, Kris bonds with Jeff (Shane Carruth) as they seek to reassemble their lives and re-discover themselves. Watching them bicker over who belongs to what memory is frightening and fascinating. It makes you question the definition of personal identity, and what if we lost that (or it was stolen).<br><br>Nature plays a huge role here, along with the connection to Thoreau's Walden. Many will use the term pretentious. Some will call it boring. Still others will be drawn in by the imagery and sound (or sometimes lack thereof). Shane Carruth does not fit Hollywood and neither do his films. He is a writer, producer, director, co-editor, cinematographer, and actor. He clearly has a love of the material and his choice of Amy Seimetz really makes the film work. She is outstanding (and also a filmmaker). The tired phrase \"it's not for everyone\" certainly applies here, but if you are a Terrence Malick fan or just enjoy being challenged by somewhat abstract themes, this one is worth a look.","user":"ferguson-6","rank":[134,186]},{"title":"\"Each drink is better than the last, leaving you with the desire to have one more. Take a drink now.\"","rating":10,"date":"25 May 2013","review":"I knew this film was going to be weird. Shane Carruth's debut film - Primer - was an oddity as it was, lacking in straightforward answers or explanations, but presenting a very intriguing and sturdy piece of hard science fiction. Be warned that Upstream Color is also something that lacks a straightforward explanation. In fact, Primer was something rather cold, with its strong basis in the scientific method; UC is far warmer and artistic, but is also more abstract.<br><br>The film may come off as slow and dull to certain viewers, especially if you're expecting a strong narrative structure or plot. I'm usually adverse to movies that have no real plot or conflict, but with this film, it's the experience that matters. Watching this film is a strangely mesmerizing, lucid, and smooth experience, given the exquisite imagery, nuanced performances, and quality music score. The film's first fifteen minutes are probably the most straightforward, most interesting, and most disturbing aspect of the whole thing, and it serves as an important fulcrum point. This much I understand: the film starts off with the freaky notion that there's a man injecting grubs into people, which makes them susceptible to mind control. From then on, the film tracks two such victims who inevitably come together and discover the secrets of their latent trauma.<br><br>What makes the film so weird, so cerebral, and potentially frustrating, is that things happen, and characters will say things that won't make total sense. And most scenes are intercut with such footage as a farmer tending to pigs, and flowers growing in the wilderness. The movie draws stark parallels between such images, to unearth some rich thematic territory. Could such scenes reflect on life and death? Is it all about nature? Is it about love? Is it the human condition overall? The film never really tell you outright, and it gets very surreal when scenes overlap. If you struggle to find logic behind this story, you might write it off as messy. If you take in the experience and open your mind to interpreting the film, it'll keep your brain going and haunt you indefinitely. It's an experience comparable to such films as Mulholland Drive.<br><br>This film is very stylish, with some beautiful photography and ingenious editing. All actors put on decent performances, and they show a good blend of nuance and emotion. Writing is pretty weird, given the amount of strange and unusual dialogue. This production uses excellent sets, props, and costumes. The music score is very exquisite.<br><br>While Primer was a film that appeals on an intellectual level, Upstream Color appeals best to the artistic side of the brain. If you're susceptible to strange, abstract films that require lots of brainpower to interpret and understand, then this one is a perfect puzzlebox for you. Casual audiences might want to approach this with caution.<br><br>5/5 (Experience: Very Good | Content: Very Good | Film: Perfect)","user":"Al_The_Strange","rank":[123,178]},{"title":"An exercise in thematic appreciation","rating":8,"date":"1 March 2013","review":"UPSTREAM COLOR is already baffling the hell out of the world and will especially draw disapproval on IMDb.<br><br>The plot is not delivered in a way that is traditionally comprehensible, only to those paying close attention to the themes that unite it all. If you're already rolling your eyes THIS MOVIE IS NOT FOR YOU.<br><br>If however you have experienced or would like to experience films where you have to dedicate your ability to assess and determine the underlying idea that is linking a series of enigmatic actions and subtle scenes, UPSTREAM COLOR will intrigue and probably charm you. It very much plays to the TREE OF LIFE crowd.<br><br>For me, it's undoubtedly a massive artistic accomplishment. Hugely evocative and if you unearth those ideas, the ability to have human connection, abuse, hope and language among them, you'll have no problem following along and the ending will be very satisfying.<br><br>If you want to say \"you're not supposed to understand it, just feel it\" that's fine. I think that if you stop and ask yourself what idea is driving moments, you can follow along just fine. The story is in the themes. Details are abstract to drive home this point.<br><br>I took off two stars because I found the serious tone and sombre score to be so focused and constant, the atmospherics became a little more monotonous than I think was intended. The briefest of levity here and there might have offset the heaviness.<br><br>If you're still reading, check it out.","user":"hellsfoxes","rank":[177,264]}]