[{"title":"Likable characters make this surprisingly enjoyable","rating":9,"date":"13 August 2015","review":"There is a winning quality to this romantic comedy about a girl in her 20s (Knightley) in a bit of a mid 20s crisis after being proposed to by her boyfriend. She befriends a teenage girl (Moretz) and her divorced father (Rockwell). It starts off a bit slow but then you realize gradually the characters are all quite likable even when they are doing something wrong. This understated treatment of the more serious moments makes it more effective especially the visit to the mother (Mol). Avoids melodrama which would have spoilt the tone of the movie.<br><br>Keira Knightley makes her 20s finding herself girl surprisingly sympathetic and identifiable. Throughout her mistakes you still root for her. Chloe Grace Moretz is a standout as always. She gives a sensitive performance and doesn't overact. Amidst all the recent movies a likable teenager character on film is kind of rare. Sam Rockwell plays the father quite charmingly.<br><br>Overall one the better indie rom coms of late and worth a watch.","user":"phd_travel","rank":[16,18]},{"title":"Quirky commentary on quarter-life crisis - funny indie, almost too real.","rating":7,"date":"13 January 2015","review":"Laggies would have been too big a mirror put up to my twenty-something crises-ed life were it not for the comedic value of the whole she-bang.<br><br>That's mildly dramatic but really Laggies is a very original take on the quarter-life crises beseeching the Millennial generation.<br><br>Megan (Keira Knightley) is an underachieving twenty-something resigned to an underwhelming existence of still dating her high school boyfriend and working for her father. Her friends are all doing the things you're supposed to be doing when you are in your mid-to-late twenties: getting married, having babies, buying a house, etcetera etctera. With a quarter-life crisis imminently on the horizon, Megan retreats to the home of new found friend Annika (Chloe Grace Moretz), a sixteen year old high school student.<br><br>The term Laggies comes from Megan's profoundly underwhelming inferior performance in life below her potential. She is in this debilitatingly immobilizing limbo of the mid-twenties when, having done what you thought you were supposed to do and following the path you thought you were supposed to follow, you find yourself 'here' but 'here' isn't where you want to be. Andrea Seigel's screenplay does a good job of satirically making fun of the trends Milennials are doing nowadays as they 'play' house – like first dances and potential baby names.<br><br>A good movie will have characters and themes you can identify with, that will help put a mirror to life and help you engage with the narrative. For some 20-somethings most of the film and Keira Knightley's portrayal of an existential crisis may be a bit too close for comfort. Thankfully Chloe Grace Moretz's character has a dad played by Sam Rockwell. Rockwell is the shining light of a comic savior within the film and lifts up the depressing moments of story to a entertainingly watchable movie.<br><br>Laggies is a fun one-time watch for 20-somethings to realize they could be more messed up and to find the humor within the perplexities of burgeoning adulthood.<br><br>Please check out our website for all the recent releases reviewed in full.","user":"ArchonCinemaReviews","rank":[24,30]},{"title":"Hit A Bit Close to Home, But Funny!","rating":8,"date":"12 September 2014","review":"Ever feel like you have spent far too much of your life wandering around and trying to please everyone else?<br><br>I would say that after my last Keira Knightly adventure with Mark Ruffalo and now this movie, I am just about ready to have her as my friend. It was so hard to like her after all that fawning over her looks in other movies. She is really a charming actress and made my day with this performance. Apparently she replaced Anne Hathaway at the last minute. It is hard to imagine Ms. Hathaway in the role because Keira Knightly owns it so completely. I usually find the performances of Brits who play Americans strangely flat, but Ms. Knightly is one good exception to the rule. She falls into her role and seems to use her outsider status as an asset which works within the premise of the movie.<br><br>Sam Rockwell is incredible. What is it about that man? He has a very sexy brain. If he were one tiny bit better looking his seductive capacity would be less mesmerizing, so thank heaven for small favors. <br><br>Have fun!","user":"juliasf","rank":[58,80]}]