[{"title":"Better than the other reviews would let on","rating":7,"date":"30 June 2013","review":"I liked this movie. It was a good sci-fi flick, but based in a believable near-future world. The voyage is captured by stationary cameras throughout the ship and a story is patched together from them. The acting was very good. There admittedly wasn't much in the way of character development, but I didn't notice it. The whole film I was hoping the story would move forward faster and faster to the end, to find out what, if anything, was discovered, and the fate of the crew.<br><br>Mostly what I liked about it was that it wasn't over-the-top storytelling, nor was it over-the-top with special effects. It used them only to tell the story that needed to be told and weren't overused. One reviewer chastised the special effects as being poor, but I disagree. They were believable. Bad is the crap they make for the Science Fiction Channel.<br><br>This movie may not appeal to everyone precisely because it's not over-the-top. It was simple, with building tension throughout the film and a good ending. There weren't monsters and aliens everywhere, there was a distinct Hitchcocian feel to it.<br><br>Very good; well worth watching.","user":"shawn4004","rank":[363,427]},{"title":"Strong little indie sci-fi you should see","rating":8,"date":"29 June 2013","review":"Europa Report is one of those low-budget sci-fi films that crops up occasionally and starts making the rounds on genre websites (my own first blush with the film was on io9.com) to create a buzz. Since Hollywood has depressingly sworn off any films that aren't megabudget tentpoles with an already-established audience anticipation index (read: sequels, remakes, or pre-existing properties), low-budget genre films are a rarity at best.<br><br>In the film, six astronauts embark on a mission of discovery, planning to land on (as one would expect) Europa, one of Jupiter's moons, after recent discoveries showed a possibility of microbial life underneath its icy oceans. What we see is the recorded video from their ship's cameras (yes, it's a found footage film) that tell the story of their ill-fated voyage.<br><br>It's a simplistic premise, and director Sebastián Cordero seems to be a bit unsure of himself at the outset. The film refuses to follow a linear narrative; even before the main title appears, we join the crew many months into their trip, and are given the knowledge that there's obviously been an incident onboard already, one that's robbed the journey of one of their intrepid space explorers.<br><br>Two things worried me at the outset of the film: one: the much-ballyhooed attention to detail (the filmmakers even brought on NASA to make sure the film was meticulously designed and scientifically accurate) and two: that constantly-shifting timeline of the film. The first point was worrisome because most films that lean so heavily on their technical accuracy forget to be dramatically compelling, and the second (similarly) because an over-reliance on storytelling gimmicks often betrays a weak story.<br><br>Happily, neither caused the film to fail: the attention to detail enhanced rather than detracted, and while the unnecessary nonlinearity of the storytelling didn't go away until the end, it did finally calm down enough for the audience to orient themselves. Given that I know now how the story unfolds, I can say that it would have actually been more dramatically compelling for the audience if the film had just told itself in a more straightforward manner, but ultimately it works fine (if weaker than it could have).<br><br>The bare-bones plot is aided by some smart writing that refuses to dip into easy characterizations and instead defines its astronauts by their mission, rather than clichéd, singular personality traits. While refreshing to see, it does leave some of the characters as relative cyphers, but strong performances all around (including District 9's Sharlto Copley and The Girl with the Dragon Tattoo's Michael Nyqvist) get the film over that slight bump.<br><br>What's most gratifying about the film, however, is that it never loses its sense of awe. The film refuses to give in to the cynical pessimism of standard sci-fi fare, and its astronauts recognize the immense importance of their mission, particularly when things start to go south. Cordero keeps the tension ratcheted up, never forgetting how innately tenuous the safety of space travel is. The performances are all good, and Copley in particular is a standout.<br><br>But what I appreciated most about the film was its tactile nature, a by-product of its low budget. The difference between models and fully CGI creations is literally tangible. A week or so ago, I watched Disney's 1979 film The Black Hole for the first time, and while the green-screening is terribly shoddy, the film's effects stand miles taller than most of the genre fare produced today, if only by virtue of the fact that being real, they informed the cinematography and performances around them.<br><br>Europa Report fits in comfortably beside Duncan Jones' fantastic low-budget Moon, and while not perfect, compares favorably to that modern classic. This class of film can either be a failure (see: Apollo 18) or a classic (the aforementioned Moon); Europa Report isn't flawless, but it's a great entry in the canon of smart, well-made sci-fi.","user":"Far-Sky","rank":[278,343]},{"title":"A movie for true sci-fi fans","rating":10,"date":"30 June 2013","review":"If you are a true sci-fi fan, you should see this movie. It doesn't have a lot of visual effects, star cast or action. What it does have is realism, scientific character and honest human emotions. It tells a simple story of astronauts doing their job, willing to make sacrifices for science and not being dramatic about it. The plot and characters are believable, and realistic style of the film creates suspense much better than any cheap effects and tricks. This movie is made in a true spirit of sci-fi genre. Perhaps, it doesn't deserve a 10, but it should definitely have a higher score than something like \"Prometheus\". After all let us not forget about 'science' in 'science fiction'.","user":"juffin777","rank":[275,365]}]