[{"title":"Entertaining unpredictable story about neighborly behavior, and taking action when police doesn't","rating":7,"date":"26 October 2012","review":"I saw this film at the Ghent filmfestival 2012. The announcement text in the festival brochure sounded intriguing, and promised a series of surprising as well as disturbing turns of events. It worked out different from what I expected, but still surprising and disturbing alike.<br><br>Imagine a well-to-do couple buying a new house in what looks like a classy neighborhood. On one side a young couple with one little daughter, with whom they make friends easily, even to the extent that they make a small door in the fence to allow the kid walking in and out when she wants to.<br><br>On the other side is a house that looks disorderly, to say the least, inhabited by an antisocial man (called \"King\" for short) who receives even-so antisocial people on a daily (and even nightly) basis. Loud parties, drug deals, fights et cetera keep the newly moved couple from their badly needed sleep. They call the police from time to time when the noise from the neighbors borders on unbearable, as law abiding citizens should do, but it has no effect whatsoever. They approach the neighbor and try to reason with him, but his reaction shows a total lack of communication, and the dialog doesn't lead to anything useful. Some people tell them to stop bothering, and to buy earplugs to solve the problem.<br><br>You easily sympathize with the couple, while observing how desperation creeps up gradually. Finally they reach a point where they decide to take action. Their plan is to hide some of their silverware in the neighbor's house when he is away, and to call in the police. Their hope is that he gets arrested and disappears for some time. Being amateur burglars it proves not that easy for the faint of heart to break into someone else's house by night. Some hilarious scenes show how they eventually get in. For spoiler's sake this is as far as my synopsis goes. Expect the unexpected after that.<br><br>I very much like the way the couple is portrayed as proud house owners and their fruitless steps to deal with the nuisance their neighbors cause, initially by calling the police, later on by trying to reason with the neighbor. It all leads to more despair, thus needing desperate actions. You only can ponder how you would act yourself in such a situation. Hopefully it remains a thought experiment, to never come true in the real world.<br><br>All in all, this film can be considered quality entertainment. Do not try to think more of it. However, I found the final scenes a bit far fetched, more than necessary depending on caricatures. I had expected the scenario writers to get more out of the finale. But that is easy for me to say from my comfy chair. The rest of the scenario is well thought out, including the good versus bad neighbors contrast.","user":"JvH48","rank":[26,29]},{"title":"a quirky, unpredictable and edgy black urban comedy","rating":6,"date":"12 July 2012","review":"Rolf de Heer is one of our great filmmakers, although he refuses to be pigeonholed. His films, like Bad Boy Bubby, Ten Canoes, The Tracker, etc, tend to play more for art house audiences rather than the mainstream. His films have all offered a rather unique take on Australian society and our identity. While his latest film also delves into some ideals of contemporary Australian society, The King Is Dead is also something of a change of pace for de Heer, who is not renowned for his light comic touch. The King Is Dead is a quirky, unpredictable and edgy black urban comedy set in the leafy streets of an Adelaide suburb. Mild mannered science teacher Max (Dan Wyllie) and his accountant wife Therese (Bojana Novakovic) buy their dream home, a bungalow in an inner suburb, and move in. On one side is a nice family consisting of Otto (Roman Vaculik), Maria (Michaela Cantwell) and their cute little daughter Mirabelle (Lily Adey). On the other side though are a more interesting set of neighbours, who quickly turn out to be the neighbours from hell. The King (a perfectly cast Gary Waddell) is a paranoid, spaced out slacker living in a house owned by his sister, who is hospitalised. His sinister friends, nicknamed Shrek and Escobar, deal drugs. Unsavoury characters come and go at will, and loud rap music blares until the wee hours. At first Max and Therese try to make the most of the situation. But then the couple find themselves mysteriously burgled a couple of times, and the police seem powerless to act. Their lawyer advises getting earplugs. Max and Therese take matters into their own hands, devising a desperate scheme to get King and his friends off their street for good. But as usual their careful plans go astray and the film moves into some dark, uncomfortable territory. Wyllie and Novakovic are very good as the young middle class couple driven to desperate measures. Waddell (from Pure S, Getting' Square, etc) is perfect as the king, and brings a wonderfully dissolute and edgy quality to his performance. Luke Ford and Anthony Hayes are also strong and menacing in smaller roles as the King's obnoxious colleagues. De Heer's regular cinematographer Ian Jones has shot the film nicely using the widescreen. He also effectively uses hand held cameras for those scenes set in the King's ramshackle house to subtly disorient the audience. Beverly Freeman's set design is also superb, particularly in recreating the interior of the King's desolate and decrepit house. Graham Tardiff's jazz influenced score offers a contrast to the loud and abrasive music played incessantly by King's friends.","user":"gregking4","rank":[8,10]},{"title":"A better film than it is being given credit for","rating":8,"date":"22 July 2012","review":"This film is about a lot more than just the neighbours. In fact it subtly and silently relies on that long running soap as a platform to explore a side of Australia that isn't cheesy at all. Where do all the schizoid, emotionally disabled ,morally destitute, drug addled violent detritus of the lucky country live and what can you do about it? Can you bear it to imagine being anywhere near them and how easy some homicidal programme based on eugenic principles might appeal to progressive middle class gentrifiers faced with horrific disturbance imposed on peace and quiet, let alone petty crime, helplessness and vicious anti social behavior are some of the questions carefully presented. The two tiered society and correlation between disadvantage and opportunity or lack of it and sanity will keep you thinking for a while if you pay attention. You get a little humor true but darkness is not at the edge of town it really is right there in front of you, it's not the Hells Angels but just the idea of the 1% ers being many more than that number and too stupid to leave everybody else out of it. And we all know about the houses with the broken windows long grass, tatts, rape, glassing, all night parties and rivers of beer between visits to that core institution Centrelink. The film will be weighed down by our deep seated fear of this disturbance, a creeping cancer of the dumb and dumber. A brave challenge. No Kylie","user":"John-lewin10","rank":[18,37]}]