[{"title":"Look guys! I'm an auteur!","rating":2,"date":"14 August 2015","review":"Watching this film, I was constantly struck by the way the director inserted himself into the project with such a loud thud.<br><br>Playing camera and light tricks that seem designed only to showboat his technique, what is really revealed is an object lesson in the old phrase \"Knowing just enough to get oneself in trouble.\" I can only hope that with the passage of time, the director/writer/editor/Svengali behind this wet splat comes to be humiliated by how amateurish he once was as he's grown into creating valid works.<br><br>Plotwise, NO new ground is covered here. Not a centimeter of fresh ideas, but a fairly sizable contribution to teen-boy gratification fantasies wherein pretty girls say the c-word and a bleach blonde gives generously to the public nipple fund and the heroine is ...naturally, a virgin. Completely gratuitous gazongas (In the shower, of course!) is a sign someone has lost focus. This film doesn't ever seem to have bothered so much as looking for its reading glasses.<br><br>To get performances this poor on film requires determination in casting, extraordinary bad-luck or a George Lucas level micro-managerial determination to suck any kind of reality out of the otherwise human-shaped beings verbalizing and mugging on the beleaguered screen. Add to that a series of times where you can literally speak the dialogue before the characters do, and you have a morbid product to foist upon people who could have otherwise put that hour and a half of their fleeting lives into anything and found it more worthwhile.<br><br>The question of why it was made has been tossed out in a few reviews and while it seems like a bit of a mystery, I don't think it is at all. The answer lies in the opening of this review. It was a vanity piece created by a would-be auteur without talent or technique enough to assemble a film worth watching. I just hope he's able to grow using this film as experience. Another film this bad and Ewe Boll is going to be hiring hit people to come after this guy for working his stretch of sidewalk.<br><br>Best recommendation is for 12 year-old boys who've never heard of horror films before. THAT would be a happy group. Anyone else is going to find themselves checking their phones during most of this digital face-palm.","user":"toymatinee","rank":[4,4]},{"title":"You've got to be kidding me.","rating":1,"date":"15 September 2012","review":"I will put up with a lot to watch a horror.... it's hard to find a really good one and I understand, accept and even like that you have to watch a lot of B's, C's and D's to find one that might rate higher.<br><br>This one rates way, way lower. <br><br>If the main actor wheeze-breathed any more I think I would have to rip my ears off. She has 3 expressions - blank, concerned/worried/scared (they're all the same), and devil face.<br><br>The only redeeming feature about this film was the supporting actor, the brunette friend. The rest of the cast acted like they were in a school play and they'd had about 3 days to rehearse. <br><br>There were no real scares, no jolts, and certainly nothing unexpected. My friend and I were anticipating the dialogue and most of the time we got it right.... there are no new premises here! I really would rather have re-watched nearly any other movie than see this for the first time..... Give this one a big ol' miss.","user":"leannehassard","rank":[14,21]},{"title":"You need to be possessed to like this movie","rating":1,"date":"5 April 2016","review":"Plain &amp; simple: a horrible movie.<br><br>It tries to rip-off better movies, like The Exorcist or The Entity and fails miserably.<br><br>The opening credits are something straight out of YouTube. Wait, no, that's unfair...I've seen better opening credits in YouTube.<br><br>This was Greg A. Sager's first attempt at making professional movies...and I have an advice for him: please Mr. Sager, don't quit your day job yet. He is the Director, Writer &amp; Editor of this abomination. At least he did an \"ok\" job in the editing dept.<br><br>The script is awful and completely ridiculous. It's filled with plot holes and full of ludicrous situations.<br><br>The acting is simply atrociously bad. There's not 1 good actor in the whole movie. I'm serious: sometimes it feels like a homemade movie, as if some friends just grabbed one camera and said \"let's make a scary movie, you guys!\".<br><br>Photography is a mess and I'm starting to feel like they didn't do the catering right.<br><br>The FX are complete trash. And most of them are just CGI. Bad CGI.<br><br>The only \"redeeming factor\" of the whole movie is that they took one of YouTube's most infamous \"scary clips\" and remade it almost exactly. So yeah, it's that unoriginal. But hey, at least they've proved that the YouTube video was a hoax...right?<br><br>Seriously...don't watch this poorly made and very badly acted piece of garbage. Remember that life is finite. You've been warned.","user":"Orpheus_Unlimited","rank":[3,3]}]