[{"title":"Can't dismiss yourself out of this conversation","rating":7,"date":"6 November 2014","review":"The characters in #Stuck are caught in a record-breaking traffic jam; a traffic jam big enough to bring Michael Douglas's D-Fens past his breaking point and into immediate suicidal tendencies and stagnant enough to make the bourgeois French in Jean-Luc Godard's \"Week End\" mow right through the long array of cars before them. One immediately wonders upon arriving to a halt in their vehicle behind numerous other cars (a) what is holding everybody up and (b) will they ever be able to exit this long road and arrive at their destination? Traffic jams are also inherently anomalous in the regard that while one complains about being stuck in traffic, they are also part of the very issue preventing the person behind them from advancing another car length, effectively shortening the population of the road by one.<br><br>I feel like I'm beginning early research on the opening to a paper for my college class entitled \"Existentialism\" with that kind of introduction, but my mind wandered quite frequently in such a way while watching #Stuck (which, I presume, should be read as \"hashtag stuck\"), a film that has a narrative that meanders and drifts in a similar way. It concerns the likes of Guy and Holly (Joel David Moore and Madeline Zima, the only two real characters of the whole film), whom we first see sleeping next to one another following a one night stand. Holly wakes up to realize she left her car at the bar the two were at the night before and must endure an awkward ride home with Guy, who she was planning to simply abandon while he was still sleeping. \"Why couldn't you have left early like any decent one night stand,\" Guy tells her when they are driving home.<br><br>Guy and Holly wind up getting stuck in a traffic jam so large that adjectives fail to describe its immensity. The main arteries of Los Angeles are clogged with vehicles large and small, on a Sunday afternoon, and nobody is moving. What the start of that jam looks like is only known by a select few. With that, we have a film about two people whose interactions were about to conclude with sex and an overnight snuggle, forcibly being stuck together in a small space for an undisclosed amount of time. The two do nothing but make passive-aggressive conversation with each other, with Holly pervasively texting a friend unknown to Guy, and saying how she hopes somebody is dead at the beginning of the traffic jam to justify the mass amount of congestion. Guy responds by calling her amoral and, alas, we have the makings of a conversational film.<br><br>Writer/director Stuart Acher ping-pongs back and forth frequently to show the one night stand between Guy and Holly in reverse, showing events play backwards in sequence from time-to-time. While we get intriguing backstory to how these two met and came to agree to share in the desire of basic human gratification for one night, this distracts from the intimate conversation occurring in the car. #Stuck hits its stride when we indulge on the lyrical poetry of Guy and Holly, arguing or giggling over their wayward ramblings as they sit helplessly in the midst of a never ending traffic jam.<br><br>People have asked me why I love films that take place entirely, or predominately, in a sole location, like Open Water, Adam Green's Frozen, and Buried. The answer is simple; the films are forced to have dialog and some character interest or, in a horror film's case, elements of basic human survival. Films with various locations often become distracted with setting, undermining the connective tissue to the audience which are the people exploring such a region. I love films that emphasize character traits and personalities because those are the films that strike human tendencies and allow for empathetic feelings to surface.<br><br>While #Stuck, even when it hits conversational strides, never becomes that deep or invested with its characters, it's a solid look at where we are with relationships in a modern sense. We are now seeing millennials (this includes myself, mind you) more invested with hookups and momentary encounters, something made popular by social media and apps geared towards the idea of a brief encounter that often turns very sexual. The idea of settling down is a concept that, as of right now, doesn't appeal to us, which is startling considering a generation ago, it wasn't uncommon seeing people marry around twenty. If nothing else, #Stuck is an intriguing testimony to where we're at in the digital relationship age, forcing two people together for more than just a momentarily satisfying hookup to engage face to face and not through illuminating screens or over alcohol.<br><br>Starring: Joel David Moore and Madeline Zima. Directed by: Stuart Acher.","user":"StevePulaski","rank":[16,22]},{"title":"A funny, light, touching gem of a movie","rating":9,"date":"14 May 2017","review":"Two people are forced to extend a one night stand due to a huge traffic jam.<br><br>This film is the rarest of beasts: a clever comedy that is actually funny.<br><br>Most of the action is inside the car with the two struggling to pass the time, the rest is flash backs of the drunken night that led up to their predicament.<br><br>At first I thought they made an unlikely couple, but the chemistry between them is great. Lots of the comedy is observational and very sharp.<br><br>It is nice to find something that has a little depth but is still light and funny (this is no \"Broken Flowers\" or \"Lost in Translation\" yawn fest)<br><br>If you are a fan of the Seth Rogan kind of humor you may find this a little bland and tame. For me it was perfect.<br><br>I loved both characters and really got invested. The pace of the film is quite slow and considered. To break up the narrative you get snap shots of the people trapped in the jam around them.<br><br>A great, subtle, funny, clever little movie.","user":"thekarmicnomad","rank":[8,10]},{"title":"Very enjoyable","rating":8,"date":"30 September 2017","review":"This was a real joy to watch. It's light, funny and witty. The story is very simple and most of it takes place in a car stuck in heavy traffic and yet it never gets boring. The characters are both well written and charming and the dialogue is great. Both lead actors did a really good job and made their characters really believable, the chemistry between them is great too.<br><br>It would be great if films like this would get more promotion and wider release so even more people could enjoy them.<br><br>If you are looking for something relaxing, smart or a nice date movie, this is your choice.","user":"Lugo1989","rank":[5,7]}]