[{"title":"To be missed.","rating":2,"date":"12 January 2013","review":"D-minus.<br><br>The film maker obviously wasn't aware of the curfew for teenagers in the city of New Orleans. The brothers would have been picked off the street by NOPD and placed in custody until claimed by their family.<br><br>The title of the film, \"Tchoupitoulas,\" is the name of a New Orleans Street. One would assume from the title that this teenage \"road\" movie would have found the boys at least visiting the street. What we get is very poorly superimposed shots of Carnival (always in cold February--rarely in March) with the boys wearing the summer T-shirts they were wearing on a warm summer night in New Orleans. The Carnival scenes, with floats, somehow are meant to be played out on Bourbon Street. I can assure you that large Carnival floats no longer pass through the French Quarter--fire regulations and crowd control problems.<br><br>The boys miss the Midnight (and last) crossing across the river back to Algiers, the section of New Orleans which is located on the west bank of the Mississippi. They wonder from Canal Street to various parts of downtown New Orleans. We get to experience some of the sights that they see and which they comment on and if, and I emphasize, \"if,\" you can understand the dialog (ad lib?) because of the very poor sound quality, you are far luckier than I. Between the Midnight hour and 6:00 a.m. when the ferry sails again, you'll find the boys on Frenchman Street, fully lit up, we are to assume, early in the a. m. This is the Faubourg Marigny section of New Orleans, just below and immediately adjacent to the French Quarter. It's \"jumping\" up to about 1 - 2 a. m., but it's very tame after that until the next night. The film maker had no sense of time and places his trio of brothers all over a small area the city with no particular purpose as to why they are in that particular place. The boys don't experience an epiphany nor do their lives seemed transformed by their wanderings.<br><br>The opening of the film shows the tense strain of temperaments between family members. It is also, sadly, a quite unaesthetic environment that the boys inhabit. Could their home be a crack house? Sadly, again, we never see the boys get on the Canal Street ferry and we never see them get off of the ferry. They just materialize across the river. Having ridden the ferry numerous times, there always is a feeling of magic or anticipation about boarding or leaving it. This is not captured in this film.<br><br>The shaky hand-held camera work is annoying, quite often out of focus and about the only good-looking, easy to look at scene is the one in a striptease club. The stripper is excellent with lots of talent.<br><br>For a city famous for music, the soundtrack leaves very much to be desired.<br><br>A huge disappointment. The University of New Orleans has an outstanding film department. I bet the students there must be cringing at \"Tchoupitoulas.\"","user":"claygoul-2","rank":[21,32]},{"title":"Veritas","rating":8,"date":"5 February 2019","review":"Thrilling late night ramble that follows a trio of brothers through this magical city with little to no interference by the artists. The extrapolation comes in how the camera eye lingers, on an extreme close up of a bluesman's face, the artistic focusing on a street lamp, the buskers, dreamers, homeless, and tourists. The filmmakers are as dazzled by the wonder of New Orleans and all its citizens, all its treasures as we are. Reminiscent of Little Fugitive. A beautiful, little film.","user":"jacobsonalan","rank":[1,4]}]