[{"title":"A 'war movie' for modern times","rating":8,"date":"2 March 2017","review":"Not so long ago, all 'war movies' consisted of armies of infantry storming one beach/desert/jungle (delete as applicable). And, to be fair, there was little else that happened in a war. However, in today's high-tech times, 'war' can be fought from the 'comfort' of our own homes (okay, military bases, but how long before our soldiers are allowed to work from home?!). The story here goes that Britain has finally got the intel on a handful of its most wanted terrorists who are amassing in a house in a suburban African district. Should they just use an American-based 'drone' to wipe them out, or is the civilian casualty rate going to be too high? Helen Mirren thinks the former.<br><br>The cast boasts Breaking Bad's Aaron Paul on the cast list (and, of course the last performance of Alan Rickman), but it's Mirren who steals the show. She seems to revel in playing the British colonel who is willing to 'take out' the extremists at all costs. Aaron Paul isn't in it as much as some people may hope, but does well with what he's given (which is basically spending the whole film sitting in a chair!). Alan Rickman is as awesome as ever and it's a shame we've lost him too early. Plus we do see what's happening 'on the ground' as it were and the film's unsung hero is a Somalian operative who seems to give a performance filled with more heart and feeling without uttering a word of English than most English-speaking actors.<br><br>If you're hoping for an action-packed blast-a-thon of a movie then you'll be very disappointed here. Like I say, it's a war movie of our time. Some people may say that this is a fault, but basically the whole movie is people sitting around in offices debating the ethics of using technology in this way. The film is basically an 'ethics piece' which debates both sides of the argument. I have no problem with films like this, as long as they remain – reasonably – neutral and do their best to put both sides of the argument across. This one does this pretty well, however it does tend to lean towards 'nuking the site from obit' (ala Ellen Ripley) simply because its bigger stars seems to share the same opinion. However, there are plenty of moments where both sides of the argument make good points to support their opposing views.<br><br>This film won't be for everyone. Like I say, you have to be in the mood for something which is slow (but without being boring) and filled with messages (without being preachy). It does show how 'war' has evolved to a PR machine as much as something that is simply fought using a bigger army than your opponent. If you're up for something a little more thought-provoking then definitely give this one a go.","user":"bowmanblue","rank":[35,42]},{"title":"Intention vs. reality","rating":9,"date":"29 July 2018","review":"Great movie that doesn't have to rely on tons of CGI to sustain interest. Instead, there is just a handful of characters, and they discuss about consequences. It's a discussion that won't happen in reality, of course, but the characters represent the different viewpoints in the drone killing process, and they do it very well. As another comment said: you have never seen a Skype call this gripping. This is great cinematography.<br><br>Had it just been a discussion about the moral ambiguity of drone strikes, the movie would not have convinced. Where the movie shines, IMO, is its portrayal of uncertainty. Reality cannot be manipulated, and can certainly not be taken for granted. The outcome is not decided in the discussion, but afterwards, and we have to face it. That can make you reluctant to act to the point of cowardice, or all gung-ho, but it doesn't make a difference in the end.<br><br>So, is there a happy ending? It doesn't matter. Live with the pain.","user":"theovosse","rank":[12,13]},{"title":"Disturbed and Intrigued","rating":8,"date":"14 June 2016","review":"This movie was all of a sudden for me. \"GoodKill\" was the previous movie I saw which was made on the pilot behind the control's of the drones. But this took the movie to another level and did not let it stay stagnant.<br><br>I went into watching this movie with no idea, apart from the fact Aaron Paul and Helen Mirren are in it. It took me on a edge of the seat, nail biting suspense to understanding of all the decisions and effort that goes into putting a mission into effect. <br><br>If you wanna see a rare movie, shot splendidly, beautiful cast, perfect emotions and acting - this is a movie to watch. It might even crack your tears up if your so engrossed into the role these actors play in this movie. <br><br>One to watch, and I feel one to definitely own in Blue Ray.","user":"faisalhot","rank":[95,130]}]