[{"title":"Waste of 93 minutes","rating":2,"date":"10 January 2018","review":"The synopsis of this movie was intriguing. I always enjoy a good apocalyptic movie... good being the operative word. Forever's End was neither apocalyptic nor good. Every time I thought something interesting was taking place, it fizzled into nothingness. Eventually the entire movie did just that... it fizzled into nothingness. \nI'm hesitant to comment on the acting, because the actors had nothing with which to work. A few have commented favorably on the cinematography, and I will admit, rightly so. That's about the only thing this movie has going for it.","user":"dermasse","rank":[11,12]},{"title":"Crap and more Crap","rating":1,"date":"7 July 2015","review":"What a waste of time. Complete aimless ambling albeit with good acting and cinematography crap fest. I agree wholeheartedly with the down votes on this god-awful waste of time and money. Someone somewhere was either paid off for a good review or have some other incentive connected for giving this thing other than a 1. <br><br>Because I have to write ten lines to submit this I'll add the following: The plot lacks anything close to a plot, the story meanders here and there with no clear definition, characterizations are hollow at best, you will be lost throughout and unfortunately still lost when it ends.<br><br>Can I have please have the time back that I wasted on this dog? Please?<br><br>I could have spent that time watching something worthwhile.","user":"probuilders","rank":[10,14]},{"title":"A Meandering Snoozer!","rating":2,"date":"6 April 2015","review":"This movie reminded me of when my Jack Russell first saw himself in a mirror.The first thing he did was lunge at the reflected Jack, loudly bonking his nose on the cold glass. He stepped back, shook his head and then decided to see if he could get to the trespassing dog from behind the mirror. Rushing around the back of the thing (several times) he was completely stumped by the fact that there was nothing behind it.<br><br>This movie is the same thing. It starts with an interesting \"whodunit\"which grabs your attention. However, as you \"walk around the mirror\" it dawns on you that there is absolutely nothing there. In fact, it takes quite a bit of time for any characterization to develop at all. When it finally does, you realize they are boring, unlikeable and unimpressive characters. The movie itself wanders from scene to scene with little cohesiveness and little or no suspense.<br><br>They would like you to think that once you get to the end, all is known and everything will fit neatly and cleverly in place. Unfortunately, by the end of the movie you couldn't care less about it, the characters or the lame plot. It's too bad because the actors and cinematography weren't horrid and if applied to writing with an actual plot, might have made a nifty little suspense movie.<br><br>I'm always amused by the so-called \"critics\" with their effusive praise for movies like this. Most of the time, their bubbly praise is indicative of an association with the film itself (e.g. somebody's brother, brother-in-law, sister, investor, girlfriend, dog walker, etc). These are easy to spot due to the constant name dropping of the director, the actors and even a grip or two.<br><br>A good movie doesn't require any froofy prose from a self-impressed reviewer to convey its value. Just a straightforward description of style, plot, characterization, production values and any exceptional features. When the reviewer starts babbling about esoteric schmaltz it's a fair bet you'll be asleep in under 20 minutes! <br><br>Regards, The Other View","user":"nospam-25-374977","rank":[19,31]}]