[{"title":"Slow burning but satisfying first try","rating":8,"date":"14 August 2013","review":"Man of Tai Chi may not be one of the best martial arts movie made, but i would say, its a good first attempt at directing by one of my more favored actor and an all-around good human being, Keannu Reeves. Though the acting might slightly be bland for the most part (all right then, all through out except for Karen Mok who i adore), but then again you have to admit though it's not exactly Shakespeare we're watching here. Its a pound for pound martial arts movie for action flick aficionados, too much acting or show of emotions would've made it too soft for me or pretentious. I think this movie might as well be Mr. Reeves' love letter to Chinese cinema which apparently influenced him a lot. I'm quite impressed as well that Mr. Reeves has set his Hollywood superstar status aside to make way for the little guy behind all the fancy stunts and high kicks that makes all those Hollywood action movies enjoyable. Kudos to Tiger Chen for the amazing action sequences in this film as well in the other movies he had been in as stunt coordinator and the like. Mr. Chen, is the real thing here. And in conclusion, i would like to say that i know that not all may come to appreciate this movie, only a few will, but i say its an acquired taste. Its entertaining for the most part. I'm glad its not deep which is what i like in an action flick, because i don't want to work that hard when i'm already too exhausted just following the punches thrown in this film. But its a joyride and a spectacle to savor from beginning to end. Again, congratulations Mr. Anderson... the Matrix will be proud.","user":"alde_benjie","rank":[50,59]},{"title":"Excellent directorial début by Reeves","rating":8,"date":"10 August 2013","review":"I liked what I saw in the trailer, but was still not sure what Keanu Reeves would do as a director. I have heard from him in many interviews how he is a 'kung-fu film nut' but you can never be sure if actors are serious in interview or not. Once you see this movie, you can tell just how much of a kung-fu film nut he actually is. He used the camera very well in every single fight scene, none of the shaky-cam stuff we see in most action and kung-fu movies today - where the speed of the camera makes the pacing of the fight. On the contrary in Man of Tai Chi Reeves keeps the camera stationary, or only slowly panning in the fight scenes, he also used a lot fewer quick-camera cuts. Essentially he allowed the impressiveness of the moves and styles themselves to shine through. If you choreograph the fights well enough the camera does not need to be moving fast, in fact it could sit in one place and not move at all and the fight is still impressive. He still need to work a bit on his dramatic direction but he has fight scenes down pat. If he somehow reads this, or someone who knows him does - don't change a thing with your fight direction.","user":"sean-cowan1","rank":[90,112]},{"title":"The One is finally back!","rating":6,"date":"6 August 2013","review":"I saw the trailer and had my expectations set pretty high. In many ways I felt like this movie was more of a test run for Keanu. The story line was very generic but I love the big name Hong Kong actors. I wish he utilized them more but I guess for a kung fu movie cops can only have a minor sub- plot. <br><br>The movie's greatest strength was the amazing cinematography of each action sequence. I love how I can identify each style of fighting and enjoyed the clarity of each strike, grab and throw. Too bad Keanu can't pull out his matrix-self and show us he still got it. <br><br>I enjoyed this movie very much even with its flaws it is a solid kung fu movie. Kung fu movies are released fewer and fewer each year, and I hope Keanu can turn into a great kung-fu movie director and still continue his acting.","user":"kennysiuu","rank":[70,86]}]