[{"title":"If nothing else, The Banshee Chapter proves that jump scares can still be... scary.","rating":6,"date":"1 November 2015","review":"I'm not a fan of jump scares. I think they're cheap, sometimes manipulative, and they rarely imbue dread. Rather, they can ruin a movie's atmosphere if used incorrectly. Having said that, The Banshee Chapter has the best use of jump scares I've seen in a long, long time. You can sense them coming from a mile away, yet they can still make you crap your pants. I credit this to the director who clearly has a grasp on how to utilize atmosphere and build-ups effectively. These scares don't seem cheap; well, some of them do, but the tone is set by the creepy music, the static, and the robotic voices which really holds the movie together. And the imagery itself is creepy. If I saw one of those things near me, I would freak the f*** out too.<br><br>Now, you probably noticed by now that I haven't even hinted at a narrative in this movie, and that's because it's so flimsy it's hardly worth mentioning. It's basically about MK Ultra and the government testing drugs on people, then things start to go horribly wrong. The premise is good, but the actual story - the execution - is hollow and lazy. I didn't care what has happening half the time. I was too busy peeking through my eyes (kidding, but not really) waiting for the damn thing to come out from somewhere. Almost every scene is crafted this way - light on substance, heavy on scares.<br><br>Thankfully, horror is about the scares so I have to give The Banshee Chapter credit. Even though it stands for everything I hate in horror movies, this one actually gets it right, and for that alone, bravo.","user":"lnvicta","rank":[74,87]},{"title":"Tense and scary","rating":8,"date":"19 January 2014","review":"Just watched this and was pleasantly surprised. Especially after seeing the IMDb page and checking out the HORRIBLE poster and low rating. <br><br>Essentially a tale about government chemical mind control experiments, with a mix of a scary shortwave radio transmission and some super cool Lovecraftian elements a la From Beyond, it is done in a scary manner, with a mix of found footage, real and faked news clips, and sometimes just plain old standard filmed storytelling. <br><br>The flashlight, a common horror cliché, is also used to great effect here. I can see some people not liking this one and it being a polarizing movie but I enjoyed it very much. It also boasts a great performance by Ted Levine, who freaked us out as Rusty Nail in \"Joyride.\" This is the first scary movie I've seen in a while. The last thing I can say is it's a mix of originality, cliché, and \"borrowing\", but what movie today isn't?","user":"victoryismineblast","rank":[55,79]},{"title":"An unexpected treat","rating":7,"date":"22 June 2014","review":"I'd never heard of this film, (and only recognised two of the cast) but found it while channel hopping last night.<br><br>The blurb sounded promising so I thought I'd give it a go and I was glad I did.<br><br>The film felt very \"indie\", a simple (if somewhat odd) idea nicely executed. Other reviews have described it as \"Lovecraftian\", and that description works well (there is even mention of Lovecraft at one point).<br><br>The mood is one of hidden lurking menace, never fully seen, only glimpsed. There were several excellent \"jump out of your seat\" scares, but even those were tastefully done. The acting is low key and the roles well cast.<br><br>I'm not going to say much more as I'd love people to discover this underrated little gem for themselves.","user":"andymclennan","rank":[25,35]}]