[{"title":"I found myself rooting for these folks to die and I just wanted it to end!","rating":2,"date":"17 May 2014","review":"A huge trend in low-budget films over the last few years have been the so-called 'found footage' movies. In other words, the participants in some horrible massacre, ghostly apparitions or alien invasion supposedly used a home video camera and the film you see is that actual footage. In the case of The Blair Witch Project, a tiny indie brought in many, many millions of dollars. However, by now, 15 years later, the idea no longer seems very innovativein fact, it's become a bit of a cliché. While some newer found footage films manage to overcome this and still entertain (such as \"Alien Abduction\"), a lot of it is just crapand \"sxtape\" is just crap.<br><br>There are two huge problems with this film. First, despite the title, there isn't that much skin in this film. Instead, they talk about sex a lot and when the characters supposedly are having sex, you don't see anything. So, for someone just wanting a cheap thrill, there just aren't very many. Second, and this is by far the biggest problem, the characters are utterly hateful and I was annoyed every second they were in the film. And, considering they are in just about every frame, it made watching this movie a real chore.<br><br>Adam is supposedly filming everything in this, so all you get from him is his voice. He's a weak-willed guy who seems to do whatever his nutty girlfriend, Jill, suggests. She is a super-annoying young lady who seems completely absorbed by herself. The dialog between them is among the worst I can recall in a film—and they have zero depth to their relationship. They just cuss, talk about sex and she does whatever she feels like doing—exposing herself to others, shoplifting or breaking into an old abandoned hospital. And, the hospital break-in consists of most of the film. Jill and Adam decide to sneak into the place and make a sex tape. However, mostly they just rummage through the old building where it appears as if no one has been there in decades—yet, inexplicably, the lights still sometimes work and the water is also working (huh?!). Later, after one foray into this creepy place, they bring a couple equally annoying friends and they run amok in this place. There isn't a lot of suspense, however, as when the film began, you learned about their fate. <br><br>The bottom line is that having ANYONE occupy this much footage on a found footage style film is tough because the viewer will most likely tire of their antics. But, when you make the people THIS annoying and banal, then it's practically impossible to enjoy the film or recommend it to anyone. Overall, it's a film lacking originality and horror that is instead just a horror to try to watch.","user":"MartinHafer","rank":[49,58]},{"title":"Too little happens too late, annoying characters","rating":5,"date":"19 May 2014","review":"A young couple embark on a road trip to an abandoned hospital with the man filming everything along the way. The woman is a painter and the idea is to scope out the hospital to hold an art show there at a later time.<br><br>When their car is towed, they call a couple of friends to pick them up, but plans change and they all re-enter the building. This is when bad things start happening as supernatural forces begin to manifest.<br><br>The characters are so annoying and their decisions either do not make sense or just plain drive you crazy. Too little happens too late and what does happen is not very interesting. If there were more supernatural goings on and the characters were more likable I think I would have enjoyed this a lot more.","user":"victoryismineblast","rank":[19,22]},{"title":"Missing More Than The E","rating":2,"date":"8 May 2016","review":"I should have known this would be miserable. And it was. The clue was the pretentious missing E but I actress was kind of hot and...well...I'm an idiot. <br><br>Jill and Adam live in the stereotypical \"art space\" that their parents probably pay for. They have a lot of sex and talk about \"art\". That's the extent of their relationship and about the only part of the movie that works. Adam finds an abandoned hospital and shows it to Jill. OOH! They can use it an an ART SPACE!. If you can get past the ridiculousness of this you have more tolerance than I. <br><br>They wander around making plans. Jill, in a clue to how much thought she put into her art, says she can just sign the garbage lying around and that's art. They find a room with a strap-down table. Adam straps Jill down and leaves her there for...well, we don't know how long, and she's assaulted by some spirit. Adam come back. They have sex until Jill's nose literally bleeds. Good job, Adam! They get freaked out, leave the building and...ruh-roh! - her car's getting towed away! Of all the BAD LUCK. They call for a ride from a friend who shows up with her dickish boyfriend. <br><br>And decide to go back in the building because it worked out so well the first time. <br><br>An hour later, the movie ends. <br><br>If you like movies where the characters actively work against their own self- interests simply because of the script and lack any kind of logic at all (the water, power and video equipment in hospital all still work) then you'll love this. If, however, you need even a hint of reality to your suspense, don't waste your time.","user":"paul-day-clone","rank":[6,6]}]