[{"title":"Ending damages the quality of the film","rating":6,"date":"3 June 2017","review":"I generally try to avoid doing reviews containing spoilers, however in the instance of 'Black Butterfly' the ending was far too important towards the quality of the film not to discuss it. So let's start there. It's typically considered the laziest technique possible in the film making industry to end your film with the \"it was all a dream\" twist. 'Black Butterfly' uses this twist, and tries to cover it up by implying that the whole dream will be used to get a writer's career back on track. That doesn't fly with me. It still means that everything that happened up until that point was completely purportless. It's a shame too because up until that happened I had really enjoyed the film for the most part.<br><br>So the film loses a couple of points for the ending it uses, but I suppose the rest of the film still needs to be evaluated. Right before the dream twist was revealed I thought the movie was going to cut to the credits. Had it done so I think I would've called this a flawed, yet entertaining thriller that meant well in what it tried to do. The twist before the dream twist (yes that's right, the film already had a twist going for it without the need to tack on that final scene) was intriguing and had me reconsidering everything that had happened to that point. It didn't entirely add up and some scenes suddenly come across very strange when you reflect on them. For the most part though it worked well enough.<br><br>I felt a little sorry for Jonathan Rhys Meyers in this film. He gives it his absolute everything, but the script often holds him back with repeated and uninspiring dialogue. Also the actors he is given to play off (Antonio Banderas for the most part) really aren't on the same level as him in this film, and so his performance can come across as overacting occasionally. It's not, he's just a level above the rest.<br><br>I'm told the trailer to this film gives away entirely too much, which is a real shame. I watched knowing almost nothing of the story and that definitely made it a much more enjoyable experience on my part. Wipe the final scene and I think you have yourself a very fine little thriller. Even as it is it's still above average.","user":"jtindahouse","rank":[53,63]},{"title":"Enjoyable to watch","rating":7,"date":"3 September 2017","review":"Black Butterfly is a mystery/thriller. You feel that there are going to be twists so you try to figure out what the outcome will be. For once I had it right even though it wasn't necessarily obvious. My wife didn't see it coming. The story is far from perfect but it still remains a good movie to watch. The main characters are played by Jonathan Rhys Meyers and Antonio Banderas and they did a good job. Their complicity is what the movie makes it interesting to follow. And even if there were a couple faults in the story, not very big ones, Black Butterfly is a good movie for people who like this genre. It could have been better but than again I saw so much bad movies lately that I'm not going to be fussy about this one. Nicely shot, with good actors, and with an okay story with the necessary twists for a movie in this genre.","user":"deloudelouvain","rank":[22,25]},{"title":"Great movie with a small cast - just 2 men !","rating":8,"date":"28 May 2017","review":"I really enjoyed Black Butterfly, it was one of those movies that you kind of knew what was happening next, and then things turned out very differently. The 2 main characters were very well acted. I know a negative reviewer was saying alcoholics don't swig out of bottles, well as an alcoholic, I can tell you that was true to life, as was the early morning drinking, and blanking out and waking up in bed. The movie had a great location a secluded ranch style house and the tension was palpable almost from the start. I promise you, the ending was amazing and totally unexpected and a pleasant surprise. Overall a low budget movie which I enjoyed far more than Star Trek Beyond which cost $180 million dollars and which I refused to watch to the end. I am quite critical with movies, read my other reviews. This film is definitely worth viewing with pleasure and interest.","user":"mike_brunton","rank":[48,68]}]