[{"title":"Excellent Movie!","rating":10,"date":"21 January 2015","review":"This is a must see film. A fantastic coming of age story set in Yellowstone National Park. The reintroduced wolf packs are a back story in the film, so if you love wolves you have to see it! Druid Peak was filmed in Wyoming and Utah. The cinematography is amazing. The director was able to use amazing natural light to back light many scenes. I kept thinking the crew must have had to be up early to shoot some of the scenes where the light is coming through the forest.<br><br>Andrew Wilson underplayed his character so well, it made me rethink all the talking we do as parents. The director's pacing of the scenes was amazing I loved when the camera lingered on a shot for a long time in order to increase the tenderness of the scene. Something that has gone by the wayside in modern movie making.<br><br>If you love wolves, love the outdoors, and love independent films this is a must see movie! I highly recommend Druid Peak.","user":"chelsearayedunn","rank":[12,16]},{"title":"Beautifully written, elegantly filmed, well-acted","rating":10,"date":"6 June 2015","review":"Druid Peak is what great indie films should aspire towards-a great and meaningful script, cinematography that is elegant, yet restrained and performances from Spencer Treat Clark and Andrew Wilson that are believable and powerful. First time writer-director Marni Zelnick has incredible talent in both categories, but the writing , which weaves a coming of age story against the wolf reintroduction program in Yellowstone, is impressive in the extreme. Clark's character makes a journey from a completely unlikable bully to a person of substance as he discovers that wild places, and the creatures that inhabit them, can have a healing effect on those who are open to them. The transformation is both believable and more than a little inspiring.<br><br>Rachel Morrison lenses this picture with the incredible talent for which she has become widely-recognized. Her mark is on every scene, sumptuous, yet incisive. Wyoming becomes one of the\"characters\" of the movie under her able hands. <br><br>The chemistry between the 2 laconic leads, Spencer Treat Clark and Andrew Wilson, evolves inexorably and each actor shines in the way their relationship develops as they deliver the terse and excellent dialogue. <br><br>While set against the timely background of the effect wolves and other apex predators have on the trophic cascade, this is much more than a conservation movie, despite its message. It shows how transformation can come in many forms, including the ability to discover the wild within us.","user":"tmayer-91-141863","rank":[8,12]},{"title":"Absolutely Wonderful! Gorgeous scenery in the Tetons, Wolves, Moose, Buffalo & a compelling story","rating":10,"date":"14 September 2017","review":"Such a wonderful movie. I very very rarely give anything 10 stars but this was first rate. Thank you Marni Zelnick for this absolute gem! Why are there not more movies like this? The story is compelling; messed up teenage kid is sent to his Father in Wyoming and finds himself and starts to heal from his former life of meaningless mediocrity. I spent 3 months living around Jackson where this was filmed and it is gorgeous scenery. Excellent writing; very good acting by all. I particularly liked the role of the Father. He knew exactly how to act and speak with his errant son. An example of good parenting. For me, the movie underlines the need for our young people and children to be out in nature and among wild animals most of the time. Being stuck in classrooms is not an education. What this young man had in Wyoming was an education and what all young people need, in my opinion. I absolutely LOVED the teaching the Father gives on the ride, explaining how it was only when the wolves came back to Yellowstone that the behavior of the elk, moose changed resulting in more trees, plants, birds and thus showing how we really are all connected.. but he waited until his son had been nurtured enough by the land, the wolves and the experience before speaking these words. Thank you so much Ms. Zelnick... this has become one of my favorite movies ever. Please make something else with as much heart set again somewhere where it's still wild and free.","user":"fourwinds4","rank":[4,5]}]