[{"title":"Interesting documentary, a personal dialogue with a master filmmaker","rating":7,"date":"18 November 2013","review":"Interesting documentary about master filmmaker Polanski, who is visited by his friend and business partner of nearly 50 years, Andrew Braunsberg, in his Swiss chalet in Gstaad, while under house arrest for the rape charges dating back to 1977. Polanski gives a very personal insight in his early life, from childhood during World War Two, to his early acting career and later personal tragedy with Sharon Tate. Highly interesting, even touching, this is recommended to any film fan. Some of his films are neglected, some not even mentioned, but what you get to hear is fascinating. Polanski sometimes has to fight back tears. Good piano score by Alexandre Desplat.","user":"RonAltman","rank":[13,16]},{"title":"A Great Documentary","rating":22,"date":"22 November 2017","review":"Roman Polanski: A Film Memoir (2011) <br><br>**** (out of 4)<br><br>This documentary from Laurent Bouzereau has Andrew Braunsberg sitting down with his friend Roman Polanski who discusses the various highs and lows of his life. The majority of the running time is devoted to the major events in the director's life. That being the Holocaust, losing his wife to the Charles Manson family and his rape case that had him leaving America.<br><br>If you're a fan of Roman Polanski or at least interested in his story then you'll certainly want to check this out. This is a highly entertaining look at Polanski's life that allows the director to discuss his feelings and memories. He gets quite emotional talking about his mother who was murdered in a gas chamber as well as talking about losing his wife Sharon Tate.<br><br>It's rather amazing to see how much happened in Polanski's life even when you don't factor in the movies. Having been involved in WWII, having been involved in one of the biggest stories in American history and then fleeing the country is just a lot for one person. Then, of course, there are the movies.<br><br>Some have attacked Braunsberg for being too friendly with Polanski on tough subjects like the rape case but they are friends after all. I don't have a problem with the structure of the picture as I found it to be incredibly entertaining and it's interesting to hear the director talk about various moments of his life as well as comment on some of the films that he made.","user":"Michael_Elliott","rank":[3,4]},{"title":"What a hack job","rating":1,"date":"22 July 2013","review":"Laurent Bouzereau isn't exactly well known for hard hitting questions in his documentaries, but this one takes the cake.<br><br>Roman Polanski's friend (that alone should set the alarm bells off) Andrew Braunsberg is the one asking the questions, and it becomes painfully clear why they have a personal friend of Polanski interview him: So he can be asked lowball questions allowing Polanski to rant freely about the supposedly unfair shake he got from the legal system. Not only does the interviewer fail to deliver any follow up questions - he actually aggressively supports Polanski.<br><br>Here's what happened: Polanski gave drugs to an underage girl whom he proceeded to rape. Whether she consented or not, as some Polanski defenders claim, is inconsequential as a minor can not consent to sex, thus rape.<br><br>How does the interviewer - that is, Polanski's friend - approach this issue? The verbatim quotes are: \"... and suddenly you had this experience with Samantha\" \"... 33 years since the case with Samantha occurred\" Not once are the actual details of the case presented. Not once are drugs mentioned. Not once is rape mentioned. It's transformed into an abstract \"experience\" or \"case\" that \"occurred\" with a presumably helpless and passive Polanski as the true victim.<br><br>But you can rest assured that Polanski is given plenty of time to lament over how unfairly the justice system treated him, how scary jail was, and how he was forced to leave the country. Poor Roman living in luxury in Europe for the rest of his life! By now the interviewer's lower lip is trembling with sadness, and he several times feels compelled to point out how he so admires Roman for having overcome so much adversity in his life. I was fully expecting this documentary to turn into Brokeback Mountain.","user":"shanayneigh","rank":[50,140]}]