[{"title":"I think this is the best of the Tom and Jerry movies","rating":9,"date":"18 September 2011","review":"I love Tom and Jerry, their cartoons were the epitome of my childhood. The direct-to-video movies have been rather hit and miss for me. I liked Nutcracker Tale and Shiver Me Whiskers, but disliked Fast and the Furry. I loved this though, with Tom and Jerry and a truly timeless story to work from it couldn't fail in my eyes. The animation is great with fluid backgrounds, lively colours and appealing character designs that reminded me strongly of MGM Hanna Barbera. The songs and music are wonderful, tuneful and makes you want to sing along, the writing is funny and touching often and the story is still the timeless classic you know and love albeit with a clever Tom and Jerry twist. Tom and Jerry are a delight, Dorothy is cute while never cloying, Scarecrow, Lion and TinMan are great fun and the Wicked Witch is menacing and cunning. The voice acting is strong, especially from Grey DeLisle who is wonderful as Dorothy. In conclusion, while a little rushed and a little too short, Tom and Jerry &amp; The Wizard of Oz is a very entertaining movie. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,16]},{"title":"Super Cute! An Instant Classic!","rating":8,"date":"15 September 2011","review":"I never thought any movie could compare with the original Wizard of Oz! Let's face it, when I watch the original 1939 version, I sit there reciting every line of dialog in unison with the cast! Everything about the original is \"sacred\" to me.<br><br>A few years ago, Disney made a live version RETURN TO OZ. I own it on DVD. It's nice -- but I can never fully enjoy it because of all the \"differences.\" Any change from the original, and the lack of music, just remove the \"magic\" for me.<br><br>I bought this DVD for my wife as one of her anniversary presents. I expected to not like it. Wow, was I ever mistaken.<br><br>The whole production is absolutely adorable. It follows the original very closely, including ALL THE MUSIC! The colors are gorgeous. The DVD includes TWO versions -- one version begins in black and white (in Kansas) and then changes to color (in Oz), exactly like the original! I won't belabor the point. For ANYONE who loves The Wizard of Oz and is a fan of the 1939 Judy Garland version, this is a must-see, must-own, must-share.<br><br>Enjoy! I hope my little review encourages you to give it a go and to lots of smiles and memories.","user":"whatsupdoc_55","rank":[14,20]},{"title":"Another Tom and Jerry movie that's good","rating":9,"date":"27 April 2012","review":"I have to say, I was surprised at how good \"Tom and Jerry meet Sherlock Holmes\" was for a Tom and Jerry movie, but seeing this timeless classic with a Tom and Jerry twist made my heart soar. \"Tom and Jerry and the Wizard of Oz\" took me by surprise on how it stayed true to the story and \"Tom and Jerry\" lore at the same time. There were no big unnecessary changes (besides the addition of a certain Munchkin mouse, but Kath Soucie is still good) and the voice-acting is excellent, with Grey DeLisle as Dorothy and Rob Paulsen as the Tin Man, etc. The one problem I had was that it was too short. But to each its own, and I am glad to see a (sort-of) renovation to such a timeless tale that I will never forget.","user":"garthryuu","rank":[3,4]}]