[{"title":"There is more to Crush than you might expect -^-8/10-^-","rating":8,"date":"31 March 2013","review":"When I first came to check this film out I did it quickly, skimmed over the names etc. and then just hit play. It wasn't till afterward that I did further investigation that I realized that the director for this film was Malik Bader, the crafty actor/director behind the making of one of the most clever &amp; original films I've seen Street Thief(2006). Crush is, in terms of genre &amp; plot, a completely different animal and Bader handled it masterfully. If you're thinking Crush is the average teen obsession film your wrong. <br><br>The new girl in town Bess(Crystal Reed) develops an unhealthy fixation on popular star athlete Scott(Lucas Till). Only Scott's attention is towards his long time friend Jules(Sarah Bolger). As Bess becomes more &amp; more drawn to Scott terribly things begin to happen around him. If you're thinking of this as familiar &amp; predictable I can guarantee you will be dead wrong on that assumption. This film will pull the rug from beneath you with a turn of events you will not see coming. Everything here seems to be in order, the story, acting, soundtrack and camera-work. I was indeed glad I had made the choice to check this out, with no reviews &amp; little votes it was a nice surprise. Recommend it highly -^-8/10-^-","user":"Thrill_KillZ","rank":[71,86]},{"title":"Better than expected","rating":7,"date":"11 April 2013","review":"*Some very minor spoilers about the general direction of the plot, nothing directly from the movie*<br><br>This is not just a cheesy teen obsession film. It looked that way to me when I saw the thriller, but I was pleasantly surprised. Not only does it bend some of the obsessive stalker plot arc's we know of, but it also has a real human and emotional element to it that made me connect to the characters since they didn't just end up as 2D stock people. There are subtle side-plots about competitiveness, jealousy and the normality of obsessive or strange behavior, which helps flesh everything out and adds nuance. Visually and sound wise the film looks great and is not a budget or amateur production at all, it has the Hollywood polish which is nice.<br><br>The plot is still familiar, and it does have several of the typical tropes, but at the same time it adds its own originality and personality to the characters in a way that made it refreshing. All in all entertaining and immersing, and touching even!","user":"bolaman","rank":[19,22]},{"title":"Refreshing thriller that will appeal to adults & mature teens.","rating":9,"date":"17 April 2013","review":"I normally do not watch movies with this type of plot-line because I find the same old tired tropes used again and again. However, the director here made, in my opinion, a refreshing, touching, and realistic movie that gave fresh depth and character to the story.<br><br>I was left guessing who the protagonist and antagonist were until the very end, and the ending was well acted, with realistic characters who acted the way I thought someone in their positions would, not the way an audience would be screaming at them not to.<br><br>I highly recommend this movie to anyone looking for a suspense/thriller/romance/horror.","user":"Pretty-Wycked-Designs","rank":[38,48]}]