[{"title":"decent film with good performances but somehow not managing to be great","rating":8,"date":"8 October 2012","review":"During the screening for What Richard did I was transported back in my minds eye to review the trailer for the movie. It featured glowing reviews by Irish critics announcing it to be the most important Irish film of the decade. Some may argue that that is simply a marketing tool to get the cinema-goer to purchase his/her ticket but in reality is it a true statement on the actual film?<br><br>Having finished watching the movie I pondered that question. I found myself reviewing the plot/characters and finally the ending and the answer I came up with is no. What Richard did is a well made film with some good cinematography and performances from the principle cast. But somehow I felt there was a missed opportunity that dropped it from being a great movie to simply being OK. <br><br>The central Triangle of Richard, Lara and her ex boyfriend for this reviewer just fell short. Perhaps the improvised nature of the performances at times hurt it a little as the actual act of violence when perpetrated felt a little strained and not immediate enough to sustain what follows. In fact you could say it was so brief to be deemed unimportant by Director Abrahamson. Strange as its the selling point of the entire movie and what the audience was waiting to witness 'what Richard did'. This distancing approach failed in that scene to illicite the power necessary to hold together the rest of the film.<br><br>Perhaps the biggest flaw seems to be the running time as it felt that the plot didn't quite survive the full length of the movie. some would argue then that It might have been even better as a short movie. The setup itself is not exactly original having been used many times before in other movies.<br><br>On a positive note there are some standout performances at times affecting and unsettling. Not quite as good as the critics would have you believe as there are flaws present.","user":"mctiernan34","rank":[27,32]},{"title":"Great elements, good film","rating":8,"date":"6 May 2013","review":"This film seems to confirm and amplify Abrahamson's (Adam &amp; Paul, Garage) considerable strengths as a film-maker, and, to a lesser extent his frustrating weaknesses. <br><br>On the plus side, he is great with his actors, both in who he casts and what he gets out of them. His characters always feel complex and real. He also sets up very convincing, morally ambiguous worlds, situations and people. No easy heroes and villains. <br><br>But he also has a tendency to be drawn to melodramatic twists, and those actually make his films less interesting, not more, as it feels like he's trying to force the emotional issues. <br><br>In many ways my favorite part of the film was the first 45 minutes before the central incident. Abrahamson is great at observing and capturing the complexities of late teen-age life with subtlety and a fresh eye. These aren't the desperate angry street kids of poverty, nor are they the morally bankrupt idiots we often see rich kids portrayed as. They feel real; they drink, but they're not all alcoholics and stoners. They have sex, but more often than not it's attached to some sense of emotion, at graspings towards being in a relationship. Their parents are flawed but trying. Its people as people, not just symbols, even though subtle issues of class and social standing inform the whole story. <br><br>But when it gets to the big twists and the big themes, I felt it laboring more, working at it's effects instead of letting them happen. It's not that the 2nd half isn't good,it's that it lacks the power the set up and situation seems to promise. It sticks to it's ambiguity, but it starts to feel just a touch like an intellectual conceit, not an exploration of darker human truths.","user":"runamokprods","rank":[16,19]},{"title":"What Richard Did? Not Enough to Hold Our Interest!","rating":4,"date":"4 February 2013","review":"This movie is set In Ireland but is not a particularly 'Irish' film - the underlying theme is universal (the eternal triangle) and it could have been set almost anywhere. There is some reasonable acting and occasional sequences of lush camera-work, but the film is let down by a weak plot, dull script and ponderous pace.<br><br>Richard is a well-off teenager who swears and drinks a lot. He is popular among his peers for his looks, self-confidence and access to his parents' beach house. He takes up with the girlfriend of one of his pals and they have sex. Later at a party the two lads get into a fight over the girl and a drunken Richard hits him once too often, taking the lad's life. In collusion with his father, he runs away and hides until he realises that his guilt is too much to bear and that he must give himself up to the police. Returning home to hand himself in, he resumes his studies and finds another girl for perfunctory sex. Whereupon he appears to have forgotten about confessing after all . . . and the credits roll.<br><br>The movie starts very slowly with lengthy and tedious scenes of Richard and his mates chilling out together, real enough but reality and drama make uneasy bedfellows. Nothing really happens until Richard gets into the fight, but even then there is little to make us like him enough to care what fate befalls him thereafter. He has committed manslaughter and he knows it so his decision to lie and hide just makes him look a coward. So when he 'breaks down' - an embarrassing scene in which he does a lot of screeching and breast-beating - it is hard to have much sympathy. It's not as if he's murdered anyone and faces life imprisonment or worse. A good lawyer would help . . . but these and other practicalities are never considered by him nor his father and (barely seen) mother. Having decided to do 'the right thing', Richard then appears to abandon his intent and return to a life of self-indulgence. Perplexing!<br><br>So the story is more about what Richard did not do than what he did. Perhaps his parents should have told him a lot earlier to grow up and get a life!<br><br>Unfortunately, it's hard to recommend this movie.<br><br>(Viewed at The Cornerhouse, Manchester, UK, 31.01.13)","user":"flickernatic","rank":[25,34]}]