[{"title":"What Ever Happened To Original Ideas?","rating":2,"date":"30 September 2017","review":"It's just depressing for a movie lover like me to see a film like Joel Schumacher's 1990 Flatliners remade. Why? Can anyone come out with something we haven't seen before or at least from a fresh new POV. Somebody told me that my reaction is \"generational\" - I fear that's true. It makes me feel really old. I almost walked out of Mother!, the other day - something I've never done - because I felt treated like a moron. To steal from Robert Polanski to do what, what? Here is even worse. They're stealing from Joel Schumacher without having any of the...what was it that the 1990 had that this one hasn't? Well let's say that the first one wasn't a remake. Where are the mavericks? The new ones. The ones I love are in their 70's or gone. I do apologize I'm just venting my frustration. Thank you for indulging me.","user":"ggallegosgroupuk","rank":[327,404]},{"title":"In Scotland we call this \"pish\"","rating":3,"date":"1 October 2017","review":"Terrible. Acting was OK but bordered on comical. Not scary at all and second part was a bit loose.<br><br>Could have been darker with more urgency but flapped around quite a bit. The ending was boring as hell and didn't seem to convey anything. <br><br>Should've got to see Kingsman instead.","user":"scotrep","rank":[107,130]},{"title":"Unnecessary Remake","rating":5,"date":"16 December 2017","review":"In 1990, Joel Schumacher directed the unforgettable \"Flatliners\", a original horror film with Kiefer Sutherland, Kevin Bacon, Julia Roberts., William Baldwin and Oliver Platt. The remake directed by Danish director Niels Arden Oplev has nothing new in he story. The cast is weaker with the awful and unexpressive Kiersey Clemons in one of the lead roles and the screenplay is corny. The cameo of Kiefer Sutherland is probably the greatest joke in this forgettable and unnecessary remake. My vote is five.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[66,81]}]