[{"title":"It's not as bad as some would like you to believe","rating":7,"date":"5 April 2015","review":"It seems the bad reviews are coming from those that are appalled with the concept, so their views may be slightly skewed. They talk about bad acting by the sisters, which would be true if they weren't portraying teenagers, so many times I was reminded of girls I knew in high school. The lack of real emotion, the \"zig zagging back and forth\" of their emotional states, etc. is all pretty common for teenagers, especially girls... Considering what they were going through, it wouldn't have seemed right if their wasn't some back and forth in terms of intent and how they felt about the whole thing. It was their mom, so of course they would have had second thoughts and maybe searching for some reason or sign to restore a little faith in her. <br><br>The character of the a-hole boyfriend was a bit over the top, and should have been toned down and have some build up, instead of having him immediately attack Beth. I mean within seconds he's all over her, it is a bit too much. It felt like the writer used him to make the audience feel empathy for the girls, not small \"Well maybe I can see their side\" empathy, but a \"Whoa! They don't have any choice but to kill her now!!!\" type of empathy.<br><br>Perhaps it could have been better written and there are some parts that are annoying, but those are likely going to be different for most people, as it is with every movie- personal preference. All in all the movie was very watchable for me, though it felt like they didn't want us feeling negatively about the girls at all, so any situation that could create a little empathy is amped up to create a lot of it. After watching it I thought to myself that if they were my friends I wouldn't hold it against them. I then saw a statement by the author of the book saying that they left out how cold and calculating they were. Then I read a bit about the real story and feel much less sympathy for them now. Though I wish they were more true to the real story, I still enjoyed it.","user":"mxking2020","rank":[10,12]},{"title":"Good acting, good story, amateurish direction & cinematography","rating":4,"date":"12 July 2014","review":"I was looking for some gripping, even chilling story about dysfunctional teenagers. Like what we saw in \"Thirteen\", which was a great movie, but now with a - true - crime story. Nah.<br><br>The director has been a producer for over 30 years and got some famous people to act in it. The actresses (the three of them) are really good. However, the direction takes a completely wrong turn, trying to make it a \"dark teen fantasy-comedy-thriller-drama\" salad. For instance, you start to wonder how two young girl plan the murders and... you have four teenagers enacting fantasies about murder. That's so not the thing this film should portray.<br><br>All the intentions to connect with teenagers were completely flawed. Bad soundtrack, TERRIBLE montage effects, ludicrous mixture of genres, awful cinematography work. It's like parents using slang. All the attempts to highlight the medium -- divided screen, special lights, accelerated camera -- are pathetic and would not even work in an MTV show in 1997. It's not a film for teenagers -- and if it was supposed to be, it didn't work either.<br><br>There are scenes that people's faces are covered by SOMEONE'S HEAD -- and not intentionally! Unbelievable. If you are a director making a debut, be humble and let a competent cinematographer AND editor do their jobs. How beautiful this film would <br><br>On the top of that, a voice-over starts giving ANOTHER angle on the film -- those films about bitchy teenagers obsessed with fame, kind of like To Die For from Gus Van Sant -- only to forget about it minutes later and never coming back to that.<br><br>Anyways. I was interested in the story, and through all the amateur work I could grasp something from it. The two girls are great actresses, and Mira Sorvino portrays precisely the thin line between a likable weak person and a wreck that screws up their children.<br><br>Somewhere I heard this: some people don't have to work their way into the center of the stage. They can pull strings and buy themselves into it. Question is: are they ready for it?","user":"sltfilho","rank":[32,46]},{"title":"Tired of their mother's alcoholism and a string of her abusive boyfriends, two sisters plot to kill her.","rating":9,"date":"6 June 2012","review":"I luckily caught an early screening of this film by director Stanley M. Brooks and have to say I was knocked out. It is a dark, stylish modern day tragedy about two teenagers caught in an existential nightmare. The choices they feel compelled to make and their consequences will haunt you for a long time, even if you're not a parent. Brooks did a particularly fantastic job of keeping you invested in these two young women from the gate. Like \"Crime and Punishment\" you are sucked in to the vortex of their dire circumstances and are swept along in their path to self destruction but you always feel for them. This builds to the final shot of the film, which is as heartbreaking and gut-wrenching as it is inevitable, and truly underscores the film's brilliance. The performances by both young actresses were spot on but I was also very impressed by nearly the unrecognizable Mira Sorvino as the mother. Brooks brought all these women to their darkest places and the result is stunning. A must see.","user":"Bfriend-5","rank":[44,73]}]