[{"title":"Nope","rating":1,"date":"30 May 2013","review":"I have been an active member on IMDb for more than 6 years now and have never had given a movie a 1 rating. Until now. This movie does not have one feature I could praise. The acting is worse than mediocre (though to be honest I must say I watched it dubbed which could worsen the already bad situation), the story is uninteresting or I dare to say nonsense. There is not a single scene or performance I was able to enjoy. As for the music, it was so unimpressive I can't even remember any part of it that I liked. The conversations are dull and boring. I couldn't have cared less about what is going to happen to these characters: it didn't matter if they get killed or possessed or live happily ever after; the only thing I was concerned about was when this pitiful excuse for a movie is going to end.<br><br>At the end of my reviews, I like to give a recommendation as to whom I recommend and whom I don't recommend the movie in question. Well this one, I don't recommend to anyone. Not even my worst enemy...","user":"vetsera","rank":[33,38]},{"title":"Worst Movie Ever!","rating":1,"date":"3 November 2013","review":"First, they used cheap film stock always slightly out of focus, no one has the top of their head in most of the shots. My grandmother used to take photos like that, no foreheads!!!! The special effects were really quite funny, not intentionally of course. No wonder it went direct to video. Eric Roberts must be on muscle relaxers as his performance is dull and lethargic, and Danny Trejo is basically a cameo. The other actors in the film are uninspiring and really need acting lessons. The film is dark and brooding, but then, so is my cat. About halfway through the film, I noticed that staring at my cat was way more scary. Maybe she is possessed!!!! Maybe I am, while writing this review! I know this film is possessed --- of no good qualities!<br><br>Peace out, Jen","user":"srgrrrrl","rank":[13,14]},{"title":"Worst movie ever!","rating":1,"date":"30 July 2013","review":"This had to been the worst movie ever. The acting is just horrible. The characters show absolutely no inflection/emotion in their voices. The special effects(well, if you call it that) were just pathetic. My cousin's 11 year old son who makes movies has better quality sound effect programs on his computer than this movie! The story line wasn't even that good. The movie was not meant to be funny, but for some reason, I laughed the entire time, especially at the producer's attempt to make believable demon voices. And I think the most ridiculous thing about the movie was the Jesus uniform that the main character wore. I don't think the cross emblem(or anything that signifies Jesus) belongs on people who run around with weapons blowing heads off of demons. That's an hour and half that you'll never get back, so don't waste your time.","user":"jwitzel28","rank":[12,13]}]