[{"title":"Slavery is an evil that should befall none","rating":10,"date":"25 October 2013","review":"12 Years a Slave tells the true story of Solomon Northup, an educated and free black man living in New York during the 1840's who gets abducted, shipped to the south, and sold into slavery. It is a film that stimulates at both an emotional level and an intellectual one. <br><br>Chiwetel Ejiofor plays Solomon Northup. He's been a \"that guy\" actor for sometime – film-goers may know his face but not his name. After this film his name will be known. He gives, quite simply, the best performance from a leading actor since Daniel Day Lewis in There Will Be Blood. Because of his character's position as a slave he is usually unable to speak his mind unless he is prepared to be beaten. As a result Ejiofor is forced to utilize body language and his eyes, which become enormous pools of emotion to express himself to the audience. He's forced to endure terrible things, but he always maintains a certain dignity and nobility that makes his plight even more affecting. It's a performance of incredible subtlety that may leave you speechless and in complete awe.<br><br>Micheal Fassbender gives the best performance of his already extremely impressive career, even besting his previous high marks from the films Shame and Hunger (both directed by Steve McQueen, who also directed 12 Years a Slave). He plays Edwynn Epps, a vicious and demonic slaver and perhaps the most loathsome and disgusting character ever put on screen. If alive today, he'd likely be a drunk with severe anger management issues. By turns pathetic and terrifying, he embodies the ultimate nightmare of a deeply flawed man given absolute power over other human beings, and through that absolute power finds only madness, which drives him to deeper cruelty. He's always a menacing and malignant presence even when not on screen, as his slaves must always be aware and prepared for his seemingly random bouts of sadism. <br><br>Other actors give excellent performances as well. Paul Giamatti, Paul Dano, Benedict Cumberbatch, Sarah Paulson, Alfre Woodard are all great in relatively small roles. But in this film of titans it's the one you've probably never heard of who perhaps stands above them all. In her first role in a feature film, Lupita Nyong'o, playing the pretty young slave Patsey - the object of Edwynn Epps demented and horrifying affections and the emotional epicenter of the entire picture, gives one of the most devastating performances I have ever seen. A portrait of unbearable sadness, her character is a mirror image of Solomon. While Solomon is a man who refuses to break and give up the dignity which he's known since birth, she is one who has long since been broken, and who never knew dignity in the first place. Her life is a living hell, forced to endure the \"love\" of Edwyn Epps and the brutal jealousy of his wife, she's trapped in a terrible triangle that she can't escape. Despite that, she retains a level of innocence that only heightens the tragedy of her character. It actually gets to the point where simply looking at this character might be enough to bring you to tears. It's a shattering performance.<br><br>Starting his career as a video artist before making full length films, Steve McQueen has an uncanny eye for imagery and contrast. He's also a very patient film maker, utilizing long, steady single shots to emphasize various things. In his prior films this has felt like a purely stylistic choice, here, it's a choice aimed directly at our heart. When the events on screen become their most horrifying and ugly is when his camera becomes the most unflinching. At times feeling perhaps like we're seeing out of the solemn eyes of the ghost of some murdered slave, watching in sorrow and rage. This is both McQueen's most accessible and artistically searing film yet. <br><br>There are also moments of stunning natural beauty that would make Terrence Malick proud. Alone, these shots would inspire wonder, but in the context of this film they make us feel more forlorn, as if the ugliness of man is encroaching on the natural beauty of the world.<br><br>Perhaps the most noteworthy thing about 12 Years a Slave is the way that it portrays slavery itself. Instead of taking the easy way out and limiting his exploration of the topic solely to the slaves, Steve McQueen increases the scope and we see how it affects those who profited by it. Take Benedict Cumberbatch's character. A seemingly decent and caring man who treats his slaves with some semblance of respect and kindness. He comes off as a relatively good man who is trapped within the powerful confines of the institution of slavery. In 12 Years a Slave, slavery is shown as a horrifying and destructive social construct that drains the humanity from everyone it touches, turning good men into moral quandaries, turning flawed men into monsters, and turning an entire race of people into livestock and tools. <br><br>To watch 12 Years a Slave is to be confronted with the grim reality of slavery in a way that's never been done before. To say this is the best film ever made about slavery feels trivial, as slavery is a subject in film that has been shown with naive romanticism from films like Gone With the Wind or silly exploitation from something like Django Unchained. Both of which serve to make the topic digestible. To watch 12 Years a Slave is to experience a level of despair and misery that can become overwhelming. It's a film of such ugliness, such blunt emotional trauma, that it may haunt you for hours if not days after seeing it. So why should you watch a film that could leave you reeling and devastated? Because, it's also one of the greatest cinematic achievements of our time.","user":"BackFire83","rank":[471,636]},{"title":"And the Oscar goes to...","rating":10,"date":"19 October 2013","review":"chitchens fan  2 hours ago △ ▽ <br><br>− <br><br>Well, to begin, I cannot remember the last time I could not get up at the end of a movie. I literally could not rise up from my seat. My body felt as though it were being weighed down by something considerably larger and heavier than myself... History had it's way with me( I am an African American woman). Thank you Mr. McQueen, Mr. Ejiofor, Ms. Nyong'o, Ms. Paulson and others, and yes, even Mr. Fassbender. I am not a film critic nor a movie hobbyist, although I try to stay current, but what I am is a human being trying to understand the various problems and issues within our country. This movie is a potent reminder of why we are where we are as a society today. How man can be so unflinchingly cruel to his fellow man, especially if he looks, speaks or behaves differently, I will never understand.","user":"thamanidelgardo-822-410218","rank":[384,581]},{"title":"Roll Jordan Roll","rating":9,"date":"18 October 2013","review":"A random and encounter has led Solomon Northup from living freely in New York to being kidnapped and sold into slavery in Louisiana, getting handed over to various slave owners. There, Solomon witnesses numerous acts of cruelty that no man should ever face.<br><br>As I stared at the movie screen with full dread, I was reeling back at certain scenes I had just witnessed. There were good films and television shows about slavery before, and they had various nuances at how to tackle slavery. This film is part of said resurgence of the sub- genre, hot on the heels of \"Django Unchained\" and \"The Butler\". But while the former relinquishes on Spaghetti Western entertainment more than attempting to address the issue in a political light as the latter, Steve McQueen's \"12 Years a Slave\" shuts those two up, and perhaps the entire sub-genre, for good. I doubt any future slavery-themed film will be as harrowing as this one was.<br><br>Steve McQueen is a fearless filmmaker, continuing his streak of unfiltered brutality within human depths. He frames his actors' faces in extreme close-up, the eyes staring into despair, the nostrils fuming in aggression. Naked flesh are shown not because of erotic content, but rather because of desperation and futility. Long takes and wide shots are not uncommon in his films, and here they showcase a plethora of fantastic scenes and performances that work to discomfort the viewer as much as possible. McQueen doesn't just allow the audience to tackle slavery, he guts the audience and leaves them for the consequences. This is an extremely uncomfortable film to watch. Beautifully shot locations are placeholders for unsettling sequences before and after, contemplated by Hans Zimmer's poignant and at times horrifying score. This all works to create a nightmarish time and place where hell walks on Earth.<br><br>Central to all of this is the performance of Chiwetel Ejiofor as Solomon. Ejiofor showcases that he is a natural force to be reckoned with in this film, after a decade of mostly supporting characters. He spaces out in despair as the camera lingers onto him for solid minutes, not a word spoken. Another sequence shows him mourning the death of a fellow worker, in which the singing of the surrounding group compels him and shakes him down to tears. These scenes follow earlier ones where he is a classy, free man in the upper states, mingling happily with the crowd and partaking in fanciful music sessions. It is a tour-de-force performance.<br><br>A fine ensemble of established and up-and-coming actors surround Ejiofor in his limelight - Paul Dano, Paul Giammati, Alfre Woodard, Sarah Paulson, even Brad Pitt and Benedict Cumberbatch, but none so ferociously as McQueen regular Michael Fassbender as the despicable, sadistic plantation owner Edwin Epps. So excellent and terrifying is Fassbender's portrayal of such a merciless and barbaric person, that the mere sight of him will either cause audience members unfamiliar to him to flinch.<br><br>I was left speechless as the credits rolled. A lesser film would have added tacked-on sentimentality/exaggeration and politically influenced claptrap. Not this one. This is a movie to watch as a reminder of how powerful the human spirit can endeavor, and how lucky all of us have grown past that dreadful time in history. The full effect of it has not been felt in movies before, until now.","user":"dvc5159","rank":[184,276]}]