[{"title":"A real disappointment","rating":3,"date":"28 November 2011","review":"The very few first minutes were promising enough. From then on - the movie deteriorated: unlikable characters, plot full of holes, irrational decisions of the characters and the ending seems like someone got stuck with the screenplay and decided to wrap it up quickly and go home for dinner (don't get me started on the visual effects, either, which, although not being the main issue here, leave much to be desired). I like endings that makes you think, but in this case, my only thought was \"gotta warn others from wasting one hour and a half of their life on this\".<br><br>I guess my main dissatisfaction with this movie is that the storyline did not make much sense, even for the horror genre.<br><br>so... don't.","user":"OHarel4","rank":[22,24]},{"title":"Terrible, do not waste your time.","rating":1,"date":"22 December 2011","review":"I don't usually mind movies being a little rough around the edges but this one was just terrible. I felt like the producers just said \"meh, that will do.\" and released it without any thought about detail or quality. The visual effects were not just poor but offensive, the plot had huge holes in it (more holes than plot) and the choices made during the story were just insane by any standards. The most annoying part about the whole thing is the ending - or lack of one. The story wasn't wrapped up, we have no idea what happened to 90% of the characters in the movie, and it just plain made no sense. In short I would not recommend this train wreck of a move to anyone.","user":"dean-91-874940","rank":[25,29]},{"title":"Horrible horror","rating":1,"date":"18 January 2012","review":"It is really difficult to make such a bad movie as this one, picking scenes and pieces from other better movies and putting them together in such a talentless way must have been a very hard work. I started to watch the movie with some expectation and interest thinking that at some point I was going to be grabbed by the mystery or the action, but the truth is that after the first ten minutes I already realized that I was watching one of the worst movies I have seen. The actors are bad amateurs that do not even manage to make one credible dialogue. The film is inspired in so many old topics and scenes from previously released films that it is not even surprising in any way...the whole thing stinks. Horrible experience. In that sense it is really a horror movie.","user":"aguasma","rank":[10,13]}]