[{"title":"Rainier, Alfred, Charles and Grace","rating":7,"date":"3 June 2014","review":"The one to blame for Tippi Hedren, and not Grace Kelly, starring in Hitchcock's 'Marnie' is really Charles De Gaulle. At least, that's what 'Grace of Monaco' suggests. It's probably not quite true, but the film doesn't pretend to be historically accurate. It says so at the beginning: it's a fictional drama, based on true events. <br><br>The film shows a relatively small part of Kelly's remarkable life. After having been married for six years to Prince Rainier of Monaco, she is visited by Alfred Hitchcock who offers her the lead in his film project 'Marnie'. She wants to do it, but reviving her acting career turns out to be impossible because of a crisis in Monaco, caused by French president Charles De Gaulle's political manoeuvrings. <br><br>We see Kelly as a somewhat naive Princess, who against her will becomes involved in political power-play. When a French diplomat suggests that Europe should become a third pillar of world power, next to the Soviet Union and the US, the American-born Kelly quips that this wouldn't be necessary if Europe wouldn't have invented communism and fascism. It's one of the best one-liners in the film. <br><br>The story switches nicely from Rainier's political problems to Kelly's own personal doubts. She is not happy as a Princess, and has trouble with the rigid conventions of life at the palace. The film even suggests that her outspoken opinions help solving the problems with France in the end. This may not be historically correct, but it makes for a nice script. <br><br>Much has been said about casting Nicole Kidman. I think there are very few actresses on the globe who would have done a better job. I'm not exactly a big fan of Kidman, but in this case she shows exactly the right mix of a strong will, a fearless non-conformist attitude and a superb elegance. She fits in perfectly with the cinematography, full of warm colours and lush images. <br><br>I liked the way the script works towards an apotheosis: a speech by Kelly at a high-profile philanthropic event in Monaco. The speech is truly great; either it's very good script writing, or Kelly employed a very talented speech writer. It's the highlight of the film: Kidman delivers her text in a truly heartfelt way, with the camera extremely close, so only a part of her face is visible. <br><br>The film has weak points. The dialogue sometimes feels clumsy and pompous, there are too many subplots and intrigues, and the director indulges a bit too much in the glamorous palace life. But at least this film doesn't make the mistake of cramming too much biographical information into a 100-minute movie. It's an enjoyable movie about one of the most interesting women in film history.","user":"rubenm","rank":[53,63]},{"title":"There isn't much grace to be had in this formless, awkwardly-scripted and executed biopic.","rating":3,"date":"23 May 2014","review":"Biopics will always come with their fair share of controversy - doubts will inevitably be raised about whether the subject in question was well-served by the film and his or her characterisation therein. Even so, Grace Of Monaco arrives in cinemas dogged by an outsized share of debate and, well, debacle. The script has been openly decried by Princess Grace's children and the entire project overwhelmingly reviled by critics across the world. Distributor Harvey Weinstein reportedly riled French director Olivier Dahan by cooking up an alternative cut of the film. Of course, it's Dahan's version that has premiered in Cannes, to widespread critical derision, so one can't help wondering if Weinstein's cut might actually be better. That's a lot of weight and scandal for one film to bear, most of which is - unfortunately - borne out by the final product.<br><br>It's possible to see why everyone involved might have been optimistic about the project. After all, the film purports to pick apart the fairy tale that is Grace Kelly's life - a legendary Hollywood actress finds and marries her real-life prince. In reality, Grace (Nicole Kidman) is struggling to find her place in the tiny principality of Monaco. As she contemplates returning to Hollywood to make another picture - Marnie - with Alfred Hitchcock (Roger Ashton-Griffiths), Grace's husband, Prince Rainier (Tim Roth), finds himself trapped in an increasingly tense face-off with French President Charles De Gaulle. Add in courtly intrigue, an identity crisis or two, a fairytale romance gone a little bit wrong - and it seems the perfect way for Dahan to make his Hollywood debut.<br><br>However, much of the sensitivity demonstrated by Dahan in La Vie En Rose, his lovely, bittersweet biopic of Edith Piaf, has been lost in translation. Grace Of Monaco plays far too frequently at the full, high pitch of soapy melodrama, the converging story lines somehow managing to feel overwrought and inconsequential at the same time. Grace frets about her role as wife, mother and princess; Rainier broods moodily about the fate of Monaco; we're led to suspect that Grace's handmaiden Madge (Parker Posey) is a spy within her inner circle - huge, important events within the narrative of the film, but all of them are rendered in paper-thin characterisation and overly ponderous dialogue.<br><br>As the film stumbles towards its unlikely climax, it becomes harder and harder to take it seriously. The unravelling threads of Grace's life are clumsily woven together by what amounts to Grace undergoing princess training at the hands of Sir Derek Jacobi's Count Fernando: a montage that would feel clumsy even if grafted into My Fair Lady or The Princess Diaries. Grace Of Monaco also runs afoul of a few odd directorial choices. It's no exaggeration to say that Dahan makes the most excessive use of the close-up since Tom Hooper in Les Miserables - in narrowing the frame to an almost unbearable degree, his camera practically assaults his actors' eyeballs on several occasions. <br><br>To be fair to the cast, they try - particularly Kidman, who seems quite committed to giving as rounded a performance of the trapped princess as she can, whatever her director or screenwriter might have in store for her. Her efforts aren't enough to salvage the film but, at least, she's not adding to its many problems. Other reliably good actors chew over but fail to elevate the mediocre script: Roth's Rainier remains a frustratingly opaque character, while Frank Langella is quite wasted as Father Francis Tucker, a pastor whose strangely controlling relationship with Grace adds a few more wrinkles to the already oddly-constructed plot.<br><br>In effect, Grace Of Monaco brings to mind that other mess of a princess biopic: Diana. Both films have impressive pedigrees, from director to headlining actress, and both seem to have completely failed to grasp - much less do justice to - their subject. In a pinch, Grace Of Monaco is the (slightly) better film: there are more complexities at play here that can be glimpsed amidst the shilly-shallying of the script. There is, at least, more of an attempt made to look beyond the princess' love story to find the person within. That's not saying much, however. For the most part, Grace Of Monaco is an awkward, frustrating watch - one that ultimately fails to establish its title character as either person or princess.","user":"shawneofthedead","rank":[61,83]},{"title":"Worth watching for the story","rating":7,"date":"11 June 2014","review":"11 June 2014 Film of Choice at The Plaza Dorchester Tonight - Grace of Monaco. Generally slated by the critics I decided to see this film anyway and I was glad I did. A fictional story based on true events, this enjoyable film was a very haunting portrayal of Grace Kelly's move from Hollywood Princess to Royal Princess and the difficulties that arose during the transition. Centred around the very trying times when Charles de Gaulle was trying to gain control of Monaco, Grace Kelly was portrayed as a lost figure. Lost in her marriage, lost in her identity and lost in her way. Unfortunately, Nicole Kidman, although a very accomplished actress who was dressed well and at time did look very much the princess, did not convince me that she was Princess Grace. For starters physically she was too red, Grace Kelly was blonde, not a Marilyn Monroe sort of blonde but a regal blonde, and a serene blonde, Nicole just looked like a red head, furthermore she didn't make me believe that she was Grace Kelly, I just felt that I could see many of her other parts all tumbling together to try to encompass this icon of movie and Royal history. Having said that, I don't know exactly who could have played the part of Princess Grace of Monaco.........except perhaps ......... Grace Kelly!!!!!","user":"Figgy66-915-598470","rank":[20,29]}]