[{"title":"One of the best movies made in this century","rating":10,"date":"10 August 2014","review":"I am not telling anything about the plot etc to not spoil the film for anyone. It is a film that goes deep to the heart of humanity. It is a film that touches the very rawest of nerves in regard to the inhumanity that man can force on his fellow man. The story is about survival and the need for love and respect and bonding in a place where there is none. The setting is in the tough peasant life of the alps in Europe and if you have no idea about what that is about you need to educate yourself. The Alps have been a very special place in the European theatre. They are tough as hell to survive in. Failed crops lead to severe hunger not dissimilar to the potato famines in Ireland. The peasant or Bauer as he is called in the German language is not a low life derogatory term but a description of the person ie farmer. The history of peasantry in the Alps is varied but in most cases the male Bauer was like a ship's captain, all powerful and the nature of this captain determined the life of the people under him. In some cases due to the intense hardship of the work which was constant from 4 in the morning till late at night all year round just to survive this lead to some very hard and nasty types usually associated with the consumption of Schnapps which is a very high level alcoholic drink made from various fruits etc. This combination lead to some very harsh abuse of people. The situation in this film deals with a special area, the orphan children who under the stewardship of the all powerful Catholic Church were meted out to farmers for almost slave labor conditions. This was the REAL world for these people. In some cases this worked out very well for orphans but in many others it was pure hell. This film depicted this situation extremely well. The acting was superlative, the setting totally correct and the flow of the film was sustained and allowed one to really immerse oneself into these people's plights. I highly recommend it everyone. The quality of this movie makes most of the trash coming out America just look plain pathetic. Well done to the people involved and no, I am not associated with any person from this production so get that straight too. Not often I give such high praise, believe me.","user":"christiank7","rank":[12,15]},{"title":"The collective story of those affected by the Swiss foster system.","rating":8,"date":"8 August 2013","review":"There is no doubt that the story of a foster boy with no rights of his own could have been turned into a heart wrenching drama. However, despite the gravity of the subject manner, director Markus Imboden successfully infused some elements of entertainment which help viewers deal with the helpless situation of Max.<br><br>Many potentially controversial subjects were touched only at the surface, such as the role of the church or the involvement of the Swiss government in the foster system.<br><br>Thanks to the beautiful tunes of the accordion, a sort of acoustic happy end was made possible.","user":"dimitri-burkhard","rank":[16,23]},{"title":"Good film about a sinister family in Switzerland","rating":6,"date":"18 March 2015","review":"\"Der Verdingbub\" is (apart from what I wrote in the title) also about a boy who comes to a farm in order to help with the work. Later on, a younger girl also arrives there. The two get abused and a young teacher tries to help them. The director is Markus Imboden, one of Switzerland's finest filmmakers these days. I recommend his \"Mörder auf Amrum\", one of the finest television films in recent years. He becomes 60 this year. The writing duo is not particularly experienced in comparison to Imboden, but did a very good job here with the script. This movie here won Swiss Film Awards for actor and supporting actor (and was nominated for best film), but you could probably say that the whole cast was excellent. It's not a watch for the easily offended though: There are several scenes of bullying, rape, violence against animals humans and emotional violence as well.<br><br>Even if I was not too wowed by the ending on the ship, it wasn't bad either (huge negative event happens and slightly positive ending afterward, but never feels forced, just realistic) and the film's second half is certainly better than the first. The film needed a bit to get rolling for me. Quick mention to Katja Riemann, who you have probably never seen that ugly in a film and her character is a complete mystery too. There were one or two moments where I wondered if she turns to the good side and against her husband and son. One would be after the teacher (played by the stunning and talented Miriam Stein) tells her to help the children. This 105-minute (without closing credits) film is easily one of the best Swiss films in recent years, even if it did not get the Foreign Oscar submission honor. Recommended.","user":"Horst_In_Translation","rank":[3,3]}]