[{"title":"Argh ..... wasted effort","rating":1,"date":"2 March 2013","review":"I had looked forward to this and I was so disappointed. What a wonderful movie the first was ..... and now this<br><br>Acting awful despite good actors .... must be the directors fault.<br><br>There are under-laying music during the whole movie which is properly the only way they thought they could get excitement up with the viewers.<br><br>Its just awful, awful, awful.<br><br>What a shame ....... it could really have been good<br><br>Why would anybody do this and spoil the memory of an excellent movie is pitiful.","user":"epicking","rank":[24,30]},{"title":"Utter Crap","rating":1,"date":"6 June 2013","review":"Corniest movie I've ever seen - can't believe that Malcolm Macdowall would lend his name to this tripe.<br><br>Simply unbelievable sequences where a (seemingly) 30-35 year old woman can single handedly order nuclear attacks (OK OK - so she says the President authorized it - but dear me).<br><br>Not clear why they are trying to kill the main characters chasing them all over the countryside (despite the scientific advice that says don't do it).<br><br>Also when Carl finally gets off the ship by metamorphosing through the hull (how did he do that?) - there is Molly standing at that very point to meet him","user":"mickhoulahan","rank":[13,16]},{"title":"not bad for syfy","rating":5,"date":"29 July 2012","review":"First of all this is a SyFy movie so be warned not to expect too much from their movies. In all honesty this is the best SyFy movie i've seen from them by far (sadly i've seen more than a few) <br><br>Do not get your hopes up , it are all the familiar faces again and the usual story arcs but at least this time the writers have made an effort to come up with a story that isn't an insult to anyone with more than 3 working braincells. Then again giving it your full attention may cause pain and irregular bowel movements. <br><br>You can see they are learning with every flick they make. Instead of bad cgi they are now using less fx and more suggestion leaving more budget for effects when they really need to have it included.<br><br>The acting isn't bad considering the script the actors have to work with but please leave logic at the door.<br><br>In short this is a movie for when you want 85 minutes of \"no brainer\" activity or somethng in the background while you are multitasking but i think the movie works best if you watch it in group with a few drinks so you can slam the scenario or the lines as you go along.<br><br>Give it a shot but don't expect to be blown away.","user":"sven-651-931516","rank":[30,42]}]