[{"title":"Mostly misunderstood?","rating":7,"date":"19 April 2016","review":"Reading some of the other reviews, mostly focusing on the fact that the movie seems to be almost Bladerunnerish, they do not actually address what the movie is. So what that it has a musical and emotive reflection in a style that reminds one of a silver screen masterpiece? Many rappers have best-sellers based on the borrowed riff or refrain from an eighties classic. And they pull it off. The question is - did this movie get a fair shake in being rated as average? This simply means that some liked it and some did not. But slashing it for merely what it reflects is like smashing the mirror on a bad hair day. The movie is a love story. It's a simple plot, and when one sits back and reflects on it, it pulls off the simple plot. It is low budget, yes, but in a good way. Bad CGI and silly effects would not have added to the love story, but to the SciFi wrapper. And who eats the wrapper and writes a review on it? Quite a few people, if I read through them. I enjoyed the movie and the story and the way it unfolds. Perhaps it will not be memorable, but at least it was filling. Worth a seven, I say.","user":"eyefordetail","rank":[67,86]},{"title":"Well Worth Watching","rating":7,"date":"25 January 2016","review":"I've read the negative and 'so-so' reviews here on this movie and wonder if we watched the same movie. References to Blade Runner, capturing 80's style production etcetera - sorry but I don't agree. I Hailed Blade Runner as the best futuristically dystopian Sci-Fi movie as the best I'd ever seen way back when it first came out, I have every version of it and still watch them on a regular basis - it never fails to satisfy and leave me with a feeling of calm satisfaction. Just about every movie that's ever been made just like every story that's ever been written owes something to those that came before it: as they say there is nothing new under the sun. Now back to Synchronicity 2015. It is a stand alone movie with (all IMHO) a solid well-written script, a sound and interesting premise, more than acceptably good special effects (which it didn't need to rely upon to tell its story), very well cast and well acted and although not a 'drivingly wild video game movie' (yuk) it never lags in pace or fails to hold the viewers interest and curiosity. Nothing is certain ... is it past or parallel, real or imagined, it leaves a lot for the viewer to decide which is, I surmise, why the movie gets such a mixed reception. Not a typical Hollywood style wrap it all up neatly in buttered popcorn it needs your attention and perhaps more than a single viewing to appreciate the content. The sexuality/physical attraction that has been called a love story is neither pointless nor gratuitous but serves a well-defined emotional purpose given the context of events and the nature of the relationship which intertwines the raison d'être of the two characters involved with the development of the premise upon which the film proceeds. If you want or are looking for a movie that is blunt force trauma to the senses then this won't be for you. If, however, you appreciate subtlety of expression, timing and story development then give this movie a watch. I enjoyed it and will watch it several more times to allow the subtleties previously unseen to fully develop. 7 out of 10 at least on my scale for a movie that not only entertains, but holds ones attention for the duration of the movie and has characters that are believable and very human.","user":"m_lecarre","rank":[93,127]},{"title":"Reflected and interesting movie about time-travel paradox.","rating":7,"date":"29 April 2016","review":"Synchronicity is an interesting movie that makes you think. I've seen others movies on the subject of time-travel but few that goes that deep into the subject and explaining it that well.<br><br>It's by no mean an easy movie to understand as a whole plot-wise because of the whole time-travel paradox , but it actually illustrate the complexity of it in a very elegant and subtle manner without too many shortcuts.<br><br>The movie has its flaws however,some of the plot devices related to the time-travel paradox seemed a little bit too convenient in my opinion, and the ending could have been better. But as a whole I liked the story even though I didn't understand all the details involved. There is also a nice little love story which actually fitted quite well in the overall plot.<br><br>The cyberpunk setting wasn't a bad idea for the movie, but I wished they had been a bit more subtle about it. Some of the scenes of the movies were almost screaming \"We bloody love Blade Runner\" at us. I still liked the style and music but I think it was a bit overdone.<br><br>Apart from Ironside all the actors are refreshingly unknown, and do a very good job given the complex story they play.I liked the characters which were both human and interesting.<br><br>Synchronicity's story is by no mean easy to grasp , but I enjoyed it. It wasn't overly complicated but still gave me something to think about after watching it. I recommend this movie if you're in the mood for a bit more serious scifi.","user":"doktorwho","rank":[32,41]}]