[{"title":"SyFy have done much worse than Haunted High, but that doesn't stop it from being lame...","rating":4,"date":"7 October 2012","review":"Generally I hate SyFy movies with a passion. Haunted High is thankfully not one of their worst, the zombie frog sequence is fun if all too brief, Shawn C.Phillips and Lauren Pennington are likable and while Danny Trejo deserved much better he does what he can. On the other hand, a lot of the film was lame. The rest of the acting is bland, but there is no wonder when their material was as under-par as it was. I had a feeling that the characters would be stereotypes as they always are when it comes to SyFy, I wasn't necessarily put off by that. It was that few of them were memorable or had any spark to them. They were further disadvantaged by some embarrassingly stilted dialogue that never rings true and by a story that manages to be both predictable and dull with no chills or suspense and the attacks and ending were too contrived to be believable. The music is also repetitive, while Haunted High is also very cheap to look at with very choppy editing and while the effects have been worse before in SyFy movies they are substandard here at best. So in conclusion, a lame movie but at the same time it could've been much worse. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[15,16]},{"title":"The lack of ghosts and scary moments will haunt you forever...","rating":2,"date":"21 August 2013","review":"Given this is a SyFy Channel movie, the movie already have odds stacked against it. But every now and then these original SyFy Channel movies do surprise. However, I will say that \"Haunted High\" wasn't a surprise. Not even with a nice ensemble of actors and actresses as the movie has.<br><br>The story in \"Haunted High\" is about an evil headmaster who returns from beyond the grave to wreck havoc, torment and kill students at the high school. And it is up to the janitor and the students to put an end to the vile spirit and his entourage of ghostly followers.<br><br>It was so difficult to buy into the whole concept of the movie, because the storyline was so badly constructed and even worse brought to life on the screen. The ghosts were a little bit too real - too manifested in the flesh - to appear believable as ghosts or supernatural entities. And the death scenes were, most of the time, laughable.<br><br>There weren't a single scare or thrilling moment throughout the entire movie. Unless you consider seeing Danny Trejo for the first time in the movie as a thrill.<br><br>But for fans of the lower budget horror movies, then there is a good handful of familiar faces to be seen here. At least thumbs up for this ensemble of actors and actresses.<br><br>If you enjoy ghosts/haunting movies, then \"Haunted High\" is not recommendable. I rate this movie a mere 2 out of 10 stars. It was a real drag to sit through this movie, because it took forever to get nowhere. And most of the scenes that were supposed to be scary or menacing, just came off as spoofy scenes.","user":"paul_haakonsen","rank":[8,8]},{"title":"An interesting premise executed very badly.","rating":3,"date":"7 October 2012","review":"I had expected a low-budget made-for-TV SyFy feature, this is why I'll generously award this campy feature 3 stars. One simply cannot watch a movie like this and expect a high quality production, however viewers deserve to not face-palm themselves every 4 minutes.<br><br>\"Low budget\", as most of us cinemaphiles know, is not a valid excuse for bad writing, bad acting, and... bad everything. <br><br>The plot is like cheap fishnet stockings... covered with holes, transparent, and weak. Sadly, not as attractive. Some of the scenes are so illogical it's frustrating. <br><br>A better screenplay, set and directing would have lent this mess some respectability because the concept itself is very intriguing. It's a good idea with potential, gone wrong. <br><br>There are some unique kills, and I wasn't really distracted by overly bad CGI like in some comparable productions. I was too distracted by poorer qualities, I suppose. <br><br>The dialog is so bad, it exceeds description. The bad puns tossed out by our antagonist before each kill were insufferable. Even if they were aiming to be campy, it still failed. <br><br>I've seen better acting at middle school Thanksgiving pageants. The worst performance (arguably) was offered by Shawn C. Philips. He's no stranger to the horror genre. Perhaps he just did the best he could with the material he had? It's all terrible waste of several proved talents. Please do not judge the actors exclusively by this feature if you happen to be unfamiliar with their other work. <br><br>If you're a fan of other Sy-Fy channel movies and are prepared for their usual shortcomings, you may not be disappointed. Admittedly, this is not their worst work nor their best.","user":"hi_im_manic","rank":[14,16]}]