[{"title":"My Review Of \"Trashology\"","rating":9,"date":"5 December 2012","review":"Brian Dorton's \"Trashology\" is a love letter to John Waters and one hell-a fun movie! The film is comprised of three distinct stories of crazed madness and melodrama befitting a telenovela produced in Hell's asylum. It has a wrap around story that works harder than an Asian on a stripper pole. Yes that hard and crudely. This ain't no Lifetime movie bitches so if low brow humor at society and humanity's expense offends you then f**k you. This movie is hilarious as h*ll and brilliantly sick with humor. From Ouija boards to bowel releases and beyond I don't think there is anything left out of this wonderfully crafted train wreck of lives. The first story is entitled \"The Vat\" which features friendships only Satan's geriatric grandmother could relate to or anyone with a parent over the age of 50. The characters are over the top and draw from a creative point somewhere between Golden Girls on crack and Golden Girls on acid, I want to tune in next week to see what psychotic mayhem these woman get into next! Following the crazed social turrets outburst that is \"The Vat\" comes the twisted little tale called \"Big Debbie\" which features the one fetish that I just can't wrap my little g@y brain around known as 'squashing'. As I have been told over and over, it is a thing! Yet that is just the start of this sick little puppy because poor Debbie goes through some sh*t and thankfully comes through only slightly more damaged-in this film that last statement should be followed by 'if a person can be more damaged than this poor woman to begin with'. Don't get me wrong everything in this segment is dark, funny, and one h*ll of a ride through Psychoville that I will take over and over again any day. Following \"Big Debbie\" is a tale that would make Mickey and Mallory sh*t their denim jeans called \"Inglorious B**ches\" about two friends who decide to take their love of killing people and turn it into cause for killing people by going after sex offenders. As if we all haven't thought of taking a ball bat covered with spikes and ramming it up some sicko's a** until he is D-E-D dead! Well anyway the characters in this segment are so twisted and wonderful. Actually there isn't one badly written or poorly acted character in this little mental outburst of filthy thoughts and filthy jokes.<br><br>The story for \"Trashology\" is genuinely well written and f**king brilliantly executed which is more than the Texas Justice system can say. It is wicked sick how all the characters relate to each other in all three stories that show a true and honest passion for this genre from Brian Dorton that gives the film a slight seriousness which rocks because to make so many characters intertwine in a anthology either takes one h*ll of a vision or a true psychotic with some yarn and a white wall. (The walls are almost always white! well white-ish) Anyway \"Trashology\" is so much more than a love letter to John Waters it is hope – hope for a subgenre that almost never gets respect or appreciation yet makes some of the best written and most hilarious cult films evah! It is also a film that is epically brilliant and hilarious. I MEAN THIS FILM IS SICK! I think I will need an exorcism and enema just to get regular again. Okay I am lying! Those things are for funsies I was never regular to begin with and thank the gods of the sh*tty bowels of cinema neither is \"Trashology\". Now I am off to Walmart to pick out each of these characters and isle stalk them for my never ending continuation of this twisted flick!","user":"ASouthernHorrorFan","rank":[20,29]},{"title":"John Waters would be proud","rating":9,"date":"9 December 2012","review":"This film is the reason why I think therapy is highly recommended. Trust me, after the 3 stories we get to see the closing moments with Tracy and her male friend, and they do something that is so vile and disgusting that I cannot even begin to describe how absolutely bizarre it came across as. John Waters himself would love this film, but I think he would hate himself afterwards for knowing he inspired this wave of film. This film without question is not for everyone and would more than likely offend anyone who watches it. But, the film was well written and very unpredictable. And, when you have Manoush singing your theme song, you almost know that this ride is going to be something that either you are going to praise and talk about a lot, or never tell a soul what you watched and when your whole house is empty rewatch it. This film is John Waters for 2012, and I absolutely had fun with it and think that people who are in the mood for a slice of the perverse would love this film as well. John Waters would really be proud.","user":"james_depaolo","rank":[16,23]},{"title":"The Perfect Antidote to Bland Hollywood Filmmaking","rating":9,"date":"4 September 2012","review":"I guess you could say Trash Cinema is a bit of an acquired taste. Not everyone fan of film can fully appreciate the blood, sweat, and other bodily fluids that go into making a true Trash Cinema gem. With the death of the drive in and multiplexes popping up in suburban America everywhere, it is a dying sub-genre of film that hasn't been visited in quite sometime. When I received word of a new Trash flick from filmmakers, I jumped at the opportunity to review it. In the world of bland PG-13 horror movies and remakes, Trashology sounded like a breath of fresh, vomit infused air. Imagine the most twisted episode of Strangers with Candy you've ever seen, mixed with some early John Waters, and sprinkled with a dash of Troma. If that sounds like the perfect cocktail to you, Trashology is the movie you've been waiting for.<br><br>The anthology flick begins with a wraparound story as we meet Tracy (a sweet but deliciously cynical Laura Lee Black). Tracy is a middle aged woman going to college to become the next underground Trash filmmaker. After giving her film professor head for arriving late for class, she finds herself with a \"Trashology\" book full of stories featuring sex, violence, and just about every bodily fluid imaginable. Is Tracy ready for the journey into utter madness and will this help her become the next great Trash Cinema cult leader?<br><br>In the first story titled \"The Vat\" we meet Beatrice (Jenny Coulter) and Laura (Rodney Horn). Imagine Mink Stole as a 65 year old cranky, nicotine addicted spitfire and you have an idea of who Beatrice is. As for Laura, imagine Mrs. Fine from The Nanny cranked up to 11 with a delightful, mean spirited sense of humor. The duo are met by religious fanatic Claudia (Angie Keeling) who is severely upset she got ripped off at 25 cent Banana Wednesday. After a bit of a mix up, Claudia ends up dead and Beatrice and Laura are forced to bring her back using an Oujia board. By far my favorite segment of the film, \"The Vat\" features a knock out performance by Horn as the delightfully kooky Jewish woman Laura. I really can't say enough about Horn's performance as he had me laughing with every line that came out of his mouth. Coulter and Keeling are wonderful too and the trio are so off-the-wall and nutty that I would love to see an entire feature wrapped around these three characters.<br><br>Next up, we have \"Big Debbie\" as we meet a rather large woman in her wedding dresses crying as she is walking down the street holding snack cakes. Debbie (in another delicious performance by Horn) has just been stood up on her wedding day. She meets a young man on the street who offers her a shower back at his place to clean up. When she arrives at his apartment, his friend is waiting for her and the twosome plan to use her for some \"fun\". When one of the two men end up dead, Debbie is forced to get rid of the body. Little does she know an angry lesbian (Rachel Stout) bent on revenge has seen her and wants to get some justice of her own. This story is a lot of fun and doesn't quite play out the way that many viewers will be expecting. Less grotesque than the first story, this installment still feels like a wildly over-the-top and gaudy episode of \"Tales from the Crypt\" meets Very Bad Things. NoI mean that in a good way!<br><br>In our final story, we meet Katrina and Melissa (played in wonderful, go-for-broke performances by Dorton &amp; Conner), a pair of female vigilantes who discover a cell phone application in which they are able to track down sexual predators in their area. Hidden secrets and a nice twist ending put a smile on my face through this entire installment. While this story runs a little on the long side (at least a few minutes could be trimmed as the story becomes a little repetitive), it features the same spirit of the other stories with an attitude that perfectly fits the style of films such as Pink Flamingos and Desperate Living.<br><br>\"Trashology\" isn't a film for everyone. If you can't handle vomiting, diarrhea, and gratuitous nudity..this film probably isn't for you. Nonetheless, if you've been waiting for that perfectly trashy flick to offend your friends and shock the neighbors, \"Trashology\" is the cinematic obscenity you're looking for. It's rude, crude, and over-the- top. Something tells me John Waters would be proud. Long live Trash Cinema!","user":"slasherstudios","rank":[17,26]}]