[{"title":"Should you trust a message from yourself?","rating":8,"date":"2 November 2013","review":"If you received a note from yourself from the future would you know what to do? This is my favorite genre of movie. Time travel, or in this case a message sent in warning. Good movie. I hope that these guys get more money to produce it so that more people can see it. The idea is great, and the setting is perfect, you feel like it is the 90's again, and believe in the low tech of it. There was a time just a decade ago that people were still innocent, and actually believed that the people around them were too. The Actors in this movie were doing it for the art, and you can feel that there is no corner cutting done by them. If you get a chance try it.","user":"face-819-933726","rank":[4,5]},{"title":"low-budget film but still quite watchable","rating":8,"date":"8 September 2013","review":"Michael Ryan's great review on this film: Posted on July 23, 2012 By Michael Ryan Fantasia Film Festival Easton's Article Written and Directed by Tim Connery USA, 2012 \"Leave it to a time traveler to arrive late for a party! Easton's Article arrives at the Fantasia Film Festival a year after films it would have been natural companion pieces with, like Fantasia 2011 films Brawler, Bellflower and Another Earth, films that used a thin veneer of genre to illuminate stories about the most f****d up personal relationships possible.<br><br>In the case of Easton's Article, the genre is time travel and the veneer is very thin indeed. The film's biggest weakness and biggest strength is that it is not really a time travel story at all. Oh sure, it has the trappings of a time travel story, but that is simply a mask for a story genre much older and darker than time travel.<br><br>The set-up for the film is that Easton Dunning (Chad Meyer) is a computer engineer who somehow manages to pull into his 1997 \"Super-Computer\" information from his own future, specifically his own obituary and a set of instructions. In investigating these artifacts from his future, Easton is drawn back to the hometown – and the girl, Hayley Reed (Kristina Johnson) he left behind years before. Easton's bruised and alienated relationships with his hometown and Hayley are the heart of the picture. Easton clearly loves both Hayley and his hometown, but also fears them and fears opening the wounds that time and distance could not completely heal.<br><br>Easton's Article is not a time travel story with physical time travel, nor is it the kind with a labyrinthine type plot like Robert A. Heinlein's classic By His Bootstraps or Shane Carruth's Primer. In fact for a time travel story, Easton's Article is almost embarrassingly linear. It shares elements in common with films like Frequency and Cryptic or the James P. Hogan novel Thrice Upon A Time, by postulating that while people or objects can't travel through time, information can. The chief difference is that all three of those stories believe in a fluid time stream that can be changed as easily as shaking an Etch-A-Sketch, while Easton's Article is more pessimistic about the ability to change one's fate.<br><br>Fate is the key to the film. In a sense, when Easton ran away from his hometown, he sealed up his fate in a box like Schrödinger's cat and when he returns he begins the process of opening the box to see whether the cat lives or dies; to see what fate awaits him. Because you can't run from your destiny, the more violently you run away from it, the harder you run towards it. The ancient Greeks understood this well, just ask Oedipus (\"You will kill your father and marry your mother\") or Croesus (\"If you cross the river, a great empire will be destroyed\"). The ancient Greeks would have understood and appreciated Easton's Article, but not as a time travel story. They would have classified the film as a story about prophecy, and told us that it is not an accident that the Internet (especially in 1997) was/is home to both Oracle and Delphi.<br><br>Beneath the mask of the time travel story, Easton's Article is revealed as a tale of prophecy, which are always stories about how our past leads to our future like the river leads to the sea.<br><br><ul><li>Mike Ryan\" you can't run from your destiny no matter what. this film obviously is very low-budget film with only a few characters and actors to play it through, but it's not bad. i especially like Christina Johnson who played the Hailey role. she is a quite talented actress and played and acted this role very believable and convincing. this film, if you have some uncommitted time and patience, is quite watchable.</li></ul>","user":"rightwingisevil","rank":[8,18]},{"title":"More talk than sci fi","rating":2,"date":"25 May 2017","review":"BLACK WEB is a slow and dullish indie drama with a few science fiction touches, but the budget is so low that nothing much is made of them. Instead this follows the usual format of having interchangeable characters chatting in kitchens and the like while the story drags on endlessly. There are some hints at quality - this is well-shot, for instance, compared to most - and it does feel reminiscent of a snowy Scandinavian drama at times, but mostly the slow pace makes it a drag.","user":"Leofwine_draca","rank":[2,4]}]