[{"title":"A real eye opener","rating":10,"date":"13 August 2012","review":"By chance I came across this movie on TV today and must say that it truly is an eye opening experience.<br><br>Not only does the substance increases your awareness as such but this movie makes you aware how absurd in retrospect step by step a whole generation was impacted by a coincidence.<br><br>The movie is extremely well crafted. A first rate documentary which is as mentioned eye opening.<br><br>Fantastic editing, music and speed.... A historical movie about a special time...<br><br>It accurately describes how from the lab it arrived at the streets in quantities which today seem hard to believe. For someone who is now about 40 and was too young to have lived the 50ies and 60ies it enables to understand the psychedelic and Hippie movement. By the editing and the intense interviews you do have a feeling of actually reliving the times. The Director has truly shown sensitivity and also a certain pragmatism which makes this movie very pleasurable and entertaining.","user":"robeis-448-536123","rank":[15,17]},{"title":"A very important film - the history, including the recent renaissance","rating":10,"date":"21 February 2013","review":"A beautifully produced film describing the history of the of LSD, with interviews with Hofmann, Leary and Dr. Roland Griffiths who is now opening up research again, and finding important uses for psilocybin in psychiatry again.<br><br>The sad story of the 20 years of darkness where psychoactive drugs have been daemonised and attacked - mainly because of the threat that they posed to the war mongers who didn't wish for peace marches to interfere with the Vietnam War.<br><br>It's sad to see the sickness of the military 'mind' that sought to use LSD for CIA interrogation and, when that failed, as a means of attacking whole cities. <br><br>It is wonderful that such an important means of enhancing human life is coming back into the open again.<br><br>The film also has appearances from Jimi Hendrix and the Grateful Dead!","user":"peter-1850","rank":[4,5]},{"title":"A film to absorb","rating":8,"date":"30 April 2018","review":"Is there any singular substance that has influenced Western culture more than LSD? Sadly, the story of LSD has thus far been a tragic one, but with new research at some of the leading medical universities in the USA, perhaps this phenomenal gift will make a resurgence and become readily available once again - it is too beneficial for just the most ill. This film covers the entire history of LSD, including original footage of government and psychological experiments with the substance. If you are interested in learning more about LSD, this film would be a good place to start.","user":"internetfreieminuten","rank":[1,1]}]