[{"title":"Scott Elrod Makes the Movie","rating":8,"date":"13 April 2014","review":"The performance by the lead actor \"Scott Elrod\" makes this movie worth watching. I'm in a mixed marriage, and my wife the Christian, lost interest in the movie despite to the strong religious overtones. As a Jew, I was fascinated by the use of religious values to help cure addictions; it's a strong and powerful message. <br><br>Vivica Fox also puts in a very strong performance as the lead character's agent (spokes person), so was believable in her role. As a public relations spokesperson, she plays her character exceptionally well, being able to profit from those she represents, yet knowing if they don't get help they will be worthless to herself &amp; others. <br><br>I'm looking forward to seeing Scott Elrod in future leading roles, Hollywood can use another strong lead actor who's message isn't hypocritical. <br><br>I'm not sure why people didn't believe this was a baseball movie, with the constant flashbacks to the daemons of his fathers voice \"haunting\" him throughout the movie. The baseball cards in a closed box, representative of his inner child and letting them go at the end of the movie. Almost every scene was filmed at a baseball field or with a ball / ball; so how exactly is this not a baseball movie on the surface. It might have not been all filmed at the major leagues, but all players have to get their start somewhere. Whether at home growing up or in a little league type program. <br><br>This is overall a good movie which kept my interest throughout (yes, it slightly dragged at the 3/4 mark), with a positive message and some great lead acting.","user":"astravitz","rank":[15,17]},{"title":"Religion and addiction","rating":4,"date":"4 August 2013","review":"The movie has very little to do with baseball. It is about major league ball player addicted to alcohol, and hits rock bottom. His father was also a drunk and abusive. He is forced into a 12 step Christian based program at a church in his hometown. <br><br>He returns to his home town and helps coach a little league team. He co-coaches with his ex girlfriend and mother of his illegitimate son, who is also on the team. The boy doesn't know the man is his father. There is a lot of religious reflection and depiction of people who are addicted to sex, drugs, and-or have been abused in someway. The plot is nothing new and a bit weak, even for a Christian movie.<br><br>The acting is top notch. Particularly Scott Elrod as Cory. The man playing the head of the Christian 12 step program, looks realistic and seems like he may have had some serious problems. (Little creepy) Most of the other addicts were just as odd and good at acting. They didn't look like actors.<br><br>The photography is good, the scenery is realistic, and depicts a depressed small town with an amazing number of people with various addictive issues.<br><br>If this movie were tightened up to an hour it would be much better.<br><br>There are a few 'feel' slightly good moments but very few. The main problem is the attempt for atmosphere which is taking over so many movies to stretch them into a full length movie. Lots and lots of music and camera angles always indicates the plot is thin.<br><br>As a Christian based movie, this is one of the better ones and holds back on the judgmental issues, well done but slow and dragging.","user":"casper639","rank":[13,16]},{"title":"wonderfully done","rating":10,"date":"28 April 2014","review":"Sorry but I am an Addictions Counselor that attends Celebrate Recovery and yes it was worth watching and yes I intend to show my group at work. I know the Christian theme but it was a warm and encouraging movie and it does follow the 12 step spirituality of needing to admit being powerless over my addiction and need a power greater than myself that can restore me to sanity. I absolutely loved it. Addiction many times is passed down from the parents to the children. Addiction destroys self and when we are powerless over our addiction we cannot stop it is only when we give that control to a power greater than ourselves can we stop","user":"sianggany_grenn","rank":[9,12]}]