[{"title":"More Hollywood Garbage","rating":3,"date":"18 February 2017","review":"Jamie Fox and Michelle Monaghan, what were they doing in this? Both are way too good to be in a movie this bad. Hollywood continuing to churn out junk like this and showing their disrespect for the viewing audience by thinking people are going to continue to pay and swallow this stuff. Well maybe some are but my standards are a lot higher than this. Jamie gets stabbed in the beginning of the movie and then walks around through the rest of the movie like he can barely stand up and walk, but yet has all these fight scenes after that where he is beating up everybody with no hint of an injury. Then after each fight is over, he appears again all injured like he is going to pass out, that is until the next fight scene comes up. Jeez. I guess Hollywood is saying, \"don't stab thus dude, cause it makes him fight better. Then the bad guy is shooting a machine gun in the parking garage with a gas mask on shooting tear gas all over the place yet nobody walking through it is coughing a bit. Heh heh. I guess Hollywood thinks everybody are idiots and are not going to notice. This movie was not a good one.","user":"fbmike","rank":[78,100]},{"title":"THEY GOT T !!!!!","rating":10,"date":"12 April 2018","review":"<ul><li>THEY SAID IT WAS GONNA BE AN EASY GRAB !</li><li>WELL , IT AIN'T NO EASY GRAB , THEY GOT T !</li></ul>","user":"theforcegamer-50435","rank":[93,134]},{"title":"Watchable but not memorable!","rating":5,"date":"13 January 2018","review":"Review:\nAlthough this movie had an simplistic plot, which we have seen many times before, I still found this film quite entertaining, and the action was pretty decent. It is a bit corny in places, and the ending was quite predictable but it's intense throughout and the acting from the whole cast was believable. Jamie Foxx plays a cop, Vincent, who robs a ruthless drug dealer, Rubino (Dermot Mulroney), with his partner Sean (T.I.). When he realises who he stole the drugs from, he's immediately worried about his families safety and he tries to cut a deal with Rubino, who kidnaps his son for his drugs. For some unknown reason, he hides the drugs in a toilet, so he can bargain for his son but the internal affairs are one step behind him, and they take the drugs, which means that Vincent isn't able to get to his son back. Officer Bryant played by Michelle Monaghan, is on the hunt for Vincent, while he attempts to get to his son and the drugs that were taken by Bryant. With time against him, and his sons mum Dena (Gabrielle Union) asking uncomfortable questions about his sons whereabouts, Vincent is forced to take matters into his own hands, risking his job and his life in the process. It does seem like a \"made for TV\" type of movie but the double crossing from the beginning to end, leaves you questioning who he can trust. The action was surprisingly entertaining, even from Monaghan who didn't shy from throwing a few punches but it's not the type of film that become an all time classic. With that aside, it's still worth a watch, and you can't fault it in the intensity department but I was left feeling empty when the movie finished, and I won't be watching it again in a hurry. Watchable!<br><br>Round-Up:\nThis movie was directed by Baran Bo Odar (What a name!), 39, who also brought you The Silence and Who Am I in 2014. For his third film, he done a half decent job and he was lucky to get some decent actors on board but he still needs to try and do something original, so he can make his stamp in Hollywood. Jamie Foxx, who recently starred in the popular Baby Driver, has had a pretty bad track record lately with Annie, which was quite bad, and the Amazing Spiderman 2, which was also not that good but he was funny in the Horrible Bosses franchise and Django Unchained and White House Down was watchable. He's due to star in the latest Mike Tyson biopic, which is in development and he's going to play Little John in the new Robin Hood movie, starring Taron Egerton and Jamie Dornan, so he has a lot to look forward to, if the movies actually turn out to be any good. I've never really rated him as an actor but he is gradually warming to me, and his choice of movies have been pretty successful to date, even though this movie didn't smash the box office.<br><br>Budget: $30million \nWorldwide Gross: $32million<br><br>Genre: Action, Crime, Thriller\nCast: Jamie Foxx, Michelle Monaghan, Scoot McNairy, Dermot Mulroney, T.J., David Harbour, Gabrielle Union and Octavius J. Johnson. 5/10","user":"leonblackwood","rank":[6,6]}]