[{"title":"Unexpectedly emotional documentary","rating":10,"date":"6 November 2012","review":"Fascinating, unexpectedly deeply moving portrait of Marina Abromovic, who is sometimes called 'the grandmother of performance art\" and her hugely successful retrospective at New York's Museum of Modern Art'. <br><br>While her past history is never less then tremendously engrossing, the most powerful moments of the film are those showing her new work, unveiled for the retrospective called 'The Artist is Present'. For 3 months, Ms. Abromovic simply sat in a chair all day, taking no breaks, looking into the eyes of any museum guest who sat down opposite her. No talk, and very little movement. <br><br>Yet these encounters are tremendously powerful, often moving both participants to tears (and some of us watching the film as well). This is 'art' taken to it's most simple, naked level. Connection between two strangers, each coming away different for the encounter. <br><br>While all this may sound dry and theoretic, the pure honest emotion and presence the 63 year old artist brings to her Herculean task make watching the film anything but.","user":"runamokprods","rank":[28,33]},{"title":"Performance Art at MOMA and Real Life","rating":10,"date":"29 April 2012","review":"I just saw this film at the San Francisco International Film Festival. I thought it was excellent. I had heard about Marina's work, read a few articles and seen a few photos, but this film put it all together and gave me the context that I never had before.<br><br>It documents a 3 month retrospective of her work that was at the New York MOMA and not only shows details of what it was like to live through those three months, with recreations of many of her historical performances and Marina sitting in front of audience members all day every day, but also shows the back story regarding the work involved in putting something like that together, as well as details about her personal life that are fascinating. Collaborations and interviews with former husband Ulay are particularly poignant. The reactions of some of the audience members at the museum are also quite strange and compelling. I especially liked the children who sat with Marina at the museum and have a feeling that the experience will stay with some of them for a lifetime...<br><br>This film made me want to seek out more of Marina's work...","user":"sfdphd","rank":[37,47]},{"title":"More art, less artist","rating":5,"date":"10 July 2012","review":"This is a documentary about how long it took for Marina Abramovic to get famous. It's a long view of a life lived in art and for art and then suddenly, late in life, to discover that all those years spent in obscurity are finally paying off. That's interesting. But that's all the documentary is about. Why is her art worthy? What has been the arc of her life's work? How has it evolved? I might as well have watched a film about Kim Kardashian and the nature of fame. This is more an adulation of fame itself than an analysis of the power of art. Very disappointing. The frame for the film is the build up to her most famous work, The Artist is Present, at MOMA, where, individually, members of the public were allowed to sit in a chair opposite Ms. Abramovic and stare into her face. The impact of this experience seems to have been profound. Ms. Abramovic's face is magnificent, filled with pain, deep silence and supreme mystery. She did this every day for three months. The sheer fortitude that this must have taken is astounding. The amount of raw emotion that she must have absorbed is exhausting just to think about. To have heard her speak on camera about this experience would have been fascinating. But instead we get a facile look at the least interesting aspect of her life; the fact that she is now famous. I'm glad for her but it's a small, mundane detail of a life lived with far more complexity than this documentary affords her.","user":"athenamuses-308-200437","rank":[29,58]}]