[{"title":"When a brilliant auteur goes down","rating":12,"date":"12 March 2017","review":"First off, I must say I am not a Terrence Malick hater. On the contrary: I used to worship the man. I even took an entire course in film school dedicated to him, Orson Welles, and Stanley Kubrick. I think the 5 films Malick did in the first 38 years of his career (\"Badlands,\" \"Days of Heaven,\" \"The Thin Red Line,\" \"The New World,\" and \"The Tree of Life\") are all masterpieces. I even liked \"To the Wonder,\" which was almost universally panned, even though it was clearly not in the same league as his previous films. After the acclaimed \"The Tree of Life,\" Malick (now 73 years old) has been working on several projects in different stages of production. He filmed \"Song to Song\" immediately after \"Knight of Cups\" (released last year) back in 2012, and it's only being released now, as a 129-minute film, after almost five years of post-production and at least 8 editors to turn it into something remotely coherent (reportedly, the first cut was 8 hours long). Unfortunately, like \"Knight of Cups,\" \"Song to Song\" feels like a parody of Malick's work: the extensive, mumbling voice-over narration by all the main characters (taken to the extreme), the stunning imagery of nature and high-end real estate, and gorgeous people literally walking in circles and acting cute (or mean) to one another. The very thin plot revolves, as you heard, around two intersecting love triangles set against the music scene in Austin, Texas. But music doesn't play a great part in this story, and it certainly could have elevated it.<br><br>As abstract as Malick's earlier films could be, they all had tangible, rich, philosophical and often universal themes. \"Knight of Cups\" and \"Song to Song\" are pure cinematic masturbation. Malick's trick is getting some of the biggest (and best-looking) film stars in the world, and his main actors (Rooney Mara, Ryan Gosling, Michael Fassbender, Natalie Portman) have faces that one can easily watch for hours. But not even these great stars can masquerade the emptiness of the film. Mara has the most screen time of them all, being the only true leading character here, while Cate Blanchett, Holly Hunter, Val Kilmer, and Berenice Marlohe are reduced to cameos. There's at least one painfully genuine moment, near the end, featuring Hunter's character, but it only lasts a few seconds; Malick's gaze isn't interested in her emotions. He'd rather show us, for the umpteenth time, Mara and Fassbender being flirty and sexy instead. <br><br>I am all about experimental cinema, but when you realize that this is the deepest sort of \"experimental\" project that Hollywood can put out (made by a revered auteur that movie stars almost pay to work with), you feel even more nostalgic for the daring collaborations between Tilda Swinton and the late Derek Jarman. I know people who deemed \"Knight of Cups\" a \"masterpiece\" and will probably say the same about \"Song to Song.\" I try to be respectful of other people's opinions, but I really don't think we're seeing this film through the same lens. I still admire and respect Malick; I just liked his work more when he had something to say. Right now, I see him as someone who can afford to make gorgeous-looking home movies just for his pleasure, but he's a much more interesting artist when he expands his canvas into something we can truly care about.","user":"Benedict_Cumberbatch","rank":[223,271]},{"title":"Nice visuals but utterly self-indulgent","rating":2,"date":"27 March 2017","review":"I always go to a Terrence Malick movie hoping to find once again something akin to the transcendent vision firmly grounded in the real world that I encountered when I first saw \"Days of Heaven\" (1978), a movie that combined gorgeous cinematography with a compelling plot. My hopes were dashed yet again with \"Song to Song.\" The visual beauty is here, but the movie feels bloated, self-indulgent, and disconnected. Malick's technique of splicing together seemingly random footage overlaid with barely audible interior monologue has by now become formulaic, and he seems incapable, unwilling, or afraid to deliver a sustained scene in which characters actually exchange meaningful dialogue. And speaking of characters, one after another is introduced for no apparent reason, as if quantity could make up for the fact that none of them are developed, and their utter shallowness foreshortens any depths the movie might be trying to plumb. Finally, the movie went on so long that I left feeling too exasperated and exhausted to hold on to the shreds of visual beauty that it offered.","user":"jefferino","rank":[80,102]},{"title":"Way too many close-ups of Mara's face","rating":5,"date":"17 May 2017","review":"My God I am all here for a great experimental, artistic movie, but this was just boring. Despite all the great cinematography, the message from this movie could be told in 30 minutes and was explored so much better in another 100 movies. The scene with Holly Hunter in the parking lot was the best one, but it only lasted a few seconds. Besides that, it was just an accumulation of beautiful faces flerting together (good acting nonetheless). And where was the music? The music could have saved the movie. Filming the film at a festival and putting on some old music legends doesn't do the job.","user":"vaniamendes","rank":[69,93]}]