[{"title":"A Sight for Sore Eyes","rating":9,"date":"20 June 2012","review":"Ben Wheatley provides one of the year's darkest and funniest comedies in this tale of true love, caravans and dead bodies.<br><br>Ever since her terrier Poppy died in a bizarre knitting accident, Tina (Darkplace's Alice Lowe) has lived a sheltered life with her mother. New boyfriend Chris (Steve Oram) decides to show her his world and takes her on a self-proclaimed \"erotic odyssey\" in his caravan to such wonders as the Crich Tramway Museum, Ribblehead Viaduct and, of course, Keswick Pencil Museum. But with litterbug, National Trust snobs and feral youths running rampant, Tina and Chris inadvertently leave a trail of dead bodies in their wake, as their holiday continues to spiral out of control.<br><br>Steve Oram heads up the fantastic cast as the muted, yet brutal, Chris, complementing Alice Lowe's awkward, yet creepy, Tina perfectly. However, the real star is the special effects, which provide some of the most realistic and memorable on screen deaths of the year. The unsettling, albeit hilarious, performances of the two leads is mirrored in the soundtrack, a mix of cheery '80s pop songs and a haunting minimalist score.<br><br>Shot in the beautiful Lake District, director Ben Wheatley uses lingering shots and slow-mo in an innovative way, making his comedy edgy whilst poignant. No doubt, this is a very British black comedy. Wheatley shows directorial flair, but reigns it in from his previous work Kill List, leading to a much tighter film, with a concentration on the biting wit of the script.<br><br>Sightseers, overall, plays out like a cross between Bonnie &amp; Clyde and In Bruges, leading to a perfect pitch-black comedy that's not for the faint hearted.","user":"josh-thawley","rank":[86,121]},{"title":"Dark Comedy Doesn't Get Much Darker Than This","rating":7,"date":"28 May 2013","review":"Last year's \"Kill List\" was one of the creepiest, most disturbing films I had seen in a long time. It's a film that stayed with me long after the screening, and one I encouraged friends and associates to check out. Some still haven't forgiven me.<br><br>Imagine the combination of dread/anticipation I felt about the chance to see director Ben Wheatley's latest slice of darkness entitled \"Sightseers\". Described by some as a \"dark comedy\", I would say that the only thing possibly darker than Wheatley's sense of humor would be the center of a black hole.<br><br>\"Sightseers\" tells the story of a frumpy British couple off on 'holiday' (as they say,) the problems that come up on such trips, and the unique way they choose to solve them. Saying any more would give too much away. Suffice it to say, may you NEVER come across a couple like this on your vacation.<br><br>Is it funny? Yes, it is. But you may hate yourself for laughing. Is it violent? For sure. Exceptionally. But in the context of the story, it has to be. Is it disturbing? Oh, yes it is, but once again Wheatley has made a film that once you've started it, you'll find it difficult to turn away. And, like \"Kill List\", the ending packs a wallop from which it may take you a while to recover.<br><br>Films like \"Sightseers\" are tough to categorize, and even tougher to recommend. This is not the feel-good hit of the summer. It is a look into the blackest parts of human nature, and how that blackness is often camouflaged by the banality of everyday existence. I wouldn't call Wheatley's films \"entertaining\", but damned if they don't get an emotional response out of me. So seek it out but you have been warned.<br><br>www.worstshowontheweb.com","user":"soncoman","rank":[32,43]},{"title":"Proof that a great film doesn't need a large budget","rating":9,"date":"25 March 2015","review":"When you think of all the millions of dollars invested into epic Hollywood blockbusters, then they turn out to be complete turkeys, you'll be heartened to know that there are still brilliant films being made on a fraction of the budget.<br><br>If Lord of the Rings was basically an advert for New Zealand's magnificent landscape, then Sightseers does the same job for the north of England. It's about your 'average' couple as they take their first holiday together, i.e. a romantic caravaning tour of the countryside. However, things soon start taking a turn for the worse and the dead bodies soon start piling up.<br><br>I won't go into too much detail about the plot. Some films are better that you know as little as possible about them. All you really need to know about Sightseers is that it comprises of the blackest of comedy around. The humour and tone is very dark indeed. If you think you can laugh at some characters with real human frailties, as they come to terms with each other and how they see life, then you should enjoy this.<br><br>It really is a true gem. Sadly Sightseers will never attain the dizzy heights of Hollywood's output, but it really deserves its place as a great British film.","user":"bowmanblue","rank":[16,22]}]