[{"title":"The story of how Seal Team 6 kills Osama Bin Laden","rating":1,"date":"5 November 2012","review":"This was a movie I wanted to see based on the hype from NatGeo. This could have been a terrific movie if properly developed, because all the elements are here: how the CIA found Osama Bin Laden, how Seal Team 6 trained for the mission, how Seal Team 6 killed Osama Bin Laden, and the aftermath of Osama's death on the aircraft carrier. Unfortunately, none of this was done; instead, the producers decided to dramatize the killing of Osama Bin Laden and Seal Team 6's involvement in the typical 1940-1950's style. Instead of sticking to the facts of Osama's killing, the producers dramatized his death and the role of Seal Team 6. This movie seems to have been developed way before the news media released all the information they could gather about the killing of Osama Bin Laden and Seal Team 6's involvement. Almost everything has been dramatized to the detriment of the real story. This movie has more fiction than a novel. The movie has the feel of a Roger Corman quickie: bad script, mostly unknown actors, poorly directed, and acted. It was put together way too fast. It is a shame that Bob and Harvey Weinstein are associated with this dreadful movie. At the end, the movie is dedicated to the armed forces and intelligence community for what they do on a daily basis to keep us free. As a veteran, I am insulted with this trash. This movie deserves a turkey rating. Another problem was the way National Geographic presented the movie: way too many commercial breaks with way too many commercials. This movie should have been shown commercial free.","user":"ScapegoatsOfTheEmpire","rank":[104,139]},{"title":"Simply dreadful","rating":1,"date":"4 November 2012","review":"Where to start? First off, it should have been a sign when this movie went from a theater release to a late night cable TV release. It seems as if every effort was made to make this movie as cheesy and campy as humanly possible. It simply stinks.<br><br>None of the actors portraying SEALs, from Cam Gigandet, Anson Mount, Xzibit, etc were believable in their roles. This contributed to, and in many ways, enhanced, the horrible dialogue and crappy tactics. It seemed to me that the production crew relied on a teenage Call of Duty player as a technical and tactical adviser for the film, while also disregarding virtually all the confirmed details about the raid. For crying out loud, the most anticipated line in the movie, wasn't even historically accurate!<br><br>Technical problems cripple any amount of believability this film could have had. First off, the weaponry is ridiculous. I'm supposed to believe that not a single one of America's Tier One special operators is smart enough to realize that back-up iron sights are a good idea on a rifle? Then, why wear NVG's at all if you're not going to use them, and for the ones who did decide to use them at random times during the movie, i'm sure the bright white flashlight didn't screw things up at all. CQB? Non-existent in this movie! The SEALs all run through the houses shouting as loud as possible. <br><br>All in all, this movie was poorly acted, poorly directed, poorly produced, historically laughable, tactically ridiculous and a waste of time, money and energy. The only bright spot of the movie was William Fichtner, who is quite good in most roles he plays. The rest of the movie? Rubbish. Charlie Sheen's \"Navy SEALs\" was a more accurate SEAL film. Save your two hours, wait for Zero Dark Thirty, or watch Act of Valor. This movie fails.","user":"Spartan10","rank":[43,60]},{"title":"Insulting to the Military and Intelligence Communities","rating":1,"date":"14 June 2013","review":"I gave it a one because it was the lowest rating possible. If we were to edit this movie down to the facts, it would have been about five minutes long.<br><br>It's one thing to take some artistic licence with a true story, but this movie didn't take licence. It seemed like they didn't get any support from the military and they didn't do much research. A lot of the details I noticed probably wouldn't have been noted by the average viewer.<br><br>However, the most glaring detail was the way the military was portrayed - like a bunch of high school drama queens. The kind of garbage portrayed in this movie was unrealistic at best.<br><br>Please, PLEASE don't waste your time.","user":"godssailor","rank":[27,38]}]