[{"title":"Wonderful film a thumbs up for a lady who rediscovers passion and an intimate life before going out her own way! And a nice treat seeing Melanie Lynskey.","rating":9,"date":"10 February 2013","review":"\"Hello I Must Be Going\" is one of those little independent movies that you must see it's heartfelt and it shows how one little lady can struggle and after once again finding passion set back out on her own. I must also say that Melanie Lynskey really shined here she's an underrated actress she has great sex appeal and range give her more roles! Anyway Melanie(\"Two and One Half Men\")is Amy a recent divorcée who after bouts of depression seeks comfort and shelter by moving back in with her cultured and well to do parents(Blythe Danner and John Rubinstein)in their suburban Connecticut home. The only hope for Amy comes in an unexpected gift just like the way it happens in many lives. After meeting family friends she begins an affair with their son named Jeremy(Chris Abbott)a caught in the cookie jar 19 year old actor. And this rediscovery of passion and intimacy starts life all over for Amy again she's a new lady! Overall this film has it's highs and lows as you watch Amy go thru tragic and funny crossroads of her life as even though she's caught up in a magical love story this girl has reached a point in her life of raw emotional honesty so she can go her own way. Again overall nice feel good film that shows life's a journey with many up's and down's as a rediscovery of passion can show you who you are. Plus it was a nice treat seeing Melanie at work.","user":"blanbrn","rank":[26,29]},{"title":"It's a well told, well directed and well acted original story.","rating":8,"date":"30 December 2012","review":"I don't know why is this movie so criminally scored. It's a well told, well directed and well acted original story. It does lose focus a bit towards the very end, but it remains engaging and sweet in essence.<br><br>The plot is simple but also tactfully told, moves along well and it's peppered with touching moments of honesty. The protagonist's role is refreshingly crafted and accordingly acted. It has a clear structure and a detailed pacing through which we are given numerous invitations to delve in the protagonist's emotional state and even to indulge in soul searching nostalgia.<br><br>I'm really surprised at how this movie got such a low score. I treated these scores with a certain respectability when reviewing the possible movies I might spend my free time with. Outraged, I say!","user":"lgbrenes","rank":[19,21]},{"title":"Much lighter and funnier than the synopsis makes it sound","rating":8,"date":"26 January 2012","review":"Hello I Must Be Going doesn't really question the morality or credibility of its central theme -- romantic relationship between a woman and a man where she is almost a couple of decades older. The film cleverly escapes the creepiness surrounding it and actually ends up being very funny. It should be attributed to screenwriter Sarah Koskoff's unabashed celebration of the positive effects that sexual human contacts have on one's spirit, and female lead Melanie Lynskey's depressed yet oddly optimistic portrayal of the 30-something divorcée. For a Sundance Lab product, which often tends to be just dark and ambiguous, this is somewhat a refreshing change of tone.<br><br>The only indie cliché this film resorts to is the background of its main characters, who are all connected to filmmaking. However, this convenient setting on the filmmakers' part is not a real problem with the film, as there is a tangible character development of a woman slowly reopening to her senses, which should easily resonate among general audiences. All in all, this is an easy-to-follow indie with no ambiguity that makes your head spin. It clearly has adult contents with a few f-bombs, but nothing too graphic, and offers a pretty relaxed and enjoyable narrative.","user":"Arit","rank":[34,46]}]