[{"title":"Extraordinary","rating":10,"date":"19 August 2019","review":"I don't even know where to start. What an extraordinary movie with extraordinary cast. What started as a drama showcasing both the American and Ethiopian culture in the midst of one of the worlds modern states NY, to leaving me on the edge of my seat.. urging to see what next-wowww! What a script, what an incredible cast and crew. And Salome- the main character!!! PURE QUEEN! Directing and playing a major role is not for everyone- but you did that!!!! Ammmazinggg! The way the story is developed and shows how each and everyone of us are linked to each other in ways we can never imagine was also mind blowing.<br><br>It also stimulate the brain to think outside the box on how life is and what truly is important by showing us how things are bound to take a significant shift with a fraction of a second unexpectedly. It shows us what true love is. Shows us the power of forgiveness and how similar we are though there is a significance difference in the culture we are celebrate.<br><br>This movie is mush watch for all.","user":"ninilina","rank":[1,1]},{"title":"So Emotional","rating":10,"date":"13 February 2019","review":"Oh my, this film had my emotions running free. I cried, I laughed, I just didn't expect to be so moved right from the beginning. I just can't get enough of this film and will be watching again with my friend tomorrow. 2 thumbs up!","user":"jordanfields-71473","rank":[1,1]},{"title":"Loved it!","rating":10,"date":"12 February 2019","review":"It is thrilling to see our culture beautifully highlighted all throughout this film. It is truly an honor to see my people and culture displayed accurately in Woven and I really hope to see more films like this in the near future. The movie Woven showcases the life of an Ethiopian born women, Elenie Tariku, who hopes to keep her roots alive while on the path of fulfilling her dreams. The film Woven is a must-see and will literally have you at the edge of your seat.","user":"leyamed","rank":[1,1]}]