[{"title":"Extremely bad acting","rating":2,"date":"4 September 2014","review":"What can I say, just finished watching this movie and I feel that repulsive urge to register so that I could air my view, about this bad film.<br><br>Sorry to say, this is very predictable story line and unfortunately extremely bad acting, I am bemused how did it get 5.7 stars on IMDb reviews.<br><br>I would make better movie on £5.ooo budget, using my unprofessional camera and my laptop, sorry but this was 1 hrs wasted of my life(skipped 30% of it).<br><br>Feel sorry for the actors for damaging their careers, honestly very surprised how did this movie made it way to the cinema screens.","user":"igorce76","rank":[3,3]},{"title":"College students can do better","rating":1,"date":"6 October 2014","review":"Wow<br><br>College students can do better than this - It was so poor - Bad acting, no special effects, wow - we all have made you tube videos better than this. It must have made on 500.00 budget to be honest. The Staples center felt like someones garage with folding chairs in it. The stunts where so obvious and I agree with the other review. I am from LA and was ashamed that such a film would represent us like that. They must have borrowed the equipment to make this film from the Library. Please be prepared to watch one of the worst films ever. Except maybe Machete. Even new Steven Segal movies here in 2014 are so much better than this film. Don't buy any popcorn for this one. Save your money for another day. One final note, if there is a silver lining here then maybe Danny Trejo is finally not going to make films any more.","user":"kbarnett2017","rank":[2,3]},{"title":"Low budget affair","rating":4,"date":"5 May 2016","review":"This may have some people you have heard of, if you are an avid movie fan (like Steven Bauer to name but one), but it's very poorly made. I do wonder sometimes if people are not better off watching UFC (the real thing) instead. But this also has some back-story, ill son and wife and a brother and ... Well you get the point, there is drama. Not to mention really evil people.<br><br>So will our main hero be able to withstand all odds? Will the women all be able to cover their naked bodies so the viewer won't see their nipples? Because you realize, that while violence is OK in US movies, under no circumstances should you show a nipple. But apart from that odd fact, the movie is predictable in other regards too. Acting isn't really a strong point, but it does touch some bases of human emotion, so it's not the worst thing ever. It is what it is ...","user":"kosmasp","rank":[0,0]}]