[{"title":"Just good fun","rating":10,"date":"28 February 2018","review":"I accidentally found this movie on a plane, and the flight was just under being long enough and sought out to rewatch from the start as it captured me! I really liked this movie, I like it so much I literally created a log in to say so. My review isnt funny, witty or relevant in any way but I feel like this movie is something you should give a go as you might find yourself laughing and bopping along!<br><br>The sound track is so up beat and the characters are wacky but enjoyable. I sometimes play this movie in the background while I'm pottering around just because it makes me happy! Although I think the two leads are the oddest couple ever, somehow they make it work. <br><br>Overal all, super enjoyable and perky. Please just watch it","user":"melkennedy-05060","rank":[63,75]},{"title":"An unique spark and charm!","rating":9,"date":"21 April 2016","review":"First of all, the soundtrack was good. Especially Norman Greenbaum's Spirit In The Sky suited the first gun fight scene excellently, and if by then you had no idea what kind of action movie Mr. Right is, that scene tells it to you straight.<br><br>Anna Kendrick is amazing as Martha, a girl so quirky you don't know if she's just weird or if there's actually something even more weird going on his head. Also the way Martha shook off \"Mr. Right\"'s comments on killing people made me wonder several times if she thinks he is joking, or if she just doesn't care too much, because he is so perfect for her. Sam Rockwell is an interesting choice for \"Mr. Right\". When Martha first meets him, he comes off pretty creepy, and while Rockwell is still very charming, he still seems dangerous. Even the viewer is suspicious of whether or not to trust him, mostly because we have already seen what he does, but he just seems so nice, but it's masking how creepy he is, but that is kind of destroying how sweet and charming he is, and so on. Right then and there it's a vicious cycle, but of course when we learn more, we trust more.<br><br>The romantic side of the film is interesting. The romance between \"Mr. Right\" and Martha is cute, but you feel like it shouldn't be. He seems older and kind of creepy, Martha just broke up with someone and also doesn't realise how her new, uh, boyfriend is actually a killer. But their chemistry just is astonishing. Of course there are a lot of problems in their relationship if you start analysing it, but they just seem like the perfect, cute, quirky couple.<br><br>The action side of the film is very excellent. The scenes are fun to follow, and \"Mr. Right\"'s skills make them even more interesting.<br><br>The character \"Mr: Right\" is probably meant to seem quite mysterious in the beginning, because nothing is said about him or the origin of his skills immediately. But for some reason that mystery doesn't seem that interesting than other plot-lines in the story. I was more interested to see the action scenes, Hopper's hunt for \"Mr. Right\", the development of the romance and I wanted to see Martha become a proper action girl. When the information about who \"Mr. Right\" actually is, it's just like \"Okay sure\". It doesn't seem like an important detail. <br><br>If I'd have to compare Mr. Right with another movie, it would probably be Seven Psychopaths. The reasons for that are Sam Rockwell in both movies, the humour, and just something about the plot, probably how there are several different plans and goals we are following all of them.<br><br>Mr. Right is a fun action movie. The plot seems original enough, and the film is interesting to follow. It has a certain spark and a charm. What more do you need?","user":"mistoppi","rank":[103,128]},{"title":"Its funny with the most awkward way .Loved it","rating":9,"date":"14 April 2016","review":"I read some reviews saying this is \"shallow\"?! not funny and a bunch of other absurd stuff like that. I mean seriously what depth exactly did you expect from such film?.. Enough with the sofa \"experts\" saying whatever they read somewhere else and actually review this..<br><br>This film is entertaining with a really unique way, (i wont deny that the humor is really not for everyone) They create all sort of weird situations that make you laugh with the fact that they even happening like that.<br><br>It also includes some fighting scenes that are actually really good with nice choreography. The plot has no holes in it, and i mean none,everything is covered just fine.<br><br>grab some popcorn relax and you will have fun while it lasts. i would recommend it.","user":"freego1","rank":[135,179]}]