[{"title":"Fun Fun Fun!!","rating":8,"date":"9 September 2014","review":"Samuel L Jackson is the disgruntled President of the United States who is the target of an attack that leaves him crash landed in the forest of Finland aided only by Oskari, a Finish boy trying to prove himself as a hunter and as a man. WHAT MORE CAN YOU WANT?! <br><br>This is the best camp action movie I have seen in a long time (and I'm counting The Expendables). It's so much fun to watch. Onni Tommila as Oskari is so brilliant and hilarious, and stands up no problem to Sam Jackson.<br><br>Definitely what you're looking for on a Friday night in with a buddy and a beer.","user":"LTSmash14","rank":[156,244]},{"title":"A campy B-grade movie perfect for young thirteen year olds jacked up on coke and popcorn","rating":5,"date":"3 May 2015","review":"An absurd story about a thirteen year old saving the President of United States. Checked. Unbelievable action sequences featuring exploding aircrafts and bulletproof protagonists. Checked. One- dimensional villains who have no shame uttering cheesy dialogue. Checked. Throw Samuel L. Jackson into the mix and congratulations, you have Big Game.<br><br>Set in Finland, Big Game begins by introducing the audience to young Oskari (Onni Tommila) and the traditions of his small community. Just a day shy of his thirteenth birthday, Oskari embarks on a coming-of- age tradition that requires him to survive and hunt alone in the frigid wilderness of the Finnish Lapland. The son of a hunter who brought back a bear in the same hunting tradition, Oskari has big shoes to fill in order to prove his worth.<br><br>Meanwhile, up in the skies, the aircraft carrying U.S President Moore (Samuel L. Jackson) is coming under missile attacks. Forced into an emergency evacuation pod by trusted Secret Service Agent Morris (Ray Stevenson), Moore finds himself hurtling down into the foreign landscapes of the Finnish wilderness. Fortunately for Moore, his pod is discovered by Oskari, who happens to conveniently be within the vicinity of his landing. Unknown to Moore however, is that Morris has gone rogue and is conspiring with Hazar (Mehmet Kurtulus), a psychotic terrorist bent on hunting Moore as game.<br><br>There is a difference between films that parody or pay homage to movie genres and films that masquerade itself as one. While one speaks volume of a director's understanding of the genre, the other says much about the director's skills (or lack thereof). Unfortunately for director Jalmari Helander, Big Game belongs to the latter category.<br><br>Despite Helander's inclusion of clichés and tropes, Big Game just does not come across as a throwback, parody or homage to the action genre. In fact, Big Game starts off well as an action flick with its premise and characters. As such, oddities in the film can be easily seen as awkward set-ups as long as they fulfill their purposes later in the story. The strange emergency evacuation pod on board the aircraft, for example, can be forgiven as it plays a role in creating the interesting encounter between the President and Oskari.<br><br>What is unforgivable, however, is when oddities in plot and logic overpower the main focus of the film. Instead of focusing on Oskari's development and personal growth, Helander decides to, as put across by Kirk Lazarus, \"go full retard\" and spends his budget on ridiculously exaggerated action sequences. The tonal shift, beginning with Oskari's decision to jump onto a freezer transported by a helicopter, is the \"jumping the shark\" moment that marks the descend of the film into a ludicrous b-grade movie; so much so that Jackson and Tommila's performances are lost in face of the bizarre comic book violence. <br><br>Plot loopholes are also abundant in the film, making the viewing of the film a strange experience. For instance, CIA terrorist expert Hurbert's (Jim Broadbent) involvement in the President's assisnation is not clearly explained; the same with his relationship with Hazar. Felicity Huffman's lack of lines as the bland CIA Director also suggests that the film has been edited and re-edited into a pale translation of the original script.<br><br>That being said, Big Game can be enjoyable if you are a connoisseur of B-grade action flicks. With it campy plot and exaggerated action sequences, Big Game is one action-adventure flick that B-grade movie lovers should not miss.","user":"moviexclusive","rank":[65,101]},{"title":"Fun Like It Used to Be","rating":10,"date":"9 May 2015","review":"I was dragged to this Movie today by my Son. He Dragged me to See Age Of Ultron Last week and even though I'm a fan of Marvel, I thought there was far too much going on in that Movie.<br><br>But back to this one. Do you remember the old Bruce, Arnie and Stallone Movies before they got old. This is just like those movies. We get Action, Characters to Care about Action. Funny One liners. Action. And we feel good at the end. Did I mention Action.<br><br>Nobody is going to win and Oscar here but if you like bringing your kids to the movies, this is for you.<br><br>Great Fun. Just what Movies used to be like.","user":"carlcasso","rank":[113,184]}]