[{"title":"nice little cgi movie","rating":7,"date":"10 August 2012","review":"Not stellar, but pretty good. Had all the regulars Carmen, johnny Rico and Carl the esp guy. Some good crazy action however a bit heavy on drama that didn't really work for me. Decent enough story and faithful to the original. A little overboard with the nudity, but hey. i like boobs as much as the next guy. Worth a rental for sure. Some effects and graphics worked really well at times, sometimes not so much. The bug animations were kinda stiff while the texture work was really good on the faces and \"ahem\" skin. You can tell which scenes they spent time polishing. By far much better then Starship Troopers 2 or 3. My only real complaint is that the story itself felt kinda rushed and didn't really have any nuance. It was a good story and some of the time I felt was wasted on things that were not needed at the cost of fleshing out the premise of the movie. Just my 2 cents.","user":"phil31169","rank":[100,118]},{"title":"Fun to watch","rating":8,"date":"10 August 2012","review":"I loved the first movie (directed by Verhoeven). With the young cast at that time.<br><br>They took all the elements of the first movie, and made it a very good animated feature ! Hope this will reboot the franchise in a good way (forgetting the sequels and the bad animated series).<br><br>But it is like entering in a big video game demo with non-stop action scenes.<br><br>Very entertaining, popcorn in a bucket, and sit tight to watch it with friends. NOTE: not really for kids, because there are some nudity, violence and gore scenes.","user":"laurentdelvigne-446-586973","rank":[58,70]},{"title":"not bad","rating":7,"date":"12 August 2012","review":"If you enjoyed the first movie or the book, then this won't be terrible. Too each his own and all that, but I found it to be quite amusing. I was a fan of the book, the first movie was amusing even if it didn't follow the book too closely. With the limited graphics in the late 90s, the powered armor would not have looked good at all. The graphics are decent, the action sequences are well done. The movie seems rushed in some parts, the plot was nothing terribly complex, but it's a classic alien/bug hunt; people die in a variety of noble/self-sacrificial ways, as befits a cap trooper, bugs are killed and there's lots of explosions. Better than the previous three, but the bar was never set very high.","user":"camerondscott","rank":[41,50]}]