[{"title":"Remote Island","rating":6,"date":"10 April 2013","review":"I had the pleasure of watching this at the Fantasy Film Festival in Germany. Quite a few have compared the setting of it with the movie \"Mindhunters\". There are similarities of course, but this one goes for the horror stuff. You might not like what you see, if you're easily offended and/or you're not able to handle the sight of blood. But if that was true, you wouldn't watch the movie now would you? <br><br>Effects are good and the direction is decent too. The actors are doing a fine job playing characters that have their moments. Of course there will be stupid decisions, , but they are all making sense more or less. The movie is good fun overall!","user":"kosmasp","rank":[24,34]},{"title":"Hmmm another teen kick ass job","rating":3,"date":"9 April 2014","review":"Now it is not the worst pile of cheap filmmaking in the world nor is the the best by a long shot. Why do film makers of zombie movies insist on making the people in it do stupid things no normal person would do. This is what annoys me most about movies like this. They insist on not taking any cars out and they came on a boat but never think of getting out on it. They constantly run into dark old flimsy buildings. Shoot them in the head one of the girls explained. Next scene guy shoots zombie in shoulder. Doh! I am writing a zombie movie as a book at the moment and am eliminating the idiot plots most movies have. Anyone who directs and wants to work on a decent storyline. Give me a bell. B","user":"Brendanflynn5","rank":[11,15]},{"title":"Not all that eerie, to be honest...","rating":4,"date":"27 July 2013","review":"I sat down to watch \"13 Eerie\" without a single clue as to what it was about whatsoever. And as the movie started up, I thought it might be a crime thriller or something, and being the zombie aficionado that I am, imagine my surprise when the corpses started to wake up. It was just priceless.<br><br>Well, the thrill was short lived, because \"13 Eerie\" turned out to be really flat and very generic. And what really brought down the movie enjoyment was the fact that these zombies were able to run, even with their advanced decomposition. I am not particularly a fan of fast and agile zombies, but this here was just a bit too stupid. And to make matters worse, then the zombies were making these growling sounds that would put even the biggest and ferocious of lions to shame. It was so bad. Zombies should not, and I repeat not, be making such noises, it just becomes a spoof and a comedy on itself. But wait, it doesn't stop there, these zombies were breathing as well - you could clearly see the hot steam exhaling from their mouths against the cool night air. It was such a painful thing to witness, and such a rookie movie-making mistake to make.<br><br>Well, I am not even going to delve deep into the storyline, because there is very little to delve into. The story is essentially about a group of forensics students brought out to a remote location where they are to be tested under strenuous conditions, when the cadavers start to come to life. And that is it! End of story! Brendan Fehr and Brendan Fletcher actually did carry the movie quite well. But the other people on the cast list were going good jobs as well.<br><br>The zombies looked like something out of a 70's zombie movie, bad make-up and even worse design. However, that was more than made up for in the amounts of blood, gore and mutilation that was in the movie. And that is also one of the major reasons as to why this movie scores a 4 out of 10 rating.<br><br>\"13 Eerie\" is the type of movie that you watch once, and never ever make an attempt to watch again, because it just has nothing to offer or support a second watching in any way possible. The movie is linear, predictable, not even remotely scary and just trots ahead in a rather monotone pace.","user":"paul_haakonsen","rank":[16,26]}]