[{"title":"Wonderful moment....","rating":10,"date":"11 March 2012","review":"I went to watch this movie without an good or bad expectation...never hear of it, didn't know actors, director, plot...nothing,A friend wanted to see it so tools me with her.<br><br>The result was simply amazing. You just want the movie to never end and wish knowing more about the next. Actually for those who read Chinese, you can find out lot of info about the outcome of the really person (as this is a true story).<br><br>In any case, you come our of the theater Happy, touched, enriched and isn't that what movie is for?<br><br>I hope the movie will have a descent channel if distribution to open it to the largest audience possible!","user":"Mikaban-315-449138","rank":[35,36]},{"title":"it's simple but it's wonderful","rating":10,"date":"8 September 2011","review":"It is a very simple story but it's funny to watch and after the movie finished I didn't feel like leaving the theater. I sat there, speechless but felt satisfied. Some people sat around me couldn't stop crying but many of us left the theater with smile on our faces.<br><br>It is a very simple story but it reminds us of something that was once special and important in our life. We laughed through out the movie and our emotion was triggered by a very simple but very hearty story.<br><br>\"You are the apple of my eye\" what a wonderful phrase! Those years, what we did could be non-sense but it was so important and we saw only those things in those years. We grow and we change and so do the characters in the movie.<br><br>The director did a great job to tell the story and the actors/actresses did great job as well. Camera work's fine and music/original scores are great too. It's a great combination of works and it's touching! I encourage/recommend you to see this delightful movie and to find something once was important back in life. Feel young again and feel reckless again~ 10 out of 10! Don't miss it!","user":"goedgood","rank":[69,75]},{"title":"http://readreels.blogspot.in/ : purely crude and satisfyingly sensitive portrayal of love and regrets.","rating":10,"date":"28 March 2012","review":"You Are the Apple of My Eye based on director Giddens Ko's autobiographical novel, is a coming of age story.The film starts with Ko Ching-Teng (Giddens) remembering his old school day when he and all his friends had a crush on Shen Chia-Yi, a honour student from their class and how they all chased her for years.Shen develops a deep friendship with Ko-Teng as she helps him study through his final year in school.Shen, Ko-Teng and all his friends then go their different ways to attend college.The story follows Ko-Teng as he tries to win over Shen.<br><br>The film has all the makings of a cult.The director shows us a crude and strangely accurate picture of our youth, sometimes going a little overboard but never failing to capture our sensitive side.See how Ko- Teng picks a fight just to bring his love a little closer or how all the boys can jerk off all day long but don't have the heart to face rejection of their love.All the performances are light and carefree,which works very well with the theme of the film.You never sense that something is out place as the film flows freely with a pace of its own from start to finish.Shen Chia-Yi will remains in your memory as the girl we all come across sometime,somewhere and you smile with her smile and cry as she weeps.<br><br>I loved this emotional roller-coaster of a film and will surely come back to it in time.The films is nostalgia for the old and reminiscence for the young.This is a special movie.Don't miss this instant classic.<br><br>P.S. : Last time i enjoyed a film about love this much was when I watched The Classic directed by Kwak Jae-young.","user":"liveweaver","rank":[21,24]}]