[{"title":"Has IMDb been hacked?","rating":1,"date":"26 May 2014","review":"I'm struggling to understand how this got such good reviews. I usually rate the IMDb score as the gold standard but something has gone seriously wrong here. I did see the trailer, it was good and contained the only laughs of the movie. The movie was truly the most tedious thing I have ever experienced. Why did it get such good reviews from critics and such a high score on IMDb? User reviews here are spot on. Not a single good review. The reviewer above who mentioned he had sat down to more entertaining bowel movements surpassed any joke in the film.<br><br>Something is very wrong here.","user":"fergus-17","rank":[372,601]},{"title":"Tedious, Dull, Tasteless, Unfunny","rating":1,"date":"11 May 2014","review":"I'm wondering if the infant in the film has fired her agent for landing her this gig.<br><br>I love bawdy humor. I actually love bad movies (\"The Thing With Two Heads\", for example) but this one misses on every count and I'm supremely puzzled by the positive reviews along with alleged media critics asking if this is the \"...funniest comedy of the year?\"<br><br>Really?<br><br>The basic concept was not a bad one -- partying frat boys next door to a 30-something-couple-with-infant trying to retain their youthful coolness -- that the couple never convinces you they had in the first place.<br><br>As a former journalist who knows many useless small details, it grated on me that the frat house operated so far outside of municipal regulations its existence would never have been allowed along with rickety plot gimmicks that derail the couple's efforts to uproot the frat boys through official means.<br><br>The sexual humor was uncomfortably crude and unfunny rather than bawdy (i.e., the scene where a frat boy wins a fight using his erection) and there is not the slightest success in creating the most threadbare aura of believability necessary for genuine comedy.<br><br>Those who made this film could have taken some lesson's from Chaucer's Miller's Tale on how to handle off-color sexual humor and scatology with precision and good effect.<br><br>It seemed the writers thought up crude things and then reverse-engineered them into the script making it a collection of rather dumb gags disconnected from a discernible story arc.<br><br>My afternoon viewing of this film was interesting in that the entire audience was 60 or older and when the film ended the house was silent.","user":"stepjohn54-1","rank":[219,348]},{"title":"100% Trailer Movie","rating":1,"date":"11 October 2014","review":"Trailer Movie {Definition}: Any motion picture, video or film whereby the movie's funniest, scariest and/or most dramatic/action scene(s), is included, coupled w both plot &amp; overall-message in less than a 3:00 minute 'trailer', rendering the actual full-length film a complete &amp; utter waste of time. There are hoards of bad 'trailer movies'; however, 'Neighbors' is arguably the quintessential trailer movie of all time. It's as though the creators of this flick, were attempting to force a square peg (e.g. a 2x4), into a round hole (a mouse's rectum). Perhaps one day, rating movie-trailers will become as mainstream, as rating the actual movie itself..., and should that day ever arrive, this trailer will well deserve a strong '8', because like a high-dollar Vegas call girl, sipping on champagne at the Mirage, I ultimately paid for the night's rental.","user":"asktms","rank":[54,81]}]