[{"title":"Thought provoking","rating":9,"date":"13 January 2018","review":"Maybe I've watched this on the wrong day. Or possibly the right day. I have the closing credits still on, it's that raw. Just 10 hours ago I contemplated suicide. Not for the first time, but I had reasons. Strong reasons.<br><br>I didn't go through with it because of my family. Because of my future. But I've come home low, and obviously didn't tell my wife how close I came. So watching this... quite accidentally, actually. I didn't twig what it was about and how ironic it was until I was some way in.<br><br>It's helped. Helped me see that as down as you can get, it's such a final solution. I've always thought I've not gone through with it because the way I'd prefer to do it with a gun. Being English, I can't just walk into a store and buy one. I don't even know how to get one illegally - I guess I'm one of the good guys.<br><br>So as someone suicidal, this film totally resonates. Would I go on it? Quite possibly, yes. Not for the money, we're not in trouble. But because it legitimises the act. It makes it less personal, as I'm sure you'd feel a purpose to it. And suicide is about losing your purpose.<br><br>I know I'm not at that stage. Hopefully, I never will be. But this film, whilst I wouldn't say \"it's saved my life\" it's a help. Today of all days.<br><br>Thank you to all involved, if any of you ever read this.","user":"dan_emma","rank":[34,38]},{"title":"Aims For Realism","rating":8,"date":"17 November 2019","review":"When I read the synopsis I thought it must be a satire, so it shocked the heck outta me to discover just how seriously this film treats it's premise of a network television program that presents people killing themselves for money. It plays everything one hundred per cent straight; gives characters believable motivations; tries to navigate around the tricky issues of how it could be allowed on the air and how people might react to it, etc. Performances are sincere and credible; the direction is serviceable - primarily to be commended for the emphasis on making everything as real as possible; for the most part the script is intelligent and astute. And for the majority of the film my only complaint was that it could have delved even deeper into the moral, ethical and social implications even as it was clearly telegraphing where the movie was headed. The inevitable connection of plot threads which otherwise might seem a little heavy-handed seemed the perfect opportunity to really explore the complex issues being addressed. Sadly the film stumbled hard towards the finale in a desperate attempt to end on a positive note, even if that meant suddenly hurling the carefully established reality out the window and becoming stock, shallow and predictable. It sold itself out for a \"happy-ish\" ending. In that context what had earlier seemed simply a bit too obvious (you can clearly guess which characters are going to end up on the program) suddenly becomes more manipulatively pedestrian. I understand the urge to present a positive, hopeful message, but the switch from dark to light needs to be handled with more finesse and caution otherwise - as happens here - you simply spoil what was otherwise an excellent little film. It felt like a desperate alteration instead of something being built towards - perhaps it was imposed on the filmmakers during postproduction? Yeah, I'll choose to think that, rather than the filmmakers simply lost the courage to be true to their tale: which, in a nutshell, is the difference between something like Network, and what we have here.","user":"zandertowne","rank":[4,4]},{"title":"Better film than I thought it would be!","rating":8,"date":"4 November 2017","review":"This was a far better film than I thought it was going to be. The premise seemed a little stale, so I didn't go into expecting much more than a semi-gory splatter film. It's really much more than that. There were some subplots that the film could have done without -- the boy with cancer, for example -- but otherwise the script and acting were very good.<br><br>I have a feeling that those trashing the film here don't want to face the fact that we as a society could very well be stepping into the realm this movie portrays; that we're only a step or two from bloodthirsty savages. If certain laws had loopholes, and a cable network wanted to air a show like this, it's a pretty sure bet that it would be a hit. We're not talking about a world in this film that is THAT fictional.","user":"SteverB","rank":[16,26]}]