[{"title":"Jared Leto delivers a powerful performance","rating":9,"date":"20 March 2018","review":"This is an awesome movie! Jared Leto delivers, great acting and beautiful cinematography. TBH there are few actors who could have delivered such impact without a ton dialogue. The story is told in details and imagery. The movie draws you in and builds a world and atmosphere through artfully delivered scenes and visuals, from the quietly and brutally violent scenes you'd expect from a movie about the yakuza, to moody night scenes and quiet conversations between brothers having a drink, to a tatoo artist artfully working on her craft. Words are used sparingly, but they have more impact that way.<br><br>At a time when films are so often overdone with spectacle, this movie was unexpectedly quiet and refreshing... The pace may be a little slow compared to alot of the ADHD generation stuff out these days, but it is artfully crafted - in much the way Blade Runner 2046 quietly creates an atmosphere and story in a fururistic cyberpunk world, this movie builds a world around the Yakuza in1950s Japan... These are great under appreciated movies that build a story through visuals and well crafted moments more than through a ton of unnecessary dialogue...","user":"szearc","rank":[68,82]},{"title":"Ignore critics and watch this movie","rating":8,"date":"10 March 2018","review":"The critics are once again wrong. This is a good yakuza movie although there are better movies but I enjoyed this movie. It is slow going, building up characters. The climax and ending are good. Jared Leto is great in this movie, playing the silent but dangerous American who gets involved with the Yakuza. Leto's character is mysterious, maybe too mysterious. It would have been nice to understand his motivation and background. There is a small caveat to his former life but it is so small that it does not answer any questions except that's Leto's character is brutal. I didn't think this was the white savior type of movie like The Last Samurai. Please watch and support movies like this, movies that take a chance.","user":"lilydavis-46130","rank":[149,190]},{"title":"Slammed by the critics, loved by us","rating":8,"date":"21 March 2018","review":"The Outsider (Gaijin), starring Jared Leto, is the latest addition to those Netflix Originals that was slammed by most of the critics and yet turned out to be an enjoyable watch for me. This Netflix Original tries to experiment with the less talk and more acting type of storytelling which is not often seen in the genre of crime thrillers. For an out and out Jared Leto movie, The Outsider is more than 70% Japanese.<br><br>The movie follows the story of an American soldier imprisoned in post-war Japan who enters the Japanese Mob Family, Yakuza after befriending one of them while in prison. The support cast of Tadanobu Asano, Kippei Shîna and Shioli Kutsuna are amazing throughout but no gaze goes past the intensity of Nick Lowell, portrayed by Jared Leto. The intensity and honestly he brings to his character is beyond words. The story telling style and the exhaustive usage of Japanese in the movie makes it difficult to convert 'The Outsider' into a fast paced thriller that it could have been. <br><br>The way the movie ended was a bit anticlimactic and was open ended, probably with the intention of bringing out a part 2. I would go with the title 'The Insider' for part two though. I would recommend this movie to anybody who is a fan of Jared Leto and likes slow-burn crime drama's. Do not expect any classic dialogues as the dialogues itself are few and far between.","user":"JaikrishnaVS","rank":[69,86]}]