[{"title":"Skip movie, use Google","rating":1,"date":"13 November 2016","review":"The single scene in the movie Jaws where Robert Shaw scares the crap out of Richard Dreyfus as he describes the sinking of the USS Indianapolis and the terrifying shark aftermath, has more truth, terror, realism and great acting than the entire movie USS Indianapolis: Men of Courage. This film's amazing true story was hijacked along the way to make room for fictional back lines of power, love and racial tensions that all fall flat. Anachronisms abound--FNG is from the Vietnam war, the neon sign is not of the period, and Wayne Gretzky wouldn't make his \"miss 100 shots you don't take\" quote for another 50 years. It's like the scriptwriter used Google to write the script but forgot to use Google to fact check it. I wanted to like this movie, to pass along a great history lesson to my son watching with me, but from the first wobbly special effect to when we gave up and went to bed as the wrong shark species showed up, USS Indianapolis: Men of Courage never failed to disappoint. At least we know how it ends and at least there's Google to get it right and Jaws to tell it better.","user":"johnsaltas","rank":[111,130]},{"title":"This movie makes a strong case for reading books instead of watching film.","rating":2,"date":"11 May 2017","review":"The movie just doesn't do service to the real events. If you're really interested in the story just read the Wikipedia page. You'll learn more about the events and it'll save you from wasting 2 hours and ten minutes of your life to this awful movie. <br><br>I always expect that Hollywood will bungle the details in military movies and usually give them a pass for those. There are SOOO many anachronisms and inaccuracies in this movie though. EVERY scene has something wrong with it. The ship itself, the uniforms, the orders given, the weapons, the lingo, even the sharks. It's beyond distracting. The most glaring example is that they the used a battleship to represent a cruiser. You can have a movie like U-571, which is fictional, and they have more accurate depictions of the submarines and even a German destroyer. Mario Van Peebles is like \"hey, the USS Alabama is located in Mobile, let's go film on that.\" \"It's the wrong type of ship though.\" \"It's only a film based on true events, accuracy doesn't matter.\"<br><br>On top of that the writers couldn't have stuffed more cliché, trite military lingo into this movie if they tried. The focus they have on the sharks is weird, and inaccurate. The captains speech made me groan out load. Nicholas cage don't ever do another war movie again! If you've seen Windtalkers you know what I'm talking about. Again, if you really want to know what happened to the USS Indianapolis, take 10 mins and read the Wikipedia or better yet go to the library and find a book about it.","user":"denvergrown303","rank":[51,59]},{"title":"A good story made bad through awful CGI and props.","rating":3,"date":"22 October 2016","review":"I was really interested in this movie but oh boy, what have these people done? This is one of the worst CGI works I have seen in years, they simply destroyed the movie as a whole. The ship appears washed out, never matches the surroundings. Every action scene is CGI'd, in a cheap way. Scenes on the deck, when explosions happen are clearly fireworks!!! I could not believe my eyes. And some scenes are repeated! I never reviewed on IMDb but created an account just to tell others what a bad work this was. I was really interested in the movie but the lousy work that has been done simply could not pass without being noticed. Watch it and see for yourself. What a disappointment!","user":"moreirajf","rank":[91,109]}]