[{"title":"Fun take on a rom com","rating":8,"date":"29 March 2018","review":"I watched this on rainy afternoon expecting a boring cheesy rom com, but I really enjoyed it. Yes, it has a cheesy ending (thank goodness), but it wasn't boring at all. Michael Eklund is great as the new best buddy and the wrestling scenes stopped the film from being too sickly sweet. An enjoyable not too nauseating rom com.","user":"lizzieprince","rank":[3,4]},{"title":"DOWN FOR THE COUNT","rating":7,"date":"29 March 2018","review":"Movies based on the popular entertainment known as professional wrestling have not fared well in translating the sport to the big screen. Movies featuring various members who wrestled in the past do mediocre business and a number of films starring current popular wrestlers have gone straight to DVD. The only serious film on the subject, THE WRESTLER (that starred Mickey Rourke), did well critically but not so much financially. And the one that did well at the box office, NO HOLDS BARRED, came out back in 1989 when star Hulk Hogan was at his peak. Knowing all of this there is little expectations to be expected about any film made about professional wrestling. So when one is released that is entertaining it should always be considered a plus.<br><br>CHOKESLAM tells the story of Corey Swanson (Chris Marquette), a mild mannered deli worker who runs into an old friend from high school named Luke (Michael Eklund) as Luke attempts to hold him up. After the failed attempt as they sit and talk Luke suggests they attend the high school reunion taking place. Corey is unwilling at first since something happened back then to send him on a downward spiral and noting that Luke was always the cool kid everyone liked. When Luke tells him that Sheena DeWilde (Amanda Crew) will be there, Corey shuts down the deli and they head out.<br><br>It turns out that Corey and Sheena were friends and possibly a couple while in high school. Her dream was always to become a professional wrestler and during graduation the entire school was cheering her on to achieve her dream. But as she stood on the stage saying farewell Corey approached and proposed to her only to be turned down. Sheena leaves and Corey becomes \"that\" guy.<br><br>But Sheena's career didn't take off as planned. She did well but a bout with alcohol abuse and some run ins with the law left her career tanking. She's become more well known for her bouts with arresting officers and her time on a reality show than her time in wrestling, something that comes up at the reunion when a collection of her worst moments is shared on screen.<br><br>Against the better wishes of his mother who he still lives with, Corey approaches Sheena and offers her words of encouragement. But all hopes of reuniting seem dashed to the curb when her manager and potential boyfriend Tab (Niall Matter) steps in. Corey overhears Sheena saying she wants to retire and in an attempt to help her plans a retirement match and the gym in town where she began it all. Owned by Patrick (pro-wrestler Mick Foley) Corey sets things in motion. But Luke, in trying to help, plants posters all over town before he has a chance to discuss it with Sheena.<br><br>The event goes on, Tab steps in taking all the credit and Corey is left still pining for the woman who got away. The two do get a chance to spend some time together reconnect as friends if not romantically. But there are forces at work that will offer yet another chance for Corey. More is revealed about what really did happen in his past that will alter the course the story seems headed in at first. And a final moment of heroism will give him one last opportunity to make his dreams come true.<br><br>Let's start by saying up front this is not a major studio production here. There is no mega-budget on hand to either bring on top notch actors or the highest production values possible. And yet a the meager budget on hand here is used to full effect in making a romantic comedy that presents plenty of light laughs and a compelling story. The stars may not be mega stars but each and every one displays the talent it takes to reach that levels offering believable characters in an unbelievable story. Marquette and the slightly nebbish Corey is endearing in the role and Crew offers an attractive sought after dream for his character while being able to carry off the physicality that the role requires.<br><br>The movie doesn't do what a vast number of movies based in the world of wrestling choose to do which is paint this picture of the glitz and glamour, bright lights and large contracts or as a world where only the seediest of characters can be found stabbing one another in the back both figuratively and literally. Instead it takes a simple story of romantic affection and lost dreams and places them into the middle of the ring with the surrounding story being wrestling. It melds the two worlds together effectively and the end result is a movie that's both touching and fun to watch.<br><br>You won't find major belly laughs in this film and you also won't see some past starts of wrestling at the center of the story. They're there and they help move things along but not the focus. They lend some credibility to the film but are window dressing. As a fan of Foley it was nice to see him here. But the end result was a film that was more touching than expected and more fun than one would expect.","user":"kirbylee70-599-526179","rank":[2,3]},{"title":"Pleasantly Surprised","rating":9,"date":"20 April 2017","review":"My kids and I were fortunate to be involved as extras for a few of the scenes that took place at the wrestling stadium. We knew it wasn't going to be a big budget movie so honestly didn't know what to expect with regards to how Chokeslam would turn out. We were very excited to be at its premiere showing in Regina and can honestly report we really enjoyed the film! The principal acting is fantastic and the story line is solid. Of course, we loved recognizing filming locations and some familiar faces as well. We would highly recommend it to anyone, especially if you are a wrestling fan, but that is not even a necessity. Looking forward to seeing it again!","user":"jdbrown-00735","rank":[14,43]}]