[{"title":"So THIS is Shakespeare..........ahh","rating":10,"date":"14 September 2012","review":"Well Joss, you have done something no one else has ever accomplished....got me to watch a Shakespeare film. And all I can say is what a treat! For years, I have read about your Shakespeare get togethers at your home and it is nice to see an extension of that on the screen. When I first read that you had filmed this at your home and in only 12 days, I thought it would be unpolished and only available online or via DVD purchase. It appears I was wrong on both counts. This is a great production for anyone that knows your work and the cast you have worked with so many times before. If they do not know your work and see this because it is Shakespeare, I don't believe anyone will leave the theatre disappointed. Congratulations also regarding North American distribution rights being sold at TIFF. <br><br>Thanks again on an excellent bit of entertainment and congratulations to you and your amazing cast and crew!","user":"triggergotstuffed","rank":[116,163]},{"title":"Charming","rating":8,"date":"30 June 2013","review":"This is such a great adaptation. The actors speak their lines with clarity and emotion. The cinematography is great, and the movie is in turns very funny and tragic. A lot will be written about how Hero would never simply die because she was accused of 'not being a virgin', well she didn't. For once when I was watching it I got a sense of what was driving Claudio, his sense of betrayal and hurt. What he did was reprehensible but you could understand that he did have what he thought was good reasons. And for once I got a sense of real threat from Benedict's challenge. Amy Acker and Alexis Denisof made a delightful Beatrice and Benedict. You could feel the attraction there and you knew why Don Redro had such an easy time of it convincing his fellow conspirators to get them together.<br><br>What really impressed me about this film is how obvious it is that the cast is having a good time. The acting seems to be effortless and it is all spot on, and Clark Gregg/Nathan Fillion/Reed Diamond are hilariously funny. I think this is how Shakespeare should be done, as simply great entertainment. When you have that, you have the complexities laid out before you and like Claudio's anger you can see the reasons for the actions of the characters plainly.<br><br>'Much Ado About Nothing' has been very well served by Wheedon and his company of players, such a joy and that can be so rare in films nowadays.","user":"summeriris","rank":[49,68]},{"title":"Much Ado, Much Ado, Wherefore Art Thou Much Ado?","rating":10,"date":"8 September 2012","review":"I have to admit, part of me considered doing this entire review in Shakespearean English for added effect. It sounded like a good idea at the time, but there's a reason why Shakespeare is considered by many to be the greatest wordsmith of all time. He is the most human, human that there is and perhaps that there ever will be and quite frankly as a writer I will never measure up. So I figured I would save myself the incredible embarrassment and do a more traditional review, and I suspect by the end of this review I will be glad that I did.<br><br>Anyone who has read my review of The Avengers knows that I am not a die-hard Joss Whedon fan. He's not always perfect and what he does may not always work. However when he does get a chance to do things well there are very few who can measure up in today's world of film. Shakespeare on the other hand has no equal when it comes to the written word (or spoken word, as his plays would most often be performed live in front of an audience). There's a reason why some of the biggest actors of note have a Shakespearean theatre background. If you can master Shakespeare, assuming such a thing is even possible in the first place, you can master just about anything that the world of art can throw at you. That doesn't always mean that you'll make the best films or you'll choose the best parts but at the very least you know what it is that you're doing when you get one.<br><br>To put the words of Shakespeare into the hands of a filmmaker like Joss Whedon, a man who regularly invites his actor friends over to his house to act out scenes from The Bard's work, makes the possibilities endless. Speaking of his house, for those that aren't aware the film was entirely shot in and around his own house over a 12 day period during a break from his filming of The Avengers. That more than anything very much concerned me, how good could a film like that be given those extreme constraints? It doesn't matter how good you are as a filmmaker, rushed is rushed and unless you are extremely careful it can come off that way. In all honesty I was very nervous going into that theatre, wondering if I was in for another heap of disappointment.<br><br>I could NOT have been more wrong. With Joss Whedon at the helm and a host of actors any semi-fan of his previous work would recognize in a heartbeat, Shakespeare comes alive in a way that simply has not been seen since The Bard himself was walking around. There have been many adaptations of Shakespeare's work in the last 300 years since then, and even more since the advent of film and television. Few can hold a candle to the film I just witnessed.<br><br>Shakespeare had a subtlety of purpose in his words and a thoughtfulness with which he moved from comedy to drama to intrigue and deception. Using The Bard's original words but setting it in a somewhat modern time with cell phones and the internet, Joss Whedon puts it all right there on the screen for you to watch, and laugh, and cry at with equal measure.<br><br>Each of the actors involved in this film are so perfectly suited for the roles which they play that they jump right off the screen at you. He plays the actors off the long time fans like nobody's business. Anyone who has seen all or part of his other works will love the fact that he put the characters in the roles they have in the film and I suspect the die-hard fans will feel incredibly vindicated in a number of ways, although because it's Shakespeare you don't have to be a fan of Joss' work to understand the chemistry between them.<br><br>And then, Nathan Fillion happened.<br><br>None of these actors are better suited for their roles then Nathan Fillion as Dogberry. Every moment that man is on screen you can't help but smile. Every time his character opens his mouth and speaks you're forced to laugh. No matter how many times Tom Lenk as his partner Verges threatens to steal the scene from Nathan, and he very nearly does throughout the film, Nathan slaps him down with another fantastic moment... metaphorically speaking of course.<br><br>The title I used for this review is a reference to a sense of longing which I feel after having seen this film, much like the character I am paraphrasing, a longing for the fact that I can't go somewhere and watch this film right away again. It's been a long time since I have had that feeling about a Joss Whedon film, or any film for that matter, and it's great to know what that's like again.<br><br>Thank you Joss for a masterpiece of film that as far as I am concerned should be taught in schools as an introduction to Shakespeare. Once a year Joss should take some time out of his schedule to adapt one of Shakespeare's plays and premiere it somewhere (hopefully at TIFF again) for everyone to see.<br><br>It seems only fitting that I leave you with...<br><br>Much Ado, Much Ado, Wherefore Art Thou Much Ado? Everywhere and nowhere... a pox on those who do not see it, a curse on he who speaks ill of it, may the wrath of Joss Whedon and William Shakespeare be visited on those that do both.<br><br>You can read my other reviews I have done at: http://andrew-heard.blogspot.ca/","user":"Forgotten_Conscience_Productions","rank":[64,95]}]