[{"title":"Impressive action sequences let down by almost everything else.","rating":4,"date":"4 January 2016","review":"A Gen Z update to Kathryn Bigelow's 1991 cult classic, this remake is essentially an episode of Fast and Furious in which the vehicular exploits have been replaced with an assortment of extreme sports sequences. Constructed with an alarming amount of real footage and physical stunt work, the numerous action set pieces are rather impressive; a high octane wing-suit gliding scene and the tension-building rock climbing finale topping the list. Yet the impact of these daredevil stunts is wasted on a film that fails on almost every other level. Stemming from Kurt Wimmer's truly awful screenplay, every second not spent traversing a mountainside, soaring through the air or surfing a mammoth wave is cringe worthy and/or yawn inducing. Wimmer's dialogue attempts to be philosophical and Zen-like, but with clichéd stinkers like \"the only law is gravity\" and \"everyone dies, it's just a matter of how\", it's nothing short of unintentionally hilarious. Replacing the eternally cool Patrick Swayze was always going to be tough, however Edgar Ramirez does a solid job as charismatic eco-warrior Bohdi. The same can't be said for low-budget-Chris-Hemsworth hunk Luke Bracey though, who is so wooden as Johnny Utah he makes Keanu Reeves look like Daniel Day Lewis. This modern update boasts a handful of genuinely fantastic action sequences, yet they're not enough to warrant a recommendation in what is otherwise a limp and incoherent thriller.","user":"Troy_Campbell","rank":[124,140]},{"title":"GoPro and Red Bull decide to make a film","rating":6,"date":"15 December 2015","review":"If you like those 3 or 5 minute GoPro or Red Bull videos of people doing extreme sports then you will certainly like most of the movie as a lot of it is exactly that - and to be sure, those moments were pretty cool to watch and very well done. <br><br>Unfortunately, in between all of those moments is a pretty boring plot line with characters that you never really care about.<br><br>If you like mindless action (nothing wrong with that) then you will probably like this movie - although most of the \"action\" is extreme sports, not really guns.<br><br>Apparently I have to write at least ten lines of text, but honestly there isn't much more to say about the movie!","user":"allstarrunner","rank":[160,199]},{"title":"It's almost as though they made a terrible movie on purpose.","rating":3,"date":"3 December 2015","review":"Beware people, this is an early review. Being a member of a media group I caught an early screening at the Amc. I was not required to sign an NDA.<br><br>Point Break is a bafflingly unsolicited remake of the 1991 cult classic of the same name. It is directed by Ericson Core, a good filmmaker who directed the 2006 Invincible, a film which is criminally underrated. When I found out that Point Break was being remade I shuddered in fear, but I when I learned that Core was directing the film, I immediately changed my tune, as I hold Invincible in such high regard, as it truly is an under appreciated film for the ages.<br><br>Point Break 2015 is grotesque. <br><br>I am not inherently adverse to remakes and reboots, and I am not at all a purist, I am perfectly fine with rebooting material and straying from source material if it serves the story well. What had happened here is that the studio has produced a garden variety action movie and slapped a name on it purely for the sake of brand recognition.<br><br>The film exceeds expectations in the sense that this a slickly produced action film with a completely rad soundtrack. The camera work, framing and editing leave everything on the proverbial field. There isn't anything new going on here, but it's produced in a professional manner and the action scenes are handled with extreme care.<br><br>And along comes the story, instead of our group of guys pulling bank jobs to fund adrenaline junkie lifestyles, the action men of 2015 are self aware crusaders, too cool for school, hipsters on a self imposed mission from God. Every character in this film is ball- kickingly annoying. The problem is that not one of the main characters are in possession of a redeemable quality and their motivations are completely nonsensical, they are all essentially unknowingly pseudo intellectuals.<br><br>If this movie had been titles virtually anything else I may have given it a 4 or 5 out of 10, rather than a three, though the unnecessarily and intentionally sanitized PG13 vibe completely disrupts any potential the film may have had in the first place.<br><br>It's not good, it stinks.<br><br>No sir, I don't like it.","user":"Nixon_Carmichael","rank":[232,313]}]