[{"title":"Really Good","rating":9,"date":"9 December 2013","review":"I did not know what to expect when i got to the theatre. And assumed it was going to be a typical chick flick I was going to have to suffer through, however I'm glad to say my assumptions were wrong! Jesse McCormick did an outstanding job in her directing debut. It was indeed a story focusing on the relationship between two women done in a way that was totally accessible to both men and women. I laughed out loud more times than I can count, and the acting was suburb. The movie felt quite real to me and the relationships between the characters felt genuine. Don't let the trailer fool you this is not just another \"girls\" movie. I would recommend it to anyone wanting to kick back and be thoroughly entertained for 87 minutes of great filmmaking!","user":"d-baskette","rank":[10,13]},{"title":"Unfunny and Annoying","rating":3,"date":"20 December 2015","review":"In Los Angeles, the real estate agent Peter (Jon Dore) and his wife, the private teacher Lizzie (Radha Mitchell), have a troubled marriage since they are unable to have a baby of their own and they are facing financial difficulties. They have sessions with the marriage counselor Dr. Grayson (Mimi Kennedy) trying to resolve their issues. Lizzie spends most of her time with her friend Andie (Michelle Monaghan) and her dog Joyce, and gives classes to her only student, the teenager Justin (Andrew Shea). When the brainless Andie has one night stand with a stranger, she gets pregnant and gives-up of an abortion and offers the baby to Lizzie. Peter does not get excited with the idea, but Andie comes to their house to live with the couple. Meanwhile Peter's brother Casey (Michael Weston) leaves the rehabilitation and Peter bring him to live in his house since his brother is fragile and needs family support. With the four adults living together, friction increases among them.<br><br>\"Gus\" is a deceptive unfunny and annoying film. Surprisingly there are good reviews in IMDb. The story is pointless and the characters are awful and uninteresting. Andie is brainless, silly and irresponsible. Lizzie is confused and annoying, and does not give attention to her husband. Peter is a real estate agent that has to swallow his anger with his snobbish client, has many concerns (financial, his brother) and Lizzie presses him to fix the latch of the gate. Casey is absolutely uninteresting and not well developed. And their counselor Dr. Grayson is a moron. In the end, it is a totally unfunny comedy and the viewer is incapable to laugh. My vote is three.<br><br>Title (Brazil): \"De Repente Um Bebê\" (\"Out of the Blue a Baby\")","user":"claudio_carvalho","rank":[7,9]},{"title":"Entertaining","rating":7,"date":"29 December 2013","review":"Firstly let me say that Expecting is most definitely worth watching. It looks a little bit like a midday TV movie in some respects, but do not be fooled, this has some pretty raunchy dialogue. Raunchy and very entertaining, mostly fairly dramatic but occasionally hilarious.<br><br>The four leads are very well played and their characters are all the more interesting by being flawed (i.e. normal) and sometimes surprising. Cudos to writer/director Jessie McCormack.<br><br>The film has a few things which don't quite make complete sense, such as why Peter stays away from home even after moving out of Casey's place, but these are minor issues. And generally they serve to progress the plot.<br><br>Special mention to Mimi Kennedy as the counsellor/therapist, she has some very funny lines and the three scenes with her are highlights (particularly if you have ever been to a counsellor - they are not this funny), and also to Joyce the dog. Other supporting roles are well handled and the side stories are good, specially the prospective house buyer (the character listed as \"Douchebag\").<br><br>I look forward to seeing more of Jessie McCormack's work, and can commend this movie to you as one to watch.","user":"cliff314","rank":[3,3]}]