[{"title":"Good low budget Brit flick","rating":7,"date":"30 August 2012","review":"OK if you want a mega budget action film, big names, big affects....well then this is not for you. Its always hard to rate a low budget film as most have a bigger version out there (not always better mind) its hard to see past the poor locals or affects, long story short they look cheap. So we have Hit-man who relives his life, flash backs and the like, all that he has done told through his eyes. Acting wise Luke Goss is good, cold and cool, and the other cast.....well a few are good and a few bad (it tends to be accents that let actors down) The action is good at times, again the low budget keeps it to mainly gun/hand fights, both of which are not bad, its not flashy but it feels a little bit more real to life. The story is what it is, been there seen that, but it moves along well. The look of the film is lower budget.....but at times it looks very well shot. One thing that stood out for me was the soundtrack, simple and at times haunting, much better than most films of this type. I know I keep saying budget budget budget, but its what you have to think of when you look at these films, for me this is a good solid film for the budget, it makes me wonder just what Perry Bhandal(director, first film) could do if he was to get a bigger....OK last time BUDGET. I hope some studio has faith in Perry Bhandal and gives him more room to create.","user":"moby1974","rank":[113,126]},{"title":"Raw and Enjoyable Watch","rating":8,"date":"2 September 2012","review":"The movie delivered in parts and mainly in the parts that matter. Generally the acting across the film showed some good performances and there were enough of these to hold the film together. For me it distances itself from other films in the 'hitman' space by not trying to masquerade as something it not. As with many low budget films it could be enhanced with investment time and resources, but we truly need these types of films within the industry. In fact, the challenge of not having the capital forces those involved to focus on the basics. This film delivers with a refreshing attempt to portray its characters and deal with a fast moving complex plot. The director has shown potential for delivering raw and hard hitting material. I'd like to say the film rocks, without making references to those who may have had alternative careers in the past. Seriously, a good film well made, with everything in place to make this an enjoyable watch.","user":"knarf00785","rank":[86,98]},{"title":"Must See Thriller","rating":9,"date":"4 September 2012","review":"This is by far the best British made thriller I have seen in a long time, the story is gritty, intense and compelling. Although the film was produced on a low budget, this for me enhanced the authenticity of the film and surpasses many other high budget thrillers in my opinion!<br><br>Luke Goss plays the lead character Viktor the Hit-man, Luke displays his raw talent throughout and his portrayal of an assassin is most compelling. <br><br>Perry Bhandal has done an fantastic job creating this film. I am truly amazed to hear that this was his first feature length film and I for one can't wait to see his next film!","user":"flyer69","rank":[78,89]}]