[{"title":"Run of the mill, but enjoyable","rating":6,"date":"30 April 2016","review":"Fairly run of the mill thriller. A woman moves to a remote Scottish island and stumbles onto a buried body. And so the 'mystery' begins....<br><br>Nothing special here but still enjoyable. Overall the story is quite standard and predictable. Even the twists and turns can be seen a mile away. Don't expect to be wowed or anything.<br><br>The only thing that lifts this movie in to something worth seeing is the lead actress (Radha Mitchell). Every time Radha was on screen she stole the show in this otherwise bland experience. Her convincing performance makes this movie. <br><br>Overall a good movie for a rainy day. Just don't expect Oscar material.","user":"Bohemian81","rank":[25,31]},{"title":"Worth to see it","rating":7,"date":"30 April 2016","review":"I'm not really a fan of thriller movies in which legends and cults are used for a plot. Because most are quite predictable and so it is Sacrifice. Thus, after reading a storyline at IMDb, I kinda knew what to expect.<br><br>I admit, main reason for watching this movie anyway, was Radha Mitchell. I just think, over the years, she's getting better and better. I can't judge her acting, but one is for sure: she leaves a mark in a movie.<br><br>So, even nothing really surprised me during watching Sacrifice, it got my attention all the time -it's something that makes a good movie in my eyes.<br><br>Thus, if you like such genre, I recommend seeing this movie. I give it 7 stars.","user":"BogdanH","rank":[30,38]},{"title":"Quite good!","rating":8,"date":"18 July 2016","review":"First of all, I don't know why the notes / ratings here are so low - five is really so - so and this film is much better.<br><br>I did not really read the storyline of the film except that the woman is moving from New York to S Islands. So, that was what I knew and the rest of the film was interesting to me. It was rather on good pace. Not slow or too rushed. The acting was believable. The setting is good. The story is interesting and has some minor twists which are good. It keeps you guessing. I can not say that anything was predictable as many wrote. <br><br>I liked the movie. It was not really great and that blew me away, but for what it is - I give it eight! <br><br>Don't know whether because it is British, but the film kinda reminded me of those crime series from England my mother watches :) I don't know their names, but... somehow reminded me of that - and a bit of some Agatha Cristie movies.","user":"fil-nik09","rank":[21,28]}]