[{"title":"Well done Korean style gangster movie","rating":8,"date":"28 October 2012","review":"First, forgive me for sounding redundant, but in my opinion, Korean movies nowadays has surpassed Hollywood movies in term of storyline. I just can't stand how nowadays CGI has become kind of plague in almost every major movies of Hollywood with thin storyline. Not that CGI is a bad thing really but it just kinda hurt to see how decent Hollywood movies without CGI or dirty teen humor are failing in today's box office.<br><br>And although it's not a Hollywood produced, but watching 'Nameless Gangster' is like a remedy to bring back those old sweet experiences when movies are all but the lavish computer generated images. Loyalty, deception, greed, arrogance, corruption, integrity, well it just hold too much elements in storytelling of being an epic gangster movie with some comical situation which wouldn't hurt nobody. You won't find bullets flying or machetes swinging but you'll find a compelling story of how a minor custom officer build up his career through the top of Busan underground society and the downfall later on.<br><br>While it's not fair to compare Nameless Gangster head to head with classic Scorsese's picture like Goodfellas, but one can't help but to notice the similarity, and indeed both movies did build the same tense of depicting the long shot career of an underground character to build both our sympathy and repulsion. Choi Min Sik is a real versatile Korean actor, he has done a stretch range of convincing acting from a vicious protagonist in 'Oldboy' to a brutal serial killer in 'I Saw the Devil', and here he scored once again to add more depth to the movie with Ha Jung Woo putting the equal class of performance. Just great.<br><br>So give it a try if you're looking for a well packed story of a gangland world, but in Korean style if not to say in Eastern style, mind you! <br><br>It's a shame this movie didn't get enough attention as it should be...","user":"Ramuna","rank":[52,57]},{"title":"Kudos!!! real powerful acting, roller-coaster of emotions and astonishing visuals!","rating":10,"date":"22 November 2012","review":"This one is my first review, the only reason is that there is not much attention on this movie.<br><br>Namless Gangster, as usual, Min-sik Choi is filled with passion, and your acceptance to his personality in this movies isn't any different from Oldboy, and I Saw The Devil, you can't just stop love to despise him and still, feel sorry for him, this is a hell of a role and he just took it to the maximum, loved every second of it.<br><br>Jung-woo Ha, on the other hand, nailed it for me, the progress and development of this character through the movie is simply amazing, I always admired this guy, and after this one he just made it so clear, that he can just be as catchy as any other superstar actor in the universe, with his \"Gangster\" mood, this was simply incredible.<br><br>The movie, is a Korean Gangster flick as you guys call it here, still I find it underrated, but maybe due to the fact that it is considered a new movie and still needs time, the atmosphere, the progress, the conflicts in interest, and the personal feelings, they all come in a way that will keep you through a roller-coaster of emotions! Loved it and I recommend this one!","user":"TheGipsy","rank":[25,31]},{"title":"Excellent movie about loyalty and betrayal","rating":10,"date":"13 February 2012","review":"\"Nameless Gangster\" depicts the clashes in the Busan underworld when the government declares its war against crime. Former public officer, Choi Ik-Hyun (Choi Min-Sik) and crime boss Choi Hyung-Bae (Ha Jung-Woo) sit in the center of the maelstrom that sweeps the city. In 1982, Choi Ik-Hyun works as a customs officer at the Busan Port. Choi Ik-Hyun and 3 other officers takes bribes, which leads to an internal investigation. The head customs officer has dinner with the 4 men under investigation and asks them point blank for one person to become the fall guy. Choi Ik-Hyun is chosen as the fall guy by virtue of having the least amount of dependents in his family. A few nights later, Choi Ik-Hyun works the nightshift at the Busan Port. He spots two men breaking into a warehouse through the CCTV system. When Choi Ik-Hyun confronts the two men, a physical struggle ensues with the two men eventually fleeing the crime scene. After the two men escape, Choi Ik-Hyun and a colleague go into the warehouse to investigate. They discover massive amounts of heroin packed inside of containers. Choi Ik-Hyun then offers to his colleague that if they sell the heroin, Choi Ik-Hyun will retire from the department and become the fall guy for the bribe taking investigation. Meanwhile, his colleague knows crime boss Choi Hyung-Bae. The colleague tells Choi Ik-Hyun that Choi Hyung-Bae has connections with the Japanese yakuza and can become the facilitator to sell the heroin. The three men then have a meeting at a remote house. Choi Ik-Hyun notices that crime boss Choi Hyung-Bae shares the same family name. The men discuss their respective cuts from the distribution of the heroin. After the deal is agreed upon by all sides, Choi Ik- Hyun informs crime boss Choi Hyung-Bae that they are distant relatives and he knows his father. Due, to the informal manner in which Choi Ik-Hyun addresses crime boss Choi Hyung-Bae, Choi Hyung-Bae's henchman beats Choi Ik-Hyun savagely. They are partners, but Choi Ik-Hyun isn't held with high regard yet. The next day, crime boss Choi Hyung-Bae goes to see his father at his home and finds his father drinking with Choi Ik-Hyun. His father introduces Choi Ik-Hyun to his son and tells his son to bow down to his distant uncle. The two men then begin their partnership in earnest. Choi Ik-Hyun, with his uncanny ability to gain favors from those around him, and crime boss Choi Hyung-Bae, with his physical prowess as the head of a feared criminal organization, are set to take over the Busan underworld, but will it last?","user":"jt_ktwn1","rank":[24,38]}]