[{"title":"Compelling awkwardness","rating":7,"date":"19 August 2014","review":"I recorded this not knowing what it was about, then set down to watch it 3 months later. As the movie progressed, clearly slower than most action movies, my curiosity and expectation turned into a growing sense of awkwardness as the scenes unfolded. A young woman unaware of - or grappling with her own sexuality becomes the focus of male urges in forbidden, fleeting or equally desperate desires. The location of desolate isolation intensifies the storyline of her yearning to break free from her roadside, family-tied prison-without-walls young life, and the pace becomes irrelevant or perhaps magnetizing. Genuine tension fills the air with each customer visit with growing concern of the outcome. This movie is a triumph in awkwardness. Well done Director.","user":"tombsoft","rank":[12,14]},{"title":"A character study in open remoteness","rating":23,"date":"23 March 2013","review":"A lonely existence in an isolated spot, looking after an introverted epileptic father.<br><br>In spite of the minimalistic tone both in terms of story, scenery and characters a good job has been done in terms of narrating the story of a father and a daughter in this seemingly isolated existence. What would have probably been intolerable for most, these two souls do not seem to mind, nor looking for a change in their situation. They have a close bond that surpasses everything and ties them together and to that place.<br><br>The raggedly beautiful backdrop of the windy Scottish Highlands adds a pleasant variance to the ambiance of this story.<br><br>A great thing about \"Shell\" is that the girl in the epicentre despite the remoteness in which she leaves she is popular among clients, some of whom openly express their feelings but it does not change her nor makes her full of herself. She always remains the girl at the gas station.<br><br>A let down is the prevailing sense of misery that seems to be the norm in most of modern British cinema.<br><br>Despite its contained nature, this is a careful and well exposed character study.","user":"cinematic_aficionado","rank":[31,44]},{"title":"Great, slow moving film, but worth","rating":5,"date":"5 August 2014","review":"I had not heard of this film before but watched it last night and found that although it was on late, I could not take my eyes off the screen. The film is slow moving, but the acting draws you in - it is not an action thriller,so don't expect much dialogue or excitement. The characters move around each other with ease and there is a pathos and understanding between the father and daughter where you root for them to find some happiness in their dreary, bleak lives, even if it is with each other. Taboo subject, touched on with delicacy and great acting. It is almost like a French film where the words are few, the acting looks easy as if they are not acting, but the result is mesmerising and very watchable for the audience. You do feel for the couple and for their circumstances, but looking around the countryside, you can see that it reflects their empty lives.","user":"soraya_raza","rank":[12,15]}]