[{"title":"A wasted opportunity","rating":2,"date":"30 January 2015","review":"We had recently seen, and enjoyed, \"Appropriate Behavior\", a movie also featuring the Persian community in the USA, so we thought we would give Shirin a look. The one star review from Dr Farhad Javidi was scathing, but I thought maybe he was just being too critical as you can be with movies purporting to involve your own culture. Other reviews were seriously glowing. And we enjoy rom-coms, so let's go! <br><br>Well let me say, having just re-read Dr Javidi's review, that he was spot on. This is not a good movie. The script is poor, even inane. The titular Shirin is certainly attractive, highly educated and a capable writer, but inexplicably stupid. The apparently difficult, reclusive and cantankerous author Shirin goes to interview is warm generous and welcoming. Yes, we learn why she is not what we think but it is ridiculous. Shirin virtually moves in for several days (?) and they talk like old friends.<br><br>The editing is strange too - jumping from one thing to another with scenes that are disconnected and too short. There is no proper logic to the narrative, and even the most willing suspension of disbelief will not convince you that the story has any legitimacy at all. The \"romantic\" walking and kissing scenes against beautiful backdrops and with sickly sweet music would not be out of place in Bold and Beautiful. Good grief!<br><br>On the plus side (and hence 2 stars) the northern California coastline is spectacular, and some of the actors are half decent even as they deliver terribly under developed dialogue.<br><br>This is very low grade stuff - Dr Javidi, I am sorry I ever doubted you.","user":"cliff314","rank":[4,5]},{"title":"A chick flick w/ a spin","rating":9,"date":"12 May 2014","review":"Despite my lack of love for chick flicks, and that is coming from a woman, I really enjoyed this film. Yes it is a chick flick but it shows life learning experiences and it's not your normal cliché COMPLETE happy ending. Putting two completely different cultures together is what made it interesting as well. There's so much to learn from Persian culture and seeing an American in a Persian setting can be comical. The actors were amazing. From Nazanin Boniadi to Riley Smith and Maz Jobrani who brings even more humor to the table along side Max Amini. They both did a good job of making their characters shine and make you laugh in almost every scene they are in. You can tell that they all worked together to bring the script to life. Overall, I found the storyline intriguing and the settings from northern California breath taking as well. I think that the film did a good job of keeping me drawn in like a good film should.","user":"rockabillyvamp","rank":[5,7]},{"title":"A disaster in Persian cinema :(","rating":1,"date":"25 March 2014","review":"With a cast that includes Maz Jobrani, Max Amini, Marshall Manesh and Anita Khalatbari, I was expecting a Persian comedy, but the film \"Shirin in Love\" is, in fact, a romantic movie - a \"chick flick\" even. While the film's location, costumes and props were fine, its writing, directing and editing were terrible. The porno-style filming, soap opera-style acting, nonsensical still shots, disconnected scenes, stereotypical characters, weak plot and cheap humor are just a few of the film's shortcomings. The film's one bright spot is Nazanin Boniadi, who portrays Shirin. Even in a bad film you can spot a shining star. She certainly has a bright future. I don't understand why she decided to appear in this film, given her well-established career with feature roles in \"Homeland,\" \"Grey's Anatomy,\" and \"How I Met Your Mother.\" The film did little to enhance the reputations of Maz Jobrani and Max Amini, and may even have hurt them.","user":"javidi-245-765207","rank":[9,18]}]