[{"title":"A light look at the retirement of a hit man. Just OK","rating":5,"date":"5 March 2013","review":"Tim Roth plays a hit man on his final job before his daughter gets married. Adam (Jack O'Connell) is an annoying 19 year old who accidentally discovers that his step father is more depraved than he thought. After crashing his step father's Mercedes, he is in his debt and he is given a job as a driver to pay him back. His contact is Roy (Tim Roth) and they go on Roy's last hit together. Wanting to be part of the gangster culture, Adam asks to be more than just a driver and things start to go wrong, especially when 'the girl' gets involved.<br><br>The film is quite light hearted, considering its content and, at times is comical. Both lead actors play their parts quite well and create an enjoyable partnership. The storyline is a little week and everything that can go wrong, does goes wrong. I found myself rooting for Adam in the end and, despite being a professional killer, Roth's character is quite appealing.<br><br>Overall, a mediocre film that I will not watch again but it was reasonably enjoyable, light hearted and funny in places.","user":"kenyajon","rank":[28,33]},{"title":"Saved by Tim Roth","rating":7,"date":"20 October 2014","review":"The Liability is a British film which doesn't really have a budget. Its script is only so-so and the only real star name attached to it is Tim Roth. Luckily, that does seem to be enough to pull it off.<br><br>Jack O'Connell plays a young man who gets in trouble with his - slightly dodgy - stepfather and, as a punishment, is roped into the 'family business' and asked to do something equally dodgy, which involves driving hit-man Tim Roth to his next job.<br><br>It's a road movie which could be pretty average if it wasn't for Tim Roth's performance. The comedy doesn't always work. The performances can be a bit stilted, yet Tim seems to carry the whole thing on his own and makes it worth watching.<br><br>Special mention to the location scout who has found some truly outstanding filming locations around the north of England to set some of the action in.<br><br>If you're a fan of low budget British gangster movies (or simply of Tim Roth) then you should give this a go. The ending seems to divide audiences, but the film is enjoyable enough for you to ignore that minor point if it isn't to your taste.","user":"bowmanblue","rank":[8,8]},{"title":"A film I'd like to make myself","rating":8,"date":"21 November 2013","review":"A little indie gem this from Britain, with a good Tim Roth in the center as a worn out disillusioned hit-man, but it's Peter Mullan which steals the show, with a delightfully nasty big shot criminal.<br><br>There's many reasons to like this, if you don't expect this to be an action flick. It's wrongfully labeled so, but this is a a crime drama, or really a road movie, Coen/Tarantino style. 1) Unpredictable mysterious plot (gives a good ride) 2) Great cool acting (stung cool play by all, but the naive Liability) 3) Extinguished filming (lots if great angles and smart details) 4) Delightful score (sophisticated, punky and dirty, would search out several songs) 5) Classic cars (loved the use and filming of the Granada Ghia) And there's more to it. I found myself feeling it as a cozy road movie which we expect to go wrong for some. Lovely lingering excitement, taking you to the next stop on the route.<br><br>If you like one of them smart little films with no extra fuzz, just great talent, this is it!","user":"OJT","rank":[15,18]}]