[{"title":"Could have been so much better than the snooze fest it was.","rating":5,"date":"9 June 2015","review":"The movie actually had a decent plot to it. It starts with Scott Eastwood as a marine about to be executed and then it tells his story of how he got into this mess through a flashback, as a surfer who gets into trouble.<br><br>Dawn Patrol had good twist and turns to it and great potential for drama, but the dialog in the film was horrible, and i'm really surprise by how bad the acting was to this dialog.<br><br>The whole thing reminds me of movies like the Crying Game and the Sixth Sense, were the movie has a surprise twist at the end, and this one was cut together well enough to get an eyebrow raised, but the biggest difference between those movies and Dawn Patrol, is that those movies are worth sitting through.<br><br>Well cheer up, Scott Eastwood, I don't think your daddy did anything worth seeing until his, thirties anyway. This movie is just too dull and uninteresting to put anytime into it.","user":"subxerogravity","rank":[8,10]},{"title":"Huge plot issue","rating":4,"date":"5 June 2015","review":"The entire story rests on the fact that the younger brother was killed and he revenges his killing... problem is they wrote the younger brother as a complete pieces jerk that I for one was happy to see killed. They made the whole family come across as a bunch of pathetic, obnoxious losers. I got the impression that the writers had absolutely NO IDEA how to connect with an audience. Out of curiosity, I'm going to have to look up the writers to see if they've actually done anything of merit.<br><br>End result, about 10 minutes into the movie I lost ALL interest in the story. Paid for the movie and didn't even bother to watch rest of it. Last time I did this was years ago.","user":"dlancaster-785-257239","rank":[9,12]},{"title":"Total waste of time","rating":1,"date":"1 November 2014","review":"The movie was really bad, the acting was horrible and the story, well , it sucked. I wouldn't recommend anyone to see this movie.I'm honestly surprised it has a 6,4 rating, saying that, it's 19 users that have rated it. Nothing felt real between the actors, the lines where at times useless, as in I think the writers needed to fill in something so they just wrote whatever into the script. After the first 10 minutes I knew it was not going to be a good movie. <br><br>It's a bit of a shame because it could have been a good movie, IF it had been written with better dialogs and a better cast. So, no I would recommend that you choose another movie to see. There are better movies to spend time watching then this one.","user":"MadameMim","rank":[17,27]}]