[{"title":"A heartwarming, brilliant story of a couple's journey into later life!","rating":9,"date":"27 January 2013","review":"I was shocked to see the low rating this film has received here. It is a brilliant flick that left everyone in the packed audience on the verge of tears. The film, based on a true story, is a about a man who sets to building a home that is suitable for his wife with early signs of dementia. An independent sort, he mills his own lumber and builds the home to the exacting standards he learned from his father. He soon runs afoul of the county building inspector. The sterling performance of James Cromwell is one that will echo with you for weeks after viewing. Bujold's disjointed performance perfectly captures the supreme loss of dementia, a silent invader that steals the self. Not in any way smarmy but perhaps suited to an older viewer.","user":"michael-335-141594","rank":[52,54]},{"title":"superb movie made with sensitivity","rating":9,"date":"25 June 2013","review":"what a pleasure it was to view this movie. i picked it as the best of a bad bunch to go and see on a rainy day. what a great and pleasant surprise to sit through such a thoughtful and well made movie. a brilliant script delivered by two great lead actors who were supported by a very strong cast. it is such a long time that i have been moved to tears by a performance and an even longer time that i have found a movie to be totally believable due to the actors work. <br><br>the simple plot was well developed and allowed for some unexpected twists and pleasant surprises along with some intense moments of personal angst.<br><br>well done to the actors and makers of this hidden gem.","user":"cjjay2000","rank":[38,40]},{"title":"A heartwarming story for sure","rating":10,"date":"29 January 2013","review":"I remember reading in the Globe &amp; Mail in the fall of 2010 about the people and events on which the screenplay of STILL was written by Michael McGowan and was delighted to see the story come to the screen less than two years later. It is so refreshing to see an honest film with no gimmicks. Produced with a budget of just $3M, filmed in northern Ontario and New Brunswick, it is a delight. It isn't easy to deal with the topic of dementia but McGowan handles it gracefully, with gentle humour and respect. Geneviève Bujold and James Cromwell give outstanding performances. It is a heartwarming story for sure, and garnered much applause from the audience.","user":"woodward-janet","rank":[38,41]}]