[{"title":"Slow paced, yet authentic...","rating":8,"date":"16 September 2014","review":"I was actually surprised after watching this movie, having firstly noticed the given low ratings.<br><br>Starting with the characters, the difference in the way each one of them feels about the environmental problems is clear and straightforward. While Harmon, being an ex-con, performs his role in a more detached way, Dena, and mainly Josh, possess deep feelings about them. Dena learnt about them and made up her mind supported in what she claims to be scientific facts. Josh appears to have a more romantic and purist approach, despite his paranoid outbreaks and trust problems. This actually helps the viewer to start building an idea about how each one of these characters will react to the approaching outcome.<br><br>OK, it is a slow paced movie, which I don't see as something necessarily bad. Actually, I think it contrasts beautifully with the sentiment of urgency that the problem demands and which they want people to acknowledge. Also, about the kind of numbness in Josh expressions during almost all the scenes, I simply cannot see them as emotionless or empty. I rather think (and felt) that he was the most engagingly involved and disturbed about environmental unbalances, almost in a traumatized way, which I think is reinforced by some plan shots, silent and numbing, taking a few more seconds than we are used to.<br><br>Ultimately, it is a movie about the human condition, about good people, with good reasons, doing wrong things.","user":"El_Dudness","rank":[31,37]},{"title":"Guilt is what you feel before you do something wrong","rating":10,"date":"6 September 2014","review":"Way too many negative reviews of this excellent production of cinematic art! I must speak out and state my opinion of this movie. It has little to do with radical environmentalism, as so many believe. Instead it is a story that deals with the lack of guilt and then the overwhelming feeling of remorse for a wrong committed.<br><br>The plot line is about three idealistic youths who are too immature to realize the consequences of their actions in creating a destructive environmental statement . Director Kelly Reichardt has Jesse Eisenberg as 'Josh', Dakota Fanning as 'Dena', and Peter Sarsgaard as 'Harmon'. Josh, Dena, and Harmon are best described as politically committed environmentalist. We are not given much information on each characters background, we know they are sensitive individuals because they care about the natural process of things around them. The Harmon character is the wild card and the leader of the other two. Harmon has a military background which makes him suspect from the start - if he cared about the environment why would he join the military - which is more about destruction than preservation.<br><br>Their idea to destroy a dam is half baked at best because it is made clear, after the fact, that destroying one dam on the river is futile as there are many dams along the course of the river. When Josh, Dena, and Harmon realize this they are consumed by regret for their foolish action and the fear of being caught. Harmon tells them to communicate in no way. Harmon disappears, Dena becomes a nervous wreck as shown by her case of hives, and Josh becomes paranoid and irrational.<br><br>Night Moves is a study in the human condition. We as individuals seldom consider the far reaching consequences of our hateful actions, and individuals create societies, societies create nations. I believe Kelly Reichardt has made a clear statement on our world today. Just because this story only shows the actions of three people their actions had far reaching consequences on innocent others. The same statement can be made about nations and their actions against other nations. And what is achieved in the end - destruction, death, fear, and paranoia.<br><br>At the end of the movie we see Josh becoming a nonperson and having to look over his shoulder from fear. In the mirror he has no reflection but he can see other people. Who's friend and who's foe?","user":"cekadah","rank":[46,74]},{"title":"Moves","rating":20,"date":"20 April 2014","review":"Okay...I was expecting more. All the movie is about the plan. A clearly stupid and poor plan. We even don't know why they are doing that. We actually don't know anything about the characters because everything is silent and green. And that leads us to a non transparent story, full of holes and doubts. <br><br>Dialogs are nearly abstract, very plain. Eisenberg can't convince us he is kind of a criminal. There's no tension and that makes it more boring.<br><br>Then, the characters change, product of a particular situation (which was patently predictable)and we are expecting the characters to be real human beings, but...they are not.<br><br>And then the movie ends. There's no much more. And...OK.","user":"santiencalidaddeque","rank":[72,134]}]