[{"title":"Diary of a Wimpy Kid: Dog Days - Well Worth the Wait! Perfect Summer Fare!","rating":2,"date":"2 August 2012","review":"Looking to squeeze in some summer fun before heading back to school? Then head to your local movie theater and see \"Diary of a Wimpy Kid: Dog Days.\" Our KIDS FIRST! Film Critic, Julianna No one (age 12) reviews it below: <br><br>This film is the third film in this popular series and is based on the Diary of a Wimpy Kid books, which are written by Jeff Kinney. These books are about the ups and downs of growing up and trying to deal with school, family and relationships. The stories are so well written and relatable, that you can't help but love the books and the movies. This film stars Zachary Gordon, who does a great job once again as the main character Greg Heffley, and Robert Capron, as his lovable friend Rowley Jefferson. This films starts out with Greg and Rowley finishing the school year and planning out their summer vacation. There's only one problem, as usual for Greg, nothing goes as planned. Follow along as Greg and Rowley try to make it through the dog days of summer. <br><br>My favorite character is Greg because he is funny and means well even when he makes mistakes and deep down, he just wants everyone to like him. It is hard choosing one scene as my favorite, because most of the scenes at the country club are absolutely hysterical, but I was able to choose one. That's when Greg's older brother Roderick, played brilliantly by Devon Bostick, tries to fake drowning to the pretty life guard will save him. The problem is, she doesn't even notice him, so an older, hairy man dives into the pool, pulls him out and performs mouth to mouth on him. Roderick's facial expression is priceless and this scene is just so funny, I could not stop laughing. <br><br>Not only is this movie well written and very funny, but it has a really strong cast that help bring to life the Heffley family and make this an enjoyable film that the entire family can relate too and enjoy. The movie also has a great message in it about growing up and learning from your mistakes. <br><br>Overall, I love this fabulous film and urge you to take your family and go see this film today. I rate this film 5 out of 5 stars, as I think this is a film your entire family will love as much as I do. Go see this film, opening in theaters on August 3rd, trust me, you will love it! And remember, a man who makes no mistakes, is a man who hasn't learned anything. <br><br>Reviewed by Julianna No one for KIDS FIRST!","user":"rannynm","rank":[20,24]},{"title":"Wimpy Kid tackles summer in Dog Days","rating":7,"date":"3 August 2012","review":"While The Diary of a Wimpy Kid books were a major hit, the movies never really seemed to hit all that big, but surprisingly have been doing just well enough under the radar to keep the series alive. The latest entry Dog Days brings back all the favorites, combining the third and fourth books in the series, but will it continue to deliver the fun of these characters or will their age slowly start becoming a factor finally close the book on the film series? Diary of a Wimpy Kid: Dog Days follows Greg as he hatches a plan to win the girl of his dreams during the summer, but as usual nothing is as simple as it seems for Greg Heffley. There aren't too many films like this that can entertain the adults just as much as the kids, but the Wimpy Kid series does just that. The stories are pretty simple and light on content, but carry just enough fun to keep everyone entertained. This latest entry works really well having numerous laugh out loud moments. While still not quite as entertaining as the first film in the series it does manage to step things up to entertain more than the last film Roderick Rules. All the original cast return and yes the kids are getting bigger, but thanks to the age they starting making these films, everyone is still believable in the grade they are mean to be in. There are a few characters here and there that just aren't all that well acted, but you somehow can let it go thanks to the fun you get with your leads. Sadly there just aren't enough of fan favorites Fregley and Chirag.<br><br>If you're looking for that fun film to take the family too without having to suffer through another cartoon or weird princess film, then this is a must see. While it helps to see the other films just to know the characters, you can pretty much watch this as a standalone film. Turn off your brain and have some family fun. No word if another film will becoming for this franchise, but there are still two other books to work from, so we can only hope.<br><br>http://www.examiner.com/movie-in-dallas/bobby-blakey","user":"rgblakey","rank":[15,19]},{"title":"Diary of a Wimpy Kid, Dog Days is a Really Fun and Entertaining Movie!","rating":10,"date":"30 July 2012","review":"We saw the \"Diary of a Wimpy Kid, Dog Days movie\" and my husband and I absolutely loved it. The Wimpy Kid movies are John Hughes style movies but focus on Jr. High School instead of High School. Believe me, Jr. High School was much more difficult to survive than high school.<br><br>Jeff Kinney takes his story about a kid (Greg Heffley) trying to grow up and survive middle school, family dynamics, and relationships. This film, like the others, takes these experiences and makes them relatable and hilarious for anyone of any age.<br><br>Although it is apparent that the cast is growing up, (since this is the 3rd movie in the very popular series), I found that it really didn't matter because we relate to the issues and problems Greg is experiencing and not his physical presence. No one said anything about the Harry Potter kids getting older and the same holds for the Diary of a Wimpy Kid. I didn't find myself focused on the kids ages because you get lost in the laughs, and enjoyment of the film as the gags get bigger and funnier in this 3rd installment to the popular movie series. The kids are exactly at the place their supposed to be in real life - 14 years old. For us it added to the \"realness\" of the story and characters portrayed.<br><br>I hope they make more of these films and continue on into High School, as these stories and films are truly honest and bonified entertainment for the whole family. They don't talk or play down to kids, they don't moralize, they don't try to get you to \"see the light\" as other family films do. If you allow yourself to lay back in the theater seat and let go of yourself for 94 minutes, you will be transported back to a time we can all relate to in our lives.<br><br>Zachary Gordon is back, in excellent form, as the main character, Greg Heffley. This is a very complex character from Kinney's books and Zach Gordon deserves a lot of credit for continuing to carry these movies to new heights (no pun intended-see the ride on the Revolation which gets up to 3-4 \"G's\"). It has actually been a lot of fun for our family, following him as he matures in character and life. He is blossoming into a really fine actor with a big future ahead of him. One of the best things about this new movie is the relationship between his character and his father played wonderfully by Steve Zahn. We get to follow a very \"real\" father/son relationship in this film with all their ups and downs and emotional discourse. This is a dose of \"reality\" for anyone and is definitely a must see for any dad who has sons or daughters and participated in the Boy Scouts, Cub Scouts, Indian Guides, Indian Princess, or other father son/daughter activity. Brought back a lot of good memories for us.<br><br>In this combination of the 3rd and 4th book - DWK: The Last Straw, and DWK: Dog Days, the film makes for an enjoyable roller-coaster ride in a comical \"Summer\" setting. The continued trials and tribulations of the main character - Greg Heffley, are made even more hilarious and complicated when Greg 1)fakes a job at a country club to appease his father, 2) goes on vacation with his best friends family, the Jeffersons, 3)tries to further a relationship with a girl- Holly Hills, 4)has to put up with constant aggravation from his older brother Rodrick, and 5) experiences communication and relationship issues with his dad. With all these intertwined story lines, this movie will have you in \"stitches\". The scenes at the country club with his brother Roderick are just plain hilarious and embarrassing fun! Not much ever seems to go well for Greg, even when his best intentions are at stake, which of course, makes for fun movie entertainment. If you like honest, wholesome, non-animated, non-CG (3D) movies, then this ones a hit! For you critical people out there - this movie is not intended to be \"Gone with the Wind\", just good old fashioned film entertainment for the whole family, that will sweep you away from the problems of today for a moment in time. Sisters will relate, brothers will relate, and mom's and dad's will get \"teary eyed\" over the in's and out's of Greg's turbulent and very \"real\" relationship portrayed with his dad.<br><br>If you want to laugh out loud, if you want just great movie entertainment with a connected and wonderful cast, especially the lead character, Zach Gordon, then go see this, must see, movie! You won't be disappointed!","user":"jfischerwork","rank":[20,27]}]