[{"title":"The whole show on DVD.","rating":18,"date":"18 January 2012","review":"Finally a full staging of my favourite musical and the second longest running one in the U.K is here for the first time on DVD. This live production filmed straight from the iconic Royal Albert Hall in London, which was broadcasted to cinemas and theatres around the world and celebrates 25 years of the Andrew Lloyd-Webber musical, is nothing short of a lavish treat for the eyes and ears, with amazing performances and acting from the cast, including all the songs that fans of the show will know and remember.<br><br>The 25th Anniversary production stars the amazingly talented Iranian born Canadian Ramin Karimloo as the Phantom and American Broadway star Sierra Boggess as Christine Daae, with a great supporting performance from Hadley Fraser as Christine's love interest Raoul. Karimloo and Boggess incidentally are no strangers to the characters, having played them previously in the London production of the sequel to this show 'Love Never Dies'. Their chemistry on stage is perfect as are their performances. <br><br>Ramin is terrific as the Phantom and injects emotion and passion into the show playing the phantom as essentially a victim, with a voice that at times can be vengeful and deadly, yet soft and vulnerable at others. His delivery of the 'insolent boy' line near the beginning strikes fear right around the Albert Hall. I would even go as far to say that he is the best Phantom that I've watched so far, having previously experienced others on stage live and unfortunately the terrible 2004 movie version starring Gerard Butler. His acting is great without being over the top, and you really feel for the character. Sierra Bogges is also amazing displaying sensitivity, vulnerability and sexuality all throughout the show. Her performance of 'past of the point no return' being a particular highlight. The two leads work very well together and make the show believable. <br><br>There are also good supporting performances too. Hadley Fraser's Raoul is dynamic and energetic without becoming too irritating and makes quite a good match against the Phantom in the battle for Christine's heart. Wendy Ferguson and Wynne (Go Compare) Evans are very funny as the diva Carlotta and Piangi, the two Italian opera supremos who are the subjects of Phantom's rage and eventually driven to obedience. Equally as funny and memorable are the opera house managers Firmin and Andre, played brilliantly by Barry James and Gareth Snook, who camp it up and provide some additional comedy. <br><br>The staging and scenery is spectacular, with the doomed chandelier hanging above the audience and the on stage sets, especially the bridge leading to the Phantom's lair, featuring prominently. Due to the venue they had to make a very slight change to the chandelier scene at the end of the first part of the show, but it isn't a big deal and still has a great impact in my opinion. <br><br>The show is pretty much identical to that of the theatre version that one may see in London's West End or anywhere else it may be on. Some lines were changed ever so slightly but nothing noticeable or significant. The performances throughout will leave you astounded and definitely not disappointed. In fact there are simply no scenes or performances that can be criticised. If you are a fan of the show you will love this and not be disappointed. <br><br>As in usual 'anniversary style', like the Les Miserables 25th concert, they bring back all the old Phantom's and stars who have performed over the years in various productions. Including Michael Crawford and Sarah Brightman. Andrew Lloyd-Webber also makes a speech about the show and it's legacy. <br><br>So now finally you can watch the show like you were in the theatre itself whenever you want. One advantage this production has over seeing it live is that you get to see all the facial expressions and emotions up close, thereby really getting a feel for the show almost like a movie in some parts (but definitely much better than the actual movie).","user":"ben83","rank":[36,36]},{"title":"Next Best Thing to Actually Being There!","rating":9,"date":"31 December 2011","review":"We all know that the \"Phantom of the Opera\" is by far one of the best known and best loved musicals of the past years. It is quite amazing to learn that this year is already the 25th year of this acclaimed piece of musical theater based on the novel by Gaston Leroux. The beautiful music was by Andrew Lloyd Webber, with most of the lyrics by Charles Hart, and produced by Cameron Macintosh. It debuted in the West End in London in 1986. Phantom is recognized as the highest-grossing entertainment event of all time and the most financially successful theatrical show in history.<br><br>Last week, it was suddenly announced that the special 25th Anniversary performance held at the Royal Albert Hall last October 2-3, 2011 was actually going to be shown in local theaters! I knew that my wife and I had to see it again. This morning, I was surprised to learn that this will be a 3 hour and 41 minute movie. This caused problems in our schedule but we still decided to push through and watch. An opportunity to watch a theater event such as this on the big screen was indeed rare.<br><br>As we entered, we found out the reason for the very long running time. Before the show proper, there was first a short documentary about Phantom by Sir Andrew Lloyd Webber. Here we got to hear how the idea of doing Phantom came about, and meet the original London production crew. This lasted about 15 minutes. After which there were ads announcing the sale of DVDs of this event come March next year. I guess we still have to wait that long to get an original copy of this special. Then there was about another 5 minute pause (as if waiting for the audience to fill up) before the show itself actually began. I see that this film was going to approximate a real theater presentation. Unfortunately, this also included a real 20 minute Intermission after Act 1. The theater (we watched in SM Megamall) actually paused the movie for the whole 20 minutes! So be warned. <br><br>The Phantom was played by Ramin Karimloo, while his ingénue Christine Daae was played by Sierra Boggess. I knew these were the same actors who played these same characters in the short-lived sequel of Phantom called \"Love Never Dies.\" Ms. Boggess was beautiful as Christine channeling both innocence and sensuousness. Her soprano was flawless even in the most challenging and punishing notes in \"Think of Me,\" \"Phantom of the Opera,\" and \"Wishing You Were Somehow Here Again.\" As the Phantom, Mr. Karimloo has got that X-factor that makes the role dangerous yet riveting and sympathetic. His voice can navigate the highs and lows that makes Mr. Lloyd Webber a musical sadist. It can be strong, yet tender and also menacing. His \"Music of the Night\" and \"Point of No Return\" were fantastic!<br><br>The supporting performances were also very strong. Hadley Fraser cuts a dashing figure as Raoul. His featured duet with Christine, \"All I Ask of You,\" was very well sung. Kiera Duffy makes a hilarious Madame Carlotta even as she also hit those unbelievable high notes, in songs like \"Primadonna.\" Liz Robertson makes a very imposing Madame Giry with her severe black gown always in sharp contrast with the very bright colors of the costumes around her. Everything was so expertly staged: the dancing, the costumes, the set pieces, the make-up, the video backgrounds, were all so rich, elaborate and detailed. The camera work and direction was also very effective in conveying the drama, danger and romance of the story.<br><br>After the last scene where Meg Giry holds up the Phantom's mask after he vanishes, there was a very long curtain call. The whole stage was filled with actors and dancers. It was a very emotional moment. However, after the three main characters made their bows, it was not yet over. Sir Andrew himself took center stage and thanked the audience and his crew, present and past. Then he introduced the man who played the first Phantom, Michael Crawford! Finally he brought out his \"Angel of Music\", Ms. Sarah Brightman (who was looking very hefty indeed nowadays). <br><br>The surprise did not end there, Ms. Brightman obliged to sing! Of course, she sang \"Phantom of the Opera.\" I would not say it was her best because her breathing was audible, but she could still hit those killer notes at the end. Another surprise was when it was the Phantom's turn to sing, four actors who played the Phantom before came out on stage to sing with Ms. Brightman. Of the four, I recognized two: Colm Wilkinson (Jean Valjean from Les Miz) and the fantastic Anthony Warlow! The other guy was John Owen Jones (the current Phantom in London). The youngest guy of the four Phantoms, Peter Joback (upcoming Phantom in the 2012 run in London), had a rather thin and nasal pop voice, in sharp contrast with the booming tenors of the other three. Too bad, Michael Crawford did not sing a note. After this, the four ex-Phantoms all took turns to sing \"Music of the Night.\" This was another beautiful rendition of the song. At the end, the present Phantom, Ramin Kaminloo also joined the group. Another curtain call followed, and the event comes to an end.<br><br>This is definitely a must-watch for fans of Phantom, as well as fans of Musical Theater in general. When time comes for the DVD to come out, that should also be a must-own in his DVD collection.","user":"3xHCCH","rank":[32,33]},{"title":"Amazing Phantom Production!","rating":10,"date":"8 August 2012","review":"I nearly bypassed picking up the Phantom of the Opera (POTO) 25th Anniversary DVD because I was unfamiliar with Ramin Karimloo (Phantom) and Sierra Boggess (Christine). So I took a chance and brought the DVD home. What a surprising delight! POTO 25 was filmed before a live audience at the Royal Albert Hall in London. The cameras bring the viewer up close and personal to the happenings on stage.<br><br>Ramin and Sierra had starred in Andrew Lloyd Webber's POTO sequel, Love Never Dies (LND), just before the POTO 25 event. Their chemistry bonding had already been established during LND, so they sizzled on stage during POTO 25. Their voices compliment each other so magnificently, and their faces (especially Sierra's) portray the vast array of emotions during their songs. They are incredible! They make you believe that you are witnessing something very, very, once-in-a-lifetime special, because you are!<br><br>So, I have been transformed from an unfamiliar viewer in the beginning, to a full-fledged obsessive drum beater for Ramin and Sierra in their remarkable POTO 25 performances. Sierra is a true to life Angel of Music; her voice, radiant beauty, emotional energy, and sensational acting talent will mesmerize you. She is such a wonderful inspiration to all those aspiring to be stage actors and singers. Ramin is a powerful Phantom who brilliantly brings to life a lonely, disfigured composer who falls in love with Christine.<br><br>POTO 25 is beautiful acting, singing, costuming, stage setting all rolled up into a full orchestra, mind-blowing experience you should not miss! Crank up the volume and thoroughly enjoy this masterpiece.<br><br>Ramin and Sierra are pure magic together. They have made people (including me) cry during this wonderful production. Sierra's voice and emotional impact can, and probably will, cause shivers to run up and down your spine at times. Yes, she really is this amazing.<br><br>I watch my favorite parts of POTO 25 several times a week. It never fails to lift my spirits and to appreciate the spectacular talent on display whenever I wish. Bravo, Ramin and Sierra!!!!!","user":"phantomoperaphan","rank":[15,16]}]