[{"title":"If you didn't like the first film, why watch the second?","rating":7,"date":"26 January 2014","review":"I'm really puzzled by these reviews. Firstly, we have people saying they hated the first film but this is even worse. Excuse me, but what kind of stupid do you have to be to watch a sequel to a film you hated? Then there's people who complain that the film is for children? But hey, what did you expect? Well, I expected the worst, I never liked the Smurfs and I'm old enough to remember that awful song from the 70s. I've seen the McDonalds toys and I was prepared to hate this. But every Sunday we take our children to see a movie for a pound and this is what was on. I've seen Despicable Me 2, Turbo, Monsters University, Cloudy with Meatballs 2 and the Rise of the Guardians over the last few weeks on the same terms. I enjoyed those in varying degrees, but I wanted to give this one a miss. But it's for the kids, not me, so I went along. And I guess what, I actually enjoyed it.<br><br>There's no point me regurgitating the plot, but highlights for me were Christina Ricci giving a bit of Wednesday to Vexy, the naughty sister Smurf, the one-dimensional pantomime baddie (he's behind you!) and the cat, which amused me if no-one else. The plot is not believable, according to some. Yeah, and you sat though Despicable Me 2 and Cloudy with Meatballs 2? The plot is consistent with the rules set for the movie, just go with it. And if your children like it, what's not to like for you?","user":"kevingrain","rank":[21,26]},{"title":"Part 2 twice as bad as the first - if that's conceivable","rating":2,"date":"31 August 2013","review":"When we last left our intrepid tiny blue friends, they had just . . . oh, why bother explaining the plot of this film's predecessor, \"The Smurfs,\" when it's going to be difficult enough to write about this sequel's ridiculous storyline? And, unless one is either under the age of four or in a drug-induced coma, they are not likely to care an iota about it anyway.<br><br>With Neil Patrick Harris (\"A Very Harold &amp; Kumar 3D Christmas,\" \"How I Met Your Mother\" TV series) sleepwalking through his repeat role of Patrick Winslow and Hank Azaria (\"Lovelace\") as the evil wizard Gargamel - playing it so far over the top he falls off the other side - adults are most likely to simply tag along with their tots only to forget this one by the time they get home.<br><br>Like most sequels, \"The Smurfs 2\" does not live up to the original, which in turn was never something worth living up to in the first place. It does live longer, though, dragging on for nearly 105 minutes (two minutes longer than the first go 'round and a death knell to an animated feature like this one).<br><br>Here, as directed by Raja Gosnell (who has helmed such classics as \"Home Alone 3,\" and \"Beverly Hills Chihuahua\"), the Smurfs are happy and healthy back in their quaint village.<br><br>Happy, except for the group's only female, Smurfette (voice of singer Katy Perry), who's depressed because she thinks everyone forgot her birthday (get used to it, kid). <br><br>Meanwhile, Gargamel — who is now a big-time David Blaine-type illusionist in the world of humans — is hatching a plot wherein he uses his two gray Smurf-like minions, the tomboyish Vexy (voice of Christina Ricci, \"Black Snake Moan\") and the idiotic Hackus (voice of J.B. Smoove, \"Hall Pass\"), to kidnap Smurfette so he can extract her essence, or something like that.<br><br>Unfortunately, once she is missing, Papa Smurf (voice of the late Jonathan Winters, \"The Smurfs,\" but I'd rather remember him from \"It's a Mad Mad Mad Mad World,\" among other better films) along with Grouchy (voice of George Lopez, \"Rio,\" and the guy who played a light bulb in \"Shark Boy and Lavagirl\"), Clumsy (voice of Anton Yelchin, \"Star Trek Into Darkness\") and Vanity (voice of John Oliver, \"The Love Guru\"), locate Patrick and his family to help solve the mystery.<br><br>Turns out that Pat is an uptight parent entertaining equally snobbish couples at his son's excruciatingly unfunny birthday party sequence concerning - of all things hilarious - a small child with a peanut allergy.<br><br>Discovering that Gargamel has a show in Paris, the group — with nondescript tyke Blue (Jacob Tremblay) and gruff stepdad Victor (Brendan Gleeson, \"The Raven\") in tow — whisks off to the City of Lights with nary a jump cut. While there, Smurfette, who was evidently created by the bad wizard becomes fast friends with Vexy and even offers to share the secret formula that Papa used to turn her blue — a concoction that will allow Gargamel to somehow rule the world.<br><br>Meanwhile, the three incompetent Smurfs try to save the day, while an embarrassed Gleeson (much too good to be involved in an endeavor like this) spends most of the picture flapping around as a poorly-CGIed duck.<br><br>It's all about potions and magic and essences and fatherly love, all of which are needed to keep the average person awake during all of this nonsense. So-so effects, little or no pacing, a drag in the middle and totally unnecessary 3D technology highlight the pointlessness of it all.<br><br>Be aware that there is also a definite mean streak which runs through the movie (Gargamel is willing to let his creations die and laughingly tortures the captive Smurfs), as well as a complete lack of humor (or anything close to that emotion), despite the fact that Azaria (who voices about a dozen characters on \"The Simpsons\" TV show) does his best with what little he is given.<br><br>So, like \"Garfield: A Tail of Two Kitties,\" \"Marmaduke,\" \"Alvin and the Chipmunks\" and \"Yogi Bear\" — films which tried to incorporate CGI with live action — \"The Smurfs 2\" comes up woefully short, leaving \"Who Framed Roger Rabbit\" as the still clear-cut winner of the genre - and that particular production is more than 25 years old.<br><br>So why not just buy, rent or record that picture, save a trip to the cinema and call it a weekend. You would certainly be doing yourself - or your children - no favors by seeing \"The Smurfs 2.\"","user":"gregeichelberger","rank":[21,29]},{"title":"It has small improvements but still not for adults...","rating":3,"date":"25 November 2013","review":"There's no point in pulling punches here because, let's face it, these movies are meant as a distraction for kids. The jokes are bad, the acting is cheesy and the story isn't complicated. The whole point of the first film was to be something that will dazzle children with jokes only kids can laugh at and some brightly colored characters dancing across the screen. The formula for this sequel doesn't change that.<br><br>The only real difference I saw in this one was that it looked like the writers were trying to add a little more heart to the story by throwing in heavy elements of belonging and family. Smurfette feels isolated because of her lineage and doesn't feel like she belongs with the Smurfs while Patrick's stepfather comes into play and feels he's being pushed away from his stepson as he desperately tries to be a positive and loving influence in his life. I honestly enjoyed this part of the film but hated that it was surrounded with really bad jokes filled with \"blue\" gags and using the word \"smurf\" so much that the joke lost all its meaning in the first five minutes and acting that is gorged on scenery to the point of indigestion.<br><br>Once again, this movie is intended to bring smiles to little kids who still think boogers are the height of cuisine but, at least, the film felt like it was trying to make some improvements and strides to make this a better family film than the last one...also, the special effects are still decent, so it has that going for it.<br><br>Hi! My name is Rev. Ron and I love movies! So much so that I write a blog where I review whatever movie I am watching at the time. You can read a more in-depth review of this film (and others) at revronmovies.blogspot.com","user":"RevRonster","rank":[10,13]}]