[{"title":"Disappointing.","rating":4,"date":"25 November 2018","review":"Given the word I had heard about this zombie film, I was disappointed with the execution but - being a fellow creative - I don't want to dwell on the negatives so will get those out of the way early on before concentrating on what was done well.<br><br>1. Acting / characters: The acting was not good in this film. Some of the dialogue was both clunky and cheesy. I found myself not really knowing much about the characters and - as a result - I didn't care about them.<br><br>2. The run time: The film was way, way, way too long. At least an hour too long. It was action scene, zombie stuff, internal conflict with the soldiers, repeat the above for over two hours. None of the action sequences brought anything new to what you were watching so - when you saw the first one, you'd pretty much seen the rest of them.<br><br>3. Script / Plot: Nothing we haven't seen before but not as executed as well as it could have been. It needed tightening and some new twists (other than a \"twist\" at the end which just missed the mark by a mile and infuriated me). It appears to have taken bits from your favourite zombie films, mashed them together and executed them in a poorer style.<br><br>That's the negatives.<br><br>The positives.<br><br>1. Action is hard to direct and I've seen many directors who are at the top of their game fluff this. But it was clear to see what was happening, who was punching who and with little motion sickness (some go way overboard with shaky cameras in other films but not this one). It was shot well.<br><br>2. The score was good for the material they had to work with. Had the script been tighter, there could have been some powerful scenes with the added music.<br><br>3. For a low-budget film it looks great. There are a couple of dodgy effects which people laughed at (knees getting shot for example) but - overall - it would stand up well next to high budget films...<br><br>Last comment: style over substance. Had it not been so long, it could have been an average film but... The running time and other issues killed it for me personally. Give it a watch though and make your own mind up :)","user":"shawthingproductions","rank":[40,51]},{"title":"Not worth wasting time","rating":2,"date":"29 September 2018","review":"I was surprised by the plots a couple of times during the movie wondering why the story would develop in such a ridiculous way. Two of the soldiers fell in love during the mission? The captain recalled his dead wife while playing with the little girl on the beach? The plot seems to be developing in a random and uncontrolled way. Several people left the cinema before the end.","user":"kanzhou","rank":[42,55]},{"title":"Still somewhat interesting","rating":5,"date":"7 March 2019","review":"The film is generally very ordinary in all aspects, and some places are even romantic to some ridiculous.\nHowever, there are still some things to watch out - the relationship between characters and characters is very good, and some places can even be said to be touching.","user":"ParisImpressionH-Y-","rank":[16,19]}]