[{"title":"I'M NOT RUNNING AWAY. I'M ESCAPING","rating":7,"date":"30 May 2019","review":"Ribbit is a poisonous tree frog who doesn't fit in with the pond frogs. He is friends with a flying squirrel named Sandy because they are not afraid of a lawsuit by Spongebob. Ribbit believes he is a human prince trapped inside his body and embarks on a journey to find a human princess to kiss him. Sandy comes along because she is bored.<br><br>The graphics are second rate. Some of the animals have foreign accents and many are not native to South America where this appears to take place. Ribbit spends much of the beginning of the film lamenting on his purpose in life, almost turning it into a downer. The eyes looked liked doll eyes. The film stops short of being an inter-species love story, instead it concentrates on friendship and being what you are...whatever that means.","user":"nogodnomasters","rank":[0,0]},{"title":"Ribbit. A solid/fine animated film that deserves a solid recomendation to families.","rating":6,"date":"25 November 2018","review":"This is a cute charming emotional animated film with positive messages about friendship, heroism, saving the endangerd species, and being different is the best (if you should them what you are made of). The friendship between ribbit and sandy is handled very well just like real life friends, very authentic, &amp; feels realistic, so you can relate to those main characters. The voice cast is absolutley wonderful &amp; so is the voice acting, but some of the accents are not a perfect fit for the location (the Amazon Rainforest), Australian,german,indian,&amp; French. There are moments where the characters say words that are not real words, 2 moments of the dialogue said from sandy does not make sense &amp; needs to be fixed. Also the bat is a somwhat unlikable character because he is a slow thinker &amp; he makes characters fools of themselves to believe him, &amp; Terrance the toucan voiced by Tim Curry has a laugh that might be poorly directed. The animation went from very nice to top-notch. The music score reflects the mood &amp; narration, &amp; focuses on the mood &amp; narration perfectly. The music score also has full of life. Somtimes a movie with 2 heros &amp; 2 villains heighten's up the good vs evil scale, &amp; it works well. Ribbit the poison dart frog &amp; Sandy the flying squirrel. The Witch Doctor &amp; Kai the Caiman. The story/plot of the movie is good at best because it is very simple to follow (all you have to do is know what the movie is about), &amp; also the story brings in a message about...well, you already know. So the plot of the film makes sense, &amp; it works. Overall: a family film recomended for families and animal lovers.\nThis film is suitable/appropriate/O.K for kids 6 and up.","user":"kylevan-76991","rank":[0,0]},{"title":"Nice movie, worth watching!","rating":10,"date":"7 April 2015","review":"Ribbit, a frog was the hero of this film.He was a curious and adventurous frog.With an intention to find purpose in his life,he starts his journey and will meet several wonderful characters on the way. All the characters in the film did their best.I like the character of bat named Deepak in the film and is voiced by Russell Peters.Direction was amazing. This movie was definitely a good feast for nature lovers.Animation was nice.Music was touching. The Ingredients like comedy,romance,adventure and little bit horror(some scary scenes) were perfectly balanced.Overall it was worth watching and has some good message in it.","user":"nuthalapatidin","rank":[4,15]}]