[{"title":"Say what you want but it was simply a good show this year.","rating":8,"date":"28 February 2012","review":"Every year it is the same; people complaining about the nominees, winners but mostly the award show itself. Nobody can be ever completely satisfied of course and this also shouldn't be the Academy Awards' intention. But it's still good to see that they are taking some of the criticism at heart and keep improving/adjusting the show. I think that they have now finally reached a point that they have taken the best elements of the last 5, or so, Academy Awards shows and have combined it for this year's award ceremony.<br><br>I really enjoyed watching it, mostly because there seemed to be a good pace, all throughout. The acceptance speeches were all equally long/short and none of them felt overlong or made me shout out at the TV 'get off the stage!'. Also there were no real distractions this year. Normally the show takes the time to suddenly honor somebody for 5 minutes, or throw in some montages or other videos. This year it all was really mostly about handing out the awards, nothing more and nothing less than that.<br><br>Also no distracting Oscar-nominated songs and live performances this time. Sorry to say but most nominated songs are always very boring and horrible to listen to. This year there were only 2 nominees but they didn't let anyone perform them on stage, which was a great move in my opinion!<br><br>Another thing that gave the show lots of pace was the order in which the awards were being handed out. For years they always saved the most important awards for the end of the show, with always as a result that people first had to endure 2 hours of other people, that no one has ever heard of or cared about, receiving Oscars, for some very uninteresting categories. This year there was a far better balance in which the awards were handed out.<br><br>One more thing that gave the show lots of pace were the presenters. No one that came on stage ever had a long routine before they announced the winner and it was also a smart move to leave all of the comedy up to the real comedians this year. And there were quite a few comedians handing out the awards this year!<br><br>The main presenter of the evening, Billy Crystal, was also surprising good. I really wasn't looking forward to him again, after a absence of 8 years from presenting the Oscars, after Eddie Murphy had dropped out. But he simply was really good, mainly since he didn't turned it into a one man's show for himself. He still had some good jokes this year, something that was also lacking during the last couple of years, when they tried out (too) many different, new hosts.<br><br>As for the winners themselves; there were no real big surprises this year but it's still always good to see that there is not just one movie, that sweeps all of the awards. Many different movies received an Oscar this year, which should also tell you something about what kind of a year this was. it was a year with many great movies, of which none stood really out as anything brilliant, in my opinion.<br><br>Still some of the winners and its predictability annoyed me of course. Christopher Plummer mostly winning just because of his age, the way Meryl Streep acted all surprised she had won, while she was the only true 100% lock for his year, Octavia Spencer being the only one that received a standing ovation mostly because of her ethnicity and out of so called white guilt. I mean, I was hoping and also expecting her to win but really, a standing ovation, just for her win alone? It were all little things like this that still annoyed me about the evening.<br><br>But oh well, like I said before; you can never expect to feel completely satisfied during an 3 hour long award ceremony! <br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[5,6]},{"title":"Billy's back! George is upset and Meryl the best wins again! Best picture is a nod to yesteryear.","rating":8,"date":"27 February 2012","review":"\"The 84th Annual Academy Awards\" was not one of the best shows yet, it was far from the worst. As having funny guy Billy Crystal back as host improved the pace and laughs of the show. Evening though some of Crystal's skits and singing gets a little old still his jokes brought joy and the opening montage of seeing Billy in all of the best picture nominees was a blast. Interesting during the show was seeing clips of interviews with stars telling of their favorite movies and explaining how they felt that film has impacted life and culture, as by watching film anyone can take something from it and be inspired. Also moving as always was the tribute to those that we lost during the past year. As is becoming the norm again the past years winner presented the category in which they had won in.<br><br>As for the awards most went as planned as the academy finally got it right awarding Christopher Plummer(best supporting actor) an Oscar as at 82 he's the oldest to ever win heck he's almost as old as the Oscar's(84 years). However in the best actor race the man himself George Clooney was upset losing to \"The Artist's\" French macho man the talented Jean Dujardin as evidenced by the other wins including the best picture win \"The Artist\" proved that Hollywood was paying tribute to the old days of cinema and the silent film era as this picture was the first silent film to win top honors since 1929's \"Wings\". Nice and fitting was seeing the best actress in the business win for Best Actress as the transformed and always real and believable Meryl Streep(a 17 time nominee) won her third Oscar as she was stunning and direct as Margaret Thatcher in \"The Iron Lady\".<br><br>Overall it wasn't the best Oscars, yet not the worst it was good seeing Billy back and I'm glad the class act veterans like Streep and Plummer came away with wins. And only fitting was the academy paying tribute to old Hollywood's silent era by awarding \"The Artist\" best picture.","user":"blanbrn","rank":[4,5]},{"title":"My Awards For The 84th Annual Academy Awards !","rating":28,"date":"28 February 2012","review":"_The Most Truthful: (Chris Rock)'s word. That guy said nothing but the truth; he's silly, and yet he gets millions for just being the silly that he is!<br><br>_The Most Freaky: (What a Wonderful World)'s singer's hair. It's so fit for a Discovery Channel documentary that could be named \"Undiscovered yet Jungles\"!<br><br>_The Most Surprising: The winning of Iran. That director's speech, concerning how some politics' evil could bury a nation's culture, was impeccably brilliant. By the way, speaking about other movies of other nations that were buried by the Oscar's, rather Hollywood's politics; for years and years there was something like thousand movies that should have won, but not even one of them made it to be nominated.<br><br>_The Most Hysterical: (Billy Crystal)'s segment of \"That's what everybody is thinking.\", the parts of (Martin Scorsese) and (Nick Nolte) were beyond fabulous!<br><br>_The Most Vengeful: The \"focus group\" skit. WAW, it bombed the dumb reviewers rightly!<br><br>_The Most Smart: The joking speech that the winner of the sound editing award gave: \"to whoever was born, will be born..\", it was a good parody of the Oscar speeches!<br><br>_The Most Gross: The kiss of (Billy Crystal) and (George Clooney). Absolute gross, uncalled for, and unfunny.<br><br>_The Most Mean: The look upon (Christopher Plummer)'s face while (Billy) was referring to his 82 years, making joke of his aging. He was squeezing his teeth, saying deeply: \"Grrrrr, if you and I were in a boxing match, 60 years ago..\"<br><br>_The Most Weird: (Nick Nolte)'s way of clapping; as if he's slapping somebody wrathfully!<br><br>_The Best: (Billy Crystal)'s singing. His performance reached the top. It made me sad for all the musicals that he didn't make for all of those years!<br><br>_The Worst: (Billy Crystal)'s botoxed face, the little toupee, and the way he has to smile after almost every single joke he throws; it assures that he isn't cocky, but nervous. And he didn't use to be nervous.<br><br>_The Ugliest: When the music interrupts the speech of poor men like the winners of the best feature documentary. The nasty manner of the Academy that I have complained, complain, and - pessimistically - will be complaining about, seems to be incurable, ESPECIALLY when the academy leaves ***stars*** talk and yak as long as they want, because they're ***stars***. Think of it; (Plummer) talked for longer time, and no music interrupted him!<br><br>_The Most Sensitive: \"Accept me, I have so much love to give.\" said by (Ludovic Bource) the winner of the best original score. And \"My wife deserves a Nobel prize for piece for getting to save me everyday of my life.\" said by (Christopher Plummer) the winner of the best supporting actor.<br><br>In general, very good spectacle. Better than the Oscar night of the last year which was itself better than the Oscar night of the year before it!<br><br>Finally, to the Academy: While (Billy Crystal) is around, don't you ever think of calling (Chris Rock).. for anything!","user":"elshikh4","rank":[5,9]}]