[{"title":"I'm Sure You Heard the Phrase, \"Grown Folk's Business\"","rating":8,"date":"18 November 2013","review":"Best Man's Holiday, is a timely-well written and acted movie. It touches on so many social issues people are going through in the now. It is surprising how emotional involved you will be caught up in scenes. It's a roller coaster of highly amusing moments on second, followed by an altar call of your conscience reflecting on unresolved past issues the next. The movie will have you unexpectedly grabbing for popcorn salt covered napkins to use on tear ducts, then laughing so hard followed with, \"what if -, thank you, goodness (smirk),you have got to be kidding me and oh YES (I know that's right),\" moments. And then more need of those crumpled salt and oil napkins you discarded in the empty popcorn bowl.<br><br>So warning! Save your eyes, bring tissue and make sure the cell phone is charged. You'll be calling family and friends after seeing this movie. You may end up seeing them sooner than you thought possible or vowed ever to do again.","user":"day_dae","rank":[21,31]},{"title":"The Best Man Holiday delivers a dramedy which reminds you why the 90s/ early 00s were a renaissance for Black films.","rating":9,"date":"15 November 2013","review":"I have probably watched the first movie, The Best Man, at least 5 to 6 times since it came out. It was funny, presented new angles for Black actors, and though Christianity, as with most Black films, was in there, it wasn't overdone. As for the sequel, it is rare to get a whole cast to return when more than a decade has passed, and truly I think, when it comes to original movies and not ones based off someone who was alive, this is the best film featuring a Black majority cast in a while.<br><br>Characters &amp; Story<br><br>In the film, everyone comes back and really the only new editions are the kids of the characters and the obligatory White co-star. For those who haven't seen the first film though, the majority of the casts are all doing White-Collar work. Harper (played by Taye Diggs) is an author, and former teacher at NYU; his wife Robyn (played by Sanaa Lathan) is a Chef; his best friend Lance (played by Morris Chestnut) is a football player who is soon to retire; his wife Mia (played by Monica Calhoun) is a housewife; then there is Jordan (played by Nia Long) who works for MSNBC in a executive producer role; her new boyfriend Brian (played by Eddie Cibrian) who seemingly works on Wall Street; then there is Julian (played by Harold Perrineau) who seems to be a innovator in education, and runs his own school with the assistance of his wife Candace (played by Regina Hall); the last two to mention are Shelby (played by Melissa De Sousa) who is a reality TV star, and Quentin (played by Terrence Howard) who owns a managing firm.<br><br>Altogether, they all have the type of lives and careers which make them sound like Cosby Show kids, but they also have quite a bit of drama as well. Most of which is featured in the first movie so I won't go into all that. However, for this movie the idea is coming back together and trying to mend bonds which have weakened due to lack of time, effort and because of bad blood.<br><br>Praise<br><br>Probably the top thing about this movie is the comedy. This is a tad bit of social comedy in the film, but a large amount of laughs come from them cracking jokes on each other. Some of it is just jabs at one another, like the joke about Harper having a low sperm count, but other times the jokes were vicious like the fight Candace and Shelby have. At the same time though, I must also praise the non-comedic performances. Mind you, those who have seen the original, there is a lot of already existing drama since so many people dated each other, had sex with each other, or liked each other, in the group. Due to this, the chemistry between character and their history causes friction. But, naturally there is one thing which brings them together and bond like a family. Unfortunately though, said situation will bring the tears which makes me glad for Shelby and Quentin for comic relief. For, when I say a situation will bring you to tears, I mean that for at least 15 minutes I was dripping tears, sometimes it getting intense to the point I was lightly shaking and the roof of my mouth was hurting. So needless to say, bring your tissues for the writing and performances will test your sense of empathy. <br><br>Criticism<br><br>Which leads the few issues with the film. The main issue is that I do feel Harper and Lance's relationship is less natural, in terms of writing and situations, than the rest of the stories. The thing which causes conflict between the two, after they reconcile, specifically is what I felt was sort of forced and was eye-roll inducing. Still, it helped push the story along. The only other issue, and this is really nitpicking, is that Lance brings an almost Tyler Perry style faith in Christianity which only bothered me since I am growing tired of Black characters solely being Christian and not spreading their wings to other faiths, or being agnostic/ atheist.<br><br>Overall: Worth Seeing<br><br>Usually I count how often I laugh when I see a comedy film, but I enjoyed myself so much I forgot to. Truly, this film reminds me why I watch the original, Love Jones, Jason's Lyric, and other romantic dramedys that came out in the 90s/00s. They remind you, as a movie enthusiast, that there is more out there for Black actors than them doing slave roles, doing buffoon comedy pictures, or doing films based off people's lives. And this isn't to say that there aren't dramatic roles done which are fiction or original, but when do they get the type of push The Best Man Holiday is getting? This is why I think it is worth seeing. Not just because it is a good film featuring Black people, or because it is a sequel to a classic, but because it is a good film period. One that does enough to acknowledge these are African-Americans we are seeing, but in a Cosby Show way so that it isn't trying to alienate a general audience, and speak to more than simply the skin color, and backgrounds, of the cast. Truly, I hope this film inspires another renaissance, for we are badly in need of one.","user":"Amari-Sali","rank":[24,37]},{"title":"Christmas with friends","rating":7,"date":"3 December 2013","review":"Lance and Mia bring together a group of close friends to celebrate Christmas. As it is usual with such gatherings, each group of friends brought along their own emotional baggage and old divisions amongst them resurfaced.<br><br>This is an emotional movie. Lance is the central character. He is an enormously successful and wealthy baseball player, yet he is grounded by his love for God and devotion to his family. It is his loyalty to his wife that he will organise the gathering although to him will be particularly challenging.<br><br>Such occasions will provide opportunities for people to quarrel, fall out and make up. A shocking revelation will ground everyone. Ultimately, life brings ups and down and in the midst of it all one will need a group of friends that will simply be there. They don't have to do anything as long they are present and available.<br><br>Well acted, with poignant conversations this is a movie with which the audience will resonate. It is a shame that the presence of hints and insinuations in the dialogues demonstrate that the obsession with race is still prevalent.","user":"cinematic_aficionado","rank":[14,21]}]