[{"title":"I Loved It","rating":9,"date":"22 January 2013","review":"Whenever I see a movie that I get really excited about, I seek out reviews from professional critics and fellow fans. Often times they will point out things that I may not have noticed and it's exciting to feel connected to someone through art. When I find lots of negative reviews I begin to feel a sort of let down. I wonder if my opinion was \"wrong\", or why I'm the only one who liked it. Keep in mind; I'm an 18-year-old girl, so I have not yet grown out of such thoughts. I am also not an authority on film. Everything I know, I learnt from reading Roger Ebert and watching lots and lots of movies. However, this movie really stuck with me. I saw it 2 days ago and I still can't stop thinking about it. I decided to take a page out of Ebert's book and explain why I loved it (instead of just saying \"it's awesome\"). Here's why: 1. The Children: I'm a sucker for kids in movies, especially when they actually get to act like kids. The 1-year-old Lily and 3-year-old Victoria are so beautiful that they tug at your heartstrings without even trying. They were well cast. 6-year old Lily and 8-year-old Victoria were truly phenomenal little actresses. Megan Charpentier (already a seasoned veteran with previous credits including Jennifer's Body, Red Riding Hood, and Resident Evil: Retribution) handles this heavy subject matter with maturity and poise. She manages to balance innocence with experience. She has been traumatized by her past, maybe her heart is a little harder than the average 8-year-old (if it wasn't, she wouldn't have survived all that time), but we still get glimpses of the little girl who just wants a mommy. Isabelle Nélisse is (in my opinion) genius as little Lily. I think CGI must have been used to make her movements appear more animalistic, but a child of her age maintaining such seriousness is riveting to watch. When she plays with her toys, it's like watching an actual feral child in a documentary (I repeat, it is LIKE watching a feral child, not IDENTICAL to).<br><br>2. The \"Parents\": Jessica Chastain and Nikolaj Coaster-Waldau as the uncle (and uncle's girlfriend) of the little girls are very well cast. I was a bit sceptical of Jessica Chastain's \"rocker chick\" look, but she brings such life and courage to her character that you actually see her as a bass player, instead of a classically beautiful Hollywood star trying to look like a bass player. I had never heard of Nikolaj Coaster-Waldau before this film. I love how much he loves the girls. His caring for them is so sincere and honest. You truly believe that he is the kind of guy who would spend 5 years (and money he doesn't have) on the hope that his nieces might still be alive. He is a loving father figure who doesn't get as much time with the girls as her should (in my humble opinion).<br><br>3. Mama: The demon/spirit/ghost/entity/whatchamacallit of Mama was created using CGI and a very tall, thin actor. Many audience members laughed when Mama first came in to full view. I agree that she looked a little funny. Her hair was really weird and anti-gravity (like Mama in the short film) and her face was oddly asymmetrical. However, I think that she was perfect. Just the right amount of creepy and sad. This is one of the only horror movies in existence that causes the audience to feel real sympathy for the evil villain.<br><br>4. The Director: I admire Andrés Muschietti for taking so many risks. It is rare to find a filmmaker today who will go against what the audience may want. He didn't use any fake scares; the situation was scary enough on its own. There are brilliant moments of natural humour that were so refreshing. He did not mock his characters or the situation, but he found the string of comedy that was there already and used it to his advantage. How many times have you been having a miserable day, and then just stopped and started laughing about how everything went wrong? That is the humour of Mama.<br><br>5. The Story: Part of the reason that I love horror movies is that they aren't bound by the usual visionary constraints of, say, Italian neo-realism films. Tragic stories are exciting and implausible all at the same time. I think that this was a very original take on a story of mother-daughter bonding. Of course there's no such thing as a \"completely original story\", but there is such thing as a completely original vision. The story affected me very deeply. I'm still trying to come to terms with how it ended.<br><br>6. Using Clichés Effectively: There are a lot of clichés involved in making a horror film. There are only so many ways to introduce the plot line of a supernatural being. This genre requires stock characters, and they do their jobs well. They use some of my favourite scare tactics (using a camera as a light source, unexpected appearances by the entity, etc...). Those particular clichés are necessary. Would you really want to see a Jim Carrey comedy where he uses dry humour and no body language? Or a Baz Luhrman film with dull colours and understated characters? Clichés are not always a bad thing.<br><br>This is why I loved this film. Agree or disagree, but you can't say I didn't think it through.<br><br>Take care, -Hannah","user":"hannah-ladwig","rank":[219,282]},{"title":"The Mothmom Possibly.","rating":7,"date":"12 March 2014","review":"Mama is directed by Andres Muschietti and written by Muschietti, Barbara Muschietti and Neil Cross. It stars Jessica Chastain, Nikolaj Coaster-Waldau, Megan Charpentier, Isabelle Nelisse, Daniel Kash, Javier Botet and Jane Moffat. Music is by Fernando Velazquez and cinematography by Antonio Riestra.<br><br>A Suicidal father abducts his two young daughters and takes them to a cabin out in the woods, his intention is to kill them. Before he can enact his plan he is killed by a strange entity, leaving the two girls alone in the cabin. Years later the girls are discovered in the cabin, completely feral and when any sense can finally be made out of them, they talk of being looked after by someone they call Mama; And it seems Mama has come back with them to civilisation<br><br>Based on his own 2008 Argentinian short of the same name, Andres Muschietti expands the idea out to a full length feature film. With pretty decent results as well. Pic is a supernatural fairytale, thick on ethereal atmosphere and not over reliant on boo jumps or an adherence to blood and guts spilling just to put bums on seats. From the moment the girls are found, scampering around the wood cabin on all fours, clearly having survived on cherries for five years, there's an uneasy feel to the story. We already know there is a spirit involved as we half glimpsed \"Mama\" during the pre-credits sequence, what we need now is a good story and a healthy quota of frights and peril for Waldau and Chastain as they become surrogate parents to the troubled youngsters; And again, Mama mostly delivers all that is required of it for a good night in by the fire whilst perched on the edge of your seat.<br><br>Chastain is excellent as the punk rock chick reluctantly mothering two children before her time, the two girls, Charpentier and Nelisse, are also top draw, exuding the sadness and confusion that children of that age would obviously be feeling under these circumstances. While their reactions to what we ourselves can't see, via glances or hushed exchanges, has a creepiness to it that delivers a bucket load of dread. Muschietti's direction is very stylish, not only does he marshal his principal cast members with great skill, he shows some ingenuity in scene staging with one sequence particularly brilliant as Chastain does housework and the younger of the girls plays with Mama in the bedroom, we know it, even though we can only see the wee bairn. The soundtrack and score is suitably screechy, and the cinematography by Riestra has Gothic tints to it.<br><br>Why Mama is not a bona fide entry in the upper echelons of horror is mainly due to an annoying mistake that so many horror genre film makers make, namely showing too much of the spook. There is a point around the hour mark where \"Mama\" herself just stops being scary, a shame because the effects work isn't half bad. There's other, less itchy problems, such as Waldau being reduced to a bit player from the mid-point, a sub-plot involving Kash's Dr. Dreyfuss just feels like set-up material, while the ending is sure to be a bit too WTF for some. That said, this is good genre cinema for those who like The Woman in Black type of thrills and story telling. 7.5/10","user":"hitchcockthelegend","rank":[35,43]},{"title":"Begins with a lot of promise, but ends with an unsatisfying note","rating":5,"date":"6 May 2013","review":"¨A ghost is an emotion bent out of shape, condemned to repeat itself time and time again.¨<br><br>Another South American director has made his splash on Hollywood after the successful debut of Mama in theaters this year. Argentinean director, Andres Muschietti, made over 70 million dollars in the box office and received decent reviews for this horror/suspense film based on a short 3 minute movie he directed in 2008. That short film garnered the attention of movie executives such as Guillermo Del Toro who decided to produce and present this film. The fact that Del Toro's name was used here and that the coveted Jessica Chastain signed on to play the main character gave Muschietti the tremendous possibility of debuting on a high note. The formula worked pretty well because critics and audiences seemed to enjoy this film alike, and we could be heading to the start of a new horror franchise. I enjoyed most of the movie, and loved Jessica Chastain's performance, but the ending just ruined the entire film for me. It is kind of the same problem pretty much every ghost story film has. I feel like most of the endings in this genre are pretty unsatisfying and ruin the entire suspense the film has been building throughout the story. There is no denying that Japanese films have heavily influenced the genre with films such as The Ring, The Grudge, Dark Water, and One Missed Call which have all been remade, but the truth of the matter is the only film that really worked with critics was The Ring. They have tried to imitate its success, but I haven't been scared like I was with The Ring, which had a pretty satisfying ending compared to the rest. I do prefer this type of psychological horror more than the gory slasher films, but I find it troubling that they can't find a satisfying ending. My favorites in this genre will always be the first two I saw: Zemeckis's What Lies Beneath and The Ring. The rest have all fallen short. Mama was close to achieving that similar success in my opinion, but the ending really hurt it.<br><br>The film centers around two girls named Lilly (Isabelle Nelisse) and Victoria (Megan Charpentier) who are abandoned in a cabin in the middle of the woods after their father murdered their mother and was attacked by some presence inside the cabin. Five years later the search finally pays off and their Uncle Lucas (Nikolaj Coaster-Waldau) finds them. To everyone's surprise the two girls have managed to survive on their own, but they live like animals crawling around the floor and talking to walls. Lucas and his girlfriend, Annabel (Jessica Chastain) decide to raise the kids with the help of Dr. Dreyfuss (Daniel Kash) who continues to treat the girls in order for them to make the transition from their isolated lives to a normal and nurturing family life. Annabel soon discovers that these girls might have never been on their own and that somehow the presence that was with them in the cabin might be in their home as well. Several suspenseful and horrifying events begin to take place while the girls continue to talk to shadows in the walls and call out for Mama.<br><br>The film has several thrills and suspenseful moments with a great performance from Jessica Chastain. It was good to see her try out a different role and she proves she can do about everything. It's hard to find good performances in horror films, but this may be one of the best. The movie also has its weaknesses like pretty much all horror films do considering the protagonists always seem to make stupid decisions, but that is what makes the genre so entertaining at times. They are clichés which we have learned to accept. The two girls were also surprisingly good, they had strong performances as well. I really enjoyed everything about the movie up to the last 15 minutes which pretty much ruined everything. Psychological thrillers usually have this impact: they begin with a lot of promise but end up on the wrong note, and that is exactly how I felt about Mama along with Sinister, a similar movie I got to see a few months ago. The film is above average thanks to Jessica Chastain, and Guillermo Del Toro's influence in the production of the movie, but that is about it. <br><br>http://estebueno10.blogspot.com/","user":"estebangonzalez10","rank":[87,122]}]