[{"title":"Non-Stop","rating":8,"date":"20 February 2020","review":"When I first saw previews for this I called it \"Taken Plane.\" After seeing it, it is everything but that. Excellent script that keeps you guessing and trying to figure out \"who dun it.\" Liam Neeson does a great job and keeps you rooting for him the entire film. He gets a great supporting cast as well. Top notch performance by Corey Stoll as the NYPD detective passenger on the plane as well. The only downside to this film was that when the film started it almost seemed like the first 2-4 minutes were cut and just dropped you right into the film. A little confusing but nothing extreme to take away from the rest of the film.","user":"MR_Heraclius","rank":[37,38]},{"title":"Keeps You Guessing","rating":7,"date":"3 March 2014","review":"This surprised me. A thriller on a plane that has you thinking you know all the answers (because we're such expert movie watches), then flips it. Yes, it's a contrived subplot. And the reasoning behind this terrorist act is goofy, BUT...it is a lot of fun. It interweaves a really elaborate set-up that you have to focus on to understand.<br><br>Also, for people who think they're sophisticated in camera motion. Think about that space. The camera moves in (perceived) 360 degrees without a) seeing camera shadow b) camera angle is near impossible with the movements they had. This is visually sophistication that most won't see or care. But it adds a ton to the claustrophobia.<br><br>Julianne Moore is great, as always. Neeson is perfect for this role, but one has to wonder how this behemoth of a guy fits in a airplane bathroom.","user":"statuskuo","rank":[173,209]},{"title":"Surprisingly entertaining","rating":8,"date":"12 March 2014","review":"I never was a huge fan of Liam Neeson's action flicks, but I went to see this because of the good reviews. This movie is a very suspenseful and a great \"Whodunnit\" movie. It it's share of action scenes, but it never went too over the top. Even if you don't like Liam Neeson, this movie is worth seeing and is a guaranteed good time. Lot's of twists and suspicious characters leave you guessing and most likely wrong. Lot's of on the edge-of- your-seat scenes because of how well it was made and has a silent and lonely feel to it which helps you understand everything going on. Overall, this movie is a great thriller without being packed full of action.","user":"ezranelson98","rank":[122,154]}]