[{"title":"A must see!","rating":10,"date":"5 July 2012","review":"The Last Reef is stunning!! The music and cinematography were amazing!! I left wishing it was a 2 hour movie IMAX vs 50 min IMAX. I would have loved to have seen more! It was fun to watch all the kids trying to grab the fish and jelly fish swimming around their faces in 3D. The 3D was spectacular!! A must see if you love the ocean! A must see if you love coral reefs! A must see with the kids! They will love it!!! It was fascinating to see the brilliant colors of life living within the coral reef eco system. I learned so much! I can't wait to see it again!!! The sting-less jellyfish were very cool, and was amazing how they have adapted to their environment with no predators. Really cool IMAX! A MUST see!! :-)","user":"forallreviews","rank":[5,6]},{"title":"superb documentary","rating":10,"date":"18 March 2019","review":"It's superb documentary, really i enjoyed every single detail about THE REEF.\nThe fisherman who do dynamite fishing must be executed.","user":"victoriahubert","rank":[0,0]},{"title":"Decent documentary about an important, yet not so appealing subject","rating":6,"date":"17 November 2016","review":"\"The Last Reef 3D\" is a 40-minute documentary from 2012, so this one will have its 5th anniversary next year. The writers and directors are Oscar nominees Luke Cresswell and Steve McNicholas and while they reached their biggest success very early in their career, this one here is one of their most known works probably from a whole lot of nature documentaries they worked on together and the focus here is, as the title already tells us, on reefs. Honestly, reefs are crucial from an environmental perspective as they are the basis of life for so many animals, but I myself struggled a bit with this documentary as underwater fauna has never been a subject that interested me too much. That's why my 6 out of 10 rating is pretty subjective and people who find the subject more appealing may very well give it a higher rating and I would not be surprised. It is definitely a documentary film that is well-executed, offers occasionally interesting snippets of information and is also impressive visually of course. I give this one a thumbs-up and recommend checking it out, especially to nature documentary fans.","user":"Horst_In_Translation","rank":[1,2]}]