[{"title":"The Future of Horror","rating":5,"date":"27 March 2013","review":"Antiviral is a sci-fi/horror film from the mind of Brandon Cronenberg, David Cronenberg's son. This is a beautifully shot film, with a great premise but it just didn't click with me totally. The film follows Syd March, a man who works for a company that harvests diseases from celebrities and then injects them into paying clients. Sounds pretty messed up right? To put it in real world context, you'd go to this company and willfully get injected with Britney Spears cold sore. It gets even weirder when they get into celebrity cell regeneration that is made into steaks. Yeah, you read that right. There's a \"butcher shop\" that specializes in growing celebrities cells and selling them to you so you can eat them. This is an incredibly original story that plays on societies star obsessed culture and turns it on its ear. I love the idea of this movie but it moves at too slow of a pace. There's a few minor twists and basically no action, which makes a slow film feel even slower. Antiviral is not a fun film (no humor,no action, no scares) and is definitely not for everyone. It is a beautifully shot film, even though it is meandering, it is always great to look at. Every shot is framed well and done with purpose. The use of white gives it a very clean and sanitary look that is extremely effective. Cronenberg gets an A+ for the look of this film, it really is that nice to look at. The limited amount of gore is also expertly done, I just wish there had been more of it.<br><br>Caleb Landry Jones (Banshee in X-Men First Class) is the star, this is basically a restrictive narrative, and he is in pretty much every scene. He does a good job and has a bright future. Malcolm McDowell also has an extended cameo and he's as good as always. He seems to have settled into this role as a name actor, lending that name to help a small picture. <br><br>Antiviral is an incredibly original story, and beautiful to watch but it is just a tad dull. Instead of an A its a solid B, just because of the story and visuals. I repeat it is not for everyone, it reminds of Excision a bit (just without the snappy humor), so if you liked that movie then check out Antiviral. Brandon Cronenberg is the future of horror, and as a horror fan, I couldn't be happier.","user":"ystump-1","rank":[41,56]},{"title":"A strong, very subtle first film from Brandon Cronenberg","rating":8,"date":"12 December 2012","review":"Long live the new flesh! The new flesh here being David Cronenberg's son Brandon, who seems to have inherited his father's body-horror fixation and has used it to direct his feature-length debut Antiviral, an unnerving yet very entertaining piece of science fiction.<br><br>Antiviral offers a disturbing new meaning to our culture of celebrity obsession. Televisions everywhere show round-the-clock footage of their lives and newspapers are full of the tiniest stories and scandals. But that's just the beginning. Syd Marsh (Caleb Landry Jones) works for a company that specialises in injecting members of the public with diseases that have been taken from specific celebrities; you could be walking around with Madonna's chest cold if you wanted to. Part of Syd's job is to 'copyright' these infections: to remove all possibilities of contagion so that once they're injected they cannot be passed on. His desire to make a bit of extra money on the side however, coupled with his own addictions, leads him to be injected with a disease so incurable, it becomes a matter of life and death.<br><br>More a criticism of celebrity culture than an accurate vision of the future, there are moments in this film that are frankly alarming, even when compared to our present day society of Big Brother, X-Factor and Heat magazine, a world in which attaining celebrity status is the only worthwhile ambition. In Antiviral, for instance, there are companies that have developed 'cell stakes', slabs of grey meat grown from the muscle cells of the rich and famous that people actually queue up to buy and subsequently eat for lunch, their excuse being that it makes them feel closer to those they admire. It's moments like these that make it a hard concept to imagine, yet it's a credit to Cronenberg's direction, his cold, very clinical approach to every scene, that makes it somehow believable. <br><br>What makes Antiviral worth watching though, is Caleb Landry Jones, whose on-screen presence is beyond sinister. You might recognise him from X Men: First Class, The Last Exorcism and a couple of Breaking Bad episodes, but Antiviral is very much his breakthrough role; he won't be forgotten in a hurry. Very pale, very freckled and with a ponytail of ginger hair, he has this contemptuous expression on his face as if trying to keep from shouting at every client who comes into his office, yet each line of dialogue is considered and slow, sometimes menacing and other times devoid of any emotion at all, and he has such a mesmerising way of walking through doors that it becomes hard to take your eyes off him. Yet Jones' talent really comes into effect as the virus starts to take control of his body, developing a contorted, demonic stagger as he attempts to go about his life as though nothing is wrong. <br><br>Now it wouldn't be right to compare the films of father and son. There are certainly elements that share similarities: the hospital settings of Dead Ringers, the exploration of media and addiction in Videodrome, but Antiviral needs to be viewed as a completely separate piece of cinema, one that is refreshingly unique in its approach to a topic dealt with many times before, portraying a not-so-distant future with a strange, yet very absorbing bleakness. It's a well-directed film with an extraordinary performance at its centre that serves as a perfect showcase for the brilliance of both Brandon Cronenberg and Caleb Landry Jones; let's hope their collaborations continue.<br><br>http://monsters-and-ink.blogspot.co.uk/","user":"felixtaylor29","rank":[50,72]},{"title":"How far would you go to own a piece of your celebrity crush?","rating":8,"date":"10 October 2012","review":"Brandon Cronenberg's auspicious debut feature is a visually stunning, compelling science fiction story that asks the question, \"How far would you go to own a piece of your celebrity crush?\" Directing from his own script, the young Canadian takes a decidedly cynical view of the cult of personality in this sci-fi paradigm shift -- \"Antiviral\" isn't necessarily showing us what will be in the future but what could be now as it appears to be set more in the present day.<br><br>The film opens in a pristine medical facility where a desperate young man, Edward Porris (Douglas Smith in a too-brief but important establishing role), is about to be injected with a live virus taken from his favorite superstar. Being bedridden with the same illness infecting the woman of his desire is the ultimate autograph. The shot is administered by Syd March (Caleb Landry Jones), a strictly professional, unemotional clinician who knows not to take his job home with him. Of course, everything is not as it seems and March becomes embroiled in a mystery that pulls in the viewer like a syringe drawing blood.<br><br>The cast is focused on a small handful of characters. 22-year-old Caleb Landry Jones (Sean Cassidy/Banshee of \"X-Men: First Class\") is in virtually every shot, undergoing a total physical and emotional transformation that's almost painful to watch, reminiscent of the award-winning performance turned in by Tom Hanks in \"Philadelphia.\" His masterful characterization of Syd's downward spiral is breathtaking and central to the picture's potency. The iconic Malcolm McDowell is satisfyingly engaging as Dr. Abendroth, in a role that stands proudly with anything he's done. As Hannah Geist, the gorgeous object of men's desires, Sarah Gadon is a heartbreaker. Naive diva one minute, vulnerable victim the next, Gadon provides much of the heart and soul of \"Antiviral\" in a film otherwise devoid of color, literally. Joe Pingue and Nicholas Campbell are notable in support.<br><br>\"Antiviral's\" narrative is curiously fascinating, to be sure, but this is a film to examine more on the surface the way an old-fashioned family doctor can tell what ails you by looking at your skin. The highly stylized production is best appreciated by those enriched by a leisurely walk through an art museum. Every frame is like a painting, with lush cinematography and score that can only be effective when director, DP, composer, editor, and the entire visual team work in lockstep, resulting in a brilliant vision executed with highly disciplined precision.<br><br>Much of March's day is set in the clinic and his home, which mirrors his workplace in its cold sterility. The color palette is nothing but black and white. Lighting is oversaturated with characters bathed in bright white, giving the outward appearance of good health that belies the reality of what literally lurks beneath the skin. The outside world is like a parallel universe, where dirt and grime cover a worn out, used landscape as if diseased itself.<br><br>Cinematographer Karim Hussain (\"Hobo with a Shotgun,\" one of my 2011 Sundance Film Festival Top 4) goes against the hand-held trend with stationary camera throughout much of the movie. These tripod shots often feature perfectly centered props and sets following the rule of 3s -- left, center, and right objects perfectly balanced with the action in the middle of the field of view. Many frame-within-a-frame shots continue this classic visual style as the viewer peers through doors and windows, with straight lines and rectangular shapes filling the screen. It's a refreshing break with tradition although, ironically, it's a look established long ago in sci-fi classics like Fritz Lang's \"Metropolis.\" Much is owed to editor Matthew Hannam for the patient pace of the picture. E.C. Woodley's haunting electronica score is filled with biologically-inspired rhythms that reflect the throbbing hearts and mechanical drone of a scientific setting.<br><br>Viewers are cautioned not to underestimate the profound importance of the camera-work and visual effects. The look of \"Antiviral\" is as much, or more, responsible for the film's impact than the script, a notion which may be lost on those simply trying to figure out the plot and following the dialogue. This is a feast for the eyes and ears, not just the mind.<br><br>Brandon Cronenberg proves himself a welcome and worthy addition to the cinematic stage with \"Antiviral,\" a delicious visual showcase and emotionally satisfying, albeit scathing look at one of the perils of modern society.","user":"larry-411","rank":[56,91]}]