[{"title":"Room No. -> Moron","rating":5,"date":"27 October 2017","review":"This is quite the film. If you, too, are fascinated with the Shining, and you want to hear extreme fans talk about their extreme fan theories, this is the movie for you. It's important to note that this film never claims to be the definitive interpretation of the Shining, but rather observations and personal interpretations. <br><br>Some of my favorite observations include: The Shining is about the story of the Minotaur; The Shining is the foil of 2001: a Space Odyssey; and Kubrick was confessing he was involved in faking the moon landing footage. This final claim was backed up by the idea that the room number, 237, was chosen because the moon is 237,000 miles from the Earth (even though the real value is closer to 239,000). In the door to Room 237, there is a key that has a little flap with the words Room No. 237. The commentator stated that the only words that could be made using those same letters are Moon and Room, indicating a confession that Kubrick was involved in faking the footage. I suppose the commentator forgot the words or, on, moo, nor, mono, norm, morn, moor, or moron. <br><br>So, take this film with a grain of salt (or several). If you're looking for \"The Shining: explained,\" you're going to be woefully disappointed. If you're looking for a couple of fan theories that will tickle your brain and that you can kind of chuckle at, or if you're looking to make fun of fan obsession, there's something in this film for you. If you really want to learn more about The Shining, you can look up information on Youtube, or watch the film again and analyze it yourself!","user":"benjaminburt","rank":[36,42]},{"title":"Disappointed","rating":3,"date":"6 April 2013","review":"First of all, let me tell you that I've always found hidden messages, conspiracies, occult themes etc extremely interesting and it's something I love discussing about. I'm always very open minded when it comes to this kind of stuff and when i saw the trailer for this movie i just could not wait to watch it. The Shining is a masterpiece and just the thought of that it could have a much bigger meaning was just too good to be true.<br><br>Last night i finally watched it, and man was i ever disappointed. Like i said, I'm always opened minded when it comes to this kind of stuff, but the theories the creators of this film has come up with are so far- fetched it's almost embarrassing. They find a hidden meaning in every little thing and they never really seem to stop to question their own theories. Everything is taken for granted, and in my opinion, most of the claims are ridiculous; it holds no water. <br><br>To give you an example of just how ridiculous some of the theories are: If you watched Finding Nemo right now in the same state of mind as the creators of this movie watched The Shining, you too would find subliminal messages about everything from The Holocaust to the faked moon landing. It's just insane.<br><br>Also, all the different theories just turn into one big mess because there's so many of them, so it's hard to understand what they are actually trying to say. <br><br>However, big ups for making this type of movie. I just wish there were way more solid arguments and not all these extremely far-fetched ideas that don't really make sense. The creators might have some things correct (we'll never know) but for me it's just way too over ambitious and messy.","user":"christianrehn","rank":[134,176]},{"title":"Engagingly empty","rating":13,"date":"13 July 2013","review":"There is a lot of anger about this film on this page and, while I was considering whether to watch it or not, it was this passionate hate that made me interested to see it myself. It isn't across the board though, but whenever someone dislikes this film they seem to really dislike it. The problem seems to be that it appears to be a documentary about The Shining but it really isn't any such thing – but to watch it as one must be frustrating because you sit to watch that and have to listen to loopy theories about the film presented as (in your head) facts. I didn't have this approach because I had heard it was all about the theories rather than the film and as such I found it quite fascinating even if it is a little too long.<br><br>The whole film is people talking over clips from the film or other clips illustrating their point; the theories range from the film being about the Holocaust through to the Native Americans through to the Kubrick making it about his own involvement in faking the moon landings. It is all pretty nutty in terms of what it says, but it works because the contributors believe it and they speak with such passion and enthusiasm about their specific interpretations that it is hard not to get drawn in. There are plenty of moments where you find yourself starting to listen rather than mock – so specific things that are in the film that are attributed to meaning something and I started to wonder \"well, why is that thing there – it was chosen to be in this shot or be worn by this character, so what was that decision taken for\". Of course there are plenty of bits that do the opposite and are pretty laughable but generally I found myself quite drawn in by it. The length works against this in some ways because it does stretch things out more than it can bear but it was still engaging to me.<br><br>Part of the interest for me was seeing how it is possible to really find meaning in anything if you apply yourself. I was never a fan of school lessons where we had to tear works apart looking at each detail and talking about what it could possibly mean, rather than just enjoying the whole for what it does, and this is what happens here. The hunt for meaning and for symbols rewards those that are doing it, but ultimately they all have their point if their theory is true. The extent of their criticial analysis of each frame and second of the film is intense and it did make me wonder why they did it and whether they are still able to see the film for the great piece of entertainment that it is?<br><br>Room 237 is too long and lacks a clear point – it would have benefited from something topping and tailing it, but as it is I still found it engaging thanks to the passion and detail in the delivery; it doesn't mock these people it just gives them a platform and leaves the rest to us and them. I found it interesting even if ultimately it is quite empty as a film – ultimately if you dig in every corner looking for your agenda, you'll find enough to back you up – which isn't the same as you being correct. This is the message that I took from it and I found that message to be entertaining, but it is ironic that Room 237 is about lots of people seeking meaning in one film, all while it really doesn't do a good job of presenting its own meaning.","user":"bob the moo","rank":[49,62]}]