[{"title":"One of the most disappointing and unsatisfying experiences I've had at the theater","rating":3,"date":"21 November 2014","review":"I'm going to preface this review by stating the obvious (and what no doubt some may be quick to point out in defense of the sequel): look, it's \"Dumb and Dumber\" we're talking about here; not \"Citizen Kane\". But I feel like that disclaimer only goes so far, because frankly, the original \"Dumb and Dumber\" is one of the funniest films I've ever seen -- endlessly quotable, thoroughly likable. The key to the movie, I think, is that there's an underlying sweetness to the humor: Lloyd and Harry (Jim Carrey and Jeff Daniels) are never presented as malicious. Most of the bad stuff that happens to them is inadvertent, and often at the expense of trying to do a good deed (e.g. Lloyd trying to return the briefcase).<br><br>The new movie left me with a bad taste in my mouth, and it wasn't just the cheap, garish, ugly cinematography (the movie literally has the appearance of a Funny or Die or SNL sketch, with brightly lit, obvious set pieces; frankly, it has the aesthetics of a soap opera).<br><br>What left me reeling was the movie's cruel streak -- it turns Harry and Lloyd into deliberately mischievous cretins, and the inherent humour is drained from any potential scenarios as a result of their self- awareness. Roger Ebert used to talk about this a lot in his reviews -- it's only funny if the character isn't aware of what he's doing. So when Lloyd and Harry accidentally poison the hit-man hired to kill them in the original Dumb an Dumber, it's funny; when they deliberately sabotage a convention in \"Dumb and Dumber To,\" screaming at a woman to show them her naked body, or gleefully discuss being responsible for a man's death in front of his parents, it's...not funny. It's immature, it's crass, and most importantly, *it goes against the very thing that made these characters funny in the first place!*<br><br>I find it hard to believe all these original cast and crew members could re-assemble for a film 20 years later and so completely misunderstand the appeal of their own movie. <br><br>Beyond the inherent lack of humor in the mean-spirited hijinks these characters get themselves into this time around, many of the film's one- liners and jokes just aren't funny either. Sorry, but no matter how many times you repeat it, using the word 'butthole' isn't really that amusing.<br><br>The film also lazily falls back on repeating some of the original film's plot points and, indeed, one-liners (e.g. Lloyd's \"I like it a lawwwt\" or the mannerisms he makes when mixing a drink, identical to the first film). It confuses homage for humour, recycling gags without providing them in a fresh context, which simply reminds us of how much funnier they were the first time around.<br><br>And then there are the performances. The Farrellys said Jim Carrey hadn't seen the original movie for something like 15 years before agreeing to doing the sequel, and I'm not surprised. He doesn't seem to remember the comic energy he imbued Lloyd with in the original film; instead, he turns Lloyd into an unlikable, borderline creepy manchild with overly exaggerated stupidity and mannerisms. I think the simplest way of summarizing the mistake here is that they jumped the shark from 'dumb' to 'willfully stupid.' And, again to paraphrase the late Mr Ebert, this is the difference between funny and not funny.<br><br>This movie is not funny. It's not even mildly amusing in the manner in which I expected a long-delayed sequel may be. If it had been lazy and fallen back on repeating gags from the original film, fair enough; if it contained the same sweet-natured spirit of the original movie, then maybe that would have been its saving grace. Instead, it's not only unfunny, it's egregiously nasty and vile, and when I left the theater I just immediately wanted to wash the taste out.<br><br>I remember seeing \"Dumb and Dumberer: When Harry Met Lloyd\" years ago in theaters, hating it, and thinking how much better it would have been if they had convinced Jim Carrey to come back for a proper sequel. Imagine my surprise 11 years later that this movie doesn't have a single scene as funny as that one's Bob Saget cameo. What a complete and utter let- down this movie was.","user":"MovieAddict2016","rank":[312,437]},{"title":"Not what I hoped it would be","rating":5,"date":"17 November 2014","review":"Picture this: It's 20 years ago and you are at a party with stale pizza and warm beer. You plan on leaving early, then the life of the party shows up and makes it the most memorable party you ever went to.<br><br>20 years later, you plan a reunion and bring better pizza, a cooler filled with beer and invite everyone to the same place again. The same jokes are told and everyone leaves early. <br><br>That is what Dumb and Dumber is. I loved the first one so much that I am still willing to be happy with the reunion for old time sake. <br><br>It seems like all the variables were in place, and everyone just kept waiting for magic to happen. It seems like it was filmed well enough, and everyone thought they would fix it in post. Then in the edit room, everyone figured, \"Well they shot it how they want it.\" and left it long and loose. It was very paint by numbers, and everyone followed the script. In a movie where the script was just there simply as a framework to be expanded upon. The timing is off and there is no punch.<br><br>This may be what happens when modern studio execs watch too many dailies and start influencing the editing process too much, and take the funny away from the people they paid to be funny. Next time, light the fire cracker and walk away. Let the experts be experts.","user":"jbeattie21","rank":[80,108]},{"title":"Perhaps my expectations were too high for this recycled movie","rating":6,"date":"18 November 2014","review":"I was pretty disappointed in this movie, and I'm not really sure why. There were definitely some funny parts where I laughed, but the whole thing felt pretty....forced. Harry and Lloyd felt like exaggerated versions of themselves, the storyline was just OK, and I think what threw me off the most was that so much of the movie was recycled.<br><br>I mean, you wait this long for a sequel to an absolutely classic movie, you start wondering what brilliance they must be cooking up. However, a LOT of the jokes were literally the same as the ones from the original, like exactly the same. They also tried to recreate similar scenes, they even used a lot of the same soundtrack. While some may see this as nostalgia, I saw it as lazy film making. <br><br>I also didn't particularly like the silliness. The first movie had some random very silly parts that in context of the rest of the genuinely funny parts didn't bother me at all. However, this movie seemed to be made up of entirely ridiculous scenes. Almost cartoon like in the way it was done. Not a fan. It reminded me a little of the three stooges movie.<br><br>Overall, just not worth going to the movies to see. It's a shame Jim Carey and Jeff Daniels waited this long just to put out something so mediocre.","user":"scottyent","rank":[91,134]}]