[{"title":"I hear him.","rating":2,"date":"17 March 2018","review":"Gemma Shields (Jasmine Hyde) has a perfect privileged life with her husband Will (Richard Flood). When their son Joel drowns in their indoor pool, their life is turned upside down. Gemma has panic attacks which causes blindness, making driving a challenge. The couple both hear the child from time to time. They decide to get away from it all and go to a home being restored by Paul (Simon Cotton) a seemingly well adjusted person. They develop more problems. Gemma is an atheist while Will is not, which didn't weigh too heavily into the story. <br><br>I thought the film was going to a psychological thriller/horror, but turned out to be a mediocre drama with the characters lacking credibility. I would say if you haven't seen the classic \"Don't Look Now\" it is time to watch it instead. <br><br>Guide: F-word, sex, nudity (Jasmine Hyde)","user":"nogodnomasters","rank":[1,1]},{"title":"Started well","rating":6,"date":"15 February 2018","review":"I'd never herd of this Movie but thought I'd give it ago after watching the trailer which piqued my interest. Good solid acting throughout by all performers, good camera work and nice location kept me interested almost to the end. Unfortunately the last 30 minutes let the movie down for me, however I have scored a 6 based on the good acting.","user":"markhappyboy","rank":[3,7]},{"title":"WATCH OUT FOR FAKE REVIEWS...this is NOT a scary movie","rating":3,"date":"4 April 2018","review":"First...most of these other \"great\" reviews are from people who \"happened\" to join IMDB 3 weeks ago...and this is the only movie they have reviewed...you can figure that one out...I can say that didn't just join because out of all the movies they have seen, they had to leave a review on this one...check out the profiles of the other reviewers to see what I mean, there are a few legit ones.<br><br>52 minutes in and this is soooo boring....so far it's about a couple dealing with a tragedy and how they cope with it...it is NOT scary...it is NOT riveting...I'm out...not worth watching because I was looking for a good thriller and this is faaaaaaaar from that. Maybe another time when I was looking for something slow...today is not that day. <br><br>Drama...not horror, not riveting...bleh....","user":"Darktragedy","rank":[2,4]}]