[{"title":"A Tale Of Hope","rating":8,"date":"16 August 2015","review":"We all remember five years ago when the story of 33 miners trapped 700 meters underground caught the world by storm. Everyone was asking: Are they alive? How are they going to make it out of there?. I think there's no need to say how it ended. Since then we've gotten tons of news announcing a big budget film about San José's rescue. The thing everyone's asking right know is: Is it any good? <br><br>First things first: Patricia Riggen. Her direction is absolutely brilliant, managing to alternate between tense and emotional scenes almost perfectly. The acting as well is outstanding, with Antonio Banderas (Mario Sepúlveda) and Rodrigo Santoro (Laurence Golborne) being the most notable. Also, Cote De Pablo (Jessica Salgado) brings a big emotional push into the movie with a beautiful interpretation of \"Gracias a la Vida\" by Violeta Parra. Juliette Binoche (María Segovia) was also very good. In general, every actor and actress in this movie gave a solid performance. The screenplay is very well written, giving the characters a lot of development and personality. The soundtrack (Composed by James Horner) is also very good, mixing chilean instruments with big orchestra compositions that fit the movie perfectly. The CGI is OK, nothing groundbreaking, but it gets the job done.<br><br>It's not a faultless film though, it has it's flaws. The are times when the movie loses it's pace and gets slow. Also, the editing, being mostly very good, it's evident that there where scenes in the movie that were cut from the final product, an issue that can leave some viewers confused. There's a little bit of shaky cam as well, not a big complain, but it can get very disorienting at times.<br><br>Overall, even if it's not perfect, it's still a great movie that succeeds at telling the story of the 33 miners. Hopeful and inspiring, it's worth watching at least once.<br><br>8.4/10","user":"icsalgadomayorga","rank":[60,73]},{"title":"Well done story about what can happen when we all work together.","rating":7,"date":"21 November 2015","review":"Based on the true story of 33 miners who go into a mine in Chile to have a big rock get in-between them and the surface, and they have to survive long enough to be rescued.<br><br>I thought the movie was very detailed and complete about what the miners and their families went through during this ordeal. I never felt I missed any part of it.<br><br>It was never boring, always interesting, which I did not expect, but a lot went on in those three mouths and it was captured wonderfully on the screen.<br><br>Antonio Banderas was great as Mario, who kept the men together long enough to survive. <br><br>And even though I knew the outcome, the 33 makes you feel for each character, which allows suspense.<br><br>Well done and heartwarming, hitting on the rights spots and leaving me all filled up inside.","user":"subxerogravity","rank":[23,27]},{"title":"\"The 33\" is a true story dramatically and compellingly told.","rating":9,"date":"13 November 2015","review":"Mining is a dangerous business. Going deep underground to dig minerals out of the earth means subjecting yourself to extreme heat, back-breaking work and the inhalation of dust that can lead to the pulmonary disease of silicosis. If none of these kill you slowly, the mine itself can kill you quickly and without warning. Miners die from accidents caused by their equipment, gas leaks and explosions and, of course, sudden collapses of the rock surrounding them. All told, this difficult work kills thousands of miners every year (as many as 12,000 by one count). These facts and statistics are brought to life in the true story of the 2010 Chilean copper-gold mine collapse portrayed in the drama \"The 33\" (PG-13, 2:07).<br><br>The film opens with a retirement party for one miner who is about to complete 45 years of service to the private company that owns and operates the San José mine near Copiapó, Chile. Several of his long-time co-workers are at the party with their families. Their is shift foreman Luis \"Don Lucho\" Urzúa (Lou Diamond Phillips), experienced miner and natural leader Mario Sepúlveda (Antonio Banderas), father-to-be Álex Vega (Mario Casas) and Elvis Presley-loving miner Edison Peña (Jacob Vargas), among others.<br><br>On the morning of August 5, 2010, these men took the long and winding truck ride three miles into the mine, completely unaware that they were about to become victims of one of the worst mining disasters in Chile's history. Luis saw it coming, but the safety concerns that he expressed to the mine's manager went unheeded. That afternoon, a rock the height of the Empire State Building and the width of two of them fell into the mine, trapping 33 men inside. Seeing the devastating cave-in and its effects on the men and their surroundings, it seems like a miracle that none of the 33 died in the initial collapse. Although some would say that the real miracle would be if no one died in mining accidents, or at least if this collapse had occurred during off-duty hours, rather than the miners having to get trapped and suffer, while their families waited in agony for news about the fate of their loved ones.<br><br>It was those families who became the impetus for a full-on rescue attempt. Although Chile's President (Bob Gunton) is reluctant to get his government involved with an accident at a privately-owned mine, his new Minister of Mining, Laurence Golborne (Rodrigo Santoro) convinces President Piñera to let him go to the site and see what he can do. The families, led by María Segovia (Juliette Binoche), the estranged sister of trapped miner Darío Segovia (Juan Pablo Raba), had gathered outside the locked gates of the mining complex. These siblings, wives, mothers, fathers and friends demanded action, and action they got. In spite of the prevailing opinion that the miners were probably dead or would die long before they could be rescued, Minister Golborne brings in heavy-duty drills and works with renowned mining expert André Sougarret (Gabriel Byrne) to try and reach the miners before it's too late. Meanwhile, the miners ration food and try to keep each other's spirits up, even as several of them fight and suffer from various medical conditions, as hope fades that they will ever see their families again.<br><br>\"The 33\" is exceptional. Based on the book \"Deep Down Dark\" by Héctor Tobar, the film version takes few liberties with the facts and fashions a very compelling narrative. The screenplay succinctly, but effectively sets the stage and develops its characters – both above and below ground. We feel the desperation of both the miners and their families. As the miners' story unfolds, concurrently with that of their families and those attempting to rescue them, Patricia Riggens directs with great pacing (which is helped by nearly perfect editing). She also gets great performances from her cast and blends the talents and experience of well-known and little-known actors wonderfully. Although the movie did drag a little as it neared its dramatic conclusion, this is a film which tells its story with drama, sensitivity and even some humor and makes it relatable to anyone who ever came to the aid of someone in trouble. \"A\"","user":"dave-mcclain","rank":[36,46]}]