[{"title":"Great character study of two very different women","rating":9,"date":"12 May 2013","review":"Starlet is a character study very much in the spirit of films from the 70s. I think the director was influenced by the likes of Hal Ashby and Paul Mazursky.<br><br>A young, slightly aimless woman who has just moved San Fernando Valley, buys a vintage thermos flask at a yard sale from a cranky old lady and discovers $10.000 inside. After making a half-hearted attempt to give it back, she keeps the money, but then feels guilty and tries to befriend the old woman, who remains guarded to the point of hostility at the prospect of having her life disrupted.<br><br>The film doesn't ever resort to cosy indie movie clichés about the old passing on their wisdom the the young and life lessons being learned. It also doesn't exploit the young woman's line of business for cheap melodrama, as lesser films would. Both lead performances are wonderful and a cute dog always helps.<br><br>The film looks and sounds gorgeous and the director has a knack for what to show us and what to leave out. It's another good case for digital film-making. Talented independent film makers can now make great looking films for peanuts, which is just as well considering Hollywood has almost completely given up on making films for adults. <br><br>BTW. the trailer makes this look like another anodyne \"heart warming\" indie, full of laughter and whimsy, when really it's a much more melancholy, ambivalent and subtle film.","user":"Boris_Day","rank":[47,53]},{"title":"Starlet, starbright","rating":8,"date":"15 May 2013","review":"Twenty-one year old Jane (Dree Hemingway) is a porn actress simply trying to make ends meet in a cruel world, living with her two deadbeat roommates, one of them a fellow actress. After purchasing a vase from an older woman and finding over $10,000 inside, she decides that the least she could do is try and befriend the woman to provide some resemblance of joy and happiness in her life. I suppose friendship is the least you can offer someone after taking the money they didn't know they had.<br><br>The woman is eighty-five year old Sadie (Besedka Johnson), who spends her days calmly and in a true state of loneliness, tending her garden and quietly playing bingo at a senior's center. Meeting each other is a generational shock for the both of them in a way that doesn't revolve around the expected political/social norm changes. Instead, the details are shown just by the way they communicate and adapt to their own lifestyles accordingly. Jane would much rather go out of her way to get something more than textbook happiness, while Sadie feels disturbing consistent flow is a personal sin she can not commit.<br><br>Sean S. Baker's Starlet is a sweet, tender little story detailing a generation gap that I love to see explored. It's a film, too, that boldly shows a lifestyle in a way that isn't comical or condescending. While the adult film industry only makes up a small part of Starlet's overall focus, it nonetheless makes its view on the industry respectable and mature. The maturity of director Baker, even as he treads dangerously close to smug depiction, remains visible throughout making this a truly sentimental work.<br><br>The film is carried by the gifted performances of Hemingway and Johnson, who strike up a valuable, potent chemistry when they're on-screen together. Hemingway's brash qualities and aware attitude contrast boldly with Johnson's reclusive, control-freak persona, making for a relationship that is erected from more than smiles and good-feelings.<br><br>Baker adopts the style of filmmaking known simply as \"cinéma vérité,\" a style that heavily emphasizes the brutally honest, naturalistic side of life in filmmaking. I mention it here because the texture and look of the film plays a big role in its likability. Visuals are often mild and possess a sunny disposition, the filmic atmosphere is accentuated beautifully through the use of lens flare and flushed-out colors, and the warmness comes off as not a put-on, but a comforting feature.<br><br>There are moments in Starlet that hold deep, uncompromising emotional drama, mainly in the scenes at bingo, where a coldly detached Sadie is left staring at her bingo card as if she really cares what the odds are. There's emotional honesty in the scene because we can see she is not really happy and Jane knows it as well as the audience does at that point. The scene is beautifully captured and scored perfectly so as not to be too mawkish or too downplayed.<br><br>Ultimately, Starlet ends the way we kind of expected and its presence is more significant than a footnote but not so much as a genre-piece or a game-changing masterwork. It's short, simple, but above all, an effective illustration of emotion and tone as a coming of age story and a slight meditation on age and its downsides. It provides warmth and heart in its material, but most importantly, an unmissable soul as it shows both generations in full bloom and the naive impulses they give off that often prevent entire personal connection.<br><br>Starring: Dree Hemingway and Besedka Johnson. Directed by Sean S. Baker.","user":"StevePulaski","rank":[30,33]},{"title":"Unique and lovely","rating":9,"date":"25 November 2012","review":"\"Starlet\" is an absolutely lovely, unique film which I recommend without reservation. Masterfully directed by Sean (\"Greg the Bunny\") Baker, it stars Dee Hemingway, the daughter of Mariel, who plays Jane, a rather aimless but very sweet, very young, very pretty Angeleno who drifts through her life with two somewhat repellent roommates and a cute male Chihuahua named Starlet. <br><br>Things change when Jane buys an old thermos bottle at a yard sale and discovers ten grand hidden inside. The rest of the movie has to do with her relationship with Sadie, the old woman who held the yard sale (played by octogenarian Besedka Johnson, making her film debut!), and Jane pursuing her part-time job. <br><br>I won't say more, because the journey is worth taking. Hemingway and Johnson are a fantastic team. Jane and Sadie are an odd couple as odd, unexpected, and ultimately moving as any I've ever seen. The film is unpredictable and eye-opening and funny and poignant. I loved it.","user":"billyweeds-1","rank":[51,64]}]