[{"title":"Very realistic","rating":9,"date":"19 April 2018","review":"The acting and filmmaking are very realistic. It's almost like you're watching a documentary. A very important film to see and talk about in today's climate of tragic school shootings in America. Addressing bullying, the consequences of a destructive friendship on a young mind, adolescent alienation and the hardship in processing or communicating inner pain and turmoil as a result, and an adult generation that may be hearing but not actually listening.","user":"markpenney1976-28-188091","rank":[21,25]},{"title":"The Lonlieness of Adolescence, Close and Honestly Seen","rating":9,"date":"10 November 2017","review":"This film, dark and spare in the script and the actual cinematographic light cast on its main characters, succeeds in getting the viewer inside every character.<br><br>It makes clear the gnarly inchoate incompetence and pain of being thirteen year-old boys, friends since kindergarten, unsuccessful in 'socializing' in middle school.<br><br>Clear also is the wide gap parents try to bridge, when they try to fix their kids, objectify their children as problems to be solved by programs and processes, instead of wordless aimless love.<br><br>\"And Then I Go\" has a plot, which dimly echoes the Columbine school tragedy, but that echo isn't the point of the film at all.<br><br>It's about the hundreds of blows that being \"othered\" inflict upon a young and fragile sense of human worth, and the dark pearl that can rise from being hated or dismissed or being made small, a nick at a time.<br><br>It's about the tragedy of blind loyalty also. It's about a lot of things, some of which you will see, though I have missed.<br><br>Good movies are like that.","user":"jnathanj","rank":[24,33]},{"title":"Wasted Opportunity","rating":3,"date":"20 November 2018","review":"This should have been a 'boy' version of \"Eighth Grade,\" the wonderful little film by Bo Burnham from earlier this year (2018). And that's what the first half of the film felt like.<br><br>Instead, we ended up with your typical run-of-the-mill school shooting movie, which we've already seen with \"Elephant\" and \"Zero Day,\" among others.<br><br>It's really a shame because the lead actor who plays Edwin, a young man by the name of Arman Darbo, gives an AMAZING performance that would be Oscar nomination worthy in a better movie. It sincerely felt like I was watching a young Leonardo DiCaprio, as cliche as that feels to type.<br><br>The character of Edwin deserved a better storyline than being a hesitant participant in a school shooting. The depression, anxiety, and isolation of Edwin (with such a realistic portrayal) was an interesting tale to watch on its own that it just didn't need such a senseless, melodramatic plot device to carry the film.<br><br>Oh, and the ending sucked too. Just awful.","user":"LeafKing","rank":[5,9]}]