[{"title":"Beautiful, authentic and hard hitting","rating":9,"date":"8 February 2012","review":"This was a real highlight at Sundance, an incredible movie, has all the grittiness a street film should have, but with real heart. The story is familiar, but Sally El Hosaini's script keeps it fresh by introducing unexpected twists that keep you wanting to find out what's coming next. Without giving any of those twists away, this is basically a film about two brothers and how their relationship changes as the younger one who has always looked up to the elder grows disenchanted with him, while trying to define himself as a man (which he isn't quite yet). Setting that story in the midst of London gang life pushes the poignancy of the story with great effect. Beautiful cinematography by David Raedeker and the outstanding acting of James Floyd and Fady Elsayed make this a real treat.","user":"rez-950-571403","rank":[30,41]},{"title":"Totally absorbing","rating":10,"date":"30 March 2013","review":"James Floyd and Fady Elsayed rivet your attention as older and younger brothers, UK-born of Egyptian parents, who have hopes and, therefore, frustrations living in council-houses London. As with so many young, poor males in that milieu, the only immediate path to some kind of decent income is in the gang activities commonplace in their part of town.<br><br>And yet this movie avoids every clichéd turn of plot suggested by the familiar premises of the story. The drama is consistently fresh. The developments, though surprising, are invariably right. This movie will hold your attention and its characters your sympathy from the opening scene to the last blackout.<br><br>I'd also mention that a lot of the movie is in closeup so it helps that James Floyd is very easy to look at. The most perfect nose without rhinoplasty I ever saw. Jim Smith","user":"jimsmithnewyork-646-578370","rank":[14,19]},{"title":"Great acting performance. Too clean to be \"real\"","rating":6,"date":"22 March 2013","review":"MBTD has a great cast, not a single complaint about it. The young actors are truly phenomenal. The story of two brothers in Gangland London doesn't ring that right to me. This is not gangland London. What the producer wants to show is the under layer of society where kids too mature for their age get in the lowest ranks in the hierarchy of drug dealers and their rivalry to make it big or make it out. But it's too clean, too polished and too polite.<br><br>El Hosaini goes methodically by a list of what are considered controversial topics just enough to charm but not offend the audience. Events are nicely sown together to make festival goers feel that this movie is \"deep\". Played out in sleek designed apartments and clean street scape instead of rough neighbourhoods governments neglect and fail to maintain . The director doesn't really understand the dynamics although apparently she spend 5 years doing research for the script. It looks like she spend a lot of time reading about it. The world she tried to capture is far more gritty than this. It's a nice watch but in no way La Haine where you see desolation, despair and boredom with a life that will have nothing else to offer. If I could I would rate this 8 for the cast and 5 for the script.","user":"MdlndeHond","rank":[18,27]}]