[{"title":"Great Performances Lead a Not-So-Great Film","rating":6,"date":"1 May 2016","review":"Michael Shannon as Elvis and Kevin Spacey (the king of impressions as Nixon? You sold me. Elvis &amp; Nixon tells the untold 'true' story behind one of the most famous photos of all time between Elvis and Nixon at the Oval office. Shannon and Spacey deliver captivating performances as two icons in what is otherwise a very forgettable film.<br><br>At only an hour and twenty five minutes, Elvis &amp; Nixon is a rather short film that is based on a true story, but it doesn't feel like it. It takes a while for the film to get going as it decidedly focuses primarily on Elvis for the first 45 minutes or so leading up to the meeting. You get glimpses of Spacey's Nixon here and there but we don't get the two on screen together until nearly an hour in. I would have much rather watched a full hour and a half of these two guys talking to each other. The story of Elvis' friend Jerry Schilling or anybody inside the White House, I didn't care about.<br><br>I understand you need to at least follow the true story to a point, but no one truly know the events that went down that day, so you might as well structure it to the strengths of your film. No matter, the time spent on screen with the two leads is a joy to watch. They are far from an SNL impression as they both create their own distinct interpretations of Elvis and Nixon. Even if it's an extremely slow burn, the last 30 minutes are definitely worth watching. If only a better movie surrounded the two great performances.<br><br>+Two lead performances<br><br>+Entertaining final 30 minutes<br><br>-Extremely slow burn<br><br>-Focus on side characters<br><br>6.6/10","user":"ThomasDrufke","rank":[35,45]},{"title":"Elvis & Nixon","rating":6,"date":"8 July 2016","review":"Elvis &amp; Nixon very much relies on the performances of Kevin Spacey and Michael Shannon, and thrives on what they bring to the eventual meeting between both men. The movie is based on a true story that's better documented than is suggested here. Making Elvis &amp; Nixon fanciful and fabricated in spite of how unusual this event actually was. Which is fine, because most biopics and fact-based dramas exist on creative licence. Although this is a movie that could have been equally successful had more of the facts been more closely adhered to in the script. <br><br>What matters, however, is how interesting and appealing Spacey and Shannon make the film's central characters. But we find a way into their respective worlds by way of Colin Hanks' Bud Krogh and Alex Pettyfer's Jerry Schilling. Schilling in particular, whose fingerprints are evident throughout the movie (\"me and a guy named Elvis\" is a line of dialogue at one point\") and who acts almost like an audience surrogate.<br><br>Schilling, who we first encounter working at Paramount Studios, is encouraged back \"in\" with Elvis as we are taken on a journey to the White House that's foreshadowed in our first glimpse of the man, himself. Watching Dr. Strangelove on one of his three televisions in a nicely recreated Graceland television room. But this isn't just a reference to one of Elvis's favourite movies, the scene from Kubrick's film that's used here foreshadows the nature and tone of his meeting with Nixon. No fighting in the War Room? How about karate in the Oval Office?! <br><br>Along the way, Shannon, who doesn't resemble Elvis but embodies the role with gestures small and grand, speech patterns, glances and a physicality that's undoubtedly been studied, becomes believable as Elvis. This isn't a caricature. The caricature is what Elvis actually became. Which is appreciated in the way he expresses concerns about his identity to Schilling, and in a touching monologue about his stillborn brother, Jessie Garon. <br><br>Shannon finds genuine nuance and pathos in Elvis. Although Liza Johnson's direction doesn't quite allow the excitement and elation of meeting Nixon to be juxtaposed with crushing lows or an indication of how such ultimately manifested itself in Elvis over subsequent years. We see him disappointed when things aren't going his way and when meeting Nixon seems lost at one point, but standing slumped and resigned isn't enough to encourage deeper sympathy for Elvis. Whilst the ultimate irony was missed in failing to depict his own problems with drugs. <br><br>As Nixon, Spacey also finds nuance and manages to make the former President larger than life from behind a desk and despite his reservations about meeting Elvis, and just about everything else. He has less to work with than Shannon, but Spacey gets Nixon just right and manages to refrain from caricature whilst exploring amusing traits and mannerisms. Both physical and psychological. <br><br>Beyond the two central characters, the screenplay and some variable stock footage encourages political and cultural touch-points that aren't dwelled upon. Although it's clear that Nixon isn't adverse to finding good PR opportunities or impressing his daughters. A trend that crops up throughout the movie, with Elvis using such as a free pass at his convenience. For him, good PR opportunities are also valuable. <br><br>In many ways, however, Elvis and Nixon suffer the same issues with loneliness, isolation and concerns about their image. Which is something Elvis is portrayed as being more in touch with than Nixon, who laments about not looking like a Kennedy and tries to boost his ego by asking Krogh if he could take Elvis in a fight. Elvis, on the other hand, is aware of his image and the performance that's required just to be Elvis Presley. Which is something that was also expressed by Michelle Williams' Marilyn Monroe in Simon Curtis' 2011 film, My Week With Marilyn. <br><br>By the time Elvis and Nixon eventually meet, both characters have been fully established, and whilst the vignettes along the way are both funny and geared towards comedy, some miss the mark completely. Such as a clandestine meeting between Elvis and Nixon's aides, that hints towards All the Presidents Men but plays more like a parents' meeting. Although Elvis's visit to a doughnut shop that's populated by a streetwise and vocal black clientele shows him comfortable with all walks of life and able to keep his ego in check. <br><br>This is in stark contrast to his meeting with Nixon, where Elvis is far from humbled and tries to impress upon the President with bizarre notions and one-upmanship. In one shot, Elvis seems to dwarf Nixon in the way both men are framed. But Spacey plays the President with quick wit and more than a little bemusement at what's in front of him. He sees what see in Elvis. But can't see that he's playing him for his own gain. <br><br>Unfortunately, the pacing and editing falters during the final act, with Schilling's personal dilemma of getting home to his girlfriend breaking the meeting up at one point. Whilst Evan Peters and Johnny Knoxville's Dwight Chapin and Sonny West, respectively, linger in thankless roles. <br><br>What's also noticeable is a lack of Elvis's music in the film's soundtrack, which is quite good regardless. Although Ed Shearmur's score is transparent and obtrusive at times. But Elvis &amp; Nixon isn't about Elvis and his music. It's about a quest to find something fulfilling in his life. Which is expressed with profound sincerity in the way Michael Shannon plays Elvis. Getting under his skin and contrasting charisma and personality with a pensive nature and moments of uncertainty. It's a warm, affectionate and earnest performance in a movie that's skewed towards comedy, but has an acute understating of not only Elvis and Nixon, but celebrity and politics.","user":"JohnnyWeissmuller","rank":[15,18]},{"title":"The true story?","rating":5,"date":"27 July 2016","review":"I had heard the story of Elvis' meeting with Nixon, but not how it came about. How true this story is, is open to conjecture. The wonderful Kevin Spacey is totally acceptable as Nixon. The look, the voice and the stooped deportment, are spot on. Unfortunately, I never for on moment thought that I was looking at Elvis. Michael Shannon's wig was about the only thing that was on the money. Elvis was very handsome, with tremendous charisma, and a good build. Shannon had none of that going for him. Colin Hanks is improving every time I see him. His portrayal of a Nixon aide was nicely drawn. Johnny Knoxville was rather wasted, as part of the Elvis 'mafia'. It's not a bad bad film and is not padded out too much, though it would probably have made a better television show.","user":"mic-daley","rank":[17,21]}]