[{"title":"Surprisingly Interesting & Nice !!","rating":6,"date":"4 June 2013","review":"To start with, a very well sorted plot, story and good screenplay. The movie keeps getting you interested even in some dull scenes. Overall a very well written script and screenplay.good acting by Ario BayuI thought he did an excellent job in this movie.<br><br>Yeahaction is missing in some scenes but there is enough to enjoy !! would have been a great movie if there were some more action packed scenes. I don't want to take away the credit from the director.he did a nice job but he could have done better with all the ingredients he had (plot, story, actors and locations).nevertheless decent action flick.<br><br>Recommended from my side :-)","user":"premkishan-k","rank":[18,29]},{"title":"Not The Best, But Not Bad, Watchable...","rating":6,"date":"8 May 2013","review":"Another movie from far east, Indonesia.<br><br>Clearly this is an action movie, if you like action, this movie could be your weekend options. Quite entertaining. A lot of action in there.<br><br>Tells the story of a special forces anti-terrorism cooperation with an American citizen solving terrorism cases.<br><br>Speaking of the actors may not be so well known, but their acting is quite good.<br><br>In the end, the film is worth watching. presents the story from the largest Muslim country in the world. Where many terrorists were arrested and prosecuted.<br><br>From 1 to 10 I give 6.5","user":"diyan_kecil","rank":[15,27]},{"title":"Pretty Good Action Flick","rating":6,"date":"17 September 2013","review":"A Muslim detective teams with an American (Kellan Lutz) posing as a graduate student to find the man (Mickey Rourke) behind a series of deadly terrorist bombings in Indonesia.<br><br>Although this seems in some ways to be an inferior-grade \"Bourne\" film, it has plenty to offer: a fresh lead actor, a great villain (Rourke, as a \"klepto-terrorist\") and all the action you expect from such a film -- explosions, gun fights and car crashes.<br><br>My biggest issues were not really with the film itself (which I thought was pretty good), but more technical matters. The DVD/BD seems to have not had the volume synced properly (conversations are too quiet, action too loud) and the subtitles are hard to read -- both because they are small, and also because they leave the screen too quickly. I would have enjoyed the film much more if these problems were corrected.","user":"gavin6942","rank":[10,17]}]