[{"title":"The Great Wall","rating":7,"date":"13 February 2020","review":"Matt Damon, given his predicament and the backlash of being a white person cast in a move that was based in China, still gave a great performance. The plot was nothing special, but I throughly enjoyed the concept. The cinematography was beautifully shot and the colors throughout the movie make it very pleasing to the eyes. Without the camera work, this would not be a good movie. I think this movie is still worth a watch.","user":"MR_Heraclius","rank":[39,40]},{"title":"The Opposite of White-washing","rating":10,"date":"19 July 2017","review":"I'm Chinese and I don't think to have Matt Damon as the main character is a white-washing or anything racist. Some foreigners are needed to show foreigner's perspective of the magnificent China : the Great Wall, the weapons, the army, etc.<br><br>While the CGI, costume designers and production staffs are whites, 90%+ of the casts are Chinese. Even the directors are Chinese. The director Zhang Yimou pick Damon by his artistic choice. This is not a Chinese film, nor a Western film, this is definitely a collaboration, which prove that if we human, from East, and West, if we trust each other and to work together, we could achieved great things. If even Chinese are not offended, why white people called this film racist?","user":"henhelena","rank":[233,297]},{"title":"A Very Entertaining Film","rating":8,"date":"29 December 2016","review":"As a constant film goer I was really impressed with this film. It was entertaining. The story worked well. The acting was great. And the effects were really impressive. I watched it on a big screen in Bangkok and enjoyed the experience. The sound was equally impressive. <br><br>I just can't understand why the really negative reviews abound. Some are cursing it for having foreign actors. Others about the political situation etc. And the poor director is even getting a caning. <br><br>The story is about a legend. And it was wonderful to just sit back and let someone tell a story. I nearly didn't go because of all the bad reviews but I am glad I went and made up my own mind.<br><br>Go and see it.","user":"captainpat","rank":[448,669]}]