[{"title":"Morally ambiguous characters in a deceptive, complex thriller plot","rating":9,"date":"9 February 2013","review":"In \"Side Effects\", Emily (Rooney Mara) is feeling hopeless, suffering from prolonged effects of abandonment issues, unsure how to proceed in her life. Her husband, Martin (Channing Tatum) has just come home from prison, serving time for insider trading. But Emily doesn't know what she should be feeling; Emily doesn't know how to feel what she should be feeling. Psychiatrist Dr. Jonathan Banks (Jude Law) is exactly what the doctor ordered.<br><br>For those of us who watched \"Contagion\" (2011) and wanted to focus only on Jude Law's morally ambiguous blogger, Alan Krumwiede, we have finally gotten our wish. Law's morally ambiguous Dr. Jon Banks and Mara's psychologically ambiguous Emily are the only two main characters. There is only one story to follow.<br><br>It starts off with some strange camera angles (Steven Soderbergh serving as his own director of photography as he has for the majority of his films) but then settles down as a thriller, or what will become a thriller once we get to know the characters better. Emily has tried many antidepressants in the past but most leave her with undesired side effects: nausea, dizziness, or lack of a sex drive. Won't Dr. Banks please prescribe her something different? Sure, how about Ablixa, the new medication which Dr. Banks is being paid to try out on patients.<br><br>And although we now think we know in which character evil lies, we do not. Dr. Jonathan Banks is singularly the most complicated, interestingly created character in recent times. He's modern, selfish, compassionate, professionally-oriented, family-oriented, has respect for the legal system, and will go to extremes to distinguish between right and wrong. He's the focus of this character-centric, film noir thriller which uses Mara's Emily as the vehicle for the plot.<br><br>A crime is committed. It's bad, really bad. But the question is not who did it, the question is, who is guilty? In answering that question the film weaves from deception through twist to deception, never ceasing our questions of what is morally right, what is morally wrong and who is guilty? The screenplay is incredibly well-written, creating characters that amaze us, disappoint us and deceive us all the while being a part of an interesting and complex story. The dialogue fits with that theme, using words like \"hopeless\" to tie multiple characters together - conceptually not physically.<br><br>It's more of an edge-of-your-mind thriller rather than an edge-of-your- seat thriller. Never really scared, always questioning the moral and psychological behaviour of these characters. The ending takes some strange, sexually-charged turns, and perhaps a bit more conclusive than I was originally expecting, but don't worry, you can still question where the line is between right and wrong and when each character crossed it.","user":"napierslogs","rank":[191,234]},{"title":"\"Did You Try to Hurt Yourself?\"","rating":7,"date":"10 February 2013","review":"In our pharmaceutically inclined society, side effects are ever-present hazards of prescription drug usage. Whether they are minimized in print, or spoken in a hushed tone at the close of television commercials, side effects have become a shady companion of prescription drugs. Side Effects, Steven Soderbergh's alleged final film, focuses on the consequences visited upon a young couple after the side effects from the wife's medication cause her to commit an alarming act. As the chasm opens beneath this young woman, her psychiatrist struggles with his responsibility for her predicament, and confront his lingering suspicion about his patient's state of mind.<br><br>Ever the auteur, Soderbergh remains delightfully unpredictable with this latest feature. Side Effects initially presents itself as an indictment of the pharmaceutical industry, wearing its heavy-handed message on its sleeve, but promptly converts into a psychological suspense thriller. Soderbergh stares you directly in the eyes while he rips the rug from beneath your feet, sending you spiraling toward a conclusion that is equally unexpected and pleasing. Soderbergh and screenwriter Scott Z. Burns (Contagion, The Bourne Ultimatum) channel Hitchcock, creating an in-depth narrative that remains unpredictable until its final scene. <br><br>Soderbergh is known for generating a positive film environment for his cast, and maximizing the actors' potential in his films. Although the cast for Side Effects is comprised of actors who have previously provided impressive performances, each actor presents a character that rivals any prior roles. Rooney Mara plays the young woman at the epicenter of the conflict. Mara is extremely engrossing, creating an aura of discontent and depression within her situation. She acts as the film's catalyst, holding all the characters together while prompting them toward their conclusions. Attractive, graceful, and erratic, Mara is the wounded girl who isn't all that she seems.<br><br>While the film's driving force is Mara, Jude Law is its principle focus. As Mara's overwhelmed psychiatrist, Law provides his most empathetic role to date. Law establishes a flawed character who struggles with the consequences forced upon him, and transforms into a protagonist worthy of our admiration. Law and Mara provide such intriguing characterizations, Soderbergh seems to have difficulty deciding which to devote more time to. The scenes they share are the most arresting in this film.<br><br>There are few things more satisfying than a film which receives little attention, but creates an unexpectedly entertaining experience. Though Soderbergh has billed Side Effects as his swan song, he confirms that he is a cinematic mastermind in a film that would be an impressive conclusion to an eccentric career. Indulge in this unconventional thriller; you won't mind the side effects.<br><br>flickermotion.blogspot.com/","user":"the_grand_lebowski","rank":[117,144]},{"title":"Being Fooled is Part of the Fun","rating":8,"date":"8 February 2013","review":"I read an article that said that, with Side Effects, Steven Soderbergh wanted to return to the old suspense classics like Jagged Edge and much of Hitchcock, psychological twisters that aren't made much anymore.<br><br>I suspect that's because today people expect vampires, car chases or buckets of blood to justify the price of a ticket. Well, I too remember those old classics and I loved them. Side Effects is a worthy addition but be warned that it's a thinking person's movie not a chainsaw caper.<br><br>I'm surprised that so many people mention the twists and turns. Yes, there are some but not that many and they're what makes it all so fascinating. You think you know what's happening -- but you don't! What I especially enjoyed was the gamesmanship the different characters displayed. It's like a chess match with three people and more to kibitz.<br><br>And yet as we travel through the story, the surprising bits do make sense and we wonder why we didn't think of those things before. We're deep into the heart of mental illness and psychopathology. Almost every character has secrets or hidden motives they would not like to see the light of day. Although the main character seems at first to be the troubled young wife, it becomes clear that it is Jude Law's character as the shrink who is struggling to find the truth and do the right thing.<br><br>Just when you think everything that can go wrong for him has, the tide begins to turn and it's Oh My Gosh. Just like a Hitchcock film, you have a guy to root for and wonder how he will ever work his way though. I expected a different -- more startling -- ending, but there is the promise (perhaps?) of more horror to come.<br><br>Yes, let's definitely have a sequel! Okay, Stephen?","user":"kkboyd-603-991354","rank":[179,226]}]