[{"title":"Good performances, weak script, unoriginal plot.","rating":3,"date":"7 April 2013","review":"I cannot recommend this movie. I am a fan of all the lead actors. All play their parts well but in this case, the sum is far less than the parts! It is a very complicated movie and I soon lost my way. If there was a clever plot to keep me entertained then I'm afraid it went over my head. My main criticism is that I was always aware that I was watching a movie. Not once was I drawn into and absorbed by the action. The dialogue was unoriginal and to some extent the overall outcome was quite predictable. Oh, and I hate it when a man suffers severe gunshot wounds but moves around apparently uninjured a few scenes later; the rest of us mere mortals spend a week or two semi-conscious in hospital! Nothing new in this movie; don't waste your money.","user":"nickstone8","rank":[49,62]},{"title":"Not bad at all.","rating":7,"date":"10 November 2013","review":"I have to disagree with Nick Stones review. Either he wasn't watching it at all or his interpretation was somewhat misguided.<br><br>I found this to be a good movie typical of the type of English crime drama i have come to expect over the years.<br><br>I thought the plot was well thought out and the twists and turns quite fascinating.<br><br>Yes one does have to keep focused on whats going on but that is the whole idea.<br><br>It kept me glued to the screen wondering who was going to do what next.<br><br>The ending for me was an ending i believe was appropriate. 3/4 of the way through i had a feeling it would end that way.<br><br>I was left feeling this was not a waste of my time and, unlike Nick Stone, i would recommend it.","user":"rex-170","rank":[39,49]},{"title":"One slick British Crime Drama not to be missed","rating":7,"date":"9 April 2014","review":"I also disagree with Nick Stones review.<br><br>Slow to start - definitely not. I was glued to the screen from the moment the film began.<br><br>This was a slick British crime drama that I've come to expect from the Brits. No one writes mystery and crime drama like they do.<br><br>And you could not have asked for better actors to play their respective roles; from Rufus Sewell, Gabriel Byrne, to Toby Stephens they all provided excellent performances.<br><br>The one thing I love about British crime drama is that many writers fail purposely or not to explain everything, they leave the audience to figure out various parts of the plot line, which I personally like and approve. And this movie had a lot of plot twists and unexpected results that will have your jaw dropping.<br><br>I recommend this movie to anyone who appreciates British crime drama.","user":"DJNormand","rank":[17,20]}]