[{"title":"A Half-Baked, Woman-In-Jeopardy, Home Invasion Thriller","rating":5,"date":"22 September 2014","review":"Idris Elba and Taraji P. Henson have squandered their considerable thespian talents on \"No Good Deed,\" a half-baked, woman-in-jeopardy, home invasion thriller that springs few surprises during its ephemeral 84-minutes. Ironically, Elba and Henson shared credit as executive producers, but they didn't serve themselves adequately enough with this mediocre but atmospheric crime drama. Despite some genuinely suspenseful moments in this PG-13 rated tale, veteran television director Sam Miller and \"96 Minutes\" scenarist Aimee Lagos ask us to believe that a former lawyer who dealt with cases concerning violence against women would behave as naïvely as Henson's hare-brained heroine does. A suburban housewife and mother with two children, one of whom is an infant, Terri Granger quit her job as a prosecutor who represented battered women only to become a battered woman. The conduct of Henson's damsel-in-distress will make your jaw drop in sheer disbelief. It is difficult to believe that a woman, who once prosecuted vicious felons like the criminal Elba plays with such chilling intensity, could behave in such a foolhardy fashion. Less back-story with regard to Henson's Terri Granger would have been better than more. Had she simply been little more than a housewife, her actions would have been more credible. Meantime, Elba is suitably menacing as a charismatic but ruthless predator. Early on, a parole board member describes Elba's serial killer character as a \"malignant narcissist.\" Naturally, Miller and Lagos amass all the surefire suspense elements as well as the clichés to heighten the experience. Of course, movies like \"No Good Deed\" dispense with realism as readily as they exploit the artifice designed to make you squeeze your fists with white-knuckled tenacity. The robust cast and the nerve-racking predicaments that their characters wind up in are the kind of fodder that inflames audiences.<br><br>\"No Good Deed\" opens with Colin Evans (Idris Elba of \"Prometheus\") appearing before a Tennessee parole board. Authorities believe Colin murdered five women, but they have no evidence to convict him for any of those heinous crimes. Instead, they have managed to bust him for manslaughter. During a brawl in a bar, he killed an adversary. Since then Colin has served five years in the big house, and he touts his record as an exemplary inmate who taught other inmates how to read. Nevertheless, a skeptical parole board refuses to accommodate him. While he is being hauled back to prison, Colin disarms one guard and then murders both of them. You'd think that prison officials would have assigned more competent cops to guard him, but then we wouldn't have \"No Good Deed.\" Later, Colin tracks down a former girlfriend, Alexis (Kate del Castillo of \"Bordertown\"), and strangles her in a fit of jealous rage in her own house after she lies to him about flirting with another man at an Atlanta restaurant. Colin appropriates her vehicle, but he crashes it during a noisy thunderstorm. Despite from his inferior driving skills, Colin qualifies as a dangerous but resourceful villain with no qualms about murder most foul. The same cannot be said for our heroine.<br><br>Terri Granger (Taraji P. Henson of CBS-TV's \"Person of Interest\") finds herself at home alone with her two children, young daughter Ryan (newcomer Mirage Moonschein) and a baby boy Sam, after her husband Jeffrey (Henry Simmons of \"Taxi\") takes a trip to visit his ailing father. Since Jeffrey is leaving her, Terri has invited her closest friend, Meg (Leslie Bibb of \"Iron Man\"), to spend the evening with her. They plan to treat it like a girl's night out. Colin stumbles onto Terri's front porch with a cut on his temple, and our heroine literally lets him have the run of her house! Colin does everything that he can to lull Terri into a false sense of security. Terri even cleans up the cut on Colin's temple. Of course, the familiarity with which she receives this stranger is hopelessly absurd. Meg flirts with Colin as he lies to them about himself. Unfortunately, Colin grows impatient with Meg when Terri is out of the room and gives her the same treatment that he gave his girlfriend. At this point, Colin brandishes a pistol and forces Terri to pack her kids into their car and give him a ride. Later, during their ride, Terri flashes her high beams at a policeman. Incredibly enough, Colin doesn't notice this act, and the cop pulls them over. The cop asks Terri to step out of her car. Terri has every opportunity to explain her predicament, but she fears that Colin will kill her infant son. This makes you wonder why Terri put herself in such a predicament. Impatiently, Colin takes matters into his own hands before Terri can do anything else to sabotage his plans.<br><br>Veteran television director Sam Miller has a knack for staging action, and he makes this implausible hostage thriller look exciting. Ultimately, everything boils down to a one-on-one fight between Terri and Colin. They struggle for possession of Colin's automatic pistol in a darkened room at another house. Essentially, this is a David and Goliath bout. Nevertheless, desperation turns Terri into a superior adversary, and their fight is a down and dirty match. Inevitably, just when she thinks she has Colin down for the count, he pulls a \"Halloween\" and catches a second wind. Nothing about \"No Good Deed\" except its big twist reveal in the final scene is groundbreaking. Sure, that surprise at the end will make you turn your head, but it constitutes more of a cheat than a coincidence because there is no way that you can see it coming. Again, Terri's lack of common sense puts her at risk more than anything skillful that Colin did. \"No Good Deed\" lives up to its title. Interestingly enough, the studio that produced this lackluster thriller—Screen Gems—had so little faith in it that they delayed its release for two years.","user":"zardoz-13","rank":[14,16]},{"title":"Good Movie","rating":6,"date":"14 September 2014","review":"Idris Elba was the man, as a psychotic woman hating murderer who escapes jail and through a series of events, cross paths with Terri, played by Taraji P. Henson, who's was in a troubled marriage and vulnerable to the killer's charms.<br><br>It Reminded me of the 1986 movie, Extremities with Farrah Fawcett as the female victim being taken hostage by a criminal looking to steal her \"goodies\" <br><br>I thought No good deed was a lot more cleaver than most movies of this kind. In certain places, it has to fall into line of genre's plot (woman alone in the house without her man, then a scary bad boy comes to the door and charms his way into the lonely women's house), but the movie surprised me by putting a little ore substance into the female victim, by making her life more interesting than usual, and it helps having an Oscar nominee like Ms. Hensen play the role. A fact that was not used to advertise the movie as much as it should have. Definitely a better played out Victim than I've seen before. <br><br>A decent plot and a great thriller. I recommend giving it a shot.","user":"bbickley13-921-58664","rank":[33,45]},{"title":"What it's supposed to be - very entertaining","rating":7,"date":"22 January 2015","review":"I read a lot of reviews before watching, and truly was surprised as this movie was MUCH better than the detractors let on. The acting is great, the storyline, though part of a formulaic genre, is well thought out and moves at a great pace, the dynamic of action/release/suspense/reveal is well timed, and unless you're unbelievably difficult to entertain, you'll not want to be interrupted during any part of this film. Are there plot holes? We debated this and decided it's truly up to your point of view, but the events are actually all completely plausible. Summarily, unless you go into movies for the sole intent of picking them apart and finding things to not like, I guarantee you will be surprised, uncomfortable, freaked out, worried, excited, and ultimately entertained by No Good Deed.","user":"vettworx","rank":[16,21]}]