[{"title":"Everyone that rated this below a 7 are why can't have nice things.","rating":10,"date":"23 February 2019","review":"Oh my god. This has to be the most misunderstood Pixar film ever created.\nI never realized how much hate this movie had gotten until now, but, reading through the reviews, it just isn't justified.\nAll of these are parents complaining about it being too intense for young children, but, this film isn't for them. I found that it reached out to a completely new audience, one that Pixar hasn't really touched upon recently, and that is pre-teens and teenagers that suffer from depression.\nI am now 14 years old, and this film came out at just the right time for me, when things were taking a turn for the worst. I was going through depression and suicidal thoughts for reasons that I don't want to talk about, around the time in which this film was released. I hadn't seen a disney film in quite a long time, and my little sister really wanted to see this one.\nLooking at all the generally positive feedback, I decided to go see it with her.\nThe opening sequence was possibly one of the best Pixar had done since Wall-E. It was beautiful and cinematic, and just adorable. Riley had some pretty gorgeous facial expressions and detailing for an animation standpoint.\nAs the film moved on, I started to realize how well this film related to my life, and how well riley related to me as a character. Pixar was very subtle with it, but, managed to develop Riley's character so well, with her barely being on screen.\nThe characters themselves were shockingly complex, especially sadness and joy. (Joy has a brilliant character design, with blue eyes and blue hair which we'll get to later.)\nThe main plot basically revolves around a pre-teen going into a state of depression after moving to her new home, away from her friends, her hockey team.\nDepression, in my experience, isnt what it says it is. To me, it is a complete lack of any feeling whatsoever. When joy and sadness basically lose control of riley for awhile, this perfectly captured the \"what is going on inside their head\" meaning at the beginning of the film. Joy and sadness are the two most important emotions, and riley didnt have them anymore. A complete lack of emotion, a state of depression.\nThe rest of the film after that was enjoyable, and a certain character whom I was almost sure going to be a twist villain after that monstrosity that was 'Frozen', turned out to be my personal favorite character in the film. Everyone's had some sort of imaginative personality growing up. I had one.\nIt helped me cope with stress, I talked to it when I was mad about something, and whenever no one seemed to want to talk to me for whatever the reason, she was always there. That's why Bing Bong's death was just so hard to watch, because of how painfully true it is. I guarantee that 99% of the people on earth have completely forgotten about their imaginative friends growing up. The thing is, he didnt die, he was completely forgotten. When you think about it, it seems so much worse than dying. After that, joy seems to have forgotten about him as well. He isnt mentioned ever again in the movie, but, I'm kinda okay with that. If the movie forgets about him, the audience does as well, which creates an illusion.\nNow, let's talk about the ending.\nWhen riley returns home to her worried parents, she seems emotionless. Then I realized something, a slow realization that happened throughout the final scene in the film.\nTrue happiness cannot exist without sadness.\nThis realization is depicted in one of the most brilliant forms ever, mixed emotions. As riley is growing up and maturing, mixed emotions become apart of her and her core memories. This symbolizes maturity and complexity as you grow up.\nThis film got me to open up to my parents about my depression and anxiety, and I feel like I have matured just like riley did in the film. Pixar did a brilliant job as depicting our emotions, personalities, and maturity. I love this film so much, and it changed my life.","user":"havenferrer","rank":[73,88]},{"title":"I cried like a baby..","rating":9,"date":"14 June 2019","review":"I watched the movie long time ago, and I've just rewatched it today.\nFor kids it will be a funny movie with no meaning maybe!!\nBut for an adult, its so true!! You lose your childhood personality you change you feel sad, i mean it literally touches my soul\nGreat movie for both kids and adults.","user":"gloriesalbuainain","rank":[26,30]},{"title":"I feel like everybody has missed the point","rating":9,"date":"9 July 2016","review":"I am not normally one to write reviews, but I couldn't help reading several for this film on this site that just did't seem to understand where I think the film was supposed to be coming from.<br><br>The majority of the complaints I saw were that the film was 'too depressing for a children's film', but whilst I see where they are coming from in some regards, every child who I have seen watch this film (I work in a cinema) has absolutely loved it, and laughed out loud almost constantly. They are not old enough to realise the message the film is trying to convey: that life isn't all about happiness. I applaud the attempt from Pixar to make a film that is not only hilarious in places, but is also a major comment on what life is like to be a younger teenager, transitioning through one of the most important moments of life. <br><br>From a more personal perspective, why should everything we show our children gloss over the reality of life, and try to make them believe everything is rosy 24/7? Again, what this film does brilliantly through the message I took away at the end was that life will never be 100% full of happiness, but that is fine. Why does it have to be? A little bit of sadness is necessary. If a person was never sad, they would be inhumane. <br><br>Overall then, I suppose my review is more of a comment on the type of film we exhibit to children, and how the Nanny-state we live in looks to protect them from most of lives inevitabilities. Either way, what can't be ignored is that this film is equal parts sad, and equal parts what I am sure will become a timeless classic in years to come.","user":"james-calver","rank":[396,666]}]