[{"title":"Really wanted to love this movie...","rating":5,"date":"12 January 2012","review":"After 13 years of playing the game, after seeing how namco stated they would do a proper movie to redeem themselves for letting that disappointing live-action movie to be made, I had high hopes for this animated movie. It is every tekken fan's dream for there to be a true masterpiece of a movie. <br><br>Unfortunately, it did not happen. this movie turned out to be yet another mediocre attempt. Better than the live action for sure, but still fall way short of what was expected of it.<br><br>First problem is the general directing and \"acting\", too much pretentious \"I am cool\" crap, mostly from Anna, Nina, Jin and Shin, yuck! if tekken was aimed at 15 years olds then I would understand, but most long time tekken fans are now in their mid twenties to mid thirties. these high school wannabe facial and body expressions simply come off superfacial and repulsive.<br><br>Second problem is voice acting. I watched the English version, after the 3rd line of the whole movie, where Nina and Anna exchange greetings, I was like \"oh boy..\". The voice acting is closer to a cheap DVD localised release of anime series than a mainstream feature animated film. it was as if voice actors had no proper direction or had not understood their characters, several characters come off as cheese and pretentious. since it's just like their acting, maybe it was intended after all.<br><br>third and the biggest disappointment of this movie is the way the final battle had taken powers so out of proportion, almost as if we have moved from Tekken universe into Dragon Ball Z universe. this sort of elevation is not a problem if the movie did not have tekken in its roots. the whole point of tekken is balanced fighting power between its characters that makes a fight possible. Turning it into a plasma canon feast completely destroys the fundamental dynamic between the characters. and in the end one super Saiyan characters seemingly seriously but obviously jokingly tells a teenage girl, \"some day you will defeat me\" .<br><br>Having said all this, Blood Vengeance is not without merits. I really enjoyed its animination in general, Ling has a difference face in every tekken game she appeared but she looked the best in this one, yet still maintains a very oriental look. some perverted shots from below hers and Allisa's short skirt were amusing. Music and sound effects are top quality. Lee's comical presences was great, it was a pity that they did not handle Anna and Nina in a similar less-serious more-fun approach.<br><br>All in all, Tekken fans will see it regardless what people say, non fans will find plot somewhat puzzling and over movie lacklustre, but semi- decent entertainment nevertheless.","user":"ultimitsu","rank":[15,20]},{"title":"Kind of disappointing.","rating":3,"date":"4 August 2012","review":"I agree with some bits of swing kid's review. However I do think it's fine if they used Xiouyu has a main person. Elisa is only a main kind of character in Tekken 6. I was hoping to see other characters such as Law and Hworang and even Asuka. They are way more important. Even Anna wasn't that much of a deal. Lee was only there in a humorous role although I wouldn't really have expected him in such a role. I've liked Lee in the games ,mainly Tekken 5 so that's okay. I decided to watch the English version so I would understand better. Big mistake. The voice acting is ridiculous. I'm going to watch bits or so of the Japanese version so I can get over how bad the English dubbing is. I wouldn't mind Namco trying again but seeing all the main characters of the game would be interesting. 3 stars for Kazuya, Jin, Heihachi, Xiouyu, Lee, Nina and Panda. Excuse the spelling.","user":"amaze-mas-x","rank":[7,8]},{"title":"No denying: This movie blows.","rating":1,"date":"22 March 2012","review":"I'm a big fan of the Tekken series, but this movie is testing my patience as a fan.<br><br>First of all, why is the movie starring the character that has the LEAST amount of connection to Tekken's overall story?<br><br>Second, why do we need androids? Was boxing kangaroos and living training dummies not far-fetched enough? Speaking of far-fetched, why is Panda featured as a main character? I'm not kidding, Panda gets more screen time than Lee, Nina or Anna. And somehow, we're supposed to take it seriously...<br><br>The dubbing is awful across the board, I've heard better dubbing in B-grade hentai. Er, not that I would know, just from what I hear... Moving on.<br><br>In the last 15 minutes or so of the movie, you find out that the ENTIRE plot revolving around the pretty boy Shin and the two girls was COMPLETELY AND UTTERLY POINTLESS, and it doesn't even have any resolution. A whole new plot starts, and it's wrapped up even worse than the previous one. (Rocket fist? Really?!)<br><br>You could argue that in a Tekken movie, all that matters is the fighting. Well, this movie manages to sucker punch you there too, because there is HARDLY any fighting whatsoever. It's no exaggeration that more time is spent between the two girls yacking their heads off than fighting. The only good fight is the one at the end between three certain characters; partially because the two stupid girls aren't involved, and also because it's actually exciting. But is that worth sitting through all the bullcrap this movie has? HELL no. Just look up the final fight on Youtube.<br><br>And ignore SecretSkills' review, unless you're like him/her, and all you need to be happy is bright flashy images in your face. Trust me, save yourself the time and killed brain cells and just have someone jingle keys in your face for an hour. Keys that have a panda keychain on them.<br><br>0 out of 10, and that's being gracious.","user":"swingkid_2000","rank":[26,41]}]