[{"title":"It's not what it seems.","rating":19,"date":"19 August 2013","review":"I'm surprised that the viewers didn't really understand the movie in it's entirety. Shae has just gone through a horrific rape, she has also been dumped by a narcissistic prick who has no real feelings for her. She's in her own personal hell. What does Shae do? She creates a fantasy. A fantasy where she and \"Lu\" go on a killing spree. Lu Lu is a figment of her imagination. She is the Riot Grrrl inside Shae. How do I know this? At the end the camera pans across to all the places they supposedly killed all those men. They are clean, free of any bloody carcasses. Why? Because no one died in these scenes. The director is letting us know that it never happened. Shae takes a bath, cleansing herself, starting fresh. She's ready to take on the world. She is no longer afraid. She's brushing her teeth and the camera pans right and shows us the Japanese robe \"Lu\" wore while killing Shae's DJ friend. It's hanging there as if it's always been there. It's Shae's bathroom robe. Then we see Shae at work, smoking in the stairwell. When she's talking to the crying girl, Right before Shae inhales the smoke from her cigarette, the camera goes out of focus on Shae's face and in the background you see another light. This light is of another cigarette being inhaled. This is letting us know that \"Lu\" is NOT dead. At least not in Shae's mind. Shae has now taken on Lu Lu's persona. She is no longer an innocent. \"Lu\" has always been there. And now she sit's behind Shae figuratively, keeping watch over her girl. Shae needed those fantasy's and \"Lu\" to get her through the rape and breakup. She will probably always distrust men. Of course it's all relative. This is what I perceived happened. I encourage you to watch it again if you don't believe me. I loved this movie. The acting, cinematography and music made it a really beautiful film that made me really think.","user":"katherinecorea","rank":[50,64]},{"title":"My New Worst Movie Ever","rating":1,"date":"28 February 2015","review":"At least the original I Spit On Your Grave knew what it was (exploitation plain and simple). This garbage tries to dress itself in artsy decor, even as it shows a young man being dismembered. But whatever you think you might be getting from this film, you won't get it. As a feminist statement...well, watch Thelma And Louise again. As exploitation, it is nowhere near as extreme as the poster art would have you believe (the one scene I described being the exception). As cathartic revenge, Death Wish this ain't. The fact that it earned a little over $6K at the box office (probably not enough to cover the catering costs during filming) proves there is no audience for this cr*p and as Dana's looks fade, the few roles she gets will quickly fade as well as she is singularly without any acting talent, exhibiting here the same vacant stare throughout the entire movie (the other lead actress is actually pretty good). I should also point out that in addition to being anti-male (well, not quite all of us), the film is also very homophobic.","user":"Zebb67","rank":[23,35]},{"title":"Boring, cheap, done to death premise","rating":3,"date":"9 January 2017","review":"GIRLS AGAINST BOYS is another cheap revenge picture with a battle-of-the-sexes slant. It feels very much like a cheap I SPIT ON YOUR GRAVE remake and even features an actor or two who appeared in one of those films, I can't remember which. This one seems to have even less plot than usual and is merely a string of set-pieces of the main two characters going around and butchering unsuspecting blokes, some of them deserving, some of them not.<br><br>I find films like this one almost entirely devoid of merit. The cheap digital look of the production is almost anti-cinematic and an example of everything I DON'T want to see in a film. The acting is generally weak and exaggerated and the violence brief and not very shocking. The subject matter is distasteful but the approach is so lame that none of it is possible to take seriously.","user":"Leofwine_draca","rank":[13,18]}]