[{"title":"Just when you think you know what is going to happen it throws something at you that shocks you right up until the end","rating":7,"date":"26 June 2014","review":"\"Your dad never broke a promise ever and the way he looked at me at the airport, it just looked like he knew something.\" Marika (Anderson) and Erol (Osment) kiss goodbye to their husband and father at the airport as he leaves for a conference in New Jersey for a few days. When he never returns they begin to worry, when no one can find him they fear the worst. 12 years later Osment is told a secret by his grandfather that may answer the question that has plagued the family for years. I had no idea what to expect from this when I started to watch it. I was interested almost right away but when the time travel thing came up I laughed a little. The more I watched the less absurd it sounded and that actually became the reason I was so sucked in. This is a movie that was actually able to stay one step ahead of the viewer the entire time. Just when you think you know what is going to happen it throws something at you that surprises you right up until the ending that is both shocking and perfect. This is the type of movie that after you watch it all you want to do is tell everyone you know to watch it. That is the beauty of lower budget films. There aren't many blockbuster movies you rave about and think wow my friends need to see this. Overall, this sucks you in and keeps you interested the entire time trying to predict what will come next. I give this a high B+.","user":"cosmo_tiger","rank":[42,55]},{"title":"Decent sci-fi drama","rating":7,"date":"28 June 2015","review":"Erol (Haley Joel Osment) and his grandfather (Victor Garber) work together using quantum physics to develop the ability to travel back in time, with the aim of repairing a family shattered by the disappearance 12 years earlier of Erol's father (Rufus Sewell). <br><br>This is a movie about relationships and the possible selfish impacts of time travel upon them. For example, if Erol travels back in time to prevent his father's disappearance, how can he guarantee his fiancée (Susanna Fournier) that they will still be together in the new version of the present day? <br><br>This is not an action movie. There are no special effects. It is essentially a mystery drama with time travel acting as the primary plot device.<br><br>I enjoyed the movie. Its definitely not perfect. A little slow in places. <br><br>I read several reviewers complain about the casting of Haley Joel Osment. I thought he was fine, though given his physical appearance it is hard to imagine him being the son of Rufus Sewell and Gillian Anderson and the grandson of Victor Garber. However, if you can suspend your disbelief and believe that a couple of men writing mathematical equations on a chalk board can make time travel possible, then anything is possible.","user":"chris-j-stanton","rank":[12,14]},{"title":"Enjoyed it","rating":7,"date":"19 September 2014","review":"This came on TV the other day and I had nothing else to do. I didn't know what the movie was about, or who the actors were. I recognized Haley Joel Osment, and kind of did a double take. (More of the \"Yikes. Has it been that long?\" kind.) The story is a sci-fantasy story, but that's not the driving factor. There is little (almost none) in the way of special effects, and it doesn't need it. The plot centers around Erol, whose father left for a conference, and disappeared. But there is more to it than just a disappearance, and with his grandfather he figures it all out. I thought the acting could have been better in places, as it was very character driven. I won't put spoilers, but I didn't see the ending coming. Definitely worth getting the popcorn out for.","user":"SilkeJ","rank":[12,14]}]