[{"title":"Seriously! Seriously! Seriously!","rating":1,"date":"11 May 2013","review":"3 attempted reimagings... 2 miserable fails.There was Night of the Living Dead 3D, Night of the Living Dead (Memesis) but I can't really count that one......Then there is this. Utter nonsense! I was actually looking forward to seeing this movie. No, my hopes were not up high at all. I am a realist. I have watched some terrible movies. The trailer definitely fools you into thinking you are in for a jolly good time or one heck of a ride. What you are in for is a snoozefest with your head bobbing up and down consistently once you get to the core of the film... Sigh, such a wasted opportunity. Yeah, I get it. They want to make it their own. Give it a new spin. This movie is random...How random you ask? Random in every aspect. Just watch the movie and see for yourself... Or better yet DON'T. Everyone has their own taste. This definitely is not mine. Watch at your own risk. If you can't do a decent reimaging or remake leave the franchise ALONE!","user":"cheetor75-1","rank":[32,33]},{"title":"Does the rating system go to zero?","rating":1,"date":"11 May 2013","review":"In a nutshell: Community Theatre does a zombie play and then decides to film it. I must start off by saying I love bad movies. But this - I just couldn't even like it. I get it that the filmmakers tried paying homage to Romero throughout: with the funky camera angles, too close close-ups and claustrophobic, under-lit interior shots - but all-in-all, fail miserably in paying respect to the Master. Also, if the acting were any better, there might be a bit of redemption. Unfortunately, the locals that comprise the cast just don't pull it off. Run from this film. Run fast and run hard. Run just as you would from a flesh-eating horde.","user":"jhciswatching","rank":[27,29]},{"title":"A rip off","rating":8,"date":"8 June 2013","review":"Cheap production value, cheap sound quality, and cheesy dialogue make this film one to avoid at all costs, just when the British film Industry has at last made its mark in the world of film and cinema along comes this load of old tosh that drags it back 20 years why oh why oh why, oh I know why, to make a few quid, if you want to know what it feels like to be mugged buy this DVD and you'll realise! it shouldn't even be allowed to carry the title Night Of the Living Dead George A Romero must be livid his highly original work getting used as and excuse to sell this rubbish!!I have to make this review at least 10 lines OK it looks like it's been filmed on a phone, the characters in the film are very flimsy and the actors playing them must have been chosen in a raffle of some sort, or responded to an ad in the local paper, I didn't care what happened to the characters I just wish they would all get killed so I wouldn't have to hurt my eyes anymore watching this rubbish, I have seen a lot of films not all of them good be warned this is the first time I've been moved to write a review, be afraid be very afraid.","user":"kickboxking","rank":[15,16]}]