[{"title":"Great movie with real life lessons","rating":10,"date":"4 February 2013","review":"So This Is Christmas is a great film! We loved it! We can't wait to see it out in theaters so all our friends can see it too! I loved the fact that it was a blended family with a black mom and white dad. It is so appropriate for our world today, yet you don't see it much on movies or TV. I really loved the Christian beliefs added, we need more of this in our movies today! The movie was heart wrenching, funny and serious, so you had several emotions throughout the film, which in my opinion makes a fabulous movie! The actors did a great job bringing the characters issues to the light and learning from them. I could see the pain they all were facing and it was real!!! Great job!","user":"kajacobson","rank":[14,21]},{"title":"unfortunately very disappointing","rating":2,"date":"15 October 2013","review":"I have been watching a great deal of films and was really hoping to just relax &amp; enjoy this, but truth be told, I had a very hard time watching it all the way through. A whole lot of things just did not work at all for me. Some of the acting itself I think was good, but I wondered while watching, if perhaps this was done by someone with little directing &amp; writing experience.<br><br>The rough storyline was quite predictable, but could still have made for enjoyable viewing. Some things are a question of taste, of course. I have liked quite a few films with strong moral messages in the past, but the Christian message in this film really was very in-your- face. I wonder if there wouldn't have been a more subtle way to get the message across, that may have had a much stronger effect. Granted, it is a holiday film, but still...<br><br>On the slightly more formal side of things, I quite liked the lighting in some of the scenes, but can't say the same for the cinematography or editing.Overall okay-ish, with a number of \"oh- what-a-weird-shot...Why would-they-do-this?\" moments scattered throughout. All in all, a real shame. I appreciate the work that must've been put into it and there were some good elements, but for me they just didn't come together at all. This could have been a much better film.","user":"helga-stock","rank":[9,14]},{"title":"A great family movie with life lessons","rating":10,"date":"4 October 2013","review":"Great movie! Really enjoyed the storyline.People can relate because there are so many families dealing with issues such as these today,very thought provoking.The actors were very good and brought their characters to life. Mac and Jonathon played by Brian Massey and Justinh Avery were excellent!!! would love to have seen more of Jonathan( Justinh Avery) quite a talented actor.His performance demanded your attention. A natural in front of a camera.I hope to see more of his work in the future.The scenes between he and Ashley(Lexi) were very real and sweet.I also thought Eric and Vivica did a really good job on vocals. This is a great family movie, I would not suggest appropriate viewing for younger children.","user":"tamspaugh","rank":[10,19]}]