[{"title":"Intense","rating":7,"date":"23 June 2013","review":"Blood deserves better than other reviewers have suggested. It is a small movie yes but it is intense and filled with first-rate performances from an excellent cast. Bettany especially is on great form, but then he usually is, as a man falling apart. You believe these characters, understand their motivations and emotions, even as you watch them get closer to the edge. <br><br>We may have seen many of the cast in bigger productions but there is no sense that they are slumming it and even the smaller roles are played in an incredibly realistic way. It reminded me of some of the best noir movies in the way the plot is driven by the characters' reactions to one fateful action and the way the claustrophobia mounts as they struggle to come to terms with what has happened. Recommended.","user":"alan-taylor77","rank":[24,27]},{"title":"Absolutely astonishing film. A must see if you like true crime dramas.","rating":8,"date":"1 February 2014","review":"Rarely does a movie come along that slips under the radar of the movie goers of the world that is as poignant as Blood. I know people have a habit of watching Blockbusters and judging all movies based on the salary of the actors and the budget of the film. Blood is proof, yet again, that a movie doesn't have to be high budget to be beyond great. I very rarely rate movies as most people don't really pay much attention to the actual review that is associated with the rating. The entire cast and crew of this movie were exemplary and deserve the accolades that go along with it. I have a new benchmark to base all crime dramas off of now thanks to this great and powerful movie.","user":"gamesplayerone","rank":[16,20]},{"title":"The cast is great, the film not so much","rating":5,"date":"31 March 2014","review":"For a film with such quality actors and a name brand director in the form of Sam Mendes as producer it's hard to gage just why Blood was released with such little fanfare but then again upon watching of the film it's hard to promote it as a must see when in reality it's a film that whilst having good central performances is just too generic to fully buy into.<br><br>Adapted from the British mini series titled Conviction, Blood has a plot that is all too familiar for anyone who has but a passing interest in the family/crime genre of movies. In the role of brothers and cops the film has its strongest points with Paul Bettany in a rare leading role and Stephan Graham in another top supporting turn doing well with their respective characters Joe and Chrissie. It's always good to see Bettany on screen and for an actor that chooses a wide range of shoddy roles it's a welcome return here to see him display a range of emotions. Stephan Graham in my opinion one of the most talented and watchable actors working today with his work on HBO's Boardwalk Empire and roles in feature films such as This is England showcasing his startling talents and again here comes away with the films best moments in a film that needed more of them.<br><br>One of Blood's major problems is in its setting up of the story and subsequent lack of feelings after it due to a rushed and frankly over the top scenario that would of worked better if the film spent more time establishing the bond between the brothers, there iffy relationship with fellow cop Robert (thank goodness Strong is not a bad guy!) and the trials they are experiencing with their ex-cop dad Lenny (Cox). It all plays along nicely enough but you never get the sense your witnessing anything feature film worthy thanks to Murphy's bland direction and dull set ups.<br><br>If you're a fan of Bettany and Graham Blood is a film worthy of your time to see the fine actors ply their trade side by side but for anyone else Blood is nothing more than a sadly predictable and safe movie that really should have been a lot more memorable.<br><br>2 and a half bacon sandwiches out of 5 <br><br>For more movie reviews and opinions check out - <br><br>www.jordanandeddie.wordpress.com","user":"eddie_baggins","rank":[15,20]}]