[{"title":"Taut beginning; almost unravels in cat-and-mouse hi jinx, but still redeems itself","rating":7,"date":"9 November 2015","review":"\"Kristy\" has a young university student, Justine, staying on campus for the Thanksgiving break and forgoing returning home until Christmas. Her rich roommate Nicole, who had originally planned on staying with her, goes to see her family last-minute in Aspen, leaving Justine and the campus security guards alone for the Thanksgiving holiday. After taking a trip to a rural convenience store, Justine runs into a group of young people who seem to want trouble, and upon returning to her empty dorm, finds herself in for one hell of a night.<br><br>Maybe it's because I love a good college campus slasher, or maybe it's because I'm a grad student who's about to spend his first Thanksgiving alone (albeit in New York City, not in the backwoods in which this film is situated), but I was completely taken in by this film from the beginning. The premise from the get-go is very straightforward: girl alone on a sprawling rural college campus. What could go wrong?<br><br>The film establishes its villains from the beginning in an internet montage which features video and cryptic text from secret message forums, implicating some sort of new age cult committing ritual killings across the country which are then posted on the internet. While this is admittedly disturbing, I honestly found some of the most interesting the scenes to be within the following exposition of the film, in which Justine finds herself at her own wits, entertaining herself and wandering around the empty college campus. The director, Oliver Blackburn, has a stylish way of illustrating her solitude, and there is something relatable and quietly eerie in this first thirty or so minutes of the film; in spite of the fact that nothing ostensibly scary is happening on screen, there is a very ominous and unnerving mood that gets established; this is what really absorbed me most and got me invested.<br><br>By the time Justine leaves the campus late in the evening to run to the local convenience store, the audience knows intuitively that her languid Thanksgiving is about to take a wild turn for the absolute worst, and the suspense of it is taut and subtle up to that point. Unfortunately, from there the film begins to temporarily devolve. For having such an understated and ominous exposition, the film is too quick to take the route of a hyperactive thriller, and spends a good thirty minutes devoting itself to flashy cat-and-mouse chase scenes. While some of these are inarguably effective, it is routine and gets old fast. It is not until the last twenty minutes that the film redeems this devolution with an entertaining (albeit also routine) retribution. While all of this is nicely shot and at times startling, I kept thinking to myself how much I missed the subtlety that pervaded the beginning, and in reflection, that was honestly when I was most unnerved. <br><br>The acting here is surprisingly above standard, with Haley Bennett as the competent lead. Ashley Greene plays the counterpoint female cultist, with Mathew St. Patrick as the likable security guard and James Ransone making an unexpected minor appearance. The production values are high and I'm honestly surprised this film wound up slipping under the radar as it did. Granted, it's not entirely original (comparisons to \"The Strangers\" and \"Them\" are almost unavoidable), but it is a technically well-made film and is far more interesting than any horror film to hit theaters this past fall.<br><br>Overall, \"Kristy\" is a solid film. I especially commend it for building such a stylish and taut exposition—I honestly can say that the first thirty minutes of the film were among the most inexplicably unnerving I've seen in a long time; quietly creepy even though nothing creepy is happening. As I pointed out, the film does take the cat-and-mouse action a bit too far in my opinion and perhaps is too fast to launch into it, but the final act is satisfying and I was able to overlook this because I found the first act so absorbing and enigmatically spooky. 7/10.","user":"drownnnsoda","rank":[24,30]},{"title":"Some flaws, but a tense cat and mouse thriller.","rating":7,"date":"30 January 2016","review":"Before I start the review I want to say Haley Bennett, who played the lead, Justine, did a great job. You can feel the struggle she is facing between having to work her way through college, having a rich boyfriend who doesn't completely get it, and being a tired student. I see she's playing the lead in the upcoming movie The Girl on the Train. The book was very good, and I can see Haley playing the part wonderfully.<br><br>Having spent some holidays alone at college over various vacations, this movie peaked my interest. Although this must be a very small college because she is the only student there. Makes for a good movie, but not very realistic. There are two security guards and another guy who's house is just on the outskirts of campus. <br><br>The opening of the film begins with a young woman being chased down and killed. There's shaky camera work, and I was concerned that the rest of the movie would be like this, but thankfully it wasn't.<br><br>You get a sense of the Kristy Cult and why they are killing. Kristys are women who are pretty, and pure, and have a good life. Although I'm not sure how they know they are pure, but we're just along for the ride. <br><br>Kristy comes from Christ (although Kristy could be spelled Christy, but I guess that's too close to Christ and might confuse us??) And I think they are killing them because they don't like God. To me, this part could have been left out. But perhaps they thought people just killing because they are psycho would leave too many questions for the audience, so they needed a reason.<br><br>After that beginning it turned amusing. There was a cheap shot made for the audience to jump, and the flickering lights were explained away well enough. Then we break out into a montage where Justine is dancing around the dorms Breakfast Club style. We also see that she is very athletic from the run she takes and the swimming she does. I will say, I would have been screwed if I was her, because she did a lot of running from the killers.<br><br>Justine goes on a last minute run to the gas station before the guy at the security booth goes home for the night. At the station she meets a weird woman, Violet, with lip piercings and what looked like Meth teeth. There's a confrontation at the checkout that leaves Justine a bit shaken up.<br><br>Getting back to campus, she warns Wayne, the security guard, to be on the lookout for the weirdo from town. And then the fun begins.<br><br>The lights start flickering even more, and although Justine has an uneasy feeling, she takes her sweet time getting back to her room. When she gets back there, a video of the various girls that have been killed by the Kristy Cult is playing on her computer. Then her computer goes out and she can't get a signal. The door slowly starts to open, and we see Violet standing behind her.<br><br>Cue the cat and mouse scenes, which I will say were pretty good. My biggest problem is when she goes into the kitchen (that she works at) and doesn't grab a knife, or even a frying pan. She does do a couple of other things to throw the killers off, so that was good. <br><br>Then they're running all over campus, lots of tension building up, and I was yelling at the TV. I was getting really annoyed, mainly with the key issue. Justine needed a key to get into the doors, and it would have taken her a second, but it didn't seem like she locked any of the doors behind her. Even when the killers were not that close. Also at the beginning it seemed like a lot of the dorm doors were open. If everyone went home for the holidays, they would have all been locked. And if Justine had locked her door, there is a good chance it would have took the killers a lot longer to find her.<br><br>The movie did redeem itself towards the end though. I enjoyed it, and they did bring the Kristy Cult full circle. If you enjoy cat and mouse thrillers, with a tough heroine, I would say you should watch this one.","user":"kimheniadis","rank":[5,5]},{"title":"The Strangers meet the university","rating":7,"date":"21 November 2015","review":"\"The Strangers\" meet the university (student), except it was better than The Strangers. The Strangers was a bit of a downer juxtaposing chance and violence. They pick you and you die. True, while unsystematic random violence is to be feared it can hardly stand alone as dominant story-telling. Yea need a reason. 'WE' need a reason. This movie....Kristy.... provides that reason by means of meager, yet plausible, cultism. The first half of the movie is good scary stuff, the back half.............an action film. Run for your life kind of mania. But I nevertheless enjoyed it for some strange reason. Her expression perhaps.....................I'm not sure exactly, but i believe that was it. She was very convincing.","user":"neko1962","rank":[17,23]}]