[{"title":"'Smashed' gets it right","rating":8,"date":"11 August 2013","review":"I am a recovering alcoholic, 23 years sober. Over the years, I've developed somewhat of an obsession with films on this subject, always looking for my own story. 'Smashed' is that film. Mary Elizabeth Winstead captures the essence of the functional alcoholic perfectly. Her character, Kate, is two people - the respected, enthusiastic teacher by day and the out of control drunk by night. This can work for a while, but there will always come a day when these two worlds literally collide.<br><br>This movie hits that mark perfectly. Kate's recognition that she is an alcoholic is tough to watch, but so realistic. I knew I had a problem, but denied it until that one morning I woke up in my car and had flashes of memories from a crazy, chaotic night before. Like Kate, I went to AA that same day, and while I hated it at first, those people saved my life.<br><br>This movie is about redemption and loss. Getting sober isn't easy. Life continues and we are left to deal with the wreckage of our past. Those problems we ignored, suddenly explode in our faces. But we deal with them. 'Smashed' should be required viewing at rehab because it's real.","user":"dlrturtle","rank":[39,41]},{"title":"Seriously relevant.","rating":8,"date":"8 March 2013","review":"Writing as an alcoholic... I have 2 things to say about this film. The first is that the learnt ability to 'deal' with life through alcohol abuse, was entirely authentic... and the second is that the loss of important relationships was inevitable with the life changes that salvation demands.<br><br>Writing as a film critic... that this taught me something about my own alcoholism... makes it an impressive film from my point of view. The inter-dependent relationship at the centre of this story is entirely real, as is it's eventual de-construction. Only a non-addict would see the interventions contained within the story as being sanctimonious or having some political agenda. This is not an argument... alcohol destroys lives.<br><br>The acting from the two 'leads' was excellent. The bigotry towards alcoholism was treated in a perfunctory way... but was still relevant to the story. Most of all... this film portrays the isolation felt by those who escape their entrapments. We all have to take giant steps in our lives... those steps rarely coincide with anyone else's. This film demonstrates that very well.<br><br>This was never going to be a film that excites the majority movie-goers...but for those that like films that can tell you something you didn't already know... it is well worth watching.","user":"soupster1","rank":[59,64]},{"title":"One Fine piece of Filmmaking","rating":10,"date":"18 February 2012","review":"This film was one of two real standouts for me at the Sundance Film Festival 2012. Lead by two Oscar-worthy performances from Mary Elizabeth Winstead (Kate) and Aaron Paul (Charlie), \"Smashed\" accomplishes the impossible by addressing a very serious topic with depth and sympathy and realism, while still finding time to make the audience laugh hysterically now and then. Director James Ponsoldt and his co-writer Susan Burke deserve high praise for pulling off that feat. Additional kudos go to \"Parks and Recreation's\" Nick Offerman, as the deadpan sad- sack co-worker who takes Kate to AA and starts her on the road to sobriety. In a role that's the opposite of uber-confident Ron Swanson, he's hilarious as the always-ill-at-ease Dave.<br><br>This is one of those rare movies that is just like life: sometimes very funny, sometimes very sad, but always real. I hope it gets the audience it deserves.","user":"KM_391","rank":[89,105]}]