[{"title":"Weak porn-a-like ... something.","rating":2,"date":"27 May 2015","review":"The whole movie is like the prologue of the porn scenes but than actual sex is cut out. The actors act terribly since they are porn actors, and the whole movie made like a porn scene: slow beat music and whispered dialogs. The lighting and locations also remind you of adult movies. They filmed a lot of porn stereotypes scene like the car washer guy etc. They wanted something different, I understand, but every frame reminds you the cheap porn not something better. No drama or thrill like the genre shows. 2 stars because Malena Morgan is unbelievably sexy and I have penis between my legs. But I can't say any other positive about it. If you want to watch porn this is not for you. If you want to watch a drama or thriller movie this is not for you. If you want a porn like ... mess, or you are in love with one of the girls, well, watch it.","user":"daninet","rank":[29,38]},{"title":"Fifty Shades of Grey is even more erotic AND has a better story. Need to know more?","rating":4,"date":"23 June 2015","review":"Directed by Zalman King...who's that you ask? He brought us Two Moon Junction, Wild Orchid, Red Shoe Diaries and assisted Adrian Lyne in making 9,5 weeks. So you get the theme: he's into making erotic films. Pleasure or Pain is his last directorial effort before he croaked (he made it to 69, ain't that fitting). Contrary to his other films this one stars real life pron stars like lava-melting-hot Malena Morgan and also Elle Alexandra, Hayden Hawkens, Kayla Jane and Aubrey Addams. Now you might be thinking this fact would mean that it's a LOT more explicit than say 'Fifty Shades of Grey' but it certainly is not. The sex scenes are pretty short and you hardly see anything like in most other soft-porn movies (to which you could count his previous work I guess). Worst of all is that they aren't very erotic either which should at least be the point of this film but there it falls short. Though she looks gorgeous Malena is not a great actress. Well nobody in this film is. But they're better at other things lucky for them. Overall I found the story pretty boring, slow moving and poorly written as is the dialogue btw. Some credit to the DP who did a fairly good job with the lighting and such but it doesn't matter. This film is hardly worth watching because it is neither a good plot based film nor a good erotic film. Skip it!","user":"Jerghal","rank":[13,19]},{"title":"Production value of softcore porn. But hey... it's porn","rating":3,"date":"29 May 2015","review":"There isn't much in the movie aside for erotic scenes and stupid script. Acting is shallow, because let's be honest, these are porn stars. The movie is basically a series of cheap sexual fantasy delivered in monotonous tone. Production value is passable, and the ladies are nice, but for those wanting a psychological thriller or intense drama might have to look elsewhere, after a few ogling here maybe.<br><br>Story follows the main girl as she retells the story of her encounter with a rich man who has strange appetite. Plenty of monologues are used and they are all delivered with overly sensual tone and corny lines. Sequences are done for the purpose of creating titillating situations, these are mostly misdirected as the characters are inherently too cheesy and the performers can be quite zealous.<br><br>The movie doesn't attempt to be overly hardcore or theatrically artsy, it simply presents attractive girls prancing about in sexually explicit way.","user":"quincytheodore","rank":[10,14]}]