[{"title":"Zombies as a manageable plague","rating":7,"date":"19 February 2014","review":"Well-made story of the politics of controlling a plague. This is a thinking man's horror movie: An allegory for HIV/AIDS and similar viral outbreaks, this virus makes its victims into zombies: They're crazed, they spread the virus through biting, and to kill them requires shooting them in the head. But zombies and their gore are rare in this movie. Rather, the focus is on potential zombies, infected people who are kept normal though daily injections. The virus isn't curable, but it is manageable, but only if society supports the victims with expensive drugs, and only as long as each victim is responsible about taking their daily dosage. These factors make the infected a time bomb, a hypothetical that becomes a more urgent reality with rumors that the drug is running out. The story is personalized by Alex and Kate, who show the battle to control the disease, the consequences of not doing so, and the societal impact on their personal lives. Unlike most zombie movies, this one does not focus on the standard action scenes of zombies swarming, eating people, and getting slaughtered with ever more creative head wounds. Nor is this a dystopian future depicting the breakdown of society from a planet overrun by the infected with a few living humans struggling to survive. Rather this horror is psychological: controlling a plague, caring for loved ones, balancing the good of the few with the needs of the many, and the desperate acts this necessitates. Well written and well acted, this is a gem in the horror genre.","user":"moviefansme","rank":[41,59]},{"title":"Not your typical zombie movie","rating":10,"date":"19 February 2014","review":"This movie has some bloody scenes but it is not the focus of the movie. The few zombie scenes that are shown are not for shock value but to make the viewer understand the emotional turmoil the characters are facing. Some of the flash back shots could have been left out since they took away from the moment rather than adding to the heightening how you felt. The story that the movie tells is one of interactions between people, how we love defines what we are. The film asks the question, when do we lose our humanity and start to give in to our baser instincts? Kris Holden-Ried and Emily Hampshire make you care for their characters and their struggle. Shawn Doyle and Claudia Bassols play their roles well and have you asking yourself, What would I do? David Tompa has a very small role in the film as the father of a young returned, he does a great job making you feel his characters pain. You may be disappointed if all you are looking for blood. guts and gore; but if you are looking for a well made movie about human struggles then this is the film for you!","user":"smetaxas","rank":[51,75]},{"title":"Very Unsettling","rating":8,"date":"26 February 2014","review":"After a bloody opening, one would expect the rest of the movie to follow the typical shenanigans of a living dead creature fest; however this is not the case. The Returned plays out more like a drama that displays the desperation of Kate and Alex as the supply of a protein (needed to be injected once a day) that keeps one from returning to the living dead becomes scarce. Alex is one of \"The Returned' – the label for those who are lucky enough to get the solution within four hours of being infected, and his wife Kate is a doctor who treats the survivors.<br><br>Overall the movie was very captivating with a top notch cast and a realistic premise of how the response to a shortage of such a protein would be carried out in our society today. The visuals were exquisite, including a few gory scenes. My only criticisms are the ending (which I won't mention specifics here) that seems unnecessary and a moment where a Security Guard is drinking coffee out of an empty cut. Despite these setbacks, it's worth a watch! 8/10","user":"adam-1894","rank":[32,45]}]