[{"title":"Almost a gem of a movie","rating":6,"date":"6 April 2013","review":"Despite not being anywhere near the league of great film, still it is one of the better British films of recent times, in the sense that we get to escape from the council estates and the thugs they supposedly breed as well as the horrible language that makes one wanting to have a shower after a screening.<br><br>We follow the story of two brothers who migrated from Cyprus to England, one of whom became a millionaire and fully embraced the British ways whilst the other did not do so well and remained faithful to his routes and culture.<br><br>There is real warmth conveyed in this film and the importance of family is never underestimated, again a non-entry in many British films. In a short space of time we undergo a journey of emotions, hopes, aspirations and sadness that is a part in an immigrant's life.<br><br>A man goes from top to bottom and struggles to come to terms with the new reality of both the situation and the fact that he has to give up his ultra posh life and move to a lower middle class neighbourhood. Whilst we can rush to assume him as a snob, the truth is that he isn't; the issue he has is not so much encountering his brother and the old life, but the fact that as far as he was concerned all this was left behind him and simply moved on to a different place.<br><br>Despite the presence of elements that could potentially have made this a gem of a film, somehow it is rather corny (or simply not aimed high enough) and that reduces it to a warming, charming family comedy.","user":"cinematic_aficionado","rank":[21,23]},{"title":"Everyone Should See Tthis Film","rating":10,"date":"14 November 2012","review":"I started following Marcus Markou on Twitter when he was getting ready to film Papadopoulos and Sons and was going to be tweeting about it along the way. As an aspiring filmmaker, I thought this would be an interesting feed to follow. And indeed it was. Here we are one year and a couple months later and Marcus has taken the film to a few film festivals, screened it a couple times in London and lord knows what else. Since I don't live in a city where any of these screenings were, Marcus sent me a screener copy of the film. And these are my thoughts on it.<br><br>In a word, I LOVED it!<br><br>I had a feeling from the trailers and teasers that Marcus released, that I would like Uncle Spiros and I absolutely adored him. I've checked out George Corraface's IMDb page and I've not seen a single thing he was in, so he was \"all new\" to me and he was wonderful (the character as well as the actor).<br><br>My friend and I noted how much we liked Marcus' script as well. He's a great writer. Nothing ever felt awkward or forced. Very fluid and coherent dialogue throughout. And VERY funny! We had some good laughs, at the dialogue as well as some of the reactions or expressions pulled by some of the actors. <br><br>Marcus was very lucky to get a cast of some superb actors. It was about 50/50 on actors I was familiar with, and (most of) those who I wasn't familiar with did a great job. Ed Stoppard was campy and funny. Georgia Groome was snarky and fabulous. Thomas Underhill was a RIOT. And Stephen Dillane.... seriously... seeing him in a comedic role (as well as a couple of VERY moving scenes), just solidifies how multifaceted he really is. <br><br>The one that I was most impressed by (which, really, shouldn't shock me at all, given who his dad is), was Frank Dillane (who I'd never seen before). His character was so sweet and charming, and he never missed a beat. More than delivering the lines... he succeeded in delivering the feeling. Just really, really well done, Frank! I hope he's continuing on this track, because that kid definitely has the gene.<br><br>I can see why Papadopoulos and Sons won the Audience Choice Award at the Thessaloniki Film Festival in Greece. Everyone should be very proud of that. It really is a delightful film. It's honest and beautiful. It's a story everyone should see.","user":"photomintie-273-263143","rank":[26,32]},{"title":"Oh dear...","rating":2,"date":"28 November 2015","review":"Utterly dire, the worst type of contemporary British film - was this Lottery-funded, I wonder? Allegedly a comedy drama it is neither funny nor dramatic - the sort of piece they used to call 'heart-warming' for want of anything else positive to say.<br><br>Dillane is catastrophically miscast - about as Greek as an Asda moussaka. Not the most inspiring screen actor at the best of times, for the first half he stands around looking stunned-to-blankly moody, saying little and little apparently going on inside either. But that's better than when he does finally start saying something - so bland he seems to have suffered a stroke. The script, the direction, the editing unutterably clichéd, unimaginative, predictable and SLOOOOOW - and I *love* slow when the slowness lets you watch interesting things going on. No such luck here.<br><br>The most unbelievable brothers since Schwarzenegger and DeVito in 1988 - but this time it's not meant to be a joke. And finally the traditional British film failing: some really embarrassing supporting turns which should have been ruthlessly excised - the guy playing Lars, the Scandinavian money man, gets my award for the worst foreign accent of the decade...nearer German, if anything, but like one in a bad war film of the 1950s. The only Greekness I detected anywhere was in the music, but even that relentlessly trying to tell us what we should be feeling and when (the script and action having failed to do so) - sad, hopeful, joyful, sad again (and again and again)...and finally triumphant and (you've guessed it) heart-warming.<br><br>At one point a character (Dillane? I forget) says, \"This doesn't feel right\" - the most truthful line in the movie, I'm afraid.","user":"osmundbullock","rank":[9,12]}]