[{"title":"Surprisingly Authentic","rating":31,"date":"31 January 2013","review":"With ample opportunity to turn heavy-handed and sappy, Any Day Now is surprisingly authentic without jerking tears about a 15 year old Down-Syndrome boy being saved from institutions by a male couple. The film does not turn on sentiment but rather on the weakness of the 1979 judicial system that might deny custody just because the parents are gay.<br><br>Rudy (Allan Cumming) is a drag queen, who wants to care for neighbor boy, Marco (Isaac Leyva), abandoned by druggie mom. Paul (Garret Dillahunt), an assistant district attorney, comes out to Rudy and falls in love with him. Both men love Marco, yet they struggle to convince the court that because a couple is gay, it should not be denied custody.<br><br>It is the '70's after all, and being gay and a drag queen can be a real drag for the authorities. To the film's credit, even the tough-minded judges can have moments of sympathy. Minor players like the prosecuting attorney go beyond stereotype, and the ending goes against expectations, a real plus for a film that could have followed the play book for tears and happiness.<br><br>An audience favorite at Tribeca and Chicago film fests and winner of the Golden Space Needle award at Seattle, Any Day Now, inspired by a true event, delivers an honest conflict with an honest conclusion. I'll take that any day now","user":"jdesando","rank":[33,36]},{"title":"A review in response to mikejackson-2","rating":8,"date":"17 December 2012","review":"Opinions are like a**holes, everyone has one. That being said, I loved this movie. Yes, due to the constraints of a 2 hour movie, the leads fall into a serious relationship quite quickly. And maybe two guys in West Hollywood circa 1979 may not have fallen in love exactly like this, but darn it, does every gay film have to depict us all as un feeling sexual beings only. What a great message for future generations, and a timely one with gay marriage at the supreme level, that some gay men actually do want love and a family. My biggest compliment to the film was that by the end I was to enraged to cry. With only 16 theaters in the country showing this, and a mere 40k weekend, I feel so fortunate to have seen it in the theater. Ignore his 4 out of 10 rating and seek this little gem out.","user":"cbnspanky2","rank":[58,68]},{"title":"A must see!","rating":10,"date":"15 January 2013","review":"I saw this movie on a whim at the Palm Springs Film Fest and I feel like I left the theater a different person. I loved this story in all its heartbreaking glory. Alan Cumming's performance was wonderful and raw and at times I felt as enraged, as hopeful, as passionate and as proud as he did. I experienced so many emotions during the film that I was spent afterward, and I'm not ashamed to admit that I shed many tears during and after the movie. <br><br>I didn't know what to expect going in and I am so glad I picked this film. I could say more, but I don't want to spoil anything for the next person. Love, love, love - thank you Travis Fine.","user":"i3adfish7","rank":[39,46]}]