[{"title":"Delicious, Delightful, Intelligent","rating":7,"date":"25 April 2013","review":"The bespectacled, wrapped-too-tight spinster, Julianne Moore, is an archetypal schoolmarm with a fire down below living a life of quiet desperation. Until a former student, a failed playwright, with the right poker (pun intentional) arrives in town with a play no one wants to see. Teach flips over the play and pushes the Drama Club to mount it as the complications pile up.<br><br>Ms. Moore is simply superb here. She's a national treasure and woman-of-a-certain-age Hollywood still calls. And rightfully so. Although pony tailed and covered head-to-toe as \"The English Teacher,\" she's still hot!<br><br>Teach judges men she dates with stream-of-consciousness displayed as on-screen text. She's abetted by a proper British narrator, Fiona Shaw, who adds an element of Gothic Romance to this tasty stew.<br><br>The Drama Club is run by a terrific Nathan Lane, a failed Broadway Star, who delivers the funniest lines in his trademark condescending dryness. Kudos also to Jessica Hecht and Norbert Leo Butz as Principal and Vice who take exception to the play's dark ending and demand a rewrite. Add a serviceable Greg Kinnear who easily handles his role as the playwright's Doctor Dad.<br><br>The play, \"The Chrysalis,\" is received as having a universal theme all people relate to as if it were written specifically about/for them. The broad interpretation is Ms. Moore, by film's end, has broken out of chrysalis to butterfly. (Much to the consternation of the narrator who unsuccessfully attempts to talk Teach out of a date with Kinnear.) Scratching beneath the surface, students of Literature and Drama might find the film mildly thought provoking.<br><br>Ms. Moore's arc is predictable, but the journey remains a lot of fun.<br><br>Though a bit lightweight, with a great cast, a smart, funny and intelligent script, there's little to dislike about \"The English Teacher.\" One hopes Ms. Moore will keep you after class.","user":"Cinnyaste","rank":[39,46]},{"title":"A decent small film with good performances from the Leads","rating":6,"date":"26 August 2013","review":"First of all watch the film, then make up your own mind, I can't stand people who come on here and give bland one or two word reviews. Its a small budget film which centers around a returning high school grad and an English teacher trying to help him succeed and reminding him to keep at his dream of becoming a playwright in New York. Its films like this that make me want to continue watching films, they center around characters, story and actual acting. If you want gimmicks and explosions with no point then go play a computer game or watch a Michael Bay film.<br><br>Okay so this film isn't the best you'll ever see but its decent.","user":"esub44","rank":[25,32]},{"title":"Charming & funny - a real gem","rating":10,"date":"19 July 2013","review":"This is one of those indie movies that is much better than many big budget feature film comedies.<br><br>The story combines original comedy, a touching partly dramatic climax and a feel good plot that comes together perfectly. The comments on screen are an original touch. No wonder such a top notch cast appears in it.<br><br>The performances are stellar. Julianne Moore gives a wonderfully varied and moving performance as a spinster English Teacher in high school who mounts the play of an ex student played by Michael Angarano. She can do comedy just as well as she does drama and biopics. <br><br>The supporting cast includes Broadway veterans Jessica Hecht and Norbert Leo Butz as school principals, Nathan Lane as the diva of a drama teacher, the lovely Lily Collins as a high school student and aspiring actress and finally Greg Kinnear as the young playwright's father.<br><br>This is one of the best indie comedies in years and deserves much more critical acclaim and financial success than it received. Look forward to seeing more from the screen writing duo who penned the story.","user":"phd_travel","rank":[32,44]}]