[{"title":"Well worth watching if you enjoy sci-fi dystopia genre","rating":7,"date":"16 August 2015","review":"Despite other reviews I've read i liked this movie. Read no further than this review, or the synopsis because the less you know the more immersed a film will feel. <br><br>It's about two men who service a facility which hold the last remnants of humanity and civilization. The air outside is toxic, there are other facilities just like theirs out there. <br><br>Although the cinematography was average, and i think some scenes could have emphasized claustrophobia better; nonetheless, the production value was great which is necessary for films in the sci-fi genre. The soundtrack i really liked and it really sealed the deal on my interest. From the start there was growing suspense that kept me fixated. <br><br>Up until the conflict, i felt like i was alongside them in this dystopia. I don't think the chemistry between Bauer and Cartwright was really that fluid and the dialogue (banter) itself was sloppy and forced. But they really shined when they were in their separate scenes and that is what held my intrigue.","user":"johnathanleigh","rank":[75,97]},{"title":"A sort of Moon, but not that good","rating":8,"date":"24 July 2016","review":"I liked the film, as a performance piece from Reedus and Hounsou, and truly it's not more than that. It's a situational drama. The plot is, in fact, irrelevant. The ending scene that brings closure was already not needed.<br><br>That being said, I feel like the script could have been a little more polished. The dialogue and the decisions of the characters sometimes felt a bit fractured, the movie lacks a natural fluidity. Certainly the film could have gained a point if the extra scenes - like the pointless and extra long beginning - would have been cut in favor of character development.<br><br>Bottom line: it doesn't deserve such a low rating on IMDb. Cantamessa may not be the best director in the world, but for his first full length movie, he wasn't bad. I felt as if the film was inspired by Moon. It had the same feel, only with two protagonists. And as Moon, the movie could easily have been an episode of a sci-fi anthology. Moon was clearly better, though.","user":"siderite","rank":[22,27]},{"title":"The main problem of Air is it doesn't have enough gas to keep the momentum going.","rating":5,"date":"20 September 2015","review":"For a movie called Air, it sure feels tiresomely suffocating. The overall concept is about two men who wake up from stasis sleep to do critical housekeeping on a post-apocalyptic facility. It brings the usual gloomy ambiance and the two actors do possess good acting performance, but the movie is utterly boring. Low on production and very tediously paced, it's almost like a forced prolonged short movie.<br><br>Bauer (Norman Reedus) and Cartwright (Djimon Hounsou) work on the ark facility where periodically they would wake up to keep things running. With small cast and setting, the main focus here is the human drama between these two as they troubleshoot any faults in the station while questioning their own sanity.<br><br>Plot-wise it's not very complex, there's not much developments or twists, at least not outside the stereotypical sci-fi movies. The back story is told with various clips or narration from both characters, which can feel detached and lackluster at times. Norman Reedus and Djimon Hounsou have decent on-screen presences, however the material is spread too thinly and they struggle to produce any excitement from the barren plot.<br><br>That's the main problem of Air, it simply doesn't have enough gas to keep the momentum going. Note that the runtime is the average ninety minutes for a very small scale movie, furthermore it utilizes repetitive themes for filling. It teases the slightly dysfunctional relationship between the two or what mental problem they may have, but these are basic thriller aspects that don't present much thrill in exception of one or two decent scenes.<br><br>While the retro 80s futuristic theme can be intriguing and its two leads are capable, most of the movie feels like extended padding. It probably could've done the same with half the runtime, the rest is merely cumbersome trudge over dystopian gig.","user":"quincytheodore","rank":[42,57]}]