[{"title":"Film or digital? You decide.","rating":21,"date":"21 September 2012","review":"\"People love great stories. They love to get into a world and have an experience. And how they get it—it doesn't really matter.\" David Lynch<br><br>Which do you prefer: photochemical or digital projection for your movies? If you're geeky enough, you really care; if not, like me, you want a great story and characters with a crisp image that complements the theme, regardless of whether or not it's film. As for 3D, I can live without it.<br><br>Christopher Kenneally's interesting Side by Side documentary presents filmmakers like George Lucas who claim celluloid is dead and those like Christophe Nolan who vow not yet to trade his \"oil paints for crayons.\" The film does a credible job presenting both sides with a slight edge to a future of all digital and a pessimistic take on film as an eventual curiosity.<br><br>Among the talking heads are avatars of photography and direction with an occasional producer and actress to get closer to us viewers, who are never questioned even though we are the ultimate arbiters. But the experts have valid and provocative points: the film advocates tout its warmth and color possibilities while the digital dudes trumpet the ease, low cost, and creative infinity. The film does an entertaining job of presenting the sides.<br><br>Both sides agree archiving remains a pressing and often neglected issue. Although Martin Scorsese is at the forefront of saving film, no one else has yet taken the case of digital preservation with his passion. The documentary doesn't take enough time on this issue especially since I thought something like my external hard drive would already be in the mix. Not. Apparently even digital imaging can break down in storage.<br><br>Oh, well, I'm with Lynch: Give me a super story and beautiful image and let the geeks and gods work out the details.","user":"jdesando","rank":[27,27]},{"title":"A Nutshell Review: Side by Side","rating":10,"date":"18 March 2012","review":"Film is dead, or is it? With major distributors in USA going digital this year in lieu of film, the death knell has been sounded that perhaps it's not too long before celluloid film projection is a thing of the past, and with it comes digital filmmaking, production, distribution and projection. But does it have to be that way, and can both mediums co-exist to satisfy the various sections of the creative market? Produced by Justin Szlasa and Keanu Reeves, the latter who was here in Hong Kong for a masterclass, Side by Side is the documentary written and directed by Christopher Kenneally, that deep dives into both sides of the equation.<br><br>And who better than to interview those who have dabbled with both mediums? What made this documentary a compelling watch is Keanneally's ability to cover an entire range of topics related to this issue, tracing the history of both mediums, especially the digital one, and giving depth into backgrounds, reasons and rationale taken from those who have dealt with both old and new technologies. Having Keanu Reeves turn into the interviewer works in both levels of attracting the casual viewer into watching this, as well as on the interview front, made it easy for filmmakers to relate and open up to one of their own, as they talk about the medium, how it impacts filmmaking, and from acting in front of the camera, the camera technologies themselves, and the case for distribution and exhibition, weighing in on the pros and cons at every stage.<br><br>These filmmakers are none other than the who's who of Hollywood luminaries, such as James Cameron, George Lucas, Martin Scorsese, David Fincher, Robert Rodriguez, Christopher Nolan, Danny Boyle, Richard Linklaer, David Lynch, Joel Schumacher, Steven Soderbergh, Lars von Trier, and both Lana and Andy Wachowski whom Keanu Reeves made the prolific Matrix trilogy. And it's not just directors, but also containing interviews with editors and cinematographers such as one of my personal favourites Wally Pfister, who together with Nolan stand on the side of celluloid, famously resisting Warner Bros' attempt to turn their lucrative Dark Knight projects into the digital or 3D formats.<br><br>While one may get distracted by the star studded lineup, we get to see how each are so passionate about the medium they believe in, and the compelling arguments they make for and against their case, listening from the horse's mouth of those who are in the industry, together with the satisfaction gained and challenges they face. For instance, like Fincher, digital filmmaking gave rise to cameras that can be designed to cater to the nature of the shots he had intended, without which films like The Social Network, or The Girl With the Dragon Tattoo, cannot achieve certain shots or have the camera angles so desired. Everyone provided their own memorable soundbites when they engage in this discourse, so much so that you'd soon find everything that's being said becoming terribly sexy and seductive in their arguments.<br><br>But Conneally does an excellent job in not allowing any one filmmaker to run away with the presentation he so decided, allowing arguments to be made and the viewer to form his own conclusion. The pace moves at breakneck speed, hardly every pausing just like how digital filmmaking has directors almost never calling it quits because the medium has run out, as you the audience will definitely find an area in which you have little knowledge of, but thanks to this film and its incredible breadth adopted for its scope, you're bound to come out of it a little bit enlightened about the entire technical process, the evolution of filmmaking technologies, as well as gain new found appreciation for those who are so passionate in their filmmaking that it's automatically shown in the final cut they put out for projection.<br><br>No film related topic was taboo, as the documentary also took a look at archival processes, which contains a little bit of an irony. If there's a flaw to this wonderfully made documentary, it will be that its focus is still inherently Hollywood's own, since there is a distinct lack of interviews and gathering of content outside of Tinseltown. Perhaps an apt follow up to this would warrant a lot more interviews to be done with filmmakers around the world, but I'm guessing most of the responses will already have been covered by the mammoth scope here (and whose filmmakers are at the forefront of technology given geeks like Cameron), and at best appear as supplemental discs should this ever be released on DVD format sometime soon. Definitely highly recommended viewing for everyone, film buffs or otherwise, with great material yet to be seen in upcoming films included as well.","user":"DICK STEEL","rank":[31,33]},{"title":"An exciting cinema history session","rating":7,"date":"28 December 2012","review":"As a film student or just a movie lovers, you rarely got a chance to connect with cinema history, or meet with famous people in the industry who set the standard and created the masterpieces. This documentary gives it all in a friendly story telling mode that could benefit both professionals or just any random viewers <br><br>As much as it is about digital, it's equally about how cinema develop and what it would be like in the future. The documentary points out an interesting finding that it's the professionals, not the technology that drives the storytelling art forward. Each and every of them offer their best performance and artistry via the choice of techniques they made. <br><br>It's fantastic to see how filmmakers form different groups of opinions and stay faithful to it. While the film did not intend to come to any conclusion about future of cinema in digital or old style film, it clearly set up a basic understanding about filmmaking as a painstakingly process that require endless decision making based on personal visual creative interpretation. <br><br>A nice to watch movie for film students, especially those are fans of David Lynch, James Cameroon or George Lucas, the main speakers","user":"thaibm","rank":[10,10]}]