[{"title":"I don't know what's going on!!!!","rating":10,"date":"26 October 2012","review":"I bought tickets to this movie for its premier at the Toronto After Dark Film Festival based on the trailer alone and went in with some trepidation after checking its IMDb rating and reading some critic reviews on Rotten Tomatoes.<br><br>Having seen the movie tonight, I can honestly say I feel like I'm from another planet then those reviewers. I absolutely loved this film! It was hilarious, creepy, intelligent, and unique. I was roaring through the whole thing, and it wasn't just me! The entire theater was rolling in their seats! The directer, Chrispian Mills was there and I stayed afterwords to shake his hand and tell him I am now a fan. There was a line of people wanting do the same thing.<br><br>I made an IMDb account specifically to tell you to pay no attention to the negative critic ratings. If you've seen the trailer and you think it looks like something you'd enjoy, then for God sakes go see it!","user":"agravelle1","rank":[118,145]},{"title":"Not for mass audiences, HOWEVER a very clever, funny original","rating":8,"date":"22 October 2012","review":"This film will find its audience among fans of dark comedy. Don't expect the broad appeal of \"Shaun of the Dead\" or \"Hot Fuzz\", and comparisons to other Simon Pegg films miss the point. This is a film deserving attention, especially for writers and the \"cult\" audience who enjoy quirky, unique dark comedies/mysteries.<br><br>Reviewers forget that some films are not for everyone, and their opinion is worth nothing in the evaluation of such films. This one may be very much enjoyed by a smaller audience, even after several viewings. \"Fantastic Fear\" ranks among the \"love it or leave it\" types; you may find it annoying or too odd, like \"Dark Shadows\", or it's tremendous fun.<br><br>\"Burke &amp; Hare\" also divided audiences, yet this film has more in common with murder-mysteries, like a cross between \"Clue\" and a spoofy take on say, the recent \"The Raven (2012)\". Better than both films, IMO, this will live on with DVD and Blu-ray releases, thankfully.<br><br>Box office numbers and critical \"consensus\" are ultimately short-lived, and very deceptive. Give this a chance if you like dark comedies. And it must be said that Simon Pegg's acting resume becomes increasingly impressive. Regardless of the final product, you have to give him props. And here, the final product is better than you might expect.","user":"Harry-Hood","rank":[55,74]},{"title":"Oddly surprising, surprisingly odd, verging on hmmm","rating":6,"date":"16 June 2012","review":"A Fantastic Fear of Everything is probably not what you're expecting from Simon Pegg. It's not horrifically funny like Sean of the Dead, as outright entertaining as Hot Fuzz and, mercifully, it's not as tepid as Run Fatboy Run or as stagnant as Paul or Burke and Hare. Actually, it's not very funny at all to start with.<br><br>So what is it? Well, it's a journey and if you decide to embark upon it you'll need to see it through to the end to decide if it was worthwhile. It begins with an engaging, gentle, animated title sequence before introducing us to Jack (Pegg) a flailing children's author engulfed by his research into Victorian murders for a prospective TV series that nobody wants. We quickly discover he has an all-consuming paranoia of being murdered. How do we know this? Because he tells us. And that's when it starts to go downhill.<br><br>It's a steep decline that director Crispian Mills (yes it is, but more about him in a minute) seems incapable of avoiding. He seems unaware of any filmic devices to portray the protagonist's thoughts and emotions without resorting to plodding, turgid exposition and painfully obvious statements. It's part way down this terrible slope that you'll feel the urge to pick up your coat, head for the exit and sneak into the screen next door even if it is only Top Cat: The Movie.<br><br>Don't! Stick with it. Somewhere around the halfway point the decline into cinema hell slows, stops and gradually heads up to a satisfying peak via some strange and thoroughly enjoyable scenery. For the patient and slightly off-kilter, it's a very satisfying escapade indeed.<br><br>At some point you'll discover that it's evolved into a most amusing and very dark trip through a world inhabited by the likes of Tim Burton (when on form), Wes Anderson, Dr. Seuss and Roald Dahl. It's a world I feel very comfortable in but doesn't suit every reader of my blog. There's murder in mind, paranoia at large and animation sequences akin to Fantastic Mr Fox and The Nightmare Before Christmas on LSD.<br><br>Cast-wise there's nothing remarkable on display; Pegg is good but ill served by the stodgy first act and Amara Karan as Sangeet occasionally forgets how to act but gives enough to be enjoyable if not memorable. The absolute star of A Fantastic Fear of Everything is Crispian Mills and it has nothing to do with him being son of Hayley, grandson of Sir John, nephew of Maxwell Caulfield or lead singer of Kula Shaker, although it's all interesting trivia.<br><br>No, he's a star because this is his directorial debut. And his first outing as producer. And the first screenplay he's written. As debuts go, it's not up there with Duncan Jones' Moon but it's one heck of a start and he's the star because he's dared to be both dark and different at a time when Hollywood is determined to be predictable and repetitively upbeat.<br><br>A Fantastic Fear of Everything is far from being a perfect movie but it's a solid, enthralling film that hints at the possibility of Crispian Mills becoming a very fine filmmaker indeed and a hero of the off-kilter cinephiles who are tired of Tim Burton's ever-downward spiral and in need of someone new to rely on for their fix of surrealism.","user":"TheSquiss","rank":[51,70]}]