[{"title":"Really good, very dark","rating":8,"date":"13 June 2014","review":"This movie has gotten a lot of bad reviews and i have no idea why. The twist were at the right place and everyone says the acting was bad. Forrest Whitaker always KILLS everything he does and Anthony Mackie was PERFECT. People say Mike Epps is just a comedian but he was really good in this role. This movie actually had me confused and shocked at some point but i don't regret watching this at all. I really wish i would've went to the movie theatre to see this. I recommend this movie to anybody who loves movies that make you think and that don't just hand their ending out to you on a silver platter. My advice watch this on a rainy day, turn the lights off and pay attention. Hope this helps.","user":"Mugsta-419-573473","rank":[19,27]},{"title":"Spook movie","rating":4,"date":"18 July 2019","review":"Not too interesting supernatural movie with a weak script and sadly lacking in suspense and credibility.","user":"fmwongmd","rank":[3,3]},{"title":"This Just Didn't Work At All","rating":3,"date":"30 June 2014","review":"Generally speaking, I like Forest Whitaker. In fact, he's the reason I was willing to rent this movie in spite of its rather mixed (at best) reviews. And he didn't disappoint me. His performance as Angel Sanchez was actually good. Sanchez was a man dealing with the tragic death of his mother, who decides that he's going to take revenge on those responsible. Whitaker handled the vengeful psycho character pretty well - one moment the quiet, gentle and doting father; the next moment busy torturing the guy he blames for his mother's death in his basement. But it seemed natural. He was believable in both personas, and the transition from one to another was fine. Whitaker was the obvious highlight of the movie.<br><br>Then, into the mix comes Anthony Mackie as Thomas Carter, and here's where things begin to fall apart. Not so much because of Mackie. He was all right. But the character, and the direction the story takes. Mackie's some sort of New Age counsellor type, and once that's introduced the movie disintegrates into a cacophony of meaningless and sometimes incoherent New Age mumbo jumbo. Then - because Angel and Tommy have to be brought together in some way - there's the very fortunate release of Tommy's brother Ben (Mike Epps) from prison. Ben needs money, he wants it from Tommy, Tommy apparently owes him big time so to get money he takes on - voila! - Angel as a patient. Yes. A happy coincidence. Angel's \"plan\" wouldn't have had a chance had that not happened. And then mixed into this there's a lot of unnecessary supernatural stuff revolving around the ongoing presence of Angel's mom. What was the point of that? Why couldn't Angel just have been out for revenge? Why did he need to keep seeing his mom? And then it wasn't just a figment of his imagination - because his daughter had some sort of contact with her as well. Totally unnecessary; totally pointless. Thrown in because ... well ... I don't really know why it was thrown in. Just because apparently. And the ending was ... not satisfying. To say the least.<br><br>Yeah. I like Forest Whitaker. But this is one Forest Whitaker movie I wish I hadn't seen. (3/10)","user":"sddavis63","rank":[8,11]}]