[{"title":"Action fans have completely lost their sense of priorities","rating":8,"date":"14 December 2013","review":"Note: Check me out as the \"Asian Movie Enthusiast\" on YouTube, where I review tons of Asian movies.<br><br>You really have to wonder how a film like \"Special ID\" (2013) gets an average IMDb rating of 5.3 out of 10 while something like \"The Hobbit\" (2012) gets an 8.0. People have truly lost their sense of priorities while watching action films. Read some reviews of \"Special ID\" and you'll see all kinds of petty criticisms, from language dialects to overly decorated restaurants! Here's a newsflash for you. For an action film to satisfy, it needs a minimum of two things: good action and brisk pacing. Guess what. \"Special ID\" easily meets this standard and in fact surpasses it with some truly memorable action sequences. Sure, the script is boilerplate and basic (even a bit clumsy in spots), but that doesn't automatically tank the enjoyability of a film that focuses first and foremost on the action anyways.<br><br>A cop (Donnie Yen) and his team of comrades go undercover in one of China's most ruthless underworld organizations to stop a gang leader. Andy On plays a good villain, while Tian Jing is a likable female lead. The action in this film is spaced out nicely, which assists the pacing quite well. The fight choreography is less \"showy\", opting to reflect a realistic, scrappy form of fist-fighting with some mixed martial arts peppered in. The finale lasts a whopping 15 minutes and showcases a suspenseful car chase. This actioner definitely satisfies.<br><br>The director here is Clarence Fok, who has a hit or miss filmography but has given us some fun movies in the past – \"The Iceman Cometh\" (1989) and \"Black Panther Warriors\" (1994) being two fairly brainless crowd-pleasers that stand out. He has also contributed some truly riveting dramas. For example, his crime drama \"Century of the Dragon\" (1999) is one of the best triad films of the past 15 years. Overall, the direction in \"Special ID\" is solid during the action, with some very cool sweeping shots during the lengthy car chase.<br><br>Unfortunately, Clarence should have vetoed some of the scoring choices in \"Special ID\" because the background music got intrusive at times. The sound design of this film feels amateurish and cheap early on, but get better as it progresses. This shouldn't be too much of a problem for fans of old school Hong Kong action flicks from the 80s and 90s, which many times had consistently poor production values but nevertheless succeeded at providing pure entertainment value. At the very least, \"Special ID\" looks nice while it gives the viewers its fist-to-face goodies.","user":"ebossert","rank":[32,42]},{"title":"Exhilarating Action Scenes!","rating":6,"date":"18 January 2014","review":"I am not really a big martial arts movie fan, but I enjoy watching a good one when I get the chance. \"Special ID\" is the only other Donnie Yen film I have seen after the phenomenal \"Ip Man\" and its lesser sequel. I was curious to watch Donnie fight in the modern setting. This film definitely confirms his excellence in martial arts choreography and execution -- from the quiet discipline of wuxia before to rough and rugged mixed martial arts this time.<br><br>The story is common and predictable, Chan Chi-lung (Donnie Yen) is an undercover Hongkong cop who gets sent to China to help corner an up-and- coming crime boss, Sunny (Andy On), with whom he was close to in his previous assignment. There were no really big surprises or twists. But of course, we do not typically watch these types of films expecting a profound story, but it is mostly for the exhilarating action scenes. And in this aspect, I thought \"Special ID\" delivers big time.<br><br>It was cool to see a different Donnie Yen as a brash and reckless cop, which was totally in contrast with his subdued character in \"Ip Man.\" His range of fighting skills were all very elegant to watch in those incredibly and impossibly choreographed fight and car chase scenes. Be they in enclosed spaces or in wide-open areas, Donnie Yen is exhilarating to watch.<br><br>Andy On plays a very convincing new debonair crime lord from the US. He figures in a very long climactic scenes of car chase with fighting, followed by an intense scene of bloody hand-to-hand combat. He was able to match the grace and flow of Yen's movements yet their scenes come across as gritty and realistic.<br><br>As Yen's Chinese female police partner Fang Jing, pretty actress Tian Jing was made to mouth some pretty cheesy lines. But when it comes to her action scenes, her awkwardness disappears. She was unexpectedly awesome in her parkour scenes jumping and running across rooftops, and of course, her major fight scene set unbelievably inside the confines of a Land Rover! <br><br>Reviews from many die-hard martial arts film fanatics have been harsh, calling this film a miss in Donnie Yen's filmography because of its sloppiness. However, for the casual viewer who only watches martial arts films occasionally, I do not see anything wrong with the action sequences I saw here in \"Special ID\". While they may miss the mark for bonafide MMA connoisseurs, for an ordinary guy like me, those action scenes and stunts were quite exciting and very entertaining. 6/10.","user":"3xHCCH","rank":[12,15]},{"title":"Donnie Yeh should be international bigger.","rating":6,"date":"9 March 2014","review":"I'm always surprise that Donnie Yeh has not exploded onto America like Jackie Chan or Jet Li. I saw a biography on the man and learned that he spent a lot of his childhood in the states and as such speaks better English than the average Chinese action star who basically just learned how to read lines in English. Kind of Ironic, and added to the fact that The Don is more attractive than his peers you would think Hollywood would be knocking on his door, Or maybe they are and Donnie chooses to stay away from the headaches the ones that came before him had to go through.<br><br>Special ID shows the kind of hands-on film making Donnie gets to do in his native land. The action sequences are long and energetic like I would expect from a Kung Fu flick, and never let down. What I love best is the martial arts sequences are very contemporary with what's going on today. The Don does the traditional high speed flying kicks that are trade mark in Kung Fu, but I noticed that Donnie is using the rapid punches that remind me of his role as Ip Man. I also notice that mixed martial arts seems to have influenced the fights in this movie with a lot of low to the floor fighting which actually made the conflicts realer for me. Outside the fight choreography, there was also an awesome chase scene as well.<br><br>Donnie plays a police officer who wants to take down China's most ruthless crime syndicate. In order to do this he has to go deep undercover, but when the mob boss suspects a traitor in his ranks, Don as \"Dragon\" Chan, is in trouble of getting his cover blown and his life ended, which puts him in conflict with his duty as a police official. His best ally is Fang Jing, an officer who puts herself on the line and in the action. I love noting more than to see a woman who is more than just eye candy to the action hero (but she does do eye candy very well).<br><br>Another highlight for me is one of The Antagonist's henchmen Sunny played by Andy Oh. He spoke a lot of English in the film for reasons I did not fully get, but this may have help with me relating to the character, as I did not have to read what he was saying, but the fight scene between he and The Don was brilliant.<br><br>Once again the Don delivers a worth wild Action flick, to add on to the many reasons why Hollywood does a disservice to itself sleeping on his skills, but it's probably for the best as an American made Special ID just would not be the same.","user":"bbickley13-921-58664","rank":[8,10]}]