[{"title":"A quick lesson about junk in earth's orbit","rating":5,"date":"14 August 2014","review":"Space Junk brings much needed focus to the problem about junk in earth's orbit and the effects it might have on space travel and even communication here on earth. It's a short educational documentary, that seems more suited for a 30 minute slot on the Discovery Channel or PBS, than on an IMAX screen. There is too much reliance on digital effects here and quite frankly, they're terrible. Space Junk feels designed to be a visual experience, as much as it wants to be an educational one, but the bargain basement CG never lets this rise to anything but a quick lesson about dead satellites and how the space in earth's orbit is smaller than you think.","user":"TheMarwood","rank":[5,5]},{"title":"An educational documentary","rating":13,"date":"13 December 2013","review":"This is a scientific documentary that explores the previously disregarded problem of junk in space.<br><br>I did wonder what happens to all the fuel tanks and other detachable parts of the rocket after a satellite is put into orbit. \"Space Junk\" shows that they become limbo in orbit, waiting to collide with other pieces of man made celestial bodies. It's quite a shock to find out how environmentally unfriendly the space program is, and I was also shocked by the number of satellites in space.<br><br>\"Space Junk\" can ride on the wave of the recent and widely acclaimed film \"Gravity\", increasing awareness of the serious and dangerous problem of space junk. I hope there will be a solution soon, so that astronauts will have a safer working environment.","user":"Gordon-11","rank":[4,4]},{"title":"Never gets to the core of the problem","rating":4,"date":"3 June 2017","review":"\"Space Junk 3D\" is a 37-minute (including credits) documentary movie from 2012, so this one has its 5th anniversary already this year. it is among the more known works by director and co-writer Melissa R. Butts. The narration in the English version is by Oscar nominee Tom Wilkinson. The title already describes fairly well what this one is about. Or does it really? Yes there are sequences where the focus is on junk that humans put into space and that has not been used by anybody in decades and it is just there doing nothing and will stay there for a long time too in the future. But then the focus is missing entirely. It talks about how we humans have to act reasonably, but that's it. Depth and further explanations are missing entirely. Is it not enough that we pollute the Earth that much, but really necessary to extend our reckless behavior into the orbit. Also completely aside from situations, the film occasionally feels like a generic space documentary that has very little to offer in terms of informative value. This is quite a negatively impressive achievement for a runtime of under 40 minutes. Here and there is a slid moment and the film is definitely not junk, but it offers far from enough compared to what it could have been looking at the subject. I give it a thumbs-down. Not recommended.","user":"Horst_In_Translation","rank":[0,0]}]