[{"title":"MUCH better than the IMDB score","rating":7,"date":"3 September 2018","review":"I'm glad I gave this a shot. It's well produced and very well acted. The story is bizarre, but inventive and not impossible. Within its bounds, the plotting and writing is very good, with all the action holding together. That alone is an achievement these days.<br><br>A black comedy, exactly as advertised - and a pretty good one too.","user":"truphane","rank":[48,62]},{"title":"A surprisingly good dark comedy!","rating":8,"date":"26 August 2018","review":"Novice director Jonathan Watson makes his 2nd directorial debut and his first full length feature film, and knocks it out of the ballpark!<br><br>This is a well written, cast and produced dark comedy with few LOL moments, but you will have a constant grin throughout, especially from the perfectly cast Danny McBride who's performance was outstanding for his character.<br><br>He, as well as the great directing along with the perfect cinematography make this film stand out and very entertaining.<br><br>The entire premise of the set location (pretty much abandoned gated communities) make this a different type of cat-and-mouse comedy thriller that is enjoyable start to finish. The pacing is great and the length is perfect.<br><br>An excellent Sunday hangover popcorn flick! A well deserved 8/10 from me","user":"TheTopDawgCritic","rank":[77,108]},{"title":"I thought it was an excellent movie. Sue me lmao","rating":10,"date":"28 August 2018","review":"You know whenever I read a review from someone who dissects and over analyzes the entire movie from start to finish sucking the life and any enjoyment from it. It's a must see for me. That just shows me that said reviewer really has no idea if it was good or not. They spent the entire time concentrating and searching for WHAT THEY THOUGHT WERE FLAWS. Whilst any entertainment went right over their heads.\n Look everyone has their preference. Me I LIKE MOVIES. See it or not. Dont let what someone you may have nothing in common with dictate whether you see a movie or not. I loved it. I also a big Coen Brothers fan so ironic dark comedies I love. You'll either like it or you won't. Dont rob yourself from a potential gift. Danny McBride is fantastic","user":"ichoosethelight","rank":[70,110]}]