[{"title":"My Review Of \"Sick: Survive The Night\"","rating":3,"date":"18 December 2014","review":"The story is a somber, monotone one that relies on a lot of dialog. Most of the story is about the human experience and toll the zombie apocalypse has on one psychologically as we battle for a \"cure\". It is reminiscent of Romero's \"Day Of The Dead\" in pace and stripped down style. The acting is mediocre, with a lot of the characters feeling contrived. It is a clunky drama that does more peacocking of personalities than the material, or cast can actually account for. There are moments when the story almost becomes thrilling, and a few of the cast really get into their character. It is just not enough to save \"Sick: Survive The Night\" from being a bit dull. <br><br>The special effects, for the most part, keep within practical-low budget grade effects that work. I preferred the stripped down zombies that go back to the beginning of this genre. The creature effects are cool enough, however the zombies don't dominate the film with enough force or energy to really kick \"Sick: Survive The Night\" into thrilling gear. The soundtrack and sound effects are decent enough to give the film atmosphere, some moments do feel creepy and chilling, it just never seems consistent through the whole film. <br><br>Overall, I found myself wondering why? What was the story that this film was wanting to tell? Most of the components are redundant aspects found in zombie horror. I did appreciate the added mix of these scavenger crews roaming around raping and pillaging. However the story doesn't give enough time for that element to really take off. Most interesting things take place in flashbacks while the main meat of the tale is left to melodrama and mild zombie attacks. \"Sick: Survive The Night\" isn't a film that you will kick yourself if you miss it. Mostly it is just a boring movie where people talk too much.","user":"ASouthernHorrorFan","rank":[11,11]},{"title":"I enjoyed it.","rating":7,"date":"13 October 2018","review":"This is my second IMDb review. It's also the second \"zombie\" movie that I've felt i should say has been under rated in its reviews. Overall, it was an entertaining movie. Yes, it was low budget, and over/under acted at points in the movie. \nBut... If you are a true zombie genre lover, it is one of the better low budget movies I've seen in awhile. It did not try to over compensate with a huge amount of gore or cheesy CGI. It relied on the location and the actors to set the tone and drama. It could have used a little more back story on some of the characters to round out the plot, but overall a good movie. \n \nIf you like Romero's first Night of the Living Dead, then, check this one out.","user":"remypsmith","rank":[3,3]},{"title":"Zombie flick","rating":4,"date":"28 January 2015","review":"A zombie film , not a high budget one , I can see a lot of effort went into it for a low budget one , the actors did their best acting. The story was OK, it followed the same stuff which is in all the zombie films. Is it a classic , no. If your into zombie low budget films you may want to watch it. The zombies make up is good and their movements are credible . The main actors were not high end actors like walking dead ones. The cinematography is good, no dodgy camera work, scenery was good , good locations . My last words would be this film would mostly appeal to a zombie fanatic who has watched all the other zombie flicks and just has to watch another one because this genre is his thing. I think if the film could have increased its standards by one third it would've been a decent film and I would have scored it higher , ie. acting a third better , story a third better and it would be getting much higher reviews , good luck to the maker of the film , and hey you have a knack with the whole thing but if the next one just went to being a third better I think you would've pulled of a low fi cult of this genre , but needs fine tuning","user":"epiceffectss","rank":[2,2]}]