[{"title":"Peter Kay: The Tour That Didn't Tour Tour","rating":8,"date":"21 August 2012","review":"It had been a long while since the Bolton born comedian had done live stand-up comedy, since for the last few years he concentrated on writing and acting on television work, such as Britain's Got the Pop Factor, and music hits for charity, so everyone was so excited to see him back on stage. Peter Kay plays at the O2 Arena to a huge audience, and you can spot celebrities like Dawn French as well, and he brings us the same fantastically funny and original observational jokes we have come to expect from him. He uses a camera to spot funny audience members, and he talks about going to an accident his dad had where his balls got caught in a cracked sun lounger, the dentists, personal health, his Uncle Knobhead, how popular sayings are ridiculous, television programmes like Come Dine with Me and Embarrassing Bodies, telephone and mobile phone problems, his experiences with his grandmother and her funny sayings, e.g. \"wiffy\" instead of Wi-Fi, and \"Facetube\" (Facebook and YouTube), Blu-ray and HD, Sky+, weather eating out, school, what some lyrics of songs sound like rather than what they are, e.g. \"the heart does go on\" from \"My Heart Will Go On\" sounds like \"the hot dogs go on\", other songs include \"We Are Family\" by Sister Sledge, \"Mercy\" by Duffy, \"Drive\" by The Cars, \"You Are Not Alone\" by Michael Jackson and \"That Don't Impress Me Much\" by Shania Twain, and a rock performance miming electric guitar music with a shovel, to songs like \"Whatever You Want\" by Status Quo, a variation of \"Is This the Way to Amarillo\", playing \"Eye of the Tiger\" while singing \"(I'm Gonna Be) 500 Miles\" and \"We Are the Champions\" by Queen (where using screens he became all three members: Freddie Mercury, Brian May and Roger Taylor), all in all this is a hilarious comedy show. \"Garlic bread\" was number 23 on 50 Greatest Comedy Catchphrases, Peter Kay was number 22 on The Comedians' Comedian, he was number 12 on TV's 50 Greatest Stars, he was number 7 on Britain's Favourite Comedian, and he was number 2 on 100 Greatest Stand-Ups. Very good!","user":"jboothmillard","rank":[1,4]},{"title":"Funny stuff","rating":7,"date":"14 May 2017","review":"After a long break Peter Kay returned to stand-up with this show.<br><br>It's perhaps not as good as the earlier shows that were released onto DVD, but there is more than enough funny material here to make people of all ages laugh.<br><br>Peter Kay is so skilled at what he does, really tapping into the everyday things that we all think about but never say.<br><br>Yes, there's a fair bit of swearing, but Kay's natural charm and enthusiasm more than makes up for it.","user":"studioAT","rank":[0,1]},{"title":"After a long break for nationwide tours, Peter Kay returned with a top notch show.","rating":9,"date":"19 February 2016","review":"8 years on from his 'Live at the Bolton Albert Halls' tour, Peter Kay hit the stage again with 'The Tour that didn't Tour, Tour'. That's not to say that Peter Kay was making a comeback from years away from the public eye, he was instead focusing on TV work, a return to stand-up though was pleasant to see as 8 years was too long without it!<br><br>Being filmed in 2011, it is a lot more current than his previous shows; we have jokes on Sky+, Wifi, problems with technology and much, much more. After all this time, his style remains the same, little bad language and mainly family friendly humour – I wouldn't say it's for children but it's certainly not crude or offensive in anyway.<br><br>As usual, Peter Kay ends his show with a sing-along, however this time it is bigger than ever – it makes references to earlier jokes and the reaction from the crowd showed us that it really worked. After such a long time out of the stand-up game, this show really could have gone either way, thankfully he pulled it off, delivering some of his best material yet.<br><br>9/10","user":"MUFCOK","rank":[0,1]}]