[{"title":"American Neo-Noir meets romantic European fable","rating":7,"date":"8 March 2013","review":"He looks out the window in the night sky after a long day's work, thinking of what has become of himself. Across his apartment balcony, in the window of the building opposite his, stares a woman, solemn, pained. Their eyes meet, and, slowly, they wave at each other. Not a word was spoken.<br><br>Subtle scenes like these evoke memories of the raw power of film - it is emotion, not words or sometimes action - that drive a motion picture. Thing is, Vic is a thug working for a ruthless mobster; and Beatrice is a traumatized victim of a car accident. The subtlety will not last long, but it does make healthy re-appearances.<br><br>Niels Arden Oplev's \"Dead Man Down\" is the English-language debut (third this year overall following two Korean efforts) of the Swedish filmmaker famous for the original \"Girl with the Dragon Tattoo\" film. He even brought along his star Noomi Rapace for the ride. It is a joy to see a modern filmmaker who cares for and loves his characters as much as the audience expects themselves to, that we are invested in them strongly and want to see them succeed. He crafts the film with love, as the cinematography gracefully dances around the characters, as if it was a complex ballet intrigue and hidden motives. Do we really want to right that wrong? Will it be worth it in the end? For us and for our loved ones?<br><br>The movie is, first and foremost, a revenge thriller. But surprisingly, it is also a compelling love story. From the moment the film opens we are thrust into the urban jungle of New York City (accentuated with a moody and atmospheric score by Jacob Groth, composer of the original \"Millennium\" trilogy), but with a poignant yet meaningful statement by Vic's friend Darcy (Cooper). Writer J.H. Wyman uses strands of earlier revenge films, twisty film-noirs and the classic melodramatic romance of earlier Hollywood films and incorporated them into his screenplay. Oplev transforms the screenplay, with such passionate energy and inventiveness, that the whole film somehow resembles a classic romantic European fable - sort of like this big tough warrior who falls in love with a wounded soul in a far-away and dangerous land, and both become kindred spirits. It is engrossing and captivating to watch the characters actually become real human beings, instead of being caricatures. This is a film where the characters' decisions affects what happens next.<br><br>The film would not succeed had it not been for the two leads, Colin Farrell and Noomi Rapace, followed by a strong and diverse supporting cast. Farrell is strong as Vic, big, tough but withdrawn and solemn, slowly hiding away his anguish and rage towards his real enemy. Rapace, an actress whom I'm starting to grow fond of, is quite wonderful as Beatrice, who is traumatized but is still capable of captivating the lonely Vic. She walks and talks with unease, but there are times where she switches gears and becomes intensely aggressive in her true goal, where it will reveal is eating her up slowly but surely. The strong chemistry between the duo make the movie much, much better than it was intended.<br><br>The rest of the cast consists of Terrence Howard as a deliciously ruthless and intimidating as the villain Alphonse (watch the scene where he confronts Vic in a dark apartment room, with backlighting in Paul Cameron's cinematography brilliantly capturing the essence of noir), Dominic Cooper giving Darcy a human and realistic portrayal of a stock crime film character, and brief but warmly welcome appearances of F. Murray Abraham and Isabelle Huppert.<br><br>This is a movie which has something for both guys and gals. Guys will go for the gritty story and the obligatory \"Colin Farrell kicks ass\" scenes, especially the violent climax. Women would go just to see Farrell the romantic, and the compelling chemistry between the two leads are enough to make them swoon over. But the film is so well made, the characters and story strongly developed and very compelling enough to hold my attention for two hours, that really, you couldn't ask for a more well rounded revenge thriller of late. This is a movie which actually is a real movie, instead of feeling like a movie or being a commercial/stunt/SFX reel. Kudos to especially Oplev, Farrell and Rapace for making a strong, real film about lovable characters.<br><br>No doubt the marketing for the film is way off (as an action thriller, as usual) and reveals quite too much. Doesn't matter. \"Dead Man Down\" is the finest and most meaningful revenge film in years.","user":"dvc5159","rank":[104,130]},{"title":"Surprisingly Good Thriller!","rating":9,"date":"19 July 2014","review":"Dead Man Down is actually not a good thriller, but it is a great thriller. Some things may not be entirely believable, but then again we are often told to suspend our disbelief in these kind of movies, which I did. This thriller is a slow-burn thriller that focuses less on the action, but more on the characters and the retribution.<br><br>Oplev's film has a distinctive European feel to it and that is how I like my thrillers. But this film is about a man named Victor who is the right-hand man of a crime lord named Alphonse and has a very mysterious past. But he is seduced by a car crash victim named Beatrice, who is a mysterious woman herself. But together, they plot to bring Alphonse to justice.<br><br>For a film such as this, it has a pretty talented cast. Colin Farrell and Noomi Rapace share such intimate chemistry with each other. It's a shame Farrell is not a high box-office draw these days because he got so much talent. Terrence Howard does a very good job, and it's nice to see him shine in a villainous role for once. There is a nice cameo by F. Murray Abraham as well and I like it because we definitely don't see much of him anymore.<br><br>Overall, Dead Man Down is much better than what people are making it out to be. It's a slow-burn thriller, not an action shoot-em-up as apparently people were expecting. There are going to be logic issues, but I'm very good at suspending my disbelief, because I'm watching a fictional movie. But this is a well-acted thriller and one of the better films of 2013. I rate this film 9/10.","user":"g-bodyl","rank":[24,27]},{"title":"An intelligent thriller that takes its time dishing out retribution.","rating":8,"date":"13 May 2013","review":"Dead Man Down is a surprise and an exceptionally rewarding viewing experience. This is an intelligent thriller packed with action that takes its time to unfold and finally wanders off into the sunset leaving the viewer invigorated and satisfied, but ready for another bout.<br><br>Victor (Colin Farrell) is a player in in gangland kingpin Alphonse's (Terrence Howard) empire and, though he gives the appearance of being Alphonse's right-hand man, his intentions towards the crime lord are decidedly darker. Meanwhile, the girl in the apartment opposite, Beatrice (Noomi Rapace), watches him dispatch an adversary and blackmails him into dishing out a generous serving of retribution that she herself is unable (or unwilling) to administer.<br><br>Neils Arden Oplev (the original Girl with the Dragon Tattoo and currently shooting Stephen King's Under the Dome) peels back layer after layer to reveal ever-rawer characters and emotions in Dead Man Down. It isn't just about unfolding the story, though he does so beautifully, it is more about filling out the characters carefully so that we understand what makes them tick. No, what makes them angry.<br><br>There are some severely damaged characters on display here but their emotions, their actions, come across as not just understandable but entirely justified. Forget petty crooks with violent whims, Victor and Beatrice have given serious thought to their revenge but that doesn't make them shallow or irredeemable.<br><br>While Victor bubbles along in a coldly, organized manner, Beatrice rages under her skin. On the surface she is the cool cat but the confusion, the maelstrom of rage, bitterness and loss, swirls within her so that she is potentially dangerous to herself and Victor. It is tempting to use the old cliché of both Farrell and Rapace 'never being better' but it isn't true in her case; she is frequently this good, even if the films don't always match her talent. In Farrell's case, he has so many under-performing films (London Boulevard, Tigerland) and the odd turkey (Total Recall) on his CV that it is easy to forget that he is generally on very fine form. Don't believe me? Look again at Phone Booth, In Bruges <br><br>Howard has a reputation in the industry of being 'difficult' (note the recasting of Colonel Rhodes in the Iron Man sequels) but his body of work is extraordinary and the intensity of his performance in Dead Man Down makes it blindingly obvious why he's a good bet on screen. There's no Nicolas Cage-type ranting, just a considered, quiet violence to his Alphonse.<br><br>Dominic Cooper slips along in Dead Man Down, not at all unremarkable, but just another fine actor and a superbly cast film. As Darcy, another of Alphonse's mob and friend of the traitorous Victor, he comes across as a good(ish) guy who's unfortunate to be caught up in entirely the wrong job in the wrong place at the wrong time. He doesn't steal scenes here but he fills them out, he completes them, knowing his place in the hierarchy of the mob and his billing in the film.<br><br>Oplev has crafted a very fine thriller indeed. The drama excites, the explosions scorch the skin but what makes Dead Man Down stand above so many others in the genre (I'm talking to you, Welcome to the Punch) is not the ramped up action but the stillness and the time and care he takes over his characters and the setting of the atmosphere. He allows us time to enjoy the clinking of ice-cubes in glasses as Victor and Beatrice consider each other and, strangely for a director of an action flick, allows the dialogue to do the talking rather than the gunshots and the car chases.<br><br>Dead Man Down is at times gentle but always thrilling and the pauses in the action don't ever detract from the pace. Conversely, they make it more intense and a film that truly deserves to register at the box office in spite of the big-buck, megastar vehicles of Iron Man 3 and Star Trek Into Darkness. I fear it will be another 'underperforming' film on Farrell's CV, but don't for a minute confuse that with being a flop. The dead man might be down but he definitely isn't out.<br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[103,130]}]