[{"title":"Not bad for a comedy sequel","rating":5,"date":"19 August 2017","review":"I watched both 'Horrible Bosses' films back to back and it's clear that the first movie is the better of the two. 'Horrible Bosses 2' has its moments but lacks ideas and the originality of the first film. The guys are a lot more stupid in the sequel, they reminded me a lot of the Hangover trio. Whether that was deliberate or not I don't know, but they weren't that dumb in the first film.<br><br>By the standards of the average comedy movie, it's not bad. I laughed a few times, which is more than can be said about a lot of comedy sequels. Like in the first film, Aniston and Sudeikis are the highlight for me. Both are brilliant in their roles. 'Horrible Bosses 2' isn't as bad as some would have you believe, but there's a clear lack of ideas here.","user":"areatw","rank":[20,24]},{"title":"Pretty good for a sequel","rating":7,"date":"20 August 2018","review":"Personally I loved both the first movie and this one. Although the storyline is a little predictable it definitely is funny and it's great to see everyone from the first movie in the second movie with the exception of Colin Farrell. (Obviously) <br><br>I love Jason Sudekis, Charlie Day and Jason Bateman together and I'd definitely watch another movie with these three. Is this sequel Oscar worthy? No, but it is definitely funny and a pretty good sequel.","user":"britquatrini","rank":[9,11]},{"title":"I laughed so hard","rating":8,"date":"13 February 2015","review":"I honestly thought it was way better than the first. This movie is ridiculous, the whole scenario is ridiculous which is what makes it funny. The three main actors have the best synergy. Three morons who try to kidnap a millionaire's son for ransom, you can only imagine the chaos that ensues. I really enjoyed it, but the humour is a little silly so it's not for all. You either going to like it or hate it, more specifically Charlie Day. A lot of people complain about his voice, but personally I thought he was one of the funniest. One thing is for sure, this movie does not deserve a 6. It's well above 6 and should easily be ranking 7-7.5 score.","user":"cajete","rank":[81,137]}]