[{"title":"Saving Mr. Banks is a terrific, adult movie that will change the way you view Mary Poppins forever.","rating":9,"date":"28 December 2013","review":"This movie is much more than and definitely deeper than one would suspect from the 'syrupy' trailers most people have seen. The understory, gradually revealing the early life of P.L. Travers, the author of Mary Poppins, and depicting how the people in her dysfunctional family led her to write Mary Poppins, is the true core of this movie. I will never see Mary Poppins in quite the same way. All of the acting is superior, and the score is excellent. This is not the shallow, childlike movie that many will expect. I would not recommend it for children 11 and under, depending on the child. Otherwise, I highly recommend this movie, even if you are not a big fan of the original Mary Poppins film.","user":"gailalong-1","rank":[123,147]},{"title":"Truth, not all the truth, yet nothing but the truth, Walt Disney's Saving Mr. Banks is a Best Picture Hopeful with all the good credentials","rating":8,"date":"19 December 2013","review":"Walt Disney Pictures rarely aims for the Best Picture crown, being more a company focused on profits and sustaining its wildly popular brand. To make you haters hate more: they've earned $4 billion this year already and this includes the $200 million loss of Lone Ranger). They usually only distribute the movies that have a shot at Academy Awards immortality, with The Help (A Dreamworks film) being the latest example of a nominee and No Country For Old Men being their latest example of a winner.<br><br>But with Saving Mr. Banks, Disney is going the whole nine yards. With a stellar cast, seemingly endless budget (Giving John Lee Hancock a much-less stressful job in directing), high production value, and heavy dosage of drama that hides beneath the happier movie trailers, this film stands as one of the better dramas of the year and a sure-fire Oscar-contender. Touching upon the tissue-happy themes of forgiveness, family, and seeking happiness in a miserable world, prepare for waterworks throughout the two hours.<br><br>What makes this movie work more than anything else is the screenplay that didn't start in the studios of Disney, allowing for a more accurate portrayal of the true story behind the making of the masterpiece Mary Poppins----even if the entire world knows that with the backing of Disney some details will be left out. Kelly Marcel and Sue Smith weaved out an engaging story full of crisp dialogue and skillfully avoids becoming too overblown or too overdramatic. And whenever the movie gets close to being all-out depressing, we get treated to humorous moments here and there to keep the audience in check.<br><br>In a movie about artists that are addicted to their craft, you need actors that work with the same type of fervor. Emma Thompson despite not getting top billing gets the most screen time, gets the toughest job, and delivers the ultimate performance. She becomes very dislikable and yet sympathetic at the same time, and it is impossible to see anyone other than Thompson deliver this type of impact. Tom Hanks in an Oscar-baiting year does a superb job portraying the icon planet Earth knows and loves as he gives Walt Disney a humanized performance that separates the flawed man from the myth the Disney Company has feverishly worked to this day to protect. The rest of the cast does not disappoint, and we even see Colin Farrell potentially impress some Academy voters as the loving yet extremely defective father figure.<br><br>Disney's protection of its brand is the sole reason why Saving Mr. Banks could never ever ever ever ever ever be produced or made by anybody else. But luckily for all viewers, Disney doesn't pull back many punches in delivering the story behind the complex and conflicted making of Mary Poppins. It will be deep in the Golden Globes and the Academy Awards but ultimately indeed deserves the praise—even if you won't see all the details behind the true story on screen.","user":"diac228","rank":[132,164]},{"title":"Great tribute to Walt","rating":9,"date":"20 November 2013","review":"Saving Mr Banks tells the story of Walt Disney's battle to get the rights to make Mary Poppins into a movie. I wasn't expecting to like this but was completely blown away. <br><br>It is beautifully put together, is hilarious in parts and very touching and emotional at other stages, but is not overly sappy or cheesy. <br><br>There are some outstanding performances here. Emma Thompson plays Mrs Travers beautifully - a cantankerous and stubborn lady, yet you can't dislike her. Tom Hanks does a good job of playing Walt Disney - a tough role for anyone but he seems to suit it, so long as you can get past the terrible fake southern accent which is worse than Dick Van Dyke's attempts at an English accent in Mary Poppins. <br><br>However the stand-out performance is, surprisingly, delivered by Colin Farrell as Mrs Travers' father. He brings amazing range and emotion to a character that is simultaneously a loving, sweet father and a man caged in by life and personal demons. <br><br>Go see it for yourself when it comes out at the end of November. I'm looking forward to watching it again.","user":"baz-b","rank":[140,178]}]