[{"title":"A War Film for Grown Ups","rating":9,"date":"29 April 2014","review":"I suppose if your experience is limited to veteran level on Call of Duty or Michael Bay films then this probably isn't your cup of tea.<br><br>I saw this film in Brighton recently, and was very impressed given the limited budget. Combat is 98% boredom and 2% sheer terror, and this film didn't try to make out that war is anything other than that, along with soldiers bitching about their kit and conditions, and the inevitable stress and tension between fighting men, particularly when the enemy is elusive and rarely clearly seen.<br><br>Judging by other reviews, one might be forgiven for thinking that war is an entertainment franchise. Nice to see a war film directed by a former soldier with a grounding in the realities of combat, rather than some fist-pumping gung-ho CGI-fest directed by a Hollywood celebrity with a massive budget and zero experience of the realities of war.<br><br>Something of an antidote to the usual war film cheerleading, and not one to appeal to MMRPG playing geeks.","user":"sdp-williams","rank":[43,62]},{"title":"Some are expecting too much...","rating":7,"date":"30 April 2014","review":"As someone who is fed up with watching countless American films about their involvement in their wars, I was fairly excited to watch this British take on the Afghanistan conflict. Unlike the American versions however, this film had an incredibly small budget. Having said that, the kit is good, the sound effects and the explosions etc are incredibly good. It's not perfect however, the storyline could be better and at times some voices seem dull. But all in all, with such a tight budget, this is an excellent film, I hope that this production team will get together once more and produce another film with a slightly bigger budget.","user":"tm-wood1995","rank":[26,38]},{"title":"See it and judge for yourself","rating":9,"date":"29 April 2014","review":"This is a triumph of British cinema, giving an account of a war which has come to embody the West's reaction to terrorism. An army patrol with no understanding of their mission, overcome by the futility of their orders and betrayed by their politicians - an embodiment not just of our forces' presence in Afghanistan but of the nation as a whole. An ever constant threat, an enemy never seen, and the boredom of military life - this is a tough act to pull off in cinema and retain the audience, but The Patrol succeeds by virtue of its honest approach. We empathise with the individual cast members and this makes the conclusion all the more gut wrenching. Any war film which doesn't follow the \"gung ho\" line will have its detractors, especially when depicting current conflicts with such brutal honesty. The Patrol deserves to be seen by as wide an audience as possible.","user":"sam-1384","rank":[29,43]}]