[{"title":"Interesting and brutal captive fighting movie with women.","rating":6,"date":"31 August 2015","review":"My quick rating - 6,0/10. A different look on the women behind bars story. These women are held captive and forced to fight to the death in an underground \"dungeon\"? That is what it looked like. Very brutal and quite depressing movie showing the violent side of the fighting coupled with the bonds this women create before they must face the inevitable if they win. They will have to fight each other. Pretty decent acting for the very limited budget. Didn't know who Zoe Bell was before (the main character) but she did a good job. Also to note, a very good ending that may or may not leave the door open for a sequel. Fighting scenes are not for the squemmish but beyond that, nice diamond in the unheard of rough.","user":"jackmeat","rank":[11,12]},{"title":"Not your regular 90 minutes martial arts flick","rating":7,"date":"12 January 2014","review":"It is really good. Unfortunately a lot of people seem to watch it with the completely wrong ideas about it in their head. This movie is not about empowered women and it doesn't make any political statements. It shows how women from different walks of life act when thrown into an impossible situation. For this the organization who kidnaps them chose women who know how to fight or else the whole setup wouldn't make much sense. But it is not like your regular 90 minutes martial arts flick. There is nothing heroic about it. The directing, the lighting, the soundtrack - that's all closer to what you see in horror movies and they way they went about making this film reminded me a little bit of Saw.<br><br>I gave it 7/10. The acting is damn good and the general mood of the movie is dark. The fighting isn't glorified and flashy like in your regular action movie where male fighters have to fight in a to-the-death tournament. It is extreme, unpretty and direct. If they had given the story a little bit more room for getting into the surroundings and the organization who's holding the fights I'd probably have given it an 8. A few things were to compressed in my opinion.","user":"tatsu2050","rank":[40,54]},{"title":"Very bloody, dark but good movie..","rating":8,"date":"25 August 2019","review":"It was the most brutal fight scenes so far.. Phoebe's killing the blonde scrubbing on the wall, Zoe Bells killing another drowning in sand... But still the movie could give us the impression that they had to kill for their and their families lives and in fact they were sad, only Phoebe was happy to be in such fights.\nI liked the film , it was a deep and good martial arts film.\nActing was super...","user":"ergunbul","rank":[5,5]}]