[{"title":"Better Than Anything on SyFy","rating":6,"date":"14 June 2013","review":"Upon his 18th birthday, a young man receives a mysterious phone call telling him to come out to a property he just inherited. Now, he will learn about his true past and the dark secrets of his family.<br><br>I would first like to point out that director Colin Theys is under 30, and has already accumulated a decent amount of credits. Now, they may not be big projects and he may not be the next big thing in horror. However, \"Dead Souls\" was better than average and I think we might be seeing Theys moving up in the world very soon.<br><br>The film as a whole has a creepy atmosphere and preys on the connection between God, faith and how far we will go for what we believe in. Other stories have told this tale with varying degrees of success. Here, I think we have a new angle -- the protagonist, despite being born into such a home, is completely unaware of it and experiencing everything for the first time. He is an outsider as much as an insider.<br><br>Not all of the acting is great, and some of the characters are a bit random and show up without reason. Even Emma seems to be thrown in there for nothing more than a romantic interest. I do have to single out Bill Moseley as doing an excellent job. He gets roles in many bad films and gives performances to match. Here, I think he gives it his all.","user":"gavin6942","rank":[13,22]},{"title":"Dead boring...","rating":2,"date":"11 October 2013","review":"Beginning tepidly, and concluding with just about the most confusing, ridiculous climax I've seen like EVER, Dead Souls is another big FAIL of a horror film to add to my ever-growing list. It's also loaded with the cheapest scare tactics around, you know... the mysterious shadow in the corner, the girl on the swing... but when you turn round, nothing's there. Once or twice, this might be effective... but this constitutes 90% of the action, and quickly becomes an exercise in tedium.<br><br>I don't want to get into the dopey story, but I do want to highlight the last 15 minutes or so. Until then, I was ready to label it as a not very good, but relatively harmless piece. But then, the dead started coming back to life, with all other kinds of cockamamie going on... it wasn't big, it wasn't clever and didn't make one lick of sense. It could have worked I suppose if it had been well done, but this segment had more ham than a butchers. Yeesh.<br><br>Final Note: One thing I've noticed of late: The better illustrated the DVD box of a scary movie, the more rubbish it is. It's like they're saying: \"Who cares if it's any good? All that matters is it looks nice on your shelf!!\" 2/10","user":"natashabowiepinky","rank":[12,20]},{"title":"A Classic Ghost Story That Never Comes Together","rating":7,"date":"1 June 2015","review":"An average, run-of-the-mill ghost story that neither succeeds or fails and only captures the imagination a few times. Director Colin Theys never really pulls the elements of the story together and fashions anything substantial from them. The cast is less than adequate for the most part with the stunning exception of the wonderful Geraldine Hughes. She gives a superb performance and gives the proceedings a touch of class. However, she isn't in enough scenes to rescue the movie from the oblivion to which it's destined to disappear. Due to the presence of Hughes, the film deserves 3 stars more than the 4 it would ordinarily receive on its own merits.","user":"jlthornb51","rank":[2,2]}]