[{"title":"Great concept, lacks follow-through","rating":4,"date":"14 November 2013","review":"The idea of a man finding out he's been laid off or fired on the last day of his vacation, then suffering a mental breakdown has an interesting appeal. However, the plot was uneven (some mental breakdown, some interest in way-to-young women, some random interludes with older women). The guerrilla filming was great, but the story of mental breakdown could have (should have) been better, instead of being a random set of stories of a degenerate man who isn't faithful, and puts his needs above his family's. Based on descriptions, I expected a story about mental breakdown due to stress, but instead, it's more about the guerrilla filming style. He should have spent more time on the script.","user":"matweed-844-558796","rank":[24,29]},{"title":"I guess at least it can still be the ultimate guerrilla film, just not the best.","rating":5,"date":"26 October 2013","review":"While this may not exactly be Heaven's Gate, Escape From Tomorrow is a case of the film's production being far more interesting than the film itself. Surreptitiously shot at Disneyland without any permission at all, this film can still earn its title of ultimate guerrilla film based on that fact alone. However, the most interesting factor is that not only do Disney now know about it, but they're not doing anything about it. Evidently it's not worth the effort but boy is is that a hook beyond the film's context itself. Everyone loved the idea of this film. It's a great juxtaposition, a surreal David Lynch/Terry Gilliam-esque nightmare in Disneyland. Unfortunately the films we concocted out of our imaginations are much better than the material Moore thought about. This is the work of an eager amateur.<br><br>Contrary to expectation, Escape From Tomorrow has an incredibly mild execution, focusing on cheap gags and slapstick rather than scares or atmosphere (black and white film is not atmosphere). Granted, I'm sure Moore had a lot of challenges and maybe the film doesn't match his initial vision, but the scenes away from the parks match the weirdly off tone so maybe this is who he is. The photography is only okay. The technical aspects do suffer, particularly with sound and visual effects in green screening, but that's forgivable given the circumstance but not forgivable given the script. The fundamental problem is that the acting is very unconvincing. Instead of a protagonist undergoing an understandable mid-life crisis, he ends up like Lester Burnham without the charm, acting just like a terribly unlikeable 16 year old pervert. And this guy is supposed to be a parent.<br><br>Perhaps Moore wants us to be uncomfortable watching him, maybe there's things to be said about man's desire for young women, but it's not the kind of meaningful discomfort that really makes a viewer think, it feels thrown in there as a character quirk. It's hard not to go into these types of films without expectations, but it simply didn't go as dark as I would've wanted and ended up feeling random instead with too many plot threads. The film could've saved itself by its final minutes by tying up all of them in an interesting way that actually says something, but instead they vouch for a single one that negates the others. It can be interesting and engaging at times, but as a whole it doesn't really work since Moore doesn't have anything to say about the human psyche, just that this would probably be cool if a film shot in Disneyland about bad things happening existed. Please make this a curiosity viewing only and don't get too excited.<br><br>5/10","user":"Sergeant_Tibbs","rank":[47,63]},{"title":"Wish I Could Give it Zero Stars","rating":1,"date":"27 January 2019","review":"A rambling, whining, nonsensical, egotrip of a movie. Agonisingly obvious, and filled with faux-deep 'statements' on humanity that mainly consist of fatphobic ableism. This movie would be played on repeat in my personal hell.","user":"theargentbusiness","rank":[6,6]}]