[{"title":"It starts off slowly but is worth your time.","rating":7,"date":"16 October 2013","review":"\"The Kings of Summer\" is a film you need to accept on its own terms. It's not a Hollywood production, it has a relatively low budget and it has a few plot problems. Sure, the characters might not be 100% believable or even really that likable--but, if you sit back and watch it with modest expectations, you'll find the good easily outweighs the bad.<br><br>The film is about two disaffected teens. Both hate it at home and they want to get out...but how? When one comes up with an insane plan to move into the woods and build their own shack, the other, reluctantly comes along for the plan. There is a third--and that kid, Biaggio, is a real cipher. He's bizarre and in the film mostly for comic relief--though I found myself liking him the best of the three. But when he disappears, no one seems to notice...he's that sort of a kid. But the two main characters are initially happy and their running away seems to be working out well...at least for a time.<br><br>Overall, this is a film that folks who only enjoy traditional movies will probably NOT like very much. As for me, I have a higher than normal tolerance for the unusual and found a lot of nice performances and moments in the film. Worth seeing and clever.","user":"MartinHafer","rank":[51,61]},{"title":"A comedy, with all the right mixes of emotion.","rating":8,"date":"18 February 2013","review":"Toy's House was an interesting film following what most teenage kids wish...A kid who finally breaks free from his parents control. Joe Toy and his friend Patrick get fed up with their parents and decide to build a house in the woods to live in.<br><br>I really enjoyed this movie. It seemed to have the right mix of comedy and drama to keep you engaged the whole movie. Watching a couple of teenage boys try and survive in the woods was a lot of fun, and Nick Offerman as Joe's dad was a lot of fun as well. The biggest thing to note, is that while this is billed as a comedy, it was definitely more than that. The emotional aspect of this movie was everything you come to expect from a movie that has to sale itself with a great story, like most films at Sundance, which made it all that more fun.","user":"JustinBell4","rank":[72,95]},{"title":"Sweet and...independent.","rating":8,"date":"22 July 2014","review":"If you are looking for a heart-filled independent film, then this is the right choice for you. This film has a lot of heart put into it, which makes its characters more likable, interesting, and funny. The humor has this old-fashioned vibe to it, making this film great for adults (props to the soundtrack for some awesome retro-gaming like music) Now, do I think the humor stands out as much as the story? Not really, but that's not a bad thing. A comedy's story is usually very weak so that only makes this comedy stronger. Also, the likable cast also leads to some great humor. You want to see these kids succeed in building their own home in the forest and its very enjoyable to watch. A great cast (Moises Arias as an oddball weirdo was an awesomely funny choice), good humor, and a great heart is what a comedy should be made of. The Kings of Summer definitely rules.","user":"Kyleeeeeeeeeeeeeee","rank":[11,13]}]