[{"title":"Rapid-fire verbal humor which soon becomes tiresome.","rating":3,"date":"30 July 2014","review":"The story starts with some promising comments on the fate of husbands at the hands of their wives, but it endlessly repeats the old Jewish joke on this issue (that husbands -- even those who do well at work -- are brow-beaten at home. You know the kind of thing: 'Why do all Jewish husbands die before their wives? Answer: Because they want to.'). And as the plot develops this theme becomes increasingly tiresome, boring and, indeed, nasty, until you begin to yawn when each predictable scene follows another: nagging wife, misunderstood husband; men are from Mars, women from Venus; etc. etc. And then the soppy ending you saw coming after the first five minutes. I'd give it 'One' star but maybe it deserves three if only for some of the acting and editing.","user":"mernestc","rank":[19,22]},{"title":"A single bachelor helps his married friends re-connect with thieir macho side","rating":10,"date":"27 July 2014","review":"You will love this if you liked Hitch, Hall Pass and Couples Retreat. This movie was like riding a roller coaster. I rarely laugh out loud during movies, but at least a few scenes had me in hysterics. A few funny lines from the bar scene I will be using with my friends when I go out to order drinks. It also had a cool shocking moment and a tear jerking ending. Don't take your eye away from the office scene, or you might miss it since it happens pretty quick. It hit so close to home. I meet my married friends for happy hour and annual vacations and they have the same issue as in this movie. They need to take some tips from John Stamos. This has got to be Stamos' best movie. I think this movie has a potential to be a cult movie, so I will watch again, but this time after a few drinks and things.","user":"imdb-406-401487","rank":[3,14]},{"title":"Perfect Couple Date Night Movie","rating":9,"date":"25 July 2014","review":"A great romantic comedy for married couples and those thinking about getting married. Movie will both having you laughing and looking back and forth at your significant other as you recognize different parts of your relationship that you will 100% relate to. For guys out there...expect a few elbows in the ribs from your wife. <br><br>The cast is great and there are many cameos from familiar faces. Movie doesn't take itself too seriously and there is a story line to go along with all the laughs.<br><br>Lots of great comedy, great performances and a story you will enjoy. You will leave with a smile and might just have a few things to examine in your own relationship.","user":"paul-2663","rank":[5,33]}]