[{"title":"Entertaining black comedy á la Forrest Gump","rating":7,"date":"1 January 2014","review":"The Jonas Jonasson novel \"The Centenarian Who Climbed Out the Window and Vanished\" has been a gigantic success in Sweden, selling more that 250.000 copies. A success that has spread to a lot of other countries as well. I read the book just days before I saw the world premiere on this, as I got the book as a x-mas gift, just two days before the premiere.<br><br>Well, to make a long story short, this is an unlikely black comedy in style of Forrest Gump, though darker and way more stupid, and filled with more stupid humans. Other films it's in class with here would be \"Fargo\", \"One night at McCools\", \"Seven psychopaths\" a.s.o. The book functions, and I'm glad to say that the narrative grips made on this as a script works as well. It's a good farce, which will give out many laughs. The two hours goes like it's one.<br><br>The 100 years old Allan runs away from his birthday party, and starts a story which only he could be behind. Inwise decisions gives severe results, and looking back on his own life, he's done it before. He's made both tragedy's as well as things leading to happier consequences. They have tried to lock him up more than once, but he's not the easiest to detain.<br><br>I enjoyed the film in a quite crowded cinema, which already started laughing at the first scene, and so i t went on. A mixed audience, with surprisingly many pensioners, which have read the book, will probably guarantee the film to be an even bigger success than the novel. At least, that's my guess.<br><br>Well, how well is the novel brought to the screen, then? Well, surprisingly well, I would say. The most boring parts of the book is when Allan thinks back, and this is narrated down, so that the story happening present is the main thing. That's a major thing in making this work. There's been some minor changes done to shorten the travel, which unfolds like some kind of a trip or road movie, if you like, just as the book.<br><br>The make up is brilliant, and way better than we've seen in Hollywood films (!). Amazing. Robert Gustafsson, playing Allan, is just turning 50, but here he looks perfect both in the twenties, the thirties and as 100 years old. (Well, maybe he looks eighty-something more than 100, but still it's quite passable.)<br><br>Some of the CGI isn't exactly brilliant. This I see much better in Norwegian movies. Especially all the explosions are bad, but it doesn't hurt the story, since it's far from believable anyway. The famous persons portrayed are also quite good. The casting is well done, also when it comes to the actors playing the younger Allan. What annoys extremely is the music, which not only is stupid and too \"funny\", it's also very high in the sound mix. This is the worst bit of the movie. There's also some goofs, like the frozen guy and a tank lid closing itself, while driving away, but still not very big issues.<br><br>So very well done, and the best Swedish comedy I've seen in many years. Thanks to a great staff, a quite large budget (63 millions SEK) and wonderful actors. (I'm sure it will play in the money!) The book is well taken care of, and if you enjoyed the movie, you'll find a lot more in the book, now with the clients you've seen here.","user":"OJT","rank":[112,135]},{"title":"Hilarious","rating":9,"date":"10 October 2014","review":"This movie is extremely funny. From the moment the old man crawls out of the window until the very end of the movie, it is a stitch. It is fast paced and all the characters are well drawn and fleshed out, even characters that only appear near the end of the movie. I was reminded of Peter Seller's movie \"Being There\" and, yes, there was a bit of \"Forrest Gump\" in it. I did not object to the \"violent\" deaths that some of the characters experienced because they were so over the top that they could not be taken seriously and the audience apparently agreed with me since everyone was howling with laughter. We saw the movie at the Chicago Film Festival and it was one of the few times I have attended a film festival when the entire audience stood up and clapped at the end of the movie.","user":"carlinafox","rank":[65,79]},{"title":"A marvellous film of many kinds","rating":9,"date":"3 September 2014","review":"This film follows the progress of Allan Karlsson, a simple man with a predilection for blowing things up, after he leaves his nursing home to embark on a journey that will take him wherever it takes him. Through flashbacks we see that this is a metaphor for his entire life. Karlsson has, it turns out, been with several significant figures of the 20th century and, unwittingly, has profoundly affected its course.<br><br>The film is comic, darkly comic, absurdist, farcical, a chase caper, an espionage thriller and, finally, peaceful. It is all of these things successfully in a way that Wes Anderson's \"The Grand Budapest Hotel\" attempted to be, but didn't quite manage. More importantly, the characters are entirely believable despite the often fantastical story lines. It is also beautifully shot.<br><br>\"Life is what happens to us while we are making other plans.\" — Allen Saunders<br><br>Thoroughly recommended.","user":"Qrobur","rank":[57,71]}]