[{"title":"the life and times of a great artist","rating":10,"date":"22 April 2012","review":"I just watched an early screening and this film really works as the story of a visionary artist of his time, using animation and interviews the film zips along his timeline with humour and insight.Johnny Depp plays it straight brilliantly and some of the music really works with the pace of the film. i really recommend this film for anyone who is interested in the whole Gonzo idea. Richard E Grant-add words of insight Terry Gilliam and Jan Wenner add their bit but the real star of the film is Ralph himself. Telling stories and memories the great artist guides us through sometimes difficult observations of the way we have been conducting our lives, his savage pen perfectly accompanies these raw words of truth about poverty, America and his friends, a really entertaining watch.","user":"ella_bella_star","rank":[29,32]},{"title":"A different look into the art world! 6/10","rating":6,"date":"13 September 2014","review":"Review: I really enjoyed this documentary about the extremely talented artist, Ralph Steadman, who has a very unique style of painting/drawing. A lot of people have seen his work on the Withnail &amp; I and Fear &amp; Loathing in Las Vegas covers, but he hasn't really became an household name. After seeing his amazing work in this documentary, which shows Ralph Steadman being interviewed by Johnny Depp who was the main character in Fear &amp; Loathing, you can't help thinking that he is extremely under rated which is probably due to his personal political views. This movie gives an in depth look about the thought process behind his work and the strange but wonderful relationship between Steadman and Hunter S. Thompson. I think that the director done a great job with this documentary, and for someone that had never heard of Steadman before, I will definitely look out for his previous and present work. Enjoyable!<br><br>Round-Up: The way that the director was able to use Ralph Steadman's work to put it into mini cartoons, was brilliant and to see Steadman create a painting from just flicking the paintbrush onto a blank piece of paper, really does show how talented the man really is. The different techniques that he uses to come of with some amazing paintings, was an eye opener, but it's a shame that no one has really heard of him. In the art and movie world, he does seem to be well known and respected but I really didn't have a clue about his work before I saw this documentary. Anyway, it's worth watch if your interested in this type of thing, but I'm sure that some people would find it boring if they were looking for entertainment.<br><br>Budget: N/A Worldwide Gross: $67,500 (Deserved more!)<br><br>I recommend this movie to people who are into documentaries about art and who have seen some of Ralph Steadman's terrific work. 6/10","user":"leonblackwood","rank":[6,6]},{"title":"One of the very inspiring people that Johnny Depp \"collects\"","rating":10,"date":"6 January 2015","review":"Johnny Depp, who is intriguing himself, seems to collect other intriguing people as friends. This documentary is about his friend Ralph Steadman, the artist who collaborated with Hunter S. Thompson and did a range of other fascinating work including illustrations for children's' books.<br><br>Steadman demonstrates his creative process, discusses his love/hate relationship with Hunter S. Thompson, and talks about what he was and still is trying to achieve with his art. <br><br>If you enjoy explorations into the intimate, fascinating details about artists and their work, you will love this film. If you've read Fear and Loathing in Las Vegas, it will be all the more interesting.<br><br>I appreciated that Johnny Depp remained as invisible as possible, making sure Ralph Steadman took center stage. By the end of this movie, I was fascinated by the artist, and I am planning to view some of the books he has illustrated.<br><br>Detailed documentaries about artists and their thought processes are not for everyone, but if you are fascinated by this type of film, you will not be disappointed in this one.","user":"jenperkins123","rank":[2,2]}]