[{"title":"Surprisingly Good Ghost Story","rating":7,"date":"8 February 2019","review":"After the explosion of a research laboratory in Chicago known as The Event that kills a great number of people, the living people cohabit with ghosts known as remnant especially near the ground zero. Ten years after The Event, the teenager Veronica Calder (Bella Thorne) has classes about the remnant laws with her teacher August Bittner (Dermot Mulroney). She also coexists peacefully with the remnants until the day she is threatened by the mysterious remnant Brian (Thomas Elms). She seeks help with her schoolmate Kirk Lane (Richard Harmon), who is an expert in remnant, and they need to the Chicago's No-Go Zone, a place forbidden to humans, to learn secrets about The Event and the killer.<br><br>\"I Still See You\" is a surprisingly good supernatural thriller with an original ghost story. The screenplay does not have the usual clichés of the genre and the acting is good. My vote is seven.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[35,39]},{"title":"I Still See You: A beautiful surprise","rating":8,"date":"3 December 2018","review":"Within moments I was oddly gripped, I loved the concept and the whole thing looked sleek, original and fascinating.<br><br>Starring the stunning Bella Thorne and underappreciated Dermot Mulroney this is one that is very hard to pigeon hole as it doesn't really fall under one category.<br><br>It tells the story of a science experiment gone wrong and a world where ghosts walk among the living frequently, though they are unable to interact nor aware that they're deceased.<br><br>The ideas within the movie are remarkably clever but I quickly began to think that they'd be better suited to a television series rather than a movie. By the end, I had that belief confirmed. Don't get me wrong I Still See You is a very enjoyable movie but I think it was perhaps released in the wrong format.<br><br>Genuinely clever, interesting and captivating I can't argue that it isn't without its flaws as truth be told it has many BUT the quality of the film outweighs them.<br><br>I'd recommend the film to anyone and everyone, sure it has that teen-sci fi vibe about it but thankfully manages to be considerably better than that.<br><br>I'd love to see this become a television series, I'd rush to watch that every week. But if this is all we get, then it's enough.<br><br>The Good:<br><br>Looks great<br><br>Bella Thorne and Dermot Mulroney<br><br>Some great ideas<br><br>The Bad:<br><br>Some of the ideas don't feel fully formed<br><br>Leaves a lot of unanswered questions<br><br>Things I Learnt From This Movie:<br><br>There is still life in the ghost sub genre<br><br>We need more original movies like this and less reboots","user":"Platypuschow","rank":[44,52]},{"title":"A for effort, C+ for execution","rating":7,"date":"14 October 2018","review":"I really liked underlying premise of this movie, specifically that the millions of people killed by a cataclysmic event became ghosts, or remnants. In addition to this novel concept, the acting was good, and the characters' motivations and actions were logical and intelligent. In fact, I can't think of a single instance where extremely poor decision-making was used to advance the plot, setting this apart from most horror/thriller movies. <br><br>On the minus side, there were a number of plot holes and cheesy bits. Although they weren't bad enough to ruin the movie, there were enough of them that I can only give it a 7/10. <br><br>Overall, it was an enjoyable movie, and I would recommend it.","user":"ddbeuth","rank":[41,56]}]