[{"title":"Listen to a fellow Movie Fan, not the so-called professional critics: Self/less is inventive and entertaining!","rating":8,"date":"11 July 2015","review":"Sometimes I just don't understand so-called professional critics. I really don't. You give them a very good movie and they complain that it wasn't a lot better than it was. It's like they're going out of their way to be negative. That bothers me and that's why I prefer to call myself a movie \"reviewer\". I'm just someone who loves movies, sees a lot of them, knows a bit about the industry and wants to use my experience as a writer to discuss movies in a way that others might enjoy and find useful – and from a movie fan's perspective.<br><br>I'm only out to answer one question when I review a movie: Was it entertaining? If I feel it was, I recommend it, giving it a grade in the \"A\" or \"B\" range, depending on how entertaining it was. If it's not very entertaining, or just bad, it gets a \"C\" or \"D\". And if the movie is out-right horrible, it gets an \"F\". Simple, right? Well, \"Self/less\" (PG-13, 1:56) isn't going to change the world, but it is interesting, fun, thought-provoking and well-made. It is, simply stated, a very entertaining film. What more do we need in a movie? Underneath all its action and intrigue, this movie asks how important a person's life is and at what cost a specific person's life should be preserved. Oscar winner Ben Kingsley plays Damian Hale, a New York City real estate tycoon who is dying of cancer. Like most people, Damian is more than a little unnerved by the reality of his imminent demise, but, unlike most people, he has the ability to do something about it. He becomes aware of a very expensive and very secretive process by which his consciousness can be implanted into a younger man's body, enabling Damian to survive, enjoy life and contribute to society for another 50 years or so. He's rich enough to afford it and arrogant enough to think he deserves it.<br><br>Professor Albright (Matthew Goode) tells Damian that each body is an \"empty vessel\" grown in the lab. The body that Damian is given to inhabit looks a lot like Ryan Reynolds. The transition from his old body to his new body (called \"shedding\") is disorienting. Damian's mind has to get used to seeing a different reflection in the mirror and must learn to adjust to his new physicality. Albright puts him up in a luxury apartment near Albright's New Orleans facility in order to monitor the progress of Damian, Version 2.0. Albright also gives the new Damian red pills to help him suppress upsetting and reoccurring visions. Albright calls them \"hallucinations\" and says that they're a common side effect of the shedding process, but Damian says the visions feel more like memories. Hmmm.<br><br>As the story unfolds, Damian learns to make new friends, but keep the old. In his temporary digs in the Big Easy, he starts hanging out with a guy named Anton (Derek Luke). Damian also gets reacquainted with two very different women from his past (played by Michelle Dockery and Natalie Martinez) and has to reach out to an old friend and colleague (Victor Garber) when things get complicated. A sci-fi drama becomes a mystery, a psychological thriller and an action movie with several twists and turns. \"Self/less\" is part \"Invasion of the Body Snatchers\", part \"The Bourne Identity\" and a little bit of \"The Matrix\". There's a lot going on to keep you entertained while you're thinking deep thoughts about the story's bigger issues.<br><br>Some critics fault \"Self/less\" for becoming too much of an action movie and failing to more fully exploit the plot's intriguing set-up. But I have a feeling that if they got the movie they say they wanted, they'd have called it boring. This is an original, exciting film that is very well-acted, well-paced (by director Tarsem Singh) and well-plotted (by screenwriters David and Alex Pastor). The moral issues are never far from the moviegoers mind, and are still there to be considered after some of the movie's more frenetic moments have faded from the screen. A movie doesn't have to be completely original to be thought-provoking and entertaining. \"Self/less\" is both – and more. \"A-\"","user":"CleveMan66","rank":[234,303]},{"title":"Mind swapping thrills n' chills FUN!","rating":9,"date":"10 July 2015","review":"This IMDb synopsis is accurate and a good starting point: Billionaire Damian Hale has terminal cancer. He turns to a radical medical procedure called \"shedding,\" in which his consciousness is transferred to a healthy body. After the procedure, Damian, now called Edward, starts a new life in New Orleans but is plagued by disturbing images. When he delves into Edward's mysterious origin, he learns that some will kill to keep it secret.<br><br>My buddy and I, both long time film buffs of multi-genres yearn for decent sci-fi thrillers that are well written and directed, leave us guessing here and there via plot twists and turns, includes necessary action, murder and mayhem and a credible Mr. Evil. This film delivers 116 minutes of story, acting, production value and pure cinema sci-fi thrilling FUN.<br><br>We were both thumbs-up entertained by one of Ryan Reynolds best efforts plus a fine supporting cast including Mr. Evil (Albright). Our usual post film discussion of plot holes was minimal given the original, well crafted screenplay. That is not to say we did not suspend belief as is the case with many of our best action/Sci-Fi films. A major section of the film, with some of its best action sequences, reminded me of my favorite scenes in Bourne Legacy. <br><br>With all the above said there was yet room for disturbed, romantic relationships and one cute kid spitting out all her needed lines. <br><br>Production value gives us some fun shots of New Orleans, area mansions and a finale 'home' in a spectacular locale.<br><br>There have been so many mind invasion/transfer films that our expectations for something original with thrills, excitement and pathos were low. We left the theater smiling for the simple reason that we were both thoroughly entertained.","user":"stevepat99","rank":[129,176]},{"title":"Cool little sci-fi flick, that gives you a little entertaining kick","rating":7,"date":"14 July 2015","review":"When I saw the trailer, I was expecting a quiet little sci-fi drama about an old billionaire played by Ben Kingsley who gets the opportunity to live longer with the purchasing of a new body, played by Ryan Reynolds, and discovers his new body had a prior soul in it.<br><br>The movie gave me a little more than that thanks to who the prior soul belong too and the large amount of trouble the creator of this body switching technique called shredding goes through to keep his project low key, when the billionaire freaks out about steeling another man's life. <br><br>It was an action packed drama helped out with an incredible musical score. It kinda has the same vibe as a movie called Limitless starring Bradley Cooper and Robert DeNiro. The Sci-Fi concept is different but it's the same tone of coolness. <br><br>Nothing in the movie is mind blowing, but it's very cool to watch and very entertaining, so I'll recommend.","user":"subxerogravity","rank":[75,100]}]