[{"title":"\"You may run as far as you can for as long as you like, but you will not escape your heart\"","rating":8,"date":"23 July 2012","review":"A safari hunter drifts across the starched heat of the African plains, stealthily prowling amongst the tall grass, the scorching shimmering sunlight falls upon the shadows of predatorial lions, hungry hippos and the gleaming jaws of the crocodile. A vinyl recording of 60s rock 'n' roll echoing over time through generations suggest a nostalgic remembrance of a distant land, which later plays a greater significance in a saga of unrequited love, regret and (literally) life and death.<br><br>Initially, Tabu is a love story in disguise, a unfinished love story sprawling over a lifetime of passion, regret, duty and propriety. In it's latter stages it contemplates ideas of memory, unrequited love, ageing, class inequality, prejudice, and European colonialism in African hills and plains.<br><br>The first part follows the life of an enigmatic elderly woman in contemporary Portugal - titled Paradise Lost - as she goes about her daily life, we learn snippets about her about her prosaic hobbies, simple pleasures, prejudices, idiosyncrasies, detests, and regrets over a sobering simple lifestyle, a long way from the dream life she idolised. Her simple pleasures have allowed her to gamble away her savings and her estranged family by doing so; in her current state, she had little left except her dedicated maid and carer Pilar who initially acts as the audience's eyes and ears into the portrait of a solitary woman.<br><br>What is the intriguing background to this lady's prime of beauty and youth? The modern landscape of metropolitan Lisbon, Portugal is industrial, bleak and sobering, at times sad and efficient, a far world from that which she inhabited in her youth. It is not long until what find out the origins of her melancholy and frustration, and what exactly has been trying to atone for most of her later life.<br><br>So begins a tale in colonial Africa, a tale of love and betrayal, rock 'n' roll, diamonds, and an alligator. This second part, subtitled Paradise is almost silent with only diegetic sound imposed during key moments with no title cards as far as I can remember. It is a wonderfully romantic and nostalgic yet with an undercurrent on living the edge of a precipice - the dangerous beasts of the African plains, the wild unfamiliar natives and rugged landscape - there exists a sense of tragedy combined with high passion, regret and wild party impulses.<br><br>Whereas part one is melancholic as it is bitter and comic, the second part contrasts the beauty of youth, the blinding African heat and sun, it exposes the storytelling medium the by abandoning almost all dialogue and all but some diegetic sound effects. The compositions and framing are gorgeous, a simple story of unrequited love requiring little explanation and is suggested by moods, looks, and atmosphere and nostalgic memories. The economy in telling a story almost wordlessly, embraces the feelings and mood of silent storytelling placing the onus of eliciting emotion on the charismatic and effortless performances. From the frustrating, fussy and capricious Aurora to the charismatic, carefree, jeunesse Ventura and the supporting jaunty characters, each signify the contrasts in class, social status and the colonial class system soon to collapse under political revolution.<br><br>What is essentially an unrequited love story /melodrama is a charismatic and rollicking passionate ride with some crystal sharp compositions in textured black and white. This is an impressive, technically creative, charismatic, heartbreaking, melancholic and nostalgic film; perhaps more daring and arguably less conventional than that other lauded silent film of last year. Tabu is gorgeously unpredictable, surprising and artful.","user":"polar24","rank":[37,39]},{"title":"A gem of a film not just about love, but love of cinema","rating":8,"date":"30 March 2013","review":"I watched Tabu knowing very little about it and found the film a real treat to watch, but however I will try to avoid giving too much away as this is one of those films that are best to watch not knowing too much. The whole viewing experience is very rewarding, not just emotionally, but also in that your required patience is amply rewarded. Though the entire film is shot in black and white, the two different stories are told in differing stylistic ways, making Tabu a very fitting tribute to cinema itself. <br><br>The first half, firstly being set in the present day, has almost a surrealist feel to it, with some apparently random moments and new characters being introduced suddenly. This does require your attention and anyone could be forgiven for wondering where the hell the film is going. However, as the first half reaches its inevitable conclusion and we enter the second half, this is where Tabu becomes an engaging and emotionally rewarding film. Many of the supposedly random moments of the first half now fit in perfectly as we are revealed what happened when Aurora was a young woman living in Africa. <br><br>The second half is a rather simple story of an illicit love affair that could never be but is told in an emotionally powerful way, enhanced by the framed narrative structure and deeply mournful narration of who we discover to be the man she loved. The power of the voice over is enhanced by the completely different stylistic approach of the second half, the only dialogue throughout is the voice over of Aurora's lover and the whole second half is shot in 16mm. The poignant reflections of the narrator can easily be interpreted as also being the director's and perhaps us the viewer's feelings towards silent era cinema of a bygone age. This stylistic approach is very much purposeful, all other diagetic sounds can be heard, and the characters are physically talking to each other. The emotional power is only enhanced by the fact all we can hear is the non-diagetic narration and having to otherwise rely on expressions and body language of the characters. Part two feels like a two sided approach to love of the past; a past loved one and a love of cinema of the past.<br><br>Despite the main subject of the story at hand, Tabu is not a completely bleak film, the playful use of different cinematic techniques and music are a joy to watch and the catharsis of the ending leaves a feeling of poignancy but not abject misery. There are however elements to Tabu that may frustrate. It feels that the protagonist of part one is Pilar, Aurora's neighbour and her story does feel frustratingly unfinished as we see elements of her daily life that make us truly care about her as these moments have literally nothing to do with Aurora. However, this is the story of Aurora through the eyes of those around her and in that case the stylistic approach of part one in retrospect fits with that of part two. The surrealist and playful approach to narrative structure in part one may seem pretentious and potentially alienating to some, but after watching the entire film I could only look back at it with positive feelings. <br><br>Original and unique, Tabu is a thoroughly engrossing and emotionally rewarding story that serves not only as a tribute to human love, but also love of the history of cinema. The first thirty minutes or so may feel hard work at first, but what the remainder of the film has to offer more than amply rewards the viewer's patience.","user":"MoodyB84","rank":[20,22]},{"title":"Taboo","rating":9,"date":"18 April 2012","review":"The title Tabu is one that looms large over film history recalling the collaboration of two pillars of silent cinema, F.W. Murnau and Robert J. Flaherty, about a forbidden love story (the film's taboo) between a fisherman and a holy maid, and splits its story between two clear sections titled \"Paradise\" and \"Paradise Lost\". In Gomes' film, we begin with a prologue of a Portuguese man's expedition to Mozambique in search of his lover's soul, ending in him being devoured by alligators and being reborn as one, before moving to the first section of the film, titled \"Paradise Lost\". In it, we follow María, a woman activist who's neighbour with a senile lady with a gambling addiction by the name of Aurora, and her African maid Santa. Aurora is poor and raving madly about her fictitious exploits in Africa and her strange dreams of being raped by apes, all the while being suspicious of Santa, accusing her of voodoo witchcraft. Eventually the woman's health declines rapidly, and as a last wish she asks María to look for a man called Ventura. María eventually finds Ventura but is unable to bring him to Aurora before her death. After the funeral, Ventura joins with María and Santa and begins telling the story of his affair with Aurora (played by the beautiful Ana Moreira), where he confirms she did actually live in Mozambique, and where he tells of his forbidden romance with her while she was pregnant of her husband's baby. Here we begin the section titled \"Paradise\", detailing the story of their affair and of their Portuguese social circle, back when Mozabique was still a colony, which makes up the larger bulk of the film.<br><br>One of the aspects that surprises outright is just how brilliantly Gomes manages to capture this story from an aesthetic point of view. Visually the film is of course emulating an older style of filmmaking, right down to the choice of working in an academic ratio (1.37:1), but his visual style is perhaps less reminiscent of Murnau's, and rather seems to emulate 50s Kenji Mizoguchi and early Satyajit Ray. There is that same remarkably organic, unimposing and ever so elegant kind of black and white photography which is harder and harder to find today (even the first half which is filmed in contemporary Lisbon), all the while the film works with a very limited array of sounds and music providing a background for a story told otherwise entirely through the voice-over of Ventura.<br><br>The voice-over eventually leads to many labyrinthine stories regarding the lives of many people he met in Mozambique, not least the members of his own rock n' roll band, specifically Mario to whom Ventura was a sort of right hand man. The stories are all vivid and told with great detail and humour, but essentially they are a smokescreen to what's otherwise a very simple tragedy of forbidden love, beautifully told. In many ways, even through these many decade-spanning branches, the film's narrative closely resembles the works of Gabriel García Márquez. The love story at the heart of it is one forbidden due in large part to the social aspect, that Aurora is a pregnant, married woman, but all throughout the film there's another side suggesting the nature of this affair's forbiddance is also of a divine kind - it is, precisely, taboo. There are many elements of magical realism at play, from the cryptic opening tale to the encounters with witch-doctors and seers, the latter foreboding the tragic end to the affair. Even the location, set around a fictional Mount Tabu, and the attitude adopted by Dandy, Aurora's pet alligator, seem to plot to make their fates meet. There is a strong mystical power at play, one that, like many of Márquez's most classic works, seems to exist as an unholy hybrid between local and European beliefs product of colonization.<br><br>Evidently, this affair is doomed from the start. The inversion of the original Tabu titles, leading to an almost sardonic remark over the latter section, allows us to see and know these characters' fate before we see their relationship progress, and thus the development of their relationship is all the more arduous and cathartic.<br><br>In the Q&amp;A with Miguel Gomes, he mentioned that he had no ulterior motives to tell this story, no overlapping ideas as he does not consider himself to be a smart man and therefore does not consider his ideas \"worthy\" enough to sustain a film (perhaps in admitting that he's smarter than a vast majority of the filmmakers in the BAFICI), but instead he concentrates on catching glimpses, moments and developing a story out of them. Effectively this is not a film of big ideas and enlightenment, roughly the overarching themes could be related to adultery and natural law with hints of a cultural clash and the likes, but it's never really about that. It's about creating a story that's affecting like no other, and that he's managed to create. With this, Gomes becomes a cinematic force to be reckoned with, and one I'll be following very closely from now on.","user":"algroth_1","rank":[20,23]}]