[{"title":"Likeable","rating":14,"date":"14 February 2019","review":"This film tells the story of a young man who is obsessed with a local football club that isn't doing so well even in the non league.<br><br>It is interesting to see a socially inept young man getting up to all sorts of mischief. The plot is quite interesting, even to a non football fan. David and Ruby are both likeable characters. I enjoyed the film.","user":"Gordon-11","rank":[7,7]},{"title":"Bromley Boys Night Out","rating":8,"date":"28 August 2018","review":"Saw this film at a special screening at Churchill Theatre Bromley.\nAlthough not packed out (due to very inclement weather that night) there was still a good crowd of varying ages. Really enjoyed this \"feelgood\" first romance story interwoven round the highs and lows of Bromley FC. Based on a true story, with great soundtrack weaving through the film, it was genuinely one of the best Sunday nights out I have had for years. The comedy was laugh out loud, the pathos had me reaching for a tissue...we wanted our boy to win...won't spoil your enjoyment by giving away any more of the plot...\nIf you have ever stood on the terrace at your local football club, or supported your child at a school game, or cheered a friend playing at the local park then this film will transport you back...if you are a certain age and can remember the late sixties this film will transport you back to the fashion and feel of those years...if you ever wondered what your grandparents did back in their day...if you just want to see a funny, feel good movie - then search out a screening of The Bromley Boys for 90 minutes of great entertainment with no blood and guts, no high speed car chases, no nudity - just good old fashioned family entertainment. And if you're from Bromley...\nI was extra lucky - our screening even had people involved in making the movie on hand for Q + A session after the screening. Hope they do that when the film is released on DVD.","user":"patmurphy-72460","rank":[8,10]},{"title":"Whole lot of heart","rating":9,"date":"11 December 2018","review":"A refreshing change from gritty gangster movies that often are the the staple of indie British films - this exists as the pola opposite, a film about friendship, young romance, change and actually very little football - a plus for me.\nI've watched this film with people of varying ages (12 up to 65) and they all enjoyed it.\nI'd recommend giving it a go, even if you dislike football, as this film is funny and sincere - and this is becoming hard to find these days.","user":"matt-choules","rank":[6,7]}]