[{"title":"More enjoyable than the relatively low IMDb score would have you believe","rating":7,"date":"16 June 2013","review":"I went to this blind, as it were, not having read any reviews on here - I think this is probably the first - nor any of the critic reviews in the papers. I am a little surprised that it is showing so low on the star rating as, for myself and my wife, it was a throughly entertaining evening at the cinema. I knew very little about the Newlyn artistic set before but it would appear to have been as incestuous and fraught with failed and doomed relationships as the Bloomsbury literary group of a couple of decades later. Enter Florence, fresh from an overbearing father in London, to visit her brother who was already part of the set. Her beauty turns more than a few heads and A.J.Munnings, a wild and poetry-spouting bohemian, persuades her to sit as a model - and attempts to teach her the rudiments of drawing. Gilbert, in some ways the major-domo of the group but not an artist himself, also falls for Florence but she sees in him many of the traits of her strait-laced father and when Munnings proposes to her she accepts. Tragedy, as we will have garnered from what has gone before, will inevitably follow. The photography and cinematography is a pleasure to the eye and the producer has taken pains to get the period correct. Where it slightly falls down is in the character of Florence who, I have since learnt, was already unsettled and a depressive before she arrived at Lamorna. This would account for her later actions but we get no sense of her instability in the first half of the film. There may be an over-emphasis on \"all down the pub for a jolly good drink and a sing-along and pay the landlord with a quick 10 second sketch for the bill\" but overall we felt sufficiently interested in the history portrayed by the movie to do some subsequent research on the real characters portrayed.","user":"postmortem-books","rank":[37,42]},{"title":"Unexciting","rating":23,"date":"23 June 2013","review":"Set in beautiful Cornwall about 100 years ago this catatonic film tells the story of a group of artistic friends leading a bohemian life which is interrupted by the arrival of a sister of one from the group. One falls for her but she ends up marrying another, an individual that turned out to be an awful husband driving his wife to suicide.<br><br>Aside from the fact that this group of friends turned out to be some of the country's most influential artists, this film is held together by the beautiful cinematography and some interesting performances with the word exciting lacking in the storyline, or the way it engaged the audience.","user":"cinematic_aficionado","rank":[19,23]},{"title":"Pretty accurate portrayal of lives and loves of lesser-known artists based in a scenic Cornwall in 1914","rating":8,"date":"14 November 2017","review":"British films with a historical theme are typically well-made, gorgeous to look at and in general worth watching; and Christopher Menaul's \"Summer in February\" is no exception. This is certainly a powerful advertisement for wonders of Cornwall only too apparent to those like myself, who have been there and fallen in love with the county pretty much instantly. For artists, it was always a matter of landscape and \"the light\" there, and this is also no exaggeration.<br><br>In this particular case, the artistic community featured is one that assembled in Cornwall from around 1907, and in particular in the 1910-1913 period. The film itself claims to be set in 1914, when the February was indeed mild, as winters in Cornwall typically are. However, this is a slight \"telescoping\" of the facts in what is otherwise a fairly faithful presentation of true history. The key protagonists are (Sir) Alfred James (AJ) Munnings (1878-1959) - here rendered by Dominic Cooper; Florence Carter-Wood (1888-1914) - played by Australian Emily Browning; non-artist Captain Gilbert Evans (1883-1966) - played by Downton's Dan Stevens; Dame Laura Knight (1877-1970) - played by Hattie Morahan; and Laura's husband Harold Knight (1874-1961) - played by Shaun Dingwall. All are well-acted, and portray what by the standards of the day was a bit of a \"Bohemian\" lifestyle.<br><br>At this point, we come to the key question here - do you want to devote 100 minutes of your life to the relatively passionate and tragic, but ultimately sort-of trivial goings-on of artists few have ever heard of over 100 years ago? The question comes all the louder when one notes that the story told here (basically by writer Jonathan Smith) arises primarily because Munnings was not an especially nice or stable guy, Florence was not an especially rational woman, and Evans was the \"Officer and Gentleman\" you might expect.<br><br>By this point, a normal person might be screaming out: \"who cares?\" <br><br>In my view, this is the wrong attitude; but then I opted to watch the film anyway - because of Cornwall, because British-made, and because the acting was good in a story that does have a good dose of passion and sadness in it. As a bonus, I learned that, for all their faults, the above artists were very talented indeed, produced quite a few very impressive works (readily viewable online, as well as in galleries) and are (relatively) little-known solely because the tide of (trendy, though not necessarily ordinary person's) interest turned against their kind of painting. Munnings was notably opposed to Modern Art, and Menaul has Cooper make an angry (possibly drunken) reference to \"Pi**-casso\", which I found quite witty! <br><br>In fact - among many other things - Munnings went on to paint pictures (sometimes even slightly impressionistic) for the Canadian Cavalry in WWI, and these are as significant and moving as you might expect.<br><br>Perhaps you don't need to watch a film to learn about the above artists and come to appreciate their worth? <br><br>Well, as it happens I did, and am more than happy to be enlightened in this way...<br><br>And I shall certainly track down these artists further the next time I'm in Cornwall.","user":"jrarichards","rank":[4,4]}]