[{"title":"Cuts slowly and deeply","rating":6,"date":"23 March 2015","review":"Greetings again from the darkness. There is a theory that to catch a killer, one must think like a killer. Young John McCormack is in the next room when his detective father, frustrated at being unable to put away a serial killer, commits suicide. Flash forward twenty years, and John is now himself a police officer intent on finishing his father's work  and gaining a bit of revenge in the process.<br><br>The story picks up as John (Chris Coy) has tracked Francis Visser to a small town, where he is known as Eugene the town barber, a gentle and dignified friend to all. Scott Glenn portrays Eugene as a slow-shuffling elderly gentleman who doesn't much appreciate profanity, rudeness or poor decisions. He is even friends with the local police chief (Stephen Tobolowsky), who accepts Eugene's word on just about any topic.<br><br>The cat and mouse game between John and Eugene plays a bit like Sleuth (1972) where each participant sees himself as smarter than the other. Only this time, there are 17 previous murders to go along with the developments after Eugene agrees to mentor John on the fine art of stalking, planning and killing without evidence. Beginning with a gypsy proverb: \"You have to dig deep to bury your father\", the film seems to use that quote figuratively and literally, as being buried alive plays a role alongside the detective father's ruinous obsession. Supporting work is provided by Kristen Heger, as John's co-worker (and more), Olivia Taylor Dudley as the waitress looking to John for fun, and Max Arciniega as Eugene's barber shop employee.<br><br>More attention to the John vs Eugene piece, and a little less to the various sub-plots, could have tightened up this thriller and elevated it to an even more suspenseful level. Mr. Glenn and Mr. Coy are both excellent, and at their best when sharing a scene. It's a nice first feature from director Basel Owies, who has an eye for nuanced characters with a dark side.","user":"ferguson-6","rank":[37,52]},{"title":"Nice to see Scott Glenn in a lead role again","rating":7,"date":"24 July 2015","review":"First I'd just like to say that the plot-summary on this page is inaccurate, albeit not far from what it is about it's still inaccurate.<br><br>What is true is that it is a serial killer themed thriller which starts with a wannabe serial killer meeting the real deal.<br><br>I can't go into any details without starting to spoil stuff but there are many twists and turns throughout the movie.<br><br>Luckily these twists aren't the typical random twists that sometimes Hollywood scriptwriters tend to throw in in last minute to shock the viewer and think that they are clever but doesn't make sense with what we've just witnessed.<br><br>They all make a fair amount of sense actually in the end so that's a definite plus.<br><br>And Scott Glenn is as I said really nice to see in a lead again, a underrated actor, Chris Coy in the other lead-role is also good.<br><br>It's not a perfect movie, it does feel like they didn't have much budget or time to deal with and some characters aren't fleshed out as they could have been but it does entertains and yeah I'd watch it again.","user":"Seth_Rogue_One","rank":[5,5]},{"title":"Decent Serial Killer Thriller Mystery","rating":7,"date":"20 July 2015","review":"A barber comes into contact with two men fixated on what triggers evil. A father, whose life is destroyed in pursuit of a killer, and a son who is trying to prevent his father's obsession.<br><br>So, they had me hooked early on with the mention of the Kenosha PD, an organization I happen to be rather familiar with. Did this have anything to do with the story? No. But it was still a great mention.<br><br>Then we also have Scott Glenn. Although he has been acting for decades, he seems to have finally come into his own as of 2014-2015. He made a big impression on \"Daredevil\" that he may never had done before. I can see fans of that show wanting to see more of him ,and they will love his performance here.","user":"gavin6942","rank":[5,5]}]