[{"title":"Boring bad movie!","rating":2,"date":"8 May 2014","review":"I really had my hopes up, and thought this is going to be a good movie. To bad, couldn't be more wrong. After 20 minutes I thought damn I want to turn off this movie, but I am someone who never ever turns off any movie! So when it did made me feel like this, I knew this was a total bust! It starts out slow, it has bad boring music which looks like it repeats itself continuously. The actor is pretty okay, but the screenplay is so bad! The conversations are boring, and looks like its written by my nephew who is 5 years old. The whole story of the movie had some potentional, but they screwed it up pretty bad. You know the plot twist, and the order is not logical, which is like the most recent movie \"enemy\". But there you understood the movie, and that was beautifully screenplayed. This is a screw up, and at the end of the movie I thought wtf! Please do not waste any time on this movie, its the first movie ever I gave a rating of 2.","user":"omer2003","rank":[17,21]},{"title":"For Mature Audience","rating":5,"date":"2 September 2016","review":"This movie really requires a mature audience. Not for teens &amp; 20's who lack maturity or patience as you can see by their reviews.<br><br>Admittedly, this movie is somewhat confusing and you only half understand it at the end. So I will endeavor to sort it out. But the story has merit and it is not predictable other than the character has had a brain implant. That much you can determine by the name of the film &amp; the box cover photo.<br><br>What is not predictable &amp; why it is confusing is the technical reason behind what is going on. This was due to the brain chip damage in the accident. This is where patience &amp; a mature understanding is required. If you miss a word, you miss the explanation.<br><br>The screenplay &amp; dialogue is missing too much to fill in all the gaps. So it will leave you confused to some degree but not as bad as these children's reviews describe. They want shoot-em-up, fast gratification films with no substance. This mentality is obvious on remakes.<br><br>The concept is a good one. It just shows how important the choice of screenwriter can be and a director who can recognize problems and not use hand-held cameras.<br><br>Some clarification &amp; remaining confusion is when the implant was originally installed. It appeared to have been implanted following his suicide attempt after the car wreck. But this was not the case. A TV news report could be partially heard stating the driver of the accident was found on the nearby beach which confirmed the post-wreck suicide scene. But his conversation with Surgeon Milo reveals the implant was damaged in the car wreck which caused the random memories &amp; false images. So his implant was installed before the accident. Likely a year earlier. Either from the ruptured artery or an earlier suicide attempt. <br><br>His shirt on the beach was different from the wreck despite his attempting suicide immediately following the accident. There was also the absence of the other driver who hit them. You had to look hard to see the second car in the distance with the flashers. So where was the other driver? Perhaps deceased since it plowed into their side; head on. But then again, it was parked 100 ft away.<br><br>One scene had a doctor who mentioned \"his disease\" as a reason for the implant. Another mentioned ailment was Artery rupture. Another was suicide so perhaps there was an earlier attempt. Perhaps over the broken family. I believe it was likely the ruptured artery as the reason for the original implantation which was damaged a year later in the car wreck causing the random memories &amp; false images. We have that much from Milo. <br><br>Once the defective implant was removed, the story came back to the beginning where he did not remember his father.<br><br>Film Errors were:<br><br>the constant changes of facial injuries from right to left &amp; back &amp; forth. <br><br>No incision for brain surgery despite having a shaved head. <br><br>We never saw the new wife &amp; new kids except on a photo. Perhaps they were invented like the brother. Or we never saw them because they were at the ending when he was shaved bald &amp; everything else was unreal. <br><br>And then there were the different shirts from the wreck to beach scene. <br><br>Any decent actor would be aware if makeup &amp; costumes don't match.<br><br>It will probably require a second viewing since this is a wrap around movie where the beginning is the end.","user":"midge56","rank":[4,5]},{"title":"Not worth it at all!","rating":1,"date":"24 May 2015","review":"So, I thought this was going to be a great movie, I was excited and played it on my DVD player. 10 minutes in I found myself struggling to watch it as it was so incredibly boring and dragged on. The actors are pretty good, but the story really needed work. After 40 minutes, I did fast forward to the end to find out what happens..... The film was too predictable. I thought there were certain parts that were unnecessary. The music sounded like it was repeated and I found myself confused in some areas of the film. the film was repetitive and the quality was that of something a child could write. The film I felt was more focused on the love interest between Camille and Ethan than what had happened to the main character before his memory loss.","user":"jemamaegriffiths","rank":[0,2]}]