[{"title":"Quiet & Understated Film","rating":7,"date":"25 March 2015","review":"This is a very quiet and understated movie, which I surprisingly ended up liking, but will most likely appeal only to those viewers who are willing to be patient, as it's more of a mood piece than anything else. It can be slow-paced and melancholic, for sure, but I felt that what worked for me was the chemistry between Anne Hathaway and Johnny Flynn that developed in the film, as well as some first-rate folk singing from Flynn.<br><br>Hathaway portrays Franny, who's in Morocco, as the movie opens, working on her PhD in Anthropology, studying Nomadic tribes there. Hathaway still has loads of screen charisma, in my opinion, with those doe-eyes, infectious smile, and lots of acting talent. One night, she gets a call from her mother (Mary Steenburgen), in New York City, that Franny's brother Henry (Ben Rosenfield) has been struck by a taxi while crossing a Brooklyn street, and is lying in a coma in the hospital.<br><br>Immediately returning to New York, Franny holds lots of guilt because they haven't spoken in six months, after having an argument when Henry wanted to give up college for his music, as he's an aspiring singer and songwriter. She finds a diary of his and begins to go to some of Henry's favorite places to record sounds that she hopes when played back to him in the hospital will help him come out of his coma.<br><br>Franny also finds a ticket for a performance by popular folk singer James Forrester (Johnny Flynn), whom Henry idolized. She goes to the performance and there is immediate chemistry between Franny and James. I thought Flynn was also excellent as James, and both their characters are quite reserved and laid-back. To me this was the heart of the movie, as in a very quiet way the two build a relationship, even if it may be only temporary.<br><br>In summary, I thought Kate Barker-Froyland, who wrote and directed this film, and makes her major motion picture debut here, did quite the credible job, although as mentioned it's not for everyone. Maybe I was just looking for a change of pace from the frenetic and heavy dramas that are out there, but this indie worked fairly well for me.","user":"larrys3","rank":[13,13]},{"title":"Beautiful and Poetic.....Quiet and Honest","rating":10,"date":"3 May 2018","review":"I am quite amazed at the bad reviews. This is one of the most beautiful movies I have seen in some time. Incredibly well acted...exceptional music and performances. The sensibility of this film is so unique.Poetic in its delivery, it doesn't just hand you every emotion. You actually have to tap in and feel them for yourself. For me this movie does so effortlessly. Thank you for making this film. I bought it and will watch it often.","user":"integralmassagetherapy","rank":[12,13]},{"title":"I was not in a coma! This movie awoke every one of my senses!!","rating":10,"date":"18 February 2015","review":"How do you spell \"Relief\"? S-o-n-g-O-n-e! Finally... a movie that knows how to be refreshingly real and not afraid to use it. Life is fragile. I don't know of anyone who hasn't experienced an event that changed their world in an instant. The movie's characters and story drew me in from beginning to end. What's not to love about Anne Hathaway as she struggles to let go and understand her brother's world rather than that of strangers in faraway places? As Franny re-discovers her own love and appreciation for the talent, passion and struggles of musicians, so do I! Johnny Flynn? A truly amazing performance as a sensitive, sometimes awkward and insecure artist whose voice and poetry speaks from his heart to all who listen. Song One is a movie that will not be forgotten by it's viewers. Unless you are an unfortunate soul in a coma, your senses will be heightened as well as your sensitivity and connection to the realities of life.","user":"nangan29","rank":[23,29]}]