[{"title":"A horror films from the 1970's made in 2012","rating":23,"date":"23 April 2014","review":"Do you remember that horror film made in the 1970's that crossed Picnic at Hanging Rock with The Omen? You know, the one that someone like Jose Larraz or Jorge Grau made back in the day and that used to line VHS stores in a lurid big box? <br><br>Here Comes the Devil is a 1970's horror film made in 2012. Although not set in the 1970's, it has the feel of a 1970's horror film. For some reason, I was particularly reminded of Satan's Blood, another Spanish language exploitation movie. This is not a retro homage that winks at the viewer the way Grindhouse or Black Dynamite do. No, Here Comes the Devil is first and foremost an unnerving horror film, one without humor or irony.<br><br>The plot has two children exploring a hillside shunned by the locals as their parents take advantage of the time alone to engage in sexual play. Time passes. The children do not come back. Worried, their parents search for them and find nothing. The next day the police find the children safe and sound. All is fine . . . or maybe not. The children are different, withdrawn and having an unhealthy attachment to each other. The parents suspect their children have been sexually abused and go about searching for a suspect. In fact, the truth is much stranger.<br><br>Here Comes the Devil is a slow burn. This was more common in 1970's horror cinema than it is now (the original Texas Chain Saw Massacre for instance). Some have found the film slow. However, the film pays off with a genuinely unnerving conclusion and along the way there is an escalating sense of dread. This dread often takes the form of sexual tension, some of it involving the children. This makes the film an unlikely choice for a US remake. It also makes it feel older, from another time period. I had read about Here Comes the Devil in horror magazines like Rue Morgue and Fangoria. I was pleasantly surprised that it lived up to the hype.","user":"jrd_73","rank":[17,22]},{"title":"Once again, well done Adrián García Bogliano!","rating":7,"date":"10 April 2013","review":"It only took two of his movies to make me an avid follower of Adrián García Bogliano. He's the type of cinematic artist I deeply respect and even am somewhat jealous of. We're about the same age, but at \"barely\" 32 years old Bogliano accomplished nearly a dozen of long feature horror films. And although I'm certainly not claiming his movies are bona fide genre masterpieces, they are definitely interesting to explore and – on a more personal note – the type of movies that I'm looking for the most. They are raw, brutal and nihilistic low-budget exploitation efforts that genuinely re-create the atmosphere of horror during the 70's and early 80's. His \"Room for Tourists\", for example, is one of the cruelest torture-porn flicks out there and especially his \"I'll Never Die Alone\" is pretty much the only modern day rape &amp; revenge flick that truly lives up to the prototypes of the seventies, such as \"I Spit on your Grave\" and \"Last House on the Left\". Evidently I was very eager to catch his newest effort \"Here Comes the Devil\" when it played at the Brussels' Festival of Fantastic Films, because it allegedly concerns a homage to the devilish cult flicks of the 70's and one giant homage to \"Picnic at Hanging Rock\". Bogliana again didn't disappoint, although it's different from his previous work and emphasizing more on character depth and disturbing atmosphere. Our director moved up from Argentina to Mexico for this film (I sincerely hope he isn't on his way to Hollywood!) and serves a compelling cocktail of drama, occult thriller and vigilante action. During a family day trip, Felix and Sol's preteen son and daughter request to go on a hiking trip up a hill while their parents \"relax\" in the car. They don't come back down, though, and the parents spend a long and petrifying night in a nearby motel. But the kids suddenly show up again the next morning, unharmed and just in a minor state of shock, and they all happily return home together. Over the next few days, however, Felix and Sol witness their children behaving increasingly bizarre and asocial. They presume their offspring fell victim to a perverted child molester and promptly seek for vengeance, but in reality something far more disturbing happened to Adolfo and Sara. They seem possessed by dark forces and deliberately head back to the hillside The slow and sinister pacing, as well as the detailed character drawings, are the main trumps that make \"Here Comes the Devil\" such a haunting and unsettling thriller. Felix and Sol are very identifiable characters and, especially if you're a parent yourself, you'll mildly cheer for their unlawful (and slightly inconsiderate) decisions. Bogliano masterfully mounts the tension steadily and professionally towards a nearly unbearable climax that is – admittedly – somewhat derivative and vague, but most of all harrowing. Stellar performances from the ensemble cast, gorgeous filming locations and the exact right amount of blood and violence also contribute in making this is a true gem. Please, if you love real horror, leave all the nowadays CGI ghost and zombie crap for what it is and dig into the repertoire of Adrían García Bogliano.","user":"Coventry","rank":[38,59]},{"title":"Excellent New Mexican Horror Film from Veteran Argentian Director","rating":9,"date":"16 September 2012","review":"Perhaps we are seeing a revolution in Mexican horror cinema today. Along with Jorge Michel Grau's excellent WE ARE WHAT WE ARE (2010), a story about a family of inner city cannibals, who must also like the Mexican horror film industry face change or disappear. Argentian horror film maker Adrían García Bogliano's newest film follows in a lot similar constructs.<br><br>Neither of these two recent Mexican horror films follow the country's classic monster horror formula of the past. They are both stylistically and visually very modern horror films. There are also extremely low budget and make excellent use of Mexico's dark and dirty urban settings and focus on the strife of Mexico's lower class families.<br><br>After a jarring opening of sex and blood, HERE COMES THE DEVIL is a unnerving, taunt and tension filled tale about a family that starts coming apart after a family trip to the outskirts of Tijuana. Parked at a highway truck stop, the two kids, Sara (Michele Garcia) and Adolfo (Alan Martinez), decide they want to explore a nearby rocky hill while their parent Felix (Francisco Barreiro from We Are What We Are) and Sol (Laura Caro) \"relax\" in their car, waiting for their two children to return. Soon the frantic parents wake up in the car to realize their children have vanished.<br><br>The real star of this film is the direction of Bogliano. From the very opening of this film he creates an atmosphere of tight slow unwinding tension that builds to the perfect closing shot that like the master Mario Bava is a very subversive wink at the audience. Getting to the final shot is where all the fun lies. This film is classic horror film making at it's finest. With excellent storytelling and a very controlled atmosphere, Adrian draws the audience in from the opening and sustains the suspense without giving the audience a chance to catch their breath till the final reveal. The score and sound construction is muted excellence too, that Hollywood horror films sure could learn a thing or too from. Adrian never tries to scare his audience with loud sound effects. Instead he builds brooding momentum with an acoustic guitar melody layered with creepy distant background noises. In one scene he makes fantastic use of a heavy metal song playing on the car radio. As the score builds so does the editing and pacing. This film is an excellent lesson in making the best use of what you have. With minimal characters and a tight focus on a interesting plot, you don't need a lot of money to make a great dark fantasy film. That is not to say that this film didn't have a couple of eye-popping set pieces that had an afternoon TIFF audience hooting and hollering at it's world premier! This film has so many classic horror film references from Hitchcock to Fulci, but what makes this film work is the economy in which it was made.<br><br>When it comes down to it this is a smart fun horror film that recalls those classic European grindhouse films that were cheaply made in the 70's &amp; 80's without much fanfare. Fantastic film and my pick for Horror film of the year. Dark Sky should be rewarded for producing this Spanish language film and Argentinian director Bogliano is definitely a name to watch. I know i am now looking forward to going through his back catalog of horror films he made in Argentina looking for some more gems.","user":"jimi_lamort","rank":[32,52]}]