[{"title":"Not sure there is a spoiler but just in case","rating":8,"date":"25 November 2012","review":"Larry Clark likes to make movies which shock. Particularly about teenagers. They f*ck and swear and sometimes kill (Bully). On the other hand, William Golding's Lord of the Flies is on the reading list in most English language high schools around the world. Nothing Larry Clark has done can outdo the horror of those kids on an island.<br><br>Homo sapiens are a brutal and savage species, probably responsible for the elimination of Neanderthal man and since then we have sent thousands of species into extinction, from mammoths, to bison, to the dodo. If there's a bad animal around, we're it.<br><br>Clark like Golding is busy with representing the what is, ripping off of your rose-coloured glasses and then stomping on them to boot. Yes, your girlfriend in high school betrayed you. Deliberately. And your son's girlfriend is probably betraying him now too. It's just what people do. Your wife probably cheated on you at least once or twice too. Go and read Jane Goodall's study of chimpanzees: how they mate and how they stalk their neighbours and kill.<br><br>Anyway back to Marfa Girl: it's the same unlikeable group of teenagers smoking up and screwing as we've seen in other Clark movies. This time it's on the US/Mexican border. There are some very dislikable adult border patrol officers and some slightly less dislikable promiscuous kids. It's a film about ideas and loyalties. There are some extended Socratian dialogues between kids and cops, cops and cops.<br><br>Those ideas are played out through the bodies and lives of the Clark's kids. Unlike in a Rohmer film, ideas are not apart from human existence. Ideas have a real human price.<br><br>Performances are convincing all round from mothers to daughters to cops. I really didn't like either Adam (Adam Mediano) or Marfa Girl (Drake Burnette). But that's not their job to make me like them. Their responsibility is to play their role convincingly and that they did.<br><br>If you are looking to be uplifted or dream of a brighter tomorrow, no Larry Clark film is for you. If you are looking to take a cold hard look at today's passage from childhood to adulthood, Larry Clark is your man.<br><br>I'm not sure I liked Marfa Girl, but I respect the craft. Anyone concerned with border issues will find a lot to think about. There's a tall pile of DVD's of films waiting more important to me than Marfa Girl. While I respect Larry Clark's craft (I was lucky enough to see a premiere of Bully at TIFF with Clark in attendance in 2001), one of the reasons I am among the first to watch and buy is its direct online distribution. Direct digital distribution is the only future for independent film. Larry Clark is both wise and brave to choose exclusively online digital distribution with no cut to iTunes or any other of the conglomerates.<br><br>It's an experiment worth supporting. If works the quality and the honesty of Marfa Girl are what direct distribution brings us, the future of independent film looks brighter than it has in over ten years.<br><br>If you are on the fence, please give Larry Clark your support to send a clear signal to both independent film makers and to Hollywood. Give us something better than the sequels and focus grouped rubbish which commercial filmmaking has become and we'll pay for it.<br><br>The online viewing experience was very easy. You pay via Paypal with no extended offer nonsense or other advertising and you get a login key which lets you see Marfa Girl in very good quality HD right away. Absolutely no problem playing it in the browser.","user":"richard_longman","rank":[25,33]},{"title":"Eh, it's okay.","rating":6,"date":"1 July 2013","review":"Six years is a long hiatus, especially since Larry Clark was popping movies out almost annually for a while. After that much of a break, you'd expect a filmmaker to come back with something new, engaged with different subjects. But then again, this is Larry Clark we're talking about. All of his work is a variation on a theme. \"Marfa Girl\" takes a few new turns even if it's firmly rooted in the director's obsessions.<br><br>The title is somewhat misleading. Yeah, the movie is set in Marfa, Texas. That's not the misleading part. Instead, the movie is actually about a boy, not a girl. Fifteen year old Adam, about to turn sixteen, is the protagonist. He skates, is in a band, occasionally enjoys a pot cigarette, is friends with a sexually liberated young mother, and is currently trying to get into his girlfriend's pants. His mom rehabilitates parrots and is heavily involved in the local spiritualist and art scene. She's friends with a twenty-something artist, the titular Marfa Girl, a young lady who believes in free love and equality of genders. Connecting all the story threads is Tom, a border patrol cop with sadomasochistic fantasies, misogynistic tendencies, and an unhealthy obsession with Adam and his mom.<br><br>\"Marfa Girl\" is edgier then \"Wassup Rockers\" but is still more gentle then the majority of the director's films. As you'd expect, the film is loosely plotted, rolling from one encounter to another. The pacing is relaxed, instead of belabored. Once again, Clark has successfully put us into these kids' lives. There's not much of a score and what is there is odd, chiptune music. The film is named after its setting because Marfa is a character onto itself. It's clear that the odd mixture of artists, spiritualists, disaffected kids, and border patrol cops that makes up the town was Clark's main inspiration. After watching the film, you feel like you know what a day in the sleepy town must feel like.<br><br>As is expected with Clark by this point, among the teenage sex scenes, drugs, and violence, are genuinely touching or intriguing moments. An early moment, when Adam's mom talks with a friend about loosing pets and reincarnation, really impressed me. Though the movie seems to implicitly suggest that the whole conversation is ridiculous, the emotion the moment sums up is true. Another stand-out moment is Adam and the Marfa Girl's discussion about sexism and double standards. This leads to an encounter with two Mexican border patrol cops, starting a heated conversation. Clark continues to do intimate conversation well. The Girl has a revealing conversation with the mellower of the two cops, about his military history. An earlier date with another artist is charmingly awkward. Even the villainous Tom gets a revealing monologue near the end. Surprisingly, the sex scenes, only a few of which involve teenagers, have a gentle, romantic tone to them, making this, perhaps, Clark's first legitimately erotic film.<br><br>Adam is your standard Clark protagonist: Obsessed with sex with no clear direction in life. His sweet relationship with his Mom makes him different though. Adam Mediano has a natural charisma as an actor and it's not impossible to see him going on to a real acting career. Drake Burnette as the titular character does very well, being spunky and lovable. She can't make all her heavy dialogue work but the actress is still likable. I didn't care for what happens to her in the last act though. That felt unnecessary. I especially liked Indigo Rael as Adam's friend Donna. She's a complex character, a mother, a teen, and sexually open. Mary Farley is also strong as Adam's mom.<br><br>Tom is the most fascinating character in the film. He's a total creep. Aside from needlessly harassing Adam, he makes sexist remarks to a young waitress, tricks a fast food clerk into a date that transforms into a possible sexual assault, and shows Adam's mom disturbing \"blue waffle\" pictures. For most of the film, he comes off as a thinly developed villain. His eventual acts of violence and sexual assault aren't surprising. Frankly, his admittance of getting turned on by violence is awkwardly presented and Clark falling back on shock value and boners. However, the character's monologue, were he discusses his past and his relationship with his father, are oddly powerful. Jeremy St. James actually gives a fantastic performance, making Tom an ugly creep but also, oddly easy to watch.<br><br>The movie concludes with violence. You could say this is lazy. However, the middle section of the movie, which includes a long drug trip in a school gym, drags on. The whole movie sets up this conflict between Adam and Tom. The ending is a fine pay-off to this. The resolution puts a nice emotional bow on the story.<br><br>So \"Marfa Girl\" is about half/half. It's a lot of the same stuff you'd expect from the director by now. Its dreamy tone is sometimes entrancing, sometimes boring. The script is unbalanced between captivating character study and directionless location piece. I both like the town and have no desire to ever visit it. All things considered, it's what I would expect from the director at this point in his career.<br><br>Clark released the movie independently as a streaming rental through his website, with no intention of ever releasing it to theaters or home video. He hopes to reach the kids this way. Maybe he will. I don't know what young people will think out of \"Marfa Girl.\" It won't change detractors mind and it could potentially either surprise or bore Clark defenders. Despite it's issues, it's still the filmmaker's best work in years.","user":"Bonehead-XL","rank":[14,18]},{"title":"Dude, where's my script?","rating":1,"date":"5 September 2016","review":"Is probably something that mr. Larry Clark asked his assistant when he was on set to start film this, and seemingly they never found it and had to make up something on the spot.<br><br>'Bully (2001)' was a great movie, directed by him but after that he hasn't done anything remotely as good... 'Wassup Rockers (2005)' despite poor acting was still decent because it had at least somewhat of a plot where as this does not and seem to aimlessly just go to events that lead to teenagers getting naked.<br><br>Now granted, I don't believe Larry Clark has done a movie where teenagers don't get naked but really with this one I seriously started to wonder if he did this film for the sole reason of getting off on the nude teens with multiple crotch-shots (male and female)...<br><br>It sure couldn't be because he thought he had a good story to tell.<br><br>One of the characters says 'if people f'd more there would be no war. Less killing, less rape, you know what I mean?'. The character has some similarities to Larry Clark (it's an artist who likes to paint guys genitals, much like Clark himself is an artist who likes to film them) so that seems like a way for Clark to justify his fascination with teenagers sex lives, and possibly a (poor) attempt at giving some depth into a hollow movie.<br><br>A sequel is listed for being in the making for next year, I don't see how they expect to make any money off of that, but maybe Clark doesn't care and he just want to film some more naked teenagers.<br><br>There was a time when he was seen as a talented director who was slightly perverted, but it's quickly turning to him being seen as a perverted director who's slightly talented instead.<br><br>I think he need to do a full 360 if he want to turn that around, maybe make a movie about adults instead or if the teenage thing have to continue let them keep their clothes on and focus on a good story instead, and maybe a cast that have acting experience.","user":"Seth_Rogue_One","rank":[14,19]}]