[{"title":"Awful. There was just no real point in telling this uninteresting story.","rating":4,"date":"30 June 2013","review":"Several years ago, a group of Los Angeles teenagers learned that they could easily break into the homes of celebrities, keeping tabs on their comings and goings online. This is their story, as told by Sofia Coppola. Coppola is one of my favorite modern directors. Her previous four films are generally about ennui-filled lives, and I can see what attracted her to this story about these vapid social media- and celebrity-obsessed kids feeding off the even more vapid celebrities (they even pick the most awful celebrities imaginable to victimize, like Paris Hilton, Lindsay Lohan and Megan Fox), but, in all honesty, this story just has no conflict whatsoever, and the little jackass teenagers who are at its center are so painfully uninteresting that, after spending half an hour with them, I really wanted to walk out of the theater. To boot, the plot is repetitive as Hell - teenagers break into house, teenagers steal baubles, teenagers drive away like idiots singing along with rap songs, teenagers do drugs, teenagers go out dancing. The film goes through this cycle like six times before the cops finally arrest them. The film is sometimes well shot (it was the last film shot by master cinematographer Henry Savides), and there's at least one killer sequence where the two main teens (Katie Chang and Israel Broussard) rob a glass house where it's shot from quite a distance (it's perhaps reminiscent of the glass apartments from Tati's Playtime - I don't know if Coppola had that in mind). The most recognizable stars in it are Harry Potter's Emma Watson and Leslie Mann, who plays her mom. I'd actually call this the worst film I've seen so far from 2013.","user":"zetes","rank":[177,232]},{"title":"Interesting Concept, Boring Execution","rating":5,"date":"17 May 2013","review":"I saw an early screening of The Bling Ring and I have to say my expectations were not met, in fact the movie did not even come close to meeting them. When I heard that Emma Watson was going to be in a movie about a group of teenagers robbing rich celebrities I have to say I was intrigued. Add on top of that the fact that Sofia Coppola is the director, she also made the excellent Lost in Translation, and I was guaranteed to be seeing it sometime in theaters.<br><br>The film is based on the true story of a group of teenagers that lived in or around Calabasas, California. Sometime during the period of October 2008 through August 2009 the group, called the \"Bling Ring\", stole about $3 million in cash and belongings from celebrities including Paris Hilton, Orlando Bloom, and Lindsay Lohan.<br><br>It is a fascinating story and one that sounds like a terrific setup for a film but the execution is terribly bland. If you have watched the trailer for the film it seems like it is going to be an insane mashup of partying scenes and what most people are going to be looking forward to Emma Watson and her friends robbing celebrities left and right. These scenes are in the movie but in the film they are not exciting or insane in any way. The robbing scenes all start off with the group looking up the celebrities house on the internet and then finding out if they are out of town or not. They then proceed to just drive up to the house, get out, walk up the driveway, walk around the house trying to open doors, and then when they find an unlocked one just walk right into the house. The filming is so lazy and simple that these scenes are as exciting as watching your neighbor unlock his front door and go inside after coming home from work. Then the actual robbing parts are just the group picking up the celebrities valuables and then constantly saying \"Oh my god this looks hot!\" Repeat this process for a good 20 times and you have the first 3/4 of the entire movie.<br><br>The characters in the film are based on the actual teenagers but their names have been changed. Contrary to the film's marketing selling Emma Watson as the main character she is actually not the ringleader of the group. Instead it is a girl named Rebecca played by Katie Chang. The film centers on Rebecca and her best friend Marc played by Israel Broussard. Their acting is so average and their interactions are so boring that it is hard to care for them at all. In fact the only above average performance in the movie is from Emma Watson and surprisingly she only plays a small role in the film until the end of the movie.<br><br>Altogether I am not sure who The Bling Ring was made for. The intended audience appeared to be teenagers but with a R-rating most of that audience is unable to pay to see it. But at the same time it cannot be for this group because the film tries so hard to be artistic. Case in point one of the heist scenes is a continuous shot of the exterior of a house while the characters are running around inside of it for a good four minutes. So the film is too slow to be for teenagers with small attention spans but it is not relatable or intelligent enough for anyone in their 20's or older. And as for those Emma Watson fans they should be prepared to be disappointed because she is not even on screen for a large portion of the movie.<br><br>The Bling Ring is a missed opportunity as it could have been an exciting teenage heist film but is instead a film that tries to be artsy and drags on for way too long. If you have to see it rent it on DVD but otherwise you will not be missing anything.","user":"cgmovies","rank":[150,213]},{"title":"Based on an article. Should have stayed one.","rating":1,"date":"1 September 2013","review":"It was based on an article and it feels like an article stretched out into a film. <br><br>I'm a fan of Sofia's work but this is crap. Incredibly two dimensional and the point of the film is established almost immediately and then drawn out from there. I understand what the film was trying to do but it did it in an exceptionally boring way. <br><br>Saw this in theaters and would have walked out if the ticket didn't cost so much. <br><br>Enough films about this Beverly Hills rich kid wanna-be celebrity lifestyle. It's incredibly boring. <br><br>Of the films I've seen this year, this is the worst. Spring breakers is a very close second.","user":"alecpmoore","rank":[58,82]}]