[{"title":"Bateman is \"Murray-esque\"","rating":9,"date":"14 September 2014","review":"I was blown away by the surprisingly low \"6.7\" current rating on IMDb. My theory: The easily offended were easily offended (perhaps the movie should have been called \"Bad Words\").<br><br>(Some of my favorite comedies: Dumb &amp; Dumber, Super Troopers, and Tommy Boy).<br><br>Jason Bateman stared in, and directed, this \"tightly\" constructed DARK adult comedy. There was not a wasted second or single \"slow\" moment in the entire 89 minutes.<br><br>Everything was dead-on: The originality of the storyline, the casting, the acting, the timing, the tone, and THE KID!... I've never been a big fan of the \"cute, heart-strings-pulling, kid\" cliché, but you don't have to be to appreciate this kid - he takes NOTHING away from the dark humor, and only adds substantially to the film in every way. His authenticity and interaction with Bateman's character is as good as it gets (Roeper compared Bateman's spot-on apathy to Bill Murray's, and I couldn't agree more - you could just as easily picture Murray working his magic with the same degree of unflappability, esp. opposite such a contrastingly upbeat kid).<br><br>Bateman is an unassuming Rock Star that let's his talents do the talking, and I'm looking forward to the next film he directs and leads.","user":"MrMcMurphy","rank":[51,62]},{"title":"Sad that some people don't get it.","rating":8,"date":"21 March 2014","review":"This is indeed racist and it's also misogynistic. Does this mean that a movie with those qualities can't be funny? The movie knows it's racist and (wow this word is overused lately) misogynistic . It's also extremely funny. If you know you can't see past certain things like that then I suggest you don't watch this movie. It's mean and and very crude and hilarious. <br><br>I was actually ashamed that I laughed at some of the jokes as I consider myself to be a good person but they are so shamelessly delivered by Bateman I just couldn't help myself. Young Rohan Chand was very likable and held his own with Bateman who knows first hand about what it takes to be a child actor. Turn off your media forced judgment and just enjoy the movie. Even assholes can be funny.","user":"JR541","rank":[149,199]},{"title":"If you think this movie is \"racist\", you aren't smart enough to watch this film","rating":10,"date":"23 March 2014","review":"Thank you to Jason Bateman and all involved in making this film. It is sad that movies like this are such a rarity . We live in a world of idealism and of the studios putting out all of their god awful PG-13 movies or just plain god awful movies with solely profit in mind. It is such a treat to have a movie that is not politically correct, and done well. Nobody takes any risks. How can everyone stand for all of this sanitized entertainment. Bateman was great like he always is, this movie is hilarious!! To say this movie is racist is to say you have no brain, there was no hate in this movie. Jokes and stereotyping is not hate. People just love to ruin good entertainment for others. Thank you for this movie!!!! We are lucky to get 1 movie a year that is as good as this.","user":"stuart-dong01","rank":[113,149]}]