[{"title":"Absolutely wonderful, for some.","rating":8,"date":"28 February 2017","review":"This is a highly underrated film! Pros: hilarious dialogue, gorgeous clay animation, a strong attention to detail, and fun vibe. Cons: the humor will not be for everyone, you really have to have an open mind to intentionally offensive comedy. I love that it is a mix of high brow and low brow comedy. You have semen jokes immediately following an obscure Greek mythology snide. The demons (especially Pena and Nanjiani) and Odenkirk's devil absolutely make this film. Their attitudes to working in hell combined with clever one-liners play very well to the right audience. There is a lot more to appreciate to this film than what is above surface. I call it the funniest, most original comedy I have seen in years! My favorite piece of the film is the atmosphere. Give it a half chance. I consider this smart people making a dumb comedy for smart people. I also have not seen such beautiful and painstakingly detailed claymation since Nightmare Before Christmas. I wish I could compare it to another film, but I really can't. 10× better and more original than Sausage Party. Sorry for any typos, typed this on my phone. Bottom line: some very talented, very funny and very dedicated people made this film and clearly enjoyed making it, you should watch it and if you don't appreciate the story, appreciate the zany world, voice acting, quotable lines (welcome to hell) and incredibly detailed claymation atmosphere. Phew.","user":"chouiad","rank":[11,13]},{"title":"Joins the ranks with its other lackluster, adult-animated contemporaries","rating":3,"date":"3 October 2015","review":"\"Hell &amp; Back\" poses a sharp contrast in quality between the wealth of its talented voice cast and the sheer pedestrian mediocrity of its screenplay. It's amazing that a barrage of talented and proved comics from the likes of T.J. Miller, Mila Kunis, Bob Odenkirk, and J.B. Smoove, would subject themselves to something so bland and ugly. From its choppy stop-motion style of animation, its lack of real creativity in its jokes, and its miserable color palette, there is a striking joylessness present in \"Hell &amp; Back\" that is only highlighted by the film's lackluster writing.<br><br>The story opens in a failing theme-park, largely run by slacker employees Remy (voiced by Nick Swardson), Augie (T.J. Miller), and Curt (Rob Riggle). When Curt borrows a mint from Remy, taking a blood oath to pay him back before reneging on his promise shortly after, the three are sucked into a vortex that takes them to Hell, where they are seen as \"mortals\" awaiting sacrifice. While Curt is the only one who is set to be sacrificed, for breaking a blood oath, Remy and Augie are also planned to be executed simply because of their presence in Hell as mortals. As a result, they team up with a demon named Deema (Mila Kunis), who is searching for Orpheus, a famous spirit who is said to have saved countless mortals who's souls were doomed to perish in Hell in time before the Devil (Bob Odenkirk) decides to sacrifice the three men.<br><br>Despite the high stakes, the film feels like a constant array of tired stoner jokes written by a gang of adolescents that still find using at least two curse words in every sentence is hilarious. Admittedly, however, the film did get some laughs out of me when the small-scale, background jokes took over. Consider the scenes that involve the demons of Hell tempting the souls by having a Taco Bell/Pizza Hut counter. When one of the souls requests a pepperoni pizza, the demon informs him that they only have the Pizza Hut sign up as decoration and they are only a Taco Bell. \"Welcome to Hell,\" the demon says whilst giggling, upon informing the poor soul. This happens a couple of other times in the film and works because of how simply outlandish and ridiculous the scene plays out, in addition to a few scenes of demons looking up the sins of the souls to see what constitutes their presence in Hell.<br><br>These scenes are few and far between, however, as the bulk of the film has Remy and Augie bumbling on to random setpieces in Hell, witnessing some crass display of juvenile gags all captured in some of the most visually ugly scenery I've seen all year. With all the lame jokes occurring and the setting feeling so dim and dingy, there's simply very little positivity in this film to keep an upbeat frame of mine. Comedies set in underworlds or places of little hope obviously have difficultly meriting this constant stream of upbeat humor in contrast to the setting, but when both elements fall apart here, \"Hell &amp; Back\" doesn't have a leg to stand on, frankly.<br><br>Finally, there's a real cheapness to the animation here. The stop-motion animation is evidently rushed, as characters, especially when walking or moving very quickly, show a peculiar jerkiness to their motions that indicates that figures' poses were shifted too quickly, and thus, don't appear fluid. This doesn't occur frequently, but when it does, it makes the whole film seem off balance, and, much like the writing, poorly conceived.<br><br>I remember hearing of \"Hell &amp; Back\" earlier in the year and thought it would be something of a box office surprise; we rarely get adult animated films, and if we do, they are usually so obsessed with the idea of being vulgar and animated (\"Cheech and Chong's Animated Movie\" and \"Jay and Silent Bob's Super Groovy Cartoon Movie\" to name a few) that they wind up being throwaway projects of little merit. I felt that the talented cast of this particular film would crush that stereotype and lift it up to certain quality. Unfortunately, with the startlingly silent marketing for the film and the quiet release, \"Hell &amp; Back\" will likely join other contemporaries as an experiment that failed largely because of its worst tendencies.","user":"StevePulaski","rank":[34,50]},{"title":"Slightly Entertaining But Mostly Just Really Stupid","rating":4,"date":"6 January 2016","review":"I really wanted to like this film a lot, but as the film progressed that got harder and harder to do. Every step of the way the film tries to be as raunchy and as inappropriate as possible. Which would have been fine if the Raunchy/Inappropriate humor was funny, but about 85% of it just isn't. It's the kind of jokes that I use to make with my friends when I was in middle school, when I first started understanding what all those dirty words meant. That kind of humor is just not amusing enough to carry an 1 &amp; 20 minute film.<br><br>The one thing that the film did have going for it is the animation, the settings all looked really good. Hell was cool, Satan looked awesome, and characters were all very well done. Unfortunately the voices for the most part just don't seem to fit. There were a few times where I kind of felt like I was watching one of those you tube videos where people dub over children's cartoons in an effort to be funny. <br><br>I enjoy animated stuff aimed at adults, however it seems like for the most part it just doesn't work when it comes to films. There are plenty of great animated TV shows for adults (Archer, South Park, Bob's Burgers, etc) but when I try to think of great animated movies for adults the only one that really comes to mind is South Park: Bigger, Larger, and Uncut. \"Hell &amp; Back\" had a lot of promise, it's filled with very funny people doing the voices for the characters and the premise seemed like it opened up a lot of room for very funny situations. However, the previous reviewers were not wrong about this one. <br><br>This wasn't absolutely horrible, but it just wasn't good. It was entertaining enough to keep me watching but most of the jokes just fall flat and the comedians who lended their voices to the film are mostly wasted on a very poor/unfunny script. I wanted to like it, but I just didn't.<br><br>4/10","user":"HorrorOverEverything","rank":[15,26]}]