[{"title":"Wonderfully affecting","rating":9,"date":"6 September 2013","review":"Even though this is a fantasy movie, it is notable for how real it feels. The fantasy elements inform the plot, but it is the very real human emotions and connections that fuel the movie. This feels more like a thinly veiled version of real life than something fanciful.<br><br>The movie is constantly moving, but in a quiet way. It touches your heart, not with big moments, but with small ones. It is a movie about love of all kinds, and while it is admittedly an idealized version of love, a story of the sort of unselfish, uncomplicated love that only exists consistently in movies, it is truly lovely.<br><br>It is also often quite funny, well paced, and thoroughly entertaining.<br><br>Having seen Mamoru Hosada's previous films Summer Wars and The Girl Who Leapt Through Time, I see him as the successor to Hadeo Miyazaki, who (alas) cannot live forever. Hosada is a very different filmmaker, but he has the same ability to make fantasy real and human, and to make me happy.<br><br>Watch this movie.","user":"cherold","rank":[64,67]},{"title":"Incredibly cute and touching drama of everyday life","rating":9,"date":"16 August 2012","review":"In the vein of films like Totoro, and in contrast to Mamoru Hosoda's previous Summer Wars, this film glides along without an epic struggle driving the story. Rather, the greatest moments are the depictions of family life and the picturesque sketches of Tokyo and the Japanese countryside.<br><br>The story begins with the start of the eponymous wolf children's parents' love, and progresses through births, deaths, moves, the first day of school, and their growth into adults. The story is almost too ordinary, but in its normality, its moments are universal. One can't help but stare in awe at the beauty of life as it happens, and be reminded of the beauty of one's own mundane yet special lives.<br><br>The art is also quite something. Tokyo's bustling life is reduced to warm glows of winter, and the Japanese farms and countryside is rendered beautifully whether it be in rain, sun, or snow.<br><br>Watch it. It's not of the same scale as Hosoda's previous Summer Wars or The Girl Who Leapt through Time, but it packs an emotional punch that surpasses either of them. You'll shed a few tears, and marvel at the beauty of the world and our lives.","user":"dokokita","rank":[73,78]},{"title":"Another Superb Effort from Mamoru Hosada.","rating":9,"date":"27 September 2012","review":"As part of Madman Entertainment's Reel Anime Festival that now come very two years since 2008. Its aim is to showcase some of the freshest and new Anime films that have been recently released in Japan to the rest for Australian and New Zealand for a limited time only. I managed to catch two films during its run; Berserk: Egg of the King and Wolf Children. I can only hope I see the other two From Poppy on a Hill and Children Who Chase Lost Voices when they come out on DVD.<br><br>Here's my review of Wolf Children: Mamoru Hosada could be one anime Director who could rival the international reputation of his former employers; Studio Ghibli.<br><br>\"Wolf Children\" is his third feature after the successes of \"The Girl Who Leaped Through Time\" and \"Summer Wars\".<br><br>The Stoy follows Hana; a young University Student who falls in love with a strange young man. It soon turns out he's a mysterious Half-Wolf-Half-Man descendant. Things start to take a more drastic turn when He dies leaving Hana alone to raise her two Children they bore.<br><br>The rest of the film follows the children as they grow up and how Hana manages to raise them and deal with their gift, habits, situations and morals.<br><br>The central action takes place in their new country home surrounded by wilderness and their interactions with the town folks and wild life.<br><br>Like Hosada's previous works, this film has fantastic and unique character designs; that aim more to realism and art-house scene than traditional anime designs.<br><br>The story is very heartwarming and cute as time goes on, there are some dark parts that become very heart wrenching. There's some very distinctive Ghibli influence in this piece of work, But I'm glad Hosada takes to his own territory.<br><br>To some viewers it maybe a little too long running at almost at 2 hours. But overall its a superb anime film even if your familiar with Hosada's other films or not Wolf Children is great and must be seen, I highly recommended it for a heartwarming journey of endurance, love, coming of age and prosperity.","user":"luke-eberhardt","rank":[44,47]}]