[{"title":"Living and (not) loving in East Germany","rating":8,"date":"17 September 2012","review":"It looks as if the communist rule in former East Germany is a nice source of inspiration for German film makers. First, there was the light-hearted comedy Goodbye, Lenin. Then, the heart wrenching drama Das Leben der Anderen. And now, there's Barbara. Another drama about a human being whose life is ruined by the regime. <br><br>The film is mainly about trust. Or, about not being able to trust anyone in a police state like East Germany. Barbara is a doctor who is banned from Berlin and put to work in a hospital in a provincial town in the north of the country. Soon enough, we find out why: she has a lover in West Germany and wants to escape from the country. She is bitter and full of resentment, but cares a lot about her patients, especially about a young girl who lives in a nearby labour camp and turns out to be pregnant. <br><br>Several times, we learn how oppressive this country was. 'No one can be happy here', says Barbara when her lover proposes to come and live with her in the East. 'I want my baby to go away', says the pregnant girl, and she doesn't mean abortion. 'Do you think they will let me go if I marry him?', asks a girl who also has a Western lover. 'No', is Barbara's short and clear answer. <br><br>The film is very strong in atmosphere, but there is also suspense. There are even some Hitchcock-like moments. One is a scene where Barbara tries to locate a colleague, and finds him in the house of the Stasi-officer who has searched her apartment. It makes you wonder if the doctor, too, is a Stasi-informant. One of the other strong points is the acting. Nina Hoss is very convincing as the bitter, distrustful Barbara, who only really can relax in the company of her Western lover. And there is the cinematography, that adds to the almost claustrophobic atmosphere. The camera hardly moves, the shots are static and show exactly what needs to be showed. <br><br>The end is quite surprising, and adds a nice and meaningful twist to a beautiful movie.","user":"rubenm","rank":[56,60]},{"title":"much more accurate than 'Lives of Others'","rating":8,"date":"20 November 2012","review":"It's a challenging task to depict a bygone era which hasn't yet passed into history, but is a living memory in the minds of many. Distant events may be easily interpreted at will, because no spectator can expect a minute reconstruction of a reality past. Adaptations of recent events, however, fall under close scrutiny of those who were actually there, and any attempt to 'tell the whole story' will invariably meet with criticism from those who feel left out of the picture, or who remember differently. It is therefore the best solution for the film maker to focus on atmosphere rather than events, and a simple story rather than a complex rendition of society as a whole. And that's what director/ screenwriter Christian Petzold does: he tells the story of a doctor, displaced from the capital to the province for an application to leave the country, and confronting an atmosphere of distrust while preparing her escape to the West. This routine of hostility is a little ameliorated by the interest of a male colleague, who may however be an assigned informer, and the friendship to a pregnant patient, who apparently escaped from a juvenile offenders camp only to be recaptured.<br><br>What makes me consider this film as far superior to the much lauded, Oscar-winning 'The Lives of Others' is that it does not sacrifice atmosphere to film making conventions. For instance, there is no music, because there was no music. 'The Lives of Others' tormented any actual witness of the times it described with a sappy soundtrack. It also did not correspond to my recollections of East Germany because it limited the supervision of ordinary citizens to the Stasi ('State Security') and its collaborators. It did point out that this supervision was omnipresent, but it created a division between good and evil which was slowly eroded from the evil side's end. 'Barbara', however, focuses on the way ordinary citizens, not intellectuals, were treated, and the fact that virtually everyone collaborated in the supervision of the individual, whether they were working with the Stasi or not. Barbara is fully aware of her situation, and tries to make friends with her colleague/informer André Reiser to win him over to her side, while at the same time not giving anything away about herself. Reiser, on the other hand, tries to gain her trust as a person, because he needs her competence at work and may be romantically interested in her, while at the same time fulfilling his obligations to report on her.<br><br>This constant game of hide and seek illustrates what Socialism was really like - a permanent grey zone in which you had to measure your steps carefully and no clear distinctions between good and evil existed, as 'The Lives of Others' would have you believe; and the young patient side characters show that quite a few cracked under this immense pressure. By focusing on one woman's story, director Petzold delivers an accurate portrait of the realities of life at that time: it did not matter whether you were good at your job or not, and being too good made you automatically suspicious, while being lazy made you the target of accusations of boycotting society; it was dangerous to open up to colleagues, because they would almost certainly be inquired about what you said, but at the same time it was dangerous to distance yourself, because then you'd be suspected of having something to hide. Everything was tactics, nothing was spontaneous, everybody wanted to get out, but chastised those who actually tried. This authenticity has probably prompted this film's selection as the German candidate for the foreign language Oscar 2013, but it may also have hampered its chances to win the Golden Bear upon its premiere at the Berlin Film Festival, where Petzold won the director's prize though. Realism makes for an accurate portrayal of the recent past, but for those who have not been there, 'Barbara' may be a bit too stiff and gloomy, because it does not compromise its authenticity to the expectations of (Western) audiences.","user":"Radu_A","rank":[65,74]},{"title":"A Somber and Compelling Film","rating":8,"date":"29 December 2013","review":"BARBARA may be a little too slow and humorless for many tastes, but it's one of those films that's so real it hardly seems like a film at all. You have to admire the stark realism here. Whether you want to go there or not, this film truly takes you to a secluded province of East Germany, 1980. BARBARA affords an acute look at the inside of a totalitarian state. While it doesn't show a whole lot in this regard, what it does is shown most effectively. The lack of any soundtrack--something I didn't even notice while viewing but that one of the reviews on Amazon pointed out--only adds to BARBARA's immediacy. Quietly immersing, with a real surprise at the end. Excellent cinematography and fine acting by all.","user":"doug_park2001","rank":[11,11]}]