[{"title":"What did everyone expect? It's a disaster movie!","rating":8,"date":"11 October 2015","review":"I read some of the reviews here and am wondering what all the negative reviewers expected. Who didn't know this was a huge, costly disaster movie? Who didn't know there were going to be many unbelievable scenes? Who didn't know there would be some cheesy dialogue? <br><br>Well, I, for one, enjoyed it. The last good disaster movie I saw was The Towering Inferno, and you know that was a long, long time ago. It's still my favorite disaster flick. San Andreas, of course, had much better special effects. (several decades later, better effects, right?) I thought the scenes of the destruction were amazing. <br><br>We all know disaster movies usually focus on a handful of people in it and this one was no different. The movie was entertaining for me. I hope it is for you, too. :)","user":"otter-stl","rank":[200,287]},{"title":"Big Dumb America","rating":5,"date":"26 August 2015","review":"Hilariously dumb and manipulative, it's entertaining on that level alone, although scary in that it's so boarder line that you can't be sure the movie was made with tongue anywhere near cheek, I'm inclined to think not. That this movie is serious, that America needs to feel like a scared kitten rescued by a big stack of muscles. That stack of muscles is Dwayne Johnson and it's hard not to love him. He's kinda good in this, I like him, even when he's part of this manipulative propaganda. The special effects were nice. it kinda flowed, sort of, I guess, lots of plot holes but why bother looking for them when the iq level they're aiming this at is so low you're not supposed to notice. The cheesy flag at the end gives you another good piece of cheese to choke on. If we're going to go down we might as well go down stupid.","user":"Rob-O-Cop","rank":[297,476]},{"title":"Disastrous","rating":4,"date":"11 July 2015","review":"My first experience in the UltraScreen®DLX with massive screen, Dreamlounger leather reserved recliners, and Dolby Atmos immersive sound with bass you can feel (it's true), was none other than to see San Andreas. If you haven't been following my reviews this summer, my goal is to review all of the summer blockbusters on cheap movie days for $5.<br><br>My first surprise was that the seats are reserved. You get to pick your seat, although there were few left to choose from when I arrived. The second surprise was that the chairs are power recliners, so you just push a button and wham you go back and your legs go up. The third surprise was a smell I hadn't smelled in years, not since junior high locker room. It was a mix of people who don't like to shower, don't like to wash their gym clothes, and wet tile. Then a nice young couple who dry humped the whole movie sat next to me and at least she was wearing a strong perfume that mostly covered up the smell.<br><br>But I digress. What about this disaster movie? It features a family (that apparently has no last name, at least not that I ever learned, nor is there any last name listed for them in the credits, so I will call them Family #1), a pretty family, an upper-middle-class family that is going through a rather benign divorce and Emma causes trouble immediately because she is moving in with a richy rich dude (who has a last name, because he's Daniel Riddick), a thoroughly loathsome man incapable of love except for buildings.<br><br>Ray is solid as a rock, he's something sturdy, like a real man, someone you can cling to or hold on to no matter what. He loves his daughter, Blake, very much, because he blames himself for the death of his other daughter, whom we eventually learn died while rafting. You see, Ray is a professional rescue-chopper pilot, so the death of his daughter is as much personal as it was a professional blunder.<br><br>The main problem with this disaster movie is that Family #1 is split in two groups, and there is no real belief that any of them will ever actually die, although San Andreas does feature Blake enduring the longest non-death sequence I've ever seen. In better disaster movies, like the original Poseidon Adventure (it's unfortunate that I have to clarify the \"original\" Poseidon Adventure) the protagonists are traipsing and shambling through the disaster together, and they drop like flies until the very end, when only a handful of the worthy and fortunate survive.<br><br>The acting in San Andreas isn't bad, and it's not good. It's extremely okay. Poor Paul Giamatti, who seems typecast as himself these days.<br><br>Things blow up, collapse, and fall apart real good. The special effects are pretty amazing and realistic. It's nice to see so many Californians perish as a precursor to the Great Water Wars of 2016. In fact, even though Ray is a civil servant responsible for saving lives, he tries to fly the chopper from L.A. to San Francisco to save his daughter instead of trying to save anyone in Los Angeles or elsewhere along the way. He _does_, however, trade a stolen pickup for directions to an airfield, which I suppose is a fair trade and shows he's a Really Good Guy.<br><br>There is a bit of adventure. Ray commandeers trains and boats and planes. Well, no trains. That would've been pretty cool to drive a train through an earthquake. A simple oversight, I suppose. Nevertheless, I sensed the feeling of excitement at the thought of being in a real disaster, stealing whatever vehicles were around to go wherever I wanted. And it's nice to see a lot of chopper scenes in a movie. There should be more chopper scenes in every movie.<br><br>Forget the millions of Californians who died or were dying along the way. All we care about are a handful of pretty, well-off people trying to survive the worst earthquake in human history. We rarely see anyone die, because they get swooped up or down or crushed. No bones, no blood, no limbs flying everywhere. It's pretty WASPish death, as people disappear in clouds of dust, never to be seen or heard from again.<br><br>Despite all the Californian death and destruction, Americans can be jingoistically proud to see a final flowing flag confirming we are the best nation-state on Earth, and we will rebuild it all for the next disaster.","user":"justinwfirestone","rank":[226,377]}]