[{"title":"Maps to the Stars is about the aspects of Hollywood that, as a film fan, I'd rather not think about","rating":8,"date":"6 October 2014","review":"Written by the acerbic Bruce Wagner, Maps to the Stars is about the cynicism of the entertainment industry, about the actors who are motivated by vanity and the money-minded executives who exploit them. These people's heads have been long removed from their shoulders, their molly-coddled lives are run by other people as they incessantly try and top up their serotonin through drink, drugs, sex and bastardised spiritualism with increasingly less success. It has been called 'narratively unwieldy' by the 'tomato-meter', and the events in the latter stages of the film are certainly dramatic and in quick succession, however Maps to the Stars is a great, grotesque satire from David Cronenberg, who could also be described in such terms!<br><br>Julianne Moore is brilliantly unhinged and crude as Havana Segrand, a deeply warped, neurotic actress who's haunted by the vivid apparition of her actress mother Clarice Taggart (Sarah Gadon) who died in a fire. When she's isolated in her large home, she's never far away from a breakdown, and we see her experience particularly wayward instability as she obsesses over securing the lead role in the remake of a film her mother starred in. Havana has expired her Hollywood leading lady shelf-life, however she's desperate to be at the forefront of the business and in the process has ground herself down into a drug addled, hallucinating mess. Havana's manipulative conversations with colleagues makes for awkward viewing, she fawns at a moment's notice, even with people who privately drive her into psychotic episodes.<br><br>Evan Bird is very good as Benjie, a child star who is often obnoxious but really a product of his clearly unhealthy environment. He is introduced to us in a hospital room as he visits a young terminally ill fan with Hodgkins Lymphoma; when presented with such misery he deals with it the only way he knows how by arranging for her to be given an iPad. After this he has a brief argument with his adult assistant, the sweary exchange is concluded with Benjie calling him a 'Jew faggot'.<br><br>His sometimes vulgar, churlish exterior belies a rather precocious character with an articulacy that's beyond his years. Even when he's unpleasant he's not entirely loathsome, his language is so gratuitous that it was almost comical, especially when expressing his unashamed contempt for the sycophants around him. I suppose he was hard to take seriously owing to his elongated neck and sloped, pre-pubescent shoulders.<br><br>Agatha (Mia Wasikowska) is a timid, unusual young woman who, with multiple burns across her body, is destined to fail in the industry. She's in Los Angeles after corresponding with Carrie Fisher on Twitter, and Agatha soon finds herself being interviewed for the position of 'chore whore' for Havana. It is here that her burns actually help her odds in Hollywood, as the injuries remind Havana of her mother. It eventually arises that Agatha is in the city to 'make amends', unravelling a twisted cauldron of lies and incest.<br><br>John Cusack is also well cast as Stafford Weiss, the self-help charlatan father of Benjie who is made very creepy by Cusack's dark, dead eyes and blank expression. His wife is Christina (Olivia Williams), a woman bereft of any charisma who spends much of her time posturing anxiously with a cigarette in her hand.<br><br>Unlike Cosmopolis, Robert Pattinson's character Jerome Fontana, a shy limo driver with ambitions of being an actor/screenwriter, is strictly a supporting one. In a film full of freaks, Jerome is the ordinary Hollywood wannabe, the one with which we can most relate to. However it appears his foray into this glitzy, red carpeted hell is in its infancy, he mentions to Agatha early in the film, albeit half-heartedly, that he's considering Scientology for better career prospects, which is an amusing dig at both fad culture and that absurd, unsettling religion.<br><br>I'm not sure what to make of the film's final act, everything goes awry for the characters in a manner that is perhaps too fast and too crazy. I tried to get the measure of the aberrance and the immorality upon leaving the cinema, I wondered whether Maps to the Stars was grounded in much reality, I then remembered Natalie Wood, the Black Dahlia, Elliot Rodger and the myriad other of Hollywood's victims, pill- poppers and prima donnas.<br><br>81%<br><br>www.hawkensian.com","user":"Hawkensian","rank":[98,125]},{"title":"The Grisly Side of Hollywood","rating":8,"date":"14 September 2015","review":"Anyone worried that a David Cronenberg film about the inner workings of Hollywood would not be filled with copious amounts of ick, rest assured. The ick abounds in \"Maps to the Stars,\" a fascinating film that must be something like what watching a grisly car accident in slow motion would feel like.<br><br>Julianne Moore won her Oscar for the bland and award-bait \"Still Alice\" last year, but THIS is the movie for which she should have won. Utterly lacking in vanity, Moore tears into the role of a washed up actress struggling night and day to stage her comeback. Think Norma Desmond without the black and white studio sheen of \"Sunset Boulevard\" and the filters that were necessarily in place back when Billy Wilder's dark satire was released. This film is like rummaging through Norma Desmond's underwear. Mia Wasikowska is great as well as Moore's hanger on and personal assistant who unravels and goes off the deep end and beyond. Swirling around these two characters are plot lines involving a troubled child star, lots and lots of incest, and enough frantic desperation to fill a sequel to \"Mulholland Drive.\" <br><br>Whenever I see a movie like this, I immediately wonder how true it is vs. how exaggerated for effect. For example, did Halle Berry or Nicole Kidman at one point in their careers have to subject themselves to the indignities shown or implied in this film? But then I think there has to be a lot of truth to movies like this, \"Mulholland Drive,\" etc., which makes me glad I decided to be an anonymous Joe as opposed to a superstar. For every Julia Roberts, there are hundreds, maybe thousands, of desperate people out there waiting for the big break that will never come, or who can't handle it when it eventually does.<br><br>Grade: A-","user":"evanston_dad","rank":[32,39]},{"title":"Cronenberg ignites a magnificent film with passion and humor...","rating":8,"date":"28 September 2014","review":"Probably the weirdest monster you'll come across this year, David Cronenberg's Map to the Stars is an odd animal full of wit, charm, and pure entertainment value. Definitely not for the faint of heart, but for those who love rich and layered characters, Cronenberg takes on Hollywood with zeal and humor. Some may classify the attempt as \"mean,\" but no different from what Martin Scorsese brought to the table with The Wolf of Wall Street, a black comedy with a much deeper message is fully on display.<br><br>Bruce Wagner's script is a masterclass of writing. He finds all unique characters within our social existences and assembles them with stunning resolve. It's hard to believe the guy who wrote \"A Nightmare on Elm Street 3: The Dream Warriors\" could be capable of such a feat. We also get a subtle score by Howard Shore and stunning contemporary costumes by Denise Cronenberg. Not since The Devil Wears Prada has fashion felt like a separate character piece on a contemporary film set.<br><br>With no short of brilliance, the entire cast ignites some of their finest and most compelling works of their careers. It starts obviously with another powerhouse turn by four-time Academy Award nominee Julianne Moore. As \"Havana Segrand,\" an actress dying for a big comeback, Moore illustrates her most vibrant and fruitful interpretation since \"Cathy Whitaker\" in Far from Heaven. Ferocious, daring, and completely involved, there's no other actress like Julianne Moore on this cinematic planet. Too good for words.<br><br>Everything seemed to finally click for actress Mia Wasikowska in her most daring performance to date. A ticking time bomb of emotion, her interpretation of \"Agatha\" is damn near close to terrifying. Robert Pattinson leaves all his \"Twilight\" days behind him and continues to evolve as a true performer. Cronenberg obviously knows what the heartthrob is capable of as he continues to use him frequently.<br><br>John Cusack and Olivia Williams are a match made in cinema hell, which secretly means heaven. Two people who are despicable together, the pair play insanely well off each other, showcasing luscious movements that all ring true. The young Evan Bird will have all of us learning his name by end credits. Lots of child stars make soft transitions in upbeat films like Little Miss Sunshine and Whale Rider. This is a brave and charismatic performance, channeling the aura of Justin Bieber (unfortunately just based on looks) but with tenacity as such performers as Ryan Gosling.<br><br>There are some tough pills to swallow during the viewing. There's incest, murder, \"mean girl,\" moments, children dying which has characters happy to see it, it just doesn't seem to end. However, you will be entranced and placed under its spell from moment one. Cronenberg takes on subjects like violence and family with assurance. He's displayed this ability many times over in his filmmography. Map to the Stars stands tall with all the director's previous efforts.<br><br>Map to the Stars is not coy and completely confident in its demeanor. A well orchestrated and symbolic film that stands as one of the year's best films. This is Cronenberg's best effort since A History of Violence.","user":"ClaytonDavis","rank":[58,83]}]