[{"title":"Under-rated low budget alien encounter film","rating":5,"date":"23 August 2015","review":"A unique and interestingly different approach to the crashed alien space craft/alien contact genre. A take I've never seen before (and I've watched a LOT of these films) which makes it a must-see for any fan. However as it is, it would have been better as an hour long short. That really is it's main problem--not enough story to fill out a feature length film; otherwise it was a very worthwhile effort.<br><br>The story was stretched too thin for a feature, but it has its strengths as well; the acting was very good and it did manage to maintain tension despite the relatively slow pace. While it did use a bit of the \"found footage\" technique, it didn't over do it and how they used it made sense. Plus for those who hate FF, there is only a little (a reasonable amount of) camera shake (I hate that too). The story overall held together, but I was puzzled by why the interrogation was instantly hostile. It would have helped if there had been some kind of indication given--more background shown regarding the person in charge and her over-board hostility, and the explanation would have helped fill out the story. A missed opportunity for real story telling, it comes off as the bones of an idea rather than a full-fleshed film.<br><br>Still much better than many of the films of the genre and much better than the 3 rating on the IMDb page. I don't get it; there are far worse films with much higher ratings. Go figure. I was almost tempted to give it a higher rating than I did just to make up for it.","user":"ladybug2535","rank":[15,16]},{"title":"Almost excellent low budget film","rating":6,"date":"30 January 2015","review":"Come on! If it doesn't have a budget of hundreds of million of dollars it's a bad movie? The IMDb rating is way too low for this film.<br><br>It is not perfect, that I admit, but it is far from bad. I think the worst part of it was the interrogation room. They used some weird tech and they made a great effort to explain that no one knows how it works, only what it does. It had absolutely nothing to do with the story. Also the psychopathic doctor cliché went a little bit too far and for no good reason.<br><br>It basically played out like an over extended Outer Limits episode sans the budget. Lots of annoying clichés were used like the evil shadowy government organization, the humanoid alien that makes cameras fizzle right when it enters the shot, the found footage bit, the black eyes, etc. However it stops right at the edge of being too much and overall it kind of works.<br><br>Bottom line: the ridiculous low budget shows in the special effects, the sets and, unfortunately, the acting quality. The story, though, is interesting enough to keep someone watching and always trying to understand what is going on. I wouldn't recommend it, but I can't tell people off, either. A bit too long for the content, though.","user":"siderite","rank":[29,35]},{"title":"Eject it","rating":1,"date":"23 January 2015","review":"I decided to watch this film besides the low score. That was my first mistake. It was immediately evident how bad it was going to be but I kept watching with the hope the it will improve later. That was my second mistake. And surely enough I was rewarded with one of the worst endings in the history of cinema.<br><br>I am trying to find a redeeming feature for this film. Perhaps Julian Richings's acting was sometimes bearable but I am not sure if it was because of effort or sheer astonishment at the stupidity of the script. Everybody else's acting was as bad as bad acting can get. They almost seemed they were doing this in a foreign language they didn't understand and then dubbed badly into some kind of English.<br><br>The storyline was mediocre and predictable. Huge holes in the plot and unexplained behaviour from absolutely everyone made this film quite cringe-worthy. The Blair-Witch-eqsue delivery was laughable and the video selfies *with* light while hiding from monsters in a dark forest were just bizarre.<br><br>I don't have this feeling often but after watching this awful, awful flick, I just want back the 77 minutes I wasted on it.<br><br>Move on people, nothing to see here...","user":"georgem4","rank":[16,20]}]