[{"title":"Could have done with being twenty minutes shorter","rating":5,"date":"25 July 2014","review":"Mischa Barton plays a young woman whose parents both die. Aggrieved, she renounces God's existence and challenges him to prove there's something more to life than what we know and see. I guess he does. He seems to send legions of things that bump around her flat to haunt her. Then he gets these goolies to kidnap her new - unbelievable perfect - boyfriend. The moral: never mess with God.<br><br>So, poor newly-atheist Mischa must look for her stolen bloke in a haunted apartment block where she reckons he's been imprisoned. Now, most horror films like this are about ninety minutes. This one runs at nearly two hours. And here lies the first problem. Namely, that much of the film is either pretty establishing shots/montages, or Mischa walking slowly around one empty hallway or another - sometimes something jumps out at her, sometimes not.<br><br>This film is slow. And how you perceive it will depend on how much you like it. It's the very definition of a 'slow burner.' If you're desperate for something to happen, it may well drive you mad and you'll find that absolutely nothing happens for long periods of the film. However, if you like your horror slow, creepy and tension-building, then you'll probably enjoy this.<br><br>Just don't go expecting a roller-coaster of a ride style horror film. Unfortunately, although I like to think I can appreciate a slow-burner or two, I found there was nothing new enough here to warrant watching it again. It falls into that 'seen in all before' category.<br><br>http://thewrongtreemoviereviews.blogspot.co.uk/","user":"bowmanblue","rank":[8,8]},{"title":"Plot Problems","rating":3,"date":"15 October 2013","review":"SPOILER ALERT Yes, the movie is suspenseful - I'll give it that, but there are many holes and disappointments.<br><br>First, the two main actors are BORING! She spoke as if she was deflating -- monotoned, the \"grrrrrrr\" vocal range and just not very attractive acting range. The male was just as dull. I just didn't care about either of them which is a big problem with any film.<br><br>Next, the story line is ambiguous: What was the purpose of her being selected by the \"building\" -- her eulogy? Really? If so many people went missing from being in the building, why did anyone want to live there? Wouldn't the police notice a \"pattern\" for this happening? Don't tell the fire dept that there is no stairwell? Wouldn't that be noticed on regular, mandatory inspections? Who or what was in control of the top floor? What actually happened to him? How did he \"change places\" with her? Who did he negotiate with? Why did they both end up in Afterlife Beach and the other girl stuck on the haunted floor? She didn't do anything.<br><br>Finally, the end was \"Chick Flick Gone Wild.\" Boring.","user":"donnatirella","rank":[19,24]},{"title":"A little bit of light could have made things a lot clearer. Instead they went with a lot.","rating":5,"date":"11 March 2014","review":"This is a tough one to nail down. Basically Micha Barton﻿'s Sophia is a girl who has always had an eye for real beauty, but at her father's death bed she is given to suddenly have all of her basic beliefs torn to shreds, and she can no longer tell her own feelings from those that are just the result of a lifetime of being told that things are one way. Now this is a fragile girl who lives alone like most of us chose to, and she is afraid to lose what little she feels she has left as most people are. There is some good acting in here, and a lot of good camera work. The lighting is sort of the key to many scenes, and I have to fail it simply because it was not used enough (there are times when it is used to represent life, and others that it is used to represent the shifting from light to what is in the dark) it just felt like the flashlights could have been better spook tools instead the whole movie ends up not being scary at all. The first shot had me actually in, I saw Mischa Barton walk into the dark and thought things were going to get started, but then the movie stutters, and stalls. For a while things just feel forced, and the characters are pushed on us, then there is some nice warming in the new relationship stuff, but the artsy nature of the direction will leave you wondering if most of these things are or did even happen. There is a point in the \"spooky\" part of the movie that made me lose it a bit: the entire group agrees that they need to go down stairs, and get out, then they all walk happily away from the elevator. There are a few more moments like this where you have to ask \"How long will she just stand there moving the flashlight back, and forth hoping that something is going to change? Walk please walk.\" There is a movie in there that can be Enjoyed, I just don't think that most people will ever find it, or be willing to dig deep enough. So I don't really recommend this one to anyone, there are some rehashed old plots mixed up, and you are paid off with another rip off at least that's how I saw it.","user":"face-819-933726","rank":[4,4]}]