[{"title":"I Tawt I Taw a pretty weak movie","rating":4,"date":"7 June 2017","review":"\"I Tawt I Taw a Puddy Tat\" is an animated short film from 2011, so this one had its 5th anniversary last year and it is a bit of back to the roots as here we have a new modern take by writer and director Matthew O'Callaghan on the eternal story of Sylvester trying to catch Tweety. Of course, Granny is around as well as if Tweety would not make things complicated enough already for the kitty. It is pretty short, runs for 3.5 minutes only, so half the length roughly as these cartoons did back in the day. Mel Blonc was long dead already when they made this, but he still leaves a lasting impression and his song is probably the only somewhat decent aspect of this little movie. Oh yeah, June Foray as Granny is on board too, very fitting character for her as she is about to turn 100 in a few months. Anyway, the comedy was not good in here at all, the animation did not really impress me either and I cannot agree with the Annie Awards appreciation for this one. It's not new or creative or innovative, but maybe it can get a few people interested again in the cartoons from the 1930s, 1940s and 1950s, then it is okay it was made. Besides that, I give it a thumbs-down though and don't recommend the watch, maybe because even back then Sylvester and Tweety were never among my favorites compared to the many many other WB characters or Disney too.","user":"Horst_In_Translation","rank":[1,1]},{"title":"Sylvester and Tweety in CGI","rating":8,"date":"2 June 2016","review":"Although there are people out there that don't care for the Sylvester and Tweety cartoons, and also those that dislike Tweety as a character, this reviewer doesn't mind Tweety (while admitting he is too much of a plot device in their latter cartoons) and mostly enjoys their cartoons, though feeling that some are better than others.<br><br>'I Tawt I Taw a Puddy Tat' is the same as the CGI Roadrunner/Wile E. Coyote cartoons 'Coyote Falls', 'Fur of Flying' and 'Rabid Rider'. In that it is not quite up there with the best of the classic era cartoons, but is almost as good and better than their later efforts which saw some of their weaker cartoons (though the worst of their cartoons, their weakest being 'The Jet Cage', are better than the worst of the Roadrunner/Coyote series and especially the worst of the Daffy and Speedy series, Bugs and Daffy also had cartoons that were worse.<br><br>Matthew O' Callaghan's CGI Looney Tunes cartoons are surprisingly really good, being well made and entertaining and doing a great job retaining the classic Looney Tunes feel missing for so long. Their only real problems really are their too short durations, though his Roadrunner/Coyote cartoons also could have been slightly wilder. All five of them are well worth watching, with my personal favourite being 'Daffy's Rhapsody', which was the funniest, was closest of the five to recreate the classic Looney Tunes spirit and Daffy rendition of Liszt's \"Hungarian Rhapsody 2\" is sheer joy. 'I Tawt I Tawt a Puddy Tat' may be my least favourite, but is still incredibly enjoyable. A large part of it is due to that there is a personal preference for Roadrunner and Coyote and Daffy and Elmer as duos.<br><br>This said, there is not much problematic with 'I Tawt I Tawt a Puddy Tat'. Like 'Coyote Falls', 'Fur of Flying', 'Rabid Rider' and to a lesser extent 'Daffy's Rhapsody', just over three minutes is too short a length and with some occasionally rushed pacing it feels it.<br><br>However, the animation is vibrantly colourful and also remarkably meticulous in detail and smooth. All three characters fare surprisingly (having had no prior experience seeing either character in a different animation style than traditional hand-drawn) well in CGI, and characteristics of their original designs can be found here and translate well in CGI. The music is similarly great, the main Looney Tunes theme is a delight and not only does the music sound good and entertain the viewer but it does a great job gelling with the action.<br><br>The song takes up a vast majority of the cartoon, and while it is not as riotous or as visually imaginative as Daffy's rendition of \"Hungarian Rhapsody 2\" in 'Daffy's Rhapsody', it is an incredibly catchy song with hilarious lyrics. Mel Blanc's (whose distinctive voice is heard through archive sound) vocals, in almost a one-man show, sings the heck out of it. As said, the lyrics are hilarious and are perfectly matched by the beautifully animated, nimbly timed and never less than very funny visual gags, that are never repetitive, tired, dragged out or painfully predictable. Hard to say which was the standout, because all of them work excellently. The ending is not really that surprising, anybody familiar with the character of Sylvester could see his actions coming from quite some time away, but that doesn't distract from the quality whatsoever because it's still funny and that it shows some typical behaviour of Sylvester shows a respect for the classic Looney Tunes characters and not a want to distort, dumb down or exaggerate them.<br><br>While the story is not exactly much of one, basically it's a series of gags revolving around the song, the cartoon is still mostly well paced and compelling, not boring the viewer for a second. All three characters are very well characterised, they carry the cartoon superbly and their classic personalities are retained and not something else that would have made them less funny and less likable. Granny's contribution is small and deceptively dotty but with a fiery feistiness, and Tweety (a marmite character that this reviewer has never minded, in fact I've always mostly liked him, but admits that he was too much of a plot-device character in the later cartoons) is not annoying instead sweet and quite amusing (there's also a little of the anarchic personality that was present in the early stages of his development way back in the 40s).<br><br>Sylvester is the star though, like Wile E. Coyote in the Roadrunner/Coyote series he is the funnier and more interesting of the duo and not only is he is so well characterised in the animation (Sylvester being one of the most expressive characters in the Looney Tunes canon), he is one of those played for laughs characters that is so fun to watch but it's also easy to feel sympathy for him. Mel Blanc (his voice heard through archive sound) and June Foray do wonderfully voicing the characters.<br><br>All in all, my least favourite perhaps of the five CGI Looney Tunes cartoons from Matthew O' Callaghan but really good, which says a lot about the surprising high quality of the five shorts. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[2,4]},{"title":"Well done WB!","rating":8,"date":"30 June 2019","review":"I'm not a big fan of these recent computer animated shorts but this one's pretty good. The songs are catchy, the animation's great and the story while simple and recycled has a bit of twist to it. I'd say check it out.","user":"mitsubishizero","rank":[0,0]}]