[{"title":"Tesla, Westinghouse & Edison... the Real story?","rating":6,"date":"15 September 2019","review":"Thought the casting on Cumberbatch's behalf was odd as he doesn't resemble nor act as you would suspect Edison to act (on the uncharacteristic side). Others in the cast seemed right. I've read where people argued the story-line of the movie vs. actual, and I've done a lot of reading on Edison and Tesla and actually found it very close.. plus the AC vs. DC rivalry with Westinghouse (including electrocution) to be VERY accurate. The story doesn't have a lot of \"wow\" to it (like a fictitious story would), but considering it based on real-life, it felt right. Oddly, the focus seemed to be heavy on Edison, yet the aspect of the story with Edison/Westinghouse truly MAKING AC work (and the person truly on the \"shaft end of the stick\") was Tesla!! The characterization of Tesla really left a massive untold story of pure genius receiving the most unfair treatment (though touched upon). YES.. Edison DID tell him he'd pay him a huge amount if he could figure out the problem.. and YES.. Edison did say \"he was joking\" (as in real life). It mentions Edison's venture into film, but if the film makers wanted to tell a more interesting story about Edison, it might be about his film work and competition with the Lumière brothers (the two brothers who actually were the real leaders of motion pictures. There are horror stories of Edison hiring hit men to show up where people were filming with Lumière film equipment to beat them up and destroy the equipment. Edison is portrayed a bit of a victim in this movie, but it seems that he really was anything BUT that. It seems that whoever wrote the screen play or story didn't know enough about Tesla to really portray him as the real victim he was, nor recognize Edison's very underhanded way of sometimes doing things. The film points out (justifiably) that often people credited with inventions are really just the person getting the last development in (not truly the original inventor). I'd LOVE to see Scorsese do a complete story focused on Tesla. THAT'S the REAL story here!","user":"dan_slentz","rank":[131,145]},{"title":"Inaccurate story, not linear facts","rating":3,"date":"18 July 2019","review":"The movie is actually slow, with a sad music, giving inacurate profiles about the personalities of Edison, Westinghouse and Tesla. Tesla should be the real hero of the movie, as it happened in reality. The other characters where: Edison, yes a quite original mind but not a genious, being a slave to his need for fame. Westinghouse, JP Morgan : businessman. Tesla: the one that changed the world and died broke in an appartment.","user":"ikgoumas","rank":[239,297]},{"title":"Lets all forget about Tesla","rating":1,"date":"21 July 2019","review":"Typical Hollywood, the do not want to tell the truth.\nIf it was not for Tesla I think Edison would have been a laughing stock.<br><br>Edison stole ideas from Tesla.<br><br>Not to mention, Tesla was so much more interesting than Edison, he was charismatic and eccentric.","user":"vsx819","rank":[223,284]}]