[{"title":"Decent enough action thriller, it grew on me by the end.","rating":7,"date":"28 October 2016","review":"This movie tries to be many things; its mostly an action film but also plays heavily into the family drama while throwing in some dark comedy too, all with mixed results.<br><br>The somewhat recycled story follows Kevin Costner as a gruff ex secret service agent who after being told has just 3 months to live sets out on that infamous \"one last mission\" in exchange for an experimental drug that will save his life. This last job just happens to take place with he also tasked with looking after his estranged teenage daughter (Hailee Steinfeld) after his ex wife (conveniently) has to leave town.<br><br>The action storyline is quite good though thanks to Luc Besson; decent stunts, tons of broken glass and bullet riddled bodies, and Costner gets the job done -Liam Neeson style-. The ending sequence was also refreshing as all along I had been assuming a cliché kidnapping, so nice twist there.<br><br>I did find the amount of perfect English being spoken and understood in France and especially Serbia a little convenient but whatever, this was mindless but still worth a watch.","user":"juneebuggy","rank":[16,18]},{"title":"One Of The Most Action Packed Movies Of Costner's Career","rating":7,"date":"2 November 2016","review":"Continuing my plan to watch every movie in Kevin Costner's filmography in order I come to 2014's three days to kill.<br><br>Plot In A Paragraph: Ethan Renner (KC) an estranged father, with limited time to live, desperately tries to reconnect with his estranged wife and daughter before his death. Oh and he is a C.I.A. field agent, that is promised an experimental drug if he agrees to one last job. <br><br>3 Days To Kill was marketed as an action film like Taken. I guess, that is a fair description. But there is more to it than that!! It is also an melodrama mixed in with foreign intrigue, assassination plots, kidnappings, and murders. There is plenty going on. Maybe it would have been better in Luc Besson's directed his own script, as it seems uneven at times. <br><br>Ridiculously implausible, but that doesn't take away from its entertainment value at times. There is a silly sub-plot about a squatting family of immigrants who have taken shelter in KC's flat, but the distraction is minimal. The annoying daughters bratty attitude grows tiresome early on (I actually wanted several horrible fates to befall her) but she is worth protection by the ended the movie. <br><br>With the exception of 3000 Miles To Graceland, 3 Days To Kill is without doubt the most action packed/violent movie in KC's filmography.","user":"slightlymad22","rank":[19,23]},{"title":"Don't take it seriously!","rating":8,"date":"21 February 2014","review":"It is a lot like \" True Lies\" in that a lot of the movie is played for laughs. Amber Heard fits her role very well. Kevin Costner is great as a man who has spent too much time on work and not enough time on his personal life. That is something most of us can relate too. I see people complain about the subplots but they are what make the movie fun. The character actors are great. Not a miss among them. The chase scenes are good with out going over the top. There were only a couple of times where the movie goes to big explosive special effects that take away from the story. The Daughter, played by Hailee Steinfeld, is excellent. Haiee played Mattie Ross in \"True Grit\". It will be a great loss to the screen if she goes into directing like she wants.<br><br>Get some popcorn, sit back and enjoy the fun.","user":"bodnarhd","rank":[147,213]}]