[{"title":"A lumbering, distasteful comedy that has a lower impression of you than you have of it","rating":2,"date":"14 July 2013","review":"There I sat, in stone-cold silence, not completely watching, but observing Grown Ups 2, one of the most desperate comedies of the year. Smiling maybe twice, groaning several times, rolling my eyes several more, and eventually closing them for a few seconds trying to imagine what a movie like this could've been if the quality of the talent matched the quality of the three screenwriters behind this project.<br><br>The first Grown Ups film wasn't great - or even good - by any means, but had the vibe of a cheery, stupid ABC Family movie. The strongest complaint I had about the original film carries over to this one immensely which is that given the immense amount of talent in this film, from the three title characters alone, this should be a much better, much funnier movie. Adam Sandler can be funny when he is given timing and a decent character, Kevin James can always be sweet, simple, and relatable, Chris Rock is one of the funniest comedians working today, and David Spade almost always knocks one out of the park in Rules of Engagement. It's dumbfounding to note that Taylor Lautner has the biggest laughs in the film, and after watching this, I have faith that after the redundant Twilight franchise he'll find work in some solid buddy comedies. However, the first inkling that Grown Ups 2 is terrible is by the sole fact that Rob Schneider himself decided other matters were worth is time than making a film that was almost guaranteed to be a hit.<br><br>The entire event is a plot less picture (not the good kind) that provides its audience with a pathetic array of scenes that seem more like throwaway skits from Saturday Night Live. It's a massively redundant, laundry-list of senseless setups with unfunny payoffs that usually involve something along the lines of bathroom humor, objectification, homophobia, and obnoxious behavior. In other words, it's another Sandler movie. It takes place entirely on the last day of school and revolves around the gang of Lenny (Adam Sandler), Eric (Kevin James), Kurt (Chris Rock), and Marcus (David Spade) returns, this time welcoming a more quiet, suburban lifestyle contrary to that of Lenny's in Hollywood, and the ridiculous series of sitcom antics that unfold overtime.<br><br>The plot stops there. What follows is, as stated, a series of cheaply-staged, poorly-performed, witless gags that do nothing but make one check the time. Among the barrage of questions I had while watching this film, one of which was, \"who is the target audience here?\" My mind resorted immediately to tweens and adolescents, who spend too much time giggling at bathroom humor as is. But then, as the film progressed, it began to redirect its senses to a more sentimental side, which only shows the immense tonal strain the film has which is \"create cinematic anarchy for forty minutes before showing that this is a story about being true to ones roots and taking care of the family.\" The sentimentalism is then mixed with a strangely out of place eighties party that concludes the picture, which will definitely not be appreciated to the fullest extent by the previously mentioned tweens and adolescences, as many of the jokes and period references will fly straight over their head.<br><br>The problem with the film is that it seems so effortless and so poorly conducted. At least with various Sandler films like Happy Gilmore, Big Daddy, and even the unexpectedly raunchy That's My Boy, I could sense that it was made for somebody, be it adolescents or a bit older of a crowd and stuck with that persona. Grown Ups 2 is a film made with no agenda, no personality, and no spirit. It even resorts to the tireless Sandler cliché of having all the male characters being a cornucopia of stupidity and the female characters being nothing but eye-candy for the men. There are certain things I expect Sandler to be over now, what with approaching fifty in a few years.<br><br>You have a choice as a moviegoer this weekend and the several other weekends Grown Ups 2 is going to play. You can either a see a film that possesses gags as commonplace and predictable as a Fruity Pebbles commercial or use this time as an opportunity to seek out nearby independent features in theaters, at your local video store, or even on Netflix. Say you refute that suggestion and want to see Grown Ups 2 as a pleasant, feel-good movie. I know plenty of independent movies that are pleasant, feel good movies (Frances Ha is one of them and is still playing in many theaters nationwide). Wouldn't you at least want to give money to people who don't believe that you're sitting in the audience because you possess the attention-span of a newborn? Starring: Adam Sandler, Kevin James, Chris Rock, David Spade, Salma Hayek, Maya Rudolph, Maria Bello, Nick Swardson, Shaquille O'Neal, Peter Dante, and Allen Covert. Directed by: Dennis Dugan.","user":"StevePulaski","rank":[202,295]},{"title":"I was embarrassed to be seen at this movie","rating":1,"date":"22 July 2013","review":"How can I fully express my total disappointment in this film? It may not be possible. I am one of those who actually liked the first Grown Ups. It had a plot, good characters and lots of fun. The sequel, on the other hand, is pointless, stupid, juvenile, and insulting. Not one redeeming quality in the entire movie. I contemplated leaving after the first 15 minutes! I forced myself to stay just to see if this mess would get any better. It didn't. The jokes concern nude men, homosexual men, brainless women, sex, bodily functions (over and over again!), and more of the same, repeatedly. No story, no acting, no thought, no point. I was the first one out of the theater and never looked back.<br><br>What a total waste of time.","user":"dcorvino","rank":[149,225]},{"title":"A Terrible movie thats TERRIBLE!","rating":1,"date":"11 July 2013","review":"Sandler's first sequel, is even lazier, dumber, and even less funny then I could have imagined. It's worse than most comedy sequels, and worse then most movies period. It's worse than Grown Ups, for heaven's sake! There's no plot, none, zip, nada. Characters and gags are set up without payoff much like in Jack and Jill. Almost every attempt at a joke falls flat. Anyone who wants to make a comedy should watch Grown Ups 2 as an example of one that does almost everything wrong and what to and what not to do when directing and making a mainstream comedy.<br><br>Almost every joke in this movie is pointless, absolutely pointless. The movie's first joke: a deer wanders into Sandler's house where it pees in Sandler's face. In a movie that had actual though: this would happen not just because a deer peeing on a man is funny, but for some reason that has a point, maybe to show that the family had moved out of the city and into the country. There is no point, none and only the dumbest of the audience will find this amusing.<br><br>Grown Ups 2 is worse then the first and is a close 2nd as the worst Sandler movie ever made, nothing in this movie had a point, there is no plot, the whole movie and setup basically everything was lazy and Rob Schneider may have actually made one of his best decisions ever by skipping out on not only one of the worst sequels ever but one of the worst comedies I've seen in a long, long time. 1 out of 10. Skip this movie and go see Pacific Rim or read a book or go outside, Do Anything!! Just Avoid this movie.","user":"final-fantasyxcjo","rank":[103,161]}]