[{"title":"Girl on the run","rating":5,"date":"20 August 2016","review":"With Ottawa standing in for Philadelphia which you only see in establishing shots, Fugitive At 17 is a decent enough drama about a girl on the run. Marie Avgeropoulos is invading male nerd space as she is both beautiful and a computer hacker, not the image one usually has of hackers. But it's her computer skills that are invaluable to her right now as she seeks to clear herself of a murder charge, the murder of her best friend.<br><br>She goes with Cindel Chartrand usually to keep an eye on her as she's beautiful and a bit of a wild child. But they split at a club with Avgeropoulos going off with Daniel Rindress-Kaye and Chartrand being picked up by Casper Van Dien. Van Dien slips her a roofie and Chartrand dies of it and he attacks Avgeropoulos when she goes looking for her friend. The cops think she killed her friend.<br><br>The plot is kind of weak here and a good lawyer would have gotten her off as there was never even a motive hinted at why she would kill her friend. But later on while being transported to jail with some real feminine hard cases she gets caught up in an escape.<br><br>It's a good news bad news situation. Bad because she's a fugitive, good because she's free to investigate herself. She has a detective played by Christina Cox whom she gradually convinces of her innocence.<br><br>I liked Avgeropoulos's character. She's got a lot of Nancy Drew in her for the 21st century. Nancy could never have kept up and in touch with law enforcement and her father if she didn't have what this girl has available to her.<br><br>Casper Van Dien who is usually a square jawed hero reverses type against himself to play a predator. And play it well.<br><br>Fugitive At 17, not a bad film for a made for Lifetime TV job.","user":"bkoganbing","rank":[6,6]},{"title":"\"(twig snapping)\"","rating":5,"date":"11 June 2014","review":"Holly Hamilton (Marie Avgeropoulos) is a precocious Philadelphia high school senior who hacks into computers and commits insurance fraud and various other crimes--but only for the noblest of purposes. When she is framed for the murder of her best friend at a rave--which Holly, of course, only went to because her friend insisted--she must go on the run and prove her innocence to the local cops led by tough but compassionate detective and mom Cameron Langford (Christina Cox).<br><br>This made-for-TV production is the latest of MTI/Lifetime's \"at 17\" series, a little (but not much) rougher and grittier than its predecessors, \"Stalked at 17\" and \"Betrayed at 17.\" Fans of this series should definitely enjoy it. It's professionally filmed with decent acting. Plot-wise, it pretty much follows the old formula, with a few tiny surprises and a classic \"Scooby Doo\" ending. This script is staid and unimaginative: I like to use memorable lines of dialogue as the titles of my reviews, but the best thing I could find here was the above closed captioned stage direction.<br><br>Simply entertaining but quite contrived: Although Holly has had her share of bad luck, she also has some rather amazing strokes of fortune. While Avgeropoulos does the best job possible of portraying her, this character is an unbelievable paragon of brilliance and off-center virtue, a veritable Robin Hood who, despite many of fate's turns working against her, has apparently never done one truly wrong or foolish thing in her entire life.<br><br>Subject matter notwithstanding, FUGITIVE AT 17 is TVland clean: An unexplicit rape attempt, some mild violence, lots of chase scenes, no real gore or nudity, a few \"damns\" and b-bombs but no f-bombs, etc.<br><br>Oh, well. I realize that films of this sort have their share of fans, and I hope those people won't take too much exception to my little wise-ass observations here.","user":"doug_park2001","rank":[2,2]},{"title":"good for low budget TV movie.","rating":6,"date":"31 August 2013","review":"Holly Hamilton (Marie Avgeropoulos) is an independent loner teen computer hacker who has a history with the cops. She has only one friend and her name is Blake. When they go to a bar to celebrate, Blake is lured away by a serial rapist. Holly goes in search of Blake and comes upon the rapist. He kills Blake and frames Holly for the crime.<br><br>This is a made-for-TV movie, and it looks like it. Luckily the story had a little bit of ambition which made it somewhat watchable. Marie Avgeropoulos is good looking and fairly physical. But she doesn't really have the facial expressions to do in-depth acting. The story has some tension, but the low budget just doesn't allow for big action. It's watchable, but forgettable.","user":"SnoopyStyle","rank":[8,14]}]