[{"title":"Fresh from Toronto After Dark","rating":9,"date":"11 July 2012","review":"Listen, the only way to truly enjoy a horror film is in a large, pitch black room with deafening surround sound and a group of people just as scared as you are. Other times, a laptop works too. But I, and a group of about 100 others were privileged to catch the first Canadian premiere of V/H/S presented by the Toronto After Dark Film Festival. Enough plugs, onto the film right? My review. See it! If you love horror, if you hate horror, if you think you might like it and wanna try it out, just see it! Without spoiling anything I will say that there are about 5 or 6 anthology stories tied around a main story in which four guys break into a house to look for a specific video tape. They find a lot more, let me tell you. Some of the segments are better than others (trust me, you'll know which ones) but overall, V/H/S is one of the most imaginative, jolting, riveting, heart-beating-outside-of-your-chest-because-its-so-intense horror films of recent time. Fans of Creepshow 1 and 2, Tales From the Darkside, Twilight Zone (the movie) and even Stephen King, if you get the chance to watch V/H/S, do it! It's bloody, it's scary, it's haunting, and if you're anything like me, you'll know it scared you when it's 1:43 in the morning and the only thing you can do to make yourself fall asleep, is to review the film on IMDb.","user":"turbo_t_7","rank":[172,239]},{"title":"suspension of disbelief","rating":8,"date":"31 August 2012","review":"I can understand if you do not like the so-called 'found footage' films, for example; Blair Witch and Cloverfield. I must admit, some of them work, some of them don't. Cloverfield worked for me, but only on the big screen in a cinema. Blair Witch worked for me, but only on a small PC monitor. Some things work better depending on the way you view these things, but also, what works with one person, will not work with another, everybody is different.<br><br>With that out of the way, let me honestly try to convince you that my small review on this film is mainly based on its merits, and not just what I enjoy personally.<br><br>I think the credit is due to the effort that went behind making this film, because even though each of the video tapes the guys find and watch are very strange and hard to swallow, they have genuinely tried hard to convey a sense of realism. <br><br>But it also helps if the viewer made a little effort, and suspended your disbelief in order to get into the film. Some people can do this easier than others. If your a horror fan, this will entertain at the very least. Each of the five found tapes start off innocently enough like home movies, but each one reveals shocking footage of something strange or unravels into a horrifying ordeal. It reminded me of 'Tales of the unexpected' or 'The Twilight Zone' but with the use of a hand-held camera instead.<br><br>Again, it'll either work for you or it wont. But the makers of this film tried hard and kudos to them. The effects were great, the acting was as expected, just as in any 'found footage', if its going to convey realism, its NOT going to have Oscar worthy acting, don't forget these are meant to be 'real' people. And the stories behind each tape were all entertaining.<br><br>In the end then, before you watch it, heres some top tips; Turn the lights out. Keep telling yourself that what you are watching is 'real'. Open your mind. And enjoy.","user":"darksideofthespoon-622-36121","rank":[73,107]},{"title":"Creeper Compendium.","rating":7,"date":"10 February 2013","review":"The horror anthology has a chequered history, some are bad but saved by one great segment, others boast a couple of genuine creepers but are undone by one instalment so bad it tarnishes the film forever. And on it goes. V/H/S brings the format into the new age by unfolding its tales by wrapping around the latest craze of found footage.<br><br>Six indie directors have produced a picture that was well received at Sundance but has proved to be most divisive with critics and horror fans on internet forums. This will come as no surprise to anyone who knows their horror anthology onions. The usual problems are evident here, a couple of great stories are surrounded by mediocre ones, but at least there is something for everyone, with most bases covered, but that in itself is a problem, all horror fans have preferences, it's a big ask to expect a fan of stalk and slash to love a story about a winged harpy!<br><br>Then there is the issue of the found footage format, here recorded on actual VHS. Not everyone is a fan (myself for instance), and much of V/H/S is dizzying and often hard to follow, especially as regards the Tape 56/frame narrative story that cloaks the other five stories as a bunch of no-mark young crims burgle a grotty house and sift through the tapes. It's a format loved by many for its supposed realism factors, I don't get that myself, but for those people this really is up their trees!<br><br>Amateur Night (David Bruckner) and The Sick Thing That Happened to Emily When She Was Younger (Joe Swanberg) are the standouts. The former is a cautionary tale of frat boys out for sex who get more than they bargained for when they take home the mysterious Lily, the latter an eerie tale unfolded via Skype communication as Emily appears to be a victim of a haunting whilst chatting to her doctor boyfriend.<br><br>However, if you ask another fan of the film what stories they feel standout, you may just get two different answers. So as with any other anthology horror, you roll the dice and take your chance, just don't expect genius in every story, for that is purely folly of expectation. 7/10","user":"hitchcockthelegend","rank":[39,55]}]