[{"title":"Drowns under the weight of cryptic dialogue and abstract storytelling.","rating":4,"date":"24 October 2013","review":"With three of his novels being adapted into critically acclaimed films, Cormac McCarthy has opted to try his hand at screen writing, and the fruits of his labor can be seen in The Counselor. Directed by Ridley Scott, the film stars Michael Fassbender as a high-priced lawyer who decides to dabble in something a bit less than legal in order to make some extra cash.<br><br>Against the advice of associates Reiner (Javier Bardem) and Westray (Brad Pitt), The Counselor (whose name is never mentioned) has somehow gotten himself involved in the drug trafficking business, although the film remains ambiguous about the specifics. Motivated by the love of a beautiful woman (Penelope Cruz) and the desire to maintain the lifestyle he's enjoyed for so long, he never takes into account the sort of consequences he may be subjected to, should things not go according to plan.<br><br>As the trailers for the film make abundantly clear, things do not, in fact, go according to plan - at least, that's what we're led to believe, since the details of The Counselor's involvement in said plan are never actually revealed. Despite being warned about this scenario from the very beginning, by nearly every other character in the film, The Counselor remains inexplicably shocked and stunned when things begin to unravel.<br><br>Ridley Scott's latest directorial effort is peppered with lengthy scenes that find The Counselor engaged in conversations with other characters as they try to impart kernels of wisdom, truth and philosophy. Unfortunately, first-time screenwriter McCarthy fails to realize that he's not writing a novel here. Despite the brilliance of his literary works, he doesn't take into account the fact that living, breathing people rarely speak in monologues, and there's scarcely an ounce of naturally delivered dialogue in any of these exchanges.<br><br>Indeed, if you watch closely you can actually see the actors struggling to wrap their heads (and mouths) around these complex conversations that are surely meant to sound intelligent, but come across as anything but. It's hard to find fault with the talented cast, but when working with such messy material, it's difficult to be at the top of your game.<br><br>Despite the script's shortcomings, The Counselor provides enough intrigue to keep things moving along for about 90 minutes or so. The problem, of course, is that the film grinds to a complete and utter halt with another half hour still left in the tank, and the final 30 minutes is some of the most excruciatingly boring cinema I've seen this year. It's a frustrating and befuddling experience, and I left the theater wondering exactly what the hell had happened, both in front of the camera and behind it.<br><br>-- Brent Hankins, www.nerdrep.com","user":"BrentHankins","rank":[505,634]},{"title":"Who Should Be The One Counseling?","rating":5,"date":"26 October 2013","review":"Normally, I fully appreciate bleak films with utterly despicable characters that leave you thinking rather than leaving the theater with a smile on your face, joyous to the fact that the hero saved the day yet again. Sorry, that's not my kind of story as overdone as it is. I prefer brutal realism where humanity is depicted in a much less phony manner. That's exactly what The Counselor promises as its characters take fairly regrettable paths- flawed people that make mistakes in a criminal environment. Some are more oblivious to it (or outright merciless), and some are much more humane in their methods. At first glance, it seems as if it's impossible for The Counselor to be proved a disappointment from the looks of its amazing cast (the likes of Michael Fassbender, Javier Bardem, Cameron Diaz, Brad Pitt, and Penelope Cruz), exceptional director with a credible resume, and a totally prestigious author signed on for his first screenplay. In addition, it appears to be a crime thriller, which definitely commences my adrenaline rush because it's personally my favorite genre. <br><br>Unfortunately, this film is a perfect example of \"don't judge a book by its cover\" (whether positively or negatively; people just love positivism so they usually associate the idiom with negativism). To simply put it, the story is a complete mess right from the start. We have our main character who goes by \"Counselor\" (played by one of my favorites, Michael Fassbender) confusingly dropped into this situation. How did he end up in this predicament? Why did he choose to pursue such a perilous and illicit path? Basically, the movie never explains anything. You're left in wonderment, attempting to figure out who is on whose side. Who wants to kill them exactly? Characters end up in random places, and the story never even bothers to explain how the two characters even know each other. The script just conveniently places two movie stars in one scene without an effectively developed context to service it. What follows are countless scenes where characters engage in conversation, vaguely discussing the circumstances. <br><br>The dialogue also feels vastly strange because the characters don't talk like actual people do in reality. Their speech sounds quite literary as they spout metaphor after metaphor, coupled with complex vocabulary. With that being said, I had no issue with it at first. In that, I mean I held no issue with the style of speech. What I did have an issue with was the way the characters spoke in a way that fully befuddled the viewers. It's like only the characters are in on it the entire way without the audience's understanding. In essence, it makes for an inconvenient and confusing experience. <br><br>Speaking of the cast, Javier Bardem was really the only one that stood out to me. Frankly, Cameron Diaz had me bewildered. She's supposed to be from Barbados with an accent- See, I wasn't even sure whether she was sporting an accent or not. At times, it felt like she had an accent going on, and then in other moments, she was speaking fluent and clear English; so I have no idea what was going on there. Even then, the film could've easily hidden all these flaws by presenting us with a thrilling and suspenseful plot, but it actually turned out to be incredibly uneventful. The scope didn't feel as exciting as it was supposed to be, and it definitely wasted an incredible amount of potential. So yes, I'm absolutely saddened; this was one of my most anticipated films of this year, if not my most anticipated, and it ended up falling embarrassingly flat. <br><br>There were a few disturbingly violent scenes that boosted the film's tone, for lack of a better term, literally, and reminded us of the excellence of No Country for Old Men. You're also met with an outrageous sex scene that's equally disturbing and sexy for some, and those scenes might be the only snippets of The Counselor remembered down the road. The ending was also not very reassuring, cutting to the credits unexpectedly shortly after another monotonous and ambiguous conversation. The only decent element of this movie was its soundtrack, but then again, its quality could've just been determined in comparison to the oddity and nuisance that the rest of the film consisted of. In sum, the best way to describe The Counselor is \"brutally unsatisfying.\" I felt no sense of satisfaction by the time it drew to a close, and everything simply felt so meaningless and forgettable. There's no question that it left a bad taste in my mouth, and I sincerely hope that Ridley Scott ups his game sometime soon.","user":"FilmMuscle","rank":[319,447]},{"title":"The Counselor proves that talented people can produce a horrendous mess","rating":2,"date":"24 October 2013","review":"When the names Ridley Scott and Cormac McCarthy are connected to a project, one can't help but visualize the noir visual poetry of Scott's Blade Runner and think of the harsh, grim storytelling excellence of Cormac McCarthy. Unfortunately their project, The Counselor, lacks all of the wonder that has gained them respect in the film industry.<br><br>The story, the first original screenplay written by Cormac McCarthy, is meant to be didactic but instead comes off as a pedantic mess. It clomps where it should glide and leaves film-goers expecting more than they receive. The story is about a lawyer, The Counselor, who somehow (that is never explained), is brought into a drug deal of some kind (which is never clarified), to an extent that we aren't privy to. There is also a secondary tier of characters who The Counselor knows, many of whom are also involved in the drug deal yet we never learn why or how they're involved; not what I was expecting from a man heralded as the most important writer in the country. Add to the soggy script McCormack's usual lack of understanding about women, his fascination with unnatural sex and predictable, but not particularly interesting violence. There are dozens of nonsense plot turns and character inconsistencies. Long amounts of time are spent in developing characters that never appear to have any significance in the film. Wise men abound; there's a wise diamond expert, drug cartel lord, and a couple of un-identified wise men. Meanwhile, the only three women in the film are a whore, a personified animal and nun. There are a few other women to be seen; either dancing in bikinis or pouring coffee.<br><br>Whether it comes from the script or was added as an artistic touch from Scott, there is an infusion of grade school obvious symbolism throughout the film which is so blatantly obvious it borders on being offensive. The good guys live in completely white houses and the bad guys all drive black vehicles, that sort of thing. One of the many weaknesses of the film is the cartoon-like quality of the characters. It's difficult to determine if they were written that way or if it was an artistic decision on the part of Scott. Either way the experiment was a failure. While the cartoon effect can be used deftly in film, in this picture it creates one more bruise on an all around achingly painful film.<br><br>Occasionally a disastrous script can still work on some level if there are exceptional performances. Unfortunately the two leads, Michael Fassbender and Cameron Diaz, are the weakest links in the picture. Michael Fassbender, as the good guy who made a bad choice, is meant to keep us engaged, even if we don't understand his motives or his reactions. We should feel something with or for the character. His performance is so flat that even at his most sniveling, snot-flying crying moments the audience sits in a numbed daze.<br><br>Cameron Diaz is painfully inept for the lead role in which she is cast. She's supposed to be terrifying and mysterious, but instead comes off as not understanding the meaning of most of her lines as she recites them in a staccato tone reminiscent of a poor high school performance. It is such a clunky performance that she often emphasizes the wrong word in lines of dialog. As if her performance isn't ludicrous enough she is also saddled with a ridiculous appearance. Her character is literally designed to look like a cheetah. Her hair is sculpted to resemble the cat and she is tattooed from behind the ear all the way down her back with a cheetah pattern. The film opens and ends with a hit-you-over-the-head-with-a-frying-pan obvious symbol that she is the hunter. We're told repeatedly that she has \"done everything,\" and she says that she has \"done very bad things\" yet the only example we are given is a sophomoric, insulting, male erotic fantasy in the form of masturbation. The final scene of the film, which should be edifying and revelatory, instead is painfully predictable and full of the hunter symbolism which represses any message that could survive Diaz's droll delivery.<br><br>image Javier Bardem, with his crazy troll hair and unthinkable clothing combinations, is ironically the most human of all the characters and perhaps it's due to his exceptional acting prowess. He is forlorn and powerful; confused and focused. The complexities that he brings to the part offer a welcome respite from the bland work by the leads.<br><br>Brad Pitt shows up in all of the advertising but his part is minute. He plays an urban cowboy of sorts; he dresses in outdated polyester cowboy garb and is smart enough to have a well planned exit strategy if things go wrong. We are supposed to believe that this same man would fall for an obvious female infiltrator and that he would order Heineken at a bar in El Paso, TX. His character would never order an import. Conflicting minor details like this compound the myriad of larger problems with the film.<br><br>Penelope Cruz's beauty and talent is completely wasted. Her character is so one dimensional you feel as if you can see through her. She is stereo-typically the \"wife\" in the \"wife\" or \"slut\" scenario to the point that she wears a cross necklace, talks about going to church, is hesitant to talk dirty to her lover and doesn't want to know the value of her diamond.<br><br>There have been no early reviews for the film. Many wanted to believe that it was to refrain from plot spoilers and maintain an air of mystery. The truth is much less interesting. It's because this is a horrible film in every possible way.","user":"jenn-haight1602","rank":[261,364]}]