[{"title":"Not one of Scooby's best but a nice way to pass the time","rating":7,"date":"1 March 2012","review":"As a big Scooby Doo fan, I enjoyed Scooby Doo and the Music of the Vampire. Of the Scooby animated movies, I do prefer Witch's Ghost, Zombie Island and Goblin King, and this is perhaps my least favourite of the movies to use the Mystery Incorporated-like animation style. However I still enjoyed it, I liked the animation style which was like a combination of the classic Scooby Doo and the What's New Scooby Doo style, and while it takes some time to get going the story was interesting with an ending that was a lot of fun if not entirely unexpected as I knew who it was halfway through.<br><br>The dialogue is witty, and the voice work is absolutely great, with only a little too squealy Mindy Kohn disappointing(slightly). Frank Welker is terrific as always, Matthew Lillard had big shoes to fill and does admirably being very goofy and likable and Jeff Bennett is both menacing and makes us feel sympathy for him. Valdronya is a very convincing villain, with an imposing look and a Dracula/Maldor the Malevolent-like voice that gives the chills. Now to the stuff that I wasn't so crazy about, apart from Mindy Kohn and some of the story taking time to get going.<br><br>I personally think the film could've been shorter, with a couple of scenes that could've been either shortened or cut I wouldn't have felt that the pacing was a little uneven with a couple of parts in the middle dragging. The songs I was mixed on; the best were Done With Monsters, which was clever and very spirited vocally, Scooby and Me, which was hilarious and Do You Want to Live Forever, especially for the dancing. The rest were forgettable, Valdronya Returns had a strong hint of deja vu almost as if it was trying too hard to be another villain song(can't quite put my finger on which) and I can't remember any of Vampire's Bite and Vampire's Dance, and didn't move forward the story much.<br><br>Overall, a decent film and an interesting enough change of pace, but I have seen better from Scooby. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,4]},{"title":"Another Nice Film for Scooby","rating":31,"date":"31 October 2013","review":"Scooby-Doo! Music of the Vampire (2011) <br><br>*** (out of 4) <br><br>Feature cartoon has Scooby and the gang solving a mystery and then heading down South to enjoy a vacation. They end up in Louisiana where there's a Vampire Fest being put on and sure enough they soon find themselves in another mystery. This time a vampire wants to make Daphne his new bride. SCOOBY-DOO! MUSIC OF THE VAMPIRE is actually a fairly entertaining film that manages to have a few good laughs, a couple nice throwbacks to the old TV show and of course there's even a little bit of TWILIGHT spoof thrown in. As you'd expect, the animation is really top-notch and we're given some wonderful visuals to look at. This is especially true with the darkness of the swamp, which simply looks wonderful as do the scenes inside the vampire museum. Another major plus is that the monsters themselves are all pretty good. I thought the vampires looked quite effective and especially the main leader who often finds himself flying through the swamps throwing fire balls. I'm sure these vampires will scare some really young kids as they're quite creepy. The vocal performances are also quite good with all of the main cast members doing a fine job and especially Matthew Lillard who has really perfected his Shaggy work. The film even turns into a musical as there are a couple songs played throughout and they're actually not too bad. They're certainly put to better use than some of those songs that were added to episodes in the second season of the original series. Fans of Scooby should certainly find enough here to keep them entertained and at just 75-minutes the film never overstays its welcome.","user":"Michael_Elliott","rank":[3,3]},{"title":"An Honest Review","rating":9,"date":"1 April 2017","review":"The whole concept of going to a Vampire Festival to get a break form monsters only to find monsters is classic Scooby Doo thinking.<br><br>Need a vacation from all the scary monster stuff? Then go to a monster festival, makes total sense...and fits brilliantly into the philosophy of the Scooby gang....sometimes you wonder if they don't do things like this just to torture Shaggy and Scooby.<br><br>It fits extremely well into the Scooby world, even down to the humor involved.<br><br>And the parody of the vampire story fad, is, of course, the only reason this installment was made. It brings the movies back to the Rice/King parodies in Zombie Island and Witch's Ghost...<br><br>...and the twist is fun...unfortunately that's where it dies and continues just long enough to turn what was potential into yet another lackluster conclusion.<br><br>It came VERY close to being one of the most solid Scooby Doo movies in the catalogue though. Certainly worth a purchase.","user":"generationofswine","rank":[1,1]}]