[{"title":"An odyssey of discovery, even self-discovery","rating":9,"date":"26 August 2012","review":"Sixto Rodriguez, a little known American folk-rock singer/songwriter in the tradition of Bob Dylan and Cat Stevens, released two albums in the early 1970s, Cold Fact, and Coming From Reality but failed to achieve any popularity. Though praised by critics, his haunting songs about love and loss, drugs and politics, such as \"I Wonder,\" \"Cause,\" and \"Sugar Man\" should have been hits, but, for some reason, were not. After a minor tour in Australia that brought neither success nor recognition, he was dropped from his record label and was not publicly heard from again.<br><br>Winner of the Jury Prize and the Audience Award at the Sundance Film Festival, Swedish filmmaker Malik Bendjelloul's moving documentary Searching for Sugar Man investigates the life of Rodriguez who grew up in a run-down working class area of Detroit, Michigan and worked mostly as a manual laborer, singing at night in small, smoke-filled bars. A friend who remembers him at the time says, \"There was something mysterious about him. He looked like a drifter.\" The film demonstrates Rodriguez' striking presence using a mix of songs, interviews with those who knew him or knew about him, animation, and archival photos.<br><br>Though no one knows exactly how, his albums somehow made their way to South Africa and circulated among white Afrikaans musicians. All of this led to a growing mystique about an artist that no one knew anything about. Rumors began to circulate that, during an unsuccessful concert, he shot himself in the head or died from a drug overdose, but no one knew for sure how he died. The film begins when Cape Town record shop owner and music fan Stephen Segerman, whose nickname \"Sugar Man\" mirrors one of Rodriguez' most famous songs, meets music journalist Craig Bartholomew-Strydom and the two undertake to investigate what had happened to him.<br><br>We find out that his album Cold Fact was distributed on a small South African label, that one of his songs, Sugar Man, was banned on the government-run radio station for its drug references, and that the anti-establishment lyrics of his songs such as The Establishment Blues struck a responsive chord with the growing student involvement in the anti-apartheid movement, and led indirectly to the Afrikaner protest musicians of the '80s. When Segerman and Bartholomew begin their investigation to uncover the mystery of Sixto Rodriguez, they take a cue from Watergate and decide to \"follow the money.\" As each layer is unpeeled, it only adds another mystery.<br><br>Though his albums are said to have sold half a million records, speculation is rife with questions about what happened to the money and an interview with, Clarence Avant, the boss of Motown adds more heat than light. What the music detectives eventually find is not only surprising but extremely poignant, and it is best for viewers to find this out for themselves. The film is an odyssey of discovery, even self-discovery, that is a profoundly inspiring celebration of a man and his music. More than just a film about music and musicians, however, it is about the human condition. Though it reveals its secrets slowly, when it hits you, it is with an astonishing burst of power that you can feel in your bones. Searching for Sugar Man is one of the best films of the year.","user":"howard.schumann","rank":[114,120]},{"title":"West LA Loves Sixto Rodriguez","rating":10,"date":"5 August 2012","review":"The Landmark Theatre in West LA is a tough crowd but they were laughing and crying and when it was over they were applauding. This is what movie magic is all about. I wandered in and was blown away. Where can I get the soundtrack?? Holy! Crap!! <br><br>Sixto is what Dylan could have been. That's right he's better than Bob. Better writer, better vocalist by tenfold. Unlike The Jester this guy never sold out and walked the talk until the bitter end. <br><br>I've always believed the world's best talent goes unrecognized most of the time but the story of Sixto Rodriguez puts that theory into the \"true\" category once and for all and I will never doubt it again. Please recognize this man's work! Hopefully his daughters will continue to work toward that end both in the USA and South Africa.","user":"djdavig","rank":[120,129]},{"title":"Well worth your time...","rating":10,"date":"24 July 2012","review":"This film was by far our favorite at the True/False Film Festival in Columbia Missouri this past spring.<br><br>The delights of \"Searching for Sugar Man\" are revealed along the way, as the story unspools over decades and continents. I BEG YOU to cover your eyes and ears if you happen to see a trailer at your local indie theater - the art of the trailer is apparently a lost one, and most of the surprises are spoiled in the promotion prepared for this film.<br><br>The director received a well-earned standing ovation at True/False, and wept - he and other directors said that T/F was the first audience of \"real people\" to see their respective films, apparently Sundance is peopled with \"not real people\"?<br><br>And be prepared to have the music playing in your head for some time to come.","user":"BarbP451","rank":[62,66]}]