[{"title":"I never want to date the scriptwriters","rating":3,"date":"2 February 2015","review":"I really wanted to like this one — it has a solid cast, and the promotional shots of Chris Evans in a variety of costumes (including a WWII sailor, a chain-smoking film noir hero, and an astronaut) looked intriguing. All the actors do sterling work, particularly Anthony Mackie and Topher Grace (who are, respectively, the film's id and superego). Unfortunately, not even these talented performers could make up for the clumsy, sexist script. <br><br>I was especially appalled by how Mr. Shafer and Mr. Vicknair treated Aubrey Plaza's character. I mean, her consolation prize for not becoming the narrator's girlfriend is an evening out with a guy who has problems taking no for an answer. The fact that Evans's next romantic picture, \"Before We Go,\" was also written by this duo does not inspire with me confidence.<br><br>My recommendation? Skip this and watch \"Some Like It Hot\" for a hilarious rom-com with male protagonists and three-dimensional female characters who are treated with sympathy and respect.","user":"shana-carter","rank":[37,55]},{"title":"There's a difference between a flawed protagonist and an antagonist","rating":2,"date":"11 February 2015","review":"\"My whole life, I've felt guilty after sex. Guilty for everything I'd said and done to get there. But the thing I learned, is when you actually care about the person, you don't feel guilty.\"<br><br>My palm should be in my face at this stupendously ignorant and completely illogical anti-philosophical piece of word gobble, but it was physically impossible as my clenching of my fists were instead turning my knuckles white while I was hammering at the stop button.<br><br>Why I endured this travesty for almost an hour is beyond me. Possibly because just before this tragedy of cinema I had enjoyed the flawed, but overall quite endearing \"The Rewrite\".<br><br>That story, as this one, follows a screen writer. And enduring this story had me thinking back to a scene in \"The Rewrite\" where Hugh Grant teaches his class that \"any good story must be character-driven, not the other way around.\"<br><br>It is certainly true for \"Playing it Cool\" that its story drives its characters, and its story is as clichéd and predictable as they come. But that isn't necessarily a problem; I expect romcoms to be predictable or clichéd, and I don't hold it against them if they do. Rather I'd applaud them if they break that mold. All a good romcom has to do is build likable characters that we may reflect ourselves in, and then lead us by hand through all the clichéd obstacles using funny and touching tricks to keep us entertained and engaged until we reach the inevitable hooking up of our protagonist with his or her soulmate, realizing their own flaws and having grown a bit. The End. A bit of Kleenex in front of our smiling faces, and a more or less given 7/10 on IMDb.<br><br>The problem with this formula is that when you fail to build likable characters, and you still count on that cookie-cutter storyline, there really are very few redeeming qualities left. A couple of laughs, perhaps, maybe some nudity, good actors, music. Not much reason to watch till the end now, is it?<br><br>This is evident in \"Playing it Cool.\" It's a perfect example of how important it is to have a true protagonist and not just a number of antagonists ranging from devilishly evil to just mean-spirited and spoiled, the latter being our \"hero\".<br><br>The only redeeming qualities we're shown about our main character are the ways his traits are not as repugnant as those of his \"friends\". He's a liar, he's a cheat, and he is through-and-through utterly disrespectful towards women. And the worst part is that it's not really depicted as flaws. He's a remorseless egotist bordering on sociopath. Kinda hard to feel any connection to him except a desire to connect one's hands around his throat.<br><br>It is really quite striking throughout the hour I endured how glaringly obvious it becomes that these script writers (the real ones, not the fictitious ones) truly don't have the first clue as to how love really works. The first \"meaningful\" kiss in the movie is a pity kiss, toe-cringingly pathetic. Or lead describes to his \"friends\" that his infatuation isn't about sex or lust, it's about the interests, feelings and whatnot that they share. One of the writers heard a line like that in another movie, and threw it in here — thing is, at this point he knows absolutely nothing about her. And then that horrible, stupid line that ended my viewing of this flick.<br><br>I realize you may be thinking that I'm some holier than though born again Christian who can't stomach promiscuous sex and foul language. But I assure you, I'm not. I enjoy women before, during, and after marriage as much as the next guy, the more the merrier, and I can swear you under the table. I just need my romcoms to be romantic, and at least a bit authentic underneath all their cotton candy sweetness. And that requires, at the very least, one protagonist. This flick has none.<br><br>Romcoms are a dime a dozen, and I suggest you put your money somewhere else. Anywhere else. The extra star is for decent acting.","user":"ShowMeTheCredits","rank":[50,80]},{"title":"Annoying, Silly, Boring and Disappointing","rating":3,"date":"16 October 2015","review":"A screenwriter (Chris Evans) is assigned to write the screenplay of a romantic comedy by his agent Bryan (Anthony Mackie), but he has difficulties to deal with the theme since he was abandoned by his mother when he was a boy. He unsuccessfully tries to have information about love from his friends that are also writers. When he meets a beautiful woman (Michelle Monaghan) in a charity event, he is shaken by the unknown feeling and they become friends. Further, he discovers that she is engaged of a man that represents stability for her.<br><br>\"Playing It Cool\" is an annoying, silly, boring and disappointing romantic comedy with an awful story of a man that does not believe in love due to a traumatic experience in his childhood. Indeed it is a collection of clichés. The characters are shallow and not well developed. The beautiful smile of Michelle Monaghan is the best that this film can offer. There are also many cameos only to give their names to the credit. My vote is three.<br><br>Title (Brazil): \"Deixa Rolar\" (\"Let It Go\")","user":"claudio_carvalho","rank":[21,33]}]