[{"title":"Unexpectedly powerful film","rating":8,"date":"16 July 2013","review":"To preface - I originally had no intention of watching this film due to the relatively poor reviews found on this site, as well as what I thought would be a shallow story about sex, drugs, and raves. It was pretty random that I ended up seeing this, and when I started the movie I wasn't expecting to watch much more than 5 minutes of it.<br><br>Fortunately, I sat through to the end and am very glad I did. The artfully told story and solid acting kept me hooked, though some of the scenes were admittedly a little stretched out. The story is split into three time periods of the character's lives, switching back and forth throughout the movie. As the viewer, you begin to piece together the story and relationships, and make sense of earlier scenes until you have a full picture at the end, which will stick with you for days.<br><br>This is not at all the shallow movie I was expecting. Instead, it was a gripping story about love and drugs - how they shape relationships - and a deeper look into artificial paradises. Solid acting, multi-dimensional characters and great cinematography all add to the viewing experience. This is a great addition to Brazilian Cinema which I will add to my favorites along with Tropa de Elite I&amp;II, Cidade de Deus, and Central do Brasil. I strongly recommend it.","user":"khlavguy","rank":[38,43]},{"title":"Pleasure is pain","rating":6,"date":"15 October 2014","review":"You could reduce the movie to its core message, but it wouldn't be fair to the story itself. And it's nicely edited (with time-lines crossing and giving you bits and pieces to swallow), even though it should be more than predictable early on. Then again there is a spin on that too. And there is some nudity and a lot of music and a lot of partying. \"Of course\" all that comes with a price.<br><br>You could say the bad tries to creep into the good moments someone is having. Like a balance, like yin-yang or whatever you want to call it. Decisions are made and people have to live with the consequences of their decisions. So life then ... as we know it. The acting is nice and the framing/colors are really putting you in the mood. \"Enjoying\" the movie would be a stretch, but it's powerful at times","user":"kosmasp","rank":[4,5]},{"title":"Another Brazilian failure","rating":4,"date":"2 September 2012","review":"It's very uncommon for me to see a Brazilian film, since they're always poorly executed, produced and acted-- and I'm Brazilian. \"Paraísos Artificiais\" is no exception; bad acting from most actors-- only a few did their job with quality. Directing is just poor and lifeless. Producing is lame, you can easily notice the parties aren't real since the ravers all do the same thing at the same time, which reminds us they rehearsed to do that. Story is vague and shallow. Rave is a good subject and with a professional production team it could have been a thousand times better! However, comparing \"Paraísos Artificiais\" to other Brazilian movies, it is not THAT bad. Just simply bad. Avoid it.","user":"raulfaust","rank":[31,102]}]