[{"title":"A real disaster","rating":9,"date":"2 February 2015","review":"I consider myself fortunate not to have known much about the movie. Actually, I was expecting a french disaster-flick in the vein of \"127 Hours\", a post-avalanche survival tale, because of the promotional poster.<br><br>Boy, I was wrong. Being misguided often gets me irritated, but \"Force Majeure\" was shockingly impressive.<br><br>The narrative follows a Swedish couple on a ski-holiday with their children, and the aftermath of them facing a somewhat life- threatening situation. The disaster here is not a force of nature, but a force of human emotions.<br><br>With no intention of spoiling a movie you should know as little as possible about, this is a hard hitting emotional drama about human frailty, marriage, inner torment and moral dilemmas when it comes to love, and the authenticity of love.<br><br>Very much recommended to lovers of layered, intelligent drama. And I repeat, this is not a natural disaster movie.","user":"spaceman88","rank":[117,148]},{"title":"Most interesting '\"food for thought\" narrative compromised by lack of judicious editing","rating":6,"date":"4 January 2015","review":"Force majeure means \"superior force\" in French but is also known as cas fortuit or casus fortuitus in Latin, which translates as \"chance occurrence, unavoidable accident.\" Indeed, Ruben Östlund's new Swedish drama features an inciting incident in the form of an avalanche, which greatly disturbs the relationship between husband and wife Tomas and Ebba, who are visiting a ski resort in the French Alps with their two young children.<br><br>While the family is eating lunch on a sun deck at a restaurant, Tomas assumes that what's coming toward them is a 'controlled avalanche', but when the blizzard envelopes the diners, he's the first to flee, leaving his wife and children to fend for themselves. As it turns out, the snow only reaches the resort in the form of a mist, and a couple of minutes later, everything is back to normal.<br><br>Ebba is furious at Tomas for what she perceives as his cowardice, leaving his children unprotected in a great time of crisis. She isn't afraid to embarrass Tomas by describing the incident to a couple whom they've just met at the resort. Tomas, however, denies that he ran and insists it's simply a matter of different perceptions of what occurred.<br><br>Tomas' denial infuriates Ebba even more and she again brings up the subject in front of Mats, an old friend who's also there at the resort, along with his much younger girlfriend, Fanni. Mats attempts to defend Tomas by stating that in times of crisis, one doesn't necessarily act rationally while in 'panic mode'. But when Ebba points out that Tomas filmed the incident with his cell phone, she insists that the offending incident on video be played. Sure enough, there is incontrovertible evidence that Tomas indeed fled the scene and can no longer refute his wife's claims.<br><br>As a result, Tomas withdraws into a great depression. While on the slope, Mats encourages him to let his feelings out with his voice, noting that he's pent up with rage. Tomas' 'venting' on the slope is reminiscent of the 'Primal Scream' therapy of the 60s. This leads him to break down in front of his family back at the room at the hotel and he's able to sob uncontrollably. Notably, Ebba is embarrassed by the expression of all those pent-up emotions in contrast to the children, who hug their father while he's going through this catharsis.<br><br>Tomas is a new man—or is he? One wonders why he takes the family up on the ski slope in dangerous blinding blizzard conditions. Perhaps he wants to prove to himself that he can protect them in the event of an emergency—and indeed, when Ebba loses her way on the slope, Tomas rescues her. The thought occurred to me that Ebba lost her way on purpose in order to create the opportunity for Tomas to save her. Whatever the case, we can now conclude that the crisis in regards to Tomas' masculinity is over and he has restored equilibrium in that regard. <br><br>The Force Majeure denouement adds an ambiguous coda to the previous proceedings. After leaving the resort, an erratic bus driver leads Ebba to fear for her life and now she's the one who's in full panic mode, leaving the bus without her children. It's another 'chance occurrence' where the normally controlled (and controlling) Ebba, finds herself quite out of control. Has she gotten her comeuppance or was she justified in panicking, in the face of that seemingly crazed driver? We note that one of the women that Ebba had met and talked to back at the resort, remains on the bus with the driver. Earlier, she had made it clear that she enjoyed taking chances, especially in regards to the idea of an open marriage, in striking contrast to Ebba, who couldn't countenance such actions, outside the more staid bourgeoisie union, which she had cultivated for so long with husband Tomas. <br><br>What can we conclude from Ebba's actions? Some internet posters have suggested that she is now intent on abandoning her family. As they walk down the road, she asks Mats to hold her daughter. Did she 'overreact' about the bus driver, since the woman who approved of open marriage, didn't feel at all in danger and remained on the bus? Quite possibly. An earlier scene, in which Ebba abandons the family on the ski slope, would also suggest that she's ready to call it quits with Tomas. As for the intrepid husband, when he admits that he smokes to the boy while walking down the road, it's clear that he no longer puts on any pretenses as to who he is.<br><br>'Force Majeure' falls under the appellation of the 'interesting' film. There's much food for thought here as one attempts to decipher the film's underlying meaning. The film's weakness is the lack of judicious editing, causing it to often move along at a glacial pace. I could have done without some of the long-winded visuals as their presence was detrimental to the narrative's overall fluidity.","user":"Turfseer","rank":[78,102]},{"title":"Family Vacation without Walley World","rating":8,"date":"1 November 2014","review":"Greetings again from the darkness. No one has sung the words \"I'm a MAN\" better than the great Muddy Waters, but even he would have been unable to bounce back from the ramifications of the split-second reaction of Tomas when things go awry at lunch.<br><br>Writer/director Ruben Ostland delivers an intriguing and thought-provoking look at gender roles and the definition and expectations of masculinity, especially within a family. What makes a real man? What is a hero? Is our predilection of survivalist or protector hard-wired into our DNA? And what happens to a relationship when the foundation of respect crumbles? Would you believe this film tackles these emotional issues, and does so in such a brilliant manner, that we often find ourselves chuckling (albeit with a tinge of guilt)?<br><br>A family vacation in the French Alps takes a turn when, while lunching on a veranda overlooking the ski slopes, a controlled avalanche goes wrong and the café is threatened. Tomas (Johannes Bah Kuhnke) grabs his phone and goes scurrying for protection, while his wife Ebba (Lisa Loven Kongsli) covers the kids and calls for his help. Both are instinctive reactions, and while one recalls George in a \"Seinfeld\" episode, the other is more in line with what we expect from a parent.<br><br>While the avalanche turns out harmless and the family members are physically fine, the emotional shockwaves of Tomas' actions reverberate through the family ... and even through another couple (Kristofer Hivju, Fanni Metelius). There is a exceptional dinner scene with the two couples which brings the issue to a head, and it's excruciatingly painful and funny to witness. It's terrific story telling and filmmaking and acting.<br><br>This is Sweden's submission for Best Foreign Language Oscar, and it must be considered a favorite so far. Though I'm not a huge fan of the final 15 minutes, that doesn't take away from the questions as the characters try to come to grips with the situation. Really nice contrasts between dark humor, disappointment and broken trust.","user":"ferguson-6","rank":[72,100]}]