[{"title":"Incredibly boring","rating":1,"date":"15 February 2015","review":"There might be admittedly a deeper message in this movie - but the way it is presented (cover etc) one might wait for an action/war movie.<br><br>Instead your getting a discussion between two very dull characters sitting in a container, watching a video screen - in feature length. Under pretense of coolness the actors try (and fail) to transport any kind of feeling/reaction.<br><br>No action whatsoever, this seems to be some kind of no-budget movie which isn't even very ambitious. The storyline is so predictable that one could stop watching after 10 minutes without missing anything.<br><br>If I had watched this in cinema, I would have left after half an hour.","user":"brunnengustel","rank":[9,12]},{"title":"Engrossing, Disturbing, & Makes You Think","rating":7,"date":"16 July 2014","review":"This is the first movie I've seen, or even heard about, that focuses entirely on military drone operators and their distant targets. Yes, there are lots of contrivances and manipulations, as well as misogynistic tones to the film, but I thought the filmmakers maintained a good deal of tension throughout and there are plenty of twists and turns here.<br><br>I don't know if there is a specific agenda here or what the exact rules-of- engagement are for military drone strikes, but as noted by two reviewers before me on this site, the movie made me think as the drama unfolded and various concepts were presented on either side of the drone attacks, which I believe will be debated for many years to come.<br><br>Eloise Mumford stars as Lt. Sue Lawson, who's on her first day at her job as a military drone console operator, at Creech Air Force Base, in Nevada. She's the daughter of a 4 star general, a trained boxer, and was \"top stick\" at the Air Force Academy before a detached retina forced her out of the skies.<br><br>Matt O'Leary co-stars as Airman Jack Bowles, who's the more experienced of the two. He's the pilot at the drone controls, and has already had 23 successful \"target prosecutions\" over the past 11 months.<br><br>The movie is almost entirely focused on their one shift to track a suspected terrorist Mahmoud Kahlil, in Afghanistan, and eliminate him with a missile strike. With Kahlil's parent's home being surveilled, it becomes apparent that Kahlil should be joining them and other family members for his birthday.<br><br>However, as the tension mounts for a possible strike, a rift develops between Lt. Lawson and Airman Bowles which threatens the whole operation, despite direct orders from a supervising Colonel. As mentioned, this will lead to various dramatic twists and will escalate into a startling and disturbing ending.<br><br>In summary, I thought the director Rick Rosenthal, as well as writer Matt Whitten, maintained good pacing throughout as well as a strong sense of realism. I feel this film will be controversial for many, as it raises a number of questions about drone strikes currently being used by the military.","user":"larrys3","rank":[9,12]},{"title":"Excellent film. Intense and thought provoking. Deserves a much better rating.","rating":9,"date":"28 June 2014","review":"Not too many movies really make me think. This one did.<br><br>I don't know what motivated the people that made this film, but their work stuck me much deeper than I expected.<br><br>The main characters are two soldiers in a military installation where they are assigned to man a drone spy plane. They are searching for the \"enemy\" and when they find one the drone is equipped with weapons to \"take them out.\" That's their job; find 'em and kill 'em. All with the push of a button.<br><br>Causing collateral damage (killing innocent civilians) is supposed to be just another part of the job. After all, the good outweighs the bad because the people they kill, will themselves kill even more innocents - think 911 - if they're not stopped.<br><br>This is a new form of warfare. In the \"old days\" you just dropped a bomb from the sky and never saw the people you incinerated. But now, super high definition cameras display the faces of the people you are about to turn into human hamburger on your computer monitor; up close and personal.<br><br>The drone team think they have spotted a super enemy. A high ranking member of the Al-Qaeda that is a must kill. There's only one problem: there are a house full of innocents at the same location. This includes women and children; even a baby.<br><br>Conscience begins to surface. Do they kill a dozen innocents to get this one enemy, or not? Think about what you know of Nazi soldiers who explained their actions by saying they were \"just following orders.\"<br><br>The find and kill operation takes two people to complete. One cannot fire the kill shot without the other being in compliance. Listen to the kill or don't kill conversation between our two soldiers. Ask yourself the same questions that they ask. What would you do?<br><br>Don't get me wrong. I support the military. I am grateful for the men and women that have made the decision to; if necessary, lay down their lives to defend and protect this country. That means your life, my life, and the lives of all the people we know and love. Many heroic men and women have already laid down their lives in the service of their country. They deserve to be honored, they deserve our respect, they deserve our gratitude. They have mine.<br><br>But this film raises moral questions about how we fight Al-Qaeda that did not exist when we fought our enemies of the past. Push button warfare. How much \"collateral damage\" is acceptable? Is it acceptable at all? Is there a point of depreciating returns where we become as bad; or even worse than our enemies? <br><br>Take a look at the IMDb listing of the \"stars\" of this film. See who is ranked first, second and third. There is a reason for it.","user":"captaincastile","rank":[23,40]}]