[{"title":"The Cabin Fever series are in order from best to worse.","rating":4,"date":"31 March 2016","review":"I watched this gore-fest with little expectations after the second Cabin Fever. Even with low expectations, I was disappointed.<br><br>The plot is thin, the pace is slow, the horror is limited, the characters are not interesting and most of what happens makes little to no sense once you have accepted that the disease is real. The virus reacts so differently from a person to another that it's just ridiculous how one victim gets Deadly sick within a few minutes while others take hours before having serious symptoms. The security issues around a facility of that nature are laughable at best and the people working there seem to be hired on a good-looks basis only.<br><br>Sean Astin is good, but his part is small and his lines are cliché.<br><br>I also had an issue with the most gruesome action scenes where I had a hard time understanding what was happening. As it's often the case in many movies, the quick cut from an angle to another to prevent us from noticing how low budget some FX are makes it difficult to comprehend what they are really doing. Lighting in some scenes is horrible too.<br><br>It's still enjoyable for some horrific scenes, but overall, this is not a good movie.<br><br>Cabin fever 2 was equally bad. Cabin Fever (the original movie) was campy and kind of good, even though it was by no standards great.","user":"terrylaterreur","rank":[5,5]},{"title":"Definitely no cult classic.","rating":6,"date":"4 September 2014","review":"'CABIN FEVER: PATIENT ZERO': Three Stars (Out of Five)<br><br>Prequel to the first two 'CABIN FEVER' films, revolving around how the gruesome virus originally broke out. It was directed by Kaare Andrews (who previously helmed the 2010 horror flick 'ALTITUDE' and a segment of the 2012 anthology thriller 'THE ABCS OF DEATH') and written by Jake Wade Wall. The movie stars Sean Astin, Mitch Ryan, Jillian Murray, Brando Eaton, Ryan Donowho, Claudette Lali and Currie Graham. It delivers the same over-the-top gore and claustrophobic suspense, as the first two films, but not nearly as much of the dark and witty humor; that made the original movie such a cult classic.<br><br>Astin plays Porter; the sole survivor of a deadly flesh eating virus, which kills all the other residents on a remote island. A scientist named Dr. Edwards (Graham) captures Porter and keeps him in a lab, while his research team tries to create a vaccine. After months of being held captive Porter becomes obsessed with breaking out. He causes a lockdown, by spreading the virus to others in the lab. At the same time four friends, celebrating a bachelor party, arrive at the island on a boat.<br><br>Eli Roth's original film is a horror movie classic! Ti West's sequel did a pretty good job of continuing the franchise in possibly an even grosser and more disgusting way. This prequel has plenty of grotesque gore, and is somewhat scary, but it lacks the clever wit and nasty thrills that made the first two movies much more memorable (especially Roth's original). Astin is good in this installment and the directing is decent but it's definitely no cult classic.<br><br>Watch our movie review show 'MOVIE TALK' at: http://youtu.be/YxrE7gt2K3g","user":"Hellmant","rank":[5,5]},{"title":"By the end, my patience was zero.","rating":4,"date":"8 June 2015","review":"I blind bought Cabin Fever 3, reasoning that it couldn't possibly be worse than part 2; I was correct in my assumption—it's EQUALLY as bad.<br><br>Part three of Eli Roth's flesh-melting horror series takes place in the Dominican Republic where Marcus (Mitch Ryan) is due to marry his fiancé, but not before his brother Josh (Brando Eaton), long-time pal Dobbs (Ryan Donowho), and Josh's girlfriend Penny (stunning brunette Jillian Murray, who provides the gratuitous nudity) have given him a proper bachelor's send-off. Chartering a cruiser, they whisk Marcus off to a remote island for a night of copious amounts of beer and weed, but the party atmosphere doesn't last long: after a swim in the warm tropical waters, Penny and Josh contract a flesh-eating virus that requires serious medical attention, and so Marcus and Dobbs go looking for help at a nearby complex, where they discover the origin of the deadly virus.<br><br>When Josh gives oral sex to Penny, unaware of the severity of her condition, and emerges looking like he's been in a serious road traffic accident, Cabin Fever 3 looks set to be an enjoyable dose of messy horror in the worst possible taste; but as night falls on the island, the film rapidly devolves into a largely forgettable slice of straight to DVD fodder, made all the more lacklustre by some very dark cinematography. Even the film's most outrageous scene—a fight between putrefying Penny and an equally gloopy nurse that culminates in death by giant rubber dildo—proves rather disappointing thanks to a lack of decent lighting.<br><br>Co-starring Sean Astin as the titular 'patient zero', the carrier of the disease, who tries to hide his shame behind a beard.","user":"BA_Harrison","rank":[10,12]}]