[{"title":"A Funny Feel Good Movie","rating":28,"date":"28 November 2014","review":"Frankly Melissa is laughing all the way to the bank. I thought the movie was funny in places poignant in others. I would see it again easily. With all the phony, pretentious movie making, this to me just looked like fun. Fun to watch and I bet it was fun to make.<br><br>Tammy starts out a minimum wage, screw up. I have seen Adam Sandler do comedy in the same vein. He is brilliant at it and so is she. Then it progresses and deals with a woman who is forced to face her issues and grow up. So there was a recovery sense to it, and for the drunken Susan Sarandon too. It was very funny and human. I love Kathy Bates, and was happy to see her in it also.<br><br>So don't watch if you don't want to, but I loved it. I giggled and felt for a lost person, who starts to gain insight. All of the negative reviews really are people's opinion. Mine is I loved it!! Also it cost 2om to make and grossed 84m. She got a cut, so I am sure she loved it too...<br><br>Take your negativity elsewhere, I would watch anything she did.","user":"trishmink0220-297-124800","rank":[14,16]},{"title":"Terrible","rating":1,"date":"2 July 2014","review":"Tammy features Melissa McCarthey as herself or so it seems. The idea that we must buy into this woman gorging herself with Cheetos and Doritos for the entire length of a feature film is utter torture. Tammy just limps into gear, act after act, it feels like the same joke over and over again. We get it, McCarthey is overweight and has a foul mouth, we knew it in Bridesmaids, we knew it in The Heat, and we knew it very well in Identity Theft. Why should we care to see it again in a film that is, quite honestly, one of the worst films I've seen all year? The answer is, we shouldn't. Tammy boasts a pretty good cast from Susan Surrandon to Kathy Bates and Toni Collette, it has all the ingredients to make a pretty good film...except its not. Tammy is a terrible film that keeps us in first gear and never moves and feels three hours longer than it actually is. The jokes are stale, the acting is wooden and the plot is so ridiculous and unfunny, I'm surprised they didn't make it a family drama. On my long list of problems with this film, my number one is McCarthey. Now, I personally have enjoyed McCarthey over the last 4 years, a couple funny movies and a great sitcom, she is usually good. However, her performance as Tammy is stale and boring. One thing in particular that really sets me off is the fact that Tammy is portrayed as a complete pig yet she lives in a decent place that is CLEAN??? I just don't get it. Susan Surrandon is wooden, over playing the typical grandmother saying outrageous things all while teaching her grand babies something special and witty. It doesn't happen here. Quite frankly, Tammy is like a long and drawn out trailer park adventure that teases an exit while you're on the verge of insanity with every second that passes. Overall, stay far far away from this film, it isn't even worth a rental. Even if you are madly in love with McCarthey and you love her humor, you will still hate this film.","user":"trublu215","rank":[195,293]},{"title":"Such a Letdown","rating":2,"date":"8 July 2014","review":"A great cast could not overcome a dull script. Random, ill developed characters popping in and out of a storyline that was all over the place. If we laughed more than a couple of times I'd be surprised. I guess you could call it a drama-dy but it fails at either. A silent theater during a Melissa McCarthy comedy? Say it ain't so! Oh wait...we did laugh .... At my husband groaning about how awful it was. Sad because I was looking forward to this one. I give it 2 rather than 1 just because it wasn't the worst movie I've ever seen, but I would advise waiting for an out of theater option if you feel you must see this because you love Melissa. It's pretty disappointing.","user":"drhall123","rank":[50,74]}]