[{"title":"Like Cabin in the Woods, only not","rating":2,"date":"17 October 2015","review":"Well, that was interesting. The very first moments looked decent, with a somewhat retro look. But as soon as the characters open their mouth you realize you're in for a treat. Sound editing is terrible, you can't hear half of the lines, and the other half is people telling each other to shut up or chill out (duude). Dialogues are below 5 years old writing. Camera work is atrocious, some of the very few thrills in this bore-fest are courtesy of the cameraman struggling with focus. And losing miserably. The editing is lame. I just began to mentally trim the footage to accelerate the pacing, leaving behind minutes and minutes of awkward silent people blank staring, panting and gasping, looking around, while I was waiting for a line or a reaction to happen. My god... Then acting. Tell me about it. 'Great acting' someone said, holy cow... They are abysmal, all of 'em, with a special award for the guy in a yellow t-shirt (sluggishly dragging around like he hadn't any idea what he was doing) and the biker chief (desperately trying to be cool in a Samurai Cop wig). Storywise, it's a mess. Girl gets missing (we couldn't care less about her, 3 minutes screen time), friends freak out (kinda) and try to find her, they stumble upon drug courier bikers, they argue, they escape, they find refuge in a ghost town, the bikers follow them, cannibal creepy inbred people, almost everybody dies by stupidity. There is no tension whatsoever! The pacing is all off, slow and helpless, the bikers are not menacing, the 'eaters' could have been a redeeming point for the movie if there was any attention to details, maybe even some self aware irony (we're playing with 50 years old tropes, guys). The plot doesn't progress, it percolates like garbage juice. Even the gore is missing!<br><br>Maybe they tried, maybe it was a joke. What remains is a mess of a movie, some occasional funny-bad moment (the screaming scene, as previously noted by other reviewers: hilarious) and lots of boredom and frustration. I somehow sat through all of it, but I don't recommend this experience to anyone.","user":"leliomulas-26583","rank":[15,16]},{"title":"Pretty Darn Bad","rating":2,"date":"29 October 2015","review":"I'm going to keep this simple: This is NOT a good movie.<br><br>I'm not going to put any spoilers in here, because everyone else kinda did that. I'm not going to explain the characters or the story line, because others have done it, and there isn't really much to explain. But here's my take on it:<br><br>The story is bad, the camera work looks like someone shot it with an iPhone, the script seems like it's mostly ad lib, there is next to no gore at all (at least for a movie this bad, you would think that it would be heavy on the gore), the acting is HORRID, the characters are vastly underdeveloped, the interactions make no sense, the movie itself drags for the first half hour, and then when it picks up it is almost comical, there is NOTHING believable about this film--it's just a flat out mess.<br><br>I didn't give this a 1 because I've seen a LOT of bad movies in my day, especially of the horror genre. However, this movie didn't get a 1 out out of 10 simply because I've seen worse movies to compare it to, not because it wasn't really bad.<br><br>Read the other reviews, and compile them all into one. Everyone is telling the truth all at the same time, trust me. If you like rustic independent films shot by film students, then this is right up your alley. If for some reason you want to see a really good horror film, either just because you like horror films or because you want to kick Halloween off with a bang, don't waste your time.","user":"baroby","rank":[9,9]},{"title":"I've Got Heartburn...REAL BAD","rating":1,"date":"6 October 2015","review":"A group of idiots (driving a nice looking 1965 Mustang) stop at a rest area in the middle of nowhere to use the facilities. One girl turns up missing and her friends are off to find her whereabouts. Oh, I \"forgot\" the ruthless motorcycle gang (which consisted of four horribly miscast individuals) that was at the rest area, but I digress. Such is the premise for \"Eaters.\" <br><br>When the movie started, I thought it MIGHT be decent...and then the actors spoke. I swear the majority of the cast in this joke could not walk and chew gum at the same time. None were believable. Not only were the actors awful, but so was the directing. When they reach the \"abandoned\" town while in search of their friend, they (naturally) decide to split up. The loud mouth, who you want to immediately die, comes upon something in a barn. Cut to two of his friends standing on a porch, both looking like they've just been hit in the head with a brick. You can plainly hear screams coming from the barn, but they completely are oblivious to this and decide they must go looking for him. Are they both deaf? Feeble-minded? <br><br>The surprise is there's some sort of clan who inhabit them thar parts and (I guess) eat people for s*its and giggles. But their introduction into the film is nothing short of comedy. The masks they wear only elicited howls from me and my friend. <br><br>I usually complain about the overuse of blood and gore in these types of movies. This one spared me on that level; however, I'm beginning to think it could have only helped.<br><br>Rated R for RIDICULOUSLY AWFUL.","user":"dcarsonhagy","rank":[28,33]}]