[{"title":"might be the worst movie ever","rating":1,"date":"10 August 2015","review":"This movie is so bad. They changed the name to the orphanage and it's just horrible. I felt like I was watching a junior college project filmed in a dorm. Nothing good about this movie at all. I feel like the name was changed so that people might accidentally rent it thinking it's the horror classic of the same name. I wish I could have that 97 minutes of my life back. The camera work was weird, The acting was weird, The dialogue was weird. This review might be weird but the movie was such a train wreck it made me feel weird. What were the film makers thinking? Were they high or are they retarded? I fee that they might be all three. I feel bad for the kid who starred in this rubbish.","user":"a-gunslinger","rank":[18,23]},{"title":"Amateurish, Brutal and Pointless Drama","rating":2,"date":"28 June 2016","review":"The eleven year-old boy Nathan Perry (Christian Goodwin) is beloved by his parents that are going to give a dog for him. However his family is destroyed in a car accident when his parents die and the boy is sent to the custody of Milwood, an orphanage managed by Mr. Clemens (Jimmy Scanlon). The boy is treated with love by the social assistant Judy (Michelle Romano), but abused by Mr. Clemens. When Nathan is bullied by other boys, Mr. Clemens sends him to the feared Ward B and the mean Katherine Rizzo (Tiffany Shepis) becomes his tutor and he has medical assistance from the weird Doctor Charles (Don Tempesta). While snooping around the Ward B, Nathan discloses a dreadful secret. What have him discovered?<br><br>\"Milwood\" is an amateurish, brutal and pointless drama. The plot is confused and it is never clear the motives of Mr. Clemens and Doctor Charles: are they simply deranged sadists with their experiments or do they sell organs? The cinematography, lighting and edition are awful. The histrionic Jimmy Scanlon has a ham performance and only Christian Goodwin has an excellent performance. Michelle Romano has a nice character and also a good performance. The government sends the boys to the custody of Milwood, but there is no audits, in a very strange behavior. The marketing of this drama is completely wrong and viewers believe it is a horror film. My vote is two.<br><br>Title (Brazil): \"Orfanato\" (\"Orphanage\")","user":"claudio_carvalho","rank":[8,10]},{"title":"Nothing supernatural, and downright depressing","rating":1,"date":"17 June 2016","review":"First, this is also released as 'The Institute' and the description refers to a building 'said to be haunted' and the 'evil spirits live in the walls'. Unless this is referring to the staff there (with the exception of one), then that is one hundred percent false advertising. There is *nothing* supernatural about this *whatsoever*.<br><br>Second, this is downright depressing. It is the story of a child admitted to an orphanage after his parents are killed, then is mistreated in said orphanage. Lovely.<br><br>Don't bother watching this, whatsoever. Find a good horror movie. There's plenty out there.","user":"oscarlupton-96485","rank":[2,2]}]