[{"title":"Entertaining, leaves you promising never to go to L.A.","rating":6,"date":"8 September 2013","review":"If you ever wondered what L.A. parties with rockstars and aspiring rockstars are like this movie answers all your burning questions. <br><br>1. Soooo much vomit, really, lots of different types, textures and from different positions. But only the guys seemed to do it, apparently girls can hold our booze and drugs better.<br><br>2. Hipbones - at least these made up for all the times I had to watch a guy puking.<br><br>3. Douchey-ness is not limited to Bros. L.A. scenesters can be douches too, at least they are more entertaining to look at.<br><br>4. Why does the cover art have 3 girls in bikinis and who are they? Much better to have put the bandmembers in the art. Or at least just the hipbones with no faces.<br><br>On a serious note - it's a decent low budget flick. The writing is consistent, the dialogue believable as are the characters. There were some actual funny antics to laugh at. I have paid to see much worse in movie theaters.","user":"paula-ashton-328-733172","rank":[24,46]},{"title":"I DON'T REMEMBER THE LAST THING I REMEMBER","rating":6,"date":"6 July 2018","review":"If you read the DVD cover you will immediately think about \"Hangover.\" Unfortunately the script writing lacks the cleverness and cohesiveness of a \"Hangover\" script. The film is about a British band that try to piece together the events of the previous night in a haphazard fashion. Eddie (Scott Rosa) is the voice of reason and songwriter for the group. Chas (Michael Graziadei) is the drummer who does more drugs than is humanly possible, even for Keith Richards. Toss (Flood Reed) is a crude unlikeable guitarist who's only goal is to use women. Gunther (John Joyce) is the fourth member of the band. The writers ignored him for much of the film. They wake up to a trashed house and a dead guy in the pool. All the action takes place at this one residence.<br><br>There are some funny scenes and lines, but over all the movie lacked any type of rhythm. Chas resembled Zach Galifianakis which was a plus, but the added two characters of Toss and Gunther did more to hinder the story than add to it. The band girls were underutilized. The film has a certain amount of crudeness as expected for this genre, with a few scenes being more crude than funny.<br><br>Watching a bunch of guys play beer pong is boring. It is an acceptable young adult romp rental at best. Good for a few laughs.<br><br>Parental Guide: F-bomb, sex, nudity","user":"nogodnomasters","rank":[0,0]},{"title":"The Blackout is worth the watch","rating":10,"date":"28 September 2013","review":"This movie provides a peak at some major up &amp; coming talent. I found the dialogue and humor to be impressive considering the budget involved. I would recommend giving it a view and watch some of these names show up more often in various roles because I saw a lot of range. I felt at first that I was to watch a horrific reboot of The Hangover, but it was instead surprisingly unique and refreshingly comedic from the typical type of comedy we've been force fed for years. Once you allow the characters to settle in, the movie takes off and your treated to impressive writing and witty humor. I thoroughly enjoyed and it reminded me where great talent starts.","user":"gray-1218","rank":[11,46]}]