[{"title":"Sucky Film","rating":1,"date":"7 December 2018","review":"It's a ridiculous movie. Poor acting, boring, no real plot.","user":"sampaioana","rank":[5,5]},{"title":"Blood Ransom : This is how Vampire movies should be made","rating":10,"date":"3 November 2014","review":"A very dark, gritty and bloody take on the vampire mythos, Blood Ransom is one of my favorite in this genre. It's sexy and very violent, which is how these kinds of movies are supposed to be. In a generation where you only see watered down PG-13 vampire flicks, I this one stands out. The performances are quite good, especially Anne Curtis and Alexander Dreymon. They look so perfect together. There's something between them that makes them so believable as two people with eternal love for each other. I must also say that Anne Curtis is so perfect in this role. Her gaze, as everyone who have seen the movie said, is so stunning and hypnotizing. Caleb Hunt is also terrifying in his role. He is a very antagonist and really pumps up the tension. Director Francis Dela Torre succeeded in all levels in this film despite the budget constraints. I especially love the final shot of the film. Love seeing Crystal walking alone the deserted highway, feeling and enjoying the sun. That image was the best. Two Thumbs up!","user":"jaysonantipolo","rank":[6,21]},{"title":"A slow romp for me, but I like the vampire.","rating":8,"date":"4 November 2014","review":"A good vampire concept that was a little too poetic and I got lost in some of the subtly of the film. On the surface the film is about a girl who gets kidnapped by the criminal friends of her limo driver, a man she has develop feelings for, but the event opens up a string of events when it turns out that the girl's value is as a vampire who will become full fledged once she kills the driver. It's very romantic for a vampire movie. This is were I get lost. Thought the plot is interesting, it past by to slowly for my taste. <br><br>Of course this could have just been a promotional fault as they used the kidnapping to attract audiences. <br><br>I though the special effects were cool. The blood viens on the vamps pop out whenever they are ready to feed. the movie also had these moments of after violence, were instead of showing us what happen they showed us after the fact which I thought was more hunting.<br><br>Overall, it's an interesting addiction to the vampire genre, but not my fav.","user":"bbickley13-921-58664","rank":[5,19]}]