[{"title":"Never Drive During a Tornado Watch","rating":8,"date":"15 September 2012","review":"A mother and her three daughters are going on a weekend trip when they soon find themselves caught in the middle of a storm. A tornado heads directly for their car so they seek shelter in an abandoned wine cellar. They discover they are trapped and whoever owns the house wants to keep it that way. Within the shadows something begins to stir. They are not alone in the darkness...<br><br>I give it a B- because although predictable, it offers good acting and the feeling of claustrophobia. The characters are also likable and more three dimensional then cereal box creature features. The creatures themselves wouldn't make a five year old wet their pants, but it's the idea that suppose to be scary. Check this movie out if you are a horror fan. It's at least entertaining.","user":"adam-1894","rank":[15,21]},{"title":"Interesting idea, poorly executed.","rating":3,"date":"29 June 2012","review":"Nailbiter draws on the venerable \"small town with a secret\" sub genre of situational horror. Not a bad way to go. In this instance a mother who is a recovering alcoholic drives to KC with her three teen-aged daughters to meet their father on his way back from overseas deployment. Waylaid by a tornado in their path, they seek refuge in cellar of a seemingly abandoned farmhouse.<br><br>Of course neither the farmhouse nor the cellar are really empty, as the women come to learn.<br><br>Directer Patrick Rea fumbles around the obviously low budget, using shots that serve to emphasize just how low the budget must have been. When the \"bear\" does appear, it's given short shrift (although already a horror film cliché, Rea might have done better to use speeded up motion for the haunter rather than a bit of face here or a clawed hand there). The girls manage to McGuyver their way out of the cellar in ways that couldn't be more predictable--not to mention just plain silly (who else is tired of seeing people fire nail guns like rifles, ignoring the fact that as a safety feature their barrels must press against whatever is being nailed to prevent injury?).<br><br>The rest of the script is just pro-forma bits of horror/suspense tropes put in just because.... Why is the mother an alcoholic? Why take the time to depict her in an AA meeting? The answer may seem apparent nearer to the end, but it isn't, not really.<br><br>All in all Nailbiter feels like a very first film the director wasn't particularly passionate about. It could have very good, very suspenseful if shot with greater care.","user":"amkatz","rank":[15,23]},{"title":"Just Plain Stupid","rating":2,"date":"6 July 2012","review":"Where do I begin. A woman is at an A.A. meeting talking about four months of sobriety and how she is waiting for her soldier husband to return from overseas. Next up is continuous TV and radio headlines warning of the tornadoes heading towards Kansas. So what does recovering mom do; take a drink; no, I wish she would have. Instead she gathers up her three high school age children for a ride to the airport, right into the storm of the century. While piloting the family Subaru Wagon, they encounter a hail storm. The former drinker looks in the mirror and screams at the tunnel of wind headed toward them. They run from the car to the closest house, and when no one answers their calls for help, they break into a cellar. The winds knocks a tree down over the entrance and they are trapped. The youngest daughter tries to squeeze through a small window and is bitten by a strange creature. The wound looks like pellet holes in her arm. A lot of screaming and bad acting follows. A local cops mother lives in the house and she looks a lot like Barbara Bush; it's the only unintentional comic relief. She has somehow begat some kind of Alien like offspring which terrorize the mom and three girls throughout Nailbiter. It is simply awful. Avoid this turkey like the plague.","user":"billcr12","rank":[24,42]}]