[{"title":"I want my money back!!","rating":1,"date":"13 May 2015","review":"I have to agree, this has been the worst movie I have ever watched, albeit only for 30 minutes. I also agree how long does the camera need to be on hair &amp; tweezers? the camera appears to be pitched on someone's shoulders, bumping, jerking.....and the acting!!!! well that has to be the worst I have ever seen. The story jumps all over the place, from one scene to the next not making and sense. I watched this on the basis of the first review, and let me tell you it will be my last time I read a review without reading all the others as well. Then I cant/wont blame anyone else but myself. I must admit, I will give it another go tonight.......I'll start from the beginning.....but I doubt I will get through it. I give the movie a 1.......only because there was no zero.","user":"marychapman-73035","rank":[9,10]},{"title":"Pass on this one","rating":1,"date":"16 May 2015","review":"I gave it a chance &amp; watched it all. It's time wasted that I can't ever get back. The actress who played the victim needs some more acting classes. The male hoods, there's no help for them, really they need lots of help to make it past these low budget films. What was up with the sex paraphernalia at the beginning, it wasn't explained anywhere. The gun shots were worse sounding than a starter pistol. When the car hit the tree it was daylight then he next shot of it was when it was night. What happened to the escapees that was mentioned near the start? I could go on but this film wasted too much of my time so I won't waste yours.","user":"Caledan","rank":[7,8]},{"title":"Absolutely horrendous, don't waste your time","rating":1,"date":"6 July 2015","review":"I would have given this movie zero stars if possible, do not waste your time. I am a huge supporter of independent and low budget films but this was seriously bad even for the genre. The acting was extremely sad and most of the time over the top and just plain awful, the best acting was done by the strip club security guard who had no lines. I am not sure if this was meant to be a revenge film or just another bad people do bad things kind of film but either way the plot and storyline (or lack of both) made no sense whatsoever. I could go on and on about how bad this movie is and from reading other reviews the majority feel the same way, so unless you are trying to punish yourself avoid watching this film at all costs.","user":"dougomjr","rank":[4,4]}]