[{"title":"The many facets of promises","rating":8,"date":"19 April 2014","review":"A PROMISE is an exquisitely beautiful very quiet film based on Stefan Zweig's novel 'Journey Into The Past', sensitively transformed into a screenplay by writer/director Patrice Laconte (Monsieur Hire, The Hairdresser's Husband, The Widow of Saint-Pierre, Intimate Strangers etc) and co-writer Jérôme Tonnerre (Intimate Strangers, Un Coeur en Hiver, My Father's Glory etc). The story is enhanced in the film version so well because of the cast of fine actors and because of the atmospheric, very important musical score by Gabriel Yared.<br><br>Staying very close to Zweig's novel, the story is set in Germany just before WWI and is centered on a married woman who falls in love with her husband's protégé. Separated first by duties and then by the war, they pledge their devotion to one another. Young Friederich Zeitz Richard Madden) has humble origins, but rises to the attention of his new boss, Karl Hoffmeister (Alan Rickman). Karl is aging and suffers from severe heart disease and his impression of Friederich's brilliance grows steadily. As he volunteers to tutor his employer's son Otto (Toby Murray), he gets more and more attached to Karl's young wife Lotte (Rebecca Hall). She refuses however to betray her husband even when they learn Friedrich must go to Mexico for two years to supervise a mining project for Karl. Friedrich and Lotte swear one another they will stay true to each other, but the oncoming war keeps them apart for far longer than expected. After six years, Friedrich goes back to Germany and finally sweeps Lotte off her feet.<br><br>Rickman, Hall and Madden deliver perfectly crafted performances, each revealing the difficulty of keeping a promise when personal needs are not being fulfilled. It is a pleasure to see a romance bloom, pause and then grow into a full bouquet as time and circumstances change. The impact of the period of pre-WW I Germany, then Germany at war and losing, and the gloom of silence after the war is over is underlined splendidly by Eduardo Serra's cinematography and Yared's Beethoven-infused score. This is a period piece, finely crafted by Patrice Laconte. Its mood lingers in the mind long after the film is over.","user":"gradyharp","rank":[59,72]},{"title":"A Melodramatic Affair","rating":5,"date":"3 May 2014","review":"It is probably a matter of personal taste when watching a story of forbidden love as to how it is portrayed. There have been many that have gone before \"A Promise\" that have moved readers and audiences alike. Frankly, it's old tale of elderly man, young wife, and introduction of handsome contender who falls for the forbidden fruit. As much as I like Alan Rickman, I found this movie to be a slow-moving tale lacking the passion I hoped to encounter.<br><br>Alan plays the elderly owner of a foundry, Karl Hoffmeister, with an ailing heart. Enters Friedrich Zeitz, who he takes under his wing as his protégé. It's apparent from the beginning he is grooming the young, intelligent man to take over his business. Early in their relationship, he discloses the secret that he is not well.<br><br>As he methodically allows the young handsome Friedrich to enter his home and take up residence, you gain the sense that he has purposely brought him close to his wife to encourage something more. Perhaps, it is the love of an older, dying man for his young wife to make sure her needs are met after his demise. Little did he know, that having done so, he finds himself brokenhearted over the outcome when she falls in love with Friedrich.<br><br>Rebecca Hall plays the proper wife, though slightly dull. Richard Madden plays the protégé, who is immediately attracted to Heir Hoffmeister's wife. He turns into a sappy, slightly obsessive worshiper of young Charlotte. In one scene he smells her scent and kisses the keys of the piano that she has played, as if he's making love to it. Of course, that is countered later in the movie with Charlotte sniffing the pillow of his empty bed.<br><br>The two are thrown together due to Heir Hoffmeister's ill health attending the opera and other activities. It's a silent game between the two, as they both play with fire, but fail to acknowledge their feelings for one another for some time. It's not until Hoffmeister reaches the stage of jealousy, that he sends off his rival to Mexico on business for two years. Then, the floodgates of words of undying love burst forth between the two, as well as the \"promise\" to wait for one another.<br><br>The movie is set in pre-WWI Germany. When war ensues, it keeps them apart far longer than either anticipated. After the death of her husband, and many years of receiving no word, Friedrich returns after the war. Charlotte who has been sorrowfully smitten and pining for her sweetheart meets him once again. Instead of the passionate reunion you anticipate, it turns into a polite cup of tea like two friends making up for lost time. He is aloof and cold, she is polite and proper. In fact, he confesses he's not married but has been with other women. She fluffs it off as inconsequential. It's not until the end scene they finally kiss. Where's the tears? Where's the passion? Where is the joy of seeing one another again? Obviously, six years has cooled them off. It's an odd, emotionless reunion.<br><br>The more I think about why this movie doesn't have the effect is should, is that the two main characters, Charlotte and Friedrich, never really take the viewers to the point of falling in love with them. Friedrich is sullen, moody, and intense. He surely didn't make me want to swoon and commit adultery. Charlotte's character, though quite innocent in the beginning, doesn't really portray why she is so unhappy with her husband that she should be tempted to stray. Because I never bonded with the characters, except for Herr Hoffmeister, it wasn't an exciting, moving, heart-throbbing love story that made me want to see the two live happily ever after. Even though it is based off a novel written by Stefan Zweig's \"Journey into the Past,\" it comes across as a worn-out plot that is missing important elements of passion to make it memorable.<br><br>Of course, I love period movies, whether excellent or mediocre. Though for me this was more mediocre, you may find it your cup of tea.","user":"VickiHopkins","rank":[28,36]},{"title":"Good story material but not capitalized","rating":3,"date":"30 November 2014","review":"I watched this film and was anxious to see a period piece set in Germany pre WWI but it never quite got off the ground. There is no chemistry between the two lovers. The male lead is not somebody a wife would fall in love with even if he is there all the time. He had no personality. He does not make her laugh, is not all that great with the son and offers no sex appeal. Rickman offers the only acting spark. It would have been interesting to see more of what Germany was like leading up, during and after the defeat of the war. Would make for such wonderful material both in plot and theme. A feeble attempt was made to stir up the politico in a scene close to the end where there is an aggressive street demonstration with people wearing swastikas. The Nazi party did not come into existence at the time the film depicts (end of war 1918). The DAP which was the predecessor of the Nazi party came into being in 1919 but it was not known enough for a street demonstration in 1918 and not with Nazi swastikas. These are simple facts I found online. I would not have researched had there not been that street demonstration scene with swastikas. It was totally out of place for the rest of the film. There should have been more of these types of scenes as there were riots in Germany in 1916 because of shortages in fuel and food. The film totally missed the effects the war had on the German people. The kiss at the end was as passionless as the whole lifeless movie.","user":"diisdesigns10","rank":[29,42]}]