[{"title":"Half Coming of Age Film/ Half Horror Movie","rating":10,"date":"15 July 2012","review":"Found is a refreshing intelligently written horror movie with a prominent coming of age theme.<br><br>There is no delay in finding out that Marty's older brother is a serial killer. I quickly identified with the 12 year old's obsession with finding his family members' hidden secrets, like his mom's love notes from an ex-boyfriend, his dad's typical porn stash, and of course, his brother's non-typical rotating selection of heads in the closet.<br><br>The acting was incredible, and I often felt like I was intruding on private affairs as opposed to just watching a movie. Gavin Brown does an excellent job as Marty. He often provides narration through the movie, which felt more genuine than most voice-overs, with real emotion and no over-acting.<br><br>Most of the movie really is about the relationship between the two brothers, and the horror elements are provided by the movies within the movie. Of note is the one called \"Headless,\" which provides the older brother, Steve, with gruesome inspiration. Until the climax of Found, \"Headless\" is the part that will have you squirming in your seat.<br><br>And with the level of detail put into the special effects, you will squirm. The attention put into making everything realistic is evident. Right after seeing the premier, everyone was talking about particular scenes where the special effects really transmitted the feeling to the audience.<br><br>This is a story about the dynamic between older and younger brother, and how it changes as they get older, all wrapped up in a horror movie shell. The balance of drama, suspense, horror, and comedy, is perfect. It's the type of movie you'll find yourself still thinking about the next day.","user":"MzHartz","rank":[39,49]},{"title":"This movie does a lot of things very well","rating":6,"date":"7 January 2015","review":"Let me start by saying I respect the hell out of this movie. I had heard good things about this movie, and it seemed right up my alley, so my expectations were set mildly high. I thought the story, character development, writing, and lead kid were all great. There were a few scenes with actors that played small roles that were almost cringe worthy because they weren't very good actors. Luckily for the film, most of the scenes took place between the 12-year old boy and his brother. My overall feeling with this movie is that I enjoyed it, but I wish there was just a liiiiittle bit more in the budget for the smaller roles. If you can get around a few scenes with bad acting, it is worth a watch.","user":"Stephen_BU","rank":[11,12]},{"title":"Disturbing on an extreme level.","rating":8,"date":"28 September 2014","review":"I'm going to dive straight into a simple fact about this movie. It will mess with you. At the deep emotional level, this movie will be extremely disturbing to anyone that gives it a chance. This is the type of movie that will stick with you for days, if not weeks. You will be driving to work days after watching it, see a Family walking down the street and wonder what secrets and personal issues they have solely because of this movie. I watched this movie almost 3 weeks ago, and I still find myself disturbed by it. It's not due to gore however.<br><br>Although I am confident in saying that even self-proclaimed horror/slasher film buffs will find a few scenes within \"Found\" extremely hard to watch. The gore isn't overdone or even a focus of the movie at all. When it is done, it is done very very well and is very very disturbing. I never personally get grossed out by film gore. Ever. However in one scene in particular, I seriously paused the film and sat there by myself wondering if I even wanted to continue watching the movie at all. The scenes in which gore isn't involved at all are just as, if not more disturbing than the gory scenes. Watching a 12 year old boy having to face such horrific realizations, all the while dealing with being bullied and having absent parents is disturbing in and of itself. <br><br>The acting would be the only reason this film didn't receive a perfect score of 10 from me. As much as I loved this movie and wish this wasn't the case, the acting by the Father is horrible. Luckily for us he doesn't spend more than 2 minutes on screen at a time, and only has a few lines of dialogue throughout the movie. <br><br>To sum this up, I'm going to talk about the final 8 or so minutes of this movie(Without spoilers of course). The final 8 minutes of this movie is by far the single most disturbing piece of film I have ever seen, and hope to never see again. Don't get me wrong, I love this movie. The final scene is just... It's indescribably horrific and dark. I genuinely hope I don't watch a movie with a scene that dark in it again for as long as I live.<br><br>Go watch it, it's an amazing accomplishment in the World of film. However, consider this review a warning.","user":"lochnessx77-119-604937","rank":[31,40]}]