[{"title":"I'm a published author, and I loved it!","rating":10,"date":"4 April 2015","review":"Maybe I'm the exception, but having dealt with every one of these personality types in writer groups, I found this movie to be hilarious and therapeutic. <br><br>This movie is exactly why I don't tell my friends what I write. \"If she can do it, I can do it.\" <br><br>Then put in the work and prove it, jackass. <br><br>I have watched this movie twice already, on Netflix, and I will be buying a copy to watch on days when I need to be reminded to ignore the professional jealousy of those around me. Trust me, it's just not worth telling people what you write. Pen names are the way to go. <br><br>These are the characters, as I saw them, and as I know them to be in person: <br><br>1. One woman is a dim-witted, spoiled narcissist who barely makes time to write, yet she tells everyone she's a \"writer.\" She looks at pictures of herself while she does yoga, to get inspired.<br><br>2. Her husband, who doesn't actually write, but keeps a tape recorder handy so he can record his \"brilliant\" ideas, which are usually just character names that he finds clever, or half-baked plots. In other words, he's not a writer. The \"idea\" doesn't write the story, and is absolutely worthless unless you're fleshing it out in the book, and he is not. <br><br>3. A sweet guy who loves classic literature, like The Great Gatsby, and takes his own writing very seriously. He submits manuscripts to publishers and agents, and keeps all of his rejection letters on his wall. He admits at the beginning of the movie that he hasn't written in two weeks.<br><br>4. A narcissistic war veteran who idolizes Tom Clancy and thinks his manuscript is good enough to become a movie. Also, he holds a self-published book signing at a hardware store. (I know someone who threw her own self-published book signing at an IHOP.)<br><br>5. A guy who's in love with being a writer. It gives him an identity. But he's only written three pages of what he calls a manuscript, and instead of writing the rest of that book, he just revises those three pages again. <br><br>6. The girl who makes writing a priority, but hasn't read any of the classics, and hasn't gone to college. But she's the one who lands an agent, a book deal, and a movie deal. I've seen the movie twice and I'm fairly certain that she's the only character who doesn't trash anyone else's writing. <br><br>I understand why people who haven't belonged to a writers' group may find the movie boring, but it was the only piece of fiction I've ever seen that captured the delusional narcissism of a writers' group. <br><br>As soon as one person in the group gets successful, the claws come out. \"She doesn't deserve it.\" \"It's because she looks good in a miniskirt.\" \"\"I'm the better writer, it's not fair.\" <br><br>She also put in work, and put her writing first. It doesn't matter who you've read or what you've studied. If you don't finish your manuscript, you will not be successful. <br><br>I hate to say that writers are this unlikable in person, but we are. <br><br>I revised my review to say this -- I am both traditionally published, AND self-published. I read other reviews that thought the movie took digs at self-publishing, but I didn't see it that way. There ARE people just like John K. Butzin, who don't know how self-publishing really works, and get scammed as a result. His goal isn't to make a living with his book, but to see it on the big screen someday, and to \"get published.\" His character was the funniest and most realistic, to me. Although, on some level, it's incredibly sad, because guys like him actually exist. I watched this movie with a writer friend and Dennis Farina said many things that made us look at each other and mention names of people we knew. Again, it's actually sad, but it felt so good to laugh. <br><br>Ten bright, glowing stars from me.","user":"asleep_soon","rank":[14,16]},{"title":"It wasn't too bad","rating":6,"date":"1 February 2016","review":"I wasn't sure whether or not to give this one a go considering the current low rating (which was 4.4 when I wrote this review) but I must say I'm glad I did.<br><br>It's not the most amazing movie of all time or anything but it kept me entertained throughout it's running-time.<br><br>It feels like it was heavily inspired by the TV-series 'Modern Family' and Christopher Guest's filmography with a fake documentary approach having the characters talk straight to the camera occasionally about their lives and the other characters etc.<br><br>If you want to get technical some angles could simply not have been captured the way they were in the movie by a documentary-crew, with for instance multiple- angle close ups of characters sitting opposed to each other at a table but no camera-man in sight in any of the shots, but it doesn't take you out of the movie or anything.<br><br>As far as the movie goes it had a lot of funny moments with a stellar cast (good to see Chris Klein again) and even though the plot is hard to describe as it's not really a plot-based movie but merely about some odd characters with hopes of becoming successful writers (some odder than others) it does entertain and that's all I wanted from the movie.","user":"Seth_Rogue_One","rank":[5,5]},{"title":"Waste of time.","rating":3,"date":"4 May 2014","review":"Well I love everything literary, but I certainly didn't love this movie. As soon as I saw Kaley Cuoco of Big Bang fame I decided to watch it. I'm also a fan of Chis Klein but he fails to impress in this movie. Kaley appeared exactly the same as her ditzy character in Big Bang, I sincerely hope this is not her true personality and she is just being type cast which is a real shame. All the characters were overblown and farcical, I presume this was intentional. I found nothing funny about it, didn't laugh once and dare I say it, didn't even smile. What another waste of time and effort. How do they get the money to make these movies? Very disappointed yet again. The premise was interesting, but the heavy handed script writing ruined any chance of an enjoyable movie. Why do they insist on treating us the paying viewers as if we are dumb? Shame, shame, shame.","user":"brushwood11","rank":[23,33]}]