[{"title":"Say cheese!","rating":1,"date":"22 April 2015","review":"If you like soft porn (without the porn), this is the movie for you. Terrible acting, terrible script. Granted, not \"all\" of the acting was \"terrible\", but the acting that wasn't terrible, wasn't great. The acting that wasn't terrible might have been better with a better script and better directing. The plot was the only thing that this movie had going for it that even resembled something good. \"Great\" idea, extremely poor execution. With better acting, and something to work with, this might have been a good movie. With a couple of decent cameras, and a little extra money, I guess anyone can make a movie. Not saying I could do any better (never really tried), but if I couldn't do better than that, I wouldn't waste my time. I guess the up side is, at least \"they\" tried...or did they? Who knows, they may have gotten out of bed one morning and said \"Hey, let's make a movie\".","user":"mkauger","rank":[15,18]},{"title":"Third Thursday in a row","rating":4,"date":"17 January 2018","review":"Professor Bill Pollard (David Christian Welborn) teaches Biology 101 at Thatherton Community College. He is obsessed with an on-line cutie Dani Darling (Noelle DuBois, topless again) to the point he would rather fly solo with her than to fulfil his weekly Thursday night duty with his wife (Deborah O'Brien) a sound sleeper who doesn't realize Bill is gone all night until late in the film.<br><br>Then, in an unlikely scenario, \"Of all the gin joints in all the towns in all the world, she walks into mine.\" Yes Dani, now Marissa Weaver enrols in Pollard's class, a man she doesn't like as much in real life as the faceless perv who tips her gifts.<br><br>This had a made for TV feel to it with a plot that might appeal to the understanding wife type that appears in the film. Bill is the only person on the planet who hasn't mastered thinking of one person while making love to another. The production went into inane directions in a badly written script. I really liked Noelle DuBois in \"Night Vision\" where I thought she was really sexy. What really surprised me was that the gifts you tip the girls on-line they actually get. I would have assumed they would get the cash in a split with their sponsor.","user":"nogodnomasters","rank":[5,6]},{"title":"Kept me on the edge of my seat","rating":10,"date":"15 January 2014","review":"I got lucky and saw this in Phoenix. It was a great movie. I would highly recommend it. Can't wait for it to eventually come out on DVD or Redbox. <br><br>Community college science professor Bill (David Christian Welborn) has a loving wife, Diane (Deborah O'Brien), who desperately would like more intimate time with her often distracted husband. Bill couldn't be less interested, however, as he is obsessed with a webcam girl, Dani Darling. His busy days teaching and busier nights on the internet with Dani have left Bill unavailable to both his wife and teenage daughter, Hannah (Emily Bicks).<br><br>Things take a turn for the surreal, however, when a new student, Marissa (Noelle Dubois), joins Bill's class. She looks an awful lot like Dani Darling, and Bill finds himself in the unique position of having his fantasies fulfilled, such as finally meeting his obsession in person, and some new unexpected nightmares realized when it becomes clear how compromised a position he has put himself in.<br><br>Christopher Smith's Biology 101 is a challenging film to embrace. It'd be one thing if Bill had simply made a mistake and gotten caught up in a sexual obsession to deal with the other problems he has in his life, and that very well could be the case, but he also shows signs of anger and violence that, while maybe not entirely realized, paint him far more in the deviant, potentially psychopathic, camp. Which, you know, is hard to sympathize with as a main character. Not only has he brought everything on himself, but he's been a real creep along the way.<br><br>Other characters in the film, however, are easy to get behind. Bill's wife Diane is not some vindictive beast making Bill's life miserable; quite the contrary, she's supportive and often just wants to connect sexually with her husband. Their daughter Hannah is a typical teenager, starting to find more and more conflicts with her parents, but otherwise seems to be a good kid. Even Marissa, for as much as she instigates some of the drama to come by the end of the film, is painted somewhat sympathetically, as she's just trying to get an education, and doesn't need her professor slobbering all over her.<br><br>So there's the give and take of connecting with the characters. Whatever happens to Bill, for the most part, he brought on himself and, often, deserves what he gets for taking things too far; it's hard to connect with him in a meaningful way. The periphery characters often exist to be hurt by the fallout (including, comically, fellow professor Marty (Morgan Peter Brown)), so you feel bad for them most of the time.<br><br>Still, for as creepy as some of the undertones in this film are, the film doesn't go as dark as it could. There's a weird tonal mix of a family drama, with some mid-life crisis thrown in for good measure, some light comedy and sexual perversion that results in a film that seems to exist along multiple planes but never fully commits to any one. Thus, moments are funny, but not too funny. Things get dark, but never too dark (though the potential is certainly there). Sometimes the mix works, other times it's tonally confusing.<br><br>But there are little touches that serve to elevate the experience. The art direction had some fun with this one, as posters, test answers and the like all appear to offer lewd suggestions for our professor at one time or another. This shows how the mundane aspects of his job are conspiring with the downward spiral of his sexual deviance to make \"normal\" life truly challenging for Bill.<br><br>In the end, Biology 101 is a film that plays with tone, sometimes to a disconcerting extent, but overall works. You know, if you can get beyond the fact that the main character can be pretty creepy, and walked himself right into this situation. You may have to find someone else to root for, but as a study of life, which is often as muddled and insane a tonal mix as this film sometimes exhibits, this is probably more true a story than many would expect.","user":"Danny_Temple","rank":[14,43]}]