[{"title":"Seriously...?","rating":2,"date":"24 March 2014","review":"Right, well I was lured in by the promise of zombies when I sat down to watch \"Toxin\". And boy, was I disappointed with this movie, so much in fact, that I think I made it just about halfway through the movie.<br><br>Not only is this movie awfully devoid of zombies (sure, there were some angry people running around with theater blood on their faces yelling and growling at people), but it was also incredibly boring and had a really dull storyline.<br><br>The movie brandishes \"Millions infected, countless dead\". Yeah, where exactly?<br><br>It should be said that the performances in the movie were so-so, nothing overly impressive here, and truth be told, then I have seen worse elsewhere. But when it comes down to it, then the actors and actresses had absolutely nothing to work with here script-wise or storyline-wise.<br><br>This movie was wooden and horribly forcibly scripted. And there was nothing enjoyable or entertaining to be found here. It was a struggle even just to get to about halfway into the movie, and I must admit that I dozed off every now and then.<br><br>If you enjoy zombie movies, then stay well clear of \"Toxin\".","user":"paul_haakonsen","rank":[41,46]},{"title":"I've been so many places, I've seen so many faces, but these zombies were down right BAD!","rating":3,"date":"25 March 2014","review":"Toxin is not as bad as Flesh Wounds and this is the only good thing I can say about it. <br><br>So lets begin: they pretty much covered all the basic moves in a zombie/action movie, and if one is familiarizated with this kind of films, the road will be straight with no bumps ahead. Nothing new whatsoever, just that so tired formula, applied over and over again, that I fail to see how this could even be put in the category \"we all have to start somewhere\". For 2014, even with a minor budget, this is bad, this is too low to be noticed by anyone and if so, I doubt someone will actually see any good in it.<br><br>Therefore my advice, unless you are a huge zombie devourer, look elsewhere. Lately some better zombie movies came out, like: Open grave, The returned, even Cabin fever 3.<br><br>Cheers!","user":"gothic-fiction","rank":[16,18]},{"title":"NO Don't you even think about it!","rating":2,"date":"1 May 2014","review":"Out of my good nature i'm giving it 2 stars but I don't think it even deserves that. This movie is almost an hour and 15 minutes long and seems like decades! This is the same clichéd military experiment gone wrong, now commanding Clint Eastwood / John Wayne wannabe hero wants revenge from the government by finding proof on a remote island full on virulent zombies! The protagonist is like Mr. Macho Man no one can hurt me and then the evil government and the whole hijacking for the good of humanity etc etc stuff, probably seen it a million times and if you miss this flick I guess it won't hurt at all.<br><br>People seriously speaking nothing to see here move along. 2 out of 10 that is all! @evilspellz","user":"evilspellz","rank":[6,7]}]