[{"title":"I liked it","rating":10,"date":"24 September 2014","review":"Having read the reviews, I wasn't really sure what to expect when I began seeing GHTG. I should say that I have been a B&amp;S fan since 1997 or 1998 when I discovered \"If you're feeling sinister\" and I have all their releases up until 1998 as well as the debut album of Gentle Waves. Their music has really influenced me as a person and I really was curious of what a film based on their songs would look like.<br><br>I felt happy watching GHTG but it was also really emotional. Being in my mid-30s it reminded me of my dreams as a teenager and I began asking myself if there's still time to accomplish them. I strongly identified with the character of James and his search for the perfect moment, which makes it impossible to enjoy life. I recognized Eve in the many talented, self-destructive, impulsive people I have met in my life and all the opportunities I had to make my life a little more interesting.<br><br>GHTG is full of color. The characters dress up in all kinds of costumes, and yes it is unrealistic but I think what many fail to realize is that our fondest memories are usually very different than what we really experienced. Everything is more colorful and stylish in our memories, like a Belle and Sebastian album cover.<br><br>I had read that there is no plot to the movie, but I don't agree at all. I think both Eve and James are wonderfully developed characters and Cassie is also an interesting character whose presence makes the story better. And the music is also wonderful. I was very pleased with Emily Browning's singing performance. She not only has a great voice but she also seemed to be really invested in the songs which made her character more believable.<br><br>I loved the film's bittersweet ending as well as the many funny and awkward moments (James fighting his drummer, James and Eve showing up at Cassie's house or the drunk Scottish boys whose accent Cassie couldn't understand). This may not be a film for everyone, but I think the world would be a better place if more people listened to Belle &amp; Sebastian and all I can do is thank Stuart Murdoch, the actors and everyone else involved in making this film.","user":"century_of_fakers","rank":[27,37]},{"title":"Exceptional Film","rating":9,"date":"26 June 2015","review":"I thought this musical fantasy was a most pleasant and enjoyable film, filled with an appealing storyline, humor, and, of course, many delightful musical numbers.<br><br>Set in Glasgow, Emily Browning the stunning and talented Australian actress is superb as Eve, who's in treatment at a mental health facility for depression and an eating disorder. However, she'll often sneak out of the facility, at night, to visit local clubs, as she's an aspiring songwriter and singer.<br><br>One night at one of these clubs, she'll meet James, an idealistic young man and guitar player, whose day-job is being a lifeguard at the local university. Olly Alexander is exceptional, as James, and there's a noticeable chemistry between Eve and James, which will eventually lead to a very close friendship.<br><br>James is teaching guitar to another young woman, Cassie, ably portrayed by Hannah Murray, who also wants to sing and write songs. Soon, the three of them will form a strong bond, and look to form a band so they can try to play out their musical aspirations. However, in time, they'll have to make decisions about their lives and their futures.<br><br>The movie was written and directed by Stuart Murdoch, the lead singer of the Scottish band Belle and Sebastian, who were very involved in the musical productions here in the film. I thought his screenplay was very clever, and his direction of the musical numbers was extremely well done.<br><br>All in all, there were some elements here that reminded me of the great movie \"Once\", with its heartwarming themes and music. To me, this movie was a most pleasant surprise and an exceptional film.","user":"larrys3","rank":[4,4]},{"title":"Belle and Sebastian, the movie","rating":6,"date":"16 September 2014","review":"There was a lot to like about God Help the Girl but despite a few good individual scenes, but it didn't flow together as a story that well. Maybe writer/director Stuart Murdoch needed more creative feedback and better editors than he got. Certain scenes and characters just show up out of nowhere with little connection to the rest of the story, like the WTF scene of Eve going on a bender with some girl we never see before or since. The main character of Eve was weakly written. Her past and her motivations were vague. The movie would have been far better with James and Cassie as main characters and Eve as a side character.<br><br>You could see God Help The Girl as a culmination of Belle &amp; Sebastian's (a band named after a fictional band that Murdoch's songwriting centered on) characters and themes spanning their nearly 20 years as a band. James, Cassie and Eve seem derived from the archetypal characters from B&amp;S's songs. The movie though develops them in a shallow and haphazard way that doesn't really do justice to the insights and characters brilliantly explored in the individual songs. I think Murdoch could make a good movie, but God Help The Girl was just so-so. The music was excellent at least.","user":"Nynaeve","rank":[17,25]}]