[{"title":"Nowhere near as great as its soundtrack, but this is harmless, cheesy fun if you're in the mood for it.","rating":5,"date":"10 July 2014","review":"Very few films aspire to the heights (or, more accurately, depths) of chirpy cheesiness achieved by Mamma Mia!: a cinematic guilty pleasure if ever there was one. Walking On Sunshine is that rare film which does. In fact, it's dancing merrily into theatres, so intent on recreating the unexpected blockbuster success of Mamma Mia! that it's forgotten to tweak the formula even a little bit. And so, we go from the sun-washed beaches of Greece to the sun-washed beaches of Italy, from cheesy but super-catchy ABBA tunes to cheesy but super-catchy 80s pop hits, from an awkward love affair to... an awkward love affair. Do you see where we're going here? The unfortunate thing is that Walking On Sunshine never quite hits on that elusive magic which allowed Mamma Mia! to be so bad and so darn good at the same time.<br><br>Here's how the story (what little there is of it) goes: Taylor (Hannah Arterton) meets and falls in love with gorgeous Italian hunk Raf (Giulio Berruti) on a sun-kissed beach in Italy. But the summer is drawing to an end, and she has to be responsible and go back to school. Three years later, when she finally graduates, Taylor returns to the same Italian village to meet her headstrong, impulsive sister Maddie (Annabel Scholey) - whereupon she learns that Maddie, on the rebound from her horrible ex Doug (Greg Wise), is due to get married in a matter of days. The twist in the tale, of course, is that Maddie is planning to marry Raf - the love of Taylor's life.<br><br>In other words, the plot, such as it is, is flimsy and contrived. The narrative staggers predictably from song to song, whether it's Taylor and Raf realising they still have feelings for each other (It Must Have Been Love), or Doug and Maddie crooning about their toxic relationship (Don't You Want Me). The characters seem to function on the basis of narrative expediency: Doug, for instance, waltzes in and out of the film, teetering dangerously between unforgivable jerk and viable love interest. Truth be told, if you're looking for depth or complexity, look away now. The film seems to operate on the blithe assumption that yet another karaoke-friendly song will sweep away the awkward writing that preceded it.<br><br>The film also falters somewhat where its cast is concerned. All of them are earnest to a fault, belting their numbers with more passion than skill. They certainly work incredibly hard at playing characters with little more complexity than a batch of paper dolls: Arterton is the textbook lovelorn but responsible girl, torn between her head and her heart, while Scholey sizzles efficiently as the bubbly Maddie. But they never really manage to give off the sheer, unmitigated joy that practically radiated from the A-list cast populating the Greek islands in Mamma Mia!. Of the supporting cast, comedienne Katy Brand wins most charismatic honours as the sisters' best friend Lil - not something that can be said of X-Factor winner Leona Lewis, who should really stick to her day job.<br><br>To be fair, Walking On Sunshine does have its merits. If you're in the right mood for it, it's a silly, summery burst of fun - not quite as funny and sweet as you might want, but good enough in a pinch. Its soundtrack is great, jumping from Madonna (Holiday) to George Michael (Faith), before taking a delightful detour into tomato-strewn mayhem in the huge musical number that accompanies the title song. There are even a couple of unexpectedly rich character moments that come courtesy of the two sisters: Taylor's bravery in returning for Maddie's wedding is a surprisingly emotional moment and one of the high points of the film.<br><br>Of course, when it comes down to it, no amount of critical analysis will matter anyway. Walking On Sunshine is, quite simply, the kind of film that's largely critic-proof. It may not even be as good as Mamma Mia!, and its story and characters are almost wilfully poorly-constructed. But it won't matter because the film is also relentlessly fun, silly, sunny, and cheesy. Berruti is gorgeous to look at, as are the sun-kissed beaches of Italy. The songs are catchy, summery and joyous. That certainly doesn't add up to 'great' but, if you're open to it, it just might add up to 'good enough'.","user":"shawneofthedead","rank":[16,16]},{"title":"Sunny, but highly unoriginal","rating":7,"date":"15 July 2014","review":"Taylor fell in love with hottie Raf while on holiday in Puglia, Italy but, despite his entreaties to stay, she left to go to university. On graduating three years later, she returns to Puglia to holiday with her sister Maddie who is already there (they had decided on Puglia because it meant to much to Taylor). Maddie, who has a history of relationships with unsatisfactory men, announces that she has had a whirlwind engagement and is about to get married in two days. No surprises for guessing who the lucky fellow is...<br><br>So, let me see - a British film with a frothy story involving family relationships, secrets, romance, deceit, love, and squealy young women, in a sunny Mediterranean setting, with the plot advanced by way of the cast bursting into 30-year old pop songs at regular intervals. Walking On Sunshine isn't even a blood relation of Mamma Mia!, but it has definitely sneaked into its wardrobe, nicked its shorts, T-shirt and sandals, and put them on to make you think it is. Which gives two grounds on which to consider it - on its own merits, and by comparison to MM!.<br><br>On its own merits, it is amiable enough. The good points are that it is bright, colourful, cheerful and tuneful, and the two sisters (Hannah Arterton - younger sister of Gemma - as Taylor, and Annabel Scholey as Maddie) are both attractive and likable performers. The bad points are that it is completely predictable, the dance routines are pretty obvious (even as a non-dancer I can spot that they are not especially challenging) the cast includes two funny fat people (despite giving good performances, they are included solely for the sake of being funny fat people which, as a not particularly funny fat person, I object to), and the hot Italian blokes are indentikit and interchangeable (I accept that those who are fans of the male sixpack may feel differently).<br><br>And, compared with Mamma Mia!, it fares worse, for three main reasons. One, its following of the MM! template is absolutely transparent, from the squealy reunion at the start to the dramatic and heart-rending showstopper towards the end. Two, the selection of 80s hits doesn't have the emotional heft of a soundtrack selected entirely from the Abba catalogue. And third, and most importantly, it doesn't have a cast who bring the commitment and credibility to the froth in the way that Meryl Streep and co. did. Walking On Sunshine features a bunch of attractive 20-somethings (and one louche old lothario) who don't appear to work or have a single worry other than romantic ones: contrast Streep and the three Dads, all of whom were grounded in the real world.<br><br>If you didn't like Mamma Mia!, you aren't likely to enjoy this. If you did - well, like I said, it's sunny, cheerful and tuneful, so you may. And if you didn't see Mamma Mia! - then I guess it depends on why you didn't.","user":"neil-476","rank":[11,13]},{"title":"The Musical Movie Event of the Summer!","rating":5,"date":"20 June 2014","review":"Well, that's because it's the only musical movie of the summer.<br><br>They wanted to make a movie for the female gender, so if you're a male and you're forced to see this you better relax your butt and let it happen. The girls want to watch this to see Giulio Berruti, because he is handsome as ****. I'm a guy, 100% heterosexual, but if you deny that this man belongs to the top of our class, you are lying.<br><br>The acting is average. Every character looks like he is living in a fairy tale, so everyone is happy and starts singing at random and sometimes inappropriate moments. You notice that every actor in this movie is enjoying their work. They act playful and enthusiastic, so you can't help yourself smiling sometimes. The dark side of this acting style is that you don't take the more emotional moments very seriously. It's a happy-family-summer-musical-movie after all, so everything is going to be be okay. Oh yeah, the jokes are horrible though.<br><br>The movie itself is not that bad. I would call it a budget version of Mama Mia!, because the A-list actors were the main reason people wanted to see that. There's one location, one annoying girl and at the end a wedding with a 'twist' that won't surprise anyone.<br><br>It's extremely cheesy, but if you fancy a brainless movie night, this is not the worst choice you can make. Don't see it in theaters though, unless you want so see Berruti's abs in widescreen-size, and don't forget the alcohol so you can suddenly sing along with everything.","user":"leroyspierings","rank":[21,29]}]