[{"title":"Hacksaw Ridge","rating":10,"date":"11 February 2020","review":"Another WWII movie but instead of D-Day and the Battle of Dunkirk, it's the Battle of Okinawa in Japan. Which means, new branch of military and new settings. Usually I want war movies to focus on the historical accuracies and action rather than characters, but this movie changed my opinion. It tells the story of Desmond Doss and his life and how he joined the army, that was very interesting and well-acted. The beginning explained our main character and introduced all the others, who are also a good addition. BUT the rest of the movie is awesome. The battle scene is engaging, heart-wrenching, and epic. It is very gruesome, some may not like that, but that's how it actually happened - when you get hit with a bullet, there's going to be blood. The fight portrayed Desmond's goal and his heart to save others, which you have to respect. Not only does this movie provide adrenaline, but also a learning experience.","user":"MR_Heraclius","rank":[43,46]},{"title":"At The Very Center Of It All","rating":9,"date":"28 January 2017","review":"We knew already that Mel Gibson is a filmmaker with a powerful vision and the craftsmanship to go with it. Extraordinary battle scenes. Violence, Gibson style, which means Peckinpah plus, because here there is such a personal intention that makes every frame, utterly compelling. The only drawback and I have to say it, Vince Vaughn. Why? In the moment he appears, this extraordinary film becomes a movie. It took me completely out of it. When you look at him you see an actor, acting. On the other hand, Andrew Garfield. Sublime. He makes totally believable a character that could be fictional. The humanity in Andrew Garfield's eyes makes everything real. It tells us, in no uncertain terms, that at the very center of it all, there is love. Love!","user":"littlemartinarocena","rank":[241,318]},{"title":"Powerful - well acted piece","rating":9,"date":"22 September 2016","review":"As someone from Sydney, Australia I was proud at the way this was filmed. Using the Hollywood model, there would have been lots of sets but using actual buildings allowed a lot of warmth to come through in the natural light. Gibson is a fine director, I was impressed with his framing, he shoots very closely for the acting stuff (more head and shoulder) which is quite interesting on the eye. Using more natural light it is quite beautiful. I suspect Gibson will not yet have been forgiven for his personal life to get the recognition he deserves.<br><br>This movie could have been another Forest Gump, it could overly sentimental, instead, carries an appropriate amount of sincerity. The backstory is a major part of the movie. Doss is portrayed as uneasy with the girls who fell for the first pretty thing he saw. This could have been so Forest Gump-like but strikes a nice chord.<br><br>The cast was excellent. Hugo Weaving was perfection. He carried the first half of the movie as the battle-fatigued (PTSD) WW1 vet father. Some may complain that the women are poorly portrayed as are the Japanese, who are largely like ants coming from their mound or canon fodder.<br><br>As brutal as the second half is, I am sure it could not convey how truly gallant Doss was or brutal it was in reality.","user":"conan-2","rank":[264,378]}]