[{"title":"Taut and gripping from start to finish, Johnnie To's intricately choreographed procedural of a complex anti-narcotics operation pulsates with a gritty and realistic feel","rating":8,"date":"13 April 2013","review":"For the uninitiated, 'Drug War' marks acclaimed Hong Kong director Johnnie To's first crime thriller to be shot in Mainland China, an understandably wary prospect considering how his usual sensibilities in the genre are highly likely to run afoul of the Chinese censors. But fans of the auteur can rest easy – To is as sharp as he has ever been here reuniting with his regular screenwriter and producer Wai Kar-Fai, delivering a tense and engrossing procedural around a complex anti-drug trafficking police operation.<br><br>To be sure, the subject matter is an extremely risky one – after all, the tough stance that the country has adopted towards drugs means that the authorities are only going to scrutinise a movie about that hot- button topic very, very closely. It is therefore somewhat of a miracle that To manages to remain politically correct without ever being preachy, and even better, to mirror the authorities' no-nonsense approach while offering the kind of nail-biting entertainment perfectly accessible to mainstream audiences.<br><br>But then again, we should have expected no less from To, and right from the get-go, we are treated to both Wai Kar-Fai's elegant storytelling and To's classy direction. Cross-cutting seamlessly between two seemingly unrelated series of events, To introduces his audience to Louis Koo's Timmy Choi, who is seen driving away from a factory billowing in smoke while foaming at the mouth, gradually losing consciousness until finally he crashes in spectacular fashion through the glass walls of a restaurant. Meanwhile, Sun Honglei's Zhang is on a dilapidated bus going through a toll booth, whose commuters are really mules transporting drug-packed ovules within their body.<br><br>When his partner-in-crime panics after their overheated bus pulls to the side just after crossing the booth, Zhang reveals himself to be no less than the very captain of the narcotics squad. At the same hospital where Zhang and the other drug mules painfully excrete their smuggled goods, Zhang runs into an unconscious Choi, covered in skin lesions and bearing the unmistakable whiff of a drug-making operation. Immediately, Choi is put into surveillance, but Choi's identity only becomes clearer when he is brought into questioning, turning surprisingly compliant as he tells Zhang that he is but a middleman between a rich businessman turned drug dealer Boss HaHa (Hao Ping) and a powerful supplier named Uncle Bill.<br><br>Even then, Choi remains an enigma – we're sceptical of his plea to escape the death penalty in exchange for his cooperation – and yet a cautious alliance emerges between the tough grim-faced Zhang and the persuasively suppliant Choi. Keeping the proceedings entirely realistic, To unspools the action through a series of undercover infiltrations, surveillance and stake-outs filmed with the same breakneck urgency and unnerving tension of such real-life operations. Moving from posh hotels to lavish cabaret nightclubs to busy seaports, To switches from location to location without any let-up from a consistently gripping pace.<br><br>Yet despite the breakneck pace, each sequence is tautly choreographed. Particularly effective is the pivotal setpiece in the middle section, which sees Zhang masquerading first as Uncle Bill to meet Brother HaHa and then posing as HaHa (the character's signature hysterical laugh included) to meet Uncle Bill's representative. Both close-quarter setups ripple with edge-of-your-seat tension, with Zhang's charade threatening to unravel itself under the villains' scrutiny. Also worthy of mention is the film's climactic shootout in front of an elementary school, as Choi finally reveals his hand as a cool-blooded conniver interested only in his own self-preservation. Though less violent than the usual To actioners, the action is nevertheless exhilarating in its rawness, with To subverting genre expectations of who dies and who prevails.<br><br>In true alpha-male fashion, Zhang remains an inscrutable character throughout, defined only by his doggedness when hunting down his targets. Ditto for Choi, who doesn't get any backstory to explain how or why he got into the drug business. Like 'PTU', To keeps his focus singularly on the nuts-and-bolts of the police work at hand, deliberately refusing to let his audience get to know more about any of the characters aside from their relative positions in the unfolding mission. Such a clinical approach may frustrate some viewers, but anyone who's been a fan of his trademark understatement will embrace it – along with Xavier Jameux's pulsing score – as nothing less than To's brand of cool.<br><br>Just as certain to delight fans is a nifty twist late into the story that turns the movie into a reunion of sorts for To's regulars – Lam Suet, Gordon Lam, Eddie Cheung, Lo Hoi Pang and Michelle Ye. Of course, that's not to diminish Sun Honglei and Louis Koo's strong lead performances – the former bringing gravitas and an unexpected touch of humour when imitating HaHa's over-the-top behaviour to an otherwise stoic role; and the latter playing both cunning and desperate in thoroughly engaging fashion.<br><br>And so despite the Mainland setting, 'Drug War' remains a distinctly Johnnie To movie, using the bleak wintry settings of the Mainland city of Tianjin to lend the film and its subject matter a gritty sobering feel. Eschewing the visual aesthetics of 'Exiled' and 'Sparrow', it is also easily his most commercially accessible action thriller of late, with a documentary-like realism that mirrors Derek Yee's style in another drug-themed movie 'Protége'. Like we've said, To's fans will enjoy this as much as his previous works, and this is a movie that demonstrates once again why he is easily one of the best directors in Hong Kong today.","user":"moviexclusive","rank":[29,41]},{"title":"A solid and taut, if ultimately shallow, action thriller","rating":7,"date":"20 October 2013","review":"I'm not terribly familiar with Johnnie To's work, though I know he is one of China's biggest directors. Drug War is his latest film, a critically hailed masterpiece, so to speak, that rivals some of the best American crime films. And for the most part, it is a very good film. Gripping, with a tight rope plot written like a maze, Drug War very rarely lets up as it navigates from one stage of the plot to the other.<br><br>The film opens with Timmy Choi, a drug manufacturer, driving erratically until he runs through the entrance of a restaurant until he ends up in the hands of Captain Zhang. For dealing the amount of drugs that Choi is responsible for, the penalty is death, but Choi cuts a deal to help the police bring down a drug lord responsible for the sale of the narcotics. What follows is a near non-stop mission to get into the heart of the drug dealers and bring them down.<br><br>Drug War is the kind of crime action thriller that is very audience pleasing. There is plenty of suspense and mystery, as you're always on the edge of your seat in anticipation of what will happen next. It doesn't help that you're never quite sure who to trust or who will do what, especially Choi, who remains shifty and unsure. Sun Honglei is especially entertaining as the no nonsense Zhang, whose smart and constantly does his best to stay one step ahead of all those he's trying to bring down, including Choi. The writing for the film is very intricate and full of surprises. Coupling this are several action set pieces, the highlight of which are a middle section involving the police and two very capable partners of Choi and the ending, which is an absolutely crazy finale for this film.<br><br>If I have one real complaint about the film, it's the lack of depth. For all the technical skill and excellent writing and plot, we really don't get to know any of our characters. There is an attempt to make Choi somewhat sympathetic through a plot point about his wife, but Choi himself never really does much to make us like him or get us on his side. The same can be said about Zhang, who is little more than a hard nose cop trying to catch the criminals. There's never any real insight into either of these men, let alone the rest of the cast. It's a very basic and shallow cops and criminals tale, albeit, a very well written and produced one.<br><br>But these are minor complaints in the face of the entertainment at hand. This is arguably one of the best films of 2013, even at it's rating, and I urge anyone looking for to make up for some theatrical thuds to check this out. It's well worth it.","user":"cadillac20","rank":[12,15]},{"title":"Meth in the Mainland","rating":9,"date":"8 January 2014","review":"After his meth lab explodes, leaving him scarred and his wife dead, Timmy Choi (Louis Koo) is apprehended by the Chinese police for a crime that warrants the death penalty. In the custody of Captain Zhang (Sun Honglei), Choi sees only one option to avoid execution; turn traitor and help Zhang's undercover unit bring down the powerful cartel that he has been cooking for. As the stakes get higher, it becomes increasing unclear as to who has the upper hand, and who will dictate the endgame. <br><br>Director Johnny To is a master of the crime film, and with \"Drug War,\" he's created a near masterpiece of the genre. He never convinces us of being in anything but complete control of his multifaceted thriller, and exudes an unparallelled confidence in every scene and phenomenal set piece.<br><br>To's electrifying picture recalls some of the best work of his great contemporaries. \"Drug War\" possesses the technical brilliance of Scorsese's \"The Departed,\" the ground-level knowledge and surveillance of David Simon's \"The Wire,\" the gritty realism of Michael Mann's best work, and by the end the blistering, double-fisted action of John Woo's prime. These elements don't come together as a derivative; To is a filmmaker at the top of his game, and makes the most of his cast, his influences, the Mainland setting, and a little of the grotesquerie that often has Hollywood shuddering; in a singular whole. <br><br>Disparate from most Hong Kong action films, \"Drug War\" is a methodical, meticulous procedural first, exploiting a street-smart screenplay that knows the Chinese crime scene; and if that statement is indeed false, it never feels less than authentic. Much of the intensity derives from dialogue exchanges, and how rigorous both the cops and criminals try to not get made. Because of this well paced, equally well played dynamic, we never know who we should root for, and that's exactly the point. Mr. To's drama is incredibly intense... but then he pulls out all the stops. <br><br>The last 20 minutes of \"Drug War\" is the show-stopping action set piece of the year. An extended shootout that's brutal, ambitious, and a masterpiece of it's kind. It's a marvel of physical filmmaking that also works as an unexpected plot device, violently flipping our conceived notions of these characters on their ear; clearing the way for a fittingly ironic, ice-cold conclusion.<br><br>\"Drug War\" might just be the best pure crime film of 2013. Technically and narratively stellar, it already seems like a minor classic of the genre.","user":"space_base","rank":[14,18]}]