[{"title":"Very interesting story about General Fellers who is given the impossible task to investigate the Emperor's role in the lead-up to war,","rating":7,"date":"3 May 2014","review":"This nice movie tells a fictionalized account based on the actual life story of US Army Brigadier General Bonner Frank Fellers who served under General Douglas MacArthur . On the staff of General Douglas MacArthur (Tommy lee Jones), the de facto ruler of Japan as Supreme Commander of the occupying forces, a leading Japanese expert, General Bonner Fellers (Matthew Fox) is charged with reaching a decision of historical importance: should Emperor Hirohito be tried and hanged as a war criminal? Interwoven is the story of Fellers' love affair with Aya (Eriko Hatsune), a Japanese exchange student he had met years previously in the U.S. Memories of Aya and his quest to find her in the ravaged post-war landscape help Fellers to discover both his wisdom and his humanity and enable him to come to the momentous decision that changed the course of history and the future of two nations.<br><br>This is a good drama war with emotion , suspense , thrills , culture clashes , and historical events . The picture contains a marvelous story of love and understanding set amidst the tensions and uncertainties of the days immediately following the Japanese surrender at the end of World War II. Excellent cast gives good acting as Fox who plays Bonner Fellers, a general who's sent to Japan to decide if Emperor Hirohito will be hanged for war crimes ; starring alongside him is Eriko Hatsune as Aya Shimada, a woman Fellers romanced years earlier, and Tommy Lee Jones as legendary Us military figure General Douglas MacArthur. The movie displays a colorful as well as adequate photography by Stuart Dryburgh . Emotive and evocative musical score by Alex Heffes . The flick was professionally directed by Peter Webber (Hannibal , The girl with a pearl earring). This true life story was one worthy of big-screen treatment .<br><br>The picture is well based on true events , these are the followings : After the war, Fellers played a major role in the occupation of Japan. Among his duties was liaison between HQ and the Imperial Household. Soon after occupation began, General Fellers wrote several influential memoranda concerning why it would be advantageous for the occupation, reconstruction of Japan, and U.S. long range interests to keep the Emperor in place if he was not clearly responsible for war crimes. He met with the major defendants of the Tokyo tribunal. In their research and analysis of events and considerable controversy about the time period, according to historians Herbert Bix and John W. Dower, Fellers—under an assignment by the code name \"Operation Blacklist\"—allowed them to coordinate their stories to exonerate Emperor Hirohito and all members of his family. This was at the direction of MacArthur, now head of SCAP, who had decided that there was to be no criminal prosecution of the Emperor and his family. He will question the accused Class -A War Criminals such as Wartime Prime Minister Hideki Tojo, Former Prime Minister Konoe, and Koichi Kido while confronting prejudice from a resentful populace and other American soldiers. General Fellers, who came from a Religious Society of Friends family (commonly known as Quakers) and attended the Quaker-affiliated Earlham College, was instrumental in the selection of Elizabeth Vining, an American Quaker educator, as tutor to the Emperor's children. Ms. Vining was followed after 4 years by another Quaker educator, Esther Rhoads.In 1971, Emperor Hirohito conferred on Fellers the Second Order of the Sacred Treasure \"in recognition of your long-standing contribution to promoting friendship between Japan and the United States.\"","user":"ma-cortes","rank":[30,32]},{"title":"A Tale of Two Emperors","rating":6,"date":"17 September 2012","review":"Emperor (2012) <br><br>In his rule over Japan as Supreme Commander of the occupying forces after World War II, General Douglas MacArthur was probably as benign a dictator as history has recorded. His enlightened policies led to a Japanese post war economic recovery from wartime devastation, and to post-war harmony between Japan and the West that replaced virulent wartime hatred. Emperor deals with his first days in Japan after the Japanese surrender, and in particular, with his momentous decision not to include the Emperor Hirohito among the Japanese war criminals, a judgement made despite political and popular clamor. Allied war propaganda had demonized the Japanese people and Hirohito in particular, and Japanese propaganda had done much the same with the other side. MacArthur's decision became the lynch-pin of his policy there: to respect the cultural differences instead of seeking to override them, and to try to bring together the best that both Japan and the western powers had to offer.<br><br>The movie deliberately avoids clarifying which emperor the title refers to. On the surface it may seem to denote Hirohito, but as supreme commander MacArthur had near imperial power, and did not hesitate to use it. The film concentrates on one of his protégés and close advisors, General Bonner Fellers, a Japanese expert on whose opinion MacArthur chooses to rely. Fellers was close to MacArthur, having served with him even before the war. Fellers loved Japan and had visited it, and had produced for the American military a crucial assessment of the Japanese military mind. He had additionally predicted war with Japan well in advance of Pearl Harbour. In real life, Fellers had some connections to Japan, even to the Imperial Household, and he had a close friendship with a former female Japanese exchange student whom he knew from Earlham College in Indiana. He rejoined MacArthur in 1943 and accompanied him during the Supreme Commander's momentous first days in Japan. The film strongly hints that MacArthur had already made up his mind about the treatment of Hirohito, which he almost certainly had, but wanted Fellers to supply the rationale for his decision.<br><br>The film has three threads that run throughout: MacArthur's occupation of Japan; Fellers' investigations leading to his written opinion; Fellers' search for his Japanese friend amidst the post-war chaos. It is one thread too many, since while the film juxtaposes these, it does not successfully weave them together. The one exception may be Fellers interview with the Japanese general, supposedly his friend's uncle, since it does much to explain the country's traditions and military attitudes. Director Peter Webber has said quite rightly that MacArthur has not been particularly successfully treated on the screen. In fact, epics like MacArthur (1977) and Inchon (1981) proved to be major disappointments. It seems a shame here that the director and writers Vera Blasi and David Klass did not keep MacArthur as the film's central figure, but instead chose to focus on his subordinate, Fellers.<br><br>As MacArthur, Tommy Lee Jones gives an outstanding performance, and the film is worth seeing for that alone. Looking nothing like MacArthur (he didn't try), Jones captures ever bit of \"El Supremo's\" command and self-confidence, and when he is present on screen, like the General himself, he dominates it. It is just a shame that he doesn't get more screen time. MacArthur is, historically, the man who made the real decisions, and, especially as played by Jones, a figure far more fascinating than Fellers.<br><br>By contrast, the part of Fellers (Matthew Fox of \"Lost\") seems dull, unfocused, and even clumsy, particularly considering the crucial days in which it is set. That is probably not Fox's fault, but a weakness of the screenplay. While the fact that Fellers knew Japan well and was especially friendly with a Japanese girl he had met in college are factors that deserve to enter into the picture, as presented they often tend to be a distraction from its central theme. This is all the more the case since the story of \"Aya\" appears to contain considerable fiction. Feller's real-life friend from Earlham, Yuri Wantanabe, survived the war, and his connections to Japanese officialdom were probably better than her own. There is the additional fiction that all this is compressed into a ten-day window, when the actual investigations took place over five months.<br><br>Still, in playing Aya, Eriko Hatsune renders her subtly, displaying a delicate balance between propriety and concern. Some of the other Japanese actors are equally notable. Especially fine, and especially central to the story, is the portrayal by Masatô Ibu of the Lord Privy Seal, Marquis Koichi Kibo, the highest figure in the Imperial Household and a friend to Hirohito. Ibu is persuasive in presenting a man who attempts to preserve the Emperor's honour – and his privacy – even in the face of the possibility that the Emperor might hang. Masayoshi Haneda also gives a fine performance as Fellers' interpreter and de facto aide. And Takatarô Kataoka is realistic as Emperor Hirohito himself.<br><br>The wanderings of the plot are offset in part by the great production values (Grant Major)and fine cinematography (by Stuart Dryburgh). The contrast between the real beauty of Japan and the wartime devastation is particularly effective.<br><br>This movie has many good things going for it, particularly Tommy Lee Jones (and MacArthur himself). It's just a pity it didn't capitalize on them more.<br><br>Emperor premiered at the Toronto International Film Festival on September 14, 2012. It has been acquired for distribution by Lionsgate &amp; Roadside Attractions, but no date for general distribution has yet been announced.","user":"laheyray","rank":[88,104]},{"title":"Compelling and Thought Provoking","rating":9,"date":"3 March 2013","review":"I recently saw Emperor at a preview ahead of the upcoming March 8 opening. I found it well paced, carefully constructed, and beautifully shot. The interwoven sequences work tightly together. The protagonist's personal past and present personify the larger struggle over how to treat a brutal enemy that's been justifiably vanquished at horrific cost to both sides. Tommy Lee Jones and Matthew Fox deliver emotional performances as military leaders pivoting from years of war to peace. It's an absorbing story that puts you in their characters' shoes, and is compelling and thought provoking even though you know the historical outcome.","user":"marysmith3535","rank":[53,62]}]