[{"title":"A train wreck, from start to finish. One of the worst movies based on a classic character I have ever seen.","rating":1,"date":"11 March 2018","review":"I recently started watching the original \"Woody Woodpecker\" cartoons, and while I find the character somewhat annoying, he is more entertaining than this pile of trash. This movie has got to be one of the worst movies based on a cartoon character I've ever seen, point blank period.<br><br>While I was sick, I decided to watch this film on Netflix. Big mistake. The acting is downright terrible and Woody looks like a bad PlayStation 2 graphic from a video game. The jokes are horrendously unfunny and 90% of them rely on fart jokes and other bodily humor in the sad hopes of getting a laugh, and not a single one of them works; Not one! <br><br>Also, I should mention that Woody is barely in this movie. There are way too many scenes with the human actors instead, and when he does show up, he's there to tell jokes that aren't even remotely humorous or do something disgusting. Why would you even make a movie about a famous character from the 40's to 70's if he's not the main focus? The antagonists are the most generic and uninteresting excuses for villains you will ever see. They could've worked if the movie itself was completely animated, but they fall flat on their faces because they are just there to act stupid. That's it. Those are the entire traits to the characters of these villains. They are stupid, just for the sake of being stupid.<br><br>I know I already talked about the humor, but I feel the need to talk about it again. Really, what do you expect? The humor is nothing more than your typical, run of the mill PG-rated comedy. Like I said, it consists of fart jokes, burp jokes and other forms of toilet humor. <br><br>There is one scene in the middle of the movie where Woody encounters the villains for the umpteenth time, and then, proceeds to relieve himself on one of their ice cream cones. The villain who is dumber than his brother eats the ice cream that Woody's bodily fluid is on. Are you serious? Who, in the right mind, thought that would be good enough to be considered comedy? Not only was the scene lazy like the rest of the film, but it was vomit-inducing and revolting. <br><br>Overall, this has got to be the worst cartoon adaptation I've ever seen in my life, and also one of the worst movies I've seen. It's unfunny, infantile, ugly, pandering and horrid. It has no charm, love or heart put into it, whatsoever and it abuses the very character it's based on, to a point where it becomes unrecognizable. Please, I implore you; if you have kids, DO NOT, under any circumstances, show them this movie. They deserve a lot better than this.","user":"j-jessie-weaver","rank":[28,38]},{"title":"Horrible","rating":2,"date":"15 February 2018","review":"I have no idea why the writers found it necessary to start the movie with a broken family plot. Rich dad divorces mom and hooks up with younger sex object who needs a \"Xanny\" at one point. Why?! <br><br>Dad is forced to take kid along on a vacation which really is dad trying to build a mansion in the forest. <br><br>I think a key aspect of writing for kids is that the writers have kids. Are we targeting ages 4 - 7? 8 to 10? up to 12 years old (because they won't believe a woodpecker drummed on soup cans to produce Jon Bonham-esque sound).<br><br>I feel sorry for anyone who had any role in this project, but mostly anyone who decided to watch it.<br><br>Why? Just why.","user":"cliffordadamsii","rank":[27,38]},{"title":"There's a reason I'd never heard of it","rating":1,"date":"16 February 2018","review":"It's because it stinks.\nThe acting stinks (Tim Omundson manages to be somewhat ok, but his character is empty and moronic).\nThe music stinks.\nWoody Woodpecker's character and voicer is annoying, vapid, and obnoxious.\nEverything and everyone is see through and one dimensional.\nUniversal was like,what's the crappiest thing we can do with a beloved character? Oh I know, let's butcher it with lazy writing and worse production. \nGood grief it stinks.","user":"Moonstrike9","rank":[17,24]}]