[{"title":"Well done but difficult to watch","rating":5,"date":"4 April 2017","review":"My ratings are based mostly on how much I enjoy a film. This film was very difficult to watch especially after the diagnosis was delivered. I am sure that many of the things I disliked were intentional by the writer/director.<br><br>Kate and Ryan are a beautiful couple very much in love. You soon realize that Ryan has issues with his memory and perhaps even mentally. Kate is a perfect wife. She adores Ryan and tries to be positive at all times. She loves spending time with him and seeks to help him at every turn. She occasionally loses patience, especially as things get more difficult, but quickly rebounds, and also tries to hide her impatience. Kate remains true to the end.<br><br>Both Bean and Boston do a great job in difficult roles.<br><br>There are no villains in this movie except the disease. The plot is very basic - it is the degeneration of the life of a happy couple due to a debilitating mental disease. Because the plot is so basic, it moves slowly especially after the diagnosis. There are many scenes where the camera pans slowly through empty rooms or outdoor scenery. In at least one scene this panning is shaky. Kate is so lovable, that it makes her suffering even more painful for the viewer. Ryan appears oblivious to much of his suffering because of the disease. The movie makes extensive use of discordant music and noise which often builds to loud crescendo. As I said before, I am sure that all this is intentional, even artsy, but it is difficult to watch, especially the suffering.<br><br>If you like to watch movies for how well done they are then you will probably want to watch this. If, like me, you watch more for entertainment value, then you may want to pass on this one.","user":"Jackbv123","rank":[6,6]},{"title":"Great Movie","rating":10,"date":"23 April 2013","review":"Great movie. I saw this at the Boston International Film Festival on 4/13 the 7th session at 10:15 and thought it was a great. It showed how difficult it can be to watch someone you love slowly pass away while there is nothing you can do to save them. The movie has a lot of literature quotes and is centered around him writing a novel in the woods while his wife accompanying him on the trip. Soon she sees him struggling to write and do every day tasks. The acting and the writing were terrific. The disease the actor portrayed was difficult and he did a spectacular job.I hope this movie gets picked up for wider distribution.","user":"tsanborn79","rank":[7,8]},{"title":"Hard to swallow","rating":10,"date":"29 June 2019","review":"I made an account on here just to rate this movie. The beginning and seeing the characters so in love made me feel deeply for the characters. I would recommend this movie to everyone but make sure to have some tissues once the diagnosis is made. Very touching. I never cry during a movie but this one got.","user":"mrgums-87207","rank":[2,2]}]