[{"title":"Poor Ray","rating":1,"date":"19 May 2013","review":"I give Ray Liotta thumbs up for letting his hair go gray, and that's the only positive thing I can say about this one. Poor acting, choppy direction, dizzy camera work, weak plot, uninteresting characters. I cannot tell you how it ends because I FF'ed through a lot of it, and don't care. The lead actor in this seems to mug a lot and is more concerned with his looks then how he can make the stultifying dialog come to life. The interspersed scenes from one time frame to the next is a half way decent ploy in a good movie, but it's not working here. Nice to see some actors are still working though. I always wonder how can I care of feel empathy for any character in a movie, and in this movie I'm still wondering.","user":"dontreado","rank":[13,15]},{"title":"Acme Acting School Failure","rating":1,"date":"7 May 2013","review":"Terribly mixed performances...veteran actors allow neophyte protagonist to live long enough to kill any interest here. Glaring differences between portrayal skills. Non-stop panning camera shot in warehouse dungeon becomes wearying, script simply contrived, no real conversation or exchanges, just uttered lines. Blooper city. Not even laughable. This movie makes good actors Emilio Rivera and Ray Liotta look bad, and after an hour of viewing this disaster it's downright embarrassing, like watching a champion boxer take a dive. I had to turn it off. I don't care what the ending is. You're a better man than me if you finish watching this one.","user":"johncarabillo10","rank":[11,14]},{"title":"Terrible","rating":1,"date":"2 June 2013","review":"I probably couldn't find enough adjectives to express how awful this film is, one of the worst I've ever seen. Filled with torture and sadism, as well as incredibly muddled plot elements and flashbacks, I would say it's an insult to anyone's intelligence.<br><br>Joel Mathews portrays Thomas Conrad, a post traumatic stress disorder patient, being seen by Dr. Robert Michaels (Ray Liotta), a military psychiatrist. After a minor fender bender with a man named Bill (Emilio Rivera), Thomas is told no harm done, and invited to a local bar for a drink.<br><br>The next thing he knows he's tied to the ceiling and being tortured by Bill and his cohorts, who let him hear on the cell that his wife and daughter have been kidnapped and held hostage. Unless Thomas can get his father (a judge), his sister (a cop), and his brother (a border patrol officer) to cooperate in a crazy scheme involving robbing a dangerous Mexican drug cartel, they'll all be killed.<br><br>Pretty much the entire movie is Thomas being tortured as he tries to convince his family to cooperate with his captors. By the time the \"big\" surprise ending comes, I couldn't have cared less and felt I need to take a shower to get this drek off of me.","user":"larrys3","rank":[7,9]}]