[{"title":"what's not funny?","rating":7,"date":"2 March 2017","review":"Greetings again from the darkness. The best comedy often touches a nerve. Jokes can make us feel uncomfortable and even a bit embarrassed for laughing. Although the best comedians are traditionally those who attack the politically correct world we live in, there are certain topics that remain taboo even to the bravest comedians: child molesting, rape, AIDS, 9/11, and the Holocaust. Director Ferne Pearlstein examines the issue of taboo comedy through numerous interviews with some well known and successful comedians, authors, and even Holocaust survivors.<br><br>Much of the focus here is on the Holocaust, and some of the familiar faces providing insight include Mel Brooks, Sarah Silverman, Gilbert Gottfried, and Rob and Carl Reiner. We learn the most important rule is  never tell a crappy joke about a dark subject – it better be really funny! We also learn that while the Holocaust is mostly off-limits, the Nazi's are fair game. Bugs Bunny, Charlie Chaplin, The Three Stooges, and The Marx Brothers have all mined the Nazi world for the sake of comedy and satire, though maybe none have done so as frequently or successfully as Mel Brooks (\"Springtime for Hitler\")<br><br>One of the most interesting recurring threads of the film involves Auschwitz survivor Renee Firehouse. North of 90 years old, this remarkable lady is extremely sharp and understands the importance of laughter  while also never being shy about what she thinks is NOT funny. Ms. Firestone even meets up with the effervescent Robert Clary, a fellow Holocaust survivor, and known to many as LeBeau on the TV show \"Hogan's Heroes\".<br><br>A trip to the Holocaust Survivor Convention on the Las Vegas strip offers up more thoughts on the role comedy played in keeping these folks alive. We see rare footage of carefully staged Cabaret acts from within the concentration camps  who even knew this went on? The recently re-discovered footage of Jerry Lewis' \"The Day the Clown Cried\" is also shown, and the commentary from Harry Shearer makes it clear that the rest should never find an audience.<br><br>Authors Etgar Keret, Shalom Auslander and Abraham Foxman each provide their thoughts on forbidden comedic topics, and clips are shown from \"Curb Your Enthusiasm\" and Brooks' \"The Producers\", as well as scandalous moments from Louis CK, Joan Rivers, Chris Rock, and the most censured comic of all, Lenny Bruce. Laughter may be the best medicine, but sometimes it's interesting to take a step back and determine exactly what is off-limits. When has a joke gone too far? It appears from Ms. Pearlstein's project that the line in the sand is determined by personal taste, preference and judgment.","user":"ferguson-6","rank":[10,14]},{"title":"Interesting but this has been done so many times","rating":5,"date":"4 July 2017","review":"It's watchable and instructive at times but honestly I must have seen half a dozen documentaries on the subject of Holocaust humor and the feelings of both the survivors and present-day Jewish comedians.<br><br>There's nothing new here at all and just for a change I'd like to see documentaries about the humor of others involved in those events. The SS, for instance, must have made jokes, both at the expense of their victims and probably their superiors too. It would be interesting to hear about those. And what about the Poles? What did they find to laugh about during the war? It's good to hear about Jewish humor but they weren't the only people with a sense of humor in those days.","user":"aldiboronti","rank":[4,16]},{"title":"Is the holocaust funny?","rating":7,"date":"18 May 2018","review":"Is the holocaust funny? No. This though explores the idea of finding humour in the aftermath, as a coping mechanism or even revenge. There's a lot of conflicting arguments here, all of it very thought provoking. Where is the line? Is there a line? Does the line move over time? It seems perhaps the bar is lower now than ever before. But the bar is still there and although there's power in humour, there's still more in the truth and maybe the bar should go up a little.","user":"garethcrook","rank":[1,2]}]