[{"title":"An experience that assumes a dreamlike and spiritual aura","rating":9,"date":"4 November 2013","review":"Poet and naturalist Diane Ackerman said, \"The great affair, the love affair with life, is to live as variously as possible, to groom one's curiosity like a high-spirited thoroughbred, climb aboard, and gallop over the thick, sun struck hills every day.\" One such high-spirited thoroughbred is Australian naturalist Robyn Davidson who, at the age of 27, crossed the Australian outback in 1977 from Alice Springs to the Indian Ocean with only four camels and her dog as companions. Nominated for Best Film at the Venice Film Festival, Director John Curran's Tracks documented Davidson's nine-month journey of 1677 miles without adding layers of melodrama to distract us from her true spirit of adventure and love of nature.<br><br>Based on Robyn Davidson's classic travel book of the same name and supported by the extraordinary cinematography of Mandy Walker and the lovely score by Garth Stevenson, the film follows Robyn as she travels solo across the unfathomable desert. Sponsored by National Geographic magazine, photographer Rick Smolan (Adam Driver) was chosen by the magazine to photograph her journey for the magazine, but only meets up with her at scattered points during her trip. Davidson at first finds Rick annoyingly over-talkative, but slowly warms to his support and caring and they become friends, while still keeping their distance.<br><br>Not much information is given as to Robyn's motivations in undertaking this adventure, but the film does provide flashbacks over the course of the film informing us about events in the naturalist's past involving loss and disappointment. In some ways, comparable to Chris McCandless' odyssey as documented in Sean Penn's 2007 film Into the Wild, Robyn's goal is to convince herself that she is up to the task of following her own path without having to conform to society's expectations. In spite of her need for solitude, however, she learns to compromise with friends and reach an understanding with visiting journalists looking for a story, even though at one point she says to a resident of the desert, \"It's hard to explain that I just want perfectly nice people to shut up and die.\" Though Robyn does her best to avoid the unwanted company, she eventually recognizes her need for support from others, not only from Rick, but also from an Aboriginal elder named Eddy (Roly Mintuma), who accompanies her to make sure that she avoids the Aboriginal's sacred land. Mia Wasikowska as Davidson perfectly captures the sharp edges of her enigmatic personality while still retaining her adamant refusal to be the effect of her social limitations. It is a strong performance that may earn her consideration for a Best Actress award at the 2014 Oscars.<br><br>Though some viewers may become restless with the unchanging landscape and the lack of overt drama, obstacles do appear in the form of wild bull camels charging towards her and the need for her to take a 160 mile detour to avoid Aboriginal lands. While Tracks has a surprising amount of clutter for an adventure into the wild, as Davidson comes closer to her goal, the growing quiet and emptiness of the vast outback turns her journey into an experience that assumes a dreamlike and spiritual aura.<br><br>Through it all, her fierce determination to accomplish her goal while still retaining her sense of self grows stronger. Davidson in a recent interview said that \"At the time, all young people pretty much wanted to do extraordinary things and extend the limits of what had been given to them as their roles.\" Poet e e cummings agrees, saying, \"To be nobody but yourself in a world which is doing its best, night and day, to make you everybody else means to fight the hardest battles which any human being can fight, and never stop fighting.\" That is the legacy of Robyn Davidson.","user":"howard.schumann","rank":[96,113]},{"title":"A Visually Stunning, Superbly Acted Film","rating":8,"date":"31 May 2014","review":"Tracks is a film that was over 30 years in the making with actresses like Nicole Kidman and Julia Roberts being attached to the project. Lead by Mia Wasikowska, Tracks is an interesting, thematic character study.<br><br>In the mid-seventies, Robyn Davidson (Wasikowska) is a determined young woman who leaves the big city behind for Alice Springs in the middle of Australia. She plans to raise money and gain skills before attempting to cross the Australian deserts to the Indian Ocean: a journey of 1,700 miles (2,700 kilometres). With sponsorship from National Geographic, she sets off with her dog and four camels and meets American photographer Rick Smolan (Adam Driver) at various points on her journey.<br><br>Wasikowska gives a fantastic, compelling performance as a young determined woman who puts herself through a massive physical and mental toll. She is a character who is uncomfortable with modern society, and everyone she meets, from her friends to hardened outback men, think she is mad for wanting to take such a dangerous journey.<br><br>Robyn is a character who has to negotiate for everything she wants to complete her journey and she is determined to do it her own way. She is in the shadow of her father who was himself an explorer and disappeared in Australian wilderness. Robyn is haunted by her past as she has flashbacks during her journey about the various tragedies of her life.<br><br>Some of the best moments in Tracks are when Robyn is all alone in the wild, giving Wasikowska a fantastic opportunity to show off her a talents, as she goes through the emotional stresses she endures. She is believable as she treks through the hostile environment, battling for survival and doing for her the unimaginable, including shooting wildlife and having to discipline her camels.<br><br>As she progresses on her journey her sense of reality is questioned, affected by both her isolation and the hot, physical environment. This is amplified by the direction of John Curran, who adds to the surreal nature of these sequences and the fantastic cinematography by Mandy Walker, who truly highlights the beautiful landscape while still showing it as hot, dry and harsh.<br><br>The main focus of Tracks is Robyn's personal journey yet it still looks at some wider issues particularly the treatment of Aboriginal people. This theme is prevalent throughout the film, starting early as one Aboriginal person suffers racial abuse, and keeps going as Aboriginal people are seen living in poverty or gawked at by tourists. Even people who have good intentions are disrespectful of their traditions. Robyn ends up being a character who has more affinity with the Aboriginal people and fellow loners and outsiders than with mainstream society.<br><br>Tracks is in keeping with films about outsiders looking for a purpose in their lives, like Into the Wild. It is a brilliantly acted film blessed with excellent visuals and themes to easily sink your teeth into.<br><br>Please visit www.entertainmentfuse.com","user":"freemantle_uk","rank":[42,48]},{"title":"Quiet but profound","rating":8,"date":"23 May 2014","review":"Robyn (Mia Wasikowska) arrives in Alice Springs, determined to make the 1,700 mile journey to Australia's west coast on foot across the desert, accompanied by camels and her dog. This film tells of her preparation and the outcome of her journey.<br><br>Despite the fact that it is often leisurely in the telling of Robyn's true story and that Robyn is, for much of the running time, the only person on screen, it is never less than engaging. We get some idea of what drove Robyn to undertake this project (although there is no glib, clear explanation of her motivations), and we meet some of the people she encountered (and one of the enjoyable elements in this film is the development of National Geographical photographer Rick (Adam Driver) - truly annoying when we first meet him, by the end he is much more in tune with what Robyn's objectives have been).<br><br>Mia Wasikowska is very good in this gently moving film, but the real stars of this beautifully photographed story are the Australian desert and the camels.<br><br>There is a small amount of dramatically justifiable bad language and some animal upset involved.","user":"neil-476","rank":[43,52]}]