[{"title":"\"Sometimes people don't know what they need\"","rating":7,"date":"12 June 2014","review":"Low budget Australian affair about an obscure and remote mental \"hospital\" whose star patient, Patrick, forges a bloody bond with new smart and able but unsuspecting nurse Kathy Jacquard (Sharni Vinson). The opening prologue seems to promise another predictably lame slasher flick, and the entire film is a little slow to develop, yet the last half-hour or so entails some interesting and creative layers and twists. This film becomes a lot more distinct once we get to know Patrick's story. Decent all-around acting, with good performances by the three women who play the nurses: Vinson, Rachel Griffiths, and Peta Sergeant.<br><br>It seems the makers were trying to create a circa 1950 Gothic horror film set in the age of GPS with modern horror tropes (something like that). A valiant attempt, but PATRICK would have been better if it were more consistently modern. Many of the props (nurses' uniforms, etc) look unrealistically antiquated, and the outside views of the hospital. . .well, you can tell it's not an actual building. The constant rubber stamp suspense symphony soundtrack also gets a little annoying--There's just no need for it except in a few select spots. All the same, none of the various weaker points should get too much in the way if you're a big horror fan.<br><br>Some brief \"incidental\" nudity and a fair measure of really nasty-gory death and dismemberment. Still, PATRICK makes good use of its gore, using it briefly and shockingly.","user":"doug_park2001","rank":[13,13]},{"title":"My Review Of \"Patrick\" 2013","rating":7,"date":"10 April 2014","review":"\"Patrick\" is a remake of the classic 1978 film of the same name. This updated telling of the somber, clinical horror is directed by Mark Hartley and stars Charles Dance, Rachel Griffiths, Sharni Vinson, Peta Sergeant, Damon Gameau, Martin Crewes. \"Patrick\" is the story of a young man in a coma who is the subject of a mad scientist's cruel and unusual experiments. When Kathy Jacquard, a young nurse, begins working at the isolated psychiatric facility under Dr. Roget, she becomes fascinated with Patrick and soon the comatose man begins showing signs of supernatural abilities. <br><br>The story in \"Patrick\" is a really dark, nefarious tale of mad science and extreme circumstance. \"Patrick\" takes on the most colorful of urban myths where cold, calculative doctors explore scientific discovery and notoriety at the behest of the helpless patient. It is the core of most nightmares surrounding hospitals, clinics and mental institutions. So \"Patrick\" is a story that should please any horror fan. This film offers the same evenly-paced melancholy with a bit of unease as the classic version, but the updated look and feel give more edge to the film. There isn't a big change to the story or situations in this remake generally speaking which normally would make a remake pointless and boring but with \"Patrick\" there is still that creepy, since of dread and chilling coldness that the original film held. <br><br>The acting in \"Patrick\" is pretty standard for a film with a nice enough budget. The actors are all well known from various other ventures and their ability to give life to the characters shows on screen. This film doesn't demand to much depth or complexity of character and the director doesn't offer anymore than what the original story called for which works but at times kind of gives the film that whole \"going through the motions\" sort of vibe. Still the actors offer believable, solid performances and the dramatic overture to their interactions presents a traditional macabre performance. <br><br>The special effects and soundtrack used in \"Patrick\" is tight, much like the acting, with plenty of creative gruesomeness. The kill scenes aren't as visceral as most modern horror films tend to be but they work and offer enough blood-n-guts goodness to satisfy. The suspense isn't really as strong as I would have like, especially considering it is a remake of such a notable cult classic. Maybe cause I saw the original more than once this film just seemed like a \"basic\" update which isn't saying anything bad about it, it just would have been nice to see the extra effort made to shock and thrill those of us who where familiar with the original-offer a modern, fresh atmosphere of fright. The soundtrack is eerie enough but still much like the shock factor it doesn't really heighten the suspenseful nature or chilling overcast of the film. That being said \"Patrick\" is an entertaining, creepy film that manages to breathe new life in a horror story classic.","user":"ASouthernHorrorFan","rank":[11,12]},{"title":"Telekinetic power","rating":7,"date":"20 February 2015","review":"I never saw the original one so I can only review this one without comparison. I see that the first one gets much more stars so I might watch that one as well in the future because I already liked this remake. The whole movie was not boring at all like many other horror movies. Instead I thought the storyline was well intriguing and it keeps the audience interested during the whole movie. All the actors were fine to me, nobody bothered me at all. Charles Dances as doctor Roget gave a good performance as usual. The music and sound was perfect for the suspense. Definitely a good horror/thriller to watch on a cold dark evening.","user":"deloudelouvain","rank":[7,7]}]