[{"title":"And the pain of hunger and heat","rating":7,"date":"1 February 2014","review":"I'd bet a lot of white people look at this movie at first glance in a 'Blindside' type of way. This isn't a black movie or a white movie or a white guilt type of movie or exploitation type of movie.<br><br>The Inevitable defeat of Mister and Pete is just a good movie about a young boy with dreams, in a terrible spot. His mother is doped out, he lives in a rough neighborhood and there is no way for things to get better (even though he aspires to become an actor and make a better life for himself).<br><br>When the police crack down on the drug trade in his neighborhood, his mother is picked up. Mister and Pete (the young boy who was staying at his apartment because his mother was on a binge) spend the summer trying to survive and stay out of riverside orphanage.<br><br>A hallowing story about life--not black life or the ghetto, a story about life when things are bad and all that matters is surviving, the Inevitable defeat of Mister and Pete takes the viewer into a world they most likely never see.<br><br>This movie had a great message of survival and perseverance and hope and left me believing, if I just keep living and fighting, everything will work out.<br><br>The dialogue at times was a little forced, I felt, to convey the situation of helplessness--but I can live with that, as the script on a whole was pretty good. It's hard to convey so much with just dialogue and I thought the writer, Michael Starrbury did a pretty good job.<br><br>It was well Directed, but George Tillman Jr has proved he is an elite director imo.<br><br>Skylan Brooks (Mister) probably set himself up to be in countless movies in the future and I'd like to see him in a comedy next.<br><br>Jennifer Hudson, even though she didn't have that many lines was able to fulfill her role perfectly.<br><br>This was a good movie and definitely worth the time it took to watch it.","user":"pcrawake","rank":[33,35]},{"title":"This film needs a much higher rating","rating":9,"date":"26 January 2013","review":"I saw this film at Sundance and the cast and crew got about four standing ovations. People who raved about Fruitvale said this film tops it. This a great film! This film is a cross between Spike Lee's Clockers (1995) and Hirokazu Koreeda's Nobody Knows (2004), with a bit of Fresh (1994) mixed in. Based on a true story, Nobody Knows portrays siblings who are abandoned by their mother and forced to survive on their own. Resiliency is a trait of many urban kids. Even in tragedy they were just kids. Mister and Pete doesn't try to let the audience \"off the hook\". The performances pull you in, or at least it did for me.<br><br>I was surprised to see how low the ratings were for this film.","user":"nettrice","rank":[70,80]},{"title":"Amazing actors telling an often overlooked story","rating":10,"date":"4 October 2013","review":"I was lucky to see this at the Milwaukee Film Festival with the director, writer and two leads in attendance. The children who play the 2 main characters gave incredibly honest and nuanced performances, especially considering the harsh reality of the characters. Skylan Brooks has some real acting chops and I can't wait to see what he does next. <br><br>Apparently it took quite a while to get the film funded and then distributed - until some bigger names like Jennifer Hudson signed on, they studios responded saying \"No one will pay to see a film about inner city children.\" This film, however, is not only important (because of its oft overlooked subjects) but also beautifully told with compelling characters. I found myself laughing as well as gasping in shock, sitting on the edge of my seat, and tearing up. <br><br>Even 5 days after seeing it, I'm still thinking about it and how this story plays out every day. Now that's a well told story!","user":"meganmcgee","rank":[42,52]}]