[{"title":"War as the true test of friendship","rating":8,"date":"28 July 2013","review":"This film is surprisingly good. Very low budget with few sets or special effects and literally no adult actors, I Declare War nonetheless scores extremely high on the thought provoking barometer. It forces us to examine the real nature of friendship and perhaps to realize that true friendship is sadly extremely rare.<br><br>A group of about a dozen boys play out a war game in the local woods. There are strict rules of engagement and death is established through a direct hit with small balloon filled with red dye. No one is meant to get hurt but, as with all wars, rules are broken and the passion of the moment has its own momentum.<br><br>But this is not just a plot about the corrupting effects of aggression and power over victims. A whole series of relationships exist amongst these boys. The leader of one side has a 'best friend' whom he protects above the safety of others whilst the opposing commander, a dreamy eyed beautiful youth, is befriended by a besotted girl who will stop at nothing to impress him. There are ex-friends who have become enemies, jilted friends who wish to regain their standing and just normal mates who hang out with each other under the guise of friendship.<br><br>Each of these relationships is put to the real test and each is exposed for what it really is. In the end there is only one true friendship amongst them all and the stark reality of our own lives is chillingly revealed. This is not a film about war but actually about love. It is well worth seeing for all age groups.","user":"RichardvonLust","rank":[17,23]},{"title":"What happens when innocent fun gives way to danger? Classic theme well-executed.","rating":9,"date":"9 October 2012","review":"In the tradition of \"Stand by Me\" and \"Lord of the Flies\" comes a poignant dark comedy that puts a timely spotlight on the games kids play and the consequences of seemingly innocent actions when fun gives way to danger.<br><br>Jason Lapeyre and Robert Wilson co-directed from a Lapeyre script. Wilson is an accomplished producer -- this is his second feature directorial effort (he serves as a producer on this as well). This is Lapeyre's followup to his first narrative feature \"Cold Blooded.\" The movie had debuted as a work-in-progress print at ActionFest in North Carolina in April, where it took home the jury prizes for Best Film and Best Screenplay. It went on to a triumphant premiere at last month's Toronto International Film Festival. It took top honors here in Texas, winning the Fantastic Fest Audience Award.<br><br>The premise of \"I Declare War\" is deceptively simple -- a group of kids gets together on a regular basis to play war games in the woods, challenging each other in mock battle with harmless paintballs and tree branch bazookas. We used to play cowboys and Indians with water guns and toy pistols. Some of us graduated to Civil War reenactments. We turned out okay. So when these youngsters choose to head out into the forest and get a good physical workout trying to steal the opponents' flag from their home base, while most of their peers are engrossed in role-playing games on their computers, this looks like a marvelously healthy alternative.<br><br>But boys will be boys, as they say (okay, there is one girl), and the situation inevitably turns sour. Rivalries turn real as jealousy, love, and loss come to the fore, and some players take the game one menacing step further. The timely topic of bullying suddenly rears its ugly head as we see its root causes on display before having the chance to look away. As in 2004's \"Mean Creek,\" one of my all-time favorite indies, innocent joy turns to potential tragedy as the line between fantasy and reality blurs both on screen, for the viewer, as well as in the minds of the youngsters.<br><br>What the kids begin to see in their minds -- a stick of wood is suddenly a rifle, a paintball is a real grenade -- is reflected in the film itself. This is just one of the many masterful strokes that sets \"I Declare War\" apart from its brethren and makes it such a powerful cinematic experience in its contribution to a rich cinematic tradition, the classic morality play writ large when the protagonists are vulnerable adolescents.<br><br>This character-driven study on the limits to which a man/boy can be pushed rests on the abilities of this age-consistent ensemble cast to make these characters believable. Without that the narrative would fall apart like an army facing mutiny. Standouts include Gage Munroe as PK and Michael Friend as Skinner. Both turn in frighteningly genuine performances that may draw a tear or two. All team members are on somewhat equal footing in significant roles with few in background support. Kudos must go out to Siam Yu, Aidan Gouveia, Mackenzie Munro, Alex Cardillo, Dyson Fyke, Spencer Howes, Andy Reid, Kolton Stewart, Richard Nguyen, Eric Hanson, and Alex Wall. Another bold choice -- there are no adults in this tightly-focused production.<br><br>The movie's authenticity also stems from its unscripted feel, as the youngsters were encouraged to insert dialogue using their own teenage vernacular and improvise where it was agreed the young actors would best know how to behave in a certain situation. The language is raw, to be sure, not unlike my 2012 SXSW Film Festival favorite \"Funeral Kings,\" with F-bombs galore and enough obscenities to make their parents blush. But it always effectively serves the plot and is never gratuitous or overtly offensive.<br><br>Production values are well above the typical indie or foreign film. The entire picture was shot in one exterior location, a seemingly simple task made much more difficult by the limited hours allowed for underage actors and inability to avoid shadows no matter how well lit. Still, it always appears to be magic hour with the kids awash with the stunning beauty of nature, bathed in sunlight, their angelic innocence filling the screen.<br><br>Composers Eric Cadesky and Nick Dyer have crafted an intricate score that's surprisingly heavy, serving as a perfect dramatic counterpoint to the child's play in the great outdoors. The action dictates the viewer's emotions, not the clichéd tugging of heartstrings with violins and cellos, and that's as it should be.<br><br>The camera-work is virtually all Steadicam, affording cinematographer Ray Dumas the ability to maintain fluid motion throughout, despite the natural obstacles inherent in shooting on a forest floor. The combatants often move with the frame and not through it, as though we were running right alongside them. These tracking shots bring the viewer right into the action, allowing us to feel as if we're part of the game. But we're playing both sides -- but they don't know that -- and that's part of the fun of I Declare War. Spies abound, and you're one.<br><br>\"I Declare War\" also works because we've all been there, more or less -- every audience member will see a bit of their golden youth in one or more of these kids, for better or worse. If painful it can be cathartic. If pleasant it's sweetly evocative of a time past to which many wish we could return.","user":"larry-411","rank":[25,37]},{"title":"War ... It's child's play","rating":7,"date":"8 April 2013","review":"Like many fellow viewers at the Brussels International Festival of Fantastic Films that afternoon, I didn't have any clear idea on what to expect of \"I Declare War\". It plays at this prominent and reputedly brilliant genre festival, so it must contain some sort of significant cult value, that's for sure. But what exactly to prepare for, I didn't know Drama and valuable coming of age life lessons like in \"Stand By Me\"? Adventure and thrills like in \"Lord of the Flies\"? Or maybe something entirely unique and innovative like \"War of the Buttons\", or something extreme and shocking like \"Battle Royale\"? It became somewhat of a mixture of everything, in fact, and yet at the same time something totally new and original. Although I certainly can't state that \"I Declare War\" is one of the greatest and most eye-opening films ever made, I'm nevertheless very glad that I watched it and wouldn't hesitate to recommend it to a wide variety of film fanatics. It's an atmospheric and occasionally very suspenseful motion picture with sublime performances from the youthful ensemble cast (not a single adult in the film) and a well-scripted scenario that thankfully doesn't get overly moralizing or metaphoric near the finale. It's summer vacation and the neighborhood boys gather every afternoon in the woods to play war. The rules are quite simple: two camps and two generals instructing their teams to capture the opponent's flag through smart tactics and ingenious war strategies. The soldiers use wooden sticks and water balloons, but through their vivid and wildly imaginative eyes we see rifles, machine guns, bazookas and grenades. Today also promises to become a special day for the troops, as there will be mutiny within the platoons, female soldiers joining for the very first time and ordeals that will genuinely put the soldiers' friendships to the test. \"I Declare War\" is reasonably fast-paced and benefices from terrific filming locations as well as from steady direction and – as mentioned already – stellar performances. The sound, visual and make-up effects definitely aren't childish, but neither are they provocative or graphic. In other words, this isn't just intended for physically grown-up people, but also for emotionally mature audiences  largely accomplished by kids! What I appreciated most of all was that, at all times, the children remain in fact children. Their reasoning, motivations and interactions are exactly like any child of whatever origin or culture would react. That sounds logic, but it really isn't as the movie will make clear, and that's why it's such an impressive and highly recommended effort.","user":"Coventry","rank":[14,22]}]