[{"title":"Aussie drug trafficking tale based on actual events","rating":8,"date":"17 March 2016","review":"This is a really well made film; the plot surrounds Ray who is a bit on the 'slow' side. He plays a bit of 'footie' at his local club and mends electrical goods for a living. Still at home with his parents who are having financial problems. So when he gets made an offer by one of his closest mates to earn some easy cash – he decides to go for it.<br><br>It involves a trip to Thailand and more importantly a return trip with a rather full stomach. What follows is a story that had me totally gripped. There are some truly disgusting scenes here too so really make sure you are nowhere near food while this is on – and for a while after.<br><br>The acting is all top notch - Ray is played brilliantly by Angus Samson ('Fargo') but the real plaudits have to go to the perfectly horrible cop – Det. Tom Croft played by the superb Hugo Weaving ('Mystery Road') who oozes bad cop in a way that balances sleaze with old school policing and the tension is pounding for most of thisthriller – completely recommended.","user":"t-dooley-69-386916","rank":[11,12]},{"title":"Australian Black/Comedy that should NOT be overlooked","rating":9,"date":"22 November 2014","review":"When people form opinions about Australian Cinema, they generally base that opinion on previous Australian films with successful backgrounds, i.e.; Animal Kingdom, Chopper etc. What Angus Sampson has created here is a fantastic, moody, brooding black comedy/drama that surpasses most of the tripe that comes out of the US and Australia, but also that stands alone as a film that really works on all levels. Ignore Sampson's past achievements in the form of 100 Bloody Acres and the Insidious franchise etc. This film is a winner, and it's completely different. It is a stand alone film that pulls all the right triggers at all the right times. Sampson, having written, produced, starred and co-directed shines here as a shy and humble first time drug mule. His reluctance to be a participant in the smuggling leads to his fumbling through airport gates leading him to a minor cavity search that lands him locked up in a hotel for 7 days, guarded by Federal Police, waiting for the contents to pass through. The premise has been done before, however Angus Sampson brings the character to life and watching him hold on to number 2's for days is both uncomfortable and hilarious. This film is by no means a comedy. But throughout the film, the banality of simple Australians can't be helped but laughed at as they stumble through the complications of their lives. This film is a great Aussie crime drama that will stand up to the test of time like Animal Kingdom and Two Hands.<br><br>Definitely worth the watch and Angus Sampson is also one to watch in the future.","user":"malbanese","rank":[32,43]},{"title":"'The Mule' is a fresh and original 'drug mule' centered film, that will both make you laugh and sick at the same time. I couldn't get enough of it.","rating":8,"date":"12 August 2015","review":"We've seen our fair share of 'drug mule' films over the years. Everything from Nicolas Winding Refn's 'Pusher' to 1996's 'Drug Mule' to 2004's Oscar nominated film 'Maria Full of Grace', and even last year's 'Lucy' that starred Scarlett Johansson. But we haven't seen anything quite like 'The Mule'. Written by Leigh Whannel and Angus Sampson (both from the 'Insidious' franchise), this drug fueled film is quite comical and abundantly gross.<br><br>With all all-star cast including both Whannel and Sampson, Hugo Weaving, and John Noble, 'The Mule' should keep your attention and keep you laughing, if not squirming in your seat. Most 'drug mule' films follow a poor unfortunate soul who has dozens of condom wrapped drugs in their body, as they pass through airport security to their next stop without getting caught. However here, 'The Mule' presents a different type of situation.<br><br>Set in 1983 during the American Cup Yacht Competition, a group of people at a bar are betting and having fun watching the contest. Club President Pat (John Noble) has secured enough funds to take his team to Bangkok, but he has secretly fixed the Clubman of the Year contest so that the friendly yet dumb Ray (Sampson) would win this year. In fact, President Pat is also into gambling, loan sharking, and other forms of criminal activity including the drug trade. His goal is to use Ray as a drug mule for heroine, by telling him that his father owes him money and threatening his mother.<br><br>Once Ray swallows the dozens of condoms full of heroine, you'd think that he would pass through airport security fine, as we've seen in other film over the years. But just like Ray said to his childhood friend Gavin (Whannel) who works for Pat, \"I won't be any good at this.\" And he isn't. Ray is quickly picked up by airport security for looking nervous and suspicious. The standard over-the-top bad cop/good cop duo comes in Detective Tom Croft (Hugo Weaving) and Les Paris (Ewen Leslie) to question Ray.<br><br>Back in the 80s, the laws in Australia said that authorities could keep you for a week under tight scrutiny to see if the drugs come out. And that is where 'The Mule' takes us. A week long of literal gut wrenching and messy instances as we say Ray try to keep the heroine inside his stomach while being beaten, and eating for a week without doing his business. If you have stomach problems or are easily sick, you might want to cover your eyes a few times here.<br><br>Whannel and Sampson have perfectly crafted a highly entertaining story where each character has something they're hiding, which turns up towards the end. Each character's story arc is engaging and comical, even if things end tragically. Sampson does an exquisite job of playing the dolt who is forced into a horrible situation, but stays loyal. And Hugo Weaving plays the deranges police detective who is not above torturing and beating his suspects is one of the best parts of the film. Every time he's on screen, you don't want him to leave, even if he is a bad guy.<br><br>'The Mule' is a fresh and original 'drug mule' centered film, that will both make you laugh and sick at the same time. I couldn't get enough of it.","user":"bryank-04844","rank":[8,9]}]