[{"title":"An interesting idea completely wasted in a boring film","rating":4,"date":"21 April 2014","review":"Some obscure television actors wanted to play in a movie and they chose this one. I can only call it a bad career move.<br><br>The basic idea of the film is that a \"cure for cancer\" was found. It not only cures all types of cancer concomitantly, but it is also a single molecule, easy to produce. The problem with this type of medicine is that it is a lot less profitable than painful drugs with side effects that rarely cure anything, therefore the evil medical corporation withholds it and instead pretends to always develop new, better stuff.<br><br>It is an interesting concept that might work if explored properly. Unfortunately we instead get a bunch of emotional \"young brilliant researchers\" running around the medical facility followed by incompetent bad guys while they explore their various insecurities and emotional issues. They also explore those badly, so there.<br><br>Bottom line: The Cure does a pathetic and predictable bait and switch, pretending to discuss the moral and financial angles of a real cure for cancer and instead giving us a low budget, badly acted, chase in a locked building movie.","user":"siderite","rank":[11,12]},{"title":"The Cure: Good ideas, flawed execution","rating":6,"date":"1 February 2018","review":"I'm not a big conspiracy guy but The Cure deals with one that personally I think is very feasible. I'm referring to the cure for cancer existing but it being more profitable to treat than to cure.<br><br>The story is powerful and heart wrenching, made even more impactful by just how realistic the concept is.<br><br>I was really enjoying it but was saddened to see two things take place. One character bounces from being likeable to detestable every other scene like I've never experienced before.<br><br>Secondly the story becomes a bit far fetched, I'd have rather have seen a slow burning thriller without the need for guns and explosions. The front cover even shows it off to be exactly that, but it should have been so much more.<br><br>The Cure is a USA/NZ joint venture and a passable one at that, but it should have been better. If only they'd kept their feet on the ground.<br><br>The Good:<br><br>Excellent concept<br><br>Cast do a decent job<br><br>Mostly well written<br><br>The Bad:<br><br>Inconsistent characters<br><br>Gets a bit daft by the end<br><br>Things I Learnt From This Movie:<br><br>If you don't think the worlds governments/big pharma companies would/will do this you're out of your mind<br><br>Not every movie need guns damnit","user":"Platypuschow","rank":[5,5]},{"title":"A brief review","rating":3,"date":"4 May 2014","review":"Okay, there's a number of reviews here already ranging from horrible to mediocre. They really should be sufficient to give you the right idea. But on the off chance they don't...<br><br>I started watching The Cure with the best intentions as I'd read no reviews. I figured it'd be in the same vein as Contagion or REC. This is not that film.<br><br>Go ahead and watch if you wish. Ignore the warnings presented to you. In a digital era there's little harm in giving something 15 minutes. But! If after 15 minutes the alarms in your mind have yet to ring out \"Hmmm this is a bit rubbish\" maybe you'll be able to manage the rest of the movie and be amongst those who'd rate this a 5.","user":"Quotius","rank":[7,9]}]