[{"title":"A Nutshell Review: Dead Mine","rating":7,"date":"26 September 2012","review":"Dead Mine chalked up a number of firsts in the region, being HBO Asia's debut original feature, and Singapore based company Infinite Studios' new soundstage facility in Batam, Indonesia being used for the production. Technically, the movie boasts some excellent production values, from stunts to props, sound engineering and special effects to art direction, with the soundstage adding a dimension to filmmaking around the region, with one more slated for Singapore, but as the adage goes, never forget about the story, as it is still king.<br><br>The screenplay by Ziad Semaan and director Steven Sheil has an interesting premise, but unfortunately lapsed back to genre clichés. If the pace was kept high, and story tight, then Dead Mine would have been something of a shiny debut for the collaboration between companies and geographies. As an action-horror, it took quite a while for characters to be established around the usual caricatures that pepper the genre already, before the first big set action sequence acted as catalyst for the narrative to move forward, thrusting the entire cast into the titular location. Things slowed down a lot, in between posing, spewing rote dialogue, and traversing the many nooks and crannies of Dead Mine, but when it finally shifted to the high gear, it showed potential that never really reached a high.<br><br>Centered around the legend of Yamashita's treasure, the WWII Japanese General who had been rumoured to stash some handsome gold somewhere in the South East Asian region, Sulawesi, Indonesia becomes zeroed in for exploration, funded by corporate rich kid type Price (Les Loveday), who had brought along his girlfriend Su-Ling (Carmen Soo) for the ride, with his engineer Stanley (Sam Hazeldine) in tow, and researcher Rie (Miki Muzuno) to provide the brains for their expedition. Needing protection as they enter a foreign land, they engage the soldiering mercenaries in Captain Tino Prawa (Ario Bayu), with his rag tag team consisting of Djoko (Joe Taslim), Ario (Mike Lewis) and strong man Sergeant Papa Ular (Bang Tigor). My initial fears it may be something like Sanctum, but thankfully this was better, but not without its own illogical moments that exist for plot convenience.<br><br>Once they get all chummy and acquainted, the set action pieces are what stands out in the film, aside from the nicely done production sets that made the Dead Mine an incredibly believable location, with two separate tiers being the sandy underground, and the concrete labyrinth above it which suggests the location was more than a potential treasure store, but houses something a lot more sinister, harking back to experiments and torture. There's no lack of gore that adhered to a limit set to keep the ratings as low as possible, so plenty of violence actually happen offscreen, before cutting to show the bloody, gory end result.<br><br>And the makeup and costuming department is no slack either, having creature designers work overtime to come up with Mutant POWs, which serve up a lot more terror than the more powerful Imperial Guard type enemies decked in Samurai gear, because as mentioned, the pace could have been kept high to add a degree of urgency, tension and genuine dread to the entire situation. There's plenty of running, and careful treading within the mine, but a little speeding up of lengthy explanations would have been appreciated, and perhaps making it a wee bit more of a fair fight would have sweetened it up a little, than to have it quite one- sided.<br><br>Between the cast members, I thought the Indonesian actors triumphed in the film, especially with Ario Bayu's charismatic allure that made it believable that he's the de-facto leader a skilled crew would work under. Anyone who had watched The Raid: Redemption would be familiar with Joe Taslim, and it's interesting now that Hollywood had already come knocking on his door with the Fast and Furious franchise. Unfortunately he has only a bit role here, and doesn't show off his martial arts for his role. Bang Tigor is yet another actor with immense presence on screen, and that's not because he's bulked up.<br><br>Still, Dead Mine is a genuine showreel of the kind of production HBO (and its Asia arm) is capable of, with a decent production budget, collaborating with talent in the region, both in front of and behind the camera, and yet again a testament to Infinite Studio's promotion of how a soundstage facility that's really a first of its kind here, could benefit filmmakers to be a little bit more ambitious in telling a story that can be set almost anywhere the imagination dares to venture. So long as it's driven by a strong script, I'm pretty sure we can be set for a lot more variety in the kind of films that could be told in the months to come.","user":"DICK STEEL","rank":[39,57]},{"title":"A Good Example of How Bad a Movie can Be","rating":2,"date":"26 July 2014","review":"In an isolated island in Indonesia, an expedition is apparently seeking the legendary Yamashita's Gold. Out of the blue, they are attacked and seek refugee in an abandoned Japanese bunker. Soon they discover that the place was a secret laboratory in the World War II where the prisoners were guinea pig in weird experiments. Further, they are trapped inside with strong and resistant creatures created by these experiments. Will they succeed to escape from the dead mine?<br><br>I really do not understand how producers (HBO, not Sci-Fi) can spend their money in garbage like that. The story is a terrible rip-off of \"The Descent\" and I believe anyone who read it would have at least some doubts to make a movie. The dialogs are extremely poor and the motive of the expedition is a mess. Who are the guys that shoot the expedition? How the Japanese survivor had eaten and drunken along all those years trapped in the bunker with the creatures? How someone could inject a rusted syringe with a sixty and something year-old substance in another person with the intention of healing him? The group splitting to be more easily killed is one annoying clichés. The awful lack of conclusion seems to show the intention of a sequel, meaning more wasted money. Last but not the least; the acting is more dreadful than the creatures. My vole is two.<br><br>Title (Brazil): \"Mina Abandonada\" (\"Abandoned Mine\")","user":"claudio_carvalho","rank":[14,19]},{"title":"It started out great, but flopped tremendously...","rating":3,"date":"7 September 2013","review":"I remember the first time I saw the poster for this movie, and I decided to stay clear of the movie, believing it to be something in the likes of the \"Chernobyl Diaries\" movie also from 2012, as the poster is much alike, and that \"Chernobyl Diaries\" movie was just abysmal.<br><br>Then come 2013 and I found out that Joe Taslim is in this movie, so my interest was instantly caught, and I decided to give the movie a go regardless of prior assumptions.<br><br>And now having seen it, I sit here with a really bad taste in my mouth. The movie starts out well enough, but then it just peaks and becomes too much, and the movie just spiraled out of control and everything just fell to the floor.<br><br>The story is about a group of hired soldiers led by a treasure hunter to seek out the fabled Yamashita's Gold treasure. As the group becomes trapped inside an old mine dating back to World War II, they quickly figure out that they are not alone in the dark mine.<br><br>Right, well the story did have potential to be interesting and it did start out well enough and promising enough. But then suddenly after the first revealings of what has been lurking around in the long-abandoned mine, then suddenly director Steven Sheil decided to throw in three squads of what I assume to be reanimated dead Japanese Bushido samurai warriors. And that is when the line snapped for the movie. Once these were introduced, the movie just went from an adequate action horror movie to a laughable attempt at an action horror movie. It was just awful and abysmal to witness. These animated samurai warriors totally killed any shred of enjoyment and entertainment that the movie had.<br><br>As for the acting, then people were doing good enough jobs with their given roles. And as I mentioned earlier, then it was because of Joe Taslim that I decided to give this movie a chance. Unfortunately his role wasn't all that big, much to my disappointment.<br><br>It should be said that the movie actually does fare well on the effects and creature make-up department. Thumbs up for that, at least.<br><br>I supposed this abandoned mine should never have been opened, and then at least I wouldn't have wasted 87 minutes watching it.","user":"paul_haakonsen","rank":[9,12]}]