[{"title":"complete waste of time","rating":1,"date":"8 February 2015","review":"From the beginning of the movie you will hate Charlie O'Connell idiotic character, if the director is trying to create a new \"Villian\", he failed miserably, the character is dumb, slow, almost like he have a mental problem. The dialogues are just...unbelievable...non sense...rude and completely weird. There is not a single character you will think \"ok, movie sucks but the acting of...\", forget it this will never happens. The script is crap, the acting is primary school level and the cameras...oh dear... In total there are like 10 people in all the movie, effects are far from awful, are like 700 steps under awful... The action parts are like \"they are really trying to make an horror movie?!\" The old school \"boobs + gore + pretty girls + scary character\" it is far from being accomplished, there is nothing that makes people get related to this movie. This movie is not even attractive from the Bizarre/b-movie point of view.<br><br>Just...awful...","user":"fabioloust","rank":[9,15]},{"title":"It sucked","rating":1,"date":"5 February 2015","review":"OK, don't read this at all until after you see it if you care more about spoiler than wasting your life.<br><br>First issue is that casting was horrible. Three daughters look basically same age as their mother, which is around 30. They are supposed to behave like they are under 16 or something, or its another attempt by some idiot to try and say that 17 year olds are 'children', either way, I saw them as used up by life, not as children and as thats kinda main point of film, it failed right from start.<br><br>Second thing that really sucked majorly is that Huff character (name of main guy apparently, who is supposed to represent 'the wolf') is highly inconsistent. He has asthma which seems to be so severe that he can barely do anything, yet here he is running around actively. Person who wrote the character is clueless about asthma, and as I am not it killed it for me.<br><br>I cant say I got point of his quoting the Bible few times as he was obviously nonreligious. I am agnostic, but it just felt like retarded extremist atheist portrayal of retarded extremist Christian ... maybe that was whole point of entire film.<br><br>I found it to be garbage overall, although actor playing Huff did great job acting. Probably only person in the entire film that did something actually productive.<br><br>My advice to Huff actor playing Huff: Dude find a better agent. You can do much better than this type of crap films, you've got talent.","user":"jackhuntermtl","rank":[3,8]},{"title":"The intentions were good","rating":3,"date":"9 June 2015","review":"Pretty sure of that. I mean there are a lot of comparisons you could make to the \"original story\" this is \"based\" on. Our big bad wolf in this one, is obviously a human being, but he's as evil as they come. Almost comical evil most of the time. He also has an issue with his breath (though he never at any point tries to blow down a house ... with his breath that is of course).<br><br>You get a bunch of good looking actors, whom you can almost feel sorry for and they have to go through a lot. Jump through plot holes and such things. Not to mention all the \"silly\" acting they have to do or the convenient meetings/things that are happening all around. It's not the worst movie I've seen (by far not in that category), but the whole thing feels rather like an excuse than a good movie","user":"kosmasp","rank":[2,5]}]