[{"title":"Falls flat on so many levels","rating":2,"date":"30 December 2013","review":"I'll keep this simple. The story is bad, made absolutely terrible by some of the worst voice-over work I've had the misfortune of hearing, and I've played some terrible games and watched some terrible films in my time.<br><br>The action is choreographed reasonably. This doesn't mean it's good, it's passable. It's noticeable too often and there is too much reliance on fighting, making it seem like it's just a wet dream fantasy of some random guy.<br><br>This wet dream fantasy is culminated with shoe-horned sex scenes or just random female nudity. Now, granted, this actually is the best part of the film for me, as a hot-blooded male who thought the film was pretty crap. The women were very attractive, but were simply there to be that, which is a shame. I say women, it was just one woman really, and a topless Asian girl right at the end.<br><br>Honestly, the film is just plain bad, start to finish. The only redeeming feature is the rare, but nice to look at, nudity. That makes me sound terribly misogynistic, which I swear I'm not (!), but it's the truth. It's not worth watching.","user":"halbarad_loire","rank":[23,25]},{"title":"So bad it has to be seen to be believed...","rating":2,"date":"17 April 2014","review":"\"Dragonwolf\" was really a horrible experience to sit through. Not only because of its mediocre storyline, but more so because of the wooden and wooden acting and laughable dialogue all the way throughout the entire movie.<br><br>The story is about Mozart (played by Kazu Patrick Tang) whose mother dies when he is a boy, and Julius (played by Johan Kirsten) promises to look after him, essentially adopting him as a brother. As grown ups, the brothers are living on the shadier edge of the law, both having fallen for the same woman.<br><br>This movie takes place in Thailand, but for some odd reason everyone is speaking English throughout the movie, even Mozart's mom during the start of the movie. Having everyone speaking English didn't really help to make the movie any better.<br><br>I must confess that I have never seen as bad acting as I did in this movie from the guy who played the shaman and one of the goons (who were on the mountain with a binocular and saying that the woman was his project now) who worked for Julius. Wow, that was just horrible to bear witness to.<br><br>The one thing of the two things that this movie has working for it is the martial arts. There are some nice fighting scenes, although you can see that they are choreographed and rigidly executed, especially during many of the kicking scenes as they don't even try to hit one another. Despite having some fair action scenes and sequences throughout the movie, they could do nothing to lift up the movie, much less make the movie worthwhile.<br><br>And the second thing that works for the movie is the fighting and stunt talents of Kazu Patrick Tang.<br><br>Thai movies usually are nice, but of course, it would be ignorant to think that every single Thai movie will be great, and \"Dragonwolf\" is the testimony that proves the theory wrong. Boy was this a horrible movie.<br><br>And the movie ran for about 120 minutes, which was a painful length, because the movie was slow, dimwitted, dull and most often uneventful. \"Dragonwolf\" is not one of the prouder moments in Thai cinema. Should you be unfortunate to sit through and bear witness to this movie, trust me that you will soon forget about the movie once it finished (provided you make it to the end, of course), and you will not look back to make an additional viewing of this movie. I guarantee it.","user":"paul_haakonsen","rank":[15,20]},{"title":"Who let the dorks out?","rating":1,"date":"5 November 2013","review":"Our two heroes belong to an \"Institution existing many generations\" (oh boy) as the \"filmmakers\" put it.<br><br>Apparently some other guys from another \"institution\" for some reason don't really like our heroes.<br><br>But instead of just shooting and being done with them they decide to fight them in endless lame martial arts battles in always the same abandoned, derelict buildings.<br><br>There is really not much else going on.<br><br>I guess the filmmakers have been let out their \"institution\" way too early or they were treated with the wrong meds. (I call them \"filmmakers\" but they are not really filmmakers.) Do I really have to mention that the actors suck as much as the script, the cinematography (if you really want to call it that) and the \"directing\"? If you really want to waste your time watching some dorks beating up other dorks then you'd better also check into some kind of \"institution existing for many generations\".<br><br>But make sure they don't let you out early like all the zero talent guys who have made this crap.<br><br>Where are Bruce Lee and Jackie Chan when you need them? Oh crap.","user":"Shizuka2008","rank":[22,33]}]