[{"title":"Emotionally draining but truly moving \"ripped from the headlines\" story","rating":10,"date":"3 October 2012","review":"\"The Hunt\" is the latest unflinching drama from Danish auteur Thomas Vinterberg. Co-written with Tobias Lindholm, this is an ambitious star vehicle for legendary actor Mads Mikkelsen, an icon in Denmark and familiar face around the world as well. He plays Lucas, a small-town kindergarten teacher. At its heart the story is ultimately a powerful comment on prejudice, based on true incidents, that may leave you emotionally drained but truly moved.<br><br>To delve into the plot here would reveal too much. So I'll just say that the film is quite dark and deals with some very difficult subject matter that can be very hard to watch at times. I'll leave it to you to decide if you want to be more aware of the details by looking up a basic synopsis.<br><br>This is essentially a one-man show. While supporting cast members are all up to the challenge, Lucas is on on screen virtually every moment of the movie and its overall success rises or falls on his believability. Mikkelsen's delicately underplayed characterization of a man under fire likely won't be appreciated or understood by all viewers. His restrained performance is remarkable and does much to make The Hunt a haunting, memorable experience. Among the children, Annika Wedderkopp's portrayal of Klara is frighteningly brilliant. She steals every scene she's in.<br><br>The physical beauty of the production belies the ugliness beneath. Natural lighting is used to match the heights and depths of the kindergarten children's emotions. Their innocence is reflected in its intensity. When surrounded by love, they are glowing. The color palette is warm and inviting. As fear rises, they appear in shadow. The tableau turns increasingly darker as the narrative does.<br><br>This is a very quiet and thoughtful experience in many ways. Nikolaj Egelund's score is sparse. Editors Janus Billeskov Jansen and Anne Østerud keep the pace measured and deliberate. The focus is on the story. Long takes without dialogue are quite effective as so much is said in the eyes, in the faces, of Lucas, the kids, and townsfolk. Cinematographer Charlotte Bruus Christensen allows the lush landscape of the Danish countryside to lull the viewer into a sense of peace, in contrast with the turmoil just under the surface, ready to jump out like a demon in a horror film. But these are real life nightmares, not the product of a genre writer's imagination, which chill to the bone.<br><br>Hollywood could never touch this subject and have anywhere near the impact. Backed independently by Swedish and Danish production companies, director Vinterberg actually intended to set and shoot the picture in Canada but better tax incentives and financing led him back to his native country of Denmark. It doesn't matter, though. This is the kind of isolated little village that can be found anywhere in the world.<br><br>\"The Hunt\" was easily the saddest film I've seen all year but in a cathartic way that only a great work of art can accomplish. It's a gritty and hard-hitting statement on our judgmental society that pulls no punches in its recounting of a controversial ripped-from-the-headlines story, repeated all too often in recent history, that's both poignant and polarizing in its authenticity.<br><br>It was difficult for me to hold back tears during the screening. I broke down several times. Many will be touched by certain scenes more than others, but \"The Hunt\" is one of the most affecting and emotional films I've ever seen and one of the best of 2012.","user":"larry-411","rank":[650,685]},{"title":"Fantastic and compelling","rating":10,"date":"17 October 2012","review":"I went to see this as part of the London Film Festival on Monday. I have to say that two days later it still resonates in my mind. Yes, it's a common tale that has been told in cinema before(man is wrongly accused and ostracised), but never so well, in my eyes. The acting is first class with no exception and the cinematography is perfect, creating a tense mood throughout the film. It's not for the faint hearted, but I think it's an important subject matter and very current. I've often wondered what it must be like for someone wrongly accused of such a crime and the hysteria that surrounds it. I have read reviews that say this is unrealistic but I don't agree, I only have to look on my own front doorstep in England to see exactly the same sort of behaviour, often far far more intense.<br><br>I highly recommend it.","user":"lilibartley","rank":[308,334]},{"title":"A film for those who stupidly believe there's no smoke without fire.","rating":10,"date":"5 December 2012","review":"Sometimes children lie.  Sometimes good people give in to hysteria, and lose all sense of  reason.  Sometimes they destroy innocent lives.  The Hunt (aka Jagten) is the latest offering from Denmark that will  knock you sideways. Forget the thrill of TV dramas The Killing, Borgen  and The Bridge, Thomas Vinterberg's film is a shocking, harrowing  experience that will affect you profoundly and will live in your mind  for a very long time. The Hunt is for those who don't need to 'enjoy' a  film to regard it as valid and who are not afraid to step into the  darkness of the injustice and judgment of which we are all capable.  More than that, it is a film for those who stupidly believe there is no  smoke without fire.  Lucas (Mads Mikkelsen) is a lonely teacher, divorced from his wife,  kept apart from his son and devoted to the young children in his care  at the nursery and within the community. He is a genuinely good man who  has earned the respect of his peers, the love of a new girlfriend and  the trust of the children who leap out of hedges to wrestle him and be  chased around the playground by him.  Klara (Annika Wedderkopp), the daughter of his best friend, Theo  (Thomas Bo Larsen) has an innocent, childish crush on Lucas when two  situations occur in quick succession. Firstly she is exposed to an  explicit pornographic image and, secondly, Lucas gently chastises her  for inappropriate behavior towards him. With a fertile imagination,  childish indignation and no comprehension of the consequences, Klara  makes an accusation against Lucas and his world implodes.  For only the fifth time so far this year, I believe I have witnessed a  near-perfect film. The Hunt is complete due to the tight screenplay,  the sensitivity of Vinterberg's direction and the performances from  principal and peripheral actors alike that are always absorbing and  frequently astounding.  Mikkelsen must certainly be the focal point of any review. His  performance as Lucas causes the stomach to tighten and the back tingle  as we wonder How would I react? In much the same way that Colin Firth's  George crumpled when receiving the news of his partner's death in A  Single Man, so Mikkelsen's Lucas is silently crushed as he is told that  accusations have been made. Lucas suffers the physical and emotional  wounds of slander and revenge for an act he cannot conceive and of  which he has less knowledge than those who condemn and attack him.  Equally, both Larsen and Anne Louise Hassing as Klara's parents  carefully unwrap the turmoil any parent would suffer upon hearing their  young child has suffered sexual abuse. It is a challenge not to yell at  the screen \"Don't be so stupid,\" or to scream expletives at Grethe  (Susse Wold) the head teacher who loses her grip on both duty and  reason and germinates the hatred and judgment that follow. As Lucas'  son, Marcus, Lasse Fogelstrøm gives a heartfelt performance segueing  seamlessly from courage to hurt to desperation and anger and his  distress is a warning to those given over to rumours.  The surprise, no, the absolute shock, with the casting is Wedderkopp.  In an adult with twenty years experience on the big screen it would be  a breathtaking performance; that this is the debut of a young child is  staggering. She is entirely believable as the girl with the vivid  imagination and understandable lack of foresight who is lead by  over-enthusiastic adults and suffers her own punishment of confusion  alone.  The tragedy within The Hunt is explicit and unavoidable. The external  tragedy is that it will probably not feature on most To See lists  because it is both foreign and that the explosions are emotional rather  than physical. Although it is Denmark's entry for Best Film in a  Foreign Language for the Oscars, I suspect both Mikkelsen and Vinterbeg  will be completely overlooked in their own right as with the principals  of Beasts of the Southern Wild. Thank goodness for the BAFTAS and Mark  Kermode! The events depicted in The Hunt are utterly horrific. Don't  sit in front of the screen expecting a light, easy, thought provoking  flick. I emerged numb, angry, helpless and terrified. But for one  careless or cruel comment, it could happen to me.  Or you.","user":"TheSquiss","rank":[267,290]}]