[{"title":"heartbreaking story","rating":8,"date":"1 January 2015","review":"It seems that people on IMDb didn't like this. I did. I thought it was about a lot more than Alan Turing being gay, and I appreciated seeing this after seeing \"The Imitation Game.\" People keep saying they want more science. A lot of it would go over people's heads.<br><br>It states right in the documentary that what made Turing a genius was the fact that, although others had broken the Enigma code, no one had ever broken the German navy code. Turing built a machine to do that. He also invented the idea of the computer years before its time, even talking about taking a computer to the park, like a i-phone. The documentary also shows some of his early inventions.<br><br>The documentary's conceit is that Turing (played here by Ed Stoppard) is talking with a psychiatrist (Henry Goodman), as he goes over his life. There are interviews with the woman to whom he proposed, Joan, with the psychiatrist's daughters, Turing's nephew, and others.<br><br>I think we learn more about Turing than just that he was gay. That he was gay is important because after serving his government and, according to Churchill, shortening the war by two years, he was chemically castrated. Pretty shabby treatment. The estrogen had an effect on his brain as well. And we know what happened in the end. A sad statement about the way heroes are treated.<br><br>I think this is a good companion piece to \"The Imitation Game,\" and I recommend it.","user":"blanche-2","rank":[19,19]},{"title":"Sometimes a Cigar is Just a Cigar","rating":9,"date":"6 February 2016","review":"After having found this obscure docudrama on Netflix I decided to look in at its various reviews on IMDb. My curiosity in the first place came from watching The Imitation Game from 2015 and wondering what else was out there on the subject of Alan Turing. I had read a good deal about him over the years but was unaware that there were several other biopics based on his life story.<br><br>Only a handful of reviews on this one, despite the popularity of others? I was intrigued. Ed Stoppard's credits on IMDb fail even to mention it. Was it really that insignificant, or a bad film?<br><br>Not at all. It is a fine piece of work, combining fact and fiction in an artful and satisfying way...an excellent accompaniment to The Imitation Game for anyone who found, as I did, the more recent Cumberbatch portrayal mysterious and vague. Codebreaker for all its faults in not going far enough into the science of computing does indeed reflect the real man and those who were integral participants in his life and tragedy. It pulls no punches. Although the role of the psychoanalyst is a throwaway gimmick, I cannot fault the Stoppard performance. It informs cold documentation very well indeed.<br><br>Nine out of ten marks without any hesitation.","user":"B24","rank":[4,4]},{"title":"fascinating and heartbreaking bio of a genius","rating":29,"date":"29 November 2014","review":"This was a wonderfully crafted biopic about the mathematic genius who cracked the enigma code, wrote a paper laying out in original plan for computers, and studied math and biology in marking in animals and insects.<br><br>He was persecuted, arrested, tried, convicted of homosexual acts in a 1950's England which was much like the persecution and ruination of Oscar Wilde. Alan Turing was a rare genius. Everyone should know his name.<br><br>Notable scientists are interviewed. An actor plays Turning during sessions with his kind Psychiatrist. If you like science, or social justice, or GLBT history then you will enjoy this film. It flew by.","user":"bpladybug","rank":[7,9]}]