[{"title":"Misunderstood","rating":8,"date":"2 July 2016","review":"I am not writing a review because unlike the others (not pointing fingers and i apologize if i offend) i don't want to spoil anything and don't want to say anything majorly about the story I see that people rate it for something it isn't and i feel like that is a problem. I just feel like people should know at least what I gathered from this film. <br><br>I have not watched the original but what i have understood is that people seemed irritated that some \"proffesional\" reviewers wrote it off as a women hating, violent movie and nothing more.<br><br>Now i have read some of the reviews for this and a lot of people say the same thing. Just a violent nasty and judges/rates it on that. IT Isn't. In fact this is one of the saddest movies i have seen. I think its wrong to say that it isn't violent. It has violence that makes you want to turn away. But its not about that. It doesn't rely on violence. The main character is a troubled man that tries to live his life, dealing with his issues. He doesn't have anyone and doesn't know how to deal with them alone.<br><br>Its a 1st person drama/thriller with a sad but beautiful techno music to blend in with the neon lighted feel of this movie. The acting of Elijah wood is brilliant in that he mostly needs to act with his voice and not his face. The story is sad and i cant help but feel sad for the main character much like The Voices staring Ryan Reynolds. The movie focuses so much on there psychological problems that it just comes of as tragic and sad. <br><br>This isn't a horror movie with no story and disposable characters. This is a character built, character driven sad movie that is beautiful both visual and story wise.","user":"edwardvincentv","rank":[43,51]},{"title":"A Remake that exceeds the original.","rating":8,"date":"17 April 2013","review":"I saw this movie at an advanced screening of what I thought was a restoration of the original movie. Instead, I got treated to movie that I didn't even know was being released. The Maniac remake is a really good movie and better than its predecessor, which was more notable for its Tom Savini gore effects and unconventional leading man than for actually being a good movie.<br><br>This flick, like the previous Maniac, dispels the idea that psychopaths are cool or bad ass. Here, Frank (Elijah Wood) is a weirdo loner that spends his days restoring antique mannequins and his nights stalking, murdering, and scalping beautiful young women. His grip on reality is so fragile that he has to chug anti-psychotics just to keep his hallucinations under control. Then he meets a pretty young French girl that actually seems to like him. Instead of offering redemption, the burgeoning relationship only makes him more unstable.<br><br>The murders are bloody and brilliantly shot and they're made dramatically more by disturbing the film's central gimmick, almost the entire movie is presented from the killer's POV.<br><br>The new Maniac does a solid job of capturing the grind-house spirit of the original film. There's plenty of sick humor, sex, and gore all well captured by director Frank Khalfoun. He also partnered with Alaxander Aja (High Tension, The Hill Have Eyes), a co-writer and producer, on the disposable P2 which sucked despite, not because of him. Then he made the superior crime flick Wrong Turn at Tahoe. Now, after watching Maniac, I have to say he is officially a director to keep an eye on. Elijah Wood also does great work as Frank, although I admit it took me a little while to get used to the idea of the stoner dork from Wilfred as a murderer. He definitely won me over by the end, though.<br><br>There are minor problems here and there, like the way the whole city is always completely deserted when Frank is stalking a victim. Still, this is a great little movie, very violent, and if you're a gore hound that's also interested in the psychology of a killer, you should watch this immediately.","user":"Kolobos51","rank":[77,116]},{"title":"Could have been a origin story for Kevin","rating":7,"date":"8 July 2013","review":"Now this movie isn't for the weak of heart or for people that have weak stomachs. The kills in this movie is realistic and very gruesome looking. Although it lacks tension, it's better than a lot of the redundant slasher movies that go straight to DVD. What is unique about this movie is that it put you in the view point of the killer and for the most part goes in a first person view direction. And just with that this movie can get difficult to watch at points. Watching this movie was liked watching a slasher version of \"Enter the Void\" except instead of a wandering spirit, it's in the view point of the killer. Elijah Wood is really good at playing this obsessive, creepy or mentally unstable psycho killer roles. And he really nails it in this one as well. Although it lacks in tension it makes up for it with the visuals and the psychological aspect of things. Now I haven't seen the original and while this is a remake, I think it's a stand alone film. It's a disturbing film from start to finish and will have most people's attention that can handle it, all the way through. Psycho slasher movie fans will most definitely enjoy this one.<br><br>7.6/10","user":"KineticSeoul","rank":[19,25]}]