[{"title":"Overlooked and Underrated.","rating":8,"date":"11 August 2014","review":"This review contains NO SPOILERS and I suggest you skip the reviews with spoilers until after you see the film.<br><br>In my opinion this film is a gem in a sea of gravel. Although it could be more polished it nevertheless retains its value. <br><br>The actors performances range from competent to stellar (Alexia Rasmussen was particularly impressive but everyone involved held their own and had their moments to shine) and this is in no small part due to good writing and direction. Cinematography is a similar affair ranging from adequate to mesmerizing. It is certainly a mixed bag but you'd be pressing pretty hard to go so far as to call any of it bad. I personally felt the score was superb and fit the tone of the scenes well.<br><br>With the exception of a fairly brutal scene in the first act of the film there really isn't much violence or gore on screen here and what little of it there is was handled tastefully. Visually there is nothing here you won't have seen before. What makes it disturbing is the context, the emotional and psychological mayhem rippling through the characters affected and the cold distance maintained by those less/ unaffected around them. The behavior of the main characters may be extreme but they are the extremes of common conditions.<br><br>This is where the film truly shines, as a study of the human condition when emotional needs are not satisfied, the common phenomenon of loneliness and isolation within a dense population and the resulting psychoses. The way empathy is handled in a clinical fashion by professionals and dished out superficially by peers when it suits their agenda, the way people within various relationships, genders (or rather, levels of masculinity or femininity within both genders) as well as how deserving a person may actually be of true empathy anyway are all bouncing off each other here and it's really engrossing to behold if this sort of thing interests you.<br><br>I really don't want to spoil anything for any of the viewers for whom this film is intended so I hope it suffices to say that there are \"twists\" resulting from the nontraditional narrative structure that create an unpredictable thriller spliced with elements of drama/ horror. Every time I made an educated assumption of where things were headed the film surprised me and seemed to revel in doing so until the credits rolled.<br><br>If you are the type of person who thinks a character in a film who happens to be of a certain gender or sexual orientation being portrayed as flawed is an accusation directed at everyone in that category or, more importantly, are enduring the loss of a loved one . . . viewer discretion is advised.<br><br>I hope this film isn't lost in the horde of mediocre entries in the genre(s). From me this film scores a solid 8/10.","user":"nqsferatuslair","rank":[27,31]},{"title":"Solid acting, good performances, added to my weird list.","rating":6,"date":"23 April 2014","review":"If you're looking for a movie that gives you that feeling like you're not sure what you have been apart of, then take a moment to view here. As you sit alone in the dark talking aloud to the TV, you'll be asking yourself questions like: It's a horror? Oh, is it mystery? Maybe it's a psycho killer type thing? Or is it just weird? The ending, It couldn't of ended any other way! I liked it.<br><br>The main character really pulled me into the story. She is alone and pregnant, we don't know why. An introvert loner who's sadness seems obvious for all to see. When the first shocking seen hits you, it hits you twice as hard as you know this will send her down some weird pit of crazy despair that only someone on the edge can feel.<br><br>Then as the next few scenes of the movie unfold, you can sense that something else is happening and That's when I sat up as I wasn't sure what is happening or what will happen next. As you know, there are way too many movies where you know what happens next! <br><br>You have to like unconventional movies or you won't enjoy this strange little trip into weirdness.","user":"individual-297-994063","rank":[27,34]},{"title":"Crazy Hitchcockian Birds.","rating":8,"date":"7 May 2014","review":"Oh the need to be in the spotlight, the need to be loved, the need to be draped in others sympathy. This is the tale of Proxy. And while it certainly has many plot holes (which the less patient seem to be shouting about loudly), it has enough style to keep everyone on board to the end, maintaining an air of dark brooding menace for most of it's running time. And that soundtrack? Its just fantastic, I couldn't work out if the film really was Hitchcockian or the brilliant score just made it seem that way. But from the shock opening scene (which may upset a few), to it's twisted end, it never gets boring, and it kept my ears pricked up enjoying it's burrowing plot. The acting is top notch, and I think I might check out this director's other efforts now. But I would recommend Proxy to those able to ignore it's little holes. <br><br>Ps. And to the person who didn't understand why the shirt in one scene had blood, then hadn't, that was intentional. Think about it, she was already dead. This was the character imagining what he would do to her if she wasn't. When he walks outside (to reality again), the blood is gone. Surely not everything in cinema as simple as this needs signposted?","user":"horizon2008","rank":[15,19]}]