[{"title":"Frigg'n HILARIOUS and very entertaining... Blu-ray: Excellent A:9 V:9","rating":8,"date":"7 March 2013","review":"I just finished watching this and I must admit that I had MANY truly laugh out loud moments. ONLY the UK people can pull off something like this with the DEAD-pan sense of humour it takes to make this work. Sure, some of the comments the clown makes are pretty corny, but there are far more that are REALLY funny!<br><br>There are some nice classic Horror touches too. YES, it is a bit gore heavy; but, the effects are well done and very imaginative. I really appreciated the inclusion of the 'Cat' (YES, I love animals, but I love people too, so if you're gonna make a dang Horror film where a bunch of 'teens' are killed, well...) Anyway, back to the nice Horror touches... Gore withstanding (it's almost NEVER my favourite part anyway) the early scenes with the very creative Clown ceremony and mythology were quite entertaining. The guy playing the clown himself was bloody HILARIOUS! His deadpan comments, especially early on before the 'accident' were great!<br><br>So, if you DO like entertaining and well done Comedy / Horror, then this is your film. As mentioned by another reviewer, if you are really sensitive about gore effects, then you might want to proceed carefully (For me personally, this kind of 'cartoon' or 'fantasy' gore is all right, although it IS kind of pushing it. What I absolutely do NOT like at all are these 'Torture Porn' films where evil people are just doing horrible, cruel, and mean-spirited things to other people in ULTRA- realistic ways without any fanciful or supernatural context - Those are complete non-starters with me...)<br><br>I'd say that if you really liked 'REANIMATOR', you probably would really like this film. Lots of fun if this is your kind of thing...","user":"lathe-of-heaven","rank":[29,38]},{"title":"Surprisingly good.","rating":5,"date":"31 October 2012","review":"I went to the cinema to see 'Sinister', but it was full, so we went and saw Stitches instead. I'm so glad we did! This film was classic! I expected a horror, but I wasn't at all prepared for how much it'd make me smile. Ross does a brilliant job bringing his character to life, and the story and kids wrapped around the concept are just tacky enough to reek of stereotype, but just different enough to keep you entertained and smiling (such as Bulger doing the splits at the gym, or the 'bully' actually being the only character in a stable, functional relationship).<br><br>Brilliant film, a lovely surprise to what would have otherwise been a disappointing evening!","user":"sylph_uscm","rank":[42,59]},{"title":"Not so Frightening but funny!","rating":7,"date":"11 October 2012","review":"I love Ross Noble! So we jumped at the chance to see this as the closing film to Grimmfest this year! Im very glad i did! Stitches is a very funny take on the slasher genre, using comedy and horror combined, it reminded me of the latter Elm Street movies, where the villain has to use a comic gag to kill his victim! Ross noble seemed to revel in the role and proving to be a very convincing killer clown! He even went onto say in the Q &amp; A about wanting sequels made, do we have a British Jason/Freddy in our midst! Maybe with a bit more budget and a stronger supporting cast and a little better writing, Stitches could become the UKs' very own slasher icon!","user":"hitchinlist","rank":[30,44]}]