[{"title":"First of all, I hate this movie...","rating":10,"date":"16 January 2014","review":"I hate this movie.<br><br>Why might you ask have I rated it 10/10 then? Because it is possibly the most completely wonderful story I have ever watched.<br><br>I'm getting on now, I'm a guy in my late 30's who is into action and violence and explosions and big robots smashing things and never before have I seen a movie which moved me to tears.<br><br>There were elements which reminded me of silly things which I have done in the past and wished I could have done over, moments I wish I could relive and times I wish I could get - even writing this makes me want to cry! Damn you Richard Curtis, you've made me into a sissy with your perfect casting in this bloody beautiful, touching movie!!!<br><br>I don't usually do sentimentality but this isn't the reason I hate this movie... No I hate this movie because I think it has replaced the Princess Bride as my no. 1! And yes I know that was a soppy romance but it had pirates in it so it was fine!!!<br><br>See this movie.","user":"jonathancolley-885-704860","rank":[596,658]},{"title":"The reason you go to the movies","rating":10,"date":"11 October 2013","review":"Why do you go to the cinema? For me, it is to be moved. To laugh, to cry, to be frightened, to be in awe, to be amused in a gentle way. This movie did this to me in all 5 ways. I am Mr. Ordinary - I have been lucky enough to be born into a loving family, I have wooed a certain number of women, I have married and enjoyed the highs and lows of having my own family, I have lost my parents. I try in my own way to appreciate others and acknowledge that they are trying to make their way in life. This movie defines me. If you miss it this time, don't worry. You'll catch it later. Most people interested in cinema will see it at some stage. My advice is to go and see it now. It's not perfect - it's a bit English, a bit middle class, the story is preposterous. But the sentiment, the message hits the spot. Take one of your significant others. Take a first date. Take a box of tissues. It's the reason you go to the cinema.","user":"steve-atkinson-814-726592","rank":[801,908]},{"title":"a witty, intelligent, charming, sweet film with surprising depth and heart","rating":8,"date":"21 September 2013","review":"From the director of 'Love Actually', who is also the writer of 'Four Weddings and a Funeral', 'Bean', 'Notting Hill' and the 'Bridget Jones' films, it sure raises some expectations for this particular fantasy romantic comedy drama film about time travel. <br><br>Although it shares some similarities with 'The Time Traveler's Wife' (the same female lead actress, Rachel McAdams) and 'Groundhog Day', but rest assured, 'About Time' is a witty, intelligent, charming, sweet film with surprising depth and heart. The script was well written, the direction was great and the casts made a decent performance in their respective roles. <br><br>The film done a fine job in balancing the comedic and dramatic elements of the story, providing enough laughter and allowing it to flow smoothly without feeling too overly long despite its 2 hours running time.<br><br>Despite the time-traveling plot device, the story focuses on the father-son relationship of Tim and his dad and the lovely romantic relationship between Tim and Mary, without being too sappy, too overly lovey-dovey or too sentimental. The message or overall theme of the film about appreciating life as if it was your last was subtle and not too forceful or preachy.The selection of songs for the film was appropriate and not too overly done for the emotional scenes.The on-screen chemistry between Rachel and Domhnall are convincing enough for the audience to watch them going through life together. On the other hand, Domhnall and Bill, as father and son, their connection is felt throughout the film and certainly evoke some poignant memories when watching them together.<br><br>It's one of the best romantic comedies this year had to offer, better than the disappointing 'Time Traveler's Wife'. It's a great date movie that's not to be missed.","user":"YJLcool","rank":[289,335]}]