[{"title":"The Ultimate Movie Review! - http://tss5078.blogspot.com - @tss5078","rating":6,"date":"24 December 2014","review":"I have always loved Charles Dicken's classic, A Christmas Carol. I have seen literally dozens of adaptations of it and I still find it to be one of the greatest things ever written. All American Christmas Carol is a redneck take on the story, and while it wasn't a bad film, it wasn't what I thought it would be. Cindy (Taryn Manning) is a single mother, who has three kids from three different men, and she's not even thirty. Her drunken, partying life style doesn't even cover the bills to keep her three kids, Harley (Tristan Lake Leabu), Skoal, and Cheese Doodle in their trailer. Her life and family are headed for disaster, when Harley's father, aptly named Jake Marley, dies in a paintball accident. After the funeral those three ghosts we all know and love show up and try to put Cindy on the right path. This film was unrated and had all the makings of another terrific raunchy Christmas film. I was expecting Bad Santa, instead I got it's Duck Dynasty-esq PG-13 cousin. Kill Theories, Taryn Manning stars and she was great, she was far more believable than any of the ghosts and really made you feel for her character. The other stand out in the film is young Tristan Lake Leabu, who plays her oldest son, Harley. Harley is the man of the house at the ripe old age of 13. With the hilarious redneck antics going on around him, it's hard to remember that he's doing a man's job at a child's age. Leabu played the both sides of this character and did so with the ease of an actor far beyond his years. This is not your typical Christmas Carol, it's not all that raunchy either, but for it was, I was pretty entertaining. I wish they had taken it to the next level and really gone all out with the comedy, but still it didn't take that much away from the film. Rednecks let this film be a warning to you, if you don't do more than drink and have sex, the ghosts of loved ones passed will haunt you and it will be hilarious.","user":"Tss5078","rank":[4,11]},{"title":"Waste of my time.","rating":2,"date":"9 December 2018","review":"This movie was terrible. Story line was lame and acting wasn't that great. Modern day trailer trash Christmas Carol. Could be a funny concept, I grew up in a trailer court, I know what I'm talking about. This movie had a few laughs but was mostly cringe inducing. Skip it.","user":"daveconaway","rank":[2,4]},{"title":"The gift that never gives.","rating":3,"date":"29 November 2018","review":"\"All American Christmas Carol\" tries to play both sides of the line between trailer trash schlock and family redemption ala Dickens. Unfortunately, it fails to entertain in either realm. The pace of the movie is uneven and slow, bouncing around story points that go on too long and initially leave you wondering what all this is leading to. Most of the cast is competent enough, but the characters and situations, as written, are uninteresting and unconvincing. Ironically, when the first ghost finally appears in the presence of the character supposedly needing to be un-Scrooged, the moment is rushed with no buildup or reaction whatsoever to the game-changing event. Why this scene is played with such dryness by both characters is both puzzling and disappointing, especially after so many uncompelling scenes leading up to it. And so it goes with the rest of the spirits who have their subsequent (and unremarkable) interactions. At what point this movie was supposed to be entertaining was lost on me. The resolution that finally brings this movie to an end is equally unbelievable, uninteresting, and prolonged.<br><br>I gave this movie 3 stars for good acting by some of the cast, and overall technical production that was decent. None of those stars are for special effects, as the ghosts appear mostly via camera cuts and are only afforded makeup for their afterlife appearance.<br><br>If you like stereotypical trailer trash gags, this movie has a few. Otherwise, there's not much else in it worth the hour and a half.","user":"mrlanceb","rank":[2,4]}]