[{"title":"Easy Going","rating":7,"date":"8 March 2014","review":"Life's a Breeze is a small, family oriented drama from Ireland starring Fionnula Flanagan as a retired school teacher whose adult children decide to clean up their mom's house as a birthday present. The problem is, that with the stuff they throw out, is an old mattress with the old lady's life savings in it. Thus begins a wild goose chase to recover the missing money. Flanagan is great here, as she was previously in The Guard(a must see Irish comedy), and Kill the Irishman, an excellent true crime story. Her granddaughter, Emma(newcomer Kelly Thornton), is a breath of fresh air in her numerous scenes with Flanagan. The eighty minutes go by quickly and had me laughing and rooting for a happy outcome. The cast is all good and the script witty enough to make Life's a Breeze worth watching.","user":"billcr12","rank":[16,20]},{"title":"A great feel-good Irish comedy that'll restore your faith in your family","rating":7,"date":"27 December 2013","review":"Of course, it's an Irish film, so it's ha-ha-ha laugh your head off funny - you should absolutely see it because it's the greatest film of the year and there's nothing quite like it! (Sarcasm intended)<br><br>It's a deep-rooted Irish comedy, and plays on the fact that we love to laugh at ourselves - which for some, works, and for others, doesn't. It's far from being a masterpiece, but it's a feel-good comedy that'll give you a few chuckles on occasion because you will, without a doubt, be able to relate some of the story to your own life.<br><br>The film is filled with beautiful shots of the not-so-beautiful Dublin city, and is a very enjoyable visual experience with some lovely cinematography. So, visually, it's a very solid viewing experience. However, it may not be the most well assembled story ever made - it survives mostly on the characters and their relationships with each other, but with a few twists along the way, it does leave you wondering whether or not the money actually exists, or \"nan's gone crazy\".<br><br>\"Life's a Breeze\" has a well assembled cast, including the Emmy-winning Fionnula Flanagan as the grandmother. Pat Shortt as 'Colm', and the terrific Kelly Thornton as the young girl 'Emma'. Thornton and Flanagan form an adorably lovable pair on screen, while Shortt brings come stereotypical Irish comedy into the mix. Along their journey to find the money the trio encounter many quirky situations that cause multiple clashes among the rest of the family but when it all comes to a close you'll be left with a sense of restored faith in your own family, and a bit of home for the people you surround yourself with.<br><br>\"Life's a Breeze\" is a lovable comedy that's absolutely worth a watch if you're a fan of Irish production, but maybe not your cup of tea if you're over-judgmental of what you choose to spend your time watching.<br><br>www.StuartComerford.com Twitter: @StuartComerford","user":"stuart-comerford","rank":[14,18]},{"title":"It really doesn't matter if they find the money, it's the journey together that is the real treasure.","rating":8,"date":"17 February 2014","review":"Sweet messed up family get their lives thrown into chaos, and are all the better for it. Life's a Breeze, then we are the paper people that it blows around at it's whim. This is a well told story acted perfectly by all of the players. Not a big Hollywood movie, but it certainly just as good. The most beautiful moments of this movie are spent surrounded by rubbish, and gulls. I really Enjoyed the full cast of characters, and was really impressed at the way the country came together in spirit even if just for a small time. Ireland please keep making these great movies. I recommend this movie to anyone from young to old, there is someone in here for you to relate to, and others that you will feel you already know.","user":"face-819-933726","rank":[9,12]}]