[{"title":"Totally watchable","rating":8,"date":"18 November 2015","review":"One of the best French movies I watched this summer.<br><br>Had to do it in chunks, though: the emotions were so overwhelming I had to stop my player every 15 minutes or so just to catch my breath.<br><br>I dunno, probably it's because of my age (about 50, male) that I relate so closely to that story.<br><br>Certain scenes and dialogs seem a bit exaggerated but that's French comedy for you. Snobish movie critics can boil their head but I don't regret for a minute that I spent well over two hours watching it; will recommend it to all my buddies.<br><br>On a side note: After seeing the movie, it would be probably a good idea to read the interview with Vincent Cassel (Paris Match #3449, Jun 25 - Jul 01, 2015, pp.9-11) where he talks about his character in that film.","user":"joie_de_vivre","rank":[35,48]},{"title":"French re-make of \"Blame It on Rio\"?--well, not quite","rating":21,"date":"21 October 2016","review":"There is a reason that some of the other reviewers have noted that the plot of this movie is very similar to the 1984 American film \"Blame It on Rio\". BOTH movies are remakes of a now largely forgotten 1977 French film with the same title as this one, \"Un Moment d'engarement\" (\"One Wild Moment\"). It is interesting though that the French are STILL making films like this, while the Americans wouldn't touch this subject today with a ten-foot pole. It's very doubtful older teenage girls have become more virginal since the 1970's and 1980's, and the idea that a sexual relationship between a younger person and an older person is ALWAYS \"predatory\" (provided the younger person is old enough to be sexually active in the first place)is a lot more debatable than it is often made out to be. Are sexually active teenage girls really a lot better off with an inexperienced guy \"their own age\" who doesn't even know how to successfully use a condom? <br><br>For me though it is pretty simple. There are A LOT of things that seem exciting and enticing in movies, but would be extremely foolish and probably disastrous to do in real life. I definitely wouldn't lie down on the train tracks and let a train pass over me, even though it seems exciting when they do it in movies, and by the same token, while I enjoy the fantasy of movies like this (or the two earlier versions), I certainly wouldn't do it in real life. I doubt even in real-life France that middle-age men routinely sleep with their friends' teenage daughters, but the French also just don't have the ridiculous puritanical hang-ups of Americans when it comes to anything having to do with S-E-X, and thank god for that.<br><br>For what it's worth, this version does make one concession to our more cautionary times. While the young actresses in the original \"Un Moment d'engarement\" and \"Blame It On Rio\" were both slightly underage themselves at the time like their characters, the actress here, Lola Le Lann, was actually about twenty, and ANY male of ANY age will find her VERY attractive as she frolics around completely naked in the surf. Ooh-la-la! I do think they should have switched the male roles and had the more mature and repressed Francois Cluzet get involved with his friend's daughter as opposed to the more youthful and \"dangerous\" Vincent Cassell. (That dynamic worked better in \"Blame It On Rio\" where the hapless Michael Caine had to deal with the volatile Joseph Bologna, who was trying to find the older man who slept with his daughter). Still this is a pretty entertaining and sexy movie, but definitely don't expect another American remake in this day and age.","user":"lazarillo","rank":[13,16]},{"title":"Beautiful","rating":8,"date":"26 October 2015","review":"A wonderful comedy and a typically french amour. Vincent Cassel and Francoise Cluzet as two fathers in their 40ies who spent their holidays with their teenage daughters in the sunny south of France.<br><br>First the daughters don't like the idea of spending their summer holidays in a house in the Provence but things change.<br><br>Lola Le Lann as Cluzets film daughter Louna is charming, beautiful, charismatic and a real wonderful actress with a great future in the business. Her character Louna fells in love with the best friend of her father (Cassel) after they spent a night on the beach together. While the elder man tries to forget what happened on the beach the girl is in love for the first time. She is wonderful when she tries to seduce Cassel and even her suffering after he rejects her in the next days is very much believable. <br><br>The funniest moments in this film has Francois Cluzet when he goes hunting the wild boars who ruin his garden but never gets them.<br><br>Alice Isaaz as Marie, Lounas best friend, gives also an impressive performance.<br><br>If you love funny and emotional films this one is a must-see!","user":"wolfhell88","rank":[23,31]}]