[{"title":"Makes me think about a third...","rating":5,"date":"9 January 2015","review":"Nice, this 55 year old liked it.<br><br>Fluffy, yes.<br><br>Light, yes.<br><br>But also intelligent, well written, well acted, and realistic.<br><br>No puerile toilet humour.<br><br>No clichés.<br><br>A very smart move which leads to a pleasant end to a pleasant movie, topical on the way people hook up today and deal with the traps, pitfalls and dangers in pursuing the elusive \"no strings attached\" night of \"just sex\" with no thought for past, present or future.<br><br>I liked it, no world beater but it kept me entertained and I felt pleased at the finish.<br><br>An honourable pass at 5/10 stars.","user":"adrossan","rank":[43,52]},{"title":"A very smartly written romantic comedy that I really enjoyed.The dialog is funny and there is a lot of truth to what is said.","rating":8,"date":"5 January 2015","review":"\"You might not be the worst person in the world to be stuck with.\" Megan (Tipton) has lost her way. She graduated from college with a degree she doesn't want and spends her days at home doing nothing. When she tries on-line dating she meets Alec (Teller) and the two meet and share a night together. When she tries to leave in the morning she is surprised by a snowstorm that has forced them to spend more time together. What starts off has two people that hate each other soon grows into something else. This is just a good movie. The writing is witty and funny and the actors have great chemistry together. The movie is totally predictable and very cookie cutter but that in no way hurts the movie. The younger crowd may like this more than an older one but I am 36 and really enjoyed this and so did my wife. The dialog is funny and there is a lot of truth to what is said. There are some really funny parts in this and I laughed a lot all the way through. Overall, a very smartly written romantic comedy that I really enjoyed. I surprisingly give this an A-.","user":"cosmo_tiger","rank":[45,60]},{"title":"Don't you want somebody to talk to?","rating":7,"date":"12 November 2014","review":"Megan (Analeigh Tipton) is a beautiful young woman troubled by her own singularity. She hates being single and fears she is seeing the best years of her love-life rush by her and can do nothing but passively watch them dissolve before her eyes. Catering to her desperation, she creates an account on a website dedicated to matching singles up with one another and connects with Alec (Miles Teller). The two meet and wind up having great sex together, with Megan presuming she can just leave as soon as she wakes up the next morning. This method of avoiding anything in the way of romantic feelings, however, is prevented given a huge blizzard is taking place outside, making travel of any kind next to impossible. Megan is forced to reside at Alec's until further notice, making for an ostensibly awkward but thoroughly revealing evening as the two talk about past relationships, critique each others sexual practices, and spend time nosily prying into the lives of one another.<br><br>The premise for Max Nichols' Two Night Stand is made slightly more original given the fact that the idea of millennial relationships is a fairly topical, sociological talking point at the moment. I just recently saw an article stating that numerous young people don't even know the status of their own relationships, as the modern world has populated so much of romanticism with casual hookups, \"hangouts,\" and acts of \"seeing\" people with little or no commitment involved. The characters, the structure, and the ending of Two Night Stand, however, make the film something of another romantic comedy, but exploring a reasonably believable scenario about failing to have your cake and eat it too. They thought they were getting carefree sex without any kind of personal relations to follow...what they got was a window to themselves from a complete stranger.<br><br>Two Night Stand's commitment to perfunctory plot-points (including a pretty senseless ending) are saved by screenwriter Mark Hammer's reliance on conversation in the film, and, most importantly, the performances of Tipton and Teller, two young actors to watch in the coming years, with Teller being the more prominent one. Starting out finding his footing in amoral comedies like 21 &amp; Over and Project X, Teller has grown into a seriously likable and human screen-presence, inhabiting the role of the cocky yet vulnerable young adult, determined, but somewhat directionless, and friendly, but also contemptible at times. His versatility is the glue holding Two Night Stand together when lengthy conversations between the two parties take place, resulting in pleasantly lyrical discussions about topics that are finally starting to find themselves more prominent in film.<br><br>Sex is not an uncommon thing to see in films anymore; the discussion of sex, romance, love, and marriage from the perspective of the people who most often engage in it - teenagers and young adults - are a bit harder to find. Two Night Stand finds itself released and promoted around the same time as #Stuck, another film about an extended hookup that results in the male driving the female home and both of them getting stuck in a record-breaking traffic jam. The evasion of feelings and any form of commitment is something that we can see in films with millennial characters, and when they finally are forced to tackle it is when we have an intriguing film on our hands.<br><br>As I said before, Two Night Stand is burdened by an ending all too conventional and a structure far too similar. However, the recommendation in this case is for you to see two talents, who will soon find themselves in roles with more potential and possible accolades to affirm that, tackle material, as of now, rarely committed to film. It's a treat to watch Tipton and Teller interact with one another, and an even greater one to know the best is yet to come for both of these young actors.<br><br>Starring: Miles Teller and Analeigh Tipton. Directed by: Max Nichols.","user":"StevePulaski","rank":[31,41]}]