[{"title":"Good concept buried by crude execution and inconsistent delivery","rating":5,"date":"22 June 2015","review":"For a low budget film, Fear Clinic respectably produces several good horrors, they even resemble high fantasy at times. However, aside from the fast introduction early on, the plot stutters with repetitive scenes and the actors' performances are too often flimsy. The concept and visual are decent enough, but the movie just feels that it loses momentum as it progresses and eventually doesn't conclude as strongly as it opens.<br><br>Story follows a doctor who has made a method to deal with fears. He would put people inside a chamber and let them experience virtual enactment of said phobia. Problem arises after several people begin to see strange things even when they are not connected to the machine. The first act is arguably the best part, since it delivers a good hook and fast enough for people to invest in.<br><br>Unfortunately, the plot suffers from awkward development. Scenes would feel jumbled and needlessly recurring, mostly because the editing is poor. After the initial build-up, the characters are interacting with the excitement of telemarketer or frantic over-the-top. It seems odd since there's barely any coherency between each scene, the characters' reactions appear to be unexpectedly random.<br><br>For what it's worth, it has a few good moments. When the visual is accommodating, the thrill is presented admirably. A couple of events look like they belong to sci-fi or fantasy film, or even another higher quality production. It's unfortunate that the film only produce these instances briefly.<br><br>Fear Clinic couples together decent concept and presentation, it's just not done consistent enough as it deteriorates anticlimactically.","user":"quincytheodore","rank":[12,14]},{"title":"Tries Too Hard Not to Look Like a B-Movie","rating":4,"date":"22 June 2015","review":"As the title suggests the movie deals with people's fears, but sadly it's only a specific type of fear all the patients share because they have all experienced the same traumatic incident; i.e. we don't see a variety of phobias, which is a lost opportunity.<br><br>The cast and cinematography are fine and the movie looks like one with high production values, although certain scenes that depend heavily on special effects look really B-movie-sh; surprisingly, even the flickering of the lights looks B-movie-sh. The plot sounds really disjointed and confusing because of the way one scene leads to another; i.e. the editing is absolutely B-movie-sh. I could also tell the director had a thing for old men and used every opportunity to capture the reasonably handsome old doctor naked on camera, even though none of those scenes call for that.<br><br>I think despite the fact that the opening scenes are promising, this movie is going to let most people down and leave them with the feeling that they have just watched a B-movie that tried too hard not to look like one and its every attempt to scare the audience failed miserably. It kind of looks like an episode from Dr. Who.<br><br>I don't want to be too harsh, because I've seen worse, so I'm tossing in a 4.","user":"politehere","rank":[16,20]},{"title":"Mediocre!","rating":3,"date":"28 February 2015","review":"Sometimes I should not read the reviews on here when there are only 5 reviews. I think it might have been people that worked on this movie and the reviews are rigged. I started watching it with an open mind, and seeing that it was not the usual horror story but something with a different concept I thought I was going to like it. But even if the theme was good the story was not well executed for me, it could have been much better. First of all it took much too long before it might get interesting and then finally when you could call this movie a horror story the special effects were pretty mediocre. I was glad the movie was over so I could watch something else and better to forget about this one.","user":"deloudelouvain","rank":[24,32]}]