[{"title":"You'll love it unless you don't","rating":9,"date":"4 January 2014","review":"Quentin Dupieux's films are not for everyone, but if you're looking for a very fun, absurdist film you're going to love Wrong Cops.<br><br>I can't understand why other reviewers hate on this film so much. I watched it and laughed my ass off and had a great time. It's my favorite film of the past year. It's deadpan absurdity, a sequence of slightly the surreal encounters of a police force that does more harm than good, who spend their time selling drugs, refusing to investigate crimes, and composing house music. Dupieux's films collectively are like a breath of fresh air in a stodgy and self-important film culture.<br><br>The plot of Wrong Cops is loose and it almost feels like a piece written for the stage. It's all about the slightly twisted encounters - from scene to scene there is no way to predict where the film will take you, and once it takes you there there's no way to know exactly where you are. This kind of mischievous disorientation can be very fun if you just let go and take the ride.<br><br>If you like David Lynch, Alejandro Jodorowsky, etc. - films that go over the top with their surrealism and absurdity, films that never feel quite comfortable and familiar yet which you can't look away from, you will love this film. If you're looking for standard fare, just don't watch it. It will probably make you angry.","user":"littleiceagerecords","rank":[50,72]},{"title":"A Potential Cult Classic with Great Black Humor","rating":9,"date":"12 April 2014","review":"I like to avoid spoilers in my reviews. This movie is very short, but you'll remember every moment of it. The music is extremely obscure, but draws you in and makes the movie by the end.<br><br>It was great to see that the cast and crew didn't take themselves too seriously when making this film. Its not meant to be completely realistic, nor run for Academy Awards.<br><br>If you are offended by extreme sexual jokes, and people treating each other horrifically in bizarre social environments, then this movie is not for you.<br><br>The film starts off awkward, which sets the pace of the entire movie. The acting is not the most amazing, but its hilarious.<br><br>I've watched this movie at least 10 times since I got a copy of it. I've re-watched it with friends who share the same type of humor.<br><br>There is a gore scene that's quite disturbing, yet darkly hilarious. I mention that as a warning for people who couldn't stomach it, its quite psychotic. I won't ruin it for people who want to enjoy it.<br><br>This movie is best watched knowing almost nothing about it before you see it. Its best for when you don't have time for the usual 1hr45-2hr run time movies that are the norm these days. Wrong Cops is a movie you should also be in the mood for the first time you see it.<br><br>There's a lot of people who will hate this movie. Every joke is pure black humor. It seems to take influence from Reno 911 and Super Troopers. It is, however, much less slapstick.<br><br>This is the best review I can do without giving away anything, or spoiling anything. I rate it a 9/10 for the category of Black Humor Cult Classics. While its not old yet, people may still enjoy this 20 years from now.<br><br>The storyline is very unpredictable. A lot of the characters are unlikeable as people, but enjoyable to observe.<br><br>Although being unrealistic at various points, there are a lot of scenes that hit a little \"too close to home\" for people who have had a rough past. To enjoy this movie, separate yourself from the situations completely and thank heavens you don't live in the same neighborhood as these people.<br><br>Please remember that a protagonist doesn't have to be a good person. There are plenty of books and movies where the lead characters are straight up villains. The entire movie is quite amoral, which helps make this a unique little film. Its original, memorable, and not for everyone.<br><br>I hope this helps you decide if this is the movie for you tonight.","user":"blaynebittner","rank":[27,39]},{"title":"Doesn't try to be anything","rating":8,"date":"12 April 2014","review":"8 out of 10 is quite a high rating, normally reserved for great films. This isn't a great film but it is a great comedy. It's great because it doesn't try to be funny or really even try to be a story. The concept and idea are strong and funny enough. So many good ideas are ruined because they try to be something and completely fail (anchorman 2, for instance). This is not a mainstream comedy by any shout, it's fresh, subtle and very smooth. Aesthetically and intellectually. This is very brave film making, it doesn't ponder to mainstream acclaim and for that it holds it's integrity. This film simply is what it is. If you like Eastbound and down or Green Wing then i advise you to give it a go, if your cup of tea is 'how i met your mother' then forget it. This isn't for you. I'd actually like to see this as a TV series.","user":"martin-461-375135","rank":[17,26]}]