[{"title":"Utterly refreshing. Green is back. Rudd shines.","rating":8,"date":"13 August 2013","review":"All hope was lost for David Gordon Green. After a string of cult-ready indie flicks, he sold out in the best possible way and made the hilarious Pineapple Express. I hoped it was a one off, or at least, that he would remain good at comedy. But the disappointing Your Highness and the 'I- can't-even-bear-to-look-at-its-IMDb-page' The Sitter don't look too promising for his future. Now with Prince Avalanche, it seems like he's taken a good look at himself and realized what he does best. Small scale dramas concerning the human condition, especially regarding romantic relationships. I always love good films about little-thought of jobs and the guys who do the line painting of the roads in the middle of nowhere is a fascinating one. Prince Avalanche is a dual character study of an introvert and an extrovert but goes beyond the 'odd couple' clichés. Together, they cover enough ground to find relatable areas, and with dialogue-driven scenes, it cuts to the core of what they live for and how that drive changes and grows throughout the course of the film.<br><br>Paul Rudd is absolutely outstanding here. I'm so glad he's finally found a role to test his dramatic talent without having to ignore his brand of comedy, though much of the humour of this film is incidental and sparse. He's incredibly subtle and commanding. Unfortunately, Emile Hirsch looks amateur next to Rudd and he rarely feels as sincere. Sometimes the little conflicts between them suffer because of it which make the film feel slower than it is, but they still drive the character development in an interesting way. Rudd aside, the highlight of the film is the great cinematography. Sometimes the cutaways and montages are more emotionally engaging than the words as they think of all the symbols possible in this environment with these characters. It's a film that conjures a mood more than anything and it reassures me that David Gordon Green never left, he was just taking a break. I regret that I've more or less forgotten what happens in his first four films but Avalanche makes me want to revisit them soon. It's a beautiful simple film which ends on a lovely hopeful note. A true catharsis from the social order of life and utterly refreshing to watch.<br><br>8/10","user":"Sergeant_Tibbs","rank":[39,47]},{"title":"A Charming Journey through the Woods with Two Great Actors","rating":8,"date":"9 March 2013","review":"I enjoyed seeing Prince Avalanche at SXSW Film Festival. It is a peculiar and deceptively simple story of two highway workers in an isolated area painting the line down the middle of a new highway. The setting becomes a character as this low-budget movie was filmed in Bastrop, Texas last summer in the aftermath of the recent fires. Paul Rudd and Emile Hirsch are really magnificent. Rudd is actually difficult to recognize and comes off so different than he often does in his straight comedy roles. This is a dialogue-driven film that in some ways seems a bit like a stage play. The dialogue and the relationship between the two leads drives the entire film. The film nicely merges the comedic nature of both of the ridiculous characters with the serious nature of the issues that they are dealing with in their personal lives. The film is far lighter than Rudd's recent turn in deathly dark Killer Joe, but somewhat more serious than Rudd's big budget film This is 40. While this sort of small-budget film is unlikely to get widespread distribution it really showcases the talents of both of these actors and the importance of good writing and a beautiful setting.","user":"JustCuriosity","rank":[51,67]},{"title":"A quaint and well-handled light comedy","rating":6,"date":"2 August 2013","review":"Prince avalanche gains much of its personality from the fire damaged forests that it takes place in. Despite the characters fairly trivial and base dramas that occur in their lives the film likes to remind us of the natural beauty that can be found in the remnants of what was once a community but is now being rebuilt by these two bumbling characters.<br><br>There's not a great deal of plot compelling Avalanche forward at times and often scenes will consist primarily of Paul Rudd and Emile Hirsch spraying new road surface lines followed by extensive hammerings in of poles. Although the film may appear slow I quite enjoyed the meditative state in which the film exists as the occasional bursts of personality were punctuated more by the peace that preceded it. The film is also often quite funny in my opinion but it's a very low key humble humor that won't have you in stitches but feels natural within the scene. <br><br>I also really enjoyed the truck driver character and subplot (I guess you'd call it) involving a woman who lost her house. I guess why these elements work so well is that you're constantly searching any one frame or scene for something that will advance the plot and although these elements appeared before my patience ever wore too thin, they're still quite few and far between. There also a scene which involves Hirsch and Rudd getting drunk and doing whatever one does drunk this deep into the woodlands which I found very funny and a definite highlight.<br><br>The film doesn't achieve any great heights and probably doesn't land as much humour or inject enough drama to justify its length I still enjoyed my time in the theatre and would recommend watching it if you're in a chill enough mood.","user":"BlairMcLovin","rank":[29,38]}]