[{"title":"Quartz watch???","rating":3,"date":"16 April 2017","review":"I just love it, when at the end of the movie Arthur is kneeled down on his wife's tomb, weeps and almost cries, promises his wife to \"always love her\", and places red roses on her grave... sporting a $ 20 gold-and-steel quartz watch!!! All of this in 1916???<br><br>Other than that, sorry to see again a heartless, stone-faced, stereotyped Grrman officer, whose only task is to kill and to see how the mama-loved Irish soldier is used as a sacrificial lamb to make a boring movie. Yawn!","user":"s_andretta","rank":[6,6]},{"title":"Regretfully unconvincing.","rating":2,"date":"25 August 2013","review":"Forbidden Ground is an Australian-made rendition of the plight of British soldiers trapped in no-man's land, and should have been the war epic it was (once) anticipated to be. The unfortunate truth is that it falls short of all expectations, and as a patriotic Australian I take no pleasure in saying it. <br><br>From the first moments the small budget is apparent. Close-ups try and disguise the limited scale of the production. The battles in the film are all no more than small skirmishes and never really produced with any flair, impact, or suspense. The constant reliance on CGI for special effects cripples the action, unlike it's predecessor Beneath Hill 60 - which it will surely be compared to - which used mostly practical visual effects and captures gritty violence effectively. As such, when the horror of trench warfare comes along in this film, it is woefully un- engaging, and downright boring in parts. I felt no connection with the men going to their deaths. The obvious computer-generated explosions and squibs left a lot to be desired and had no \"punch.\" It's an anti-war film, as most WWI films are, so you would expect a focus on correctly portraying the shocking waste of war, but Forbidden Ground lacks the budget or know-how to do it properly. <br><br>There are some tired clichés including snobby, arrogant officers and the hard-nosed NCO, and while historically accurate in some ways, Forbidden Ground doesn't cast the roles with conviction, simply recycling scenes and minor characters from a dozen better war films. The other problem with authenticity is that most of the cast is Australian, and while our accents may be more or less similar and we often are mistaken for Poms, the actors on show here can't quite make it sound natural and every line feels laborious and forced. If they'd just spoken with their normal accents they would probably have sounded more comfortable with their characters, but alas every Pommy soldier on screen sounds like a caricature of British stereotypes. <br><br>Another problem with authenticity is that the unit that is focused on seems to be an amalgamation of British accents. Whether intentional or by accident, units were formed from specific locales (universities, rugby clubs, towns, cities, etc) and would only occasionally be mixed with troops from broadly different locations (casualty replacements). <br><br>So the end result is a disappointing straight-to-DVD war drama without any magnetism or flair. I praise the cast and crew for doing what they could to commemorate the war, but I can't recommend Forbidden Ground as good viewing. Better luck next time.","user":"mwburrows","rank":[48,67]},{"title":"Astonishingly bad","rating":2,"date":"18 January 2014","review":"Every war movie cliché lives on in this waste of money and time. They're all here -- the strong but self-questioning hero, the cowardly kid soldier who finds courage only to (surprise!) get killed, the weedy English officer, the cruel German one...Hammy acting, leaden dialogue and uninspired effects.<br><br>As if that weren't enough, the script is full of anachronisms, as the characters talk and behave in ways that are utterly foreign to the world of 1916, but will be perfectly familiar to modern viewers.<br><br>And the icing on the cake: plagiarism. Major scenes in this stinker shamelessly rip off Timothy Findley's 1977 novel The Wars, and the film made of it. (That movie wasn't great, but it's a damn sight better than this one.)<br><br>So how bad is it, really? Bad enough that you'll wish you spent the time doing practically anything else than subjecting yourself to this loser.","user":"lawrence_purdy","rank":[11,14]}]