[{"title":"An excellent overview of a complex and troubling miscarriage of justice","rating":9,"date":"24 November 2012","review":"While the story of the West Memphis Three, their awful flawed trial and subsequent efforts to obtain freedom were well covered in the \"Paradise Lost\" trilogy of films, this single film overview has a lot of value. <br><br>Perhaps because the case can now be looked back on in total, it feels like there is a clearer focus here than in the excellent \"Paradise Lost\" series. There also seems to be more of an emphasis on the emotion and humanity of all the victims – the three falsely convicted young men, but also the families that lost children. <br><br>Last, the film makes some of the awful holes in the prosecution case more simple and clear than earlier accounts, as well as putting a chilling spotlight on the possible real perpetrator, but without the theatrics that harmed 'Paradise Lost 2', which seemed guilty of what the trial did to the three boys; throw suspicion on a subject largely because he 'acted weird'. <br><br>Here the investigation into another possibility feels more dispassionate and scientific, and less manipulated, leaving one with questions rather than forcing conclusions. <br><br>The world might not have 'needed' another film on the subject, but personally, I feel the more injustice can be intelligently examined and exposed the better off we are as a society.","user":"runamokprods","rank":[45,57]},{"title":"That's the way they do things in West Memphis","rating":8,"date":"21 October 2016","review":"There's no such thing as a nice murder, but the deaths of three children in West Memphs, Arkansas in 1993 seemed particularly horrific: the killer had apparently cut off his victim's penises and drunk their blood before throwing the corpses into a creek. The police promptly rounded up some local kids with a passing interest in Satanism, and a conviction as duly secured. Only later, amid mounting concerns over a potential miscarriage of justice, did it emerge that an incompetent pathologist had failed to recognise that the wounds were almost certainly inflicted post-mortem, and not by the killer, but by turtles. Not only had the wrong people been convicted of the crime, but the crime was perhaps just an \"ordinary\" murder after all. But getting the State to agree was a further long struggle. Amy Berg's documentary charts the story. It's horrific (the crime was still an awful one, even if not quite as originally portrayed, and the false imprisonment of the accused a second tragedy), fascinating, and beautifully filmed. On the downside, it is a bit long, and while it does a good job at suggesting who might have actually committed the crime, one can feel a bit uneasy about making such charges in a film like this (although one can also note that the authorities seemingly have no interest in re-investigating the case). More than anything else, the film is an interesting (and scary) look into the life of the American poor, a long way from the glitz of Manhattan. For many of the people we see in this movie, life would have been a hard, tough grind, even without the terrible events displayed. When one of the three accused finally gets out of prison, he tells us he isn't going back to Arkansas; and one doesn't feel like blaming him.","user":"paul2001sw-1","rank":[9,10]},{"title":"Shocking Story of Injustice","rating":8,"date":"9 September 2012","review":"Alright, let me be completely honest with you about how I stumbled upon this documentary. <br><br>For most of my life, I had no idea who or what the West Memphis 3 were. I'm a 23 year old girl, living in Toronto. When these crimes were committed, I was in kindergarten likely learning how to read. So the fact I never heard of the crime never exactly surprised me. And if it wasn't for Johnny Depp, I probably would have never heard of the crimes to begin with. <br><br>I first learned about the West Memphis 3 watching a Johnny Depp interview on David Letterman. I was intrigued, looked up the case, became slightly disturbed, and unfortunately, forgot about it for a while. I hadn't actually heard about the case again until TIFF announced the final films in its 2012 program. West of Memphis sounded familiar, and low and behold, it had been the topic of the discussion in that said interview. After reading that Depp was attending and discussing the film after, I purchased the tickets. <br><br>Now I'll be honest, it may be slightly sad or pathetic, but Johnny Depp was the main reason I decided to see West of Memphis. I'm a huge fan of his work, and I had the opportunity to see him discuss a film, so of course I was getting the tickets. I realized after the film, if it wasn't for Depp I'd never even know about the West Memphis 3, and that made me realize how much the media and publicity truly helped their case. I barely knew a thing about them before I walked into the screening, but coming out, I was glad I blindly followed Depp towards it. <br><br>West of Memphis tells a true story that the world needs to hear. It's a film that I sincerely believe everyone needs to see simply so they can be aware of how cruel the justice system really can be. <br><br>he story of the Memphis 3 is eye opening, and disturbing. It's terrifying to know how badly the justice system can fail somebody. For nearly two decades Damien Echols, Jason Misskelley and Jason Baldwin sat behind bars for no real reason, while a murderer walked free. The crimes they were charged with were absolutely horrendous, and they were suspects purely because they fit a stereotype. That fact alone is just plain wrong. Facts were ignored, forensics were wrong, and three young men suffered due to the failure and lies of others. Stuff like this shouldn't happen, but yet it does. The worst part about it all is that the three men are still technically guilty. They may be free from imprisonment, but they're not innocent in the eyes of the law. <br><br>I'm not normally very big on documentaries, but I think this is an important film to watch purely because it's a crime and trial that shouldn't be forgotten. The film is over, but the story isn't. Justice hasn't been served yet, and that's something that needs to change.<br><br>For more reviews check out http://confessionsfilmaholic.blogspot.ca/","user":"meggz3","rank":[70,103]}]