[{"title":"I love Ben Kingsley","rating":2,"date":"29 April 2013","review":"Any movie with Ben Kingsley surely cant be as bad as reviews here said. Really, I love this guy. But after seeing \"a common man\", I stand corrected. Its even worse. The script is ridiculous, the dialog so bad its almost hilarious, the music is painfully bad, the acting absolute rubbish. I hate to say it, but even Kingsley is anything but impressive in this movie. <br><br>Throughout the movie I kept thinking there has to be a back-story to this. How did this thing ever get made and why oh why did Kingsley ever sign up for it?<br><br>I got to write a few more lines before I can submit this. But I have nothing else to say. Don't waste your time on this.","user":"duvel123","rank":[27,38]},{"title":"worst movie ever!","rating":1,"date":"16 July 2014","review":"This movie sucks so bad that my eyes couldn't believe!. I mean, come on!, the whole movie was filled with clichés like the tough guy wearing sunglasses (even in the dark) and fist fights so poorly acted. Sir Kingsley, I hope you are reading this and if so, you owe me one and a half hours of my life...and i want them back!. <br><br>BTW, the way they speak through the entire movie reminded me of those English dubbed Chinese movies.<br><br>It's very difficult to understand how a man who played such a profound role like Gandhi can perform such a terrible movie like this one. <br><br>Overall, worst movie ever...and Mr. Kingsley, i mean it, i want my wasted time back!","user":"dshoji1","rank":[9,11]},{"title":"This is a copy of movie \"A Wednesday\" which is an Hindi movie released in 2008 and 100 time better than this awful combination of production, direction, editing and acting.","rating":1,"date":"30 July 2013","review":"The reason im rating this movie awful is that i have seen the original movie by which is in Hindi and was released in 2008. This is simply a English version of the movie \"A Wednesday\" which is one of the best movie's i have seen. The only reason i picked this movie to watch was because of Ben kingsley and i am very much disappointed and never expected such poor performance from him. I recommend everyone to watch \"A Wednesday\" with subtitile you maybe also find that on youtube.<br><br>This movie is awful in its every aspect either its the direction, production, editing, and above all the acting. When people copy something i would expect that to be a better version, improved one. This is just an awful movie and waste of time, i again recommend to watch the original movie \"A Wednesday http://www.imdb.com/title/tt1280558/?ref_=fn_al_tt_4 \".","user":"hoathjunaid","rank":[24,35]}]