[{"title":"I'd say, don't watch it.","rating":1,"date":"15 August 2017","review":"A boring movie that the creators thought would be cool, just because of the cool actors. The movie sounds like and endless poem, which many times repeats itself. There's basically no story, everything moves extremely slowly and the music makes it sad for no apparent reason. Of course it's one of those movies, many people would say it's artistic, therefore you should watch it. I'd say, don't watch it.","user":"andrea-rockroll","rank":[7,7]},{"title":"A film that goes nowhere","rating":17,"date":"17 December 2014","review":"This film tells the life story of the poet CK Williams, through the use of his poems.<br><br>I had high hopes for this film because there are three stars that I like in it. Unfortunately, there just isn't enough material to fill up the already short screen time. It tells several excerpts of Williams's life, and none of these events have dramatic turns. In fact, the events told are so plain that they are not even interesting. Watching Williams watching TV about a nuclear disaster, without any follow up or response, hardly qualifies as interesting. Either Williams had a very uneventful life, or the research into his life when making this film was inadequate. \"Tar\" is a film that goes nowhere, which is a pity as there is great star power.","user":"Gordon-11","rank":[9,10]},{"title":"Didn't get it! 1/10","rating":1,"date":"1 November 2014","review":"Review: This film was totally boring! All the way through the movie, James Franco is quoting his own poetry, which sounded like complete&nbsp;gibberish&nbsp;to me and there isn't any talking at all. Kunis is only in a couple of scenes and the movie goes back and forth in time which makes it even more confusing. After looking at the cover for the film, it looked really promising, but what I didn't know was that there wasn't any script and its totally based on poetry. Personally, I lost interest after the first few minutes and the annoying music really got on my nerves. Maybe I didn't get the point of the project but I don't think that I missed much. Awful!<br><br>Round-Up: What is James Franco and Mila Kunis doing in this movie? Franco is known for doing some quirky movies, but this one was really bad. I honestly thought that it was going to be a Rom-com or something in that type of genre, but its a deep drama about a man who starts thinking about his past and he begins to question his love for his girlfriend. Thats the only part of the film that made sense to me but it started to go down other avenues which were strange. Anyway, I think that you can tell that I didn't enjoy this movie at all and I found it a complete waste of time.&nbsp;<br><br>I recommend this movie to people who are into there deep dramas about a poet who has flashbacks of his past. 1/10","user":"leonblackwood","rank":[17,23]}]