[{"title":"Better handled than expected","rating":8,"date":"22 September 2018","review":"I'll be honest, I was a little worried about this considering that: a) This is the first children's film from torture porn horror director Eli Roth not to mention the first time he's helmed a film with an attempted big visual flair. b) The film is more humorous than the book. I was afraid it might be too hard to be Goosebumps. Luckily, both my fears were abated.<br><br>Jack Black and Cate Blanchett have excellent chemistry together. They're both quite humorous, but they also nail the characters' more serious moments. It's weird that a trifecta of children's/family films has produced some of Jack Black's best roles. Although, you feel a bit more of the Jack Black personality here than in his other two roles, he does manifest the character of Uncle Jonathan, the fun uncle who also has a secret undertaken. Overall, all the characters are really well-fleshed out here.<br><br>Visually the film looks great from the 50s' setting to the entire look of the lavish house from the title, especially the scary visuals. Really, they rank with the likes of Tim Burton or Krampus. <br><br>The film knows when to have fun, but it knows when to bring on the scares. As a child I preferred the original book and the other works of John Bellairs over Goosebumps, because the horror was played more directly and seriously, and this movie understands that. Cautious parents be aware that this is as scary as a PG movie can get. Well, maybe not as much as The Witches, but what is. This is definitely Coraline level.<br><br>The only downside is that at a running time of one hour and forty-four minutes, the second act, which is heavy on the character bits, drags a bit. Most of the action doesn't happen till the third act.<br><br>Roth surpassed my expectations here, and I hope he gets a chance at adapting the second book in the series.","user":"jwwalrath-227-85487","rank":[102,139]},{"title":"Decent Adaptation with Hit or Miss Moments","rating":6,"date":"21 September 2018","review":"I was a huge fan of John Bellairs book series growing up, and was excited for a hopefully competent film adaptation. The biggest dissapointment for me was the casting of Owen Vaccaro as Lewis Barnavelt. In the books, he was a well-defined and intelligent protagonist who overcame obstacles via inventiveness. In this film, he's a crybaby with terrible character motivation and a generally useless atmosphere, with Vaccaro giving one of the worst child actor performances I've seen in years (not exaggerating, the \"bully\" character that we're supposed to hate is a better actor and more likeable than the lead).\nJack Black does a good job with the lackluster script and Cate Blanchet's character was probably my favorite in the film. Kyle Maclachlan's brief role is also great, I'm glad he went all out for a relatively unknown movie. The set and costume design is also solid, while the CGI hurts some scenes.<br><br>While I'll never watch this movie again, I would recommend it to parents looking for a unique live action kid's film. The House With the Clock in It's Walls could have been a much more memorable film with a different lead actor, or with a script that drew more from the rich source material.","user":"leaugebrett","rank":[94,130]},{"title":"Decent Waste of Time","rating":6,"date":"19 September 2018","review":"Orphaned and sent to live with his Uncle Johnathan (Jack Black), Lewis (Owen Vaccaro) soon discovers that his Uncle is a Warlock, and his neighbour Mrs. Zimmerman (Cate Blanchett) is a witch. Together the three of them investigate the mansion that their living in - that formally belonged to a powerful and evil Warlock Issac Izard (Kyle MacLachlan), particularly the mysterious ticking that they can hear at night, seemingly coming from within the walls themselves.<br><br>Truth be told, I am probably much older than the target audience for this one. The reviews have talked about this being Eli Roth's first family friendly film but there isn't honestly a lot for the parents in the audience to sink their teeth into. The performances are generally OK, although Jack Black does resort to \"Jack Black\" a few more times than is really necessary. The story is OK, though it ends somewhat abruptly. Occasionally the CGI is a bit of a let-down, but this is the exception rather than the norm, in fact most of the time the film is visually charming.. <br><br>It is occasionally a little too scary for some of the younger children who might see it, but most would cope without any issues. <br><br>The trouble is that it doesn't really add up to very much. You're unlikely to hate it but you probably won't love it either.","user":"southdavid","rank":[128,184]}]