[{"title":"Way better than expected","rating":7,"date":"14 March 2014","review":"I decided to review this one because some of the other reviews are slightly miss leading. I do not pretend in any way to be a film critic... Just your every day regular movie goer/watcher, and as such I must admit I really really enjoyed this one. It has enough twists and turns to keep you hooked till the end and delivers a nice sense of humor throughout the whole movie. Yes, maybe the movie did try a bit too much to be a type of Guy Ritchie meets Ocean's Eleven, but I wouldn't necessarily say that's bad, and I wouldn't say it failed at it either. Bottom line, if you are considering watching it don't think it over too much, go for it and enjoy it, I guarantee it'll have you hooked into the first 10 minutes.","user":"emv1031","rank":[48,56]},{"title":"surprise! nice one!","rating":8,"date":"15 March 2014","review":"Seldom writing reviews, but this one deserved it... just because it got such a low rating.... the movie fulfills the promise of the genre - it's a heist movie, with a bit of comedy in it, and actually funny comedy... and it has interesting plot, with good twist... the acting could be better, the camera could be better, the story could have been better...everything could have been better, but then it would be another movie. This movie deserves higher rating, if for no other reason, then just because it delivers the promised. it s not a masterpiece, it s just a good movie to watch when you want to be entertained... not many movies these days do so, so i must say: bravo,finally!","user":"siwaka","rank":[46,54]},{"title":"Did this even go to the movie theaters?","rating":10,"date":"20 February 2014","review":"This was WAAAAYYYY better than what I thought it was going to be. There are very few movies I don't like of Kurt Russell's but the rest of the cast was pretty awesome too. The comedy part that stood out to me was the banter of Terence Stamp. Funny stuff there! <br><br>If you like Jay Baruchel's acting, you'll get some great scenes with him too. Especially when he had the beard on at the border crossing. Wasn't any nudity that I could think of which is always a bummer but good for the kids. While not action packed like Italian Job or movies of the sort, it was still a great watch. Definitely stay for the end credits as there are some out takes.","user":"elocal-bpalmer","rank":[47,60]}]