[{"title":"Who ordered a 2016 film with 1960s values...?","rating":5,"date":"25 July 2016","review":"Writer/Director Chris McCoy was born in 1981 but, to all intents and purposes, he may as well have come from the 1960s, because, for all its pretense about edginess, the standards and values for this soggy teen coming-of-age story may as well have been plucked from a Doris Day/Rock Hudson romcom.<br><br>Now, ordinarily this is the part of the review where I reassure the reader that, in spite of one of the worst scripts in recent memory, there are loads of other good things here to keep viewers enthralled and entertained.<br><br>Sorry, that kind of happy ending only happens in movies, not in reviews of movies. Unlike fine wine, this one does not get better the more time you spend with it.<br><br>The cast tries hard with the material they are given but sadly that is not enough. (The single exception being Zoey Deutch, who was perhaps the only thing worth watching in Vampire Academy and once again offers the only character worth following in this outing. Deutch has that rare mix of innocence, wisdom and sassiness, bringing to mind an early Diane Keaton. With more edge.) It is also astonishing how a film that tries (unsuccessfully) to base itself on sex has virtually none. This can't be a censorship thing because the other day I was re-reviewing 1978's Animal House (great film!) and that 40 year old flick had more raunch and nudity. So, once again this has to be a director/writer thing -- see comments above on this topic.<br><br>The only one in the entire film who seems to be having more fun than Deutch is Ashley Judd playing a cougar who sets her sights on one of the young boys in the ensemble cast. You almost get the feeling that she waived her usual fee just to take the part.<br><br>Judd and Deutch generally have a great time here. The audience, not so much. If it is entertainment you want, pick up a copy of Ferris Bueller or Emma Stone's Easy A.","user":"A_Different_Drummer","rank":[85,124]},{"title":"promising premise undelivered","rating":5,"date":"18 April 2017","review":"Nora (Zoey Deutch), Andy (Nicholas Braun), Lion (Mateo Arias), and Spice (Israel Broussard) are best friends since childhood. They are unflinchingly good kids in the poor side of the resort town and headed for good colleges. They refused to party or do anything bad. Lion teaches martial arts to little kids. One of his students invites him to her birthday party on the rich side of town where they've never been. The group of townie friends decide to go partying and do all the bad things that they missed.<br><br>This is a promising premise but newcomer Chris McCoy is unable to deliver on the hard-partying fun. The premise is built to be an one-crazy-night movie. Instead, it's all stretched out and it rambles around. There are some rom-com ideas but they're slapped together haphazardly. Although, it does lead to a surprisingly great friendzone conversation. The characters and actors are perfectly nice. Braun has his great lanky awkwardness. Zoey Deutch could do more awkwardness to help her character. The other two have less to do. They're all nice but this is nothing special or anything that funny.","user":"SnoopyStyle","rank":[6,8]},{"title":"Not exactly sure what I just watched","rating":4,"date":"14 May 2017","review":"This movie was kind of a mess from all standpoints. The plot was uninteresting and incoherent. Like, what was the conflict/initial incident even supposed to be? Oh no, their summer of partying has been kind of mediocre...this is so riveting. None of the party scenes were interesting either, \"Woah I made a soufflé\", \"Wow I'm catching food in my mouth\" \"Oh my, watching someone skinny dipping from a kilo meter away, this sure is scandalous!\". And wtf was that dump party at the end? Running around with megaphones and doing mattress fights, no high schoolers do this. Not much was even accomplished in the end. One guy whored himself out and got a yeast infection and was fired from his job. The girl had an unsuccessful relationship where she was cheated on. The karate dude did a bunch of drugs and got fired from his job. And the last guy got a handjob. They only went to like three parties. Barely anything even happened and they're all celebrating at the end as if they just threw Project X. <br><br>The characters were unlikable/dumb/underdeveloped. The main guy was insufferable, a hypocrite, and a moron. Talk about being controlling and jealous after he encouraged his female friend to get a boyfriend. Not to mention the irony in all of his criticisms of her relationship, has he ever heard of projection? And oh my god he actually spent over $2000 to fly some girl to his country when he has essentially no proof that she isn't a catfish and he has feelings for another girl...WAT! That literally makes no sense and the girl didn't really serve any purpose in the story, so I am not sure what the excuse is for that stupidity. Aren't these supposed to be the Harvard kids that are too smart for everyone? The karate guy was really annoying and I think was supposed to be the funny character, but that didn't seem to work out as he was just kinda cringey. The other two were more likable and less annoying, but of course they were pretty much the least developed, so there wasn't much to appreciate there. They're all really disruptive/obnoxious in public, and we see from the beginning that they're really recluse, yet they whine about not being invited places. Hmmm, I wonder why. <br><br>The humour...ummm was it even meant to be a comedy? I don't even think I cracked a smile at anything that happened. I get that humour is subjective but I seriously cannot think of one joke/funny moment in the whole movie. Oops. <br><br>Everyone in the movie acted stupidly unrealistic, I could not relate to any of them even though I am nearly the same age as most of them. That fight scene was one of the dumbest things I have every seen. The karate guy is somehow able to 1v6 a bunch of fully grown men who are twice his size. Like I get that he teaches tai chi or whatever but I am sorry this is not anime or Super Smash Bros, in real life he would get pummeled. And then the cops show up to see 6 unconscious men on the ground surrounded by a bunch of drunk teens and the extent to their investigation is just \"They must've deserved it harharhar\". Like the cops are just like \"Want a ride home in a cop car?\", uh okay never mind the guys that may or may not be dead on the ground or the hundred underage drinkers. What world do these people live in?<br><br>Was not terrible, but at the same time it kind of was. 4/10","user":"Brc123","rank":[4,5]}]