[{"title":"He's holy, but not wholly. He's funny for sure..","rating":17,"date":"17 October 2014","review":"St. Vincent, starring Bill Murray as Vincent, asks us to define the qualities of a saint, while we enjoy the decidedly unsaintly Vincent. He defines curmudgeon, a cranky old misanthrope unhappy with his life and ready to dress down practically anyone who talks to him. The film itself is an amusing character study with unanticipated turns.<br><br>But don't think you can write the script because Vincent and the motley crew of his life have surprises that do not fit the usual bitter old guy formula. The saving grace is the honesty Murray invests in the role, which requires him also to display caring characteristics not immediately apparent. That we are probably spying into the eccentric character of Bill Murray through Vincent is an added treat.<br><br>The catalyst for the clichéd curmudgeon turnaround is a new pre-teen next door neighbor, Oliver (Jaeden Lieberher), who is thrust on Vincent for after school babysitting by med-tech mom, Maggie (Melissa McCarthy). While the bonding is to be expected, Vincent and Oliver do a long dance before any saintly traits emerge. Yet Oliver learns what saints don't ordinarily do, like fight and gamble. As we learn, those aren't necessarily negatives.<br><br>Although Naomi Watts' Russian hooker is a bit over the top in beauty and heart of gold categories, she manages to project a simple love for Vincent, a symbol for everyone who loves Vincent even as rough as he is. Although Vincent could be loved for only his Vietnam experience, he does low-key, un-Mother -Teresa-like acts of kindness that could qualify him for sainthood.<br><br>That's the important theme of this tragicomedy: Being good, loved, and saintly are within the grasp of the most common among us, implying that imperfection is a constant of being human and maybe a bigger credential than piety when that sinfulness is transformed into good deeds.<br><br>St. Vincent is an entertaining film with a well-worn message, but Bill Murray, in his finest role since Lost in Translation, transforms it into holiness.","user":"jdesando","rank":[94,105]},{"title":"Saint Bill","rating":8,"date":"24 October 2014","review":"This film is recommended.<br><br>The old curmudgeon has been a screen staple from Lionel Barrymore to Walter Matthau to Jack Nicholson. Yet no one has played this type of character so well these many years as Bill Murray. Even as a young man, the actor brought with him that droll view of life, a wicked acerbic wit, and a unique ironic humor to his many film roles from Ghostbusters to Scrooge to Lost in Translation. So his portrayal in St. Vincent may not be much of a stretch for the actor, but it is wildly captivating performance that needs to been seen.<br><br>Yes, the story is far from original. Crotchety old man finds love and redemption by the love of a young kid who he befriends begrudgingly. Vincent is a drunk and a gambler. Yet, his new neighbor, Maggie (a subtle and convincing Melissa McCarthy), hires him to babysit her son, Oliver (Jaeden Lieberher), while she is at work making ends meet. Now right there, one questions the entire sit-com set-up and implausible story of the film, but one goes along with the preposterous notion for sheer entertainment purposes.<br><br>Placing Mr. Murray in that pivotal role is the force that binds this story together. He is both charming and repulsive in this part and the actor is an absolute comic delight. Vincent's the man-child, a boy who never grew up, a loner who survives from day to day and Murray nails his character. His droll asides when taking his young charge to a bar or racetrack, or cavorting with strippers and other unsavory persons are key to the film's enjoyment, as is his wonderful chemistry with Master Lieberger, who gives a natural and lovely performance as a child who seems to have more common sense than any of the adults in this film.<br><br>St. Vincent is an auspicious film debut by director/ writer Theodore Melfi. While his initial premise is spotty, the filmmaker more than acquits himself with his funny script and fine casting. Rounding out this wonderful trio of actors are Chris O'Dowd, Terrence Howard, and especially Naomi Watt as a Russian call girl with a heart of platinum. The entire ensemble delivers their lines with brutal accuracy and delicious comic timing, even if the film leads to a rather mawkish and sappy ending that some may find to be poignant. One just can't help relishing in the overall fun.<br><br>Technically, Melfi needs to learn more restraint as a director. He tends to overuse pop songs to reinforce his message and overdoes many scenes with melodramatic spurts. As a writer, he creates effective dialog mixed with one-liners that, at least, stay true to his well-written characters. But his plot structure is too conventional and simple in every sense of the word. He may easily achieved his goal in making a crowd-pleasing film, even if it lays on the pathos a bit thickly. And from the reaction of the moviegoers in my audience, the film scored highly amid the audible aahs and sniffles to my left and right. It doesn't merely tug at the heartstrings, it plays two part harmony too.<br><br>In truth, St. Vincent owes so much of its success to a small blessing known as Mr. Murray. It is his compelling presence that is the main attraction on display, and on that, everybody can rejoice! GRADE: B","user":"jadepietro","rank":[60,70]},{"title":"Pitch-Perfect, Under-Rated, Wonderful","rating":9,"date":"30 October 2014","review":"There is a school of film reviewing which suggests that a film is like a symphony, to review it, don't bother with minutiae, just listen for a false or off-key note, and deduct points accordingly.<br><br>By that approach, this film would be a 10 because there are no false notes.<br><br>And it is really that good.<br><br>The key to these sorts of films is trust your script, trust your actors, and trust the director to simply to give them lead and let them run. Which is precisely what we have here.<br><br>The iconic Bill Murray gives his most memorable performance since MEATBALLS -- which, BTW, launched the entire Canadian film industry -- even though it is not actually a comic role. Impressive.<br><br>Naomi Watts give her most memorable performance since MULHULLAND DRIVE where, as a glowing young ingénue, she stole scene after scene. She steals here too.<br><br>Even Melissa McCarthy, who many consider a scenery-chewer and over-the-top, is wonderfully restrained and actually creates an empathetic character.<br><br>Delightful.","user":"A_Different_Drummer","rank":[117,150]}]