[{"title":"Winning First-Hour, Average Second!","rating":6,"date":"13 July 2012","review":"Homi Adajania's 'Cocktail' has a Winning First-Half, but an Average Second. It begins wonderfully &amp; offers some hilarious moments, but in the latter hour, the proceedings not only become serious but also very dry. Nonetheless, a decent effort!<br><br>'Cocktail' is about 3 friends, of whom each, falls in love with one another.<br><br>'Cocktail' rides on an excellent first-hour, with each sequence working big-time. But as mentioned, the second-hour is average. The proceedings appear dry. Imtiaz Ali &amp; Sajid Ali's Screenplay is good, but could've been tighter in the latter hour. Homi Adajania's Direction is highly efficient. Cinematography, Editing &amp; Production Design, are top-class. Music by Pritam, is terrific.<br><br>Performance-Wise: Saif Ali Khan is a fine actor &amp; the actor once again pitches in a sincere, believable performance. Deepika Padukone is fantastic, her performance stands out. Diana Penty does quiet well, although her role lacks meat. Dimple Kapadia &amp; Boman Irani are impeccable. Their sequences are simply hilarious! Randeep Hooda deserved a better deal. <br><br>On the whole, 'Cocktail' is a decent effort.","user":"namashi_1","rank":[23,28]},{"title":"A heady mix!","rating":8,"date":"13 July 2012","review":"Bollywood has had its share of love triangles. Does Cocktail have something fresh to offer or it's just an old drink in a new glass? <br><br>Meera (Diana Penty) is a traditional Indian girl in London who meets the London bred and oh so sexy Veronica (Deepika Padukone) by chance. They gain from each other's contrasting personality and friendship blooms. Gautam (Saif Ali Khan) the happy and getting lucky with women kind of a guy falls for Deepika and he gets friendly with her best friend Diana. As it so happens in real life, Saif develops feelings for his girlfriend's best friend Diana too. Cocktail is the story of friendship that will undergo a litmus test, of love, heartburn and heart breaks. Does friendship supersede love or love prevails over friendship? Was the best friend bond wafer thin? And can anyone 'rise' in love? I won't tell you. Watch the movie ;)<br><br>The movie has lots going for it. The introduction of Saif, Diana and Deepika is flawless. Their camaraderie is so enjoyable you get simmered in their funny and frolicking ways. What happens then is a realistic depiction of problems between friends about love and companionship. You are bound to identify with the highs and lows it takes you through. The second half is marginally stretched and could have been trimmer but that, would be nit picking. <br><br>Saif has played such roles earlier. As such this is not a fresh character for him but Gautam Kapoor is his best portrayal of what he does best – a cute, fun to be with and innocent character. He portrays it with finesse, in comedy scenes and the dramatic ones. Deepika sizzles as a sexy rich brat. She looks hot and is unstoppable as Veronica. Her depiction of a wild child caught in an emotional web is praise worthy. Diana's debut couldn't have been better. Perfectly casted, she is never out of character and manages to hold her own even with experienced actors like Saif and Deepika. The seniors, Boman Irani as Saif's mama and Dimple Kapadia as Saif's mother are very good too. Randeep Hooda even in a very short role is good. <br><br>A great cocktail needs the right mix. Imtiaz Ali's script not only delivers but packs a punch! Here's an example of what an excellent script can do. The intelligent dialogues guarantees laughs and keep the mix tangy. Pritam's 'Tum hi ho bandhu' is already a rage and 'Jugni' too is an outstanding song. Anil Mehta captures the beautiful locales well and Sreekar Prasad's editing is crisp. Anaita Adajania deserves a special mention for the apt costumes and making Deepika look her sexiest self. <br><br>Director, mixologist Homi Adajania should be credited for getting this mix spot on. He treats the excellent script and dialogues with élan, adds great music and extracts superlative performances from his actors. This Cocktail is a fresh take on love triangles set in the contemporary milieu and is so refreshing, you might even ask for a repeat. A great watch whether with friends, best friend, girlfriend, boyfriend, love interest or your ex! Grab your seat now!<br><br>Watch for: A thoroughly enjoyable contemporary and mature love story. Watch out for: Performances. Don't watch if: Nai yaar. Go watch. <br><br>Story: 9 | Screenplay: 9 | Performances: 8 | Songs and Music: 8 | Direction: 8 | Overall: 8/10","user":"rajshah","rank":[23,29]},{"title":"Again, people on here have slammed a refreshing attempt, only to applaud typical trash like Bol Bachchan. Oh dear.","rating":8,"date":"18 July 2012","review":"I wasn't surprised to realise the point made in the summary, for one reason: this is a film that easterners may not have the capacity to digest. I'll tell you why this is the case and what I thought of the film.<br><br>First of all, this is co-written by Imtiaz Ali, the director who presented us with films like Jab we Met ('07), Love Aaj Kal('09) and Rockstar ('11). It is perhaps his touch that takes this film beyond the reach of those who prefer the typical 'masala' stuff, examples of which have been given above. For me, it is once again a pleasure to experience all that Imtiaz's writing brings to a film, not least in the situations created, dialogue, and humour evoking parts. New ground has been broken above and beyond Zoya Akhtar's Zindagi Na Milegi Dobara.<br><br>Secondly, this film has been directed by Homi Adajania. He's the director who had the guts to attempt something like the almost perfectly executed 'Being Cyrus' on debut. With is name on the film, you have to anticipate that it will present something in a different manner. Once again, he has done a solid job. Though the second half could have benefited from a few changes, this is once again a solid effort.<br><br>Above I have provided an explanation of why this film won't be the cup of tea of many in India, but instead to Asians living in the west and fans of off-beat cinema. Now let's focus on the positives and negatives.<br><br>Of course, as with any review, it is necessary to provide an account of the performances of the cast. Saif Ali Khan is extraordinarily natural in this role. No other actor in India could have fulfilled this part to a level anywhere near his. The film marks a solid start to Diana Penty's career in Hindi films, who is consistent throughout. Deepika Padukone has given her best performance to date. She has been set the task of fulfilling a very difficult role and she throws absolutely everything at it. Kudos. Boman Irani is very good (and funny!) throughout. Special mention to Dimple Kapadia who is effortlessly entertaining as the Desi mum. She is part of of one of the most hilarious scenes in the film, shot on a beach in Cape Town, South Africa. Randeep Hooda gets an opportunity to shine with his brief appearances but he has once again grabbed it with both hands.<br><br>The film has been shot in London, New Delhi and Cape Town. As such, the cinematography, is amazing. Credit to the D.O.P, Anil Mehta, who has captured the beautiful views of Cape Town and the chaotic and unpredictable nature of life in London very successfully.<br><br>The soundtrack is one of the best of the year, and is entirely appropriate given the film's title. It's a rich mix of different flavours that packs a punch. The chart buster 'tumhi ho bandhu' is beautifully picturised. The other tracks are pretty amazing too.<br><br>A negative is the second half as previously mentioned, leading to the climax, which could have benefited from a greater insight into emotions. I suppose you could also argue that the climax itself is not quite sufficient for all that's gone before.<br><br>Overall, this is one of the best films of 2012 so far, regardless of the flaws. The main plus points are the performances, a great soundtrack,amazing cinematography and refreshing dialogues. This is a film for you if you, like me, encourage further exploration of genres new to Indian cinema, but also want to enjoy a film at the same time. Go for it! <br><br>8/10.","user":"XxMaverickxX","rank":[13,17]}]