[{"title":"Utterly compelling.","rating":10,"date":"13 February 2013","review":"I really don't understand how this doco only scores a 7.3. It's the most compelling piece of film I have seen in years, I was gripped from the beginning to the end. It is basically about the early fight for treatment research and recognition that HIV sufferers have a disease and were entitled to respect and humanity from the wider community as it was not a punishment from God for a so called \"lifestyle choice\".<br><br>It is structured by piecing together a lot of archive film that is edited so brilliantly that it like watching a scripted film that tells a great story, a film with real stars and characters. The subject matter is based on HIV but what I took away from the film is how people with such a motivation did \"act up\" and used democracy to achieve an objective. It is compulsive viewing for any interested in any type of campaigning.<br><br>My only criticism of the film is it did not fully explore the reason for the early antagonism toward people with the virus and why the medical establishment and governments at that time were slow to act. But in the end I seen a film about a story I did not know about, a story about successful democratic campaign that has saved millions of lives. I now think these early campaigners should have got Nobel recognition. The film is that powerful.","user":"jpm-387-613125","rank":[14,16]},{"title":"wonderful, bittersweet look at a movement over ten years","rating":10,"date":"25 September 2012","review":"That seeming rarity: an incisive, heartfelt documentary about people doing good that is important, even today as AIDS is not the 'plague' it once was. It shows what people will do when they are pushed to a limit - it's not even about gay rights but about human rights, for proper health-care for the deathly ill. It's filmmaking that doesn't shy away from the rougher areas - when there is infighting in ACT UP, the director (first timer David France) shows it warts and all. But it's the heroism by the likes of Peter Staley and Mark Harrington that shines through the most. As Roger Ebert said, it's most emotional for the audience with a drama when seeing good people suffer, as do the people in ACT UP and in the AIDS crisis, and in doing good, against all odds. <br><br>We get the sense that they were not just fighting for themselves, though that was certainly a big component, but fighting for the millions that needed the medicine that could at least be attempted. The saddest part is seeing the trial and error over the years, where people who did take the early drugs like ATX just didn't get better like they should've. It's a bittersweet conclusion since by the time the medicine did get to the point where AIDS was at least something people could try and not, you know, kill them, so many had already passed (the ticker per-year that comes up becomes more and more shocking, albeit a lot of these numbers were from Africa). As a document of the AIDS/HIV crisis and as a pure protest movie and 'Fight the Powers That Be!' saga, it's moving, harsh, and keeps its story moving with compelling people who faced up to the fact that their fight had to be about science even before it being a social issue. <br><br>Oh, and the sort of 'reveal' you don't even expect in the last ten or so minutes... it shoots this up to being essential viewing.","user":"Quinoa1984","rank":[16,19]},{"title":"Extremely Well-Made","rating":2,"date":"2 January 2013","review":"How to Survive a Plague (2012) <br><br>**** (out of 4)<br><br>David France's excellent documentary takes us back in time to see the fight AIDS activists had to go through in order to get where we are today. Through video clips, interviews and other forms of video footage we see how the times changed throughout the years while the main focus of the film is set during the late 80s and early 90s when political indifference and a lack of any plan caused millions of people to die while drugs that might have helped them weren't being given to them. What's so great about this movie is that it uses video footage from throughout the decades to tell its story. It could be media reports, underground videos, appearances by people on talk shows or various other forms of footage that really gives one a terrific idea of this uphill fight. Director France does a rather remarkable job editing the footage together to give the viewer a complete idea of what it was like during these times when it seems no one could agree on what to do next. The film covers the activists hopes for what would happen, the politicians refuses to step in for a variety of reasons and even the Catholic church's controversial statement that condoms were sinful. I thought the film really did do a great job at showing future generations the \"war\" that these people were pretty much going through in order to try and get something done. Some will argue, perhaps rightfully, that the film is too one-sided since it only gives off one side. I understand this argument and I would have liked to have heard from some of the medical departments on why more wasn't done. Still, HOW TO SURVIVE A PLAGUE is a pretty haunting and dramatic little picture that will certainly be a staple of its subject for years to come.","user":"Michael_Elliott","rank":[14,17]}]