[{"title":"Surprising, but needed trimming","rating":4,"date":"9 June 2015","review":"I assumed this was a low-budget student-made film, based on the number of ratings and reviews, so I was not expecting anything good to come out of it. There were certainly moments that broke my suspension of disbelief; moments in plot that made no sense, ADR that sounded off, and brief moments of unbelievable acting, but overall, it was better than I expected.<br><br>In contrast, the main cast was phenomenal, both in performance, and in recognition. Imagine my surprise to see that an international director doing his very first feature-length film roped in three world-class actors.<br><br>In all honesty, it was the acting that held the entire thing together - as you may expect from a film set almost entirely in an elevator.<br><br>It was definitely slow to get going, though. It wasn't until the half-way mark that the plot actually got interesting. Occasionally things would happen that offered no value to the story line, and until the forty minute mark, a lot of it felt like filler, like the movie wasn't going to be long enough, so more scenes were added.<br><br>Nothing was more annoying than thinking something interesting was going to happen, only to realise that nothing was happening at all. I began to get bored after the opening sequence.<br><br>That being said, if you can endure the first act, you may be pleasantly surprised by the second, as things begin to pick up the pace, and the characters really begin to develop and take on their own stories.<br><br>In the end, I wasn't impressed by the actual plot, and its conclusion. It was an interesting idea, to be sure, but it made for a rather dull conclusion, when it was revealed what it's all about.<br><br>Basically, I was pleasantly surprised by the film, but only because I expected a no-budget indie film.","user":"josiahhilbig","rank":[4,4]},{"title":"Secret Sentence","rating":8,"date":"19 December 2014","review":"This movie reminded me of the 1991 movie \"Closet Land\".<br><br>Movies with a minimal amount of actors can sometimes be overwhelming with the lack of on screen charisma, but these actors are powerful enough to draw my attention for the limited amount of time they have to tell their story.<br><br>What I like best about this movie is the ending leaves you with the question, \"What was said in the middle of the movie?\" If you had seen this in the movie theater you would have left with an unanswerable question. Classic move on the writers part, and classic movie for people that like movies.","user":"shoantell","rank":[7,13]},{"title":"Not Bad","rating":6,"date":"23 January 2019","review":"So this is low budget but it is a good find. I'd rather give it a 6.5 rating because it is better than 6 but not quite a 7. This has a limited cast and it is shot mostly in an elevator. I like watching films like this just to see if people can come up with some interesting scenarios for such a tight set. It really isn't too bad. The acting is decent for the most part. It was filmed well and I liked the story. I was a little unsatisfied with the ending but only because I wanted to know more. This worked out just right for my rainy day and nothing to do.","user":"Foutainoflife","rank":[1,1]}]