[{"title":"If Wishes Were Fishes...","rating":6,"date":"14 February 2014","review":"In bringing together elements from Inglourious Basterds, Ocean's Eleven and Museum Hours, George Clooney certainly had plenty of opportunity for a rich and interesting story. War heroes who appreciate fine art played by the likes of Clooney, Matt Damon, Bill Murray and John Goodman (plus a few \"that guy\"s), attempting to steal back priceless works of art from the Nazis, it sounds amazing.<br><br>So what went wrong? Well, to begin with, for a movie about a team, we're given very little time with them as a group. Almost immediately they pair off on their own little adventures. Instead of using these exploits to let us know a little more about the characters as individuals, we get the usual oddball pairings and some mildly amusing, but ultimately hollow, vignettes. Even when we lose some of our team, it really feels like nothing more than just something that happened on the trip, like \"oh, and I also saw a horse.\" We have hardly any sense of them as a group and far less about them as people. The only character whose motivations we can understand is the one played by Cate Blanchett, but her limited chemistry with Matt Damon dooms what little redemptive quality her character had.<br><br>Also, and particularly troubling for a movie involving art, George Clooney's lens has little reverence for the work it shows. Though the film heavy-handedly ponders whether a piece of art is worth a human life, the camera never does. Even when a character lays down his life for a sculpture, it comes off less dramatic than inevitable. The film treats the works as being mostly historically significant and never finds that lover's gaze that tells the audience why.<br><br>What we're left with is a bag of spare parts. It's a popcorn movie with no setpieces. A war movie with no battles. A heist movie with no scheming. An art movie with no inspiration. Were they to have found some of Inglourious Basterds' bluster, Ocean's Eleven smarts or Museum Hour's insight, they may have found a formula that works, but that's not the movie we have here. I'll be damned if George Clooney doesn't look good in a moustache, though.","user":"MassDistraction","rank":[181,217]},{"title":"Danny Ocean stars in \"Saving Private Art\"","rating":4,"date":"7 February 2014","review":"If you want to see George Clooney play George Clooney, Matt Damon play Matt Damon, Bill Murray play Bill Murray, John Goodman play John Goodman, and Jean Dujardin play a clichéd Frenchmen (right down to the French beret and scarf)...in a incredibly mediocre film based on a compelling true story that's badly written and directed, go see \"The Monuments Men\". It's an \"Oceans 11\" team of art curators, historians and architects sent into France and Germany. Their mission? \"Saving Private Art\". The obstacles? Almost none, once they knew where to look. It was apparently the easiest art heist in history. The plus side? it's a stretch...but I did like Hugh Bonneville playing someone kinder and gentler than Lord Grantham in \"Downton Abbey\"...and Cate Blanchett? She's always great, but she truly doesn't have much to do here, other than speak with a French accent and look irritated. Don't be fooled by the star-studded cast like I was. This movie is a waste of your money and time. All of these actors have made far superior films. And this story would have been better served by a more accomplished screenwriter and director.","user":"CanuckGirl","rank":[163,203]},{"title":"Not nearly the worst film of 2014, but the most disappointing one so far.","rating":6,"date":"9 February 2014","review":"The Monuments Men is directed by George Clooney, staring himself, Matt Damon, Bill Murray, John Goodman, Jean Dujardin, Bob Balaban, Hugh Bonneville, and Cate Blanchett. It tells of a group of soldiers tasked to locate and preserve pieces of art that have been stolen by the Nazis during World War II.<br><br>It's no secret that The Monuments Men was one of everyone's most anticipated movies of 2013, and looked like a solid awards contender, until it was pushed to a February release date, purportedly due to the need for more time to be spent on the special effects.<br><br>The truth is, The Monuments Men could be, and really should be much more entertaining than it is. The best part of the film, and at the same time, its major problem, is the script. There are seemingly continuous laughs coming from quick one liners and witty character interactions, which keeps the audience somewhat engaged, although with such bleak subject matter, it's debatable that a movie dealing with the eradication of an entire culture's achievements should be as lighthearted as it is. But the flaw with the script is that it seems like the first act eats up almost all of it's running time. It's as if the film is missing large portions of the actual plot to make room for massive amounts of unnecessary exposition. Secondly, the film's characters are stale and one dimensional at best. I invite anyone who sees the film to wait an hour after finishing the movie, and try to remember even three of the character's names or what their role in the mission was. There isn't a moment in the entire film where it isn't simply John Goodman or Bill Murray dressed as World War II soldiers and not fleshed out characters. Albeit all of the actors are exceedingly fun to watch, I assume that just watching all of these actors talk together at a press conference would be just about as entertaining.<br><br>The Monuments Men isn't even close to the worst movie of 2014 by a long shot, even though it is only February, but it's arguably the most disappointing film of the year as of yet. I take no pleasure in saying this, but it's noble intentions fell utterly short due to awful pacing, and forgettable characters. I haven't read the book, but I have to think that it must be much better constructed and does this fantastic real life story more justice.","user":"mikerapuano","rank":[284,366]}]