[{"title":"the Dark Knight Returns with a BANG!","rating":10,"date":"17 January 2013","review":"This is the animated film comic fans have been waiting for. Batman fanatics will want to watch this and the Dark Knight Returns Part I back to back. Casual movies goers will want to head to their local comic shop for the first time ever.<br><br>The Dark Knight Returns by Frank Miller is among the most acclaimed graphic novels ever. For years fans hoped for a film version of this four part miniseries. Just when we thought the cinematic world of Batman couldn't get any better (thanks to Chris Nolan's masterful Dark Knight Trilogy) we were finally bestowed the very faithful film adaption of the Dark Knight Returns.<br><br>This films follows immediately after the Dark Knight Returns Part I. Bruce Wayne is old but more determined than ever to reclaim the city. Batman is met with both praise and animosity from the public. Commissioner Gordon has retired. The new commissioner wants Batman arrested. A teenage girl is the new Robin. Nazi gangs are roaming the streets. Joker is being released from jail. Green Arrow is getting involved in Gotham City's conflicts. Street gangs proclaim to be the Sons of Batman. The Cold War is about to reach its nuclear climax. Superman has been hired as an assassin by the president....<br><br>All of these events come together beautifully (and with many surprises) in a well-paced, brilliantly written, thought provoking, elegantly animated, and savagely action-packed epic played out by fascinating characters. The Dark Knight Returns reaffirms that the Legend of the Dark Knight is timeless and can only die when the rest of the human race goes with it.","user":"thezakman182","rank":[92,113]},{"title":"totally epic","rating":10,"date":"1 February 2013","review":"after the first part came out i thought this is as far as a thriller animation can get............ . I WAS WRONG.<br><br>I don't know how they have managed to show all this in 75 minutes .. but i thought i was watching a 2 hour movie and the thrill never went down . NOT EVEN FOR A MINUTE ,<br><br>the battle between BATMAN AND JOKER was mind blowing and to be honest my body was shaking <br><br>but to my surprise the end battle between BATMAN AND SUPERMAN was even more brutal and thrilling .What else could you ask for <br><br>I have watched almost all the batman anime .. <br><br>BUT TAKE MY WORD THIS IS THE BEST BATMAN ANIMATION EVER.","user":"shuhaabshah-3","rank":[76,93]},{"title":"Satisfying second part","rating":9,"date":"15 January 2013","review":"The first part was in itself great, but the second part really breaks the boundary of excellence. Not being familiar to the graphic novel origins of the story, what happens in second part really blows my mind. Not only does Batman have the Joker to contend with, but put Superman together in the mix, and you get another level of awesomeness.<br><br>I feel like the animation in the second part is more fluid, the fighting choreography was smoother and the direction, especially the \"camera\" work was definitely better than the first. An overall improvement. However, it might also be due to more \"stuff\" happening in the second part, thus more avenues to feature all these improvements.<br><br>This is one of the best animated movies I've had the chance of seeing. It even stands fairly well on its own without watching the first part, but seeing the first part adds a lot to the enjoyment of the second. Watch this. I don't give out 9 stars easily, and this movie is better than every movie I've watched in 2012. A very good start to 2013.","user":"thebackofmyhouse","rank":[48,60]}]