[{"title":"A new spin on Christmas traditions","rating":1,"date":"1 December 2011","review":"This short animation is about a young mammoth going to the North Pole to search for Santa Claus because she wants to prove to her father that Santa Claus exists.<br><br>Just as you think all tales about Christmas have been told, \"Ice Age: A Mammoth Christmas\" comes up with yet another idea regarding the festive season. The animation is fun and entertaining. The characters are cute as usual, and they are up to much merry, harmless mischiefs. The atmosphere of the animation is warm, positive and has a strong family theme. The ideas about how Christmas traditions come about in the Ice Age world is fun as well, making it a great film for children.","user":"Gordon-11","rank":[11,17]},{"title":"Wonderful Modern Family Holiday Viewing!!","rating":8,"date":"7 December 2011","review":"I'm basically older than rust - and my idea of holiday 'specials' is limited to the classics: 'Rudolph', 'Charlie Brown'... those modern cartoons that came out in the 80's were beyond lame, so I was somewhat suspicious of this when I first came across it.<br><br>Now that I've watched it twice (and will probably watch it again soon), I have to say, WELL DONE!! Modern, familiar characters - portrayed in true-to-character form - and presented in a short, family friendly format. HOORAY!! Family entertainment, happy ending - and lots of laughs for adults too!<br><br>So, added to my once yearly viewing with the aforementioned will be Scrat in his eternal hunt for the ultimate acorn.... and all the other 'Ice Age' alumni!","user":"redd0531-232-883930","rank":[12,19]},{"title":"Festive fun with the Ice Age characters...","rating":8,"date":"18 March 2012","review":"I enjoyed the first two movies, was mixed on the third and liked Scrat's Continental Crack-Up. I was anticipating Ice Age: A Mammoth Christmas, and found it did live up to expectations. While short, perhaps a little too short, it is festive and fun, with the animation as great as ever especially in the beautifully detailed backgrounds and the music jaunty and putting you in the mood for the festive season. The writing even with the odd forced moment is mostly witty and funny(with Diego having the best lines), and the story is engaging and heart-warming with a warm atmosphere. I have always liked the characters and they are still entertaining, with Scrat stealing every scene he's in and Peaches is adorable, and the voice acting is solid across the board.<br><br>All in all, a lot of fun and perfect for the Christmas season. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[7,10]}]