[{"title":"Not your ordinary romantic comedy...","rating":7,"date":"3 February 2014","review":"The Right Kind of Wrong is an unusual film...<br><br>It takes a lot from common clichés that we're used to understanding as typical romantic comedies but it builds upon it and presents it in a novel yet interesting way. The main protagonist is not a common well behaved steady earning good boy that we're grown to expect from this genre. On the contrary - he is a broken man with a joke for a career, no ambitions and plenty of other weaknesses to top that up. The girl however... Well, she's equally humane. :) And that's about it when it comes to things worth knowing about the flick. It's not the genre nor the cast that will make you enjoy watching it - it's just the fact that all the characters are so \"real\" and not over the top smoothed out for Hollywood role models. As the title suggests the right things about the movie are all the wrong ones and that's what makes it a definite watch!","user":"kadt-uk","rank":[30,37]},{"title":"Story and characters that grow on you","rating":7,"date":"15 October 2013","review":"Filmed in beautiful Banff, Alberta. About a failed writer whose ex- girlfriend writes a blog about what a loser he is, that goes viral. He then falls in love with another girl on her wedding day. Fairly tame story that actually gets better in the second half. It does have its share of trite 'Degrassi' moments but overall I found myself liking it. Beautifully shot, in a fantastic location, the movie's setting really is what takes this movie to thumbs up. Jason Stackhouse (c'mon, you know who I mean!) plays the main character and does it admirably and the female lead is charismatic as well. The side stories could use a boost but I can live with them. The adversaries are straight out of 1980's college movies but it appears to be on purpose so it is forgivable and Catherine O'Hara spins a decent tune as the hippie mother. Enjoyable characters and an overall not bad!","user":"caldepen","rank":[26,32]},{"title":"I Just Don't Get It","rating":3,"date":"17 July 2014","review":"Quite honestly, I am surprised that this movie is getting such great reviews. To begin with, the main character, Leo, falls in love with Colette, a complete stranger, on her wedding day. He pretends that he is a guest at her wedding and proceeds to hit on Colette in front of her husband which (obviously) causes a scene and gets him kicked out. In a later scene, the bride's mother comments that she thought his actions were \"ballsy\". No, actually, it is extremely creepy and inappropriate to behave like that and cause such a scene at a strangers wedding.<br><br>The rest of the movie is dedicated to watching Leo's multiple attempts to get Colette's attention. She rejects his advances numerous times but he won't stop bothering her. Eventually, this starts causing problems in her marriage and she winds up with Leo by the end of the movie. <br><br>The plot of this movie disturbs me. After multiple rejections, he will not leave her alone and I couldn't understand why Colette and her husband were being so nice about it. 3/4 of the way through, the husband steps in and threatens Leo, which is the movie's attempt to make the husband look like the bad guy but the reality is that Leo is the bad guy. He interferes with complete strangers lives/marriage and will not quit until he gets what he wants. In typical romantic comedy fashion, they try to make his advances seem innocent and endearing however any normal person in real life would have taken out a restraining order about a half hour into the movie. I am tired of romantic comedies glorifying stalking behaviors that would normally get you arrested.","user":"Vogon-Poet","rank":[17,20]}]