[{"title":"It's a matter of taste, but I found it very funny","rating":8,"date":"12 February 2013","review":"Nat (Rose Byrne) and Josh (Rafe Spall) get married after a whirlwind romance. As their first year of marriage progresses, they begin to learn that they don't seem to be very compatible. When one factors in the reappearance of Josh's previous love interest Chloe (Anna Faris) and Guy (Simon Baker), a romantically inclined client of Nat's, both of whom seem to have much more in common with the spouses, one wonders whether the marriage will survive for a year.<br><br>This romcom is, in the modern fashion, fairly rude, so don't go and see it if you are offended by smutty humour, sex, nudity or bad language. It is also, again in the modern fashion, largely powered by the humour of embarrassment (best friend Danny (Stephen Merchant) delivers a Best Man speech of excruciating embarrassment, aware but uncaring of the offence and discomfort he causes, for instance). Again, if you don't care for this sort of humour, you're not going to enjoy the film. And it's clear that a number of reviewers, both professional and other, belong firmly in that camp - nobody likes everything.<br><br>But the proof of the pudding lies in the eating. I saw this film in a fairly well attended screening with a mixed audience, mostly mature couples and not the sort of audience I would have expected this film to appeal to, except that they were all people who had experienced the difficulties which the experience of living with someone else brings with it. And that is at the heart of this film. When I wasn't laughing out loud, I was giggling almost constantly - I found this film very funny. And, from the evidence of my ears, I was not alone - there was a lot of (especially female) laughing out loud.<br><br>Spall and Faris have some funny stuff, and Byrne is also funny by virtue of playing it straight - of the 4 principals, only Simon Baker suffers from an absence of humorous material. But the secondary characters make up for this, with Merchant's crass best friend and Olivia Coleman's sour relationship counsellor being best of the bunch. There are some very funny set pieces - Baker's attempted hotel seduction, Faris' threesome, Coleman's phone diatribe - and stay through the titles in order to catch Jane Asher's final line.<br><br>I really enjoyed this and I recommend it highly (but only if you are in the mood for that sort of thing).","user":"neil-476","rank":[48,67]},{"title":"Skip, skip, skip","rating":2,"date":"10 April 2017","review":"Have you ever literally cringed? <br><br>I felt like doing so at many times during this film. Let's call it a movie, as I think 'film' should be reserved for something better.<br><br>To begin, I WANTED to like it. I really never followed Rose Byrne, but I liked her in X-Men, and I have liked Anna Farris in a couple of things. The first twenty minutes or so however should have been a clear indication that I really wasn't going to, and I should have cut my losses then and there. <br><br>But no. I watched until the sleep-inducing end.<br><br>NONE of the characters are very likable although their unlikeablity ranges from mild unlikeability to extreme dislike. Nat (Rose Byrne's character) is a total witch and you get the idea that no matter who she is married to, that won't change. Her husband, played by Rafe Spall is the most likable, again, of unlikeable characters, and is portrayed as dumb, uninteresting and a moron sometimes. Simon Baker's character is just dull, uninteresting, and it felt like the actor was just calling his scenes in. Anna Farris looked pretty bad and her character was such a tremendous pushover you kind of wanted to slap her. Oh, and a special mention to Rafe Spall's character's best friend who should win an award for most annoying supporting character EVER. <br><br>Note to the makers of this film: YOU CANNOT have a hit if most of your characters have almost no appeal whatsoever.<br><br>The premise too was just bad-awful and you know it is a movie while watching it because in the real world no real person would act/react the way any of these characters acted in several of the scenes. <br><br>The comedy itself wasn't HORRIBLE, it just wasn't really THERE. There are literally NO laugh-out-loud moments, although there are a couple of cute 'haha', funny scenes. Mostly though, again, you just feel as if you have to cringe in embarrassment for the fake (in every sense of the word) \"people\".<br><br>The ending is so ... trite ... but fits the entirety of the movie well, in that nothing about it is any good.<br><br>All in all, I wish I had skipped it.","user":"Her-Excellency","rank":[22,29]},{"title":"I'd give it a miss!!","rating":4,"date":"27 February 2013","review":"I Give It a Year. As a cinema lover, I'd give it a miss! Dan Mazer (famous for writing Borat and Bruno, starring Sacha Baron Cohen) gives his directorial debut with this rom com that looks at the trials and tribulations of a newlywed couple during their first year of marriage. Rafe Spall and Rose Byrne play the 'happy' couple and the film also features the likes of Anna Faris, Minnie Driver, Simon Baker and Stephen Merchant.<br><br>In a word: terrible. The film is very cruel in the way that the first 5 minutes are actually quite funny with Stephen Merchant giving an incredibly awkward and humorous best man's speech at the wedding of which anyone who has been part of a wedding can relate to and find amusing. You think to yourself that if the movie keeps this tone then you could be in for an hour and a half of laughs.<br><br>Instead, what you get is 92 more minutes of very average dialogue that is trying to pass itself off as humour. 95% of the jokes are to do with sex and that is becoming a problem with a lot of films these days like Movie 43 as a prime example. They just aren't clever enough and leave you feeling very disappointed because the scenario of the film can be made into a really funny story with all the things that can go wrong in a marriage. Only a handful of things are portrayed though i.e. leaving the toilet seat up or not taking the bin out when it's full. <br><br>As far as rom coms go, it fails miserably at the 'com' part. Stephen Merchant is the only character remotely funny with his typical way of delivering jokes but as for the rest of the cast, it's just appalling! A married couple, played by Minnie Driver and Jason Flemyng, seem to hate each other constantly for no apparent reason and their insults to one another just lack any comedic effect. A disappointing performance as well from Olivia Colman, the newlywed's marriage councillor, who is just a foul mouthed nut case herself with her own marriage problems but, again, the humour isn't there.<br><br>Far better rom coms have been made and far better rom coms will be written in the future. Sorry Dan but not the greatest start to a directorial career that I have seen. Maybe stick with Sacha Baron Cohen because even he is funnier than I Give It a Year!","user":"filmtrance","rank":[40,58]}]