[{"title":"Unexpected Fascination","rating":8,"date":"13 July 2015","review":"2012's Magic Mike wasn't exactly about the stripping. Sure, it features a lot of it, but the real center of the movie was the lifestyle of its main character, Mike. This latest installment showcases more of the crew and how they put up the show. It's more choreography driven than some commentary, which actually made it more appropriate to this material. It still has the stunning style of the first one, though it mostly feels quite forced, but if the movie tries to be itself, then there it actually shines. Magic Mike XXL indeed brings much of what you expect from it.<br><br>While the first movie basically shows the art of its aesthetics, this sequel rather shows the art of stripping. The story isn't quite remarkable; it's so simple that it's nothing more than an excuse to show more of these acts, which is both a good thing and otherwise. But really, that's what the target audience really came here for. Just like the first one, it's all atmosphere than following a plot. We just see these characters trying to get along, hint some commentary, and do some stripping. The difference however is the stripping is the real showcase, as in the direction and choreography improves within that aspect which makes these performances speak what this movie is truly about. People would immediately think that this would only appeal female viewers, but even as a straight man as I am, I would actually be impressed by the choreography displayed on those scenes.<br><br>The direction does try to keep Soderbergh's style going in this sequel, though only eschewing the intense sepia and welcoming other colors on the daylight. The new style is sometimes indefinite, specifically the vague lighting in some scenes, but then, the movie eventually breaks the pretense once the characters start dancing on screen, having more focus on their moves, and of course, bodies. Star, Channing Tatum, still has the charm as he always has. The other performers also get their characters expanded, staying natural whenever they bond and fight off on screen, treating them beyond than typical eye candy compared to the first one.<br><br>Many may call Magic Mike XXL a totally needless sequel or a cash grab for those who seek for more endless dose of shirtless men, but I believe this movie actually exists to make up for its own value. The story may not be as meaty as its predecessor's, but it shows everything what its audiences actually wanted for it. And it is done elegantly, proving that stripping apparently has more to offer than just lust for flesh. It sounds incredibly weird if you say it that way, but looking at these performances seems like this is an art that we didn't see coming. Again, there's nothing remarkable about the story, though if you're curious about the appeal of this career, then it gives a room for fascination.","user":"billygoat1071","rank":[41,59]},{"title":"Sequels have been good until now","rating":1,"date":"1 July 2015","review":"UGH...just saw MM XXL and I left the theater feeling grubby. Look, I'm no prude and I really liked the first Magic Mike and was hoping to see the same kind of guilty pleasure with some good moves. Forget it. These guys just used their nice bodies in a showy, uninteresting way and there was very little classy hot dancing.<br><br>It's such a rip off when actors just walk through a movie because it's going to make money. Wait for the DVD if you want to see this. It's corny, sleazy, very little dancing by the guys and a stupid, stupid story line. This movie had no class at all as the first Magic Mike had...that one was good! <br><br>Sheesh, I almost walked out about 25 min. into the movie, but then I thought I could not give a solid review if I did. What a waste of my time. I should have gone to Terminator.","user":"coastdaze","rank":[128,207]},{"title":"Where's the beef?","rating":1,"date":"17 July 2015","review":"Strange it is to pay seven to ten dollars to see a movie about male strippers--and none of them even remove their tee shirts until a so- called \"grand finale\" at the end. This is when our boys actually strip down to speedos and jock straps. Wow. Channing Tatum, the main star, was all over the media months before the premiere, assuring one and all that this sequel to the highly successful original, \"Magic Mike,\" definitely deserves a \"hard X\" since it'll show off a lot more of the guys than previously seen. As he winked and smirked, he also promised us he would keep the most handsome of the original strippers, Joe Manganiello, naked as much as possible. Tatum's promises never appeared. Instead, we have nearly two hours of non-stop verbal garbage as the guys ad-lib and we can't understand anything they say since they all swallow their words. In their van they're traveling to Myrtle Beach for a stripper convention and along they way, they have several encounters with women who are so unattractive they're only blurs. Then we come to big stripper event. We're tantalized by seeing other male strippers preparing for the show but we never see them. All we see is a hysterical carnival like routine featuring Tatum, Joe and Matt Bonner. They whirl around, move their hips against women and when they finish, we realize none of our hotties even showed their butts, let alone their joy sticks. Probably the most hideous sequence in the movie that drags on forever is when the guys stop at a plantation to see black strippers but it's all filmed so darkly you can't tell what's happening in the shadows. Poor Jada Pickett Smith. She should definitely grab the Raspberry Award for the Most Horrendous cameo in the movie. This is a movie that could safely play on the Disney Channel but even the kids would be bored out of their skulls.","user":"jery-tillotson-1","rank":[67,108]}]