[{"title":"Bleak and disturbing","rating":8,"date":"16 April 2014","review":"A timely title for Holy Week. Father James (Brendan Gleeson), a village priest in a coastal village in Ireland, is told in the confessional that one of his parishioners is going to kill him. The man was abused by a priest for five years as a child; that priest has died, but killing the innocent Father James will be revenge for the other priests's abuse of an innocent boy.<br><br>A challenging set-up for a movie, especially one which sells itself as a comedy - albeit a very dark comedy. With Father James we meet most of the locals, a sinful lot for such a small village. The butcher who beats his two-timing wife; the aggressive local publican; the cynical doctor; the alcoholic landowner; the police inspector with a taste for rent-boys; an ancient exiled American writer (M. Emmet Walsh). <br><br>Having been married (and widowed) before he answered the Call, Father James has an unhappy daughter (Kelly Reilly) down from the big city, her wrists bandaged from a suicide attempt. A week after the woeful NOAH, I half expected a Flood to overwhelm the village, full as it was of folk sliding into wickedness. The central mystery of which of them has threatened the priest is a bit of a cheat, since surely he would have recognised the voice in the confessional.<br><br>The dark mountains and pounding seas which sandwich the village are as atmospherically filmed as they were in David Lean's RYAN'S DAUGHTER, and a fine score boosts the film's seesaw moves between comedy and tragedy. The script is clumsy in parts, but the actors carry us over the bumps. Brendan Gleeson is on splendid form (I wish he'd played Noah last week!) and the rest of the cast turn in believable performances. There is no comedy in the bleak finale. This is a dark and disturbing low-budget movie which, like PHILOMENA, will linger in the mind long after multi-million-dollar blockbusters have faded into a CGI haze.","user":"davidgee","rank":[116,137]},{"title":"Calvary - Utterly Superb.","rating":9,"date":"17 May 2014","review":"Calvary<br><br>Honestly, for those of you who haven't seen this film, go and see it. It's absolutely fantastic! <br><br>Brendan Gleeson gives a stunning performance as a troubled priest who has to come to terms with something shocking that he has been told will happen. It paints a brutal, realistic and yet original picture of modern Ireland. All the characters in the film are exaggerated representations of the types of people you get in Ireland today IMO. The story is touching, emotional, real and unforgettable. <br><br>My favourite film of 2014 so far. If you liked In Bruges or The Guard or even Seven Psychopaths, see this film. It's darker than all three of those films and it's hard to watch at times but honestly, it's worth it. <br><br>A beautifully dark film, with lashings of black humour and some lovely one liners. Just make sure to laugh at the appropriate parts, some viewers in my cinema laughed at the opening line! (once/if you see it you'll understand) I hope audiences outside of the UK and Ireland can enjoy it. I implore you to see it. 9/10, a must see!","user":"georgetdavies","rank":[86,104]},{"title":"Priest faces his death better than others face life","rating":9,"date":"19 August 2014","review":"In confessional, a parishioner tells Father James he will kill him in a  fortnight because Father James is good man, an excellent priest,. His  murder would be a shock to the church that countenanced the man's  boyhood sexual abuse.  Despite knowing who his threat is, Father James spends the time  ministering to his parishioners  including his killer's domestic  issues, preserving the sacred privacy of the confessional. He gets a  gun but at the last minute throws it into the sea. He plans to escape  to Dublin but changes his mind as he boards the plane.   What prompts that change is seeing two airport employees idly chatting  as they lean over a coffin. Inside is a good man who was killed in a  car crash with drunken teenagers. Father James is strengthened by  seeing the casual way in which that victimized innocence is treated.  There is no respect there, no overall sense of holiness or decency,  just two yobs leaning over a box. That revives Father James's  conscience and he returns to face his fate.  The dead man's wife is the only character here who has no crisis of  faith. She knows her husband was a good man. Though in pain, she  accepts his  what we would think is Absurd  random death. She  appreciates the kindness the strangers have shown her. Serenely she is  flying him home. Father James's daughter, who looks like her  thin,  delicate, wan  grows through the film from her shaky recovery from a  suicide attempt to her own serenity, when she goes to the prison to  talk to her father's killer.   As Father James told his daughter, the most undervalued virtue is  forgiveness. After a broken romance caused her to despair, now her  father's sacrifice brings her a surprising peace. She forgives the  troubled killer and can then forgive herself the lesser failures she  has magnified. So when Father James goes back to confront his killer he  is performing his function. He learned that from the good man of abused  acceptance in the coffin.  In performing that role he  like Jesus  expiates the other's sin. He  saves his killer's soul by exorcising the abused boy's rage and  helplessness. For the killer to forgive his abuser, the church and  ultimately himself for the murder, though, the butcher needs the model  of the priest's daughter's forgiveness. That distinguishes this killer  from the one Father James visits in prison, a cannibal who feels  nothing.  In contrast, with the exception of the new widow, every character  suffers from the wealthy landowner's confessed \"disassociation.\" The  daughter is adrift, unmoored by the loss of her father to the  priesthood after she lost her mother to a lingering death. The campy  male prostitute constantly plays a gangster grotesque to avoid making  any human connection. He's most comfortable crisply shooting pool.   The landowner at one point takes down a treasured painting from his  wall and urinates on it. Abandoned by his family and even his servant   to whom he later admits he never felt attached anyway  his wealth is  meaningless. His 100,000 Euro check to the church means nothing to him,  neither as gesture nor as value.The painting is Holbein's The  Ambassadors, which famously shows two wealthy overdressed men, a  display of secular opulence, with in the foreground an anamorphic image  of a skull that can only be seen from the side. In this brilliant  composition, the askew view from the side undermines the impressive  secularity seen from the front. A Christ hangs obscured in a distant  corner. \"Calvary\" of course means \"the place of the skull\"  the place  where we confront our mortality, as Christ assumed his.  This painting is an emblem of the film  but with a twist. From the  frontal view our impression is of a troubled, pained, helpless secular  existence, where even a good priest is immediately suspect for chatting  with a little girl, where the Catholic church stands condemned for its  greed and its abandonment of its children, for its hypocrisy. But  viewed from a different angle, from Father James's perspective, there  survives the reminder of grace, of forgiveness, of connection.   One more point about that painting. It famously hangs in London's  National Gallery. In no way could this character own it. So what he's  so proud of having spent so much meaningless money to buy, what he  thinks he is so dramatically despoiling to demonstrate his power, is   a fake. He was had when he bought it and his every estimation of it is  wrong. The fake is as dissociated from its original promise as the  character is.  There are three priests here. The young colleague and the older bishop  look the same: thin, bloodless, lifeless, with no spark or energy to  suggest a calling. In contrast Father James has the physical bulk of a  Falstaff and erupts into that rogue's drunken violence on the eve of  his mortal test. Father James is a man of flesh and passion. Having had  a daughter before he became a priest, he knows the flesh. He knows  love, so he doesn't need a picture to remember his wife. He has been a  drinker. Behind his adoration of the beyond is a full fathoming of the  here. He can cry for his murdered dog the way he couldn't cry for his  church's young victims, for he too knew disassociation.","user":"maurice_yacowar","rank":[47,55]}]