[{"title":"Well above average found footage horror","rating":9,"date":"21 May 2015","review":"The Possession of Michael King is an entertaining, thrilling, and well thought out horror film. I was hesitant to watch at first, expecting another generic possession movie, but the premise is original and catches your interest off the bat. Instead of the typical wrong place wrong time possession this is a case of curiosity killing the cat. There are a few scattered jump scares but seeing Michael's descent is what sticks with you after the credits have rolled. Overall this was well shot and acted, my only real complaint is that they could have taken their time and dug more into the religious exploration scenes in the first act.","user":"dkeller522-242-31684","rank":[16,18]},{"title":"Nicely done possession flick","rating":7,"date":"6 September 2014","review":"I was highly skeptical (but also bored) and so I decided to give this film a try and I'm glad I did. After seeing the low score I was expecting something boring, with cheap scares and bad visual effects. But quite the contrary, the main character acting is believable, visual effects though scarce are well made and add to the scariness of some scenes, and it's overall a refreshing horror flick that makes good use (but doesn't abuse) of the \"found footage\" format that is so popular in horror movies these days. <br><br>The only thing that I found annoying it the LOUDNESS of some scary parts. I was watching this movie with headphones on and at a moderate volume and after the first official scare I was nearly deaf. I think they went a little bit overboard with the sound contrast, so be warned..<br><br>7.5/10","user":"hayduke05","rank":[29,37]},{"title":"Worthy freshman effort from David Jung","rating":7,"date":"20 August 2014","review":"After the death of his wife, non-believer Michael King sets out to prove that there is no such thing as the supernatural, God, or The Devil. He sets up cameras throughout his home and enlists his friend to film everything. <br><br>First, he tries to summon a demon on his own using a hokey kit he buys off the internet. <br><br>Eventually he goes to some real supposed demon summoners and engages in their bizarre rituals. He goes to a necromancer and tries to summon dead spirits using an equally crazy ritual. <br><br>Of course he becomes possessed, as we know through the title, and strange and really freaky things start to happen. This is all told in the now familiar found footage style. <br><br>This one has some original ideas and some really freaky scares. There are some of the prerequisite jump scares of course, and some scenes don't work as well as others, but freshman writer/director David Jung does a good job of keeping the viewer interested as the story progresses along nicely, and he doesn't wimp out with the ending. This is a nice refreshing possession movie, one of which I haven't seen in a while. I look forward to see what he comes up with next. 7.5/10.","user":"victoryismineblast","rank":[48,66]}]