[{"title":"Low budget re imagination of a famous story that fails at everything.","rating":2,"date":"4 June 2016","review":"With the tag-line \" The darker side of the mirror \" i had some hopes of this movie. With a really good original story about the break between childhood and growing up, i hoped that this was some kind of dark sequel like what we have with the wizard of Oz. Instead what we get is what i assume is the local cos-player/ civil war re-enactment/ steam-punk group trying their hardest to act without any kind of budget.<br><br>As Director,writer,producer and editor 95% of the blame fall on Zach Hamer - the rest goes to whomever decided to have loud license free music play the whole time during the movie!<br><br>A small tip to Zach here - when you introduce a character ( bad, good or mysterious ) ,let them do something that makes us care ( bad , good or mysterious ). This was 2 hours of characters we had absolutely no interest in. To see what i mean, watch the Tim Burton Alice movie again and watch what all new characters do within the first two minutes of screen time.<br><br>A small tip to anyone thinking about watching this movie: get the game Alice: Madness Returns on steam instead. Better story and characters you care about. ( also much darker mature story, so nothing for the weak of heart. )","user":"ropipgi-581-487166","rank":[13,14]},{"title":"The worst crap I have ever seen, with the most annoying music that won't stop","rating":1,"date":"28 May 2016","review":"This movie, if you want to call it one, is the worst remake of Alice in Wonderland. The dialogue is the worst ever, with the fact that music is constantly playing without stopping. Whoever even wrote this had no imagination, and whoever directed this just cannot direct. The story line was stupid, the props were home made, and the acting was so bad that the Kardashians act better just lying on their backs... This movie doesn't even deserve a star in any way shape or form, nor does it need to be out for public viewing. This movie kind of reminds of someone going through a bad trip and trying to watch fairy tales and having nightmares later on during the night.","user":"edwardajahnke","rank":[25,32]},{"title":"what the ...","rating":5,"date":"27 May 2016","review":"I can't believe people would honestly believe this to be a major film production, but, apparently, they do.<br><br>The Other Side Of The Mirror is a fan film, made with very little budget and semi-professional actors; it is, if you will, a college-level production. And for what it is, it's pretty solid. <br><br>The story follows the original Alice In Wonderland, replacing the fantasy characters with human counterparts - for example, the Smoking Caterpillar is now a stoner dude. There's some weird stuff going on, but it doesn't scare me. It's reasonably creative and far, far from horrible. I would actually suggest this film to anyone who is studying filmmaking. <br><br>A honest vote of 5/10. If you don't understand what you're watching, then you shouldn't be watching this.","user":"digdog-785-717538","rank":[21,31]}]