[{"title":"A realistic view of adult relationships","rating":8,"date":"1 August 2013","review":"As a warning to anyone wishing to see this movie: it is not a COMEDY nor was it designed to be. Jake Johnson usually plays comedic roles but do not expect any big laughs from him or the cast. This movie is essentially a new take on a classic relationship quagmire - 2 adults who are doomed to remain friends despite a strong sexual attraction towards each other.<br><br>The films strongest point is the portrayal of realism in regards to adult relationships. You won't find any cheesy romantic quips or witty comedic banter - just adults trying their best to deal with the problems of love and life. A large portion of the film may seem uneventful but for anyone who has been in this type of situation before, you will establish a greater connection to the lovelorned co-stars.<br><br>Olivia Wilde is surprisingly genuine and in-depth along with Johnson. Jason Sudeikis has a wasted cameo (probably decided to be in the film to keep tabs on his new wifey, Olivia). Other then that, no one else really stands out.<br><br>It is best to come into this film with the realization that it is not a comedy; that way you will have a greater appreciation of the adult themes laid out.","user":"jayjaydeng","rank":[113,140]},{"title":"A great movie about ordinary people.","rating":9,"date":"5 August 2013","review":"This is not your ordinary rom/com. This movie focuses on conversation and relationships. Long, realistic conversations with buddies, work colleagues and partners. It's so sad to see reviews complaining that this movie is too realistic and that nothing happens, when that's exactly what the movie wants.<br><br>I was expecting another generic romantic Hollywood drama/comedy like The Dilemma or the Change-Up, with an obvious plot to work around and some clichés thrown in. Instead it felt more like Blue Valentine meets Closer, but lighter than Blue Valentine and more realistic than Closer.<br><br>I liked the long camera shots that follow the characters around, focusing on them and their interactions. I liked that I didn't know what was going to happen in a scene because there's no obvious overall plot in the movie. There's just ordinary people having ordinary conversations.","user":"zalkins","rank":[102,135]},{"title":"Delightful, breezy slice of life","rating":8,"date":"27 July 2013","review":"I've been highly anticipating this in the hopes that it would be this year's Celeste &amp; Jesse Forever and it didn't disappoint at all: it's more light-hearted and less penetrative, but has the same keen eye for relationship dynamics, sly humor, realistic characters and fantastic soundtrack. It's the most true-to-life romantic comedy I've seen in years. The characters were so relatable, totally reminded me of people in my life, and Joe Swanberg doesn't need plot twists or external drama to push the story along because it unfolds so naturally through the character interactions and developments. <br><br>It doesn't dig very deep into its characters, but I felt that was accurate and appropriate: we don't know much about the characters because they don't let people get to know them. Daily interactions are shallow, jokey; the deep conversations and self-revelations only really happen at 4am by a bonfire after a few drinks. I think the film would have been much worse if it had a Katherine-Heigl-movie moment of all the characters spilling their feelings and wants and grievances to each other because that is not how life goes - at least not for these people. <br><br>Olivia Wilde is outstanding and while it's not the powerhouse role I've been waiting for her to take on, it does further establish her as an impressively natural and charismatic talent simply in need of the right roles. She's hilarious and buoyant and handles her dramatic moments - however fleeting or quiet - with expert skill. Jake Johnson was the perfect match for Wilde as they have incredible chemistry and their charming banter keeps the movie energized. Anna Kendrick basically plays herself, but she's very good, as is Ron Livingston with a curiously enigmatic performance. <br><br>It won't appeal to everyone, because as it is so realistic, not much happens. It's more focused on the almosts and the might-have-beens than the happeneds. But it's so delightful, funny, observant, and coyly ambiguous, I really hope people give it a chance. It's not going to revolutionize cinema or anything but it has an authenticity, spark and lively wit that the genre generally eschews in favor of saccharine clichés and melodramatic crying scenes.","user":"Emma_Stewart","rank":[115,155]}]