[{"title":"Most of the reviews here divorced from reality","rating":8,"date":"21 February 2016","review":"In the IMDb Guidelines for Top Reviewers, Rule 19 says that, when in doubt, be honest.<br><br>So I will.<br><br>I have no idea how most members do their ratings these days. But I do know that often the ratings make no sense. This is one example. This is a stellar western, borrowing the \"retired gunslinger\" theme from the 40s and 50s, the type of western that Glen Ford used to do best.<br><br>The script is solid, the acting ditto. I mean, Brian Cox and Demi Moore in supporting roles. Wow. The elder Sutherland as always gets a little trapped in his one-dimensional character but the part was written for a character actor not a lead. The younger Sutherland effortlessly spans the full spectrum of emotions and holds the attention of the viewer like glue. And Wincott makes for one of the most articulate western villains in the history of the genre.<br><br>The cinematography is stunning.<br><br>Again, looking at the low IMDb rating, you would think there are so many quality westerns being made these days that viewers are overpowered by choice. Nope, that's not true. Is it? If I were grading on a Bell curve, this would be a 9. As it stands it gets a solid 8. Recommended.","user":"A_Different_Drummer","rank":[118,136]},{"title":"Nicely done western from father and son Sutherland","rating":7,"date":"23 February 2016","review":"It's a slow drive that ends with a sudden violent car crash, like a good western should.<br><br>Kiefer Sutherland plays a soldier who waited far too long after the war to put down his guns, but something tragic hits him hard, and he tries to change his ways, with the help of his father, played by Sutherland's real life father, Donald Sutherland who plays a small town preacher who disapproved of the life his son once lead, and is threaten to get back into when a banker tries to buy out the town by any means necessary.<br><br>It's a very typical western story made timeless by it's focus on being character driven. I don't know if this is the first time Kiefer and Donald have done a movie together, but it must have help with the relationship between their characters.<br><br>But my favorite interaction was between Kiefer's John Henry and Michael Wincott's Dave Turner, who plays a rival gunslinger hired to influence town people off their land. The mutual respect these men showed for each other despite being on different sides of the coin was masterful, something I never seen done so well in a western. <br><br>Brian Cox was also in the movie playing the banker that hired Dave Turner. His role as James McCurdy is what tells us that this timeless Western was made in 2015, because he's all about taking people's homes who don't want to leave, and his level of cold heartiness is done brilliantly, reflected this day and era. <br><br>Though I'm sure she was trying to due some respectable acting in this film, Demi More is still some impressive eye candy. <br><br>The story is nothing out of the ordinary, but it's strengthen by a great set of actors doing their thing, lead by father and son team Sutherland. Good western.","user":"subxerogravity","rank":[30,35]},{"title":"Beautifully Made Western","rating":9,"date":"22 February 2016","review":"I grew up in the era when the western was king. I really love a great classic western and Forsaken brought me back using classic tropes that many seemed to see as clichés but I welcomed as old friends. The cinematography is gorgeous, the acting is stellar, especially the Sutherlands, Demi Moore and Michael Wincott. At it's heart this movie is a beautiful father and son story, more drama than action flick which is also something I appreciate. As one who has not particularly been drawn to the revisionist western of today, ( zombies? aliens? incredible disgusting violence and nastiness? ) Forsaken was a breath of fresh air.","user":"cms-271-482756","rank":[56,73]}]