[{"title":"Excellent worth while watching","rating":8,"date":"23 April 2015","review":"Very different than the norm, normally wouldn't do westerns, or made for video movies. This is probably worth a watch. It shows that a modern day perspective on bankers may not really be too short of what happened in the past but without the violence and the guns and that its easy enough to be shoved into an uncomfortable corner or a place you wouldn't want to be. there's survival in the winter wild outback, the journey, the cold and the hunger too there's also survival in the home, the family and a new born. foreclosure happens in many ways and for many reasons Even in the simplest of these situations lives and relationships are destroyed forever","user":"edunican","rank":[24,31]},{"title":"Not your Typical Western, but a very good one.","rating":6,"date":"20 December 2015","review":"There are a lot of movies coming out that give reflection on the financial crisis that we are going through right now, but nothing does it as uniquely as the Timber. Quentin Tarantino, once said you can always tell the state of American society by the western that comes out in that period, and the Timber is true to this statement. <br><br>Two brothers are threaten by foreclosure of their land and the lost their livelihood if they can't track down their father. The Timber acts as a testament on what you need to do in order to survive during hard times.<br><br>With Josh Peck playing an unlikely western star. It was his performance most of all the brings it home as he struggles through the wild west completely out of his element, in order to find a way to provide for his wife and young son.<br><br>The music seem out of place as well yet fit into the atmosphere and set the tone of the Timber <br><br>I'm sure things like this were common in the wild west, but what a perfect time for The Timber to come out. It's the most out of the ordinary western I've seen and that's what makes a brilliant one.","user":"subxerogravity","rank":[10,12]},{"title":"Worst movie in years","rating":1,"date":"21 April 2016","review":"I can't stress enough how awful this movie was. I watch on average about 5 movies a week and this one was the worst in years! A very confusing movie that likes to gloss over any kind of connecting bits that might explain itself. I found preparing my tax returns for 2015 to be far more entertaining that this POS movie. Did they actually pay the director and editor and producer? Sheesh! It's like worse than a student production in film school. If you like yawning and falling asleep while watching movies I've got better ones than this one. This one deserves to be thrown in the trash. Maybe the DVD might better be used as a Frisbee.","user":"perryway","rank":[8,10]}]