[{"title":"Just Don't","rating":4,"date":"16 February 2017","review":"OK, I have a theatre minor, and this is the first thing that struck me: college project. For that it gets at least an 8. For a movie - a 4 because there are so many worse. The whole thing could have been presented on a set. Overacted, weak scripted, a good \"effort\" for a grade in school. The story is pointless, just a character study by actors who hammer home their scripted characters hard enough to make sure the professor gets it. \"Didja see how nutty I am?\" Here, I'll do it again - bigger! Characters are introduced and just fade out without reason. It's basically a two person performance for the audience.<br><br>A jumble of loosely related characters spending some time in a huge mansion which, itself, had more character and could have been the subject of the movie. They all fade away without any real justification, leaving the two: an introverted, but smart kid who sees how crazy the other is, but he's attracted by the extroverted wild girl. Problem, I just don't believe his justification. I get more that he knows she's at least two screws loose, but can't walk (or run) away. There's no emotion behind his attraction. So many better out there.","user":"jayg_58","rank":[4,5]},{"title":"Sinister throughout","rating":9,"date":"11 March 2016","review":"The cinematography in Backgammon is beautifully done, contrasting quaint yet eerie exterior shots with intimate looks into the characters Miranda and Lucien. <br><br>The personalities of these characters perfectly balance one another as the plot delves into unsettling and unpredictable territory. Brittany Allen is wonderful as Miranda - cute, yet crazy, while Noah Silver plays a grounded, unpretentious ivy-league chap.<br><br>The music, when present, creates a mood that is introspective and peaceful, but when absent we're provided with raw dialogue that really makes the conflicts of personalities come to front.","user":"dvella-26565","rank":[8,18]},{"title":"Technically very good but ...","rating":5,"date":"13 February 2017","review":"A group of friends are staying in a beautiful house, near the ocean in Maine. There is a fight between the house owner and her boyfriend and left; the other couple's girl starts feeling jealous and also left. Sudden the female owner and the other couples male are alone in the house.<br><br>An erotic game of seduction starts; the surroundings, the music and cinematography are outstanding but what is happening and why ?.<br><br>As interesting as things become; when the game reaches boiling point the director shy away and resolves the mystery in a couple of scenes. <br><br>Sadly the movie is predictable to the whatever is happening comes at no surprise.<br><br>It is really a pity because the two leads are very good as is the whole technical aspects; but for some reason the makers of the movie were afraid to dare a little more.","user":"abisio","rank":[2,3]}]