[{"title":"OK, That's My Fault","rating":2,"date":"12 September 2014","review":"During the American Civil War, Abraham Lincoln (Bill Oberst Jr.) realizes that there are zombies in the Confederate army and he organizes a small group of agents from the Secret Service to take over a fort in Savannah from the enemy to fight against the undead. He has to face not only the walking dead, but also Confederate soldiers, a traitor and his former love Mary Owens (Baby Norman). <br><br>I saw the IMDb rating of \"Abraham Lincoln vs. Zombies\" and decided to watch this flick; therefore that is my fault. I was expecting to see a funny trash, but I found an awfully boring movie with no story, dreadful acting and cheap CGI. The lead actor is terrible and it might be sad and offensive for the American viewers to see the use the name of American personalities in such lame movie. My vote is two.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[12,14]},{"title":"Abraham Lincoln would be Turning in his grave, as a Zombie","rating":1,"date":"17 June 2012","review":"What The Hell Did I Just Watch!?!?!?!?!?! THIS WAS CRAP!!!!!!!!! DO NOT WATCH THIS!!!!!<br><br>I don't know why I watched this, I thought it would be funny. I was wrong. The story is of Abraham Lincoln fighting off Zombies. Some of the Worst CGI possible. I could make a more realistic looking Zombie in Paint. Asylum (See what I did there) WHY DO YOU MAKE ME AND OTHERS SUFFER? Plants vs Zombies has a more realistic Story. AND IT DOESN'T HAVE A STORY! I wish I could rate this film less than a 1 but I can't. Again. Don't watch this. You could be spending your time doing something more interesting, like listening to your Grandfather talk about the war or washing your car. Zombies must have eaten the brains of the Script Writers because they obviously have no Brains. Again. DO NOT WATCH!!!!!","user":"Bullwinkle96","rank":[48,68]},{"title":"Other than that, Mrs. Lincoln, how did you enjoy the play?","rating":1,"date":"5 June 2012","review":"The Asylum has it's little niche. Doing bad ripoffs of big Hollywood films on the hope stupid people will buy them from Netflix, Blockbuster or Redbox not knowing what they are. The term is \"Mockbuster\",and the Asylum is the master of it.<br><br>Because someone decided to create a movie called \"Abraham Lincoln-Vampire Hunter\", the folks at Asylum decided that the Great Emancipator didn't have enough people disgracing his memory.<br><br>Lincoln leads a team of Secret Service Agents to fight a Zombie outbreak in Savannah Georgia, which also includes running into Pat Garret, Teddy Roosevelt as a child, Stonewall Jackson and John Wilkes Booth. Other than the name dropping, the bad Civil War Re-enactments and other contempt for the audience's intellect, this is a typical cheap zombie movie.<br><br>I should point out the makeup work is truly awful. You couldn't tell the protagonists from the Zombies without a scorecard and some of the fake beards were laughable (Especially the aforementioned Stonewall Jackson.) <br><br>It's been 40+ years since \"Night of the Living Dead\", come up with some new ideas, cheap film makers.<br><br>Sometimes Asylum films can be little gems of people trying, and sometimes they can be inadvertently funny. This film was neither.","user":"JoeB131","rank":[23,31]}]