[{"title":"Not without faults","rating":7,"date":"22 February 2015","review":"But still very intriguing and very weird, which I found to be good. It's not really new and you will be able to guess a couple of things coming along the way, but the way it is told and shot respectively (very dark) may be exactly right up your ally. Or you might hate it for that, but you'll be able to know very early on if you like it or not, the mood is set very early on.<br><br>It's a slow burner, but there will be blood and action if you are patient enough to wait for those \"sparks\"/moments to happen. It's not the flashiest of movies or the fanciest in the horror/suspense category, but it does many things right. Are you up for that?","user":"kosmasp","rank":[35,48]},{"title":"An original approach but lousy acting ...","rating":4,"date":"10 July 2015","review":"\"The Stranger\" is a typical example of a film with an original approach to an already widely used subject, that initially creates a momentary excitement, which then however is nipped in the bud by a pace that claims some patience, dark settings (although in this case that's quite obviously) and mostly lousy renditions by some members of the cast. In the beginning I had the impression that this story took place somewhere in South America. Afterwards I was quite surprised when it turned out it was situated somewhere in Canada. The Chilean director Guillermo Amoedo sought most of his cast among the Chilean population. Hence the confusion. Besides, the sounding title \"Eli Roth presents The Stranger\" isn't a reason to get excited immediately. Just as in \"Clown\" his name is prominently mentioned on the cover. But this isn't an insurance for a high quality end result.<br><br>The main character Martin (Cristobal Tapia Montt) appears one evening at the door of a shabby house that's inhabited by Peter (Nicolas Duran) and his mother Monica (Alessandra Guerzoni), asking if they know where his ex-girlfriend is. The simple answer he gets, leads him to the local cemetery where he's looking sadly down at the grave of Ana (Lorenza Izzo). Moments later the local hooligan Caleb (Ariel Levy) and his mindless friends bump into him. Martin doesn't even bother to defend himself while these loafers brutally molest him. It looks like he's sick of life and he's actually left behind for dead. Caleb's father, Police Inspector De Luca (Luis Gnecco), tries to cover up the crime and hides the corpse. Peter, who witnessed the whole thing, takes Martin home to take care of him. Apparently it's not so obvious to kill this stranger and afterwards it seems that his blood, as he declared furiously, is contagious.<br><br>The only feeling I had after watching \"The Stranger\" was an unsatisfied one. The subject was inventive and had potential to make something interesting out of it, but that wasn't realized. The film is painfully slow and in terms of action it's not that impressive. The obvious theme of vampirism shines through the film even though it's not explicitly named. But the fact that Martin is in need of consuming blood and can't stand sunlight clearly points in that direction. His only goal is to get rid of similar people, including himself. Therefore there's this ever-present morbid, depressed and violent atmosphere around him. And then there is the phenomenon of healing blood which really distances this film from all the other movies with blood-sucking creatures of the night. But attempts to differentiate itself from the older movies where Dracula and associates flutter, are nullified because the most common clichés of this genre are still valid. For example, a sun cream with factor 100 is indispensable for Martin.<br><br>Cristobal Tapia Montt really was wonderful in his role. The constant inner struggle. The destructive attitude on the one hand and the role as martyr which he appropriates himself. At times I even thought he looked a little bit like Jake Gyllenhaal. Nicolas Duran's contribution was also acceptable on some level. Although I'm still impressed how quickly he managed to overcome his drug addiction. Furthermore, the rest was filled with the familiar, clichéd characters. But also there were some abominable interpretations. At times it seemed as if the dialogs were read directly from the script. Among other Alessandra Guerzoni made use of overacting in general. And Luis Gnecco appeared not to master the English language and it looked as if he was dubbed sometimes. Even Ariel Levy's performance wasn't that impressive from time to time. Although his appearance at the end was fairly successful.<br><br>\"The Stranger\" isn't exactly a masterpiece and has some flaws. Yet Amoedo succeeded in creating an eerie atmosphere with some horror moments and downright brutal, bloody fragments. This film brings nothing new in the familiar horror genre, but it's still worth the effort to give it a try. And although the ever-present darkness isn't exactly an advantage, ultimately this creates a dark and grim atmosphere.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[10,13]},{"title":"It took me a while to figure out why this movie was annoying me...","rating":5,"date":"22 June 2015","review":"The movie looks great and the actors seem OK... but as I watched something kept bugging me. Repeatedly taking me out of the story and making me wonder 'what's wrong here?'. It took me a while but it started to dawn on me that none of the voices seem right. Overly precise and just don't go with the faces, if that makes sense. I'm pretty sure now that this was done with the actors speaking English, maybe phonetically, but probably with strong accents... and then later dubbed over with native English speakers. It creates a subtle but jarring effect that really got in the way of my enjoying what otherwise is a pretty good little horror tale. A bad decision, IMO... though a lot of the blame goes to audiences who refuse to watch subtitles.<br><br>OK, other than that major complaint... it's not bad. Never scary... not too surprising.... but competent.","user":"venusboys3","rank":[25,40]}]