[{"title":"Not sure what this was","rating":2,"date":"11 October 2014","review":"I'm giving it a two, because I liked some of the music and the screenshots. I think this was supposed to be a dramatic tale of a girl and her lost sister. She felt bad for leaving her and wants to communicate to her ghost. There's something about vipers. Her sister was killed by vipers. She has a tattoo of a viper on her arm nad she cuts herself with razorblades. The movie just kind of stands still. It never really amounts to anything. It's not abstract either really. It kind of tries to be abstract, it almost manages to be viewable. It just falls short in terms of an overall fluidity. Maybe it's because it's Italian...But it's better than a one out of ten any way. It's definitely not a horror movie. More of a bizarre disjointed emo-teen girl adventure.","user":"LiamBlackburn","rank":[6,10]},{"title":"Why the confusion?","rating":6,"date":"19 April 2016","review":"Some here seem to be confused about the story. It is fairly simple, if not spoon fed to us. There is a website that is run by a figure called The Master who invites whomever is willing to do the most evil thing they can imagine, video tape it, and upload it to his site called \"Evil Things\". Whomever gets the most thumbs up becomes a contestant in his ultimate contest. Four winners are chosen and that is when the story essentially begins. The background is told in somewhat consuming flashbacks so perhaps that is the confusing part to some.<br><br>The film is well shot, well acted (especially the lead Ariel), and indeed keeps us guessing just what exactly the motivation is besides banal internet fame and some fortune. Not even the four contestants know what \"the prize\" is for whomever wins this ultimate contest. There is obviously a sinister aspect but it's true nature is not revealed until the end.<br><br>I do not recommend this for people who like easy to follow horror stories about slashers in masks or haunted houses. There is a heavy undercurrent of mental illness, a past that cannot be escaped, and the question of just what would a person do to be a part of such a game. <br><br>Also the at home viewers are depicted to give us a window to ourselves as internet voyeurs and how, from a distance, we can cheer on the most gruesome of actions assured that they are \"not real\" and just \"a game\".<br><br>Not an easy film to sit through but a worthwhile one if you can lend yourself to the film makers choppy\\edgy style.","user":"songod-95003","rank":[1,3]}]