[{"title":"Grave Disappointment","rating":3,"date":"2 October 2012","review":"I thoroughly enjoyed the first Grave Encounters. I think it's one of the best of the found footage movies I've ever seen. Granted, none of the actors were in danger of an Oscar nomination, but the characters were believable and got you involved in the story, the clichés were kept to a minimum, and most importantly, the atmosphere and the scares worked, and they held up to repeated viewings. Grave Encounters 2 should be renamed Grave Disappointment, imho. I spent the first twenty minutes having to double-check to make sure I had the right movie, and once the story actually got started, it seemed to me the movie couldn't make up its mind as to what it was trying to be. Parts of it felt like a spoof of the original, and parts felt like a shot-for-shot remake. There were blatant rip-offs of REC and Evil Dead 2, among others. The lead couldn't seem to make up his mind whether he was channeling Lance Preston's character from the first movie, or the kid from Terminator 2. The other characters were wooden or clichés, with a scream queen who made you want to scream every time she was in a scene. The one original element to the story line was another rip-off, this time of 1408. And the ending was absolutely pathetic, and unfortunately, strongly hinted at yet another travesty of a sequel.","user":"Bill_the_Pirate","rank":[77,91]},{"title":"Disappointing sequel doesn't even try.","rating":4,"date":"7 November 2012","review":"Grave Encounters wasn't all that original a found footage horror but, The Vicious Brothers did have some clever fun with the conventions and made an entertaining and spooky tale of a crew of a paranormal investigation show coming up against something they can't handle at an abandoned insane asylum. Sadly, all that cleverness and tongue in cheek creepy fun is gone for this uninspired sequel. Encounters 2 takes The Blair Witch 2 route and makes it a film about the film. Sadly the film also makes some of that sequels same mistakes. This time we have movie fan and amateur filmmaker, Alex Wright getting cryptic e-mails from a mysterious benefactor known only as Death Awaits. These messages hint that Grave Encounters was not just a movie, in fact it was quite real and the actors are all really missing. So, Alex grabs his camera and friends/crew and sets off to investigate. Bad idea. First problem is that this flick keeps the found footage motif yet, never at any time does it give us the vibe that it is actual footage and not just a movie. The film then tediously takes over 40 minutes to finally get our characters into the asylum, after a very \"Catfish\" first act, and once we're there, we are treated to a retread of Grave Encounters part 1 that also blatantly lifts scenes directly from previous found footage flicks like Blair Witch and Paranormal Activity. At least the previous flick did so with some cleverness. Maybe it's because The Vicious Brothers hand the directing reigns to John Poliquin who gives us a film that is populated with pretentious and annoying characters and comes across as very set up and phony instead of spooky and scary. But, he directs from their script so they share blame for what is obviously a sequel thrown together to take quick advantage of the minor attention the first film received. And it shows. Not only is the film lifeless and scare-less but, completely devoid of the cleverness and sly humor that garnered the first flick it's reputation. But, worst still, the final act descends into complete silliness when it introduces a character from the first flick into the mix and just falls apart. Add to that the flick is overlong at an hour and forty minutes and takes itself way too seriously. The Vicious Brothers knew they were having fun and let the audience in on it. Director Poliquin is trying to make a straight horror when the convoluted script desperately wants to wink at it's audience like the first film did. The recent Paranormal Activity 4 was accused by many as a lazy cash grab but, that film was at least still entertaining and gave us likable characters and had a nice sense of humor to give it some fun. Grave Encounters 2 doesn't even try. Disappointing follow-up especially considering The Vicious Brothers showed such potential in their first feature.","user":"jaguiar313","rank":[34,42]},{"title":"Okay I guess?","rating":5,"date":"1 October 2012","review":"I think the fact it's a sequel really hurt the movie, but then again the movie wouldn't exist without the first one. First off you must know going into this I knew what to expect, a \"found footage\" horror film sequel. Though I enjoy both types of movie those two combined just doesn't sound too great (except REC1 and REC2.. REC3 was an abomination). I got what I expected and was alright with it.<br><br>The Bad: Normally movies in this category if not always have acting rated a C (normal) which is fine. I'll give the acting here a C-, it wasn't on par but not bad enough to make the movie experience dreadful The plot really struggled to connect with the first movie, and the movie's own plot was good but poorly executed. The characters were not likable and showed no growth but I think I could say that for every 'found footage' film. Some of the scares were the same from the first movie which took away from the surprise factor. I could foresee a lot of what was going to happen just based of the first movie but I guess when you're basically recreating the same film that happens. The characters make stupid choices which always bothers me though<br><br>The Good: It wasn't terrible? Some of the scares were creepy nothing to dramatic. In the end I got what I expected, an alright found footage film and a probably 'worse than the first' sequel.<br><br>Conclusion: If you're bored yeah I'd suggest it.<br><br>Who should watch it: Grave Encounters Fan? Sure. Found footage fans? Sure. Horror fans? Maybe. None of the above? No.","user":"Douglobacki","rank":[36,47]}]