[{"title":"Omg ...No!","rating":13,"date":"13 November 2015","review":"This was the worst fan made piece of crap I've ever seen. The first 10 minutes of the movie is the same scene and line repeated over and over. There is no set up to explain what the story line is about (because there is no story.) I eventually got to the point where I just started skipping through the rest of the movie. Only to find that it just gets worse and that the same dialogue from the beginning of was still on repeat... I mean repeated.<br><br>This is just a bunch of people, who never seemed to grow out of their D &amp; D/goth stage. Dressed up in scantly, in leather and robes, trying to put on a show. I've seen better performances at a renaissance fair.","user":"JupitersFire1214","rank":[12,12]},{"title":"Thats what happens if you listen to metal, kids!","rating":2,"date":"16 May 2015","review":"Just kidding, metal is also my genre, which is an important factor in rating this movie. what this movie had: +their favorite metal tracks +half naked dudes with long hair (If you've ever seen fans of a metal concert, thats it) +outfits with tons of leather straps, studded bras and tattoos what it did not have -suspense curve -responsible use of visual filters (I believe they did this to hide they actually recorded with a smartphone, because it would've made no difference) -budget effects, they shouldn't have used to begin with -no trained actors. You'll notice, because they don't get you involved with the story at all, they don't portray a believable character, instead, the only thing they radiate is \"goddamn I'm so metal right now, this movie is gonna be so cool\"<br><br>tl;dr: \"Woah WACKEN was awesome, I'm hella drunk right now. You know what? I think we're total badasses, let's share our favorite metal tracks and wave our swords we bought on a medieval market by making a movie we record with my iPhone\"","user":"fmaczek","rank":[11,13]},{"title":"Appalling","rating":1,"date":"3 June 2019","review":"I love B grade action films and I can over look bad acting, cheap VFX, mundane score and enjoy a B grade film for what it is, low budget.<br><br>But after sitting through this whole movie, I unfortunately cannot find one redeeming feature about this film.<br><br>It is completely bad on every level.","user":"CrazySeff","rank":[2,2]}]