[{"title":"Beautiful and intense. Turn the lights off and sound up","rating":8,"date":"29 December 2014","review":"I watched this in the dark with high volume. Which I would advise everybody else to do so also, as this movie is all about it's sounds, feel and atmosphere. <br><br>I wasn't expecting much from this movie as I had not heard of it, however I was pleasantly surprised. <br><br>The movie is set with one main character who is crash landed in a foreign destination in the midst of the second world war.<br><br>The movie is eerie, the scenery is beautiful and the character is very well played. The constant build up of suspension leaves you driven to wondering what will happen next, and although nothing much appears to happen by way of extremities, there is a great awareness of the solitude and danger which could always be nearby... <br><br>Admittedly this is not the type of block buster war movie you would put against such movies of recent showing extreme heroism and patriotism, it is not the same, and for these reasons above, I think 8/10 is warranted.. Enjoy","user":"paul-psr-ryder","rank":[15,20]},{"title":"A very good movie that makes a very strong statement","rating":8,"date":"29 December 2014","review":"Before I watch a movie I look at the plot summary and read a few reviews. There are a some very negative reviews of this movie here on IMDb and I am left wondering why these people watched the movie? A few seemed to think there should be more fighting and sophisticated effects. Some seemed to think there should have been a stronger story line. This is not that kind of movie folks. This is the kind of movie that requires the viewer to engage and think about the human condition. If you want banging and smashing action or a fairy tale story don't bother watching this movie. If your attention span is just long enough to manage handfuls of popcorn don't watch this movie. If you want to be engaged in a thought process then you are in for a treat. I was reminded very much of the classic war movie \"Hell in the Pacific\" as I watched. Here the two characters are comrades rather than adversaries but there are similarities in the lack of a common language and the reliance on strong visual images. I don't want to give away the plot or ending but without spoiling anything I can say the penultimate scene makes a very strong statement about how we remember the victims of a war. In summary people should watch movies according to their tastes. If you want big budget Hollywood action and a story don't bother with this movie, and moreover don't half watch it without concentrating and write a lambasting review. If you want something more existential and thought provoking, I recommend this movie to you.","user":"wells-barry","rank":[19,27]},{"title":"amazing with few, little money and no dialog","rating":8,"date":"24 December 2014","review":"Its amazing what can be achieved with a small crew and low budget. But with a vision of telling a compelling story and a good camera. This film has very little dialog or musical accompaniment. The audio track is astounding, as we're dropped into a rain-forest that's been overrun by the Japanese during WWII. We get the sounds of war and the jungle. I was riveted. I love the close encounters with the life of the place. Feel the bugs crawling on my skin. A unique piece of cinematic art deserving of positive critical review. I've seen lots of WWII movies over the years, but nothing like this. Another plus: none of the blood or violence or men with guns that is usual with the genre. More awards please!","user":"rkerver-1","rank":[15,22]}]