[{"title":"Appalling acting, direction and story-line","rating":1,"date":"26 September 2016","review":"Viewed at a free screening and I felt ripped off.Infantile teen comedy knock off of Snatch &amp; Lock Stock And Two Smoking Barrels. Written as a vehicle for forgotten about and wannabe \"celebrities\" with little to no acting experience and it shows.The badly cast caricature gangster theme is ridiculous to the nth degree,the villains attempting to be menacing but never quite managing to carry it off. I found some amusement from the gypsy gang but no doubt the stereotypical portrayal will be viewed as racist rather than funny by the traveling community. Professional fantasist Dave Courtney's performance as Terry is strangely unconvincing, I say strangely as he has been pretending to be a gangster for 25 years and still cant pull it off. If this truly had a budget of £1.8 million a cannot see where it was spent and feel for the investors. I cannot work out the target audience. primary school humour with a level of violence and offensive dialogue which precludes primary school kids from watching. I also feel compelled to warn others not to waste their time on this.","user":"arranmiles","rank":[17,22]},{"title":"God Awful. Tragic. Amateur.","rating":1,"date":"1 October 2016","review":"This film must have been created on a whim where the main protagonist 'Amar Adatia' had a school boys vision he'd make a movie one day. And this is what he made the minute he got a chance.<br><br>The movie (if i can even call it that) looks like something they quickly rustled up on the back of toilet paper.<br><br>All of it seems to be various comedy skits stitched together to try and make a movie. Rehashing of scenes they saw in other comedy movies they thought to replicate and just shove in this sad excuse of a plot. Not one part of it is funny. All of it cliché.<br><br>Seems like the entire cast (of which there are some familiar B/C- list UK faces) came on board as a favour to Adatia. Either that or he bribed them. Which may account for the alleged £1.8 million budget this movie professes to have spent. Where else did the money go? certainly wasn't on production value.<br><br>The movie looks like something that was filmed on an iPhone. In fact it seems like it was an experiment that was done on that a basis.<br><br>I cannot believe anybody involved in this film would think it anymore than a laugh at creating an amateur video for YouTube. Something for them to just privately snigger at. One that they done on a whim one week when feeling bored and nobody took seriously.<br><br>I think the crew who made this need to start at the basics of film making. Start off making 5 minute music videos. Progress onto making made-for-TV or internet programmes. And then perhaps progress onto short films and then full features.<br><br>Clearly the crew here hasn't learned their craft. I suppose they see this as a stepping stone to bigger better movies in future. But there was no redeeming talent here for anyone to think these are directors / actors we should look out for in the future.<br><br>This movie is an absolute dead entity. Should be looked at as nothing more than an experiment to see if they could make a coherent movie. They can at least now say: They cant!","user":"blayzer_trayl","rank":[18,24]},{"title":"Directionless humourless pointless","rating":1,"date":"2 October 2016","review":"I have watched some rubbish in my time but this tops the list . Am I missing something? or is there real villainy afoot? Today the IMDb star rating for this garbage is 8.3, putting it on par with Reservoir Dogs and Snatch, It is not! This is so bad i feel i must review it to protect future viewers from being tricked into watching such a \"film\".It is a crime caper in the sense that it should be declared a crime against the British film industry. Low budget dross with poor production values and a script delivered as though it is being read from auto-cue by people that struggle to read, This \"comedy\" is childish and devoid of humor, the biggest joke being that this film ever secured any investment. The acting is shockingly bad, but i guess that was always it's destiny being that the cast is made up of z list \"celebrities\" and friends without real acting backgrounds. Richard Blackwood plays Olu and attempts to supply laughs by spending the whole film screaming \"give me my money\" in inconsistent accents, stick to stand up. Dave Courtney provides the usual hammy overacted menace expected from this self fabricated wannabe gangland figure, leaving you pondering as to why the main characters ,stoners, Lee and Krish even care that these guys think they are threatening them( i didn't care what would happen). Jodie marsh's input is to flex her dysmorphic body. Big Narstie (Terry's minder, topless throughout!)this role is just to look fat and ridiculous, the wrestler Tiny iron can only be there to ensure his fans buy the DVD and vote on IMDb (as is the case for most of the cast). As you would expect the fit girls are involved as eye candy for teens, and to facilitate sexist gags.The plot borrows heavily from better films, despite the plagiarism is directionless, laugh- less, pointless, busy yet bitty, sexist, offensive and at times racist, and you cant help wondering if what was left on the cutting room floor, through even worse acting, would have made the plot make sense. Save your money this is one to avoid!","user":"arranmiles-82839","rank":[11,15]}]