[{"title":"As informative as it is entertaining: great stuff (and neither sweet nor sticky)","rating":9,"date":"26 December 2013","review":"This film has a very rare 100% rating on 'Rotten Tomatoes' (just for comparison, 'Gravity' has 97%), which is one of the reasons I wanted to check it out. Another reason would be that it was recommended to me by people who are normally more into films like 'Die Hard' or 'Starship Troopers'. Now, having seen the movie, I can clearly see why that is.<br><br>This beautiful documentary has a lot more to offer than just information (as interesting, disturbing and educating said information definitely is); what you get here is also great, cinematic entertainment. There are characters in this film - the old beekeeper, for instance - which made me laugh out loud, and then there are moments of such breathtaking beauty I nearly cried. <br><br>And the cinematography - wow; just: wow! I don't know how they got to film the bees so close; if it was done with CGI or other computer tricks, the effects would certainly be Oscar-worthy. As far as I'm concerned, this masterpiece can compete with anything in the 'blockbuster' category that Hollywood has put out recently.<br><br>Great, informative entertainment and a visual feast, this film will make you see bees with different eyes. My vote: 10 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[44,47]},{"title":"an education with an emotional impact","rating":10,"date":"9 November 2013","review":"This film portrays another example of the cost of factory farms. The facts are presented without judgment. It seemed to me that the bees are defending themselves against the manipulation of their perfectly organized society. One wonders why we humans think we know better when our own societies are totally out of sync with each other and the earth. Now I understand why vegans do not eat honey. I did not realize how much work the bees have to do in order to make their perfect food. The photography is wonderful and the story is gripping so I recommend it highly. I think everyone should see this documentary so we might have more respect for the way we harvest honey. I admit that I am old and grumpy but this film really made me feel sad. I am glad I saw it and am grateful for the enlightenment.","user":"hopebrown333","rank":[21,33]},{"title":"Awesome, beautiful, and slightly disturbing","rating":8,"date":"20 April 2013","review":"This movie is like honey to your visual senses. With picturesque Switzerland in the background, it is shown how bees were kept in the past. And how nowadays massive commercial beekeeping takes place in North America. Like a traveling circus, the bees are shipped from one place to the next to pollinate flowers of various fruits and nuts with total disrespect. You can't help pity the poor creatures, as their owners can only think of money, and have no love.<br><br>This movie is a cinematographic masterpiece that tells you about the crises the bees are currently in. Colonies collapse without a clear reason. Like with the bio-industry, it makes you think that this is not the way to treat other animals, even if they are insects. Colony collapse? I think it's just the bees way of going on strike.","user":"andre.koster","rank":[36,66]}]