[{"title":"More of a comedy than anything else, in spite of the blood&gore. Two brothers run a dubious fertilizer factory requiring some secret ingredients","rating":8,"date":"7 April 2013","review":"I saw this film at the Brussels fantastic film festival 2013 (BIFFF). It was announced as a Horror movie, but you are mistaken if you want something sinister. Everything happens in broad daylight. On the other hand, there was sufficient blood&amp;gore to let it fall under the Horror category. Still, I found it more of a Comedy rather than anything else.<br><br>The plot elements were cleverly employed, like the use of human bodies (from travel accidents, at first) to \"improve\" the fertilizer that the two brothers produce. They have a lot of success with it, and demand is rising. Due to the latter, any human body that is found along the road that does not move, is carried away without proper medical review. That is where the story starts, soon involving three hitch hikers who pose an imminent danger to their secret operations. They thus become potential ingredients for their fertilizer production process. Though the cutting up of bodies is only shown once and not very directly, you can expect an abundance of blood sprayed around, tainting most of the bystanders who have every reason to assume they are next in line. Those movie lovers fainting on the sight of blood, are better off when they avoid this one.<br><br>The real secret ingredient of this film, however, is the humor that is incorporated all over the story, and works very well in hiding there is no real story to tell. Things happen in a logical sequence, though, but different from what we expected upfront. That is precisely the most important feature of this film. It is a Comedy rather than a Horror movie, is my conclusion, with the blood&amp;gore only as binding element.<br><br>All in all, I found this Horror very enjoyable. I usually try to steer clear of blood&amp;gore movies, but this time it is not the central theme that binds the scenes, unlike some other movies with no recognizable story line other than providing for reasons to miserably end other people's lives. In other words, the blood&amp;gore is more entourage here than anything else. The relationship between the two fertilizer making brothers is much more important, as is the hasty and uncoordinated way they try to cover their tracks when the darker side of their business might be exposed. Along the line we witness various ways in which the younger brother tries to show initiative, in an attempt to outsmart his brother who obviously has the lead in everything. And the people who are so unlucky to get involved in their \"factory\", mostly fail to survive the encounter with all limbs intact, or even to escape alive for that matter. Hilarious scenes throughout, in spite of the darker aspects of the plot.","user":"JvH48","rank":[37,45]},{"title":"There will be blood & laughs, \"That's a Morgan brothers guarantee\" ◆≈≈7.4/10≈≈◆","rating":7,"date":"30 June 2013","review":"Co-writer/directors Cameron and Colin Cairnes, in their feature film debut, successfully deliver all the essential elements needed to both make you laugh &amp; squirm in their new black comedy \"100 Bloody Acres\". A story of two unscrupulous brothers, Reg(Damon Herriman) and Lindsay Morgan(Angus Sampson) and their quest to be the unrivaled top dogs of the local fertilizer industry, a status that they will stop at nothing to achieve. After a tragic accident claims six lives in town, the two swipe the bodies from the scene and after adding them to their special \"mix\", they become the champions of the fertilizer biz. <br><br>Our story starts out with Reg, while out driving one day he encounters a trio of kids, Sophie(Anna McGahan),James(Oliver Ackland) and Wesley(Jamie Kristian) who happen to have the bad luck of having car trouble and are looking for a ride into town to attend a local music festival. At first Reg resists, but after some thought &amp; a little nagging, he reluctantly welcomes James &amp; Wes into the back of his cube truck &amp; Sophie up front to ride with him. Any good intentions soon vanish as the guys discover the body of a man Reg previously collected from an accident scene. Thus the film descends into a quite comical &amp; altogether gory fight as the trio does their best to remain \"unprocessed\" at the brother's fertilizer factory.<br><br>While the plot consisted of conventional &amp; somewhat clichéd ideas it used those elements to their maximum potential. With fine acting from the entire cast, skillful gore effects and proper production values, the film managed some serious laugh out loud moments while also delivering a few bona fide quirky uncomfortable scenes of horror, all of which were delivered in fun, as it stayed mainly on the black comedy track. If you don't mind gore and have the urge for a hilarious Aussie dark comedy, I absolutely recommend it.<br><br>--^--7.4/10--^--","user":"Thrill_KillZ","rank":[19,24]},{"title":"Classic Aussie Backwoods Flick Part 2","rating":10,"date":"31 January 2014","review":"Cameron and Colin Cairnes wrote and directed a gem in 100 Bloody Acres.<br><br>Starring Angus Sampson has also been another classic flicks, Insidious 2010, Insidious: Chapter 2 2013, Insidious: Chapter 3, Mad Max: Fury Road 2016 and a series of the classic television series, Underbelly 2008-2013.<br><br>Also starring Damon Herriman who has also been in other classic flicks, House of Wax 2005, Son of a Gun 2014 and Praise 1998.<br><br>Also starring Anna McGahan who was also in a series of the classic television series, Underbelly 2008-2013.<br><br>Also starring John Jarrat who has also been in another classic backwoods flick, Wolf Creek 2005, Wolf Creek 2 2013 and other classic flicks, Django Unchained 2012, Rogue 2007, Dead Heart 1996, The Chant of Jimmy Blacksmith 1978, Dark Age 1987, Blue Murder 1995 and an episode of the classic television series Police Rescue 1989-1996.<br><br>I enjoyed the violence, comedy and the scenes where the knife gets flicked and the aunty on the chair in the lounge room scene!<br><br>If you enjoyed this as much as I did then check out other classic backwoods flicks, Hatchet III 2013, The Cabin in the Woods 2012, A Lonely Place to Die 2011, Resurrection County 2008, Straw Dogs 2011, Transit 2012, Tucker &amp; Dale vs. Evil 2010, Backcountry 2014, Wrong Turn 5: Bloodlines 2012, The Hunted 2013, Hard Target 2 2016, The Hunt/Sanyang 2016, Blair Witch 2016, The Edge 1997, Killing Ground 2016, Enemies Closer 2013, Jungle 2017, High Lane 2009, Severance 2006, Happy Hunting 2017, Inbred 2011, The Ritual 2017, Wake In Fright 1971, Welcome to the Jungle 2003, Victor Crowley 2017, Calibre 2018, Downrange 2017 and The Condemned 2007.","user":"sydneyswesternsuburbs","rank":[10,17]}]