[{"title":"I Love These Women,they are delicious!.","rating":10,"date":"26 April 2014","review":"The Other Woman is a 2014 American romantic comedy film directed by Nick Cassavetes and written by Melissa Stack. The film stars Cameron Diaz, Leslie Mann, Kate Upton, Nikolaj Coaster-Waldau, Nicki Minaj and Taylor Kinney.<br><br>The Movie Plot: After discovering her boyfriend Mark is married, Carly tries to get her ruined life back on track. But when she accidentally meets the wife he's been cheating on, Kate, she realizes they have much in common, and her sworn enemy becomes her greatest friend. When yet another affair, Amber, is discovered, all three women team up to plot mutual revenge on the cheating, lying, three-timing Mark. Things get a lot crazier when they discover that Mark isn't a three-timer he's a four-timer<br><br>I really loved this film the women were deliciously cute and their acting was amazing. I laughed a lot and honestly I was surprised that this movie is rather excellent and has been under-rated. The movie poster is simply perfect. Believe me this film is a masterpiece. See it and you will spend the best of times and I guarantee you will quite enjoy this film and you'll love these irresistible ladies.","user":"olalara","rank":[160,283]},{"title":"A Senseless Woman's Revenge Fantasy","rating":2,"date":"14 May 2018","review":"Dressed up as a comedy movie, the narrative surrounds three grown adult women who attempt to resolve an affair by playing childish pranks and eventually driving the man to self harm and bankruptcy.<br><br>Instead of speaking with the cheating husband about the affairs, our female protagonists think it funny to...\n<ul><li>Involuntarily alter his body by overdosing his drinks with female hormones.</li><li>Dilute his shampoo with hair removing cream, causing him to lose his hair.</li><li>Flush his toothbrush in the toilet...</li><li>Pour dangerous amounts of laxative into his drink at a restaurant.</li><li>Have a drag queen sexually assault him without consent.</li></ul><br><br>All the while, the women are portrayed as strong supportive characters, with a cringey slow-motion beach shot where they all hold each other as if to say 'yeah girl power! we're all in this cruel vendetta until the end!'.<br><br>After the slew of assaults upon his person, they climax by confronting him, causing him to have a nervous breakdown, and they literally stand around watching as he breaks his nose and then trips into a glass pane that shatters and cuts him up. They literally just stand there watching. Nobody offers to check if he's okay or call an ambulance. I guess that's okay because he's a man.<br><br>The worse thing about this movie is that it is NOT a good portrayal of women, and there is something seriously wrong with society if we do find this funny.","user":"dylandesign","rank":[23,35]},{"title":"hard to admire, unenjoyable","rating":5,"date":"13 February 2019","review":"A misguided and horrible excuse for a female empowerment film, The Other Woman is a comedy that makes women look terrible and is absolutely miserable to watch, with horrendous performances, painfully unfunny attempts at humor, and poor writing.","user":"aminifatimaaa","rank":[8,11]}]