[{"title":"Started off slow but really picked up & by the end you're glad you watched it. One of the better westerns in the last few years.","rating":6,"date":"25 November 2013","review":"\"The Lord does not believe in actions without consequences.\" The New Mexico territory in the late 1800's is full of danger. When Sarah, a young wife (Jones) encounters the local preacher (Isaacs) and a sheriff (Harris) who isn't totally sane. When she refuses the preacher's advances her life is forever changed. Now with the help of the sheriff she sets out for revenge, and you know what they say about a woman scorned. I am a huge Ed Harris fan and I like westerns but lately the genre has been in a huge nose dive so I wasn't sure what to expect from this. This is easily one of the better ones that have come out lately but it is still a little slow moving. 90% of the reason this is good is the cast. Harris is good in everything, Isaacs is the most disturbing preacher since Michael Parks played one in Red State. The gem of the movie though is January Jones. For once she isn't just the eye candy of the movie, she actually has a needed part and the fact that it is her that loses it and goes on a killing spree makes it that much more interesting. If you are a western fan this is one to watch. Don't expect something like Open Range though, this is more like Appaloosa or 3:10 To Yuma or for you real movie fiends out there, if you liked Seraphim Falls you will like this. Overall, started off slow but really picked up and by the end you are glad you watched it. One of the better westerns in the last few years. I give it a B.","user":"cosmo_tiger","rank":[34,41]},{"title":"Old-Style Western as Feminist Revenge Flick","rating":9,"date":"21 July 2013","review":"In 1880s New Mexico, self-declared prophet Josiah (Jason Isaacs) is building a church on \"God's land.\" Unfortunately, \"God's land\" is also inhabited by a farming couple, Miguel (Eduardo Noriega) and Sarah (January Jones), whose attempts to grow crops keep being stymied by Josiah's free-roaming flock of sheep. At the same time, two brothers who happen to be related to the Governor have gone missing, and it seems to lawman Sheriff Jackson (Ed Harris) that they must have disappeared right in the middle of Josiah's spread. The meeting and interactions between these characters will bring out their respective histories, misdemeanors and other crimes, and it's anyone's guess who might live to tell the tale.... Although I don't generally like Westerns, I was very impressed at FantAsia 2011 by \"Blackthorn,\" in which Sam Shepard plays an aging Butch Cassidy (and Eduardo Noriega has a feature role, as in \"Sweetwater\"); I thought for sure Shepard would get lots of acting awards once the film played in wide release, but I don't think it ever got a wide release. Fearful of missing another great Western by assuming it would be in regular theatres any day, I made sure to catch \"Sweetwater\" this year and I'm glad I did! Ed Harris is amazing as the very eccentric, borderline crazy sheriff and Jason Isaacs is incredibly chilling as the definitely way-over-the-border psychotic preacher. But January Jones was just electric here; sure she looks gorgeous and makes most of the male characters drool, but she's thoroughly independent and absolutely fearless when she decides to take matters into her own hands. The landscape is breath-taking (and will make you thirsty just looking at it) and the story-telling is marvelous. I hope this has a better fate than \"Blackthorn,\" because it deserves to be seen even by those, like me, who don't tend to like Westerns.","user":"alisonc-1","rank":[29,35]},{"title":"Mostly absurd but ridiculously fun to watch","rating":8,"date":"28 January 2013","review":"There are ways for women to overcome their physical inferiority to men. The heroine of this film, played by January Jones, somehow learns it, and carries out her plans with a vengeance. The film later becomes an absurd but fun ride like \"Red Eye\" with its female lead replaced by another pretty blond, and set in the spectacular backdrop of the wild, wild New Mexico.<br><br>Jones is clearly not gunning for major awards here, and striking deep emotions is apparently not a requirement for her part. She needs to look sassy and resolute in her cute costume, and she sufficiently delivers within that realm.<br><br>Ed Harris is fantastic as a lunatic sheriff. The performances by the rest of the supporting cast are also sound, especially by Jason Isaacs.<br><br>Country music heartthrob Jason Aldean is naturally menacing as the bad guy's right hand man. He has a reasonable shot at a moonlighting career in movies of this genre outside his day job as a singer.<br><br>\"Sweetwater\" will surely rub old school Western fans the wrong way, but if you are open-minded about crossing formats, you just might find this popcorn Western a perfect pastime.","user":"Arit","rank":[46,60]}]