[{"title":"Great","rating":9,"date":"22 February 2020","review":"It is hard to believe but this movie is bigger AND better than the first one. I will say it has ambition in opening up this world into a mafia drama rather than another claustrophobic thrill-ride. The mob aspect of the plot might be generic and cliched at times but overall that part was surprisingly more engaging than some American movies of that kind. But we watch this for the action and it was insanely savage! We are talking level-11 sh-t here; high-speed pacing, masterful choreography and brutal as hell. Fight sequences that put most action movies to shame!!\n......................................\nTHE RAID 2 QUOTES\nYou Apologize to them in their languages, in our land. Where is your honor!","user":"MR_Heraclius","rank":[40,41]},{"title":"The most highly anticipated film of my life, and it actually met those expectations","rating":10,"date":"28 March 2014","review":"Note: Check me out as the \"Asian Movie Enthusiast\" on YouTube, where I review tons of Asian movies.<br><br>The Raid 2: Berandal (2014) (Indonesian Action).<br><br>Viewed on March 28th at the Regal E-Walk cinema in the heart of New York City.<br><br>After surviving the apartment building raid, Iko Uwais goes undercover to take down an Indonesian crime syndicate that is feuding with an invasive Japanese yakuza clan in Jakarta. Things get out of control and everything goes to hell. That's the plot in a nutshell.<br><br>The fighting is the main draw of this film. Martial arts films are frequently under-appreciated because critics tend to downplay the artistry of orchestrating a fight sequence. In some ways it's like staging a complex dance with extremely difficult performances by physical talents who have spent their entire lives perfecting their craft. In many cases it can be even more challenging than executing a good dramatic moment. With that said, \"The Raid 2\" is an exquisite ballet of death with an incredible variety of expertly crafted action sequences that have a grounded, realistic feel to them. It's hard to describe, but despite the insane action there's very little outrageousness present. The choreography here is some of the best ever put on film.<br><br>There is no question that Uwais is currently the premiere martial arts star, and there is certainly no question that Gareth Evans is the greatest action director on the planet. This man is a genius in terms of visually expressing action through vivid, mind-blowing camera-work. This guy never directed a car chase sequence in his life, and yet his very first attempt is impressive. I did notice a bit more shaky cam in this film when compared to its predecessor, but one can see everything so it's not a problem. Evans is also a pro to create a crescendo of action where every fight seems to outdo the one before it. This generates an absolutely thrilling final hour that will go down in history.<br><br>The gory violence of \"The Raid 2\" is a big \"screw you\" to PG-13 action movies. Some critics are already whining about the graphic bloodletting, but these are the same guys who hand out 90% approval ratings to movies with incompetent action and no edge – *cough* \"The Hunger Games 2: Catching Fire\" (2013) *cough*. The gore in \"The Raid 2\" isn't just randomly thrown in either. It's a logical consequence of the situation and characters, and it is applied in very creative ways. I have heard that Evans was only coerced to cut a few \"frames\" due to the MPAA review, but I have no idea which frames those were because the now infamous shotgun kill is present in its full, unadulterated glory.<br><br>The $4.5 million budget is an even bigger \"screw you\" to mega budget Hollywood blockbusters. \"The Raid 2\" has more thrilling action than every $100+ million superhero movie I've ever seen . . . at less than 4.5% of the cost. It's almost unbelievable what these guys can do with a limited budget.<br><br>Given the exceptional quality of the action, the 148-minute runtime puts some pressure on the story to maintain its momentum between the violence. The first \"Raid\" received much criticism that asserted a generic story and undeveloped characters, but I felt that it nevertheless established a \"feel\" for the characters without the need for long-winded exposition. That \"feel\" can add quite a bit to an action film. \"The Raid 2\" spends more time setting up its premise, which results in some genuine plot and character development. It attempts to do this by taking a generic gangster template and infusing it with a sprawling crime saga that implements many characters. This is essentially a \"chess board\" setup where numerous pieces are first put into place, allowing for many possible confrontations. The viewer is therefore able to relish the moment when a particular piece attacks and takes down another, revealing the actual outcome amidst the countless possibilities. <br><br>I really liked some of the supporting characters in this, and actually felt a bit sad when they died (even some of the villains!). I am a bit disappointed that both \"Hammer Girl\" and Baseball Bat Man\" are only given a few scenes, but they are certainly memorable. I really liked that brief moment where Hammer Girl picked up her hammers on the bar shelf. It was slightly child-like and innocent, like she was going out to play with friends. This brief, split-second moment can communicate a lot about her character. <br><br>I suppose it helps to already be a fan of the actors and actresses here, since there are a number of familiar faces from both Indonesian and Japanese film industries. Needless to say, the performances are top notch. The Japanese actors have their little moments, but they could have been given more to do in this. Maybe \"The Raid 3\" will give them more time in the spotlight.<br><br>Overall, \"The Raid 2\" is a very satisfying action film that justifies its hype after just one viewing. It's simply spectacular.","user":"ebossert","rank":[375,430]},{"title":"One of the best martial arts movies EVER !","rating":9,"date":"29 March 2014","review":"The Raid: Redemption was such a success and regarded by many people as one of the best action movies of 2012, and the sequel is likely to end the year 2014 as the best action movie of the year. It's pretty much different than the first movie, in this one there was actually a story. This movie is a great combination of a gangster flick with a very well coordinated martial arts.<br><br>The director Gareth Evans is masterful at filming incredible action sequences, probably better than ANY Hollywood directors working right now. It is inspiring how he managed to make such unbelievable fight scenes, and car chase in a such limited budget. The cast were good in delivering the good, the dialogue was fairly good, the choreography were Spectacular! Not to mention the unforgettable cinematography that was brilliantly managed by people who knows what they're doing.The only downside is perhaps the running time which could have been shortened 15-20 minutes, but you will still always be entertained while watching this movie.<br><br>Overall, The Raid 2 is arguably one of the best sequels ever, and even one of the best martial arts movies ever. It's superior to its predecessor in terms of story telling, considering the running time, and the choreography was also quite a bit improved from the already unforgettable moves in the first one. It had more action and violence than the previous one, although less action percentage-wise. It will keep you on the edge of your seat. It has everything a perfect martial arts movie has to have, and it deserves to be regarded as one of the best in its genre. I hope that the director Gareth Evans would make more films with a higher budget to showcase to the world his true potential as a director, and it'd be great to have it featuring Iko Uwais, that could be an icon for years to come.","user":"Fanboy218","rank":[173,197]}]