[{"title":"It's the movie to be jolly","rating":7,"date":"18 January 2017","review":"A festive movie about family, about values, about love and everything else. With a little twist at the end if you want to call it that. Other than that it is pretty much by the numbers (predictable that is). But it's a fun movie to watch and it's lovely to see another story about family interactions.<br><br>If you like that kind of stuff that is. But it's light (drama included of course) and it's fun overall. The acting talent at hand is amazing and it's clear they're having a blast. I guess watching it around Christmas time makes the most sense, but you could also watch it anytime else and still have that good feeling","user":"kosmasp","rank":[18,22]},{"title":"Fantastic dramady about dysfunctional families and holidays.","rating":9,"date":"18 November 2015","review":"I saw this with my husband and daughter in law and we all just howled. It reminds me of Nora Ephron film with all the family and personal drama going on. There is a bit of profanity and sexuality so I wouldn't take your younger kids but, for teens it's a go. <br><br>It has a great ensemble cast, each with his or her own personal drama going on. Diane Keaton and John Goodman (who has lost a ton of weight and looks great) make a very believable couple whose kids and grandkids are all slightly off kilter. Steve Martin, who narrates the film through the eyes of the family dog, is a delight. And, the love story between Angie and Sergeant is one of the highlights of the film. \"I never believed in love at first sight until now.\" <br><br>As Leo Tolstoy said, \"All happy families are alike; each unhappy family is unhappy in its own way.\" But, you might just see an element of your own family in this film.","user":"rannynm","rank":[46,69]},{"title":"Deserves a slot in the Christmas canon","rating":8,"date":"25 October 2016","review":"Any number of the films we now think of as unassailable holiday classics -- Christmas in Connecticut, White Christmas, even It's a Wonderful Life -- were dismissed as corny and formulaic in their original reviews, so it's no surprise that Meet the Coopers met the same fate. But I suspect time will be kind to this one: it's warm without being gooey, the humor is sharp and observant, the ensemble is top-notch, and the soundtrack is quite lovely.<br><br>If, like me, you're a fan of the dysfunctional-family Christmas comedy (The Ref, La Bûche, A Christmas Tale), this one may well sneak up on you and enter your annual holiday rotation. If I ever get to update my holiday film guide \"Have Yourself a Movie Little Christmas,\" this one would definitely go in.","user":"NeelyO","rank":[11,14]}]