[{"title":"Has some occasional good moments but overall not a great movie","rating":5,"date":"23 November 2014","review":"I didn't plan on writing a review about this movie, cause there simply isn't that much to say about it and I didn't have a strong liking or disliking for it, it was just a okay but flawed watch<br><br>I'd like to point out that even though Steven Segal and Vinnie Jones despite getting top-billing and on the poster are not in it for that many scenes (3 to be exact).<br><br>Now I don't even like them so personally I don't care but I know they have a strong following so I thought I'd give the heads up to their fans who might be eager to watch them.<br><br>It's also not a action-movie as the poster is made to look like, it's more of a slow burning film noir type movie, not a very successful one but that is the genre I think they are heading for.<br><br>It's not all negative though George Eads from CSI is a pretty cool guy in the lead and I wouldn't mind seeing him lead other movies in the future.<br><br>The plot is decent when it's not all over the place, I could have done without 1 or 2 twists though, which felt terribly forced, like they often do in movies like these.<br><br>AnnaLynne McCord whom I loved in Excision and enjoyed in Scorned (despite that movie being very flawed her performance was very entertaining) is just okay here, feels like she's not really trying too hard.<br><br>Tia Carrere appears in one pretty pointless scene.<br><br>What more can I say? Oh yeah one thing that got a little annoying was when they had tons of flashbacks of scenes from like 10 minutes prior in black and white, highly pointless.","user":"Seth_Rogue_One","rank":[20,21]},{"title":"Nonsensical & Bizarre Noir","rating":2,"date":"3 December 2014","review":"This nonsensical and bizarre noir initially offers some intrigue as to where exactly this dark tale is going. However, to me, it just seemed to get more and more convoluted and ridiculous as it progressed.<br><br>Set in Las Vegas, George Eads gives a solid performance here as Jack, a wise-cracking poker playing chump, who always seems to be dodging or getting beaten up by his creditors. One night, he's approached in the casino by a wealthy smarmy gambler, named Duffy (Stephen Lang), who offers Jack a chance to make some big bucks, but won't reveal to him the details.<br><br>When Jack gets desperate enough for cash, he takes Duffy up on his offer and goes to his mansion. Jack soon finds out the deal is for him to have sex with Duffy's sultry wife May (AnnaLynne McCord), while Duffy observes and Jack will receive $20,000.<br><br>Of course, you know that things are not going to go smoothly and Jack will get himself deeper and deeper in a web of deceit and death. When Duffy's brother Lewis arrives on the scene, even more mayhem and murder will follow.<br><br>As so often happens in these types of films, Steven Seagal's name will be used for advertising but his screen time is limited in a supporting role. Why Tia Carrere agreed to play a ridiculous cameo role of a strip club drinks hustler is beyond me.<br><br>All in all, I found Eads performance here good, but after an initial interest into where this was going, I just found this noir to eventually turn into just a muddled mess of a movie.","user":"larrys3","rank":[7,9]},{"title":"No forgiveness for this !!","rating":1,"date":"16 December 2018","review":"I am the kind of guy who can apreciate a Seagal movie, and yes i am talking his straight to video movies. I don't need much to be entertained. Cast him as an ex CIA agent or whatever, and suddenly criminals are after him, and give me 2-3 aikido stunt double fights, 3-4 gun fights and ill roll with it.<br><br>Lately Seagal has been playing a backrole in movies to younger guys and honestly it was not that bad for the most part. I think its even a good thing. Killing Salazaar was fine. Luke Goss did a fine job in the action role, and Seagal was in it just enough to justify his name on the cover, and it had GSP.<br><br>But this movie... this movie does not deserve anything. Its a bad cash grab, a deception. You got Seagal as the biggest face on the cover and he has barely a cameo, not even landing a single punch. Vinnie Jones is also just a cameo.<br><br>Even the DVD box is deceptive, it make it looks like Seagal will have a nice secondary role, but nop.<br><br>Looking at the box i was hoping for something close to that Jason Statham movie, you know \"Wild Card\", not a masterpiece but entertaining enough. This is nowhere even close to that.<br><br>NOTHING HAPPEN, no action what so ever. Its clearly a movie where Seagal put his face in to score a few $ while the company making it tough it could lure a few Seagal fans like me and it worked i guess. I paid this movie 5$ out of a video store bargain bin and its still too much. Im returning it even if i just get 1$. I collect Seagal movies, even the \"lesser ones\" but that one is too bad to even take a space on my shelve.<br><br>I don't think i ever gave 1/10 to a movie on IMDB, if i did it must had been very bad, but here i just feel i was deceived !!<br><br>And before you say, yes reviews could had tell me but usually peoples are harsh on Seagal movies, and like i said i usually enjoy them, even when he plays a second role. I had tons of fun with Force of Execution for instance. I enjoyed Code of Honor despite being a rather mediocre film, hell even End of a Gun, wich is one of the Seagal movies where not much action happened and i find it rather boring, at least he was IN THE MOVIE.<br><br>Gutshot Straight is terrible and should be forgot. I never want to watch it again !","user":"destroyerwod","rank":[3,3]}]