[{"title":"Decent film well worth a watch.","rating":7,"date":"2 August 2015","review":"This is the kind of film you flick on at 12.30am when you really should be thinking about bed, but instead you find yourself sitting there wrapped up in the story telling yourself '5 more minutes...just 5 more minutes.' <br><br>There's very little original or inventive about this movie. On paper it's a decent horror-suspense the like of which you will have seen many times before. It's strengths are in the restrained, yet engaging pacing, but most especially the subtle but powerful performance of lead actor Kevin Durand. <br><br>Durand plays small town Sheriff Paul Shields, a man seemingly on the verge of a nervous breakdown after the tragic death of his son and the breakdown of his marriage to his wife Susan, played with depth and compassion by Bianca Kajlich. It is this human element to the story that elevates it beyond your typical creature-feature mystery-suspense. <br><br>The premise has been used countless times before, but rarely acted so adroitly. You really feel for Durand, he practically exudes pain in every scene without ever overstating the case. I always liked him as an actor, but after this performance I would rate him as a potential great. I sincerely hope that on the back of this performance he gets more sympathetic, serious roles away from the unhinged baddies he usually plays (albeit excellently).<br><br>I don't like to spoil the content of movies in my reviews, so I'll just conclude that this film is good but nothing special. It's well worth a watch for fans of horror and/or suspense, just don't expect a reinvention of the wheel, because you'll have seen most if not all of this before elsewhere.","user":"johnbkaramazov","rank":[57,65]},{"title":"Could Have Been Great","rating":6,"date":"26 July 2015","review":"Directed by a man from Kentucky, a monster/horror film and starring one of my personal favorite underrated actors (Kevin Durand) I was intrigued to check out Dark Was the Night despite the name. It sounds kinda cool but once thought about you half expect it to be directed by Captain Obvious. (Because no crap, it's dark at night)<br><br>Bright Was The Day still brings the good stuff for at-least the first 2.5 acts. A nice, slow burn, mysterious story about a Father (Durand) with a painful past trying to prove to himself he's capable of keeping his family safe. Then something screwed up comes to town and gives him the chance to x 5000.<br><br>The tension builds in an already paranoid small town when animals start to go missing and freaky hoof prints are found all over the place (No really, but they pull it off nicely). Things feel less dumb horror movie and more J.J. Abrams style Monster Mystery at this point as we slowly unravel the menace along with Sheriff Shields (Durand).<br><br>Director Jack Heller does a great job of using atmosphere &amp; slowly delving out creepy hints rather than throwing out empty jump scares. Also working for him is Durand who overcomes a done-a-thousand-times back story and manages to deliver his heartache &amp; intention with sincerity. Plus the dude just looks and acts like a leading man. He's a kick-butt Schwarzenegger type believable hero who can also act. He's usually the best part of everything he's in &amp; it's nice to see him get to keep the cameras attention throughout.<br><br>Remember those few episodes of Lost when we didn't know the monster was just a stupid cloud of black smoke? They do almost as good of a job hiding their perpetrator here, just showing us enough to keep us scared. Maybe they knew that once we saw the evil full form, we would lose interest.<br><br>Just as things are reaching peak intensity and they create a killer moment for us to chew on everything goes flat. Mainly the special effects kill all the momentum and end our hopes of scary time goodness. The tension is literally sucked out of the film in a single ugly moment. The shock and horror instead comes from just how bad the special effects look and I think the film makers knew it because they go for a really stupid final horror moment that undermines its best character arc and renders it useless. But damn, they started off really nicely.<br><br>6.5/10 Dark Was the Night is watchable because of the well crafted pacing by Jack Heller &amp; Kevin Durand. Damn that final act though. This is a film worthy of a re-make with a better budget for better special effects and Cinematography. As long as they could keep the same players! Just give them the money to make this look the way it should.","user":"wewatchedamovie1","rank":[50,58]},{"title":"Decent suspenseful horror","rating":7,"date":"26 July 2015","review":"Up until the closing scenes Dark Was the Night is reminiscent of any number of films by director M. Night Shyamalan. <br><br>A strong sense of foreboding and tension is established early in this film. The source of the terror that infects a US country town is hinted at and glimpsed but never fully revealed, until the final scenes. <br><br>As a result, Dark Was the Night could be described as somewhat slow by some but that was not what I took away from this story. Its well acted, with a solid sub plot and good character development, that moves the story forward. <br><br>The ending is somewhat predictable, as is the final twist but that really doesn't detract greatly from what is a worth while watch. Seven out of ten from me.","user":"s3276169","rank":[52,63]}]