[{"title":"Waste of time and money! 2/10","rating":2,"date":"6 February 2016","review":"Review: What a boring, uninteresting movie! The movie seemed cheap and the storyline was awful. With a title like, Guns For Hire, I was expecting some form of action, especially as Jeffrey Dean Morgan is holding a gun on the cover but there's no action at all. Its about a suicidal blonde, Athena (Ever Carradine), who hires a tow truck driver/assassin, Beatle (Michele Hicks) to kill her. As Athena has no money, she signs over an insurance policy to Beatle, which will pay for the assassination. While there waiting for the paperwork to come through, Athena moves in with Beatle and they start to become close, even though the situation is slightly warped. Beatle regularly sees a psychiatrist, Dr. Vanderark (Orlando Jones), who thinks that her whole assassin story is in her mind and she has a strange relationship with a hooker/stripper, Carla (Sarah Shahi), who actually has feelings for her. They also have a brutal hit-man on there tail, Bruce (Jeffrey Dean Morgan), who is hired by Athena's crooked previous employer, Kyle (Ben Mendelsohn). On top of that, Detective Holt, Raffaello Degruttola is following Athena and Beatles every move and he builds a case to try and stop Beatle in her tracks. Sounds exciting but it really wasn't. Most of the footage is about Athena and Beatles relationship, which is quite boring but the major twist at the end was surprising. I personally did lose interest after a while and the acting was quite bad from the two leading characters. I was expecting more from Jeffrey Dean Morgan and Ben Mendelsohn, who usually put in decent performances but the awful script didn't bring the best out of them. I couldn't really see the comedy side of the movie because there wasn't any wit in the script at all but I did stick with the plot because I really couldn't see were the film was going. When all was revealed I still wasn't that impressed so it has to get the thumbs down from me. Disappointing!&nbsp;<br><br>Round-Up: This is the first and only movie directed and written by Donna Robinson, who really didn't do a good job with this film. There's a few unnecessary lesbian scenes and there wasn't much depth to any of the characters, which made if feel like this movie was made without much thought. There were some good actors on board, who really got wasted because of the awful storyline, so it has to go down as a bad day at the office.<br><br>I recommend this movie to people who are into their drama/thriller/comedies starring Jeffrey Dean Morgan, Ben Mendelsohn, Tony Shalhoub, Orlando Jones, Ever Carradine, Michele Hicks, Sarah Shahi and Ivvana Milicevic. 2/10","user":"leonblackwood","rank":[16,24]},{"title":"Quite seriously pathetic","rating":2,"date":"11 January 2016","review":"Wow. <br><br>From awkward over gesturing not matching emphasis or tone, to children's diagrams in the background of the detective office (like you need a diagram to visually map out the relationships between 3 people), to the poorly worded phrases like \"in your infinitely wise logic that i'm too cabbage headed to grasp...\" and peppered over a lesbian undertone for absolutely no reason. <br><br>This is quite possibly one of the worst movies I've ever seen. It is actually bad enough to be funny if you're in good company and the right mood enhancers...","user":"paxdriver","rank":[16,25]},{"title":"Of course it's silly and ridiculous . . . and quite fun","rating":7,"date":"3 August 2016","review":"Of course it's silly and ridiculous . . . and quite fun<br><br>OK, some of the reviewers here might be over thinking this just a bit, maybe?<br><br>C'mon, we're not talking \"Gone With the Wind\" here . . .<br><br>No, this isn't spectacular drama with intensely portrayed characters and deep probing plot lines.<br><br>Sometimes, you just have to dive in with no specific expectations and go with it.<br><br>And in this case, it works.<br><br>Well, I'll admit to having just a bit of a crush on Michele Hicks.<br><br>I mean, really, what could be more lovable than a way out on the fringe edgy tow truck driver and assassin with mysterious behavioral traits?<br><br>So, about the aforementioned plot lines (sketchy as such may be).<br><br>No spoilers, so not much detail offered here, except to say that the ending may be simplistically disappointing to some, and cleverly contrived to others.<br><br>But that's not really the point, at least in my opinion.<br><br>The meandering moment to moment scenarios are more like a series comedic vignettes loosely woven together to form a sort of quasi- quilt of an emergent story.<br><br>The concept is to simply enjoy the delightfully bizarre nature of this entire production, and just go with it.<br><br>Is this a 10? No, hardly . . . but as a low budget indie dark comedy with some kinky twists, I'll give it a solid 7.<br><br>Just my opinion.","user":"charles000","rank":[12,18]}]