[{"title":"A thoughtful, action-packed, entertaining Superman movie.","rating":9,"date":"5 June 2012","review":"An extremely well done Superman story that touches on the major moral aspects of a superhero as powerful as Superman.<br><br>I should start out by saying I was NOT looking forward to this movie based on the previews I had seen, and after watching the movie I was VERY impressed with how it turned out. Does a great job of talking about the grey area of Superman's moral code of not killing anyone and if that is the right way to go in today's world. <br><br>Batman and Superman both don't kill, and as a result their villains ALWAYS escape and cause more harm, so why NOT end the monsters right there and save everyone for good? That's the central theme, and it presents it in an intelligent way with plenty of interesting and unique action. The animation is pretty good, and I actually ended up preferring this Superman visual style than the other Animated-Series style Superman.<br><br>The action was all great, felt like they made really good use of Superman's powers and strength... which sometimes they forget to do.<br><br>The story really kept me interested and I didn't really know how it was going to all end, and was surprised at how into it I was at the end and really wanted to see how it all turned out.<br><br>I would put this up right next to the Batman/Superman animated movie.<br><br>8.5 out of 10.","user":"admiraln8","rank":[61,73]},{"title":"Very enjoyable, interesting, and generally great","rating":8,"date":"5 March 2016","review":"Let me preface this review by saying that this is the first DC animated movie I've watched, unless you count a compilation of the first episodes of Justice League, and I also haven't read the comic this film is based on, so I'm not going to be comparing it to either of those other things. I've watched most of Superman: The Animated Series, but other than that even my DCAU experience is rather limited. However, I am a big fan of Superman, if a relatively new and inexperienced one, so there's that.<br><br>Overall, I found this movie very enjoyable, and it successfully captured much of what I love about the character while also telling a really interesting, thought-provoking story that went beyond costumed characters beating each other up. As others have pointed out, the analysis is pretty simple and one-sided, and while a more thorough treatment could've been nice, I still liked it the way it was. The point of the movie was to defend Superman's idealistic way of doing things in a cynical and angry age, and personally I don't have a problem with that - heck, I actually really like it. Yes, there's certainly a need in the world for a more thorough treatment of these issues, but that doesn't mean this film has to do it all.<br><br>The depiction of Clark/Superman in this film was very nice. I think they captured his most important traits just about perfectly. He comes across as authentically human and an embodiment of our highest ideals at the same time. I also really loved their portrayal of Lois and Clark's relationship. An especially cute aspect was seeing them maintaining their journalistic rivalry despite being a married couple now. We also saw that their relationship has its ups and downs, just like everybody's, but that their love and commitment for each other is incredibly strong. It just reinforced in my mind how awesome and important an aspect of the series Clark and Lois' relationship can be, and I'm so glad they paid it attention. I have to say, Lois came across as a little too whiny, especially with the voice they gave her, but I do like that she's far from perfect.<br><br>The Elite were entertaining and interesting in both personalities and powers, which I was grateful for - I'm glad they weren't just generic bad guys. Still, I wished they hadn't tried quite as hard to dial down the viewers' sympathy for them, as it's one thing that could've made the film a little more nuanced easily.<br><br>If you accept its one-sided nature, the moral conflict and Clark's quest to restore justice and morality is a beauty to behold. I loved how they explored how Superman is more than someone who just solves our problems - he's an inspiration to us, someone we can aspire to be like. He doesn't just beat up the bad guys. He shows us that there's a better way. And that's what the Elite, and the \"edgy\" superheroes they were designed to spoof, just don't get. Superman's quest isn't just to stop some villain from doing something - he's actually trying to convince the people of earth, us, to hope for better things and not settle for violent solutions. Their depiction of the conflict, and especially how it was resolved, was very compelling.<br><br>The artwork and animation was serviceable at worst, but I'd be lying if I said they were super impressive. Probably the worst thing of all was, at the risk of sounding a little silly, Superman's chin. For some reason they decided to make it really big and odd-looking. There were also a few moments that looked just a little cheap in the animation department, such as one near the start where it was very obvious that everything was absolutely still and rigid other than Superman's mouth. Overall, this aspect of the film wasn't bad, certainly, but it wasn't particularly great either.<br><br>This is pretty minor, but I just have to make a quick note of this - Superman's alter ego of Clark Kent is an aspect of the character I love, and while he didn't play a huge role in the story, he did get some nice screen time and he was portrayed nicely. (To be clear, there was no visible difference in personality between him and Superman, but I'm a-OK with that.) I just feel compelled to mention this because, in my personal opinion, the Clark Kent from Superman: The Animated Series is one of the worst versions of the mild-mannered reporter ever created (despite the overall solid-ness of that show), and so it was just really nice seeing a well-done version of him in a modern animation - so nice I felt compelled to comment on it.<br><br>Oh, and, I just have to say it - the idea of people rallying around and singing the praises of total jerks who talk about how they're going to solve problems in the harshest possible ways reminds me a bit of a certain presidential candidate, which will certainly date this review, but whatever.<br><br>Overall, if you have any interest in Superman, superhero cartoons, etc., I definitely recommend you give this a watch.","user":"Talia_the_StoryMaker","rank":[7,8]},{"title":"It's OK","rating":6,"date":"6 July 2012","review":"\"Superman vs. The Elite\" is an animated adaptation of \"What's So Funny About Truth, Justice &amp; the American Way?\", a comic which made a contrast between the classic morality of more traditional heroes with the actions done by morally ambiguous antiheroes, which question the consequences caused by the decision of Superman to don't kill anybody, not even the worst villains, considering that sometimes this could do more harm than good.<br><br>The bad thing is that even with such interesting premise, neither the original comic or this animated movie made a very deep exploration of those themes, and instead of that this movie takes the easy way out of turning The Elite characters into typical villains (instead of the antiheroes that they were supposed to be) in order to make Superman to be automatically right. In other words, what could have been a complex story turns into another predictable battle of good vs. evil and black and white morality. Superman is right, and the Elite is wrong, there is nothing to question here.<br><br>I appreciate the fact that the animated movie tried to add some little shades of gray making The Elite a bit (just a bit) more likable than their original comic counterparts, also showing the collateral damage caused by the decision of Superman to don't kill any villain. But that's it, at the end this animation follows the same pattern of the comic, without going deeper than that.<br><br>But at least this had some entertainment value (Though I liked the original comic a bit more: It is true that the story was more simplistic, but at the same more direct, without any of the unnecessary filler material that was added to this animation) Even if at the end this is just a classical \"good vs. evil\" story disguised as something more complex,, it does still have some virtues that deserve appreciation, such as a good voice acting, some decent action scenes (Though the animation of this isn't so good as it could have been) and the fact, that despite how deeply flawed this was, at least was something funny to watch.<br><br>I guess that this movie has a good point and a correct message, but if somebody think seriously about it, at the end Superman makes the same mistake of the Elite, seeing the things in black and white: He is completely right and the others are wrong, even if they have some valid points to make. And in my opinion, that's a bit contradictory.","user":"Rectangular_businessman","rank":[9,11]}]