[{"title":"Episodic by nature","rating":8,"date":"26 May 2013","review":"The movie might have one major flaw: It does not know where and when to end. But then again, that didn't stop other movies from being great. And this one is possibly one of the best German movies that came along the last few years. Very witty, very modern and very close to real life. Some things are a bit too much (story-wise, a self exploring trip that brings \"together\" two characters springs to mind), but overall, the movie is more than well written.<br><br>It might also be a big surprise to some, but the acting is actually more than good. If you're used to let's call them commercial comedies from Germany and the absence of the lead actors in those movies to act, than you will be smitten by the ones lining up here. It's a real joy watching them all and participating in their lives is a real treat.","user":"kosmasp","rank":[12,15]},{"title":"Good German movie","rating":7,"date":"5 March 2014","review":"If you think on German movies you will automatically think on all the Till Schweiger and Matthias Schweighöfer Movies or you think on some Movies they are to much art. \"3 Zimmer/Küche/Bad\" proves that there is something between. It is a Movie that is near reality with good acting and with some good jokes. The Story is about a couple of young People there try to get clear with their life and get some problems with their relationships and friendships. So the Story don't got a clear target and is really crazy too. It's maybe one of the best German Movies they come around the last few years and it's for all the people they think Germany aren't able to make some good Movies.","user":"buechejulian93","rank":[6,10]},{"title":"A failed attempt at depicting German 20-year-olds' every day life","rating":2,"date":"11 August 2016","review":"\"Drei Zimmer/Küche/Bad\" or \"Move\" is a German 2-hour film from 4 years ago, this one was made back in 2012. The director is Dietrich Brüggemann and he also wrote this one with his sister Anna, who plays one of the main characters in the film. This was the second time already I watched this movie and it was at least as disappointing as the first time shortly after it came out. But lets start with the title. This one is actually not bad as it fits nicely with what the movie is about. Old people do not move and switch places too often anymore and the title stands for something that young people/couples are looking for when they want to get into a new apartment. And this is what this one is about: a group of young people moving places as their relationship statuses keep changing and a lot is happening in their lives. And they help each other all the time as a move is usually something fairly strenuous and time-consuming.<br><br>So these are the basic facts and I admit it does not sound too bad, like a film that I could be interested in actually. But the details in this movie are the huge problem. It is basically all about depicting life of people in their 20s realistically. Life as it happens. And that's where it fails. There were probably 10 moments that felt completely unauthentic to me in the sense that these moments would never have happened in real life. One example would be one character having to throw up the moment another reads a letter to him. Another example would be the break-up scene in the truck. These two wanted to move in together and on their way to their new home they talk about the guy's attraction to another girl? Yeah, of course they waited so long. And of course she would force him to get out in no-man's land. And of course one girl asks another guy to be the platonic \"daddy\" to her baby, only to get moments later back together with the real daddy and decide to move in together. The absolutely negative highlight was the ending though what made me give this film an even lower rating than i initially intended to: Two main characters find out they are actually half-brother and half-sister and of course they had sex with each other earlier. These random unrealistic development in here take away any credibility from this film in my opinion.<br><br>This is a bit of a shame as I believe most of the actors are fairly talented and there are also some moments that were pretty fine in terms of character presentations or character development. A lot of the film made really sense I think. But then, it all gets sacrificed for these nonsensical weird moments that just did not fit with the overall picture at all. And these turned this really long film into a failure as they basically turn all the good into irrelevance. I cannot take this film seriously and I absolutely cannot recommend it. Stay far far away.","user":"Horst_In_Translation","rank":[1,5]}]