[{"title":"Terrible Writing, Weird Directing and Awful CGI","rating":2,"date":"20 April 2019","review":"Watching this, it feels like a twelve-year-old wrote the screenplay by tacking together scenes that might look cool without giving any thought to what the dialog would sound like when spoken out loud by human beings. Ian McShane does his best to sound convincing, while some of the other actors don't seem to see the point in even doing that and it's hard to blame them. There are plot holes throughout and segments that make little-to-no sense and add nothing to the story, although would maybe look neat if the effects were any good. The whole thing generally feels like someone slapped together at least four or five stories and tried to turn them into a coherent whole, which wouldn't surprise me, although I don't know enough about the comics to say for certain.<br><br>I'm not sure where to place the blame for the awful pacing, but the movie is just unrelenting. There are times when things should wind down, but then it's just more noisy stuff happening. For example, at one point a character is in need of specialized medical attention and they find out it'll be a fairly-long and \"treacherous\" trek to get it. The character is then cured within 1-2 minutes of runtime, the trek portion being a few seconds of that, then we jump straight into some exposition, then we jump straight back to what we were doing before, presumably after a long and treacherous trek back that also happens instantaneously. To get an idea of how jarring this feels, imagine if Gandalf told Frodo about what it would take to destroy the ring and the next scene was at Mount Doom.<br><br>The direction is mostly just odd, and I have no idea if it's because the director couldn't figure out what was happening in the script or because someone was meddling with his work.<br><br>Finally, the CGI monsters look terrible. There are some impressive uses of practical effects, but the transitions between those and their CGI counterparts are blatant.","user":"misho-29395","rank":[437,661]},{"title":"Damn my eyes!","rating":2,"date":"12 April 2019","review":"I don't consider myself an angry guy but if this is the new standard for blockbusters, Baba Yaga can have both my eyes because I will have no further use for them. There's nothing I can think of to defend this cinematographic abomination. This extremely ugly shot cosplay version of Mike Mignola's Hellboy comic does not even attempt to tell a coherent story. The soundtrack consists of some out of place rock songs that are stuck in random places in the film. Unlike Del Toro's films, there is no way of feeling any sympathy for the one-dimensional characters. The endless stream of silly one-liners and aimless quips make you realize that these annoyingly unpleasant characters have nothing to tell us over the course of two (!) excruciating hours. The movie simply jumps from exposition piece to action scene and back again. And where Guillermo Del Toro created a tactile world with a balanced combination of practical effects work and sparingly used CGI, we are now saddled with special effects that look like the deleted scenes from a Playstation 3 game. It's incomprehensible that Mignola believes that this soulless version is closer to the comics. I think the claim that the a fan of the source material would be at peace with this terrible movie is an insult.","user":"neat-stuff","rank":[352,557]},{"title":"Watch the del Toro duology instead...","rating":5,"date":"11 April 2019","review":"Although the effort of the director and the talent of the actors, the movie lacks the charm of the Guillermo del Toro duology. The movie is way more faithful to the comics but it also tries to be faithful to the previous movies (which every reboot should try to be) but it just becomes a mess of attempts.\nThe CGI is overused- WHEN WILL STUDIOS LEARN!- and although the creatures design is very interesting, pretty much every character lacks the dept the old duology provided.\nAt the end of the day Hellboy(2019) is just another failed reboot that tries to be it's own thing while respecting the previous movies.\nMy rating?\n5 out of 10, but I do agree with the 61% rating on rotten tomatoes because the movie isn't all crap, there's a charm to it but it's not enough to make you overlook it's flaws.\nJust watch the Guillermo del Toro duology, it's a far superior franchise, and I would of loved to see the third movie if the studios didn't cancelled it.\nIf you are interested in the director Neill Marshall (which despite the failed attempt of rebooting Hellboy is a damn good director) go watch Dog Soldiers which is criminally underrated.\nSee you next time at the movies,\nRuben the Critic","user":"rubenrui","rank":[371,589]}]