[{"title":"Sub-Par \"B\" movie","rating":2,"date":"9 October 2012","review":"I find it nearly humorous that when I decided to view this movie it had a 7.7 on IMDb. After seeing the movie I was left with the feeling that the 27 ratings,at the time,were all put there by cast members. The movie lacks ANY depth or originality. It's another low budget film that employees actors with no real acting skill. The plot has been done in other movies...but with moderate success. I understand the concept of limited budgets in relation to movie production,but it seems like a Doc-in-the-box office was used for this level 4 bio-hazard facility. I would as soon people be honest and not dash to dupe people and make a few bucks since the backlash will cost more sales down the road as no one lies a set up and the review was clearly orchestrated and not an actual representation. I would advise against renting this movie at any time in our existence on this planet as the sheer level of acting it brings to the industry is liable to make people scream out in rage and never see another movie again :)","user":"mrorange-20","rank":[27,38]},{"title":"Watchable on a boring day.","rating":6,"date":"12 October 2012","review":"After reading the reviews... I wasn't going to watch it, but I was bored and there wasn't anything else. <br><br>It wasn't the worst that I've seen but you really do have to be bored enough to not walk away. Not do to any lack of effort from the actors... I've seen high profile actor work on low budget films before and have the same look and feel as this film. I would like to watch a few more films by the same director to be sure, but the way the film was shot... I would have to say that any fault lays with the director on this film. It had the feel of a homemade movie... Could have used better shots, and with less effort... making it more realistic.<br><br>It's a story line that has been done a million times before, but if your bored and in need for \"something\" to watch, then yes... it is watchable.","user":"tanwestcoast","rank":[13,20]},{"title":"It had spirit and the will...","rating":4,"date":"19 November 2016","review":"Actually I will start out by saying that \"Biohazard: Patient Zero\" turned out to be somewhat better than I had initially anticipated. True that I didn't have much hopes for this movie, fearing that it would be yet another one of those low budget zombie movies with awful make-up.<br><br>However, \"Biohazard: Patient Zero\" turned out to be entertaining enough. And while it wasn't as much of a zombie movie as I had hoped or would have liked, it still proved to be a watchable movie.<br><br>The story is quite simple, actually. It is about a Dr. Jonathan Wright (played by Brandon Slagle) and Dr. Jenna Barnes (played by Amanda Phillips) who works at a genetic research facility. However, they do more than just simple genetic research here, and when the bio-weapon is compromised, the entire facility comes under lockdown, and there is suddenly a real threat to the lives of everyone trapped inside.<br><br>I will say that despite the simplicity of the storyline, then director Brian T. Jaynes actually managed to turn it into something that was entertaining enough.<br><br>The movie, however, just wasn't outstanding or particularly memorable. I had expected more of a zombie movie, whereas \"Biohazard: Patient Zero\" turned out to be more of an outbreak movie. Sure, there were some infected people (or carriers) seen as the bio-weapon was released, but it just wasn't enough to keep a seasoned gorehound like myself satisfied. The ones that you see are merely just people with bloodshot eyes and theater blood on their faces and bodies. Of course, it would be like this as the outbreak had just started, but I just would have liked to have seen something more.<br><br>As for the acting in \"Biohazard: Patient Zero\", well it was adequate. Although you shouldn't set yourself up for some award-winning performances here.<br><br>All in all not an overly memorable movie, but still entertaining enough for what it was and for what director Brian T. Jaynes accomplished to muster together with fairly limited resources.<br><br>\"Biohazard: Patient Zero\" scores a four out of ten stars rating from me.","user":"paul_haakonsen","rank":[2,2]}]