[{"title":"Sitges 2012","rating":8,"date":"17 October 2012","review":"I saw it at Sitges this year and i was impressed by the quality of this crazy and bloody Italian flick. Zampaglione clearly knows his stuff and with this new film he shows all his love for the genre. . Tulpa visually looks fantastic,and it's a well performed addition to Italian cinema, most importantly it does what it intends to do, it remains faithful to the Giallo mentality, and breathes life back into a dead area of the horror/thriller genres. <br><br>Zampaglione even goes as far to bring back the traditional Giallo killer, a dark shadowy figure, with face covered, black hat, and those leather gloves . There are also some incredible and elaborated murders you will never forget. Giallo fans will love this one.","user":"jackierouge","rank":[17,22]},{"title":"Opera meets Eyes Wide Shut","rating":8,"date":"30 August 2012","review":"Not since Dario Argento's \"Opera\" have I had so much fun in the cinema. TULPA in the tradition of the aforementioned giallo classic's continues the black gloved killer franchise in a way that their creator has failed to equal since. Enter Federico Zampaglione, cat-like femme fatale Claudio Gerini and future horror icon Nuot Arquint in a trippy and highly erotic sex and death adventure, accompanied by moody neo-noir cinematography and a score that rivals Simonetti and the Goblins at their very best. Clunky plot points and expositional dialogue aside, TULPA is a must see for any horror fan worth their weight in salt. 8 stars....","user":"dekalog666","rank":[11,16]},{"title":"Pretty vicious and bloody Italian neo-giallo.","rating":7,"date":"14 February 2015","review":"Claudia Gerini plays Lisa Boeri,a successful business woman who is also a member of an exclusive club in which people are having sex with multiple partners in order to reach a higher level of consciousness.But people with whom Lisa had sexual encounters begin to die viciously murdered by a killer dressed in black.It's up for Lisa to track the killer down.Federico Zampaglione's \"Tulpa - Perdizioni Mortali\" is a pretty vicious and bloody Italian neo-giallo scripted by Dardano Sacchetti.The film has some obvious references to Dario Argento's \"Tenebre\" or \"Inferno\" and Sergio Martino's early 70's gialli.The killings are stylish and brutal and there is plenty of sex and nudity.Unfortunately there are some dull scenes and the dialogue is horrible at times.7 hungry rats out of 10.","user":"HumanoidOfFlesh","rank":[6,8]}]