[{"title":"Awful Acting","rating":1,"date":"10 September 2015","review":"The idea the film attempted to portray could easily make a good film, and may well have been the basis for the 2014 film the Giver. Unfortunately, it was executed very poorly. The acting punctuated the overall lack of talent of direction. The production value of the film was OK, the camera quality was decent however there were several scenes where the audio sounded a bit like a high school project, when combined with the music it was nearly impossible to here the dialog, which may not have been a bad thing.<br><br>All in all I think the Giver took the idea of this film and added all of the missing pieces to make a good film, that being said there is a clear budget difference.<br><br>I am sad to say that this film is not watchable due to the acting and direction quality. I can not recommend it though the idea behind it was good.","user":"brandon-198-374558","rank":[13,19]},{"title":"Dystopian Fiction for Collar Poppers","rating":4,"date":"15 June 2017","review":"\"New World OrdeRx\"<br><br>In the near future, a secret community in America is experimented on with repressive drugs by an authoritarian corporation.<br><br>In defense of the dub I just watched, I think this film takes on a far more sinister vibe in German. The voice actors bring real life to the roles and the authoritarian parallels add a sense of dread surrealism I can only imagine is completely missing in the original English version.<br><br>This film begins well and establishes a sense of dreamy despair in its first act through scenes portraying subverted iconic American imagery and a hopelessly medicated population. <br><br>However it loses it's tonal focus in the middle, where interestingly enough the movie includes scenes of what may be the first extant examples of a new sub-genre of Speculative Fiction: The Bro-topia. <br><br>In fact, the second act is populated with scenes of Bro-ing out at campfire parties, drinking from red solo cups, and even includes a cheerful deprogramming montage set to an original soundtrack in the style of a John Mayer or Dave Mathews album. All that is missing is a full on game of Beer-Pong. So, as you can imagine this is as real as it gets.<br><br>Still after all it had going for it \"New World Order X - Das Ende der Menschheit\" really struggled to come together at the end where the film takes on the appearance of being shot in the producer's backyard and where the plot's coherence and the villain's motives just completely unravel.<br><br>As a subdued entry into the genre that establishes its own quirky territory and because of it's strong opening, there is enough here to bemuse the curiosity of Dystopian film collectors but others may find this Rx hard to swallow. All said and done the director was savvy in creating a Futuristic Dystopia for College Bros, an under tapped market for Sci-Fi, its just that the completed film is nowhere near as fascinating as that sounds on paper.","user":"beingandtimefilm","rank":[1,1]},{"title":"Makes one consider","rating":8,"date":"11 May 2013","review":"The film overall covers a wide range of possibilities that this country as a whole could face. I think it tries to answer an age-old question regarding how fulfilled would our lives be without pain? One can argue the benefit of not having to deal with everyday occurrences which cause people pain, but from the outside looking in, it seems so empty. in the \"world\" of Cheery Point...people seem content in their simplicity. It almost seems like a Pandora's box being opened when exposed to emotions. Even the lead character seems to regret at times these newfound feelings. The film flows well.When I saw the film the first time, it was hard to determine what parts were \"flashbacks\" from characters lives, and what was present tense. The second viewing, there were titles showing that they indeed were from the past.In our own reality, it seems very plausible that what takes place in Cheery Point, could in fact happen anywhere in our world. The soundtrack is very fitting for the piece, even though it tends to make the film drag on as a series of music video's, but they are used to show a lot of action and events that help further the story along. The end of the film leaves people puzzled as to the perpetual \"what next\"? I must encourage any viewer to watch the film past the credits, as there is a scene that ties things all together and clarifies some of the questions that are left at the end of the film. I'm not sure if that would serve it better to be shown before the final credits, as many people leave during the credits and miss this scene. I know there are quite a few films that operate in this fashion, so I suppose to each his own. This film is well worth watching, and I'm glad I had the opportunity to see it twice. The Acting =B The Score= A- Visual aspect= A Well done. Before seeing this film, as yourself one question. Is any pain worth the joy you feel? Take everything to the extreme...life is worth living.","user":"artistic_vagabond","rank":[11,33]}]