[{"title":"Dark and gritty, but also trapped by shallow unrealistic delivery.","rating":6,"date":"6 June 2015","review":"There's always a niche appeal for submarine stories. The very concept promises many characters sharing a mutual predicament while confined in the depths. Black Sea offers decent psychological thriller with its good set-up and claustrophobic cinematography, but the personalities often do stupid things just for the sake of drama. One must wonder if the problems here could've been resolved with proper human interactions, such as conversations without violence undertone or not resorting to outright violence on a whim.<br><br>Robinson (Jude Law) is recently fired from his job. Disgruntled and very keen on making money, he jumps at the first opportunity of big pay. The gig is to recover sunken World War II submarine which allegedly contains heaps of gold. Thus, he assembles his team of merry misfits and dives for the riches. His whole team consists of either inexperienced or slightly mad crew.<br><br>Cue the crazy debacle where someone gets randomly stabbed or a few misclicks cause the submarine to nose dive, and the operation sinks faster than the submarine itself. Everyone is aggressive every time, there's barely any human interaction which doesn't lead in heated argument. I'm not an expert but surely when placed in crucial condition as submerged with actual chance of dying, one might need to cooperate instead of constantly picking a fight.<br><br>The visual is fitting for the theme, mostly shot in typical small corridor or halls, it is meant to be claustrophobic. The acting isn't half bad, Jude Law does his best though the accent is a bit jarring. It takes advantage of the premise well, and produces occasional morale ambiguity for gritty effect. A couple of the twists are decent in creating more dilemmas to elevate the tension, excluding the rest which are the results of tragic human error.<br><br>Black Sea is true to the deep nature of submarine film, sometime suspenseful and engaging, though most of the personality clashes are ridiculously forced.","user":"quincytheodore","rank":[17,17]},{"title":"Technical issues galore!!!","rating":3,"date":"27 February 2019","review":"Why is it so hard for various producers to create storylines that even remotely pass muster of believability?<br><br>Sure, we'll just hop in a \"vintage\" Soviet submarine, that's been sitting around for however many decades, and off we go! No fuel polishing, taking on fresh fuel, servicing systems, batteries, etc- nope we're just going to grab some food and go!<br><br>How many times can we crash said vintage submarine and it not suffer structural damage/ implode?<br><br>Escaping in an \"escape suit\" (which looks like a red Tyvek painter's suit) from ~300 meters depth? Sure, why not! (the pressure from equalizing the tubes would kill you in 2 seconds)<br><br>\"Sonar\" with no pings but a dude can create a 3D map of the surrounding area via banging on the hull?<br><br>Speaking of sonar, if anyone thinks it's possible to just slither around underwater in a submarine without various Navies realizing that you're there, it just doesn't work that way.<br><br>My absolute favorite though, is the \"driveshaft\" mumbo jumbo. First of all, ships/ submarines don't have \"driveshafts,\" they have \"propeller shafts.\" I used the plural of the word \"shaft\" since the Russians have favored twin screw designs for their subs, and all of the exterior scenes in the movie show a twin screw vessel.<br><br>Diesel/ electric subs are exactly that. The diesels (again, more than one) turn generators which produce power to charge the batteries. The screws are turned by DC electric motors. They can either run continuously while surfaced, or within periscope depth (where the snorkel allows for engine and cabin air exchange and also hydrogen gas venting from battery charging). When submerged deeper than this, they secure the diesel engines, and everything draws off the batteries (including the propulsion motors). The norm was to run surfaced at night to charge the batteries, and submerged during the day. During combat, they could conserve power and remain submerged for, at most, a few days.<br><br>Back to the \"driveshaft.\" Steel shafts don't \"shatter\" during a fire (especially ones there are 5\" - 8\" thick, which is what they'd be). What's far more comical to anyone who knows anything about mechanical things, is that what's pictured is a crankshaft from a car sized engine. The auxiliary generator engines on a vessel like that have a crankshaft that weighs over 1000 pounds. The main diesel engine cranks weigh several thousand pounds.<br><br>A propshaft for a vessel the size of a submarine is also several thousand pounds.<br><br>Even if we ignore the nomenclature, and substitute \"prop shaft\" for \"driveshaft,\" there would be two of them (one for each screw). So, even if one \"shattered,\" they can limp along on a single screw.<br><br>\"Oh, we'll just machine it to make it fit.\" Sorry, but you can't \"just machine\" a BMW crank and make it fit into a Honda motor!<br><br>I seriously laughed out lout at the scene that shows the \"driveshaft\" spinning away with the throws (which are what the rods attach to in a piston engine) connected to nothing. Oh, the sparks flying were a nice touch too.<br><br>I get that this isn't a documentary, but is it really THAT difficult to keep things remotely within reason?","user":"patrickelee","rank":[14,15]},{"title":"Black Sea","rating":9,"date":"11 February 2015","review":"As a former submarine sailor I watch every submarine picture that is exhibited. None are exactly as it was or is. Most are a lot of fun to watch. This movie was very good as it entertained and kept you on the edge of your seat. This is a good escape from all the movies that are all explosions, blood and gore, fantasy, and vampire trash. This has a believable storyline even if the FX are a little unbelievable. You should watch this movie and enjoy it. Jude law is surprising in the role of the Capt. and is a great deal different than previous movie roles for him. The clash of personalities adds to the excitement through danger and mechanical malfunctions.","user":"funkb","rank":[111,144]}]