[{"title":"A Most Enjoyable Film Which Endlessly Pulls at the Corners of Your Face","rating":10,"date":"7 April 2018","review":"Who would have thought that the sequel to a much-loved classic would, in my opinion, turn into such a stand-alone powerhouse!?!<br><br>Jumanji Welcome to the Jungle, does just that. <br><br>Not only is it a virtual non-stop ride of hilarity and laugh-out-loud moments, and it is, but the chemistry among the adult cast members is practically flawless and lends to the easy banter and overflowing, genius, COMEDIC DIALOGUE which just SHINES. Every look, every gesture, every note from The Rock, Kevin Hart and Jack Black are perfection in that at no time do you doubt they are who they are supposed to be. Karen Gillan is adorable and gorgeous at the same time. The obvious fun they are having, despite what I imagine to be uncomfortable filming locales, is palpable, and as an audience member, _if you allow yourself to be_, you WILL be swept up and transported by it.<br><br>So, why ANY low ratings?<br><br>While the first Jumanji was 'fun', underneath the fun, there were dark layers. There is none of that here and perhaps, this is where some of the disconnect from its detractors comes from. Unlike the original Jumanji, Jumanji Welcome to the Jungle is a fun, and funny, film throughout. <br><br>In closing, quite to the contrary of what a couple of reviewers are saying about Robin Williams, such as: 'he'd be rolling over in his grave (over this movie)', Robin Williams was one of those rare and amazingly special individuals who found joy and humor in most everything, and who chose to share that with those of us who are lucky enough to be witness to some of the favorites he left behind. Personally, I find it in very bad taste and verging on offensive, that those who seem to not share the capacity to laugh or live the way he did, or the ability to laugh with the rest of us, and who lack the gift of both being able to give or receive the very humor which exuded from Mr. Williams, would dare say he would be doing anything other than laughing riotously while munching on some popcorn and watching this film.<br><br>Thank you, Robin Williams, for the precursor which was so fantastic, it brought about an equally wonderful sequel.<br><br>You are missed.","user":"Her-Excellency","rank":[291,377]},{"title":"No idea why it took me 2 years to watch it","rating":8,"date":"23 November 2019","review":"It's good. I had no idea what to expect in all honest. I am not huge fans of other movies by these actors, but this really worked. You could see the great chemistry between them all and it paid off.<br><br>What I liked: I enjoyed how it didn't dither about at the beginning and got right into the action. Jack Black especially was brilliant and hilarious! All the actors/actresses were great but Jack Black stood out. Good mix of action and comedy throughout. I was on the edge of my seat (metaphorically) wanting them to escape the game.<br><br>Negatives: not many to be honest, couple of scenes were slightly cringe, but not off putting. Same logic goes for a couple of scenes which felt dragged out.<br><br>I think people need to forget about this being a remake of a classic film and treat it as a separate movie altogether. If you start comparing the 2 that's when it goes wrong.<br><br>Ps.. Karen Gillan. Marry me please?<br><br>Worth watching and will be going cinema for 2nd instalment.","user":"danielmanson","rank":[23,27]},{"title":"You're Going to Need a SEATBELT","rating":10,"date":"8 April 2018","review":"I used to have an IMDB account when I was a teen - or at least thought I did, but couldn't log on. In any case, I think I've visited here maybe twice in the last five years. Today though, after just getting back from watching this with my almost-grown kids, I had to make an account just to leave this review.<br><br>To begin, I'll never understand people. I can't believe the negative reviews. How could anyone not have laughed like hell while watching this and still have a pulse? I didn't go in expecting much, but I came out with a smile on my face. The girl is hot, Jack Black \"owns it\", I've never been overly enthused about Kevin Hart, but he was fantastic. and The Rock just knocked it out of the park. <br><br>I saw one review which reads: \"not a wrestling fan ever so to see 'the rock' in movies, instantly puts me off!\" Does anyone else want to vomit at the inanity, irony and ludicrousness of that statement? Then you have the user who out of 40+ titles he/she has reviewed in the past has only ever rated TWO above three stars. Seriously, if you don't enjoy films and find them so terrible, find a new hobby already. You've got one guy saying the shirt one of the kids wore was outdated. So, I'm guessing one can only wear clothing depicting the current year? Then you have the reviewers who maybe didn't understand the dialogue since they can barely communicate correctly themselves (such gems - I kid you not - as: 'averege'; 'what so ever'; 'family fair' (fare); 'are just wasn't'; 'due to it has'; 'all of there' {their); 'coz it is boring story'; 'no compare with'). Finally, you have the maybe half dozen reviewers who are so caught up in their bigotry that they can't relax and enjoy a film if it isn't whitewashed and who complain about the \"Hollywood liberal agenda of diversity\". Leave the politics at the door, man.\nIn short, Jumanji Welcome to the Jungle was a fantastic hour or more of rip-riding fun and laughs.<br><br>Except for one very funny moment, Dwayne Johnson retires his wrestling persona for this film and instead, provides a smoldering and intense performance, riddled with good-natured hilarity as the lead in this film. Gillan was great in Doctor Who, and although I thought she was the weakest of both characters and actors in this film, she still held her own and looked fantastic doing so. She has one of those faces you can't help but love. Kevin Hart was fantastic as the diminutive valet and looking back, I think he was somehow involved in every funny moment in which I laughed the hardest. Finally, the master, the maestro (though I never really was a fan prior to this), Jack Black plays the teen beauty queen with 100% commitment and to perfection.<br><br>10/10 and definitely a film I will be purchasing right after I click \"Submit\". You can never have enough laughter in life, and Jumanji, Welcome to the Jungle delivers barrels-full.","user":"ThmellyAthole","rank":[158,227]}]