[{"title":"Surprisingly Good","rating":8,"date":"13 June 2014","review":"Saw At Dances With Films and never spent so much time thinking of a film There is no doubt, this is an amazing combination of film meets movie and art meets commerce. It is no ordinary movie. The mood and stories and characters keep building, and when it finally comes down, I feel this immense sense of relief and wonder at how Erik Peter Carlson was able to come up with something so clever and intertwining and wondrous, and was able to pull it off. The cast, as you have probably read, is superb. I have never been so impressed. This film has \"restored my faith in the film making industry. To see these actors, crew, and the writer/director/genius at work is inspiring.\" These people obviously love their craft.<br><br>The soundtrack, oh, the soundtrack. When listening to the songs, I can picture each exact moment as if I was watching the movie all over again, and it brings unexplainable feeling. Daily Bread and Gliss' songs, especially, are a perfect fit to a perfect story and mood. If you want to see glorious film making, acting, writing, and characters in action, I HIGHLY suggest you see The Toy Soldiers.","user":"johntomccarty","rank":[13,30]},{"title":"The Youth of This Sick Country","rating":13,"date":"13 June 2014","review":"Erik Peter Carlson has broken the boundaries with this film. It is one of the realist depictions of our countries' youth. I never once saw this as a shock film, I saw honesty and truth behind every scene. This is really what is happening in our backyards. Kids are not as young as they used to be, and are growing up in a world with more possibilities and distractions than ever before. This is the modern world, and these are the newest leaders. <br><br>While this is not what happens with all of our youth, it does paint a beautiful picture of just a handful. This is happening all over this country. In the wealthy, poor, and everything in- between, our children are experimenting without any form of education or realization of their actions. <br><br>This is better and more honest than any reality program out there and it may scare the daylights out of you. This is our world, we must change it. F**king brilliant. Want to see it again.","user":"FarandFewBetween","rank":[12,35]},{"title":"Gem of a movie","rating":8,"date":"11 December 2014","review":"Once the movie Toy Soldiers marches into your life, it will never march out. It was meant for Erik Peter Carlson to take the journey, and bring this movie to life. The casting choice for Toy Soldiers was excellent. The movie has fresh new faces of young actors and actresses, playing alongside a few seasoned veterans of the business. Together, they portray the rawness and pure emotional characters of teenagers, family and friends, during one particular evening in the 1980s. The movie immensely captivates as you sink into the midst of the story and you can sense with vigor the emotional wounds of the teenagers and their families, the distress, the sadness, the hope and the love. There are no illusions in this movie, as it plays out in depth what happens that one destined evening translating the good and bad encountered by the cast onto the big screen. This movie definitely is worthy of repetitive viewing. I applaud Erik Peter Carlson and the cast of Toy Soldiers on a journey well-traveled together in order to bring about this wonderful original gem for movie fans.","user":"hetty007","rank":[7,26]}]