[{"title":"Masterpiece","rating":10,"date":"27 September 2017","review":"I have never seen a movie handle a plot and its characters with such grace and authenticity. As I was watching this modern art piece by myself in my Grandfather's shed at 2:00 AM, I realized something. Life is a very fragile thing. We live and we die. Time will consume us and our lives in the blink of an eye. If there is a God, he forsake us long ago. I ponder on the very existence of God and myself in this world I live in. I scream into the shadows of my existence every night. No one hears me. God never answers. No one answers. I am a cog in the machine. An extra in the background. I am nothing. This movie is all I have. This movie gives me hope. This movie takes me to a world where I am valued. A world where God still loves us and cares for us. This film is proof that God exists. This faithful adaptation of the Shakespearean tragedy Macbeth will leave you in awe from start to finish. I believe that this movie can be a catalyst for the World's issues. All the conflicts we have, all the anger and violence can be stopped with this film. Please for all that is holy, watch this film and enter a world that we as people belong in.","user":"gavino-59335","rank":[12,17]},{"title":"Mediocre and Offensive","rating":2,"date":"21 December 2016","review":"This is your typical lazy kiddie fare that puts a bunch of animals on screen and makes them do people stuff. That's really not enough by itself to make something funny. This goes beyond being forgettable by further assuming you can engage in rampant stereotyping simply by making the characters dogs. I don't enjoy this depiction of Mexican culture, created by white people for a white audience. It's really on the nose that the fancy lady chihuahua is a white chihuahua. The movie makes it like Papi is some kind of hero for booking a mariachi band, instead of a DJ or a reggaeton act. But it's just him doing another Mexican thing in a Mexican way, and it all gets very tiresome. Meanwhile, the human Hispanic man has this pointless subplot about trying to impress the big boss with his landscaping and his hard work ethic. Sigh. <br><br>Another criticism is that it depicts Papi as the only character whose decisions carry consequences. He gets to be the big hero. He dotes on but also dictates to his daughter. Somehow this incredibly retrograde view of fatherhood gets a pass because, again, the characters are dogs.<br><br>The problem I see with these huge stereotypes is that it's aimed at kids, who in turn will back up problematic racial and gender stereotypes. The only character I found really amusing was the pug, who despite still being rather stereotypical himself, at least had some charm and talked in a vaguely sensible way about things that were going on. He was an oasis of wit and sense in a movie fully of corny lines and nonsense. <br><br>It's not completely without redeeming features. The plot, tired as it is, is probably enough for young viewers, resolves efficiently. The comedy-of-errors side plots similarly get us from point A to point B without much fuss.<br><br>My kids watch this movie over and over again. I guess it's fairly entertaining for them. But as a parent I strongly dislike it. It's empty candy that leans on creaky old stereotypes for humor value. Don't let your kids watch this. Please, just don't.","user":"pawsplay","rank":[3,9]},{"title":"Boring","rating":2,"date":"6 February 2018","review":"This is simply a hard to watch movie. It seemed like forever having to sit through this garbage. Maybe I'm being too hard on a kids movie, but there are great enjoyable kids movies and this is far from being one of them. One criticism I have for this movie is that it tries too hard to be Mexican. The fact that Papi had to chose the mariachi band just bothered me. There isn't much going for this movie at all","user":"dgillis-61398","rank":[0,2]}]