[{"title":"Would probably have worked better taking a more dramatic approach","rating":5,"date":"19 February 2016","review":"I went in to this movie not really thinking it would be all great, Jennifer Carpenter (from TV's Dexter) was the swing-vote why I decided to go ahead with it.<br><br>However she was not really why I kept interest, cause frankly she wasn't that great in this one.<br><br>Luckily the other cast was slightly better, no Academy award winning performances or anything but decent enough.<br><br>I went in to it thinking it would be a horror, and even though the beginning of the movie does fall in line with that and there are horror elements that pop out from time to time in the movie I'd say it's first and foremost a drama.<br><br>And even though the horror segments are neatly orchestrated it often just don't feel like it's from the same movie sometimes, characters who at one point are shook up can in the next minute be going on their business like nothing happened, so yeah uneven direction for sure.<br><br>It's almost as if someone wrote a somewhat realistic day to day script what life in a cult would be like and then some big shots told someone else to re-write it to a horror instead so they just cut and pasted some horror segments into the script where it could fit.<br><br>And the ending is pretty awful.<br><br>5/10","user":"Seth_Rogue_One","rank":[14,15]},{"title":"A surprisingly good horror movie that deals with one of the scariest things of all, evil done in the name of God.","rating":7,"date":"5 November 2014","review":"\"6 girls born on the 6th day of the 6th month. Their 18th birthday is approaching. 1 will emerge.\" When the 18th birthday of the daughters of Jacob Brown (Sewell) and others in a quaint Amish town approaches things become uneasy. One of the town's leaders and elder Beacon (Meaney) recounts a prophecy about the devil coming to the village. He fears that these girls are the reason for the happenings and begins to do anything he can to stop the prophecy from coming true. The girls on the other hand have a different story to tell. Going in I was expecting yet another cheesy low budget horror movie. I was surprised at how much I liked this. Without trying to start something I do think that religion in the hands of the wrong people is very dangerous and this movie is an example of why I feel that way. The best part of the movie though is that it stays one step ahead of you and you never really feel comfortable with what you are seeing. That is the sign of a good movie to me, one that keeps you guessing at the same time you are becoming angry at what you are seeing. Overall, a surprisingly good horror movie that deals with one of the scariest things of all, evil done in the name of God. I give this a B+.","user":"cosmo_tiger","rank":[27,40]},{"title":"The Ending Ruined Whatever Potential There Was For This Movie","rating":2,"date":"24 July 2015","review":"OK. It wasn't horrible. That's meant as a compliment because I was pretty much expecting it to be horrible. Now, I'm not saying it was wonderful, or good or anything like that. Let's not get crazy. It's a weak horror movie with a silly story. Six girls are born on the sixth day of the sixth month in some type of isolated religious community called New Bethlehem - a community led by (or lorded over by) Elder Beacon, played by Colm Meaney, who was certainly the most recognizable face in this. Beacon prophesies that one of them will turn out to be the devil incarnate, and which one it is will be the only one left by the time the girls turn 18. Sure enough, as their 18th birthday approaches, the girls begin to disappear. What's happening? Is the prophecy real? Is the devil really working through one of these girls? Or is Beacon the true evil one?<br><br>It's watchable pretty much all the way through. But in the end, it disappoints. As long as you believe that Beacon is evil and responsible for everything, then you actually have not just a cheap sort of horror movie, but an actually believable (in an exaggerated sort of way) look at the potential dangers of these isolated religious communities whose lives revolve around the decisions of a single charismatic leader, whose hold on the community is so strong that he can do pretty much whatever he wants. Meaney was good in the role. He took it seriously and seemed to capture the inner workings of Beacon. This would have been OK - not great, but OK - if that had been the outcome of the movie: a community that eventually rebels against an evil demagogue. But, alas, that wasn't the decision. <br><br>It had to end on a supernatural note. I won't go into much detail. I don't want to spoil the twist too much - but Beacon (evil, religious, charismatic demagogue though he was) really wasn't responsible. He actually turned out to be right! The devil was responsible - and he wasn't the one the devil was working through! That threw me. Disappointed me. Discombobulated me. Upset me. How else can I put it? The end took a movie that I had been prepared to promote to a few degrees above silly (because I thought it really had offered a decent look at the potential abuses in such a community) and it just became silly again. And that's the thought that lingers in my mind after watching this. Too bad. There was potential for better. (2/10)","user":"sddavis63","rank":[11,15]}]