[{"title":"Where did you come from?!","rating":10,"date":"20 January 2013","review":"Okay, I consider myself a pretty good Halo fan. I have played through all of the games numerous times, and read every Halo book that has been released. I was walking through Walmart's electronics department about a month ago, and I see a Halo movie. What? A Halo movie? Let me take a closer look. Oh great, its a live action Halo movie that I have never heard of, this is going to be terrible.......but its only $14 on BluRay so what the heck. Then I get home (with the kids at daycare) and start watching it on my 42\" TV. OH MY GOD. The movie is brimming with great character development, and morality themes regarding the human rebellions before the covenant attack. The main characters (which are cadets at a UNSC Military Acadamy) are all new faces, except the lead female who is the girl from Narnia. They all do a great job convincing me that they are the children of the highest echelon of the UNSC elite, who are trying to make their parents proud. Some people claim that them movie is a little slow at first, or that it parallels Starship Troopers. I do not agree with those claims. The movie thoroughly develops and introduces the characters, so when the covenant (and Master Chief) arrive, you are vested in them, and don't want them to die. By the way, the Covenant were done fantastically, and Master Chief is NOT CGI, but instead the most realistic and amazing armor outfit every constructed. Bottome line, if you like anything about Halo, or if you plan on playing Halo 4, see this movie. Thank you 343 studios for coming out of left field and blowing me away with this movie. I just wish I could have seen it in the theater!!!","user":"meestabeck-586-169733","rank":[62,80]},{"title":"This Is How The Halo Movie Should Be Made","rating":10,"date":"5 October 2012","review":"A few months ago when the first trailer came out for the web series, \"Forward Unto Dawn\", I was beside myself with excitement. I watched the trailer an easy 5-10 times, and then periodically checked back to view it again, in case I missed something the first time around. I've been a fan of the Halo series since day one of Halo C.E., and it's been really disappointing to not have a Halo movie I can feel proud of. Since high school, I've followed the hype surrounding the script writing and screenplay mock-ups of a potential Halo film, but they never panned out into anything real. Then, Microsoft and 343 Industries teamed up to create Forward Unto Dawn, and the hype surrounding a Halo movie returned. Only this time it wasn't going to be a movie, but a web series instead. And when it debuted on October 5th, I was one of the few to see it when it was only at 5k views(hipster moment). It was everything I expected and more. Superb acting, gorgeous visuals, a beautiful soundtrack, and the promise to deliver more and more in future episodes. Friday has always been my favorite day of the week, but now I have a reason to love it. Each episode debuts on a Friday, which means all my calls will be held, pizza will be delivered to my couch, and nothing is more important than those 20 minutes of Halo action. No feature length movie just yet? Well, this is the next best thing. If you call yourself a fan of the game, you...will...watch...this. Oh, and before I forget...Axios!!","user":"zack_wall","rank":[138,197]},{"title":"If you don't play Halo, you should still watch this film.","rating":20,"date":"20 December 2012","review":"The year is 2525 and the UNSC is at war with terrorists know as Insurrectionists. Thomas Lasky, a freshman cadet, is unsure about this war and his combat capabilities, but when the Covenant invades, he learns what it takes to be a hero from spartan John-117 (aka Master Chief).<br><br>This was an awesome film/mini series. Pretty good cast of characters, the actors weren't people I've heard of, but they were still good, cool special effects, and of course the music was great.<br><br>I think anyone, whether they are Halo fans or not, will like or love this film/mini series. One more thing: as a lot of people know, most games that are turned into movies are bad, but after watching this, I have faith in an actual Halo movie being made and it being great. All they have to do is do what they did here.","user":"joenasc","rank":[39,54]}]