[{"title":"So funny and amazing","rating":7,"date":"23 February 2020","review":"Not quite as good as Kung Fu Panda 2 since it does rehash some plot elements from Kung Fu Panda 2, but Kung Fu Panda 3 is still a solid entry in this kung fu fighting franchise.","user":"MR_Heraclius","rank":[39,40]},{"title":"From complexity to oversimplification: the journey is complete","rating":6,"date":"13 June 2016","review":"As a certain character once said, a James Bond movie is only as good as the villain. The same rule actually applies to just about any story with some kind of confrontation, with the best of such stories having villains which you even want to relate to.<br><br>Kung Fu Panda trilogy is no exception. One of the reasons behind the first film's excellence was Tai Lung, a character so intense, conflicted and deeply rooted in the history of the KFP universe, that his story managed to combine the vibes of two great confrontations: Obi-Wan vs Darth Vader and Darth Vader vs Luke. So it's no wonder that my greatest wish for every next KFP movie was to have him back somehow. Those vain hopes...<br><br>The villain's complexity became the foundation on which the rest of the story could develop. Including the main character. First film's Po was so great because he was a classic \"loser with a dream\" type of character: confined in his bleak reality but refusing to accept his destiny. Po's power was in finally letting himself pursue the dream he's been having on his own for so long, and in how a true dream can overcome any obstacle in its way.<br><br>The problems began when Po was raised to the supreme position. It's where the pursuit of a dream was replaced with a job. Po is not a leader, he's not even a hero, he's just a guy who does what he can because his heart tells him so. But letting him keep that spirit would mean losing pace for the franchise. So each next film was basically creating a new villain out of thin air (or, in this film's case, from the other world, literally) and imposing the duty of defeating him on Po, using it as a justification for granting him another magic ability.<br><br>The gods are what we create ourselves. And, at the end of the day, KFP3 finished creating a cult of the Dragon Warrior by transforming Po from a goofus with a heart and spirit into some kind of omnipotent golden Buddha, smiling and just-be-yourself-preaching. The complexity is gone, the humanity, with all its inherent flaws, is gone. The only thing that's left is the divine perfection and invulnerability. Maybe the kids will love such glossy happy ending, just like they love playing video games in god mode: easy win, plain and simple. But for someone more mature, that kind of easy is just boring.","user":"Semisonic","rank":[47,65]},{"title":"A Quality Family Film For All Families.","rating":10,"date":"14 February 2016","review":"In the Chinese Spirit Realm, Grand Master Oogway (Randall Duk Kim) fights against the spirit warrior and collector Kai (J. K. Simmons) and has his chi stolen, but not before he warns Kai that Po (Jack Black), the Dragon Warrior, will stop him. Kai disregards this and returns to the mortal world. Meanwhile, Master Shifu (Dustin Hoffman) announces his retirement and passes the role of teacher to Po. He discovers that teaching kung fu is hard, as the Furious Five members Tigress (Angelina Jolie), Crane (David Cross), Mantis (Seth Rogen), Viper (Lucy Liu), and Monkey (Jackie Chan) are injured as a result. Po is demoralized as a teacher, but is advised by Master Shifu to be himself.<br><br>Po heads home to his adoptive father Mr. Ping (James Hong) at his noodle shop where a panda named Li Shan (Bryan Cranston) breaks Po's dumpling-eating record. They both soon learn that Li is Po's biological father and they bond with each other much to Ping's jealousy. After introducing Li to Shifu and his friends, the Valley of Peace is suddenly attacked by past Kung Fu Masters turned into jade statues under the control of Kai. The team then learn through research that Kai was Grand Master Oogway's old friend who fought with him long ago, but was banished to the spirit realm for 500 years when he grew thirsty for the power of chi. Kai can only be defeated by a master of true chi, which they discover was an innate ability of the panda colonies. Po, at Li's suggestion, along with Mr. Ping, travels to the secret village where the pandas hide while Shifu and the Furious Five stay behind to investigate Kai's movements and defend the Palace. Although Po is eager to learn chi, he first learns the life of a panda in the village, which he feels grateful to be a part of.<br><br>After learning that all the Kung Fu masters are missing, Master Shifu sends Crane and Mantis to find them. Crane and Mantis join with other Kung Fu masters to confront Kai, but they all have their chi stolen. Kai then arrives at the Jade Palace and destroys it, then takes everybody's chi while Tigress escaped to find Po and warns him of the upcoming danger. Afraid, Li and the pandas prepare to run away. When Po demands that his father teaches him chi, he reveals that they had all forgotten chi, and he only wanted to save Po from Kai's wrath. Hurt over his father's misdirection, Po isolates himself and trains vigorously to confront Kai. Mr. Ping then comforts Li and admits he was initially worried Po would be taken away from him, but came to realize that Li being a part of Po's life simply added to his happiness, and that they should stay by Po's side as family.<br><br>Tigress confronts Po and tells him that he cannot defeat Kai without continuing to discover the secret of chi, during which Po confesses that the experience has him once more doubting his potential. Li and the villagers, having decided to stay, ask Po to train them so they can fight back. Po agrees and teaches them using their everyday activities as their assets and begins their plan to save their village. Kai arrives and sends his minions to capture Po, but they are held off by the pandas and Tigress, distracting Kai. The plan works, but ultimately fails when Po tries to use the Wuxi Finger hold on Kai, who reveals that it won't work on spirits. Kai gains the upper hand in their fight, but in a last-ditch effort, Po uses the Wuxi Finger Hold on himself while grabbing onto Kai, sending them both to the spirit realm. They fight again, but Kai defeats Po and prepares to steal his chi. Using what they learned from Po and about who they are, Li, Tigress, Mr. Ping and the pandas are able to use their chi to save him. Po, with the chi flow, suddenly generates a golden dragon-shaped avatar around him and destroys Kai by overloading him with his chi, freeing all of the Kung Fu masters in the process.<br><br>In an ethereal golden pond, Grand Master Oogway appears to Po, and informs him his journey has come full circle, revealing his role by selecting Po as Dragon Warrior is also because of his descent from the ancient pandas, and his embodiment of the yin-yang. He also reveals his role in alerting Li of Po's survival, and expresses his happiness to Po about how much he has grown. By choice, Po wields a mystic green staff bestowed by Oogway to return to the mortal world. Everyone returns to the Jade Palace, where Po proudly gazes upon his family, friends, and legacy in the spot where his journey began.","user":"HealthyLove","rank":[85,125]}]