[{"title":"Total garbage","rating":2,"date":"8 April 2015","review":"After seeing the first movie of White Collar Hooligan I already knew it wasn't going to be about football hooligans at all. I'm fine with that because this time I knew about it. But if the first movie was okay to watch this one on the contrary is total garbage. It was really painful to watch. About everything in this movie is wrong. The story is so weak and predictable you are kind of glad you are not playing in that movie. I would have been so ashamed of myself if I was in that movie. This time there were two \"hooligan\" scenes and they were so bad I could not help myself laughing out loud. I heard there is a third movie about it. Well let me tell you that I for sure won't watch that one. What a waste of time.","user":"deloudelouvain","rank":[1,1]},{"title":"Pretty Average! 4/10","rating":4,"date":"4 August 2013","review":"Review: I thought that this storyline wasn't as good as the first movie, but they obviously had a bigger budget to play with because it was shot in different countries which is never cheap. The movie starts from the 1st movie in the franchise and it does a recap of everything that has happen since. It then goes a bit wishy washy and then its starts picking up and they cut out a lot of the unnecessary swearing which is not a good way to portray English movies. Anyway, I liked some of the wit from Simon Phillips but it still seems average.<br><br>Round-Up: No doubt, they will be releasing another movie in this franchise, which is actually not a bad idea because they might have enough money to make a half decent movie. They might need to reboot the franchise with a different leading character because his acting is way to stiff, but I don't that many people will be that bothered with people's performances. <br><br>I recommend this movie to people who were fans of the first movie. 4/10","user":"leonblackwood","rank":[2,5]},{"title":"Average","rating":2,"date":"12 December 2013","review":"OK, its better than the first one (which is appalling), i'm so intrigued as to why Simon Phillips is appearing in so many films with the same group of actors, its like a little clique, very odd! This film could be OK with better actors, the main guy Mike, is embarrassingly trying to be like Danny Dyer, in look, and in dialogue, the football hooligan who has only ever been to one match (in his expensive Slazenger cut off shorts) in 2 movies of this crap collection of 3.<br><br>Rita Ramnani is about the only good thing to come out of these group of actors, it seems they are making movies by the truckload, Simon Phillips has the irritating lisp, Peter Barrett is the ugly one with the gap in his teeth, they are responsible for the worst movie ever made in 'Alien Uprising' i hate these films with a passion, a passion which seems to drive me to watch them (sadistically), just to see how much worse they can get..","user":"richie_efc","rank":[1,3]}]