[{"title":"What a beautiful apocalypse","rating":9,"date":"5 May 2015","review":"Wow, I was taken by surprise with this one. What a beautiful film! This may well be the best apocalyptic film I have seen..<br><br>The film was loaded with great imagery and concepts from the very start... I believe it had its own unique take on the apocalypse which was terrifying and believable.. There is a great unique narration as the film progresses that lets you in on how little time is left..<br><br>The acting was superb from the two leads, even the child actress was fantastic.... The film made me think how important any meeting or bond can be between us humans regardless of time...<br><br>This film deserves your attention and to do well...<br><br>Overall: Beautiful. Add it to your watch list its one of the best films I've watched this year....","user":"Lambysalamby","rank":[29,32]},{"title":"Great film - Nathan Phillips and Angourie Rice are excellent","rating":4,"date":"4 August 2014","review":"Great film - tense, edgy, but human. Nathan Phillips and Angourie Rice are excellent - especially Angourie Rice - extraordinary acting for an 11 year old! The other two stand-outs are Sarah Snook, and the cameo by Lynnette Curran. In fact, the female casting is what makes the film so memorable - in other hands an end-of-days scenario like this could have been a parade of clichés for the young adult male market, but director Zac Hilditch draws us into a story that is bleak, yet sensitive and gripping without being addled by senseless action and effects. The cinematography and editing are also responsible for the film's great presence - beautifully shot by Bonnie Elliott and edited by Nick Meyers.","user":"JohnMannering1","rank":[55,64]},{"title":"Great Movie","rating":8,"date":"27 October 2014","review":"I have been downloading/renting movies for yrs and using these ratings to decide if I should invest in the bandwidth/Cost. Felt it was time to contribute as this movie was way above what I expected. I am a SCI Fi/End of the world/Zombie movie lover and this totally entertained and kept my attention beginning to end.<br><br>This move met all my expectations and I could not stop watching till the end. And was the reason for me to create the account and add the review.<br><br>I recommend it. And have a few tissues waiting... it sure jolted my heart in the end. I know... being a guy I am not supposed to cry :)<br><br>Go/rent... whatever.. it's worth it<br><br>Well done to all involved... great movie. 8/10","user":"waders","rank":[75,90]}]