[{"title":"All-Too-Familiar Story of Greed and Corruption","rating":8,"date":"8 September 2016","review":"Directed by Jodie Foster, \"Money Monster\" rehashes the cliché film dramatization of Wall Street fraud and the commonplace Americans who are the big losers in a tycoon's greed.<br><br>George Clooney and Julia Roberts have good chemistry as the star television talking head Lee Gates and his hard-working producer Patty Fenn. The simplistic story is that of a \"hostage drama\" when Gates is held captive in the studio by a crazed investor who has lost his fortune due to a Wall Street scammer and the advice given over the air by Gates. The plot unfolds with Gates and Fenn actually bonding with the terrorist to get to the bottom of malfeasance on the part of the CEO of a company called IBIS.<br><br>With the primary setting a television broadcast studio, this film might have worked better as a made-for-TV movie, as opposed to a feature film. Most of the action was predictable, and much of it was also unbelievable. The relationship of the young terrorist and his wife was entirely unconvincing. And the inaction on the part of the SWAT team, who had successfully surrounded the terrorist both in the studio and outdoors, was equally improbable.<br><br>In the end, \"Money Monster\" was a formula film that should not provide any surprises to viewers. The only cliché that was missing from the film was a slow crawl across the screen that reads, \"Based on a True Story.\"","user":"lavatch","rank":[19,23]},{"title":"Not realistic or worth watching....","rating":2,"date":"21 September 2016","review":"The premise of this movie could have been a lot better thought out and a lot more logical or realistic. For a George Clooney film, this should have been a lot better. Anyone with any common sense as far as the police handling a live hostage situation. As soon as the NYPD allowed the girlfriend to go on TV only to call him stupid, dumb, etc. I watched the movie in the background.<br><br>And the horrible humor parts of this movie, c'mon, it was so out in left field it just made this movie more of a joke, until you hear that the NYPD is planning to shoot the hostage in order to unarm a bomb vest and eh...don't waste your time.","user":"dryanmorr","rank":[36,52]},{"title":"Terrible","rating":2,"date":"25 August 2016","review":"SPOILER ALERT <br><br>I simply cannot believe the positive reviews on this movie. It was in a word....terrible. The theme was important-that the (financial) system is \"rigged\" and perhaps that was what attracted a big name like George Clooney to it. I think the only redeeming quality of the movie was George Clooneys acting, which he seems to do so effortlessly.<br><br>But the execution of this movie was laughable. There are simply too many ridiculous and non believable actions by humans in this movie to list here, and I've forgotten more ridiculous things than I have remembered. But, it ruined the movie.<br><br>First, the obvious one that has been mentioned before. There is simply NO WAY a producer would decide to keep a hostage taker live on the air like the way she did. The hostage taker was obviously an idiot with no understanding of the technicalities of a TV show production, and would have not known whether he was live on the air or not. The movie lost most of its credibility within a very short time after it began because of this.<br><br>A few things other things that I do remember were especially comical. The movie seemed to be written by someone who has ZERO understanding of the financial markets/investment industry. That would be OK, except that the whole movie was focused on this industry. The fact that the writers/director didn't care to do their homework is representative of the laziness and lack of detail that you see over and over again in this film. For instance, the term \"algo\" was used countless times with seemingly no understanding of what an algo does or its potential ability to move a stock price for an extended period of time (and none of the people who were supposedly in the investment industry seemed to know in the movie either). <br><br>So many math problems too! The hostage taker in the movie supposedly bought the stock of IBIS Pharma at $75/share (mentioned by Clooney), and the companys stock price during the hostage taking (after an \"algo attack\") dropped it $8/share where is was during the film. Clooney mentioned that the hostage taker lost 60% on the stock, but this would have been an almost 90% drop. The hostage taker said he \"lost $60K\" with the stock drop, and at a later time the detectives learned that the hostage taker had gotten $60K exactly from his mother which he put all in this stock. Well, he would have then lost 60% or 90% of the $60K right? And he only would have lost that money if he had actually sold the stock, but based on what happened in the movie (when Clooney was trying to get the public to buy the stock to make him whole again) he was still holding the stock. Also, Clooney said he wanted to \"triple\" the stock to make the hostage taker whole but really that would have only gotten the stock back into the $20's, far from where he he bought the stock at $75K. The lack of attention to detail drove this viewer crazy!<br><br>There was a mention in the movie that the company in the middle of the whole controversy \"had all of its pensions depleted\", as if the stock price of this specific company had any affect on the value of its pensions (which would be diversified in any corporation into bonds/stocks, etc, NOT invested solely in its own company stock!). Furthermore it seemed to be the case that IBIS's OWN algo was responsible was its stock price dipping 90%, as if IBIS would be in the business of controlling its own stock with an algo, which is highly illegal (and impossible for an extended period of time). No one in the industry seemed to think this was an usual thing. Later in the movie there was some Asian genius that appeared for a minute that seemed to know all about the algo, and made some seemingly profound statement like \"its just math\" and said there was no way an algo could be completely responsible for dropping a stock price 90% for an extended period of time. He said this as if 100% of the people in the investment industry would not have known this already.<br><br>You also had a hostage taker walking the streets of NY with a gun and a bomb and a hostage, and the NYPD seemed to think it was OK to allow pedestrians withing spitting distance from the man, and when the man opened fire on the crowd, the police said \"dont shoot\" (at the hostage taker)? Are you kidding me?<br><br>It was an F.","user":"tjberchou","rank":[65,101]}]