[{"title":"Mo' Moe.","rating":3,"date":"28 November 2015","review":"Oh boy, just what the horror world needed a lousy sequel to lousy 2009 slasher Bikini Girls On Ice. This one picks up where the last one left off, with wheezing maniac mechanic Moe (William Jarand) targeting a new group of girls: the performers of a burlesque show.<br><br>There are just two things that a film of this nature needs to deliver: hot girls, preferably unclothed, and creative kills with lots of gore. Although Pinup Dolls on Ice definitely delivers more nudity than its predecessor, the girls really aren't all that attractive (if I had paid to see them strip, I'd want my money back!), and the death scenes are extremely disappointing, special effects limited to some fake blood liberally splashed about, and a severed head in the film's closing moments.<br><br>Here's a run down of what you can expect if, like me, you decide to watch against your better judgement: a totally naked chick with a ridiculous trout pout and silicon breasts, an irritating slacker dude with long hair, a gratuitous shower scene, lots and lots of uninspired screaming and running and hiding in the dark, a spot of necrophilia, loads of poorly acted conversation between the irritating strippers, a predictable death for the cop (it's meant to be a surprise, but I saw it coming a mile away), a 'shock' final act in which the last survivor also dies (yawn), and an epilogue that promises a third movie which I'll still probably watch even though I know it'll be crap.<br><br>2.5 out of 10, rounded up to 3 for at least trying with the nekkidness.","user":"BA_Harrison","rank":[3,4]},{"title":"If you're a hardcore slasher fan... also just watch anything else..","rating":2,"date":"26 October 2015","review":"After watching this and reading a review by someone who compares this with great movies like \"High Tension\" and \"Wolf Creek\", it's obvious that that particular review had to be written by family of the director, his wife, his best friend, or something like that. \"Pin-up Dolls\" is a sequel to \"Bikini Girls on Ice\" (I'm certainly not going to watch that one..) and we have the same killer named \"Moe\" who growls the entire time and stalks a couple of strippers who in real life could even be strippers, but certainly no actors. Their performances are awful to watch, all the cardboard characters are painfully annoying, every second you hope they get killed right away. The dialogue is unintentionally funny and probably made up at the spot. <br><br>The story makes no sense at all, the girls have plenty of opportunity to run away but instead they stay and hide, or even walk into the arms of the killer, who's isn't menacing or even convincing. Help arrives in the form of the local sheriff: in this peril situation he's surprisingly calm and takes all the time in the world to explain the entire back-story to the girls. Knowing that the killer is out there, he just walks outside without any protection and gets killed..<br><br>Basically, it's a hard movie to sit through. It's even harder not to touch the \"fast-forward\" button, but besides the nudity (well, at least there's plenty of that but don't get too excited) the only reason why you keep on watching is because it's a slasher movie: so there has to be special effects and a couple of nice killings. Again, a big no-no: the FX are limited to screaming women covered in blood, blood spraying, blood on the walls and a couple of post-mortem wounds. Yep, the budget was very limited on this one. You're relieved when the credits finally roll, but also a little confused: there's no real ending, it just kind of stops and (here's where the real horror starts..) even leaves an open door for a sequel..! <br><br>Clearly inspired by classics like \"Friday the 13th\" - Parts 1 &amp; 2 in particular, you're better off watching those again instead of wasting 85 minutes here. Want something more recent, watch \"You're Next\".","user":"homecoming8","rank":[2,3]},{"title":"terrible","rating":1,"date":"13 November 2018","review":"Haven't enjoyed anything about it once again it's just really bad.","user":"amandajohnson-26038","rank":[1,1]}]