[{"title":"Perfect for kids but even better for adults","rating":10,"date":"20 October 2014","review":"First lets; clarify; I am not Mexican nor any in my family and friend group; however it has been a long long time since we catch kids movie able to captivate 5,6,7 or 8 year old girls and boy and the parents that took them. Just the quality, colors and artistry of the images; makes the movie worth; but the subject matter is even more impressive. How many times you were able to really laugh on a subject matter like death and make children (and adults) happy with an adventure that is pure entertainment but also gives a quite poetic look at life and dead. In brief; take your children to see it as an excuse; you probably will enjoy it even more. Forget PIXAR formula products; this is just a masterpiece","user":"abisio","rank":[95,120]},{"title":"Don't miss this special animated film!","rating":9,"date":"15 October 2014","review":"This is a beautiful animated film. Very unique in comparison to other animated films out there. I loved that it had funny parts - for adults as well as kids - but it isn't a silly comedy. It is a gorgeous, epic folkloric tale of family, tradition and finding your own way. I laughed and cried, and my kids loved it as much as I did. My kids (ages 3.5 and 5.5) both were entranced and never got bored or scared watching this film. For families: it wasn't scary at all. I worried maybe the \"skeleton\" painted Day of the Dead characters may be creepy but they weren't at all. The sets and characters were all very beautiful and unique. The Land of the Remembered was especially visually stunning. I found it especially touching as a parent of young kids with numerous generations in \"our village\" helping raise my kids and help carry each other through life's highs and lows. I was reminded by this film of the importance of all the generations that came before us - how we are shaped by our families. How we learn from and must respect those who came before us. That was a nice message for me and my kids. But, it also shows that, while we respect, learn from and inherit gifts from our fore-bearers, we also have a responsibility to be true to ourselves, to make our own way and find our true calling. It was also touchingly romantic. It felt very genuine and warm throughout but the sweet romantic story was especially touching. You could tell a lot of love went into making this film. I hope it does well - it should on its own merit!","user":"joey_cade","rank":[61,77]},{"title":"Life, Death and Love","rating":9,"date":"27 November 2014","review":"While I have to admit I'm not exactly the greatest Jorge R. Gutierrez fan (In fact, I strongly disliked his series \"El Tigre: The Adventures of Manny Rivera\") I found \"The Book of Life\" to be a pretty enjoyable flick, with very good animation (The art style of Jorge R. Gutierrez looks surprisingly good in the CGI format, with stylish designs and impressively detailed sceneries.) likable characters and a fun story which balances very well the comedy, romance and adventure.<br><br>The musical aspect was quite good too. Against what I was expecting, the use of modern songs was moderate, and each one of the musical moments this movie has serves in some way or another for the plot and character development, with more than effective results. This aspect, combined with all the other positive qualities this movie has serve to make it a very good animated film for the whole family.<br><br>There is too much to like about \"The Book of Life\". For me, it was definitely a pleasant surprise, and while I'm not entirely sure to consider this the best animated film of the year 2014, it is definitely a strong contender for that category, along with \"The Lego Movie\" and \"How to Train your Dragon 2\". Definitely worth- watching.<br><br>9/10","user":"Rectangular_businessman","rank":[33,41]}]