[{"title":"Beats Star Wars: the Last Jedi","rating":9,"date":"20 August 2018","review":"Way better than the last Star Wars and most other sci-fi films. Very imaginative, plus a lot of fun and action. Contrary to a few other opinions, I thought the actors fit the roles and did a great job. ALL of the characters, including the digital, behaved like real people, not just mechanically following a formula derived from preceding films. If you don't like the on-screen characters, that doesn't mean the acting was bad. Maybe it's just a reflection of your discomfort in seeing certain roles portrayed. There is a modest element of romance, which always makes some viewers uncomfortable in a shooting and chasing film. Bottom line: this movie is seriously under-rated.","user":"jrwygant","rank":[205,274]},{"title":"Wrong actors in a otherwise good movie","rating":7,"date":"12 February 2018","review":"As always Luc Besson makes a visual outstanding movie. The effects are like the best sci fi flicks and for that alone the movie is worth watching.<br><br>The story might not be the best, but what really is negative about this space adventure is the casting, especially the lead characters. Who really believe Valerian is a man hero, a military major when he looks like a 50kg high school boy?\nI know I dont. And there are other characters who are really misplaced and dont seem to know the art of acting at all. You just dont believe in them.<br><br>I would say Luc Besson had all his directing skills focused on the effects of the film, and left the (bad) actors to do what they pleased without any focus on making the characters believable.<br><br>I hope I'll never see Dane DeHaan act ever again.. The CGI characters have better acting than him and Cara Delevingne.<br><br>The reason for me giving 7 stars is because of the visual universe Luc Besson created, it's really great. If you dont care about bad casting and bad acting this film is entertaining and well made.","user":"gaute_lie","rank":[240,328]},{"title":"Eye candy","rating":10,"date":"13 November 2018","review":"Eye candy film, eye candy imagination and certainly eye candy actress with legs to die for. Made to be enjoyed on Bluray.","user":"bwq-25393","rank":[157,211]}]