[{"title":"Worth a watch","rating":7,"date":"14 September 2014","review":"Having seen \"Blood and Bone\" I was interested to see MJW's latest outing, and with some minor reservations this movie is worth a look if the genre interests you. Its well shot, reasonable well acted throughout, with a good peppering of action sequences culminating in the standard \"final battle\". The fight scenes are well done, focusing on MJW's obvious skills without special effects or camera trickery. The plot moves along nicely, true its a little formulaic and maybe predicable, but name an action/revenge movie that is not....its more about the journey than the destination....hands up who wasn't sure if Liam Neeson would find his daughter in \"Taken\". The thing that impresses me the most is how good it it is considering the budget...$4.5 million, compare that to \"The Expendables\" $262 million...and it doesn't look cheap...think more \"Transporter\" than \"Bourne\".... ...now there's a thought MJW v Jason Stratham..","user":"chris-brown77","rank":[31,37]},{"title":"Other reviewers are too hard on this film","rating":10,"date":"21 November 2015","review":"I've watched most films on the IMDb list \"Best action movies in 2014/2015\" (http://www.imdb.com/list/ls075110196/), from the highest rated down to \"Falcon Rising\".<br><br>I really do not understand why other users have given \"Falcon Rising\" such a low rating (at present, 5.7/10 from 4,359 users). In fact, I gave the film 10/10 simply to counterbalance the naysayers.<br><br>During the film, a character states that Brazil has the second-largest population of Japanese people besides Japan. I noted to myself, \"After the film finishes, I will try to verify this statement; if it's true, I will write a review on IMDb\".<br><br>It's true. (See the article \"Japanese Brazilian\" on Wikipedia.) Such attention to accuracy reflects well on the film to me.<br><br>\"Falcon Rising\" is an excellent action film. Definitely better than \"Non-Stop\" (7.0/10), \"Jack Ryan: Shadow Recruit\" (6.2/10), and \"Taken 3\" (6.0/10).","user":"jwb001","rank":[16,18]},{"title":"Solid action movie with the best, MJW","rating":7,"date":"20 November 2014","review":"7.5/10 <br><br>I agree with A_Different_Drummer's review for this movie and his Blood and Bone review. MJW is one of the best action stars out there and is still under-utilized. While this movie started off slowly, the second half was very entertaining and worth it. Predictable story but who cares, it's all about the style for this movie.<br><br>MJW needs more roles, I will watch anything with him in it. If you haven't seen Blood and Bone or Black Dynamite yet, go ahead and do yourself the favor.<br><br>Though this one isn't his strongest movie it beats the usual 6's and 7's on IMDb that are churned out by Popllywood.","user":"designstudio609","rank":[9,10]}]