[{"title":"Good movie, reflecting witch hunt mentality in social media/TV","rating":7,"date":"6 May 2015","review":"I never wrote a review before in my life so please excuse my poor attempt, but after reading some of the reviews I just felt I had to give it a try.<br><br>I really thought this movie was very good. It's starts as the typical \"missing wife, husband main suspect, no body yet found\" tale we all have seen once in our lives. But after the first act it really gets extremely unsettling and special. I felt sick in between because of the horrible, frightening character of Amy. I can't describe it any further and think you should simply give it a try.<br><br>SPOILERS!!!!<br><br>I now would like to address certain plot holes many people have been pointing out. <br><br>First of all, every movie has plot holes. I'm usually the first to notice, and even though there were some things that bothered me I got over them quite quickly since the movie had a tight grip on me.<br><br>Many are mentioning to different cameras in Desis house. First of all I know that many surveillance cameras overwrite their data after some time, so it is very likely that only the last few days (where she never left or entered the house) would be available to the police. Second of all, as far as I could see, the cameras only showed the outside of the house not what was happening IN the house. That's why she went near the window, which was within the perimeter of one of the cameras, to do her screaming attack. If you pay attention, you never see Amy appearing on any of the cameras when she checks them, only when she actually wants to be seen.<br><br>I could address many other so called \"plot holes\". I don't think they actually were plot holes per se, but made intentionally in order for us watchers to go...\"But wait, how does she get away with this??\". Think of the police officer who is in doubt of Amy's statements or even the lawyer.<br><br>What Fincher in my opinion wanted to demonstrate is the exemplary control Amy had over the public, were no questions were asked, nobody ever doubted her. It is kind of symbolic for witch hunts we ourselves have witnessed on TV or social media, were no second opinion is sought, nobody looks at the story from a second angle. Amy is the personification of the American Sweetheart, and is treated as such. It just shows us how blind and angry the crowd gets when you push certain buttons, Amy herself actually talks about that in the car scene. The pregnant intelligent wife, who was cheated by her husband. Or the poor girl next door who was always nice to the strange kid. Or the rich guy who thought he could have everything. <br><br>That is basically the story and that's why this film is so intriguing in my opinion. It's a mirror of how our society in the age of internet, social media, TV etc. functions. How we can be tricked into anger or sadness, and how little people actually question certain statements.","user":"johaschrei","rank":[91,112]},{"title":"Shock and Awe","rating":10,"date":"25 January 2015","review":"How on earth is this film attracting so much criticism?! This is one of the best films of 2014 and people are labelling it \"utter tripe\", \"an enormous heap of illogic and nonsense\", \"wish I had missed it\". Are these people serious? Can we no longer appreciate - or even identify - a great film?!<br><br>Gone Girl is a peerless plot-driven story about a wife who goes missing. Seems pretty ordinary, right? Well it's not. And it doesn't take very long at all for any sane viewer to recognise this. <br><br>You start watching and - as you do with any mystery - you start collecting the clues and piecing together an explanation for the events which have taken place. But no sooner than you have formed the perfect explanation in your mind is it immediately swept away in the most overwhelming twist of the year. <br><br>And it only gets better from there.<br><br>Gone Girl is a roller-coaster; only you're riding it in the dark. You don't know where the next turn is, you can't see where you're headed, and you have no idea how many more ups and downs you're going to experience before it's all over. <br><br>It's a film that keeps you guessing and just as you're beginning to (once again) think you've got it all figured out, the game changes and it's all up in the air once more. <br><br>The diary-exposition format is also very clever and was executed perfectly. Many films fall victim to losing the viewer when jumping back and forth between past and present, yet Gone Girl - you guessed it - does it just right.<br><br>This film ranks high in the mystery/thriller genre. It is just as compelling and perplexing as Shutter Island - if not then moreso. <br><br>And let's not forget: the acting. Ben Affleck and Rosamund Pike do a phenomenal job in their roles as husband and wife. Not a line feels out of place and both seem as though they were born to play Nick and Amy Dunne. By the end of the film I felt so immersed in their story that I found it hard to believe it was just a film. <br><br>All in all, I for one am thoroughly pleased with Gone Girl. I knew from watching the trailer it would be something I would like, I just never imagined it could thrill me this much.<br><br>A very underrated and overwhelming story that should be enjoyed by all.","user":"LiamCullen6","rank":[302,456]},{"title":"Gone, but definitely not forgotten","rating":8,"date":"22 April 2015","review":"Wow, actually a thriller that's pretty good. Yes, it's fair to say that 'Gone Girl' is a really engrossing film. As with almost every film, it's based on a book. And, as with most films based on a book, I haven't read the book, so I haven't got a clue how well the film relates to the source material. But then I don't care. I just enjoyed the ride.<br><br>'Gone Girl' is one of those films where you don't want to say too much about for fear of giving things away and spoiling it for people who haven't seen it. Ben Affleck plays a (reasonably) decent husband whose well-to-do wife disappears. The media circus that follows then starts to reveal that the truth is far more complicated that it first seems (not to mention the obligatory police investigation). It's fair to say that what follows is a film that twists and turns, so you only really get one chance to watch it and not know what's coming.<br><br>Many people don't really like Affleck when it comes to acting (even less now he's due to don the Batsuit!), but I think most people will relate to him as he gets pursued and hounded (unfairly? You'll have to wait and see!) by the media. Rosamund Pike plays his (gone!) wife with a flawless American accent. Again, you'll have to see whether she's found alive or dead. The story bounces around back and forth in time, making sure you're just confused enough never to put too much together before the film's ready to reveal what's happening.<br><br>If I had one complaint it's that the film is a little too long. Perhaps ten to fifteen minutes could have been edited out at around the three quarters mark, just to speed it up. But that's a minor gripe. Basically, if you like your thrillers twisty and turny (and have a couple of hours to spare on a film that you really have to concentrate on) give this one a go.","user":"bowmanblue","rank":[67,95]}]