[{"title":"Fun and very claustrophobic chase movie","rating":9,"date":"18 August 2014","review":"If you don't mind low-budget and you enjoy sci-fi horror, then you might enjoy this.<br><br>I almost stopped watching at the beginning but decided to stick with it, and I'm glad I did, because once they get into the tunnels/pipes, it changes gears and becomes kind of unique The farther they get into the tunnels the more intense it gets, and it doesn't let up. There's no side story to cut away to, you're stuck with them, in the tight spaces till the end. I read somewhere this only cost something like $8,000 to make, which is a pittance in filmmaking terms, so I think the makers are to be commended for the final product. It won't win any Oscars, but it's not supposed to, but as a sci-fi horror film, it offers more than films costing a helluva lot more. <br><br>I've seen a lot of films, probably too many, and I don't recall ever feeling as claustrophobic as I did watching this. I read online that a Japanese critic called it THE MOST CLAUSTROPHOBIC FILM EVER... might not be too far from the truth. It certainly is relentless till the end.<br><br>I've noticed people are leaving a lot of negative remarks. I feel they're not really giving it a chance. Appreciate it for what it is. It's a comic book style action sci-fi horror chase movie, that delivers a prolonged intense chase for most of the film, and for the most part delivers a pretty unique experience. Watch it loud and with the lights out, you should have fun.","user":"StepstonefilmsImdb","rank":[25,37]},{"title":"Not what I expected, and not in a good way.","rating":4,"date":"18 November 2015","review":"I've seen a lot of good publicity for this movie, and when I saw it was on the horror channel a while ago, I decided to record it and give it a go. I mean, when all I've seen are really good reviews for it, what's the harm in giving it a go?<br><br>I have to say - I regretted this decision.<br><br>Now, don't get me wrong. I understood what the movie was trying to do, I understood, I really did. But after seeing Oklahoma Ward and Nicole Alonso publicising this moving up to a 10/10 (of course, I knew this was publicity – I assumed the movie would be a 6 or 7 out of 10), I was thoroughly disappointed.<br><br>I felt the plot lagged on, and the whole movie was slow. The opening was exciting, of course, but it took so long for it to get through. The whole premise of the movie wasn't understandable, to me, anyway, and I had to find a synopsis online to actually discover what the movie was about.<br><br>I appreciate the horror aspects in this movie, but, for me, I didn't find the movie that scary.<br><br>A woman, crawling through pipes, again and again, is not scary to me. I understand that to some with claustrophobia, it will be scarier, but for me, this movie didn't do much. I ended up online, searching through my list of to-watch horror movies, which probably doesn't bode well. Then again, I'm sure a lot of people will enjoy this movie.<br><br>It just wasn't for me. I won't be watching this movie again, and I definitely wouldn't recommend it.","user":"rickyslittlehorror","rank":[5,6]},{"title":"Crawling 90 minutes","rating":3,"date":"13 August 2014","review":"This film is only 1h30 but seems to be 3h long. Very little happens and you follow a team crawling through pipes and narrow tunnels in order to escape some kind of monster. Explanations to why they have to do it this painful and dangerous way, are reduced to a minimum. There are other films such as The Descent, The Cave or The Cavern, where all the action is under ground. But these were way better than this one. Because there was a real script, plenty of twists and action, good acting and more generally good filming.<br><br>The fact of having a tiny budget does not justify the lack of imagination and does not excuse the boring final product. Some spectators will probably leave half way into the film, some will just keep playing with their tablets or mobile, while checking every 10 minutes to see if the story has moved on. And some, like those who wrote early reviews, may even find it good. Sorry, but not me.","user":"tux-12","rank":[22,38]}]