[{"title":"HK Neo Reviews: [36HKIFF] Love in the Buff 春嬌與志明 (2012) – Hong Kong","rating":7,"date":"6 May 2012","review":"@ 36th Hong Kong International Film Festival<br><br>Director Pang Ho-Cheung managed to deliver yet another piece of gem. Love in the Buff, a carry-on of the entertaining Love with a Puff deals with modern romance with an ingenious manner, excellent script, decent chemistry and a believable story. Pang in this film transform into the serial modern dating expert Patrick Kong. While Kong can write a good story about modern relationships and its dynamics and how love generally sucks, Pang out-dux his counterpart by being able to tell the story better on the big screen. Pang talks about similar issues, but what he is able to do in one film, Mr. Kong requires 10. Let's not get too big- headed, as this is by no means a perfect movie. The flaws of the Miriam Yeung-Shawn Yue combo are still questionable at best and despite some improvement, the chemistry is at best decent. However, the film works despite the lack of smoking sequences and relies strongly on the likable presence of Miriam Yeung, the irresistibly hot Mini Yang and as per usual sharp and clever direction from the unmistakable Pang.<br><br>Miriam Yeung is really a hit and misses. No manner how much she tries to act, she is just not on the same caliber as let's say Sammi Cheng. Still, Yeung is always a cheerful and likable character no matter how you put it. She is a genuine crowd pleaser and possesses an air of on- screen presence that carries the audience through the movie. The real problem of the film lies in Shawn Yue's character, ever since I praised him with potential in his small role in Jiang Hu, Yue has stalemated to the point of delivering predictable stoic performances. It is a shame as the real star of the movie is not the central character, but rather their younger counterpart delivering a winning performance. Mini Yang is able to depict and show the emotions of a naive girl in love with a guy where his heart buried within his own history. Yang is a perfect combination of hot, sexy and cute and when you add some acting chops to the mix, you got an actress around the corner.<br><br>All in all, Love in the Buff is really a good movie, but relies more on Pang's quality script writing, perfect song selections, sharp editing than on the actual acting itself. The good news is that there are plenty of laughs, funny moments, romantic tones and enough regrets to get the audience involved in the process. It is rare a film can overshadow the actors' performances, and not unlike Wong Kar Wai, Pang is able to do this. Still, Love in the Buff could have easily been better; casting Yue-Yeung combo lacks the required chemistry to make this film truly successful. On the hand, in terms of sequels it is twice the rarity that the second film is better than the prior and in this respect, Buff easily out-dux Puff. Now that's an achievement. A good film, but just not great<br><br>Neo rates it 7.5/10<br><br><ul><li>www.thehkneo.com</li></ul>","user":"webmaster-3017","rank":[9,10]},{"title":"A Nutshell Review: Love in the Buff","rating":10,"date":"22 March 2012","review":"The film begins with a story about death, much like the earlier film, but this time round you're probably attuned to Edmund Pang's signature style, with snippets like these easily becoming short films in their own right. It blended absurd comedy with solid dialogue, which is to become the hallmark of Love in the Puff/Buff, and many of Edmund's films. We learn that both Jimmy (Shawn Yue) and Cherie (Miriam Yeung) have moved in together and cohabiting in an apartment, but not everything's fine and dandy in a relationship that calls for much compromises, maturity, little niggling white lies here and there, fused with the director's keen observation of modern day society where a focus on one's career may have a detrimental effect in sucking the romance out of a relationship bone dry. Reality has set in, and it's not looking too good.<br><br>It's about time and quality spent with the significant other, and it pains to see the both of them drift, and part over time, nary saying much to each other when they once had some of the best communications and dialogues any couple can have. Their break up isn't very clean to begin with, where Jimmy goes over to Beijing to further his career, given an appraisal of the bountiful opportunities in China, with Cherie staying behind in Hong Kong, only for her company to find itself shutting down its doors for the larger (and cheaper to operate in to boot) China market, but she too given a chance to remain with the organization since she's of low threat to her boss, spelling out a relocation to Beijing as well.<br><br>Sure enough, their paths do meet in the most serendipitous of instances in the large capital city of China, but by then Jimmy has already moved on and is in a relationship with You-you (Mini Yang), an air stewardess much closer to Jimmy's age (don't forget that Cherie is many years older), and with physical assets that gets compared to in one of the most hilarious scenes in the film. One notices that the comedy in this film, and in the Love in a Puff/Buff series, is never slapstick, but boiled down to very strong language delivering its razor sharp wit, and of course, coarseness as well that only serves to reinforce the point that dubbing will only make all these moments woefully lost in translation.<br><br>While Jimmy's story arc in his relationship with You-you is great eye candy, especially since the latter has this effervescence demeanour and their hookup also based on a joke onboard a plane that served up another highlight, it's actually Cherie's story arc leading to a relationship of sorts with Sam (Xu Zheng) that proved to be more substantial and engaging instead, involving an observation about love in Beijing dealing with how singles get hooked up through family, who spend time scouring parks where parents of other singletons would advertise their own children's qualities, and appraisals done before the setting of blind dates. There's a point put across as well about the magnanimity of the Mainland Chinese in love and relationships, and how pragmatic their attitude can be as well, and this point will likely go down well with the Mainland audience, while doesn't come across as sucking it up because hey, we're all here to root for any sliver of possibility that our primary couple will break all deals and get together. After all, they still hold a candle for each other and constantly keep in touch through secret late night rendezvous or dirty weekend retreats behind their respective partner's back.<br><br>While it looks like a light hearted romp, it has plenty of heart put into the story, and those who have been through breakups will probably identify some takeaways that Love in the Buff points out well, with its exploration of themes like how one lover tends to exert an influence over the other whether subtly or otherwise, and how we deal with the implications of a messy and unclear breakup, where both Jimmy and Cherie obviously has pride, ego and longing in the way of calling it quits properly. And it's not all fun and laughter, since Pang Ho Cheung includes some heart-breaking moments but steering very clear of melodrama, which would have really ruined the treatment of the film.<br><br>A whole bevy of stars remain best to be unnamed to maintain the comical nature when they get introduced, from recognizable up and coming ones to those whom we have not seen for the longest time since bowing out of the limelight, bringing back plenty of memories especially for those amongst us who are of the couple's age and have grown up with the 80s and 90s pop culture. The end credits is wickedly hilarious, so don't leave the cinema just yet when the first credit starts to roll off, not only will you be treated to a short epilogue, but it continues to wryly poke fun at how we prefer our most embarrassing moments caught in digital records to be erased from the consciousness of all and sundry. Let's see how one of the actors wriggle out from this one indeed! It's probably only the half way mark now, but Love in the Buff made this trip worthwhile already. Highly recommended and a definite must watch for fans of Pang Ho Cheung and Love in a Puff. This is a more than worthy sequel as it gets a little bit more intimate with our favourite characters, and it powers its way into my top films of the year to date!","user":"DICK STEEL","rank":[8,14]},{"title":"One of the very best rom-coms we have seen, witty, touching and insightful in its portrayal of love, relationships and every other complication in between","rating":10,"date":"15 May 2012","review":"If 'Love in a Puff' was about the getting together, then its sequel 'Love in the Buff' is about the staying together. Indeed, almost anyone who's been in a relationship can tell you that you may love a person, but being together and staying together with that person is quite something altogether. What may have once seemed endearing suddenly becomes frustrating; and what should have seemed so simple suddenly becomes so complicated.<br><br>Wait a minute- is such heavy-handed matters the stuff of Pang Ho- Cheung's 'Love in the Buff'? After all, the original was a fluffy light- hearted romantic comedy built around the social phenomenon known as 'hot potting', or in other words, the regular congregation of office workers around dustbins in back alleys for a quick puff in the middle of their work routine. But unlikely as it may seem for fans of the original, this sequel ventures into much more mature territory, portraying with great detail and accuracy love, relationships and their attendant complications in today's modern dating scene.<br><br>So even as we are reunited with our favourite quirky couple Jimmy (Shawn Yue) and Cherie (Miriam Yeung), there is a sense that not all is well. As men are prone to do, Jimmy no longer makes an effort to remember his commitments to Cherie- even to the point of forgetting her mother's birthday celebration- and using work as an all-too convenient excuse instead. It's too easy for complacency to set into a relationship, and in the case of Jimmy, it just happens more quickly. Disappointed at Jimmy's nonchalance, Cherie moves out of Jimmy's apartment and quietly breaks up with him.<br><br>When a former boss (Jim Chim) makes him an offer to work in Beijing, Jimmy takes it up and meets on the flight there an attendant named You You (Mini Yang). How the two get acquainted is one of the many laugh- out-loud scenes in the movie, as Pang demonstrates once again why he is one of the most subversively entertaining filmmakers in the industry. Soon after, Jimmy and You You start going out with each other, and the easygoing chemistry they share soon leads them into a relationship- though You You's reaction to Jimmy's signature trick (which he had used with Cherie in the first movie) of pouring dry ice into the toilet bowl proves telling of the strength of their union.<br><br>Cherie makes an unexpected return into Jimmy's life when she is sent to the Chinese capital after her company decides to shut down some of its operations in Hong Kong. A chance meeting revives the spark of love within their hearts, even as Jimmy is now attached and Cherie's knowledge of that drives her to seek a new mate in the form of 40-plus year-old Sam (Xu Zheng). Still there's no denying their mutual attraction for each other, with their texting, late-night suppers, and hookups reminiscent of their whirlwind dating in the first movie.<br><br>Purists may decry the nature of their relationship with each other, and yes there's no doubt that much as we enjoy and root for the pair to get back together, it just isn't as straightforward as before- especially since both Jimmy and Cherie seem to be cheating on their respective partners. Therein however lies the dilemma that Pang addresses with delicate sensitivity- what exactly is the right thing to do if we are in a relationship with someone who loves us but find ourselves loving someone else instead?<br><br>The brilliance in Pang's filmmaking technique lies in how effectively he draws his audience into the seesawing emotions of both his lead characters Jimmy and Cherie, struggling with their responsibilities to their other halves even as they come face to face with the reality of their affections for each other. It's drawn-out no doubt, with Jimmy especially vacillating back and forth between Cherie and You You- but Pang finds such a bittersweet resolution to his characters' quandary that you'll instantly forgive the back-and-forth between the two characters.<br><br>The assuredness of Pang's direction is matched by the clarity of his and co-writer Luk Yee Sum's script, which through Jimmy and Cherie's text and voice messages to each other, convey acutely their mutual feelings. Not only is their writing spot-on in the depiction of the various relationships within the movie, it also retains completely the wit that made the original so endearing- both in terms of its use of allegories to portray its characters' circumstances as well as its side-splitting gags that include a guest appearance by Ekin Cheng and ex-Kevin Cheng flame Linda Wong. We dare to go as far to declare it as one of the very best rom-com screenplays from Hong Kong in recent years.<br><br>Besides sharp scripting, Pang's film is also a joy to watch for Shawn and Miriam's performances. Clearly relishing the opportunity to revisit the characters they played with aplomb the last time round, both actors are at their playful and tender best. In particular, Shawn once again demonstrates a hidden knack for comedy, a trait not often seen in his usual serious-type films. Miriam, on the other hand, wears her character's emotional vulnerabilities on her sleeve, and you'll be hard- pressed not to empathise with her through her tears and heartaches. <br><br>Rare is the rom-com that is as entertaining and as affecting as 'Love in the Buff', which through its characters and their relationships are bound to put anyone who's ever been in a relationship or for that matter fallen in love with someone in a ruminative mood. This review however would not be complete without a special mention to the film's soundtrack, which perfectly complements the tone of the scenes of the movie, and is worth keeping in itself. Once again, Pang proves why he is one of the best filmmakers in Hong Kong, and 'Love in a Buff' is that movie you want to visit every now and then just to bask in its emotions.","user":"moviexclusive","rank":[6,10]}]