[{"title":"The Snakes of Sugar Mountain","rating":7,"date":"20 February 2014","review":"7 of 10. It's hard to review this without spoiling it. Let's just say this is a film best watched knowing as little about it as possible. The title has multiple meanings within the story, thereby adding another element to enjoy.<br><br>There are some drawbacks. The beginning is weak and feels pieced together after the rest of the story is told, requiring narration early on to setup the story, but the narration doesn't help. There are also some annoyingly stupid actions that eventually make sense given the nature of the characters.<br><br>The film could be easily titled \"Seriously Messed-up Folk\", but that applies to a lot of films. Don't expect high action. It's drama and mystery made more interesting via the story and the quirky characters involved. Excellent performances by Joe Egender, Don Harvey, and Brendan McCarthy make it authentic and immersing. Yet the story could really use 5 more minutes for things like plot and character development.","user":"in1984","rank":[37,44]},{"title":"Worth a look","rating":4,"date":"19 October 2014","review":"A tough film to review without spoiling, Holy Ghost People is a about a young woman, Charlotte, and her search for her missing drug- addict sister. Tracking her down to a secluded religious community in the Appalachian mountains, Charlotte enlists the help of an alcoholic ex-marine to infiltrate the \"Church of One Accord,\" run by Brother Billy, a charismatic snake handler.<br><br>At times melodramatic and perhaps plodding. But while not especially fast-paced, this mystery/thriller is nonetheless interesting, well-acted, and edgy, as well as raising some intriguing questions about the potential power of faith—- for good or ill.","user":"indianajones79","rank":[6,7]},{"title":"A great atmosphere created in the beginning, but the ending was a bit disappointing.","rating":6,"date":"14 August 2014","review":"\"Bless your name, holy Jesus. Satan's shedding' big ol' tears tonight. He's a big boy, ain't he? I call him Satan,cause he's so big and mean. It's these deadly serpents the Lord sent us to handle... without fear. Our hearts are filled with the Holy Ghost. Get on up here, Brother Cole. Satan wants to talk to you.\"<br><br>\"The Holy Ghost People\" is not really a horror, even if the movie poster looks like it and it's a pretty macabre theme. It's more a thriller in which the creepy part is manifested through the religious sphere. Or you get the shivers already by looking at some poisonous rattlesnakes.<br><br>What makes this movie eerie is the fact that it's indeed still possible that an individual who's charismatic and has the talent to preach in a convincing way, can manipulate a bunch of people so that they follow him blindly and firmly believe in what these indoctrinating figure proclaims. A person with a seemingly clear mind who tries to convince others that he's talking the truth (however it's usually a twisted truth). Regardless if what he's preaching is based on Biblical or other religious texts or that this is simply improvised and full of hollow words. And he usually speaks to people who have physically and emotionally difficulties, or are recovering from a particular setback, and actually are in need and looking for a glimmer of hope and a last resort to hold on to. History has already shown the effect of such figures and what they can cause. And without going into a religious debacle here, I'm convinced that most of the global problems are rooted in the religious aspect of human life. And that's something that scares a lot of people already. Enough said!<br><br>Charlotte (Emma Greenwell) is an ordinary waitress in a local bar in a godforsaken American town near the Appalachians. She's looking for her sister Liz who she has thrown out years ago because of a persistent drug addiction. The last thing she knows about Liz is that she has joined a cult called \"The Church of the One Accord\" somewhere in the mountains. She asks help from the Afghanistan veteran Wayne (Brendan McCarthy) who's suffering from PTSD and has an alcohol problem and who she helped one night. At first he's rather reluctant until Charlotte waves some dollar bills in front of his eyes. Before you know it they are attending a service with this religious group and they meet the phlegmatic and charismatic figure Billy (Joe Egender) who looks like he walked away from a 60s movie and you expect him to sing a rock song any moment. A true religious crooner. He emphasizes his message by using poisonous rattlesnakes. They are the symbol of the eternal struggle between God and the devil. Charlotte and Wayne soon realize that Liz is not present and Charlotte goes to investigate. Before they know it, however, they are caught in the web of the dangerous religious Brother Billy and his henchmen.<br><br>Ultimately, this wasn't bad movie in the beginning. The gloomy atmosphere was constantly present and even at times it was pretty exciting. The images mounted in between from the eponymous documentary made by Peter Adair in 1967, made sure that the lurid and creepy atmosphere was maintained. The performances are the strongest part of this movie. It's the denouement that's the weak point. Especially Joe Egender I thought was fantastic and did some strong acting. He really came across as an evil and manipulative person with his loud-sounding voice and the way he spoke to his followers in a hypnotic way. A true wolf in sheep's clothing. Satan in person. Brendan McCarthy and Emma Greenwell were very convincing as the by chance created couple. McCarthy, ravaged by alcohol and who actually preferred to drive back. He's a character who cares about nothing. Greenwell tries to unravel the puzzle on her own. They truly did their best in a convincing way.<br><br>But then the movie turns into a complete mess and ends in a disappointing way. The entire buildup is fabulous and is negated by the uninspired denouement. Why couldn't they just simply ask about the presence of Liz? Despite their aversion and indifference about that religious stuff, they still let themselves immerse. It also seemed strange to me that they could feel from the outset that there was a certain danger when staying in this closed community.<br><br>In a certain way this was a scary and creepy movie about the deterrent of fanatical sects. A succession of extreme religious brainwashing where self-punishment is a method of self-purification. A crazy ritual encouraged by a dogmatic person. There are several films about such cults (and this one is definitely better than \"Red State\"). And because it is strange and incomprehensible for \"normal\" people this can lead to confusion and even fright, as the unknown frightens. So don't expect gory scenes and ghastly moments. For genre fans, it's a film that's worth watching.<br><br>More reviews at http://opinion-as-a-moviefreak.blogspot.be","user":"peterp-450-298716","rank":[5,6]}]