[{"title":"Wonderful drama","rating":8,"date":"19 August 2014","review":"This is a wonderful spectacular and emotional film. It grabs at the heartstrings. It makes you think. It makes you fall in love with a wonderful cast of dynamic characters, which are flawlessly performed on screen by an all-star ensemble of a cast. I think this was directed wonderfully. <br><br>I believe the story-line came together in a believable fashion. I think the viewer becomes a part of the overall story. You can relate to the characters. You seem to meld into the mindset and the actions and the emotional reality of the story. The story-line is something we all can become a part of and relate to and feel like we have gone through it or know someone that has gone through it.<br><br>It shocks me that this movie has got such bad ratings. The critics are absolutely wrong on this one. This is a touching story. A wake up call so you can say what needs to be said and done before it's too late. Like I say this is a film that is a true drama that needs to be seen. It's almost as if coming to a point in your life when you realize what needs to be done, has to be done now, there's a deadline and it makes you experience that reality.<br><br>It's great and funny at times. Nice originality and a relatable cast, relatable story and a flow of the direction, we all can become a part of. The film is very fresh. It seems like it's a moment of everyday life that you come in-sync with at what's taking place. At times you laugh, you're moved through an emotional journey of life and death and choices.<br><br>You can finish my review here: http://www.abucketofcorn.com/2014/07/lullaby-2014.html","user":"scarycatreviews","rank":[8,10]},{"title":"The Critics Are Very Wrong","rating":10,"date":"19 June 2014","review":"This is a truly beautiful and deeply moving film. While it may sound a bit depressing, it's anything but. <br><br>It's funny fresh and completely life affirming. <br><br>The performances are flawless and Garrett Hedlund and Richard Jenkins are magnificent. Jessica Brown Findlay, Anne Archer and Jessica Barden are also wonderful. Jennifer Hudson has never been better.<br><br>The music and feel of the film is fresh and really satisfying.<br><br>It made me want to call everyone I hold close and tell them exactly how much I appreciate them and love them.<br><br>Life is short. <br><br>See it!!","user":"cary-86","rank":[15,24]},{"title":"Rather tedious","rating":4,"date":"4 September 2014","review":"This film tells the story of a dysfunctional family, who is reunited by the terminally ill father's decision to pull himself off life support.<br><br>\"Lullaby\" is named quite the opposite of what it really is. It is a dark film with a lot of arguments and dysfunctional interactions. It is not easy to watch. The pacing is very slow, and I think the film can be a lot shorter, especially by cutting out the music scenes that are unnecessarily long. Jennifer Hudson is memorable as a nurse with attitude, I am quite unsure if nurses in the States really act like that! The ending speech by the daughter is very touching, but it is still not enough to save \"Lullaby\" as a tedious film.","user":"Gordon-11","rank":[10,15]}]