[{"title":"On par with the first one!","rating":7,"date":"5 June 2014","review":"It's pretty easy to review this one. If you liked the first one, you're in for a treat. It holds up to the expectations and plays cleverly with 'being aware' of making basically the same movie again. The good thing about this flick is, that it doesn't take itself too seriously while at the same time delivering a good and fast paced story with quite some surprises and good action. I basically laughed from the first minute up to the (awesome!) end credits! If you like that type of comedy, this one is for you, as it delivers on point and, without a doubt, is the funniest flick this year so far! Jonah Hill and Channing Tatum have a great chemistry and you can see and feel, how they enjoyed doing this movie. Like the first one, 22 Jump Street does a great job observing the different aspects of college life, students and teachers (or professors for that matter). Everyone who's been to college can relate to those stereotypes (e.g. the pseudo intellectuals, the sport jocks, the art students etc.) and directors Phil Lord and Christopher Miller (\"The Lego Movie\") do a great job spoofing those clichés while at same time debunk the downsides and shallowness of those groups or college life in general. <br><br>Verdict: Go see it, if you liked the first one. I can't say if it's better, but it certainly holds up. And I liked the first one pretty much. So there you go...","user":"EddyOne","rank":[202,290]},{"title":"Successfully Jumping Back On The Street","rating":18,"date":"18 June 2014","review":"My initial expectations were that '22 Jump Street' would be an over-the- top and cheesy sequel created solely to make money... I was wrong. '22 Jump Street' truly builds on the basis of the first film, further expanding upon the bromantic chemistry between Tatum and Hill creating an even more solid sequel full of good-natured humour and relentless action that made its predecessor such a great film. With Ice Cube having more of an impact this time round, the trio pursue their leads to ensure the villains are brought to justice. The direction duo have pulled off another amazing film to add to their filmography, a truly impressive and hilariously funny film.","user":"CalRhys","rank":[167,265]},{"title":"Good and Properly Stupid","rating":7,"date":"8 September 2014","review":"All these reviews are bashing the crap out of this movie. 'It's aimless drivel and only for mindless idiots'. Well....Yeah. When I watch a comedy like this that's what I hope for. Sometime you just want to turn off your brain for an hour and a half and watch two familiar \"actors\" play out ridiculous but easy enough to grasp scenarios while they foolishly react. A post-viewing critique is pointless because the directors have no intention of it being able to hold up on creative or any kind of artistic merit. If you want to think about what you're watching, or enjoy good story development, or simply see some great acting then there are plenty of movies like Rashomon, Eraserhead, The Man from Earth, Memories of Murder, Hitchcock films, Miyszaki films, or something like Life Is Beautiful or It's A Wonderful Life(I forget which is which, both great). And there's nothing wrong with a good documentary know and then either. But something good and properly stupid can be just the right thing when you need to take a respite. Not all comedies are going to be a quipping Woody Allen flicks. It's really about getting a good balance in your movies types and picking the right one for your current mood. In other words this movie is just what it intends to be and just what wanted it to be. Pure and easy entertainment.<br><br>...Now I'm going to get my Audrey Hepburn on and watch My Fair Lady.","user":"gregtoolson","rank":[57,88]}]