[{"title":"Just not funny enough for a comedy and far too messy.","rating":4,"date":"16 July 2012","review":"It's of course OK for a comedy to have a very simplistic story in it but its unforgivable when you just don't have a good comedy writer. Really, what's the point of watching a comedy when it just isn't being all that funny? <br><br>I just couldn't believe how badly written some of the comedy in this movie was. Most of the moments or pieces of dialog will get absolutely no laughs out of you, no matter how desperate the movie gets at times. The movie truly goes overboard in an attempt to still make you laugh, or at other times it's simply just going on and on. The director just didn't knew when to say cut at times, probably also because the director, Tyler Perry, himself is being on the screen a lot as well, as a whole bunch of different characters. But he clearly just ain't no Eddie Murphy!<br><br>The different story lines are either poorly connected or just connected in such an unrealistic way that it becomes ridicules. The movie even drops some story lines after a while and then picks them up again 30 minutes later, or sometimes it doesn't at all. It does the same with some of its characters. It all lets this movie feel like a real messy one at times and you are wondering multiple times throughout it what it exactly is that you are watching here.<br><br>The main premise of the movie is already a real ridicules and unlikely one to begin with. But the sad thing about it is that it's also absolutely going nowhere with it. At times I though that the movie was perhaps going to be one with some 'messages' it and the two different families would start to learn from each other and slowly but steadily grow closer to each other as well. But none of that is the case in this movie. It just mostly relies on racial stereotypes and other prejudices that just aren't being all that clever or original to watch and therefore also not all that funny.<br><br>And really, I love Eugene Levy but I just think he is better when he's not playing the lead role. He's just far better and more fun to watch in supporting roles, though it perhaps is not fair to say that purely based on his role in this movie of course. He is given some incredibly weak material to work with and the movie perhaps was at times relying far too much on his delivery. But not even a comical talent like Levy could turn some of the moments and pieces of dialog into something funny. And how are we supposed to believe he's married to Denise Richards? There is some weird casting going on in this movie but Tyler Perry foremost should not had cast himself playing 3 different characters. He just isn't a talented enough comic, so far too scenes involving him fall totally flat.<br><br>A failed attempt at a comedy.<br><br>4/10 <br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[9,11]},{"title":"Shame on you Hollywood","rating":1,"date":"14 July 2012","review":"I laughed twice throughout the entire movie, and once was at the bloopers. To say this movie is bad is an understatement. To those that reviewed it 10/10, what does a 5/10 look like to you? Or a 1/10?! Off the charts funny? I bet you said the same thing about \"Jack and Jill\". How many fart/genitalia/overused jokes can they cram into one movie you ask? Oh just plenty. I'm only going to spoil one specific scene (even though the plot is transparent from the start) SPOILER: There's a scene where Madea goes to fly and has to go through TSA screening. Not only do they send her through the X-ray machine AND Full body scanner, they sexually grope her as well. Now as half the theater erupted in laughter I wondered...\"Why do these people laugh? Am I missing the joke?\" It's almost like people go to the movies today and FORCE themselves to laugh at anything that maybe perceived as a joke. I wish moviegoers would take a stand and force Hollywood to improve the quality of movies instead of just allowing them to keep churning out the same old recycled trash. If you're still reading at this point, take a hint and avoid this movie, even if someone else buys your ticket.","user":"KidFresh48","rank":[15,23]},{"title":"The acting is simply terrible","rating":2,"date":"4 July 2012","review":"Denise Richards is easy on the eyes, but can't act a lick. My wife said to me three times during the film, \"this movie is just awful\".<br><br>Tyler Perry does an adequate portrayal of the cliché black aunt, and there are some entertaining and funny parts, but the other two main characters lay large emu eggs.<br><br>The plot becomes very predictable when the clip from a prior movie of the same genre is shown. After that, there is no suspense.<br><br>Even Tom Arnold and John Amos struggle to keep it believable. <br><br>Romeo and Doris Roberts are okay, but nothing is going to salvage this train wreck.","user":"elbojpb","rank":[15,24]}]