[{"title":"A real lesson in life!","rating":9,"date":"15 November 2014","review":"Wow this flick has caused a lot of negative responses and i cant quite figure out why, sure it was never going to be everybody's cup of tea but it's actually quite deep! What we have here is a film that shows the importance of letting ones inner demons out and not letting stress get the better of you. Some moments were very touching dare i even say sweet. Much of the humour was pretty crude and slightly childish but very funny the gore is fairly nasty and Milo himself is an amazing looking cute lil guy that is a great psychical effect rather than CGI this made me feel extremely nostalgic towards the fun 80's creature features such as Gremlins and Critters. This is for anyone who has ever let stress effect their everyday lives or anyone who wants to see a really cool 80's style creature.","user":"willpryoractor","rank":[18,22]},{"title":"Bad \"Ass\" Monster equals funny horror done right","rating":8,"date":"16 July 2014","review":"Bad Milo is another great example of what is right in horror comedy the last few years! Its a perfect blend of bad one liners, potty humor, heart and gore. Who would have thought that a film that teaches us about Anus Mythology, could be so awesome?! And I can't believe I am saying this about something that is borne out of a mans ass, but damn Milo is adorable. I swear by the end of the film you're going to want a Milo all of your own, poor misunderstood lil guy! <br><br>Duncan is an average good guy, living the average good guy life. He has a decent job, a good woman, and what looks like a okay life. He struggles with some tummy trouble, mom offers remedies, doctors try to help, and eventually he ends up unhappily in therapy where we can get to root of his problems. Pretty quickly this film pulls you in with a great opening scene, and then it keeps pace through the entire film, rotating between great blood soaked moments and humor sometimes mixing the two perfectly in such a disgustingly delicious way that you may feel both grossed out and ashamed for laughing at such wretchedness. You will also find yourself shocked by how much you want to hug this little ass borne, doe eyed, killing machine, i swear I even got teary at one point for the lil fellow! It was awful!, but it goes to show the amount of emotion that is in this film, not what you would expect from a story like this one.<br><br>If you haven't watched this film yet definitely add it to the list, it is a gem! The cast is made up of comedy veterans who bring this film to a whole new level of funny, and the gore is very effective with some scenes really looking incredibly good. I will definitely be pulling this one out again for years to come. It just goes to prove stress kills, but sometimes its kills the other guy!!!","user":"ms-omen73","rank":[11,13]},{"title":"All in all more touching than you would think, a true black comedy","rating":8,"date":"1 October 2014","review":"Where to start with this movie. When I first started watching it I wasn't blown away, the acting was good (I'm looking at you Patrick Warburton) but the main guy, Duncan, just struck me as an unlikable mook. Then the ass demon appeared and the whole thing changed. I suddenly found myself not only laughing at the absurdity of it all but also taken aback by the feels and not the feels that one would imagine having from an ass demon crawling his way back into your ass but more as if he had crawled his way into my heart. <br><br>The whole shebang really takes a turn when Milo, the brown town demon, crawls its way from Duncan's ruined sphincter to kill the people who hurt him and you start to understand what makes this anxious dork tick. As revealed during a therapy session with a kooky hypnotist, Duncan's father had abandoned him as a child and with Duncan's wife wanting a baby he is faced with something that people with abandonment issues often face. An issue I myself faced and that is the fear that we will end up like our fathers. This point is driven home even more when it is revealed that Duncan's father also has an ass demon and that Duncan's wife is finally pregnant. Upon hearing the news Duncan does exactly what his father did, he turns and runs, unable to process. Did I just find an emotional connection to a guy who spends part of the movie trying to feed cat food to a wide eyed demon that crawled out of his butt? Damn<br><br>Duncan shows the classic signs of someone who had an absent parent. He feels anxious in supervisory rolls, feels helpless, unimportant, as if what he wants and what he feels doesn't matter. Milo embodies his internal and his external stresses, his desires and his rages, the things he won't let himself address. As he tries to bond with Milo, at the behest of that nutty therapist, it symbolizes not just coming to terms with those parts of himself (\"I know you were only dong that for me.\") but also coming to terms with the fact that he is not his father. Milo and him take on an almost father/son dynamic toward the end of the film, with Milo calling him \"papa\" after he had chopped off the poor little guys arm and legs with an ax. That scene itself is one of the most moving parts of the film for a lot of reasons. Not only does Duncan gain control of his darker desires but he accepts Milo back into his ass with the help of his pregnant wife, essentially showing the act of becoming a responsible father helped him accept his own worth. In the end we find Duncan the head of his own company, getting ready for the baby and even taking care of his now invalid father. <br><br>The gore was a little cheesy and some of the acting was a little ham-fisted but in the end there are a ton of laughs to be found here and enough comically gruesome scenes for any danger dog to scratch his bone.","user":"r-allen-brewster","rank":[7,8]}]