[{"title":"Superhero Movie Fatigue","rating":5,"date":"27 September 2017","review":"Please take my review with a grain of salt. I don't really write reviews, but I really felt compelled to say something about this movie and it's decaying genre.<br><br>I'm conflicted, because I know my opinion is getting more and more jaded with every new superhero flick- but I am quickly reaching the end of my rope here. All these movies feel so predictable and cliché anymore, and as much as I truly want to enjoy them it is becoming more and more difficult.<br><br>The main actors in this movie were pretty good, but what can you do with yet another weak story that has already been rehashed in other films. The writing felt subpar, and in the end it came off as being full of gimmicks and convenient sub plot.<br><br>It just doesn't feel real anymore, it doesn't feel believable. It feels like a fantasy world created for superfans who never take a step back and critique.<br><br>These superhero movies are becoming more and more uninspired, and while I try to give them all a chance I am just getting tired of it all. It feels like the quality is being diluted, all that matters anymore is the quantity. All that matters is the money.<br><br>I still hold out hope- just look at the 'zombie' genre. Just because there is dilution within the genre doesn't mean a sporadic gem can't be made. However, if you are of a similar mindset as me, you might want to keep looking elsewhere.<br><br>Thanks for reading!","user":"anto_capone","rank":[161,234]},{"title":"Hugely disappointing","rating":6,"date":"24 July 2017","review":"As a lifelong Spidey fan I was expecting good things of Homecoming. Sadly - and I appreciate that I seem to be in the minority - it did not deliver for me. <br><br>Let's start with the positives: Michael Keaton's Vulture was everything a villain should be with an added layer of charm and depth. The high school setting and our youngest Peter so far was definitely a step in the right direction (Tom Holland is a very capable actor although though his voice did grate after a while). Even the menacing Mac Gargan, a potential 'Scorpion', was a great addition.<br><br>Now the negatives. I think the casting for Flash Thompson, Liz Allen and Ned Leeds was absolutely ridiculous. Flash is supposed to be a jock who bullies Peter - not a smaller Asian guy who is also a member of the same quiz team! And that throwaway 'M J' comment at the end - unforgivable!!! <br><br>The costume AI also didn't work for me. I appreciate that this is a tool to integrate Spidey into the MCU - but for me he works better when he is on his own, a guy in a cloth suit overcoming the odds with a mixture of bravery and science. <br><br>I can appreciate that Homecoming had some issues to get over, especially as the other movie incarnations covered his unique origin in such depth. Was it brave to avoid the origin altogether - or did it detract from really getting us onside? Maybe a 20 minute opening section with Peter narrating, recapping his origin might have helped...<br><br>I've no doubt that younger viewers would have enjoyed this movie (and maybe that was the aim), but fans of the 60's, 70's or 80's Spidey might have wondered what had happened to their favourite wallcrawler.<br><br>For me, the first 45 minutes of Raimi's 'Spider-Man' nailed it and SM2 was equally as good. My GF, who has no knowledge of the Spider- Man lore, left the cinema with me and remarked 'that was the worst one'.<br><br>Though I don't necessarily agree with that comment, I certainly wasn't ready to hail SM:Homecoming as an all conquering triumph, instead a rather weak chapter in the MCU series.<br><br>Sorry Spidey, I so wanted to love this movie! Maybe better next time...","user":"craigearl","rank":[265,409]},{"title":"Worst spiderman movie ever","rating":1,"date":"8 August 2017","review":"Seriously the worst Spiderman movie I've watched. The first three movies in my opinion were the best. In this film Peter Parker is portrayed as a hyperactive, silly, and immature teenager. They make him seem very weak and unimportant compared to other avengers. Furthermore I disagree with the use of gadgets and high tech suit. This is not how Spiderman should be portrayed and remembered. Honestly Spiderman is my favourite superhero and I grew up with him, but with the original Spiderman not this silly version and I'm just sad that people will now have this view of Spiderman instead of how Spiderman used to be and SHOULD be.","user":"oublalelekaka","rank":[236,370]}]