[{"title":"Aaaaarggggh!!!","rating":3,"date":"20 April 2013","review":"Apart from the presence of the wonderful Jodie Foster, the first Nim's Island had a well written, original plot with genuine tension and excitement. This sequel is a tedious, predictable load of trite nonsense, with cardboard cut-out characters, an almost complete absence of acting and plastic animals. Okay, the animals are real, but the sets are not. The plot (such as it is) is constructed entirely as a vehicle for Bindi Irwin, which ignores the unfortunate fact that Bindi could not act her way out of a three-sided room if she tried (which she doesn't, noticeably). She recites her lines as if from an autocue and has two stock expressions - sulky and slightly less sulky. Her love interest (eek - her character and his are aged 14!) is a rather more accomplished actor than she is, but presumably he had to audition for the part, while she obviously didn't. Matthew Lillard, who plays her father, never got out of first gear, and nor did the awfully naughty bad guys - who predictably got what was coming to them in the end (including, naturally, piles of bird poo on their heads). It was an afternoon I'll never get back, but at least I was able to catch up surreptitiously on Facebook ...","user":"clairestruthers","rank":[24,35]},{"title":"all new actors","rating":4,"date":"25 September 2016","review":"Nim (Bindi Irwin) and her father Jack Rusoe (Matthew Lillard) are on the island doing biological research with their nerdy assistant Felix. Jack's father-in-law Grant informs them that developers are planning to build a resort on the island. Nim comes up with the idea to find three endangered species to save the island while her father goes back to the mainland to present to the government. Edmund runaways from his bickering parents and hires a boat to go back to the island. Booker and his sons Ben and Frankie operate the boat.<br><br>The actors are all new from the original. I don't want to be mean-spirited but Bindi Irwin is limited as an actress. She still fits the role in some sense. She brings her myopic focus on nature and she's pretty good at being a grumpy teenager. She and Toby Wallace have fun hate to start the teenie rom-com. However, her acting cannot take it any further. The poaching family is bothersome and takes the movie into the wrong direction. Whatever potential this movie started with is gone after the first half.","user":"SnoopyStyle","rank":[4,4]},{"title":"Another Bindi Irwin vehicle to make her a star","rating":2,"date":"15 May 2013","review":"The 2008 version of Nims Island with Jodie Foster and Abigail Breslin playing the young girl, wasn't great but it was watchable. Return to Nim's Island isn't. <br><br>I love the Irwins; but Bindi Irwin cannot act. Her over the top performance was straight out of a middle school talent show. Her trying to be tough and feisty against her over the top bubbly image is a little creepy. She isn't an actress. <br><br>Her father was paving the way for her to stardom having her star in several TV shows when he passed away. Without him though, this is just another vehicle for her to get famous. <br><br>Her acting is horrific and phony and the rest of the cast should get double the pay for being in this. The book Nim at Sea by Wendy Orr in which this was based on is a charming book; this movie isn't. <br><br>The lack of chemistry between Bindi and competent young actor Toby Wallace (who is her crush in the movie) is uncomfortable to watch sometimes. Matthew Lillard who is a long time solid and hard working actor must have wondered what was he doing in this film. <br><br>Using real and trained animals is always a crowd pleaser; especially with kids; but the sets are so phony that it's hard to take anything serious. The \"bad guys\" are straight out of the Home Alone series and it's a huge disappointment. <br><br>In ending, this movie was one of the worst I've seen in a while and Bindi's acting is really bad. It will be interesting to see how far her father's fame and popularity will take her. <br><br>I just wish the adults in her life would get super stardom out of her head, and get her back to where she belongs. Teaching people about animals, and conservation.","user":"jpm4444","rank":[12,17]}]