[{"title":"Paradise Lost and Found","rating":8,"date":"4 October 2012","review":"I just watched Paradise Lost and, I admit, I cried a few times. I liked it just as much as the first (maybe even a bit more). The conclusion was a lot better than the first. I know that the characters were different from the norm of what you'd see at an American cafe, but each character represented the experiences of multitudes of people around the world: empty and addicted to drugs, believing that...pain is an illusion/that through thousands of lifetimes, one can get redeemed, selling drugs to get rich, sold into sexual slavery, full of bitterness, sadness and despair/losing one's faith due to loss of a child or loved one, etc. Good to see David A.R. White playing the role of the police officer in Thailand. That Jason Statham-esque scene was well-coordinated by the way!","user":"thaigirlgod","rank":[13,24]},{"title":"Great movie!","rating":8,"date":"25 September 2012","review":"I love the guy who plays Jesus in this movie and the first Encounter movie. He has the greatest smile and is extremely believable in the role. I think it's so great that real Bible Christianity is finally being taught here. A Christian heroin addict dies and they show that she goes to heaven. Of course she would. Does the Bible teach that taking drugs is a bigger sin than the sin of doubt, worry, fear or lying, and no one doubts that those sins will keep you out of heaven. Thank goodness the blood paid for it all! I didn't mind the violence so much because, why sugar coat real life and the problems real life Christians face everyday!","user":"Johnsod8","rank":[12,26]},{"title":"I was disappointed with this sequel - but loved the original","rating":5,"date":"15 July 2013","review":"I can't say it was a bad movie. I just can't say it was an original or good movie. I think that's what disappoints me with it.<br><br>The original Encounter was like a parable. I didn't take it literally, and the simple staging worked well with the metaphorical presentation that made you think about you and your personal relationship with your savior. This one drowns in scenery and detail. We have the Boxing Day typhoon in Thailand as history. We have a whole background story of action from a mafia movie, the drug dealer, the cop, etc. We have the lush and lovely background of Phukett, Thailand and those beautiful beaches. Worst of all, we have the not at all well done fight scenes. All of that distracted from the beautifully simple message of the original.","user":"mike-ryan455","rank":[6,11]}]