[{"title":"Well done","rating":9,"date":"7 June 2016","review":"Not only does this film (through its actors and director) tackle a difficult subject with sensitivity and a realistic touch, but its portrayal of a trip to Alaska is spot on. Having lived and traveled there for several years I think the film captures the sights, travel and exploring the Great Land in an equally honest and straightforward way.<br><br>The actors neither overplay their roles nor sleep through their performances. <br><br>Not a Hollywood blockbuster and not filmed with a blockbuster budget. And maybe that's why this film succeeds on several levels.<br><br>Well done.","user":"reidcom","rank":[15,16]},{"title":"Beautiful in it's poignant quietude and breathtaking journey through Alaska","rating":10,"date":"29 October 2015","review":"When I first saw the trailer and guessed what this film might be about, I was very nervous. <br><br>I was nervous that such an important story might not be handled well, especially by a male director. The few films that I have seen depict rape/molestation have presented it in a way that didn't feel real to me. Others had been too theatrical, too overdone, and too violent.<br><br>After seeing Wildlike, I knew that writer/director Frank Hall Green had done his research on the subject matter. Real life abuse isn't always loud and violent as we often see it portrayed, but it can be quiet and fleeting as it slips into daily routines with terrifyingly familiar people. In real life the darkest moments of our lives often go unspoken, revealed only in glances or implied in what is left unsaid. Wildlike captures this flawlessly.<br><br>Wildlike depicts the quietness of pain, but also the placid and beautiful journey to healing that can follow. It is refreshingly optimistic in that it does not linger on the suffering, but instead quickly allows you to escape on an adventure of recovery with the young protagonist. Vast and breathtaking landscapes of Alaska seem to set both the character and the audience free after a meaningfully unsettling first act. <br><br>And while the scenes of sweeping landscapes captured effortlessly by Hillary Spera are incredible, it is not the purely the majesty of Alaska which defines this film's success. It is the vulnerable and compelling performances of Ella Purnell and Bruce Greenwood which drive the film, and Green's fluid approach to the human condition. Real life is beautiful in it's quietude and subtleties, and that is what Wildlike evokes so honestly.","user":"kellybachman336","rank":[25,30]},{"title":"Humanly portrayed the tough subject","rating":8,"date":"28 September 2015","review":"I chose to watch it in spite of good reviews. The fundamental part of the story is chellanging. There are wide ranges of sexual abuses existing in our society. The percentage of crimes being reported is shamefully low. This movie is the testimony of it.<br><br>In my view, the part how Bart (played by Greenwood) handled the situation after he found out the truth was crucial. It portrayed the deep concern of Bart's part about Mackenzie's well being humanly. He did not pass judgments on Mackenzie even she attempted to seduce him earlier. He somehow understood her behaviors. I would say this movie sieved the humanity through a series of unfortunate events. The director had keen eyes to present the positives through the negatives in life.<br><br>Human beings are resilient and uplifting sometimes even in worst circumstances. This movie undoubtedly depicted that at least. The director left the untold ending behind which I would say is better than telling it all. If you like to have reflections after, this will be the one.","user":"cheer88","rank":[17,21]}]