[{"title":"good intentioned but top-heavy","rating":6,"date":"1 November 2013","review":"In regards to Corey Montieth: I saw that the other review focused almost entirely on Montieth's performance. In truth, he plays a supporting role without much screen time (although it is an important role). He does an adequate job, but I was not blown away by his performance. I will say that he was completely unrecognizable to me, which is a positive thing.<br><br>In regards to David Morse: A underrated actor who I have always appreciated. He carries the burden of the film on his shoulders and makes it look easy. Morse has a way of being menacing and is absolutely believable as a cop approaching retirement age who can still scare people shitless.<br><br>The movie as a whole: A mixed bag. Rather than being the gritty character study that it wants to be, it feels like a ripoff of some other superior gritty character study. The dialogue is just barely off the mark, but enough so that it feels slightly odd. Some plot points are naggingly unrealistic (For example, the idea that Morse's partner could be unaware of a robbery/rape that occurred the previous night. Believe me every cop in the city would be aware). The camera-work and direction are competent but bland. Morse raises my score from a 4 to a 6.","user":"remembervhs","rank":[23,29]},{"title":"A grim crime drama showcasing two very good performances","rating":6,"date":"20 July 2014","review":"McCanick follows a darkly twisted Philly detective throughout one day as he tries to find a recently paroled ex con. This film stars David Morse in another Philadelphia based role and the late Cory Monteith, both of which give very seasoned performances that really elevate this film. To start off, the story here, while it is entertaining, is very hard to follow. It is telling two stories simultaneously, one through flashbacks, the other through present day. While this has worked for films of this sort in the past, McCanick misses its mark here regarding a coherent plot. However, as a character piece, this film is absolutely terrific . David Morse as McCanick is very realistic and true to his performance. Morse is especially great in delivering a spot on Philly accent and making us truly believe that this man is a complete psychopath. Another actor in need of much praise here is Cory Monteith. Despite passing away rather recently, this film is bittersweet in a sense. The man proved he was capable of delivering raw and intense emotions, it is a shame we will not be able to see Monteith truly evolve and grow as an actor. Mike Vogel, another Philly native, gives a rather lackluster performance in a bare bones type of role. It isn't necessarily Vogel's fault that his character was underwritten, but he could have at least spiced it up a bit on his own. The director Josh C. Waller has created a great atmosphere for Philadelphia along with delivering a very tasteful character study but he fails to deliver in telling a story that remains coherent and is paced right. In the glimpses of the story that we do get, it is broken information, some of which is said and then never touched upon again. This happens quite often in this film. Despite a bare bones and jumbled story, the film works as a gritty character study of an obsessive cop. If only the story was elaborated on more or cut out all together and went the Bad Lieutenant route, either way there is room for improvement. The only thing that I did not like in this film was the ending. Without giving away any spoilers, all I'll say is it is underwhelming. Overall, I feel Waller has a safe place for future films of this sort. He directs with confidence, even if the script is a bit flat, he makes it work. The real people to watch in this film though are both Morse and Monteith. These two actors really give two amazing performances that are quite impressive. Morse especially carries this movie on his shoulders and runs with it, he's very very good in this film. Anyone who is a crime film buff, you'll really enjoy this one. It's a really raw and gritty thriller with a lot to offer.","user":"trublu215","rank":[6,7]},{"title":"Messy Story","rating":3,"date":"23 February 2019","review":"In Philadelphia, on the day of the fifty-ninth anniversary of Detective Eugene 'Mack' McCanick (David Morse), he learns that Simon Weeks (Cory Monteith) has been released. Captain Jerry Quinn (Ciarán Hinds) asks Mack to forget Simon Weeks, but Mack lures his partner Floyd Intrator (Mike Vogel) to chase Weeks with tragic consequences. In flashbacks, the relationship between Mack and Weeks is disclosed.<br><br>\"McCanick\" is a crime-drama with a messy story. The good thing is to see the underrated David Morse in a lead role and the young and promising Cory Monteith in his last work. Unfortunately the screenplay is not clear and the viewer ends the film without understanding the reason of the hatred of Mack for Weeks. The conclusion is also deceptive. My vote is three.<br><br>Title (Brazil): \"Obsessão Perigosa\" (\"Dangerous Obsession\")","user":"claudio_carvalho","rank":[5,6]}]