[{"title":"I'm not a film snob, this film is just really really bad.","rating":1,"date":"7 December 2012","review":"OK, I read the existing review of this movie, (Batman meets Daredevil,) and thought what the hell, I'll give it a try and ignore the score.<br><br>That was a BIG mistake as this film is truly terrible. Bad direction, camera work, lighting, sound, acting and script. Sometimes you really have to wonder how these things get made when there are so many talented people trying to make it in the industry. Mentioning either Batman or Daredevil in the same sentence as this movie is an insult to them both and I have to question whether the reviewer was involved with the movie in some way. (Apologies if you're not and just have really bad taste in films.)<br><br>Don't get me wrong, I love a low budget movie as much as the next guy, but it has to be good and this definitely is not. With so many other movies out there I'd give this a wide berth. Try watching Defendor or Super instead, two really great low budget movies with an interesting take on the whole superhero genre.","user":"simon-548-143581","rank":[73,78]},{"title":"Rise Of The Black Bat","rating":1,"date":"6 December 2012","review":"first i wanna thank the whole cast and crew because i had a problem with my stomach and i couldn't poop. when i watched this movie , my problem solved so i recommend this movie to people who have any kind of problems with their stomach. thank you so much black bat. i wanna know what camera you used to record this movie , you can record much better with cell phone cameras these days. i can fight better than your superhero in this movie. my fake gun is better than yours. next time you wanna make a movie , spend money on it. and please don't rate your own movie 9 from 10 , let people do that for you and don't say (Where would you like to see this character go next?) i would like to see him in toilet , nothing like dare devil , nothing like batman.","user":"mahbod-ghazi","rank":[39,43]},{"title":"Flop of the Black Bat","rating":1,"date":"10 December 2012","review":"What in the name of holey bat **** is this? This is not a spin-off of the Batman movies, nor is it a different take on Batman, but it's in fact just a rip-off of Batman that I would be pleased if Warner Bros did sue those responsible for this movie with copyright infringement.<br><br>First off, the cover of the DVD. It contains screen clips taken from Dark Knight Rises, misleading people into thinking, \"Oh, this film had a budget, look that bike looks just like the actual one\". SUE THEM WARNER, PLEASE. Those images are misleading and just there to get suckers money.<br><br>The plot is about a lawyer who takes on a case against one of the cities top gangsters. The bad guys jump the lawyer and throw acid in his eyes. Case closed! Apparently if the lawyer is blind, it's a mistrial in this town.<br><br>The lawyer has treatment all over the world trying to get his eyesight back, and eventually finds someone who can fix it, but when it comes back, he has night-vision and hates sunlight. He figures that this is a gift he must use, and goes out hunting the criminals of the street with a bullet proof vest, a batman cow, no cape but he has a gun.<br><br>You can guess the rest of the story and how it pans out already, so no need for me to tell you anymore about it.<br><br>The filming is amateur, the actors are worse, the plot is a joke, and the movie is bad. Need I say anymore to convince you never to see this piece of garbage that should never have been made? You won't even find a copy of this on Amazon, I already looked... hopefully because WB are suing them for making this garbage and advertising it with stills of the real Batman movies on it.","user":"MikeHunt1075","rank":[24,28]}]