[{"title":"What is better then a zombie movie? A zombie movie with robots!","rating":7,"date":"1 August 2013","review":"I was entertained. First off, it contains Dolph Lundgren, you know what kind of movie it is. He doesn't disappoint, while no Arnie, Dolph handles his one-liners while killing zombies and surviving while all around him die. <br><br>Although the zombie attacks are less and lees in the middle of the film, they come back with a running vengeance that overwhelms most of the survivors.<br><br>The plot is thin and basic, but the added adventures when the robots come into the picture change the course of their actions quickly. <br><br>Good for a popcorn night in.","user":"rivalclepto","rank":[23,27]},{"title":"Better than I expected","rating":6,"date":"26 July 2013","review":"There was some sketchy dialog particularly noticeable when Dolph's character max was speaking with his fellow soldier while they were walking on the bridge early in the movie, and some of the acting was stilted, but I loved that the zombies moved quickly and the robots were fun. The Dolphster is getting old, you could tell by his movements, especially when he runs, but he is in excellent shape. Dolph plays the part of the stoic unwilling hero well. The CGI was not Lucas film quality but it was not distracting. The main characters had clear personalities and weren't all generic. I only wish the end wasn't so predictable as to who would survive.","user":"angil_x","rank":[16,18]},{"title":"Battle of the Damned: About as mindless as you'd expect","rating":4,"date":"15 November 2017","review":"Dolph Lungren stars in yet another straight to DVD action film. This time he plays a former military man recruited by a wealthy guy to go somewhere dangerous and extract his daughter. So yeah basically the same plot as a couple of hundred other action flicks.<br><br>The twist is the \"Dangerous area\" is full of zombies, and on top of that military grade robots are also out in force.<br><br>With a hostile reception from all sides upon his arrival Lungren must dig deep to find and rescue the girl.<br><br>It's dumb, it looks shoddy and despite the zombies vs robots thing which is remotely original the whole thing feels oddly familiar.<br><br>For fans of Lungren or hardcore zombie nuts only.<br><br>The Good:<br><br>Lungren still looks the part<br><br>Kind of original<br><br>The Bad:<br><br>Crappy zombies<br><br>SFX more miss than hit<br><br>Weak kills<br><br>Seven shades of dumb","user":"Platypuschow","rank":[7,7]}]