[{"title":"Stupid, but entertaining!","rating":9,"date":"16 January 2013","review":"Let's get this straight right now: I appreciate good movies. Was this a good movie? No, in fact it was pretty stupid. Will people hate it? Absolutely. Did I enjoy it? A whole lot. I don't know what it was about this movie, but at times I could not stop myself from laughing. In my head I knew it was stupid, but I just didn't care. It's immature, raunchy, and ridiculous, but I loved it. The only Marlon Wayans movies I like, along with this one, is the first Scary Movie, and White Chicks. All three of them were pretty stupid. But that's the point. Sometimes you just have to see those movies that are obviously not good, but will entertain you. I love good, well made movies as much as the next guy, but I also enjoy just kicking back and watching a movie that will keep me smiling for 90-120 minutes. So if you're bored, have $7-$10, and an hour and a half to burn, watch this movie.","user":"bballking7007","rank":[121,171]},{"title":"Under-rated film worth seeing","rating":7,"date":"15 January 2013","review":"Whether or not this movie was stereotypical should be set aside for reviews. Focus on the main parts of this movie which were to utterly make fun of paranormal activity and the devil inside. I felt like this movie is under-rated. I thought they got straight into funny and absolutely making fun of paranormal activity 1 very quickly. The first scene was based on making fun of the camera work of paranormal activity in the bed room. Although these sorts of comedies are always a stupid sort of funny, I laughed throughout this movie, especially at the character of Chip the psychic; whose main goal is to bring out the gay demons in Malcolm the main character. I had a good laugh and if you can score some tickets for cheap its not a bad, make you laugh at stupid comedy, type of movie.","user":"spencer-trego","rank":[73,117]},{"title":"Great Comedy","rating":9,"date":"14 January 2013","review":"I am giving this movie a \"9\". I loved this movie, every scene was hilarious. I don't understand why the movie critics are so critical of this movie, to me a \"spoof\" is just like \"a roast\" it is meant to be funny and sometimes delivered in a risqué manner. Bravo Marlon... You did a fantastic job with this. I can not wait to go see it again plus buy the movie when it comes out. Everyone in my party was laughing and still laughing today and we send it two days ago. I thought my boyfriend was going to pee his pants he was laughing so hard. The whole theater was cracking up. Go see it people, we need to laugh after all the craziness that has been going on this world we live in.","user":"luvlive33","rank":[69,114]}]