[{"title":"Disney old magic","rating":9,"date":"8 February 2015","review":"Inspired by Frozen I started my search for new Disney movie which will offer me same \"Disney magic\" as i experienced in Lion King, Pocahontas, Bugs life, Frozen etc.<br><br>So I found Big hero 6, and the magic started. This movie is made for all ages. What i find very interesting in this new Disney movie is that he is very educational, specially for children, but grown ups will enjoy ether. characterization is very deep , and you will feel as you are one of the characters in this beautiful story. Visual effects are stunning, so u will experience another Disney master piece. <br><br>After seeing this movie , I would really recommend it to all movie lovers, especially fans of the Disney cartoon movies. If you are looking for an intelligent and inspiring cartoon movie for your youngest, you can stop looking because you just found it.","user":"emilbalint1990","rank":[53,68]},{"title":"Whoa!","rating":10,"date":"16 March 2015","review":"Please don't listen to the bad reviews and watch this yourself.<br><br>I registered with IMDb just to write this. That is how much faith I have in this film. I really cannot believe some of these bad reviews.. \"Not a kids film\"?? kids would go mental for this.<br><br>Animation was nothing short of exquisite<br><br>Comedy was extremely funny (and i'm not one for comedies)<br><br>Story line was really great too<br><br>Also made me cry a little... meh<br><br>please please please watch how awesome this is. i'm nearly 28 and I absolutely loved it.","user":"maxskimoose","rank":[142,195]},{"title":"Disney Going Hero","rating":10,"date":"22 February 2015","review":"Big Hero 6 is another in a line of many successful Disney animated movies. And rightly so, might I add. The movie is about a boy, Hiro, his friends, Nerds and a health care prototype robot, Baymax. They live in a not so distant, technologically advanced future in a city called San Fransokyo. The story is action-packed comedy with dramatic elements to it and, as such, is appropriate for all ages. If you love Marvel movies, you will most definitely like this one as well. If you are more akin to beautiful landscapes and animated design, then by all means, this is the movie you will want to watch. If you are feeling down, the abundance of comedy, present in this movie is sure to make your day up. There is also a lot to learn from this movie, as some of the most important things (as well as most painful) in our lives, are depicted in this movie. Plus, the movie features one quite notorious figure (without too many spoilers). In short, the movie is a must see for children and for grown-ups as well, if they have a child lurking somewhere within them. Do not make a mistake and pass on a beauty of this movie.","user":"mat-dragonfire","rank":[73,101]}]