[{"title":"Interesting satire on religion, big city life and fragmented society","rating":8,"date":"16 May 2014","review":"I am very disappointed by the less than intellectual viewers who claim that this film is offensive to Jews. Since when did showing the negative side of a culture become offensive? A more enlightened person would view this film as a brave satire on all fundamental religious fanatics set against a contrasting progressive society. I personally love the indirect social commentary and defiance of the female character Avigal. The film also touches the complexity of living in a society full of protocol and expectations and their impact on individual decisions. <br><br>The entire cast turned in worthy performances but the film did suffer from a very low budget, tight shooting schedule and a somewhat inexperienced Director but overall, it was a couple hours I feel were worthy of my time.","user":"indiedavid","rank":[73,91]},{"title":"Quirky and charming, though not all the way through.","rating":5,"date":"10 June 2014","review":"Woody Allen isn't really an actor for hire. It's just not something he does: if he acts, he generally prefers to do so in films he also writes and directs, largely because - one suspects - he only feels comfortable playing parts that he knows are tailored to his particular strengths. So it's odd and potentially exciting that he agreed to take a rather key role in Fading Gigolo, a passion project for actor-turned-writer-and-director John Turturro. As it turns out, it's easy to see why Allen agreed to join the cast: when the film works, it can be as charmingly quirky, odd and romantic as Allen's own movies. Even when it doesn't work, the cheeky byplay between Allen and Turturro's characters remains a selling point.<br><br>The story goes like this: bookseller Murray (Allen) encounters hard times in the bookselling business, and hits upon the novel idea of playing the pimp to his unexpectedly charming friend Fioravante's (Turturro) gigolo. As the business takes off, Fioravante encounters women both adventurous and shy. But, even in the face of such voluptuous and voracious beauties as Dr. Parker (Sharon Stone) and her girlfriend Selima (Sofia Vergara), he's particularly intrigued by Avigal (an intriguing Vanessa Paradis), the buttoned-down widow of an orthodox rabbi who's barely surviving the extremely strict rules and regulations that accompany her husband's death.<br><br>There's a lot to enjoy and even love in Turturro's gentle, quaint film. He excels in injecting tenderness into scenes that are practically structured to be awkward, like Fioravante's first encounters with both Dr. Parker and Avigal. But both turn out to be strangely, sweetly tender, as he manages to tap into something primal within both women that they both sorely need. The gentlemanly respect with which Fioravante treats all the ladies brought to him by Murray help the film's slightly out-dated message - women need a man to help them break down the walls that surround their hearts - go down a lot easier.<br><br>But Fading Gigolo also veers into considerably less successful territory, chiefly by turning Fioravante and Avigal's relationship into an uncomfortable love triangle with Dovi (Liev Schreiber), an orthodox Jew who serves in the community police force in Avigal's neighbourhood and has loved her from afar for years. There are a couple of fun comedy beats in this romantic entanglement, particularly when Avigal remains determinedly unresponsive towards Dovi's advances. But Turturro's tale takes such an odd left turn at the end that it undermines a lot of Fioravante's own growth within the film, which comes about when he realises just how strong an emotional connection he's forged with Avigal.<br><br>Fortunately, the film benefits greatly from the spiky chemistry between Allen and Turturro - their characters spar and tease with words and glances, as Murray talks Fioravante into a business that really doesn't seem to make a whole lot of sense. (It's readily acknowledged that neither of them is a natural fit for their respective roles as pimp and gigolo.) It's not quite enough to completely salvage Fading Gigolo, but the central friendship does survive the script's stranger and less truthful moments, and adds immeasurably to its charm.","user":"shawneofthedead","rank":[30,36]},{"title":"This Sad, Sweet, Funny Film","rating":8,"date":"15 May 2014","review":"Okay, this could well have been written and directed by Woody Allen. It has the feel of a Woody Allen picture. New York, Jewish neighborhood, and John Turturro as an unlikely Romeo who will quite possibly win your heart. The longer you watch, the more charm you see in him. Woody Allen as Murray was, well, Woody Allen and if you are a fan, you'll enjoy it. I am. And I did. Perhaps the ending wasn't exactly what I would have chosen at first thought, but I as I walked out of there it seemed as if it was probably about perfect. This won't appeal to everyone, but then not everyone is a Woody Allen type movie aficionado. If you are, you'll like this one. I thoroughly enjoyed a quiet little film sans all the non-stop violence and action that leaves you wiped out and drained by the end of it. Turturro did a fine job on this film. I left the theater with a smile on my face and a feeling that this was a really good little movie.","user":"patsworld","rank":[55,72]}]