[{"title":"Fresh, interesting British Horror","rating":8,"date":"4 April 2014","review":"The Quiet Ones is a new British horror movie from the makers of The Woman in Black. Produced by the classic crafters of horror, Hammer Productions, the film follows an Oxford professor (Jared Harris), his tutees and a student cameraman (Sam Claflin) as they attempt to both prove and document the theory that supernatural powers are simply a manifestation of psychological trauma. They begin studying a young girl who believes she is possessed by an evil entity, and a strange relationship begins to develop between her and cameraman Brian as the professor's attempts to create a poltergeist take their toll.<br><br>In an era where endless Paranormal Activity sequels, squeezing every buck out of the found-footage genre and reliance purely on cattle-prod jump scares, it's refreshing to see a horror film that seems to have been made by people who understand how suspense works. In the same way that Woman in Black tricked you into thinking that it's going to be a run-of-the-mill horror flick set in a creaky old house but did something interesting, The Quiet Ones uses the 'house in the middle of nowhere' setting in a way that doesn't just turn the lights off and throw furniture around when things go wrong.<br><br>While rare (but noticeable), there are still uses of very loud noises out of absolutely nowhere to accentuate the scares, but asides from that, they are achieved through realistic and unobtrusive special effects, a sparing but effective use of a rumbling, mechanical musical score (there is something to be said for music that can make a scene of occult research feel intense) and an unflinching refusal by the camera to shy away from the horror. The camera-work is an interesting mix of live-action and old celluloid stock filmed from the perspective of the cameraman as he observes the increasing number of bizarre and terrifying events unfolding before the investigators.<br><br>As far as performances go, Jared Harris is well cast as the physics professor slowly declining into madness in a knowing manner very reminiscent of classic Hammer-horror and Sam Claflin builds a lot on his brief performance in Catching Fire, creating a very believable character struggling with his own beliefs as the absolute horror of the experiment becomes increasingly harder to deal with. Olivia Cooke is also very good as Jane, the tortured subject of the experiment, taking a very over-used character (the silent, unblinking possessed girl) and doing something interesting with it, alternating between an almost comatose recluse and a young woman dealing with adolescence and emerging emotions.<br><br>The running time of just less than 100 minutes means that some of the character development feels a little rushed, but it means that the film has adequate time to set up scares, deliver on the suspense, and create an intriguing story without feeling repetitive. Taking unexpected turns, featuring good performances and inciting real fear in the audience, The Quiet Ones is a very welcome breath of fresh air in mainstream horror movies, proving once again that constant scenes of exorcisms and annoying families with camcorders have become tired old tropes and that the best thing to do is wipe that all away and focus on believable characters and more interesting methods to create a genuinely tense atmosphere.","user":"cc_vivalavida","rank":[60,86]},{"title":"genuinely surprised by the negative reviews","rating":8,"date":"22 May 2014","review":"Aside from The Exorcist, possession films always seem so lacking. They never have enough real, human tension. They focus on predictable jump scares and an even more predictable plot. It's safe to say that, in general, possession films don't have much to offer. Thankfully, The Quiet Ones does not suffer from the same faults of many other similar films. <br><br>Rather than simply focus on the dark progression of a possessed being, The Quiet Ones presents the frustrating fears that torment the young, inexperienced scientists, as they struggle with their desire to help a suffering being through the means of science and logic, the underlying threat of possible demonic possession,and the obsessive nature of Professor Coupland. <br><br>The performance of the cast is top notch, the effects are subtle, the only disappointing aspect was the very, very end, and the fact that as a whole, the film just wasn't that scary. Still, if the concept of possession interests you, but you've been disappointed with past projects, you might want to give this a shot.","user":"memoryplague","rank":[25,33]},{"title":"Good and creepy. However; easily forgettable, incomplete and has a disappointing ending.","rating":8,"date":"21 June 2014","review":"So, The Quiet Ones. I gave this film an 8 out of 10. I would however give it a rating of 7.8 if I could. <br><br>The Positives: The Quiet Ones is very successful in building up tension. It builds it up and then a jump scene comes at you and throws you out of your seat!<br><br>It is also a great concept. As the story progresses you begin to see more to the story than what we first thought.<br><br>Also TQO manages to go into different stories based on real legends (e.g. The theories they come up with and the covens they slightly touch upon.)<br><br>It is also quite creepy and intense with many scenes that make you say to yourself: WTF?!<br><br>The Negatives: TQO does not go deep enough into the story. They could have made the run time longer resulting in the movie being a lot more frightening. At the end of the movie, clearly not destined for a sequel we are left with many un-answered questions.<br><br>It is easily forgettable! After watching the film I simply left the screening. I did not take a minute to think about what I watched, literally the second I left the cinema I forgot about it.<br><br>The ending is also very disappointing. After all the build up I bet you were expecting a dramatic, jaw dropping climax?.... Well this movie does not offer that. Up until the end all the other negatives could have easily been forgiven. All it would have needed was a better ending.<br><br>And finally I'm going to tell you the problem with this film that occurs all of the time. 'Based on a true story'. If you are a director reading this STOP ADDING THOSE 5 WORDS! It makes the film feel scarier obviously but it also makes the director have to keep it realistic and that is usually a big downfall!<br><br>So 7.8 is what I give this film. It is creepy, jumpy and an interesting mix of found footage genre cinematography and regular cinematography. However; TQO simply isn't very believable and it is not good enough to get out of the 7 rating.","user":"lledain-796-978822","rank":[37,52]}]