[{"title":"Good movie, just don't expect \"Amadeus\" for chrissake","rating":7,"date":"4 June 2014","review":"After reading some of these reviews I started thinking a better use of my time would be to hunt down all copies of \"Plush\" and destroy them to make the world a better place. So glad I didn't.<br><br>While this movie certainly won't solve world hunger and seal the ozone layer, it did provide some interesting thoughts to ponder, and of course the story, though yes cliché at times (what rock n roll movie isn't??), it had enough suspense and twists to keep me riveted.<br><br>I won't say much about the plot because almost anything is a spoiler. I'll just say that it's a story of a somewhat naïve young singer falling prey to the darker elements of the music business. But what makes it compelling is the subtle theme that these \"darker elements\" (pain, cruelty and other vices) are what make a successful artist. More about that later...<br><br>I think some people came away with negative opinions because none of the characters are perfect, and you may find yourself hating them for stupid things they do. The main character \"Hayley\" (Emily Browning) is not a strong individual; she's no badass like Joan Jett or Siouxie or Amy Winehouse. No, Hayley is deliberately portrayed as a sort of fragile leaf in the wind who is easily coerced into doing unwise things. The story begins by implying that the death of her brother leaves her adrift, insecure and vulnerable. I think Emily Browning did a great job of playing such a character, foolish yet intelligent, and despite her questionable choices, we can still associate with her as someone who is trying to find her footing in life.<br><br>Oh but don't expect the ABC afterschool special because \"Plush\" isn't afraid to get down &amp; dirty. While there's not a lot of blood, gore &amp; nudity shown on screen, violence and sexual situations are clearly implied. Not a good date movie, since most of the \"intimate\" scenes border on rape. But, going back to what I said earlier, these \"darker elements\" are central to the theme of the artist's passion.<br><br>My only real gripe with the movie was that they didn't explore that more for us. I suppose the film plants the idea and we are supposed to ponder it ourselves. But still, I would've loved to see some powerful, chilling monologues (like in \"Amadeus\" where Salieri declares war on god for not giving him enough talent). But I suppose dramatic monologues like that would've sacrificed the plot's momentum. And the plot is clearly designed to be a roller-coaster from the very opening scene to the very last.<br><br>That very same breakneck pace might be what turns some people off, thinking it's too unrealistic. But hey folks, this is rock n roll. Anything goes.<br><br>I thought the soundtrack was nicely done. I didn't recognize any bands on the list, but the overall vibe was something like the dark 90s bands Nine Inch Nails, Evanescence &amp; Tool. With just a splash of Hilary Duff. I think I read that Emily Browning actually sang vocals. If so she did a fine job. One thing to note is how the music gets more &amp; more messed up as the film spirals down. The last song, \"Half of Me (Enzo remix)\" is so positively screwed up that it's almost a joke, but that's the point.<br><br>If you like this movie I highly recommend other films that delve into the theme of depraved artists and what fuels them: \"Art School Confidential\", the Aussie rock n roll comedy \"Garage Days\", and sure why not... Oliver Stone's \"The Doors\".","user":"rooprect","rank":[18,21]},{"title":"Too Much and Predictable!!","rating":5,"date":"19 June 2014","review":"Being a HUGE movie buff and having a soft side for Indie movies I was expecting a lot.Why? The banging trailer and Emily Browning made me anticipate the movie very much until I watched it and was disappointed to the maximum. Beginning with the direction style, the movie looked like a first-timer's project which they could care about less. The style isn't that bad actually, but its so many other factors that make this movie unbearable and a pain to watch. The intertwined and unrealistic plots are taxing on the mind and what's more,they are all PREDICTABLE. The acting is below average to say the least, apart from Emily Browning of course, who was very convincing in her role and the only thing that kept me from stopping the movie. The music used was quite good at times, IF you're into the Indie Electronic,Electronica etc..genres. Only watch this if you have lots of time on your hands.","user":"with_blackstars","rank":[5,5]},{"title":"Push","rating":4,"date":"22 May 2014","review":"Sometimes its easy to push another persons buttons. It's even easier to do so, when you're not showing your full self. In this case this happens to a young female singer who seems to be very vulnerable. Though that seems to be a stretch considering she is married to Cam Gigandet (well the character he is portraying).<br><br>Of course there is more than a few moments where the viewer will be shaking their head, at what the singer is doing. But then again, this is way better than some other recent movies with a same story line. The sex scenes are not very steamy, which is intended, but the very first one could easily be discussed and ripped apart. Other movies have had problems with similar evolving scenes ... Whatever the case, this is a decent effort, until the end (with some extra juice and some extra twists)","user":"kosmasp","rank":[3,3]}]