[{"title":"What happened...","rating":6,"date":"16 September 2016","review":"I've posted some 60 reviews on IMDb so far, and I've never felt the need to post one that contained spoilers. I feel that too many viewers are going to miss the point of this movie though, and I feel the need to help people appreciate it.<br><br>ISRA 88 is about a mission to reach the edge of the universe. It's unclear which time period it takes place in, but the technology apparently exists to use particles collected in space, in some sort of fusion or singularity reaction that produces thrust at hundreds of millions of miles per second (apparently without suffering the consequences of special relativity).<br><br>Here comes the explanation. If you don't want to know, don't read any further. Spoilers ahead. Major ones. You have been warned.<br><br>You could think of this movie as having been inspired by a Star Trek: The Next Generation episode called \"Parallels\". In that episode, some rare space phenomenon mixed with a starship's \"warp\" effect causes the barriers between parallel universes to destabilize, and elements from one bleed through to another.<br><br>Quick primer on the \"many-worlds\" theory: All outcomes that can happen DO happen. Each decision people make results in the creation of parallel universes, wherein every possible choice plays out fully.<br><br>Early on in ISRA 88, we see the ship crash through what appears to be some sort of solid shell that encloses our universe. It causes an effect similar to what was seen in Star Trek.<br><br>Multiple versions of the same events, and one character \"remembering\" things that haven't happened (or haven't happened yet), are all products of the fact that in one universe, the ship did indeed succeed in its mission to reach the edge of the universe; only this had unforeseen consequences. The ship quite literally cracked the barrier between parallel universes, causing elements from multiple versions of the universe to bleed into each other. That's why we see the different sets of astronauts and other different ways events unfold. <br><br>The implosion scene we see an alternate set of astronauts suffer was due to their accidentally deactivating a ship system that was shielding the body of the ship from its engine, causing the ship's propulsion reaction to eat the ship itself (a futuristic version of a nuclear meltdown). <br><br>Much of the story is told in reverse chronology. The first half of the movie winds up feeling very slow, largely because it begins at the end of the story chronologically. At this point, the characters have been in space for a very long time. They are surrounded by nothingness, being far beyond any stars or galaxies. The relationship between the two characters has broken down, and one of them spends most of his time drinking, watching TV, and going a little mad. Very little happens, and there's very little dialog to hold your interest. <br><br>That's meant to be an exploration of the condition of isolation, but even considering that, it's a tedious prospect for the audience to sit through; especially since we're occasionally teased with scenes hinting at an exciting premise.<br><br>Things get more interesting toward the \"end\", when not only does the plot become more dense, but the characters are also showing actual interaction and their relationship develops.<br><br>It's due to the long monotony in much of the film that I'm forced to give it a lower rating. It's otherwise not bad. The production looks relatively glossy, the acting is good, and the plot is interesting and original.<br><br>A few strategic cuts would raise the rating drastically, if you ask me. If it had been given more of a pace to begin with, and the monotony were more hinted at rather than shown explicitly and excruciatingly for such long stretches, this could have been a lot more interesting to a lot more people.","user":"equazcion","rank":[41,46]},{"title":"Dull","rating":2,"date":"9 September 2016","review":"I thought the plot of this film sounded intriguing and was looking forward to a cerebral sci-fi. Unfortunately, it was incredibly dull and slow.<br><br>2 men are tasked with flying a spaceship to the 'edge of the universe'. There is no explanation of how this is possible, and forget explaining the trivialities like how they have gravity on the small rather dated looking vehicle with 'egg-box' walls, levers, green screen text terminals and flashing light boxes...<br><br>The film left me feeling like I missed the point, if there was one.<br><br>Watch the TV series Red Dwarf for a pair of similar characters in space as you'll get a lot of humour and actually far more interesting sci-fi.","user":"laymonite-2","rank":[77,91]},{"title":"Not really a space film - not for everyone","rating":6,"date":"3 November 2016","review":"This is a weird film. It would probably make a better play. The space mission depicted is entirely unrealistic and the story told is revealed in a non-linear, disjointed way. So if you get past that description, and you aren't looking for something along the lines of 'Gravity' or 'Sunshine' it's not so bad.<br><br>But. It's kinda slow. It takes a while to work out what really is going on and what the film is interested in. The space aspect of it really is incidental, the film 'Moon' might be a reasonable comparison (another film that would probably work well as a play...) The final scenes are devastating if you've stuck with it. It's well-acted, I thought, with a peculiar retro-future feel that some people may find appealing. I nearly gave up on it about twenty minutes in but ultimately I'm glad I didn't.","user":"Khymaeri","rank":[20,22]}]