[{"title":"A masterful adaptation of a masterful play","rating":10,"date":"27 July 2014","review":"First, I should warn readers that a major plot transition appears below the Spoilers alert—or maybe not. Regardless, film revolves around the aging and perhaps dying architect Halvard Solness (Wally Shawn), a parochially renowned architect whom we first see in a bed with EKG leads, monitors, and private nurses attending to his apparently imminent death. There is a tangled web of relationships with his withdrawn and severely mannered wife Aline (Julie Hagerty, in a major departure from comedic roles), his bookkeeper qua (perhaps) mistress Kaya (Emily McDonnell) and her fiancé Ragnar (Jeff Biehl) whom Solness maintains and severely controls as an lowly employee, Ragner's father Knut Brovik (Andre Gregory) who was an associate/partner/competing architect whom Solness oppresses, and finally a mysterious young woman Hilde Wagner (Lisa Joyce) who bursts into this house of misery with verve, joy, hope, and vibrancy. The surface plot entails the ego-maniacal control Solness exercises over his wife; Kaya and Ragner whose engagement he attempts to disrupt; Brovik who is dying himself and begs Solness to give his imprimatur to his son's architectural prowess, and finally his bewilderment at Hilde's arrival which keeps him nonplussed and off balance for the duration of the film. Hilde relates that she met Solness 10 years before at the age of 12 when he built a church and, for her, magically placed a wreathe at the top of the steeple. There are hints that Solness tried to seduce her at age 12, but also more obvious statements that she worships Solness as the \"Master Builder\" with whom she will re-unite in 10 years and who will build her a \"castle in the sky.\" Her role, and the end of the film, deviate from Ibsen's play and are of Shawn's doing in his adaptation. Before going to Spoilers and conjecture, it should be noted that Shawn, who is a Harvard graduate, learned Norwegian so he could translate the play directly into English himself. The acting is outstanding, especially from Shawn and Joyce who up until this film had relatively minor roles. I cannot imagine another actress who could have conveyed the energy, vitality and sheer joy (as well as occasional pathos) she exudes. The cinema-photography is wonderful, including a hand-held camera giving an intimate and at times embarrassingly too-close view of Solness on his deathbed. The film is almost all dialog and emotion, and some will see it as too slow moving. However, I was literally sitting on the edge of my seat enthralled and enveloped by the karma, emotions, and symbolism coming at every turn. *************SPOILERS*************** Apparently lost on most other reviewers to date is the fact that most of the film is a dream or mystical. Solness goes into cardiac arrest shortly into the film, both shown and also depicted by the eerie EKG auditory alert. The entire rest of the film up to the last few minutes is, depending on your interpretation, a dream Solness experiences, a But run, don't walk, to see this brilliant film which will have a short mystical visitation from a forgiving angel, an apotheosis to THE master builder on his deathbed, etc., but NOT reality. The film returns to reality a few minutes before the end with several of the characters witnessing Solness' death and his wife bereft at his side. I view Hilde as an angel come to attempt redemption of or at least comfort for (think Wings of Desire) Solness's sins, and his wife from guilt over the death of their two children whom she pitifully tries to replace with love for 9 dolls. Beyond these thoughts, there are multiple metaphors and symbolism to absorb that I will leave to other viewers. run given that the main plot went over the head of most film critics so far.","user":"krp2003","rank":[16,22]},{"title":"Definitely a Play on Film","rating":7,"date":"19 May 2017","review":"A successful, ego-maniacal architect (Wallace Shawn) who has spent a lifetime bullying his wife, employees and mistresses wants to make peace as his life approaches its final act.<br><br>While this is a very good film, it must be stressed: this was originally a play, and it comes across very obviously as a play, even on film. The dialogue is dense, far more than your usual conversation. And the sets are minimal. Not sparse, but few... are there even six different rooms in the whole two hours? I feel like I have seen another version of this play done before (on film, not in person). But this probably is the defining version. Wallace Shawn is great, but really Lisa Joyce steals the show. In the few years this has been out, her career has moved along steadily, but she's not the big name she should be. Someone cast this woman in the right role!","user":"gavin6942","rank":[6,7]},{"title":"Wallace Shawn is Great","rating":10,"date":"22 July 2018","review":"It's neat to see Jonathan Demme's direction of this, which was five years after the last feature film he made (Rachel Getting Married). It's still very good, as are his recent documentaries like My Cousin Bobby. You can tell this is a play adapted for the big screen but Wallace Shawn is amazing and as far as plays go you can't do much better than Ibsen. It's a great play and the adaption is good.","user":"ronkoyama","rank":[3,4]}]