[{"title":"True Story comes up short","rating":6,"date":"27 April 2015","review":"True Story is based on the novel by Mike Finkel recounting his relationship with Christian Longo(James Franco), a man accused of murdering his wife and three children. Finkel(Jonah Hill)is a young up and coming journalist writing for the New York Times when his career is derailed after he plays a little fast and loose with some facts of a recently published article. While trying to plan the next chapter in his professional life he receives a call from a reporter looking to get an angle on the story about Longo. It seems that he was using Finkel's identity when he was captured in Mexico. Finkel is naturally curious but also smells a story that could put his career back on track.<br><br>Finkel and Longo arrange to meet and what follows are a series of meetings where both men engage in a dialogue meant to extract as much information as possible from the other. But how much of what Longo shares is the truth? How does Finkel use the information he gets?<br><br>The main problem with this movie is the pay-off, or the lack thereof. The story is simply not as interesting as it sounds. Honestly, it's no ones fault. The direction by first timer Rupert Goold is solid, well paced, and true to the story. The acting is good even if it is a little weird to see Hill and Franco together in serious roles. The best way to describe it might be we all know someone(friend or family member) who is excited to tell a story of something that happened to them or something they witnessed and when they are done, looking to you for a reaction, all you can say is \"Is that it?\"<br><br>The most compelling aspect of the film is Finkel coming to grips with the fact that he has to determining what is the truth and what is a lie. Not unlike his readers had to do after reading his last story for the Times. One liar interrogating another.<br><br>In the end, the build up leads to very little. The ride was interesting but the destination was a big disappointment.","user":"d_vsbrgh","rank":[146,166]},{"title":"We don't get the pay-off we think is coming after all the build-up","rating":6,"date":"22 April 2015","review":"\"True Story\" (2015 release; 100 min.) brings the story of how a reporter becomes entangled in a murder suspect's world. As the movie opens, we see some brutal images of a young child being stuffed into a suitcase, which later turns up in the water. What is going on here? After the opening credits, we get to know Michael Finkel (played by Jonah Hill), a New York Times reporter, as he interviews young men somewhere in Africa. Alas, later on he is caught fabricating some of the facts for the subsequent NYT piece and he is let go in disgrace. Meanwhile, we get to know Christian Longo (played by James Franco), accused of killed his wife and 3 young kids. When he is rounded up, he claims to be Michael Finkel, NYT reporter. It is not long before Longo makes contact, from jail, with the real Mike Finkel. To tell you more would spoil your viewing pleasure, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: \"True Story\" is based on the Mike Finkel book of the same name, and if of course a true story. The premise of the movie is really intriguing (and cleverly played up in the trailer), reason I went to see this in the first place, namely is Longo somehow playing Finkel, while being in jail, and if so, what disastrous effects could that have for Finkel? Alas, in the movie it doesn't bear out. There is lots of build up in the movie, and ultimately not enough pay-off. I am all for a long build-up, but there has to be a reward for sticking with the build up, and when the reward finally comes, it's simply not enough. A quick word about the acting performances: James Franco does what he can with the limited material that is given to him. Jonah Hill is okay as the disgraced NYT reporter. The real star of the movie Felicity Jones in the role of Jill, the girlfriend of Mike Finkel. I also want to give props to prolific soundtrack composer Marco Beltrami (recently of The November Man; The Drop; The Giver, just to name those), who once again provides a lovely soundtrack.<br><br>The early evening theater screening where I saw this at was attended not very well (less than 10 people), but in fairness, it was a weekday evening. That said, while this is not a 'bad' movie per se, nor do I feel that the movie is all that it could've become. That said, if you have a chance to check out \"True Story\", be it in the theater or on DVD/Blu-ray, I suggest you do and draw your own conclusion.","user":"paul-allaer","rank":[56,68]},{"title":"Don't trust the reviews - this is a must see","rating":9,"date":"18 April 2015","review":"I had been looking forward to True Story since I first saw the trailer in December. And then I read reviews tonight on it and was pretty worried. I actually almost didn't go to the theater to see it. I almost considered waiting for the DVD (or Digital HD rather, Ha) release. I am glad I didn't. <br><br>I am not going to recap the entire summary of the film, as if you are reading this, chances are you already know it, and if you don't, the less you know the better. I just finished researching the true story of the film, and it appears this film is quite close to the truth. (Unlike the characters in the film)<br><br>This is a movie about deception involving characters that fabricate the truth to incredible lengths and spin endless webs of lies. One character to a lesser extent to the other, but I found it interesting how this film portrayed the similarities between these two men. The story is brilliantly woven, and extreme attention to detail is paid. The cinematography is beautiful, the acting is solid, this is just all around an exceptionally well made film. It's tragic, yet very thought provoking. <br><br>The main two complaints I heard in critical reviews were that the film lacked suspense, and that it was a whole lot of buildup with no payoff. The no payoff criticism concerned me the most, as I can't stand movies like that, and that criticism seemed to be the biggest people were making. <br><br>Realize going in, this is a psychological drama/thriller. I personally was riveted and in constant psychological suspense, but there isn't any real physical suspense throughout the film. The suspense comes from a psychological place, falling victim to the constant mind games, and not knowing what the truth really is. <br><br>And as for the biggest criticism, that there wasn't any payoff, I couldn't disagree more. I'd like to ask these critics to their face - how much more payoff are you looking for? Given the details of the true events, there isn't any more payoff that could have been provided, in fact, I felt the payoff of this film to be big. It was a psychologically riveting experience that provided a lot to think about long after the end credits rolled.","user":"Krisp8888","rank":[182,237]}]