[{"title":"Hamfisted...","rating":7,"date":"7 April 2018","review":"Don't waste your time with this flick. I'm being gracious with 2 stars.<br><br>The film tries too hard to be noir and fails miserably. With essentially a \"no name\" cast, which is not normally a red flag, but in this case it is. This is more a parody of a noir detective film, at least that's the way it comes across. Acting is high school drama class quality... seriously, I really can't single out one good portrayal. The writing is an insult to classic noir, the directing is hamfisted and sophomoric.<br><br>The 8,9 and 10 star reviews were probably made by the cast, crew and family members as they are so over-the-top gushing platitudes as to be completely unbelievable.","user":"davidjdoyle-140-892335","rank":[27,34]},{"title":"Classic elements","rating":9,"date":"3 April 2018","review":"It's interesting how stories stick with you. \nThis one stuck with me for days.<br><br>The story is a classic noir setup. Gumshoe down on his luck meets a pretty brunette at his office, sleeps with her, wakes up to blood in his bed but no body, and gets visited by the brunette's blonde sister wielding a gun, wondering what happened to her sister. It gets messier from here, as is the norm with noir. In noir, the story was never simple, even if the sets were.\nThe gumshoe Roland Drake is a Marlowe-esque character and you feel for him and his predicament. He's had a string of unfortunate things happen and while he has certainly retained his sarcasm, his failure to write his own happy ending makes him melancholy. He obviously still longs for that happy ending, which is why he falls hard for the blonde, despite having misgivings about the case and the blonde's weird family.\nThere are some laughs and there is some violence and there's certainly drama, but in my mind this is ultimately a story of romance, albeit not a typical one. To me this is mostly a story of the gumshoe's struggle between his romanticism and the cynicism brought on by his experience. In the end, one must prevail.\nThe struggle of romanticism vs cynicism is timeless and that's the part that always gets to me, and as a result I keep thinking back to this story and my empathy buttons keep getting pushed. There are some really loathsome characters in this story, and while they can't be excused, some of the villainous actions could be seen as reactionary, or at the very least inescapable. The parable of the frog and the scorpion comes to mind.<br><br>The acting was solid throughout. Some familiar faces as well, if not big names. Steve Tom got a lot of laughs from me (he's one of those guys I keep seeing everywhere). I haven't actually seen Vernon Wells in anything since The Road Warrior, despite his lengthy resume, but it was fun to see him gleefully chew up all the scenery, both real and virtual. Which brings me to the production values.<br><br>I knew going in that this was going to be a low budget indie so I knew I wasn't expecting The Avengers level production values. But what these guys pulled off on a shoestring budget and a tiny crew is pretty amazing. From what I've seen practically every scene in this film features a virtual set or set extensions of some kind. Which is understandable given the 1940s setting, but mind blowing given the small budget. I can't imagine it being easy to pull off a period piece where a large city like Los Angeles is the primary backdrop, without having tens of millions of dollars just for the production design and visual effects.<br><br>Is this a perfect film? Of course not. No film is. But it is entertaining and the story stuck with me. What more can I ask for?","user":"jimtolano","rank":[71,103]},{"title":"Trouble was I've wasted my life to watch this crap","rating":7,"date":"7 April 2018","review":"Yeah, what a load of crap! Fooled me with a jargon of \"Neo Noir\". You don't have to be that stupid to use some saxophone soundtrack to tell people this film is a NOIR, NOIR, NOIR. The private eye does not have to be always in a jam, down and out in L.A. and couldn't afford the rent and got 30 days pay or out eviction notice. <br><br>Jesus, this film just looked so pathetically pretentious and ridiculous. More like adapted from a lousy comic book or a children's book. A horrible fantasy for the brain dead adults. Absurd screenplay, scenarios and plots. Nothing is right. A complete waste of time. Like watched a lousy poor staged play in a theater. Characters are all comic, over-the-top costumes and make up. A missing person case or several murder cases, who cares! Don't forget to pay your 2017 income tax and your property tax before the deadlines, they are more important than wasting your time and money to watch this stupid Neo Noir film.","user":"LogicIsEverything","rank":[19,29]}]