[{"title":"Ben 10 in the ultimate alien rumble!","rating":9,"date":"2 April 2012","review":"As the classic franchise went on, awesome as it still is, I was starting to miss the old days when Ben first became a hero. Then this movie came out and brought back the shape-shifting hero's younger self into an awesome, action-packed, computer-generated adventure. Get ready to set your watches because this is Ben 10: Destroy All Aliens! <br><br>Summer vacation is over. Ben is back in his home town to once again return to a school-failing, bullied life. Soon enough, trouble comes looking for Ben as a mysterious alien vengefully searches for answers involving the malfunctioning of Ben's omnitrix and the disappearance of Azmuth (the creator of the omnitrix). Our hero now finds himself in a conflict that has the fate of the world hanging by a thread, but thankfully he has Grampa Max, cousin Gwen, and rock-hard Tetrax to help him out. It's hero time! <br><br>So nice to see the old look of the characters and it's even nicer to see them in CG (which itself is pretty impressive). The old alien forms are back in all their super-powered glory with the same actors doing their voices. The action scenes are absolutely insane, virtually everything in sight gets destroyed as Ben, Gwen, and the aliens duke it out around the world. These may be the best action scenes in the entire franchise, and that's saying a lot! The story is pretty interesting too as it keeps you guessing on what's going to happen next. It makes enough connections between the first and second series, which to me are satisfactory.<br><br>Overall, this is the best Ben 10 has to offer. I went in this not expecting too much, and as a result I was totally blown away by all the stuff that happens throughout the film. I definitely recommend anyone to check this out-of-this-world flick out and enjoy.","user":"kevinxirau","rank":[6,8]},{"title":"Lazy attempt at revisiting the original","rating":5,"date":"1 April 2012","review":"After years of following the adventures of teenage Ben Tennyson through Alien Force and Ultimate Alien, this all-CGI movie takes us back to the Ten Year old Ben Tennyson that animation fans were first introduced to. For the benefit of all, here are the basics. Ten year old Ben Tennyson comes across this alien technology called \"The Omnitrix\" that allows him to morph into 10 different types of aliens. Together with his grandpa, who is secretly a hi tech defender of earth, and his magic wielding cousin Gwen, Ben Tennyson uses his new gift to take out any evil alien that may threaten mankind.<br><br>Over the course of the series, Ben 10 is notable for developing a rich mythos and fictional universe filled with alien technology, extraterrestrial races, almost as diverse as Star Wars. This new movie throws you right into that universe without any form of introduction to anything. So, if you are not a pre-existing Ben 10 fan, be prepared to do a lot of wiki-ing.<br><br>However, any good fan would tell you how over-done the plot is. This is not the first time where some mishap causes a recurring glitch in Ben's Omnitrix. This is not the first time where some super powered alien comes after Ben for reasons unknown. Heck, this whole plot seems like a futile follow up to \"Secret of the Omnitrix\" the previous Ben 10 animated movie (which was in traditional 2D animation and a lot better than this one by the way). So after a whole summer of kicking alien butt, Ben has to go back to school. One night he gets a summons to meet Azmuth, the creator of the omnitrix, and leaves with his ally Tetrax despite being grounded. At the meeting place, they are attacked by a blue \"Tokustar\" which disappears and an evil Mechamorph warrior ambushes Ben thinking that Ben knows the whereabouts of the mysterious Tokustar.(See what i mean by needing lots of pre-existing knowledge of the Ben 10 Universe?)<br><br>Now the mystery element is the main attraction. The show keeps the viewers asking questions until the last moment: Where is Azmuth, who is the mysterious attacker, what is wrong with the omnitrix etc. But the resolution to the story is very anti-climatic. Overall, it lacks the intergalactic scope of \"Secret of the Omnitrix\" or the novelty of the live action movies (as bad as they were). If it were not for the CGI animation, this movie could have easily been a mid season episode of the original series.<br><br>The CGI itself is another problem. The computer animation tries to translate the original anime-styled designs to 3D CGI but with sub-par results. The simples lines and colors that work so well in 2D just seems unimpressive in 3D CGI and downright lazy at times. For example, characters' hair look more like clumps of clay, clothing lack any folds, background buildings and props are hastily rendered with only the most basic of shadings. Sometimes even the mouth movements seem out of sync with dialogue. The designs are great but the actual CGI quality is sadly below mediocre; more fitting for a early 2000s TV series than a 2012 movie. Vehicles, wreckage and the like have a certain weightless feel about them and those fire, water or smoke effects look years behind the times. Just comparing this to the Ben 10: Vilgax attacks PSP video game shows you how lacking this show is in terms of quality.<br><br>The movie's only redeeming quality is the voice acting. Tara Strong and the other original voice actors return to the roles that they helped give life to and once again put forth an awesome performance. The chemistry is impeccable; just hearing Ben and Gwen bicker again will bring a smile to any fan's face. More thought seems to have gone into the dialogue script than coming up with a fresh epic story. <br><br>It is a valiant move to try and revisit the original Ben 10 but at least try to do it right. The creators could have gotten a more competent animation studio and a \"bigger\" plot to justify this movie as a movie and not a random episode of the TV series but with crappy animation.","user":"xamtaro","rank":[6,9]},{"title":"Ben 10 perfection","rating":10,"date":"26 February 2019","review":"The perfect Ben 10 film for any fan and any kid. This film takes every original voice actor from the original series that the new series very much lacked, and it gives you a sense of nostalgia and a feeling of this being a new chapter in your childhood. This film is visually amazing making the Cg animation feel completely natural. The story is very simple and varies between generic and episodic. The villain is somewhat weak until you find out his backstory which is told at the very end. The characters feel like the same characters from the original series, the writing is brilliant, and the dialogue is perfect. The banter between Ben and Gwen is fun as always, and it gives you a lot of hope for Ben 10 after the lack of quality in the TV shows. This film is very fun and will leave you feeling like a kid seeing Ben 10 for the first time.","user":"dp-17275","rank":[2,2]}]