[{"title":"Pleasant comedy that's worth seeing","rating":8,"date":"12 October 2013","review":"In a World . . . was written, produced, and directed by Lake Bell. Can you guess who stars in the movie?<br><br>This modest comedy takes place in the mini-world of people who do voice overs. Apparently this world exists. And, like all such worlds, it has stars, former stars, people who want to be stars and will make it, and people who want to be stars and won't make it.<br><br>This world also has alliances, feuds, betrayals, burning hates and burning loves. It's the same as any other profession, except that it's invisible to the rest of us. (When was the last time you knew the name of someone doing a voice-over?) <br><br>Bell is a good director and a good actor. (And, yes, her voice is fabulous.) She keeps her excellent ensemble cast moving along. The story line starts with boy meets girl, so you know how it will end, but there are enough unexpected twists and turns to hold your interest. It will work well on the small screen. My advice--seek it out and see it. Just don't expect a movie that's so powerful that it will change your life forever.","user":"Red-125","rank":[61,78]},{"title":"Make more movies like this one!","rating":8,"date":"31 August 2013","review":"After watching an infinity of trailers for violent, over-the-top, sci-fi or thriller or political espionage movies coming down the pike, my question is Why aren't there more charming and happy movies? They sell well too.<br><br>So what a delight to see In A World.<br><br>It is a quirky and sophisticated comedy. Perhaps it is a chick-flick, but not overwhelmingly so.Yes, some of the criticisms herein are true, but not damaging enough to detract from a thoroughly enjoyable cinema experience. The acting is terrific, the plot and subplots are simple, the humor is amusing and even at a couple of points a true belly laugh, and altogether, the movie is a winner. Kudos to Lake Bell and team.","user":"nyccents","rank":[64,92]},{"title":"One of the best movies I've seen in 2012-13","rating":10,"date":"14 February 2013","review":"A friend invited me to a Sundance USA event in San Francisco, where they take 10 films from the festival and show them in different cities around the US. I had no idea what the movie was even about, and obviously no expectations.<br><br>I was completely blown away. 'In a World' was one of the funniest, cleverly-written and flawlessly edited movies I've seen this year (2012-present). From Demetri Martin, Rob Cordry and Lake Bell herself, the acting was fantastic. I had seen Lake Bell in 'How to Make it in America' and thought she was great, but I had no idea how unbelievably talented she is (i.e. playing an accent- obsessed speech coach/aspiring voice-over actress who does probably 10+ flawless accents throughout the movie...a movie she wrote and directed as well. No big deal).<br><br>I'm not sure if this movie is getting distributed to a wider audience, but I'm grateful my friend convinced me to go. If you have a chance to catch this, it's a must-see.","user":"charles-hale","rank":[86,127]}]