[{"title":"Another Perspective","rating":5,"date":"13 August 2017","review":"First time to see it tonight . Of course Forest Whitaker performance is excellent , movie as a whole is average . Have one or two remarks . Why a black man ? it could have been a white man and the same events would have happened with him too !!! or was that to reflect a raciest problem ? that wasn't clear too . <br><br>Why make him a \" Muslim \" who converted to Islam during his 18 years prison time ? what really reflected that ? from my view as a Muslim ...nothing but view shots but not a behavior , he drinks , living with a woman without marriage ...which would have been more normal behavior for a regular Muslim not a converted , practicing ones ,who prays at Mosque , ones whom usually have stronger faith .","user":"khaledkhattam","rank":[7,8]},{"title":"40 years on","rating":7,"date":"19 June 2014","review":"My summary line making the point that this is a remake many years removed from its (french) original. I haven't watched the original, so I cannot tell you how the two movies compare. I can only judge this by its own merits (and faults). What I can say, is that Whitaker is giving an excellent performance. It's also nice to see Harvey Keitel in a bigger role, even if it sometimes turns a bit comic evil, he has the gravitas to pull it in.<br><br>The age old question within this movie is: can we escape our pasts? Can we change and become someone/something different? Can we ever truly repent and is there such a thing as forgiveness? Those are heavy topics and the movie does not stay away from other topics as well (like religion, though it's not really made a big strong point, other than being there). You can tell early on, if this is the kind of \"entertainment\" you like to watch or not ... the rhythm/pace stays the same throughout (occasional outbursts excluded)","user":"kosmasp","rank":[19,34]},{"title":"Exquisite film -- a real sleeper","rating":8,"date":"4 September 2016","review":"\"Two Men in Town\" (2014)\" is a brilliant blend of acting, directing, cinematography and setting. Why isn't this film better known? It's a real sleeper that ranks up there with series noir classics of the US Southwest -- from \"Bad Day At Black Rock\" (1955) through \"No Country For Old Men\" (2007). Yet one can see why this gets a low IMDb rating, probably low US Box Office too. This is not a happy film. This is not sunny, funny New Mexico. Another \"Milagro Beanfield War\" with a magically satisfying ending. \"Two Men in Town\" is richer; traditional and innovative at the same time. Acting A+; equally the DP work. This is both Cop Show and Western. Bigger than a single genre. Here be the desert -- of the soul. Here be echoes of Camus' \"The Stranger\". Here be an austere foreboding world from which man or woman cannot escape. God has left. Check it out. Good luck.","user":"jdeureka","rank":[8,12]}]