[{"title":"Excellent documentary and fun to watch","rating":10,"date":"28 April 2013","review":"There are some very miserable spiteful reviews on here. They usually contain such revelations as 'I don't like Katy Perry's music and hated this movie'. Er... what are you doing watching a film about Katy Perry if you don't like Katy Perry's music. I know, you came to be bored and to dislike it and you succeeded. The film contains a very revealing and surprising story about a genuinely gifted songwriter breaking out of her strict religious upbringing and rising to the very highest peak that anybody could possibly wish for. She did it through shear determination and spirit. She did not get it handed to her. She was in fact jerked around by all the record companies and almost sunk until, in one memorable quote, one of the young female execs stole her music from the company and 'snuck out' with it, so that she would be free to find success at another label which had people of some imagination and vision instead of the lame egotistical dicks that she was tied to at that time. Her message is absolutely positive, absolutely empowering and liberating for young girls, and the concert footage shows just how transcendent that message becomes for them at the live shows. She is not sleazy or nasty or stupid. If I had a daughter I would strongly approve of her being a 'Katy cat'. I enjoyed every minute of this documentary. Those who hated it are most likely sad old men or jealous bitches. I reckon.","user":"toby-brace","rank":[16,21]},{"title":"Exactly what you expect it to be","rating":7,"date":"6 July 2012","review":"If you go into this movie as a fan of Katy Perry, you'll love it. If you don't like her at all, you won't like the movie. Plain and simple.<br><br>As a fan of Katy Perry, I juggled with the idea of actually paying money to see this in the theater because I wouldn't say I'm a hardcore fan. But I decided I would go to experience the 3D effects. The 3D did not disappoint. It added a dimension to some of the concert scenes making the atmosphere fun and bubbly. The concert scenes were mixed in with behind the scenes looks at what goes into being Katy Perry.<br><br>Now if you are not a huge fan of her, you probably won't want to see the movie. It does give a really personal and at times, tragic, look into super stardom. And at the end of the movie you might find yourself liking Katy more.<br><br>Overall, it really is a film for fans. Nothing more, nothing less.","user":"filmnoob007","rank":[35,55]},{"title":"Where's the concert movie, though?","rating":7,"date":"6 July 2012","review":"If you don't like Katy Perry then don't go and see this film. If you've never heard of her, then here is a quick heads up about her and about this (self-produced) movie. After kicking away from a very religious upbringing (while retaining her faith), and paying some serious dues, Perry hit it big with the self-aware and mildly salacious single I Kissed A Girl and the excellent album it came from, One Of The Boys. More hits followed as Perry worked her little Minnie Mouse strawberry flavoured socks off touring the album across the world in a series of relatively small gigs. The second album (discounting an Unplugged fill-in), Teenage Dream, enjoyed massive success and spawned 5 (and counting) major hit singles. Perry toured this album with a major stadium worldwide tour throughout 2011 featuring a two hour show laden with dancers, costumes, effects and so on. 3D footage of tour performance forms the backbone of this film as it tells Perry's backstory and also provides backstage footage of the tour and also the disintegration of her relatively brief marriage to bad boy comedian Russell Brand.<br><br>Despite being a 60 year old Englishman with two grown kids - hardly part of the Perry demographic, and certainly not one of her \"KatyCats\" - I have a lot of time for Miss Perry. If nothing else, she is a grafter, and I respect that highly. She is also a strong individualist with a huge sense of fun as regards style and presentation. Her songs are melodic and often lyrically witty and saucy (though with a regrettable leaning towards crassness in places on the more recent album). Her vocal style, while limited to essentially a full-throated pop blare or else falsetto, suits her material.<br><br>The concert footage - all of it interrupted by cutaways and voiceovers - made me wish that a full 3D concert movie was available. I enjoyed it, but was enormously frustrated at not being able to experience a single number all the way through.<br><br>The non-concert footage is interesting (and one must bear in mind that the edit was almost certainly under Perry's complete control). I was already aware of most of the personal history, but it was interesting to meet family and friends and to understand that she has a strong support structure in place. The scale of the more recent tour was impressive, and it was good to see her enthusiastic interaction with her fans, especially the young ones: not all acts are as available, even if only in rationed doses. Also interesting and moving were the sequences shot around the marriage breakdown. Kudos to Perry for including them (I contrast this with Paul McCartney's concert DVD immediately preceding his marriage breakup, where Heather Mills has been edited out completely, while she is all over the previous one). These sequences don't take sides, they simply present a glimpse of the impact on Perry towards the end of a major tour, and her professionalism in the face of difficult personal circumstances.<br><br>I suspect that the best stage performances feature a considered performance persona - a \"stage face\", if you like - fuelled by talent and part of the personality of the real person behind the mask. Sometimes the two meet, and the audience sees the real person through the stage mask: that is magic, and it happens here.<br><br>A film which started out having me go \"Oh dear\" at the gushing tributes from young fans left me with increased respect for Perry, and the feeling that maybe she's not a bad role model for impressionable young girls.","user":"neil-476","rank":[16,23]}]