[{"title":"Excellent docudrama for the bodybuilding enthusiast","rating":10,"date":"21 September 2013","review":"Bodybuilding is fascinating. There's an unspoken camaraderie among those who eat, live and breathe bodybuilding.<br><br>Just like in Pumping Iron, the champion, Phil Heath is depicted as the villain and like Lou Ferrigno, Kai is the hardworking underdog.<br><br>Ben Pakulski is sort of the \"Ivan Drago\" of this docudrama. Dennis Wolf has a particularly awkward comedic scene and Roelly Winklaar is absolutely hilarious.<br><br>I am so glad the director, Vlad Yudin did not show Branch Warren shouting swear words and throwing weights.<br><br>The plot is really all about Kai vs Phil. To people unfamiliar to bodybuilding, the footage of the other bodybuilders can seem out of place since the audience doesn't get to form any type of connection with them.<br><br>They do touch on anabolic steroids but it is very limited. \"Bigger, Faster, Stronger\" is a better documentary for that but it is nice that they do mention it instead of ignoring the elephant in the room.<br><br>I follow bodybuilding very closely so a lot of the content seems redundant, but I still gave this a ten just because I love bodybuilding. It's great to see that somebody is at least trying to break it out of it's shell and I support that 100% percent.<br><br>Bodybuilding is such a niche market and outsiders have such a close-minded opinion of it that I highly doubt this film will make much of an impact but I sincerely thank Vlad Yudin for the effort.<br><br>P.S. It was quite amusing seeing some of the gigantic audience members trying to get comfortable in the seemingly tiny movie theater seats.","user":"elchinonino","rank":[46,59]},{"title":"A peek into the world of Mr. Olympia","rating":8,"date":"24 August 2014","review":"This was a very interesting documentary, very well put together and you feel you're following these people on their journey to become the next Mr. Olympia. Mickey Rourke as narrator adds a nice touch to it. This is not simply about muscles, it's about what it takes to get to that level and what drives them! It has a nice human element to this which makes you feel for the people you're watching, you see the pain they go through and whilst I'm not an avid supporter of body building you have to give credit for such sheer dedication. It's not a controversial documentary, however nonetheless it kept me entertained and hopefully you'll find it a very pleasant watch too :)","user":"purpleprinc3","rank":[7,7]},{"title":"Interesting look into modern bodybuilding","rating":6,"date":"27 April 2014","review":"Interesting look into how things have changed in the world of bodybuilding since the cult classic Pumping Iron came out. Overall, the film was well shot and edited with a fairly in-depth look at some Mr. Olympia hopefuls. Overall the movie is more of a commercial for bodybuilding than it is a balanced documentary. However, it was definitely worth watching.<br><br>The elephant in the room is the fact that genetics, nutrition, and exercise science haven't changed enough over the past 30 years to make these guys look like something out of a comic book. They are taking steroids....lots of them. There is a plethora of medical evidence that steroids cause deleterious effects on the body, which the film acknowledges. One could argue that all professional athletes are using them, but bodybuilding is different. You HAVE to use steroids in order to compete, and there is no real effort to prevent there use. As a physician and a longtime weightlifter it pains me to see so many people pursing this hobby/sport at the expensive of their health. Most of it boils down to money for advertising and supplements. <br><br>Overall, an entertaining movie, but a painful reminder of what bodybuilding has become.","user":"coolguy1541","rank":[20,25]}]