[{"title":"Good Flick","rating":8,"date":"27 July 2013","review":"I will be short and sweet (kind of like the film was) and won't go into a summary as the rest of the well-written and accurate summaries have been thus far. I thought this film was really good. The casting was great, as was the plot and story line. It was a touching story, where despite the indiscretions of a married couple, you had them rooting for each other to find their way back to each other and to bring their family together.<br><br>The movie went fast and even though you hoped for a happy ending, you weren't quite sure how it was going to turn out. I won't spoil it, but the ride to the end was worth it. It is a cute, summer drama that is worth checking out.","user":"nikicianciola-702-657633","rank":[61,76]},{"title":"The quintessential \"sweet little indie,\" overflowing with authenticity","rating":8,"date":"5 October 2012","review":"As I make the festival rounds every year I search for that elusive \"sweet little American indie.\" I don't come across them very often, certainly not often enough, but when that moment happens there's a little pitter-patter in my heart as I know I'm witnessing what could be the launching pad for hot new talent -- writers, directors, actors -- who will go on to produce exciting, creative work in the years to come. I found that here in \"Writers.\" <br><br>First-time writer/director Josh Boone has crafted an exquisite film which successfully combines several themes that few are able to tackle successfully. Like David Gordon Green's \"Snow Angels,\" my #1 Top Pick of 2007 and one of my favorite indies of the past decade, we see three couples struggling to cope with the primordial human connection -- the innocence and fear of first love, the seesaw of a mature relationship, and the pain of an estranged couple. Ironically (or perhaps not), \"Writers\" is privileged to have enlisted Green's longtime Director of Photography Tim Orr. But this is a much lighter picture than \"Snow Angels,\" making it especially accessible to young people and families.<br><br>Greg Kinnear is William Borgens, the classic what-have-you-done-for-me-lately author who hasn't had a hit in ages but refuses to allow anyone to sense his self-pity. His wife Erica, played by Jennifer Connelly, is the quintessential partner cast aside at the expense of William's inattention and indiscretion. Their teenage children Samantha and Rusty, portrayed by Lily Collins and Nat Wolff, are discovering their own offbeat paths into the wacky world they've inherited. High school student Rusty, in particular, is a struggling writer himself who is beginning to experience the first frightening pangs of adolescent desire. Dad isn't the best role model, after all, but this is a father-son relationship that has promise if either or both can get their acts together. Samantha is in college and headstrong in the ways of a young woman determined to control her life and career at the expense of entering the dating scene and submitting to the wants of a man. Enter Lou (Logan Lerman), the earnest intellectual who'll stop at nothing to win her over.<br><br>From top to bottom -- Kinnear, Connelly, Collins, Wolff, Lerman -- \"Writers\" is perfectly cast. All inhabit their roles as if they created them. In fact, to some extent, that's true as the dialogue's authenticity is at least partly rooted in Boone's generosity in allowing the actors to improvise some of their material (a technique favored by the aforementioned David Gordon Green, as well). Wolff, in particular, takes advantage of this opportunity to add a good deal of the narrative's comic relief with his ad-libbed lines. Interestingly, he did the same in last year's Toronto hit \"Peace, Love, &amp; Misunderstanding,\" in which he played virtually the same character -- a naive youth, physically inexperienced, gently and innocently exploring his potential with the tender yet intimidating opposite sex. Lerman, 19 at the time of filming, played a 15-year-old in his other world premiere selection at this same festival, \"The Perks of Being a Wallflower.\" In \"Writers,\" he goes in the opposite direction as a 21-year-old who couldn't be more different from Perks' Charlie. In that film, his role is similar to Wolff's as the vulnerable virgin. Here, he's a self-assured, bright college student who is destined to charm Samantha off her feet. The fact that he can convincingly portray both these characters in two pictures at the same festival is testament to his talent and versatility. As his would-be suitor, young Lily Collins is an able foil to Lerman's advances and wins over the audience with her sharp wit.<br><br>The adults who anchor the film deserve far more credit than they're given. Jennifer Connelly, who won an Academy Award opposite Russell Crowe in 2001's \"A Beautiful Mind,\" is a beautiful soul inside and out as the wounded spouse who still has a place in her heart for a potentially loving husband. He still holds a torch for her, as well, an intensely personal plot device that could easily lack credulity in the hands of lesser professionals. Oscar-nominated Kinnear proves once again why he is one of the industry's go-to guys. Few actors handle comedy and drama equally well, and he has no problem convincing the audience as a tormented has-been. He may be down on his luck but retains the earnestness that brought him fame and a loving family not that long ago. He's poised for a comeback and it's a role tailor-made for Kinnear.<br><br>The film is technically well-balanced between slick Hollywood production values and a relaxed indie look. Bright lighting belies the turmoil beneath the surface. The quaint beach house setting used in many of the scenes is awash with a color palette of earth tones and rustic furnishings, a counterculture milieu befitting this family of intellectuals. Mike Mogis and Nate Wolcott's score is combined with a soundtrack of indie music featuring Conor Oberst of Bright Eyes, whose attraction to the material led him to write original music for the movie.<br><br>Tim Orr is truly a master cinematographer. His signature style is the ability to capture beauty in nature and everyday objects -- a dripping gutter here, a playground swing there -- and photography that is comforting, enveloping the actors in a warm glow that matches their affections. Nobody does it better. Boone was truly fortunate to have Orr on board.<br><br>\"Writers\" is overflowing with the authenticity of real life. You'll laugh, you'll cry -- often in the same scene -- and, most of all, you'll empathize with at least one of the characters. There isn't one of us who hasn't experienced the feelings and emotions exhibited by the members of this richly complex family. That's key to this ensemble that features many of our best and brightest young independent film actors. For what I expect a \"sweet little American indie\" to accomplish, \"Writers\" is simply perfection.","user":"larry-411","rank":[63,90]},{"title":"Cold November night flick.","rating":6,"date":"21 September 2013","review":"Stuck In Love is the perfect film to be placed in my November film category. This category is specifically for films that make you feel good, make you shed a tear or two and are full of clichés. 'Stuck In Love' is all of these things. I will start with the plot: The film is based on a broken family where the father played by Greg Kinnear (typical dad actor) is still head over heels in love with his ex wife played by Jennifer Connelly. His two children, Sam and Rusty, played by Lily Collins and Nat Wolf have responded to the divorce in different ways and the film follows all four characters as they fall in and out of love. <br><br>The script written by, and directed by Josh Boone (new comer) is clichéd to say the least. He uses various quotes from literature to make his characters seem intelligent and interesting. Personally, I love these sort of characters however, I understand other viewers who would find these characters pompous and not very relatable. <br><br>Now on to the acting which I think was rather good. Characters who really struck me where Rusty played by Nat Wolf. I feel like he really excelled in the whole second kid syndrome. I didn't necessarily find his characters a refreshing and new character, although I found he played the part extremely well. Kudos to you man. As for Lily Collins, compared to her other work I think it's safe to say she's making better choices. I mean what was abduction all about? I think her character was more interesting, she played the douche bag girl which was interesting as it's usually the douche bag guy. Logan Lerman was well Logan Lerman. He wasn't the central character which, I think made me like him more. But hey, what can I say? He's totally adorable but nothing to call home about. Greg Kinnear is also Greg Kinnear. I'm pretty sure he plays the exact same dude in every freaking film. I swear William the dad from Stuck In Love is Steve the dad from The Last Song. I love Kinnear and would love him to just do something a little bit more interesting and out of his comfort zone.<br><br>Overall, Stuck In Love was a clichéd film from clichéd land. But everybody loves a clichéd film now and then? I really enjoyed it. Josh Boone is going to direct The Fault In Our Stars which makes me feel a little relieved and a little excited. Stuck In Love scores 6 Kayne Faces.","user":"sianpretorius","rank":[26,38]}]