[{"title":"A Nice Sidetrack to the Original, if Occasionally Over-Similar","rating":7,"date":"19 April 2017","review":"Back to the pond for Pixar, where we find things largely unchanged from the end of 2003's Finding Nemo. As the continually-forgetful blue tang Dory has a sudden enduring flash of her childhood, a rush of recall, she gathers the clownfish for one more globe-spanning adventure. The setup is a little soft, lingering too long in the shadow of the first film, but eventually we break free of that sentiment and forge a new (if similar) identity for the sequel. The closed-in landscape of an aquatic themed zoo/amusement park feels a bit claustrophobic at first glance, but as hijinx ensue and we learn more of Dory's early years, it all fleshes out nicely. No shortage of colorful new characters there, literally and figuratively, not the least of which is Ed O'Neill's escape artist \"septipus\" (having lost a tentacle in the touch tank), who treads dangerously close to becoming a deus ex machina with his versatility. O'Neill brings his usual disgruntled pessimism to the role, though, and some genuinely clever sight gags using the creature's natural assets go a long way to smoothing that over. He's overly convenient, but we're always glad to see him again. Witty and fast-paced, with a good mix of gags for the adults and their kids, plus a potent dose of the studio's famed poignancy. I laughed, I misted up, but I never quite fooled myself into thinking it was superior to the first.","user":"drqshadow-reviews","rank":[27,33]},{"title":"Going away","rating":8,"date":"12 June 2017","review":"This is a really good sequel. Taking characters from the first one and putting new ones in there as well, it never gets boring or seems to repetitive. And you don't even have to be Dory, I mean forgetful, for this to work for you. Yes it does make sense to watch the first one (Finding Nemo) then, although I reckon you could watch it and enjoy it as a standalone too.<br><br>The characters and their traits are strong and there are a lot of side jokes built in to this too. Humans are being treated like extras and we wouldn't have the time to deal with them anyway. That is apart from one major voice - but it's being highlighted too as if one of the writers or Ellen herself might have a crush there. But you can't blame them for that. On the contrary you can congratulate everyone involved for a really good movie","user":"kosmasp","rank":[27,38]},{"title":"No walls in the ocean","rating":10,"date":"10 March 2017","review":"I've never been into animation and my comments probably reflect it. Not for any silly quibbles about real cinema versus not, kiddie versus adult; it's simply that the real world that threads itself around us is too marvelous and fantastical, too full of myriad possible worlds to envision, to forego the opportunity. Okay, but this leaves me free to observe these few things here.<br><br>It really has taken a quantum leap the last decade in trying to replicate our world after that business with dead eyes was over. Is there anything more extraordinary than texture and light falling a certain way? An audience of Disney's time would have been baffled by what kind of reality this film shows.<br><br>The most fantastical quality of reality is that I can open the door and go wherever. The thinking mind will hold me back nine times out of ten, but the fact that our lives play out against the possibility is behind any life worth being lived. Spontaneity. It lies at the bottom of all the other structures we observe around us and at the bottom of almost every great film I know of.<br><br>Pixar's main structure in building world - and what sets them apart from previous studios - is finding a small corner of our own world to animate, say toys in the attic, we can then have the delight of secret lives right under our feet. The more ordinary and familiar this corner is, the more often we can imagine passing through it, the better. It's the difference between Toy Story and Cars. It lets them filter in the following way; the larger surrounding human world retains its quality of callous indifference as we think of it ourselves, our gaze is directed to the magical world-within where fragile beings have to struggle with predicaments like ours. <br><br>The primary thing to note in tandem with this is how the rest has been engineered around spontaneous expression. Pixar are something of a master in how things flow, how walls can be moved around to facilitate experience. It's all about turbulent motion that zig zags over barriers; through ocean streams, a bird flying us overhead, through tubes inside the marine park, hijacking a truck. Things magically work out, even when our heroes don't land in the right place, they do.<br><br>And you'll see this in the story about a narrator who continuously forgets, has no plan about how she's going to accomplish what she wants other than the urge to find her parents, but makes her way by rubbing against limits of where she finds herself, spontaneously opening ways.","user":"chaos-rampant","rank":[24,36]}]