[{"title":"Clever and above average..!","rating":7,"date":"19 July 2015","review":"This is not the kind of movie that will stay with you forever. I have seen better animated movies in the past. BUT it's a movie that you will definitely have a good time watching, laughing and laughing again. I loved the way this little alien was depicted, using Jim Parsons' ticks and facial expressions! The concept of the aliens taking different colors based on their mood was just to die for!<br><br>The story was OK and the time it lasted was sufficient (I always root for longer movies instead of shorter). Overall, it was a cute cute movie in the end! We laughed a lot, and although we are genre-fanatics (being in our 30s watching these movies without kids), I think that the average movie fan will also like it. <br><br>It was time well-spent on a movie and I sincerely recommend it!","user":"palavitsinis","rank":[41,57]},{"title":"OK, but disappointed","rating":6,"date":"4 April 2015","review":"Took my 8-year-old girls. It was cute. They enjoyed it well enough.<br><br>But on the car ride home, when I asked about their favorite part, the best they could come up with was the cow joke (I won't repeat it).<br><br>After all the great animated kid's movies of the last 10 years (Nemo, Shrek, Cars, Frozen, etc), this one is completely forgettable. In a month or two, my girls won't even remember it. Can't imagine they'll ever ask to get a DVD or watch it at home.<br><br>I'm not sorry I took them, nor was it a waste of money. But we are so spoiled by such great animated movies that a mediocre one like this becomes disappointing.","user":"giofls","rank":[83,132]},{"title":"An Excellent Adventure with some good lessons to learn","rating":10,"date":"21 March 2015","review":"I had not really high expectations on an animated movie, my son would probably enjoy something like this way more than me I thought. Huge Fail. The movie was from the beginning great and not only for kids. It is a feel-good movie for all ages. It is about family , friendship and that being different or just being yourself is not a bad thing at all. I found the movie throughout entertaining and very often funny.<br><br>The Boov's are just too funny in particular Steve Martin as the voice of Captain Smek, whose firm leadership of the Boov people is undermined by his ridiculous fascination with human artifacts such as bubble wrap . He reminded me partially on King Julien from the Penguins of Madagascar.<br><br>But even if you are not touched by the great story you will certainly love the Soundtrack. The whole movie was perfectly set and is for me the best Dreamworks movie since a long time. Take your kids and watch it on the big screen, they will love it! and you too, guaranteed.<br><br>Verdict: A great story meets perfect cast and nothing can go wrong on this alien/ human road trip movie.","user":"tomas1810","rank":[66,108]}]