[{"title":"Familiar but charming, definitely worth a watch","rating":7,"date":"5 January 2017","review":"Being a lifelong fan of animation and ballet, 'Ballerina' seemed very appealing to me. Plus who doesn't love an underdog/person who wants to succeed at something they love against adversity story.<br><br>While not up there with my favourite animated films, or one of my favourite films of 2016, 'Ballerina' is nonetheless charming with a lot of delights. It will delight the younger crowd, but fellow ballet fans will also be charmed and there should be enough for adults to find value. 'Ballerina' is much more than a film for \"little girls\" or \"just for kids\" and does a good job telling a type of story that would be relatable to anybody.<br><br>Coming from somebody who overcame disabilities and bullying and wanted to sing professionally and get training and experience, it took a long time but I got there and have not looked back, 'Ballerina' clicked with me.<br><br>Of course 'Ballerina' isn't immune to flaws. The story is very familiar and does get predictable, while the characters are very likable but slightly skim-surface archetypes. However, this may seem very nit-picky and can easily be ignored by people and only problems for the toughest of critics.<br><br>Aside from these, there were also reservations with some of the soundtrack and one voice cast member. The music is often beautiful and infectious, with some genuine enchantment, but could have done with more classical music choices and less pop. A good deal of the pop tunes are very catchy, but more Tchaikovsky would have suited the film better and been more dynamic and a few others grate. Dane DeHaan doesn't sound right as Victor and doesn't fit, sounding too mature for a character clearly intended to be much younger, either he should have tried to sound younger and more boyish or the character should have been voiced by somebody in his late-teens.<br><br>However, the animation is very good, often excellent, especially in the beautifully studied and meticulous background details and the intricate and graceful choreography that synchronises with the music very well and shows animators that have clearly done their homework. As said, the soundtrack does mostly work, while the script makes a real attempt to appeal to both children and adults (being a family film) and, with a nice mix of humour, pathos and life values and never being over-complicated or childish, it does succeed.<br><br>The story, even with the familiarity and predictability, goes at a neat pace and as well as having a lot of charm and heart the messaging never comes over as preachy and very much valuable. It is also easy to see why anybody would find it inspiring and easy to relate to, as a young adult both were very easy for me. Even though archetypal, the characters are still likable, the title character has her flaws but it is easy to quickly warm to her. The voice acting, DeHaan aside, is strong, with Elle Fanning and Carly Rae Jensen bringing emotion and spirit to their characters and Maddie Ziegler stealing the show.<br><br>In summary, a familiar film but a very charming one and one to be seen without prejudice. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[43,51]},{"title":"Dreaming's easy, but chasing it needs all the effort.","rating":7,"date":"4 May 2017","review":"Well, I praise a lot, particularly the European animations for preserving the 2D animation. That does not mean they lack behind in 3D format. The recent film 'The Little Prince' was the perfect example of a quality 3D animation outside Hollywood. Pars with Disney, Pixar standards. Technically, as well as the story contents. But the quantities are very less and also making it a bit expensive. So they usually prefer producing it in the English language for the wider/international market, keeping North America particularly in mind. This is a French English-language film that co-produced by Canada.<br><br>This is a nice film, that particularly targets little kids and mostly the girl audience to inspire Ballerina. Cute characters and scenes, but very familiar story. Shares lots of similarities with 'August Rush', except the field of interest. I am not an expert or know all about Ballet, but some of the parts involving them were turned me off. I know the gravitation force is irrelevant in animation since they're not real world to comply with science, but maybe I'm being an adult and knowing that stuff might have influenced me to think that way. It reminds me I'm really an adult, though this film should be watched as a kid despite whatever you are. However, nothing affected me from enjoying it.<br><br>It sets in the 80s of the 19th century France. At the time when Eiffel Tower and Statue of Libery were on the construction, a poor orphan girl named Felicie escapes orphanage with another boy to pursue her dream to be a ballerina. Then they arrive in Paris, and very soon they find their separate ways to achieve the goals. Not all smooth sail, especially for her. So she takes the opportunity that comes her way, even after knowing it was wrong to do.<br><br>❝You have something that she can only dream of: passion!❞<br><br>From there, with all the complications tailing her, how far she could go to make her dream come true. Which also includes the amount of dedication put on her undertaking to meet the expectations of her trainer, rivals and many others. And to show the world the interest is not simply based on enthusiasm, but willingness to sacrifice anything for it. Her journey from nothing to the edge of something new to define her life is the film that briefs for just short of 90 minutes.<br><br>This is not another 'Billy Elliot'. Animations are usually comedy, fantasy and musical, but recently the adventures and science fictions are surging. I don't remember I ever have seen an animated dance flick. Not the classical dance, not in the modern 3D animation format. The closest one was a decade old 'Happy Feet'. So that makes it is a unique product and comes under a must see for all the animation fans. But the storyline is predictable and many sequences were intentionally dragged to be cliché. Because it works, particularly if they're aiming for the younger generation who haven't seen many films in their lives. Only we the grownups whine.<br><br>Most of the voice-over artists are well known Americans actors which boosted the film. The character combinations are good. It brought the variety, especially slightly to ride off the main theme in a few occasions. Like the boy's interest in inventing things which were other major parts of the twist and turns in the narration. It is not a great animation if it was from Hollywood, but coming from France and the theme it focused on, the effort must be appreciated. Overall a much better film than what the average reviews and ratings around the internet says. It is a ballet film means not those who love it should watch it, but those target audience should not miss it. That means generally worth a watch, but not for everyone.<br><br>7/10","user":"Reno-Rangan","rank":[15,17]},{"title":"A delightful underdog story.","rating":7,"date":"25 December 2016","review":"Something tells me there's more to the film than just a wannabe ballerina setting out to achieve her dreams. I could be very wrong but I believe his to be a personal accomplishment for French director/screenplay writer Eric Summer who comes from Brittany himself, where this story starts at an orphanage in 1879. <br><br>Enlisting the talent of French animator who was partly responsible for one of my favourite animated movies, Belleville Rendez-vous, Éric Warin sits alongside Summer in the director's chair and what they give us is a delightful underdog story. <br><br>The focus of the story is on Félicie, voiced by Elle Fanning, an ambitious yet rebellious orphan girl who dreams of becoming a dancer, constantly attempting to flee the orphanage to Paris, in pursuit of her ambition. <br><br>She's not alone in either dream-chasing or escaping the orphanage. Victor, voiced by Dane DeHaan, an obvious admirer of hers also wishes to leave to become a famous inventor, so the two of them embark on an adventure finally reaching Paris and with various strokes of good fortunate, end up where they both want to be. <br><br>The voices don't necessarily match their characters, DeHaan being far to old (apologies, 30 isn't old, but...) to voice a teenage orphan. Pop singer Carly Rae Jepsen does a fine job of voicing broken ballerina, Odette, but I'm most impressed with Sia's music video dancing star, Maddie Ziegler, voicing the spoilt, stuck-up Camille. <br><br>It has all the ingredients of a simple yet pleasing underdog story with some impressive and enticing animation. The dances themselves are superbly gracefully and the details are brilliant. There's troublesome emotions, difficult choices and quite a few triumphs with a clear message of never giving up and what ever you do, do it with heart. <br><br>It's predictable but that's forgivable being a children's film. It's loaded with touching gestures and typical twists that make the film memorable but is equally loaded with unnecessary silliness and feels a little rushed in places, possibly to keep children's attention. <br><br>It's not a musical but the soundtrack that accompanies the film really stands out with some great tracks from Magical Thinker, Chantal Kreviazuk and Camila Mora. Klaus Badelt does a graceful and enchanting score that does well to stand alone from Tchaikovsky's ballet greats of Swan Lake and the Nutcracker. <br><br>It's good sign not hearing any disturbances for the young audience and my God-Daughter seemed to enjoy it giving a little dance at the end. It's far from perfect but there's some great scenes and you can see the effort was put in. It's good light-hearted entertainment for the whole family. <br><br>Running Time: 8 The Cast: 6 Performance: 7 Direction: 7 Story: 8 Script: 7 Creativity: 8 Soundtrack: 9 Job Description: 9 The Extra Bonus Points: 0<br><br>69% 7/10","user":"SpoilerAlertReviews","rank":[32,40]}]