[{"title":"An Economic Inconvenient Truth","rating":8,"date":"8 May 2013","review":"I just caught this film at the 56th San Francisco International Film Festival, and I'm glad I did, because the film was one of the most informative and, quite frankly, entertaining documentaries I've seen via the Festival, and most of the credit for that goes directly to the film's \"star\" Robert Reich.<br><br>Reich is a charming and personable individual who is obviously passionate about the sorry economic state of the middle class. He presents facts and reviews history (assisted through some terrific graphics) to make his case that a strong middle class is the bulwark upon which a thriving upper class must balance. Most importantly, this middle class is made weaker by the disparity in incomes and by a tax system that seems to reward \"job creators\" who don't really create a single damn job or, at best, create jobs overseas.<br><br>The issues are pretty damn complex, but Reich and Kornbluth do an excellent job of laying out their interpretations in a simple, forthright manner.<br><br>At the Q&amp;A following the film, I asked Kornbluth and Reich if they felt any need to \"balance\" the film with alternate economic takes on the same facts. The film trots out the usual cartoonish Fox News critics, but I wondered if they thought about heading off the sure-to-come criticism that the film is too one-sided and doesn't present any intelligent alternate viewpoints. While Reich just shook his head \"no\" (one gets the impression he feels he isn't wrong so why bother,) Kornbluth responded that questions like mine ticked him off, as \"there always doesn't have to be two sides to a story.\" He compared it to the issue of evolution and \"intelligent design\". Just as intelligent design's complete lack of factual basis has no business in a documentary about evolution, he felt the economic facts presented are facts and they were presented accurately in his film.<br><br>This film is a terrific pairing of a passionate filmmaker with a passionate advocate for the working class of this nation. Recommended viewing for anyone with a stake in our country's economic survival - regardless of political affiliation. That means everyone. That means you.<br><br>www.worstshowontheweb.com","user":"soncoman","rank":[59,74]},{"title":"Actually pretty nonpartisan","rating":10,"date":"15 October 2013","review":"Former Secretary of Labor Robert Reich does an excellent job of cutting through all the b.s. perpetrated by the media about the economy to present factual information about how the economy has changed. While I have no doubt that those on the radical right will simply dismiss his film with the usual right-wing name calling, and those on the far left will say he doesn't go far enough, Reich really does explain how our economic policies have allowed the wealthiest amongst us to destroy the middle class so a small portion of the nation can amass incredible wealth. What is especially revealing is the factual information showing that vast wealth does not result in reinvestment in America -- it goes into savings and stocks since they can't possibly spend all that money. The film clearly shows, factually, how the reduction in the size and wealth of the middle class is killing our economy. It shows how salaries for the middle class have actually declined (in constant dollars) since the 1980s. It logically explains why and explains the three phenomena that have resulted. While the facts are very depressing, Reich maintains a self-deprecating sense of humor throughout. He'd make a great president, but he's just too short, insightful, analytical, and honest to have a chance.","user":"Dan_L","rank":[34,41]},{"title":"A film that should be mandatory viewing for all citizens","rating":10,"date":"4 October 2013","review":"Robert Reich's Inequality for All is an accessible primer on the motion of our nation's socioeconomic barometer over the past century. Together with a range of anecdotal human interest stories, he effectively uses statistical data to show how the country's economic health has waxed and waned over the years, who has benefited and who has not, and just how extreme the concentration of wealth has become over the past 30 years.<br><br>At the top of the economic mountain, the 400 richest people in the country have recently accrued the same measure of wealth as the poorest 150 million (i.e., nearly half the country). This extreme concentration of wealth endangers our society by making too much money available for risky speculation (e.g., the stock market crash of 1929 and the mortgage-backed derivatives crash of 2008), producing less tax revenue for government operations (because most of the rich's income is taxed at the much lower \"capital gains\" rate) as well as making government vulnerable to the exclusive interests of the richest people. For an example of the latter, half a century ago there were 26 income tax brackets, reaching up at least into the middle ranks of the upper class, but now there are only 7. Ronald Reagan presided over the elimination of the higher brackets, thereby generating a huge windfall for the richest that has failed to \"trickle down\" to the rest of us.<br><br>Through a series of graphs, Reich shows the correlation between the current, growing concentration of wealth and the rise of global capitalism, the decline of labor unions, tax law manipulation, the off-shoring of capital and jobs, political polarization, and plain old greed. The average CEO in Reagan's day made about 40X the average worker's salary; that factor has now grown to about 400X. Unlike corporate executives, most of us don't get to determine our own level of compensation.<br><br>Reich briefly mentions the favorite red herring of conservative media, which is to incessantly attack government as the root of all evil, while never talking about how the actions of members of the private sector upper class are impoverishing the country, nor how impotent government has become in the face of multinational corporatism. I wish he had said more about this, because it is a major point of misunderstanding for many people.<br><br>He also never specifically mentions the repeal of the Glass-Steagall Act during the late '90's - an event that paved the way for the crash of 2008. The repeal was driven by the Republican-controlled Congress during Bill Clinton's second term (Clinton had no choice but to sign the bill or else face a Congressional veto override).<br><br>But aside from those minor criticisms, overall, this film is a well-organized, fact-based survey of the topic, one that will make many people's jaws drop when they realize how extreme the economic continuum has become, from hyper-rich citizens like hedge fund managers making $4 Billion a year, to working-class parents with children, fighting like hell to keep their heads above water without health insurance nor any prospect for owning a home or saving for retirement.<br><br>Another manifestation of inequity is the slow erosion of our public infrastructure - utilities, roads, bridges, schools, transit systems, etc., while U.S. corporations and entrepreneurs hold trillions of dollars of revenue offshore in untaxed accounts. In prior generations, a significant portion of that sequestered capital would have been invested to sustain the \"commonwealth.\" The present extreme inequity is breathtaking, and as Robert Reich infers in his curiously upbeat manner, if we don't change the vector we're on, the prognosis for our society is disturbing.","user":"MomentaryParticle","rank":[54,69]}]