[{"title":"Holds your attention... Takes you nowhere!","rating":5,"date":"5 November 2018","review":"This movie was more about a teenager's obsessing with her breasts and sex ,then about her missing mother! Her mother's missing and given their history she assumed mom left dad, meanwhile all she can think about is sex with the detective that's on the case of her missing mother, and screwing her boyfriend who no longer desires her , which we find out why later on in the movie. For the movie to supposedly be about a woman gone missing it sure did not focus on it. It focused more on the girl coming of age and her desires, if that's the case it should have been titled A Coming of Age ,college years later she's literally sitting around her friends before she actually gets the idea that maybe, just maybe her mom didn't run away after all, maybe something did happen to her? Maybe dad is responsible? Just for her friends to tell her hey, we've been telling you that for years now! Really Columbo?","user":"bronzesrv","rank":[6,6]},{"title":"Strong Coming of Age Story","rating":8,"date":"22 July 2014","review":"Kat is a 17-year-old girl in the suburbs, growing up in the late 1980s and observing her parents' dysfunctional marriage at close hand while trying to cope with first love, relationships, sex and friendships - all the growing pains that being 17 involves. When her mother disappears one day, the police think she's probably run off, perhaps with a boyfriend; Kat thinks her mother just got so fed up with her boring, empty, perfect-housewife life that she finally left it to find something better. Kat herself doesn't know how she feels about that; truly, she doesn't really feel much of anything, especially because her mother had recently been so intrusive in her life. Her father seems meek and lost after her mother leaves, but both of them will eventually have to pick up the pieces and go on. If only Kat would stop having those disturbing dreams about where her mother might be....<br><br>This is really far more of a coming-of-age story than it is anything else; aside from some dream images, there's very little that would fit the term \"fantastical,\" even though I saw it at Montreal's Fantasia Festival. There is some very fine acting, from Eva Green as the mother, Shailene Woodley as Kat, Christopher Meloni as Kat's father and Thomas Jane as a police detective, and both writer/director Gregg Araki (from the novel by Laura Kasischke) and the cast do a very good job of capturing that confusing stage of adolescence, where one is not quite fully grown up but is certainly not at all a child anymore either. I very much enjoyed the film, even if Fantasia is an odd place to see it!","user":"alisonc-1","rank":[77,118]},{"title":"Not that great","rating":4,"date":"13 February 2016","review":"This movie is a hard movie to rate I feel, although many scenes are well orchestrated together as a movie it just doesn't make you feel anything, and the ending is clearly meant to be moving and shocking but it's really not.<br><br>Acting is... Okay, it's not bad but again the cast fail to make you sympathise with any of them, visually it's really good looking so that's always a plus but a lot of times the movie seems more focused on showcasing Shailene Woodley's breasts than anything else.<br><br>Now there's nothing wrong with them at all, in fact they are pretty neat however I'd prefer her keeping her clothes on if that meant that the director could focus on telling the story in it's best way as possible.<br><br>Listed as a drama/mystery/thriller but the drama that is feel too flat and superficial to ever hit an emotional core, even though it tries in the end but by then it's too late and based on how the characters interacted with each other previous having that boastful dramatic ending simply does not make much sense.<br><br>As far as the mystery well... sure there is some mystery I suppose but there are only so many ways it can end so it doesn't become very successful in that department either, plus most times it focuses on the teenager's sex-life more than anything else.<br><br>As far as the thriller goes, well even less there going on honestly, there's not many scenes of suspense here to be found.<br><br>No tbh it felt like this movie would work a lot better if they did it as a dark comedy and went a little more crazy with it, I think the movie could have succeeded at being that with just minor tweaks to the script.<br><br>I was debating whether to give it a 5 or a 4 but after writing down my thoughts here it has to be a 4 after all, there is talent involved but the movie just kinda feels a bit pointless.","user":"Seth_Rogue_One","rank":[16,22]}]