[{"title":"Really good!","rating":1,"date":"5 June 2013","review":"I am homeless. One day I was drinking vodka and loitering with my dog Sporky when I heard loud noises nearby. I suffered a flashback to 'nam and when I woke up I was apparently at a showing of this movie. I later found out that they had mistaken me for one of the extras judging by my disheveled appearance and the alcohol on my breath.<br><br>This is a fantastic movie. I will list my reasons in order of importance, 1 being the most important.<br><br>1. There are ugly women wearing shorts. That is my fetish. I secretly admired the butterface leading lady while pretending to check my cellphone. I don't have a cellphone.<br><br>2. Zombies are cool. The zombies reminded me of the time I got really messed up on bath salts and killed another homeless man. The police can't prove anything.<br><br>3. The loud, mediocre music overwhelmed my brain and allowed me to briefly forget about watching my comrades die in the jungle.<br><br>4. I know a couple of other homeless people who \"acted\" in this movie in exchange for beer. You know some of those \"zombies\" who suddenly vomited all over themselves and died choking on their own blood? They weren't acting. RIP Slinky, Wozniak, and Crazy Mary. It was nice to see them immortalized on the silver screen.<br><br>5. It didn't last too long so I managed to watch the entire movie without wetting myself or having heroin withdrawals.<br><br>I give this movie an A+ and a 1 out of 10 for number 1.","user":"WPoins1969","rank":[30,37]},{"title":"Why would anyone like this?","rating":1,"date":"5 June 2013","review":"Saying that it's \"just a zombie movie\" is a cop-out and suggests that legitimately good zombie films aren't legitimate art.<br><br>This movie sucks and I regret wasting my time seeing it. I realize that it's an indie movie made by some alcoholic hicks from the South (no offense) but that doesn't excuse the fact that it's very cheesy and not in a really fun way.<br><br>What was up with that Sinister Minister guy? It's kind of lame when your movie is hiring random gimmicky local celebrities. I wish that meant that this gave the movie some legitimate folksy charm or something, but it doesn't really work.<br><br>I really wanted to like this movie, but it didn't work out.","user":"EStateen29","rank":[13,16]},{"title":"Movie sucks","rating":1,"date":"13 May 2013","review":"This movie is awful. Worst movie I've seen, and I love zombie movies.<br><br>This film has nothing redeeming it. Its not funny enough to be a funny zombie movie and when it attempts to be funny it just winds up with the most cringe worthy attempts at jokes that could be done. It's not scary enough to be a horror zombie flick. The CGI gore and over the topness just make this seem like a wannabe movie to unrealistic to be scary. The film suffers from trying to find a new niche to in the zombie franchise but just ends up repeating other flicks to the point of plagiarism. The dialogue is questionable and the acting far below par. Not once could I even relate to the actors becuz they just seemed like they couldn't connect to the roles they were playing. This movie isn't even good enough to make it on Thriller or SyFy during zombie week or make it to the 49 cent ben at walmart Also, the Cody Cromartie reviewer was in the movie so don't belief him.","user":"user-684-69213","rank":[15,19]}]