[{"title":"A brilliant addition to the serial killer genre, and also the coming-of-age genre","rating":8,"date":"25 June 2018","review":"The true life serial killer genre isn't exactly over-crowded, just more that there's fictionalised ones that take more of a forefront - Hannibal Lecter, Norman Bates, Freddy Krueger all for instance - and they always portray those characters with a certain degree of appeal. However, when I was watching this movie, I was thinking of a less violent but just as emotionally wringing version of the brilliant Henry: Portrait of a Serial Killer, based heavily on Henry Lee Lucas.<br><br>My Friend Dahmer comes at the story of Jeffery Dahmer from an interesting angle; it follows Dahmer growing up at school, following from aged 17 to his first murder at 18 - the film stops just after he picks up Steven Hicks. The story as written by John Backderf, played by Alex Wolff in the film, follows him and his various friends as they both invite Dahmer into their group to use him in various pranks, but also try and be friendly with him - or as friendly as you can be to an asocial, seemingly asexual outcast who fakes seizures to get attention.<br><br>The film does have certain benefits that I would say raise it above the bar of simply \"good\" to great. Firstly, the cinematography is first class; there is so much boldness and colourfulness that does associate it much more with a coming-of-age film - the sharpness of colours does remind me a lot of The Spectacular Now, and that type of look helps the movie have a groundedness to it and make you almost forget you're watching a film about one of the most infamous serial killers in history. The script is full of very interesting scenarios about both the characters and the town that we're growing up in. You get to see the individual disintegration of the lives of both Dahmer's parents, which are brilliantly realised by both Dallas Roberts and Anne Heche, you get to see the conflicting dynamic between Derf and his friends over their treatment of Jeffery and how their whole lives are currently going off course.<br><br>The cast is strong - small, and full of little parts that still stick with you. Alex Wolff is kind of nerdishly charming as John Backderf, who views what him and his friends are doing as harmless fun and does seem to like Dahmer, really. There's a recurrent role of a doctor played by Vincent Kartheiser who Dahmer starts to fantasise over, played with a normalcy that makes the part stand out.<br><br>However, BY A MILE, the best part of this move is Ross Lynch as the young Jeffery Dahmer. The thing that makes this performance as Dahmer so interesting is that he's not an overly awkward, nerdy, introverted guy at the start of the film - he's just someone who has problems but isn't overall bad. However, as the film goes on, you see this guy growing more and more dangerously in upon himself, and the few good qualities leave him overtime - his willingness to make people laugh, his academic interests, and even his acceptance of Derf's drawings for him are completely gone over the course of the film. I won't say the film made me feel sad for him, but more despair watching someone become more and more lost than anything else.<br><br>From his graduation towards the end of the film, when he literally left entirely alone by his family, just left with a bottle of Vodka, the film's tone shifts from amusing to soulless, and it's a tone that Ross Lynch fully embraces, through an unbelievably tense scene with Derf, to the brilliant final scene where he picks up hitchhiker Steven Hicks, that felt me very emotionally shook. I really liked this film, a lot. It shows a great showcase of acting from Ross Lynch, who looks more than capable of shedding his Disney Channel image, and also Marc Meyers for directing such good material.","user":"paulmcuomo","rank":[42,46]},{"title":"SPAZ","rating":8,"date":"13 December 2017","review":"Not a comedy. I repeat, this is not a comedy.<br><br>Also of note for the squeamish set: no serial killing here, just the seemingly mundane life of a high school misfit. Jeffery Dahmer is a mopey, four-eyed moptop, shuffling through adolescence, dealing with a fractious household in the bland and brown seventies.<br><br>Of course we all know how this plays out, and that ominous shadow creates a vicious tension throughout this excellently unsettling film. Collecting and dissolving road kill in his makeshift shed lab, is certainly cause for concern, but it is Dahmer's awkward interactions with his peers, family, and authority figures, that bring the shivers. We know there is an explosion coming, but we just don't know how or when.<br><br>Based on a graphic novel by a high school chum, \"My Friend Dahmer\" focuses on the usual tribulations of teenagers searching to belong. Either bullied (nasty) or ignored (worse), Dahmer gains a strange semblance of attention by spazzing out in school. If fake epileptic convulsions means popularity, then so be it.<br><br>Former Disney star Ross Lynch brings a perfect blend of desperation and dread to the complicated lead. He has issues, but what outcast teen doesn't? Among his many quirks, Dahmer's seemingly innocuous interest in a neighbourhood jogger (a running theme throughout) is one hell of a creepy sequence, even though nothing comes of it. We see a series of small events that may point to the evolution of a monster, or to a weirdo biology major. There's a fork in this road!<br><br>This all foreplay movie succeeds brilliantly because it plays the audience, who for once, are itching to spoil the ending.","user":"js-66130","rank":[57,73]},{"title":"Somewhat slow but powerful all the same, and full of brilliant performances","rating":9,"date":"20 November 2017","review":"I'm a fan of Derf's graphic novel about his teen experiences in the late '70s with Jeff Dahmer -- as a result I had mixed feelings about a film version. On the one hand, I was excited, but on the other was quite curious how the relatively brief story could be turned into a feature length film.<br><br>In terms of storytelling, the movie works. Yes, as a reader of the graphic novel may have suspected, the pace ends up being a bit slow, but it's still compelling stuff -- the viewer is there just as Dahmer arrives at a fork in the road of his life. Which way will he take? Will he end up just being an eccentric, or will he take that other, infinitely darker road? <br><br>We all know the answer, and of course the movie has a strong tragic element to it. It's all the more tragic -- for Dahmer's victims and their families, but also for Dahmer himself -- when we see that there was just enough to the guy ... just enough potential ... to make him possibly go the other way.<br><br>At times watching the movie can be tough going, but not for the reasons you might think. Watching a kid as painfully awkward and then as deeply depressed as Dahmer go through the torture of Middle American high school can be truly excruciating, all the more so because it seems to be happening in slow motion, like watching a car crash. But make no mistake -- it is absorbing human drama, quite unique in our age of comic book heroes and lurid reality TV. <br><br>Even if you don't particularly like slow-burn drama, see the movie anyway, for the performances. Lynch doesn't say a lot but he's truly engrossing to watch. Anne Heche is virtually unrecognizable as Dahmer's mother skating along the lip of sanity -- her manic performance is brilliant and unforgettable. And as usual Dallas Roberts impresses as Dahmer's father. <br><br>Highly recommended -- but don't go expecting a serial killer flick.","user":"Larry-115","rank":[45,60]}]