[{"title":"Return to Nuke 'Em High Volume 1: Erm.....no","rating":2,"date":"25 December 2018","review":"Almost 30yrs since the first Nuke Em High movie and almost 20yrs since the last one, Lloyd Kaufman returns in a reboot to Troma's second most famous franchise.<br><br>Overhauling the plot altogether (Not that there really was one) it tells the story of two girls who fall in love and have to combat an evil corporation and a genetically modified glee club.<br><br>So all these years later what are the differences? Well it's the same gore, nudity and 3rd grade humor. If you want fart jokes and ridiculous stereotypes this will still appeal.<br><br>What's different is they've almost entirely lost the 80's theme (Which was the heart and soul of the Troma universe), they've lost the recurring cast and any connection to previous movies.<br><br>So essentially this has thrown aside the universe they have spent 30yrs building and starts afresh with a clean slate. Only thing is they used that clean slate to make the same old garbage for the most part.<br><br>Crude, offensive, dumb, childish and catering to the lowest possible denominator.<br><br>The Good:<br><br>Stan Lee's narration<br><br>The Bad:<br><br>Lloyd Kaufman<br><br>Beyond childish humor<br><br>Cringe inducing<br><br>Things I Learnt From This Movie:<br><br>All you need is lobe<br><br>Lemmy should have been President<br><br>The food network is sexy<br><br>Prince alberts are not suitable high school attire<br><br>Tuna Town doesn't sound appealing<br><br>Marijuana causes spontaneous combustion<br><br>95% of Troma advertising is in movie posters","user":"Platypuschow","rank":[12,13]},{"title":"I wanted to love it so bad...","rating":5,"date":"1 July 2013","review":"I saw this last time in London in a double bill with the original Class of Nuke Em High.<br><br>As a huge Troma fan it was a great honour to meet Lloyd Kaufman and i had planned to congratulate him on his latest \"Tromasterpiece\" however when i met him i didn't mention the film at all out of respect.<br><br>Whilst i didn't hate it, it is my least favourite out of all the recent Troma in-house movies.<br><br>Cutting it up into 2 parts just drags the film down. Whole scenes drag on way too long to seemingly just fill out time. The jokes just aren't that funny, and the topical humour regarding school shootings and cinema shootings just seems mean spirited.<br><br>Troma have seemingly embraced digital special effects, and oh boy are some of them BAD! Now i know Troma isn't known for its high budget but i love the makeshift nature of just a melon filled with blood being stamped on it works and is visceral. Seeing terrible digital visual effects takes away from Tromas normally fantastic physical work.<br><br>What I did think worked was the chemistry between the 2 lead actresses, they were the only 2 good actors out of the rather mediocre (even by Troma standard) bunch.<br><br>It really, really pains me to say it but it is not a good movie. I think when Vol.2 comes out it is salvageable and i am still definitely looking forward to it as trailers hint at many scenes not in Vol.1 that look awesome.<br><br>I just wish that we could have had a really tight awesome 2-hour Return to Nuke Em High as a single film rather then this unfortunate (so far anyways) mess.<br><br>Big props to Lloyd though he stayed and greeted his fans outside the theatre to the end signing whatever Tromabilia they had.<br><br>Thanks Lloyd your film disappointed but you still made my day x.","user":"daddygerplex-28-470862","rank":[24,29]},{"title":"The usual Troma but with some hot girls","rating":4,"date":"6 April 2014","review":"How to review a movie like this? The first minute or so we get a fast-forward recap of all the previous Nuke 'Em High movies. The nuclear plant was destroyed and an organic food plant has been build on top of the ruins. A new girl starts school. She's given a hard time by some cute tough chick. On Taco Tuesday the food plant provides the ingredients. All the kids who eat it become mutants. The new girl as a pet duck that also becomes infected and infects the new girl in the craziest way. In the meantime new girl and tough girl have fallen for each other and now both become mutants as well as the school's singing club which have become The Cretins.<br><br>It's been years since I've seen a Troma movie. I never was much of a fan. And Return to Nuke 'Em High Volume 1 isn't going to turn me into one either. It's got great gore scenes, very good nudity from the two gorgeous leads: Catherine Corcoran and Asta Paredes. That's about it. The humor wouldn't be funny to 10 year olds. It's more interested in being offensive and dumb, as expected. It even manages to ruin the two main characters. It's impressive though to see a young cast so committed to doing whatever is asked of them. A shame Troma doesn't know what to with them. Still I'll probably check out part 2 just so see more of Cathy and Asta.","user":"TdSmth5","rank":[11,13]}]