[{"title":"Inspired premise and acting weakened by melodrama and cliche plot turns","rating":5,"date":"29 June 2018","review":"I had really hoped \"Swung\" was going to be one of those inspired indie dramas that I'm always seeking out, but soon enough, seemed the choices the writer got more implausible and felt borderline Hollywood cliche and melodramatic. A beautiful spainish journalist living in Edinborough or Glasgow? is competing with colleages for racy stories at work, and since her husband has ED, maybe investigating swingers will spice up his intimate life. Then the storyline takes these almost TV movie twists, things that are funny aren't meant to be humorous, like overdosing on viagra. Later, they cast Elizabeth McGovern (Downton Abbey) as an american tantrist and guru. Why not a british tantrist? These choices just seemed out of place the whole movie and it affected the flow and quality of the experience, which made me convinced it's a first time director. Sometimes less is more, and I felt that the good set-up of the movie wasn't followed through.","user":"rhodesbenjamin","rank":[4,4]},{"title":"A watchable indie dramedy.","rating":7,"date":"19 May 2016","review":"The two leads were likable and i believed their relationship and chemistry. The film started well, with some nice humour and warmth about erectile dysfunction and keeping a sex life alive, but did start to lose its way towards the final act as things got a little more serious and there were some strange choices for the dramatic finale (the black room was at least original, but a little... weird) But the film was short so never dragged and was well shot with a decent soundtrack. Worth a watch as it's good to support independent films and also it's at least trying something a bit different. I saw a few reviews who seemed to think it was supposed to be making a bit statement about the swinger scene or erectile dysfunction (!) but i never felt that was part of it, it was just a backdrop for the characters to explore their problems. The film was well made for a low budget and passed the time without being boring.","user":"laslopaniflex","rank":[3,3]},{"title":"Not the expected one","rating":5,"date":"8 January 2020","review":"Hoped it would be more interesting about a complicated relationship but it wasn't. It would be better to keep some twists in the plot, movies like this has either strong sexual appeal or a storyline to trick the audience. Unfortunately none of them were present.<br><br>This movie contains nothing without some low class sexual actions.","user":"evancadet","rank":[0,0]}]