[{"title":"A rehashed idea, done a thousand times and 999 times better!","rating":3,"date":"10 March 2018","review":"A weak storyline, poor script, slow pace and ham acting, make for a less than enjoyable ride. A rehashed idea, done a thousand times and 999 times better! Our lead, Karl Urban, makes Matt Damon seem to have limitless emotional depth. He permanently looks like he is suffering from hard stools - maintaining the same expression throughout. The wardrobe department wasn't too taxed, given he wore the same outfit the whole movie, but for a t-shirt change. Continuity need sacking; cops break our hero's tail light and 20 seconds later it is fully functioning and undamaged again! Make-up is a bit odd, a punch in the nose illicits much blood after a thousandth of a second and one character shot in the final scene bleeds out immediately from the head and body, despite being shot only once. One character dies from a non-lethal wound! The storyline is simple enough. Man accused of something he didn't do goes out to prove otherwise and uncover a thinly-veiled conspiracy. I lost interest so many times, due to the slow pacing and poor script. The movie is lacking in drama and you become disengaged from the plot really easily. In short, it's not good.","user":"makka-00955","rank":[50,68]},{"title":"\"Hey there, my names Karl Urban\"...","rating":2,"date":"10 March 2018","review":"\"Hey there, my names Karl Urban. I'm known for my films where I play Karl Urban and most recently, playing the exciting new role of Karl Urban. This time around, I'm a cop who was framed for murder blah blah blah now out of prison blah blah blah finding out the truth behind blah blah blah bring to justice, etc. It's a real fresh concept on the genre. The script for this movie is genius in that it feels like someone wrote the entire thing in Mandarin and then transposed it to English using Google Translate. Not only that, but Sofia Vergara is in it so we have an excuse for a poorly executed love interest that comes quite literally out of nowhere. She's terrible, but she makes out with a chick so it's worth it. I spend most of the movie hunting down the generic bad guy within 7 days, during which time I conveniently have a \"guy\" for everything to help assist the plot along, without the need for unnecessary things like exposition. Need a licence plate run? I know someone in the DMV. Need to check my car for bugs? Got a guy in a garage. I'm just like John Wick! I also have two sets of clothes for the entire god damn movie, it's really remarkable. Anyway make sure you catch this film before you completely forget it even exists, which is a real possibility.\"<br><br>I'd rather clean all the bathrooms in Flinders Street station with my tongue than watch this atrocious drivel again.<br><br>2/10","user":"thebigrip-1","rank":[67,104]},{"title":"Its ok to watch from home!","rating":6,"date":"17 June 2018","review":"Not the best/worse movie I have ever seen but it was ok.","user":"astodghill01","rank":[12,17]}]