[{"title":"Might Have Been an Entertaining Movie with Improvements","rating":5,"date":"5 April 2014","review":"In the Sixteenth Century, a group of warriors are vanquished by Wrath (Vasilescu Valentin) and other demons in Romania. The teenagers Alina (Kelly Wenham) and her sister Esme (Holly Earl) flee with a box, but they are surprised the a group of thieves commanded by the young Lucian (Ben Robson) that wants the box. They disclose that inside the box there is the Lightbringer, the only weapon capable to kill Dracula (Luke Roberts). Soon the vampire hunter Leonardo Van Helsing (Jon Voight) comes to the camping of the thieves and when he is explaining the power of the Lightbringer, Wrath returns with the creatures and attack the group. They are defeated but Wrath kidnaps Aline and brings her to Dracula in his invisible castle. Her resemblance with Dracula's bride that was killed by traitors one century ago makes him believe that she is her reincarnation. Now Dracula wants to seduce Alina and he asks his assistant Renfield (Stephen Hogan) to take care of Alina. Meanwhile Van Helsing and Esme team up with Lucian and the hunter Andros (Richard Ashton) that seeks out Dracula to revenge the death of his sister Demetria (Poppy Corby-Tuech) and the unlikable group heads to the castle using a compass in the Lightbringer to rescue Alina from the vampire.<br><br>\"Dracula: The Dark Prince\" might have been an entertaining movie with improvements. Dracula blonde is ridiculous; the decrepit Jon Voight is annoying and also pathetic in the role of a vampire hunter. The two \"Xenas\" protecting the valuable box is also terrible. The modern haircut of Lucian is laughable. The female vampires in Dracula's harem seem to be in a fashion parade or beer advertisement. But the movie is watchable and makes laugh. My vote is five.<br><br>Title (Brazil): \"Drácula - O Príncipe das Trevas\" (\"Dracula - The Dark Prince\")","user":"claudio_carvalho","rank":[17,23]},{"title":"Bramstokers Dracula meets Xena the warrior princess","rating":1,"date":"16 October 2013","review":"right of the bat this is a rape of a classic love story with after school special violence, skimpy costumes, poorly written characters, fake looking sets, and in many cases just plain bad acting, needless to say i did not enjoy what i saw one single bit<br><br>and why the hell is the Liech king(Wrath) from war-craft one of Dracula's minions?<br><br>all movies has their audience, and this one is directed towards children, and hillbilly's born with 6 fingers on each hand (the only reasonable explanation for the brief nudity in Dracula's castle)<br><br>there are a lot of question raised around why anyone would make certain decisions during the production of this made for TV movie.<br><br>-10/10 not even worthy of ironic appreciation","user":"jorof90","rank":[41,78]},{"title":"It would be a good movie if...","rating":5,"date":"16 February 2014","review":"It would be a good movie if: <br><br><ul><li>Had no unnecessary nudity;</li></ul><br><br><ul><li>The clothes were more appropriate to the time and more rustic;</li></ul><br><br><ul><li>Women do not appear with a look from a beauty salon (much production in the face and hair);</li></ul><br><br><ul><li>The younger actors seem to have left the Glee show.</li></ul><br><br>The story became very different, it was not bad, just different. <br><br>The production is modest, within the available budget. Being a super production is not mandatory and does not guarantee a good movie. <br><br>The film has some good actors, yes. And it's easy to see who they are, the more experienced and less exaggerated.","user":"whopoder","rank":[18,31]}]