[{"title":"Worth Seeing? G-NO-ME","rating":5,"date":"4 June 2018","review":"(Sigh) . . . Lacking, would be my one word review of \"Sherlock Gnomes\". Though the animation itself is nice, the basic story and lacklustre script will probably leave most of the children in the audience bored, let alone the adults. <br><br>The vocal performances are a mixed bag. With Gnomeo and Juliet effectively sidelined for a lot of the film, their performers (James McAvoy and Emily Blunt) probably give the flattest turns, but this does allow for Johnny Depp and, particularly, Jamie Demetriou to shine as Holmes and Moriaty respectively. There is a song crowbarred in around the middle of the picture from Mary j Blige's Irene Adler, which is as inexplicable as it is awful. In fact, music in general it a bit of a problem for the film - with a few bars of various Elton John hits piped into certain scenes, but it's like hearing a panpipe version in a lift, recognisable but not entertaining. <br><br>There is, as I say, some nice animation but there aren't nearly enough gags that land, and certainly not enough that would appeal to any of the older kids / adults in the audience.","user":"southdavid","rank":[17,19]},{"title":"You're left wondering who it's for, and why you can't care enough to even be bored.","rating":3,"date":"8 May 2018","review":"You are left wondering exactly who 'Sherlock Gnomes (2018)' is for, other than the pun-masters who came up with its title while presumably snickering for a second and then realising they have to spend literally years to make an entire feature surrounding their wordsmith handiwork. See, it's not like any of the four year-old's this should be aimed at will get most of the 'adult' or referential humour or even know who 'Sherlock Holmes' is, much less care for his porcelain counterpart, and I'd even stretch to say that the 'potty' humour that's seen here is just too subtle to give kids a giggle, either. It simultaneously seems to aim too young and too old, failing to find its audience because of this. Where the first 'Gnomeo &amp; Juliet (2011)' sought to bring a classic Shakespeare story to a younger audience, however successfully, this one clearly just started with a pun and spun out from there, with no real intention of adapting a proper source story or even sticking to the character in any real way. It's not too big a leap to assume the character was only chosen due to the earliest of his stories being in the public domain. The result is a mishmash of the first flick with these loosely adapted, but not really parodied, characters from a classic adult detective fiction that has no connection to either 'Romeo &amp; Juliet' or any of the Gnome elements from the franchise. These pieces clash together and vie for attention in a bizarre way, both competing to control a film which should really be a sequel to its predecessor but can't properly be because it's not allowed to have time away from its new, essentially unrelated characters. It therefore doesn't introduce children to the 'Holmes' character through his 'Gnomes' variant, in the way that 'Gnomeo' leads nicely into 'Romeo' even though the former is a severely watered down version of the latter, but still heavily borrows an amalgamation of elements from several of Sir Arthur Conan Doyle's stories and uses them as fodder for clumsy jokes and haphazard plot elements. It's almost as if you'd need to be a proper 'Holmes' fan to even understand most of these references, and if you're a fan you probably won't like this or its representation of the character - though, you probably won't see it, to be fair. The piece also opens the world up in strange ways that make it feel closer to 'Toy Story (1995)' in the worst way possible, a bad imitation losing its identity in every way it can.<br><br>It's actually a little hard to put my finger on why I disliked this one as much as I did, for in theory it ought to be a harmless, if joyless, experience that can be watched passively, yet easily. It's not offensive, the voice-work is decent and so is the animation. There was clearly work put into the piece and the messages are important, if a little ham-fisted. On paper, it is certainly far from the worst thing I've seen. Yet, I have a distinct distaste for it. I'm not angry, tired or still cringing about it (though I was cringing pretty much every time Elton John came on in lieu of a musical score), and I wasn't totally bored while watching. I think that might just be it, though: the lack of any real response. It isn't good for anything, not even putting you to sleep. 3/10","user":"Pjtaylor-96-138044","rank":[25,32]},{"title":"Although the plot is predictable, still funny and clever","rating":10,"date":"28 May 2018","review":"Breaking news from London-garden gnomes have been kidnapped! \"Oh fertilizer!\" This is one of many amusing jokes from the very British characters in Sherlock Gnomes, sequel to the 2011 animated film Gnomeo and Juliet. Although the plot of this family-friendly movie is somewhat predictable, it is still quite funny and clever. <br><br>In this sequel, the formerly star-crossed lovers Gnomeo (James McAvoy) and Juliet (Emily Blunt) are married and have just moved to London where they are appointed by their parents as joint heads of the garden. Both Juliet and Gnomeo feel the pressures of their new leadership roles and the marriage begins to suffer through lack of communication and mutual appreciation. Meanwhile, their gnome friends are disappearing from homes all over London, and they attempt to search for and save them. With the help of Sherlock Gnomes (Johnny Depp) and Watson (Chiwetel Ejiofor), the adventure begins - to defeat the evil pie company called Moriarty (Jamie Demetriou) and save all gnomes. We also see that poor Watson is quite ignored and under-appreciated by Sherlock.<br><br>My favorite aspects of this movie are the music, Johnny Depp and the \"planning\" sequences. I love the song choices used in transitions between scenes. If you are a fan of Sir Elton John, you will be pleased to hear many of his hits, including \"Don't Go Breaking My Heart,\" \"I'm Still Standing,\" \"Saturday Night's Alright for Fighting\" and a fantastic new song performed by the great Mary J. Blige. Johnny Depp is hilarious with his condescending British accent. I have seen almost every movie he has ever been in and he never disappoints with his comedic intensity. Another interesting thing that happens is when we see the inner workings of Sherlock's mind in 2-D black-and-white animation. One clinker for me is when super-intelligent Watson, looking for Gnomeo, says \"Gnomeo, Gnomeo! Oh don't make me say it - wherefore art thou, Gnomeo?\" (Of course \"wherefore\" means \"why\" in Romeo and Juliet.)<br><br>The message of this story is a good one - that you will succeed by respecting the people who support you. Sherlock learns that lesson when he realizes that Watson feels that Sherlock isn't listening to him or respecting him. Juliet learns it when she realizes that Gnomeo feels as if Juliet is ignoring him, too.<br><br>I rate this film 5 out of 5 stars because, almost all the scenes kept me laughing, the music is great, and I love the message. I recommend this movie for ages 7 to 18.<br><br>Reviewed by Lucia F, KIDS FIRST! Film Critic. For more reviews by youth, visit kidsfirst dot org.","user":"rannynm","rank":[19,30]}]