[{"title":"Kinda like a clichéd Disney love story..","rating":4,"date":"3 February 2014","review":"Where to be begin? Well, this was one of those movies you happen to watch on netflix. This movie centers around a kid who is a hero, and a thief. Amongst all other things, he's just your average outcast. He moves from town to town never really finding a home. There's very little to this movie. Very simple plot, no surprises at all. It's a matter of when it will end, not how. The acting is very mediocre and lazy. The writing doesn't really grasp your attention. I feel like this movie was made for Disney. (Coincidentally it stars a former Disney star 'Kelsey Chow')If you minus the few gun scenes, this movie would have been stamped with a PG rating. If you're looking for a \"live action\" thriller, this is not it. It merely advertises as fast action, but it simply does not deliver.","user":"yourwickedsurprise","rank":[11,19]},{"title":"If your a kid who has never seen Gleaming the Cube, just go watch that. If you prefer Parkour try Youtube","rating":7,"date":"18 February 2014","review":"For the most part this is like an ABC Family channel kind of afternoon tween-teen action/adventure kind of movie. There is a lot of really low budget looking film work as they follow the Parkour stunt team around preset skate park like scenarios. There is an entire montage that should just be on Youtube, and not in this movie. All of that said the acting is decent, and the over-all story isn't bad, it just makes no real sense. Eric Roberts should not have seemed so completely neutered, and Lucius was just way too motivated to kill with not enough of a back story that we get to see that would explain his everlasting Love/Hate thing. I Enjoyed most of the movie though as the Father Son dynamic was good, and the school stuff was OK, but just. If I am recommending this movie it is only for you to watch the Parkour, if you are into that sort of thing, but even that looks way over choreographed(especially the in movie stuff, there is about 5 minutes of the actual stunt team showing off, and a couple guys who won an online contest which is a bit better).","user":"face-819-933726","rank":[9,15]},{"title":"Don't see obstacles, see opportunities.","rating":6,"date":"22 February 2016","review":"Run Summary: Don't see obstacles, see opportunities.<br><br>Run is primarily a visual homage to parkour, a sort of non-combative martial art developed in the '80s from military obstacle course training. It's all about getting from point A to point B, using nothing but your unassisted body — running, climbing, swinging, vaulting, jumping, rolling &amp; scrabbling on all fours. Nowadays, parkour seems to include very acrobatic front, back &amp; side flips as well, making it quite spectacular to see. Downright jaw-dropping to watch someone use sheer momentum to run along the side of a vertical wall or scramble up meager handholds on the walls of two close-set buildings by springing with seeming ease from one building to another.<br><br>Daniel, the protagonist, attends high school by day, but by night he's an accomplished thief who uses parkour to escape from the cops. His father's a former gangster who's been on the run from his ex-boss ever since a very personal falling out many years ago, so he &amp; Daniel never stay long in any one locality &amp; have prearranged escape plans always in place. When they have to move on yet again to keep from getting known, the son makes friends with a crew of parkour enthusiasts at his new high school &amp; wants to stay.<br><br>(One false note here when Daniel tells his new friends he learned his skills all by himself &amp; didn't even know there was a name for it. In this Internet age, he never heard of parkour? Aw, c'mon now.)<br><br>When Daniel's father &amp; also his new girlfriend are captured by the baddies, it's up to Daniel &amp; his new friends to save them. Not a great movie, plot line pretty predictable, but an entertaining visual introduction to all you ever wanted to know — &amp; then some — about parkour.","user":"epat","rank":[2,2]}]