[{"title":"Every human male should watch this movie","rating":10,"date":"18 December 2013","review":"I give this movie a 10 because it has a message. It has a true purpose to it, which effects nearly every man on the planet.<br><br>Ladies, you can listen to this, but be reasonable. Guys, we all masturbate. Some of us do it more than others, most of us look at porn. Some of us only masturbate to porn and some of us have real hard fetishes.<br><br>This movie points to the problem, the process of porn turning our heads, making us believe in perfection and making us ultimately selfish as lovers.<br><br>You watch porn, you don't have to please a woman, you don't have to worry about anyone but yourself. It is all perfect. In the real world, in relationships, the other person matters just as much as you, but sometimes, even the real thing is not as good as the fantasy and the ease of it.<br><br>Don Jon is about that confusion of liking and appreciating porn more than real women, of becoming addicted to the idea of 'perfection' and the ultimate realization of the effect it has on all us men, making us irritated little boys, incapable of truly connecting with another person.<br><br>The message is not that porn is bad, only the way we think and use it is misleading to reality.<br><br>But, this is not the type of movie to watch with the family, the girl; it's funny, but not a comedy in a spoof and clown type of way. Watch this movie alone, think about yourself and how porn effects you. It will benefit you greatly.","user":"pcrawake","rank":[365,427]},{"title":"Joseph Gordon-Levitt delivers a Stinging Critique of Modern Relationships","rating":8,"date":"12 March 2013","review":"Don Jon was very well-received in its regional premiere at the Paramount Theatre during Austin's SXSW Film Festival. The film was written, directed and starred Joseph Gordon-Levitt. He did a really fine job for his writing and directorial debut, but he may have been trying to do too much. The acting by Gordon-Levitt, Scarlett Johansson, Julianne Moore, Tony Danza, Glenne Headly, and Brie Larson is quite good. I think it is Gordon-Levitt's script that leaves something to be desired. His character Jon is a very successful ladies' man who is also heavily addicted to masturbating to internet porn – numerous times daily. Many people will find the film to be quite funny and enjoyable. However, the graphic use of porn will not be to everybody's taste and may be off-putting to viewers – particularly female viewers. I'm also wondering whether the extensive use of porn will lead to the MPAA giving it the kiss-of-death NC-17 rather than an R rating.<br><br>JGL's script is well-intentioned and he is trying to make the point that many people become so self-absorbed that they lose the ability to interact with others on a human level. Jon is deadened to real romance by his reliance on porn. His girlfriend has an overly romanticized view of relationships based on watching too many romantic movies. They are both so self-absorbed and selfish that they can't really build a real relationship. Still, it was often difficult to figure out what JGL's point was and in many ways became clearer listening to him during the Q&amp;A after the film. JGL is attempting to raise profound issues about human relationships in the modern era, but he hasn't quite figured out how to do that as a writer and director. I expect that he is going to become as fine a director and writer as he already is an actor. He has a fine future ahead of him.","user":"JustCuriosity","rank":[313,394]},{"title":"A 10 for the message if nothing else...","rating":10,"date":"23 December 2013","review":"(Somewhat Spoiler-y) I've dated an older woman, and in a lot of ways she tried to tell me the same things Esther tells Jon. In fact I remember a few distinctly similar interactions, so on that level the movie really spoke to me.<br><br>I imagine one could say the movie relies on some clichés, just enough to satisfy the romance/comedy genre, but it uses them in very unique ways to tell a story that at least seems a little more real. Sort of like 500 Days (of Summer) on steroids. No pun intended. In fact it may be even safe to say that Don Jon is the next chapter in the 500 Days saga, albeit with a different character. Perhaps one made cynical by the events of JGL last romance comedy outing.<br><br>Don Jon has graduated beyond puppy love, certainly, and onto full blown adult fun. But the movie is very biting, and sort of tears apart his self-serving agenda.<br><br>A lot of people seem to be caught up in the \"porn\" aspect of the movie, but honestly the \"porn\" is a metaphor, no more important to the gym-tan-laundry-sexualized commercials.<br><br>There are only two real female characters in the film: Esther, and Jon's quiet-except-for-one-powerful-line sister. The sister in fact almost makes the movie, as they use her small character to incredible effect.<br><br>The movie does a nice job of tricking the audience into rooting for Jon and Barbara, of course it's all a ploy. They even set up Esther as a sort of antagonist. She is enticing yet feels all wrong for Jon. Older, sort of run down, maybe a bit of a predator of weak men, the movie isn't very clear about her at the start. She runs completely counter to the stereotypes of women as set up by the film. She is far from perfect, but Moore makes her believably beautiful. I truly doubt many other actresses could've sold this role in the way she did. While her age played right into the character she probably was right for the character for mostly other reasons.<br><br>I don't think the movie is overall that outstanding. Many of the jokes fall flat, and some of it is tedious. In fact the vast majority of it could be considered filler, but the end is so incredible it does a great job of tying all these scenes together in a way that makes perfect sense and delivers a powerful message. Without completely ruining it the end embraces the typical cliché, but flips it on it's head. What results is a very mature version of what audiences have come to expect from these types of movies. The same, but also very different.<br><br>I would expect JGL will have continued success as a Director and actor.<br><br>The guy truly gets it.","user":"MikeM1984","rank":[90,111]}]