[{"title":"Easy going Xmas story","rating":7,"date":"29 November 2013","review":"Not sure why Lisa Bishop has to reduce this to a sexist moan as it wasn't written to be sexist! Such a shame and so unnecessary.<br><br>This is a simple little story that draws you in. It I has an easy storyline and is nice to watch and become involved in.<br><br>The characters are believable and enjoyable. The story is often predictable but that does not detract from the overall plot which still surprises at moments. There are some great moments in it where you want to hide in embarrassment but this is because in a way they are believable! <br><br>It doesn't have to have big expectations because that is what it is! <br><br>Settle down on a cold wet afternoon in front of a fire and enjoy!","user":"cliverichards1","rank":[10,11]},{"title":"suckered in","rating":8,"date":"2 December 2012","review":"I really like joey Lawrence as an actor and when i seen that he was going to be in this movie i just had to watch it. The holidays are stressful and very lonely if you have no one special to share them with, I'm always single on the holidays so i know. This movie had a sweet twist in it being that the man was doing this online arrangement for his dying grandma and not just to show off to his buddies. THe other thing that i thought was funny is how drunk he got at the work Christmas party. You knew they were going to end up together because thats just how these movies go, but the funniest part of all is that at the end he finally made one of his mothers \"visions\" come true. I recommend this movie to anyone who like a laugh and a good looking actor, or can relate with a crazy family.","user":"sa8713","rank":[14,17]},{"title":"Just darling and a great mixture of Christmas and Hanukkah themes","rating":8,"date":"6 March 2014","review":"Its Thanksgiving. Rob (Joey Lawrence) has a hard time committing to ANYTHING! On the job, he is a talented art director but he happily goes from one freelance position to another, so that he doesn't have to stay true to a single company. The same phobia occurs for his love life, a never ending string of short-term romances. He breaks up with a current flame in a taxicab! His grandma is keenly disappointed, as she is very ill and wants to see him happily married. Meanwhile, beautiful Julie (Emily Hampshire), also single since her last New Year's Eve break-up, is upset that her Jewish mother is endlessly trying to match make her only daughter. Turkey dinner is almost unbearable, since Mom and Dad have invited a \"prospect\" to join their meal. Enough of this, she thinks! Her brilliant plan is to go online and find a \"pretend\" boyfriend for the coming holiday season so that she can avoid any future blind dates and complications. Guess who sees her ad! Rob! He believes his grandma is dying and wants to give her a last wish by becoming engaged. Oh, what a tangled web may be ahead, for Rob is Catholic and Julie is Jewish. Each must take a \"cram course\" in faking a new religion. But, amid the errors, both of them laugh and, in truth, like what they find in their pretend fiancés. Will it only be a case of hitched for the holidays! This darling film has a great cast (including Marilu Henner), lovely sets, fetching costumes, a mirthful script, and a lively direction. How welcome it is to find a seasonal film that touches on Hanukkah as well as Christmas. It also produces laughter, as when Rob's family buys Kwanzaa candle holders instead of Menorrahs! Naturally, romance fans will be delighted, too. Ditch the old re-runs and go get Hitched!","user":"inkblot11","rank":[10,12]}]