[{"title":"How to watch a Saudi film directed by a Saudi Female in Saudi Arabia","rating":7,"date":"28 June 2013","review":"Being a Saudi girl myself I didn't know what to expect, but honestly it was quiet good. The way they portrayed how it goes behind the closed doors of girls schools was so real, like I saw my whole life flashing in front of me: You have to cover your face, you have to wear fully covered Abaya... etc, etc. <br><br>Funny thing that most of you know by now that we don't have public theaters here, so I was lucky to hear about the screening in the U.S embassy with the presence of the director Haifa AlMansour. it was a once in a lifetime experience: I watched a Saudi movie directed by Saudi female director with a Saudi audience in Home but not quiet home. That kind of thing only happens in this side of the world.<br><br>I really believe that the story portrayed everything well and fair, there were a lot of good laughs. <br><br>Good job Haifa: I was lucky enough to tell her that be person. Now Go and make the rest of us proud.","user":"r-chloes","rank":[181,196]},{"title":"A fantastic film contribution from Saudi Arabia.","rating":7,"date":"16 October 2013","review":"This film gives us a unique glimpse into a society we know very little about. The story might seem simple at first but as we are witnessing the events unfolding we notice that the story is a lot deeper than that. Underneath the surface of a standard modern society we see how women have to cope in this patriarchal restrictive society. Despite the absurdities that women face every day we can still relate to the characters and the themes in this film. What makes this film so good is how it tells us a story of how people live their lives through the experiences of a little girl. Where dreams can still be realized despite how oppressive things can be. While a sense of optimism always lingering in the background with a healthy dose of humour. A rare but curious journey into a society that seems so different than ours. The director did a great job at telling the everyday story about the Saudi Arabian people without any bias or obvious political agenda. All through the perspective of a charismatic young little girl who just wants a green bicycle.<br><br>It is good to see films use similar themes but from a different perspective. The film industry is too clouded with uncreativity. I hope this film experience is not the last great adventure from Saudi Arabia.","user":"finalfantasy_gc","rank":[24,25]},{"title":"A complex story told simply and well","rating":9,"date":"13 October 2012","review":"The director Haifaa Al-Mansour tells the tale of a child called Wadjda whose wish is to have her own bicycle so that she might race against her friend and neighbour Abeer. The only problem is that Wadjda is a girl and girls in Saudi society do not ride bikes, which are considered \"boys' toys\" ... As we follow Wadjda in her quest to find the money to purchase the bicycle she sees being delivered on the roof of a van, we are introduced to her society and its culture and, in particular, its treatment of girls and women. Al-Mansour's portrayal of her country is shown without heavy judgement, although the bitter sweetness of being female is not concealed.<br><br>Filmed on location in Saudi Arabia, a feat in itself in a country that does not have a film industry as films are considered sinful, Wadjda's desire represents the wish for female freedom; her lack of a bicycle is mirrored in the adult women's inability to drive, prohibited for women in Saudi Arabia, and the problems this creates for them. So the child's desire to ride a bike becomes a metaphor for freedom, which is the central theme in the film. <br><br>This is a subtle tale full of character, charm and complexities and not at all as one might expect. The young girl who carries the film, Waad Mohammed, is terrific and it is hard to believe that she was not an actress before appearing in this feature.<br><br>Does Wadjda achieve her desire and get her bike? Is she able to race it along the dusty roads as free as her friend Abeer and the other boys? Well, you will have to watch the film for the answers and in watching the film will support the director and the nascent film industry emerging from within Saudi Arabia.","user":"PoppyTransfusion","rank":[77,88]}]