[{"title":"Very fun and entertaining movie","rating":8,"date":"11 January 2014","review":"I think it's important to mention that it is probably the first \"made in Lithuania\" movie worth seeing for viewers outside Lithuania borders. As Lithuanian I would write whole 10 for it, but being realistic and thinking about international audience I will vote for something between 7 or 8.<br><br>Now about movie. Without spoiling anything: it's a criminal, little bit dark humor comedy about few English guys who decided to rob some gangsters and run to Malaysia. Everything went according to the plan except one thing- them flight was redirected to god forgotten eastern European country with unpronounceable name. <br><br>This movie took place in Lithuania and reflects myth and ideas about it, but in my opinion those myth would fit perfectly for any eastern European country and any viewer from there will find something alike in them homeland. <br><br>Because most of the audience will be from Lithuania there are some jokes that only Lithuanians will understand or understand it differently from the rest, but I think it shouldn't cause much problem for anyone.<br><br>I should mention that this movie is mostly in English, but also you can hear some Lithuanian language, some very \"broken\" English and even few words in Russian. Don't worry because everything is subbed. This kind of thing is done because in Lithuania older generation hardly speak English and it was the only way to show it. And also it's very fun to watch this miss-communications between main characters and natives. Maybe it will be harder for ones who do not understand Lithuanian language, but still it should be pretty entertaining because subs will let you catch the idea. <br><br>By the whole this movie is really entertaining and fun to watch. Maybe little bit to much nudity and curse words, but let's not forget that it is S rated move. Also some things shown are little to harsh and show eastern Europe from not the bright side, but this movie is not a documentary so it shouldn't taken seriously, it should be watched with little irony and wish to laugh at yourself (last part dedicated for eastern European viewers).<br><br>To sum up everything- if you like Guy Ritchie movies, if you liked movies like \"Snatched\", \"Seven Psychopaths\" or movie \"Kiss kiss kiss bang bang\" you will probably like this one too.","user":"Gexas","rank":[303,420]},{"title":"It's not terrible","rating":5,"date":"20 December 2014","review":"It's not terrible, but that's also not saying much. The score also isn't very indicative of this film's quality, but on such a prominent site as IMDb - it is no surprise. 5 stars for the effort of trying to be something it clearly isn't - a Guy Ritchie style gangster flick.<br><br>Is it funny ? Yeah, at times - it is, but most of the laughs are accompanied by a cringe. Is it original ? Hardly. You always get a feeling you have seen all this before - which isn't necessarily a bad thing, but in this case it feels like Re-Directed is awkwardly trying to mimic its bigger brothers from UK. The dramatic arguments in some of the scenes feel incredibly forced - clear over-acting steals the emphasis from what should be really important in the scene. That said, the pacing is okay, there's enough action for this kind of movie and it doesn't stall too much. Also, I found some scenes genuinely comical, but some were a bit too cliché-ridden.<br><br>What deserves some applause though, is that the director didn't attempt to paint a realistic picture of Lithuania, but took the satirical, \"Looney Tunes\" approach instead. It's one of the things I actually liked about this film - it's very light-hearted and doesn't take itself seriously, which scores it some very much needed points.<br><br>This is something you watch once, then remember how many times you had watched Snatch/Lock Stock, and then watch them again - because they are worth it.","user":"trashcan-e","rank":[47,71]},{"title":"Some bad reviews but I enjoyed it.","rating":7,"date":"1 September 2017","review":"I enjoyed this one, it was a mix of lock stock with The hangover, it was predictable but after 10000 movies they are all predictable. not a Vinnie Jones fan but he works well in movies like this, nice Tony Montana reference thrown in their. It could have been written better so not a 10er","user":"abowkley","rank":[4,4]}]