[{"title":"Just when you thought you couldn't take yet another low-budget zombie movie, here's one that is actually worth seeing.","rating":8,"date":"16 April 2013","review":"The thought of yet another low-budget zombie movie filled me with dread, but I was hearing good word of mouth about Jeremy Gardner's $6000 zombie pic THE BATTERY, so I gave it a whirl at Amsterdam's Imagine film festival. And am very glad I did, as it turned out to be probably my favourite film of the all the ones I saw there. <br><br>It's a (nearly) 2-hander about two guys crossing rural New England and, very occasionally, fighting off zombies. The title is a baseball term referring to the partnership between the pitcher and the catcher. Or something - forgive if if I've got that wrong; I don't know much about baseball, but it doesn't matter anyway. <br><br>And that's pretty much all you need to know about the plot. <br><br>Like the best zombie films, it's more about the living than the dead. This is a double-pronged character/relationship study (which thankfully never degenerates into the bad soap of The Walking Dead) rather than an action movie and there isn't an awful lot of gore, so younger viewers with ADD might get fidgety. But anyone who enjoys a well-crafted screenplay and nicely-drawn characters will have a blast. The climax, which makes a virtue out of the film's low budget, is particularly ingenious.<br><br>There are no wobblicam, jitterbug editing, CCTV, found footage, flashy camera effects or modish colour grading. Just a brace of good performances against a backdrop of leafy green countryside in broad daylight, beautifully edited &amp; classically filmed so that (and this is a novelty these days) you can actually SEE what's going on. <br><br>Also has an excellent soundtrack.","user":"doravale","rank":[91,132]},{"title":"Zombie film but very unlike the usual blood&gore. Rather studying two different characters coping in a hostile environment. With humor as a secret ingredient","rating":9,"date":"12 April 2013","review":"I saw this film at the Imagine film festival 2013 in Amsterdam. The festival website labeled it as Horror, but the IMDb website rightly adds the Drama label as well, the latter better describing the essence of the story. There is no real plot, other than the zombie plague that apparently is spreading. We are left in the dark how and why this came about. The number of zombies in sight is kept to a minimum, being not really important for the story, only needed as entourage creating the circumstances in which the two men have to survive. The few humans they encounter on their journey are hostile on average, only trying to survive like our two main characters. Meanwhile they talk about lost relatives, family members, and (of course) former girl friends whose fate is uncertain.<br><br>We see two very different characters, formerly working together as a so-called Battery (a catcher and pitcher couple in baseball), roaming from place to place, eating canned food, using empty houses for shelter when available (after being checked for zombies, and swept clear of it when needed), but otherwise having nothing useful to do other than practicing and quibbling. Their interaction is the real subject of this film, and keeps us interested for the whole 101 minutes running time. The secret ingredient is the humor that is interwoven throughout, and their differences in coping behavior.<br><br>The long final scene in the confines of a car is unique. From the Q&amp;A after the screening we learned that it was even 17 minutes long originally, later cut down to 11 minutes, but still stretching the patience of contemporary viewers. But it worked: wondering how this would come to an end (and which end?) kept us alive and prevented a walk out. Unique for the film as a whole is that it adds humanity to the zombie category (a takeaway quote from the Q&amp;A). It shows that it is not always needed to have an abundance of blood&amp;gore in a horror movie to keep us interested. Apparently, this story works as a vehicle to let us think about what might happen when our way-of-life is turned upside-down. How will I cope in such circumstances??<br><br>Of course, the post-apocalypse situation always gives rise to questions: where to find petrol (out of stranded cars??), bullets (how to obtain??), and batteries. They burn a lot of the latter, e.g. the walkie-talkies took 4 each, and the continuous use of a discman is utterly irresponsible. But all of that may be wrong questions to ask, especially in this movie that tries to be different and succeeds very well in that, so we really should not be bickering about such tiny details.<br><br>All in all, I was very satisfied to put this film on my \"must see\" list, regardless of the synopsis not sounding that much interesting. But it worked out very well for me, after all, as can be derived from above paragraphs. I scored a maximum (excellent) for the audience award when leaving the theater. As of today, this film ended second (score 8.43) on the audience award listing, so I'm not alone in this.","user":"JvH48","rank":[59,99]},{"title":"A remarkable \"anti-zombie\" story","rating":9,"date":"5 June 2013","review":"I love film and I love it even more when it sneaks up and surprises me with something completely unpredictable and original. Jeremy Gardner's The Battery, made for only $6,000 and released on video-on-demand outlets as of June 4, 2013, is one of the most surprising endeavors I've stumbled upon in months. It's a free-spirited, \"anti-zombie zombie movie,\" combining wonderfully played dialog, palpable circumstances, and enough wit and soul to liven an entire franchise of movies. If this is the future of independent horror, I got some serious renting to do.<br><br>Gardner, who directed, wrote, and produced the film, stars as Ben, traveling down the back-roads of Connecticut with Mickey (Adam Cronheim), both of whom were once ballplayers. Their polar-opposite personalities and resistance of closeness and bonding tells us they weren't the two sitting next to each other at the bar when they celebrated a win. Ben and Mickey are traveling the back-roads in an attempt to flee the zombie apocalypse and find adequate shelter.<br><br>I'll interrupt myself by saying that I use the phrase \"zombie apocalypse\" loosely; very loosely. Gardner is smart to shove the undead to the background, while the relationship and humanity of Ben and Mickey proudly takes the foreground here. While both men may not be the best of friends, neither would've gotten far without the help of each other. Mickey is petrified of \"zombies\" (I put the word in quotes since the only time the word is uttered is reluctantly and hesitantly indicating the overusing of it in recent times) and leaves all the killing and maiming to Ben, who likely would've went insane without the companionship.<br><br>The device used to unite the men are Mickey's headphones, which do different things both both men. Mickey uses them to temporarily close out the world around them; he employs them when he is frazzled or nervous about the dubious times. Ben uses them as a lighter form of escapism, cheerily dancing to Rock Plaza Central's \"Anthem for the Already Defeated,\" making for one of the best scenes in the entire picture.<br><br>The Battery works so well because it doesn't try to be just another film capitalizing off of the incredibly childish, overblown idea of a zombie apocalypse, which would be much easier to do in the wake of The Walking Dead and World War Z. An \"anti-zombie zombie movie\" is the perfect way to describe this picture. Despite placing emphasis on the undead, the film's focus is on the living, making for a very realistic, pragmatic take on a relationship that may come through during such an abhorrent event.<br><br>With sun-soaked cinematography by Christian Stella, capturing the woodsy atmosphere and the sweltering climate of the wilderness and vastly open plains of grass and wheat better than any films I've seen in recent years and a soundtrack composed of delightful but not cliché indie rock tunes, aesthetically, The Battery has it all to a tee. This is certainly one of the best looking films of the year, as well. While this is Gardner's first formal outing, he conducts it like an incomparable professional, staging shots that are tricky and clean, making use of a setting for more than twenty minutes, and even holding on one continuous shot for eleven minutes. None of this is boring, by the way. The final act takes place entirely in a van and is one of the most intimate, realistic exchange between two characters I've seen in a film like this, mainly because the conversations and exchange of thought it so typical and atypical to the situation. Regardless, the film is wholly unpredictable and that's one of the highest compliments I can pay to a film.<br><br>Stories like Ben and Mickey's are far more interesting than redundant survivalist drama in the wake of an apocalypse or a subversive yet lukewarm look at zombie romanticism. If we're past the point of ques and cinematic semantics and are formally referring to the The Battery as a horror film than this is, by far, the best horror film of 2013. It certainly is one of the best dramas of the year as well. And comedies. And action films. And thrillers. And satires. And films in general.<br><br>Starring: Jeremy Gardner and Adam Cronheim. Directed by: Jeremy Gardner.","user":"StevePulaski","rank":[57,98]}]