[{"title":"After All these Years...When Life Falls Apart ***","rating":7,"date":"1 September 2013","review":"Wendie Malick's life turns upside down on the day of her 30th wedding anniversary party. Afterwards, her husband confesses that he wants a divorce to marry another woman. As the divorce becomes a bitter one, Malick's husband turns up dead in the house with a knife in his back.<br><br>When everything obviously indicates that Wendie has done him in, the film is devoted to her proving her innocence.<br><br>The film is very fast paced. Delving into his life, she soon discovers that there are an array of other suspects. There was even another affair. Seems as though others would also benefit in doing her husband in.<br><br>There is even romance along the way with an old flame as she tries to evade the police.<br><br>The ending is a bit of surprise with the least likely of people discovered to be the killer.","user":"edwagreen","rank":[12,12]},{"title":"Giving Wendie a job is good {spelling editor: faux roughly = fake}","rating":7,"date":"21 April 2013","review":"Wendie Malick is excellent with tongue firmly in cheek throughout this faux mystery. I laughed aloud more than once (just ask my wife in the next room - she thought I had changed channels since I rarely laugh aloud at Hallmark movies.) The other characters adequately complement this mood. Cinematography is not my forte, and I did not notice any outrageous errors in the filming. Be sure, though, to begin with the expectation that had this aspired to mystery, it would have been a catastrophe; as a comedy, it works. <br><br>It is most certainly more comedic than mysterious, and I must assume that to be intentional. My charity is reinforced by some citations, including the final sequences where the lieutenant repeatedly shushes Malick (\"be quiet!\", to recite verbatim in his deeper male voice, her previous line of the script. Or when he is so effusive in praise of her skill in forcing the suspects to support the case she has made, even offering her a job as an investigator. <br><br>This is appropriate and commonplace for other amateur movie sleuths - for example, Murder, She Wrote - but that dialog seems to have disappeared in the two later broadcasts earlier today. Perhaps I should have held off a day or so for editing to be final. Some scenes were clearly deleted, others subjected to minor alterations vis-a-vis a line or two deleted, to be replaced by a line or two added from stock rescued from the cutting-room floor. The schedule may have been a little too tight for all the editing to be completed to everyone's satisfaction so that it is yet a work in progress. Hallmark does this quite often - I frequently see the same movie a day or two later with new scenes replacing some that I had thought were keys to the story. Glad I saw both versions so far of this one.<br><br>I will add only that when the culprit is eventually revealed, the mystery component is forced back to the surface with the choice of identity of that culprit. As in a true mystery, it has to be someone whom we have dismissed as utterly impossible - and it IS! I was actually surprised when my two best suspects were innocent of the murder; SHOCKED at the true perpetrator.","user":"conleytgwinn","rank":[18,21]},{"title":"Not what i was expecting","rating":9,"date":"9 August 2014","review":"i saw this as it was on an afternoon television schedule. i have just started watching afternoon television films and i can say most of them are OK but they may lack a strong storyline or recycle an overused plot. now, i wasn't excepting to enjoy this film as much as i did. it is better than most Hollywood films because it isn't over the top. it is kind of down to earth... i think 6.0 rating is too low it should be 7.0 at least. the movie has good energy, its one of those films which will make you have a good feeling while watching unlike most mysteries which are miserable. the ending is unpredictable to most, so i can say its worth watching till the end. acting is OK, mise en scene is great too. it is a movie to see if you are looking for entertainment.","user":"bananabutcher","rank":[16,20]}]