[{"title":"An Honest and Emotionally Devastating Film about Life, Love and Sexuality","rating":10,"date":"24 September 2013","review":"I just want to start off by saying this is an amazing film about young love that is actually honest with its audience. There are countless of films about people falling in love, but when you see \"Blue is the Warmest Colour\". You realize just how rare films are that make a sincere attempt to catch what it really is like to fall for someone, without sentimentality, forced cuteness or cheap emotional manipulation. This is the rare love story that has real emotional truth about it. The fact that it is about two women who fall for each other is almost secondary to the way the film catches the universality of what it is like to fall in love and maintain the relationship. \"Blue is the Warmest Colour is a naturalistic and touching film, whether you're gay, straight, bisexual, or whatever orientation. This is a film that can give you relationship advice and life guidance no matter what your orientation may be. It isn't an indulgent film bringing only a unique gay relationship to light and nothing more, and it isn't an ode to \"coming out\" and stockpiled clichés of \"being different.\" It shows how an interaction with a person can have a truly provocative impact on you as a person.<br><br>The struggles between the two lovers is depicted in breathtaking detail. The director masterfully captures all of the turmoil and hardship going on between Adele's and Emma's relationship. The movie's long running time does not effect the film at all because you are so immersed into their characters. The sexual realization of Adele is perfectly shown in the movie. She is confused and doesn't know what she wants, it is a typical teenage problem. This movie is ultimately about Adele and her struggles to find her true self. The transformation that she experiences is utterly engrossing to watch. The film's nearly three hour running time is devoted to showing the growth of her character and it is absolutely amazing to watch it unfold right in front of your eyes.The intimate scene's between Adele and Emma are nothing short of miraculous in their depth and their honesty. The conversations are heartfelt, and the pain is evident and shared. It's realism of the world we live in is honest and raw.<br><br>The movie owes so much of it's emotional power to its two fantastic actresses. They really bring it their all in this. I've never had doubts of these two performances, the characters felt like real people and you felt so much for their relationship. Their emotional hardships feel completely real. The character's flaws and insecurities feel so authentic because you actually believe them as real human beings. We never lose sight of their chemistry and devotion to one another, even in the most difficult of times. The two of them are like fireworks, waiting to explode out. I cannot recommend this film enough to those of you out there who are interested in seeing this. This is one of the wisest and least condescending films I've seen this year. I congratulate the director, Abdellatif Kechiche and the two actresses, Adele Exarchopoulos and Lea Seydoux for an emotional and spiritual journey that had me compelled to the screen for 179 glorious minutes.","user":"Loving_Silence","rank":[465,540]},{"title":"One of the best films I have ever seen. Go immediately.","rating":10,"date":"10 November 2013","review":"I saw this film as a preview, at 11am on a Sunday morning, whilst nursing a horrible cold and it was the best decision I have made in a long time. <br><br>The film offers several basic and well used premises: the Eliza Doolittle/Henry Higgins: why won't you let me educate you thing, a dichotomy between big city and small city ideas and ideals and the well trotted out first love idea. However, the way this film is presented is entirely original. Kechiche sets it in Lille, a town in Northern France, full of provincial living and entirely captures how it is in general in this town - when the characters walk around you feel that he understands what he is talking about.<br><br>The film is about desire, desire to eat, desire to sleep with someone, desire to dance and it is portrayed within a first relationship between two women. The two women are fantastic and the plot has amusing little french jokes interspersed between the very emotionally demanding relationship that has you gasping at points. However the story is largely about one of them, Adele - and you feel over the three hours, that you get to know her, what she is about, what she finds attractive, what she wants (or what she thinks she wants). The actress playing her has a wonderfully expressive face and she needs it for the amount that happens. When she cries, when she eats, when she sleeps you believe her.<br><br>Much has been said about the sex scenes, which are very graphic, however these are entirely relevant to the plot and the furore seems to be about the actors criticising the director for pushing them too far, however, without this pushing this film wouldn't be nearly as good. <br><br>When it finished, and I realised that it had been three hours I couldn't believe it.<br><br>It was a revelation.","user":"smdilke","rank":[222,305]},{"title":"One of the most emotionally intense, powerful movies of the year","rating":10,"date":"27 December 2013","review":"I saw this film on the last night it was playing at my local theater and I jumped on the opportunity. Once it was over I realized how smart of a decision it was. I read a review of the film that said something along the lines of, \"the trouble with this film being 3 hours is that you want to watch it for several more.\" I couldn't agree more with that statement. The story, along with its characters, moves the film along to the point where it didn't feel like 3 hours. <br><br>This film was probably the most emotionally intense and powerful movie I've seen in a very long time. You believed everything you were seeing and it forced you to feel it along with the characters. As much that has been written about this film, the acting can not be overstated. These two actresses are a revelation in this movie. <br><br>It seems that whenever the topic of homosexuality is covered by a film it usually contains some sort of hate crime or bias against homosexuality somewhere in the story that the film's characters have to face and overcome. What's refreshing about this film is that there is a dash of that but its in the beginning of the film and never becomes the focus of the conflict with the characters. The film acknowledges that bias is there but brushes it aside to say that there is something bigger and more important at play with the characters. Really nice to see that in a film.<br><br>This movie ranks as one of the best films I've seen this year and am so happy I had a chance to see it.","user":"nootch23","rank":[100,137]}]