[{"title":"Oh, how the mighty have fallen.","rating":4,"date":"27 September 2016","review":"Seagal made some pretty good movies back in the day, but now he seems out of his element and past his prime. It reminds me of John Wayne playing Attila the Hun, no matter what he played he was always John Wayne. Seagal's style of \"speak softly and carry a big stick\" works in some venues but it has become his trademark and it's getting old. His constant whispering of dialogue seems so out of place with the gangsta slang he uses. He mumbles his words without any emotion whatsoever. I just don't believe the types of characters he portrays would be so soft spoken and philosophical. He really needs to find a script that is written just for him and his style of acting. The action, when available, are his typical Aikido moves. The script is sort of a rehash and compilation of other similar action movies. Nothing new or striking. It's a movie you could turn off halfway through and forget about.","user":"johnott1864","rank":[20,25]},{"title":"Best Seagal DTV Effort since Absolution","rating":7,"date":"24 September 2016","review":"You cant say that there is ever a drought when it comes to Seagal. Unlike JCVD, Stallone or Arnold who are a little more selective in the movies they make and we are lucky to get 1 or 2 movies a year from the action heroes of yesterday, Seagal has had 3 releases in the past month and i think 4 or 5 this year. The problem with such a high output of product is the standard isn't very high. Biggest complaints with Seagal is that he is marketed and billed as the star of the movie and then he ends up in the movie for a total running time of 20 or 30 minutes (if we are lucky), and even then he is usually heavily doubled with the body and voice. I never understood this lack of quality control or respect for his fans to put out something so substandard. But in recent years we have occasionally got a decent one that reminds us that if Seagal is in the hands of a capable director, he can still put out a decent action film. Unlike the releases this year Sniper, Code of Honour, Asian Connection, Killing Salazar &amp; The Perfect Weapon (Both in the last week), Seagal is actually the lead, i would say he is in at least 70 minutes of the 90 minute running time and there is minimal dubbing. He seemed interested in the movie, it was set in Paris and he gets a couple of decent fights (even if the doubles are still present). A couple of smart one liner jokes, this was a decent effort and would say, skip his other 6 releases this year (particularly Killing Salazar and Sniper) and support this one with a purchase. Keoni Waxman is a DTV director that knows how to shoot action, he knows how to get the best out of Seagal. Seagal should make every movie with him. As a DTV release I would say 7/10... compared to every other Seagal movie released in the past 12-15 months, this one is definitely the best one.","user":"realhiphop","rank":[26,39]},{"title":"Just when you think Seagal can't go any cheaper","rating":1,"date":"2 October 2016","review":"Of all the former action stars (Van Damme, Lundgren, Schwarzenegger) Steven Seagal has had the most pathetic decline. While it is true that Lundgrens movies are filmed at a lower budget, at least Lundgren is in shape and is actually emotionally present in his movies.<br><br>Seagal hasn't given a f*** about his movies in the past 15 years. And this one is no different. There are few fight scenes, and the few there are, are so horrible and cheap. Seagal just touches their arms and they fall down. Not even his body double does much movements this time. The shoot outs are slow and just look awkward. Seagal just mainly sits down in this movie and mumbles something about honor, the past and friendships. <br><br>The movie has a weak attempt at trying to emulate a heist movie, but it fails miserably. The acting from the supporting cast is standard Romanian fare and the female lead is nothing special, and her story arc is garbage, she for no reason does a complete break of her characters logic at the end of the movie. <br><br>For some reason there are scenes with a head boss talking on the phone. You never see his face, and his voice is clearly dubbed over. They never return to this character, and it makes no sense whatsoever to have him in this film.<br><br>Don't waste your time with this movie","user":"Junebug23057","rank":[13,18]}]