[{"title":"Scares over sense.","rating":4,"date":"19 September 2013","review":"Insidious: Chapter 2, the sequel to the 2011 hit Insidious and directed by the same guy, James Wan. This is...um...less than the first...but I'm not sure if that makes it good...for me at least.<br><br>So, here's the story: Immediately after the events of the first one, the father named Josh, played by Patrick Wilson rescues his son, who possessed a supernatural ability to travel through different worlds. He came across the dark spirit world, inhabited by demons. After Josh gets his son out, it turns out he was possessed by a woman in black. Possessed, Josh kills Elise without anyone noticing. Josh's wife, Renai, played by Rose Byrne, tries to defend her husband that he wasn't responsible. While that's going on, strange activities occurs just like in the first and the scares are placed here and there for the audience to jump.<br><br>So what are the problems with this movie? Well first off, Josh being released after being suspected in murder? Shouldn't he be in custody or something? Like being held? If he's a suspect in murder, he shouldn't be around people. I know it's dramatic irony, but this is still weird. Aside from that, there are some things that aren't explained and they make no sense. I won't say anything here, but...needless to say, it's pretty hard to swallow.<br><br>The scares...they're a bit step back from the previous film. They're not bad, they're just not as subtle as the first. Also another problem. In the first film, they follow the \"rule of Jaws\" when they don't show the monster until the last third. Here, they show it no time flat. And they jump scares in this movie can be a little too over the top silly and I daresay-- pretty damn cheesy. In fact, that's what James Wan's biggest weakness. His scares are scary, but they are a bit \"in your face\". His other film, The Conjuring, worked so well because not only were there jump scares, but there were a lot of moments when you can just take in the unsettling atmosphere. James Wan does do that in his movies and he did in this, but not as much as The Conjuring did.<br><br>With all these problems, does that this movie is bad? ...not necessarily. The good stuff are the performances, the twists and how the plot explains more. But to be honest, the twist raises more questions. Never answered, of course, how the twists play out and that it does answer some questions from the first film is pretty interesting.<br><br>So, yeah. It's a mixed bag to say the least. It's not good, but it's not terrible. The first beats the sequel by a lengthy distance, but the good stuff is pretty satisfying. If you want to see it and have a jump scare fest, you won't be disappointed. I probably would see it again if I'm bored, but go ahead and see it and give your own take on it.","user":"bendy392","rank":[36,51]},{"title":"Scary Fun","rating":12,"date":"12 September 2013","review":"We horror fans have been spoiled this past year, we've had it good  because director James Wan brought us The Conjuring and now Insidious:  Chapter 2, if this film had been any scarier, the world may stop  spinning, it is that scary. It's terrifying but it's also fun because  of that Ghostbuster-esque duo with their mormon missionary type outfit  on, who return to once again provide the humor for this franchise. But  seriously, James Wan has mastered this genre and made it his own. To  me, Wan is like this generation's Dario Argento. Wan and screenwriter  Leigh Whannell prove to be a winning team and they've brought us a  sequel that's just as good or even better than the first film.  Now, I'm going to try to do this review without spoiling details, and  it's going to be hard but I'm going to try to the best of my ability.  INSIDIOUS: CHAPTER 2 takes us back to The Lamberts who went through  basically hell over their son's essence being trapped in this realm  called The Further. Now, what's extremely cool about how Wan and Leigh  crafted this sequel in that they play it in a way that this realm The  Further becomes a connection, a bridge between the first and this  second movie. There would be little instances like a door suddenly  opens by itself in the first film, and this sequel shows you why the  door did that. There are countless sequels out there that try hard to  expand on something while begging audiences to check out the first film  again, but the way that is done in INSIDIOUS: CHAPTER 2 is clever.  Folks who've seen the first movie would be amused, folks who haven't  seen it would practically beg to watch the first movie after they're  done viewing this sequel, and all of it much thanks to this realm that  Wan and Leigh created, anything can happen in it, you can travel  through time, you can travel through places, ghosts can get you there,  and you can even get trapped in it, it's like a zone or a dimension  that probably Rod Serling himself would wish he had thought of it.  James Wan is a great horror director because he knows exactly what  scares you. That idea that somebody may be there watching when you  can't really see anybody there at all. It's that uneasy feeling that  slowly but surely creeps up on you and then strikes you in a heartbeat  without mercy, it's that old ghostly tale told by some kind of expert  who has gone through the experience years prior, Wan knows exactly  which elements that would not only scare you but would also leave you  scared long after the movie's done. INSIDIOUS: CHAPTER 2 offers all  that and a bag of chips, one can even call this movie, INSIDIOUS: The  Origin Of The Bride In Black. While they're dealing with what may or  may not have happened to Patrick Wilson's character, they discover a  certain backstory that explains the motivation for the Bride In Black.  While a certain past or a certain childhood is a dealt with and as they  try to close the chapter on The Lamberts, they open a new way to a  possibility of the team of experts going to another family, because  this is a world where The Further has taken the front seat, it has  become the lead star and the face of this franchise. I think INSIDIOUS:  CHAPTER 2 won't disappoint the fans, and I guarantee you'll have a  jolly good fright at the theaters.","user":"Ramascreen","rank":[61,94]},{"title":"Cash grab? probably.","rating":4,"date":"14 September 2013","review":"The Wan hype train is rolling through this film, there for it will make a lot of money just because of The Conjuring. I don't hate James Wan, I just hate the people that d**k ride his films, probably because horror is complete trash now-a-days, and this is the closest thing people see as good horror. But in reality, it's mediocre and nothing special. The Conjuring was a well made film, but it was downright horrible in every other category, including the most important thing, atmosphere/scares. Luckily this film was more of a thriller than it was a horror film, they recycled the exact some scares from the first film. I'll explain.<br><br>The plot is alright in the sense that it actually has a thought out story line, even if it is down right stupid at times. All the characters return, even those annoying comic relief paranormal specialists. You can pretty much guess the plot just by watching the trailer, every thing is obvious, except for when they stretch out the BS. There is some time travel nonsense that is just plain ridiculous. Is there infinite realities, is this Bioshock or a ghost movie. It really tries to have this mind bending plot line, but it just had me rolling my eyes. It's about as clever as the swing away twist in Signs, that's pretty bad. The ending should be left as it is, if not, we are looking at the next paranormal activity, the BS will just go on and on, but people will see it. In fact, James Wan could be described as paranormal activity, over hyped, appeals to the masses, even if it completely ruins his films. He makes his films dirt cheap, and wrings in the cash from the general audiences.<br><br>The music is still loud as hell, or quiet to the point you can't even hear it. The acting is fine, they get a pass. There is no tension, no good scares or atmosphere. You never feel a sense of urgency, or fear. It is all around horrible as a horror film. But it was pretty entertaining, and just all around fine. You'll roll your eyes more than you'll jump in terror. The story was wrapped up, but that old Hollywood money machine will still be sniffing around this franchise.","user":"DustinRahksi","rank":[33,49]}]