[{"title":"Mediocre British \"Humor\"","rating":5,"date":"30 October 2018","review":"It is safe to say that the funniest part of this movie is the very last line of the credits. So now you can jump straight to the end and enjoy the best thing in the movie and save yourself all the rest of that time.<br><br>This is typical absurdist British surrealist humor. Dark, ridiculous, full of cliche characters that too much mimic real life people all of us know. It is almost enjoyable but not quite. Interesting enough that if you make it to the halfway point you will probably go ahead and watch the rest, sacrificing the remaining time so that investing in the first half of the movie won't be a complete waste.<br><br>The Fitzgerald is a surviving, surfaced submarine in a post-apocalyptic world full of poisonous gas. The residents can't boast a functional brain in the lot of them. Viewers will consider this either brilliant or blundering tripe, depending on your point of view. As it's intended, it is presented reasonably well. It could have been better by a great deal. In the end the viewer is left with one big question: \"That's it?\"","user":"Snootz","rank":[10,15]},{"title":"Pretty good","rating":7,"date":"6 January 2019","review":"This is a British low budget film, a quirky, post apocalyptic comedy, brilliantly and interestingly shot. Reminds me of a Wes Anderson movie, although doesn't have the level of artistry of his work, just the influence of the look and feel.<br><br>It's the tone of the film that really plays - the direction, the acting, the photography, production design and the music, it all fits and works well together. It makes the film feel professionally and solidly handled despite obviously having a small budget.\nThe performances from the unknown cast are absurd and over the top, but that's the point with this type of comedy.<br><br>No stars, no money, few locations. You know the drill. But will you like this film? A comedy has to be funny. But funny is so subjective. If you like Fawlty Towers, Monty Python and that sort of British humour you might like this. Just don't expect the brilliance of those classics, but a take on the genre and you may find yourself laughing like I did.","user":"Jaspa1982","rank":[5,9]},{"title":"dissapointing and poor","rating":2,"date":"30 October 2018","review":"Poor script, poor performances, poor photography, poor budget (includes only the former military submarine probably with no cost and most of all characters which reminds the backyard of a multi apartment building. The effort to make it a graphic scenery fade away by the characters themselves probably inspired by the memories of the author of the script.\nThe best part of the movie is the opening animation scenes... for about four minutes which open your appetite and expectations but the rest is boring... pity for writing this!","user":"ioannesp","rank":[7,16]}]