[{"title":"The writer wanted to hire girls to get their boobs out for him","rating":1,"date":"16 March 2015","review":"What the... I have no words. <br><br>So lemme get this straight. You're 2 best friends were killed, you run for help, you decide hey - there's a bar, and there's a hot girl right there.. let's have a shot, and hey, I'm just gonna wash my face whilst I'm here because it's not like anyone is in any immediate danger of being savaged to death whilst they wait for me to save them. And the nudity... well my Husband loves a bit of T&amp;A in a film (he's a guy,duh!) but even he couldn't understand why every girl in the move was flashing her silicones when they should perhaps be concentrating on , um I don't know..survival maybe? <br><br>We couldn't understand if this was a horror, comedy, or an audition for porno for the lovely leading ladies. That being said, the only thing they could do was take off their clothes as their acting skills left a LOT to be desired. Where did they find these girls?! In the back pages of a magazine me thinks.<br><br>How on earth this film got the green light for production, I have no idea. And we were so outraged by the sh*tness of the overall film, I signed up to IMDb just to warn others about not only wasting time watching this spaff, but actually destroying braincells by watching it.<br><br>How people have given this anything over 1* I don't know. I can only assume that there are a couple of 15yr old boys banging the bishop to the boobies.<br><br>So in short...I just died inside after watching this ..erm...'film'<br><br>(Oh, and the girl in the club bathroom changing her underwear 20 times???? WHY???)<br><br>DO NOT WASTE 1 SECOND OF YOUR PRECIOUS LIFE ON THIS FILM!!","user":"kimmie_cutie","rank":[97,122]},{"title":"Bad Movie / Bad Actors / Bad Actresses","rating":2,"date":"20 March 2015","review":"New 2015 \"Horror\" slash Thriller. \"Muck\" This was very strange and odd and I didn't really like the acting or the story line, if any? I didn't really get it?<br><br>They started off with 5 teens in the middle of a swamp running from someone or something and 2 of them dead and 3 of them tired and wounded badly. One of them took 45 minutes to die despite having a bad cut across his chest and leg.<br><br>Most of the killing took place off camera so you don't see what happened to them, we are just told they are gone and dead.<br><br>The acting was poor, story was poor, and for 1 hour 20 this could have been a good movie but in the end was very disappointing!! I see others saying it was bad movie too?","user":"richardhoughton","rank":[29,37]},{"title":"Muck is an appropriate title.","rating":1,"date":"13 March 2015","review":"Muck is a lot of things... poorly lit... lacking plot... full of character dialogue that's trying way too hard to be Whedonesque... a shameless means to show various women naked.<br><br>The one thing Muck is not is a good movie. In fact, it's barely a movie.<br><br>We are thrown into a story mid-way with a cast of characters we get no introduction to. What little dialogue they have before they get killed doesn't do much to endear us to them, so why care about them being killed? Instead of characterization and backstory, Muck gives you extended scenes of a woman showering and a woman who apparently keeps a Victoria's Secret inventory in her purse putting on a one woman lingerie fashion show in a dive bar bathroom.<br><br>But wait, the movie has Kane Hodder! Surely that must give it some cred, right? Not as such. Kane Hodder as Hatchet under a ton of make up? Scary. Kane Hodder under a hockey mask? Scary? A shirtless, aging Kane Hodder splashing around having what is essentially a wrestling match in the climax of the movie? Not so scary. Kind of sad actually.<br><br>Muck wants to be Cabin in the Woods, but it's not funny or invention enough. Muck wants to be a softcore porn, but the movie's lighting is so bad you are better off watching scrambled porn channels. Muck wants to be a horror movie gorefest, but most of the kills happen JUST off camera and we're shown, instead, the killer or a nearby witness just getting karo syrup tossed on them.<br><br>Muck wants to be a movie but it isn't. If the excuse is \"Well, it's the middle part of a trilogy released first,\" then that shows the director/writer/guy who clearly likes boobs had no original idea other than \"Let's just show the movies out of order to confuse people.\"","user":"iceanvil","rank":[35,47]}]