[{"title":"Mad Spin Doctors Trying to Sell Berlin As a Cure For Depression!","rating":14,"date":"14 February 2019","review":"'Berlin, I Love You' has been made by people, who don't know much about Berlin. The amount of things they've got completely wrong is amazing. Nearly everybody in Berlin speaks English all the time? That's a fundamentally distorted view of the world. Some of the authors quite obviously think that Berlin would be a better place without Germans.<br><br>Most of the ten segments' stories could have been used for a 'Dallas, I love you' or 'Birmingham, I love you' compilation, because Berlin is nothing more than the background scenery. All of them are quite pointless, cliché-ridden and extremely predictable. If the nagging feeling that you are wasting your life tends to give you depressions, you should stay clear of this movie. There is an awful lot of obtrusive agitprop by pundits who don't have a story to tell and therefore settle for sending some platitudinous messages. On the other side it sometimes gets so bad and pathetic that it gave me some laughing out loud moments - so that's a positive.<br><br>The segments in chronological order:\n<ul><li>0 \"Transitions\", the wraparound (director: Josef Rusnak)</li><li>1 \"Berlin Ride\" (Peter Chelsom)</li><li>2 \"Under Your Feet\" (Massy Tadjedin)</li><li>3 \"Love is in the Air\" (Til Schweiger)</li><li>4 \"Berlin Dance\" (Justin Franklin, Daniel Lwowski)</li><li>5 \"Me Three\" (Stephanie Martin, Claus Clausen)</li><li>6 \"Hidden\" (Dani Levi)</li><li>7 \"Sunday Morning\" (Fernando Eimbcke)</li><li>8 \"Lucinda in Berlin\" (Dianna Agron)</li><li>9 \"Embassy\" (Dennis Gansel)</li></ul><br><br>Three episodes could be considered as tourist promotion: \"Berlin Ride\", \"Berlin Dance\" and \"Transitions\". In \"Berlin Ride\" a simple photo safari through Berlin cures an American tourist of his suicidal thoughts. \"Transitions\" borrows heavily from the imagery of Wim Wenders' \"Der Himmel Über Berlin\" (Wings of Desire). It shows an emotional journey from depression to lust for life. While Wenders' movie features an angel with an interest in humans, here the brooding angel impersonator (Robert Stradlober) seems to be more attracted to the great beyond. A tourist from Israel will fix this - temporarily. \"Berlin Dance\" is basicly a music clip for Max Raabe and his Palast Orchester, it's actually nice and by far the best segment.<br><br>Three episodes are completely expendable: \"Love is in the Air\", \"Sunday Morning\" and \"Lucinda in Berlin\". \"Love is in the Air\" is a trainwreck of a story and it features Mickey Rourke - a match made in the heaven over Berlin, I guess. It is notable for the complete absence of Berlin, everything happens inside of a hotel. \"Sunday Morning\" is the dream of a drag queen to get hit on by a cute 16-year-old. (Yeah, that's exactly what it is!) In \"Lucinda in Berlin\" the depression of an American tourist gets cured by puppetry.<br><br>Two episodes are hypocrisy on steroids: \"Under Your Feet\" and \"Me Three\". Whoever still likes this kind of heavy-handed propaganda is in dire need of a software update.<br><br>Two episodes are so bad that they are actually funny: \"Hidden\" and \"Embassy\". In \"Hidden\" an asylum seeker who killed a 15 years old German boy (but of course he is still the good guy, because it was somehow \"self-defense\"), seeks refuge in a brothel. Unintentional hilarity ensues. Definitely on the funny side of bigotry. In \"Embassy\" the passenger of a very talkative taxi driver reads my mind and asks her: \"Do you really need to keep talking? It would be great if you just not do that.\" It's the beginning of a wild ride that had me in stitches. Your mileage may vary.<br><br>There is an eleventh short film, beach boy Ai Weiwei directed the filming in Berlin via Skype from Peking. Sadly, it didn't make it into this compilation, which is a shame, because this sounded like the perfect recipe for a desaster.<br><br>If you suffer from depressions, Berlin is probably the last place you want to be, except if you just want to surround yourself with like-minded people. David Bowie and Iggy Pop tried it in the 1970s, you should listen to their Berlin-made records from 1977 \"Low\" and \"Lust For Life\" - not really fun stuff. 42 years later they are still a perfect soundtrack for this city. In spite of reiterated attempts of cheerfulness, 'Berlin, I Love You' is basically a very bleak and boring movie. It will not attract many tourists, if any at all.<br><br>All in all: Yes, this is a very bad movie. But it is made with adorable incompetence and a complete lack of self-reflection. Yes, sometimes it is so bad, it is kind of good. (\"Bad German Movies\"-Review No. 17)","user":"Thom-Peters","rank":[62,74]},{"title":"One cliche after an other","rating":5,"date":"5 April 2019","review":"Want one cliched PC lecture after another? Or one cliche after another?<br><br>If you like films with no story, no intelligent writing, no craft, but absent that some mindless propaganda, you will love this.<br><br>if not, skip this awful excuse for a film.","user":"random-70778","rank":[35,46]},{"title":"It's horrid","rating":19,"date":"19 April 2019","review":"This film is a collage of segments of people whose lives intersect in Berlin.<br><br>With this many big names, it is a surprise that the film is allowed to be a horrid mess. Just the first segment alone is enough to make me lose interest in the whole film. It is a bizarre short about a man and a GPS system, and it is just way too strange to be likable. The subsequent segments get no better, not even the one with Helen Mirren and Keira Knightley. The Berlin protrayed in the film is an unattractive dump, and it does not inspire any romantic feelings. Fortunately, there is one segment that is good, which is the puppet show one. It gives warmth and radiates attraction, which is the only segment that sticks to romantic love in Berlin.","user":"Gordon-11","rank":[18,24]}]