[{"title":"Tense and entertaining","rating":8,"date":"29 December 2012","review":"Hayley Atwell made this for me - she was excellent throughout. The story was exciting, although I still don't know who was watching from the forest and why they would suddenly start to do so, long after the original events. Charlotte Rampling is also very good indeed in her part. <br><br>The credits show that quite a lot of it was filmed in South Africa, which seems to have done duty for the USA. This sometimes looked cheap (the little street corner that stands in again and again for New York City) and some of the local actors had dodgy American accents. \"Turn left hyah\" doesn't strike me as authentic for New Mexico. <br><br>It was enjoyable and I recommend it.","user":"pawebster","rank":[21,27]},{"title":"A harrowing, nail-biting tale by a master story-teller","rating":10,"date":"28 December 2012","review":"This gripping film was brilliantly directed by Edward Hall, who has previously directed six episodes of the TV series SPOOKS but is otherwise little known. I cannot imagine that now he will be little known for much longer. The film is from a screenplay by William Boyd, an adaptation of whose novel (by himself), ANY HUMAN HEART (2010, see my review) was truly spectacular. I would say that William Boyd is now one of the hottest things British television has got to offer to the world. Hayley Atwell does a truly brilliant job of playing the lead in this new film, just as she excelled in Boyd's earlier series. This film is a new variation of the British traitor theme, and concerns a devilishly cunning double agent. Atwell plays the young Eva Delectorskaya, a Russian émigré fluent in English and other languages, who is recruited as a British spy in 1939. The film begins in the current day, when Eva is played with steely conviction by the indomitable Charlotte Rampling, who was for so long every thinking man's choice of the ideal tea partner, if crumpet was to be served. Really, I do think Charlotte Rampling could convince anyone of anything. If she had not been an actress she could have made a fortune as a salesman. Even now that the film is over, I still believe she is out there with her sawn-off shotgun ready to protect herself from the people who want her dead because she knows too much. The screenplay, as is to be expected, coming as it does from Boyd, is sensationally well crafted. All the cast are excellent. Rufus Sewell has matured into a most interesting actor who has gone beyond youth into becoming a real man at last. For too long he was the thrusting young man. Now he can get all those good solid grown-up parts which suit him so much better. He does a wonderful job here as the spy master Lucas Romer, who in the present day scenes is played with his usual powerful presence by Michael Gambon. Young Michelle Dockery plays the daughter of Rampling. We can see her character visibly maturing on the screen, as the action brings out that rare thing in a movie, true character development. At the beginning of the film, when Rampling announces to her daughter that her name is Eva Delectorskaya, Dockery thinks she must be getting Aldzheimers or something, and says: 'Nonsense, you're my mother. Your name is Sally Gilmartin', as if she were a nurse calming a patient. But gradually the truth begins to dawn, and it is not long before they enter into a double game as a team to flush out the threat to Rampling's life. There are many heart-stopping moments. But the central glowing presence on the screen which makes everything work so convincingly is Hayley Atwell. She was named by her parents after Hayley Mills, as so many thousands of British girls were. (Hayley was only a surname until Hayley Mills was given it as a first name, her mother being Mary Hayley-Bell. William Hayley, 1745-1820, their ancestor, was a distinguished minor English poet of the 19th century and a close friend of William Blake.) So maybe talent is hereditary, passing down through anyone named Hayley. Just a thought! The seamless interweaving between past and present in this film (well, I say film, it was shown in two episodes on the BBC and is thus technically a mini-series, I suppose, though with a running time altogether of only 3 hours) is done with considerable finesse. Everything seems to have come together to make RECKLESS a total success, and that splendid achievement was anything but reckless. More, please!","user":"robert-temple-1","rank":[33,47]},{"title":"Watch it for the actors","rating":6,"date":"11 January 2013","review":"RESTLESS is a two-part BBC drama, based on a story by ANY HUMAN HEART author William Boyd. It's set in two different time periods, the 1940s and the 1970s, and follows the fate of characters working as spies during WW2.<br><br>For starters, this is no ANY HUMAN HEART. The calibre of the script just isn't up there with that production's, and the whole cross-cutting between two time periods doesn't work that well. The wartime espionage stuff is fine, but the '70s era plotting is dull and features luvvies Charlotte Rampling and Michael Gambon giving typically lethargic performances.<br><br>Thankfully, we have at least half of a good show, because the spy stuff is where RESTLESS hits its stride. Hayley Atwell (PILLARS OF THE EARTH) once again proves her worth as a tough, sexy, heroine, trained to be a spy by the British and engaging in all manner of dangerous plots thereafter. Rufus Sewell more than matches her as the suave spymaster she falls for.<br><br>Clocking in at three hours, the production is a little slow and the ending more than a little obvious; the identity of a key villain is also way too obvious. Still, the espionage scenes are handled well and it's a pleasure to watch drama that doesn't pander to its audience.","user":"Leofwine_draca","rank":[25,38]}]