[{"title":"Missed somethings","rating":6,"date":"21 December 2014","review":"Conspiracy theories. Espionage. Terrorist acts. All this is present in the film Closed Circuit. What are not present are depth in theories developed by the characters and explanations of crucial details of the film.<br><br>Starring Eric Bana and Rebecca Hall, the film shows us a little of the British judicial system. This is perhaps one of the biggest flaws of the script. The lack of explanation of how this system works and how it is structured, does not allow us to get into the story, just accept what is shown.<br><br>About the actors, Eric Bana is what to be expected for those who have seen his films. In contrast, Rebecca Hall shows the same talent seen in The Prestige (2006) and The Town (2010). Jim Broadbent gives us another opportunity to see his gift, even in fast appearances during a 90-minute film.<br><br>The film wants to leave the place where it started, however the lack of surprising elements in the script makes everything back to the beginning. This is the same path that follows the protagonist throughout the story.","user":"rartioli_21","rank":[13,13]},{"title":"Not the Thriller expected, but not bad","rating":5,"date":"8 February 2014","review":"Martin Rose (Eric Bana) and Claudia (Rebecca Hall) are assigned to a case to defend Farroukh Erdogan (Denis Mochitto) who is accused of bombing a London market killing 120 plus. Because this case involves classified information Martin and Claudia cannot interact together or they will lose their licenses. Martin is the Defense Lawyer. Claudia is the Defendant's Advocate. Martin will defend in Open Court and Claudia will defend in Closed Session where classified information will be presented. In time, both learn that a government cover-up may be in play. Uh oh! What to do? What to do?<br><br>Not sure though if the Advocate person is only assigned when classified info is in play. No matter. It is what it is. <br><br>Well, of course, you know that Martin and Claudia will somehow interact and this will cause them to be most careful. Oh, they were lovers a while back. See? <br><br>This will not be the thriller you may have expected. No, it's a comfortable ride and the pacing is just right. Some things happen but nothing to put you on the edge of your seat. It's not that kind of thriller, but it is watchable. See? <br><br>I enjoyed this but the ending is really weak. Bummer. (5/10)<br><br>Violence: Yes. Sex: No. Nudity: No. Language: Yes.","user":"bob-rutzel-1","rank":[20,23]},{"title":"You're so sly, but so am I","rating":8,"date":"31 August 2013","review":"It was a bit difficult getting up the motivation to do a write up for this one, as it does not inspire. But it is very believable, with a realistic feel in script and action. Both sharp and taut throughout, this is meant to be more intellectually stimulating than adrenaline releasing. A movie that makes you think. I found the tone and atmosphere, at least in part, to be comparable to Roman Polanski's recent effort in The Ghost Writer. <br><br>There seems to be a resurgence in recent years in both the practice of and appreciation for the well honed tension that Hitchcock was famous for. This has some of that. It seems that making what most would call a good movie was not the aim here, as much as having something to say, and wanting it said well. Which it was. What was said bothers you a bit, after.<br><br>If you combined elements of the legal drama in Syriana, the syntax of a big brother government in Enemy of the State, along with the perfect pace and proper tension in The Ghost Writer, you'll have an idea of the movie. Perhaps that's what he was aiming at. It isn't as good as any of those films. But definitely worth seeing if you want something more cerebral. <br><br>Without giving anything away, it seems they were very clever in an almost feigned attempt at a happy ending. A bit of psychological warfare I think. You'll have to see it to know what I'm talking about. Much too lite for such a serious threat. But then, that was probably the intention. It kind of helps drive it home and makes it stick to you. Some complained about it being too short. I do want my money's worth, but I don't think the time affected the quality of the movie.<br><br>http://fullgrownministry.wordpress.com/2013/07/29/no-anxious-thought/","user":"onewhoseesme","rank":[87,115]}]