[{"title":"I am speechless, but fortunately I can still write.","rating":1,"date":"12 April 2014","review":"Preamble; I love movies of all genres from The Princess Bride to Total Recall with side-trips through the classics and British Comedies. That being said, this is perhaps the worst movie I've seen to which actors of this caliber have been attached. This is Grovic's first directorial attempt, and he has yet to develop a sense of tone, story-telling, etc... This movie is a mish-mash of other stories pasted together with no commitment to it being a comedy, gritty suspense story, visceral murder and mayhem fest or spoof. It's a mystery, to me, why these very talented actors made this movie. Are they friends or relatives of the director? Did he have a colossal budget to pay them? Was the script great and then thrown out during the process of making the movie? Beats me. I rented from a Red Box and I feel cheated at $1.20 Sorry for being so harsh about this film, but when proved actors whom I regularly pay theater prices to see work make a movie like this it's jarring to my artistic sensibility. Better luck next time.","user":"spydermanstudios","rank":[46,70]},{"title":"Adjectives have not yet been invented to describe what I saw","rating":1,"date":"8 March 2014","review":"Having just seen this film, I am in a state of disbelief, bordering on numbness. That John Cusak, memorable in \" The Grifters, \" &amp; Robert De Niro, would sign on to this train wreck is beyond comprehension. De Niro's hair stylist is only surpassed by Stevie Wonder's &amp; his costume designer is from the Liberace School of Tackiness. As far as the plot, theme, story-line, whatever...it is an embarrassment to the film industry, at large. To borrow a phrase from Judge Welsh, when questioning Senator Joseph McCarthy, to all who participated in this disaster: \" Have you no shame?\" I take no satisfaction in saying what I just did, but I could not, in good conscience, let this slip by &amp; traumatize those out there who would expect to see a quality film &amp; end up wondering what they just wasted their time watching. It is B A D!","user":"farberw-1","rank":[47,72]},{"title":"I had fun with this movie--it has a sense of humor about itself.","rating":7,"date":"22 February 2015","review":"This was not a great movie, but there was plenty of fun stuff going on. I laughed out loud a few times, and had fun almost the whole way. Not everyone will like it, sure, but I don't see how it is as bad as a lot of the reviews are saying, and I wonder if those people had mistaken expectations? Like they thought it would be tense and gritty, grim and threatening? But it's not--it's a left-field black comedy with some tight action moments and--yes--actual character development. Maybe you have to have the right kind of sense of humor to enjoy it--almost nothing in this movie is meant to be taken seriously, not even the weird romantic tension that develops, and certainly not the eventually revealed backstory that drives the plot. I would rather watch 10 quirky, off-beat, low-budget indie black comedies like this than 1 (imho) flat-footed, ham-fisted, self-serious big-effects-budget film like ... Skyfall.","user":"dewittambassador","rank":[11,14]}]