[{"title":"Well-Acted, but not Hilarious!","rating":6,"date":"29 July 2015","review":"'Clear History' is certainly amusing &amp; also well-acted, but its not Hilarious. Despite some funny moments &amp; an ensemble to die for, this Larry David comedy doesn't really bring out the hilarity one might expect from it.<br><br>'Clear History' Synopsis: A disgraced former marketing executive plots revenge against his former boss, who made billions from the electric car company they started.<br><br>'Clear History' clearly lacks wit &amp; top humour. Larry David, Alec Berg, David Mandel &amp; Jeff Schaffer's Screenplay has a terrific premise &amp; some sequences, especially when the revenge is plotted against the antagonist, do hold you interest. But, overall, its strictly average. The sub-plots are too many &amp; sadly, not all of them even work. Even the culmination to this twisted story, isn't well-done. A far superior Screenplay could've made things better! Greg Mottola's Direction is standard.<br><br>'Clear History' is led by a very fine cast. Larry David is in his element &amp; performs marvelously well. Michael Keaton is simply astonishing as the angered hillbilly. He steals the show &amp; brings the house down. Bill Hader is first-rate. Jon Hamm is effective. Kate Hudson is genuine. Live Schreiber is superb. Eva Mendes is excellent. Philip Baker Hall, Amy Ryan &amp; Danny McBride shine, as well. <br><br>On the whole, 'Clear History' has stellar performances, but thats about it.","user":"namashi_1","rank":[9,10]},{"title":"Highly entertaining and funny as I expected.","rating":8,"date":"19 August 2013","review":"Clear History is like an extended episode of L.D.'s Curb Your Enthusiasm, it has the same spirit, the same jokes, but yet it works. How could this be ? I think it's all thanks to a brilliant vision of a genius of comedy, Larry David. <br><br><ul><li>Clear History centers on Nathan Flomm (L.D.), a marketing executive, who works for and is also a partner with Will Haney (Jon Hamm); they're working on an idea of a revolutionary electric car, but when the name of the car becomes an issue for Nathan, they part their ways. Nathan regrets it and wants to get back on the business, but Will refuses him. Nathan, in order to avoid the humiliation of having missed out on a hugely successful business, assumes a new identity on Martha's Vineyard. One day (after 10 years) a well known face shows up in town (Will Haney), and leaves Nathan no option but to plot revenge.</li></ul><br><br><ul><li>Any \"Curb Your Enthusiasm\" fan won't be disappointed with what \"Clear History\" has to offers, and anybody else who watches the movie will enjoy it too, cuz the movie is funny, the jokes hit the mark, the story is simple (it's easy to follow it), the ensemble cast dances with L.D's tune and also the soundtrack (mostly supplied by Chicago's discography) make it a \"Clear Triumph\". * Now, I think, it's time for the next season of \"Curb...\" !!!</li></ul>","user":"Atdheu90","rank":[42,60]},{"title":"Clear History: It's history is clear","rating":11,"date":"11 August 2013","review":"If you're a fan of Larry David's (and I am) this feature film should make you very happy. It's very much like an extended episode of Curb Your Enthusiasm with the same sort of quirky observational humor and dependence on Larry's obsessions with the minutia of every day life. The revenge plot, the back story are just scaffolding on which to build the kind of gags that made Seinfeld and Curb so satisfying. Is Larry exploring new territory? No. But expecting LD to be different is like expecting Woody to be a different person in his films. One can argue that Woody and Bob Hope and Danny Kaye are always themselves (or at least their comic personae) in all of their movies. And I wouldn't have it any other way. There are lots of laughs in this film and Larry delivers in his signature style.","user":"gjtoon-1","rank":[38,57]}]