[{"title":"Jue di tao wang: I enjoyed it despite it's best efforts","rating":8,"date":"11 January 2019","review":"Okay bear with me on this one, this is one of those films that I enjoyed yet I fully understand an argument against me doing so.<br><br>You see Netflix decided to make another buddy duo with Jackie Chan, he's done great work with Chris Tucker, Owen Wilson and even Lee Evans before so it made sense. There is just something about him that screams buddy movie, so here they pair him with Johnny Knoxville which has been met with a very mixed reception. Do they have chemistry? I personally thought so.<br><br>It tells a rather generic action movie story (As they tend to do) with lashings of comedy to keep it interesting and in my view both of these leads excel in that department. They both have great natural comedic timing despite not really coming from that background, Chan from martial arts and Knoxville from.......stunts?<br><br>An old school buddy movie with over the top sequences, the odd couple dynamic and Chan's trademark comedy stunts/fight scenes I was enthralled but the films flaws are overwhelming.<br><br>Many jokes miss their mark, some moments seem awkward, the fights are considerably tamer than we're used to (Chan's age no doubt a factor), and the whole thing has a really PG vibe to it. Truth be told the movie has a lot more flaws than I'm letting on but it's qualities outweigh them and I found it an enjoyable, fun, throwback movie.<br><br>I understand the criticism, but I really enjoyed it and would love a sequel.<br><br>The Good:<br><br>Leads do a great job<br><br>Eve Torres is ageing like a fine wine<br><br>Some funny moments<br><br>Awesome buddy movie dynamic<br><br>The Bad:<br><br>Littered with flaws in pretty much every area of the film<br><br>PG cuteness hurts the film","user":"Platypuschow","rank":[13,13]},{"title":"Pretty dumb, but also pretty fun","rating":7,"date":"16 October 2016","review":"Okay, the plot is a little bit all over the place at times but it still had some pretty neat fights (Jackie Chan always delivers some good stunts for his films) and some fun humor (often within said fight scenes). <br><br>There was some dubbed scenes in the first 20 minutes where they clearly weren't speaking English as they would have had no reason to being just Chinese present but luckily that didn't last too long.<br><br>I'm guessing the studio thought that Johnny Knoxville fans couldn't handle reading too many subtitles so they dubbed every other scene that was Mandarin sometimes more obvious than others (in the first dubbed scene they avoid the obviousness by simply picking shots that avoid the lips of the cast when they speak).<br><br>But I guess that makes it feel a bit like the classic early 90's Jackie Chan movies where they did similar things for the international versions.<br><br>Anyway all in all I was mostly entertained and that's why we watch these kind of movies after all and it's worth watching it to see Jackie Chan sing Adelé alone.<br><br>6.5/10 for me.","user":"Seth_Rogue_One","rank":[18,19]},{"title":"Reminiscent of 'RUSH HOUR' and 'SHANGHAI NOON', but not quite as good.","rating":7,"date":"21 November 2016","review":"'SKIPTRACE': Three and a Half Stars (Out of Five)<br><br>The new Chinese-American action-comedy buddy film, starring Jackie Chan and Johnny Knoxville. It was directed by Renny Harlin, and written by Jay Longino, BenDavid Grabinski and Wen-Chia Chang. The film tells the story of a Hong Kong detective, that's forced to team up with an American gambler; in order to stop a Chinese crime boss. The movie also costars Bingbing Fan (a popular Chinese actress and pop singer), Eve Torres (a popular WWE wrestler, model and a Brazilian jiu-jitsu fighter) and Eric Tsang. The movie received mostly poor reviews from critics, but it was a blockbuster at the Chinese Box Office. I enjoyed it.<br><br>Bennie Chan (Chan) is a Hong Kong detective, that's been pursuing a Chinese crime boss, known as 'Matador', for many years. He became obsessive about the case, when the notorious criminal killed his partner, Yung (Tsang). Bennie believes that a businessman, named Victor Wong (Winston Chao), is the 'Matador', but he doesn't have the evidence he needs to prove it. When Yung's daughter (Fan) gets in trouble with the crime boss, for letting an American gambler, named Connor Watts (Knoxville), steal from her, Bennie must track the gambler down in order to help her. Bennie and Connor then reluctantly team up, and of course bond on their new adventure.<br><br>The movie is everything you'd expect from a Jackie Chan buddy movie; it's reminiscent of 'RUSH HOUR' and 'SHANGHAI NOON', but not quite as good. Knoxville is great playing the comic relief, in action buddy flicks like this (he also did it in 2004's 'WALKING TALL', and 2013's 'THE LAST STAND'), and he and Chan have great chemistry together; it would have been interesting to see Sean William Scott in the role too though (who Knoxville replaced). Renny Harlin is of course very qualified to direct this type of movie as well, and he does a good job. It's a fun movie; not great, but fun.<br><br>Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=2GhHTPB4y30","user":"Hellmant","rank":[10,10]}]