[{"title":"Amazing spectacle; no story required","rating":9,"date":"6 July 2012","review":"I'm a bit of a fan of good photography, and I enjoyed films like Baraka and Koyaanisqatsi. Whilst these two examples have a theme, however loosely you might interpret it, Timescapes is all about the spectacle. Don't be thrown off by negative comments because it doesn't have a story - it doesn't need one. Half the films in Hollywood are all visuals and sound effects with little story, and at least Timescapes has these qualities without pretending to be anything else.<br><br>It is expertly shot, beautifully scored, and I found it to be a rousing film that can be enjoyed just for the craft alone. Whether you are a fan of photography, astronomy, or just like something cutting edge, this film will not disappoint.","user":"LynchpinHags","rank":[22,28]},{"title":"a visual masterpiece - must see","rating":10,"date":"14 July 2012","review":"There are movies and there is cinematography. First of both are made to entertain while the second is pure art. \"Timescapes\" surely belongs to the latter.<br><br>Until now there were two motion pictures of such a breathtaking visual power - Baraka and Home by Yann Arthus-Bertrand. While Baraka has the most complex story and Home delivers an ecological message, Timescapes now completes this trilogy being the artistic one of that bunch.<br><br>It's right, there is no clear story behind and the scenes seem to be some kind randomly cut but this does not really matter as each of them is a masterpiece of its own. It can be compared to an exhibition of pictures, all of them show the workmanship of a great master while each is independent and not an element of a series.<br><br>Time lapse photography is an artistic expression and it is pure joy to watch it put on a screen in brilliant perfection. However do not get lost in wrong expectations, TimeScapes has not been filmed to be an entertaining blockbuster, instead it wants to show you the beauty of motion pictures - either in slow-mo or time compressed views.<br><br>So if you liked Baraka or Home you will most likely also enjoy this work. From the technical point of view there is nothing to complain about, the BluRay version is of high quality, detail sharpness is outstanding and the soundtrack fits very well to the pictures.<br><br>It is my humble opinion that motion pictures like these are important, to set a contrast to all those movies made for commerce in order to entertain the crowd. It is a fascinating expression of art and for anyone interested in cinematographic art a must see - possibly one of the best works of 2012.","user":"humodda","rank":[15,21]},{"title":"Astonishing and Brilliant.","rating":10,"date":"11 June 2012","review":"What can I say about \"Timescapes\" other than it is pure brilliance. The photography of this film will blow your mind. Every single second, every single shot is brilliantly crafted to leave you in a state of amazement. <br><br>This is said to be the first film shot in 4k resolution to be sold to the public. I had the pleasure of viewing it in 1440p and can say I have seen no finer quality. I can only imagine the experience of viewing this film in its 4k resolution but plan on it very soon. <br><br>As you watch the stars pass over in brilliant time-lapse you are left with the notion of how small and insignificant we are to the vastness of the cosmos.<br><br>The score meshes with the imagery with perfection and creates a viewing experience not to be forgotten. It seems that no detail was considered insignificant to the filmmaker. This is my first experience with this director and I can only understate how impressed I am. <br><br>From what I understand the director lived out of a truck for 2 years to craft this film. To anyone who is considering this, it is not a something you view once, it is something you will be glad to own and share with people. This is the first true 10 I have rated. Bravo to the creator!<br><br>I simply cannot recommend this film enough.","user":"ChrisMichael81","rank":[22,35]}]