[{"title":"Satisfying Story of Young Adult Indecision","rating":8,"date":"30 July 2013","review":"I've got no experience with Veronica Mars, but I can see why people like Kristen Bell. She's real and relatable, as are all of the characters in this film.<br><br>At age 29, with her life in the city more disheartening and less complete than she ever expected, Kristen Bell's Leigh heads back home, where her two best friends (Mammie Gummer of The Good Wife and the familiar Martin Starr of Freaks and Geeks and about a million other comedies) are leading lives equally unperfected. During her aimless summer in her home town, she crosses paths with the local drop-outs, played sensitively and convincingly by a trio of young actors, including recently discovered teen actor Alex Shaffer of the Paul Giamatti film Win, Win, in a supporting role. Youthful indiscretions can't really cohabit with adult responsibilities, and the dramatic tension is ratcheted-up (if also resolved fairly easily) in sincere ways.<br><br>Nice production and a convincing story of early middle-age indecision with nuanced acting by a strong cast of recognizable faces adds up to a satisfying film.","user":"matthew-bonness","rank":[45,57]},{"title":"A Drama about Searching for Fulfillment","rating":6,"date":"3 December 2013","review":"If you are looking for a neat package of a film with all the loose ends tied up with a pretty ribbon, this film is not for you. And as we all know, life is not that way either.<br><br>If seeing an older woman with a young man nauseates you, don't watch this film. Frankly, I wonder why some people never read about movies before they watch them. Then they are shocked to discover the themes of the movie.<br><br>Kristen Bell plays a 29-year-old woman who has grown disenchanted with the big city and her life there. She returns to the small town where she grew up, and moves back in with her parents.<br><br>This action can be described as irresponsible, simply because she is looking for a respite from responsibility. In fact, she returns to the Lifeguarding job she used to have.<br><br>She reconnects with old friends who have remained in the home town. They also have issues regarding responsibility and self-actualization. <br><br>In an attempt to regain the freedom of youth--and its passion--they start hanging out with some high school kids. This leads to some risky behavior. The rest of the plot relates to how this dangerous situation plays out.<br><br>I thought the acting was good. I especially enjoyed seeing Amy Madigan as the mother. Back in the day, I really enjoyed her in To Live and Die in L.A. <br><br>The movie Lifeguard, starring Sam Eliott in 1976, also dealt with a main character who is a lifeguard and who struggles with the issue of responsibility. I recommend it.<br><br>The main thing I can say about this movie is that it feels something like how real life is. People make mistakes. People come to crossroads. People sometimes search for answers without really having a clear understanding of the questions.","user":"atlasmb","rank":[19,23]},{"title":"heavily dependant on life circumstances","rating":6,"date":"31 August 2013","review":"where to start on this one...<br><br>i think opinions on this film will be formed from personal life experience and how much someone can relate to the characters. myself, I'm similar in age and circumstance to Leigh and recently made a life change much like hers (moving back home from the city) and while the mistakes and tumbles she makes are outright irresponsible, i could not help but like her character and the maturity she showed at the end.<br><br>the romance aspect of this movie, whilst most definitely *inappropriate* does reflect the mental state of the main female character played by Kristen bell. stifled by her routine adult life and the responsibilities that come with it, she finds solace in a younger group who bring out her inner teen as it were. i think this is extremely well portrayed in the film through the three main adult cast members, who were friends in highschool, that upon the return of Leigh (KB) all suddenly start to regress and rebel against the adult strains put on them. all three characters go a little wild and forget that 'time only moves in one direction' and their subsequent battles to re-balance themselves as adults was interesting to watch.<br><br>the strength of the young actors in this film prevented it from becoming smut. David Lambert had enough charisma that it was plausible that a confused and disturbed woman would be drawn to him, whilst still maintaining that young innocence that made the story equally as much about him maturing as it was about KBs character. Alex Shaffer was impressive and moving in his portrayal of a tormented young man.<br><br>could it have been done better? absolutely. does it contain inappropriate feelings and relationships...obviously yes. Does it convey the ability of people to mess up in the most stupid irresponsible ways....yup. i liked it. i wouldn't watch it again, but it was a good film. comedy it is not however and the tag-line cheapens the movie.","user":"manicmeuk","rank":[17,22]}]