[{"title":"Powerful and topical","rating":10,"date":"20 November 2014","review":"There are some issues in this country that continually get brushed over in the hopes they will never grow as a problem. School shootings are one of these issues. They are disturbingly unique to this country and have increased in frequency. This movie does the best job yet of tackling a very difficult subject that shouldn't be dismissed. The film is artfully directed by Tim McCann. It has a documentary like power that brings to mind ' Z' directed by Costa-Gavras, but is much harder to watch than that piece shot in the 60s. White Rabbit is contemporary, unvarnished, and brutal. This film reminds you that mental illness has many faces and continues to be misunderstood and evaded as a root cause of these shootings. I've looked over McCann's filmography and he has a legacy of socially relevant films tackling the most difficult subjects. Very courageous and inspiring in an era where we cannot rely on the media to properly weight the right issues.","user":"mrizzer-1","rank":[19,21]},{"title":"Rise up and be the better man","rating":9,"date":"3 November 2014","review":"Harlon's life is dominated by an emotionally-abusive father. He gets picked on at school. He has almost no friends. He is failing his courses. He doesn't quite fit in to his world. He grows more and more reclusive and his only solace is found in the comic books he reads. Soon it starts to become apparent that Harlon will reach a boiling point in his life. Luckily, a fallen angel appears, and ends up reminding him of the little rabbit he couldn't (didn't want to) kill when he was young. The end result is that he finds the compassion that he had lost from when he was a child. I was really satisfied with the end of the movie. I hope people who watch this give it a chance and see the bigger picture.","user":"LiamBlackburn","rank":[14,17]},{"title":"Very enjoyable and unique","rating":10,"date":"11 October 2015","review":"Growing up can be tough. It is even more tough as men when we are sensitive, and things can just get to us so much. Bullying tactics might be enough to have us cry and just have different meltdowns of sorts. I believe this is the core theme of this movie.<br><br>In life we have challenges and we can rise above them and be better then them or we can let them crush our soul.<br><br>Watching bullying movies can be hard for me and yet so relatable although the movie is only about bullying in part I believe it to be one of the central themes. It makes me angry inside seeing bullying but for me I just sympathize with it so much due to my own experiences.<br><br>In life we have to be tough but kids do not always know how. In small town living there is not much to do but people have fun doing what people have always been known to do.<br><br>Very interesting directing, use of filter, acting, writing, the story flows in an interesting way, and the topics throughout the film are extremely relevant.<br><br>There are things with the film I will not talk about, as the story changes in interesting ways throughout the film.<br><br>I bumped into this on the \"trending now\" section on Netflix streaming and I was glad I did. It also has Sam from True Blood in it who I always liked. He plays a real masculine no nonsense type dad.","user":"SillyGayBoy","rank":[4,4]}]