[{"title":"\"You scorned me, Kevin.\"","rating":4,"date":"15 February 2014","review":"The movie begins with a corny song over a laughable text message conversation so I knew right away this wasn't going to be something I would want to brag about seeing. The plot is about a complete psycho (AnnaLynne McCord) who discovers her boyfriend (Billy Zane) is cheating on her with her best friend (Viva Bianca). So she ties them both up and spends the bulk of the movie threatening and torturing them.<br><br>AnnaLynne McCord, with her horrible Southern accent and tacky hair extensions, offers up an extremely campy performance. You will undoubtedly spend most of the time viewing this laughing your ass off at her. She seems to especially enjoy using profanity like a child who has just discovered dirty words. She's really the whole show here. Whether you find anything to like about this movie depends entirely upon how much you enjoy her bad acting. Well, whether it's bad or whether it's \"so brilliant that you just think it's bad\" is up to you to decide. I know which side of that I come down on.<br><br>Billy Zane, once a respectable actor, has become moviedom's biggest garbage man. He keeps appearing in trash and getting paid for it. Viva Bianca is the only reason I checked this out in the first place. She looks amazing, even with that terrible wig on. Sadly, she plays the whole thing straight like she believes she's in Fatal Attraction or Misery. Don't get me wrong -- her acting isn't bad. It's fine, actually. It's just that opposite the scenery-chewing AnnaLynne McCord, she maybe should have tried to play the part a little more tongue-in-cheek. The script and direction did her no favors anyway. Director Mark Jones appears to have the same amount of talent as you would expect from your average Lifetime TV movie director. The story here is full of clichés and offers nothing to interest your average viewer, who has probably seen a version of this story done before and better. As a thriller, it's pretty weak. As an unintentional comedy, it's good for some laughs. Go into it with the right expectations and you might enjoy it.","user":"utgard14","rank":[19,27]},{"title":"Scorned is a wonderful dark comedy","rating":7,"date":"12 February 2014","review":"Mark Jones (Leprechaun) &amp; Sadie Katz (House of Bad) have put together a really fun dark comedy.<br><br>The premise is simple, a pair of love birds head out for a romantic weekend but the plans are derailed when the boyfriend(Billy Zane) is found out to be a cheater. The girlfriend (AnnaLynne McCord) learns of the situation and becomes unglued and then the fun begins.<br><br>Many of Mark Jones films feature malevolent midget monsters but with Scorned Jones &amp; Katz have created the monster girlfriend that every man should rightfully fear. <br><br>The movie is worth seeing just to watch AnnaLynne McCord (90210, Dallas) ratchet up the crazy!!!","user":"linewrench","rank":[21,33]},{"title":"A Showcase of Acting, But Not Much Else","rating":5,"date":"3 February 2014","review":"A romantic weekend turns horrific and sadistic when Sadie (AnnaLynne McCord)discovers her boyfriend (Billy Zane) is having an affair with her best friend (Viva Bianca).<br><br>If you are looking for a film about a kidnapper who tortures her victims for perceived wrongdoing, you will be better off with \"Misery\" (referenced here) or \"Death and the Maiden\". Despite a decent cast (I never tire of seeing Billy Zane), this plot is just not all that special and comes across as disposable -- despite a strange subplot / twist relating to a nearby prison...<br><br>In fact, this film probably deserves a 3 out of 10, but I cannot bring myself to do that because of one thing: AnnaLynne McCord. I loved her in \"Excision\", and now she has returned better than before. Some people do a good job playing crazy, and some (Jack Nicholson) are born for it. McCord may be in this category. A terrible film, yes, but an Oscar-worthy performance. If she gets the right roles, we may not have seen the last of her yet...","user":"gavin6942","rank":[13,20]}]