[{"title":"At Least Say Something","rating":3,"date":"24 June 2016","review":"Some thoughts: <br><br>(1) The filmmakers do far too much hiding of their own opinions in the various opinions presented here. <br><br>(2) I bet however, that they do believe things like \"black people can't be racist\". Exposing the ever-self-serving corresponding absurdity, being as simple as looking up the word \"racist\" in the damn dictionary. Instead of putting up a highly-specialized/strawman definition, only to pretend that it's THE definition. <br><br>(3) There are actual slaves in the world. Right now. Millions of them. Moreover, even in the US, there is both very real slavery and very real racism. Not dumb college kids responding to faux-civil-rights-crusader bait and wearing some dumb costumes at some dumb private party. No. People are actually being forced away from their health and freedom based on race and class - in the US - as we speak. Black people, brown people, Asian people, even white people (see: Eastern European sex trafficking), etc. Exceedingly few of these grim realities, have very much to do at all - with what's depicted here. And if one is really concerned about such matters - one would find a way to reflect (at least SOME of) them in one's film. If however, one is selfishly concerned instead with the minutiae of one's own exceedingly-privileged (by world and even US standards) existence, while wanting to disguise oneself as a hard-issue-tackler - one would make a film just like this. <br><br>(4) And if burying one's head this far up one's own rectum is an absolute must - I'd at least ask that there's a clear corresponding point. Which brings us back to (1) above.<br><br>(5) Perhaps I'm being too harsh, but when people pretend to care about higher ideals, while their efforts are all too obviously aimed instead at merely serving themselves - I have trouble seeing anything else. Whether it's Fox News with their constant cry-bullying. Or what madness Nazi atrocities and such have been used to justify in the middle East. Or such, admittedly-milder, yet all-too-similar cases.","user":"arseniy","rank":[91,120]},{"title":"A supreme case of wasted opportunity to make a difference.","rating":1,"date":"12 March 2017","review":"I watched,with great pain,the pitifully biased and nonsensical film that attempted to elevate the discourse on real racism and its presence in our world. Well funded and full of passion,it simply shows whites as the worst people,ever. The black people in the film,ironically,came off just one half a notch less awful. Im a glass half full type,so I have more optimism than the cynic that penned this thing,but the answer to this problem is NOT to write a film that portrays whites as whiskey drinking KKK types with greasy hair and hate in their hearts. The only answer is truth. Pursue it. This is NOT the truth. Just a slant.","user":"stevewrench-816-856983","rank":[131,178]},{"title":"Boring and overdone","rating":3,"date":"23 June 2015","review":"There are plenty of other black films out there that really entertain and sometimes make a point about race perceptions and relations. (see last paragraph)<br><br>The filmmakers scripted a real life situation, A racial Halloween Party in Texas...how boring can you get. Whites in black face... zzzzz..huh, oh I fell asleep. Why make a movie about one incidence of jerky white guys.<br><br>Then the movie turns into a black Dinner with White People where people chat on and on.<br><br>If you are into b/w dialogue just listen to the audio. Nothing to see here except a few very hot sorority girls. The filmmakers must have said, 'let's bring in comments on 'the weave'. Sorry Chris Rock did an entire documentary and it was great.<br><br>Was Dear White People a class project? What was the point. \"Hey some fraternity dudes can be assholes.\" Big surprise.<br><br>Rent Hollywood Shuffle by Robert Townsend and then check out the reset of his film. He is good.","user":"djderka","rank":[131,181]}]