[{"title":"Good piece of Romanian cinematography","rating":7,"date":"25 March 2012","review":"Another good example of Romanian cinematography, \"Toată lumea din familia noastră\" focuses on the character excellently played by Șerban Pavlu and the nervous breakdown he is going through on the day he wanted to take his daughter to the seaside. The apparent opposition he encounters from the mother's new boyfriend and then from the mother herself lead to growing tensions, verbal abuse and even physical violence, all of them already announced at the beginning of the movie, when we see Pavlu's character in his relationship with his own parents. Like most recent Romanian productions, it's a movie difficult to narrate and it has an open ending, a thing Romanian directors and script writers seem to very much enjoy. Nevertheless, it is undoubtedly more audience-engaging than other Romanian films, as the likes by Cristi Puiu or Corneliu Porumboiu. Strongly recommended.","user":"accercel","rank":[10,13]},{"title":"Quite veridical from my point of view","rating":8,"date":"12 September 2012","review":"I have just watched this film and was very interested in what others had to say about it. While I am not going to contradict the people claiming that this is meant to be a (very) dark comedy (I think that only the director and the writers know best whether this is true or not), I am going to state that from my point of view it is sadly way too close to reality. From the moment Marius refuses to wait for Otilia before leaving with their little daughter, my heart kept pounding in my chest because there was no way of knowing what would happen next. Marius acts like a mad person and Serban Pavlu beautifully portrays a cornered man searching for every possibility of getting away: violence, pleading, emotional blackmail, lies. What puzzled me was Otilia's calm, she was the one that reminded me it was only a film, but then again, everybody acts differently under such circumstances and it could be only myself that found her attitude slightly less real than the others'. Even Aurel, played very well by Gabriel Spahiu, with his inability to stand up to Marius, didn't seem comical to me.<br><br>I am without a doubt influenced by having had a similar drama in my own family, and thus might not be able to see it as it might have been intended - a dark comedy. However, being able to compare it to the real thing, I can say that it certainly made me feel the same, scared and experiencing mixed emotions towards each character, knowing that every so-called grown-up (as they are acting very childish) shares a part of the blame, and not being able to decide (at least at first) who it would be best to win this battle. And it is because the film achieves this that I recommend it.","user":"ruxicpit","rank":[7,11]},{"title":"Not easy","rating":8,"date":"30 April 2012","review":"It's all about family in this movie. Not only one, but what can happen when things do not go as planned. The director present at the screening of this movie in Berlin at the Festival was keen to make a lot of jokes, which came as no surprise as the movie is very much a comedy (even if it is a very dark one).<br><br>The actors are really good in it and the story does concentrate on one location mainly. And this is important because this was shot on location, which made it very difficult for the crew and the cast of course. But that also means, that it is terrific work by the DP of the movie. Smooth and nice shots and even when they decided to use a take, where you can clearly see a cell phone ringing but not hear it (for obvious distracting reasons, story-wise), you are not too mad at the movie. Or you shouldn't be. Watch it, if you have no problem with Un-PC behavior and lots of dialogue!","user":"kosmasp","rank":[7,13]}]