[{"title":"Very bad cheap movie and IMDb rating is flawed","rating":1,"date":"26 February 2015","review":"About 3 seconds into this movie I knew it was a bad movie and was checking back on IMDb like \"what convinced me to check this movie out again?\" I don't know how this movie got the rating it has.<br><br>This movie has that very easy-to-capture atmosphere of \"cheap movie made by high-school kids.\" It's not a fun kind of bad movie. This one is just bad. Bad script (but not bad enough), bad acting (but not bad enough), poor quality everything.<br><br>This is the first time I have watched a movie that was rated over a 6 on IMDb and found it to be anything but great. Why did this exception have to be so exceptional?<br><br>This movie will almost definitely NOT make it into the elite group of bad movies which become cult classics.<br><br>Don't waste your time on this movie.","user":"trick_morr","rank":[12,13]},{"title":"Interesting introduction to film making","rating":4,"date":"27 January 2013","review":"I read some of the awful reviews of the film and then decided to watch it anyway, I like B movies.<br><br>The other reviews comment on the film itself so I'll limit my thoughts on that to the following.<br><br>The film itself is not great, acting was painful at times and the music seemed to be trying to overcompensate for other flaws but on the plus side the camera work was good.<br><br>I'm giving it a 4 because it's a useful film for would be movie makers.<br><br>I'd be interested to know what the actual budget was and how long it took to film but it is clearly a very constrained budget film if you managed to stay watching until the end credits they were all covered in around one page with less than 10 people involved, in many movies these days you have 10 minutes of credits.<br><br>For 90% of the film it was two characters in a single setting and they have put together a watchable feature length film with their own original take on soundtrack that whilst it's definitely not for everyone, many people will watch it, some will enjoy it and cable channels will probably snap it up.","user":"andy2552","rank":[13,15]},{"title":"Be open minded, not spoon fed","rating":8,"date":"19 January 2013","review":"When you watch this movie you need to look at the right things. Yeah it may be slow in spots. Yeah the acting can be painfully average at times. But look at the cinematography, the eerie colors used to set a surreal scene where you don't know what's reality and what isn't. The score is unreal, it suits the movie so well. It's simple and to the point and it was obviously done intentionally. So anyone who says the score is too repetitive or you don't get to see the creature.. you are missing the whole point. You are looking at the film completely wrong. You need to appreciate it for what it is. A slow suspenseful film that doesn't spoon feed you every little thing. If it did it would be just like a million other creature thrillers. This one shows you just enough to frustrate you in a good way and make you think. Good independent filmmaking with a few bumps in the script. Watch it and appreciate it for as a well made, original take on a creature feature","user":"codycarlington1234","rank":[20,31]}]