[{"title":"One of the absolute best Scooby Doo movies","rating":9,"date":"13 October 2012","review":"I have always been a huge Scooby Doo fan. It is great fun with funny jokes and writing, endearing characters and a sense of mystery that is quite infectious. Big Top Scooby Doo! is one of the best Scooby Doo movies alongside Witch's Ghost, Zombie Island and Goblin King. In fact there isn't a Scooby Doo movie I intensely dislike, even my personal least favourite Monster of Mexico had its moments. Back to Big Top Scooby Doo!, I knew I was in for a treat when I got the DVD from Amazon and I was right.<br><br>The animation, a nice mix of the What's New Scooby Doo?, Mystery Incorporated and the classic Scooby Doo styles, is colourful and fluid. Yet when there are more haunting and mysterious parts there is a darker visual style that was most fitting. The music is both catchy and rousing and never feels too much. The writing has hilarious jokes, so much so I was in danger of missing a few from laughing so much, and witty dialogue, that sticks true mostly to the Scooby Doo that I know and love. Only Velma's tensing up joke came across as awkward but don't let it put you off too much. The story has its fair share of almost scary(but never enough to traumatise anybody) and entertaining moments. And it further benefits from a wonderful mystery that is quite suspenseful, with a setting that brings a fair bit of nostalgia for me and a very convincing werewolf, that exudes menace. The train chase sequence was one of the best of any Scooby Doo movie as well.<br><br>Not only that, the feel of the film is close in feel to Scooby Doo Where Are You, no dating awkwardness or stereotypes like bumbling sheriffs or wacky parents, just feel-good and funny, in a somewhat corny but endearing sort of way, Scooby Doo. The identity of the villain does get obvious, but the twist that the film includes is completely satisfying.<br><br>Big Top! Scooby Doo has some very entertaining moments that will delight any Scooby Doo fan. Daphne's motorcycle racing is amazing, possibly the coolest thing she has done in a long time, while Fred with the trapeze and Velma being shot through the air as a human cannonball are just as delightful. Daphne, Fred and Velma are the most likable they've been in a while, while Shaggy- who has never been as smart as he is here- and Scooby never fail to bring a smile to my face and their friendship is quite affecting. The voice acting is just great, Matthew Lillard had big shoes to fill and he does a good job, goofy and likable. Frank Welker has still got it as Fred and his Scooby voice continues to grow on me. Grey DeLisle and Mindy Cohn(who is much better than she is in Music of the Vampire) are also fine, as are the rest of the cast.<br><br>All in all, a great Scooby Doo film. It is not as good as the original show, or The Scooby Doo Show or The New Scooby Doo Movies, but of the animated direct to video movies it is one of the best and I'd say almost on par. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[6,7]},{"title":"One of the best Scooby Doo Direct to Video's Made","rating":9,"date":"8 September 2013","review":"I just saw both 2012's Big Top and 2010's Abracadabra-Doo in the past week and I have to say that Big Top was probably the best Scooby Doo episode made in the 21st century--2002's The Cyber Chase. Unlike Abracadabra-Doo where one could guess who the true villain was from miles away--since only he had the technical know how to pull off all the stunts with the griffin in that episode--with Big Top, a werewolf is terrorizing a circus and his identity is not obvious to the viewer until minutes before he is finally captured.<br><br>In Big Top, the gang discover that the circus is not a very friendly place and almost all the circus ringleader's employees have an axe to grind with their new circus ringleader--Marius Brancusi--who just inherited \"the greatest place on earth\" from his uncle. Therefore, the villain could be anyone and discovering his identity turns out to be a difficult job which is great for the plot. Doubleday, in the end, is revealed, to be the werewolf villain partly because he is disgruntled that he didn't get the chance to run the circus after Marius' uncle left the circus even though he had been helping running the circus for years unlike Marius. But something is not right: the jewels the Werewolf stole have not been recovered and Doubleday can't talk since he has been tranquilized. Then the gang realise that Doubleday had an accomplice all along and must give chase to catch this second person before he gets away. So, the plot is quite intriguing and is lots of fun and this episode at 80 minutes...is the longest Scooby-Doo direct-to-video movie ever made and certainly one of the best too since the Witch's Ghost and Zombie Island. Recommended.","user":"fabian5","rank":[2,2]},{"title":"Perhaps the Best Scooby Feature to Date","rating":25,"date":"25 October 2013","review":"Big Top Scooby-Doo! (2012) <br><br>*** 1/2 (out of 4) <br><br>There's no question that the Scooby-Doo features have been up and down throughout the two decades that they've been made. This one here has the gang arriving at the carnival to find out that it has been taken over by werewolves who are stalking it for an unknown reason. The gang agrees to go undercover and join the circus so that they can find out what's really going on. BIG TOP SCOOBY-DOO is without a doubt one of the best features to be made in the series and it might very well be the best. There's so much that works here that even someone who hates Scooby Doo could probably love this film. Fans of the original series when it was meant as a dark, creepy and atmospheric ride will certainly enjoy this film because it really goes back to its roots. The monsters are all extremely well-made but even better is that the film allows them to be dangerous and I'm sure scary to many of the younger viewers watching. The werewolves are all excellent looking and come across quite menacing at times. The atmosphere is about as thick as any animated feature in history with a certain bleak darkness running throughout the film. The entire visual look of the film is wonderful as the darkness just really soaks up everything going on and makes it all the more memorable. The animation is another major plus as this is probably the best looking feature I've seen from the series. All of the main characters are quite memorable and they're really brought to life by their vocal actors. Scooby is pitch-perfect here as is Shaggy as the two share many great scenes together. Even the new characters are quite memorable. Best of all is that the actual mystery really works well and keeps you guessing right until the end. BIG TOP SCOOBY-DOO has all the horror and comedy that the best episodes in the television series had.","user":"Michael_Elliott","rank":[2,3]}]