[{"title":"The Greatest WTF Movie Ever Made","rating":4,"date":"4 August 2013","review":"The Canyons (2013)<br><br>1/2 (out of 4) <br><br>Paul Schrader's latest deals with the rich Christian (James Deen) who's living in Los Angeles and seems to have it all until he learns that his girlfriend/sex partner (Lindsay Lohan) is having an affair with a man (Nolan Gerard Funk) who he hired in his latest movie. THE CANYONS is without question the greatest WTF movie in the history of cinema or at least to date. I say this because there was never a single second during this film where I understood what was going on or what director Schrader or screenwriter Bret Easton Ellis were trying to say or do. This film is without question a complete and utter mess and for the life of me I can't understand what the point of it was unless the only goal was to make it as cheap as they could and hope that the Lohan nude scenes would gain enough interest to make some money. Both Schrader and Ellis are so incredibly talented that it would be easy to make fun of this picture but I personally found it rather sad as neither man has found themselves involved with something this bad before and worse of all is the fact that the film makes no sense. It's meant to be some sort of twisted erotic thriller but there isn't a single thrill and the sex scenes aren't nearly as shocking as it appears the filmmakers think they are. Had this been made twenty-years ago then it might have been considered shocking but in today's day and age everything just comes across as pretty lame. Deen is fair in his first non-porn role but he certainly doesn't show enough here to warrant any future movies. The supporting players are all either bland or downright horrid and often times it seems like we're watching line rehearsals instead of an actual take. As for Lohan, well, sadly she once again is pretty bad. She just doesn't have any emotional depth here and even during her nude scenes she just looks incredibly uncomfortable and especially during a shower sequence. I'm sure this nudity is what's going to make most people check this thing out but it's really not worth it. The film also features a bad music score, some forgettable cinematography and worse of all is how deadly boring it is from start to finish. The dialogue is downright laughable and the overall feel is something cheaper and worse than what you'd expect to see on Cinemax at three in the morning. I guess the best thing I can say is that it's actually the best of the three movies Lohan has released in 2013.","user":"Michael_Elliott","rank":[48,65]},{"title":"Surprisingly Un-Sexy","rating":3,"date":"5 August 2013","review":"This film suffers heavily from a distinct lack of sexiness and way too much boring dialogue. And that is just the beginning of the problems. You really know a film is bad when Lindsay Lohan is the only bright light in it! <br><br>The Acting: Lindsay Lohan does quite a good job in a couple of scenes involving emotion, though she is much less effective in the (too abundant) dialogue heavy scenes. James Deen shows a few flashes of talent but mainly seems as if he is trying to emulate a method actor with no real understanding of how to actually pull it off. The other \"performances\" are uniformly bad to less-bad.<br><br>The Writing: One word... Awful. Boring dialogue and unbelievable story. Poor ending. I think Bret Easton Ellis is a one-trick pony. He has never managed to equal what he achieved with American Psycho.<br><br>The Directing: Same word as above... Awful. Paul Schraeder really should sink back into obscurity. This project is definitely not going to help his career. Poor choice of camera angles and poor framing abounds. He shows no sign of his earlier talents. I think he is lost in his own imagined \"genius\" as he tries for a gritty realism and gets ugly pretentiousness.<br><br>Camera, Lighting, etc.: Poor lighting in almost every indoor scene. It looks like it was shot on a smart phone. The music is irritating. Wardrobe... What wardrobe? It looks like the actors supplied the clothes they wanted to wear. There is no costume design or set design in evidence here.<br><br>Sexiness: Basically there is none. Lindsay Lohan looks pretty sad with her prominent beer belly, sagging breasts and 1960s style lingerie. Control-top granny panties are not lust-inducing! The sex scenes are boring and much less spicy than the hype suggested. The \"orgy\" was so badly filmed it and lit that it was impossible to find it sexy or even interesting. Women or those with a gay interest may find it more sexually appealing but I don't find dangling limp penises to be anything but silly looking. The entertainment media painted this as shockingly graphic but it is pretty tame compared to cable shows like True Blood if you discount the number of penises on view.<br><br>In Conclusion: Not really worth a look even if you just want to see Lindsay Lohan in the buff. There was more of her on view in Playboy and her body looked at least a bit better in the magazine. If you are looking for titillating sex scenes you would be better off with Skinemax. If you want to see a dramatic expose of Hollywood's dark underbelly look elsewhere. In fact just look elsewhere. Period.","user":"erostew","rank":[77,121]},{"title":"Great movie, typical Ellis - detached and cruel","rating":9,"date":"4 August 2013","review":"I think that a lot of the criticism of \"The Canyons\" is missing the point. All of Ellis' stories have a detached quality in them which makes them hard for audiences to relate to, especially on screen. They seem \"unreal\".<br><br>A constant theme in Ellis' work is the existential \"ennui\", the boredom and emptiness of life, the absence of deeper meaning. His main characters feel that something is missing, but they can't pinpoint what it is. As an audience, we know what they are missing - connection with themselves and others, and genuine emotion. This is why there is so much disconnect between the protagonists and the viewers.<br><br>It may be that the choice of Hollywood as a backdrop for this display of existential emptiness is an unlucky one because few people can relate to wealthy Hollywood life on a personal level.<br><br>However, I applaud the filmmakers for at least having the guts to try. The people in this movie are all choosing materialism over personal connection, and mechanical sex instead of intimacy, an orgasm is for them a reflex just like sneezing. Neither money, sex, nor social status provide happiness for those who get it in abundance; only those who don't have it in abundance think they will bring happiness. The values that popular culture upholds are devoid of value.<br><br>In addition, I think James Deen does a perfect job playing a narcissistic, controlling, emotionally empty vessel on the verge of snapping, and Lindsay Lohan (this is her first movie I've seen, and given the bad press, I'm positively surprised) does a great job playing a woman despairing from choosing hell in physical luxury, while starving emotionally.","user":"chenthom","rank":[85,135]}]