[{"title":"Just as expected - Thankfully","rating":10,"date":"10 June 2013","review":"Far too often, you see the cast of a movie, the previews, go in with an idea of what to expect, and come out feeling you were duped out of your money. Not so with 'The Internship.' I was reluctant to see it based on some of the poor reviews I'd seen, but my wife, who pays absolutely no attention to reviews whatsoever, is a big fan of both Wilson and Vaughn (sp?), so we took the chance. We both found it to be entertaining and funny, never lagging too long before the next joke. The Google campus proved an interesting site in itself.<br><br>Of course it's a bit far-fetched, but who cares. If you like Owen and Vince either separately or together, you will likely enjoy the movie. All of the supporting actors did a commendable job as well.","user":"jordan2240","rank":[140,205]},{"title":"A Comedy That Disguises As A Google Commercial","rating":6,"date":"13 May 2019","review":"\"The Internship\" stars Vince Vaughn and Owen Wilson,who both made their mark as comedians in \"The Wedding Crashers\". This comedic film tells the story of how two watch salesmen -Billy and Nick =who lost their jobs after their company have shutdown and the owner decides to retire in Florida. It was explained in the story that they lose their jobs due to the Digital Age as there is less need for watches as people nowadays look at time in their cell phones. When both tried to get back to the job market, they decided to apply at Google.Surprising,both got accepted and have to go to an internship to compete with other tech savvy interns to get the coveted jobs at the Google Headquarters located at Mountain View,California.Apparently,both former salesmen are together with those who are considered rejects such as . But nevertheless,will Billy and Nick's group obtain the coveted Google jobs?Your guess is as good as mine.<br><br>Obviously,the movie has already set up the storyline right at the beginning. The only thing that could be great at the movie is the journey their group has to go through. Too bad that it is by the numbers comedy that comes up short to greatness.We know that the underdog theme comes into the picture in the storyline.With regards to eliciting any laughter to the viewer,both Vince and Owen comes short.The same is true with the rest of the cast that includes cameos from John Goodman and Will Ferrell.What is worse is that a lot of the jokes are unfunny and corny.<br><br>The movie just provides the viewer a glimpse of the Google Headquarters as the film shot on location and exposition the products that Google has throughout the film.It was good to note that both Vince and Owen also gets to greet Google founder,Sergey Brin by calling him,\"Hello Boss!!!\". Apparently,this film is basically a Google commercial disguised in a comedy.","user":"JustinCasey83","rank":[6,6]},{"title":"Job hunting: The old fellows vs. the young","rating":8,"date":"9 November 2013","review":"A comedy about two 70s born middle aged guys who recently lost their job due to the new culture called e-shopping. It tells how the old fellows struggling to get the jobs in todays computer world. After forced to retire from their positions as salesmen, Bill and Nick applies for an internship at Google. Now these two have to compete with the energetic, smart, young generation seeking employment who are just coming from their college graduation. With the lack of computer knowledge Bill and Nick have to successfully complete the series of tasks to get the jobs.<br><br>Kinda cool comedy from the director who gave us many fine comedy features. It was a good combo between Vince Vaughn and Owen Wilson, they were excelling in their respective roles. The lack of required knowledge in order to get the full employment at google make us to have fond on them. They really convinced us with their acting as innocence and middle aged strugglers. We can call it where the job hunting movie 'The Pursuit of Happiness' meets fun teen 'American Pie'.<br><br>It was a good comedy as well serious about getting jobs for old guys. I know it was not real, It won't happen in real life but a heartwarming drama with some good laughs. After 'The Social Network' and 'jOBS' we expected a movie about google and now here it is. Although it was not based on real but a fictional dramedy which can be thoroughly enjoyable.<br><br>7.5/10","user":"Reno-Rangan","rank":[12,14]}]