[{"title":"Must-see ! Good for bassists and people who also want to learn about 70s music industry","rating":9,"date":"4 July 2015","review":"i watched this movie about Jaco Pastorius at the European premiere in Munich/Germany this week and did like it. As a hobby bassist i'm heavily influenced by Jaco and there's footage in the movie previously unseen. There's funny moments in the movie and many interviews from the musicians Jaco collaborated with as well as Jaco's brother and you'll hear also from Jaco's first wife Tracy and others who were close to him. The film accomplishes to draw attention to Jaco and make him aware to other people. It never accuses anybody of anything and stays neutral and objective. While as someone who plays bass i wished that more footage was included from his earlier days like how he changed from drums to bass and how he developed his technique, i'm grateful for the people who made this happen and showed lots of footage and people's views on Jaco Pastorius along with his great music and him being a pioneer changing the e-bass and influencing future generations of players.","user":"Monte_Strings","rank":[11,12]},{"title":"An intriguing and deeply personal film about the greatest bassist to ever live","rating":10,"date":"4 April 2016","review":"Described by nme.com as \"a four string demon\", Jaco Pastorius was arguably the greatest electric bass guitarist to walk the earth since John Entwistle, and continues to hold a revered reputation amongst bassists across the world, including me. The news of a documentary and the release of the film's theatrical trailer tickled my anticipation to high levels, and I can proudly say that Robert Trujillo's 2015 passion project is a great representation of Jaco's career and personal life.<br><br>Although normal moviegoers might not appreciate Jaco as a film, it should not be viewed as a mind-boggling piece of cinema, but rather a detailed lesson on one of the most influential musicians of all time. The essential purpose of a documentary is to educate the masses on a subject not commonly known. Jaco more than delivers as a refresher for fans and as a discovery for newcomers. It touches on most of the essential topics in Jaco's life: his youth, musical career, personal life, mental disorders, and most importantly, his legacy in the musical community. This intriguing and deeply personal story is represented through a wide variety of media, including photos, archive footage, interviews, and music. You might question the over-reliance on grainy Super 8 footage, but it nonetheless provides us to hours of unseen footage and concerts, showing that the filmmakers have really done their homework and respect the material they are handling. As far as their production values go, the style of the titles and montages is gorgeous and oozing with colour, while the high resolution, low depth-of-field shots showcase a level of professionalism for the most part.<br><br>Jaco features dozens of famous musicians that offer words on this kingpin of the electric bass, including Flea, Joni Mitchell, Herbie Hancock and many more. Although the filmmakers fail to capitalise on the big-name bassists, such as Sting, Bootsy Collins, Geddy Lee and Victor Wooten, the undeniable influence of Jaco reverentially acknowledged by these musicians is humbling to listen to, propelling your appreciation of him even further. Moreover, the people who were most important in Jaco's life and/or those who knew him best are given longer amounts of screen time, and rightly so; the raw authenticity with which they describe Jaco and his demise propel the emotion of the film.<br><br>No discussion of Jaco would be complete without mentioning its soundtrack, primarily (and appropriately) comprised of music composed and performed by Jaco himself. While the occasional leitmotifs from the soprano saxophone and the bass guitar harmonics feel a bit too monotonous, it is a very small complaint, because the symphonic-like arrangement of Jaco's countless compositions throughout the film is so intelligent and mathematical, and it is impossible not to feel chills when you hear the deus-like virtuosity of Jaco's playing. Coincidentally, the best Jaco compositions are the ones that are utilised the best in the film, such as Continuum, Portrait of Tracy, Donna Lee and Come On, Come Over, all of which happen to be from his eponymous debut album.<br><br>We might view films as a means of escape and entertainment, but the really good ones are ones that manage to both distract and educate us. Jaco perfectly achieves both of these objectives, and while it is not as jaw-dropping as Whiplash, it is the perfect medium to transform anyone into a fan of Jaco Pastorius, a unique, tormented and unforgettable individual who reinvented the electric bass the same way Jimi Hendrix did with the guitar.","user":"naysbaghai","rank":[7,9]},{"title":"570th Review - The Fusion And The Fire","rating":9,"date":"5 December 2015","review":"Jaco is a brilliant watch - anyone with a passing interest in music or artistic talent is always looking for clues to that elusive question What makes musical genius. Here, there are plenty of clues.<br><br>Jaco Pastorius single-handedly changed the bass as an instrument - his decision to remove the frets of his electric bass because of the Florida humidity, not only changed the sound, but also the timbre of the instrument - and this documentary uses previously unseen footage to document that change - and the man behind it.<br><br>Jaco has a great balance between interviews, footage, facts, and music - and for anyone who wonders where jazz went after Kind of Blue, without having to go through learning about Sun Ra, Ornette Coleman or Pharaoh Saunders, this kind of answers that question - it looks at fusion, and asks how rock and jazz came to live side by side.<br><br>More than that it focuses on the man - this slender reed that was a ball of energy heading to self-destruction - and gets close to some real understanding of his motivations, his demons, and his genius. No mean achievement.<br><br>This really does try to understand both the man and the music and it is a really fascinating, lively, and interesting watch. Definitely what a real music documentary should be.","user":"intelearts","rank":[7,9]}]