[{"title":"David Lynch with humour","rating":10,"date":"22 November 2016","review":"Yesterday I saw Réalité for the second time. And I found it even better than the first time. So I had to upgrade my rating from 9 to 10. Why? Well, because this film is... genius... funny... and a great trip altogether:<br><br>The main story is about a guy (Jason) who has an idea for a film, but all he needs to get a contract signed, is the perfect (death)scream. He strains every nerve to obtain this sound. Then there is also the story of the producer who offers to sign this film, but who is also working on another film. This film, directed by cult director 'Zog', is very intriguing, compelling, a little bit artsy, and eventually the stories get mixed up with each other, and other stories. These other stories involving a cooking studio, a guy who likes dressing up like a woman, and a few more.<br><br>Boy, did I had a good time watching this movie! The absurd dialogues, the details, the music, the plots mixing together. It had me glued in my chair like Jason.<br><br>The acting is very good. The filming as well.<br><br>I believe perhaps one would enjoy the movie more if you're bilingual (French-English)<br><br>But all in all, one of the most sophisticated movies I've seen in a long time. If you like David Lynch, you will like Réalité","user":"theowlofthegame","rank":[10,10]},{"title":"Absurdities in abundance, dividing us in lovers and haters of this film, exactly like earlier movies of this film maker","rating":8,"date":"20 February 2015","review":"I saw this film at the Film Fest Ghent 2014, where it was part of the official Competition. Previously, I saw Rubber of the same film maker at the Imagine film festival 2011 in Amsterdam. I wrote a positive review at the time, accepting the fact that I was a minority. Most others could not appreciate the absurd undertone and the almost absent narrative.<br><br>Recalling my good memories in favor or Rubber, it may be possible that I had expected more of this successor. Nevertheless, it delivers an absurd story you'd expect from this film maker. Compared with Rubber there are less LOL (laughing out loud) moments, however. Instead, we can enjoy a humorous undertone all along the running time, while contradictions and absurdities come along in abundance.<br><br>It is no use to condense the story in a few lines, not even several paragraphs won't do, still without any chance of getting the absurd message(s) across. Brace yourself, and let this movie come over you. It may change your view on film and film making. On the other hand, I sincerely hope that we do not have to take this backstage view on the film industry seriously.<br><br>All in all, in spite of (or thanks to) all the controversies this film maker causes, I look forward to more products along the same line. His products are well made, and supported by good actors. That his narratives lack a logical story line, is more like a signature rather than a defect.","user":"JvH48","rank":[40,49]},{"title":"There is genius in this film. If you are bored with much of the formulaic output of Hollywood, but still have a passion for film, this might be for you.","rating":9,"date":"18 March 2016","review":"There is genius in this film. If you are bored with much of the formulaic output of Hollywood, but still have a passion for film, this might just be for you. Granted, it's not for everyone. I can only speak for myself. I still have chills from my first viewing. Only after it was over did I understand I had just watched the second film from the man behind Rubber. Glad I didn't even know, as expectations would have been quite high. Having grown up with rented video tapes in the 80's, this speaks to me on an intuitive level, using a language of cues, but remixed with a great deal of finesse and an engaging visual style, which had me grabbing frames here and there for inspiration in my architectural work. While shot with a keen eye for color, depth and composition, the film's strength lies in its mastery of the time domain.<br><br>The storyline edits weave jaggedly into each other in a provocative manner and the art house ingredient, psychedelic in its simplicity, works its magic once it has taken hold of you. I see no room for improvement here, it is simply a great work. Where Rubber was a testament to the strength of the storytelling formula, this is the master wielding it just forcefully enough to grab people's attention. I suspect there's a lot more where this came from. As someone who lives with parts of stories, unfinished tracks slaved over in the recording studio, this ode to the behind- the-scenes heroics of unsung heroes was beyond captivating. Like an Ayahuasca trip, it is best described as liberating...like an itch, scratched at last. Bravo!","user":"jeremy-starseed","rank":[11,12]}]