[{"title":"Blue Ruin is a quiet film that make a loud impact.","rating":9,"date":"23 April 2014","review":"A very tense and taught thriller that puts you along side Dwight as events unfold. I am so accustomed to the actions of characters in your typical Hollywood revenge thrillers that in my mind I was intensely screaming at Dwight's actions when IT, hit the fan. Then the realization came, this is not a film where the lead character becomes a fuel raged unstoppable hero suddenly becoming an expert on how to kill. <br><br>The quietness is very intense in this film and you focus everything on the characters. That is how good the directing and the script are, the film is not afraid of the silence. You become aware of how fast your heart is beating in the silence. The directing by Jeremy Saulnier was handled expertly and was feast for the eyes. Beautiful cinematography and his utilization of natural lighting made it easy to get lost in the film. There are scenes that will make you squirm and there are humorous tension releasing moments, that is how tight the script is you are relived that you have those moments. Everyone in this cast is on point, I did not feel one off key from any of actors. The gamut of emotions that run through Dwight's ( Macon Blair) eyes alone is worth the price of admission. There are some great actor finds and also some actor re-found here. Eve Plum as an unredeemable character in the film. Yes, that Eve Plum. Applauds to the whole cast. The score from the Blair Bros is haunting and never over powers a scene. It might sound like I am gushing over this film, but if you can talk and think about a film long after the lights come up then gush I must. <br><br>If you find this film near you, do yourself a favor and see it and be kind to your friends and bring them along. You are guaranteed a long conversation over drinks afterward. This is not your typical revenge film, yes it bleeds, but it also bleeds emotions.","user":"scarinny","rank":[139,169]},{"title":"Revenge of a novice !!","rating":9,"date":"15 July 2014","review":"This movie 'Blue Ruin' has received so much acclaim despite it lacking a star cast or any major publicity that I had to find out why. However once you have seen this film, it's easy to understand how this movie has captured the attention of so many people. Revenge thrillers are about a strong lead character who embarks on an impeccable road of destruction which is heroic and clinical, this is what we have come to expect but here we have something different. This movie follows a down and outer who returns home once he hears the murderer of his parents has been released. His aim is to take revenge which is something he has no preparation for and this leads to a series of tragic events. The film is riveting and compelling, with a real feel of the main character as he goes deeper and deeper into a path of self-destruction. This film is so different, you need to be patient with it and empathise with the lead character who makes some difficult decisions and is forced to bear the consequences.","user":"Zulfmanauthor","rank":[46,55]},{"title":"Excellent Indie slow burner","rating":8,"date":"25 April 2014","review":"Apart from a few forgivable imperfections (remember, this is a debut film, after all), Blue Ruin is an excellent Indie drama/thriller.<br><br>I disagree with the previous reviewer who referred to this as a movie with multiple and constant plot twists - what you get in Blue Ruin aren't actually plot twists, instead they are merely plot developments presented in a story that is told in a fashion that is not strictly linear.<br><br>This is a well shot (some creative use of visual techniques and shot selections in this film), well written, engaging film that draws you in and keeps you watching right to the very end, despite the fact that it deliberately takes in time in various places.<br><br>I couldn't help but think of Take Shelter when I watched this film - both movies have a similar stylistic sensibility, where things are not overplayed, and the lead protagonist has an eccentricity and vulnerability about them that you just can't look away from.<br><br>A great film, well worthy of the 90 minutes it takes to get through, and a clear sign that this filmmaker has a very successful future ahead of him.","user":"brendan-821-654855","rank":[98,124]}]