[{"title":"I guess I'm alone in my interpretation of this movie","rating":9,"date":"25 March 2015","review":"OK, so big spoiler here. Note the disjointed time lines. Note the different people (at the end) saying the exact same lines other characters said earlier, creating a repetition of \"get a job\", \"pussy\", \"coward\"... etc. Note the \"end\" of the so-called sci-fi plot where Maya entwines her finger around Cole's ring finger, which jumps directly to him in a clean hospital bed with Maya entwining her finger around Cole's ring finger.<br><br>Does anyone else see that the so-called sci-fi part was actually Cole's death bed subconscious dreaming a disjointed time line? As in, can you say it, dream? That Michael did actually shoot Cole (think of this (the end) as the \"beginning\" of the movie, and the first lines of the movie were about \"The Light\"..as in go to the light? Cole's subconscious dreams of the aliens are imagined from the Tabloid suggestion of a near miss comet. There are no aliens, yes he and Maya were together in real life and his death bed subconscious dreams about the past come in ever increasing disjointed fashion and ever increasing fantastical imaginings. Cole's dying. Maya and the baby (and the rest of the world) are just fine.<br><br>What this movie is about is a prolonged stream of consciousness (or unconsciousness) of a dying man who is a guilt ridden loser. The reason the sci-fi plot is essentially absent is because it is....except in the dying man's disjointed imagination. Why did I give it such a high mark? Because it obviously fooled everyone. Note the dream-like sequences, landscape, surreal scenes and above all that the sci-fi stuff was a \"rip off\" (as one critic noted) of other sci-fi movies. Of course it was a rip off, it was what was in Cole's head. Cole actually subconsciously wanted the end of the world, like he wanted the end of his life, so the suggestion of the Tabloid comet was enough to set off his \"what if\" scenario. Based on this interpretation, with clues everywhere, the movie was very good indeed. Watch it with this interpretation in mind and you'll see it.","user":"cynthiawaguespack","rank":[28,34]},{"title":"Relationship 99%, Science Fiction 1%","rating":8,"date":"3 April 2015","review":"If you liked the movie Another Earth you might like this one. Like the summary states this is more about the couple's relationship and not the aliens or science fiction. We never found out if the aliens actually killed anyone or if it was just the breakdown of society. <br><br>The acting was good, but there quite a bit of back and forth from the past to the present time. As the movie approached the end it became unclear to me what was reality and what was just a blurred memory of the main character. I was disappointed that we never got to see the aliens, where the other people went, and if the crazy doctor really hurt the wife or not. <br><br>We watched the movie on Netflix it was only given a one star rating. Below is my rating. Acting: 4.5/5 Plot: 3/5 Cinematography: 4/5","user":"peterson-b-1","rank":[7,7]},{"title":"Mildly entertaining, concept film, with horrendous ending.","rating":5,"date":"20 March 2015","review":"I would've given this more stars, it was mildly entertaining up to a point, its clearly more of low budget conceptually film, about the human reaction to crises. <br><br>Up to the last few minutes that is, then it turns into some sort of dementia ridden affair. Did he get shot, was he hallucinating, was there any journey at all? Maybe the comet just hit the earth and this is the imagination of a drug ridden patients last thought. There was no pondering at that point, I've seen worst Hollywood endings (master and commander comes to mind) but this will strike me as a top 5 contender for that award. <br><br>Clearly I have no idea, of course, the thought being to make it provocative I guess, I found it annoying, unnecessary and made what was up to that point a fine indie effort, into a spiraling mess. <br><br>The best I will say, is its still worth seeing as its on netflix to stream at the moment. <br><br>The one star reviews are harsh, it was a more subtle film, but overall better then that review, as is the ten stars, this is no where near a top end film, due to the ending itself. <br><br>Writers who cannot make a resolution, have no business making a script.I feel its a too easily taken cop out these days on this level of filming.","user":"silverkelt","rank":[13,15]}]