[{"title":"The obligation of growing up","rating":9,"date":"9 June 2013","review":"Is it fair to call Frances Ha a product of the mumblecore movement in cinema or is it all too, well, professional? Noah Baumbach's examination of culture, early adulthood, and obsessive friendships not only makes for a good, topical debate but a very worthy motion picture, as Frances Ha is one of the strongest films this year. Heavy on dialog, characterization, and the strong, stable topics to examine, this is a thoughtful mediation on what it means to grow up, stay true to your friends, and be self-reliant.<br><br>The film stars the zealous Greta Gerwig (whose work in Hannah Takes the Stairs I still regard as terrific) as the title character, a plucky dancer at the age of twenty-seven, living with her best friend Sophie (Mickey Summer) and her best guy-friend Benji (Michael Zegen). Frances and her friend Sophie are like \"straight lesbians,\" so Benji says, as they do everything together, and both of them would seemingly be lost without each other. The thought is put to the test when Sophie decides to move out of the cramped studio apartment in favor of moving in with another friend, leaving Frances sort of lost and unfulfilled with her current position in life.<br><br>This is basic framework for a story that begins to follow the path of a series of vignettes, focusing on the ups and downs in life, along with those awkward stretches no one really likes to talk about. Baumbach brilliantly captures this through a black and white lens, and allows his actors the freedom to get immersed in their characters with little restrictions in place.<br><br>Frances Ha does a lot in eighty-six minutes, like notably humanizing the \"hipster\" culture of the last few years, detail loneliness and friendships, impending adulthood, and dependence all the more. The humanization of \"hipster\" culture comes into play because we notice that these characters are not of the \"typical\" breed, whatever we define as typical. They are about as free and unrestrained as the wind that catches their hair, especially Frances herself, who is arguably one of the most fun characters I've had the pleasure of watching this year. There's something about the way she engages in quick-witted conversation, runs happily through the streets of Chinatown at random, and is constantly proclaiming she is \"undateable.' Gerwig magically transforms a character bound for a caricature state of mind into a strong woman that may not be looked at as a role model for girls but certainly a realistic portrayal of many.<br><br>I imagine the loneliness that the loneliness and slight-depression Frances feels when Sophie leaves her is one many post-college girls will feel when their best girlfriend moves on to bigger and better things and she remains somewhat inert and stuck in her current life position. Baumbach details growing up in Frances Ha not as a choice but as an obligation, which it rightfully is in many regards, but the way he doesn't isn't condescending or superficial, but rather hopeful and endearing.<br><br>NOTE: My video review of Frances Ha, http://www.youtube.com/watch?v=yc6LbMzbGww <br><br>Starring: Greta Gerwig, Mickey Summer, and Michael Zegen. Directed by: Noah Baumbach.","user":"StevePulaski","rank":[109,138]},{"title":"Frances Hmmm...","rating":6,"date":"2 June 2013","review":"Can't really decide how I feel about this film. It was somewhat intriguing, beautifully shot (in black and white), and the lead character was perfectly cast. I love quirky characters in independent movies, but most of the time I couldn't decide if Frances was incredibly endearing or incredibly annoying. Immature, yes. Quirky, yes. Childlike, yes.<br><br>I didn't by any means hate this movie, but I did not love it as much as others. It is a film like no other, and worth a watch, but it left me feeling ambivalent. There was really no plot, which made sense because Frances didn't really seem to have any clearcut goals or ambitions (other than being a dancer, which wasn't ever going to happen). She lived moment by moment and the film took us on her journeys even though I am not sure they served much of a purpose.","user":"nikicianciola-702-657633","rank":[136,180]},{"title":"noah baumbach becomes a much more cheerful man, and greta gerwig glows","rating":9,"date":"23 February 2018","review":"So much fun, so funny, so moving and beautiful and real. \"Frances Ha\" has gotten a few less than favorable reviews from folks on this very site, but I must strongly object to said reviews. Personally, this is just my kind of movie I guess. It's mostly plotless, episodically following the main character, Frances, as she struggles to make money and keep friends in NYC. It's very much in that classic indie movie mold of \"oft-romantically-involved, witty, well educated twentysomethings living their daily lives with plenty of comedy and drama to go around,\" but there really is something about \"Frances Ha\" that makes it so much more special than the average film that fits this formula. Basically, one of the very best things your independent film can have is a performance by the lovely and talented Greta Gerwig, particularly as your film's leading lady, and especially when she's playing a character as compelling as this. She is super likable in every single scene she's in, but she still makes a boatload of face palming mistakes throughout the course of the film, while still being so lovable that you can't help but be on her side. She's just such a wonderful character, and is played with so much genuine honesty and accuracy by Gerwig (probably partially because Gerwig herself acts a lot like this in real life considering her overall mood during interviews and (more triumphantly recently) award speeches) that this movie becomes so much fun to \"hang out\" with, sort of like \"American Graffiti\" or \"The Breakfast Club\" or \"Fast Times at Ridgemont High\" or \"Dazed and Confused\" (as well as \"Slacker\" and The \"Before\" Trilogy) or even \"Boogie Nights\" to a certain extent; these are all movies I love, and I am so very grateful that a film like \"Frances Ha\" can now join such a list!","user":"framptonhollis","rank":[13,14]}]