[{"title":"Well acted but light on Entertainment","rating":7,"date":"10 April 2016","review":"Mississippi Grind is an independent drama film starring Ben Mendelsohn an Ryan Reynolds. Mendelsohn plays Gerry, a joylessly committed gambler whose addiction to the tables in backwoods Iowa casinos has cost him his marriage, the chance to see his daughter grow up and his integrity. Further along into the film, we see a developing relationship between both leads. Curtis (Reynolds) is an enigmatic fellow poker player who shares his love of Woodford bourbon. The film is more of a character study slower paced drama which has a very anti-mainstream feel about it. Which is case in point where the film has been critically acclaimed by top critics but criticized for being boring by casual fans. Overall, Mississippi Grind is well acted, an interesting story for those interested in the world of gambling and addiction. Yet the film did leave questions open, and the ending could have been more developed.","user":"Floated2","rank":[28,33]},{"title":"A convincing portrayal of a compulsive gambler","rating":26,"date":"26 January 2016","review":"This film tells the story of a compulsive gambler who is in fell debt. He hopes to make the money back on a road trip to various casinos, travelling with a young charismatic card player.<br><br>\"Mississippi Grind\" may be very realistic in the portrayal of a compulsive gambler. Ben Mendelsohn gives a very convincing and intense portrayal of the gambler. His expressions of exhilaration and desperation are very captivating, that I feel his emotions too. The scene where he loses the horse race towards the end is very memorable. <br><br>The plot is a rather sad story of how compulsive gamblers lose everything, from money to family and even their integrity. It is a captivating story.","user":"Gordon-11","rank":[21,24]},{"title":"Great road movie that develops great characters with a great bond","rating":8,"date":"16 January 2016","review":"Once again the IMDb user rating fails to reflect the true quality of a movie and I have to side with the critics. So be it because I was surprised how much I liked Mississippi grind. The acting from the two leads was exceptional, particularly Ben Mendelsohn. The writing is very natural and realistic as well. As usual, I would normally side with users, but every once in a while (such as with the guest) the critics know what they're doing and quite frankly the users couldn't be any more wrong, with a rating of 6.4/10 I would call this film criminally underrated, just so you know I don't say that often.<br><br>To steer haters away I will tell you this movie can be quite depressing at times, it's writing and acting is so raw that the emotion and situations really get to you. I don't know about you but any weird feelings this film gave me were on a positive note (quality wise anyways). I love different movies, on first glance I was thinking this was just another gambling movie, you know what I was wrong. This film does things not many other films have done, such as the feelings it gave to me.<br><br>I love and I mean LOVE different movies, and this film is quite different, full of lots of bits that are left un said and yet if the viewer is immersed properly they will feel it and it works and it really worked for me. Yes the characters in the movie have a gambling problem and it can be quite un comfortable to see what they do themselves and others but you know what not every movie is going to have happy go lucky optimistic heroes, so if you don't like movies with characters that aren't picture perfect steer clear.<br><br>I apologize for my rather vague review, I am coming right off of my initial viewing so keep that in mind but don't think of this as a review but more as a recommendation. I'm not saying this is the best movie ever but for those such as myself in search of something different I would highly recommend this film and I would put this up with some of the greatest gambling movies EVER. Initially I give this a 10/10 but as I said I'm fresh out of the viewing so I have to give this movie some time to absorb to give a more proper assessment, but no doubt Mississippi Grind is worth a viewing. Thanks for reading my recommendation and hopefully you'll enjoy this hidden gem.","user":"WalterSoprano","rank":[32,40]}]