[{"title":"Community collage AV club made this?","rating":1,"date":"18 December 2016","review":"I was looking forward to this film when I had rented it. <br><br>Then when the kids are not around so I can watch this horror film that looked like it had such potential.<br><br>I see what looks like the Audio-visual club from the local community collage put it together. <br><br>A delta operator that is an easy 60lbs over the maximum allowable weight?<br><br>Special forces guy that is drunk on 7 beers?<br><br>Bad camera work and the audio seems like it was done without external microphones.<br><br>The only thing that was worse was the fight scenes.<br><br>I can't give less then a 1... tragic.","user":"lookjamesarmstrong","rank":[24,25]},{"title":"Atrocious","rating":1,"date":"21 August 2016","review":"A slag of the popular wisdom states that in life, anybody can choose whatever they want to be. If some people chose to be actor, cameraman, director and script writers while they should CLEARLY have not, this is the place where they all meet.<br><br>I've seen movies that are so bad that they're good, but this one can't even reach that low standard. Everything and everybody is atrocious. Bad acting, bad camera, bad direction, you name it - they managed to fail on every single step.<br><br>Even the actors don't look like actors: it ranges from fridge repairman, to truck drivers, a retired science teacher on chemo,etc I've seen fan movies done with shoestring budgets, fly miles higher above this sleazy compendium of \"you're doing it wrong\" broken arm team. My nephew with his mates playing paintball in the yard are more convincing than that.<br><br>They should have shot than on a mobile phone, the picture look like it's out of a camescope from the 80s. If you're a student struggling with your studies or homework, please watch this. It will show you how vain sometimes entertainment could be. And give you an inspiration to work on your assignment, cause you don't want to end up like those people.","user":"zerocrew-56802","rank":[32,35]},{"title":"Ahh the Ol' Switcheroo","rating":1,"date":"21 March 2017","review":"I picked this movie to watch because when I saw the cover, I thought it said \"Call of Duty\". My immediate reaction was \"WHAT?? There's an official Call of Duty movie?? Hopefully Soap and Capt. Price are in it!!\" Then I started watching it and lo and behold, it became clear to me that I was the unfortunate victim of a marketing scam. I bet I'm not the only one. This is most certainly not a Call of Duty movie. Activision, Treyarch, Infinity Ward. None of them have anything to do with this mess. It doesn't even have 1/10th of the average budget of a Call of Duty video game. How was I duped? Look closely at the art. Do you see it? Yep. It says \"Call TO Duty\". It even has the same font and logo as the latest CoD game! I don't know how that happened but good for these guys for getting away with it. I'm sure by hanging on Call of Duty's coat tails, they've managed to sell a few copies. Let me tell you something, fellow movie watcher people out there. This film is terrible; not just terrible but absolutely horrendous. It looks like a community college undergraduate student film on a really really really tight budget (like under $500...Ok, maybe a grand). I bet they could have only made it after the director sold his Kia. The plot is beyond stupid. If you've ever played the zombie survival mini-games in Call of Duty, you probably know what this movie is about. It's that...as a live action film but horribly terribly done. The writing is appalling. The special effects ridiculous and extremely cheap. The actors are unskilled and awkward. If only it was narrated by 14 year old boys yelling obscenities at the actors, it would seem more like the CoD game. Alas, this film is garbage. Straight up garbage. Throw it away. Burn it. Delete it. Don't watch it. Never look back.","user":"MinistryofDoom","rank":[19,20]}]