[{"title":"Another triumph for Dark-O-Vision . . .","rating":5,"date":"10 January 2015","review":". . . or the reinvention of Radio? That is the key question posed by THE WOMAN IN BLACK 2: ANGEL OF DEATH. My eyesight is above average, and I could barely make out 10% of the screen for the two-thirds of this flick set at night. I know Hollywood's job is to cut every corner it can, as movie props and scenery tend to cost more than those of Broadway or Radio productions. However, my Multiplex screen was a 37 1/2-footer. So unless you have a 450-inch home entertainment or mobile device, do NOT rent or stream ANGEL OF DEATH (except if you enjoy eye strain). It seems as if most of this movie was shot with a black filter (save for the daylight or dusk scenes, which alternated gray and brown lens coverings). Novel as it is to experience 1890s film quality, those flicks lasted two minutes at most. This is pretty hard to stand for 99 minutes straight. (For those who are Harry Potter Completists, Mr. Radcliff is only present for this prequel in spirit, as one of the film's final lines reads, \"Harry's watching over us - - SHE can't come back,\" the SHE referencing the witch Hermoldevort.)","user":"oscaralbert","rank":[67,93]},{"title":"Yawn & spoiler","rating":5,"date":"12 January 2015","review":"I enjoyed the previous film with Daniel Radcliff. I expected this to be, perhaps not as good, but hopefully entertaining. I was disappointed, it is just nonsense. Where to start:<br><br>There is no real plot, certainly nothing that ties the characters together in any believable way.<br><br>The film relies on the horror genre stereotypical making the audience 'jump' moment. Over and over again. It gets so over done it becomes tedious.<br><br>The actors do their best but the lack of any real plot and a poor script and so many illogical aspects make it hard work with so many absurdities e.g. <br><br>One man, a former pilot demoted for cowardice, is apparently in charge of an entire local dummy airfield. It has fake aeroplanes and he can electrically ignite fire bombs to simulate 'hits' and make the enemy think they have hit something. He has a motorbike and a jeep for transport. He manages this 'dummy' airfield entirely on his own. No guards, no maintenance people, nobody, just him. <br><br>A school class of evacuees and 2 teachers are 'evacuated' to the ghostly derelict house. More classes are arriving in a week. There is 'no where else'. It's absurd to believe they would put kids (even in time of war) in a derelict house with holes in the roof and great holes in the floors etc. But somebody has installed beds for a dormitory. Installed desks/tables for classrooms but they can't sweep up and clean out the other rooms ? Let alone do any basic repairs.<br><br>A doctor drives a bus for them but won't put on the headlights in the marshes because of the 'blackout'. However, He is quite happy to walk around with a very big torch shining and he is quite happy to stand at the house door open at night with the lights on. <br><br>There is some raving blind man wandering about for no apparent reason. <br><br>I felt sorry for the actors, they did a good job with so little to work with.","user":"amazon-171-436558","rank":[28,36]},{"title":"Better than you've Heard","rating":7,"date":"3 January 2015","review":"I'm not quite sure why this is getting all the bad reviews that it is. I went along tonight, expecting a creepy ghost story...and got a creepy ghost story. Of course it repeats some elements of the first films, but most sequels do. And no, it doesn't come over as such a \"worthy\" film as the first one - but that's not such a bad thing. By having far more characters within the film, it is in many ways more entertaining. There are far less scenes of someone walking around the house with a candle in this effort.<br><br>There are moments where the script does let the side down and it sinks into cliché, which is a shame. But, on the whole, the direction is more than serviceable and the acting is generally good. Jeremy Irvine is rather wasted in a rather one-dimensional role, but he performs well enough.<br><br>I'm not quite sure what people are expecting from a sequel such as this. It does what it says on the tin, and there's nothing wrong with that - and it's a damned sight better than many horror sequels that are simply remakes of the first movie. Yes, it could have been better, but it zips along quite briskly and yet still manages to pack a punch when it needs to. Not bad at all.","user":"slbbooksmusicfilm","rank":[55,83]}]