[{"title":"Not the greatest but watchable","rating":6,"date":"20 October 2015","review":"Okay, I've seen some miserable horror movies in recent times. I've seen horrors that have made a great fresh start the descended into awful, others that after 5 minutes I've released a deep sigh and pressed the off button.<br><br>This is not one of those movies. For that I am thankful.<br><br>It's not one of the greatest movies but its not horrible like so many recent horrors.<br><br>I enjoyed it a little. at the end I did not groan out loud. Acting was okay, storyline okay. I enjoy English horrors more than their American counterpart as the emphasis is more on suspense and storyline than special effects and action.<br><br>Seems an odd way to put a positive review, but that's really how it is with horror.<br><br>Watchable, not terrible.","user":"reallyevilboy","rank":[65,85]},{"title":"Really enjoyable werewolf siege film","rating":6,"date":"22 October 2015","review":"This is a really well done film that focused on what it was instead of falling for the trap of trying to be more than it could. It didn't try and be some terrifying horror film and nor did it spend too much time on the werewolves. For the most part they're left out of sight or kept to a minimum so as to play well to the claustrophobic element of the film. When they are seen, they look very cool and are really well done.<br><br>The acting is good, the characters are likable enough and all contribute something towards the experience of being holed up in a tin can, trying not to be munched on by bloody werewolves.<br><br>I was well entertained and didn't find myself fiddling with my phone or anything. It wasn't too long and wasn't too short and left on a decent note.<br><br>The storyline alone is fun enough to hold your attention for the duration of the film. It does what it says on the can and doesn't leave you feeling like you wasted your time.<br><br>I watch a lot of horror ...and a lot of bad horror subsequently and this film doesn't fall into that substandard category. It's not a great film but it's a good film and especially within the werewolf sub-genre, and there are not too many in there.<br><br>That's what I think anyway, check it out and see what you think. I recommend it.","user":"alex_van_beek","rank":[66,88]},{"title":"There were three things about this film that made me like it.","rating":8,"date":"22 October 2015","review":"ou can't call \"Howl\" (2015) a great movie — not all of its acting, screen writing and directing supports that statement. But this indie British horror flick's better qualities make it a pretty good one — enough to warrant an 8 out of 10.<br><br>There were three things about this film that made me like it.<br><br>1) It's a straightforward werewolf tale. Monsters attack average commuters on a red-eye train after it breaks down under a full moon in an English forest. There is no Byzantine backstory, no sexing it up and no humanizing of the werewolves. (They're gross.) I found that refreshing in an age of franchises like \"Underworld\" and \"Twilight.\"<br><br>2)Our protagonists are average people who are relatable. Who among us hasn't been stuck on a stalled train at least once, even briefly? These unarmed, everyday commuters would probably be easy prey for a human predator, not to mention a super-strong supernatural threat. That made it scary.<br><br>3) I thought that the special effects (a mixture of practical effects and CGI) were actually quite good. I was pleasantly surprised when this low-budget, direct-to-video film bared its fangs as a decent creature feature.<br><br>And did anyone else recognize the train conductor? That's none other than Sean Pertwee, who starred in the werewolf classic, \"Dog Soldiers\" (2002). It's fun imagining \"Howl\" as a companion film.","user":"ericrnolan","rank":[52,75]}]