[{"title":"David Lowery's Memorable & Courageous Period Piece","rating":8,"date":"30 August 2013","review":"David Lowery has constructed a beautiful, atmospheric, little indie film with this 1970's Texas crime melodrama. At every point where Lowery could have added Hollywood flourishes and gimmicks to make the film more commercial he refuses to do so. The result is a thin crime &amp; punishment type plot that functions as a canvas for this tone poem about passion and tragedy. I don't know if I could say there's anything ultimately redemptive about these sad, doomed characters but perhaps it's enough to say that they possess a degree of humanity that makes us pity them for the choices they've made. This is another triumph for Rooney Mara who is excellent as a strong, young woman who desires a better life and a man who can't get it for her. There's great irony in the way events turn out for her and it's all totally believable. I was also impressed with Casey Affleck's performance as her lover and small time criminal. In supporting roles there's Nate Parker as a friend of Affleck; Ben Foster's sympathetic police officer and Keith Carradine soaring as a town elder and father figure to Rooney and Affleck. \"Ain't Them Bodies Saints\" is a great looking picture and Bradford Young deserves all the praise he has earned for his cinematography.","user":"georgep53","rank":[43,53]},{"title":"Not Bad Outlaw Couple Film","rating":7,"date":"22 January 2013","review":"Caught this at Sundance where the buzz surrounding it was pretty high. Did it live up to the hype? Yes and No.<br><br>As almost every reviewer has noted, it is a return to the Terrance Malick/Robert Altman-style outlaw lovers films of the 70s. Lots of long lingering visuals of country places and lots of deeply-felt brooding by the main characters. Not bad for that kind of film, but frankly nothing to write home about.<br><br>The three leads are very good, as is Keith Carradine. The music and photography are great (though I think there is an over abundance of mid and close shots in a film that screams out for long deep focus photography). Yet, somehow, it doesn't quite jell. A lot of this could be due to its slow pace. Another element may be the reluctance of the writer/director to dole out plot points (you know, like when someone reads an important letter, but we don't find out what is inside until 15 minutes later).<br><br>All in all, it is fairly good for what it is. I am sure it will garner positive response from critics. Still, somehow the whole is less than the sum of its parts.","user":"judex1066","rank":[74,95]},{"title":"Classic love story remains true to the genre but has unconventional feel","rating":8,"date":"12 June 2013","review":"If I had seen this film outside of a film festival setting I probably would not have appreciated it as much. Fortunately, director David Lowery provided amazing insight into his thought process and artistic intent as he crafted this film.<br><br>His attempt to create a \"classic\" film, distinguishable for its details but otherwise typical of the star-crossed lovers genre, resulted in something so much more. The characters are much more complex and do not fit neatly into their traditional archetypes. The audience will feel conflicted throughout, growing partial to different characters and rooting for different outcomes at various junctures in the film. Character introspection and lengthy shots of the landscape definitely took priority over plot development. If the depth of the story matched the depth of the characters this would be a truly great film.<br><br>The performances are second-to-none and the film was expertly cast. The hand clapping percussion and fiddle gives the score a uniquely southern, soulful feel; anyone from Texas can attest, the combination of score and cinematography will let the audience know what small-town Texas feels like.<br><br>Lowery prefaced the film as a cinematic \"folk song\" and it totally had the feel of a Townes Van Zandt ballad. If the film-goer keeps the folk song description in mind they'll truly appreciate the film's nuances and enjoy the experience.","user":"charles-luongo","rank":[54,68]}]