[{"title":"A somewhat lacking Madame Bovary","rating":6,"date":"17 June 2015","review":"First, the short summary at the top of the IMDb page COMPLETELY MISREPRESENTS the plot of the movie and novel. Madame Bovary is not simply cheating on her husband to advance her social status.<br><br>Her affairs are part of a much more profound struggle for transcendence from the ordinary life in which she feels trapped. That's why the novel is a classic of modern literature. The way IMDb puts it makes it sound like a cheap Lifetime movie.<br><br>Second, Mia Wasikowska is a fine actress but I've always imagined Madame Bovary as a much more sensual woman.<br><br>Third, I think Ezra Miller was terribly miscast as Leon Dupuis. Not to disparage his acting, but he's far too young and effeminate to be an object of desire for Emma Bovary.<br><br>While the film was beautifully shot, it otherwise doesn't quite do justice to Flaubert. Perhaps my expectations were too high.","user":"quayrice","rank":[75,86]},{"title":"Oh Lord, This is Excruciatingly Bad . . .","rating":2,"date":"27 September 2015","review":"Casting is totally off. Charles Bovary is supposed to be a large, good-natured, undemanding drudge of a man, hard-working and country bumpkin-ish without any slim, well-tailored glamour. Instead we get this svelte, firm, and resolute executive type with patent-leather hair. (Don't know if he ever did it, but the young Gerard Depardieu is the perfect physical type.) This is important because her spouse's rustic dullness as she perceives it has to be seen in the actor chosen. The Emma character has no obvious allure in this adaptation. Why are these men so attracted to her beyond an impression that she'd be \"easy\"? <br><br>The whole plot involving Leon's legitimate reasons for visiting the house is mangled, as is the genesis of the attempt by Charles to correct Hippolyte's medical issue and the surgery's outcome. Boneheaded decisions abound, such as the decision to change the sumptuous, romantic ball that quickened Emma's economic and sensual envy into a grubby, sweaty stag hunt. Worst of all its many bad decisions, this film totally eliminates the Bovarys' baby daughter Berthe, whose existence is essential to our understanding of how huge the final tragedy really is and its domino effects far beyond Emma and Charles.<br><br>I rarely write reviews but, when such violence is done to one of the great works of world literature, I do get annoyed. Apart from a bit of recognition for production values including cinematography, sets, location detail, costumes, I have to give this sloppy, bloodless and point-missing attempt the welcome it deserves.","user":"mkd002","rank":[43,49]},{"title":"Dull and diluted retelling of a classic story","rating":5,"date":"11 July 2015","review":"The crunch of the story is forgotten in this diluted adaptation. Anyone not familiar with the story prior to watching this film would be left with the impression that Madame Bovary was a fragile victim who simply fell into circumstances over her head. But this is not who the classic Madame Bovary character was or why she inspired writers and directors to retell her story throughout the years. The classic Madame Bovary is an ambitious, strong-willed woman who connived to continuously improve her status in society, even before she married. She had passion and vision. The character in this film has no redeeming qualities and stumbles through the story as an ungrateful opportunist who becomes less likable as the story progresses. The ethereal atmosphere, cinematography and set design were all remarkable, but combined with the weak storytelling makes this an average film with a forgettable Madame Bovary character.","user":"natamity","rank":[60,70]}]