[{"title":"I enjoyed this movie","rating":7,"date":"23 February 2020","review":"After the mediocre first and insultingly stupid second part this one finally delivers what the series always set out to do: elderly action stars in ironic, fun action scenes. The humor works much better here and doesn't feel as forced as before and the new additions are great. Especially Gibson obviously had fun with his villain role. Sure, this still isn't one of the smartest films ever made and it certainly wouldnt have needed the young additions. But at least the film is fun and thoroughly entertaining, unlike the stupid second part.","user":"MR_Heraclius","rank":[37,38]},{"title":"Seems the audience is Expendable","rating":3,"date":"7 August 2014","review":"When the first Expendables was announced, it was supposed to be a throwback to the early years of action cinema - gratuitous violence, one liners and major carnage. The first two films lived up to this. The third is just awful.<br><br>Instead of spending more time with the aging heroes we've come to love, we get stuck with a bunch of whiny youngsters who don't do anything and aren't very interesting. I seriously doubt the so called \"broader\" audience this film is aimed at are gonna care about it. And the people who were interested in the series are going to be bitterly disappointed. Nice one, Sly!!!<br><br>Some of the new additions to the cast aren't that bad: Banderas, Snipes, Ford, Grammar, but Gibson completely owns the film - which dies whenever he is not around.<br><br>How's the action? Instead of being focused and over-the-top like the other two films, we get bland MTV style kills, thanks mainly to the new PG-13 rating. Who thought giving the film this lame rating was a good idea? Hey, lets take a series that is aimed at adults, starring aging action heroes who only the older audience will remember, and turn it into a dumb teen movie where the target audience WILL NOT CARE who they are or what they have done. Surely one of the worst business decisions in recent memory.<br><br>Newcomer director Patrick Hughes has not done anything with this film, but its really hard to tell if that was intentional or if the PG-13 hack job done to the film has made it bland.<br><br>Overall, this film is just a waste. Too soft for its hardcore fans, and not \"hip\" enough for its intended young audience. No one will be happy. Sure, it might puts bums on seats for the first week, but it will quickly disappear after that...and with good cause.<br><br>\"What mean Expendable?\" \"It's like when you're invited to a party and don't show up and nobody really cares\".<br><br>I suspect theater owners are gonna know the meaning of this come August 15.","user":"anghart","rank":[236,350]},{"title":"Great popcorn flick","rating":8,"date":"5 August 2014","review":"I read a lot of bad reviews about this film, attacks on the script, plot and direction, so I was pleasantly surprised to find they were all wrong and they totally missed the point. I think these people were expecting Oscar winning performances but this film is about watching bad guys getting their a*s kicked. I also read that the actors seems withdrawn and bored of their roles and that is utter rubbish, and even if that were true it doesn't matter, im not interested in deep characters and meaningful performances in films like this, I just want to see lots of destruction and the bad guys getting owned.<br><br>There's some funny dialogue here and there and Banderas' character had me smiling a lot.<br><br>If you like action films you will enjoy this action romp, so ignore those bad reviews and grab yourself a bucket of popcorn and enjoy.","user":"hawkfrend-875-968087","rank":[157,240]}]