[{"title":"Just not what you expect these days and funny in its own way","rating":8,"date":"26 September 2014","review":"Reading the comments and ratings, this movie does not seem to be watched by the right people. I think the problem seems to be in the expectations and the movie being something different than what we are used to these days when you read the plot of the movie. <br><br>If you expect a normal sci-fi, where the sci-fi part is important for the story, it's not, it's just the setting. The cheap 70's sci-fi look is humor for me. <br><br>If you expect a comedy, with clear, loud jokes, or people being funny, it's not. I found the humor more in the irony and in the annoyingness and painfulness of the characters.<br><br>If you expect a spectacular blockbuster, it's not, it's almost more an art-house movie.<br><br>If you expect a serious drama, it's not, although it is about loneliness and emptiness in people. <br><br>So yes, I actually did enjoy it, because it was different and well made.","user":"daviddas9999","rank":[115,135]},{"title":"Contrastive to every other review here...","rating":8,"date":"23 September 2014","review":"I went into this not wanting to watch it - and was left a little perplexed by the dislike for this film; as was my other half. I think part of it could be cultural and us Brits having a different sense of humour to Americans/Canadians (which is where this film has thus far been released).<br><br>Frankly, I found this a lot more entertaining than comedies like 'Bad Neighbors', 'This is the End', 'Pineapple Express', 'Hangover'... or basically anything with Seth Rogen, Jonah Hill or Michael Cera - these sort of films generally seem to unimpress me and make the rare list of things I end up turning off. I'm not saying they are terrible films... I'm just saying that *I* think they are terrible utter rubbish 'movies' (or rather, polished turds) that should have never been made. Again; probably my different sense of humour, contrastive to a lot of reviewers here who have echoed similar thoughts about Space Station 76.<br><br>Now, Space Station 76 isn't paced to have you laughing at every second - and it is deliberately slow as a film; rather, it's a window into daily life in space coupled with awkward discourse and events amongst the small community on the ship. It's evident this is going to end up as more of a cult movie: it deserves to be.<br><br>The sets are wonderfully put together and create a consistent sense of galactic immersion, the acting is brilliant, the cast is filled with a lot of familiar faces from great films and the comedy delivers well. Yes, it might not all be inoffensive - but it's pretty brilliant.<br><br>This is a great movie the way it is. Things do get a little dry at either end of the film but it's forgivable.","user":"anon7310","rank":[96,122]},{"title":"70's Nostalgia","rating":5,"date":"29 October 2014","review":"Unless the viewer is *very* familiar with the 1970s ... the fashions, culture, music, attitudes, behaviors, etc ... much of the impact of this movie will be lost. There are a multitude of references to that era that are presented with such subtlety that they are very easily missed. From the top-loading VCR to the mood ring to Tab soda can to the \"I'm OK, you're OK\"-speak of the robot shrink to the rainbow color distortion in the telecoms projection, the film is loaded with them. Clearly the production designer, costume designer, and set decorator did their research on the period. That aspect of the film was wonderful. The story line? Not so much.","user":"Historian-3","rank":[12,13]}]