[{"title":"There's no dancing around it: this flawed but hugely enjoyable film comes with bucketloads of charm and humour.","rating":7,"date":"10 April 2014","review":"Nick Frost usually comes as one-half of a package deal. With Simon Pegg (and their behind-the-scenes collaborator Edgar Wright), Frost has starred in three of the most gloriously subversive, smart and silly British comedies of the past ten years: Shaun Of The Dead, Hot Fuzz and The World's End. Can he hold the screen and get the laughs when he's headlining a film, with neither Pegg nor Wright in sight? The answer is, thankfully, yes. Cuban Fury is a great vehicle for Frost - he grounds the fun, loopy, cheerful dance comedy in something a little more real and affecting, even if the film doesn't quite hit the brilliant heights of the aforementioned Cornetto Trilogy.<br><br>After being bullied mercilessly by a pack of boys as a child, Bruce (Frost) swears off the one thing he's really good at: salsa dancing. Fast forward a few decades, and he's a bored, boring office drone forced to suffer the company of Drew (Chris O'Dowd), his lewdest, rudest, meanest colleague. When he meets his new, gorgeous boss Julia (Rashida Jones), however, Bruce feels compelled to step out of his comfort zone - especially when he realises that she loves salsa dancing too. Even as Drew tries to worm his way into Julia's affections, Bruce resolves to put on his dancing shoes again.<br><br>The plot of the film is something of a hit-and-miss affair - it can occasionally feel like it's been forcibly stitched together from a bunch of really great stand-alone scenes and ideas. Some of the narrative decisions don't make a whole lot of sense either. Why, for instance, is Julia anointed the boss rather than a new colleague? It seems to complicate matters unnecessarily throughout the entire film, given the ethical issues at stake in an employer-employee relationship.<br><br>But there's no real need to over-think things when Cuban Fury is just so goshdarn chirpy, funny and entertaining. The film practically radiates its own brand of amiable humour, often zipping from goofy wordplay to awkward slapstick within the space of a single scene. Amidst the roof-top dance-offs and mix-tape mix-ups, there's even a little room for huge helpings of heart. Bruce becomes a better person for doing what he loves, and it's a joy to see him find the confidence he'd lost all those years ago.<br><br>Whenever the script misses a beat, its oddball characters come to the rescue. Frost's Bruce is a standard-issue unlikely hero, and Jones is almost criminally wasted as the painfully underwritten Julia. But the weirdos dancing around them are a delight. Hilariously committed to the part of Drew, O'Dowd is clearly having fun being as rude, nasty and offensive as he possibly can. Ian McShane is marvellous as Bruce's dour old dance teacher, Ron, and Kayvan Novak steals scenes aplenty as Bruce's gleefully flamboyant new friend Bejan. Even so, it's Olivia Colman who walks away with top honours: she's spectacularly funny and appealing as Bruce's open-hearted, game-for-anything sister Sam.<br><br>Cuban Fury isn't a game-changer by any stretch of the imagination. Unlike the Cornetto Trilogy, it doesn't have something smarter and more subversive to say about its chosen genre of film. This is a sports-laced romantic comedy with no greater ambition than making its audience laugh. Not every element of it works perfectly, and the script can be lead-footed in parts. But, when it comes down to it, the film is so sweet and silly that it sometimes approaches the sublime.","user":"shawneofthedead","rank":[29,40]},{"title":"Predictable, yet strangely endearing","rating":6,"date":"10 June 2014","review":"Like most people, I'm used to seeing Nick Frost as part of a 'double act' with friend and fellow actor Simon Pegg (or technically 'triple act' with their director Edgar Wright). However, in 'Cuban Fury' we see what he's capable of when headlining the bill.<br><br>In case you haven't seen any of the posters for this film, it's about dancing. Frost plays his typically mellow, overweight self who used to dance as a child, until he was bullied into giving it up by other boys. Now, as a man, he has to regain his dancing feet in order to win over the (naturally beautiful and coincidentally American) woman he loves.<br><br>I could tell you how it goes, but, if you can't guess, then you haven't watched enough films. Its major flaw is that it's painfully predictable. You can sort of see every situation coming and feel like you could have even written it yourself if you put your mind to it. However, despite this being a 'tried and tested' formula, it's still enjoyable to watch.<br><br>Nick Frost may not be fighting zombies or aliens, but he's still naturally charming and managed to be watchable as he bumbles his way through the film. After watching it I didn't feel like I'd wasted an hour and a half of my life (although I'm not likely to bother watching it again on account of me already having seen a hundred films just like it). It's basically nothing new, but if you're in the mood for something light, frothy and easy-going, there are worst ways of spending your time.<br><br>Also, special mention to Olivia Coleman who, in my opinion, stole every scene she was in. Pity she wasn't in it more.<br><br>http://thewrongtreemoviereviews.blogspot.co.uk/","user":"bowmanblue","rank":[24,33]},{"title":"Cuban Fury: a good balm.","rating":7,"date":"10 June 2014","review":"Watching films like the present one is, under some respects, a rite: we know in advance what is awaiting us, we can easily imagine what will happen, how things will turn, how they will end. So when we start watching we wonder mainly one thing: will the story develop as we expect, will our expectations be happily confirmed or on the contrary will something unpleasant let us down? Which is exactly what doesn't have to happen.<br><br>Knowingly or not we are seeking for something that will sooth our anxiety, like a balm. This is the prerequisite. Then we check if the film is OK, if it makes us laugh, if the story is original, if it surprises us, if the funny characters are actually funny... and so on.<br><br>Well according to me everything is OK in this nice movie, the story is good, the characters are catching and everything is as it had to be: funny and entertaining. A good British answer to American comedies.","user":"niutta-enrico","rank":[26,37]}]