[{"title":"Bland","rating":4,"date":"9 February 2014","review":"This movie follows the quest of an average guy looking for love. Of course he has a player friend, is in some friendzone dynamic, has a problem having sex with hot women since he wants commitment more than anything. Yeah, he might as well be a girl, except he has that average guy face and romantic attitude for the female audience. It's like a network sitcom, an even dumber version of How I Met Your Mother. The movie is fine in terms of acting and production, and is acceptable for mindless light entertainment, but there was no reason for it to be made. There is no reason for this review either, but the absurd 10/10 reviews needed to be questioned","user":"timlin-4","rank":[25,32]},{"title":"watch Bollywood movie instead","rating":4,"date":"15 February 2014","review":"If I had to watch a super corny 'love conquers all' 'run after the taxi' movie there are some really rich ones in Bollywood collections.They also will have some enjoyable dances, song and music during which you could go out for a break.<br><br>This movie has been made for a very select demographic.I don't know if its high school girls or 'looking for love' adolescents or somebody else. But chances are if you are not a part of that demographic you would end up with a serious head ache.<br><br>Acting is average throughout.Many of us will go to this movie for Camilla Belle.She is not disappointing.I am not a technical expert in movies but I didn't feel any glitch in direction anywhere.Just that this movie was definitely not for me.","user":"jhabrijeshbk","rank":[13,20]},{"title":"Oh EM GEE Clichè explosion","rating":2,"date":"10 February 2014","review":"The only reason we gave this film a 2 is because we laughed once during the film. This review sucks, but it is still 10x better than the film. This film was a combination of every other stereotypical romantic comedy, filled with clichés and empty/unoriginal characters. There was not one thing in the film that was unpredictable. Please, give me my 85 minutes of time back. I could have been watching 3 episodes of the Walking Dead instead. Yes... the Walking Dead. I don't have anything else to say about this film, however, I am required to provide 10 lines of text for this review. So, I will just say that the only somewhat pleasant thing in this movie, was Chad. Go Chad.","user":"user-920-834704","rank":[12,20]}]