[{"title":"Disturbing film","rating":9,"date":"1 September 2013","review":"This movie will probably stay with me for a while. Heather Grahm was beautiful in the movie and really made me feel for her characters. I was dreading that the movie was going to turn into a predictable girl gone crazy movie because I really like the characters of Amy. Luckily this film had more depth. One of the most disturbing things about the film is the cards that Amy is dealt in her life. I may be a bit biased because I'm a huge foodie like the characters so I really enjoyed that aspect of it as well.. The one thing I will say is this movie may not be for everyone. Hardcore horror fans may not appreciate the slow paced drama but at the same time drama lovers may not appreciate the macabre aspect of the film. I won't say much more but if you like simple yet disturbing movies is recommend this one","user":"mikeydoeshorror","rank":[24,27]},{"title":"Surprisingly underrated","rating":7,"date":"13 March 2014","review":"The story of two disturbed women whose lives end up intertwining. Or to be precise, one obsessive and possibly delusional woman and another who simply has had a hard life. When the psychotic of the two, Amy, develops a fascination with her reclusive neighbour, Saffron, she shows it through trying to push her love of food on to her. What follows is a rather bizarre but intriguing series of events.<br><br>A great aspect of this film is that I believe it's open to interpretation. Amy clearly doesn't have the tightest grip on reality, in fact we are often shown glimpses into her head where an imaginary audience is cheering her on. Combine this with the plot and characters going in the strangest of directions and the sceptical comments of a particular other character and the film raises the question of how much of it is in Amy's head and how much of it is simply events going in such a unique way.<br><br>Admittedly, this film is probably a bit of an acquired taste(ha, get it). It's labelled a thriller, which is partly true but the vast majority of it is a character study. If you like analysing the mindsets of flawed characters, this film is for you. Worth re-watching if you want to look at things from a different angle.","user":"ghiz876","rank":[7,7]},{"title":"Worth a rental","rating":6,"date":"22 June 2013","review":"We watched it last night, and honestly, it wasn't that bad. I've seen a lot worse. The premise was a bit weak, the acting was average, and the story was transparent. It was almost like a characterture of what the real movie would have been. It hard to explain, but everything was over done, colours, costumes, scenery, acting, basically everything. That is what gave it a \"pass\" to be a mediocre movie. You can get away with it, because it's supposed to be campy. <br><br>I would recommend a rental if you want zombie out in front of the TV for 88 minutes. It's mildly entertaining and the two female leads are pretty enough to keep you interested.<br><br>The production was fine. The quality edit, colour correction, lighting correction and so on was done well.<br><br>A lot of people worked hard to make this film, so I applaud them for it. Nice work, decent product and no time wasted in production.<br><br>It's not a compelling movie, but it's a movie. A simple, nice, different kind of film. Recommended when you want to do nothing.","user":"CitizenMarvin","rank":[39,51]}]