[{"title":"A One-Hour Justin Timberlake Music Video & 30 minutes of Ben Affleck Blinking Repeatedly","rating":5,"date":"4 October 2013","review":"Mindless entertainment, check.<br><br>Justin Timberlake being Justin Timberlake, check.<br><br>Ben Affleck being his same character from Boiler Room but with more blinking while delivering frat-boy douche lines, double check.<br><br>Hot girl standing around being hot, Check.<br><br>FBI agent way to young and random to be a believable yet cliché FBI agent, check. <br><br>Justin Timberlake not nearly getting his ass kicked enough in this film, inexcusable but CHECK.<br><br>5/10 yall","user":"GodofGSXR1977","rank":[180,225]},{"title":"Dry Predictable Gambling Caper","rating":4,"date":"26 September 2013","review":"Richie Furst (Justin Timberlake), a Princeton management graduate student who promotes an online gambling site on campus, earning commissions to pay off his tuition. When the school clamps down on his activities and he loses all his savings on a last ditch all-or-none bet, Furst goes straight to the top, flying to Costa Rica to seek out Ivan Block (Ben Affleck), the kingpin of online gaming.<br><br>Block admires Furst's gambling acumen and hires him to be a trusted runner for his business affairs, which slowly reveal themselves to be less than on the level. When FBI agent Agent Zbysko (Anthony Mackie) enters the scene with his threats, Furst discovers he might have bitten off more than he could chew.<br><br>Justin Timberlake generally does well as Furst, wide-eyed and excited at first, troubled and harassed at the end. I liked his scenes with his father played by John Heard. I do not really expect much from Ben Affleck as an actor, and again here, he does not measure up. He is hardly believable as a nefarious gambling lord who could feed his enemies to crocodiles. <br><br>The beautiful Gemma Arterton is totally wasted here. She does not get to do much, and she does not have any chemistry with any of the men she is supposed to be in liaisons with. Anthony Mackie plays the FBI agent too over-the-top to be convincing.<br><br>The story was too familiar to be exciting. The relationship of Justin and Ben (and Gemma, for that matter) were too dry to be engaging. The gambling jargon was too hard to follow to be interesting. The ending is too obvious to be worth the time spent watching.","user":"3xHCCH","rank":[60,75]},{"title":"So bland they had to name it twice!","rating":3,"date":"2 October 2013","review":"I was sorely tempted to write a single word review of Runner Runner: Pointless! <br><br>But I'll resist and expand slightly.<br><br>The trailer strongly suggests an intelligent, exciting thriller of crime and intrigue with A-list stars, action, drama, plenty of danger and a soupçon of violence. The realty of Runner Runner is somewhat blander.<br><br>Richie Furst (Justin Timberlake) is a Princeton student with moderate financial worries, who supports himself through online gambling. When he risks everything (except the price of his airline ticket to Costa Rica, clearly) on a game and loses, he discovers he has been swindled and heads south to confront the man behind the poker company and scam, Ivan Block (Ben Affleck). Block is so impressed with Furst's balls that he offers him a job with eight-figure returns. With the chance to join the super rich, all the pleasures it encompasses and, predictably, a beautiful woman, Rebecca (Gemma Arterton), who equally predictably is Block's girlfriend, Furst's life couldn't be any better. Then FBI agent Shavers (Anthony Mackie) interferes.<br><br>The ingredients are there but it just doesn't work. The characters are half-written shadows of people about whom we don't care. There is no depth, detail or intrigue to inspire us to invest our attention and, though we try to second guess the plot and look for the twists and double crosses lurking in the background, it transpires there are none to speak of and what we see is the sum total of it.<br><br>Timberlake is on something of a downward trajectory after the superb The Social Network. Neither Bad Teacher nor Trouble with the Curve ignited and his turn in Runner Runner, though adequate, does nothing to persuade us he's an A-lister in Hollywoodland.<br><br>Affleck, however, was ridding high with the supreme success of Argo and the promise of more box office clout with the forthcoming Gone Girl and Batman vs. Superman. Runner Runner isn't going to damage his career but it certainly isn't going to boost it.<br><br>Meanwhile, there are times when Gemma Arterton frequently forgets to act (and can't pronounce Antigua) and Mackie is lumbered with a role that diminishes even the 'heights' of Pain and Gain.<br><br>Somebody really needs to shake director Brad Furman, turn him around and point him in the direction of a sequel to his fine The Lincoln Lawyer.<br><br>Runner Runner isn't a bad film. It's just a bland, boring, forgettable, dull thud with no echo.<br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[117,156]}]