[{"title":"What else did you expect?","rating":10,"date":"15 March 2014","review":"I walked in the cinema expecting fast cars, street racing, crazy cop chases, drifting and explosions and that's exactly what I got! <br><br>This film is called \"Need for Speed\" and is based on a video game. This alone tells us not to expect character development, genius plot twists and memorable dialogues. This films delivers exactly what it set out to deliver. <br><br>If you like fast and beautiful cars, this is for you. If you like crazy stunts and cars chases, this is for you. If you enjoyed getting chased by the cops in the video game, this is for you. <br><br>Go to the cinema expecting the above and you'll have an excellent time.","user":"xundarz","rank":[474,644]},{"title":"Wouldn't Expect It To Be So Awesome!","rating":9,"date":"18 March 2014","review":"Well when I saw the trailer for the NFS movie, I thought \"No just no, it's going to be terrible\" - Then I saw the cast of Aaron Paul (Breaking bad) and Dominic Cooper (The History Boys). I loved Dominic in The History Boys and like most people enjoyed Breaking Bad.<br><br>But alas, having some aspiring actors isn't going to make a movie. Then I came here and found at the time a rating of 8.4 from people who had viewed the NFS pre-release. So at that point I thought, OK I'll give it a shot, worse case scenario it ends up being like a bad Fast and Furious rip off.<br><br>NOPE! Was amazing, never a dull moment, didn't have any scene that was just utterly pointless (which almost every movie does), the acting was fantastic, the action was intense, and the soundtrack and effects were spot on! As a movie it is great, but for someone like myself who grew up on NFS and loves car's it is EPIC. There's a great scene in the end, that anyone who has played the NFS: Hot Pursuit series will instantly go \"Yep, this is really NFS!\"<br><br>The only reason I wont give it a 10/10 is because of some minor plot holes - But nothing to bad, and most people wouldn't even notice. Otherwise brilliant, wouldn't be surprised if this becomes the next F&amp;F Franchise.","user":"logicalrick","rank":[198,333]},{"title":"Best Authentic Race movie","rating":9,"date":"24 February 2014","review":"I saw this movie at a early screening. This movie was great. The best authentic no CGI fake cars or wrecks all, old school real cars getting destroyed and flying down the streets. It was fairly predictable to me though I am a HUGE movie fan over 5000 seen. Still it made me feel the way I felt the first time I watched Fast and Furious! I like how they had no stunt drivers and they trained Aaron Paul how to actually drive the cars to make it more real. They replicated the cars to ensure that if/WHEN they did wreck the cars they could truly wreck the cars with no CGI involved. Aaron Paul &amp; Imogen seem to have great chemistry on screen that sells the story also.","user":"ahurry","rank":[192,359]}]