[{"title":"Gracias Pixar","rating":10,"date":"27 October 2017","review":"Im Mexican and all i can say is Thanks you Pizax,I just saw this movie and i just remembered all my childhood with my grandparents, Mexico was represented beautifully,the music, the colors. This movie touched me in my soul and i cried a lot, i created an account just to say how good pixar made everything, again gracias pixar por tan hermosa pelicula.","user":"mryohual","rank":[718,848]},{"title":"Shocked!","rating":10,"date":"1 December 2017","review":"I knew absolutely nothing about this movie walking in, the only reason I was there was to take my daughter to see it is strictly because my wife said there was a short Frozen film that played along with the movie and my daughter just so happens to be the biggest Frozen fan on the face of the planet.<br><br>Not only was I surprised by Coco, it might be the most in depth best story line I've ever seen in an animated movie. It was also educational and shed an entirely new light on the background of the Mexican holiday Dia De Los Muertos.<br><br>Wonderful movie, can't say enough good things about it!","user":"jon-stokes21-539-17875","rank":[390,461]},{"title":"Succeeds on all levels","rating":10,"date":"1 May 2018","review":"Music is banned in Miguel's household after his musical great-grandfather abandoned his great-grandmother and her young daughter. On Mexico's Day Of The Dead festival, a convoluted series of events sees Miguel transported to the Land of the Dead, where he discovers that the dead disappear when no-one remembers them. He also discovers that unless he returns to the land of the living by dawn, he will join the dead. And there are problems ahead!<br><br>The story here is very artificially structured, with all sorts of bits and pieces present s that a predetermined trail of events can be created. But you never notice that, so natural is the narrative flow. <br><br>This film is highly original, full of truly gorgeous visuals, lovely songs, delightful characters, and touching resolutions to several individual story threads. And yet it appeared in the UK with no publicity, trailers, or warnings whatsoever, and my local multiscreen didn't even get it in 3D despite the fact that it is clear that the 3D would be dazzling.<br><br>This is as good as any Pixar film over the last several years, and better than most.","user":"neil-476","rank":[120,138]}]