[{"title":"Look Into My Eyes","rating":10,"date":"28 December 2017","review":"Shattered. Yes, that's exactly how I felt. Unable to utter a word. Jonathan Banks creates one of the most hateful creatures I've ever seen on the screen and I've seen hateful creatures. I had a physical reaction to his recognizable monster, we saw him or one of his ilk marching down the streets of Charlottesville in 2017. Carey Mulligan is simply sublime. Garret Hedlund and Jason Mitchell have become two of my favorite actors. Their truth made of confusion, outrage and pain is pungently present in their eyes. Mary J Blige provides a powerful poster child for dignity and composure. A remarkable performance and Rob Morgan moved me so very deeply. A film experience that we all should confront. My gratitude and admiration to the extraordinary Dee Rees.","user":"claudiaeilcinema","rank":[107,127]},{"title":"One of the most beautiful final shots of the year","rating":8,"date":"17 November 2017","review":"A good and extremely well acted film. It is really the netflix film that could make the difference in terms of awards recognition. It is not your typical racism film as it tells another side of it. It is about two young men who would never be in any way friends if it wasn't for one thing they have in common. Both are war veterans and return home with a trauma. One is the son of a farm aid, the other is the brother of the owner of the farm. But it is not the only story this ensemble piece tells. The acting is the best reason to see the film. Rob Morgan was the MVP for me. It was a performance that worked way beneath his dialogue. A very deep and moving character and he managed it absolutely realistic. Jason Mitchell was great as well, especially towards the end. He has for sure the battiest role. Garrett Hedlund comes right after with a very controlled and intense turn. He surely is underrated for his acting, I also liked Mary J. Blige who had some great small moments, but after all the buzz I expected something more intense. Much of her performance works through her expressions which were great and real. Carey Mulligan and Jonathan Banks were great as well. Jason Clarke had his moments but was possibly the weakest of the bunch, but that was mostly because of his pale character, The film was extremely well shot, nicely directed and had a great screenplay. At the beginning it dragged a little bit but it is definitely worth to see and the ending is extremely intense, shocking and memorable. And the final scene has to be one of the most beautiful scenes of the year.","user":"Alexander_Blanchett","rank":[90,112]},{"title":"\"Mud\" happens... but it can also create the most unexpected and inspiring bonds...","rating":9,"date":"20 November 2017","review":"Racism, war, violence, female solidarity  however relevant these subjects are, they seem rather exhausted on a cinematic level especially when the Awards season starts.<br><br>Indeed, on the simple basis of its trailer, one would believe that \"Mudbound\" is simply Netflix making its \"Color Purple\", \"Mississippi Burning\" or \"12 Years a Slave\". Maybe. But there is something fresh and original in Dee Rees' adaptation of Hillary Jordan's novel and it's a considerable achievement that owes a lot to the writing, the directing and the unusual structure and patient pace of the film. Sure it is a companion to all the movies I mentioned but it has a sort of haunting quality, something that sticks to your mind and dwarfs a rather good film like \"The Help\".<br><br>What is \"Mudbound\" about? That's not an easy question to answer, a few negative critics pointed out the film's lack of focus because it's a multi-character story and there's no lead or supporting roles at first stance, just as they criticized the overuse of voice-over. I didn't mind the voice-over much, the story is so complex and multi-layered that I'd rather have a voice-over explaining things and make it my 'privilege' to pay or not pay attention to it. The lack of focus now is just a matter of half-empty or half-full glass. But here's a way to present the film in simpler terms. \"Mudbound\" is about two families, the McAllans (white) and the Jacksons (black) living in two neighboring farms in the Mississippi of the 40's.<br><br>Laura (Carey Mulligan) married Henry McAllan (Jason Clarke), less moved by love than a desire to escape from her \"old maid\" condition, and marital life made her feel relevant and important. Henry isn't the romantic type but no bad man either, and I was glad the movie didn't take one path I expected. No, it's not about that kind of abuse. The McAllans are a steady couple and the Jacksons form a united clan whose patriarch Hap (Rob Morgan) is the descendant of former slaves who worked on that same land, Hap's dreams is to own it in the future although he's not fooled by the worth of any act of property in that racist state. The Jacksons might strike as too 'virtuous' and taking very solemn poses but once you get drawn by the atmosphere and the hostility they constantly face, you realize that \"disunion\" couldn't be an option. Hap and his wife Florence (Oscar- worthy Mary J. Blige) can't afford the luxury of not being at least \"happy together\".<br><br>But the film doesn't venture yet in these unsafe territories; the tone is only set with the presence of Henry's father: Pappy McAllan, a bigoted racist played by Jonathan Banks and whom we suspect will act like a ticking bomb. Henry buys a farm and Laura follows him, circumstances of life will force Florence to work for the McAllans, but as long as these two families mind their own business, so to speak, nothing seem ready to create conflicts. Except for what sets up the second act of the film, the second World War. The merit of \"Mudbound\" is to paint notable differences at first until you realize that the two families have a lot more in common. This 'common denominator' is the core of \"Mudbound\": the bond between the two veterans of each family: Henry's brother Jamie (Garrett Hedlund) and Ronsel Jackson (Jason Mitchell). Here are two men who've seen hell in Europe, the things we expect and that are not overplayed, but they also lived the exhilaration of liberating countries and discovering a fraternity that transcends racial barriers.<br><br>\"Mudbound\" breaks a taboo seldom explored by the movies: the hypocritical treatment of Black soldiers. America takes pride for having liberated Europe but not to the point of questioning the internal \"prisons\", and this is the concealed wound the film tries to heal. Ronsel is the most complex of all the characters because he embraced his country's idealism and couldn't believe he wouldn't be rewarded for it. Jamie suffers from PTSD and finds in Ronsel the only man capable to understand him, \"Mudbound\" began like the stories of two women, Laura and Florence who were growing to understand each other, a sort of \"Color Purple\" of the 2010's, directed by a woman and with enough narrative to play like a feminist hymn, but no, this is a movie about two men, Ronsel and Jamie who grow to respect each other because they found in the mud of the battle-fight the universally human bond. You know what that movie truly reminded me of? \"The Defiant Ones\".<br><br>The image that immediately comes to mind from that Stanley Kramer's masterpiece of 1958 is Tony Curtis and Sidney Poitier as two ex-convicts chained together and escaping from the police. They hate each other, they still carry some bits of racism but the first display of solidarity happens when they're stuck in a deep pool of mud and must climb their way to the ground. Mud isn't just about dirt or about ground but can be a powerful metaphor of something uniting two men, a metaphor for an even dirtier stuff, when \"natural enemies\" discover they're equally worthless when put in the same 'mud'... unless they try to overcome it. \"Mudbound\" carries this image but it's less about 'mud' than it is about a color-blind \"bound\". The mud is either literal in the film or represented by the trauma of war and also the suffering of women, while not the focus, \"Mudbound\" has a saying on that subject as well.<br><br>\"Mudbound\" is a proof that Netflix is becoming a major contender in the years to come, I don't know whether the film will meet with Oscar recognition but there should be some love to the haunting cinematography, the screenplay and Mary J. Blige should be a lock if Octavia Spencer and Viola Davis won for what I believe are lesser movies.","user":"ElMaruecan82","rank":[52,65]}]