[{"title":"A numbing experience of the horror before conspiracy theories emerged.","rating":8,"date":"10 November 2013","review":"A certain generation gained its knowledge of the assassination of John Fitzgerald Kennedy from Oliver Stone's JFK. Don't get me wrong, JFK remains a fine film, but there's a danger of believing the conspiracies are factual. Parkland, Peter Landesman's directorial debut, doesn't necessarily right any wrongs but it does approach the assassination with a clean slate.<br><br>Parkland unfolds the story we are all familiar with, but manages to shock thoroughly as it recounts the events of 22 November 1963 and the immediate aftermath before the conspiracy theories and thoughts of dark dealings beyond the obvious murder emerged. Landesman manages to numb us, playing our own horror and sense of helplessness across the faces of the protagonists before us as their innocence is lost and their faith in humanity is rocked.<br><br>Central to Parkland is Abraham Zapruder (Paul Giamatti), the man who inadvertently shot one of the most important 26.6 seconds of film in American history: the arrival of the President's cavalcade and his harrowing, public execution at the hands (probably) of Lee Harvey Oswald. We watch Giamatti's Zapruder evolve from confident boss to shuddering, emotional mess as he realizes just what he has recorded and the impact that footage will have on the world and his own life. It is very easy to view Zapruder as a fortunate man, a man who in a lucky half minute, shot himself fame and financial security, but Giamatti flawlessly portrays a man who just might crumple permanently under the weight and pressure from the police, the Secret Service, the press...<br><br>At every turn in Parkland there is another character recoiling in their own horror, undergoing their own life-changing trauma, and each is played with the sensitivity demanded in order for Parkland not to be a mawkish, voyeuristic experience.<br><br>After last year's The Paperboy (but overlooking the awful The Lucky One), it's definitely time to take Zac Effron seriously as an actor. As Doctor Charles 'Jim' Carrico, the young doctor called upon to put his own emotions aside and fight for the life of his President as the First Lady weeps in the corner holding a chunk of her husband's brain, he looks shell shocked and as numbed by the events as we feel. <br><br>Subtler is James Badge Dale as Robert Oswald, another man whose life is irrevocably changed by the actions of a man, who happens to be his brother. At first shocked by the shooting, he retreats into himself as realisation dawns, emerging only to castigate his deluded mother, Marguerite (Jacki Weaver), who sees an opportunity for fame and hero's honours for her youngest son.<br><br>But Parkland is such a powerful film for much more than the performances. They say the devil is in the detail and it is the minutia that kicks us in the gut the hardest. The obvious is overlooked in favour of the finer points. We never see the Zapruder film clearly or in its entirety but the sound of Jim Carrico pumping the President's chest while the gathered crowd watches silently and without hope, goes right through us. The handle of the coffin torn off as the agents lift it out of the hearse, the panic as they realise it will not fit into Air Force One, the hasty removal of the aircraft panel with saw and shoulder... They all serve to make the situation real, the horror genuine and immediate. <br><br>Landesman has created a film of morality; not just the obvious judgment towards murder, but the more difficult matters of a church burial for a man despised by the population, the suspicion thrown at the family and the blame levied at those who could have prevented the act if they had had the benefit of foresight. Parkland is an emotional journey the delivers a series of punches to leave us reeling. <br><br>Yes, we know the story, even though we may not have even breathed our first breath in 1963, but have we experienced the emotion before now?<br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[43,54]},{"title":"A different look at the Kennedy Assassination. Doesn't take sides, just the facts. As a huge assassination buff I really liked it.","rating":8,"date":"3 November 2013","review":"\"This was not supposed to happen!\" Dallas Texas, November 22nd 1963. President Kennedy is in town for a campaign stop and is on his way to the Dallas Trade Mart for a speech. He never makes it. While riding in his motorcade he is struck in the head by a bullet and is rushed to Parkland hospital. A staff of doctors do all they can to save his life but are unsuccessful and he becomes the 4th President to be assassinated. This is what happened next. I will start by saying that I am extremely interested in the Kennedy assassination. I have tons of books, movies and other memorabilia of the Kennedy assassination and administration. I won't bore you with what I know or even my opinion of what happened because that would distract from the review. What I will say is that this is nothing like JFK. That is one of my favorite movies ever but it is more or less an opinion and more conspiratorial. This movie doesn't really deal with the assassination head on but rather the out lying players. The movie focuses on Zapruder (Giamatti), the man who took the famous movie. Forrest Sorrels (Thornton) the head of the secret service. You also see the actions of countless medical staff, Oswald's family and the Dallas F.B.I. You see the actions of these people and how the assassination affected them rather then what all the other movies focus on. Overall, a different kind of Kennedy assassination movie. It doesn't take sides, just shows how people acted. I really enjoyed this a lot. I give it an A.","user":"cosmo_tiger","rank":[29,37]},{"title":"A conspiracy-free portrayal of the aftermath","rating":8,"date":"5 November 2013","review":"First of all, most if not all of the low/negative reviews are based upon lack of questioning the events that transpired. This is not a conspiracy theory fueled film. The aim of this film is to document the immediate aftermath of President Kennedy's assassination through 4 different story lines and it does just that.<br><br>Maybe I'm a little bit biased because it's one of my favorite historical events to research and learn about, but I found it to be an insightful and well done look at the people who became involved after the event, without showing/repeating most of the general information that most, if not all viewers familiar with the assassination are already aware of.<br><br>I, for one, am satisfied that they did not blatantly show the entire Zapruder film once the FBI obtained and developed it. Not because I'm squeamish, but because although some may be, and also that this film is not primarily set on the actual assassination itself but rather the emotion and reactions felt afterward.<br><br>However, I do wish that they had shown more of Lee Oswald than they did. But then again like I previously said, most people who have researched the case have seen the videos and know the story (based on the Warren Commission at least) of Oswald's whereabouts and his part in shooting the President.<br><br>People complaining there's not enough \"conspiracy\" or lack of Oswald in the story, feel free to watch Oliver Stone's JFK instead, or open up a YouTube search and have at it.<br><br>So if you read everything I wrote, or just skipped down here, Parkland is an insightful look at the immediate aftermath of Kennedy's assassination and is highly recommended for fellow history buffs in general, or those interested in learning about the events surrounding November 22, 1963.","user":"wolowskigi","rank":[16,19]}]