[{"title":"Enjoyable but not remarkable.","rating":7,"date":"4 December 2019","review":"I found this movie on YouTube and had never heard of it before.<br><br>That being said, this is quite a good film, although it's nothing we haven't seen before. It follows a basic theme seen in other Hollywood products: a young child is sent to live with relatives he/she has hitherto only met briefly (or not at all) in some back woods American town. The child is usually a bit of a loner/misfit. The relatives also turn out to be slightly eccentric and at least one of them (usually the man) is a bit curmudgeonly and doesn't like kids. The other folk in the town are a mixture of odd characters who provide humor, drama and sometimes friction. A number of low-key adventures ensue, someone important dies (usually) and the child emerges from the movie with a deeper understanding of life and people and the grudging respect of every nut case living within a five kilometre radius. This movie pretty well follows that template.<br><br>Acting is good all round. It's nice to see Bruce Dern and Geneviève Bujold as always They bring their characters to life and make them real. Young Seamus Davey-Fitzpatrick does a fine job playing the wise-beyond-his-years protagonist Austin Kittredge II.<br><br>There is some swearing in this movie, but the incidences are few and far between. On the the copy I watched, some dear soul had gone to the trouble of bleeping out the few 'cuss words' that were spoken so I can't even tell how bad they were or weren't. This anonymous prude has even gone so far as to blank out the speaker's mouth momentarily when a swear word is spoken lest weak-willed, timid-by-nature, easily-corrupted viewers should read the characters lips, discern what the swear word is, and have a major attack of the vapors. I don't know if this was done by the person who posted the video to YouTube, a previous viewer of the movie or, even, the makers of the movie (Heaven forbid!!). Regardless of who did it, this minor bowdlerisation adds nothing to the movie, is just plain annoying, and an insult to adult viewers. If you are the person who did this, and you're reading this now, then all I have to say is PLEASE, don't do it again. We are capable of policing our own morals thank you. Your assistance is not required or helpful.<br><br>Whew. Anyway, to sum it up. This is a good movie. I liked it, but its been done before.","user":"CabbageCustard","rank":[3,3]},{"title":"Good family film, but not for the little ones","rating":13,"date":"13 June 2017","review":"In Kingdom County, Vermont in 1956, Austin arrives on the train. His grandfather, also named Austin, picks him up in an old truck. It is never made quite clear why young Austin is there, but his grandfather doesn't seem very nice, at first. He describes himself as the meanest (bleep) in Kingdom County. The word is actually used one time but bleeped the rest of the time the expression is used, with the character's mouth blurred. Austin Sr. can actually be quite loving.<br><br>Austin's grandmother Abiah is there when they arrive at the house, and she seems nicer. But there are times when she will be the meaner of the two. The house has a phone but no electricity, and Abiah will not have it in her house even though she always having to deal with flies and electricity would make that easier. Austin Sr. is quite conservative as well, so one would think he's the one who doesn't want electricity. But he has a sawmill to run, in addition to his many farm-related duties, so if the power company wants to run a line there, he is all for it regardless of what his wife thinks. He has maple trees for sap, and Gram has an apple orchard. There are also cows and chickens. There's lots of work, and young Austin is expected to do chores even though he doesn't like them. Austin Sr. also expects Austin to go hunting with him, but again Austin doesn't like the idea.<br><br>Now why did I say Abiah has an apple orchard? The two are living together but that's about it. They have been in the same house for 50 years and had three children (one wonders how), but young Austin figures out if he wasn't there neither one would say a word to the other. It turns out Austin Sr. was married (not legally, but they considered themselves married) to an Inuit nicknamed Mira because that was short for the English translation of her name. Austin Sr. never got over her death and settled for Abiah. Abiah is obsessed with Egypt, calling Austin \"Tut\" because he looks like the boy king, and the daughters Nefertiti and Cleopatra have careers Austin Sr. doesn't approve of (but the rest of the world would consider them a success).<br><br>Austin Sr. doesn't approve of education because he thinks it will take away from work. He doesn't approve of his son's career as a teacher. Austin's father comes up for visits occasionally, but young Austin stays for a long time and even goes to school, because despite Austin Sr.'s attitude, children have to go to school. There, Austin meets Theresa, whose family is poor, though Theresa seems happy. Austin Sr. doesn't seem to approve of helping the poor, blames the Dubois family for being poor because they're French, and does not see anything good about Adlai Stevenson. Still, he's not as mean as he seems. There's also the bully Hettie.<br><br>Later, the grandparents enter the maple festival's syrup contest, competing against each other.<br><br>Austin learns a lot about life and family, and responsibility. There are occasional laughs and some tragedy.<br><br>This is a family film, if not one appropriate for younger children. It could have easily been a Hallmark Hall of Fame production, because it reminds me a lot of those films. I don't recall any bad language except for that one word that keeps getting repeated and bleeped. There is some minor violence, and a death, and some difficult topics, but it's a film older children could watch. And maybe even some tough younger children.<br><br>Bruce Dern gives an Oscar-caliber performance, though I imagine this film didn't get noticed and there could just have been too many equally good performances.<br><br>Genevieve Bujold also does quite a good job.<br><br>Seamus Davey-Fitzpatrick is good too.<br><br>Because of the popcornflix.com logo at the beginning and credits that go on for days with the type information movie credits wouldn't normally have, I believe this was an independent film. That usually means quality, and that's certainly true in this case. I've never seen a film with so much participation by colleges.<br><br>It's a worthy effort.","user":"vchimpanzee","rank":[8,11]},{"title":"Great acting","rating":7,"date":"1 January 2018","review":"The budget on this movie was pretty small as an independent film. What saves it is the great actors. The acting was terrific; I gave this movie a seven because of the acting. Most of the sets were fine and the costumes were realistic also. But it struggled with production value, pacing, editing, and how some of the scenes ended and began. That's were a seasoned editor, screenwriter, and director would have helped. There were several rough spots because the screenplay was clearly clunky. A better screenplay would have produced better scene opportunities. Sometimes the dialogue didn't make sense - like when the grandson asks, \"What name did she call you before she died?\" No one asks that kind of thing. Not even a 1950's kid. The information was not necessary. Some of the scenes were awkward with no lead-in and ended with the viewer wondering why the scene was included since it didn't push the story along nor really show character development. Examples include the teacher being locked in an outhouse for an extended period of time, Austin Sr. talking to the cow-stealing landlord, or the saddle bag being open. A savvy editor and director knows which scenes are irrelevant and gets rid of them. That being said, Bruce Dern, Geneviève Bujold, and Seamus Davey-Fitzpatrick were wonderful to watch.","user":"sweetartcat","rank":[4,5]}]