[{"title":"The Disappointments Room (2016)","rating":4,"date":"27 December 2016","review":"Oh yeah, we know the type. September and January releases are generally known as movie dump months, after a busy period of cinema releases. A lot of the films released in this time period are films studios just needed to stick in to release. Generally these films are not good. The Disappointments Room does not go against the mold. After I watched the film I was kind of hoping I didn't as it pretty much offered nothing worthwhile during its entire duration.<br><br>The film is about a mother (played by the lovely Kate Beckinsale), her son and husband who move into a house where creepy occurrences take hold. She soon discovers a \"disappointments room\" in the attic where children with special needs or deformities were locked up. The spirits of the past start haunting her and she has a hard time separating reality from this new world she unlocked. Its a typical horror premise. Can I even call this horror? There isn't one scare in the film. Nothing that will stay with you. There aren't even any jump scares. In this day and age you'd expect something startling from a horror film but nothing really ever comes. As the film progresses you want to stomach less and less of it. If you've seen as many horror films as I have, you want something original, ambitious, or frighteningly entertaining. Unfortunately, this rarely happens.<br><br>I love Kate Beckinsale. She's an ageless beauty who I love watching on screen. I'd say she's the only reason you'd want to check this film out. She needs to pick better stuff for herself. She's been in some bad stuff but shes just wasted here. The guy who played her husband seemed like a caricature, his line delivery seemed so forced. He was basically the prototypical husband who doesn't see whats going on. Lucas Till was an entirely useless and creepy in the wrong kind of way character. I don't like the idea for the film but there could have been better delivery. Wish-washy editing of a bunch of \"scary\" images jumbled together is not enough to be memorable.<br><br>I know its my fault for getting sucked into this (damn you sexy Kate Beckinsale!) but as an avid film lover I'm always willing to give everything a chance in search of finding an inspired work. There's no inspiration here. Just a tired picture filled with nothing essential. You'll find scarier things in your day to day life than this mediocre effort. Skip it. There's too many puns I can do with the title of this film to convey how bad it is but I'll save you all the torture.<br><br>4/10","user":"rockman182","rank":[27,29]},{"title":"So many scenes were deleted!","rating":1,"date":"10 September 2016","review":"*spoilers in this post* I was an extra in this movie in 2014, in Greensboro NC at the Adamsleigh house. My part in the movie was a huge scene of a flashback or \"vision\" Kate is having while searching for her son Lucas. Now as other users have mentioned in their reviews, there seems to be a piece of the story missing or there is no backing to the situations that the movie slightly goes into. That is completely correct, because for some reason they edited so much out of this movie it's as if they changed their minds of the story completely, and were left with this empty boring story just about a slightly insane woman after he baby dies. The flashback scene I was in was a party Mr. and Mrs. Black were throwing. There was a room underneath \"The disappointments room\" that overlooked the garden (The garden they show all overgrown with the broken statue, now beautiful and pristine in the flashback) where the elegant party was being thrown. Fancy food, drinks, candles lit, an opera singer in the garden, party goers dressed up in their 19th century style ball gowns, men with beards laughing and pipe smoking, and so on. Kate walks through this party in disbelief of what she's seeing and looking for Lucas. My guess is this scene was alluding to the parents having this amazing party all the while their disappointment child is upstairs being hidden away from society, which would have added an interesting element to the unfolding of Kate finding out about the child's story of abuse. Perhaps sparking her interest to go see that woman who knows all about the history of those Disappointment Rooms. Who doesn't love a flashback scene to another time so long ago of a fancy party filled with ignorant party goers, having no idea their hosts are sick child abusers?<br><br>Another key piece that was edited out of the movie has to do with the German shepherd scene where the cat is killed, and Kate has a vision of her son being attacked by the dog. All of that was leading up to the fact that Mrs.Black was attacked and killed by her husbands dog and her husband did nothing to stop it from happening, (One of my friends played Mrs.Blacks body double). Another interesting element cut from the movie, and leaving the scene with the dead cat completely out of no where and pointless. These scenes I was in (and told about in detail on the set) being cut from the movie, and probably countless other interesting scenes cut, left the movie dry and not well rounded at all. Let alone only 92 minutes long, shorter than your average kid movie. I will definitely be checking out the deleted scenes section on the DVD, they will probably be more interesting than the movie itself.","user":"astamper","rank":[95,111]},{"title":"Botched Gothic horror effort","rating":4,"date":"9 September 2016","review":"\"The Disappointments Room\" follows an architect (Kate Beckinsale) reeling from a family tragedy who moves into a remote mansion in upstate New York with her husband and young son to restore it. She uncovers a hidden room in the house that does not appear on the floor plans, and begins experiencing increasingly disorienting visions of the home's original owners.<br><br>I have to admit that I was fairly excited by the trailers for this film; it promised nothing groundbreaking, but appeared by all accounts to be an at least entertaining Gothic throwback—and I'd assume the script would lead one to a similar assumption, but the film unfortunately is something of a self-sabotaging effort. <br><br>It starts out briskly and glides through the typical haunted house fare—family arrives at old mansion, wife notices strange things immediately off the bat; she may be unstable, or the husband may be oblivious; the child is in imminent danger. These tropes are thrown at the audience in succession throughout the first act of the film; enter the second half, and the film seems to turn on its head. The plot regarding the history of the secret room and the apparent spirits in the house is sidelined, and suddenly the film becomes an anemic psychological study of a broken woman. The intrigue—or at least what little there was of it—for all purposes disappears. <br><br>The last forty minutes of the film especially are marked by awkward, amateurish editing choices that break any sense of flow, and a frankly ho-hum performance from Beckinsale. This isn't to say she's a bad actress, but she certainly seems bored here. The husband character is essentially useless in the film, and Lucas Till comes in as a sexualized handyman in the last thirty minutes, far too late to introduce a character that is apparently supposed to have some significance to the plot. By the end of the film, I was wondering where the narrative was attempting to take me—through the journey of a traumatized woman? Through a family that's falling apart? Through a haunted house? I still don't quite know, as the film fails to commit to any of the above in a genuine way. The last scene ties things together in a neat package, but there is no sense of relief or catharsis.<br><br>Overall, \"The Disappointments Room\" was a letdown (yes, I'm going to avoid the pun). In spite of the wonky editing, bad pacing, and general lack of narrative direction, the worst part of it all was that I honestly feel there is a good film somewhere in here; not an innovative one, or even a great one, but at least a good one— one that is capable of delivering a straightforward Gothic horror story without imploding on itself. One of the few things the film gets right is the atmosphere, and its most noteworthy scene comes at the end in the form of a disturbing Victorian-era flashback. Aside from that, \"The Disappointments Room\" is a lost opportunity. 4/10.","user":"drownnnsoda","rank":[47,53]}]