[{"title":"A Horror/Drama with Strong Performances and a Great Visual Style","rating":7,"date":"23 May 2014","review":"In my recent horror movie craving, I came across WE ARE WHAT WE ARE after seeing a few brief mentions of it when it premiered at Cannes in 2013. I'd forgotten all about it until I saw it sitting on the shelf at my local department store and couldn't remember what it was that had interested me in it in the first place, but I figured I'd give it a go. I refreshed myself on the premise and settled in for the movie, soon finding myself pleasantly surprised. It was nothing like I expected, and this turned out both good and bad. But first, a little information about the premise: the film is a remake of a 2010 Mexican horror film that I was unfamiliar with, and it follows a family known as the Parkers. Living in a small town somewhere in America, the Parkers generally keep to themselves. Their neighbors seem to know very little about them but view them as a pleasant little family. As a massive storm batters the town, the family matriarch dies and the father, Frank (Bill Sage), is left to care for three children: Iris (Ambyr Childs), Rose (Julia Garner), and young Rory. Their mother's death couldn't have happened at a worse time, as the family is approaching time for one of their more unusual traditions: Lamb's Day. As the family's disturbing secrets are revealed, the town's doctor (Michael Parks) finds a clue that might lead to information on his daughter's disappearance and his investigation leads him a little to close to the Parker's family tradition.<br><br>WE ARE WHAT WE ARE is a tough call. There are a lot of elements I liked but there was a bit that put me off. For starters, the pacing is nothing like what I expected. I don't know exactly what I thought the movie was going to be, but I sure didn't believe it to be a slow-burning, high-tension horror piece. In what I expect is a major complaint from others, the movie is very slowly paced. There are a lot of long shots seemingly used to highlight the film's dark atmosphere. It's a very high contrast film with very little actual color. There should be no complaints about the film's cinematography from Ryan Samul; if anything in the movie is pulled off near perfectly, it's the moody lighting and muted colors that give the movie a very defined style. So I can understand why so much effort was made to utilize it, but even the dialogue is delivered in such a way to make the movie feel longer than it is. There are a lot of quiet moments and, when anyone speaks, it's generally in hush tones. Everyone here is muttering as if every word spilling from their mouths is a dark secret (though I guess some of it is). It all results in a very dreary movie and it's hard to get excited about something so depressing. Actually, that's probably the perfect way to describe the feel of WE ARE WHAT WE ARE: depressing.<br><br>But that doesn't mean it's not a good movie, even if it does leave you feeling sort of drained by the end. The performances in the movie are actually really, really good. The film's four main starsSage, Childers, Garner, and Parksare great. Frank Parker (Sage) is a man set in his ways. Lamb's Day is a tradition that's been carried out in his family for generations and he will continue to abide. He never once questions his actions or what he is putting his family through. As far as he's concerned, this is God's will. The sisters, Iris and Rose, realize that what their doing is monstrous. Their minds are a little more modern and they recognize exactly what they're doing and how wrong it is. But Iris, the eldest daughter, has the responsibility to see it through and she agrees to continue to appease her father while quietly hoping she'll be gone before the next time she's called upon to perform her duties. Rose, on the other hand, wants out and she wants out now. She wants nothing to do with it and, more importantly, she wants to save her little brother from falling into their father's insane beliefs. Michael Parks as Doc Barrow is a nice addition as well. I've never really seen him in such an expanded role and a film as gloomy as this seems perfect for his tense, deliberate line delivery.<br><br>The performances and the cinematography are so well done that it helps forgive the film's snail pacing. Then there's a bizarre climactic final sequence to close the movie that goes completely against all the mood and atmosphere building of the previous hour and a half to blast the audience with some shock value that doesn't quite sit right within the film. I can sort of see what the filmmakers were going for but that doesn't stop it from coming across a little too amusingly, especially in execution. I won't spoil it here but I would recommend giving WE ARE WHAT WE ARE a viewing to find out for yourself. It's an engaging horror/drama with a strong cast and a great sense of style that overcomes it's few flaws, and it'd work well as entertainment for a quiet night rental.","user":"brando647","rank":[23,27]},{"title":"A dull set-up prevents this movie from leaving the lingering impact it could have.","rating":5,"date":"11 June 2016","review":"We Are What We Are is a brooding slow burn with little to no jump scares and disturbing subject matter, specifically cannibalism. Believe me when I say I really wanted to love this movie. Sadly, the first two acts of this movie are a chore. I fell asleep the first time around the 20-minute mark my first watchthrough. It begins with a family tragedy and shows their subsequent grieving period. This family has a secret but it's established early on so we're just watching them do stuff. It's a way to develop the characters and set the mood, sure, but it completely failed to grip my attention. You know where the movie is going right off the bat. It shows its hand too quickly and doesn't gain any momentum until the final act.<br><br>The third act is enjoyable, though. It's thrilling, tense, borderline silly at times but all in good fun. The problem is whether it's worth the wait. Like waiting in line for five hours for a roller coaster ride and you finally get on and have a good time, but was the wait really worth the few moments of enjoyment? Honestly, it's entirely up to you. The movie certainly has its perks. The acting is excellent across the board, the daughters in particular, and the cinematography is superbly crafted to give you the eerie vibe necessary to pull off this subject matter. Production value wise, We Are What We Are is quality stuff.<br><br>I'd recommend it to horror buffs, specifically those who prefer a slow burn over cheap jump scares. We Are What We Are just happens to be the particular slow burn that's slow to the point that it produces more of a flicker than a flare.","user":"lnvicta","rank":[32,39]},{"title":"Remake of the Spanish film,But it's a different beast all together.","rating":7,"date":"21 September 2013","review":"We Are What We Are is an English language remake of the Spanish film Somos Lo Que Hay. The word remake is sometimes looked upon as a dirty word amongst film geeks. Trepidation regarding the quality of remakes will always exist, it's only natural.<br><br>Both films are entirely different from one another despite sharing the same premise. Somos Lo Que Hay was (in my opinion) a pessimistic film rife with social commentary in regards to Capitalism and Poverty. We Are What We Are deliberately ignores that commentary and instead focuses in on the religious fundamentalism of the ritualistic family as its central theme. We Are What We Are is not just a mere shot for shot remake; it's a different beast all together.<br><br>Director and Co-Screenwriter Jim Mickle lift's the premise of the original film and relocates it from the Inner City of Mexico to the back end of Sleepy Rural Southern America. The film follows the reclusive Parker family and the bizarre rituals they practice.<br><br>It all begins when the Matriarch of the family unexpectedly passes away. Devastated and unable to cope with the sudden loss, the Patriarch (Bill Sage) of the family regresses into an emotional collapse. Leaving his two teenage daughters, Iris (Ambyr Childers) and Rose (Julia Garner), to ponder over who will step up to the plate and continue the cannibalistic rituals that the family practice every other Sunday.<br><br>The Parker's do what they do under the guise of believing that it is a penance that must be performed in order to be saved in the eyes of the lord. They follow the writings of a diary kept by an ancient patriot relative who suffered through a harsh winter with very little in the way of food supplies, thus resorting to cannibalism out of desperation.<br><br>They treat this diary as if it were their equivalent of the holy words of scripture. Thus the diary has been passed down from generation to generation and is seen as a rite of passage into adulthood – in this case the eldest daughter Rose is next in line to inherit its 'teachings'.<br><br>The family is kept under the strict ruling hand of the Patriarch -- played with unnerving intimidation by Bill Sage. He is a domineering force as he preaches his beliefs and traditions to the family in order to keep them together and to push forward with the annual ritual. Much like the film as a whole, he has a simmering rage boiling underneath his controlled exterior demeanor that threatens to erupt at any given moment; making him all the more frightening and intimidating.<br><br>His dominance makes life all the more difficult for his two teenage daughters who, with the recent death of their mother, are starting to question the ritualistic ways of their existence. They yearn for something else in life and struggle to come to grips with what it is they are. Much like the original film, denial plays an important factor for the siblings as it does for almost everyone else in the film – be it the savages or even the town sheriff denying suspicious foul play in his town. The siblings hide in denial of facing who they truly are until they are forced by cruel fate to face the beast that resides within.<br><br>Ambyr Childers and Julia Garner are excellent finds for these roles as they both deliver subdued and nuanced performances. They fit the mold perfectly as the somewhat reclusive children who can't quite fit in with the outside world. They have the frail and pale physical complexity that compliments the dreary and rain soaked atmospheric mood that the film radiates.<br><br>While the family prepare for their next ritual, a flood hits the sleepy town washing up evidence of human remains to the surface. This attracts the curiosity of the local town Doctor, played by the always wonderful Michael Parks, who is still haunted by the mysterious disappearance of his daughter. Parks serves as a replacement to the bumbling and fame hungry detectives from the original film. This is actually a wise decision as Parks bring a measure of soul and humanity to the grisly proceedings and is a more then suitable change.<br><br>Much like its spiritual predecessor, it isn't a film that relies on an overabundance of plot turns or 'gotcha' moments. It's a very slow and deliberately paced film spanning over the course of four days. This is reflected with its use of stilted yet beautifully composed cinematography made up of a dreary, rain-soaked and moody palette of rustic greys. It shows a surprising amount of restraint and has patience in taking its time building its tension whilst shining the spotlight on its characters and themes.<br><br>It's a very unassuming film where the tension is always simmering underneath just waiting to erupt. When it erupts, it grabs you by the throat unexpectedly and bites in hard. Unlike most Cannibal films that focus on gore for gore hound sake, it keeps the gruesome stuff to a minimum. But it is all the more effective for doing so. It is most surprising as the norm for most American remakes is to usually dial the volume way up to eleven. Yet this one is surprisingly restrained, maybe even more so than the original.<br><br>As far as remakes go, We Are What We Are is a fascinating case study of a remake done rather well.There is no familiarity between both the movies, despite a few casual sly nods of referencing here and there to the original film, it stands apart as a drastically different film that has something else on its mind and as is, it does stand very well next to its original counterpart. 7/10","user":"waqarr40","rank":[79,108]}]