[{"title":"High concept. Awkwardly executed","rating":5,"date":"15 August 2014","review":"'Shadow Walkers' (or '+1' as it's also known) is an odd little number at the best of times. It never really seems to know what it is. I guess the one thing everyone can agree on is that it's a 'B-movie.' Therefore, most likely everyone concerned with making it knew that it was never going to be a massively commercial box office smash. At best it might achieve 'cult status' on DVD.<br><br>Therefore, it doesn't have a budget and no 'known' actors to speak of. It's about a meteor that crashes into a small town in America, creating weird phenomenon amidst a local college party. Soon the guests find things are going a little crazy and they might not make it to morning alive. It starts off like some sort of adult-humour piece like American Pie, then it progresses into a looping version of Groundhog Day. There's also a fair bit of 'gratuitous' nudity which (judging from what I've read online) seems to have put a lot of people off from taking the plot seriously.<br><br>When I read that synopsis I thought it was going to have something to do with aliens. Yet, what you get is time travel. It could work. And it almost does. Without giving too much away about the plot, it tries to be a little bit different (and succeed), but then it strays into that area where it starts to become too clever for its own good. Any film concerning time travel is going to have some major plot holes. Some of them are just so good (I'm thinking the Terminator series and Back to the Future) that you can forgive the odd lapse in plausibility and just enjoy the ride. However, in Shadow Walkers the questions just keep mounting up. It's like the writers had one idea then changed their minds half way through. And then again about twenty minutes later.<br><br>You'll find yourself asking quite a few questions as to why people do things and what happens to someone which hasn't really been properly explained. I checked online as to find out the meaning behind much of the film. There are some good theories explaining most of it, but no one seems to be able to explain everything.<br><br>If you were left with questions after watching Prometheus, then you'll be able to write an encyclopaedia as to what wasn't clear in Shadow Walkers. I didn't hate the film. It tries to be different, which, in a marketplace of B-movies filled with 'found footage' and cheap zombie movies, made a change. I just wish it had been a little more focused. I don't mind not having every little detail about a story explained to me. Sometimes it's fun to interpret it your own way. It's just here they took that concept a little too far.<br><br>For fans of sci-fi B-movies only.<br><br>http://thewrongtreemoviereviews.blogspot.co.uk/","user":"bowmanblue","rank":[22,25]},{"title":"Interesting idea","rating":7,"date":"21 September 2013","review":"I really liked the plot idea for this film. A double of each of the characters at a huge student party makes for some interesting interactions. It seemed though, that after setting the scene for a very enjoyable development of the story, the producers didn't come up with a clever way to wrap it all up. The ending seems misplaced and rushed.<br><br>Except Rhys Wakefield who was very doll-like, the acting was quite good. The camera-work during the party scenes was very well done. The atmosphere of an awesome party with just a touch of \"something weird\" was delivered perfectly.<br><br>Overall, not a bad film. It would be much better with a more thoughtful ending, but then again I cannot think of a fitting conclusion either.","user":"Zubacz","rank":[56,74]},{"title":"Good looking, good premise, mediocre story","rating":6,"date":"21 September 2013","review":"Some kind of weird meteor hits the ground and causes an otherworldly electrical disturbance in the vicinity of a big college party. Suddenly there's two of everyone, which apparently causes violence to ensue. In the midst of it all, the main character is trying to win back his girlfriend. <br><br>Is it sci-fi? Horror? Drama? Sexy college comedy? It appears to try for them all, but doesn't achieve any with particularly flying colors.<br><br>A lot of people will probably like this just for the awesome party depiction; and that's cool. It does look like one hell of a party, and I kinda wish I'd been there. This movie has a lot of other things going for it, including a good premise, decent acting, glossy big-budget-looking production values, and some nudity (yay!). The effects were also quite convincing.<br><br>The story, however, leaves something to be desired. It's hard to tell whether the relationship drama or the weirdo cosmic event was supposed to be the main storyline, but I didn't much care about either one. A bunch of one-dimensional characters try to say deep things once in a while, and their reactions to the strange situation are a little contrived, as if the writers chose to force a horror/thriller show from a premise that should've taken a more intriguing route. I also kept wondering why everyone didn't just LEAVE when it became apparent that things weren't right. I guess the party was just that good.<br><br>It turned out fun, somewhat entertaining, and a bit disturbing, but could've been more. I'd recommend this for a streaming rainy day view.","user":"equazcion","rank":[40,56]}]