[{"title":"Do you like your Santa to wield a flamethrower?","rating":6,"date":"5 December 2012","review":"With the festive period now upon us, it's the time of year to bring out those films that are best watched at Christmas time. You've got Home Alone, The Muppets Christmas Carol, Scrooged, Miracle on 34th Street, It's A Wonderful Life, The Empire Strikes Back, Batman Returns, Bad Santa and a slew of others that give that special festive feeling. Quite how much of a festive feeling the last three in that list give to people is open to debate, but they're regularly on my list of Christmas viewing. One thing that you don't see that much of these days, bar 2006′s Black Christmas, is festive horror films. With the release of Silent Night, we have another festive slasher to add to this small collection.<br><br>Loosely based on 1984′s Silent Night, Deadly Night, the film tells the story of a murderous Santa on a killing spree on Christmas Eve in a small American town. Complete with classic tag-line – \"He knows if you've been naughty\" - the film is an unashamedly kitsch, cheesy, brutal hark back to the days of the traditional slasher flick. The kills come thick and fast, with Santa showing no remorse to those that have been naughty in his eyes. Each kill is different to the others, with the brutality and gore plentiful. Ol' Saint Nicholas uses a variety of weapons – an axe, hatchet, knife, flame thrower, a wood chipper (hey, Fargo!), deer antlers and Christmas lights amongst others – as he tears his way through his naughty list. Out to stop him is the local Sheriff's department, with Malcolm McDowell (A Clockwork Orange, Gangster No 1, Rob Zombie's Halloween) in the role of Sheriff Cooper. Cooper's team is made up of Jaime King (Sin City, The Tripper, The Spirit), Ellen Wong (Scott Pilgrim vs The World) and Brendan Fehr (Roswell High, CSI: Miami). Early on in the film, Jaime King's Aubrey Bradimore is firmly established as the lead of the piece, with the nervous, unsure of herself Bradimore leading the hunt to track down the dastardly Santa.<br><br>To complicate matters, with the film being set on Christmas Eve, there are Santas everywhere. The small town has a seemingly endless amount of people dressed up as Kris Kringle, most of them having worked as Santa for the festive period and most of them having an attitude. One such Father Christmas is played by the naturally charismatic Donal Logue (Grounded For Life, Blade, Shark Night 3D). Logue plays the part of a blunt, aggressively honest, down-on-Christmas Santa. Along with Malcolm McDowell, he chews up every scene that he's in. With McDowell, it's a very fine line between whether I like his performance or if it's just horrendous. As a McDowell fan, I'm inclined to lean towards the former. The problem is his delivery and his accent; at times he sounds English, at other times he sounds English with a far too forced American twang. Hearing him deliver 'ass' and 'garbage' just sounds wrong. That said, the same could be noted of his performance as Sam Loomis in Rob Zombie's visions of Halloween and Halloween II. It also doesn't help that some of the lines that McDowell's Sheriff Cooper comes out with are just pure unadulterated, cheesy one liners. At first they sound cringeworthy, but they get better as the film goes on. That may be down to the fact that I grew up on action films riddled with embarrassingly bad one liners. I'd fully understand if others found this to be a major annoyance though.<br><br>So, with the majority of the dialogue and performances seemingly tongue-in-cheek, the film could be nothing more than a fun, gory, Christmas slaughter ride. The direction by Steven C. Miller (Scream of the Banshee, The Aggression Scale) is actually surprising for a film of this standard. At times, the direction is fresh, crisp and detailed – much like a Christmas night. There's also a well utilised festive soundtrack to accompany the bloodsplattering action. Jaime King in the lead role is sympathetic and fine for what she needs to be. The performance doesn't set the world alight, but it gets the job done. In fairness to King, she does seem to be one of the few that is playing the film straight. It's just a shame for her that the rest of the cast are hamming it up. There's also the slight problem of finding yourself cheering on Santa at times, especially when it comes to a slimy, perverted man of the clergy that he takes out.<br><br>Personally, I like that the film is a little tongue-in-cheek. At times, particularly with the relatively innovative deaths and the gore used, the film gives an almost Troma-lite feel. Anybody familiar with myself or my interest in film knows where I stand on Troma, so that is another plus point for Silent Night.<br><br>If you're expecting a tension filled masterclass of suspense, Silent Night is not the film for you. Silent Night is not to Christmas what John Carpenter's Halloween is to Halloween. However, if you're after a unique, sinister, gory, festive film to kill 90 minutes, then this film fits the bill perfectly. In regards to the original, this is a remake in the very loosest of terms. There are a few nods to the original film here and there, such as the catatonic grandparent, but little else apart from the big bearded fella in the red suit.<br><br>Silent Night is a throwaway film in the best possible way. It's the type of film that you can just pop on without having to engage your brain. If you like your ho-ho-horror (bad Christmas pun) bloody, to the point, cheesy and with a dark sense of humour then I'd recommend Silent Night for at least a one-off viewing. For those that go into this with an open mind, I give this festive slasher a respectable 6 out of 10 stars.","user":"culturedleftpeg","rank":[24,29]},{"title":"Merry Christmarse","rating":7,"date":"20 July 2016","review":"A nutter dressed as Santa Claus is roaming around some sleepy town in America wasting people who have been naughty (starting with an adulterer and her lover), and it's up to deputy whats-her-name and grumpy police chief Malcolm McDowell to sort him out.<br><br>I was getting fed up with slasher movies since they, at their worst, are just the same things you've seen over and over again (see Bunnyman massacre, Mask Maker etc). Silent Night IS the same sort of thing you've seen before, but it's really well made, contains actual tension, and is a beautiful film to look at. <br><br>Of course, there are plenty of undesirable folk for our killer Claus to perforate, from the bratty kid to the pervy priest to the pornographers, and you've got plenty of gore to go with it too (including a head split in two with an axe and someone getting fed into a woodchipper feet first). I'm no worshipper of Malcolm McDowell but here he's pretty funny as the ignorant police chief who won't listen to his deputy. \"Don't put avacado on the burger\" indeed.<br><br>Just shows that a good slasher film can be made if people can be arsed.","user":"Bezenby","rank":[5,5]},{"title":"Good reboot of the old classic!!!","rating":7,"date":"2 December 2012","review":"Now this is not a straight forward remake of SILENT NIGHT DEADLY NIGHT, but it does pay homage in a few scenes, if you remember how Linnea Quigley dies in the original you'll know what i mean....its a solid film based on its own merit and storyline, some great gore and death scenes, and good acting by the most of the cast..unfortunately apart from Malcolm Mcdowell, who plays the sheriff, terrible dialogue and terrible acting, that was the only issue i had with it, because all round a great seasonal slasher, this will definitely be on the slasher/ horror list to watch every Christmas with all the rest, BLACK Christmas, Don't OPEN TILL Christmas, Christmas EVIL, SANTA CLAWS, THE Christmas SEASON MASSACRE, GREMLINS, SILENT NIGHT BLOODY NIGHT, BLACK XMAS, SINT (SAINT). Watch it, enjoy it.","user":"zombie1973","rank":[20,31]}]