[{"title":"New generic Leprechaun movie dismisses the fun and original series.","rating":3,"date":"28 August 2014","review":"I gave this movie 3 out of 10 stars and that was being generous. It was entertaining enough to get through the whole thing and some cute chicks, but that's not saying much. It was sooooo generic. The typical cabin in the woods style film with nothing special added to it.<br><br>I thought the film sounded bad from the very beginning and after I watched this, it just proved my point. Why did they have to change the formula from the Warwick Davis series? They had a fan following and this movie just has fans dumping on it while not gaining any new fans.<br><br>There was nothing fun about the monster. He didn't talk, didn't look like a tradition Leprechaun. More like one of those creatures from the movie \"The Descent\". I don't understand how Hollywood needs to remake everything and give everything more of a \"realistic\" approach. All these original horror series such as Leprechaun, Friday the 13th, Nightmare on Elm Street and Halloween used to be a lot more fun then what they are now.<br><br>All I have to say is booooooo. Two thumbs down. BRING BACK WARWICK DAVIS!!! Make that long talked about Leprechaun:In the Old West. I love all those movies for as cheesy as they are. They were fun.","user":"joeman32","rank":[36,41]},{"title":"Pumpkinhead: Origins.","rating":1,"date":"27 August 2014","review":"Let me start off by saying that 'Leprechaun: Origins' has absolutely nothing to do with the cult classic starring Warwick Davis.<br><br>My best guess is that WWE Films decided to go with the current title, hoping to snag a few people who hope to catch a glimpse of the original star.. Instead what we get, is some of the worst camera work imaginable, especially during close up shots of a creature so badly made, that it looks like a cross between 'Pumpkinhead' and one of the creatures from 'The Descent.' The creature also seemed to grow and shrink at will, during different situations, such as being shot at close range in an attic the size of a closet, by a hillbilly wielding a sawed off shot gun, who couldn't hit the broad side of a barn.<br><br>Random Ramblings of a Madman: The acting is the usual.. the characters, however enter an entirely new level of stupidity, such as entering a cabin with barred windows, and a lock on the out side of the door, big enough to keep Andre The Giant from getting out. Long story short, 'Leprechaun: Origins' is something that should be on the syfy network. If you enjoy that sort of thing, go for it.","user":"Krackoon","rank":[16,17]},{"title":"A movie that can cause cancer.","rating":1,"date":"27 August 2014","review":"This is hands down the worst Leprechaun movie, and it's also one of the worst remakes. That's a twofer, right there. As much as we all loved the Leprechaun series and horror remakes, that's saying something. Do yourself a service and watch something else—watch the 1998 Psycho remake. At least that one borrowed from the source material.<br><br>It doesn't feel at all like a Leprechaun movie. I don't know anything about wrestling, but when I heard that someone else was going to don the role of the title character, a role that Warwick Davis made infamous, I figured they were just going to redesign the character and feed him all of Davis's lines. Maybe they'd even throw in a few rhymes here and there.<br><br>Well, there was absolutely no reason why they needed a wrestling star to play this character, because the Leprechaun in this movie isn't a character. He's a monster. Yeah, he's a guy in a rubber suit, hopping around like Gollum from Lord of the Rings and growling like some disturbed beast. He has no dialogue, and he doesn't even resemble what a leprechaun is supposed to look like. He looks like kind of a decrepit Pumpkinhead.<br><br>They must have known early on that it was a terrible choice, because whenever you see the creature, he's all blurry. What, did they just smear Vaseline over the camera lens? And they don't do this just for certain scenes—it's every time they show us the monster. He has a fair amount of screen time, but they rob us of every potential scary moment because you can never see the damn thing. It also doesn't help that most of the time, they do these weird POV shots, and apparently the Leprechaun possesses infrared sight, like the Predator.<br><br>That brings me to my second point: the editing and all the shaky cam. I honestly had no idea what was going on during the whole movie. The monster just pops out of nowhere, tries to eat the main characters, and then—I don't know, it's all over the place. Rinse and repeat. The characters run back and forth into this one cabin in the woods, never accomplishing anything. Every time they go back, someone else dies. It's a terrible paint-by-the-numbers set-up, and again, because they feel the need to make the picture blurry whenever the monster shows up, we can never tell what's going on.<br><br>It doesn't matter anyway, because I just didn't give two farts about the characters. That's very common in modern slasher movies. Since when did they make this rule that characters don't need personality in horror movies? Is it really that hard to give characters some personality traits? I know you spend a little more money on ink, but come on? Slashers used to be fun. But here, I cared even less about the protagonists. They just didn't have anything interesting to say. I couldn't even hate any of the characters. Lately, it seems to be a fad with horror movies—there has to be at least one blatant dickhead for the audience to hate. But here, everyone's just kind of there, enjoying the scenery until the Leprechaun arrives. There's no reason to cheer for anyone, there's no reason to hate anyone. It's the most severe case of bland I can think of, and I sat through eleven Puppet Master movies—I know what I'm talking about.<br><br>The only connection this movie has at all with any of the earlier films is that the surviving character at the end actually says, \"Fuck you, Lucky Charms.\" I was actually surprised to hear it, because after watching this lifeless piece of crap, I was beginning to wonder if the filmmakers just didn't bother with watching any of the prior movies. Not that they would have a lot to look forward to, but that's beside the point.<br><br>I think it's obvious, I hated this movie. And to add insult to injury, they gave us twelve minutes of credits. Twelve. Frickin'. Minutes. The actual move is only an hour 18 minutes. Pay no attention to the 90 minute runtime. The last twelve minutes are purely credits. And no, there weren't a lot of people who worked on itthey just felt the need to give us boring glimpses of movie stills in between showing us the names of people who would go on to become raging alcoholics after making this movie.<br><br>This was a total waste of time, an abomination of movie-making proportions, and it needs to be outlawed in at least thirty countries, including this one. I think I found a contender for worst movie sequel of all time. Leprechaun: Origins has the potential to give me cancer. Steer clear, because there's no cure. The only remedy is to just forget it ever happened.","user":"lsherman0316","rank":[48,58]}]