[{"title":"This awful movie will have you begging to be on the hanging end of a rope before it's over...","rating":1,"date":"24 July 2015","review":"Do not, I repeat, Do not fall for the made up 10 star reviews...( It's obvious those affiliated with producing this garbage want to pique the interest of others so they give fake ratings &amp; reviews, hoping others will be interested enough to see it- &amp; they make more $$) Take it from me, Wasting my $ &amp; time on this terrible so-called \"movie\" left me leaving the theater very upset I wasted $ on this trash &amp; annoyed. All found myself wanting to do, was to drop-kick the blonde, camera-holding, guy. (.Whoever decided THAT guy has any talent in acting, needs to have their heads examined.,I can only surmise he has a family connection or paid to be in the film) The story/ acting was way too cheesy to be scary. I have nothing positive to say about this film. It was just plain junk. When I went to see it, it was opening weekend, therefore, there weren't many reviews or ratings accumulated to get a real idea of whether or not it was going to be any good. I believe this crap actually had a 6.1 rating...Now, for horror movies- I considered that to be relatively high ( even from just a couple hundred ratings) Wow, was I duped!! Now,after seeing ( most of ) the movie ( ended up walking out, it was THAT BAD) and then seeing the 10 star reviews, I KNOW the ratings on here can't be trusted...( until you see at least 5,000 - 10,000 people rated it) SO- save your $ , time &amp; irritation -skip this boring, sad excuse &amp; find something better...","user":"MovieMama625","rank":[71,94]},{"title":"I Have No Clever Analogy. It Just Sucked.","rating":3,"date":"7 August 2015","review":"Remember back when the found footage style was a unique style of filmmaking and only a handful of films used it? (I.E. The Blair Witch Project, Paranormal Activity, Rec.) But it's common knowledge nowadays that it's become a cliché and a cheap gimmick for studios to save on production costs. Most of the time, there is almost no effort put into the film's storyline, characters, or scares. The Gallows certainly doesn't help its case. <br><br>Pros:<br><br>-A few decent performances<br><br>-Good production design<br><br>-Has the potential to be scary<br><br>Cons: <br><br>-Insufferable main character<br><br>-Bullshit plot twist that makes no sense<br><br>-Plot itself is nonsensical<br><br>-Relies on cheap jump scares<br><br>-Has a few good ideas, but they're usually screwed up somehow.<br><br>-Found footage style is given no explanation<br><br>3/10 (Horrible)","user":"ralo229","rank":[38,51]},{"title":"Worst Movie Ever!","rating":1,"date":"7 August 2015","review":"So apparently the plot of this movie is that in 1993 a school is doing a play called the Gallows. The character August played by Charlie Grimille something goes wrong with the props and everyone sees Charlie being hung dying infront of everyone. So in the film 20 years later which would place the film year 2013 the play is revived i am guess as a tribute to charlie. 4 Students break into the school at night and are haunted by a unseen spirit.<br><br>There is so many things wrong with that i don't know where to being. The acting is decent i will give that to them. But the whole movie lacks really much of a story. Pfeifer tells Ryan your not suppose to say Charlie on stage it is bad luck kinda like a Macbeth thing. Okay fine and well but why is it bad luck? Why can't you say it has the play ever been done after the accident? How did they get the idea to redo the play? When Reese discovers his father was suppose to play August not Charlie question remains why did his father call in sick? Was it truly a accident or what? If one of the students is suppose to be Charlie's kid born after his death wouldn't that put them being 19 or 20 call me dumb but by then you should be out of school. This movie is just so awful really don't waste your time watching it. Don't bother reading the \"Fake positive reviews\" Because shows people don't know true horror movies.<br><br>I always said a horror movie doesn't always need blood, gore, nudity etc long as it has a great story behind it a story that does not leave more questions then answers. This movie lacks that as you get more questions then you do answers. Found Footage movies should either go away or be made to look better then this bs! So i give this movie a F actually it is so bad it really doesn't deserve a grade","user":"xxitalianbabezxx","rank":[30,43]}]