[{"title":"Space geeks will envy the rip-roaring adventures in this movie","rating":7,"date":"31 May 2013","review":"I was pleasantly surprised to see that the plot was simpler than I imagined. Before I watched the movie, the title made me cringe, suggesting that it was about teenagers battling aliens in a cheesy rampage through outer space. Clearly, I was wrong to judge a movie by its poster. \"Space Warriors\" is a fun and unexpectedly down-to-earth film for all ages.<br><br>Jimmy Hawkins (Thomas Horn, \"Extremely Loud and Incredibly Close\"), the son of a retired NASA astronaut, is a complete astronomy geek. His dream is to go to space, and the opportunity arises in the form of Space Camp, where teams can compete for the chance to go to space. His parents, played by Dermot Mulroney and Mira Sorvino, forbid him to join Space Camp fearing for his safety, but Jimmy joins anyway. At Space Camp he meets the brightest, nerdiest group of astronomy-lovers, called Space Warriors. They have to learn to work together as a team not only to win the competition, but to save the lives of three astronauts along the way as well.<br><br>Colonel Manley (Josh Lucas), one of the commanders at Space Camp, is one of my favorite characters – he's witty and smart with just a touch of dry humor and sarcasm. Sean McNamara (\"Soul Surfer\") is the director of \"Space Warriors.\" Along the same lines of \"Soul Surfer,\" this movie has many great themes that include teamwork, leadership, overcoming fear, thinking outside the box, making wise choices and most importantly, it shines a positive light on youth. The Space Warriors don't let anyone look down on them because of their age – they prove to the entire world that age doesn't matter as long as you have passion, a love of discovering, and an open mind.<br><br>The movie incorporates footage from history in outer space and was shot on-location at the Space Camp in Alabama. For science-lovers, this movie is the ultimate \"Easter egg\" hunt, where geeks will want to shout and announce to other viewers, \"That's the actual footage of landing on the moon!\" or \"I've been on a moon-gravity simulator just like that!\" I found myself thinking that if I could go to a Space Camp that looks even half as fun as the one in the movie, it'd be the best summer of my life. I recommend this movie for all ages, especially for aspiring scientists. I give it four out of five stars. \"Space Warriors\" will inspire viewers to look up and rekindle an excitement for learning about the unknown universe of space. Learn more about a world outside our own that we've barely begun to discover. <br><br>Reviewed by KIDS FIRST! Film Critic Cassandra H. Watch her video review at kidsfirst.org","user":"rannynm","rank":[34,51]},{"title":"Are you kidding?","rating":1,"date":"4 August 2013","review":"The acting is some of the worst ever. Its as if there were no auditioning for the child parts. Why in the world would a child actor be given a role and have to create a weird southern accent? Aside from that, the plot was based around totally incompetent adult characters who had no clue what to do with a disabled space station. The main character narrating as if the space camp was in the past for no apparent reason was bizarre. All of this is such a shame because there were some other good actors in the movie. I rented this movie for a family movie night and when kids watching the movie laugh at the cheesy nonsense and mock the terrible acting, it has to be bad.","user":"wpdurrell","rank":[25,42]},{"title":"it is childish fun, inspirational for children.","rating":7,"date":"29 August 2013","review":"This film is obviously not for adults who can think. but i am sure that it is good entertainment for children or teens.<br><br>the storyline is weak, and there is no way in real life that children will actually take over shuttle's operation. but it is inspiration for children who watch this film, they might be motivated to become an astronaut in the future.<br><br>sometimes, due to its childish plot, it is very apparent that those people were acting.<br><br>actor thomas kasp is a good discovery, he is way better looking than zac efron, but he may not become famous due to this low rating film.<br><br>Overall, I enjoyed watching it. You will, too; as long as you don't take it too seriously.","user":"Hunky Stud","rank":[14,22]}]