[{"title":"Initially promising, this film soon feels like it's punishing its audience - and itself - for its bad behaviour.","rating":4,"date":"10 July 2014","review":"Somewhere in this tangled mess of debauchery and off-kilter, almost deliberately offensive humour is a decent movie. At its best and most promising, Behaving Badly plays like an ultra-quirky, purposefully black-hearted look at the standard coming-of-age tale we've seen too many times before. But it never really knows when to dial back its strange and frequently off-putting humour, resulting in a film that frustrates as much as it amuses.<br><br>Rick (Nat Wolff) is a self-absorbed, close to morally degenerate teenager growing up in a complicated household: his boozed-up mom Lucy (Mary Louise Parker) is barely coherent from day to day, and his deadbeat dad Joseph (Cary Elwes) only stays married to avoid paying alimony. Even as he navigates a huge crush on Nina (Selena Gómez), the school's resident goody-two-shoes, he embarks on an ill-advised affair with the sexually voracious Pamela (Elisabeth Shue), mom to his strange best friend Billy (Lachlan Buchanan).<br><br>The film is every bit as complicated and filthy as its title suggests, its characters dealing in drugs, alcohol and sex with next to no moral compunction. Actually, that's not its problem. These scenes are riddled with a grim humour, and work best when played loudly and ridiculously - as they frequently are. And so there are moments when Rick receives counselling from Saint Lola, the patron saint of aimless teenagers (played in a neat Oedipal twist by Parker); or when he must cut a deal with slimy strip-club boss Jimmy (Dylan McDermott) to score backstage passes for a Josh Groban concert. The film is almost brave in how determinedly it sinks into the most depraved of narrative depths.<br><br>But it's hard to shake the feeling that writer-director Tim Garrick lets his own crazy creation get the best of him. He packs the film with knowing, self-aware touches - Rick frequently speaks straight to the camera, as the title character did in iconic teen flick Ferris Bueller's Day Off - but achieves very little in the way of emotional payoff and insight. As a result, when his deliberately peculiar film heads down the road to redemption, it pretty much collapses on itself. It's hard to believe in any of Garrick's characters making good, when they've otherwise been portrayed as so horribly bad that they barely register as real human beings.<br><br>At least Garrick's cast seems to be in on the joke. Wolff is an affable if somewhat opaque lead, largely outshone by Buchanan (delightfully weird) and the adult actors - all of whom seem to be only too pleased to have been let off the leash and told to behave, well, pretty much as badly as they like. Parker, Shue and McDermott, in particular, play the taboo-happy comedy with relish, committing so fearfully to their parts that watching them in action becomes part of the joy of the film.<br><br>It's unfortunate, then, that they're doing such good work in so awkward a movie. Behaving Badly is not for the faint of heart or morally conservative, for a start. But even those who are willing to take a walk on the wild side with their teen raunch-coms will find themselves disappointed by the film, which flirts tantalisingly with the dark side but winds up being both too strange and too predictable to really work in the end.","user":"shawneofthedead","rank":[24,35]},{"title":"Offensive, disgusting and ridiculous, I f**king loved it!","rating":9,"date":"4 September 2014","review":"That's right I gave it a frickin 9! I read the other reviews and I'm guessing they're all 16, and don't seem to know what they're talking about. I'm an 80s baby, we made this genre. <br><br>First off, who gives a s**t about Selena Gomez, she was a footnote in this movie and the least entertaining part. Second of all, 95% of the raunchy teen movies are about the same thing, kids acting out, but in this one it's the kids who are the responsible ones and the adults that are truly f**ked. That's where this idea is original. Sure there's some first-person p.o.v. stuff, slightly unnecessary and beside the point but, it was only because Morgan Freeman wasn't available to explain the mayhem of the twisted plot and somebody had to.<br><br>The cameos were awesome. Seeing Jason Lee and Patrick Warbutton beyond the boundaries of a PG rating was refreshing and reminded me why I loved them and they were just the tip of the filthy iceberg; Cary Elwes made me laugh as soon as he opened his mouth, I've had a crush on Elizabeth Shue since Back to the Future and probably will until she's at least 80 this movie made sure of it, Dylan McDermott brought stuff to the table I didn't know he had, apparently Heather Graham is still hot and don't even get me started on Mary-Louise Parker...awesome.<br><br>So if you're like me and love dirty, dark, raunchy comedies that have the balls to say it, you'll love this and wish more movies were like it. This movie is definitely not for kids even though it's starring a few so wait till they're in bed and enjoy!","user":"davidnhewko","rank":[24,41]},{"title":"Holy three .. times two!","rating":6,"date":"26 September 2014","review":"The movie itself might not have made it over a 4 or a 5 rating, if it weren't for the cast! I mean Mary Louise Parker, Heather Graham and Elisabeth Shue (!) on one side ... Cary Elwes, Dylan McDermott and Jason Lee on the other. Oh and a bonus Gary Busey just for good measure. I was almost blown away just seeing those guys on screen (some in different roles).<br><br>Our main protagonist could've used a bit more ... a bit more everything actually. While the talking fast and making quick jokes does work in the movies favor most of the time, it might get tiresome for most pretty quickly. Still the script must have had something (or the producer/casting director had good connections) to attract all that talent to be involved with this. Oh yeah Selena Gomez is in this too - in case you love/hate her, therefor watch everything/nothing she's in ... A bit premature and juvenile (maybe more than a bit), this still can be entertaining at times","user":"kosmasp","rank":[9,13]}]