[{"title":"Into the Wild with Reese Witherspoon","rating":8,"date":"20 May 2015","review":"A wonderful performance from Reese Witherspoon anchors this very good film about a troubled young woman who embarks on a miles-long hike as a sort of personal therapy to deal with the downward spiral of her life in the wake of her mother's (Laura Dern) death. Witherspoon reminds everyone what a good actress she is; I haven't been this impressed by her as an actress since \"Election\" way back in 1999 (and that includes her overrated Oscar-winning performance in \"Walk the Line\"). And it's nice to see Laura Dern again, who's popped up here and there over the past many years but has mostly been absent from the movie scene. The movie's editor deftly integrates flashbacks of Dern and Witherspoon together with the character's hike through the wild, and avoids the monotony that usually plagues films when structured this way.<br><br>One of the minor miracles of \"Wild\" is how subtly it explores not just the trials and dangers one would encounter in such a hike, but specifically how those trials and dangers are heightened, or at least are of a different nature, for a woman. Only once in the film is it overtly addressed, but before that scene late in the film, the director and Witherspoon have already conveyed without words how perilous such an adventure could be for a young woman, for whom every encounter with a strange man carries with it the possibility of sexual predation, even if it doesn't materialize (which, the film acknowledges, in most cases it doesn't). At the same time, the film restores one's faith a little bit in humanity, suggesting that most people are decent and kind and willing to help, no strings attached.<br><br>Witherspoon and Dern were both justly Oscar nominated for their performances, and the gorgeous Pacific West scenery deserved an award of its own.<br><br>Grade: A","user":"evanston_dad","rank":[66,80]},{"title":"The long and winding road","rating":10,"date":"23 February 2015","review":"I am the daughter of a mother who recently passed away from lung cancer. She never smoked, like the protagonist mother. I cried many times during this movie. It made me think a lot because like the lead character, i often ruminate over the past; i have a lot of flashbacks and memories of my mother keep replaying in my head., and the things she said to me will forever echo in my brain. In terms of the sex and the drug taking, i think Resse did very well in portraying the daughter who completely lost herself and the desire to live with the loss of her mother. I also grew up in a single household and my mother and I were always together, our identity are intertwined; it was us against the world. Losing our mother is like losing more than life itself, I am still finding myself lost and struggling to find meaning in life. It is a constant struggle to not give up and give into self destruction and I am very thankful that the protagonist captured this feeling very well.<br><br>Like the life of a lot of people, this movie is about the journey we take. Its not about the destination or achieving a particular purpose. It is deeply realistic, and i am glad it doesn't lecture or give a moral lesson on how we should be ,or a happy ending because we don't always get that in life. Life is ugly and it doesn't always end in happiness and things don't always happen for a reason good people do not always get a good ending and normal people can do bad things to themselves and to toh others due to pain brought on by unbearable grief. This movie inspires me to maybe run a marathon.<br><br>Walking, hiding and running are very meditative and its like a metaphor for life, no matter what happened, all we can do is keep walking.","user":"caseyyau","rank":[73,95]},{"title":"I Don't Care What They Say...I Really Liked This Movie!","rating":7,"date":"28 February 2015","review":"I am really surprised at all of the negative reviews here. But then I remember, this is IMDb. Enough said there. I enjoyed this movie very much. I don't think it was anything more than the story of one woman trying to find a way to move forward. This movie is not a political statement about feminism. This is ONE woman's story of regret, healing, and ultimately about forgiving herself so that she could move forward. Is this movie boring? Only if you need CGI and superheroes to call it \"exciting.\" Do people do really adventurous things like taking off alone on a thousand mile trek on foot? Yeah, they do. And most of them actually survive. People have been surviving for thousands of years by striking out on their own without any previous experience or \"training.\" Many years ago I did something very similar to what this woman did in the Sierra Nevadas. Looking back now I know I must have been crazy to do something so unplanned. But it was something I felt I had to do and was also stemmed from a tragic loss. I thought Reese was very believable in this role. The constant flashbacks that seemed to bother all the other reviewers did not bother me in the least. The flashbacks were the unfolding of her life taken in little pieces and in sync with the memories that were ignited within her on her journey. So contrary to the other reviewers, I liked this movie! The soundtrack was right on target with what was happening in each scene. The scenery was stunning, but of course it would be if you've ever been in the area. On foot. I happily gave this movie a rating of 7 out of 10.","user":"regalosdelsol","rank":[157,213]}]