[{"title":"Completely surprised","rating":9,"date":"8 May 2013","review":"I am completely surprised at some of the low ratings and remarks concerning this movie. My daughter and I just watched it. I hate horrors because I have nightmares all night long after watching one. I stick to the suspense and thrillers. I had reservations about this movie after reading the makers of this also made paranormal activity which I watched and found utterly cheesy. Just my own personal opinion. But this movie I really enjoyed. It kept me on the edge of my seat with my hands at the ready to slap across my eyes. I love a well made alien encounter movie and this movie did it for me. Lots of jumping moments, lots of edge of the seat suspense. I did not walk away feeling like I should have spent my money on something else!","user":"ladyfalcon001","rank":[143,178]},{"title":"One of the Most Underrated Sci-Fi Flicks Ever!!!","rating":9,"date":"6 February 2019","review":"This is a fabulous movie with a lot of twists and turns. A great cast and a sensational and very freaky story. I am a connoisseur of alien movies and this is one of the best and deserves a sequel!","user":"tbradfor","rank":[14,15]},{"title":"Slow building nightmare","rating":7,"date":"3 March 2013","review":"Being a fan of supernatural, science fiction movies such as Fire In The Sky, The Forgotten, Close Encounters Of The Third Kind, Knowing, The Arrival, Contact, Night Skies etcetera I had high hopes for Dark Skies. The result was a better than average genre mash up that borrows elements from the best including my all time favorite horror film Poltergeist. The story was gripping that involves a suburban family that we instantly relate to and care about, making the chilling events that follow effective and downright surreal. The film takes an old-school approach when it comes to developing the story and characters and delivering the frights, which might be too much of a slow burn for fans of fast paced horror flicks. I happen to like how the film took its time delivering the details and made it a suspenseful and mind boggling watch even if it raises more questions than answers. In real life though, there is events out there that were can't explain or have answers for, which makes this quote even the more true that showed at the beginning of this film: \"Two possibilities exist: either we are alone in the Universe, or we are not. Both are equally terrifying.\" — Arthur C. Clarke <br><br>The performances hit it home for me even though it wasn't always as emotionally powerful as it should have been. Keri Russell isn't in enough movies as she should be, but when she does make a movie her performances are always genuine and for surprisingly her horror film, this role fits like a glove and gives a raw and layered performance. Keri plays wife and mother of two boys Lacy Barrett, who is a struggling realtor trying to make ends meet while her husband Daniel Barrett played effortlessly by Josh Hamilton, tries desperately to find a better job to support their family. Right away their peaceful suburban life is turned upside down when they become under attack by strange supernatural forces. The child stars of this film were also impressive. Dakota Goyo and Kadan Rockett give natural and unflinching performances as the sons Jesse Barrett and Sam Barrett, who are just as confused and terrified of the strange events as their parents, but also show their own coming of age story on the side. J.K. Simmons gives a standout performance as Edwin Pollard, a man that the parents turn to for help as he knows exactly what they are going through, for he has dealt with the presence for some time. His role could of gone on the silly side but it was handled with such seriousness that you to will be on the edge of your seat with his accusations.<br><br>Director and writer, Scott Stewart delivers a nice change of pace and more of a restraint here compared to his other films Legion, which I was one of the few that actually enjoyed it and Priest, which I haven't seen yet but want to soon. This type of style seems to be more of his niche and has a more plausible approach even if he doesn't have answers for but that's fine because in real life we don't as well. I like that he went with mood, suspense, characters and story over cheap scares, over use of CGI and gore which makes the film have an old-school vibe which brought me back to horror movies of the past like Poltergeist mixed with The X-Files, Close Encounters Of The Third Kind and Signs for instance. The Fact that he waits until the end to reveal the creepy beings make you sit in constant suspense, even though they could of done a much better job with their digital appearance and gone with more natural FX to make the reveal all the more terrifyingly effective. It could of been worse though so it was fine; the ending leaves you on a cliffhanger and has possibilities of a sequel in the future that I'm very intrigued by and hope they go through with one.<br><br>Overall, another horror movie out of left field that is way better than what most critics make it out to be. It's a shame that not a whole lot of people went to go see it, as it might be the more decent horror films of the year, so far at least. If you like slow burn horror movies with suspense, you will probably enjoy this but don't expect a whole lot of action or scares just a slow building nightmare.","user":"mdnobles19","rank":[74,96]}]