[{"title":"Couldn't Get Enough","rating":8,"date":"28 October 2013","review":"My wife and I (in our 50s) went to see this with my parents (75 and 80). Mom was sorry to see it end. Yes, this is a movie that will appeal to an older crowd, especially if you have children or are divorced, and it's unfortunate that the younger sect will likely ignore it. It presents a very accurate perspective on parenting, especially as a divorced couple, and relationships at an older age. The dialog and portrayals of events/situations was very realistic and interesting enough to hold my attention.<br><br>It would benefit each generation to see movies that realistically address a different generation, to give us all a better perspective of life in general. I personally think I'd have enjoyed this movie even in my 20s, but in my 50s, I loved it. So did those in attendance with me. Makes you a little sad to know James G. won't be around to do more work of this quality.","user":"jordan2240","rank":[106,120]},{"title":"Most realistic dialog I've heard in ages","rating":8,"date":"9 December 2013","review":"I saw this movie this past weekend, when it FINALLY made it to a local theater. The fact that I found a lot of kinship with Julia Louis Dreyfus' character helped push it up a notch or two. Like her character, I'm a divorcée, and my only child, a boy, went off to college this past August. Fortunately, I'm not as needy, and would never think of inviting one of his (younger) friends to live with me after he went off to school. :-) All in all, very realistic dialog (it's not easy dating in your 40s/50s), and I think this captured an empty-nester's mindset very well. Great acting by all, but James Galdofini's performance as Albert was charming and bittersweet.","user":"divinemsh","rank":[61,69]},{"title":"I enjoyed it but the most depressing and real romantic comedy I have ever seen. R.I.P. Mr. Gandolfini. I give it a B.","rating":7,"date":"3 November 2013","review":"\"I've been listening to this woman say the worst things about the guy I'm starting to really like.\" Eva (Louis-Dreyfus) is a masseuse and a single parent who is tired of being single. When she meets Albert (Gandolfini) at a party she is surprised when he asks her out. She has a few dates with him and begins to really like him and tells her new client about him and the client begins to bash her ex-husband. When Eva realizes they are talking about the same guy she is torn as to what to do. I was interested in watching this because my two favorite TV shows ever are Seinfeld and The Sopranos. I also went in a little depressed because being a huge Gandolfini fan I was saddened at his passing and knowing this was his last movie made it a little bittersweet. All that out of the way I have to say that I did like this movie but it is not a typical romantic comedy. Most movie like this are light, mostly fluff and leave you feeling happy. When this ended I felt sad and depressed. Some of it had to do with Gandolfini and some with the movie itself. While this is still a romantic comedy it is very real and that added to the sadness. I'm not saying not to watch this because I did like it but don't expect to have a super happy time watching it. Overall, good and worth watching but the saddest romantic comedy I have ever seen. I give it a B.","user":"cosmo_tiger","rank":[28,31]}]