[{"title":"Get out the word!","rating":10,"date":"31 May 2014","review":"Fed Up highlights sleazy lobbying efforts of the food industry and describes simple actions our government could take to alleviate the obesity epidemic. Even Michelle Obama was distracted by the industry. Perhaps with the prodding of this movie production, Michelle O. has more recently started to get back on track with making dietary changes in our schools.<br><br>Will our government move in the right direction? Only with a strong grass roots effort to counteract the industry. Fed Up gives us the tools. The People enacted change upon the tobacco industry. We can do it again for food!<br><br>Warning: Don't see this movie if you're happy with the status quo, a shorter, lower quality of life, and don't mind paying even more for health care.","user":"junkmail-385","rank":[40,52]},{"title":"An important film that doesn't try to \"sugar coat\" the problem","rating":8,"date":"24 May 2014","review":"If you pay attention to nutrition labels on the food products you buy, you may notice that next to the number of grams of sugar, there is no percentage shown. The sugar industry made sure of that. What they don't want consumers to know is that the sugar content of many of their products is 100% or more of the average daily requirement. Stephanie Soechtig excoriates the sugar industry for valuing profits over health in her hard-hitting documentary Fed Up. Produced by Katie Couric, who is also the narrator and Laurie David, producer of the climate-change documentary An Inconvenient Truth, the film compares awareness of the true causes of obesity to the decade's long campaign informing the public about the danger of smoking cigarettes.<br><br>Though individual choice does play a part, Fed Up says that the main problem is not the lack of will power of the individual but the fact that people have become addicted to sugar. According to Soechtig, collusion between the food industry, Congress and the U.S. Department of Agriculture has led to fierce opposition to regulation, government subsidies to farmers for their corn (which has been turned into high fructose corn syrup), unhealthy school lunch programs (80% have contracts with Coke or Pepsi), and relentless advertising campaigns directed towards children.<br><br>Bolstered by interviews with former President Bill Clinton, author Michael Pollan, and Senator Tom Harkin together with a bevy of medical researchers, the film cites statistics showing that 80% of the approximately 600,000 products sold in the supermarkets and convenience stores have added sugar and that, since the late 1970s, Americans have doubled their daily consumption of sugar so that now, one in every five people face obesity. It is estimated by the Environmental Working Group (EWG) that in one year, kids eat more than 10 pounds of sugar by weight from breakfast cereal.<br><br>Using charts and graphs, Soechtig also shows that the amount of sugar the industry has added to food to compensate for the unappealing taste of low-fat products has contributed to the increase in Type II diabetes such that by the year 2050, it is predicted that one out of three Americans will be diabetic. The film makes the problem even more real by focusing on several teenagers who have struggled with their weight for many years, emphatically pointing out the error of the conventional wisdom which says that eating less and exercising more (striking a balance between calories in and calories out), is the best solution.<br><br>Sparing no one including Michelle Obama, the film notes that her \"Let's Move\" campaign has been co-opted by the food industry and the responsibility for obesity placed on the individual. While Fed Up is definitely an advocacy doc and is typically one-sided (representatives of the food industry refused to be interviewed), it is an important film that doesn't try to \"sugar coat\" the problem but asks us to become involved by seeking an alternative to sugar-laden products, putting pressure on government and industry representatives, and demanding that the food industry begin caring about the health of our children. Now wouldn't that be sweet?","user":"howard.schumann","rank":[43,57]},{"title":"This should be required viewing for all schools, doctors, and nutritionists","rating":8,"date":"20 May 2014","review":"Overall excellent documentary that everyone could benefit from. The trailer covers a lot of the main spoiler points (added sugar and refined flour is bad, etc) but the movie delves in deeper and shows the politics going on to make sure that no matter what bad news is discovered about sugar, processed food companies will make sure you somehow consume even more. The movie points out what affects the bottom line for food companies is sales and growth, not health. The movie also showed some very interesting concepts about our fascination with exercise and counting calories. Our modern world is exposed to all kinds of manipulative marketing that feeds into what nutritionists and doctors tell patients. The movie tragically showed how well meaning parents thought that their processed food diets were healthy even though their kids were obese. The movie points out that nothing will change until people stop believing popular marketing and switch from processed foods to whole, fresh foods without all the chemicals, additives, and sugar. I would not be surprised if years from now we will look back on the sugar industry with the same horror as the tobacco industry, and hope that we do something about this before many more people develop unnecessary health issues. <br><br>I wish the story ended with a few more encouraging stories of people who kicked the sugar habit. Instead, I kind of felt like we were left hanging. I really enjoyed learning about the politics behind food marketing. There were also some parts of the movie that were slower going, hence only 8 out of 10.","user":"michellelcalvert","rank":[30,41]}]