[{"title":"Incredibly heartfelt","rating":26,"date":"26 May 2017","review":"It's easy to dismiss an animated film like this that deals with the themes that this does. The film's quality, however, goes a long way towards making us realize that running time doesn't dictate how good something is. This film is short, but it packs a punch. One of its biggest strengths is that it doesn't try to fill up the running time or try to do many other turns in the storyline. It's very, very simply but as a result its themes are clearer than many other animated films' themes. It's handled with delicacy and subtlety. It's an incredibly strong film that I recommend.","user":"Red_Identity","rank":[43,45]},{"title":"Mature take on youth that still keeps a child-like tone","rating":10,"date":"24 July 2017","review":"My Life as a Zucchini was nominated for Best Feature Film at the 89th Academy Awards. And for a 70 minute feature, that says a lot. This French-Swiss stop-motion animation film takes on a mature content but never fails to keep its child-like tone and to an extent, its innocence.<br><br>It follows the story of Icare (but prefers to be called Zucchini), who lives with his alcoholic mother. After an accident, Zucchini has been sent to an orphanage by a policeman named Raymond. Zucchini's start at the orphanage is rough—thanks to the Simon, the bully. From there on, we are immersed into Zucchini's adventures as he learns of friendship, of family and of love.<br><br>This animated film ravel with its wonderful visuals that reminds us of the days when its was toys over tablets. In a way, this serves as a nostalgic treat for teenagers. Almost every scene carries a powerful meaning. But its greatest feat is looking at the lives of these children through a different lens—they are all abandoned, damaged or broken. One has her mom deported, the other has his father jailed— these are all mature themes but nevertheless, real.<br><br>But despite all that, Zucchini and his crew are all still children. They play, they dance, they sing. The film never stops to carry this child-like tone. The colorful aesthetics are impactful and an array of vibrancy spreads across the screen. It is a brave film that looks at life at an emotional depth. It's an eye-opening experience.","user":"kayan-15460","rank":[22,23]},{"title":"A story of caring and sentiment without being sentimental.","rating":13,"date":"13 March 2017","review":"\"Many people, for many reasons, feel rootless - but orphans and abandoned or abused children have particular cause.\" Christina Baker Kline<br><br>Stories about orphans such as Dickens' Oliver Twist have a special place--they remind us of what a gift family is. Having loving parents and siblings provides safe haven from hunger of the stomach and the heart. Claude Barras' moving stop- motion animation, My Life as a Zucchini, explores the plight of seven young orphans with emphasis on Zucchini, a name given to him by his drunken mother.<br><br>As he goes off to an orphanage, he discovers more challenges than being with his mom, whose memory he keeps by carrying around one of her discarded beer cans. The usual bully (Simon) is in residence along with some meek kids and with Camille, a saucy ten year old ready to take on Simon's cynicism and Zucchini's love.<br><br>As you can tell by the entrance of Camille, all is not lost at this homeless haven, much less the emerging sense of cooperation and compassion. The film gently approaches each major crisis with equanimity, relying not on easy solutions or catastrophes but on the emerging sense of cooperation and sincere love.<br><br>It's difficult to determine what makes this animation so human with its characters and their eccentricities; all I know is that I felt deeply about each orphan right down to the wicked aunt. It's not sentimental, mind you, just powerfully humane and deserving its Oscar nomination for best animation.<br><br>Could it be the Keane-like big eyes, so expressively alive with emotion? Possibly so. At any rate, this animation will appeal to all ages and answer some age-old questions about the depth of loneliness and the salvation adoption can bring.<br><br>\"Orphanages are the only places that ever left me feeling empty and full at the same time.\" John M. Simmons","user":"jdesando","rank":[23,28]}]