[{"title":"Seems there is an apocalypse, but the blabbering just goes on ..","rating":4,"date":"28 May 2014","review":"If I ever have to go through an apocalypse during my brief existence here on earth, I hope it's one that takes the form as shown here in \"Goodbye World\". The apocalypse, which was triggered by a rapidly spreading virus in a text message, looks pretty harmless. A few fragments of a panicking and rebellious population. Actually these are images that we get to see everyday in the media. In the distance you can see a huge cloud of smoke. Then two lost soldiers show up who supposedly want to set up a base camp and there is a commune in the vicinity who claim the right to get some medicines. It's rather the relationships between the key players that are apocalyptic. It looks like this movie is the final year assignment from \"The Philosophers\" , applied in practice.<br><br>\"Goodbye World\" is actually about a reunion of some 30'ers who grew up together but eventually went their own way over time. James (Adrian Grenier) and Lilly (Kerry Bishe) are two modern hippies who anticipated that such a global catastrophe would happen and have withdrawn themselves, along with their lovely daughter Hannah, somewhere in the mountains and build a kind of eco-house. An ordinary house with enough stock, medicine, horticulture and energy facilities. The day that the text message \"Goodbye World\" is sent around the world and a global cyber attack begins so all telephone communications, data communications and electricity supplies fail, Nick (Ben McKenzie) and Becky (Caroline Dhavernas) arrive. Nick is a former business associate of James and had a relationship with Lilly in the past. They also welcome the following old friends : Benji, a radical who did some time in prison for arson and in the meantime gives spirited lectures, Ariel (a sort of groupie of Benji) accompanies him, Laura is an associate in politics and apparently had a sex scandal with some senator and Lev is an intellectual computer expert who could well be the cause of this global cyber attack.<br><br>Everything starts in a relaxed and friendly way. It looks like an ordinary reunion with quite a bit of drinking during dinner, while raking up old memories. Also, it seems as if they are constantly making use of the home-grown marijuana out of the greenhouse. At times it seems like everyone is looking high after smoking cannabis. After a while tempers start to rise and the mutual conversations become snappy and razor sharp. Everyone is starting to realize that the other changed over time in a certain way and the opinions are no longer synchronized. Eventually we end up in a cacophony of endless drivel and philosophizing about political opinions and personal issues. I found it strange that despite the fact that there is apparently a society falling apart, a motorcycle gang has taken over the local grocery store and charge abnormally high prices, plus two soldiers show up waving their weapons frightfully around and use threatening language, they nevertheless spend their time in a hot tub in the garden and chat about the growth of hair on a testicle. The apocalypse that is going on at that time, suddenly seems a banal and trivial event. I could not get rid of the impression that a cyber attack will not be the cause of our world going down, but rather the terrible navel-gazing and the enlargement of personal issues of some narcissistic individuals will do it.<br><br>\"Goodbye World\" is roughly not more than a boring movie with lots of discussions and a conflict that is more situated in the restricted group than in society itself. There is a grand total of five minutes of action in the whole movie, so little toothpicks for the eyes can be useful and necessary.<br><br>More reviews at http://opinion-as-a-moviefreak.blogspot.be/","user":"peterp-450-298716","rank":[36,43]},{"title":"Possibly the most contrived, painful-to-view movies I've ever seen","rating":1,"date":"10 August 2014","review":"Truly terrible. I have no idea how anyone is rating this 9 or 10 stars. The concept is awesome, the acting is good, the production is flawless....but the dialogue is so cliché and predictable and forced and contrived, it's unbearable. Not to mention this is a story about the meltdown of civilization (that's the setting) but there's nothing about the meltdown of civilization in it. Literally. It's just some people hanging out in a cabin in the woods reliving past drama and bullshit. The fact that the world is crumbling outside of their bubble is a total non- factor in the entire film. I rarely wish I hadn't spent my time watching a movie, but this is one of the few. I want my time back.","user":"dwightware4","rank":[42,62]},{"title":"Excruciatingly dull and vapid film that tries to be unique","rating":5,"date":"15 May 2014","review":"The best thing I can say about Goodbye World is that it is trying to be different and I can't fault a film for that when we have so much of the same thing being regurgitated. As a novel (I'm not sure if this is based on one or not) I think this would be great because over the course of a nice long book it could do a much better job of establishing the characters. In the film you have a group of very unlikable, incredibly shallow, stoner idiots who aren't doing much of anything. They try to weave a mystery about who caused the apocalypse but essentially they're trying to create this coming of age/reunion/Big Chill type vibe with a background set at the end of the world. This might have almost been better without the apocalypse because really it doesn't play a part in the story at all. It doesn't even matter to this group of idiots. Why they chose to put a little girl in the film (who vanishes and is absent from the latter half of the film) is beyond me. Her parents and all their childhood friends are drug using, alcoholic idiots who find no redemption in this disaster. I did some potential in some of the story arcs but they spend so much time building up nothing that by the time the story comes out in the end its too far gone.<br><br>I do think the cast is talented but I don't think the script gives them much. Its a big cast but the characters are really awful people and hard to watch. Adrian Grenier is perpetually brooding, angry and slamming things around and never gets to impress leading the cast. Ben McKenzie, who I have always been a fan of, is decent in his role and has a few good scenes but I wanted to see more of the interaction between Grenier and him because I think there could have been a lot of story there. Kerry Bishe is probably the best of the girls but she spends so much time getting high and acting like a 14 year old girl that I begin to understand Grenier's constant anger at the world. Caroline Dhavernas doesn't really get any good moments until nearly the end of the film. Honestly most of the cast doesn't really impress until the last fifteen minutes. In fact the last fifteen minutes of this film are the best. Suddenly we see what this movie should and could have been but instead we have to sit through an hour plus of this group of people sitting around wasting their lives. Gaby Hoffman, Remy Nozik, Mark Webber, and Scott Mescudi are nearly completely wasted in the film and are nothing short of pointless. Hoffman gets her best scene in the end and her character could have been actually a focus of the story.<br><br>Essentially there is a good idea here buried under an extremely poor script, poor direction, poor editing and even worse character development. Denis Hennelly proves my point that I always say about a director doing his own screenplay. He has little experience behind the camera and his writing needs a lot of work too. It was really bizarre because up until the last twenty minutes of this film I would have probably given it a 2 or less but then all of it comes together and culminates in some really great, intense and emotional scenes but the apocalypse still has very little purpose to this. This could have made a great TV Series as well but there just simply wasn't enough time and effort put into this to make it worthwhile. It ends up being a total miss and even the last scenes aren't worth forcing yourself through this indie dud. 5/10","user":"Robert_duder","rank":[20,27]}]