[{"title":"I want to see more movies like this one.","rating":9,"date":"19 April 2014","review":"I love films that are about people as opposed to films where there is a lot of action. So, while the public often flocks to blockbusters with huge budgets and explosions, I am often more happy seeing a much quieter style of film—one where the characters are the center of the film. This doesn't make me right or wrong—it's just the sorts of films I usually prefer. For example, after seeing the most recent Oscar-nominees for Best Picture, one of my very favorites was \"Nebraska\" and I much preferred it to most of the action-packed and star-studded films running against it. Because of my tastes in films, Small Time is pretty much exactly the sort of movie for me—and it may just be that way for you if you're looking for an interesting story about seemingly normal folks.<br><br>Christopher Meloni (of \"Law &amp; Order SVU\" and \"True Blood\" fame) stars as Al Klein—a divorced used car salesman whose ethics are extremely limited to say the least! He and his partner, Ash (Dean Norris), will say almost anything to close a sale and they are good at what they do. A big surprise comes to Al, however, when his son, Freddy (Devon Bostick), graduates. Instead of going off to college at Cal Poly (one of the top schools in the country), Freddy announces that he wants to move in with dad and go to work with him selling cars. At first this seems wonderful —father and son together and doing what Al loves most. But, as time passes, the awkward son starts to become more and more like his dad—and perhaps even better when it comes to selling cars. This change in Freddy causes an emotional crisis for Al. Does he really want the kid to be a chip off the old block?!<br><br>This is a wonderful character-driven story. Through the course of the film, Meloni's character grows—but not in a way that is unrealistic or contrived. And, most importantly, it is not a HUGE change—but a reasonable change. Meloni and the rest of the cast are great—and Meloni proves he's not just good on television but as a movie actor as well. I loved Bostick's performance almost as much as Meloni's and there were also a lot of nice supporting characters that give the film wonderful depth and humor (the opening scene with the young car thief is amazingly clever and made me smile). While this isn't a comedy exactly, some parts are funny and some of it is quite poignant. This film should be a huge boost to the career of Joel Surnow. While Surnow has written a quite a few scripts before this (mostly for TV—such as \"24\" and the amazingly overlooked \"Nowhere Man\") and has a few producer credits, here he also gets a chance to direct as well as write the story—and he did a great job with both. <br><br>This film would make an excellent date night. Women seem to really like Meloni and the film has a lot for the guys as well. Intelligent and well worth your time.","user":"MartinHafer","rank":[40,48]},{"title":"Closing...I mean Closure","rating":7,"date":"18 April 2014","review":"When you watch a movie, often times you build positive and negative off of expectations. If you go to see this movie, enjoy it for what it is.<br><br>'Small Time' is a relaxing movie that surprised me. Al Klein (Christopher Meloni), used car salesman, allows his son, Freddy (Devon Bostick) to work on his lot selling cars rather than go to college. Freddy is a natural, but is it what he should be doing with his life?<br><br>This is a story about closure, but the problem with talking about closure is, it would be just spoilers.<br><br>In life, we have to make choices and of course live with those choices; but some times it is hard, even 10 years later to accept what seemed like the best thing to do. We often lived trapped by those decisions, unable to move on.<br><br>Director and writer Joel Surnow, who has worked in television prolifically, used a succinct and condensed writing style that is often lost in movies. In cinema everything is drawn out, rushed, then drawn out between scenes of random events to show the director's 'artistic' capability.<br><br>Just about everything said in 'Small Time' had a point and added to the story; this story, each character had depth, history, feelings. Or, in the other words, 'The writing and the dialogue was good and I liked it' (and as a writer myself, I tend to hate more than I like).<br><br>There was psychology to these characters, thoughts in their heads. I was genuinely impressed. I could talk about the acting, but I felt the three main roles played by Meloni, Norris (breaking bad fame), and Bostick (older brother from Diary of a wimpy kid) were done professionally. Three capable actors, what else would you expect? <br><br>Now, some people might not find enough drama in this film to enjoy it. We are so conditioned to seeing murders and affairs and fights and violence in dramas, we don't know what to do without it. All I can say is, as a person who values his time, I did not feel robbed by this movie and I could appreciate the story and the characters.","user":"pcrawake","rank":[35,46]},{"title":"The story of a Father seen through no longer filtered eyes of the Son.","rating":7,"date":"20 April 2014","review":"Down in the valley you always find the used car dealers; Look around they are there, where the long drives intersect. This movie is not really about the used car industry, or even the valley's (though I've always loved the one's on SOCAL)this movie is all about the Father, and the memory that this one particular summer holds for Freddy his Son. They start out right giving you all of the back story, and introducing you to all of the players so that you can form the right impressions of the characters that Freddy will meet, and this way we can react to the way in which Freddy treats the others with the same feeling that Al has. The lost boys working at the Lot are a lot of fun to watch, and that string is not pulled along too far either. There are many good locations in this movie, and each location feels right, you really get the difference between worlds even if subtle the hard lines of the moneyed, compared to the many curves of the hand to mouth. I Enjoyed the story a lot, and the acting is enough for me to recommend this movie to anyone looking for a funny little drama, or a parent who wants to see that they are not the first to go through it. This is a well made, and solidly delivered movie that anyone will enjoy, families, or just you Grandma's, and Pa's.","user":"face-819-933726","rank":[9,11]}]