[{"title":"Pretty Good","rating":5,"date":"11 February 2014","review":"Robert (Dylan McDermott) wakes up in a walk-in freezer with hands and feet bound. It's his birthday and has no memory of how he got there. Door is locked from the outside. And, it's getting colder and colder. What to do? What to do?<br><br>Okay, I get it. There will be some big twist at the end so I decided to hang for a while or until Robert dies from hypothermia. Shouldn't be too long. Maybe this is one of those Hollywood Short Shorts we hear about and never see. Hmmmm..<br><br>Two Russian heavies come in and demand to know where the money is and, of course, Robert has no way of knowing what they are talking about. They beat him up pretty good. Later, more Russians come in but this time Alisa (Yulia Snigir) is with them and she, too, is asking for the money. Robert gets beat up again. They leave. The Russians want their money: $8-million. The Russians come and they go and the beatings continue and they take his shoes (oh, no, not that!). You know for a small room there seems to be more foot traffic in this freezer than there is at Grand Central Station. Later Robert discovers he is not alone. There is a wounded cop in with him. Robert finds a telephone and calls the police, but he cannot tell them where he is. He has no idea where he is. Did the phone belong to the wounded cop? Is the cop dirty? Is the cop that answered the phone dirty too? Can anyone be trusted? <br><br>So this is how it goes and Robert is getting closer to freezing to death, but keeps looking for a way out or to stop the freezing . I kept yelling at the screen for him to knock out the fans, but the freezer impaired his hearing. Bummer. <br><br>I have to admit the dialogues and the acting carry this film. We are now fully engaged. (Who would have thought? ) Let's review: Robert in a freezer, gets beat up many times by the Russians, the woman seems softer and may be able to help, but she makes Robert take his clothes off – so no help there, many fights break out with Robert getting the worst of them. Then the big crime boss comes into the freezer to get his money and wait a minute: did I hear Robert speak Russian? So there is something more to this. <br><br>I have to admit that for a limited space in the freezer I was kept in suspense and Robert's quips may have saved him at times, but the Russians need him alive to find the money. And, then it happens, the twist. Told ya. <br><br>All in all this is pretty good. Great acting performances from McDermott and the supporting cast and great dialogues and some things we are not told until the very end. That is what twists are all about. <br><br>Violence: Yes. Sex: No. Nudity: No. Language: Yes.","user":"bob-rutzel-1","rank":[9,12]},{"title":"A total waste of time.","rating":1,"date":"8 April 2014","review":"This movie was so bad it actually began to hurt to watch it. You will find yourself saying in Every Scene: \"That is ridiculous.\" No, ridiculous doesn't fully describe it. You would have to add a few slang vulgar adjectives in front of ridiculous to give it the kind of review that it deserves. Twenty minutes into this action/thriller we were all laughing at its stupidity.<br><br>The directing looked like it was a made for TV movie and the writing was pure adolescent. Don't waste your time and, more importantly, don't waste any money on this...um...waste.<br><br>Then again, if you are intellectually challenged and don't quite understand the meaning behind the story of the 3 pigs, then... Grab that large popcorn, biggee coke, and a box or two of your favorite chocolate sugar, and get ready for a great action/thriller;)","user":"countryshack","rank":[15,28]},{"title":"Nothing amazing but not horrible either. A less horrific Saw type movie. The twist is both unexpected & predictable.","rating":5,"date":"17 January 2014","review":"\"This is the rat. I'd bet my life on it.\" Robert (McDermott) wakes up in a freezer with his wrists and ankles cuffed together and no idea why. When a gang of Russians come in they tell him he owes them 8 million dollars and won't let him go until they are repaid. When he realizes he isn't alone he is forced to make life and death decisions with every move he makes. This is a movie that although the idea has been done over and over still had potential. What it turned out to be was basically a version of the original Saw (without the gruesome chopping people up aspect). Man wakes up alone with no idea how he got there and must figure out who put him there and why. He sees someone else with him and must decide what to do next. The main difference is that this one has people coming in and out and more things happen but that is still the best way to describe it. The twist is both unexpected and predictable, when you watch it you will see what I mean. Overall, nothing amazing but not horrible either. A less horrific Saw type movie. I give it a C+.","user":"cosmo_tiger","rank":[8,13]}]