[{"title":"It's Really An Allegory Of The English Civil War Itself","rating":8,"date":"23 April 2014","review":"A FIELD IN ENGLAND is an incredibly brilliant and haunting film. While it may look like a psychedelic horror movie, like WITCH FINDER GENERAL, in reality it is a very straightforward film based very directly on the English Civil War itself.<br><br>O'Neill, the Irish alchemist who tries to enslave Whitehead and his friends, is clearly based on the English monarch Charles I. Like Charles, O'Neill is an arrogant man who claims not only total earthly power, but the right to pass judgment on men and to interfere with the cosmos itself. Just as Charles I saw himself as chosen by God (not the people) to rule as an absolute monarch, so O'Neill sees himself as a god on earth.<br><br>Whitehead, the timid religious scholar who attempts to bring O'Neill to justice, represents the Puritan conscience of England. His evolution in the film from a meek, submissive cowardly man to a military hero parallels the way the Puritans themselves evolved from a hunted, despised minority to a powerful army of spiritual and political authority, able to recreate England in their own image.<br><br>What the movie does is not just to imitate history but to reflect on its deeper meaning. Notice how the earthy, ignorant common soldiers switch their allegiance in the course of the nightmarish conflict in the field. At first they feel great contempt for Whitehead, the Puritan. They ridicule his \"soft hands\" and laugh when he is degraded and tortured and forced to run on a leash like a dog. In the same way, the English of Shakespeare's time (like Shakespeare himself) tended to regard the Puritans as a joke. But over time, as O'Neill proves more and more arrogant and unstable, the soldiers (like the English common people) begin to respond to Whitehead's efforts to awaken their sense of justice and their own moral dignity. By the end of the film, even the lowliest and most ignorant of the soldiers is willing to sacrifice his own life in Whitehead's cause, and Whitehead himself has changed from a pitiful outsider to the leader of the tiny band of \"rebels.\" The fall of O'Neil parallels the fall of Charles I, just as the rise of Whitehead mirrors the success of the Puritan revolution.","user":"Dan1863Sickles","rank":[66,78]},{"title":"Strange film with a unique distribution strategy","rating":6,"date":"8 July 2013","review":"A Field in England is most notable for being the first British film to be simultaneously released across every format on the same night. It has been released theatrically, pay-per-view, on DVD and on free television. It's a pretty audacious move and one that I hope works out for the film-makers as it could be a new way for left-field films to get the go-ahead to get made at all. It also reminded me of what it used to be like in the days before video recorders when I was a little kid. Whenever a movie came on TV it was a cultural event as a large percentage of the population sat down to watch it at the same time – we couldn't record it to watch it later or pause it to go and make a cup of tea we simply had to make time for it at the given moment and watch. I obviously wouldn't swap the flexibility we have nowadays but there was something to be said for sharing a movie at the same time as millions of others. And in a sense, the simultaneous cinema and TV release of A Field in England brings back this scenario and for that I am quite thankful.<br><br>The film itself? Well, it's a quite difficult one to accurately judge on a single viewing, as it was pretty confusing on the whole. Director Ben Wheatley said that he wanted to transport the viewer into the world of Civil War England with little exposition to explain what was going on. He wanted us to enter a world where the characters do things that would be second nature to them without actually explaining to us why they were doing them. It's a reasonable enough idea as events in the film appear somewhat surreal as a result. Having said that, I think it's obvious that the story is bizarre regardless of this. It involves an alchemist's assistant and some soldiers fleeing a battle and meeting an ominous cavalier in a field. The latter is looking for some unspecified treasure and he uses these men to find it. Throw in some magic mushrooms to complicate matters and you have one very weird movie.<br><br>I'm not 100% certain what to make of it on one viewing. It frustrated me a bit I have to admit, as it didn't necessarily make the most of the sinister possibilities inherent in its storyline. And by the end I really wasn't all that sure what had just happened. But it did intrigue me a little and I would be interested in returning to it at some later point. The cinematography was very good at times, while the soundtrack had an interesting mix of medieval drums, folk and ambient electronica. Acting was good enough with Reece Shearsmith of The League of Gentlemen always a welcome presence, while Michael Smiley was good as the cavalier. I'm not entirely convinced by A Field in England at the minute but I feel like unique films of this type should at least be encouraged in the UK so for that reason I am going to cut it some slack.","user":"Red-Barracuda","rank":[35,45]},{"title":"Works at an aesthetic level but nowhere else – lots of good moments, but they never connect to one another","rating":25,"date":"25 July 2013","review":"I've seen and enjoyed the last few films from Wheatley – not to the point that I love him but certainly to the point that I know he will bring me something interesting as a total package. He seems to do \"brooding tone\" very well while also engaging with plots, dark humor and generally well shot films. This one starts on the same way, moving characters into place and setting up some weird supernatural scenario which appears to be building and building. I was engaged by this but once we reach a certain point, it appears that this changes and it becomes almost nothing about a narrative flow and entirely about the visual and stylistic chaos of the final third.<br><br>Plot wise the film delivers nothing in this part. Characters who were dead show up, violent deaths occur, massive visions and tripping out. Those that defend the film say that you just need to go with this and that perhaps those that don't just don't like this sort of experience; I would point to 2001, it delivers content like this but does so in a way that makes sense and fits with the plot. In this case it is hard not to see it as being done for the sake of it and this is partly because the film is generally very aesthetically pleasing. The staged shots look great, the weird ideas are presented in a way that works (the two main \"on a rope\" scenes), the music produces a great sense of dread and generally it is a very well shot film. So when it offers nothing in the narrative sense, it is hard not to think that perhaps it has been focusing on the style all along and that any sense of a plot was merely just to get it where it needed to be so it could unleash stylistically.<br><br>Don't get me wrong, I liked it from this point of view but even having some structure or some basic narrative flow would have made it a good film, not just one that feels like the director was playing with how it looks and sounds. The cast deliver what is asked of them very well and their involvement is total, there are no bad performances here and I really liked the \"small cast, small space\" idea. Problem is that none of them have characters, just moments. They are great in this scene and in the next, but nothing bridges them. Indeed this is true of the whole film. Read the positive reviews here – they talk about how awesome a certain scene was or how great a certain visual trick was, but they really are not so clear about what was good about the film as a whole. Truth is I agree – there are lots of good individual moments, because the snippets are all cool to look at and very well delivered, but this isn't a music video, a fashion shoot or a 20 second commercial, it is a feature film that proposes to have a plot – but only proposes it.<br><br>For what it does well the film should be commended, but to ride on aesthetics alone for 90 minutes is a big ask and it is beyond this film. The ideas and structures probably cover it for fir the first half, but after this it really goes all out for the looks and style and, once you've had this and only this for 10 minutes then it starts getting boring without substance – and unfortunately once you hit that wall, there is probably still 20-30 minutes left to go, meaning it gets tiresome and a bit annoying. Worth a look for what it does well, but even on this level it has its limits – if this film is what he wanted to do then it would have worked much, much better as a 45 minute short.","user":"bob the moo","rank":[66,93]}]