[{"title":"Surprisingly good","rating":8,"date":"21 May 2012","review":"Against what someone could expect, this animated CGI short, despite having a cast of adorable characters playing the main roles, it is not a kid's films, but it is neither a black comedy, being instead (For most part, at least) a serious action war film.<br><br>While at first the cute appearance of the two main characters seem to be a distracting factor, the story of this short, despite being too simple it is interesting enough to make this worth-watching, being well told and surprisingly effective. Also, the good quality of the animation (With expressive and appealing designs) makes this a particularly enjoyable watch.<br><br>Fortunately, here the juxtaposition of cutesy with serious or violent situations isn't something gratuitous or forced, serving merely as an stylistic choice, working very well in that aspect.","user":"Rectangular_businessman","rank":[44,48]},{"title":"Much better than expected","rating":7,"date":"8 February 2015","review":"With that premise and especially that ridiculous title, one would expect this to be some over-the-top satirical comedy, but in fact, it turns out to be a very serious war film. You can just replace the animals in this with humans, and you'll get yourself a typical Hollywood product. <br><br>I guess the reason the creators chose to feature animals instead of humans was to make the film less violent and controversial so that viewers can suspend their political views and just see the film for what it is. And it works splendidly. With the fluffy rabbits in place of real soldiers, the film becomes much more memorable and interesting than it would normally have.<br><br>I also appreciate that they try to give the main characters some connections and progress within the short runtime, though those are no more than cliché Hollywood stuff.<br><br>The animation is good for an independent product. The character models are great with very smooth movement, and the explosion effects are OK. The only real problem I see is that sometimes the characters don't blend well with the backgrounds.<br><br>In conclusion, this short is one surprisingly fun and solid film that action lovers should really see for themselves.","user":"ddangtruong23","rank":[8,8]},{"title":"Very unique animated short","rating":7,"date":"12 January 2014","review":"Ask me how much I loved the concept of a (relatively) serious animated war story about a bunny snipers team in the middle east that includes head shots to camel terrorists. Just that description alone should entice you to see it.<br><br>The serious approach the producers took to a story line about hardened war vets (at least Packy the spotter and leader) compared to the not-so-serious premise of 2 bunnies as the main characters. They certainly play with this juxtaposition; the team is scoping out the village to weigh their options and you see regular fluffy tails twitching, they walk through the dangerous village with those floppy feet, and a cute bunny barking orders like Sgt Rock (for the younger reader, an old comic book WWII GI).<br><br>The only criticism is that Botasky's (the sniper) dialogue are a bit weak, he should have been as hardened and confident as Packy) but you can certainly forgive that slight issue as it added to the juxtaposition.<br><br>I only wish this was longer, maybe even a regular, on-going series.","user":"Finbar-1","rank":[13,15]}]