[{"title":"It's not about a one person,it's about many,who struggles in their own.","rating":10,"date":"14 February 2019","review":"It's not about only a rap,it's about every person who struggles their own inside.its the story about every struggling person who trapped under the bloody society.who want to fly,who want to go outside,who want do something.its not a rap movie,it's truly a inspirational movie.","user":"amitkowe","rank":[76,99]},{"title":"To all the reviewers who are saying Gully Boy is copied from 8 mile","rating":8,"date":"15 February 2019","review":"NO ITS NOT COPIED FROM 8 MILE. Did you guys watch 8 mile and Gully Boy both?if you do think they are the same, then you need learn how to watch movies before you compare them. You also need to understand what a movie genre means. May be search in google to get better understanding.<br><br>you all are saying 8 mile and Gully Boy are the same based on just few things as both movies are about rappers and their struggles. its like calling all the love stories are same because there is a boy and a girl in the movie.<br><br>From the above rating you can see I liked Gully Boy, music and performances are very good. rapping looks natural. Alia Bhatt is a fire cracker in the movie. I just wish there is lot more to the story. its a worth a watch. Please dont listen to anyone who says its copied from 8 mile, watch both movies to decide for yourself.","user":"bharatkgump","rank":[171,235]},{"title":"Slow and Calm Masterpiece","rating":9,"date":"14 February 2019","review":"Gully Boy merges into you and makes you feel as a part of Murad's journey (Ranveer Singh).\nDharavi 17 is where he stays and his daily struggles,his exposure to rap, his love life, a mistake in relationship,his guide,his well-wisher,his bonding with parents..\nA common man's journey actually.\nWe all have such stories in our life.\nZoya has brilliantly captured the gully life here and shows how it moulds oneself with the amount of time you spend with people around you.<br><br>With every movie this guy gets better.So once again Ranveer does his one of career's best.\nAlia is the show stealer with dialogues that gets the whistle. We have three supporting Vijays here in this movie Vijay Raaz(father),Vijay Maurya(Uncle),Vijay Varma(Friend) and they are spot on.\nAmruta Subash(mother) expresses her life's melancholy brilliantly.<br><br>Kalki as sky gets limited screen time but packs a punch and last but not the least\nthe game changer Siddhant Chaturvedi(MC Sher). He overpowers Ranveer in many scenes.<br><br>I won't stop if I start mentioning how apt and brilliant is the screenplay here..\nCinematography by Jay Oza and crisp editing by Nitin Baid are felt on the screen as the movie even being slow in pace doesn't be a boring affair in 2 hrs 35 mins.\nZoya has struck a win win here.<br><br>Finally, what made it more lively was screen time for real life rappers like Emiway Bantaai,Stony Psycho and Dope Daddy from Dopedealicz , Kaambhaari and also a second of Brodha V.<br><br>Just felt like saying this that how well the hip hop culture has been able to connect with our generation. Emiway Bantaai's one second presence in first half and the crowd erupted like never seen before. Also , his acts in second half are treat to watch. Not to forget Kaam Bhaari is there too.<br><br>All in all 9/10 from my side.\nGo for it folks.\nWatch it for a beautiful journey of the guy from streets.","user":"kunder-akshay3","rank":[72,95]}]