[{"title":"A New Approach...Likable or not ? That's your call.","rating":6,"date":"21 June 2014","review":"This documentary is related to \"The Icelandic Phallological Museum\". (http://www.phallus.is/en)<br><br>A person with a different choice starts collecting penises of different species. One day it grows up to a small museum in Iceland, probably the only of its kind. <br><br>The documentary begins with the curator's wish to have his collection completed by having a human penis. Donors are few. Two persons agree. One from Iceland, another from America. Then the documentary goes on with the happenings. <br><br>The film has objectivity. Photography is great. Beauty of Iceland is present in many frames.Music is perfectly blended with the film. <br><br>Obviously, this documentary is NOT about biological interest, rather it focuses on human psychology.","user":"ghosh77","rank":[10,10]},{"title":"Seriously, except for a wince or two, I smiled through the whole movie..","rating":8,"date":"29 June 2014","review":"A simple documentary about the life of two penis donors and the curator of a phallus museum.. <br><br>While the penis is presented as the main character in the movie, the director underplays the stereotype attached to penises and lets the viewer follow along, free to have our own reactions without prompting from theatrics.. <br><br>It's a straight forward documentary and while there are a few exposed penises, it's not a sexual movie,, it's a peek into the psyche of men who love their penises.. <br><br>I gave it an 8 rating because I found it interesting and as documentaries go, well done..","user":"rockenkay","rank":[5,5]},{"title":"A museum that needs one final endowment","rating":8,"date":"4 August 2014","review":"I remember a few years ago in my sophomore year health class, learning about the obligatory sex organ unit, being deeply immersed in my internal thoughts about human sexuality so-much-so that you couldn't give me money to tell me what my teacher was talking about. My mind kept circling back from films I've seen that touched on sex, to romantic encounters people might have with each other, to the point I want to make here, that the penis and vagina are really not that attractive organs. Men have the luxury of having two immediate go-to body parts on women to feed their eyes, which are obviously the breasts and the buttocks, but women don't have that same luxury. Yet the organs we can't see - and the ones we ultimately desire to see the most - are arguably the two most hideous things on our body; but we're attracted to them.<br><br>I bring this up because Siggi Hjartarson, the owner and founder of the Icelandic Phallological Museum, clearly finds the male sex organ attractive enough to construct and operate the only museum dedicated to housing penises of hundreds of different animals. The museum opened up in 1997, and inside, Hjartarson has severed mammal penises encased in formaldehyde for proper preservation and puts them on display with a vivid history behind each endowment. However, while Hjartarson has several penises from extinct species, and even a humongous one that once belonged to a sperm whale, he is missing a penis from a species that has billions of functioning ones right now - the homo sapien.<br><br>That's where the documentary The Final Member comes in; a film just a tad over an hour long that shows Hjartarson's impressive collection as well as his quest to obtain the penis that will complete his collection. Hjartarson's health condition is greatly deteriorating, and while he has two men interested in donating their penises to the museum, he wants to be able to see the museum complete before he dies. The museum was founded after he received a bull's penis as a joke from a friend and, upon doing research, found the idea of opening a phallological museum intriguing and playfully taboo. Contrary to public perception and initial assumptions, Hjartarson's purpose of opening the museum is the furthest thing from being pornographic. Hjartarson, much like myself, admires the notion of how taboo and off-color it is for someone to mention penis in public, despite half of the world having the sex organ. The awkward part about the penis is that people make it awkward.<br><br>In efforts to track down a human penis to complete his collection, Hjartarson finds two men, one of them named Pall Arason, a well-known Iceland womanizer who agrees to donate his penis to the museum when he dies. Another man is an American by the name of Tom Mitchell, who is perfectly willing to donate the museum his penis while he is still alive, hellbent on making his penis the most famous penis in the world. Mitchell even goes as far as to get a tattoo on the head of his penis, and has ambition to write a comic book series on his in pursuit of his goal.<br><br>The Final Member works to show the different ways people want to appreciate and commemorate their own sex organs, to which I say continue and let flourish. Hjartarson has found a quirky, unique way to inspire thought and curiosity into something so frustratingly and unjustifiably taboo in a manner that allows education and curiosity to flourish, while maintaining a successful business all the more. The documentary is never too long, is consistently entertaining, and almost operates like a fictional film, with its quirky situations and focuses, but never in such a way that the distracting and often perplexing \"mockumentary\" features are played for gimmicks. This is a genuinely fun, thoughtful, and surprisingly moving little gem about a museum in dire need of one final endowment.<br><br>Directed by: Jonah Bekhor and Zack Math.","user":"StevePulaski","rank":[4,4]}]