[{"title":"More open and honest than anything I've seen in films recently","rating":8,"date":"3 August 2013","review":"Hiding behind masks that cover their vulnerability, two Americans in Chile, Jamie (Michael Cera) and Crystal Fairy, a young free-spirited woman (Gaby Hoffmann), spar off against each other in Chilean filmmaker Sebastián Silva's psychedelic comedy Crystal Fairy. The film was nominated for the Grand Jury Prize and won the Directing Award for World Cinema at the 2013 Sundance Film Festival. Jamie's act is one of controlling, overly-aggressive behavior but not quite the \"Ugly American,\" while Crystal's is the opposite but equally phony, a caricature of a \"hippie\" filled with love for everyone who spouts clichés about chakras and mother earth, walks around her hotel room naked, engages in healing rituals, and chides the others for eating junk food.<br><br>It's hard to tell if the director is using her persona as a means of ridiculing these ideas or just showing how inauthentic she is. In any event, Crystal and Jamie's way of being, while it fills a need for them, has costs in sacrificing who they really are. On the surface, the film is a road trip to find a psychedelic substance in the San Pedro cactus plant which, when boiled for twelve hours and ingested, has the properties of mescaline (it has been said that the actors used mescaline while shooting the film). In essence, however, the film is not really about mescaline but about releasing rigid patterns of behavior and discovering new ways of interacting that are more fulfilling.<br><br>The film begins at a party where Silva's hand-held camera-work and improvised conversation is established. On a cocaine high, the caustic Jamie invites a partygoer, a girl who calls herself Crystal Fairy to accompany him and his friends on a quest to repeat the spiritual high described in Aldous Huxley's book The Doors of Perception. When Crystal takes him up on the offer the next day (which he has forgotten that he even made), he is dismayed by her annoying behavior, even though his Chilean friends, Champa (Juan Andres Silva) and his two brothers Lel (Jose Miguel Silva) and Pilo (Augustin Silva), seem more tolerant, perhaps because at least one does not understand English. Their trip to the ocean to locate and purchase a piece of the San Pedro cactus from reluctant residents is one of the comic highlights of the film, even though Jamie has to eventually use surreptitious means to acquire it.<br><br>Crystal Fairy ends up in a good place even though it is more than a little irritating in getting there. During the trip, Jamie and Crystal talk to each other, but at cross purposes. The results are unpredictable but, suffice it to say, their longing for a spiritual experience does not take the form that Huxley described. Michael Cera's role is out of character from the lovable, nerdy self he has played in earlier movies, but he is terrific in this film, totally natural and very real, as is Hoffmann in her role, both continuing to reveal a new dimension to their character. Ultimately, the group's sharing about their fears and their discovery of how their act no longer serves their purpose in life is more open and honest than anything I've seen in films recently and stays in the memory.","user":"howard.schumann","rank":[57,82]},{"title":"A Trip on a Chilean Road to Understanding and Mescaline","rating":7,"date":"13 November 2013","review":"\"Crystal Fairy\" is a road trip taken by two of the ugliest Americans to ever trod a cinematic foreign country. Their goal: Mescaline and spiritual discovery – or closer to the truth, themselves.<br><br>Comedy star Michael Cera, Jamie, showcases trademark Allenesque neuroses, whining and flat affect in a role based on the experiences of Director Sebastián Silva. The reversal is Silva was a native while Cera is an interloper of whom it is asked, \"Did you travel to (beautiful) Chile just for the San Pedro (the cactus harvested for Mescaline)?\" The answer is a resounding yes, and there is nothing he won't do to get it, including stealing cactus from a lonely, mentally challenged woman.<br><br>Gaby Hoffman, Crystal Fairy, is a pontificating Sixties throwback who wanders about in the nude and chastises people about their food choices (while drinking Coke). She's also an unwanted (by Cera) barnacle clinging to the trip which includes three native brothers. (The scenes of the brothers trying to look like they're not gawking at the nude Hoffman in a hotel room are hilarious.) <br><br>Cera's performance is admirable but his usual one-note. Hoffman easily outshines him.<br><br>The improvised dialogue adds immediacy and verisimilitude while masking the bitter subtext; Neo-Colonialism and Financial Imperialism. Like \"Tony Manero\" (a film crediting thanks to Silva), United States' influence and interference lightly greases this story's wheels.<br><br>Unlike \"Tony Manero,\" \"Crystal Fairy\" adds character arcs: Cera departs his obnoxious head to find self-acceptance and a heart recognizing Fairy's inner beauty; Fairy discovers her healing powers cannot reanimate a dead animal and the world just might not end in 2012. She also finds acceptance of the sexual abuse leading her to a life as a strap-on wearing Dominatrix.<br><br>The Chilean brothers are antithetical to the Gringos. Their portrayals are a given as they're natives of the country of the film's origin, but their counterpoint makes Cera and Hoffman all the more ridiculous.<br><br>To say \"Crystal Fairy\" is a comedy (stoner or otherwise), twisted love story or angry gringo-invective is to sell the film short. This is a sweet, abstract film with multiple layers and a few very fine moments. The film plants itself in the psyche – much like Mescaline. Giving in to the film's charms results in a feeling you actually tripped along.<br><br>Multiple viewings may help in understanding off-the-cuff lines delivered sotto voce. And the abrupt, unsatisfying ending is a shortcoming. There is a movement to cut to black and end films with ambiguity. To feed post-viewing conversation and debate? Whether lazy, uninspired, unmotivated or ill-advised, an ambiguous ending cheats the audience. (\"The Birds\" notwithstanding.)<br><br>A welcome respite to noisy, tent-pole, superhero entertainment, joining this troupe on the road is definitely worth the ninety minute trip – straight or high.","user":"Cinnyaste","rank":[15,21]},{"title":"Go ahead and fly away with this Fairy!","rating":7,"date":"6 September 2013","review":"A hit at the 2013 Sundance Film Festival, Crystal Fairy stars Michael Cera (Scott Pilgrim vs. the World) as an uptight American drug-partaking lout backpacking parts of Chile with three friends (whom are native Chileans) in search of a rare cactus -- the San Pedro -- in hopes of experiencing its hallucinogenic effects on a northern beach.<br><br>At a random party before their trek is set to begin, a coked-out Jamie (Cera) spontaneously invites another American party-er to partake with them. She (Gaby Hoffman - remember the little girl from Field of Dreams and Sleepless in Seattle?) is a hairy (uh ... yep) free-spirit who channels the vibes of nature and goes by the name Crystal Fairy.<br><br>After their trip begins (it is a few hundred miles of a drive from the city to the beach), Jamie and Crystal discover that they have conflicting personalities and they clash many times before their group even comes across the cactus to imbibe as he is boorish and insensitive and she is unique and a deep-thinker. Jamie becomes increasingly annoyed with Crystal while his three Chilean friends tolerate her much better and actually respect her point of view and sensibility. Jamie is oftentimes unaware of his rude-ness but he is written well and believably portrays an American tourist expecting concessions and advantages. When they actually find a cactus (one she has spotted), Jamie and Crystal Fairy even disagree as to how to obtain it because Jamie likes things being his way and he is a stressful worry-wart.<br><br>While this portion of the journey is complicated, the real \"adventure\" begins on the beach when they make their drinkable concoction. The film becomes one about personal and inner understanding, acceptance and compassion. The first half comes across as rather annoying as Jamie's character is very self-centered and not too-likable and while I believed the drug-induced portion of the film would be the hardest part to endure ... I was wrong as this is when the true characters of each are actually revealed.<br><br>As for the film's acting: Cera fans know what to expect from him and he plays another slight variation of manic that he's shown audiences before. His character is high-strung and abrasive and some might want to reach through their screens and punch him a time or two; but this is a testament to Cera's acting talent. He plays his character very well. Hoffman hasn't been on many movie screens lately and it is nice seeing her play the titular (ahem) character. She bares more than just her soul in a few scenes ... and her final admission around a late-night campfire is moving and emotional. Welcome back to the big screen Gaby! This is a good little, independent film ... but it isn't one for everybody. It takes some patience and those who dislike grainy picture and plot-lite story lines won't appreciate or enjoy this. It is only those patient enough to make it to the end of this film and willing to take the entire trip who will be rewarded with the film's high.","user":"twilliams76","rank":[28,46]}]