[{"title":"An Actor's Actor","rating":7,"date":"29 April 2018","review":"I'm not going to talk about the film as a film because, it seems to me, a pointless exercise. We all know the story. Painful, bitter, shattering. What we didn't know, what we couldn't even imagine is what was in Joe Paterno's heart in mind. Now we have a plausible, profoundly human version of it, in Al Pacino's eyes.\nI saw a decent man of his generation confronted by the new approach to decency. I saw in his eyes a sort of resignation, the kind of resignation suffered by the decent man who knows he's guilty. Al Pacino is still breaking ground, still at the vanguard of his own profession. Hurrah !","user":"fanaticusanonymous","rank":[53,55]},{"title":"Pacino for the Win","rating":8,"date":"30 April 2018","review":"Cable TV is really hitting it out of the park these days. Paterno is one of the better movies I've seen in awhile including theatrical movies. I probably don't need to recap the entire plot for anyone, since the news covered it widely at the time. This film centers on the horrific Penn State scandal of sexual molestation of young boys by a man who was at one time on the Penn State coaching staff and was a \"pillar of the community.\" What makes this different though than any news coverage you've seen is that it goes inside Joe Paterno 's life to show the downfall of a community and sports icon from the inside.<br><br>Of course, one must take into account that filmmakers take some license when it comes portraying Paterno and his family. While I'm sure they did their research, they weren't actually sitting at his dining room table for those intimate encounters with his kids during the aftermath of all of this. I think a question that most people had when they heard about the scandal was, \"What was Joe Paterno thinking? Why did this powerful leader not do more? What was going on inside head?\" This movie delves into that, giving an interesting and very possible take on what really was going on inside Paterno's head. Other great things about this movie: Riley Keough is fantastic as the reporter who originally breaks the case, and Al Pacino is so amazing as Paterno that you will forget you are even watching Pacino.","user":"anemone90210","rank":[29,31]},{"title":"All you need to know is this...","rating":10,"date":"12 April 2018","review":"About halfway into this film you will know that on Feb. 9, 2001, graduate assistant Mike McQueary witnessed a Penn State coach raping a ten year old child in the showers, on the university campus, and did not stop the assault. Though he was a seasoned college football quarterback, and a full grown man of significant size, he did not rush the rapist, beat the crap out of him, and rescue the child. He left because what he saw upset him. He left that 10 year old child defenseless, and still in the clutches of his rapist, Jerry Sandusky. This film shows that that night he only called his father. The next day he called Joe Paterno. Ten days later he told athletic director Tim Curley and vice president for finance and business Gary Schultz. To what purpose? To stop the rape? No, that was allowed to continue on Feb. 9, 2001. To have Jerry Sandusky arrested and put in prison for the rest of his life? No, Paterno, Curley, and Schultz, already knew that Jerry Sandusky was a serial child rapist. They had been documenting his criminal activity since since the mid 90's. To find the victim an get help for him? Make sure his parents knew that they were handing their son over to pedophile rapist? No, they never even bothered, in fact they made certain, that they would never know who the victim was. This film shows that Paterno, Curley, and Schultz, had already asked Sanudsky to stop bringing his victims onto the Penn State campus. They just needed to know what McQueary saw so that they would know what more they needed to cover up. The four full grown men, Paterno, Schultz, Curley, and McQueary, the only men with any power to save this victim, prevent future victims, and bring justice to past victims, went into self-preservation mode to protect themselves. They stood by and did nothing, while children were being brutalized. Why?<br><br>It is difficult to discuss the significant merits of this HBO film because the story itself is so infuriating. And while I am not certain that the reporter in the film, Sara Ganim, was personally responsible for this - wait for it, the film shows her typing out these words while making a report; \"Jerry Sandusky was seen \"having sex with a 10 year old boy in the showers at Penn State.\" I remember reading articles at the time with that exact wording. Who sees, or hears about, a 10 year old child being raped, and then describes it as two people \"having sex\". Again, it's her character, in this film, typing those words. I couldn't believe it because she's the \"good guy\" in this mess. <br><br>This story has been characterized as \"complicated\". It's not. The \"story\" is simple. The coverup is complicated. HBO and Barry Levinson do a masterful job of revealing a culture gone mad where pedophiles are protected, victims are chased down school hallways, and college students riot against justice for sexual abuse victims because it might, just a little, harsh their football buzz. They make the Catholic church look like ameture hour. <br><br>The enduing question in this story, and others like it, is this: why did Penn State, law enforcement, politicians, and Mike McQueary, do nothing? In fact, if they had turned Jerry Sandusky over to authorities in the mid 90's when (as far as we know) they first became aware of his crimes, they would not have lost their jobs or the bloated salaries that accompany them. They would have been hailed as heroes. So it must be something else. What could it possibly be? This film demands that we consider how this story would have played out had the victims been female children. It is really difficult to imagine that if Mike McQueary had found Jerry Sandusky sodomizing a 10 year old girl in the showers at Penn State on Feb. 9, 2001, that he would have just run away like he did when he saw Sandusky sodomizing a 10 year old boy? Had the victims been female I think he would have beaten Sandusky within an inch of his life, called 911, and been given a medal for heroism. So, what do you get for abandoning a, still anonymous, male victim. The answer would be a 12.3 million dollar settlement from Penn State for \"wrongful termination\". And that anonymous victim? No one knows what happened to him because no one even knows who he was. They didn't want to know who he was. Why?","user":"hughman55","rank":[31,36]}]