[{"title":"A movie that I did like but was almost a little too cookie cutter like to be considered original.","rating":6,"date":"11 March 2016","review":"\"You're the one obsessed with death. My Hunter was obsessed with life.\" Hannah (Hall) is trying to cope with the death of her husband, and popular singer. She spends her life living in the past and trying everything to keep his memory alive. When Andrew (Sudeikis) shows up wanting to write a book about him he is met with resistance from Hannah. Little by little the more they talk they more they realize they both have something that will help the other one. This is a very good movie that is worth watching, but it also a tad bit generic and cookie cutter like. Most romantic comedies are though so going in I expected that. Sudeikis is great and funny as always, even though this is more serious than we are used to from him. In terms of romantic movies this is one that men will like, maybe more than women. Overall, a movie that I did like but was almost a little too cookie cutter like to be considered original. I give this a B-.","user":"cosmo_tiger","rank":[18,19]},{"title":"Near Miss","rating":6,"date":"13 April 2016","review":"This movie, on the surface, would seem to have the ingredients of a successful film. It has two charismatic lead actors in Rebecca Hall and Jason Sudekis, a good supporting cast, a nice small town in Maine flavor, and beautiful cinematography.However, for me, it just never seemed to come together to a point where I was able to connect emotionally with its characters. <br><br>Hall portrays Hannah, living in a backwoods area of Maine, who is grieving the loss of her husband Hunter, some two years before, from a hiking accident, He was a singer/songwriter who had a wildly successful first album, thus achieving great notoriety before his death, and was revered by Hannah.<br><br>Sudekis plays Andrew, a writer and associate professor, who doggedly pursues Hannah to possibly collaborate on a book he's writing about talented artists who have died way too young. However, Hannah wants to write her own biography of Hunter, and resists Andrew until she realizes she does indeed need his help. As Andrew uncovers more and more information, he begins to suspect that Hunter may have committed suicide and that his death was not an accident. The interplay between the two works well, at times, but at other times seems forced and just doesn't ring true.<br><br>All in all, this movie, directed by Sean Mewshaw with a screenplay from Desi Van Til, had its moments but never really came across to me as totally believable, so I would say it was a near miss.","user":"larrys3","rank":[11,11]},{"title":"Inspired and entertaining study on the inevitable selfishness of grief","rating":3,"date":"3 March 2016","review":"Understated, honest and soulfully choreographed. The cast is engaging, authentic and surprisingly interesting even in the most ordinary situations, of which there are few. Grief may be the premise of this film, but the result is a calm escape into a world you'll be happy to spend some time in.<br><br>After reading about the film, I did expect an Indie movie with the usual predictable story lines and romantic frou frou, and there is no shortage of that, but there is another layer of depth that caught me off guard. The intimate warmth of the soundtrack, like the weightless smoke of a dying candle in a quiet room, lingers long after the end credits are over. Some of the songs really are beautiful enough to warrant this type of language, trust me. So do the memories of other musicians who left behind their timeless creations along with the shock and mystery of a lifetime cut short. Martyn Bennett and Jeff Buckley, however different the circumstances of their departure, come to mind.<br><br>Whenever an Indie movie finds the perfect balance between lighthearted, mainstream entertainment and the relatability of a smaller story and budget, it proofs that a solid Indie production can transcend the restrictions of a genre and touch the audience beyond 90 minutes of entertainment.<br><br>I couldn't think of a single studio produced movie in recent months that achieved 'Tumbledown's subtlety and depth with the same simplicity and grace. To proof my point, this movie would work even without the romance and succeed as a relevant reflection on grief and the responsibility of moving on.","user":"reviewcentralny","rank":[19,23]}]