[{"title":"A Very Surprising, Heart-Warming, Feel-Good Movie","rating":7,"date":"24 November 2013","review":"When David (Vince Vaughn) finds out he's the father to 533 children through donations he made to a fertility clinic 20 years ago, he learns that a fraction of them want to meet him. Against the advice of her lawyer best friend Brett (Chris Pratt), and while trying to mend the relationship he has with his girlfriend Emma (Cobie Smulders), David decides to set out and see how his children turned out. Along the way he starts to find himself waist deep in the situation.<br><br>Based on his original French film Starbuck, director Ken Scott brings his original film in American form. The film starts out with some nice comedic moments from Vince Vaughn's character playing the typical immature adult. However, it gradually shifts gears into a more sentimental film. As we watch David interact with his children, often ranging from some comical moments with them, but then we get the genuine and sincere moments where we see David begin to open his eyes to the world. From the outside, the film looks like some average comedy, but in the long run it runs so much more deeper and sentimental than that. <br><br>While at first glance, it would appear Vince Vaughn plays the typical character he always plays, but as the film progresses we start to see him take a more serious side that we rarely see from him. It is a major treat to see him interact with some of the youngsters who play his children. When Vaughn has to express his sentimental side, he really nails it. It makes you wish he would do more roles that require this type of range. Apart from his serious moments, Vaughn also has fun chemistry with Chris Pratt who plays his best friend. Their relationship is really believable and they have some good and funny moments together. Pratt on his own provides a lot of the major comic relief in the film, even though we find his character has his own troubles he has to deal with. <br><br>Delivery Man definitely earns a ranking as one of the surprise feel-good films of the year. It will have you laughing and by the end it can leave you with tears of joy and a smile on your face. <br><br>My Rating: 8/10","user":"Slasher_Lover23","rank":[91,114]},{"title":"Heartfelt, Emotional, and Comedic","rating":7,"date":"23 November 2013","review":"This is probably one of the best movies I've seen. Okay, disagree with me, but hear me out first. I've never understood the desire for children. I don't know why people have kids. And nobody, not even my own parents, have been able to explain to me why. But this film inspired me to become a father one day. <br><br>I laughed. It brought me tears three times. I walked away from that movie feeling satisfied, warm, and with a whole new outlook on life. Don't go into this movie expecting the comedy or the drama or the story of the year, because you're not going to get that. What you are going to get is an enjoyable film that will make you smile. And that's truly all that matters. This film is full of love and what it means, and I left loving this film and loving and understanding the desire to have children. <br><br>-Jackson","user":"readjacksonporter","rank":[124,175]},{"title":"Wow not what i expected!","rating":9,"date":"30 December 2013","review":"Firstly I will start by saying I am a huge comedy fan!, I have seen pretty much every major and a lot of indie comedies in the last decade. I have seen a lot of Vince Vaughn films and have to say I am not a big fan of his, he sometimes shines like in the Internship, but mainly is a stiff, one dimensional actor who delivers wooden performances.<br><br>His last film as I said was totally enjoyable, so I was open to seeing this as I thought maybe he has turned a corner and hell was I right!. He shows comedy timing brilliance and shows the one thing I have rarely seen from Vaughn... Emotion.<br><br>This film is as funny as it is deep! it is a joy to watch and is also just strangely gripping in a way most comedies do not succeed. He is an endearing character chasing his 500 odd children and most bring flashes of hilarity whilst the rest bring a nice emotional warmth.<br><br>You will definitely enjoy this film, after poor comedy outings such as this is the end, bad grandpa and the diabolical grown ups 2 this will restore faith that there will be some genuinely funny films that don't rely to much on swearing, sex and unnecessary shock humour such as casual racism and sexism.<br><br>Enjoy and prepare to laugh and say awwww until the film leaves you feeling like you've finally after a few months seen a truly great comedy film again.<br><br>If this is the standard Vaughn is now setting then I cant wait for the next one!!!!!","user":"chris_rowe-881-168820","rank":[59,83]}]