[{"title":"Nearing the boiling point...a triumphant 2nd part","rating":8,"date":"27 June 2012","review":"The story arc is slowly but surely making it's way towards the point of no return. The follow up to Spring's Berserk anime remake was a pleasure to watch. The excitement flows from scene to scene without growing tiresome, and our favourite characters are shown in a new light as their relationships change and take new forms. <br><br>I was expecting the story to continue further than it did, but this certainly isn't a bad point. In fact it allowed for greater character depth and emotional attachment for the viewer, and of course pure excitement in waiting for part 3. <br><br>The more 'erotic' side of Berserk that the manga fans will be aware of makes it's appearance in part 2. But it never feels out of place and is played out alongside a great musical score that never allows it to feel like a cheesy anime porn scene. <br><br>All in all a fantastic film. Fans of Berserk will be frothing at the mouth and your average anime/medieval film fan will also leave the cinema with a delightful grin on their face.","user":"yogll","rank":[31,37]},{"title":"Disappointing","rating":6,"date":"8 January 2013","review":"The anime adaptation of Berserk was absolutely amazing, so I was understandably excited when I heard of the movies coming out. I enjoyed Part I, the animation was astounding and the sound effects were great. Part II has those same qualities, but I found that the \"feel\" of the manga and anime were lost, as extended sex scenes were given priority over important plot points. POSSIBLE SPOILERS AHEAD I was most disappointed that the creators removed the scene where Zodd throws Guts his sword during his fight with Boscone, and instead added a ridiculous dance montage and extra boob time. Arguably the extended sex scene between Griffith and the princess was warranted, but I definitely would have rather seen the sword toss, which adds to the mystery of the story and foreshadows some of the freaky stuff that's coming up, than the three-minute dance scene which feels totally out of place. I think the reason the anime was so successful even though it skips over some stuff, is that the overall mood and intrigue of the manga is preserved, something this movie adaptation has proved it doesn't understand. I'm still giving it a 6 because I love the Berserk story and hopefully anyone who watches the movies without having read the manga or seen the anime will want to do so after.","user":"frontal_dysfunction","rank":[8,10]},{"title":"Berserk fans out there...prepare to be disappointed","rating":5,"date":"16 May 2013","review":"This review is written as a berserk fan so I can't help it if im biased against this second film installment.<br><br>Anyways firstly as a berserk fan I first saw the anime sometime in 2001 and then proceeded to move onto the manga which I've since read many times over and let it be known that berserk is probably one of the great works of art and dark fantasy out there. So when i first saw the movie remake I won't deny that I was excited. However after the first installment I was rather skeptical considering the super condensed story line and clunky 3d animation. However, I gave it the benefit of the doubt that being a first attempt, perhaps the second attempt would get it right...sadly I was very wrong.<br><br>Lets start with the one good point, the animation is great making the sword swinging, blood spilling and gratuitous boob grabbing all that more satisfying to watch. Seeing guts in smooth fluid animation is absolutely great, something that the original anime couldn't capture due to the low budget and superbly clunky animation. However, I couldn't help but feel that the original anime did a much better job of capturing the art style of the manga. Perhaps the ICONIC battle of the golden age arc (fans will know which one im talking about) was absolutely ruined by this film despite the fluid animation, so many of the scenes depicted in the manga were just outright skipped. Sure its nice to see guts swinging his sword around with the assistance of a bigger animation budget, but so much of the awesome stuff he does in the manga (not to mention the low budget anime) is just ignored and replaced by fluid and nice looking but ultimately empty animation.<br><br>This same 'glossing over' effect also goes for the story, no character development is allowed and many smaller but hugely valuable interactions and events are just skipped for the sake of cramming what is essentially hours of BERSERK into a condensed but ultimately tasteless 80 minutes. I also found it weird that so much time was spent on a particular sex scene which although important as a plot device didn't really warrant the amount of time and emphasis it did on screen.<br><br>But perhaps I'm blinded by my previous experiences and memories and perhaps the movie isn't really that bad. But I GUARANTEE that if you enjoy what you've seen in this movie but haven't been acquainted with the original manga...then do yourself a favor and go read it cause its a world of difference.<br><br>*Word of warning, if you do take my advice don't expect a conclusion to the berserk saga cause for all its beauty and genius, the series has definitely taken a dive and is unlikely to ever be concluded at the rate the author is going","user":"dx_hong","rank":[14,24]}]