[{"title":"An okay thriller that does have its good about it","rating":6,"date":"17 December 2014","review":"This film was relatively small but with the star power in Dominic Cooper and Samuel L Jackson plus an interesting premise I gave it a shot and I'm kinda glad I did. The premise sees Cooper as a District Attorney who accidentally hits a man with his car, when he throws the trial against the wrongfully accused man some dark secrets are revealed for both men. Now I do really like Dominic Cooper as an actor and this film once again shows how good an actor he is, this is a completely different role to his usual and he does a really good job in the role. The supporting cast is mostly pretty bad except for the obvious of Samuel L Jackson, the mysterious character he plays is perfect for his acting credentials and even with the weak dialogue for him he manages to make the best of what he is given. The story is somewhat interesting with the main story between Cooper and Jackson being really interesting and making a good shade of grey to the main characters. But there is other characters that are completely uninteresting and not important story developments. The script is alright and mainly good for Cooper but Jackson tries his best with what he is given and the rest of the cast didn't stand a chance. The style is quite cliché for films like this but I do think some of the tense situations work because of the style it was filmed in that helped add that tension. Overall this film is okay and if you like suspense films then you might just enjoy this film.","user":"alindsay-al","rank":[11,13]},{"title":"unbelievable, but watchable","rating":6,"date":"11 April 2014","review":"...everybody got their paychecks who were involved in the movie and what we audiences get is a mediocre effort from the people involved, and a preposterous storyline which they want us to believe is possible.<br><br>another run of the mill whodunit, but in my opinion cannot happen in the real world and thought about turning it off about a 1/3 of the way through. the only saving grace was that the actors were likable and helped in me finishing the movie.<br><br>it felt like one of those cop or lawyer shows that is on TV but the production was a lot better. the story is about an up and coming lawyer, played by Dominic Cooper who goes with a couple of lawyer buddies from the same firm on a drinking binge. they separate afterwards and the main protagonist instead of taking a cab, jumps into his suv, starts the car, steps on the gas and immediately runs over somebody. this all happens in a dimmly lit area close to the bar. he gets out of the suv and checks on the guy he ran over. he winds up making the wrong decision, and instead of calling from his cell-phone he runs a few yards to a payphone to call an ambulance so the call cannot be traced back to his cellphone. he goes to the guy hes just run over and tells him an ambulance is on the way. the victim can see that the young lawyer is about to leave and begs him not to, in doing so he grabs him by the front and his wallet falls out, with business cards flying everywhere. the lawyer thinks hes picked up everything and leaves.<br><br>what happens after is so preposterous and unbelievable that i wanted to laugh in a lot of spots...but all in all, i have watched a lot worse movies then this. could have been a pretty good movie but just falls flat and it is very very predictable. no one acting performance stood out and a very average movie based on the ratings that it received. i would rate this movie a 5.5 out of 10, if you can't find another movie that you want to watch then try this. it is definitely not a first or second option movie.","user":"bcheng93","rank":[33,46]},{"title":"A good idea but badly done","rating":3,"date":"4 January 2015","review":"The idea behind \"Reasonable Doubt\" is a pretty nifty one, (a young, hotshot prosecutor is involved in a hit-and-run and then finds himself prosecuting another man accused of the crime, and that's just the beginning of his problems), and to be fair what follows does make for a moderately exciting, if a nevertheless, preposterous thriller. (It also helps that Samuel L Jackson is involved). But while the initial idea may be good, the script is atrocious and Dominic Cooper's performance as the prosecutor is way off the mark; he just seems to be going through the motions and his character is impossible to take seriously. Nor does director Peter Howitt, (credited as Peter P Croudins) show any flair or apparent interest in the material. It's watchable in that of made-for-TV-movie kind of way but it could have been so much more.","user":"MOscarbradley","rank":[16,21]}]