[{"title":"Rememory","rating":7,"date":"16 February 2020","review":"It's a must see. Peter Dinklage shines in a compelling techno-whodunit that challenges the viewer to explore the concept of intrusive memory. Supported by incredible performances by Julia Ormond and the late Anton Yelchin, Rememory is an elegantly nuanced and disturbing tale that will leave you guessing until the end. A symptom and part of the daily struggle that is PTSD, intrusive memories bring back the past in such a way that you feel like you are reliving that past moment with brilliant clarity, unable to escape it. Rememory looks at the nature of memory and shows the world what it is like to be in the moment of an intrusive memory that seems so real that it forces you question the very nature of reality.","user":"MR_Heraclius","rank":[35,36]},{"title":"Peter Dinklage is worth the watch.","rating":7,"date":"12 September 2017","review":"I don't know if this is the first time Peter Dinklage leads his own movie, but hopefully it will not be his last, cause he really made this film. He just had me so into what was going on all the way to the big revealed in this murder mystery. <br><br>In it, Dinklage plays a man who lost his brother in a car accident, and can't remember the last words he said before dying. It messes him up badly, until he discovers a man who invented a machine that can recall and playback your memories and while he attempts to get a hold of this machine, the inventor mysteriously dies and he gets caught up in trying to find out how he died. <br><br>The movie is a little above average. It was an interesting mystery, mostly because of the cleaver plot device that centers around it (The machine that can record your memories, giving it a bit of a Sci-Fi appeal) but the real reason to see the movie is Dinklage who gives a fine performance to focus on rather than any loop holes you might find.<br><br>I think this movie took so long to get into theaters because of Anton Yelchin's death. They may have had to do some reediting or reshoots to accommodate his passing. It does not seem to effect the movie any, but who knows how good the film could have been if his passing actually did delay it's release. Plus, he's the other reason I went to see the movie. <br><br>I also enjoined Julia Ormond in the film, who played the inventor's widow. The parts she shared with Dinklage especially really pop out at you. I did not go into this to see her, but it was an extra added surprise. <br><br>Definitely something great to watch. A decent murder mystery with a cool plot point made really better with the help of Dinklage, Ormond and Anton Yelchin (RIP).<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[41,55]},{"title":"Last Thoughts","rating":9,"date":"7 December 2017","review":"It's great when a movie comes out and you hear about it, go see it and it lives up to your expectations. What's even better is when you discover a movie that no one else has talked about that exceeds any expectations you might have had. Those movies are far too often under promoted and tossed aside while less well made films are pushed hard. So I was stunned at just how good REMEMORY was.<br><br>Peter Dinklage stars as Sam Bloom. In the beginning of the film he's celebrating with his brother Dash (Matt Ellis) who's landed a recording contract and is on his way to stardom. That night results in a car crash that kills Dash and leaving Sam with a fading memory of what his last words were.<br><br>Fast forward a few years later and we see that Sam is a professional figurine maker. He goes to listen to a speaker named Gordon Dunn (Martin Donovan), a scientist who has created a machine that allows people to record and then watch their memories. The goal is to help people with diseases like Alzheimer's or brain damage that removed memories. Before he can speak to Dunn Sam watches several interaction he has with various people.<br><br>That night Sam goes to Dunn's office to speak with him but before he can get out of his car he witnesses several people enter and leave the office. The last is carrying a case with her, the prototype of the machine Dunn has created. She returns it to Dunn's home and Sam then enters and takes it with him. The following day word gets out that Dunn has died under mysterious circumstances.<br><br>Sam's original intent was to speak to Dunn to get help with that lost memory of his brother's last words. Instead he now finds himself with the machine and the memories of the test group that Dunn was working with as he perfected the machine. Realizing that one of them could be the killer, Sam goes through their memories and becomes an amateur sleuth as he tried to figure out if and who may have killed Gordon Dunn.<br><br>Along the way Sam also grows nearer to the solution to his own issue, those long lost last words. In his journey he'll talk to those members of the group as well as Dunn's wife, Carolyn (Julia Ormond). He'll reveal to her that he'd met Dunn once, in a hotel bar and that Dunn saved his life while telling him about the tragedy that he had in his own, one he shared with Carolyn. That meeting is what left Sam with the feeling that he owes it to Dunn to solve his death.<br><br>As all of this is transpiring Lawton (Henry Ian Cusik), the head of Cortex Dunn's business, is searching for the machine. Contracts have been made and need honored and without the prototype it cannot be manufactured. This puts Lawton in among the group of suspects in the death of Dunn.<br><br>The movie is a fantastic combination of science fiction and mystery thriller with the emphasis on the latter. This is not sci fi as laser beams and spaceships but a journey into the mind, research into the brain and what it holds. The glimpses of others memories recorded on bits of glass storage chips that Sam views help him to gain information that leads him to each person in the group. And with each one he moves on to the next as he discovers the pluses and minuses of the machine.<br><br>Dinklage is amazing to watch here. The character of Sam is a troubled one searching for the truth, a truth that may do him more damage than good. The other actors involved all do a commendable job as well, fleshing out the story that centers around Sam. The production values are perfection with great cinematography, effects, direction and writing. This is an involving story that holds you from start to finish.<br><br>As I said at the start, it's great when a blockbuster meets your expectations. It's better when a movie you were unaware of comes off better than a number of major releases that are out there. It's a movie that involves a story surrounded by the decorations placed upon it to flesh it out. Most movies work the other way round these days with little or no story at their core. That's what makes this movie one to seek out and watch.","user":"kirbylee70-599-526179","rank":[17,21]}]