[{"title":"A 'Kes' for the 21st century","rating":8,"date":"18 October 2013","review":"This film is stunning - a visually powerful glimpse into a savage, precarious world, with humour and tenderness. <br><br>It can't just be reduced to a political diatribe, although the post-industrial setting is bleak and the poverty grinding. Mainly it's the story of a young lad's struggle towards adulthood, ahead of his time and in tough circumstances, as he learns the hard way what it is to be a grown-up.<br><br>The echoes of 'Kes' are obvious, but with the destruction of that old industrial world the characters too are ambiguous and troubled. Arbor is a complex mix of ruthlessness, cheekiness and wit. We see his character develop from being a cocky little tawt to something altogether more complicated and touching...","user":"nicklpool","rank":[31,37]},{"title":"Single-handedly puts my faith back in British filmmaking. Powerful, unforgettable.","rating":8,"date":"20 January 2014","review":"Since Shane Meadows hit us with phenomenal This Is England in 2007, there's been a dusty spot on the mantle of gritty kitchen sink dramas that truly capture the modern current of low- class British life. Fish Tank has been the only contender since but it doesn't feel like it has stuck as firmly as England, which then spawned several mini-series that I really should watch. Instead, British film seems to be concerned with crowd-pleasers after the roaring but typical success of The King's Speech. BAFTA nominees for Best British Film have been questionable this year, with big budget or mainstream films such as Gravity, Mandela, Philomena, Rush and Saving Mr. Banks, all with big stars on their shoulders. The only exception in the bunch is Clio Barnad's The Selfish Giant, and is the only one that truly deserves the honour. Now that Steve McQueen has stepped firmly into the limelight with the powerful 12 Years A Slave, I must urge that Barnard is the next under-the-radar British voice that needs to be heard. <br><br>Loosely based off Oscar Wilde's short story of the same name, Clio Barnard's vision is comparable to a Ken Loach slice-of-life style but rather than the sloppiness and lack of clarity that style can bring, it's startlingly energetic and tight in its delivery. It immediately engages you with its opening scene of a cathartic pounding of rage under a claustrophobic bed then a sincerely moving image of holding hands, all from angry underprivileged boys. It's a rough world depicted here. Conflict is around every corner without exception. Characters step outside and witness kids chased down the street. The harshest swear words are thrown around without much regard for their consequence. It's intimidating, but our characters embrace it and dive in with both feet. It's a world of scroungers, those that see the resale value in everything and abuse that opportunity. It's a bleak life, but the film executes it in such an honest way that it doesn't feel preachy in the way that this is the limits of quality of life and future in the working- class north. Their immoral tunnel vision is one of necessity rather than choice. It's a cruel situation that the film immerses you without comfort.<br><br>While there may be a touch of melodrama with the theme of the mother's concern and the pacing it thrives off of seems unnatural, what makes the film work is that it still feels authentic in its performances and script. It's perfectly reflected in its terrific cinematography. It's rough and raw, but it's well-measured in its framing and characters don't get lost in its saturation. The real revelation is its lead performance, Connor Chapman, who gives a genuine and confident performance for his age. Mature, if not sophisticated, beyond his years to be able to take on a brutish character like this with such fearlessness. At first you feel animosity towards him, then a deep pity burrows deeper and deeper. Then the film utterly shatters your heart with its inevitable Shakespearean tragedy making it an unforgettable experience. Any doubts I had about the films power hinges on those fateful final 15 minutes. It may be bleak, but there's a thin ray of hope bursting through the grey clouds. The Selfish Giant single-handedly puts my faith back in British independent filmmaking. I hope this sparks a new era.<br><br>8/10","user":"Sergeant_Tibbs","rank":[31,38]},{"title":"'The Selfish Giant' is the sort of film that the British excel in","rating":8,"date":"23 November 2013","review":"'The Selfish Giant' is British filmmaker Clio Barnard's new film, set on the same Bradford estate that featured in her debut 'The Arbor'. Swifty (Shaun Thomas) and Arbor (Conner Chapman) are two thirteen year old boys, best friends who always seem to be upto something they shouldn't be in. But theirs is not merely a selfish path of youthful gratification, they know their parents struggles and want to improve their lives.<br><br>Victims of their circumstances, expelled from school and lacking a purpose in life, the boys drift aimlessly down a dangerous path. The boys hit upon a scrap metal scam, stealing copper cables left on a railway line by some just as untrustworthy individuals. They soon embark on trying to make a living from scrap metal, twinned with a fascination for horses. Swifty in particular has a gift with horses, and feels even more at home with them then he does with Arbor. He's the more sensitive and innocent of the two, Arbor's behavioural problems (ADHD) and big mouth tends to land them both in trouble.<br><br>The boys start to work for a local scrap-dealer named Kitten (Sean Gilder). Kitten shows no qualms about exploiting the boys' willingness to earn money, encouraging them to rent his horse and cart from him in order to collect scrap metal from sources that aren't legal. Kitten also runs an illegal horse-and-cart race, shown in one of the standout scenes, and he wastes no time in employing Swifty as a jockey. Barnard makes a subtle comment on child exploitation, but far more on the world commodities boom which has led to many people taking huge risks where copper has become the new gold. It also illustrates the waste that exists in society , plus how an entrepreneurial spirit can make money out of anything.<br><br>'The Selfish Giant' is the sort of film that the British excel in, and there is a point where you do get tired of yet another film about how grim it is up North. But you cannot fault the film, and if anything its nowhere near as bleak as you'd have imagined. First-timers Conner Chapman and Shaun Thomas are exceptional, as are the whole cast who give the whole film a naturalistic feel.<br><br>There's clearly a lot of anger in this film concerning the way society has let down these boys and forgotten about these communities. Barnard doesn't pull any punches but there is a surprising level of compassion and grace from the adults which really pulls on your emotions. For all the hardships they've suffered there's still something inside them which burns through their grim reality to reveal what it really takes to be an adult and a parent. The final moments of the film are practically dialogue-free, but you won't find a more powerful sequence all year.","user":"dipesh-parmar","rank":[15,17]}]