[{"title":"Tommy Lee Jones stars, writes, directs, produces & astounds in this journey through trust & the Wild West. Splendid!","rating":8,"date":"3 December 2014","review":"I need to get something off my chest: I'm not a fan of Tommy Lee Jones. I find him limited in range, much the same in most roles and, worst of all, he inexplicably won the Best Supporting Actor Oscar for The Fugitive, thus depriving Pete Postlethwaite for In the Name of the Father, Leonardo Di Caprio for What's Eating Gilbert Grape and Ralph Fiennes for his performance of pure evil as Amon Goeth in Schindler's List. In modern parlance, WTF? <br><br>But periodically, just occasionally, once in a while, he inhabits the screen in a manner that forces one to reconsider one's judgment. And so it is with The Homesman.<br><br>The Homesman is something of a surprise, and not just because Tommy Lee Jones is on remarkable form in it. Beyond a fine performance, the man writes, directs and co-produces it. Hell's bells, when did he become so damn good at everything? <br><br>In the bad old days of the pioneers in the Wild West, Mary Bee Cuddy (Hilary Swank) steps in when three women drift into various states of madness and need to be transported across the country to be cared for properly. Shunned by their husbands, denied help from the town's menfolk and at a time where rape and murder hides behind every outcrop of rock and every gnarled cactus, Cuddy sets off alone on her hazardous journey. She stumbles across George Briggs (Tommy Lee Jones), a drifter seated atop his horse, with a noose around his neck, waiting for his steed to grow bored and leave him hanging. Literally. Cuddy offers to save him on the condition that he accompanies her and so begins a particular kind of journey.<br><br>The Homesman is probably described by many as a western, but that's lazy. This is a road movie on horseback, a saunter across the plains, a journey through mistrust and emotions where a mistake or misplaced trust will result in death. It is a story of hope and love, not the romantic kind, but real love for one's fellow human being, regardless of whether they can, or will, reciprocate.<br><br>Shot beautifully with sprawling, dusty vistas that warm the heart and prickle the nape, the backdrop is a vast canvas of character and mystery upon which splashes of colour are smeared in the shape of wandering, human dangers.<br><br>Though they say little, the trio of women (Grace Gummer, Miranda Otto and Sonja Richter) are far more than peripheral characters or the MacGuffin; they are the substance that binds The Homesman and the reason for the drama, gentle though it is. As we saw in Mr. Turner, such characters can so easily become pantomime animals with over performance that slaps the viewer in the face and detracts from the whole, of which they are but a small part. Not so here. Grace Gummer, particularly, as the mostly mute but vacantly animated Arabella is terrific and we want to reach into the screen and gently push her back towards sanity. It is a beautiful, understated performance that remains in mind long after the event.<br><br>Tommy Lee Jones and Hilary Swank make a surprising double act but the chemistry is there in abundance. Both Cuddy and Briggs carry their own needs and daemons with them; neither would give the other a second glance ordinarily but circumstance prompts odd, emotional couplings and theirs is fraught with suspicion and obligation. It is fantastic to see Swank back to the form that brought her gongs and made us sit up and watch in Boys Don't Cry and Million Dollar Baby. This is a far less demonstrative performance, but no less steely or impactful because of it.<br><br>Tommy Lee Jones's performance is the most compelling, engrossing that I can recall. Beyond that, his direction is worth celebrating loudly. The Homesman is only his second feature as director (after 2006's wonderful but little seen The Three Burials of Melquiades Estrada) but there are hints that he may step into Clint Eastwood's shoes alongside Ben Affleck and Sean Penn. Just when we think we have the measure of this tale, he belts us sharply around the jowls, proving he has the mettle to surprise and shock us out of our complacency.<br><br>Maybe, after years and years of apparently coasting, broodily on film and staring into space, it will transpire he was merely absorbing, waiting for the moment to own both sides of the screen and captivate us.<br><br>You know what, maybe he's always been this good but I just didn't see it.<br><br>For more reviews from The Squiss, subscribe to my blog and like the Facebook page.","user":"TheSquiss","rank":[96,124]},{"title":"a dark bleak, grimy Western with soul and strong performances","rating":7,"date":"25 March 2015","review":"The Homesman, about a 31 year old (un-married/childless) woman (Hilary Swank) who takes up the challenge of bringing three crazed women across the Nebraska plains over five weeks with the help of a deserter-drifter left for dead (Jones), is in some ways meant to be a real Feminist Western (with a capital 'F'), and not in the way that a silly work like The Quick and the Dead was with Sharon Stone. Here, it's much more about depicting a time and place that was quite bleak and desolate and, in some spaces, without much hope. Ultimately Tommy Lee Jones, through the novel it's based on, sees a little more light at the end of the tunnel for his protagonist than, say, Eastwood did in Unforgiven. But it's a combination of things it's about, and emotionally the film does work quite well, in particular in the relationship that unfolds between the two leads.<br><br>If you're curious to see a western that has the love of the plains of the West visually speaking ala Ford, but has the dark contours of someone like Mann - and added to that those super dirty production designs and character realizations from Spaghetti Westerns - this might be it, at least up to a point. It's so unrelentingly dark in how it looks on at the deteriorating mental states of these women, and the desperation in the journey for Jones and Swanks' characters, that the few moments of humor are rather surprising - and welcome - especially when Jones first appears to Swank on the noose and the horse. It's the kind of scene that shows this actor, well into his 60's and pushing 70, trying something new in a performance (if only for a scene or two).<br><br>It's got a cast that is practically distracting for the who's who that shows up, mostly for one scene a piece: James Spader, Tim Blake Nelson, John Lithgow, William Fichtner, Meryl Streep (!) and Hailee Steinfeld (who appears almost to have wandered from the True Grit set to this one). There's so much going for the Homesman that it's a shame the script is uneven, and there's a plot twist two thirds of the way through that is sort of explained but not at all at the same time, and it leaves the film with a gaping tragedy that can never quite be filled. Interestingly, if you watch the behind the scenes on the blu-ray one of the screenwriters mentions the book left things unexplained as well. That might be fine in the book - or perhaps more was explained in other ways - but it still doesn't work, and what Jones goes for in awe-inspiring shots he leaves behind with some muddled story beats.<br><br>Nevertheless, The Homesman is a good Western, a solid western digging into the roots of the genre and mixing the unsavory and horrifying (not like a horror movie, just some repellant images at times, but for a point), though whether one will want to return to it like other, better Westerns is another story. It's the kind of picture I can't put down for its artistry, even if things can be looked at more critically, which may explain why it didn't find its way through the End-of-Awards-time (albeit it was accepted at Cannes).","user":"Quinoa1984","rank":[28,33]},{"title":"It's a hard film to watch, at times, but definitely worth it.","rating":9,"date":"9 January 2015","review":"'THE HOMESMAN': Four and a Half Stars (Out of Five)<br><br>Tommy Lee Jones directed, co-wrote and stars in this western/drama film (set in the 1850s midwest) about a 'spinster' and a 'drifter' transporting three women, driven mad by the hardships of the time, across the country. It costars Hilary Swank, Miranda Otto, Grace Gummer and Sonja Richter. It also features cameos by Meryl Streep, John Lithgow, James Spader, Tim Blake Nelson, William Fichtner and Hailee Steinfeld. The film was written by Jones, Kieran Fitzgerald and Wesley Oliver and it's based on the 1988 novel, of the same name, by Glendon Swarthout. French filmmaker Luc Besson served as a producer of the movie and it also features a breathtaking music score by Marco Beltrami. It's surprisingly dark, and extremely disturbing, but I enjoyed it due to it's strong character development, outstanding performances and odd beauty.<br><br>Swank plays Mary Bee Cuddy, a strong and independent 31-year-old woman from New York. She desperately wants to find a husband but can't, due to men finding her too plain looking (I don't think Swank looks bad at all in this movie, considering the film's time and setting). When the local reverend (Lithgow) asks for someone to transport three women across the country, to a church in Hebron Iowa, Cuddy volunteers. The women (Otto, Gummer and Richter) are all mentally ill and the church will provide the special help they need. Cuddy comes across a drifter named George Briggs (Jones), who's about to be lynched for 'claim jumping', and asks him for his help (in return for saving his life). The two make the long journey together and form an odd bond.<br><br>The movie has been called a 'feminist western', by many, and I'd definitely agree it's a strong female character study, about the hardships women faced at the time. Swank is outstanding in the co- lead and Jones is just as classic and tough as ever; he does (unintentionally I think) steal some of the female cast's thunder. Jones also proves he's an equally talented director (once again) and the movie is full of beautiful visuals, as well as haunting imagery. For me the highlight of the film is the beautiful music and the touching relationships formed by the movie's central characters (it also has a shocking and unexpected twist, at the end of the second act). It's a hard film to watch, at times, but definitely worth it; if you're a fan of the genre or even if you're not.<br><br>Watch our movie review show 'MOVIE TALK' at: http://youtu.be/1_bZp5ejQ4I","user":"Hellmant","rank":[55,71]}]