[{"title":"Lack Of Point Or Purpose Dooms This Messy Flick","rating":3,"date":"3 June 2018","review":"I'm always on the lookout for solid, emotional character dramas. When I saw that \"All Summers End\" starred Kaitlyn Dever of \"Short Term 12\" fame, I bought in hoping for perhaps a similar result. What I found instead, however, was a film that at best is a collection of teen drama cliches, and doesn't even achieve that middling \"success\" because the format used is so odd and pointless.<br><br>For a basic plot summary, \"All Summers End\" focuses on the teenaged relationship between Conrad (Tye Sheridan) &amp; Grace (Dever). One night, while messing around with his buddies (played by Austin Abrams &amp; Ryan Lee), Conrad participates in a hit-and-run type accident that leaves Grace's brother Eric (Beau Mirchoff) dead. While struggling with his conscience on whether to disclose this information, the situation is muddied even further by the fact that he and Grace have formed a romantic relationship.<br><br>There are a lot of films of this ilk (teen romance) out there, so \"All Summers End\" needed to do something to differentiate itself. Sadly, this does not happen in the slightest. Despite some great acting talent, the performances never seem convincing (likely because of a script that feels so predictable) or emotional. In the case of Devers, for example, I know this CAN happen (I absolutely revere \"Short Term 12\" and her performance is equally as strong in it), but it just doesn't happen here. The overall plot is also pretty bland and non-distinguishable: teens with friends, teens in love, mix in some tragedy, teens vs. parents, etc.<br><br>The worst part, however, is that not only does \"All Summers End\" not just coast by as a sappy teen drama, but the format in which the story is told (and thus how we are supposed to relate to the characters) is one of the oddest I've ever seen. I won't spoil everything here, but I will say that the opening prologue and closing coda, if you will, which follow one of the teen characters into adulthood, are about as asinine as storytelling comes. For the life of me, I just cannot understand why the filmmakers would think that these scenes are a good idea or add anything to the emotional cache of the picture.<br><br>Overall, I was extremely disappointed in \"All Summers End\". To be honest, I didn't have huge expectations for the film going in, but it failed to even clear that low bar. Despite being filled with talented actors, this one never gets off the ground and makes an emotional connection. Without any action or mystery, then, that is a death knell for this type of experience.","user":"zkonedog","rank":[33,40]},{"title":"call an ambulance","rating":6,"date":"9 September 2018","review":"An adult Conrad Stevens is still haunted by an incident from his first love. He (Tye Sheridan) is 16 when he first meets Grace Turner (Kaitlyn Dever). She tells him that he will love her when he already does. He joins his best friends Tim and Hunter to prank the quiet boring neighborhood. One of the pranks set off a chase by Grace's older brother Eric. It ends badly and Conrad struggles with guilt as he comforts a heart-broken Grace.<br><br>The teen sex is unnecessarily voyeuristic. Add to it the dark subject matter, it comes off with an awkward tone which would be better served with as little suggested sex as possible. As for the incident, I buy into it but I expected him to call an ambulance afterwards. There isn't much that they could do at the scene anyways. Did he go to bed right after? It's not the vote that is the fork in the road. It's whatever he did or did not do when he got home. That scene is missing. I love his mother's speech at the end. I would probably cut out the scene at the Turner doorstep after that. After the mother's speech, the movie has dropped the mic and it needed to wrap up quickly. I do like the dark tones but it could do more with Tim and Hunter. This is intriguing if somewhat conflicted.","user":"SnoopyStyle","rank":[6,7]},{"title":"A well done movie about consequenses.","rating":9,"date":"29 July 2019","review":"This isn't your typical teen movie. It has a darker and more serious tone, which makes it leagues above other fare in its genre.<br><br>Tye Sheridan stars as Conrad, a 16 y/o who on a night out with his friends takes part in a prank which has serious consequences. Conrad and his friends make some bad decisions by leaving the scene.<br><br>The remainder of the movie deals with Conrad's conscience weighing heavily on him over the decisions he made over the prank. These decisions haunt him even after he comes clean.<br><br>A good movie dealing with coming of age issues.","user":"Jack_Brock","rank":[2,2]}]