[{"title":"Bad Acting but Good Story","rating":6,"date":"14 July 2014","review":"It's true the acting in this movie would be improved if a computer read the lines and the croquette scene felt like it would go on for hours, but the story is as wonderful as a Lifetime or Hallmark Christmas film.<br><br>Either the acting gets a bit better after the croquette game or I was just worn down, but the unsurprising pay off at the end was worth the trouble. You have to be a sucker for Christmas movies to buy into any of it, but that's the joy of Christmas movies, they are just delightful indulgences that are probably the last bastion of good guys winning and bad guys either being put to shame or repenting, where the hero is actually someone trying to do the right thing. If you enjoy that formula you will like this movie.","user":"raybartlett","rank":[13,18]},{"title":"\"There's nothing that makes people of action crankier than being stuck in a slow-moving van\"","rating":4,"date":"2 September 2015","review":"I'll try and remain impassive as I write this review, but know that it was written under a drizzling cloud of disappointment. You see, having martial arts stars Cynthia Rothrock, Gary Daniels, Daniel Bernhardt, and Kathy Long - along with the added bonus of Western staple Chris Mitchum - together in the same movie would be a genuine dream come true, but only if it were a genuine action flick. It's no good to dwell on things that never were, but I spent the entire movie thinking how much cooler it would be if they were all fighting each other. It would certainly have been more entertaining, because SANTA'S SUMMER HOUSE is far from a new Christmas classic.<br><br>The story: A mysterious fog brings a van of vacationers to an isolated villa on the sunny California coast, where a jovial couple (Mitchum and Rothrock) offer them shelter. As it becomes clear that their hosts are none other than Mr. and Mrs. Claus, the guests are given the opportunity to address the personal problems that have troubled them for years.<br><br>To be certain, there is not one lick of action the film: no shootouts, chase scenes, explosions, or kickboxing of any kind. As odd as it is to see any of these stars in an entirely thrills-free movie, it's not entirely unexpected. For years, Rothrock and the like have spoken about their desire to branch out into other genres, and the family-holiday category was apparently among these. While this isn't a very positive review, know that the picture is at least better than the previous film Cynthia Rothrock did with director David DeCoteau (alias Mary Crawford). For all its faults, SANTA'S can at least keep its plot rolling and create the impression that it's building towards a worthwhile climax.<br><br>The acting is on the poor side. Daniels and Long do reasonably well and generate believable emotion in their roles as a troubled couple. Bernhardt's got more energy than anyone, but he loses the fight with the screenplay that turns him into an obnoxious jerk. Rothrock attempts to be wholesome and jolly but often comes across as a Stepford wife. Mitchum's incredibly forced \"ho ho ho!\" is painful to listen to. Supporting stars Elijah Adams Jessica Morris and Rachel Rosenstein don't elevate the standard by much.<br><br>The screenplay's pretty disappointing for its quantities of unnatural dialogue (\"I was born to be embarrassed!\"). Most of the individual conflicts likewise seem forced, with Jessica fretting that sister Rachel isn't growing up fast enough and getting upset that she practices photography. At one point, a game of croquet lasts for an uninterrupted eight minutes without any integral dialogue or development. Luckily, there are at least some nice moments near the end of the movie, (SPOILER) when Santa Mitchum gets his guests to confront their problems by having them read their old Christmas letters.<br><br>Technically, the feature toes the line between making the best use of its limited resources and just not looking very good. Expect to see a cheap budget reflected in the movie's production values, with corny transitional sweeps, time-killing environmental shots, blue filters instead of nighttime lighting, and the fact that the entire soundtrack is comprised of instrumental versions of holiday tunes that get quite old after a while.<br><br>In the end, this odd experiment is tolerable for 90 minutes but completely unworthy of that commitment. Aside from the fact that I still wish I could see these performers together in an action feature, their collaboration just doesn't amount to the kind of magical whimsy that one finds in the best Christmas movies. I do admire them setting aside the expectations of others to do a project that they wanted to, but man, I wish it could've been with a bigger budget and a better director.","user":"The_Phantom_Projectionist","rank":[5,6]},{"title":"Who thought this was a good idea?","rating":3,"date":"15 November 2019","review":"What a load of garbage! I don't understand how films like this get made. Who thought a movie like Santa's Summer House was a good idea? Did anyone involved in the making of Santa's Summer House think it was going to be a quality movie? Is the straight-to-video market so lucrative that trash like this actually makes money? So many questions that I couldn't care less to learn the answers to.<br><br>There's really no point in listing all the bad aspects of Santa's Summer House. Everything about it is bottom-of-the barrel. The plot is beyond ridiculous, most of the acting is horrendous (Christopher Mitchum proves yet again that acting ability isn't inherited), the lighting is gawdy, and the sound is so poor you can hear echoes anytime a character walks across the tile floor. The plot has a message that's pretty decent, but it's handled so annoyingly hamfisted that it loses much of its effectiveness. The entire time I was watching, I was just hoping and praying that 90s martial art icon (am I overstating it?) Cynthia Rothrock would do some sort of spinning-scorpion-five-finger-Shaolin-death-kick on the rest of the cast.<br><br>If it's so bad, then why haven't I rated it lower? Well, as bad as it is, it's not unwatchable. There are a boatload of movies out there much worse than this. And, like I said, it does have a decent message. Finally, I'll give it a point for hilariously casting Rothrock in the role of Nanna, Santa's wife.<br><br>3/10","user":"bensonmum2","rank":[1,1]}]