[{"title":"Very entertaining - if you can stomach the subject matter","rating":7,"date":"6 November 2015","review":"This film tackles some very serious topics; pedophilia, torture, murder - but the way it does that is highly unusual. I really liked the film, and it is certainly never boring, but it was a slightly confusing experience for a number of reasons. For example, the music and the cinematography in this film are fantastic, but they convey a sense of intensity and drama which somehow doesn't really fit with light tone and the dry, sardonic performances of some of the actors. And there is a twist which is rather well constructed, but it failed to leave an impact on me because its bleakness clashes too badly with the black comedy that preceded it.<br><br>So my verdict: This is a very entertaining movie - IF you can stomach the subject matter - with some truly excellent moments, but the tonal shifts seem a bit uneven. Maybe this story would have worked better for me if it had been played straight: a tense thriller with some darkly comic moments instead of a tense black comedy with some thrilling moments. Still - absolutely worth checking out: 7 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[32,36]},{"title":"Big Bad Men","rating":7,"date":"22 September 2014","review":"Though Quentin Tarantino might have been exaggerating the movie a bit by calling it the best movie of 2013, it would probably land somewhere in the top 15. The movie has both violence &amp; gore, but what really hits home is the psychological terror and the mystery of the identity of the killer. The slow details of the murder cases really clash with the motives of those involved and really makes you take a side with who you think is right and wrong. Though the movie doesn't reinvent the serial killer genre, but it does stand tall with its amazing cinematography and black humor. One of the better torture porns of recent memory (though not terribly graphic). Its on Netflix and certainly worth a watch!<br><br>Full Review at: http://www.simplefilmreviews.com/2014/05/big-bad-wolves-2013.html","user":"MattBirk","rank":[7,8]},{"title":"Dark, partially brutal yet surprisingly funny Israeli horror","rating":8,"date":"29 October 2013","review":"*No specific spoilers, merely in regards to plot outline*<br><br>A brutal sadistic child sex murderer is terrorising Israel.<br><br>Miki, (Lior Ashkenazi) is an uncompromising hard- ass cop who makes Dirty Harry and Cobra combined look like bleeding heart liberals. Miki is convinced that the killer is Dror (a great turn from a guy I've never heard of, Rotem Keinan), a mild mannered schoolteacher and is prepared to go to any lengths to get a confession, including beating his suspect senseless.<br><br>When his spot of police brutality badly backfires, he is suspended until further notice. However, not one to let such things deter him Miki resolves to get answers, even if it means kidnapping Dror and subjecting him to a bit of third degree in order to get his answers...such as what the killer does with his victims' heads...<br><br>However Dror insists- as he has insisted all along- that he's innocent, would never do such a despicable thing and that all of this is a horrible mistake. Miki is not impressed as he's convinced of Dror's guilt. <br><br>But ultimately it doesn't matter whether Miki believes Dror or not, because it turns out that it isn't Miki Dror must convince... it's Gidi. (Tzahi Grad) <br><br>Gidi is the one neither man have been aware of and he's a man on a mission. He may well have a murky intelligence style background of his own and he wants answers from Dror...because Gidi's daughter was the monster's- the Big Bad Wolf's, you might say- last victim. Gidi is implacable, determined and utterly ruthless and he will get answers. And if that means using the tools at his persuasion to torture said answers from his suspect, then so be it. And if Miki the upstart cop gets in his way, and doesn't see eye to eye with Gidi's plans, well that's just too bad...<br><br>Big Bad Wolves is a dark and rather brutal horror that's also infused with some surprisingly successful (albeit pitch black) humour that shouldn't, but does work for the film as a whole and actually balances out an otherwise quite dark and grim horror quite nicely and gives it a quirky unpredictable edge. It is NOT however a horror comedy but a quite dark horror with blackly humorous elements to it.<br><br>From the makers of Kalavet/Rabies (2010), (which I also liked for what it was) it's a marked improvement on its predecessor in terms of style, plot and character development and directors Aharon Keshales and Navot Papushado are two talented up-comers that any self respecting horror fan should keep an eye out for and I'm personally looking forward to their next potential project to see of they can offer up a third win.<br><br>8/10 a taut, well made and well acted horror thriller and well recommended for any horror fan.","user":"Corpus_Vile","rank":[31,47]}]