[{"title":"A nasty 9/10 for oculus!","rating":9,"date":"18 April 2014","review":"No folks, I'm not jumping on the bandwagon here. This film really is that good. <br><br>The beauty of the film is it's way of telling the story. The way the film jumps from past to present is just so well done. It not only tells the story in an interesting way, it also compliments the main theme of the film. Not knowing what's reality or fantasy. While I applaud the movie for this it also affects the movie in a negative way. At some points the story is getting so intense and interesting and then BLAM! Back to the past. Relieving all tension that was built up in the previous scene. But then again it leaves you in suspense, waiting for it to return to the present to see how things are going to go down. All in all it's just a very unique and tension building way to tell this interesting story.<br><br>The acting in the film is top notch in my opinion. The entire cast gives strong performances, and you actually care about the well being of these characters. The only character I didn't care to much for was Kaylee's fiancée. But I felt that particular character wasn't a main focus point for the story so it didn't affect the film in the slightest. <br><br>The film also has some very creepy and dark imagery that really sends chills down your spine. The ghostly images projected by the mirror are indeed scary and do give you an uneasy feeling for sure. There are a few jump scares that actually did catch me off guard and are well done. Before each jump scare there is a buildup of tension so that when the scare hits you, it actually hits you. The lighting is great and so is the sound and musical score. The movie isn't heavy on gore or special FX but that's not a big issue at all. The story doesn't call for buckets of blood anyways. <br><br>There really isn't much I can say that was bad about this movie because it really is a horror gem. A real slow burner that messes with your mind and sucks you into its cool storyline of the supernatural. I'd give it an outstanding score of 9/10, if you're a horror fan check this one out!","user":"MitchellCombden","rank":[196,275]},{"title":"Twisted Story with Excellent Performances","rating":8,"date":"1 May 2014","review":"Even though it wasn't as scary or gory, as I wanted it to be. It still managed to creep me out and get on my nerves, with it's very creative and elaborate story and excellent performances from all it's cast. I really enjoyed the chemistry between the two younger actors played by Annalise Basso &amp; Garrett Ryan, and the relationship they had as characters, which added a lot of heart and sentiment to the whole story. Moreover, this movie was more a drama with some horror, because it didn't played with the whole scare and gore factors, but instead it was more about the the story behind the mirror and the effect it had with the people that surrounded it. It would be a good idea to make this a franchise because of how extensive its universe could be, as well as how many different stories and characters it could incorporate and continue to haunt, even though it's ending was melodramatic to me, it felt conclusive and eerily heartbreaking. Overall, it was a very good little drama-horror film that goes more farther than you could imagine and think.","user":"hugorocksmy","rank":[140,205]},{"title":"Please see this film!","rating":8,"date":"11 April 2014","review":"This is a classic ghost story.<br><br>I won't spoil anything, but for a haunted mirror movie, I found it VERY effective.<br><br>There are only really 6 people in the film. The parents, and the children at 2 different ages. The film is not really linear, and it took me a while to get the flow of the constant changing from today and yesterday. Once I got it, I found it very clever.<br><br>What impressed me the most, however, is that there is hardly any blood, no nudity, no profanity, no sex, no gore and it scared the crap out of me!<br><br>No, it doesn't reinvent the genre (can you even really do that with the haunted mirror genre?), but it is a well crafted, well acted movie that really kept my interest all the way through.<br><br>The young girl was especially effective.<br><br>The film starts off slow and methodical and really hits its stride about the half way mark.<br><br>We need more films like this. Smart, clever \"little\" films - a few characters, a few props and lots of chills and thrills.<br><br>Please see this!<br><br>8/10","user":"fritzlang","rank":[161,244]}]