[{"title":"Weird, wise and wonderful.","rating":8,"date":"11 April 2014","review":"Terry Gilliam has never found it easy to make one of his downright weird films. Studio interference has almost invariably led to project delays, postponements, and outright cancellations, with his final cuts emerging bruised, bloodied and - more often than not - broken. Interestingly, The Zero Theorem suffers from next to none of the scuttlebutt that usually accompanies a Gilliam film. Instead, this dense, complex, thought- provoking odyssey of human existence and (un)happiness feels like pure Gilliam: odd, uncompromising, but - at its best - almost breathtakingly brilliant.<br><br>In some not-so-distant, sparkly-bright dystopian future, brilliant and determinedly solitary mathematician Qohen Leth (Christoph Waltz) suffers through the tiny indignities of daily life. He's forced to leave the burnt-out church he calls home to report for work, where he crunches numbers for his clueless immediate supervisor Joby (David Thewlis). But all he wants is to stay close to his telephone, waiting for a call he believes will help him unravel the mysteries of the universe and his existence.<br><br>When mysterious head honcho Management (a silver-haired Matt Damon) finally gives him leave to work from home, Qohen is assigned the impossible Zero Theorem, a mathematical conundrum that has defeated many a mathematician before him. To keep him from going completely around the bend, Management sends him company in the form of Bainsley (Mélanie Thierry), a nubile young woman with whom he forges an unexpected emotional connection; and Management's own genius teenage son Bob (Lucas Hedges).<br><br>If you're looking for a plot that makes sense and progresses in logical fashion, The Zero Theorem is not the film for you. In Gilliam's movie, based on a loopy, mind-bending script by Pat Rushin, plot points are more often than not metaphors for the human condition. The script can be simultaneously literal and obtuse: Qohen lives in a hollowed-out church, a blindingly obvious symbol of the fading of traditional religion; he's waiting for a call - read: calling - that will free him from the humdrum banalities of a worker-bee's life.<br><br>But that's also where the film's genius lies. It's an explosion of philosophical ideas, asking deep, difficult questions about happiness, humanity and hubris - often in the same scene. Few films and film-makers would dare to so boldly confront existential issues on this scale and to this depth. The titular Zero Theorem, after all, requires Qohen to prove that everything is nothing: that the entire universe, filled with people, ultimately has no meaning. Qohen's strange, isolated journey hints at some answers, but not anywhere near all of them.<br><br>Gilliam could easily have failed on two counts: the seemingly stereotypical blonde love interest; and the annoyingly precocious teenage boy. But, within these archetypes, The Zero Theorem finds something fascinating to say. Bainsley starts out as a ditzy blonde dream girl, but winds up offering Qohen plenty of soul and an elusive, transient kind of eternity. Bob, too, is a whip-smart delight, a child more in tune with the silent beats and rhythms of the universe than any number of people older and purportedly wiser than him.<br><br>The film would fail catastrophically without a leading man capable of handling the tragedy and comedy of Qohen Leth - a character who, in habitually referring to himself using the royal 'we' , is a metaphor for every human being that has ever been and will ever be. Waltz is more than up to the task. He is hilariously effective when called upon to wriggle into a skin-tight virtual-reality costume, and devastatingly heartbreaking in the moment when Qohen refuses a chance at freedom and happiness to stay locked into the dark, nihilistic world in which he lives. <br><br>There are also a pair of wonderful supporting turns - slightly larger than cameos - from Damon and Tilda Swinton. The former clearly enjoyed his time working on The Brothers Grimm, one of Gilliam's most disastrous on-set experiences, and here, he provides a grim, mysterious counterpoint to Waltz's Cohen - the latter only appears to be impenetrable and tough to crack. Swinton, meanwhile, is a hoot as Dr. Shrink-Rom, Qohen's at-home, virtual psychiatrist, fumbling through their sessions with tons of blustery, false cheer.<br><br>Perhaps most astounding of all is the fact that Gilliam made a film that looks so good - in its inventive, kitschy way - on a shoestring budget of US$8.5 million. That's pocket change for most Hollywood films, and there's no doubt that everyone involved took a huge pay-cut to make The Zero Theorem look as great as it does. The special effects are mostly wonderful, and the neon-coloured world through which the black-clad Qohen stalks practically bursts at the seams with detail and imagination.<br><br>The Zero Theorem is emphatically not a film that will appeal to everyone. There are those who will find themselves incredibly annoyed by its philosophical navel-gazing, and others who might find Qohen's entire journey pointless and irredeemably self-involved. But, when it comes down to it, it's hard to deny the weird, wacky power of Gilliam's movie. The Zero Theorem so bravely grapples with big ideas and complicated metaphors that it's hard not to admire the director's great courage and even greater ambition.","user":"shawneofthedead","rank":[199,245]},{"title":"Sex, Pizza, and The Gospel According to Gilliam","rating":10,"date":"11 November 2014","review":"The Lord Management created the World. It was a world of connectivity and networks and total control. You need to be connected to this world to benefit from it, and the worst punishment ever is to become disconnected, The Lord management, who looks a bit like Bill Gates and a bit like Steve Jobs, is omniscient and omnipotent. He is everywhere, but you can't see him. He blends very well into everything, but his power oozes out of everything. Although he is invisible to your eyes, he is the real life and soul of every party.<br><br>And the lord sent his son, Bob, to save us. This prodigy son is always there when saving is needed, showing the way to tortured spirit by injecting a brilliant mixture of wisdom, energy and rather naive teenage spirit. The problem with the Lord's Son is that he is actually a rebel. He doesn't wish to be a tool, like the rest of Lord Management's creation, and therefore he keeps, subtly, inciting a form of existential rebellion.<br><br>And the Lord Management wanted to test the integrity, safety and sustainability of the world he created, and its ability to stand against the invincible and perfect powers of death and oblivion. The Lord, therefore, commissions The Devil , Lucifer, Known in the Movie as Qohen Leth, to do that Job--using him as a tool.<br><br>The Devil Leth's job is to test if all this creation could add up to zero or collapse into nothingness once again. Leth's success would mean the identification of the conditions that could lead to the collapse of Lord management's world. His failure, however, would prove that the Lord's creation is perfect , sustainable and safe (despite lacking any real purpose or meaning other than survival for the sake of survival, or for the sake of Joy--which is the carrot the Lord dangles in front of the eyes of his tools to keep them running) And the Lord decides to dangle a carrot before Qohen Leth's eyes to keep him stimulated to do his job. He decides to send him joy , which comes in the form of sex and pizza deliveries.<br><br>At first, The Devil Leth is indifferent to the temptations the Lord send him. The Devil Leth had tried all the joys the world can offer and has grown jaded. His path of excess had led him to the tower of wisdom. he had lost his desires, his emotions, his heart and the lusts of his body and became \"Maximum brain, minimal body\". Thus, the Lord sends his son, bob, to tempt the devil to once again enjoy sex and pizza.<br><br>Bob the Savior is very successful in his job. He manages to endure the Qohen Leth's intolerable negativity and lack of motive and tempts him to once again connect to the Lord's world. His success is ultimate when he finally convinces the Devil Leth to wear the red suit of desire and enter the Lord's creation once again, eager for a quickie. In the End, and after lots of suffering from all sides, the Devil Qohen Leth becomes addicted to all the joys the virtual, carnal and culinary joys The Lord offers. Leth becomes motivated and works very hard, proving that The Lord's creation can never ever be equal to zero.<br><br>Leth's failure to prove the Zero theorem simply means the end of his contract with the Lord. His services are not needed any more. His job is done.<br><br>When Leth is fired, he realizes that he was really nothing but a tool, and the only real road to redemption is the one the Lord's Son, Bob, preaches at the every start before the journey temptation began. The only road to redemption is to disconnect from The Lord's World! To refuse to become a tool. However, the price of this is the deprivation from all the Lord's .<br><br>Thus, the three paradoxical commandments of Gilliam's Gospel are: -Connectivity equals joy, and also equals acceptance of the control of The Lord Management.<br><br>-Redemption equals freedom. Freedom equals disconnection. Disconnection equals loneliness--and death.<br><br>-A life is not different from death if it is a virtual life. Joy is equal to emptiness if it is no real joy.<br><br>Realizing this dilemma of our existence, Qohen Leth returns to his isolation. He tries to make the virtual world he created for himself more real by, simply, committing suicide. He allows the eternal sun fixed in its eternal dusk to final set and sink down into oblivion. When the night of death comes, Leth is happy, for what he experiencing is real. he even hears the voice of his beloved where they unite again--in another, better, and hopefully more real world, maybe? Terry Gilliam, if this is how you see the world, I bow to your genius, I applaud your mind... but I am very, very worried about your heart. I guess you really, really need some pizza","user":"tomsuthblack","rank":[24,27]},{"title":"A true Terry Gilliam film.","rating":8,"date":"1 October 2013","review":"I'm not very fond of reviews so i will be quick.<br><br>I love his movies. Brazil, Bandits, Munchhausen. They represent wonderful memories from my childhood. These are special movies. Not that I don't like the 12 Monkeys and the others, I love them. But those are special. Dream injections in VHS format they were.<br><br>The Zero Theorem? I really liked it. It felt like one of the special ones. Very little CGI, beautiful sets, great actors, crooked angles and a compelling story. I think most people will relate to the main character and his very explicit dilemmas. It is a satire of the world we live in today, as Brazil was back in the 80's. In many aspects they are very similar.<br><br>If you are a fan, watch it. You'll not be disappointed.","user":"photopunisher","rank":[195,260]}]