[{"title":"Overall Alright. Could of been better.","rating":5,"date":"5 June 2014","review":"Pretty much I see it like this, there was no apocalyptic event. The hospital they were in, which didn't seem like a regular hospital. More like a psychiatric hospital that gave off the impression of purgatory where 7 trapped souls awaited judgment.<br><br>The \"Light\" was more in line with Heaven and the \"Creatures\" were more in line with Hell. As the good ones in the group go into the light, and the bad ones had been consumed by the creatures.<br><br>Edward Furlongs character seemed to give off the presence of a Lucifer type being. Lurking in the shadows, only known by Jack giving somewhat not so good advice to him.<br><br>There were what looked to be \"patient\" files on the members of the group at the end where you see Edward Furlongs character sitting at a desk filing some away and discarding others in the trash. However it showed in Jacks file, he was a Doctor who drove his wife to suicide and that later had committed suicide himself if you stopped to read the obituary inside.<br><br>The one girl had even asked Jack at one point about his beliefs in Heaven and Hell. Jack seemed to have to come to grips in himself with what it was he had done before he could seek and receive judgment therefore ending the movie because he was the last person to be judged.<br><br>It had nothing to do with Schizophrenia or any other mental illness like stated in other reviews and compared in no way to Identity. The movie had a lot of potential but lacked a lot of finer details. Was very obscure. You never got to see any of the \"creatures\".","user":"DeviantHitman","rank":[27,36]},{"title":"WHY?","rating":3,"date":"1 March 2018","review":"Doesn't the shills realize that when they offer a 10 of 10, followed by raving about how great a movie like this is ....everybody knows they're not being truthful?<br><br>This movie is not absolute garbage, but it's not great either.","user":"Texan8","rank":[8,10]},{"title":"Isn't This the Movie That Guy Starred in?","rating":4,"date":"12 June 2014","review":"Some movies are so bad, they're funny - The Stuff. Some movies are so bad they'll make you cringe - Human Centipede. This movie, however, falls into the 3rd category of bad... the one that is categorized by looking at a movie selection a year later and thinking, \"Did I see that one before or not?\"<br><br>Everything about this movie just ranks as unremarkable. I saw a brief synopsis of the movie and figured it had potential. Almost 2 hours later, I'm wishing I had done something else with the past couple hours of my life though... take out the garbage, do the dishes... anything that I could show some result for!<br><br>The only portion of the movie that gave me the slightest jolt is when I connected \"Noah\" with \"that kid from T2\" (Edward Furlong) and it's kind of sad when the pinnacle of entertainment a movie provides comes from playing a \"5 degrees of\" game with the cast.<br><br>There's really nothing else to see here in this movie. It tries to steal premises from much better movies like \"What Dreams May Come\", \"Jacob's Ladder\" and \"Flatliners\" but fails at making an original, or at least entertaining story.<br><br>When the ending came (rather anti-climatically I might add) I was happy just to move on with my life.","user":"GreyBird77","rank":[11,18]}]