[{"title":"Don't Believe The Hype. It's Not That Funny","rating":2,"date":"3 July 2014","review":"First of all, most of these user reviews are made by friends of the filmmakers ( Yes Lucas Penn, i'm talking to you. You're listed as one of the cast !!!!) These guys obviously want to make a good impression On Nick Nevern and Jason Maza but please. You are fooling no one The film just simply ain't that funny. don't waste your money. They're trying to do what Shaun of the Dead did for zombie movies but they have fallen flat on their muggy faces. They are obviously trying to get as many people to watch this by putting out a massive campaign on Twitter and Facebook but it is not enough to mask the fact that this film isn't as good as it should be","user":"jamesdeakins26","rank":[32,46]},{"title":"Misfiring lampooning of soccer hooligan films","rating":2,"date":"7 September 2014","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning<br><br>Danny (Jason Meza) is the off-spring of his father, a once legendary football hooligan who has disappeared from his life. After being expelled from school and wanting more out of life, he crosses paths with Dex (Nick Nevern, also directing) another big name footie hooligan who's just been released from prison. Together, they go about re-uniting the old firm and trying to restore their former glory, but those days may be well behind them.<br><br>Even after they really ceased to hold their cult appeal, these British gangster/firm films still get put out a lot in the direct to DVD market, with a load of no name or little known actors in the lead role. So frequently do they appear, it seemed a fitting idea to make a film lampooning them all, and Nick Nevern's film is certainly thorough, sending up everything from Green Street, to more big time stuff like Goodfellas, only rarely to very funny result. It plays too much like a standard hooligan film, from the dialogue to the set up, and at times feels even more depressing than the usual such stuff.<br><br>Hyped up a fair bit by social media, with many of the cast and crew and their families allegedly behind it, it's all too evident why this enjoyed what could only have been the briefest of cinema visits. *","user":"davideo-2","rank":[8,12]},{"title":"Funny how?","rating":6,"date":"10 November 2014","review":"The poster should be an indicator! While this is dealing with real life events, it does make fun of them (and the people involved). If you didn't get the message then, you might get it with the movies intro. A very well known British actor has a cameo (actually you get more than one and you could ask, how they got involved in this, but it seems to have been one day of shooting and a lots of fun) were he's making fun of his image and how people perceive him.<br><br>Still not sure? The movie is filled with weird and strange humor. Not everything is a hit, but there's enough here to enjoy if you let yourself. Plus it does have violence thrown in there for good measure (in other words, does not shy away from it). It might have a very strange moment towards the end, that does break the comedy a bit, when it gets serious, but the movie almost even pulls that off. Decent enough, especially if you think there have been enough movies about Hooligans already ...","user":"kosmasp","rank":[2,2]}]