[{"title":"I highly enjoyed this new Toy Story short Partysaurus Rex","rating":9,"date":"21 September 2012","review":"So it seems that when Rex is with his regular Toy Story pals, he's often dismissed as a party pooper. So when his little girl new owner has to take a bath, she takes the dinosaur toy with her and he suddenly takes a new attitude. I'll stop there and just say this was quite another fun short from Pixar that brought a new take on one of the classic Toy Story characters which Rex's voice Wallace Shawn benefits from immensely. Certainly, those new bath toy friends certainly like him enough when he keeps the water flowing. Like just when things seem headed for something one way, an unexpected turn always comes. Really, all I'll say now is Partysaurus Rex was a fine short to watch before the 3-D re-release of Finding Nemo.","user":"tavm","rank":[12,14]},{"title":"fun fun fun","rating":8,"date":"26 March 2019","review":"Rex (Wallace Shawn) is ridiculed by the other toys as \"Partypooper Rex\". Bonnie takes Rex for the unenviable bath time. For a short time, the bath toys enjoy the party until the water is drained out of the tub. As the only one with arms, Rex is able to turn the water back on and start up the party once again. He proclaims himself as \"Partysaurus Rex\". Only it becomes more and more difficult to stop once the tap is turned on.<br><br>Toy Story is one of the best franchises around. It's a milestone in cinematic animation. The characters are iconic. Rex is a supporting comedic character. In this short, he is the lead and it introduces a whole new slate of wonderful characters. It's fun. Like any great party, one can't help but have fun. When the music starts and the party lights go on, heads start bopping and mouths start smiling. It's infectious. This is simply fun. Like the water, it's hard to stop once it starts. It also has a great button to the comedy. It's an overall great Pixar short.","user":"SnoopyStyle","rank":[4,4]},{"title":"An epic party","rating":8,"date":"8 November 2017","review":"This animated short film tells the story of Rex who accidentally messes up his friend's party. He gets called \"Party Pooper Rex\" soon afterwards. Hence, he decides to become \"Partysaurus Rex\".<br><br>The story is very simple, but it is really fun. The music is energetic and uplifting, the lights are psychedelic and there is even foam! The bathtub party is so epic that I wish I was there. Now I need to watch a film about epic parties of mega proportions!","user":"Gordon-11","rank":[3,3]}]