[{"title":"This was a bad movie, by jingo!","rating":1,"date":"21 October 2015","review":"This movie is a Fox News viewer's wet dream: factually inaccurate, racially insensitive, and wallowing in manufactured Christian persecution and martyrdom. We're so oppressed! We are only allowed to have our Christmas decorations prominently displayed in our homes and places of worship. They are stripping us of our right to force everyone in the country to acknowledge our religion too!<br><br>The guys at God Awful Movies podcast put it best: Will America Freedom Jesus? Will Jesus Freedom America? Will Freedom Freedom Freedom? Find out the Jesus to America Questions and Freedom, when we Jesus back for act Freedom of America America Jesus!","user":"lynnem-71856","rank":[30,41]},{"title":"Obvious agenda is obvious.","rating":1,"date":"13 September 2017","review":"This movie has come back in the news namely because the court case where Mike Huckabee robocalled everybody to promote this movie finally was decided and the makers need to pay out some $32 million dollars in damages. That's a little more than $10.00 per person though but it made me remember this movie all over again.<br><br>This takes place in an America that never was. It's an America where kids aren't allowed to bring bibles to school. There's never been any law like this on the books except you can't read from the bible in class nor can you teach the bible instead of actual history or science. It's a world where you can't have Christmas decorations anywhere. It's a world where kids never heard of Christmas carols because they don't play them on the radio anymore. In short, this is not happening anywhere in this country. <br><br>But that never stopped people with an agenda from pushing it and acting like they're the persecuted minority when last time I checked just about everybody in this country celebrates Christmas to one degree or another. <br><br>It's badly acted, poorly produced and has elements in it that simply aren't true no matter how much the makers want it to be true. <br><br>Avoid this unless you happen to like that kind of thing. Or even better, try to find a real Christmas movie if you're in the mood for one.","user":"Java_Joe","rank":[10,12]},{"title":"Facepalm","rating":1,"date":"28 July 2016","review":"How anyone rated this more than 1 is beyond me. Hamfisted Christian persecution complex propaganda.<br><br>They would have had to make a strong effort to make it worse.<br><br>Seriously? Anyone who gave this a 2 or more, have you seen a movie before?<br><br>Embarrassing for Christians, infuriating for the sane.<br><br>I'd rather have a sulfuric acid enema than watch this again.<br><br>I'd rather watch a soccer match than watch this again.<br><br>I'd rather have my appendage slammed between two biology textbooks than watch this again.","user":"pattyp-725-58249","rank":[12,15]}]