[{"title":"Rubbish","rating":1,"date":"1 February 2019","review":"My original rating for this film, was a 6. On further reflection I've come to the decision that that was too kind. One of the main problems I had with this film was that I found myself not really caring about their relationship. We all know that Nat is better off without Liam, who is incredibly annoying throughout the film. Liam, who is obsessed with Radiohead, becomes offended when a potential love interest calls them \"pretentious and depressing\". I thought that this was a perfect way to describe Liam himself, whose disdane for 'modern life' becomes repetitive and makes you want to bang your head against a wall. The main highlight of this film, for sure, has to be the the performance of Ian Hart. Although his part is small and under appreciated, his portrayal of Curve brings the humour so desperately needed to retain your interest. Nat finally leaves Liam after he embarrasses her in front of her boss and potential clients. After much moping on Liam's behalf, he at last comes to the realisation that he's been unfair to Nat and should have tried harder to make things work. Turns out that all he needed was a haircut. I will say that the relationship is more believable when the two are apart, looking back over their relationship, than they are together. As a hopeless romantic, I will say that the little scrapbook Liam makes for Nat is sweet and thoughtful, finally showing how much she means to him. Liam's character development, although rushed at times, helps the film find its happy ending. Overall, a forgettable romantic drama that takes more than it gives.","user":"smileykate","rank":[4,5]},{"title":"A bit of a Blur,Sterophonics,Cocteau Twins..etc","rating":7,"date":"4 October 2018","review":"I was a teen in the 80's and watched live artists regular, Madonna, Duran Duran, Wham, Micheal Jackson etc and then in to the 90's I was watching Stone Roses, R.E.M, Pulp etc and I was expecting life to keep churning out great bands and this is where this film kicks in. In era's of great music the 21st Century and it technology has made things quite boring...Hence Modern Life is Rubbish and a lot of people watching this can see where the main character is coming from . Its a British film and a bit gritty but you feel the chemistry between the two main stars. He looks like a rock star ( dark and moody) and she is that pretty girl next door with a smile that makes your day worth while. My only problem with this film is that there are so many good songs in this film and no Soundtrack album to buy, which is a bit ironic. So watch (and listen) and enjoy.","user":"richardellis-68323","rank":[5,7]},{"title":"Nice film, not a classic, but worth a look IMO...","rating":6,"date":"17 May 2018","review":"OK. Very few spoilers here and if there are some, they will be rather vague, so read on with confidence. ;o)<br><br>Its a romantic drama with nice performances from some likeable actors. Basically a couple of young people fall in love thanks to their passionate love of music, both a bit pretentious, then as the years go on, one of them grows up a bit and the other doesn't and it kills their relationship. And then... well, I won't tell you.<br><br>Josh Whitehouse and Freya Mavor are both excellent. Fine young actors who deserve a big break into the mainstream sometime soon. Ms Mavor is the more likeable character (Nat), though... Mr Whitehouse (Liam) is basically, an a-hole throughout much of the film, pretentious, constantly on the attack for no good reason at all and talking crap throughout... but I quite liked him because he reminded myself of ME when I was young and in a band in the 90's! Yup, I was once that guy. Aw, the follies of youth, eh... <br><br>What let me down about this film was the ending, which I won't spoil for you... let's just say it all went a bit 'Four Weddings And A Funeral'...<br><br>Oh, and Ian Hart, in his brief appearances, is superb, especially his last scene! <br><br>In summary, it's a nice enough flick (with some great tunes played throughout!) but could have been a little better... give it a go, though, eh? Hope you like it!","user":"kevcoe","rank":[3,4]}]