[{"title":"Complete waste of time","rating":1,"date":"1 January 2015","review":"\"The Formula\" or as synopsis says story about two engineering students who discover a mathematical formula to pick up women with ease.<br><br>Even if you think of this movie as an amateur or student movie it is still a complete waste of time.<br><br>From begging you will notice the horrible camera and awful sound, but that is not all it gets even worse, scenario is obviously written by a stupid teenager or someone completely untalented.<br><br>Movie starts as low budget boring story and it turns into nonsense and stupidity without any trace of comedy or romance mentioned in genre.<br><br>So just a fair warning don't waste your time on this one, because you can not even call it a bad joke.","user":"marko-colic","rank":[39,51]},{"title":"A complete disaster movie","rating":1,"date":"4 February 2015","review":"The movie name (The Formula) sounds as a good name and the main story idea (even if it's used before by some professionals) is good but we are talking here about a low budget amateur movie with too many reasons to hate it. The actors do not know how to act I was not convinced by any of them to be even a second or third actor in any other movie. A really boring movie from the start till the end, the sequence of the whole story line is not logic and the scenario seems to be written by a beginner. Really bad sound quality and bad picture quality too. They took too long time at the beginning in side talks that do not take you to the core of the story. There is no any kind of sense of humor, comedy scenes or romance. don't waste your time on it.","user":"eng_akramshetta","rank":[8,11]},{"title":"PEOPLE WANT WHAT THEY CAN'T HAVE","rating":3,"date":"26 August 2018","review":"Quinn (Brandon Baker), Graham (Mike Schminke), and Lee (Tyler Thirnbeck) share an apartment and have girl issues. As engineering students, Quinn and Graham have come up with a formula to \"predict and control people's thoughts\" something us old school guys call manipulation, a word that is never used. Things go well with the formula other than the fact they can't win the girl they really want.<br><br>There are no babes in bikinis. This is not a teen sex comedy as one might expect. All the sex is behind closed doors. The worse language was using \"taco\" in a slang adult fashion. This is a romance comedy drama without much of either. The film was rather boring, even the bloopers at the end lacked humor. Now there were a few scenes that I liked, such as Quinn bumping into TJ (Katie Goebel) at a bar. Nice little initial romance scene. Professor Millan (Reginald VelJohnson) had a few good lines, but in general the film was cliche and boring. 1 1/2 stars<br><br>Guide: No f-bombs, or nudity. Implied sex. Semi-adult talk.","user":"nogodnomasters","rank":[1,1]}]