[{"title":"Not a patch on Under the Wire but still pretty solid","rating":7,"date":"27 February 2019","review":"Telling the story of the last decade or so of Sunday Times' foreign affairs correspondent <a href=\"/name/nm1864908/\">Marie Colvin</a>, and based on <a href=\"/name/nm0107493/\">Marie Brenner</a>'s 2012 Vanity Fair article, \"Marie Colvin's Private War\", the film is nowhere near the quality of <a href=\"/name/nm1313338/\">Chris Martin</a>'s exceptional <a href=\"/title/tt8520614/\">Under the Wire (2018)</a>, a documentary about Colvin's last assignment, and how her photographer, <a href=\"/name/nm1672304/\">Paul Conroy</a>, got out of Syria after her death. Wisely, screenwriter <a href=\"/name/nm3885069/\">Arash Amel</a> and director <a href=\"/name/nm1292648/\">Matthew Heineman</a> choose not to tell the same story as Martin, focusing more on Colvin's life in London and her previous assignments, and concluding with her death. This makes sense, as the story of how Conroy got out is a movie unto itself, complete with plot twists, heroism, sacrifice, a villain who turns out to be a hero, and against-the-odds survival, and it's a story that's definitively told in Martin's documentary.<br><br>With this in mind, A Private War has its own merits. Avoiding hagiography, Heineman doesn't shy away from some of the darker aspects of Colvin's character (her refusal to accept she was suffering from PTSD, her alcoholism, her acerbity, her appalling hygiene), with the film more interested in asking why she did what she did rather than simply showing what she did. Part-biopic, part-journalistic drama, part-war movie, if A Private War has a salient theme, it's that of The Truth and the price that some people are willing to pay to ensure that that Truth is known; in Colvin's case, she paid with her mental well-being, and, ultimately, her life. It's by no means perfect, with some awful dialogue, scenes so on-the-nose you might need rhinoplasty after watching them, a tendency to over-simplify complex socio-political elements as binary oppositions, and an uneven central performance. However, it's a respectfully told story, the material is treated in a suitably serious manner, and historical authenticity is always paramount. Which is more than I can say for <a href=\"/title/tt6966692/\">Green Book (2018)</a>.<br><br>Opening in the Baba Amr neighbourhood of Homs, Syria during the 2012 Homs Offensive, the film then cuts to 2001. Colvin (<a href=\"/name/nm0683253/\">Rosamund Pike</a>) is embedded with a Tamil Tiger regiment in Sri Lanka, when she is hit by shrapnel from an RPG, losing the sight in her left eye, and forcing her to wear an eyepatch for the rest of her life. The film then gives us a summary of the next 11 years - her meeting with freelance photographer Paul Conroy (<a href=\"/name/nm1946193/\">Jamie Dornan</a>) in Iraq; the use of civilian digging equipment to unearth an unmarked mass grave of 600 Kuwaiti POWs in Fallujah; meeting and beginning a relationship with Tony Shaw (a criminally underused <a href=\"/name/nm0001804/\">Stanley Tucci</a>); an interview with <a href=\"/name/nm0300490/\">Muammar Gaddafi</a> (an unrecognisable <a href=\"/name/nm0712562/\">Raad Rawi</a>); and finally, her assignment (given to her at her own insistence) in Syria.<br><br>Although A Private War spends time showing us Colvin in Sri Lanka, Iraq, Libya, and Syria, it is just as interested in depicting the mental price she paid for her work. Examining how she processed the things she saw (or didn't process them, as the case may be), Heineman is more interested in the PTSD, the alcoholism, the bodily injury, and the loneliness. The film runs with the premise that Colvin was fundamentally correct when she argued that the real stories of war are not the socio-political causes of the conflict, or the military engagements, but the civilians caught in the crossfire (\"it doesn't matter what type of plane just bombed a village. What is important is the human cost of the act\"). Despite her honourable intentions, however, the film does suggest that Colvin was simply addicted to the adrenaline, doing what she did as much for her own personal needs as her commitment to a greater truth. Her insistence on going to the most dangerous places on Earth is depicted as a kind of vicious circle, with her inability to cope with the horrors she witnesses compelling her to seek out ever more harrowing subject matter. As she tells Conroy, \"I hate being in a war zone. But I also feel compelled, compelled to see it for myself.\"<br><br>The film also spends time on Colvin's private life, attempting to humanise her and round out the character, showing her tempestuous relationship with her ex-husband, David Irens (<a href=\"/name/nm0936353/\">Greg Wise</a>), her frequent clashes with her editor Paul Ryan (<a href=\"/name/nm0390903/\">Tom Hollander</a>), her descent into alcoholism, her refusal to accept help from her best friend Rita Williams (<a href=\"/name/nm0025458/\">Nikki Amuka-Bird</a>), her mentoring of young journalist Kate Richardson (<a href=\"/name/nm3849670/\">Faye Marsay</a>), her tender final relationship with Shaw. An especially telling scene in this regard concerns her eye injury. After asserting that she is unconcerned about losing her eye, we see her alone, looking at the injury in a mirror, with Pike conveying her sense of loss brilliantly. In another scene, she stands in front of a full-length mirror, completely naked, looking at herself with a curious sense of wonder. These moments reveal as much about her as the more expositionary dialogue-heavy scenes, and Pike's performance in these wordless scenes is really quite extraordinary, doing a great deal with very little.<br><br>Elsewhere, however, the performance is a little uneven. Pike certainly captures Colvin's mannerisms, to a degree of authenticity comparable to <a href=\"/name/nm0000234/\">Charlize Theron</a>'s depiction of <a href=\"/name/nm0943368/\">Aileen Wuornos</a> in <a href=\"/title/tt0340855/\">Monster (2003)</a>. However, there are several scenes that don't ring emotionally true, with the performance coming across like a performance rather than something truly lived. In particular, a scene in which Colvin berates Ryan for his lack of trust in her has the feel of someone acting (and overacting at that), with little sense of psychological verisimilitude. Indeed, even though most of the other characters are one-note or no-note (Shaw, in particular, is poorly written), they often feel more natural than Colvin, more realistic, with the actor portraying them not quite as visible. Pike is certainly intense, and her impression of Colvin is uncanny, but it takes more than an intense impression to anchor a real-life character, and oftentimes, Pike's performance is more showboating than soulful.<br><br>From an aesthetic point of view, it's worth pointing out that this is Heineman's narrative feature film debut, with his previous work confined to documentaries. Especially important in relation to A Private War are <a href=\"/title/tt4126304/\">Cartel Land (2015)</a>, in which he was embedded with a vigilante group facing off against Mexican drug cartels, and <a href=\"/title/tt6333056/\">City of Ghosts (2017)</a>, in which he profiled the Raqqa is Being Slaughtered Silently citizen journalist group who report on human rights abuses in Raqqa by ISIS. These two films show his familiarity with danger, journalistic risk, and Syria itself. What's interesting, however, is that whereas these films saw him bring cinematic sensibilities to documentary filmmaking, in A Private War, he does the opposite, bringing documentary techniques to a narrative film, especially in relation to the battle scenes, which have a gritty intensity. Along the same lines, the interview with Gaddafi reminded me of the meticulous pseudo-documentarian opening scenes of <a href=\"/name/nm0000520/\">Michael Mann</a>'s <a href=\"/title/tt0140352/\">The Insider (1999)</a>, where <a href=\"/name/nm0908794/\">Mike Wallace</a> (<a href=\"/name/nm0001626/\">Christopher Plummer</a>) conducts a similar interview with Sheikh <a href=\"/name/nm3871885/\">Muhammed Hussein Fadlallah</a> (<a href=\"/name/nm0193295/\">Cliff Curtis</a>) in Lebanon.<br><br>Although the film adopts a realistic perspective for the most part, there are some terrific visuals. The opening shot, for example, is an aerial view of Homs, showing the devastation and the shattered buildings, as far as the eye can see, with not a sign of life anywhere. It's an immensely strong image with which to open the film, conveying so much without dialogue, in a similar manner to the extraordinary opening shot of <a href=\"/name/nm0655683/\">José Padilha</a>'s masterful <a href=\"/title/tt0340468/\">Ônibus 174 (2002)</a>. Legendary cinematographer <a href=\"/name/nm0724744/\">Robert Richardson</a> shoots the battle scenes in a cinéma vérité style, employing handheld cameras, loss of focus, shallow depth of field, and asymmetrical framing. These elements work together to create a strong sense of immediacy and authenticity. Additionally, Heineman allows the rubble, bodies, injured children, and wailing women bleed from one war zone into another, to such an extent that each conflict is interchangeable with all of the others. This isn't a criticism, however, it's a visual representation of one of the film's themes; every war is the same as every other war, especially in terms of the civilians wounded and killed during the fighting. In terms of representing Colvin's state of mind, Heineman employs disorientating scene transitions, flashbacks, dreams, and sudden temporal jumps. Editor <a href=\"/name/nm1067898/\">Nick Fenton</a>'s work is also exemplary, increasing the pace of the editing depending on Colvin's mental state.<br><br>Although A Private War does suffer from the occasional clunky bit of dialogue and a slightly uneven central performance, it's a strong film. Telling a different story than Under the Wire, it doesn't shy away from the darker and less savoury aspects of Colvin's life, presenting her in a non-hagiographic manner, as someone fundamentally damaged by what she does. Unafraid of examining her careerism and setting it beside a more humanitarian and philanthropic interpretation of her work, Heineman and Amel also address the price that all war correspondents must risk paying, irrespective of why they are there in the first place. The film is deeply respectful of both the craft and the courage of such people, not the least of whom was Colvin herself. At one point in the film, she claims, \"I see it so you don't have to\". Heineman, however, suggests that she saw it so that the rest of could see it too.","user":"Bertaut","rank":[33,39]},{"title":"I'm split in half between acting and the story.","rating":6,"date":"27 January 2019","review":"If I was to rate this movie based on acting alone, Pike takes it to at least an Oscar nominee.\nBUT (it is a really big but) I simply cannot ignore everything else. This is real war propaganda, I mean it is strange how the movie speaks about the horrors of war yet only one side contributes to the horror and makes you want to celebrate the same war that the 'good' side is waging. Being informed about the wars in most of the countries and even living in one that was invaded by Nato... i just simply cant help getting sick of watching movies like this.<br><br>I mean she is with soldiers in that building that got hit and yet claims on live tv how there is no military target in that area?????? wtf.","user":"pavlemc95","rank":[97,157]},{"title":"Do not be easily deceived","rating":3,"date":"27 January 2019","review":"If you watched this Prima Facie and did no background research into the \"conflict\" in Lybia, Syria... No mention whatsoever of the US and HRC's involvement in Gaddafi's assassination, \"we came, we saw, he died\" were her very words during one interview, and not with anything even remotely resembling sobriety. You also need to understand the \"topple seven nations in five years\" the US agreed to. Lybia, Syria, Iran, etc. Or how the US and NATO forces back ISIS, shelled Assad's people. Some 500,000+ killed by the US weapons, etc. Not anything I want to be associated with, but that was my tax dollars, and yours if you are a tax paying citizen of the US. Taking nothing away from Marie Colvin's work as a journalist, but let's be clear. Assuming the film is accurate, she received awards from her company alone; it's not like they were industry awards, recognition, etc. No, I think this was more propagandist than factual.","user":"mwpowellhtx","rank":[117,202]}]