[{"title":"Fun, blood-dripping and dismembering entertainment...","rating":6,"date":"11 November 2013","review":"\"Fresh Meat\" is a tasty and lovely different dark comedy, pardon the pun.<br><br>The story is about the Crane family, who become captives by a group of criminals on the run. However, the Crane family has a secret of their own, and the lid is about to come off, and the soup in the pot is filled with various parts of meat, tasty meat, human meat...<br><br>What makes this movie entertaining is that it has just the right of dark comedy, action, thrills and satire to keep a great twist to the movie, and just when you think you got it all figured out, the movie takes another turn, thus leaving you baffled and in awe.<br><br>The characters in the movie were colorful, well thought through and executed - again, no pun intended - on the screen by the various talented actors and actresses on the cast list. And the characters were so wonderfully absurd that you can't help but get immersed into the story and it is as if you are right there in the midst of all the cannibalistic chaos.<br><br>If you enjoy movies such as \"Black Sheep\", then chances are very likely that you will enjoy \"Fresh Meat\" as well.<br><br>The ending of the movie was really the only thing about the movie that wasn't in tune with the rest of the movie. Personally I found that ending to be downright ridiculous and insulting to people in the audience who were otherwise thoroughly entertained by the movie right up to the very end, when it all crashed like glass falling on the floor. That ending was just idiotic.<br><br>\"Fresh Meat\" is a fun movie that will prove appealing to anyone that enjoys dark comedy and satire. And the whole part about the prophet Solomon Smith, was that a subtle sarcastic caricature on the Joseph Smith prophet from the Mormon religion? Well, I can't claim to be very traversed in neither Mormon religion or Maori religion.<br><br>Regardless, for a fun and different comedy about a very dysfunctional family, then \"Fresh Meat\" is a great choice.","user":"paul_haakonsen","rank":[10,11]},{"title":"A mildly entertaining comedy","rating":7,"date":"27 July 2013","review":"I saw this at Pifan 2013 in South Korea, and well, I wasn't expecting a horror comedy but got one. There were funny moments in the movie but well, the gore wasn't necessary.<br><br>I also wanted to see the actor T. Morrison but this was far from his finest hour. This film is basically a mix of gore, sex and a series of one-liners and while I didn't regret seeing this, I'm not sure I can recommend it.<br><br>I gave it seven out of ten points because there were entertaining moments, but I sure hope Morrison gets better roles to befit his acting talents.","user":"peter07","rank":[7,9]},{"title":"Unashamedly entertaining!","rating":10,"date":"25 October 2012","review":"Fresh Meat is that rare beast that you never find elsewhere in New Zealand cinema: a film that unashamedly knows its purpose is to entertain, and thus spends 90 some minutes trying to blow our heads off doing that with a heady genre mix of action, horror, black comedy, pink hot pants and even lesbian school girls.<br><br>From the opening frames- seeing a young Maori girl 'discovering' herself (and a female friend) in the shower you realise you're not in for your normal NZL film (you know plodding artsy bleak BORING AS HELL). The filmmakers seem to have their tongues firmly in cheek and want us to have a great ride. And we really do. <br><br>The pacing is excellent: it's ferocious, and doesn't let up. It reminded me of a cross between Tarantino genre homages, Bound (the Waschowski brothers' lesbian crime romp), Wes Craven's Scream, and Once Were Warriors (but only if it was remade as a zombie film). It's a heist caper crossed with a black comedy crossed with a cannibal thriller, but to pin it down to any one genre feels limiting. <br><br>The performances generally all work. However, Kate Elliott is amazing as the tough-as-nails bi- sexual co-leader of the Tan Gang, Gigi. She's hard, sexy, and talented enough to bring a great deal of heart and depth to a role in which a lesser actress would be at risk of being upstaged by those (admittedly, amazing) pink hot pants. Watching her kick ass for 90 straight minutes is worth the price of admission alone. <br><br>Hanna Tevita is great also as Rina- the female protagonist at the heart of the film. Coming home from college, she discovers that her family are actually cannibals, yet before she has a moment to process this, she has to deal with a hostage drama in which she falls in love with her captor. Great stuff, and Tevita certainly provides the necessary eye candy. <br><br>But it's Temuera Morrison that (almost) steals this film. Poking fun at his previous hard ass characters, Morrison finds the right line between deadpan comedy and all-out psychopathic rage. The scene where he interrogates Rina's love struck vegan suitor by making him eat testicles at the dinner table is seriously good, and funny as hell. Good to see Tem nailing it. <br><br>Mulheron's grounding in comedy is on constant display. (The scene where the two girls are stuck in harnesses and try to 'eat' their way out is daftly brilliant.) Mulheron seems hell-bent on touching every overly PC nerve in our collective national consciousness (to have the words Maori and cannibalism in the same sentence is risqué enough, let alone making a film about it!) and it's this sense of manic, provocative energy that sets the tone throughout. <br><br>Great to see a film that achieves exactly what it sets out to. It's an unashamedly fun popcorn movie which gave me a great night out at the cinema. Go and see this on the big screen with a beer and a big audience. Anyone who doesn't like this film should go home and watch the Piano on DVD and have a good cry instead.","user":"wallacerichard25","rank":[27,46]}]