[{"title":"Outstanding true filmmaking you don't see coming from Hollywood nowadays.","rating":8,"date":"26 October 2018","review":"I was expecting a Hollywood ending, and didn't get it, yet I appreciate this film even more because of it.<br><br>This film was an outstanding true film noir (Google it) and the finest in filmmaking you don't see made in Hollywood anymore, as today's viewers wan't more action and thrills. I am one of those people, and I can't stand slow paced films, but this film is that one rare exception.<br><br>It's an emotional roller coaster ride that leaves you wanting more, and although it doesn't fulfill your expectations at the end, it's still a rare true artistic gem of a production.<br><br>Directing by Mélanie Laurent was perfection. The writing by Nic Pizzolatto was great, although I would like to have seen a little more 'drama' and 'action' added to the script, but that's just me. I also felt the ending was a little rushed and could have been more impactful. The length was perfect, but I wouldn't complain if it was longer with less of a rushed ending. The cinematography and score were on point. Ben Foster and Elle Fanning were outstanding, and all other cast members were great, although I felt Beau Bridges slick hair character would have been better cast by a more gangster looking actor - say Tommy Flanagan.<br><br>This film isn't for everyone, hence some of the low ratings, but for those who appreciate an excellent old fashion story-telling production out of the Hollywood ordinary, that has heart, this is for you.<br><br>A well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[91,120]},{"title":"Logline does a disservice to this AMAZING film","rating":10,"date":"4 November 2018","review":"If I had read this logline first, I would have passed on watching this incredible film. It is NOT an action drama about a hitman seeking revenge, and anyone thinking it is will be sorely disappointed (likely the reason for the low rating and some of the negative reviews here). It is a poignant, gritty crime drama about a mob enforcer seeking redemption. Heartbreaking, haunting and hopeful in the end, it is worth watching for the performance of Elle Fanning alone. The characters are well-drawn, the acting superb, the writing is compelling and the directing is intelligent - focussing on the aftermath and reactions to acts of extreme violence rather than going for visual shock value. The soundtrack also deserves a mention, supporting the plot without overwhelming it, in particular Fanning's a capella impromptu solo. This film deserves way more attention than it got and if it suffers from anything, it's poor marketing. Highly recommended.","user":"goldi-38533","rank":[59,79]},{"title":"Shockingly Intelligent","rating":9,"date":"23 October 2018","review":"It's hard to believe a movie this smart got made. It's not going to be a big money maker due to how mature and sophisticated the story is, the average mouth breathing popcorn muncher will not understand it.\nEvery character, situation, reaction and outcome is absolutely real. As a result it causes the viewer to experience real emotions while they're watching it, and stays with you long after.\nIf you're capable of focusing on just one thing for 90 minutes, then I can recommend you watch Galveston. If you're a phone fiddler then don't bother.","user":"the-real-max-g-force","rank":[93,132]}]