[{"title":"What A Pleasant Surprise!!!","rating":7,"date":"18 February 2015","review":"Ii never fails - movies that I purchase for download from Amazon turn out to be utter garbage which I cannot delete from my system quick enough (Skyline being the latest).<br><br>Along comes America's Most Haunted, and I decide to be prudent, so I rent the movie instead of purchase. And after watching it, I will also purchase it, for this is a movie that I can see watching every so often.<br><br>First of all, this is NOT a horror movie - it's a horror comedy, along the lines of Ghostbusters, although by no means as high-budgeted or with such famous actors.<br><br>Still, I found America's Most Haunted to be extremely entertaining, with characters I actually cared about, and although the plot was simple, it still kept my attention throughout.<br><br>The production was outstanding! The film looked great, the sound was clear, the music added the right mood, and the special effects were perfect given the subject matter.<br><br>Another pleasant surprise was how restrained the language was (something all too rare now-a-days).<br><br>I highly recommend this film if you're looking for light entertainment and have a desire to feel good when the movie is finished!","user":"smakar","rank":[24,33]},{"title":"Enjoyable little parody of those paranormal shows","rating":7,"date":"13 September 2015","review":"What a pleasant surprise this little film was. A nice, well acted horror/comedy even with one or two good (if mild) jumpy/spooky moments. The acting is of a good quality well carried off by the cast. After some of the incredible nonsense I've seen of late, this came as a real breath of fresh air. Most of all I'd say it is a clever, subtle parody of the many nonsensical 'Ghost Hunters'type shows which infest the airwaves yet prove nothing. The over all premise is that of a crew of vain, arrogant paranormal TV researchers who are shameless fakers and disbelievers who find themselves in a really haunted location with no idea how to deal with their situation. A fine piece of work from all involved.","user":"jackstupidjack","rank":[3,3]},{"title":"Scrappy Doo","rating":5,"date":"13 April 2015","review":"Bogus ghost hunters find ... a ghost.<br><br>Nice idea, plenty of humour packed into the concept. But the production is a bit sparse and needs all the music to keep things lively - problem is there's too much musics, so the atmosphere is Scooby Doos all the ways. In the end I suppose it's a mild satire on film making.<br><br>And too many characters - I'm sure a couple of the guys could have been folded into one, and the girl wasn't given much to do.<br><br>Acting is even, but the old timer is the only convincing one.<br><br>Camera-work nothing special, with too much reliance on overlays for special effects.<br><br>Overall, fairly engaging - and I did like the ironic ending.","user":"begob","rank":[2,3]}]