[{"title":"A great homage to the book.","rating":8,"date":"2 November 2013","review":"I saw The Broken Shore at the Adelaide Film Festival in October 2013, and thought it was a great homage to the book by Peter Temple. Without giving too much away before it airs on the ABC in 2014, there is some good acting by all involved, and the screenplay has been well written by Andrew Knight (using mystery and humour).<br><br>The one thing I will say about The Broken Shore is (and this was mentioned on the night of the screening) that it would have been good if it was made into a 6x1 hour mini series, which would have meant that more from the book could have been mentioned/explored. An example of this is the character of Erica Burgouyne, who seems quite interesting in the book (and in the movie as well) however she only has a couple of scenes in the movie.<br><br>However, overall, The Broken Shore is quite good for what it is and it will be interesting to read what other people think once it has aired on television.","user":"Intriguer","rank":[41,49]},{"title":"A simply cracking Aussie crime thriller","rating":9,"date":"10 January 2015","review":"This film is based on the novel of the same name by Peter Temple and to all accounts this production does do the book justice. Set in a rural coastal town that seems to be off everyone's radar - we meet detective Joe Cashin (played perfectly by Don Hany) . He used to be a big time homicide detective in the city; but after a life changing incident he has retreated to this backwater.<br><br>Then the sleepy town gets very shaken up when one of the local grandees is murdered. This is a man with connections - and apparently no enemies. As Detective Cashin starts to investigate he starts to uncover a story of complicit lies told over decades, police corruption and racism from both sides of the divide. He also has a new neighbour a new handyman and an Aboriginal cousin who is not the most reliable of relations. As the past is uncovered the tension mounts and this will have you transfixed.<br><br>This was a complete punt for me; I just stumbled across it on line and streamed it. It was part financed by Screen Australia and the cast are not that well known outside of Australia, but if the evidence of this is anything to go by, then we should be seeing a lot more of them. It has the tension, the humour and realism all perfectly balanced. An absolute gem and one that starts off brilliant and then just gets better - absolutely recommended.","user":"t-dooley-69-386916","rank":[12,13]},{"title":"If you appreciate British or Scandinavian mysteries, this may be for you","rating":9,"date":"16 November 2014","review":"As previously written, \"The one thing I will say about The Broken Shore is . . . that it would have been good if it was made into a 6x1 hour mini series\".<br><br>I agree totally. <br><br>This is a well paced, interesting movie which discloses much about Australian culture (which only an Australian could certify as true) set in a sometimes bleak but more often beautiful setting.<br><br>The pace reminded me of a Morse episode, but with a younger, excellent actor Don Hany.<br><br>The story appears to head toward a familiar ending. However, the ending is more satisfying than expected.<br><br>The movie begs for a sequel.","user":"steve2542","rank":[8,10]}]