[{"title":"Blood first, Business second, Friends third","rating":3,"date":"12 August 2015","review":"Not particularly impressive independent hood flick with lacklustre talent in front of and behind the camera.<br><br>First of all the movie the movie is about 2 brothers (Rico and O, poor O didn't even get a full name given to him just a letter) jumps from 3 different time-periods back and forth and it get quite confusing at times.<br><br>Not so much because the story is complex but because the characters that play the brothers in the different time periods look absolutely nothing alike, nor do they appear to be the same person in terms of gestures or anything.<br><br>And the person that plays O at like 12 looks like he's about 7 which is confusing because the person that played him at age 7 looked the exact same age! Just nothing alike in other aspects, meanwhile Rico at age 17 looks like he's 23 but there's only a 5 year gap between the 2 characters, yet at that period he looks old enough to be his father so yeah that was incredibly poor casting choices there.<br><br>Maybe the directors just gave roles to family members and friends based on age and not talent, who knows, either way it just doesn't work.<br><br>The script is not that much better though, they throw in a couple cheesy overdone gangster wisdom lines here and there but they just fall flat because of the delivery and the structure of the sentence like \"once you know there's a rat in your house, there's probably more that you just haven't seen yet\".<br><br>Story is just the typical gangsta story we seen a thousand times before just most times a lot better.<br><br>And characters with questionable loyalties and ethics that simply doesn't make sense half the time.<br><br>Meh, give it a pass.","user":"Seth_Rogue_One","rank":[1,2]},{"title":"Surreal. Slight entertainment. Good dialog","rating":4,"date":"9 June 2015","review":"I can say that this movie was thrilling, had a good amount of action, and had a good enough story line to keep me watching. The story line for this should be this: One mistake can get you killed. The plot is about a man who is living in an urban society that is surrounded by crime and violence. He plays on the side that distributes drugs, but he isn't the average street hustler. He also has a family to look after and to make sure that they can grow up without falling to the hands of a criminal in the streets. The story follows the father (Edwin lee Gibson) The acting is as good as getting sushi from the gas station. While there were some of actors that stood out most of them weren't all that good. The father played by Edwin Lee Gibson had good acting skills that helped the movies motivational aspects actually feel important. Another character that did well was the son Rico played by Carter Redwood. He had strong skills at some points and other times it looked as if wasn't able to make his own character. Other relevant scenarios in the movie showed a picture of how people try to live normal lives while battling drugs in the community and having to deal with wars that start from drugs. The movie did do a good job of showing the consequences of what can happen when there is a miscommunication between people that want the same thing. It can be hard for people doing business that lack communication skills. This is the same as a bat looking for food without using their sonar to find food and eventually it is going to die. There are things that are just not going to work in a inefficient because they lack the resources and/or the knowledge to make adjustments that will allow the most positive gain. All of the criminals in this movie are looking to be on a come up and that's where the situation gets hairier than an Alaskan bear walking with Sasquatch. Things get really hairy when one of the characters thinks they have been doubled crossed. This movie could be the true life story of any individual that lives in a poor economic society and uses drug money as a main source of income. It seems that the people who live in these types of environments are prone to drugs, violence, and incarceration. With limited decisions in their day to day life they are forced trying to balance family life and business.","user":"s-jones9204","rank":[1,2]}]