[{"title":"Small Budget But Huge Heart!","rating":8,"date":"19 October 2014","review":"I read a review of this movie which, while honest, was brutally so. You have to accept a low budget movie as that and look beyond the lack of professional actors, expensive sets, and incredible sound design and look at the story, the heart of the movie, the effort that went into making it what it is. And with this in mind, 55 and Older is a wonderful piece of work!<br><br>Yes, there's issues on every level you'd expect to see when you've got more drive and ambition than dollars. But so what? The fact is they put together a movie with an interesting plot, interesting characters, some fun ideas, and they delivered. While it might be nice to see this same story done again with all of the benefits of a large studio production, there's something incredibly endearing about 55 and Older just as it is! <br><br>Personally, I LIKE that its filled with non-actors. I like that you can feel the sense of \"We're doing this and its going to be fine\" throughout.<br><br>I won't give away the plot though its fairly simple and straight forward. There are no huge twists, no surprises, but that's okay and very in keeping with the characters, setting, and story.<br><br>The 90 minutes I spent watching this film were fun! I laughed and had a good time. And isn't that why we watch films to begin with?<br><br>55 and Older deserves recognition for delivering a nice story with likable characters on a constrained budget. And that's just fine.","user":"mike_weiner","rank":[7,10]},{"title":"Enthusiastic, but disappointing","rating":2,"date":"17 October 2014","review":"I liked the premise of this, sounding a little like Old School and expecting a recent Hollywood mindless comedy decided to watch it one afternoon...<br><br>After some decent credits set to an old style cine film, we're plunged into the actual film - wow, what a strange film!<br><br>Firstly, it's immediately noticeable that the production is VERY amateurish:<br><br>Sound - weird protracted scenes in near silence to completely inappropriate background 'music'<br><br>Camera work - literally looks like it's been shot with a $100 camcorder and occasionally a mobile phone. The focus zooms in and out randomly, whole scenes are blurred etc.<br><br>Acting - utterly awful and obviously full of non-actors. The main actor talks like Kermit the frog and I assume the character of his father is his real father, as he sounds the same and can't act at all. Why do all the old people randomly walk around holding out their hands palm upwards like weird zombies?<br><br>Plot - absurd, and not in a good way. The main couple look like exactly what they are - 20 somethings with absurd wigs and talcum powder on their face. What is with the weird geeky friend and older boss and their pointless and boring 'dating' lessons and gay jokes - the film just randomly flips to this and back again. At times it moves so slow it's difficult to remember what the film's supposed to be about.<br><br>Overall, this reminds me very much of one of those obscure and cheesily retitled ultra low budget 'Troma' releases from the mid eighties, like Fat Guy Goes Nutzoid.<br><br>I liked a few things, like the opening 'wake up scene'...OK actually that's all I liked.","user":"laymonite-2","rank":[5,7]},{"title":"I could not stop watching","rating":8,"date":"29 March 2019","review":"This is the lowest budget, worst non-actors, hole filled script with go nowhere side stories I have EVER seen!\nBUT... that is why I could not stop watching.\nSuch a change up from any other movie out there. Horrendously awful.\nProbably made with a Dunkin Donuts gift card and the help of a homeowners association board over the course of one weekend.","user":"rjrreid-94427","rank":[1,1]}]