[{"title":"Not so much horror, thriller, or a survivalist film....more of a human story about finding lost love.","rating":6,"date":"31 August 2015","review":"For a zombie movie, it's worth a watch...However there aren't any huge fights, zombie hoard attacks, etc. None of the zombies particularly fill your mind with fear.... It plays more on an emotional level of trying to hold on to the things that make us human. I was a little bummed that apparently he survives with a razor, canned beans, a potato sack for a shirt, some matches, wine, a terribly cumbersome backpack, water that magically appears in cut up water bottles..(Okay you might get a few drops that way, but let's get real) he also has a gun, a seemingly endless supply of matches and at least 5 candles lit every night, as well as a cabin in the woods with a ham radio......a place we know those supplies just fall into people's laps....And let's go ahead and say it, that cabin wouldn't last up to an attack with a small hatchet....otherwise The main thing was the acting. The main characters are all acted well....the supporting cast need some tips, however they were used mainly in cutaway scenes in reflections of the past, no real need for much of it, and much of it wasn't done....but hey, all in all...worth a watch...some of the personal drama and the love story was well done.","user":"spiritchaser-26477","rank":[6,7]},{"title":"In the end, Isolation is the least of your worries... Zombie drama on a budget.","rating":25,"date":"25 March 2015","review":"Wasteland is a post-apocalypse indie drama - soon to be released by Acort International. The central hero is Scott, who meets the love of his life, Beth in flash backs as he deals with the un-dead and loneliness. After some time, the two lead characters meet back up and then survival really starts.<br><br>With the rise of shows like The Walking Dead (2010 - present), zombie fans might want to check out this local horror/survival film shot in Derby, England. After watching the special features, it was interesting to see the break down of map shots and digital pallets to create a post- apocalypse world on a budget. I think that's what I appreciated most as well as the practical gore and zombie effects.<br><br>The film stars Shameer Seepersand, Jessica Messenger, Mark Drake (who appeared in Game of Thrones) and Rachel Benson.<br><br>Director, Tom Wadlow started of with shorts before shooting the feature and he had trained at Universal Studios and now runs Light Films, Ltd. with his wife.<br><br>Wasteland is written by local talent, Tommy Draper and Chris Newman helped edit and was Cinematographer. Music by Dave S Walker.","user":"John-Von-Shelton","rank":[17,35]},{"title":"Not your typically ordinary zombie movie but good nonetheless","rating":7,"date":"2 March 2016","review":"OK i wanna begin by saying that i have seen a great deal of movies and one thing i have been thinking about is that there are a lot of movies that has a lot more money invested in them than this movie the wasteland. The more money invested in a movie does not in any way make the movie better most of the time. Now to my personal review of this movie. This is not your typically high end zombie movie with a lot of zombies and action. this movie is little slower than your average zombie flick but its still a good movie. From the beginning i wanted to continue to look and thats all i need. The movie has a pretty good story and i think the actors is doing a good job. T he music score is well done in my opinion. i would recommend this movie and i have seen a lot of movies and its nice with a movie that is little different from everything out there.","user":"andreashager","rank":[3,4]}]