[{"title":"The fan-favorite classic: Expanded, elaborated and faithfully replicated","rating":9,"date":"19 October 2012","review":"One of the most beloved Batman tales finally gets the animation treatment. So influential was Frank Miller's \"The Dark Knight Returns\" that it inspired Tim Burton and Christopher Nolan when they were crafting their live action Batman movies, as well as the 1990s Batman animated series (which gave birth to an entire universe of DC animated shows). Warner decided to split the tale, originally spread over 4 issues, into 2 movies. Turns out that it was an excellent decision which not only successfully adapted the first half of Frank Miller's epic, but added layers to the story and characters that the limited page count of the graphic novel could not leave in.<br><br>Rarely does an adaptation surpass the original source material. But Dark Knight Returns part 1 is just such an example of an animated movie that is not only true to its source material, but expands upon it. The original was great; the animated adaptation makes it better. The story will sound familiar to anyone who watched Christopher Nolan's \"The dark Knight Rises\". It has been years since Batman went into retirement. Billionaire Bruce Wayne now drifts from day to day hoping that the people of Gotham can take care of themselves. But now, a new threat emerges: The Mutants. A vast gang of street thugs led by their grotesque but incredibly strong and savage leader. Despite his age, Bruce is forced to become Batman once again to save his city. But can the aging crime fighter stand up to a threat that is faster, stronger and more powerful than he has ever been? And what happens when Batman comes face to face with his old nemesis Two-Face? Beyond the narrative lies a thorough deconstruction of the Batman character, especially when played opposite the two main villains, Two Face and the Mutant Leader. Both villains serve as a dark reflection of Batman himself. Like Two Face, Bruce Wayne and Batman are presented as two separate personalities fighting for control. But is Batman truly just a mask Bruce wears? Or is it the other way around? And as for the mutant leader, both he and Batman operate as a symbol to inspire others to action. One a symbol of chaos and crime, the other a symbol of hope and justice. But if the mutant leader's extreme acts can rouse Batman to return to vigilantism, so too can Batman's actions rouse criminals to return to their old ways (as one character claims in the story).<br><br>The characters are brought to life by a fine voice cast who nail their roles perfectly. Peter Weller of Robocop fame takes the role of Batman; a role that may comes across as a monotone baritone at first. But Weller infuses Batman's voice with nuance and subtlety which fits the character well. The only downside is that despite wanting to show a dichotomy between Batman and Bruce Wayne, Weller uses the same tone of voice throughout the whole movie; Compared to previous voice actors, like Kevin Conroy, who used different speech patterns and tones for Wayne and Batman.<br><br>A lot of deep themes about the nature of heroism vs vigilantism abound in this tale, all of which were in the original comic but just expanded upon in the animation medium. On that note, the animation presented here is the perfect balance of fluidity and art detail. Iconic frames, memorable battles and atmospheric scenes are replicated faithfully. Movie goers will be able to see many scenes that Nolan's Batman trilogy lifted from THE DARK KNIGHT RETURNS, including a fight scene illuminated intermittently by a gun's muzzle flash. Its only downside is that Warner decided to use its generic color palate rather than replicate the muted tones and heavy grays colored by Lynn Varley in the original artwork.<br><br>Fans would be pleased at how true to the original this is and how it expands on the original, smoothening out the rough edges while adding a whole new dimension to the characters. The action is intense and beautifully animated, accompanied by an epic score by Christopher Drake. This is a true ADAPTATION that does not translate the comic wholesale but translates the comic while making full use of the animated movie medium.","user":"xamtaro","rank":[43,47]},{"title":"You don't get it son. This is an Operating table and I am the surgeon...","rating":10,"date":"12 September 2012","review":"A wonderful translation of the Frank Miller Novel brought to life on the Screen. Animation was excellent, the Tone was perfect and when watching this Animated Movie, I felt completely drawn in to the world that Frank Miller had created back in 1986. The movie was amazing and I cannot wait until Part two comes out. The second half of part 1 really set the tone for part two and it really leaves the viewer in anticipation - with a big smile...<br><br>At first, I was a little disappointing when I didn't hear Kevin Convoy's voice as Batman. But it didn't take long for me to get used to the choice they made to play Batman (Peter Weller). With an aging Bruce Wayne/Batman; he set just the right tone to the character. You can hear the struggle he goes through before finally deciding to don the cowl of the caped crusader once more - and when he does - he is back with a vengeance. A seasoned veteran with the knowledge and courage to take on crime... I loved it!<br><br>Congratulations to the team that brought us this great adaptation and I hope that this is just the first of many that can be brought to the screen...","user":"DJayXIII","rank":[110,127]},{"title":"Amazing! (spoiler free)","rating":10,"date":"13 September 2012","review":"I'll be short. I'm an 90-ties kid (now 21) and I watched a lot of batman cartoons and movies, and even read the comic on which this movie is based on. The movie shocked me how good it was made, the animation, the acting (even though batman isn't voiced by Kevin Conroy), even the sound is simply great. <br><br>If you are a batman fan, and watched the cartoon series, and movies, and even better if you read the comics you are absolutely going to LOVE this movie. <br><br>It's definitely worth watching it in theaters / or blue ray. <br><br>A+","user":"behy7000","rank":[67,80]}]