[{"title":"Disappointing","rating":5,"date":"15 November 2014","review":"I had been been looking forward to this for years now. I love good documentaries, about science, the cosmos, nature or history. I love submarine movies. I am a geek. If anyone was going to love this, it was me. <br><br>But I didn't.<br><br>For starters, the geek in me was very disappointed next to no time was spent showing off the technology. How does it work? How do you build electronics and camera's and other equipment that can resist that pressure? How do you navigate or communicate at that depth ? I was dying to find out, but I learned nothing. Even when things go (very) wrong in early test dives, no explanation is given of what failed, why it failed, how they solved it. Meh!<br><br>Then there is the \"plot\"; I get it that some time will be spent on Cameron's history, why he wants to do that etc, but it takes forever. Is this movie about an expedition or about James Cameron? If only they spent half the time that Cameron claims to glorify himself to talk about the sub, I might have like this.<br><br>Finally, there is the (anti)climax of the film. Not sure if this should be considered a spoiler, but when he finally dives to the bottom of the Marianas trench, it seems like he spent all of 2 minutes on the bottom and the most exciting thing he saw was some mud sliding. You don't even get to see a trench or underwater relief, let alone anything alive. Just sand. Now I get it, this was a documentary, not a scripted movie, but really, if that is all there is to see there, what a waste of time and money. Not too mention a waste of my time.","user":"duvel123","rank":[21,24]},{"title":"Good movie that takes you deep into the waters for a great adventure.","rating":6,"date":"8 March 2016","review":"If you're looking to go on an expedition but don't want to leave your couch, then James Cameron's \"Deepsea Challenge\" is the movie for you. It is about Cameron's journey as he builds a submarine to help him explore and research the deep sea ocean floor. It is a majestic science-filled journey that displays some great cinematic shots. <br><br>\"Deepsea Challenge\" follows James Cameron and his quest to reach the deepest part of the ocean and discover and collect scientific data. In 2009, Cameron started his plan to reach the deepest part of the sea. James did his final dive in his submarine, \"The Challenger\", located near the Mariana Trench. <br><br>\"Deepsea Challenge\" is full of underwater science. It talks about having to build a submarine for Cameron to dive in that will be able to withstand the pressure of the deep dives. If they do this wrong or mess up at all it could potentially put Cameron's life on the line. It also talks about deep ocean trenches. Cameron takes a dive into the deepest part of the ocean called the Mariana Trench. The trench is a result of the bigger, denser, Pacific plate colliding with the smaller less dense Mariana plate and is subducted under forming the trench. This is a great movie to watch if you are looking to learn about diving in the ocean and also about trenches.<br><br>This movie has a lot of ups and downs, more ups than downs, and one of those many ups is its scenery. Its film work is amazing and some of the scenes they capture make it feel as if you are there in the submarine with Cameron. Every time Cameron is in the sub descending deeper and deeper into the waters it looks so real it almost makes you feel as if you are there with him in the submarine. I watched this movie in my Earth Science class on a screen so I can only imagine if this was viewed in Imax when it released. One of the few downs is that if you aren't into science or the ocean this probably isn't the movie for you. I'm not a big fan of science and the movie seemed to drag a bit but the scenery makes up for it. One of the best scenes is when they show Cameron diving to the Titanic and they also show him diving to another sunken ship. <br><br>This movie is full of science but it also teaches another very important lesson. It talks about Cameron dreaming of exploring the ocean as a young boy. He worked hard and stuck to his goals and dreams and was able to achieve it. This shows that you can be whatever you want to be and you can do whatever you want to do as long as you set your mind to it and work hard enough. <br><br>If you enjoy the ocean and science, then this is the perfect movie for you. It goes along on a great adventure and teaches you a bit about the ocean. If you are the type of person that likes up- tempo action-filled movies, then you shouldn't watch this movie. This movie is rated PG. I think this is a good film as it takes you on an adventure that show you some amazing underwater shots. <br><br>I would rate this movie a *** out of *****.<br><br>My name is Elijah Moreno. I am 17 years old and I am a senior currently attending Porterville High School. I have played basketball all four years at my high school and that is the only sport I play. Outside of school I like to workout for basketball and get better.","user":"elijahmoreno","rank":[5,5]},{"title":"An Immersive Documentary","rating":8,"date":"26 October 2014","review":"The first thing that stands out about Deepsea Challenge 3D is that a lot of effort has gone into documenting the missions in a cinematic way. There are cameras everywhere: mounted on smaller submarines to show you the bigger ones; built into the walls; carried by divers; etc. All this is fluidly strung together to recount a fascinating story, and supported by a dramatic soundtrack.<br><br>The documentary doesn't only show you the Challenger Deep mission, but everything that has led up to it, and this includes tons of film-worthy material. We are given a track record of Cameron's almost romantic relationship with the deep, and this includes some deep sea exploration missions he has conducted using submersible robots, taking us into the monumental wrecks of the Titanic and the German battleship Bismarck.<br><br>A lot of attention is given to the design of the Deepsea Challenger itself, and the engineering exploits that were carried out during its construction and testing. Creating this one-of-a-kind \"metal coffin\" is an adventure in itself, especially considering that the conditions down there are in many ways more difficult to deal with than outer space.<br><br>Cameron's narration of his expedition log bears an uncanny resemblance to Jake Sully talking about Pandora, and while there are no straight-out action scenes, Deepsea Challenge 3D feels like a science fiction movie in the way it draws you in - but this time, you know that everything you see is completely real, even the crazy stuff. Some scenes are very tense and will have your jaw hanging in disbelief, such as the dramatic submersion from deck-mounted cranes in sketchy weather, or the extent of multiple systems failure during one of the manned test dives.<br><br>In the end, Cameron says he hopes this project will also inspire children to live up to their dreams, and indeed this film is likely to mesmerize most kids who see it. It sure made me feel like a kid, and it's very inspiring to witness the adventures of real life explorers.","user":"yuehans","rank":[14,20]}]