[{"title":"Molly Maxwell is a new feature film about a girl, her teacher and being extraordinary.","rating":9,"date":"1 March 2013","review":"A great Indie film that tells a very real story in a touching and unique way. This film deals with student/teacher relationships and everything about growing up and falling in love. Molly Maxwell is just your average precocious teenage girl... sort of. Her world opens up when she becomes just a little too close to a favorite new teacher at the alternative high school that she attends. In order to complete her requirements at school, Molly is forced to pick an extra-curricular elective, she chooses photography and arranges for her adviser to be the young and attractive English teacher. An innocent relationship quickly becomes an uncomfortable and forbidden romance. Actors, Lola Tash and Charlie Carrick, give excellent performances, showing a real chemistry on the screen. Dealing with growing pains of young love, forbidden fruit and awkward side of parenting, Molly takes us on a sexy, loopy, sometimes awkward and often amusing, ride.","user":"luc-p-stodelmeyer","rank":[22,36]},{"title":"Surprisingly engaging","rating":8,"date":"8 November 2014","review":"I have to admit I almost bailed on this film in the first 10 minutes or so due to a distaste of teenage shenanigans, but it turned out to be a nice little film with a great lead who I've never seen before. Lola Tash owned the role and it's refreshing to see characters and events depicted in a contemporary film story of this kind that aren't rendered as sitcom cartoon characters. I doubt this film will set any box office records any time soon (in part due to a lack of \"names\" in acting roles) but it's very well made and has the all important great ending that makes nice moves better. If anyone is wondering where to get a hold of it, rest assured - it's out there if you look. Watch it with someone :-)","user":"MongoLloyd","rank":[5,6]},{"title":"Good movie with bad end","rating":7,"date":"14 April 2015","review":"I liked the movie in general, but something was missing. I think the teacher and the girl were perfect couple honestly. It was love, not just attraction, but the end of the movie was really bad and left me uncompleted. After the middle of the movie passed by, I had the feeling something was missing. Even know it was kinda forbidden love, I wanted to see this love COMPLETELY shown...the end was horrible and kinda ruined the whole movie... I liked the actors a lot and they did a good job, but I needed to see more. I know love like this is forbidden, but come one guys...in movies we want to see something different and more interesting than the reality. So I had high hopes for the movie but I just feel unsatisfied somehow.. It is like I wanted to see that more, but I did not get it at the end. And this sad, open ending it was not good for the whole movie.","user":"topsi91","rank":[4,7]}]