[{"title":"A little generic & predictable but a movie that will keep you laughing and extremely entertained the entire time.","rating":8,"date":"12 January 2017","review":"\"Ten years, thirty countries no one finds us out and we can't even last a week in suburbia.\" Jeff (Galifianakis) and Karen (Fisher) Gaffney are a normal suburban couple with an average non-exciting life. When a new couple moves into the neighborhood they become friends with them, but the new couple has a secret. Now Jeff and Karen are put in the middle of a deadly high stakes deal with no idea what they are doing. First thing I have to say about this is that the movie is really funny and entertaining. There really isn't anything all that new and the movie is a little cookie cutter, but the acting and jokes make it seem fresh and exciting. The chemistry between all four of the actors is almost perfect and really helps the movie a ton. This movie won't win any awards or become a classic, but it is hilarious and I laughed throughout the entire thing. That is what a good comedy should do. I would compare this to Central Intelligence. You pretty much know what's going to happen the entire time, but you can't stop watching and laughing. Overall, a little generic and predictable but a movie that will keep you laughing and extremely entertained the entire time. This is a great watch. I give this a B+.","user":"cosmo_tiger","rank":[42,57]},{"title":"Better than people here say.","rating":9,"date":"6 May 2019","review":"Ya know, everyone in real life I know loved this film. It's fun. Then you come here and a bunch of civilians making comments about real life spies and tool bags hating on this flick. Whatever, watch it and consider it entertainment like it was Intended.","user":"sathervbc","rank":[11,13]},{"title":"Mr and Mrs Jones","rating":6,"date":"20 October 2016","review":"Greetings again from the darkness. Dozens of movies through the years make up the Spy Action-Comedy segment. Most of these lean heavily on either action (Mr. and Mrs. Smith, Red, Knight and Day) or comedy (Austin Powers, Get Smart, Date Night). The latest entry from director Greg Mottola and writer Michael LeSieur offers a more balanced approach while being somewhat grounded in familiar suburbia. Perfect casting certainly helps.<br><br>Comedies are the toughest genre to review because the only thing that matters  does it cause you to laugh?  depends on the sense of humor of each viewer and even their frame of mind while watching. So what I can report is that the full theatre at my screening was filled with enthusiastic laughter multiple times, along with a pretty steady stream of chuckles and giggling. This will undoubtedly vary from the accounts of uppity film critics who will discount the basic plot and obvious laughs (which is the whole point).<br><br>A James Bond-type opening credit sequence sets the tone as we abruptly shift to watching Jeff and Karen Gaffney (Zach Galifianakias, Isla Fisher) sending off their two sons to summer camp before returning home to their idealistic cul-de-sac suburban home. Things pick up when the new neighbors, Tim and Natalie Jones, arrive  a seemingly perfect couple played by Jon Hamm and Gal Gadot. They are the type of couple who are beautiful to look at, stylishly dressed, and even show up with a blown-glass sculpture as a gift for their new neighbors.<br><br>Of course, this perfect couple is really married spies seeking information from the military weapons contractor where Jeff works as a Human Resources associate. It's Karen who senses something is off about the perfect couple, which leads to her stalking Natalie all the way to a dressing room where she is comically intimidated by Wonder Woman in black lingerie. On a side note, Ms. Fisher does have a later sequence where she proves to be anything but a homely housewife, despite how that dressing room scene is presented.<br><br>The men head off for some male bonding – at a highly unusual specialty restaurant, leading to one of the more manic sequences in the movie. The four leads are all excellent, but it's Gal Gadot who is the real surprise  and her scenes with Ms. Fisher are the film's best. Both are allowed to shine, while the men are a bit more one dimensional. Galifianakias is the all-trusting good guy just happy to have some excitement in his life, while Hamm is the super cool spy (who wishes he wasn't). Both men seem to enjoy the chance to make friends, while the women are a bit more focused on tasks at hand.<br><br>Director Mottola is known for his films Adventureland and Superbad, and writer LeSieur is best known for Me, You and Dupree. The impressive thing about this latest is that the comedy mostly derives from character and situational interactions, and the expected steady stream of punchlines never materializes. There is even some insight into marriages that have become a bit too predictable, and the challenges of making new friends when all available energy is devoted to parenting and making ends meet.<br><br>In addition to the four leads, there are some funny moments for Maribeth Monroe, Matt Walsh and Kevin Dunn. The brilliant Patton Oswalt is cast as the self-nicknamed villain, and is responsible for one of the film's biggest laughs.<br><br>Of course, this is not subtle or high-brow humor, and the story line is predictable throughout. The laughs stem from the contrast of a subdued, comfy suburban life versus the sophisticated, over-accomplished jet-setting couple  laughs clearly enhanced by the talented leads. So while this seems like the kind of movie I would usually ignore, perhaps it arrives at a time when laughing is simply preferable to the daily grind of an embarrassing and humiliating Presidential race. So go ahead and give laughter a chance  it works even better than a stress ball.","user":"ferguson-6","rank":[41,64]}]