[{"title":"Why the low ratings and bad reviews?! It is funny!","rating":7,"date":"4 August 2017","review":"I really do not understand the extremely low ratings and bad reviews. It is a funny movie with really good cast. I do not laugh easily, but this movie made me laugh out loud several times. Moreover, there was not a dull minute in it. Every scene is either funny or action packed.<br><br>Some of the reasons behind the bad reviews are utterly ridiculous. Therefore, I am no longer choosing what I am going to watch based on IMDb reviews.<br><br>Finally, I want to add that I do not write reviews often, but after watching this movie and seeing the ridiculous comments and rating, I could not resist. If you want an hour and a half of fun, watch this movie.","user":"gpride2009","rank":[87,110]},{"title":"Good as any if any","rating":7,"date":"18 August 2017","review":"I'm not sure why so many low ratings. I would say it's better than a lot of other comedies out there. I thought it maybe on par or less with The Hangover. Goldie was great and nice to see her again enjoying herself. I felt there was nice chemistry between both Goldie and Amy. Good work Gals!","user":"mhgarney","rank":[42,53]},{"title":"Very funny comedy with poignant moments","rating":7,"date":"23 August 2017","review":"Wow, I'm really surprised at all the negative reviews. I thought this movie was very entertaining. I laughed out loud more than once. Amy Schumer yet again keeps it real for the ladies. She is not afraid to go there and that's one of the things I love most about her. A lot of the humor was raunchy but that's right up my alley. If that's not your thing, don't go see her movies. I don't understand why people rag on her because of that. It's like why are they going to see her movies to begin with if they're offended by her humor in general.\nThere was one scene between her and Goldie Hawn that brought a tear to my eye. Great supporting characters including Cusack and Meloni. Sure you have to suspend disbelief for some scenes but I don't think the movie was trying to be realistic or factual. The fact is this was a funny movie with women kicking ass. I loved it and am sure I'll watch it again sometime.","user":"Bodhi_Dusk","rank":[56,74]}]