[{"title":"Wow...this film is so original in style!","rating":8,"date":"28 May 2014","review":"Hélène Giraud and Thomas Szabo wrote and directed this highly unusual French film. Although the subject matter is rather familiar (with prior CGI films like Antz and A Bug's Life), the style and content is like nothing I've ever seen before—and this is, by far the biggest strength of this cute little film. However, I must warn you that initially I hated this film, as the beginning was loud and not especially enjoyable— but keep watchingit will grow on you!<br><br>When the film begins, it begins with a normal setting out in the countryside. This is not CGI but real film. However, throughout the film the two are integrated together. When you see the world from a human's point of you, it's standard film. When it goes to the micro world of insects, the CGI is used. It's a very clever way to do the movie and it works very well. However, what did NOT work well for me were all the sound effects for the racing bugs. Using automobile sound effects seemed a bit heavy-handed and silly. Fortunately, this soon gave way to a strange sort of world where instead of voices (like you'd hear in films like A Bug's Life), you hear a combination of odd whistles and chirps. It's strange but works—especially since this makes the film much more universal than a typical animated film. There's simply no need to re-dub or caption the movie! I should also note that I did NOT see this in 3D—and assume that would have improved itat least a bit.<br><br>The plot to Minuscule is not so childish or anthropomorphic as the other insect films I mentioned. In fact, the plot is amazingly simple. A group of black ants (along with their friend, a lady bug) find a lunch box filled with sugar and take it back to their colony. However, a group of red ants are NOT pleased—it should be their sugar and if the black ants take it, it's war!!<br><br>What follows is a very surreal war between the colonies—and the film improved tremendously. This is because all pretext for realism goes out the window and the movie really won me over! After all, MOST insect battles do not involve bugs bringing cans of insect spray, slingshots and firecrackers to the conflict! Who's going to win? See the film for yourself.<br><br>The best thing about the film is simply how different it is from everything else. Too often films are derivative and familiar—something that bores me to death. However, here the filmmakers manage to create something wholly new and clever. The CGI is lovely—and different from what you'd see from Dreamworks, Disney or Pixar. More noticeable is the music. It's almost magical and so unlike the typical child-oriented CGI film. It's instead very classically inspired and perfect for the film. Finally, the film has a cute sense of humor. While I don't think it's a comedy or is meant as one, I loved the expressions on the faces of the red ants. Despite a few slow moments here and there and the rough start, this is really a film to see. Will it appeal to little kids? Maybe not. But for older kids, teens and adults who want something different and not cloyingly sweet but still family-friendly, it's well worth seeing. Vive la différence!","user":"MartinHafer","rank":[41,46]},{"title":"funny sad and brilliant looking","rating":8,"date":"31 May 2014","review":"its a shame people won't watch this because they think its foreign. there is no dialogue just a great score and sound effects, the insects do speak in there language which anyone with half a brain can work out! the cross animation with real world looks stunning! this will slowly become an all time great when the masses slowly catch on. great fun for children and adults alike,having said that young children may find bits a bit too sad! its a clever story of kindness,bullying,friendship,and war! all i can say is give it a chance and you will be very glad you did! its not cheaply done and could be compared to the outstanding visuals of a pixar movie! enjoy!!!!","user":"wayne-robb","rank":[39,45]},{"title":"What a treat ........","rating":10,"date":"8 June 2014","review":"........ for anyone anywhere on earth!<br><br>Part of the beauty of this film is the fact that not one word is spoken! It's insect buzzing and beeping that tells the messages. So anyone can understand this story.<br><br>The story includes two ant colonies - one black ants the other red ants and in the mix is one lonely disabled ladybug! The black ants have something the red ants want. The blacks ants friend the disabled ladybug! The red ants prepare to attack the black ants - the story takes you to the finish!<br><br>A remarkable treat for the eyes and ears! You cannot tell where real photography ends and the computer graphics starts - it's that well merged!!<br><br>Bravo!!!","user":"cekadah","rank":[29,33]}]