[{"title":"If you can get over the annoying over done characters there may be the odd jump for you","rating":2,"date":"29 July 2013","review":"I am not sure whether it is by design but the low budget look and feel isn't really complimented by the ridiculous acting, which I can only hope is done on purpose. If it were not for my friend who wanted to stick it out the characters alone and the general over acting would have made me turn it off after the first 5 minutes or so. The scare factor did provide the odd jump and the story line could have been a great one if you could look past all that I have mentioned above. If you like the idea of Ouija boards, ghosts and people who never turn on the light then perhaps this might be one for you. I've given it 2 for the sure annoyance factor.","user":"emmajanegray1985","rank":[24,26]},{"title":"Amateurish and Laughable","rating":2,"date":"18 March 2016","review":"\"The Ouija Experiment\" is one of the worst horror movies ever released on DVD. The film is amateurish with awful and low quality camera work using handycam and boring. The screenplay is ridiculous, with a stupid story. The characters are laughable: one shallow young woman that shags her boyfriend that is a wolf and gives a Rolex to him; the wolf himself that only wants to shag women all the time; his sister, maybe the most reasonable character; his friend that wants to play with a Ouija board with the three previous mentioned imbecile characters; and the student of cinema that wants to film the group to increase his Blog traffic. The direction and performances are amateurish. If the viewer rent this DVD and watch until the end, the result will be waste of time and money. My vote is two.<br><br>Title (Brazil): \"Ouija: Onde Tudo Começou\" (\"Ouija: Where Everything Has Begun\")","user":"claudio_carvalho","rank":[9,9]},{"title":"I Should Have known Better","rating":2,"date":"10 January 2015","review":"It's Friday night and I was up late and just happened to see this was available to watch on Netflix,unlucky me. Another found footage nightmare.I have watched lot of low budget horror but this one takes the cake. This movie has the worst acting I have ever seen,and the story takes forever to get scary. They spent so much time arguing and bickering about one guys cheating that the whole story loses focus . If you are looking for low budget horror fun keep looking this is it not it. I didn't get scared or jump once. You have been warned. Watch if you want to take a nap. You may get a few laughs out of the YouTube references and the character Lynette was the only one who was funny or at all interesting. I don't know what else I can say about this movie,except they made a part two and I won't be watching that. I've had it with found footage.","user":"SpinSpinSugar69","rank":[7,7]}]