[{"title":"Did you like Pay it Forward? If so, you'll love this movie.","rating":10,"date":"6 March 2013","review":"If you don't watch another movie anytime soon, I encourage you to watch this film. This movie could melt a stone. You cannot watch this and not take anything useful away with you. It will touch your heart.<br><br>All the actors in this movie did a superb job. If you liked Pay it Forward, you'll love this movie. We all need something like this now and then. Watch it today. You'll be glad you did.<br><br>The young girl, Maggie, did a wonderful job. The power of her emotions is staggering.<br><br>Sam, aka Bernie Diamond, was simply amazing. We are blessed that he lived long enough to complete the film. He passed away shortly after its completion at the age of 89.<br><br>The older folks from the nursing home were heartwarming, to say the least. Again, please take some time and watch this film.","user":"dderose-626-157210","rank":[23,23]},{"title":"One of the most gentle spiritual films I have ever seen","rating":10,"date":"16 December 2012","review":"You watch lots and lots of movies, sometimes you look for good action, drama and even a good horror flick, but once in a while you come across a movie by chance that has the ability to touch in such loving way that you would have not imagined before pressing that Play button. The movie story begins when a rebellious young girl receives a heartwarming letter from an unknown source and the changes which follows in her life and people around her thereafter. THIS IS NOT A COMING OF AGE FILM BUT IS AN SPIRITUAL (non-religious) AWAKING FILM. The beauty of this film lies in its simplicity and its scripted in such gentle way that is very or may even impossible to find any pretentious message in the film. Its centers on how words can heal or hurt people and how we are carelessly use them among one another. It reminds us the power of receiving a hand written letter from a friend or family member in a way that no email, text, or twitter message can begin to encompass.<br><br>You will be hard not to cry in several scenes in this movie. I honestly believe this was a labor of love and all were involve in this project must have been touched personally.<br><br>There is no violence, vulgarity, etc. in this film and people of all ages can enjoy this movie. Highly recommend if you want a wonderful lullaby of a film","user":"geneariani","rank":[31,34]},{"title":"Sow Write","rating":10,"date":"15 December 2012","review":"This elegant film by writer-director Christian Vuissa conveys a fundamental principle of spiritual enlightenment that transcends theological dogma. If you are seeking a purpose driven life, you will find value in this piece.<br><br>The teenage protagonist negotiates the rough waters of female adolescence with the unorthodox guidance of an aging mentor. She realizes ethical and moral truths by observing his consistent practices of selfless giving. Embracing these tenants in her daily life opens the door to her personal fulfillment.<br><br>This is more of a coming to enlightenment than a coming of age film. The presentation is generally nonsectarian, and should be appropriate for viewers of any religious persuasion, and particularly those of no religious persuasion.","user":"ColeLuper","rank":[20,22]}]