[{"title":"...a slice of criminal life in the bayous","rating":7,"date":"15 March 2014","review":"just saw the rating of 5.6 on IMDb and that is just a run of the mill rating or a little above that. myself personally i give it a 7. it was not a great movie and it was not intended to be. it is a nicely paced cops and robbers movie with some solid actors in it.<br><br>man! i think i have not seen Bill Duke since his role as a commando in the movie \"commando\". OK..., the two main leads in the movie are actually Willem Dafoe and Matt Dillion with a good supporting cast including Amy Smart, Neal Mcdonough and a unrecognizable Tom Berenger in a very good performance and a fine Bayou accent.<br><br>like i said, if you're looking for Oscars look somewhere else...but if you are in the mood for a well-done cops and robbers movie with action you probably will not be disappointed. the movie is not unbelievable and is base on a true story. Dafoe and Dillion did not throw out any Oscar worthy performances but still did very solid jobs. they did not just come for their paychecks and Tom Berenger actually had the best performance out of the whole cast. he was a very creepy dude and i could not recognize him and he is one of my favorites.<br><br>all in all, a good cops and robbers movie that is pretty well paced, had its share of action and the 100 minutes of this movie went by pretty fast. i would recommend this movie to cops and robbers fans and fans of Dafoe, Dillion and Berenger.","user":"bcheng93","rank":[49,59]},{"title":"Could have been much better","rating":5,"date":"10 March 2014","review":"Bad Country is watchable with some real heavyweight talent and a setting that promises great viewing. But, because of poor character development and overall production it falls far short of anything but average.<br><br>No blame to Matt Dillon or Willem Dafoe, both carrying the movie with excellent performances. In fact, Dillon's involvement in almost any project automatically guarantees reliable entertainment. And Dafoe is as gritty and pained as usual, just what you might expect.<br><br>But, the script is shallow, the sound editing amateurish, and the overall cinematography average. The final, expected scene can't be saved by the actors when all the technical facets pull together in a below average manner.<br><br>This could have been much better. So many elements are in place that Bad Country practically screams for the sort of polish and technique the cast deserves. I have no doubt that in the hands of Mann or Bay demands would have been made and ideas enforced to carry this movie to the box office with some real effect. As it is, by the end I could only wonder what could have been.<br><br>Watch it, but don't expect much.","user":"bob-larrance","rank":[31,39]},{"title":"Another movie that has a great cast but isn't a great movie. There was just something missing but I can't tell you what it was","rating":6,"date":"22 March 2014","review":"\"I didn't turn because I'm scared. I done what I did because certain people crossed the line.\" Jesse Weiland (Dillon) is a contract killer in Louisana in the early 80's. Facing life in jail and never seeing his family again he makes a deal with Detective Bud Carter (Dafoe) to become an informant. When the FBI takes over things turn south for both Carter and Weiland. When his ex-boss goes too far Jesse has only one thing on his mind...revenge. I knew nothing about this movie going in and was looking forward to it because of the cast. The fact that it is based on a true story helps too. This is however yet another movie that has a great cast but isn't a great movie. I had a hard time getting into it and really caring about the characters. They all did a great job in it but there was just something missing. I can't tell you what it was but there was an element or two missing to really make me fully enjoy the movie. When you watch it maybe you can let me know what it was. Overall, great acting but not a great movie. Seems to be happening a lot lately. I give this a C+.","user":"cosmo_tiger","rank":[15,19]}]