[{"title":"Do not watch this film, it is bad.","rating":2,"date":"16 February 2020","review":"Well I thought I would see what all the fuss was about and boy did I wish I hadn't I have seen very bad romantic comedies that are better than this film","user":"MR_Heraclius","rank":[44,48]},{"title":"This movie raped my Intelligence","rating":1,"date":"11 February 2015","review":"This movie is atrocious beyond words, and the first movie from which I've ever walked out (an hour and 17 minutes into it). The session was full of giggling middle-aged women, wetting themselves with anticipation - I cannot believe this book and movie has appeal. Are women really so bored, so desperate, that this is what gets them off?? The acting was appalling - I guess that's the end of Ms Johnson &amp; Mr Dornan's careers. And I wouldn't be surprised if the actors who refused the role of Christian Grey are secretly relieved they had the sense to reject it! The script was laughable. No chemistry between the two leads. As for the 'eroticism'.....it was completely lacking. Stilted, awkward, poor cinematography, cheesy scripting. Just terrible. <br><br>Do not waste your time or money with this.","user":"sarangi2015","rank":[2,3]},{"title":"My god.. this was awful","rating":1,"date":"10 February 2015","review":"I don't want to spoil a lot, so ill just give ratings with a brief description on certain elements of this so-called \"film\".<br><br>Acting; 3/10. The acting was misplaced, awkward.. not to look at. At least convince us you're an intense guy, Mr. Grey. <br><br>Plot: 1/10. that wasn't a plot for a normal movie, it was a plot for soft-core porn.. which had as terrible acting in it as real porn. <br><br>Camera work/scenery/etc. 7/10 for what it is.. great camera work i guess and good scenery<br><br>Romance; 2/10. I've seen the notebook... that's romance. This is a poor attempt to romance. It tries to tell you they're madly in love, but it's just a weird sexual relationship.<br><br>Drama: 1/10. there is no thrill.. no intense things going on. There is no drama in this soft-core-erotic-drama. <br><br>\"The deeds\" 10/10.. they did it. so.. can't give it any lower points than this. <br><br>Overall, it's was horrible acted, plot-less, non-romantic nor drama movie about a girl being horny and the guy doing an attempt of BDSM, which comes down to.. soft-core.. almost nothing different than normal sex with bondage.. boring sh*t. <br><br>on that note, go watch the kings man; secret service. that's one of the best action movies i've seen in a while!","user":"gangstah_vino","rank":[1,2]}]