[{"title":"An thoughtful and spiritual journey through the desert","rating":7,"date":"15 July 2014","review":"This is a great film for those who honor the journey. With a beautiful display of desert landscapes, this movie let's you feel the freedom of living life moment to moment. I don't think that the point of the story was to examine morality in any great way; aside from the pain of suffering loss and the injustice that often prevails. The film does a good job of contrasting the shortcomings of western culture with the simplicity of a more ancient one. As a result, you get a story of blended and contrasting themes, filled with the tension of an impending doom.<br><br>I enjoyed the characters as well. Jason M. created a lovable hero that is easy to empathize with. His friends and family all admire the depth of his character, drawing the viewer into their world. It helps that he's a good looking dude, with all of the swagger you could ask of a mystery rogue biker. It's hard to imagine a woman who would say no.<br><br>This movie won't rock your world or change your stance on anything. It's simply a great indie flick into a world that most of us will never see, with freedom that we will never experience. It will leave you with lingering images of endless highways cut through a land that would rather forget about us.<br><br>I would have liked to give this a higher vote, but it's just a simple story and I feel that it tops the scale of it's own potential. Otherwise, I didn't think that it lacked much. I'll be recommending it to friends who care about something more than the latest superhero flick.","user":"cazaman","rank":[27,29]},{"title":"One-sided but still good","rating":7,"date":"28 June 2014","review":"I wasn't sure what to expect from this film, but having seen the 7.4 rating on IMDb I decided to give it a shot. I am not disappointed, despite the rating being quite a bit lower now.<br><br>Even though the film is about a fugitive on the run, it does not feel like he is escaping. It feels he is aware of his limited time before facing the law, but it does not change who he is or how he behaves. He travels on his motorcycle, visits friends, helps out whom he can and ultimately is on a mission to spread his mother's ashes where she wished to rest. He joins together with a less perfect but still very likable man and they travel together. They are being pursued by two lawmen, one clearly conflicted and the other totally ruthless.<br><br>It's a very pleasant ride; we get to know the main hero, empathise with him and presumably are expected to fully agree with him dispensing justice. I won't get into whether we should or shouldn't agree, however the biggest complaint I have about this film is how much it shoves this rationalisation of vigilante justice in our face. The film could have been a lot more subtle and definitely could have hinted another side of the story. We would still sympathise with the protagonist, but through a more realistic understanding of his plight, rather than being fed a one-sided view.<br><br>I gave this film a 7 despite the above flaw. This is because this flaw is easy to spot, understand and ignore. Once you do that, the film is engaging and enjoyable.","user":"Zubacz","rank":[50,61]},{"title":"Road To Paloma Review","rating":8,"date":"2 July 2014","review":"I for one think this film was an excellent work of art. The story was great in my opinion, and it honestly was a different type of tale. Going into the movie I knew the back story, since I had watched some of Jason Momoa's earlier interviews, where he had stated that a lot of serious crimes happen in the native area, but are not taken seriously by the public.<br><br>This film shows the different aspects of Jason Momoa's work and greatness! I can see why he was tired of being type-cast as the big tough guy - and hopefully this film changes people's thoughts about him and his work. Momoa's acting was very strong, as was the writing and the directing! The directing was just awesome - the wide shots were amazing and it really captured the beauty of land and natural structures.<br><br>Lastly, the soundtrack was phenomenal and let's not forget Robert Mollohan's portrayal as Cash. His performance was really under-shadowed, and he really deserves some recognition.<br><br>In conclusion, I feel this movie was amazing. With a mere $600,000 budget, the cast and the story were outstanding. Being tired of sequels and prequels, this is an original tale, which is definitely worth a watch.","user":"vrallan","rank":[33,42]}]