[{"title":"Touching and honest movie","rating":9,"date":"7 May 2014","review":"This movie is so touching and honest it gives me the chills to this day looking back on it. I thoroughly enjoyed it and recommend it to anyone who is looking for a heartfelt movie with a realistic approach to teenagers growing up in a rough town, whose main goal is to escape it for a better reality. The score is absolutely beautiful and provides a reprieve from the darkness of this film. McAuliffe's and Cohen's performances are very raw and excellently portray two best friends who are extremely loyal to one another despite their differences. I could feel their connection and it never ever felt less than 100% authentic. The other supporting actors were equally as good. Throughout this movie you will continuously be sitting at the edge of your seat in anticipation. \"You are here, but not for long\"","user":"meclavelli","rank":[20,25]},{"title":"fine but nothing special","rating":6,"date":"21 April 2015","review":"It's VanBuren, Maine. Dominic Roy (Callan McAuliffe) and Casper (Emory Cohen) are best friends. Casper's girlfriend Tasha (Zoe Levin) tells him that she's pregnant. He comes from a dysfunctional family. He disrupts class, breaking and entering for his criminal dad Clayton (Aidan Gillen) and hates his mother (Carrie Preston). Clayton pulls him into the world of smuggling drug in from Canada. Dominic hopes to move to Boston with Casper. He lives with his mother (Carla Gallo). He works hard on the potato farm to earn the money to buy a car. Nice girl Emma (Sarah Sutherland) is also working there to pay for college.<br><br>It has a lot of the trappings of indie filmmaking of today without the something special to distinguish it from the rest. It has the dysfunctional lower class folks. The story is unoriginal. It has the hand-held shaky camera work. The two leads just aren't special enough. They are fine actors but there are not stars. They don't show or allowed to show the spark that would energize this movie. It moves a bit too slowly and needs to elevate the danger much sooner.","user":"SnoopyStyle","rank":[4,6]},{"title":"Loved it!","rating":10,"date":"12 October 2014","review":"Raw, honest, amazing actors, excellent soundtrack (and frankly the only full soundtrack i bought for £7.99). A coming-of-age movie that will surely affect ages 16-23.<br><br>This movie is not for everyone, you should have an edgy self to really appreciate it. <br><br>Emory Cohen (Casper), Sarah Sutherland (Emma), Callan McAuliffe and Aidan Gillen (Game of Thrones) were amazing actors. A movie well worth watching and forming an opinion. Very, very, very good. <br><br>If you liked 'Rampage' (the only movie that comes in mind) you will love this movie. It has an aesthetic that is very enticing and an honesty that will blow you away.<br><br>I give it 10 out of 10 for the moments it offered me!","user":"pantxike","rank":[5,9]}]