[{"title":"Complex and raw","rating":7,"date":"11 August 2019","review":"Half a century after the well-known Lolita of <a href=\"/name/nm0618603/\">Vladimir Nabokov</a> subtly transformed into a cinematographic masterpiece by <a href=\"/name/nm0000040/\">Stanley Kubrick</a>, <a href=\"/title/tt2315582/\">Una (2016)</a> presents the ravages of a few-months romance between a man in his forties and a 13-years-old girl. This analysis is essentially revealed through the eyes of this teenager who has become a woman particularly disturbed and confused by this past as short as devastating.<br><br><a href=\"/name/nm0578853/\">Ben Mendelsohn</a> and <a href=\"/name/nm1913734/\">Rooney Mara</a> play excellently, with an out-of-the-ordinary decency and an exemplary sobriety. In addition, the director <a href=\"/name/nm4970700/\">Benedict Andrews</a> successfully and coldly describes the havoc of an unusual relationship that challenges morality despite a 'consent' from the teen.","user":"FrenchEddieFelson","rank":[17,19]},{"title":"You have to watch it til the end","rating":9,"date":"12 May 2018","review":"I think most of the negative comments I read here are people mad at two things. First, they're mad that Una herself seems ambivalent about the relationship she at 13 with this man. Part of her is mad at Ray, but part of her clearly misses him. It even kind of looks like maybe she's only mad because he left her, not because he statutorily raped her. Second, it allows Ray the space to say that he's not really a pedophile, but just loved this particular girl at that time. It clearly wants the viewer to consider whether this was a truly loving relationship that was only complicated by the age issue. People justifiably do not want to consider such a thing and, if you're like my wife, turned it off. I came back to finish it because I was interested to see how it was going to resolve. And the acting and cinematography are phenomenal.<br><br>Here's where the movie saves itself and proves it isn't what my wife thought it was.<br><br>You get your first glimpse at true Ray in the warehouse when he starts saying stuff to Una like \"You were just so wise for your years.\" That's the kind of manipulative crap that pedophiles use to \"groom\" their victims. It harkens back to past pedophile Ray. It passes quickly, but it's clear that there's more to Ray than he's been showing us.<br><br>I'm skipping a bunch. In the end, they go to a garden party at Ray's house where Una discovers that he married a woman who has her own very cute 13 year old daughter. Suddenly Ray sees that he's in danger. He follows Una out and starts telling her again how special she was and how he's never been attracted to another young girl etc. He's clearly full of shit. At that moment, Una realizes that he's been full of shit for however many years. She realizes how stupid she's been for holding a candle for this guy, and she leaves, feeling disgusted. Ray turns around and everyone saw *something* happen. He's got some explaining to do and it's probably not going to go well for him.<br><br>But here's why I love this movie. <br><br>It turns the *viewer* into Una. At the beginning we're thinking this guy is a creepo, but maybe it was just this momentary thing and he's not *really* a pedophile. Maybe he even really loved her, even if having sex with her was wrong. The film forces us into Una's ambivalence. It's only in the last few moments that we do a 180 along with Una. She and the viewer realize in the same moment that Ray is and always has been a predator.<br><br>If you don't watch it until the end, you might think it's defending statutory rape. It's not. It's just trying to take you on a journey with a woman who is still on a hard journey, processing her abuse. For that reason, it's a powerful film","user":"dingane","rank":[65,84]},{"title":"a tense essay on moral boundaries","rating":7,"date":"25 June 2017","review":"Conventional genre movies work their magic almost entirely through  manipulating stereotypes. But many powerful movies work in reverse:  they deconstruct stereotypes to challenge our boundary perceptions.  Themes like feminism, racism and nationalism, are regularly pulled  apart to see what makes them tick. In recent years, child sexual abuse  has been in the spotlight and it is overwhelmingly treated as a moral  absolute. However, the film Una (2016) challenges the norm by exploring  ambivalences in a case of blatant abuse. In doing so, it places the  audience squarely on the judge's bench.  Adapted from the acclaimed 2005 stage play Blackbird, this tense  drama-thriller explores the moral ambiguities of a criminal act that  occurred 15 years ago between 40-year old Ray (Ben Mendelsohn) and  13-year old Una (Mara Rooney). The emotionally immature Ray was  obsessed with the lonely and precocious Una over a three-month  relationship before having 'consensual' sex with her. By chance, the  incident was discovered and he spent four years in jail. Since then he  changed his name and has tried to restore his life. Meanwhile Una's  world spiralled into an emotional void. Now 28, she has tracked him  down and unexpectedly confronts him at the factory where he works.  Instead of attacking him for the abuse, she demands to know why he  abandoned her after their one night together. They continue talking  beyond the factory's closing time, then she tricks another employee to  take her to Ray's home where his girlfriend is hosting a party. At this  point, the intensity of the factory scenes becomes diluted and the  sparring inconclusive.  This is an explosive mix of issues, personality and circumstance. The  film consists mostly of their verbal sparring about the illegal  'affair' with dialogue ranging from hysterical, passionate to icy cool  within an industrial setting that is claustrophobic and alienating. It  is beyond Ray's emotional capacity to understand what Una wants, while  she vacillates between wanting to restore her juvenile obsession with  him and wanting to see him wallow in guilt for his crime. Every time we  feel contempt for him, we see a piece of the emotional puzzle  indicating human weakness but not evil. Every time we admire Una's  determination to hold Ray to account, we see a glimpse of her  complicity and manipulation. Mara Rooney and Ben Mendelsohn fill their  characters with confusion and remorse. At the same time, they depict  genuine emotional connection with each other despite the legal,  emotional and moral prohibitions that still frame their lives. Their  performances are brilliant.  At one level, this film is about the horrendous impact on victims and  the abrogation of responsibility that occurs in cases of child sexual  abuse. At another, it pulls apart the stereotype of victim and abuser  to shed light on how it can happen and its painful aftermath. Some  audiences may be repulsed at the level of sympathy shown to the  perpetrator and the implicit sharing of responsibility between a  juvenile and an adult for what is entirely an adult crime. Others may  be shaken by the idea that such crimes may have any moral ambiguity at  all. In any case, this is brave and provocative cinema that cuts across  the guilt versus innocence binary.","user":"CineMuseFilms","rank":[78,116]}]