[{"title":"Artistic, powerful and surreal","rating":8,"date":"10 April 2013","review":"Plot: Narcolepsy makes it hard for Josie to separate dreams from reality. Her half-sister Samantha, who is supposed to be her helping hand, takes advantage of Josie's condition and uses her sleeping state in abstract and absurd art installations. Samantha's manipulation confuses Josie even more as sexual feelings are emerging.<br><br>Our Thoughts: It's easy to see that \"Wakey Wakey\" is a very unconventional movie. The runtime is just around an hour, it's experimental with extremely simple means, it doesn't develop a full story nor does it have a bump-free timeline, and it uses art in story, atmosphere, visuals and at times even metaphors. It's easy for me to fall for movies like these because I get so much more out of them than your typical traditional stories.<br><br>We have two characters, half-sisters. Josie is suffering from narcolepsy. Her sister Samantha takes advantage of Josie's condition for her art. She manipulates her and uses her in provoking art installations when she's sleeping. Josie is having a hard enough time as it is, being a narcoleptic, and because of Samantha she's struggling to separate dreams from reality. As Josie slowly realizes what Samantha is doing to her, a strange attraction is brought to life. A sexual attraction.<br><br>\"Wakey Wakey\" puts you in a dream-like state where reality isn't important, yet there's nothing specifically unreal about the movie. It uses everything, from the narcolepsy to the art installations, in a way for you to relate. I feel that's the power of the movie, that it doesn't do things simply because it's visually interesting or \"weird\" - it actually works every theme perfectly, making this strange, abstract movie much more relatable than movies of similar style. The narcolepsy and the confusion of young Josie works in two ways: on one end it's an interesting take on being a confused teenager, and on the other end it connects to the experimental style. Meaning, we end up feeling similar to Josie because the movie almost treats us as if we're her, with sudden actions and connecting dreams with reality. Was this intentional when they made the movie? Who knows. But it works, and that's what's most important.<br><br>With small hints of the sexual desire brewing, \"Wakey Wakey\" is subconsciously erotic. Movies aren't erotica just because they feature sexual relationships or desires, but through how they present them. That's what \"Wakey Wakey\" does, even if there's never really erotica in the movie (although there are some sexual moments) it still gives those vibes.<br><br>I'm new to the work of Adrian Goodman, but what I saw in \"Wakey Wakey\" impressed me a lot. I love it when a movie can be so simple, yet so artistic, powerful and surreal. I couldn't have wished for anything more out of this movie. Sure, it is a very low-budgeted independent movie that comes with some amateurish results if you look at the technical side, but the movie is so much more than that. I could go on about it, but the shorter the movie is - the less you should say about it. Let's leave it with this: I'd recommend it in a heartbeat.<br><br>More reviews at FilmBizarro.com","user":"filmbizarro","rank":[7,12]},{"title":"A timeless nightmare set in an architectural maze of shadowy elegance and minimal dialog to complement one killer of a soundtrack.","rating":10,"date":"21 January 2014","review":"A tale of two young sisters, isolated from the world around them.<br><br>Add a twist of the sublime with a foreboding sense of curiosity and you have one potent mix for original film making.<br><br>A young narcolepsy sufferer Josie lives with her seriously strange sister Samantha.<br><br>Josie struggles to grasp the difference between what is real and what is a dream thanks to her unfortunate illness that leaves her in a perpetual state of confusion and helplessness.<br><br>Her sister Samantha seems to revel in the realm of the unspeakable. Bound by crippling symptoms ranging from sleep paralysis and hallucinations, Josie finds herself driven deeper into solving the puzzle of her barely grasped reality of conscious life and surroundings.<br><br>While Josie struggles to control her world put on hold by her chronic neurological disorder, Samantha toys with a youthful ambiance of creativity mixed with a dark and tempting psychosis that leaves her cold and calculating towards her otherwise compassionate responsibility. <br><br>There is something undeniably romantic and seductive that lingers in this haunting dark subconscious awakening. <br><br>Goodman masterfully creates this horrifying web of deceit, anxiety and confusion that thrives in an isolated setting which is both beautiful and terrifying.<br><br>A timeless nightmare set in an architectural maze of shadowy elegance and minimal dialog to complement one killer of a soundtrack.<br><br>Wakey Wakey, is a visually stunning and delicately surreal journey that will grab your attention right from the get go. <br><br>Not to be missed.","user":"dirntygirrl","rank":[7,18]}]