[{"title":"Unsparing, cruel and stomach-churning","rating":8,"date":"1 June 2013","review":"In an early scene of the movie, a grieving husband suddenly bursts into tears while cooking. His 17-year-old daughter is with him in the house, but prefers to stay away. The sight of her father crying, which deeply moves her, leaves a authority void in her life that will define her behavior as things unravel at her new school. The relationship between Alejandra and her father is of deep love, but too many things are left unspoken, maybe precisely because each one thinks it is his duty to protect the other. <br><br>But at its seething heart, After Lucia is about the abject cruelty of the human being, and more specifically of teenagers. The acts portrayed soon become monstrous,and the issues raised are only too real. Unfortunately, the ensemble lacks cohesion, and leaves many questions unanswered about the characters and the plot. Moreover, the emotional frigidness of the film, desisting any sentimentalism, may be annoying to some. The camera seems to shun the characters, and consequently never gets close to them.<br><br>The film is saved by Tessa Ia Gonzalez, you embodies a scarred teenager. The scary intensity of her gaze, at once eerily serene and seething with mute terrors, will stick long in your minds. <br><br>Even if confusing, After Lucia packs a hard emotional wallop and have proved to be, alongside with American indie Compliance, one of the most disturbing sit in recent memory.","user":"chapelanalexis","rank":[20,22]},{"title":"Disturbing film about high school bullying and loneliness","rating":9,"date":"24 October 2012","review":"I saw this film at the Ghent filmfestival 2012. A chef (Roberto) and his daughter (Alejandra) move to a city where both are new. Their wife resp. mother has recently died in a car accident, and their move seems a recipe to get some distance from what happened and an attempt to deal with their loss. Father and daughter follow their own path to get settled in their new environment.<br><br>We see Roberto starting to work in a restaurant, but his depressive mood and sudden impatience hinders him from a fruitful working relationship with co-workers. He quits suddenly, but that solved nothing and he regrets this hasty decision. We see him later on working as a chef again. But the remembrance of his loss continues to haunt him. His depressions and anger are never taken out on his daughter, however.<br><br>Alejandra seems to get along well with her new classmates, and integrates remarkably fast. That turns around when a film showing her being drunk and having sex during a party, happens to be published on Internet. That triggers an unbelievable amount of bullying by her classmates, often to such an extent that you eagerly want to look away. But you can't, while the camera is close by and does not let go.<br><br>It is difficult to believe that the young players are all amateurs with no previous experience on stage or film-set. They have a significant part in the proceedings, be it the collective bullying of Alejandra, or the collective silence when interrogated by teachers about what is going on. The boys and the girls play equal roles in the bullying. I see them showing a very natural way of behaving, even with the camera very close.<br><br>The collective mindset, all against one, is not easy to watch. Teachers nor parent have any idea that worrisome things are going on. You feel alone with Alejandra. With apparently no one to rescue her, it is all very disturbing to witness. Teachers are not aware, because these school kids are too old to need constant supervision, and have a lot of leeway to fill their own time. The parent (Roberto) is not aware that anything bad is happening with Alejandra. As a loving daughter she takes all trouble to shield her father from any bad news, observing his depressive moods. Not until very very late in the story we see involvement of teachers and parent.<br><br>A few loose ends remain unexplained, maybe only to show Roberto's depressive mood and nothing else. Best example is that in the beginning of the film we see that he let a garage fully restore his wife's car after a crash, to subsequently abandon it somewhere with the keys inside to continue his journey on foot. Halfway the film we see the same car wrecked again after a disastrous joy riding. Similar inconsistencies I have with Roberto's job at a the restaurant where he works at first, then quits, and later on resumed working without much explanation. All things considered, these are minor details.<br><br>The camera closes in on the story. The situation gets from bad to ugly, and without anyone on the rescue. I consider this a very strong feature of this film, letting us watch what happens from very close. You get involved, willingly or not. I scored a 5 (out of 5) for the audience award when leaving the theater. In hindsight, though not as bad as Alejandra, I feel a bit lonely too when seeing that this film ended on the 38th place for the audience award, in my opinion undeservedly surpassed by several films with much less qualities.","user":"JvH48","rank":[45,55]},{"title":"I think we've found the Mexican Haneke (spoilers)","rating":6,"date":"12 October 2012","review":"\"Después de Lucia\" is interesting although it's a bit of a show-off from the director who already did the very disturbing \"Daniel y Ana\". I'm not sure about what his point of view on the story really is, for it is blurred by the abundance of topics : how to survive a loss, how much you are able to accept to suffer so as to find redemption from your guilt, how fast you can get to self-justice, and on top of that, the very modern and recurrent theme of school bullying, central to the film.<br><br>Franco's way of filming is so self-consciously reminiscent of Michael Haneke, in this quiet but terrible series of semi-violent events (obviously more psychological than physical), that it is almost annoying at times. The final scene is just a reproduction of Funny Games' final scene... and I'm wondering if, as a spectator, I have to see it just as an homage to Haneke or as sequence of the film in itself. I mean... was it necessary to complete the film, powerful enough and explanatory in itself, that way ? Not sure, even if it brings some sort of balance to the absurdity of the rest.<br><br>Anyway Michel Franco is someone to watch, \"Después de Lucia\" is a very strong piece... but I think it's time he finds his own path, away from his apparently beloved master and model.","user":"josymontmartre-1","rank":[16,20]}]