[{"title":"A pretty good movie, after all.","rating":8,"date":"25 June 2015","review":"The review that caught my eye, before I rented \"The Forger\", was \"Travolta's best performance in ten years...\". But then, just before watching it, I searched for more reviews and saw that some critics panned it. Well, I happy to say they are wrong—it's a pretty good movie, after all.<br><br>I mean, come on, critics! I usually agree with you—but saying this is too \"slow paced\" and that it has \"two, conflicting, story lines\"? I LOVED the pace, and the acting, and, especially the story line(s).<br><br>OK, so it does have two story lines going on—the forgery and heist, and the human interest about the forger's family (his dad, his son, his ex-wife who had not seen the son in years, the female detective...). So what? It's believable (as much as any heist story or human interest story can be) to the point that plot vs. sub-plot is just not a problem.<br><br>I thought Travolta DID give a heck of a performance. His pace fit the overall pace of the film, as did that of the other actors. And Travolta, who has had his share of sorrow in real life, looked to me like a man who has been there, done that. He looks the part and is very convincing.<br><br>Everyone actually looked pretty good (or properly bad-ass) thanks to some solid lighting and overall nice cinematography. (This is not some kind of \"art\" film, but nevertheless consistent in it's camera work.) The sound quality was good (a pet peeve of mine in some films) including the music which seemed to fit the film nicely.<br><br>As for the VERY best performance in the film, besides Plummer, who is always fun to watch for me... it has to be young Tye Sheridan. Nicely understated, smart, believable. I'm looking forward to his next film, whatever it turns out to be.<br><br>Finally, the director certainly knows a thing or two about film making, as, even with the somewhat slow pace, everything builds mostly evenly towards a satisfying ending. Of course the screenplay had to work too, for that to happen.<br><br>Bottom line, I'm glad I rented \"The Forger\". I enjoyed pretty much all of it, and even replayed a few parts to study how the film was put together. Probably no Academy Awards coming for this, but all cast and crew can still stand tall.","user":"sldaley","rank":[19,21]},{"title":"Not bad to watch.","rating":6,"date":"27 April 2015","review":"So, deep in the heart of this picture, it's about a man trying to spend more time with his son. It's very touching.<br><br>John Travolta overall is good in this movie. He plays an incarcerated art forger who was release from prison early thanks to an old criminal contact who needs him to forge something for him while all the forger wants to do is make up for lost time with his son.<br><br>I really like the parts where Travolta's character is preparing for the heist to steel the painting and replace it with his forgery which is where this movie differs from other heist movies as it goes into what it's like to be an art forger.<br><br>Reminds me of the Art of steel starring Kurt Russell who like Travolta, I have not seen star in a movie in ages.<br><br>Not a bad movie to catch.","user":"subxerogravity","rank":[29,35]},{"title":"Touching father / son / grandson story","rating":8,"date":"18 May 2015","review":"I really liked this movie despite the criticism against it. It's a story of men's love, more demonstrative than proclaimed. It's not often we get an honest look into the true bonds across generations. Feminists may disagree, but I see no wrong with celebrating either sex's strengths and shortcomings. It's an honest introspective with a bit of sensationalism for entertainment; I feel it was very tastefully done.<br><br>John Travolta's life made him perfect for this role. I won't dwell on it but he is phenomenal without ever being over the top. There wasn't a bad act in the bunch, from leads to support and there are a number of genuinely heartwarming and hilarious moments making this film a top class choice you won't regret seeing.","user":"paxdriver","rank":[25,32]}]