[{"title":"Dark, glossy British Sci Fi for 2013","rating":8,"date":"18 June 2013","review":"I thought this film was beautiful - the use of special effects were stunning and were utilised in a clever way that added to the atmosphere rather than overshadowing the plot.<br><br>The Machine is an interesting, dark sci-fi that focuses on character and mood rather than flashy guns and action scenes. I heard it described as a kind of prequel to Bladerunner, and agree this could be true. It has a good script with unexpected plot turns and no excessive dialogue. The delicacy it deals with with issues of loss and mourning was great.<br><br>It is a new take on the classic Frankenstein story, is beautifully shot, and was an entertaining film to watch at Tribeca this year.","user":"paulfrankl87","rank":[182,229]},{"title":"Stylish, atmospheric, refreshing","rating":8,"date":"9 April 2014","review":"It is such a relief to see an honest to god B-movie these days. A film with a somewhat flawed script, limited budget, tons of vision and the balls to take itself seriously.<br><br>The machine is about a future where elite scientists are able to re-animate the dead into powerful robot bodies, or graft advanced thought-controlled prosthetics onto the living. The robot's intelligence is the final hurdle, trying to make a subject that is both intelligent and entirely controllable. One of our protagonists is a scientist hoping to bring back his daughter as a machine. He's working with a mysterious corporation to achieve that goal. The rest of the movie is the movie.<br><br>If this sounds like a cheesy predictable premise, it is. But many many productions would take this story and do far less with it.<br><br>The Machine understands why Sci-fi was so vivid and memorable in the 70's and 80's, it's about art. Bold, heavily featured, skillfully realized art design-much of which here is brought to life through skillful practical effects. It really shows. Things feel real. Sets feel real, violence feels real, CGI is used well and, as the case should always be, doesn't draw undue attention to itself. It also has a fantastic synth-score that gets that synth-scores weren't great because they were cheesy, they were great because they were cold, otherworldly and isolating. Also that the good ones kicked ass.<br><br>In the final act, the Machine does what B-genre films do and turned into a gun-fight; but who cares, I'd already seen a good film.<br><br>I'm not sure what it was trying to say about artificial intelligence. It was sort of about innocence and sort of about man's inhumanity to man, sort of about procreation and creation. In the end it was mostly about kicking and punching. But it doesn't really matter if a movie wraps things up in a neat package. As long as it presents a premise, gives that premise a little room to breathe, and presents you with bold iconic imagery, I'm in.","user":"FreakNumberOne","rank":[120,152]},{"title":"Excellent especially if low budget is taken under consideration","rating":9,"date":"14 January 2017","review":"This is a perfect example that exceptional movies can be made on a low budget and without an all-star Hollywood cast. No abundance of explosions or unnecessary splatter here either but the film remains thrilling and captivating throughout. <br><br>I dare say the script is not completely original (but lets face it, what is completely new these days?) and it has strong connections with many gems of the genre. Some mentioned \"blade runner\", \"ghost in the shell\" is the first that comes to my mind. It is rather obvious to me that whoever directed this has studied the sci-fi anime genre thoroughly and adopted the style perfectly to the norms and limitations of a conventional acted film.<br><br>The performances of the leading actors are exemplary and together with all the supporting roles and the rather modest movie settings, they create a very believable world where the viewer can immerse himself. All the parts come together very well and lift this film from potential mediocrity to the status of visual poetry.<br><br>Productions such as these, both emotionally and philosophically engaging, renew my faith in the artistry of film-making. Congratulations are in order for the director James Caradog!","user":"lekavalio","rank":[16,18]}]