[{"title":"They Came Together is the same joke for 80 minutes. Thankfully, the joke is funny.","rating":7,"date":"22 April 2015","review":"I wasn't sure what to expect going into this movie. It seemed like it was going to poke fun at romcoms while still maintaining a grounded story and genuine romance. Yeah, that's not the case at all.<br><br>They Came Together is the epitome of meta comedy. It never takes itself seriously for a second and continues to barrage you with joke after joke after joke, spoofing the same romantic comedy tropes we've seen a billion times. It may sound repetitive, and it can be at times (some scenes go on for too long) but it's also the most refreshing satire I've seen in a long time. There is no point where you should be analyzing the plot to this movie. If you do, you're an idiot. Simple as that. The movie is one long joke - if you want some artistic integrity in your comedies then this movie is not for you. If you love to laugh at the expense of cheesy romcoms, then you're in for a real treat.<br><br>The acting in this movie is superb, if the all-star cast didn't already give that away. Paul Rudd and Amy Poehler are ace in their roles as lead caricatures, and even during the dumber moments they still give believable performances. Let me clarify: you don't believe anything the characters are doing are real, but they're convincing enough in their roles that you understand exactly what it is they're making fun of and it works wonders. Christopher Meloni is another highlight - he plays a Don Draper-esque boss that all the corporate drones follow blindly (with Paul Rudd's character being the obvious exception). I never viewed him as a comedic figure but he absolutely owns this role; the only other actor I can see doing this role justice is Jon Hamm himself. Other standouts include Jason Mantzoukas as Bob, the friendly awkward coworker, and Ed Helms playing the cliché douchebag that the girl falls for even though he's clearly wrong for her. <br><br>The best part about They Came Together is that it's wholly self-aware. It breaks the fourth wall more than a few times, and it doesn't take you out of the movie because you're never really in the movie to begin with. It's like watching an 80 minute long sketch comedy held together by a flimsy love plot. Another positive is that the movie never gets boring. It's so short and so eccentric you don't have time to get bored. Again, it's joke after joke after joke - most of them are cheesy, some are crude, but they're all so relatable as romantic comedy jabs that you can't help but laugh at the stupidity. <br><br>They Came Together is definitely not for everyone - if you're looking for substance, go somewhere else. This movie is pure satire from beginning to end. Nothing is believable, and none of it should be. It's a spoof movie at its core, standing head-and-shoulders above other spoofs due to great writing and a brilliant cast. Why this has such a low score on IMDb I will never know. I got everything I wanted from this movie and more. Throw in a few surprise cameos and you have yourself a winner.","user":"lnvicta","rank":[86,100]},{"title":"Why Don't People Get It?! This Movie Is Fantastic!","rating":9,"date":"30 June 2014","review":"They Came Together is the first great film satire in years. It skewers everyone, from the most renowned romantic comedies to the most idiotic chick flicks. Paul Rudd and Amy Poehler are perfect, parodying the roles they could very conceivably be cast in (and I believe Paul Rudd has done a few times). Not every joke lands, and most of them go by so quickly it could all be a 30 Rock cutaway, but nevertheless this movie is a delight for anyone who has noticed how brainless and predictable most romantic comedies end up being. Cheers to everyone involved in this movie, and to everyone who gets the joke. Watch it; I hope you find yourself laughing as hard as I did (all three times I watched it).","user":"nbrimmerbeller","rank":[101,153]},{"title":"Parody done hilariously right!","rating":10,"date":"19 September 2014","review":"Can we give superhero status to Michael Showalter and David Wain? After all the destruction the \"Scary Movie\" films have done and all the harm that Jason Friedberg and Aaron Seltzer has done to the world of parody, these two come in when all seemed dark and to the point it could never return to the heights of hilarity that it had once seen back in the day and proved that parody can still work and work incredibly well! <br><br>\"They Came Together\" is a ridiculously hilarious film that is filled with just some incredible talent. Everyone from Paul Rudd and Amy Poehler in the leads to the minor appearances from Kenan Thompson, Christopher Meloni, Ken Marino, and Jack McBrayer to the more lengthy appearances of Bill Hader, Ellie Kemper, Jason Mantzoukas and more (even two great cameos at the end) are just—I hesitate to use the slang \"killing it\" but are just killing it on screen. Each and every player is bringing the script to life and making the film something that made my sides burst.<br><br>From the moment it started until the time it ended (heck, even a day later as I'm writing this, I'm still laughing at the scenes that are playing on repeat in my brain), \"They Came Together\" had me rolling on the floor. The jokes are a mixed bunch that results in a film that I never found boring or repetitive. Sometimes the jokes are smart, always they are witty, occasionally they get super silly, and, on a few occasions, the film gets vulgar and offensive with its humor but, the point is, the film never stopped with its comedy and never rested on a formula that was the same thing over and over again. Michael Showalter and David Wain wrote a wickedly entertaining break down of the romantic comedy genre that proves that satire and parody is more than just some fart jokes, a guy hurting himself, and dated pop culture references that it was sadly becoming. I just loved this film and hated absolutely nothing about it.<br><br>Greetings! My name is Rev. Ron and I love movies. If you feel like reading more of my rants, ramblings, geek references, bad jokes, and other movies reviews (like a more in-depth, totally gushing look at \"They Came Together\" and other films that would be improved if Showalter and Wain wrote the script), you can visit my blog at revronmovies.blogspot.com. If you don't feel like any of those things I said and probably hate me (because we love to hate things on the internet), you can go about your day because these aren't the droids you're looking for.","user":"RevRonster","rank":[24,33]}]