[{"title":"It's been done before and much better than this","rating":2,"date":"14 December 2015","review":"I have to agree with one of the other reviewers that there isn't much, if anything, to recommend this by-the-books cult drama.<br><br>We have a chemically-dependent, terminally depressed young shrink (played convincingly enough by Mark Leonard Winter) whose young patient's suicide drives him over the edge, leading him into a cult-like EST-ish back-to-nature group led by Father Jay (Steve le Marquand).<br><br>Father Jay's group is all about getting \"clear\" (sound familiar?) and uses various punishing physical and mental techniques to supposedly \"heal the soul\".<br><br>So... is there anything you've heard so far that leads you to believe this is unlike any other cult you've heard about before?<br><br>Nope, didn't think so. And there isn't. I guess this might be shocking material for those who've never heard of brainwashing or even Charlie Manson, but it's snooze-inducing for those of us who have.<br><br>It's a pity because this isn't a poorly made film. The acting is decent. It just revolves around a non-story that's ordinary and non-compelling, to be kind. It's only 103 minutes, but it feels like a century. What a complete waste of everyone's time, including ours.","user":"bob_meg","rank":[18,23]},{"title":"Vague, disjointed, contrived.","rating":2,"date":"27 December 2015","review":"I swear I didn't dose off at in the first 45 minutes of this film, but it really seemed as though there were big gaping holes in the story. Really got tired of these tedious cult people forcing him to drink some gunk which he invariably upchucks. The story inched along, didn't pick up pace and left me feeling as though I was standing on a dark corner waiting for a ride at 3am. Would not recommend to anyone. Another of many Superchillin offerings that tout better than a 7.2 stars on IMDb, but when I actually come here, find it's a good 2 stars lower rated. 3 reviews are not a wide enough base to feasibly rate a film. The producer, director and main character could have logged on and given it rave reviews, but this was nothing close to the quality or content I would expect from a 7.2 star movie.","user":"tim-arnold777","rank":[14,23]},{"title":"Deep and disturbing","rating":8,"date":"16 September 2018","review":"I'm shocked at the negative reviews. I found this movie to be really powerful. Yes it's slow at first, but it's a beautiful story of self realization and triumph over internal suffering. The ending was a surprise and made the main character's transformation even more deep and real.","user":"kristenslawinski","rank":[2,2]}]