[{"title":"\"They'll make more\"","rating":5,"date":"2 August 2013","review":"Lynn Shelton's sophomore film Your Sister's Sister was a terrific little independent gem, showcasing relationships involving siblings and the complexities that surround quiet but notable flings we may neglect to mention to our friends. With a talented cast of three (Rosemarie DeWitt, Emily Blunt, and the wonderful Mark Duplass) it was a favorable experience to say the least. Shelton returns a year later with Touchy Feely which, to say the least, is a disappointing effort after batting a triple in 2012.<br><br>Your Sister's Sister worked because it was predicated off of human interest and realism in its events and dialog. Shelton asserted herself in human dialog, and immersed herself in the breathtaking beauty of Seattle's woodsy environment, making the film easy-on-the-eyes and very effective. Here, she makes Touchy Feely exist in what appears to be a fantasy realm, where real-life situations occupy a plot-point of science-fiction that's not only a bit offputting but difficult to adjust to. When the film introduces these plot-points, it only becomes that much harder to stay in-tuned with it, which is an issue seeing as that's the film's central plot.<br><br>Rosemarie DeWitt is Abby, a skilled masseuse who, all of a sudden, becomes frightened by the touch/texture of human flesh. This is a major issue because it renders her job impossible. Her brother Paul (Josh Pais) works as a dentist, with his directionless daughter Jenny (Ellen Page). When Jenny impulsively states that Paul has a \"healing touch\" when it comes to his dental work, the fib becomes true as Paul's work begins to heal many of his customers and their dental issues.<br><br>So, while Abby's job begins to crumble before her eyes due to her newfound aversion to human skin, Paul's dentistry practices begin to flourish and the possibilities become endless on his part. We, as the audience, are simply asked to observe this happening and this is precisely the issue; the film is void of connection and moments where true sympathy could've been evoked. We learn nothing about these characters except some of their situations are sad, some make us envious, but in the end, all of them are pretty trite and forgettable.<br><br>Touchy Feely's issue comes from two things; one, it feels more gridlocked to a story, where Your Sister's Sister was breezy and flowed in the wind, thanks to improvisational dialog. The other is that it tries to humanize something inhuman, which are relationships. It tries to make them the point of focus in the film and forgets we need to see the characters involved in the relationship to make them work.<br><br>At the end of the film - which runs a rather short eighty-three minutes - I thought about Lynn Shelton and how Your Sister's Sister struck me with so much surprise and how little excitement this effort packed. I simply console and toy with the idea that she is young, smart, and clearly passionate about not only her home-state of Seattle but film as an artistic medium. I say what I do after watching a mediocre Woody Allen movie; \"they'll make more.\" <br><br>Starring: Rosemarie DeWitt, John Pais, Ellen Page, Scoot McNairy, Allison Janney, and Ron Livingston. Directed by: Lynn Shelton.","user":"StevePulaski","rank":[26,37]},{"title":"You might not want them touching you though.","rating":4,"date":"2 November 2013","review":"It is listed as a comedy, but you won't be laughing. This is a story about a family of frail people who finally as one start to open up to the world around them. Each of them has their own protective layer that they need to break out of, and it is really not funny to watch. It is not a bad story, and it is told by a great cast, and the rural Seattle area looks great in the travel montages. I didn't like it, but you probably will. And Ellen Page is just so tiny, and broken in this her character never seems to really get better, and then she does no reason why. You could say that the healing of her Aunt, and Father was what she needed to heal herself, but you never see her actually healed as a result, just the result itself.","user":"face-819-933726","rank":[8,10]},{"title":"Another bland slice of Indie whimsy","rating":1,"date":"19 October 2013","review":"'Touchy Feely' is yet another Indie film which depicts the repressed behaviors and ho-hum dilemmas of middle-class American families. The opening act is set at an awkward dinner, where it's revealed that a dentist single father is obstructing his daughter's artistic potential by employing her as an assistant, while his sister works as a massage therapist, and prevaricates over moving in with her unambitious boyfriend.<br><br>Their issues soon materialize in bizarre ways - the dentist discovers his touch can miraculously cure long-standing dental ailments, while the massage therapist suddenly finds herself repulsed by human skin. The fine cast does their best with the material, but this lightweight fable makes little sense as pivotal plot-lines are swept under the carpet, or else forgotten by the screenwriter. By the time everybody gathers for a second dinner, most of the family problems have magically evaporated thanks to the glib ministrations of a Reiki therapist, an ex-lover's apology, the songs of an Asian folk singer and a couple of tabs of ecstasy.","user":"tigerfish50","rank":[33,55]}]