[{"title":"This ain't your Disney Jungle Book, and that's wild","rating":10,"date":"6 December 2018","review":"In performance-capture maestro Andy Serkis' hands, Legends of the Jungle is a darker, more surprising version of The Jungle Book. Get ready to leave behind the jungle of your childhood imagination. You know, the one where you slumber peacefully in a tree bough, waterfalls ain't nothing but slides and you can float downstream resting on the upturned belly of an amiable bear.<br><br>It's impossible not to keep comparing Serkis' version of this classic story to Disney's 2016 live-action remake of its own 1967 animated family favorite. In Disney's remake, the animals are remarkably photo-realistic. But Serkis is purposefully trying to achieve something entirely different. The motion capture is used to make the animal characters deeper, richer and almost more recognizably human.<br><br>This no doubt presents more of a challenge for the actors than straightforward voice work, and as a result the animals are expressive and affecting. They're more well-rounded and relatable than their Disney counterparts, even if they're not as instantly charming. Christian Bale's nuanced performance as Bagheera the panther and Benedict Cumberbatch's ferocity as tiger Shere Khan are standouts that translate particularly powerfully through the performance capture.<br><br>But as you'll have guessed from the film's title, it's not all about the animals. In Disney's version, Mowgli felt more like a narrative device drawing the animals of the jungle together so we could hear their stories. In Serkis' hands, Mowgli is less of an ensemble player. His character development is central to the plot, especially in the second half. The movie feels like a coming-of-age tale as the man-cub seeks to establish his identity as not quite human, not quite wolf -- simultaneously both and neither.<br><br>It did come as a surprise when, bang in the middle of the film, the plot veered wildly off course from the familiar narrative the Disney films established atop Kipling's work. Some may hate this startling divergence, but I enjoyed the sudden realization that I didn't know exactly what was going to happen next, especially after being lulled into a false sense of security by familiar opening scenes.<br><br>Serkis has made a visually arresting film that Netflix is lucky to have gotten its hands on. It has more than the bear necessities required to put it on your watch list, even if it is lacking the music.","user":"francescobrosolo","rank":[278,345]},{"title":"Close To Beating Faverau's Version","rating":8,"date":"1 December 2018","review":"After watching this, I felt really surprised on how good it was. Don't expect it to be too similar to The Jungle Book. Mowgli is a more adult oriented film with some dark tones which I appreciate. I was very more focused on the actors. Everyone stands out. Even some actors that have small, but important roles. The CGI was the only thing that got under my skin. Some scenes had excellent visual effects, then exceptional, and then just plain horrible CGI. It feels like an unfinished film and took me away from the movie for a while. Maybe Warner Bros cut the films cost when they decided to go to Netflix. I feel really sorry for Andy Serkis. If Warner Bros would have let Serkis finish Mowgli. It would have been better than Disney's version and Andy Serkis would get more praise when he clearly earns it.","user":"JohnnySlayer","rank":[209,278]},{"title":"Andy Serkis is the most underrated talent in Hollywood!!!","rating":8,"date":"6 December 2018","review":"Andy Serkis can do it all without drawing much attention or praise to himself. He can act, great voice actor and he's proven that he can direct. Even though they did the remake of The Jungle Book two years ago and I almost always hate remakes so close together. I would gladly say that I am wrong about this one. It was done perfectly and was a completely different spin on it. I would be glad if Andy got another chance at directing another Disney movie, Great job with this one!!!","user":"vandrist","rank":[141,185]}]