[{"title":"A Surreal, Polarizing Experience","rating":7,"date":"16 February 2013","review":"It has been a few weeks since I viewed this film at its Sundance Premiere. Even now, I am still unsure about how to feel towards it. The plot consists of a man traveling along a desert highway, and the misadventures and people he encounters along the way. There are moments of brilliance, when the dialogue and scenes are laced with dark humor, that make for quite entertaining viewing. The hilarious early scenes with the Rambler and the Scientist who picks him up are among the best in the film. However, there are also moments that feel out of place, and just plain bizarre. The tone is shifty, and it's when the mood changes from a trippy, darkly funny road movie to full-on horror that the film loses some of its momentum.<br><br>After the screening, there was a brief Q &amp; A with the writer/director. I found it funny that when asked if there was a deeper meaning behind some of the events in the film, he said no, it is what it is. I guess what matters is the journey, not the destination. And what a mind-boggling, surreal journey it is.<br><br>Above all, this film is surreal, and it is sure to polarize viewers. This film is not for everyone, but if you are a fan of dark humor, horror, surrealism, and the bizarre, you are in for a treat. A great midnight movie.<br><br>7/10","user":"crazydailymotion","rank":[37,55]},{"title":"A Mixed Bag Where the Bad Ruins the Good","rating":5,"date":"9 June 2013","review":"Who is the rambler (Dermot Mulroney)? All we know is that he has been released from prison and is on his way to his brother's farm. But this is not important -- what matters are all the misadventures he has between point A and point B.<br><br>I really wanted to like this movie. The characters are interesting, some of the story is incredibly funny, and it is all-around entertaining. But, unfortunately, the film is completely disjointed. For every good segment, there is a bad segment, and unfortunately the better ones are in the beginning so as the film goes on the viewer becomes less entertained.<br><br>Editing might have solved some of the problems, but as a whole I think there is only so much that could be done here... the film comes across as a series of short films or television episodes. And in those formats it might have a strong following. As a feature film, it tends to fail because of the lack of central narrative.","user":"gavin6942","rank":[16,22]},{"title":"Lynch-esque oddness.","rating":6,"date":"9 August 2013","review":"Lets get one thing clear, this film doesn't reach new heights in cinematic excellence, far from it but it is interesting. If you liked Eraserhead &amp; Blue Velvet then you'll find some enjoyment in this offering, if you didn't like them then this will stink. At the very least this film will have you talking about it the following day, i've lost count of the films i've watched and instantly forgotten. Its flawed, its disjointed and often ludicrous but still offers something. Don't be too critical and it won't disappoint, expect ground breaking cinema and it will. The IMDb score is probably a touch harsh considering it isn't your run of the mill B movie. Films like this should be applauded for taking a less well trodden path.","user":"lucas739","rank":[7,10]}]