[{"title":"Very immersing experience","rating":7,"date":"16 June 2013","review":"Bottom line - deeply atmospheriс, very touching, mystic and dramatic movie with a horror flavor. Close by the aftertaste to Insidious and Sinister, little below on the horror scale, and a bit up on intellectual. Don't expect massive effects, it is definitely not about it.<br><br>I loved this slow pace, rich decorations, brave camera angles and the sound work. Finally not only boom-sound effects! Just a subtle squeaking wood under one's feet in an old empty house - that's a kind of scare I was looking for. The art of attention to details is here again.<br><br>I can agree that The Last Will and Testament of Rosalind Leigh didn't untap all the potential it has uncovered. Surely not because of lacking substance.<br><br>I rather believe that the author wanted to say way more than runtime allowed to - on religion, obsessions, mother-son relationship, on religion and loneliness.. Or may be he left the space for our imagination by intent. Whatever the reason the more interesting it will be to see next works from Rodrigo Gudino I'm definitely subscribing to.","user":"rust37","rank":[66,78]},{"title":"In a world where originality cannot be found in horror...","rating":7,"date":"5 October 2013","review":"This, my fellow movie watchers, is where we catch a glimpse of true artistry. Most of us know that the reason that the horror genre gets such terrible ratings most the time is because we've all seen the same crap over and over again. And it gets old after a while. We can thank directors like Alfred Hitchcock for making practically every original thought for horror films. But dare I say it, I should emphasize the \"practically.\" This movie, was awesome. It didn't try to pull every popular string to draw the mainstream audience in (that is addicted to seeing the same trash show up over and over again and call it \"scary\") and it didn't seek to simply get views and something to watch once to say you did to all your friends. This film actually requires the audience to work. I know, daunting task right? Almost a horror in itself. But come on, aren't we a little tired of just having most if not all the answers come to us, with very few questions asked? This film shot down the traditional and gave us a little originality, something that is VERY hard to find. Give it a watch and see for yourself. SPOILER ALERT: Yes, the ending is abrupt. Yes, it may leave you wanting more. But isn't that an amazing feeling? Tell me another recent film ESPECIALLY in the horror category that actually left you wanting a sequel? I can't name one. I doubt I could even name one if I gave it some thought, which I won't bother to do because like my belief in God I have faith that the horror movies I've seen lately excluding Rosalind Leigh seriously suck and aren't worth remembering. Trust me, I am hard on movies.<br><br>If you like both a film that asks you questions and is deeply metaphorically and religiously compelling, watch this movie.","user":"alex-mr-ly","rank":[27,32]},{"title":"A Profound Tale","rating":7,"date":"16 September 2013","review":"An antiques collector, Leon (Aaron Poole) inherits a house from his estranged and deceased mother, Rosalind Leigh (Vanessa Redgrave) only to discover that she had been living in the old house by turning it into a shrine devoted to a mysterious cult. Much to his chagrin, he learns that his mother was the sole purchaser of all the items he had sold over the years. Soon, he comes to suspect that his mother's spirit still lingers within her home and is using items in the house to contact him with an urgent message.<br><br>An original horror movie - at least, I've never seen something like this before in the horror genre. The plot doesn't give anything away. Its incredibly slow-paced, but nonetheless highly intriguing the whole time. The raw voice-over from Vanessa Redgrave is a thing to behold. I cannot stop thinking about the ending and looking back now, the whole thing was amazing. The mother loses her faith after her son denies her faith and beliefs and abandons her. Her inner loneliness morphs into a demoncat while her fellow cult members turn on her in her old age. A tale of emotions, loss, and suffering and trying to console oneself through delusions. It is interesting to see that this doesn't have to be a supernatural occurrence. People are lonely everywhere and that can be quite deadly either for themselves or others. Loneliness can really be a monster. <br><br>First timer, Rodrigo Gudiño shows great talent in setting up an eerie atmosphere and going through the story without resorting to cheap tricks at any stage. The house in itself is a grand character and the dance of the shadows is immensely captivating. The acting by Aaron Poole is alright, but leaves something to be desired. He's literally the only person on screen for most of the movie and hence everything depended on him. If it was a better actor, this movie would have a higher rating from me. That said, I believe I'll be revisiting this movie some time again and that's a pretty big thing for someone like me who doesn't normally like to re-watch the same stuff. A profound tale which ends up leaving you sadder by the time you finish it. Truly an underrated and overlooked gem.<br><br>7/10","user":"GirishGowda","rank":[8,8]}]