[{"title":"A way below average thriller with few redeeming qualities","rating":3,"date":"24 November 2014","review":"Terrence Howard and Peter Fonda's scenes in the movie is basically one very long interrogation scene split up to parts.<br><br>A fairly pointless one may I add as well, where Terrence Howard plays a cop who's interrogating a serial killer played by Peter Fonda about a copycat of his.<br><br>It's obvious that all their scenes where shot on the same day in the same location, and that they both did it for the money, and that the producers needed some stars in the movie to attract viewers, and that's the sole reason why they are in the movie.<br><br>They aren't bad per se, but if they weren't famous their scenes would have been cut down to a couple minutes, or cut out entirely, hell they'd probably wouldn't have been filmed in the first place to be honest.<br><br>The rest of the movie is about the 'House Of Bodies' which is not a haunted place even if that's what it sounds like but a website with 'web-cam-girls' in a apartment complex re-enact murders.<br><br>It's really slow, and riddled with plot-holes, and the only reason I didn't absolutely hate it was because one of the web-cam-girls forms a friendship with one of her clients who happen to be a mute.<br><br>But yeah the rest of the movie is a tiring peace of work, with overall annoying characters and pointless scenes of people clicking on websites etc etc.<br><br>Queen Latifah steps by in a web-chat as a counselor or something to the mute young man, but that's about it.","user":"Seth_Rogue_One","rank":[6,8]},{"title":"Don't waste your time","rating":1,"date":"1 March 2014","review":"OK I watched this and it is a really boring and bad movie. the cast was OK, some OK acting, but the script and story were lame. Terrence Howard spends the whole movie talking to peter Fonda in a interrogation room. All this does is after a long time tells who the killer actually is.<br><br>I gave this movie one star for the cute blonde who sort of has the main role. She made the movie a little interesting. The deaf guy who she makes friends with online was OK till things go bad and then he acts like a retard. The killer is someone who used to live in this house and now shows up out of nowhere to kill all in the house very leisurely. <br><br>Everyone today has a cell phone, but not these kids? so even when 2 of the girl realize a killer is in the house , 1 hides, and the other try to sneak out. also they are running a sex fantasy website to pay the rent on the house. the movie would have been better without Fonda and Terrence, and just make it all about the house. Bad Director and bad story overall.","user":"colonel52","rank":[6,8]},{"title":"Interesting idea, terrible execution.","rating":14,"date":"14 July 2014","review":"Despite having some pretty good ideas behind it, this movie was terrible.<br><br>Good: <br><br><ul><li>The setting was interesting. A bunch of cam-girls who live in the house of a serial killer and people can pay to (watch them) act out serial killer-y fantasies. That's pretty unique and adequately creepy. You get to see some gore-y shots of dead girls and related. It had all the elements of a good horror movie...they just were totally misused. </li></ul><br><br><ul><li>A few good actors. Terrance Howard and the serial killer dude had good chemistry. The deaf guy and the main girl were fine. Queen Latifah's cameo was well done. She should've played a bigger role though, would've been funny to see her as a main character in a slasher. </li></ul><br><br><ul><li>It was shot well enough. Sets were good.</li></ul><br><br>Bad: <br><br><ul><li>Everything else. The storyline was written in such a disjointed way that it made no sense. It jumped around and was needlessly difficult to follow. You have the main storyline of a guy in the house murdering women which was super generic but decent. Then you have this other storyline with Terrance Howard which had almost NOTHING to do with the main storyline and was used in a way that rendered it completely pointless (way to waste your best actors). From the preview I expected this to be more like Silence of the Lambs, but it wasn't at all. The concept of a dude watching these girls die via webcam was OK, but not executed in an interesting or substantive way. It wouldn't have changed much if that part wasn't even in the movie (sadly, the same goes for Howard). And just when things start getting interesting, the movie prematurely ends with no resolution whatsoever. It felt like the director didn't quite know what type of movie they wanted to make and used elements of several (silence of the lambs, feardotcom, untraceable, etc), but was unable to connect and interweave them. </li></ul><br><br><ul><li>Maybe it was just the version I saw, but the sound was abysmal. The music was WAY too loud and all of Howard / killer's dialog was nearly incomprehensible. </li></ul><br><br><ul><li>There are also some stupid plot holes like how the kid magically \"hacked\" and got the power to turn back on in the house / website.</li></ul>","user":"wormsoftheerth","rank":[6,10]}]