[{"title":"A good animation is made weak by clichéd writing.","rating":4,"date":"4 May 2014","review":"A good animation is made weak by clichéd writing.<br><br>Lot of work and thought and detailing goes into an animated film. But if the writing is weak it cannot be pulled off easily. RIO 2 precisely suffers from that. The scenes are too clichéd for my comfort and the plot is very age-old. The bird formations, their beautiful feats have been all been seen in RIO and there is nothing new to offer on that front too in RIO 2. I felt like the basic format of the earlier film RIO was taken and just few modifications were done in writing. So it has that been there, seen that feel that does not add up any value.<br><br>The voice over is good and it seems like Jesse Eisenberg did make effort to feel like the bird Blu. Although the chemistry between the two birds, Blu and Jewel does not show up adequately, individually voice over of each was good. It's Anne Hathway for the female protagonist, Jewel.<br><br>The other aspects were fine, considering this is a commercial animated film. A word about music, which was good in RIO, comes weak and though are many songs, not even one was memorable, as I left the theater. So the music did not make any impression either. <br><br>If people like average stuff or have not seen RIO, perhaps will like it as they may find some new things here. For me, I did not like it and felt like a big bore. An average rating of 2/5 for this. It's not bad, it's purely mediocre.","user":"braddugg","rank":[38,50]},{"title":"Entertaining","rating":8,"date":"29 March 2014","review":"While it wasn't the best movie or even the best animation I have seen this year, this movie is definitely entertaining.<br><br>The movie begins with Blu, Jewel and their three kids having fun in their home in Rio, while Blu's former owner, Linda, and her husband, Tulio, are in the amazon. While in the Amazon, they discover a flock of blue macaws. Seeing this on the news, Jewel is desperate to visit and the story begins as Blu, his family and his friends from the last movie accompany him to the Amazon.<br><br>The story is decent. There are quite a few songs and plenty of comedic moments as well. While Blu is trying to fit in the tribe, there are a couple of dangerous foes around, Nigel and an illegal tree logger (one of which had plenty of moments which kind of reminded me of Avatar). There are plenty of great moments in the amazon when Blu is trying to fit in, which leads to one of my favourite moments, which was when they revealed the Pit of Doom. Also, it was fun to see Nigel (the white cockatoo) back, along with some new characters. The voice-work and music were quite good as well.<br><br>This movie is entertaining, the story and ending are nice as well. Although I have rated it the same as Rio, I think this was a little better. Found it to be quite funny and more action packed as well. A fun family movie.","user":"Sahl_95","rank":[44,64]},{"title":"Some high quality scenes make not a good movie.","rating":5,"date":"6 April 2014","review":"I am not the kind of person to write reviews on my own, but this one you will read is made not only by me, but also by my 7 year old daughter, who watched this movie with me.<br><br>The movie started good. The 3D is good, the dancing animals and the introduction of Blue's family were creating big smiles on the face of my daughter. If the movie would have continued the same way we would rank it with 7 or 8 stars.<br><br>After a while I noticed the movie lost its speed, its flavor and most of the charm. Without 3D it would have been worse but with it it was still okay for me.<br><br>The reason why we rank it with only 5 stars is the following. After 60 min. my daughter started to become anxious. I asked her why she seems so nervous and she told me that she is bored. And in my surprise I noticed i am too and the kids around us. There was no laughter and no giggling. This should not happen in a movie with an average rating of 7 and my daughter and the other kids fitting into the target group.<br><br>The end of the movie was okay and my daughter watched it again with attention. But that I had to ask my daughter, if she wants to leave during the movie, lets us stay with 5 out of 10 points.<br><br>Watch it at home on DVD, but do not spend 20 (Germany) for an average movie.<br><br>For comparison to RIO No1: The reason we went into this movie in the first place, was that we own the BlueRay of Rio. We watched it together several times and we were looking forward to watch the second part.","user":"Schwanitz-Georg","rank":[24,34]}]