[{"title":"Man-Eating Sushi? Bring It On, Says Keiko!","rating":9,"date":"22 July 2012","review":"The daughter of a sushi chef, Keiko (Rina Takeda), tries to live up to her father's demanding training in both martial arts and sushi making, but it proves too much for her and she runs away. She finds a job as a waitress at a remote resort hotel that caters to special groups, such as the president and some of his associates running a major pharmaceutical company. Unknown to them, Yamada (Kentaro Simazu), a former researcher at the company who was framed and jailed on trumped-up charges, is living in the area - and he's angry! His research had involved bringing dead things back to life, and he uses his knowledge now to create.... killer sushi! Set loose amongst the guests and workers at the hotel, only Keiko and former sushi chef Mr. Sawada (Shigeru Matsuzaki) have what it takes to fight back, with the help of little dead/alive egg sushi, Eggy, of course....<br><br>This is one of those highly entertaining, completely nonsensical and over-the-top gory and funny films that the Japanese seem to have a lock on these days; at one point a character says \"this has finally reached a point where it makes no sense any longer\" and the audience wonders how it managed to take that character so long to come to that conclusion! My favourite line in the film is from disgruntled researcher Yamada who, at one significant moment, states that \"I have been reborn as tuna!\" An immortal line in anybody's book, I think. What keeps this film from flying all the way apart is its gonzo spirit and absolute commitment to its absurdity, and there are also some excellent martial arts sequences, particularly from Keiko - Rina Takeda is a rising martial arts star, and she was still a teenager when she made this film. Some people might object to the excessive blood-letting, but it's done in such an extreme fashion that it's really just hilarious, not nauseating.<br><br>If the FantAsia International Film Festival needs a descriptive film to show what it's all about, \"Dead Sushi\" is perhaps that very film, and it is really only right and proper that it had its World Premiere at this festival. The film was introduced by its director and co-writer Naboru Iguchi, and Ms. Takeda was also on hand to demonstrate some of her martial arts moves live; Mr. Iguchi encouraged the packed auditorium to yell out \"danger!\" or \"sushi!\" at appropriate moments, and the FantAsia audience took him up on it with great enthusiasm. Easily my favourite film of FantAsia 2012 so far, and one that I hope gets a wide distribution because it has to be seen (and guffawed at) to be believed!","user":"alisonc-1","rank":[16,18]},{"title":"Sushi, bloods, and guts...","rating":7,"date":"11 April 2013","review":"I must start out by saying that \"Dead Sushi\" (\"Deddo Sushi\") is not a movie that will appeal just to anyone. Why? Well, because this movie is very odd, unique and special, it is extreme to the point where it becomes hilarious and ridiculous. But it works out so well, because this Japanese horror/comedy really is good entertainment and a great laugh.<br><br>In this movie you will find flying sushi, man-eating sushi, sushi nunchaku, a man-tuna, rice-zombies, and other equally bizarre things. The outrageousness of it all is what makes the movie work out so well. The dialogue is equally outrageous, but funny at the same time.<br><br>The story in \"Dead Sushi\" is about a Keiko who flees the hard tutoring of her father in the ways of sushi making and martial arts. She runs away from home and ends up taking a job at an old inn run by a married couple. A group of visitors come to stay at the inn, but they carry a secret with them, and once unleashed, the sushi comes to life to wreck havoc on the humans. This time people becomes the food...<br><br>This particular genre of comedy/horror movies is unique to Japan, and you either love it or hate it - you either get it or you don't. As with other movies in the similar genre, \"Samurai Princess\", \"RoboGeisha\", \"Tokyo Gore Police\", etc. then you are in for extremities in abundance. If you enjoy this particular genre of movies, then \"Dead Sushi\" is definitely well worth checking out.<br><br>And with similar movies, you know what kind of acting you are getting right from the very start. It is not award-winning performances, of course, but still, good enough all-round performances and action.","user":"paul_haakonsen","rank":[8,9]},{"title":"Most fun I EVER had watching a movie!","rating":10,"date":"22 July 2012","review":"Astounding is hardly a strong enough word to describe just how truly sublime DEAD SUSHI was...<br><br>This was perhaps the most tremendously fun cinematographic experience of my life! I cannot remember laughing as much while pulling my hair and jumping up and down my seat squealing every five seconds to a point where trying to restrain my reactions became impossible! I also never imagined ever feeling so incredibly hungry, sitting on the edge of my seat, holding my breath and literally drooling with my fists both against my chin while looking at a hundred flying zombie sushi famished for something human.<br><br>And yes. If you see me walking around, speaking softly to a small omelette sushi safely tucked on my shoulder, fear not! Omelette sushi are the most adorable creatures and they save lives. Yes. They do. ♥ ♥ ♥ ♥ ♥","user":"vee-vee","rank":[19,26]}]