[{"title":"Fighting sequences make it worth watching.","rating":6,"date":"18 January 2015","review":"The fighting alone makes it worth the 6/10. The acting was hard to watch.. The story was nothing worse than what you'd find in other martial arts movies like Ong Bak, etc. <br><br>The movie has A LOT of fighting in it, and thankfully you don't have to sit through to much of the painful acting. The majority of the fights are really well done (especially those with the lead actor).<br><br>The fighters themselves can seriously fight. They have technique and speed that I've seen from more famous actor/fighters (Tony Jaa, Iko Uwais). The lead actor is especially fun to watch. If you're a martial arts fanatic like myself, you'll really appreciate the skill that he has. It's a shame these guys don't have a bigger budget to work with or may never getting the fame and reputation of guys like Tony Jaa but I truly believe they have the same level of skill as the famous guys.<br><br>I really hope to see more of these guys in more professional shot/ editing movies.","user":"minh_le","rank":[6,6]},{"title":"Awesome Fighting - Definitely watch this movie!","rating":10,"date":"9 January 2015","review":"Worth the watch! This movie is action packed with crazy awesome fighting throughout the whole movie and the fights just kept just getting more and more intense! It's absolutely worth checking out because you won't see fight scenes like these everyday. For a low budget movie they did a great job with all the action and the fight choreography was new and refreshing compared to other movies. Anyone who says \"bad fighting\" is crazy because the fighting was absolutely amazing and these martial artists are extremely skilled at what they do. Most Hollywood movies these days are all wires and CG and stunt doubles - so it's been awhile since I've seen fighting like this. I hope these guys keep making more movies because I look forward to watching them!","user":"ritamcmillin-364-425591","rank":[5,5]},{"title":"Dear, Martial Arts Action Fans - Watch This","rating":6,"date":"16 November 2014","review":"For all the direct to DVD action movies that usually hit the bargain bin their are a few hidden gems among them. Die Fighting would definitely rank up their as one of the better titles that are a part of the genre. Fabien Garcia is definitely a name to look out for in the future for the genre. The movie provides on a wall-to-wall succession of impressively shot and choreographed fight sequences that are sure to provide thrills. Of course the acting may not be the greatest, but the main actors do perform their own stunts and combat sequences which surely earn them respect for action fans. The story may remind you of another solid martial arts action movie BKO: Bangkok Knockout, but they do add a twist in their to make it more unique and fact that the story and characters pretty much mirror the real life of the actors makes it more interesting to watch. Overall, a must watch for fans of movies like Undisputed II and III, Ninja II and other Direct to DVD/video action titles. If your one of those guys who enjoys these types of films, than sit back and enjoy the action and don't think too much.<br><br>6/10","user":"ActionFan-Reviews","rank":[7,8]}]