[{"title":"Just Awful","rating":2,"date":"14 November 2016","review":"I saw this flick at DedFest and am sorry to say it was the worst film of the festival. I really like biker/exploitation films and was sorely disappointed by this one. It's shot in the tiresome fake grind-house style way which was so in vogue 10 years ago and has a lot of AfterEffects filters piled generously over it. There are some cute boobs bouncing through the film and the occasional decent gore effect but neither of these redeem the film. The dialogue is high-school levels of \"edgy\" and the actors (save Laurence R Harvey doing his best Poirot impersonation) are all varying shades of terrible. Unlikeable and insipid not even a couple pints help this clunker.","user":"werewolfgal13","rank":[16,22]},{"title":"Disappointing","rating":5,"date":"3 May 2019","review":"I liked James Bickert's absurd Dear God No, it was an original and highly effective homage to seventies exploitation cinema. I expected more of the same and therefore had high hopes for Frankenstein Created Bikers. Sadly the magic of Dead God No is nowhere to be found. The film starts on a strong note with a group of teenagers going to a lake only to end up being murdered by Bigfoot. Soon after Biker gang the Impalers show up and capture Bigfoot and bring him to a mad scientist. It's all downhill from here on and I was honestly glad when it was finally over. This would have made a great grindhouse faux trailer, but does not hold up over it's 125 minutes over-bloated running time.\nThere's some great moments (but they are few and far between) and plenty of gore and nudity. Praise also has to go Tristan Risk (American Mary), who steals the show in every scene. Ellie Church is also always great to watch. I love that they shot the film on 35mm. The biggest problem with Frankenstein Created Bikers are really the disjointed, incoherent script and the awful dialogues. The editing is also at fault with no real continuity.","user":"troma_freek","rank":[5,6]},{"title":"Wow!","rating":1,"date":"17 April 2020","review":"This has got to be THE DUMBEST steaming pile of maggot infested garbage I've ever seen...","user":"desilvatron","rank":[0,0]}]