[{"title":"A missed opportunity","rating":4,"date":"30 January 2019","review":"I love Killing Joke, I was so looking forward to this, finally a music documentary on this major, influential and brilliant band. But, it was not to be, the terrible sound mixing is one thing, that alone could have been overcome, maybe, if the documentary had some kind of purpose.<br><br>The dialogue was drowned out for most of the film, either by having the music in the background mixed at the same EQ as the voice over, but with the music slightly louder, so it drowns out the dialogue completely. Another issue was having an unnecessary droning sound when contributors were speaking, much of what was said was indecipherable, hence defeating the purpose of the documentary. Definitely the worst sound mixing I have ever heard.<br><br>The documentary itself decided to skip the amazing music and concentrate on the blatant, empirically impossible nonsense of the occult. Anyone with a basic understanding of the laws of physics would be irritated by the pretentious twaddle espoused throughout this documentary. It was just like watching a christian rock group talk about their faith based beliefs, boring, irrational nonsense, I didn't expect a religious documentary about one of THE major post-punk bands, all that was interesting about this band was ignored, or if it was talked about, could not be heard because of the appalling sound mixing. The music should have taken priority, and just a brief chat about their religious faith, something that was not a major part of their influential output.<br><br>The piece on Jaz Coleman recording classic music, with influences from middle eastern music was very interesting, but again was largely ruined by the terrible sound.<br><br>A missed opportunity, it should have been amazing, it wasn't.","user":"barryjames-mc","rank":[1,1]},{"title":"You'll need headphones to make out what they're saying","rating":4,"date":"23 October 2019","review":"There's some interesting stuff here, mainly from Youth and Big Paul, but the whole thing is badly let down by the worst sound mixing for the interviews I've ever heard. Even with headphones on. it was really difficult to make out most of the time due to terrible initial recording quality (on some of them it sounded like the mic was 10 feet from the interviewee) that's compounded by droning noise and music playing in the background. Also it could easily lose 30 minutes from the 150+ min running time by losing the Icelandic bits which really add nothing. Considering it's taken 12 years to put together, it's really disappointing and I can't understand why they would release something when the interview audio quality is generally so poor. Also, it's not really a Killing Joke doc per se, it's more a Jaz Coleman documentary that includes Killing Joke. Worth a single watch of you are fan but not repeat viewing, not really anything there for non-fans though","user":"howard-89484","rank":[0,0]},{"title":"There's no business like show business","rating":3,"date":"7 May 2017","review":"I think I am writing the first review of this film. I have followed modern music throughout most of my life and whilst I had heard of the group Killing Joke, I knew nothing about them and was not familiar with any of their music. Having seen this film, I am not much better off. I am sure that we have all watched documentaries about pop groups - their formation, successes and failures, the inevitable reliance upon drugs and booze, the lies and deceptions and the final falling out. This film is no different save that the group is still going as far as I know. You get more or less what you would expect with two possible exceptions. Firstly, the members of the group profess an affinity with mysticism and the dark arts generally with many references to metaphysical events which they claim to have experienced and which permeate their music or at least that's what they say and if you could actually hear any of their lyrics, this may well be true. Secondly, the \"front man \" is a remarkable individual called Jaz Coleman. A very intelligent and talented man but as is so often the case with such people,deeply flawed with self-confessed stays in psychiatric hospitals and narcotic addictions.I was not particularly engaged when watching this film as I found the group members and attendant managers and disgruntled former managers to be by and large the sort of people I would very much wish to avoid.I am sure that if you took any well known past or present rock band and put the members under a microscope, threw in some archive footage and vague reminiscences from people who claim to know or have known them, you would not see very much different than what is portrayed here. I can't see that this film would appeal to anyone other than a die-hard Killing Joke fan and surprisingly there are plenty of them..","user":"dunfincin","rank":[4,12]}]