[{"title":"I must not have seen the same movie everyone else here saw.","rating":3,"date":"15 July 2015","review":"At the time of my writing this there were 11 reviews (as opposed to just ratings). The average rating of these 11 reviews was 9. 9 out of a possible 10. Having now had this movie inflicted upon me, I cannot see how these ratings could even remotely be legitimate.<br><br>This movie was terrible. Admittedly, movies full of ack-tors and path-oss and Deep Meaning are really not my usual first choice. But I figured, given all of these stellar reviews, how could I possibly go wrong? Very easily, I guess.<br><br>Every single adult in this picture is entirely dysfunctional. The spectrum of dysfunctionality ranges from basic autism at the most forgivable end and goes across completely fraudulent, rank infidelity, BS artist, obsessively self preoccupied, and on throughout what seems to be every possible human failing. It is an ongoing human train wreck nestled in a beautiful natural environment and garnished with lovely music.<br><br>In the middle of this waltz of jerks is a preternaturally pretty little girl of about 11 years old who's the only decent person amongst them. She's depicted as genuinely sweet, and an endless well of kindness and patience and apparently capable of forgiving the unvaryingly appalling behavior of everyone adult around her. It was actually quite disturbing to watch in horror as every adult repeatedly emotionally detonated around this poor little girl, leaving her blasted like a starling before the storm.<br><br>And so naturally the only adult she even vaguely manages to connect with is the artistic one who, of course, is the one who dies, willy- nilly, at the end of the picture (basically out of nowhere) simply in order to serve some ridiculous notion of Symbolic Meaning.<br><br>It is an appalling truth of daily human life that we, each of us, have to live with our own feet of clay and those of everyone around us. Why on earth does anyone want to go see a movie that reaches to demonstrate just how bad that can get? And just how emotionally squished kids can get in the process.<br><br>Bleck.","user":"i-34252","rank":[18,21]},{"title":"Depressing, even cute little girl can't rescue it","rating":21,"date":"21 February 2017","review":"During the Fourth of July holiday, a group of people are staying in a lake house belonging to Ellis and Wendy. Ellis is \"Provider Dad\" to Joey, while Saul King is her Biological Dad and Wendy's ex. Saul wanted a boy so that explains Joey's name, but she's quite feminine. On the radio, Saul is described as a someone who left Wall Street and became an author whose debut novel reached the number one spot, something that had not happened since Fitzgerald. <br><br>Saul's books have birds in the title but are not about birds, as quirky bird lover Chad discovered. Still, Chad enjoyed the books and wants to interview Saul. He is also a photographer (it's not clear to me whether he's a professional journalist, but I think he is). Chad seems to have mental problems but seems relatively normal.<br><br>Saul is with Emma now, but their marriage may be in trouble. Ellis and Wendy are also on shaky ground. Ellis is kind of a wimp and Joey doesn't really respect him.<br><br>Another couple in the group has this peaceful, spiritual attitude I can't stand. Saturn Moon is worse than her male partner (I can't remember his name), but I'm happy to say even she gets angry. And I enjoy it when he plays the ukulele.<br><br>Everyone has some sort of relationship problem, if they are in fact in a relationship. Chad just has problems. After a while this gets tiring for me.<br><br>In addition to the scenery, the fireworks show, and occasional comedy, the best thing for me about this movie is Joey, who occasionally narrates. Johnny Sequoyah does a great job for such a young actress, and she handles herself well among all the chaos.<br><br>Don't be fooled, though. This is far from a family film. Occasionally the sound went out when I saw it, with a character's mouth blurred. This happens frequently later on, and the words likely spoken are just garbage. When was the last time you heard the F-word used the way it was intended? I believe it is used a lot here for that purpose.<br><br>I don't know her name but the jewelry salesperson was so nice and did such a good job. But who sells a $250,000 ring in an ordinary store? Don't they sell those in fabulous places where the snooty British salesperson has his nose in the air?<br><br>I thought of something else i liked. Bikinis!<br><br>This is probably a good movie and there are some performances that are worth seeing. It just didn't do much for me.","user":"vchimpanzee","rank":[3,3]},{"title":"Unique, Moving, and Compelling","rating":9,"date":"21 July 2014","review":"I wasn't sure what to expect when I sat down to watch Among Ravens. I had seen the trailer and was intrigued by the idea of \"Ravens\" as a symbol of family and it had been quite some time since I had seen Amy Smart in a film. Let me just say, I was pleasantly surprised and thought the film was completely delightful. Filmed in the incredibly beautiful wilderness of Idaho, Among Ravens is a fun yet very emotionally compelling drama about family and human relationships. In some respects it reminded me of The Royal Tenenbaums with all its quirky characters, but with some of the seriousness and dramatic undertones of August Osage County. Overall, the performances were strong -- Amy Smart was wonderful and if you're a fan of Believe (which was sadly canceled) you will be blown away by Johnny Sequoyah's performance. If you're looking for something different, filled with real heartfelt emotion, then sit down and watch this movie.","user":"brandonfoster05","rank":[9,19]}]