[{"title":"Finally a parody I loved!","rating":8,"date":"9 January 2014","review":"I grew up with parodies, stuff that was making fun of other movies through references rather than vulgarity or silliness. I tried to enjoy many of the parodies of today and I couldn't, because they were not meant to be real movies, they didn't have acting, but just an ugly caricature of the art.<br><br>I am happy to report that Hell Baby is a really fun parody of possession movies! It references a lot of them, but not in a direct recreation of scenes or using toilet humor, instead by taking the parody and putting it into a well acted film. All actors involved played really well, but Rob Corddry was the highlight of the film. Also Keegan-Michael Key added a lot to the comedy of the situation.<br><br>The plot is that a family awaiting twins move into a run down house in a bad neighborhood. The house is possessed and soon lovely Leslie Bibb, the pregnant mother, is as well. The demolition of horror clichés soon follows.<br><br>Bottom line: I am not really into comedies and I don't easily laugh at them. Parodies have to be even better than a normal comedy, because I've seen the movies they are making fun of and they have to be at least funnier than those - which is a hard thing to do for some of the horror films around. And yet I really enjoyed Hell Baby and I recommend it to just about everyone. Well done!","user":"siderite","rank":[30,37]},{"title":"Don't trust the low rating if you like Comedy Horror!!! This movie ROCKS!","rating":10,"date":"12 December 2013","review":"OK, Honestly, first off, this movie deserves a true 100% 7.0 RATING, but I HAD to give it a 10 just to help balance out the ridiculously low rating of a 4.8? SERIOUSLY? I've watched over 10,000 movies in my life (probably). HUGE comedy horror fan. I loved this movie! I laughed so hard so many times. Nudity (hot girls), lots of gore, silly comical scare moments (reminded me of 80's horror movies), plus great actors!<br><br>Don't trust the rating, give it watch if you like comedy horrors (Shaun of the Dead, for example, or remember The Burbs with Tom Hanks?)<br><br>What this movie is NOT like is the Scary Movies series. I never laughed much (if at all) at the Scary Movie 1-10 or whatever they are at now. Not my kind of humor, but this movie really hit home with me. This was made by the makers of Reno 911, which gives you a hint at the type of comedy it is. I always laugh hard at stuff like Family Guy, Ted, Community, Half Baked, etc.. i guess i would say its that kind of humor. <br><br>Generally, if a movie is rated less then a 5.5 on IMDb i won't like it.<br><br>This movie is the exception to the rule. Somehow this is a movie that a ton of people seem to rate very low, but I absolutely loved it. Great stoner flick. And I want to make one last point very clear: This is not your standard Redbox crappy horror movie where you feel like you wasted your $1.00. You know, those movies that look like they were filmed with a crappy camera and crappy actors, and they bore you, and its torture to watch more then the first 20 minutes? This movie was a blast for me right at the start.","user":"aweofscience","rank":[51,70]},{"title":"Parody horror","rating":6,"date":"22 February 2015","review":"This movie certainly does deserve more then the low ratings it has. I wanted to give it 6.5 but that's not possible so a 6 it is. I can see why people dislike it, because they probably expected something completely else but it is what it is. It's a parody of horror movies with some stupid jokes, and that's what it is supposed to be. The stupider they are the funnier it gets. As soon as I saw Keegan-Michael Key was in it I was skeptical because I absolutely hate him in the TV-show \"Planet's funniest animals\", but in this movie he was actually not that bad. I even laughed out loud a couple times. Don't expect horror or anything even though there are a lot of bloody gory scenes because it's all too funny to be scared. I don't regret watching this at all.","user":"deloudelouvain","rank":[11,13]}]