[{"title":"Should have made Lemonade......","rating":2,"date":"15 January 2015","review":"Two Australian men introduce three American backpackers to the legend of Lemon Tree Passage, where a ghost warns young drivers to slow down. <br><br>After seeing the ghost, they uncover a force that haunts the area, and starts to shroud them. <br><br>Isolated and miles from home, the tourists find themselves caught in an evil force much more hideous than the stories that have been told....<br><br>What could have been a nice little Antipodean horror movie, gets bogged down by it's own cleverness, and poor acting from the cast.<br><br>It starts off well enough, two parties on the beach exchange stories, and go on to pursue one of the stories, but instead of going down the straight horror 'gorenography' route, which would suffice for a low budget movie, the makers have decided to be clever and do something a little different.<br><br>sometimes it works, sometimes it doesn't, and this is a prime example of the latter.<br><br>When you start to question a movie, and find yourself saying 'I would have settled for a below par I Know What You Did Last Summer', which this sets itself up to be, you know you are losing interest rapidly.<br><br>What we get is a twist on the myth, the original story is wrong, and we get a sort of weird Woman In Black revenge film.<br><br>Which bored me senseless, mate.","user":"FlashCallahan","rank":[20,22]},{"title":"Senseless Mess","rating":2,"date":"12 March 2016","review":"The American Maya (Jessica Tovey), Amelia (Pippa Black) and her brother Toby (Tim Pocock) are spending vacation in Australia. The meet the locals Geordie (Tim Phillipps) and Oscar (Andrew Ryan) on the beach and Oscar tells a ghost story at the campfire. He tells that a ghost of a motorcyclist appears at the Lemon Tree Passage intersection when a car with teenagers speeds up at the spot. They decide to go to the location to see the ghost with tragic consequences.<br><br>\"Lemon Tree Passage\" is a horror movie with a story that is a senseless mess. It is impossible to understand the plot that begins with the ghost of a married motorcyclist and ends with the fiend of a raped girl that was murdered. Is Sam the older brother of Geordie? Why the evil ghost seeks revenge against the teenagers and not only against Sam? Why Maya is connected and possessed by the evil spirit? There are so many questions to be made that better off not waste time watching this flick. My vote is two.<br><br>Title (Brazil): \"A Lenda Negra\" (\"The Black Legend\")","user":"claudio_carvalho","rank":[14,15]},{"title":"A truly random haunting","rating":3,"date":"15 November 2015","review":"Lemon Tree Passage looks like a movie made from three different rejected screenplays. It's utterly inconsistent, shifting its tone multiple times and using cliché base premise that doesn't pan out in any way. It even has stupid teenagers cast who mock how ridiculous campfire story is, and then the movie proceeds on doing that exact same ridiculous cliché.<br><br>This is the same old story about a group of teenager who try an urban legend. The characters are identical to almost every other horror movies, the main lead brunette who has visions all the time, the possible love interest cool guy, the blondie and the comic relief. They behave in a very predictable way, this might just be a copy of bloopers from 80s horror movie.<br><br>After a while the logic crumbles as both the characters and even the haunting act in such arbitrary manner. Splitting up in crisis is foolish, but these people split up off-screen without any reasons. The supposed entity even haunts sporadically, it jumps from scene to scene as urban legend, possession and whatever horror gimmick the mood takes it.<br><br>The movie is a consecutive series of random occurrences which lose any sense of continuity or even structure after thirty minutes, which is already thirty minutes of your life that could've been saved.","user":"quincytheodore","rank":[11,12]}]