[{"title":"Original? Nope. Decent? Sure. Entertaining? Yep!","rating":7,"date":"20 February 2020","review":"Awesome action, with 2 strong leads borders on comedy, but allows the actors to play off each other and showcase their skills. Not to mention a much more entertaining takeover sequence than \"Olympus Has Fallen\", or at least more thought out.","user":"MR_Heraclius","rank":[38,49]},{"title":"Great, silly, cheesy action fun - this movie should have been a hit!","rating":13,"date":"13 December 2013","review":"I'll never fully understand why people flock to films like \"Iron Man I-III\" and then completely ignore a fun action film like \"White House Down\". After reading so many bad reviews, I started watching Emmerich's latest noise-opera only because I wanted to get tired enough to go to bed. I had planned to watch the first 5 minutes and to then fast forward through the rest of the film and have a quick look at the expensive special effects. Never did I expect to actually enjoy myself - and yet I did. In fact, I enjoyed myself so much that I couldn't stop watching for the entire 2 hours, and I didn't even get up to go to the bathroom. Right from the start I realized that this movie doesn't take itself too seriously and that this is Emmerich having fun (destroying the White House - if you count freezing it - for the fourth time). But despite all the silliness and the tongue-in-cheek moments, this is a suspenseful ride which never lets up and kept me hooked the entire time. There are quite a few unexpected twists and turns along the way, and the wonderful supporting cast (James Woods, Richard Jenkins and Jason Clarke, to name a few) keep even the most clichéd characters fun and interesting. So my verdict: Great, silly, cheesy action film! Suspend your disbelief and you will have one hell of a good time. I rate it 7 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[119,171]},{"title":"A waste of 2 hours","rating":1,"date":"24 May 2014","review":"Rating this as 1 out of 10 (awful) doesn't really reflect just how poor this film actually is. I understand that this is Summer blockbuster patriotism but this trash is an insult to the eyes, from the bad acting to the script... who would say these things. <br><br>Rather like 24 (which is a good watch) can I suggest that the Government departments and agencies beef up their recruitment procedures because it seems that they regularly employ traitors and never properly check the background of people who suddenly start working in Government buildings.<br><br>One positive is that the bad guys gradually lose their ability to shoot accurately as the film progresses. At the outset, they are slick and basically kill everyone with dead-eye precision but later on they become standard 'can't hit a barn door' baddies who attended the university of bad guys never win..<br><br>2 hrs lost forever...","user":"Paulh616","rank":[61,94]}]