[{"title":"Food is love","rating":10,"date":"7 July 2014","review":"Oliver (Richard Coyle) in The Food Guide to Love is the ultimate foodie and food writer. As a kid, while others were cheering on their sports team, he was enjoying the tapas and fine cuisine at the snack table. He becomes a run away success in the way he describes the sensual aspect of food but has had a hard time translating that erotic magnetism into his relationships. After 6 months they burn out and he moves on to his next course. All is well until he comes across a hot fire Spanaird in Bibiana. She is an activist with a father's complex that sees through Oliver's frivolous ways. A foreign film that celebrates the joys of life and teaches us that along the way we much enjoy the banquet of life's joys. I believe this is a great film for anyone that wants to watch a good story.","user":"abcvision","rank":[9,13]},{"title":"Not impressed","rating":6,"date":"2 March 2014","review":"Just saw it at the Dublin Film Festival and, to be honest, wasn't very impressed. It was shown in the Irish category so I thought it would be one of those Irish films that are usually low-budget but personal, fresh and original. This one was none of that. It would be more in line with Hugh Grant's romcoms. I mean it's nice to watch with your missus, plenty of jokes thrown in, but it's more \"one of those films\" than \"must not miss\". I am not sure if it qualifies for a \"Dublin film\" either. You need to be Irish or at least someone with deep love for Dublin to make a truly \"Dublin film\". Here, the director/writers are not Irish and hardly been to Ireland before the film. They were just told (according to Q&amp;A session) that Ireland is a cheaper place to film in, so they hired an Irish writer, changed the background to Dublin, and voilà - got an Irish film. Kind of cynical. So it's more \"filmed in Dublin\". Although the location crew did make a decent job of trying to avoid the usual clichés. So at least, you'll get some nice shots of the modern Dublin.","user":"pnck71","rank":[9,18]}]