[{"title":"Genuine terror","rating":8,"date":"15 May 2015","review":"The Babadook isn't for the mainstream crowd. If you're looking for jump scares and scary monsters you wont find any here. The Babadook is a movie that taps into the basal emotion of fear. It portrays the truly terrifying things in life - grief, loneliness, and despair. Not things that freak you out but things that make you unsettled, disturbed, and human.<br><br>The acting is fantastic, the story itself is unique and told brilliantly through its subtle writing and directing, it's very well paced, I could go on and on. What I love about this movie especially is the suspense. There is always tension present throughout the movie, like there's an underlying unease to every shot. The way Jennifer Kent crafts these shots is bleak and macabre but not to the point where it's depressing. You're always on the edge of your seat. And I can't give enough credit to Essie Davis. Her performance is Academy Award worthy material, seriously. The son is great as well. At first he may seem obnoxious, and to an extent he is, but he acts exactly how a kid would act in that situation. You believe him. You believe everything these characters are doing, and that's what makes this movie work so well.<br><br>The Babadook really is one of the best horror movies I've seen in a long time and I've seen a lot. Is it scarier than The Conjuring or Sinister? I wouldn't say that, but that depends entirely on your definition of scary. This movie explores the more disturbing and realistic side of the genre, I'd say it's more haunting than said movies for sure. It's psychological horror at its finest. It actually gets under your skin, and when a movie can do that, it has done its job.","user":"lnvicta","rank":[333,410]},{"title":"Chilling and Sad.Ignore the One-Stars!","rating":8,"date":"2 November 2014","review":"Never written a review before. Haven't felt the need. But after seeing the 1 star reviews of this film,i just felt compelled. <br><br>Firstly,what this is.<br><br>I would say a cross between The Shining and We Need to talk about Kevin. This film is desperately sad. A woman who is haunted,first by her husbands death,then by the Babadook all while looking after her young son. This is a creepy, no jump scare, fantastic psychological horror. A rare gem that plays on all those fairytale fears that you may have had as a kid.<br><br>Second.What this isn't.<br><br>Well,not \"The worst horror in years\".I get that people have different opinions.I do.But this isn't a film that can justify that sort of nonsensical comment. It isn't a dull jump scare-filled blockbuster. The characters are not hot teenagers. They are believable, disturbed and this makes the film the slow,creeping horror that it is.<br><br>If you are a fan of horror,it really is a must see film.","user":"garydear3009","rank":[608,789]},{"title":"Much more than a horror film","rating":9,"date":"29 August 2015","review":"While \"The Babadook\" may display some of the hallmarks of the traditional horror film, there's a lot more going on here than meets the eye. Far from the typical Hollywood bloodfest so brilliantly satired in \"Cabin in the Woods,\" this film's characters are layered, its plot is mercurial, its actions are metaphorical, and its conclusions are ambiguous. All this is likely to disappoint those filmgoers who need to be spoonfed a formula. But if you're a film lover, Do. Not. Miss. This.<br><br>Director Jennifer Kent understands what most horror filmmakers fail to grasp: that our biggest fear isn't of crazy killers or monsters or ghosts, but of ourselves—what lives inside us, the emotions we have to live with, the illusory veil of self-control. <br><br>The plot revolves around a mum, her troubled son and the book he pulls off the shelf one night. But you already know too much. This is one film where knowing less going into it will really pay dividends. Really, don't even watch the trailer.<br><br>Just know that the storytelling and craft are flawless. Essie Davis delivers one of the most challenging performances put to screen with total commitment and credibility. Kent's storytelling is utterly absorbing and she so delicately treads the line between what's real and what's not that you can never be sure of yourself. <br><br>What you make of \"The Babadook\" will depend on who you are. You might take it at face value, as a creepy monster flick with all the constant threat and looming dread and shocking moments. You might take it as an attempt to capture the authentic experience of mental illness. You might take it as a symbolic story using a metaphor for grief and loss. The best films make you feel something and allow you the room to make sense of it yourself.<br><br>Personally, I thought about this film for days after seeing it, both because of its ambiguity and because of the themes it explores, namely mental illness and domestic violence. Yes, it's scary. But it's also touching and heartbreaking. While \"The Babadook\" belongs alongside other great psychological horror films, like \"The Innocents\" and \"The Haunting\" (1963), to classify it purely as \"horror\" really belittles its accomplishment as a film that challenges us to examine and discuss issues we are very uncomfortable tackling in reality.","user":"mikeburdick","rank":[114,157]}]