[{"title":"Awful","rating":1,"date":"27 May 2014","review":"Whilst watching Nymphomaniac I found myself often intrigued but when it was over I wondered what I got out of watching it ultimately. It all didn't really go anywhere if you ask me.<br><br>Why is it a worthwhile experience to watch this film in Lars von Trier's opinion? Why do we need to see this film in which we among other things see mankind more or less at its worst? What is the point of this film which disgusts at times? It also depressed me as it seemed to have quite a grim, defeatist, misanthropic outlook which I found a waste of time to witness. I think the film lacks focus as well as maturity.<br><br>What disgusted me for instance was the moment towards the end during which the girl relieves herself on top of the female protagonist. What is the point of this, Lars? We already knew the girl was bad news.<br><br>The fact that there was nudity and sex in the film didn't disgust me in and of itself. I don't have a problem with nudity and sex in films but it has to be there for a good reason and it's like the whole idea behind the film isn't clear; what Lars intended to do with this film is simply beyond me.<br><br>A one star rating on here stands for \"awful\" and I have no choice but to give it that as I truly do think it is an awful film.","user":"avzwam","rank":[164,249]},{"title":"Feces on a wall calling itself art is still just feces.","rating":1,"date":"5 March 2015","review":"Where to start? Watching Nymphomaniac, both volumes, is like going to an art show where feces is displayed, and everyone is standing around discussing the contours, layers, lighting, and you're standing quietly thinking to yourself, \" I must be missing something. This is art! Isn't it?\" Basically, the story of emperor's new clothes at its finest. I will be bold enough to say that no, I'm not missing anything. It really is just sh** I'm looking at. My final thought at the end of both volumes was \"wow, those are hours I'm never going to get back.\" And it's not that the movie was all bad. Charlotte is wonderful, as are all the other actors. The topic is interesting. I didn't mind the nudity and I wasn't offended by any of it. There just isn't any point to it at all! None. Just when you think there may be some point in the friendship she develops with an asexual male, the story stuffs that thought into the toilet in the most confusing unnecessary way. Or when you think there is some point to her love story with Jerome, that is trashed in a very stupid way too. And if the director thinks that he is building up, just to let us down, well, he fails to build anything up since the whole movie is so boring and monotone. There just no point. And if the point of the movie is that there is no point, then why the Hell am I stuck staring at the screen for so long? Anyways, I am utterly disappointed. This is poop.","user":"lubchka6","rank":[103,154]},{"title":"The movie rails off into an unwanted territory","rating":2,"date":"10 August 2015","review":"The characters all end up committing heinous acts that throughout the runtime of two films would lead you to think is completely unlike them at all. Not only is the final act a giant figurative middle finger to the audience, but it also decides to give all the characters completely new personalities just to be able to create a shocking ending. What is so infuriating about the ending, is that there was no built-up or anything suggesting that the characters were capable of doing these acts. It is not as if only one character were to do something that is \"outside of their character,\" but it is pretty much everyone in the movie decides to do something completely unlike themselves all at the same time, just to be able to have an unsatisfying climactic conclusion. Other than the final act, the other scenes also seem to delve more into fetishism instead of focusing on the central \"problem,\" which is her sex addiction (or nymphomania). The movie rails off into an unwanted territory and brings all 4+ hours of these two volumes to not only a disappointing ending, but also an ending that is insulting to its audience.","user":"maripere95","rank":[66,100]}]