[{"title":"Grossly underwhelming (spoiler free)","rating":6,"date":"25 April 2015","review":"Spoiler free review. Let me first start of by saying that I am not a Marvel ''fanboy'' or a DC nerd. The comic book genre of films have made it to my personal top 3 favourite genres in the last decade and the MCU has been a strong contributor to that rise. I hold the first Ironman, first Avengers and Captain America 1+2 in high regard. I did not like the direction they took with Iron Man 3 (more on this below) or Guardians of the Galaxy but Winter Soldier was a gem in terms of balancing solid action, drama and levity.<br><br>That being said, my initial thoughts on Age of Ultron (AoU) are quite negative. To me, its essentially a carbon copy of IM3. There are problems which strike you repeatedly as you progress throughout the film. The 2 biggest complaints I have with AoU is 1) the tone (comedy) 2) the script/writing.<br><br>So starting with the tone. I like to laugh as I'm sure most people do, but there is a time and place to exhibit your comedy writing skills in an action film. In AoU, its a constant, recurring and predictable theme. It's not limited to one character either, everyone is popping one liner jokes as if its the Expendables and yes, most are not funny. The timing of these moments of levity are horrible too, desensitising the viewer to any impending fear of death in battle. If the characters seem so relaxed in not worrying about possibly dying, then what suspense is needed to be held by the audience? This plagued IM3 in a bad way and its arguably worse here. The comic book films which achieved great success in this regard were XMen DOFP, The Avengers 1, Cap 2 even Dark Knight Rises! Can you imagine at the climax of Xmen DOFP if old Magneto and Storm and Bishop start pulling one liner jokes as the army of sentinels came charging at them? It would kill any tension! 2) The script. I won't say too much since this is a spoiler free review, but it really feels rushed and unorganised. I watched Fast 7 around 2 weeks before AoU and I got similar vibes. Again, its not the fact that the film is 2.5 hours long or has too many characters, that isn't am excuse since The Dark Knight and Xmen DOFP shows how to navigate these theatrical obstacles. There are a few completely unnecessary subplots in AoU and useless characters which do not impact the story overall. The villain himself, Ultron is another massive let-down in Marvels already growing catalogue of mishandled villains.<br><br>So as a summary, if you want mindless action and cool CGI, which this film does offer in the form of some spectacular visual fight scenes then you will like AoU. If you are after a darker, grounded and more moving story like the trailers promised, you will be severely disappointed. Final score 6/10 and I am being kind since Cap is my fav Avenger and they finally gave him some good screen time.","user":"charzhino","rank":[877,1]},{"title":"Avengers: Age of Ultron is a damn good Superhero flick, excellent sequel!","rating":10,"date":"8 May 2016","review":"Avengers: Age of Ultron (2015) is a MARVEL damn good superhero flick and an excellent sequel! Yes it is miles way better than Jurassic World and Star Wars: The Force Awakens and Terminator Genisys I have enjoyed this film much better than Jurassic World, Star Wars and Terminator the new movies. <br><br>This film is fun, popcorn, Action and entertaining action sequel flick. I like the first one but I love this one much more. The first time I watch it, I did not like this film at all, it did not work for me, but the second time around this flick was awesome and it become one of my favorite MARVEL superhero movies. I love this film so much, more than the first Avengers. James Spader made the movie for me! So much better than Loki. <br><br>\nJames Spader and Robert Downey Jr. played together in a teen movie Tuff Turf in 1985 and 30 years later they teamed together to star in a MARVEL comic book super hero film. I like Tuff Turf but Avengers: Age of Ultron is far way better film to me. I love this film so much and I will never get the backlash. Joss Whedon gave me everything I wanted in a sequel. This and the first film are in my top 10 films of all time. <br><br>I waited a long time for this universe and I am loving every minute of it. Superhero movies come out all time but something like this is what I love about movies. <br><br>\nPlot: Tony Stark creates the Ultron Program to protect the world, but when the peace-keeping program becomes hostile, The Avengers go into action to try and defeat a virtually impossible enemy's to get. Earth's mightiest heroes must come together once again to protect the world from global extinction. <br><br>I really enjoy this movie I don't get the backslash and a lot of people were disappointed with this sequel that it is not so good as the first film. Age of Ultron is in my top 3 favorite comic book films. Number 1 will always be Captain America: The Winter Soldier and number 2 will be Captain America: The First Avenger, I just love those two films: Captain America is my favorite superhero character in MARVEL comic books. <br><br>Captain America in this movie is the most decent hero in this movie, he did not want the leave the island with people stuck on it, he refused too, I have seen a hero in him. <br><br>People are keep getting upset over Black Widow (Scarlett Johansson), \"oh look what they did with Black Widow.\" I saw the film and I am seeing her kicking ass or calm down the Hulk, which is a pretty ballsy thing to do. Specially for someone who has no balls and she is kicking ass and driving motorcycle, driving around shooting for Cap, helping them to get vision android to beat Ultron and she is the only one with no powers, except Hawkeye (Jeremy Renner), she has the to get the thing for them. I think it would be weird to kidnapped Thor, if you put Thor in the scene duh. I enjoy this movie much more than the first film, the first film I liked okay, I like the first Avengers film. This is a fun popcorn entertainment flick that I really love. <br><br>\nI like the romance between Black Widow with Hulk it was really good fast paced entertainment. I love Elizabeth Olsen as Wanda Maximoff / Scarlet Witch I like the twist by the end of the film that she turn her side around when she found out that Ultron wants to destroy everything on this planet I love that. You have Aaron Taylor-Johnson in it from Kick-Ass film as Pietro Maximoff / Quicksilver sadly he dies on the end of the film, but he saves Hawkeye and a kid from Ultron firing bunch of bullets on them I thought that was pretty decent in the film. In my opinion Aaron Taylor-Johnson did a good job playing his character. I love that they return Samuel L. Jackson to the movie back as Nick Fury and that he help them out fighting Ultron. James Spader did a terrific excellent job playing Ultron.<br><br>Avengers: Age of Ultron is a 2015 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012's The Avengers and the eleventh film in the Marvel Cinematic Universe (MCU). <br><br>You have a lot of action in it, I also love that Tony Stark, Steve Rogers, Thor, Bruce Banner (Hulk), Natasha Romanoff, and Clint Barton work together after Ultron failed to destroy them and they go in to safe house to Clinton's family, I like that. When Scarlet Witch (Elizabeth Olsen) touches Black Widow, Iron Man and Thor I like that you see a background of Natasha Romanoff's childhood, I like that. I love the African shipyard you see them on a ship and I love the last stand. I love that the Vision helps Avengers to destroy and stop Ultron from extinction. Btw I love to death Black Widow / Natasha Romanoff (Scarlett Johansson) she is so beautiful and charming I love her.\nOverall: I am giving this flick 10 out of 10 for me Age of Ultron is my #3 favorite super hero movie. I can't wait for the next movie: Captain America: Civil War.","user":"ivo-cobra8","rank":[124,191]},{"title":"Messier, for sure, but still plenty of \"Avengers\" fun","rating":7,"date":"8 May 2016","review":"The task of bringing together Earth's mightiest heroes took Joss Whedon into uncharted territory with 2012's \"The Avengers,\" and, despite the weight of the Marvel Cinematic Universe on his shoulders, the results were staggeringly entertaining. The task of making a sequel to that ground-breaking, monumental event film, however, and being expected to deliver on par or better results, is an entirely different beast.<br><br>\"Avengers: Age of Ultron\" was definitely built on the bullet point takeaways of \"The Avengers,\" which are: Make time and space for wit, banter and humor for the sake of humor to prevent the film from taking itself too seriously; give each character a story arch and independent moments; choreography clever action sequences with well-timed glory shots. These components are in full force in \"Ultron\" and make enjoying the blockbuster as easy as shoving a lollipop in your mouth.<br><br>Yet \"Ultron\" is infinitely more complex than its predecessor. The number of heroes featured barely fits into a single action figure play case, meaning more subplots and back story, in addition to creating an arch of the creation and life of Ultron itself. With a plot that takes the Avengers from the eastern European country of \"Sokovia\" to New York to the African nation of \"Wakanda\" to Seoul, South Korea to Sokovia again, much of \"Age of Ultron\" is a non-stop blur.<br><br>The film opens with the Avengers leading an assault on a secret HYDRA facility where they have located the staff that Loki used to lead the Chitauri invasion in \"The Avengers.\" When they secure it and bring it back to New York, Tony Stark (Robert Downey Jr.) and Bruce Banner (Mark Ruffalo) discover that its power source contains a blueprint for artificial intelligence, which would allow Stark to proceed with his Ultron project, an initiative to create peace-keeping robots that could defend the world in place of the Avengers should another alien invasion occur. When Ultron (voiced by James Spader) becomes conscious, however, he interprets his peace-keeping instructions as an imperative to wipe out humankind.<br><br>Added to the mix are the Maximoff twins, Pietro (Aaron Taylor-Johnson) and Wanda (Elizabeth Olsen) – also known as Quicksilver and Scarlet Witch – who decide to serve Ultron, with the latter using her powers to give each of the Avengers dangerous visions that could tear them apart.<br><br>The fight scenes and action sequences are in such abundance in \"Ultron\" that it's impossible to remember them all, and the ones that are most distinct, such as Iron Man chasing down and taming a rampant Hulk using his Hulkbuster armor, are ancillary to the narrative of finding what Ultron is up to and stopping it. In other words – it's all for show. The creativity of the fight choreography also gets lost in the whirlwind of action. Captain America (Chris Evans) probably does 12 different awesome things with his shield, but they happen so fast you'll be hard pressed to recall any one of them in detail. Really clever sequences are only as fun as the build-up and payoff and those pieces are given no time to breathe.<br><br>Whedon does allow for pauses in the chaos, such as the swanky Avengers Tower party featuring the film's best scene, when each Avenger tries his hand at lifting Thor's hammer, or a quiet retreat to an unexpected safe house in the countryside, but it's simply a trade- off: instead of busy action sequences, we get character relationship dynamics and back story.<br><br>\"Ultron\" is inundating, to be frank, but for the everything-but-the-sink mentality, it's carried by its sense of humor and a cast whose members have each proved themselves time and again to be magnetic both on their own and as part of this team. Some of the novelty has worn off, but seeing all these characters together remains a treat that even the most convoluted of stories cannot entirely dismantle. Marvel Studios truly proves with \"Ultron\" the credibility that it has built with fans, to the point that even when it gets a little ambitious and mettles a bit more (you can easily see Whedon at odds with them in this final cut), its reputation remains intact and the fans placated.<br><br>As \"Phase III\" begins, adding even more characters to Marvel's cinematic universe (and even sliding Spider-Man into the mix) en route to the two-part \"Avengers: Infinity War\" slated for 2018 and 2019, it will be interesting to see if Marvel Studios barrels along into more unwieldy but delicious chaos, or reins it in a touch. Either way, should be fun.<br><br>~Steven C<br><br>Thanks for reading! Visit Movie Muse Reviews for more","user":"Movie_Muse_Reviews","rank":[16,21]}]