[{"title":"Amusing, but nothing overly special","rating":3,"date":"24 August 2014","review":"I mean, don't get me wrong, it wasn't unwatchable, but it was so corny that I couldn't really help myself but laugh. The fight scenes were pretty pitiful, they replayed the same kick maybe about 10 times throughout, and the characters didn't build at all from where we met them. But what do you expect from a movie called Evil Feed? The jokes in it were very simple, but mixed with the bad acting and the obvious story line I did end up laughing a few times, but not at the jokes. It is a movie that you will just shake your head to, and be mildly amused if there is absolutely nothing else to watch. Being a Canadian, I do like to give Canadian films a fair try (filmed in Vancouver), so that was pretty much what lured me in. Don't watch this if you are looking for a thriller, horror movie or a fight movie. This is neither, but I don't think it really tried to be. Again, only watch if you have a lot of free time, or if you are high.","user":"shaitan_lives","rank":[12,16]},{"title":"Evil Feed: this movie has Violence, Gore, Comedy","rating":7,"date":"25 August 2014","review":"Evil Feed: this movie has Violence, Gore, Comedy, and (Lets not forget) Nudity. Martial arts are used, pretty unclear as to style or level of skill. Blood sprays, though seldom, when blood is used it goes everywhere. Comedy is reactionary, similar to a fright movie, the comedy tends to come out of nowhere. The Nudity was not overdone its here and then its there just enough to keep you excited toward expectation of the next time. The cinematography was done well with a couple stand out shots. The main character doesn't stand out even a tenth as much as my favorite character of this film Yuki, played by Alyson Bath. With her almost fun drive for cruelty in her true Pixy form. I put my vote in for her to play Harley Quinn, in some Batman movie in the near future.","user":"afunimagi","rank":[10,19]},{"title":"Probably add 1 point for the uncut version","rating":3,"date":"26 November 2014","review":"I do try to avoid watching cut versions of movies (the bad kind of cut that is), but I did fall into the trap of this one. Once again German censorship has either helped me (by making me watch less of this) or blocked the best scenes this movie probably has. They did not have an issue with the naked intercourse, that also had quite some blood in it for reasons you might wanna find out for yourself.<br><br>Ryan N. who had the \"idea\" for this movie is infamous for this type of thing and you should know what you let yourself into. There is one bad guy who relishes and cherishes every moment he is on screen. His dialog is quite funny and what is left of the action scenes does not look too bad either. But it's cut together (story wise that is, the obvious gore cuts aside that I had to endure) in a simplistic fashion that does not add to any sort of excitement ...","user":"kosmasp","rank":[3,4]}]