[{"title":"A background in old sci-fi and paying close attention help","rating":7,"date":"19 October 2017","review":"I just watched this on Amazon Prime and I appear to be the 12th reviewer, so I'll offer some viewing tips.<br><br>In short, when one group enters a haunted forest to reclaim a supernatural relic for Hitler's occult researchers and goes missing another group is sent in. We learn why they want the relic and some nasty stuff about the SS, too.<br><br>First of all, the movie's story-line is fine if you've ever read old science fiction: people can appear to be killed in one place/time yet become part of another place/time with knowledge of the first. But you won't always see that played out as soldiers have to make split-second decisions to shoot now then talk later (but maybe no one's left to hear, or you have a reason to hide what you know).<br><br>Ignore the anachronisms. You're not going to find an adviser for historical accuracy on a small budget, so why worry? Spoiler: The soldier with the tomahawk has some Native American blood, so he has the weapons and expertise to use blades as killing tools. It is explained, but other reviewers apparently missed that conversation.<br><br>Most importantly, you absolutely must pay attention to the little clues along the way or you'll miss something hugely important.<br><br>Now that the boards are gone and no questions are being answered in the FAQ I'm hoping more reviewers will chime in with spoilers and tidbits of helpful info. Remember to tick the box if you don't want to see spoiler reviews.","user":"spoken","rank":[9,9]},{"title":"Made me want to punch someone in the face","rating":2,"date":"18 September 2015","review":"I got suckered into watching this movie because I'm a huge fan of history, the DVD cover looked really cool and it had a promising name for a title. I was hoping it would be something like the movie \"Dead Snow 2: Red vs. Dead\" which is unquestionably a masterpiece compared to this.<br><br>There are so many flaws in Soldiers of the Damned that thinking about the specifics hurts my brain.<br><br>By the end of the movie for the first time ever I just froze staring at the entire credits daydreaming wondering how the hell someone could make such garbage. While staring blankly at the credits I noticed there were 3 assistant directors, this is probably where the movie really failed. I can't possibly imagine why there would need to be a total of 4 directors when basically the entire movie was about 5 people in the forest.<br><br>There were only 2 decent actors in the entire movie and I REALLY felt sorry for them.<br><br>I don't know how a few members of IMDb reviewed this movie with a 9 or above praising everything about it. All I can say is they were probably on drugs when they watched it or had something to do with the movie.<br><br>I would rather go to work for an entire week without pay than watch this again.","user":"JakubBednar","rank":[22,31]},{"title":"I gave up","rating":3,"date":"6 November 2015","review":"I tried so hard to watch this film as love anything WWII themed but gave up three quarters of the way through. I think there is a glimmer of a good film trying to get out. It let down on the whole by an incoherent story and terrible acting by all concerned. I am no military expert but all the equipment looked accurate and the effects OK (the CGI planes were rubbish) and the battle scenes (they aren't many) quite well done. I love horror films too there have been one or two great movies with WWII and horror combined. However let down by confusing story and but most of all rubbish acting. The story as it is: a group of German soldiers (including some good Germans and some bad Nazis - mostly with English accents) agree to accompany a Professor looking for something (never found out what) in what appears to be a haunted Romanian wood. What ensues is a lot of good v bad German stuff, some ghostly children, people turning to ash and other weird stuff. Most spooky of all was the acting.","user":"murada1967","rank":[7,8]}]