[{"title":"Sit back and enjoy it","rating":7,"date":"12 June 2015","review":"Weird that so many people did not like this movie. I suppose if you had high expectations, you would be let down, but other than that, it was a thoroughly enjoyable well constructed comedy. At least a 7.2<br><br>The punch lines and comedy came off as low key and sort of anti-climactic, but I thought that gave it a greater sense of realism. I saw the IMDb ratings, and set my expectations low, and then looked for the redeeming qualities of the film, sometimes that's all it takes to get more out of it than the high-expectation crowd.<br><br>The main character suffers one realistic defeat after another, and sometimes that's how life goes. That sense of exhaustion from trying was clearly pervasive throughout the film, but the main character keeps chugging along and does not give in to the adversity he faces. To me, it created a compelling every day sort of comedy that was accessible and portrayed by fun characters.<br><br>There is some gratuitous nudity &amp; lewdness that detracts in some ways from the film, but being thick skinned, it really did not bother me at all. Bullying is a surface theme, but really it's \"being there\" for your fiends and family that is the real message and the bullying is sort of mentioned as a mechanism to show adversity and rising above it with the people we love. What's not to like about that? Bunch of \"nose in the air\" stiffs didn't get it, so what. <br><br>Very watchable \"b\" comedy that does not try and over-achieve. Good movie for a quiet evening where you don't want to think too much. Anyone can highbrow this film and put it down, but it has tangible qualities that do not make it and idiotic \"dumb &amp; dumber\" type film.","user":"frank-63-838463","rank":[58,82]},{"title":"Amusing","rating":11,"date":"11 April 2015","review":"Unfinished Business was a welcome surprise. Based on what I had read about it, I was prepared to leave the theatre underwhelmed and disappointed. That did not happen, though.<br><br>Vince Vaughn and Tom Wilkinson were amusing in their roles and they seemed to get things more right than wrong when it came to delivery and to timing. The character of their simple sidekick was more than a bit annoying, but it was good to see that the characters played by Vaughn and Wilkinson cut him a lot of slack. In short, this is a better movie than many IMDb amateur reviewers would have you believe. <br><br>I found myself chuckling more than a few times, laughing at their antics and the absurdity of it all. This was a charming and amusing film in the end. If I were to guess, then some of the reviewers here may have felt discomfort over the depictions of drinking, drug use, and sexuality in this picture. So it goes. Recommended viewing for the non-church going set.","user":"maclock","rank":[49,71]},{"title":"If you are self-employed, you will love this movie","rating":8,"date":"21 November 2015","review":"This movie is superficial. The jokes are marginally funny. There were nude scenes. The plot is somewhat predictable, a story of a underdog who eventually pulled it off with persistency and heart despite numeral setbacks. However, I for one can relate to the characters, a lot. I watched the movie on HBO on a Friday night after a long day of work as a small business owner. On this day, I bid on a project of a client who really likes our work but seldom gives projects because of our small size. Later I was told that another client was not happy with the frequency of our communication - a large company's VPs have meeting with her on a daily basis. With about a million things to take care of everyday, I can't imagine to have time to call her everyday just to chat. If you have struggles as a small business owner, which I am sure each has, you will like this movie because you feel that the main character is part of you. You try so hard for your family and your employees, whose livelihood depend on you. So the movie struck me on a day filled with some success and some setback at the same time, a typical day of my life. Who can't say that's not how life is no matter what you do. So the spirit of the character is contagious, and can struck you deep. The movie appears to be superficial. But when you think about it, and relate it to your life, it is not that superficial. In fact, it provoked some deep emotions.","user":"Jwxujerry-580-428462","rank":[19,25]}]