[{"title":"A lovely little movie","rating":31,"date":"31 May 2014","review":"Set in Newfoundland, one of the most beautiful places on earth, the views are constantly captivating. If you haven't been to Newfoundland, i'd truly recommend it. You will see sights you've never seen before. <br><br>The story Grand Seduction is cute, the acting sweet and endearing. The laughs were plenty. I went with my wife, and I honestly haven't seen her laugh so much in years. Each joke was just a little human insight. <br><br>In a world of movies filled with monsters and vampires, or traveling into the future to survive war and save the world....it was refreshing to see a movie like Grand Seduction about real people...just living real lives.<br><br>I'd recommend Grand Seduction as the perfect date night film.","user":"grahamrobertson","rank":[60,64]},{"title":"A must see movie for those tired of forced Hollywood humour","rating":9,"date":"15 June 2014","review":"This is a gentle movie, filled with gentle humour that brought smiles of delight to every one of our group of six. The scenes of the Newfoundland coast were breath taking. A great little story about a community struggling for survival. Another reviewer was dismayed by all of the citizens lining up for their welfare cheques. An exaggeration yes, because it is a film, but the key message he missed was how noble and honest, despite their desperate scam, the people of Newfoundland are. When I took my family for a vacation in Newfoundland we were mightily impressed by the scenic beauty but even more impressed by its people and their genuine interest in others. It made us proud to be Canadian and this film makes me proud of the Canadian film industry.","user":"john-831-136270","rank":[43,48]},{"title":"Love, Love Loved It","rating":9,"date":"17 July 2014","review":"I am not usually a fan of these types of movies, but my friends convinced me to see it and I am so very glad I did. It was funny and silly and very well acted. I must say the \"Dr\" was not hard on the eyes either.<br><br>The setting of Tickle Head was beautiful and reflects on the times in Newfoundland.<br><br>My husband saw the French version of the film years ago, but really enjoyed this version as well.<br><br>I would totally recommend this to anyone who enjoys a good laugh. There people of all ages teens to seniors in the theatre and we all laughed at the same times.","user":"suzicoupon94","rank":[32,35]}]