[{"title":"The Strength of Rowdy Fans","rating":7,"date":"1 October 2015","review":"This film is a testament to the fact that a little bit of passion, and a whole lot of hard work can make things happen. The key is believing in your goal, and never giving up, even in the face of major setbacks and disappointment. This documentary follows the Sons of Ben, the group of die-hard soccer fans who successfully lobbied to bring a Major League Soccer franchise team to Philadelphia. This grassroots group accomplished this by creating a supporters club, and drumming up massive fan interest from the ground up. They created the scarves, shirts, and rowdy displays of support for a Philadelphia team before one even existed. It's quite a sight.<br><br>The message that comes through the strongest in this film is just how hard these guys worked to get their team. We get to see the series of achievements and heartbreaks that these fans had to endure. And, it really is amazing to see that kind of dedication and vision. Enthusiasm for a fun, new project usually dies out long before any real work gets done. And, the Sons of Ben understood what it would take to push through that kind of deceleration. And, we can tell that it really was a labor of love.<br><br>Of course, we have the benefit of watching this documentary with hindsight. We already know that Philadelphia succeeded in getting their MLS team—the Philadelphia Union. So, the drama isn't quite as nerve-wracking as it could have been. But, I appreciated that. And, we still get to feel the struggle along with the Sons of Ben as they receive promises from investors and politicians that never materialize. What is particularly fascinating is seeing the scope of the project that was planned, and comparing it with the more modest stadium that was eventually built. It really gives you some perspective on the whole property development industry. <br><br>But, if this story has taught us anything it's that we shouldn't give up on the vision of that complete, bustling mini-city just because of one more setback. Seeing how much good the new stadium has already brought to the previously blighted area is enough to foster hope for the completed vision. I highly recommend that you go and check out this film. It's a heartwarming reminder of the kinds of projects regular people can achieve if they really set their minds and hearts to it.","user":"MyFilmHabit","rank":[3,3]},{"title":"Some people think football is a matter of life and death. I don't like that attitude. I can assure them it is much more serious than that. Bill Shankly.","rating":7,"date":"2 February 2019","review":"As a football fan (yes it's called football and not soccer as you kick the ball with your feet, not like American football where you throw the ball with your hands so that doesn't make any sense) I enjoyed this documentary/biography. I'm a Standard de Liège fan, a hardcore fan, so I know what it is to feel the bond with your team and/or city. But most importantly when you're with likeminded every week is the feeling of belonging to one big family, through the good and the bad moments. You have to be in that particular movement to know that feeling. So it's nice to see a story like The Sons Of Ben, a story about devoted people never giving up on their dreams of having a team they can follow and love unconditionally, a team in the city they live, the city they love. But only in America is such a thing possible, buying yourself immediately in the highest competition without ever having to progress from the lower leagues. Money can achieve anything over there, and that to me just doesn't feel right. In any other competition in other countries you start from the bottom leagues and promotion to higher leagues is only possible by being champions in the lower leagues. But that aside Sons Of Ben is a nice story, even for people that are not into football. Football is passion, and even if it's all about business and money now, you'll never take that passion away from fans. Football is not sitting down, eating your hamburgers and drinking your big cups of coke, football is standing up, yelling and singing for your team, from the first second till the final whistle, it's hating the other teams and fans even if that sounds bad. You have to be a fan to understand that.","user":"deloudelouvain","rank":[0,0]},{"title":"Wow, What a movie!","rating":10,"date":"18 September 2015","review":"I started the movie with the idea that I already new the story. Boy, was I wrong! As a Fan of the Union and now a new member of the Sons of Ben I really enjoyed this movie. I must say it was funny and it was more about hopes,dreams,and those never giving up attitudes that inspire us to dream a dream then about soccer. It humanized the personalities involved in the the creation of the Supporters Group and of those operating the Philadelphia Union. I think any fan of any sports team could find something inspiring and entertaining in this documentary.<br><br>You may cry, I know you will laugh. If your from Philadelphia You will surely say, \"ah-ha\" to some of the quotes in this film. <br><br>James Lockerbie","user":"jwlockerbie","rank":[0,0]}]