[{"title":"This is the perfect movie for you to watch... IF...","rating":2,"date":"4 September 2014","review":"1. If you know nothing at all about movies. <br><br>2. If you think dumb movies are perfect for a movie night. <br><br>3. If you are part of the crew and have no shame.<br><br>4. If you lock yourself in a room with nothing else, but a copy of this bad movie. <br><br>5. If you believe in \"favorable\", fake reviews.<br><br>The acting is terrible, laughable, incoherent, ridiculous, with horrendous special effects, and guns probably bought in the dollar store.<br><br>...I think I made my point, this is a bad, dull attempt for a movie, inspired by \"The Terminator\". So without more \"Ifs\", I am signing off.<br><br>Since my review hurt the susceptibility of the guy that proclaims \"Huge movie fan! Love indies as much as Hollywood!\" well I do not want to get personal, I do not have anything to prove, If I am call a \"troll\" for giving an honest review , so let it be! <br><br>Anyway I felt like editing my review omitting the \"ifs\"... where to start.<br><br>6. Of course! ... whatever name to disguise this \"Perfect: Android Rising / Battledroid / Terminator Rising \" I agree: \"it is nothing like \"The Terminator\"! that is impossible!, never the less, one of it's titles is: \"Terminator Rising \" <br><br>\"Juvenile\"? I'll take it as a compliment. Now let's go Back to the movie in question: this movie is so bad that makes \"Eve of Destruction\" (1991) a masterpiece, at the very least in that movie I had the pleasure of enjoying the acting of Gregory Hines. <br><br>Thankfully the other reviewer, gives the whole description of the movie, and to describe an \"emotional performance\" see \"Alpha Dog\" (2006) , \"Just Another Love Story\" (2007) , \"The World According to Garp\" (1982)...no? do you want cyborgs ? I have a good one!... The one where a cyborg melts itself in front of Sarah and John Connor!","user":"alshwenbear1","rank":[95,113]},{"title":"This is a terrible movie.","rating":1,"date":"11 September 2014","review":"Wow. I don't get to see movies THIS bad very often.<br><br>There's a huge trend right now for horrible movies that are bad for the sake of bad. See \"Sharknado\", and it's like. And those movies are infinitely better than this thing.<br><br>Right from the start, the dialogue is usually not even audible over the background music or sound effects... or when the characters aren't near the camera. Clearly recorded directly on the camera rather than looped or using booms or anything. It's just as well, though, since the acting is terrible and dialogue is delivered terribly.<br><br>The SFX are... you know, just about anyone can do decent SFX at home now. These still fall short. Other than screen overlays, nothing looks decent. The fake CGI blood spatter is bad enough, but the cheap painted on non-CGI blood? There's no excuse for that. Karo syrup and food colouring works better.<br><br>Oh, and hand-to-hand fight sequences... please. At least pretend your punch is actually connecting.<br><br>Which brings me to the plot, and the point where I admit that I couldn't make it past 40 minutes into this thing. 40 minutes of bad audio, bad dialogue, bad acting, bad SFX and a plot that you pretty much feel that you've already seen hundreds of times. No thanks.<br><br>I posted this review despite not seeing the entire movie because I noticed there are some positive, highly rated reviews for this movie. And claims that they are fake. I don't think they're fake, I think they were posted by people who are happy to watch, and enjoy, horrible movies. People, there is ABSOLUTELY NO NEED to put up with movies like this! There are GOOD movies out there. Hell, there are bad movies out there that are still better than this. You guys are just encouraging the trend of below-mediocrity, and I for one would really appreciate it if you stopped.","user":"jethro1138","rank":[15,20]},{"title":"I couldn't even get through the trailer","rating":1,"date":"14 September 2014","review":"I'm open minded. So I thought I would watch the trailer for myself ...knowing of course that would be the best part of the movie. The trailer was so awful I couldn't even watch the whole thing. Not more than 10 seconds! Watch it yourself and decide. It's amazing how it could be so bad. Truly amazing. Unfortunately there are very few really great movies out there. But there are even fewer that are this bad! Congrats! Why have a rule for 10 lines of text for a review? I'm open minded. So I thought I would watch the trailer for myself ...knowing of course that would be the best part of the movie. The trailer was so awful I couldn't even watch the whole thing. Not more than 10 seconds! Watch it yourself and decide. It's amazing how it could be so bad. Truly amazing. Unfortunately there are very few really great movies out there. But there are even fewer that are this bad! Congrats!","user":"redheadedrob","rank":[10,14]}]