[{"title":"Non stop steam-punk battle","rating":7,"date":"19 April 2014","review":"Please forget all the \"professional\" critics who are disgusted by any movie without strong social and political commentary. This is not such flick. This is not movie about weak characters and their development. This is just a non stop steam-punk battle in alternative history. If you want to enjoy father who just wants to hide in a basement, be my guest and watch the War of the Worlds with Tom Cruise. You know it is pretty cool as well.<br><br>This movie is \"just for fun\", more for the anime / scifi / steam-punk fans. The plot is somewhat weak, it is very linear - but what? The setting is pretty amazing, the alternative 1914 looks pretty cool and the battles are hardcore. The violence is here but is is actually mild so this movie could be even fun for older children.<br><br>In a summary: Not great but good enough and fun enough. Thumbs up!","user":"the_wolf_imdb","rank":[20,26]},{"title":"Visually pretty but storytelling wise, it is absolutely boring.","rating":5,"date":"26 March 2015","review":"War of the Worlds: Goliath (2012) is visually pretty but storytelling wise, it is absolutely boring. If it wasn't the awesome concept from the novel and the effort on visuals, this one honestly might end up being the second animated feature I'd rate 1 star. But I rated it 5 stars anyway, as some of you might like it for whatever reasons.<br><br>When compared to all older Malaysian animated features, War of the Worlds: Goliath (2012) does has a nice feel to it but the plot is unfortunately quite bad. There are so many illogical scenes that are left unexplained or unfinished even until the end. The backstory? Certainly without much thought as it is not clear or even established in the animated feature itself.<br><br>I understand alien invasion and steampunk are interesting but the series of random elements and events here won't make it a great storytelling or an enjoyable, at least for me even though it is the prettiest Malaysian animated film. (Out of four that I have seen.)","user":"hayashimegumi","rank":[4,4]},{"title":"Mildly impressive and respectful.","rating":7,"date":"17 April 2014","review":"Before we start, lets explain a bit about where I'm coming from. I grew up with parents who were fans of the Jeff Wayne War of The Worlds album and rapidly grew to like it myself. Hence, when the opportunity to read the novel came up at school I leaped at the chance and have since remained a fan of both of these works.<br><br>It has given me a cynical eye, however, hence pretty much every attempt to adapt the story has come up short in some way or another. So when I learned about this \"sequel\" I had to give it a shot, especially when I took a look at the cast list.<br><br>All in all, I was pleasantly surprised. Its certainly not what I would have expected, was was good fun and respectful to the source material in many ways and whilst I wasn't a huge fan of the Martian tripods, I could at least see how much they had drawn inspiration from the novel, so well done there.<br><br>Whilst most of the main characters a vaguely engaging, the stand-outs tended to be the supporting cast, who I got a blast out of and really made the movie shine and setting the whole thing in the run-up to the Great War was a similar moment of inspiration.<br><br>Its not perfect though. The story feels perhaps a bit too episodic, rather than feeling like more natural chapters - to the extent I found myself wondering if perhaps it wasn't originally slated to be a TV series and I was watching the first few episodes back-to back. As has been mentioned elsewhere, the dialogue sometimes also feels a little stilted but that clears up for most of the movie.<br><br>I also need to add that their choice of opening theme had me hooked from the word go.<br><br>So, overall the film is a decent package, not as sophisticated in its storytelling as some of its animated contemporaries, nor as polished as others. But its a good package and a welcome return to animated action, which seems to have fallen by the wayside in recent years (indeed, it reminded me in some ways of Titan AE, which seemed to herald the beginning and end of the last resurgence of animated action movies).<br><br>I'd guardedly recommend it, I know it won't be everyone's cup of tea, but it is certainly worth a look, especially if you have any interest in the original story, creative anachronisms or steampunk/dieselpunk tales.","user":"oneshallstand-1","rank":[13,19]}]