[{"title":"A Retro Blast!","rating":9,"date":"30 August 2018","review":"A film that made me cackle out loud. Ben(Jean Ralphio) Schwartz bounced off the uber cool Sam Rockwell and actress Ive never seen before, Phoebe Fox steals the show as a food obsessed genius lawyer. <br><br>The plot moves from one insane scene to another and you never know what to expect, I just went with it and laughed my ass off.<br><br>Its got an old 80s vibe, all rough and scratchy which fitted well with the whole music they used. <br><br>A real fun retro blast.","user":"meldavies74","rank":[39,44]},{"title":"Quirky, off-beat, enjoyable","rating":7,"date":"29 August 2018","review":"Despite negative reviews, I found this very enjoyable. The London/cockney setting is excellent and may well appeal to an American audience unaware of this aspect of British society and watching Rockwell trying to speak cockney is very amusing. The characters are all very quirky with their own little foibles, the plot, although a little far fetched, moves along at a good pace. Nice little touches from known actors, especially Phoebe Fox as the somewhat corrupt lawyer and Amanda Donohoe as the foul-mouthed pub landlady as well as the bad guy telling the hit team what he is going to do to them at the end made this a worthwhile journey. Although it is not laugh out loud funny, it is rather subtle in its approach and Rockwell is just Rockwell. Recommended with a bucket of popcorn and some friends and don't believe what they say.","user":"paulharvey-70154","rank":[52,60]},{"title":"Have a fun time and just go for this ride","rating":10,"date":"30 August 2018","review":"This is quirky, weird and certainly funny. They got each little moment in culture on point, and Sam Rockwell is a beast, even with tiny moments. I think what works best is the vanilla british female lawyer who hires the two ex cons to do a screwball job. It makes me laugh especially with the small facial expressions they get on point.<br><br>It is similar to many theatre style linear activity films. Each little who dunnit going to another fun reveal keeps the flow and it's really silly. One of my favorite things in acting is proper timing in dialog and good editing right after each moment and it works here well.<br><br>Really, the music and the moments are great. It plays out like a theatre production, noises off, something akin to that. Moments like high end moisturizing toilet paper and women's tampons for bullet wounds are sophomoric but great.","user":"kristoffe-brodeur","rank":[34,40]}]