[{"title":"If you enjoyed Sinister, you will enjoy this creepy joy ride","rating":9,"date":"2 July 2014","review":"I really enjoyed Scott Derrickson's 'Sinister' and he followed it up with a very good horror flick here. <br><br>It keeps you interested and on the edge of your seat the whole time. Not to many slow parts and there are some pretty creepy and terrifying moments. The tone and the dark hallways and dark basements and the creepy noises and the sudden jumps and scares will make you jump a few times yourself. I looked away a few times just because, you'll see. <br><br>A pretty decent story involving soldiers in Iraq and what happens to them there and then what proceeds and how Eric Bana's character gets involved while responding to a domestic disturbance call involving one of those soldiers, and it takes off from there. <br><br>Eric Bana is pretty bad-ass here, as is Joel McHale. They are tough cops from the Bronx who see some pretty insane stuff over the course of a few shifts. Olivia Munn is a babe and plays a great wife who cares and does great with little screen time. <br><br>It's a supernatural/demon/serial killer flick all rolled into one. <br><br>If you enjoy horror flicks like I do, and the supernatural and demon stuff, def check this out. Not much gore, just very dark and creepy with it's share of make you jump moments. <br><br>Not many flaws if any. Check it out!","user":"murphy_3489","rank":[131,184]},{"title":"An unusual team of two to fight the evil spirits!","rating":7,"date":"24 September 2016","review":"This was based on the real account. A cop from the New York who witnessed those unexplained events are what this film depicted for us. I think it is slightly an underrated film. Not because of true story, but from the entertainment perspective. From the beginning till the end, I enjoyed watching it. Horror means there's no big scary stuff in it, still being true to the genre, it told a decent story. It was well written and directed, a film that I almost missed, but now I can gladly suggest it to the others. But it is just an above average, yet worth a watch.<br><br>The story follows a cop who witnesses a series of strange events, which also influence his past. In the most of the case, he's trying to find one particular person, a painter seen in and around the city. So he and his partner finally find that strange man and when they do, it is already too late. One of them gets injured and the other one tries his best teaming up with a priest to fight the demon that terrorising the city. The film ends with an interesting event. Looks a sequel won't be a bad idea, since the duo is still fighting the devils as what the end statement reveals.<br><br>There's a recent television series I'm watching called 'Outcast' and this film is kind of resembles that. Anyway, this one came first, but what makes they both be alike is the unusual team up between two different field people. The series is like a follow-up of this film, or maybe inspired by this original story. Eric Bana is not everybody's favourite, but his films are quite enjoyable and for this, he had given his best. Co-stars are not bad either; particularly Edgar Ramirez was awesome as a priest. I hope you would find it interesting as I did. It would be beyond that for some, so all I say is watch it with a low expectations.<br><br>6.5/10","user":"Reno-Rangan","rank":[11,13]},{"title":"They ticked every box.","rating":4,"date":"14 October 2014","review":"Mister badass superstar cop workaholic with a traumatic event in his past : Check.<br><br>Bored hot housewife : Check Expendable badass partner who has no connection or communication with the metaphysical elements of the intrigue but initially seems willing to believe even though he's not exactly gifted ether-wise, whose eventual gruesome death will require some avenging : Check.<br><br>Little girl checking under bed : Check.<br><br>Scary jack in the box : Check.<br><br>Lengthy flashlight investigation of many basements : Check.<br><br>Ultra collected bad boy character who knows everything that's going on but speaks in paraboles and takes his time unravelling the story to a cop around drinks and a pool game while people are dying outside : Check. In this case, an eye opening leather jacket cig smoker priest.<br><br>Cannibalistic zombification : Check. True primary evil might make you eat people depending on The Walking Dead's last season finale ratings.<br><br>Static on the radio indicating outerwordly energy : Check.<br><br>Dead babies and general child abuse : Multiple instances, check.<br><br>Seeing things in a mirror then turning around and nothing's there : Check.<br><br>Many other police elements inspired by True Detective (lifting someone off the ground after stabbing them in the abdomen, PTSD stricken cop who has random explosions of frustration in front of his wife, explainable through traumatic crime scenes and ongoing cases) : Check Most other stuff coming from either The Conjuring or The Exorcist : Check.<br><br>\"Inspired by true events\" premise, when in fact only the names of the characters bear any resemblance to actual events : Check.<br><br>Main character's wife and kid gets kidnapped as a side dish to the main plot. Gives the movie a bit more running time after the main intrigue is over.<br><br>You coast through the movie checking boxes, everything is pretty much standard, the main characters starts out laughing at religion, becomes devoted Christian, his partner dies, his wife gets kidnapped, he becomes religious, wife and kid and fine, movie ends.","user":"corner_cut","rank":[81,123]}]