[{"title":"Great movie with an important message","rating":9,"date":"16 March 2015","review":"As previous commentators have stated, this is an 'unusual' war movie. Despite having a quite good and accurate depiction of fighting on the Eastern Front, including depictions of lend-lease armour at the start of the film, it's the allegorical message that's the main point of the film.<br><br>In short, the battle between the White Tiger and the resurrected Russian tanker is an allegory of Russia's centuries old battle with invaders from the West (be they Teutonic knights, Napoleon or Hitler in this case).<br><br>The message of the director is that WWII was just another episode in this long struggle and that the White Tiger (western militarism) hasn't been destroyed in 1945, but is waiting dormant for the next episode....and the immortal Russian tanker will once again be there to confront the 'Tiger' again.<br><br>The film was made in 2012. Considering current events it's proved to be quite prophetic","user":"ttass101","rank":[29,33]},{"title":"very strange but worthwhile war film!","rating":7,"date":"25 July 2014","review":"Now to start off with, if you are planning on watching this film expecting another typical war movie, then you might be disappointed! This surreal Russian film is more about courage and mental torture of war, with battle scenes taking a back seat. For that reason I really liked it. <br><br>The story kept me captivated and the characters were interesting enough to invest my time in. When the tank battles do take place, I thought they were superbly done, with the mysterious \"White Tiger\" having a scary and almost indestructible sense about it. <br><br>Now one can dismiss this powerful German tank as just that, or you can look deeper and see what it stands for. The director has created a very multi-layered film that will make the deep thinker feel as though he or she has had a good work out.<br><br>Not for everyone, but in a world of movies that lack creativity and originality, White Tiger comes highly recommended!","user":"SpannersGerm669","rank":[36,42]},{"title":"Moby Dick with an 88mm Gun","rating":9,"date":"29 July 2015","review":"First things first - if you expect a \"standard\" war film like Saving Private Ryan or Enemy at the Gates or Fury, then this is the wrong place to look. White Tiger is a Russian film set in the dying days of WW2. The titular AFV is a lone German tank which appears mysteriously on the battlefield and destroys Russian tanks by the dozen, whilst seeming invincible. No crew is ever seen, with the result that it feels like a mash-up between the great white whale from Moby Dick and the homicidal tanker in Spielberg's Duel.<br><br>Hunting the tank is a character halfway between Captain Ahab and Ishmael; a Russian tank-man who makes a miraculous recovery from seemingly fatal burns, only to find that he has total amnesia. He only knows that he can talk to the souls of tanks, and that he must hunt the white tiger.<br><br>Sounds odd? That's the point. The film is heavy on metaphor and mysticism, and in the latter third becomes deeply surreal. There's a scene of three German generals signing the document of surrender, then enjoying a strange meal. Then cut to a line of Russian PoWs; then to Ahab/Ishmael alone in a field with his tank. The white tiger hasn't gone, he says. It's merely hiding, and will be back in a hundred years or so. Then the final scene: is it real? Is it symbolic? Is it happening in someone's head? You decide.<br><br>This is a cerebral film. It asks questions, and leaves the viewer to struggle for answers.<br><br>In Russian, with subtitles.","user":"Lomax343","rank":[23,26]}]