[{"title":"16th Century history told through 21st Century eyes","rating":2,"date":"10 June 2019","review":"If you want to watch a brilliantly acted and truthful adaption of this piece of history then look no further than the BBCs early 70s series Elizabeth R staring Glenda Jackson. I would thoroughly recommend it for younger history buffs and those who like their history factually correct.","user":"Beyondtheflame","rank":[122,131]},{"title":"More concerned with pushing the filmmaker's social agenda than making us care who gains the English throne","rating":5,"date":"13 January 2019","review":"Historic authenticity is cast to the wind in this revisionist costume drama that feels like it was written by a freshman Women's Studies major. Directed by Josie Rourke with a screenplay by Beau Willimon, Mary Queen of Scots (2018) was based on the book Queen of Scots: The True Life of Mary Stuart by John Guy. Like many films released this year, it has strong female leads, a diverse cast, and progressive social messaging, but checking all the right boxes on the SJW playlist wasn't enough to save this film from mediocrity.<br><br>The year is 1560, and the young and beautiful Mary Tudor (Saoirse Ronan) returns home, where she is out of place in a dreary Scottish castle. Her half-brother, James, Earl of Moray (James McArdle), has been ruling as regent, alongside a bevy of colorless and perpetually-angry Protestant men. Her appearance in Scotland alarms her cousin, Queen Elizabeth I of England (Margot Robbie). Elizabeth, a Protestant, is not seen as a legitimate ruler by her Catholic subjects. She seeks to gain influence over Mary by arranging a marriage with Elizabeth's own lover, Robert Dudley (Joe Alwyn).<br><br>Instead, Mary marries the charming and charismatic Lord Henry Darnley (Jack Lowden), who pulls a Jeckyll-and-Hyde routine and becomes a drunken lecher on their wedding night. Things get complicated for the childless Queen Elizabeth when Mary becomes pregnant, producing an heir for her dynasty and strengthening her claim to the English throne. Can Mary fend off attacks from her domestic critics and convince Elizabeth to acknowledge her as England's rightful ruler?<br><br>Mary Queen of Scots couldn't decide whether it wanted to be a film about the rivalry between two queens or a revisionist biopic of its titular character, so it does neither particularly well. This ill-conceived and poorly executed film also missed a chance to let its leading ladies shine. As Queen Elizabeth, the talented Margot Robbie goes to waste as a costumed mannequin who practically disappears for the middle third of the film.<br><br>Historically, Mary Stuart was born in 1542, the only legitimate heir to Scottish King James V. She was briefly married to the King of France. After his untimely death in 1560, Mary returned to Scotland and ruled as Mary I of Scotland until 1567, when she was forced to abdicate after her second husband's murder (which her rivals accused her of orchestrating). She fled to England to seek protection from her cousin, Queen Elizabeth I, but many English Catholics considered Mary the legitimate Queen of England, so Elizabeth had her imprisoned and later executed.<br><br>There are many anachronisms and inaccuracies throughout Mary Queen of Scots, not the least of which was \"colorblind casting\" that falsely portrays 16th-Century England and Scotland's aristocracy as racially diverse. Mary's Scottish accent was also out of place (she grew up in France), as was her friendship with Italian courtier David Rizzio/Riccio. Most historians acknowledge Mary was probably having an affair with the man, which infuriated her Second Husband. Rizzio might have been bisexual, but he wasn't \"one of the girls,\" as the film portrays.<br><br>Though ostensibly based on a book, this film can be considered a remake of the 1971 film by the same name. Mary, Queen of Scots (1971) was directed by Charles Jarrott and starred Vanessa Redgrave and Glenda Jackson. Like the 2018 film, the 1971 version featured a fictional meeting between the two queens and speculated that Lord Darnley and the musician David Riccio were lovers. The two films part ways, however, when it came to Mary's imprisonment. The 1971 version devotes more screen time to her 19 years in English captivity, while this version fast-forwards through it.<br><br>Mary Queen of Scots opened to mixed reviews and currently holds a 63% positive rating from critics and 44% audience favorability on RottenTomatoes. Its opening weekend took in a painful $194,777 on a $25 million budget. A successful film gets the audience invested in the story. Mary Queen of Scots ultimately failed to connect with audiences because it was more concerned with pushing the filmmaker's social perspective than making us care about who gains the English throne.","user":"makleen2","rank":[426,515]},{"title":"Only go and see this if you have a vacancy in your ten worst films of all time.","rating":1,"date":"20 January 2019","review":"This is a truly terrible film made worse by the appalling theft of time; had the actors cut back on the utterly pointless \"dramatic\" pauses we could have been spared about an hour of pain. But neither the cast nor the Director were merciful. If the object was to make a martyr-movie then it succeeded - but the martyrs were the long suffering audience not Mary. Just for the record though, Mary spoke with a. French accent not Scottish, Elizabeth was a strong and ruthless Queen who never met Mary and there were no black, Asian or openly gay members of Mary's or Elizabeth's court. I appreciate that diversity is essential to have a chance of an Oscar, but the paying public just finds this patronising; Elizabethan England and even more so Scotland was very white and very Christian (whether you like it or not). To say otherwise is not clever positional-play it is lying; lying with propaganda at its dark heart.\n(By-the-way, whatever happened to cultural appropriation?)\nAlso, if they really want accolades then pandering to the BBC and its love of diversity is no substitute for decent acting or a supposedly historical movie bearing some resemblance to history.\nAll in all, a truly awful film. Warn anybody you care about not to go and see this shambles of a film.","user":"rt-90461","rank":[233,285]}]