[{"title":"Way under-rated, look beyond the controversy...","rating":9,"date":"7 February 2016","review":"This was a controversial production in 2014, an MMA film out of a country that specializes in bad sequels, Lifetime movies, and every bad X-Mas movie you have ever seen.<br><br>It was ambitious for its humble beginnings, casting the usual Canadian unknowns -- the sole exception being Michael Biehn, one of the Godfathers of the Canadian film industry -- and throwing in some cameos of top MMA fighters.<br><br>The controversy even spread to the IMDb where, at the time of release, it appeared that the first reviews were front-loaded by first-time-reviewers (reviewers with only 1 review to their name) who could only gape in wonder at the excellence of the film....? <br><br>So, on a second viewing, I say look beyond the controversy and, in spite of a few fails here and there, you will find one of the most satisfying MMA films in recent memory, an unusual but oddly comfortable mix of Karate Kid and Death Wish.<br><br>Way under-rated by the critics, props should be given for a script which (like my all-time fave, WARRIOR) knows how to build and build and build without ever getting in its own way.<br><br>Here is the unvarnished truth -- while everyone loves MMA - duh! -- there are very few films in that genre that this reviewer can recommend.<br><br>This is one of them. Catch it if you can.","user":"A_Different_Drummer","rank":[10,12]},{"title":"Terrible, don't believe the paid press","rating":1,"date":"28 April 2014","review":"Tapped Out is just another case of a no budget B movie receiving early positive press from friends of the cast and crew. The film is worse than the trailers, which have already received a ton of heat, and contains some of the most cringe-worthy moments and performances I've ever seen. This isn't even a B movie, it's a D movie.<br><br>Let's look first to Hackman, the \"star\" who just happened to produce and write the film. Not only is his talent non-existent, but his portrayal of the character is entirely unbelievable. His writing gives us nothing more than a derivative story that you've seen many times before, except this time it looks like it was made for about 20 grand.<br><br>Appearances by \"stars\" Biehn and MMA fighters give us a glimpse of what this might have been with a real budget and if the content was in the hands of better filmmakers. Biehn was a disaster, plain and simple, but he's been that since the 90's so no surprise there. On the other hand, the MMA guys step in and do a fairly decent job in their limited time on screen. Unfortunately, the filmmakers are about two years too late as MMA is on the decline and the fighters won't offer enough of a draw to attract substantial audiences.<br><br>If you're looking for absolute garbage, this is the film to see... if not, don't waste your time. A film like SHARKNADO works because it's intentionally terrible. What makes TAPPED OUT so bad is that it takes itself seriously and fails horribly in its efforts. Unfortunately, it appears that the same team is back at their B movie ways with a new Biehn picture and one starring Cuba Gooding Jr... so their trend of hiring washed up 80's/90's talent continues, but at least this film offers us reason to never check out further work by this incompetent group.<br><br>0/10","user":"thegameblender","rank":[22,32]},{"title":"World record for most clichés in one movie. WARNING: SARCASM OVERLOAD","rating":2,"date":"8 July 2014","review":"How many clichés can one possibly put into one movie? So his parents get killed during a robbery on his way home from a karate class (he is 12) then he sees a small piece of the guys tattoo. Fine. Then he is a 20 year old rebel still in high school, getting kids booze and stuff. Im like, 1. who the hell is even selling him booze? the dude is barely pushing 5' 5\". As hard as his face is there is no way someone wouldn't ask him for ID. He gets being a janitor at a Dojo as community service but the Sensei takes pity on him and decides to let him practice his punching skills for an hour after the Dojo has closed. MIND YOU his uniform is the same uniform he was wearing at 12 years old and it still FITS PERFECTLY... WHAT?!? His love interest is the Sensei's niece, who is a secret rebel OOOOO BIG SHOKER THERE. She takes him to an underground fight club where SURPRISE SURPRISE the main dude fighting is one of the two guys who killed his parents. Fine if thats your storyline I'll let you have it, i've seen worse. The underground club decides to have a tournament... *really dude really??* to which he tries to enter but has to fight a next MMA guy to get in and OMFG HE WINS BY K.O *EYEROLL* His love interest is a criminology student *GASP* and starts looking for more info on him in which she finds out about his parents and stuff. The Sensei follows him to the club to see the match and gives him crap about it but says nothing to the niece he is oh so overprotective of and he is like \"No young sir I shan't train you if you are going to fight in a club\" BUT OH WAIT I was a friend of your parents' so yea of course I'll help. This movie could have cut down 45 minutes by not having so much useless slow motion scenes or even better the length of it would have been perfect if they actually focused more on quality over quantity. How in the hell is a short ass guy who is BARELY trained in KARATE going to beat a 6' 3\" HEAVY WEIGHT SEMI-PRO MMA FIGHTER? and I know the natural response to that question is \"but it's a movie\" but even for a movie that is SO UNREALISTIC.<br><br>I got to an hour and I'm STRUGGLING to stick to my guns and watch till the end. This movie is rubbish. The one thing that I'll give them is the cage fighting looks quite natural so HOORAH FOR THAT. I don't know why I'm even going to try to watch it till the end when I already know it will follow the route of \"He beats the bad guy, gets the girl and a new family\". Oh and PS to the creators of this movie KARATE IS NOT MMA!!<br><br>2/10","user":"amillionmovies","rank":[4,4]}]