[{"title":"Average horror movie.","rating":4,"date":"8 March 2014","review":"Nothing really special here, a story about a haunted house, two characters that weren't quite exploited enough, scares that came so late and soft, a twist that didn't manage to stand tall.<br><br>It wanted to be something, you can clearly see it tried, but somewhere, it failed, somewhere along the plot development, when they tried to make it more than it could be. In the end it is a movie about a haunted house, so don't get your hopes too high, cause originality is something too hard to achieve, working around with just 2 actors make the viewer feel deserted, and scares that won't come when they suppose to, leave him even more alone.<br><br>Not so many reasons to recommend this one: yes, average horror at its best, a somewhat effort put into it, but still, it falls flat. Sorry to say so.<br><br>It will come down to everyone's personal opinion, but all horror movie fans, will feel that they didn't get the larger slice here.","user":"gothic-fiction","rank":[46,59]},{"title":"I really cannot you guys.","rating":2,"date":"18 November 2017","review":"The film opens with kind of a creepy, promising narrative given by the actress (Jackie Weaver) who played the daughter in All in the Family whose haggard appearance is perhaps the most frightening aspect of the movie. <br><br>Here's how it pans out: main 18-year-old dude goes for a good old fashioned stroll through the snowy woods and finds a girl in the freezing cold with no jacket crying about something she won't reveal. Next night, she ends up in the bed of our main guy—she sneaks on in there, by the way, and he wakes up to find her there, and is just like yeah, sure, no problem, and promises to protect her. <br><br>Two jump scares and a cheap CGI character aren't enough to hold this movie up, and by the time you get to the end, nobody's motivations make any sense, living or dead, and are inconsistent to say the least. <br><br>STOP now if you want to be surprised, because here comes the spoiler, and while there are several plot holes and unanswered questions, this is the one that irks me: if that girl from the woods is the daughter of Jackie Weaver's now-dead husband and his mistress, the fact that the girl says her mother died obviously holds up. The fact that she has a drunk dad who beats her...that's clearly not her birth dad, right, because the ghost comes for the birth dad too, in the movie's cold open? And we don't get to see the dad's face when the kid comes to check on the girl for a reason, as it's very obviously blurred, making you think that it will somehow become relevant. It doesn't. <br><br>Did someone decide \"meh, that's good enough\" when they went back and realized they had to cover their tracks when it came to one of the most important plot elements of the film—which, seriously, leads to nothing—the fact that her dad beats her? <br><br>Also, um, for what reason does this ghost want to kill the 'biological' dad in the beginning? Weren't they in love? What did he do wrong? I'm gonna give her the benefit of the doubt and guess that it's because he sat there like an idiot watching his wife about to slit this woman's throat without making a move to stop her.<br><br>Then again, I sat there like an idiot watching all 87 minutes of this nonsense, so I guess that makes us even. <br><br>Oh, and the ghost lets one person live: THE WOMAN WHO KILLED HER. REALLY? YOU'RE KILLING INNOCENT CHILDREN BUT SHE'S GOOD TO GO? Also, way to go framing your daughter for murder and getting her sent to jail, ghost lady! You are totally crushing it when it comes to getting that vengeance of yours on everyone except the one person you should be concerned with.<br><br>IFC Midnight is really starting to drop the ball.","user":"hnhnyc","rank":[10,11]},{"title":"Needs Something More","rating":5,"date":"2 June 2014","review":"An introverted teen (Harrison Gilbertson) connects with his new neighbor (Liana Liberato), and together the couple begins to explore the haunted house that his family has unknowingly just purchased.<br><br>There are some things worth liking about this film. The cinematographer is excellent, first of all, and the snow shots look great. Casting Liana Liberato was a wise move, as she has \"the look\" that could really take her places in the coming years. And the inclusion of the supernatural radio (for lack of a better term) was cool.<br><br>What was not appreciated was the writer's apparent influence from \"American Horror Story\". Maybe this is all coincidental, but the house full of ghosts, the strange neighbor, it all seemed very familiar. And not really in a good way. Other reviews have called the film unoriginal, and they are right. While few horror films are, this one is even more derivative than others.<br><br>Perhaps most strange of all was the poor advertising from IFC. The cover art is not terribly persuasive, and they make no mention of Jacki Weaver or Ione Skye. Weaver gets a mention on the back, but these are two names that should be put prominently on the cover. Why would you not play up having a two-time Oscar nominee in your film?","user":"gavin6942","rank":[17,21]}]