[{"title":"The story of a hit-man in a modern corporate world.","rating":6,"date":"16 January 2013","review":"A Company Man is 2012 Korean movie about a contract killer operating in a modern day corporate structure. It is an action drama.<br><br>SPOILERS AHEAD!<br><br>The film stars So Ji-sub as Hyung-do. Hyung-do is white collar worker employed at the corporate office of a metal works company. He's a loyal mid-management type who's married to his job, and, he goes about his daily 9-5 routine as so many other people do in this world. He also happens to be a professional assassin, as is, apparently, everyone else at the entire office he works at. This a legit company with typical business concerns, but they also kill people. There are several dozen people or so that work for this company, and everybody working here is well aware of the company's dual purpose. From the chairman on down to the receptionist at the front desk, everybody has their part to play in making sure the company is a success on both fronts.<br><br>There must be a lot of people that need to be killed in Korea, in order for a corporation such as this to have sprung up to be outsourced to handle all the contract killing work that's seemingly available. While the existence of such a company as this is hard to fathom, it does provide for somewhat of an interesting dynamic here; office politics, personal employee interactions, and the like, are on display (just as within any small to mid-size company work environment the world over). There's board meetings, company retreats, promotions vied for, office parties, etc. It's one big happy work/family that seems perfectly content with what they're doing.<br><br>It's an odd and intriguing premise to watch play out, one that posits a work environment where conversations generally go something like this: \"Hey, Good job everyone on getting that shipment of girders out to Japan on schedule.\" \"Let's all welcome back Mrs. Kim from maternity leave.\" \"Mr. So, you're late for knife fighting practice.\" \"Project team B, we need that cost analysis on the Jeju project asap.\" \"Today is Ms. Bae's birthday party.\" \"Now, everyone be on time tomorrow, cause we have lots of people to execute this week.\" It is strange.<br><br>Hyung-do is a rising star in the company, and its best assassin, He's tiring of the \"corporate grind\" involved with his job however, and he's also becoming more &amp; more sentimental with the people he's continually charged with killing off. Eventually, he wants to \"retire\" from the business, but as one would imagine, this is a company that is somewhat difficult to extricate one's self from on your own terms.<br><br>It's not hard to figure out where this all headed from there. But before that happens, the film devotes the middle hour or so of its story to the retiring hit-man looking after the young protégé he was supposed to eliminate, and subsequently romancing and falling in love with his mom along the way. I'm game for a good romance story intermixed with my action, but the love angle here is poorly executed; it drags along &amp; is too underwritten for you to engage yourselves into the romantic relationship between the hit-man &amp; mother. <br><br>There's also some nonsense back story angle about how the mother was a former pop star/singer in her youth, and the hit-man was once the young love/star struck dork who delivered meals to her. This \"sub\" story was told via various flashbacks from the past, and it's all terribly unnecessary to the romantic story in the present. Spend some money on a second unit writing team will you?<br><br>Eventually, you arrive to the climax of the story, then revenge &amp; bloodshed ensue!<br><br>There are a few decent action set pieces here and there, but this is not a balls to the wall action film by any means. What action scenes there are, albeit well done, are few and far between. That's not really the problem though. It's mostly undermined by its weakly written retirement/romantic story (which should have been a highlight, instead of a detriment). My lasting impression of this film was that it was OK, but, it was also very disjointed and muddled down a bit by its lackluster screen writing.<br><br>Bottom Line: 6 to 7 range. It's a 6 star film IMO. Not mandatory. Watchable though.","user":"cremea","rank":[23,27]},{"title":"Corporate family is no family at all","rating":7,"date":"22 May 2014","review":"An impressive movie. More than just a crime-thriller/action flick, this film takes a hard look at the Korean/Asian work-ethic, underlining the dangerously soulless nature of 'Corporate Family'. That's what The Company featured in this film is, beyond it's cover as metal-traders and its hidden, darker nature. The young field employees all see their Boss as a father-figure, \"I love you, boss.\" the literal mantra of their interactions with him, something they say with such casual ease as to suggest this is, in fact, a relatively common way to greet your boss in South Korea. The lieutenant of the Boss, who doles out and reviews 'assignments', is like the jealous older brother; his position assured by the hierarchy, but his self-worth frequently challenged by the skills of his underlings, for which he punishes them frequently, and for which they desperately apologize. The protagonist is immersed in this family, seeing it as his life entire. He truly does love his boss, and his devotion to The Company borders on the absolute. As he leaves youth behind however, crisis of conscience begin to afflict him. He begins to question the worth of his own assignments, the value of the lives he's taking, and more and more he comes to feel that living should mean something more, and his love and devotion to a Company so callous and cruel has been gravely, woefully misplaced.<br><br>It's rare to find this kind of social commentary hovering over an action/thriller film, and I found it to be treat. It gives one a window into a way of living that one otherwise might only hear about, and explores the emotional anxieties surrounding that way of living in a gripping, often very heartfelt way. There's plenty of blood, violence and gun-play to keep the viewer entertained, but the deeper themes running through it provoke real sympathy and hard thought in those receptive to such things. The catharsis of the film, the 'redemption' of the protagonist, comes in the simple form of a conscious decision to smile; to seek happiness over professionalism. It's an odd moment, hard to place in time and setting, but a potent and highly uplifting one.","user":"thisjustinsherman","rank":[11,12]},{"title":"underrated , very entertaining but not a must see.","rating":8,"date":"9 February 2013","review":"5.8 ?! Are you kidding me ? I bet the ratings were given by women disappointed in the love-line of the story.I in the contrary was superbly entertained : Excellent cinematography , acting , action , sound and a story , which can be labeled as unique in the ocean of a pro-killer falls in love-wants retirement-pisses-his-employers-off-movies. To my great relief the focus wasn't placed on love but on THE company , something I never saw before. A corporation masked as yet another unit of the ,,normal '' business world. Bureaucracy , business meetings and boring office work ? HEll NO! Suits , guns and office women in tight skirts with the ability to kill you under the blink of an eye , coworkers aka. a deadly wolfspack ; ready to turn the back on you if the money is right ? H-E-L-L Y-E-A-H ! ! ! And this exact atmosphere makes this film very enjoyable. But the main highlight is the charismatic Ji-Sub So as the silent killer ,managing to draw compassion in spite being a murderer-for-money.<br><br>A Company Man is a neat movie , being able the fulfill its main objective of delivering a good piece of cinema and solid entertainment , but it lacks that little ,, something '' to make it memorable forever.<br><br>( But fans of heroic bloodshed can't skip it!)","user":"killahdelfin","rank":[41,54]}]