[{"title":"One of the weaker entries of the series","rating":23,"date":"23 October 2012","review":"\"Wrong Turn 5\" continues the slasher tradition made by the previous four movies, but this time around the slashing is not just limited to the characters. The budget for this movie was slashed as well. Although the production travelled to Bulgaria to film in order to cut costs, the movie looks real cheap in a number of aspects. The town's street scenes are obviously a studio back lot, the interior rooms are very obviously sets, and the make-up for the hillbilly killers looks especially cheesy. <br><br>Further problems can be found in the screenplay. There are a number of plot issues that are murky or are simply not explained at all. The characters also do some really dumb things that I think even real people who are not highly intelligent would do.<br><br>As for the ingredients you expect in a movie like this - sex/nudity and gore - well, I admit the movie does score some points in these categories. There's gratuitous sex, and the gory moments get especially squishy at times. That stuff is certainly welcome, but I think even die hard slasher fans will admit that apart from that stuff, the movie doesn't really have that much else to offer that's positive. You'd be better off skipping this entry of the series and putting part 2 back in your DVD player for another run.","user":"Wizard-8","rank":[38,45]},{"title":"Amateur Hour","rating":2,"date":"18 October 2012","review":"I have to start by saying that I did genuinely enjoy the first two Wrong Turn films,particularly the first. The third was in all honesty one of the worst movies I've ever seen,(definitely in my top 5-and I've seen Plan 9 From Outer Space!). The fourth part of the trilogy was a minor improvement on its predecessor but sadly WT5 brings us right back to the abysmal standard of 3.<br><br>The plot consists of this ; A small West Virginia Town is hosting the legendary Mountain Man Festival on Halloween, where crowds of costumed party-goers gather for a wild night of music and mischief. However, Lo and behold, Three Finger and his inbred family of hill-billies decide to treat themselves to a blood soaked feeding frenzy. This involves a group of visiting 'college kids'(who incidentally all look the wrong side of 30). <br><br>Initially, I thought the plot was fairly well thought out and had the potential to work. However, it doesn't work, the acting is medioace at best, despite the best efforts of the mostly British cast.For a start their accents slip a few too many times, with Roxanne Mckee being the most culpable. The cardboard cut-out sets, would look more at home in a 1960s Spaghetti Western (I found the exterior of the Sheriff Station especially funny). Those hoping that Doug Bradley (a name well known in the horror genre) would save the film will be sorely disappointed as his character comes across as frankly irritating and misogynistic. As silly as this may sound he just seems to repeat the same few sentences about \"his boys coming to save him\" on a loop for about 60 minutes. The complete lack of realism in virtually every part of the film ranges from being laughable to actually quite frustrating. For instance, for a Town celebrating a festival it seemed to be pretty dead (no pun intended). The hill-billies simply would not have had time to concoct such elaborate deaths for certain victims and still be on constant watch at the Sheriff station. The often ridiculous decisions made by the characters are beyond belief, on occasions, they are in mortal danger, however they choose to leave their weapons behind and walk into blatant traps. To cap it all, the funniest (unintentionally so) part of the film, is the complete indestructibility of the mutants who are variously stabbed in the neck, shot in the chest and shot in the leg. They carry on regardless and seem completely unaffected and never sustain any visible injuries. <br><br>The only small plus point for me was the laudable performance from Camilla Arfwedson, who despite not exactly looking like your average small Town Sheriff did a decent enough job with what she was given and you couldn't help but be on her side at least to some degree. Overall though, this film really was dire from start to finish and the wooden script did it no favours either. Its also important to note that even with a few \"gory\" kills there is no real suspense or engagement,it is in no way scary which I would assume is a fairly vital component for a horror movie. <br><br>Personally, I am beginning to lose faith with the WT franchise a little due to the once menacing mutants becoming quite comical characters and the sheer lack of investment in the production values of the films since Declan O'Brien took the helm after WT2. I think it may be time for an official reboot but I really cant see it happening. Anyway I rate this movie 2/10 and I think that may be slightly generous.","user":"re-1234","rank":[38,46]},{"title":"This gives me hope...","rating":1,"date":"19 October 2012","review":"... for becoming an actor myself. I have no skill set whatsoever, have never acted before or starred in anything besides my own life..., i even was unable to play a rock in our pre-school play because i just don't have it in me. But still, i am confident and straight-forward in saying that this movie assures me of my future career as an actor. Please, directors or whoever fills his days with this crap, contact me to perform in the next Wrong Turn and it will be at least more successful then this one...<br><br>No... Really... I almost vomited at the acting job... And i'm used to drinking whisky from the bottle...","user":"jery_revets","rank":[86,112]}]