[{"title":"Taking issues by the horns - excuse the pun","rating":7,"date":"8 July 2018","review":"Accidentally happened on this movie and was glad I watched it. Many Christian movies try and present a reality that is either aspirational or divorced from reality. This one doesn't. It addresses issues in the church community head-on. The church, like any other organisation is plagued by a lack of strategy, structure and the abuse of power and position. That is just how it is. And this movie presents it as such. A really different movie with some great moments. Brings church into community - not above it.","user":"eyefordetail","rank":[2,2]},{"title":"Worst movie that I have seen on Pureflix","rating":1,"date":"25 August 2018","review":"The plot was extremely poor in this film and there was a total lack of Christian message in the film, moreover the photography was poor. Being from the UK and not an American I have no idea what happens in your small country towns. The US appears flawed in their faith community, and here are yet another group of Do Gooders trying to politicise the gospel message of salvation. There is no salvation in the works of the law, no evangelistic message, just a twisted message of small town politics.","user":"digiteum","rank":[3,4]},{"title":"Great Family Movie","rating":8,"date":"14 November 2015","review":"This is a funny yet serious movie, even sad. Sad because it shows that even churches can be dysfunctional. So - the movie has a little bit of every type of real life. Fortunately it was made by Christians and thus the usual Hollywood tricks for skin and sex and other \"thrillers\" are not included - just real life stuff.<br><br>The good and bad of it is that it shows that people, their egos, pride, pet projects can get in the way of the greater good - and this is bad. The good part is that if you pray, listen to what is right in the eyes of God, then things work out well - not matter the opposition - and this is good.<br><br>Watch it, you will like it. T in Carolina 111415","user":"SnoopyDogswithChliandSlaw","rank":[5,10]}]