[{"title":"Good Movie","rating":8,"date":"21 September 2014","review":"This is the last time I take into consideration negative reviews + a low rating. I was very undecided about going to see this movie due to this bad habit of reading reviews on IMDb. It is not the first time a low rated movie turns out to be great, but it is certainly the greatest contrast between reviews and the actual movie. This just proves that most users are probably persons who don't understand a well constructed narrative and don't have an eye for beautiful cinematography. Ryan Reynolds does a great job and so do his co-stars. I also admire Mr. Atom Egoyan for writing, directing and producing this movie. It is a good movie. Go watch it and don't let the rating create low expectations. Hopefully it will exceed the current 5.8.","user":"pgeorge11","rank":[199,266]},{"title":"Tough watch","rating":7,"date":"8 April 2015","review":"Sometimes your hunch can be completely off. Doesn't matter if you're a good cop otherwise. And this is just one of the sub-stories that are woven into the story. A story that is very close to reality, which makes this tough to watch. Ryan Reynolds is our driving force as his character (and his wife) cannot forget and forgive what happened to them. Who's fault is it though? Can it be on persons fault at all? The time-line hopping tries to keep the suspense up, which doesn't always succeed though.<br><br>The performances are great and you always can relate to the people involved. It might get a bit too much towards the end (not sure everyone will like how this goes on towards the finale), but it's generally a decent thriller and a \"good\" watch","user":"kosmasp","rank":[21,24]},{"title":"The film's opening scenes promise a much richer film than what's delivered","rating":4,"date":"6 December 2014","review":"The Captive's two best qualities are its snowy setting and Ryan Reynolds' lead performance. Otherwise, the film is an overlong and jumbled thriller, whose gimmicky structure fails to hide how far- fetched and formulaic the thriller component is once linear. The film's director Atom Egoyan has made many poorly received films recently, including Devil's Knot and now this feature, which was booed at the Cannes Film Festival this year. Egoyan is Egyptian-born with Armenian parents but was raised in Canada. He has set this film in Niagara Falls but it was primarily shot in Sudbury, Ontario. It's an icy cold, wintery location, the barrenness of which projects the loneliness and sense of loss Egoyan has tried evoking in the narrative's themes. It is a unique setting, one which required special measures for shooting by the film's crew, and makes the film's opening scenes promise a much richer film than what's delivered. <br><br>The film is about the kidnapping of Cass (Peyton Kennedy), a young girl who was sitting in her father's car when he went into a store but came back to find her missing. The father is Matthew (Reynolds), who continues searching for his daughter nine years after she has vanished and in spite of his relationship with his wife Tina (Mireille Enos) breaking down. The film switches between Matthew's current pursuit and the start of the investigation, instigated by two detectives. Nicole (Rosario Dawson) is a senior detective specialising in the Child Exploitation Unit and hunting down online predators and child pornography rings. She keeps in contact over the years with Tina and is partnered on the case with Jeffrey (Scott Speedman), a rookie to this department, fearless in stirring suspects and getting under their skin. He tries making a suspect of Matthew and also develops a relationship with Nicole. Meanwhile, there are strange scenes where Cass (now played by Alexia Fast) is grown up and still alive in the home of her captor Mika (Kevin Durand). Rather than using her for sexual pleasure, she is encouraged to read poetry and listen to classical music and become bait for other children online. <br><br>The film begins well, not only because of the setting, but because of the quality of Ryan Reynolds' performance. It is a change in pace and tone, which he signposted with his strong work in the film Buried. His distraught, frustrated emotions, particularly with the way he is treated by the police, are believably conceived but he is the cast's only standout. The film also drifts away from him with the plot and changes in perspective. The plot structure shuffles back and forth so frequently between time periods, with little warning, and for no reason other than to disguise how this is a highly formulaic thriller. The film's pacing is crippled by this editing technique, dragging the film even though it is less than two hours long, and any tension is dissolved. Egoyan has said he is celebrating the human spirit, but his ideas about being drawn into the search as much as being devastated by it don't come to fruition or feel transcendent. The search isn't very different from other kidnapping films like Ransom or The Changeling, where parents never give up on their lost children. <br><br>It is not even a plausible or authenticated crime film. Egoyan has said he did not want to show any explicit material because it is more unsettling not seeing it but imagining it. The difficulty of dealing with the material is understandable, especially from a commercial standpoint. But the compromise he has made is substituting explicitness for ridiculous plot points and developments. The most absurd episodes of his overcrowded screenplay are shared between its voyeuristic components, like the criminals monitoring Cass's mother with hidden surveillance equipment, and also a second kidnapping when the criminals target Nicole herself. It is a very strange and forgettable thriller, which shows how difficult it is dealing with a troubling subject matter while remaining within the frame of the kidnapping subgenre.","user":"Likes_Ninjas90","rank":[42,56]}]