[{"title":"Alice D: Another dire addition to the on/off franchise","rating":2,"date":"15 February 2019","review":"Alice D otherwise known as The Haunting of Alice D otherwise known as Tainted otherwise known as American Poltergeist 6 is terrible horror that I'm still reeling from so bear with me.<br><br>It tells the story of a group of friends in a refurbished mansion that decide to have a party, and by party I mean invite some prostitutes round and that's basically it. Sadly the house has a history as one of their great grandfathers used it as a brothel where unspeakable things took place.<br><br>Starring horror legend Kane Hodder and wrestling veteran Al Snow this is a dire piece of stupidity that fails to ever get started.<br><br>It's a haunting type but don't expecting much to actually happen. You know most found footage haunting films where it's 99% talking then suddenly everything happens at once and it's still not very good? It's like that, but it's not found footage.<br><br>It looks ugly, everything about it is uninspired and I'm shocked Hodder agreed to do this. A messy devoid of redeeming features steaming pile of otter dung.<br><br>The Good:<br><br>..........I'll get back to you on that<br><br>The Bad:<br><br>Manages to be really rather boring<br><br>Pretty much everything","user":"Platypuschow","rank":[5,5]},{"title":"Seriously BAD","rating":1,"date":"8 May 2016","review":"I do not know how this movie have such high rating. I started watching it and have to stop with boredom. The acting is awfully bad, I mean BAD, the story sucks and I guess only some nudity makes the movie more interesting for some people but, please believe me watch or try to watch this movie at your own risk I hope this gets the stars that it deserve even I suppose that friends and people involved in this movie will intoxicate the ratings sooner or later. this is the plot:<br><br>In the late 1890s the Davenport House was a famous and successful brothel, until a young prostitute named Alice killed herself there. After her death, the brothel became haunted by Alice's ghost, and was eventually abandoned. More than a century later, the old structure is renovated into a beautiful mansion. It is still rumored to inhabit the ghost of Alice. Despite this, the new owner; the rich and arrogant heir to the Davenport fortune, decides to throw a wild party for his first night in the house.","user":"bookito","rank":[18,32]},{"title":"Don't be fooled by decent star count - this is unwatchable","rating":1,"date":"27 May 2016","review":"The basic premise is prostitute offs herself then haunts the former brothel, now mansion. The mansion is owned by the former brothel owner. He's young(ish), arrogant, and decides to have a wild party in the house with his buddies and *ahem* 'dancers.' <br><br>That's about as far as I got. The movie was unwatchable. It was like watching extremely boring porn, without the actual porn. The acting is terrible, the script is terrible. Just awful. I guess the high-ish (much too high for what it is) rating is due to friends of the film makers giving absurdly high ratings. I PAID for this on Amazon. Don't make the same mistake! Your time and/or money will be wasted.","user":"lawgirlnyc","rank":[8,12]}]