[{"title":"I loved this movie.","rating":8,"date":"23 February 2020","review":"Great action movie from beginning to the end. Great story of the good guy protecting his family from criminals.","user":"MR_Heraclius","rank":[40,41]},{"title":"Statham = Last Action Hero","rating":7,"date":"30 November 2013","review":"Now you'd expect the typical reviews for this kind of movie from most critics, \"it's just another mindless action film\" or \"Statham can't act\". Ignore them, If your an action/statham fan you won't be disappointed.<br><br>If your like me and miss the traditional action films from the past that had Charles Bronson or Chuck Norris, your gonna appreciate and like this movie. Statham is the last action hero of our time. He consistently delivers solid action movies where you know what your gonna get. In Homefront thats some bloody shootouts, great fight scenes and some good one liners. It has a good cast, People may not take James Franco seriously as a villain but it's interesting to see him in a movie like this and he does a good job with it. Kate Bosworth was very believable as a crazed meth head. It has a straight forward, thrilling story that builds the tension nicely to an action packed ending. <br><br>You don't get these type of movies anymore. These days pg-13 with dumb cgi is what most \"action\" movies are about. The days of the action hero as they once were are dying out, but Statham is their to provide some vintage style action flicks like Homefront which is one of his better films. Overall, whatever your thinking - watch this movie.<br><br>7/10","user":"ActionFan-Reviews","rank":[165,209]},{"title":"It's not your usual Statham film","rating":7,"date":"3 December 2013","review":"\"Transporter\" rocketed Statham's name as a well rounded action star. Since then, most of his action films have felt the same, just with a different title. That was my mind set going into watch this film. \"Homefront\", isn't your usual Statham film, and it's nice to see it play out the way it did. A change of pace for Statham movies, and hopefully a turning point for the actor. But let's keep things simple: Story: Good Acting: Good Action: Very Good Pacing: Good If you're looking for a good action film with a lot of heart, watch this. It's not bad.<br><br>7.1/10","user":"cousbrojs","rank":[98,133]}]