[{"title":"A Wonderful Tie-In To A Superb Show!","rating":10,"date":"6 March 2014","review":"I've loved the Heartland series for years and four years ago, when I found out CBC was going to add 'A Heartland Christmas' to its holiday lineup, I was thrilled. At an hour and a half long, this heart-warming special is a wonderful tie in to the TV series. It is nice to see that just because it's Christmas-y, it doesn't mean there's no drama! Plenty of it, in fact.<br><br>The plot line involving the stranded horses is a good point, if a bit overdone in other media. However, the special manages to make it work.<br><br>Canada's own Nicolas Campbell is excellent as Will Vernon. He portrays his character very well, and it's nice to see the eventual turnaround. It's also nice to see the connection he has to Jack, and Jack's assistance in helping change Vernon's opinions and attitude.<br><br>'A Heartland Christmas' gets its message across without being a turnoff for viewers. It's a lovely holiday addition to any Heartland lover's lineup.","user":"harconn21","rank":[9,11]},{"title":"OK but not great","rating":5,"date":"30 December 2016","review":"First off, let me say I LOVE Heartland. That being said, this movie really has nothing to do with Christmas except Lou and Mallory decorating a tree. Other than that, it could have been any other Heartland episode that takes place in the winter. The plot itself is great except that it's called \"Christmas\" which it isn't. It's a new twist on Heartland's bread and butter formula, Amy and Ty come to the rescue of some horses that desperately need help. Then they spend an hour digging in the snow.<br><br>I just wish it had more tie ins to the meaning of Christmas. After all, it's not called \"Heartland Holidays\".","user":"joel-hegeman","rank":[4,4]},{"title":"Excellent, really shows the true meaning of Christmas","rating":10,"date":"9 November 2015","review":"All episodes of Heartland are excellent and heartwarming, and this one is no exception. Without giving away too much of the story, Ty and Amy help bring a community together, and mend broken families, whilst saving trapped horses. It shows the true value of giving of oneself, and helping others, rather than just focusing on gifts or religion. Before watching, I was expecting it would focus on a religious, Christian Christmas, but I was pleasantly surprised to see that it didn't. Instead, it focused on the difference people can make to other people's lives, and the importance of family, whether that be the family we are born with, or the ones we make along the way. By doing this, it made it inclusive to everyone - Every person that celebrates Christmas, can relate to the messages relayed in this show, rather than just those who celebrate and believe in the religious side of Christmas. Overall, whether a fan of Heartland the series, or not, I wouldn't hesitate to recommend this, especially heading into the Christmas period.","user":"corrie-annekelly","rank":[5,7]}]