[{"title":"I am not certain what movie others watched. This is a decent horror movie.","rating":7,"date":"6 October 2018","review":"Maybe I don't expect to see a Citizen Cane level movie when I am watching a Netflix horror film. Some of the reviews make it seem like they watched a different movie. It is a decent horror movie. It won't blow you away, but the story is original enough and acting good enough that it is an enjoyable movie to watch. It's on Netflix give it a shot.","user":"the_hawk8","rank":[169,217]},{"title":"A rather good watch, despite its obvious flaws.","rating":7,"date":"10 October 2018","review":"I really looked forward to Malevolent, particularly when I read the outline and saw that both Celia Imrie and James Cosmo were in it.<br><br>The script is a really good one, the plot is clever, and is probably the film's biggest asset, the performances are good, and at least the film manages to surprise you, as you watch it, you think you know exactly the direction the film is moving in, you quickly discover you were wrong.<br><br>It is definitely flawed, at times it seems not to make sense, almost as if scenes were cut, but it hangs together well, and after a pretty tame start it transforms into a much grittier, darker film.<br><br>Fine performances, Ben Lloyd-Hughes and Florence Pugh were particularly good I thought, Celia Imrie is excellent as always, a great chance to witness just how wonderfully talented and versatile an actress she is, what a difference to her character in Acorn Antiques.<br><br>It never looks high budget, but it's an enjoyable watch, 7/10.","user":"Sleepin_Dragon","rank":[37,48]},{"title":"O K","rating":5,"date":"6 October 2018","review":"This movie was actually okay, but not very scary.\nI love a great backstory which this movie does not provide, this is more of a gore type of movie.\nThis movie left me with alot of questions and thoughts.\nSpoilers ahead :)\n1. I was hoping for a flashback type of thing to actually see what happened to the girls\n2. Same thing with the mother, what exactly did she see that made her kill herself?\n3. Where was Mrs.Green's son (Herman) the whole while when they were going through the house, I suspect he was in the east wing somewhere based on Mrs.Green's reaction when they headed that way.\n4. The girls ghosts still had scars and such, but when we saw Jackson's ghost he wasn't beaten up at all. Did he pass peacefully? How? What was the whole thing with the shed about, how could he pass peacefully if murdered like this??\n5. How the actual heck did Elliot survive all of that?? First he breaks his ankle, then the car crash, then he gets hit with a shovel, crawls his way back to the house, gets hit by whatever object Mrs Green was holding, and in the end he was still alive?\nThe movie wasn't all that slow if i'm being honest and I enjoy that but I would really like to know more of the backstory!","user":"extraborjessonfilippa","rank":[31,42]}]