[{"title":"A mixed bag","rating":7,"date":"4 September 2016","review":"Ever wanted to know what happens when you mix 24, Bourne, Die Hard III, and Luther on a tight budget, and then you spice it all with a little Luc Besson? Then you have your answer right here.<br><br>It's a fast paced, no-nonsense action spy thriller, without a single piece of originality. But it manages to present all the borrowed bits and pieces in a way, to deliver a very entertaining experience.<br><br>The main character is almost a carbon copy of the title character in Luther, so Elba naturally revels in the role. They even managed to include one of my favorite lines from Luther, the little thieves. Which is funny since the second main character is actually a thief in this. Self irony maybe? The movie never slows down, not for a minute. I haven't seen anything like it for quite some time. There is less Neutral Gear in here, than in Luc Bessson's original Taxi.<br><br>Of course you shouldn't expect a masterpiece. The characters are all shallow, and the story is predictable. It doesn't even try to be clever, it just gives you everything at face value.","user":"mumia-1","rank":[54,63]},{"title":"A great thriller","rating":8,"date":"23 April 2016","review":"Surprised this isn't at least in the 7's on here. Elba is excellent, no cheesy crap Bond esque love interests. Just a proper thriller with some great twists and decent action sequences. Some comical moments in a non Marvel universe cheesy way. <br><br>Nothing incredibly new with the plot, but it does keep you interested for the duration. The end hints at a sequel, which could be interesting.<br><br>If you like a good action / thriller - this is the best I've seen in a long while. Not quite as good as the old Bournes, but certainly better than recent Bonds.","user":"colinwillsgibson","rank":[71,108]},{"title":"Better than Bourne!","rating":8,"date":"17 August 2016","review":"I am not speaking frivolously when I say that overall, although produced with a fraction of the budget, this is a much better film than the fourth Bourne.<br><br>Specifically: <br><br>* great opener -- film opens with a dramatic situation that immediately grabs the viewers' attention. You have \"connection\" from the getgo.<br><br>* great script --- many layers and twists. Clever dialog. (At one point the bad guys gloat about how they are manipulating \"the hashtags\" -- thereby dissing an entire generation. Another line of dialog refers to the use of \"action and reaction\" to achieve their end -- which is a very sophisticated dig at how politics are managed today.) <br><br>* Director writer Watkins know to keep things interesting, you are never bored.<br><br>* Elba is nothing short of awesome. Other reviewers are saying he could be a major international action figure. Agree! <br><br>Solid entertainment, does not take the viewer for granted, and the clever story keeps you hooked.","user":"A_Different_Drummer","rank":[90,147]}]