[{"title":"Moving Christmas Film Without the Sugar Coating","rating":8,"date":"24 December 2012","review":"Well, you can tell from my screen name that I'm part of the Irish American tribe. All I can say is that there is a lot of truth in this film. While there is a good deal of family dysfunction being dealt with here, there is also a moving portrayal of how love can transcend hurt if you let it. Believe me, been there, done that, in the same environment that Ed Burns comes from. I know these people and this film, while maybe a little exaggerated, was very real. Definitely worth a viewing, even if your not Irish. Compared to most other Christmas films, there is not a trace of false sentimentality in this picture, but it is warm and heartfelt.","user":"irishrebel98","rank":[12,15]},{"title":"great movie!","rating":10,"date":"5 December 2012","review":"Loved this movie! Having grown up Irish on Long Island, in a broken family, I can vouch for its authenticity. From the kitschy plastic Christmas decorations on the front lawn to the tough slang of the brothers, it's L.I. all the way.<br><br>In the movie, the father left the family 20 years ago, and now comes back and expects to spend Christmas with his\"family\" again--his ex-wife and seven children--even though many want nothing to do with him.<br><br>The film has a great natural flow, and it's charming throughout. It was great to see Ed Burns again and he's picked a great ensemble for his movie. <br><br>I haven't seen many of his movies but plan to catch up.","user":"vsobol-547-901598","rank":[12,17]},{"title":"An authentic family drama that every NY Irish-American family will relate to","rating":9,"date":"20 November 2012","review":"What a wonderful film. The characters, the relationships, the situations are all so real. Seven adult siblings are negotiating coming together for Christmas, after having bailed on their mother's 70th birthday party the night before. The oldest brother, played by Ed Burns, tries to bring the family together but must deal with all the various conflicts and alliances that naturally occur in a large family. The plot revolves around the absent father, who abandoned the family 20 years earlier and who now wants to reunite with the family for Christmas. All very authentic and moving, without ever becoming melodramatic. Anita Gillette, the actress playing the family matriarch, is absolutely amazing. And Ed Burns is fabulous, as usual. This should be an annual Christmas movie!","user":"levineshelly","rank":[8,12]}]