[{"title":"Amazing movie","rating":9,"date":"29 January 2015","review":"I loved this movie. I shed a tear. When I first saw the title I thought the action takes place in Stockholm. After watching the movie I realized that the title is probably referring to the Stockholm syndrome. I found it to be very touching. It perfectly described the superficiality in nowadays people interactions, how words lost a meaning and how something that is unimportant to us can mean so much to another person. I can say that it was a really good movie, because the producer didn't use eye candy tricks to make it enjoyable. The action happened in very few places, but the conversation between them was so meaningful and lacking clichés. I must also add that the actors were fabulous.","user":"sinzeg","rank":[20,22]},{"title":"Small, beautiful, strong piece of art.","rating":8,"date":"15 May 2014","review":"Great movie. A lovely story with romantic and dramatic colors, you will travel through modern Madrid night dark streets, in a mixture of dialogues and silent moments that will make you laugh and think, think about this modern society, this modern youth, and modern moral, the romantic relationships, sincerity, lies and our responsibility regarding our acts. The script is beautiful, it will give you at first a harmony feeling and comfort, to take you then into a disturbing atmosphere and a clumsy and emotional violence state. You'll see a strong psychological struggle between the characters, as they go switching their moods and hidden intentions and thoughts. Stockholm is a bit disturbing regarding the truth that is telling, and because of both charming characters, very real and complex inside their own ways of walking through life.","user":"nicoperondi","rank":[25,30]},{"title":"Crimes of the heart...a social phenomenon?","rating":7,"date":"15 December 2017","review":"I dont think this movie was pretentious or over the top, I think it depicts very well on a social phenomenon that is too seldomly encountered in the \"civilised\" world:having intercourse without truly knowing your partner, without being sincere in your pursuing, leads to drama, emotional scaring and potential tragedy. \nWe have \"him\" a smooth talker, so used to getting what he wants, he's so charming until he gets it, we have seen this type before, he's an archetype, right? Count Alexei Vronsky from Anna Karenina, if you will. We know his catch phrases, his dialogue, 20 year old me would be giggling, 30something year old me would be bored and uninterested a.f. Enough with the swagger, how about your soul, depth, kindness, being genuine and passionate, thats what I would say and get in that taxi without a second thought, if I were the female character. So let's say that from that point of view I found the dialogues to be a little lacking, but the underline of the movie is still very emotional, I'll get to that.\n we almost liked him. Almost ...as the female character because we should trust our gut and not buy into his bullshit. \nWe depict him later, after he got his way, changed in his demeanor, he doesn't smile or say those sweet things in the awkward \"post coitus\" morning, which he does his best to make it more even so.\nOn the other hand, we have \"her\" a socially awkward girl, we kinda see it from the start that she's got issues. Later, in the development, when she talks about being off for one year, being sad, talks to her mom on the phone about taking the pills in her bag and refuses to drink alcohol, we are lead to believe that she was suffering from severe depression, maybe.\n She's not the extrovert her friends are, we see that, she tries to defend herself from his attacks, being a \"b*tch\", if you will, as sometime introverts do. He is not able to see it, narcissistic as he is, her defense only inflates him more.\nSo, the morning after all hell breaks lose, as his shallowness and her incredible sensibility collide. At the end, you would think they can make ammends, as adults, but, it could be too late.\nMessage of the movie: don't play with someone's heart unless you are able to take responsibility for it...or as friend of mine says:\"interhuman relationships are haaaaaaarrrddd...\"","user":"crisjelea13","rank":[11,12]}]