[{"title":"\"Whatever you think is over for me was over a long time ago,\" (Eric)","rating":10,"date":"4 June 2014","review":"Just like the mud and the dust on the characters in the film, the excellent The Rover gets under the skin and remains there, long after the screen went black.<br><br>The story takes place in the Australian outback in the near future after a collapse. A bitter loner sees his car stolen by a gang and tries to get it back at all cost with the help of the wounded, simple brother of a gang member, left behind after a disastrous robbery.<br><br>Slow and intense The Rover sucks you into the desert, you can almost feel the heat and the flies in your face. Few words are used, more is said by gunshots. Here are no action heroes who at the end clean up the mess, restore the order and peace and let you leave theater with the feeling that you were nicely entertained. The people in The Rover are desperate to such extent that they've almost become indifferent towards life. They try to survive, period.<br><br>The bizarre relationship between the angry loner Eric and the naive, dependent Rey is wonderfully brought on screen. Both Guy Pearce and Robert Pattinson deliver brilliant performances. Guy embodies perfectly the bitter,rude, inner wounded Eric with his body language and the intense gaze . Robert disappears into Rey, a damaged rather innocent soul who IMO has been taught to blindly obey and not to think for himself, in a way that will blow people away. The tics and blinks belong to Rey, you see them disappear when he feels more at ease, reappear in situations of stress. The supporting actors are amazing as well.<br><br>Although the film is dark, the mood is not cold IMO. Under the surface of alienation and cruelty there's a palpable emotional layer of vulnerability and fear. Michôd created a world frighteningly realistic and raw, a world we, civilized people, in fact don't want to face. With his second movie David shows again how incredibly talented he is. <br><br>I was eagerly anticipating The Rover and it met all my expectations. The performances alone is pure enjoyment together with the beautiful landscapes and the amazing music score. Some scenes are quite funny like Rey trying to do his best to be a good partner, or when he's singing.<br><br>There's also a lot to think about after watching The Rover. What collapse can cause such situation? How far are civilized people willing to go when there's nothing left to loose? Is Rey mentally disabled or is he the product of a very unfavorable education?<br><br>And why did I think about Animal Kingdom after The Rover had finished? See the movie and you'll know. <br><br>Sorry for mistakes, English isn't my native language.","user":"blackbeanie","rank":[200,266]},{"title":"Post apocalyptic case of road rage","rating":8,"date":"22 June 2014","review":"What a bleak future this film portrays.<br><br>Felt like an apocalyptic Western meets old school Road Warrior. Filmed in the Australian desert, I think they could have financed this film from loose change at starring actors Guy Pearce and Robert Pattinson's houses.<br><br>Without a doubt the best performance from Robert Pattinson I've seen. Granted, I've not seen too many Pattinson films but he does a really good job of playing the half wit brother of one of the dudes jacked Guy's car.<br><br>Mysterious drifter shows up at the filthiest, dingiest outback pub in Australia just for a glass of water. Three shot up dudes in a truck crash outside the pub, steal his car and he will stop and nothing, nothing to get it back.<br><br>It's a wonderfully dreary world in which this film is set. Everyone is so dirty. They should get an Oscar for make up when all the actors did was not shower for what looks about three months.<br><br>Lots of long shots, tension filled chords supply the majority of the soundtrack.<br><br>I really dug it. Most folks are gonna hate it. Very gritty. Very dirty. Very violent. Very non-Hollywood.<br><br>It's a nice piece of cinema. And there's a midget.","user":"capncal","rank":[128,177]},{"title":"Loved Everything About This Movie","rating":10,"date":"21 June 2014","review":"As soon as I saw how slowly this movie moved in the beginning, I knew I was going to like it. It's a serious film that doesn't care about having popular appeal.<br><br>The writing, directing, and cinematography are all great, but the acting by Guy Pearce and Robert Pattinson is flawless. They do a tremendous job, together, of showing what causes each subtle change in their relationship that leads to a much larger shift in their feelings about each other.<br><br>I have to admit I am the mom of a special needs kid, which may have made me really focus on the great job Robert Pattinson did of portraying Rey. The way he showed Rey's desire to be liked by someone who didn't want a friendship with him brought tears to my eyes. And he was so real when he showed Eric (Guy Pearce) and the audience that Rey was much more capable than he seemed. I keep thinking about his speech problem, and that David Michod (the writer and director) and Robert Pattinson were so accurate when they initially allowed us to view him as more disabled than he was because he couldn't express his thoughts. <br><br>In an interview, Robert Pattinson pointed out that Rey couldn't do anything without someone telling him to, meaning that Rey couldn't function in a practical sense without another person. I think he is so close to the character he created that he doesn't see how complex he made him. The feeling I had was that Rey could function in a practical sense alone, but emotionally, he couldn't function without companionship. And that's a big theme in the movie.","user":"jenperkins123","rank":[126,181]}]