[{"title":"Spoof? \"Predator\" tribute? Or just downright stupidity?","rating":4,"date":"20 May 2013","review":"Well, well, well... \"Alien Showdown: The Day the Old West Stood Still\" (or \"Alien Predator War\"), yep it is one of those movies alright. Whether this movie is a spoof, an actual movie or an homage to the \"Predator\" franchise, well I suppose that is depending on how you approach this movie. It was blatantly copying so many things from the \"Predator\" movies.<br><br>You have an alien spacecraft crashing on Earth and an armored extraterrestrial emerging from the wreckage, in a suit that looks like a discount version of a predator outfit that was put together in a tool shed out in the backyard. And the face of this creature was a down-right imitation of the predator's, except they didn't manage to actually make it capable of opening up like the predator's did. And of course, the weaponry and the wrist-panel was also there. Copy, copy, copy...<br><br>And lets move on to the main character, Reinhard (played by Robert Amstler), of course he had to be a German cowboy with a lovely Schwarzenegger-imitated accent. It was just painful to witness. As for the acting here, well don't get worked out, because there is no acting going on, it is basically just running through a forest and shooting at a man in a plastic and rubber alien suit.<br><br>This is without a doubt a low budget and an amateurish movie, but they actually did manage to pull it off well enough, despite its lack of a proper storyline and despite its complete rip off of the \"Predator\" concept. The movie was just bad enough to actually be entertaining. This is the type of movie that requires no brain activity at all.<br><br>The thing I loved the most about this movie was that this top secret project about the alien transmitter at the top of the mountain, had just a single guard posted at a random location on the side of the forested mountain, standing at a gate. It was just epically stupid. One man to guard an entire mountain, to which you could easily go around and just scale the mountainside from any location to get to the transmitter. It was hilarious. Thumbs up on that one!<br><br>And also the fact that Reinhard's skeleton was there without the garments he wore back in 1854, as they had deteriorated and crumbled away to the decay of time, but still his journal had survived. I guess paper is just all the more durable to the ravages of time compared to fabric of clothing. Right, indeed!<br><br>This movie is the type of movie you just watch for a laugh at the stupidity of it all, and how cheesy and badly acted that it is. It is the type of movie you watch when you are seriously hung over and don't have to use your brain at all. It is the type of movie you watch once and never ever again, being left with a notion of 'seriously?'<br><br>Although amateurish and low budget, it did fare better than many other low budget movies. It is not amongst the worst of such movies I have seen. But don't have your hopes up too high...","user":"paul_haakonsen","rank":[16,17]},{"title":"Alien Showdown The Day the Old West Stood Still: Aliens vs Cowboy","rating":2,"date":"9 October 2017","review":"I'm open to new ideas, that's why when a film comes along with a ridiculous title or premise it gets my attention.<br><br>We are bombarded with the same predictable formulaic nonsense left right and centre so when I see a title like this I had to give it a go.<br><br>I knew the likelihood of it being awful was high but I held my breath and dived on in only to find my fears were justified.<br><br>A story across two generations, a cowboy battling a highly advanced alien and one very very bored viewer.<br><br>I can forgive the effects, I can forgive the lack of experience of the creators but everything about the film screamed poor.<br><br>To make matters worse I recently watched the trailer and was astonished at the lack of quality. I've never seen a trailer so shoddily made.<br><br>This film appears to be getting some serious hate and all of it is just.<br><br>The Good: <br><br>Concept is bearable <br><br>The Bad: <br><br>Shoddily made <br><br>SFX are questionable <br><br>Cast are highly hit and miss <br><br>Things I Learnt From This Movie: <br><br>Cowboys and Aliens don't mix, just ask Harrison Ford","user":"Platypuschow","rank":[9,9]},{"title":"Mockbuster, a bit entertaining - on a geek level though.","rating":24,"date":"24 March 2013","review":"Original title, as displayed in the movie: Alien Predator War. <br><br>This is actually a nice movie, considering the budget and the level of amateurism. The story is thin but interesting. The cinematography is really amateuristic. It is clear what it is supposed to look like, but it just doesn't.<br><br>The movie score is monotonous at best. Better than no music, they must have thought. Some kind of elevator music I think. The acting is fairly decent, save Robert Amstler's performance (Reinhardt/Alien invader) which is more like pretending to act, while stepping through the forest scenery like a 1967 sasquatch. Amstler is best described as a cousin of Arnold Schwarzenegger who never took acting lessons. Also he is the producer of this movie. Multi-tasking is common in these mockbuster movies. Rene Perez is director, cameraman, writer, editor, and fight choreographer.<br><br>Special effects are creative but far from good, again with an ultra low budget in mind - fair. There is some inspired screenplay, like making use of the environment nicely (the huge fallen trees). An alien invader (predator lookalike from the movie \"Predator\") comes in. Very creatively the dreadlock-like beady hear strings are suggested with pieces of ragged cloth. Also, it's stepping through the woods like bigfoot. That's when I realized it must be the same actor playing Reinhardt. Another alien (a \"gray\") transmits information in an inaudibly garbled voice. I still wonder what it was saying.<br><br>The cgi guy worked miracles. Really, I take off my hat. Nice work!<br><br>There is a scene with bears, which is clearly out of a documentary like from Discovery or National Geographic. Well, as long as they paid for it it's okay. And YES! There is nudity which seems to arouse the praying predator, breathing heavily and grunting like an animal - and wow! It appears silicone breast implants were available in 1894. Later, in present time, the \"gray\" alien also likes to look at the naked female body. Kinky aliens, those. <br><br>The camera-work and editing allowed a little too much filler footage, seconds in where nothing really happens or is added to the movie, and no entertainment value is apparent. A lot of lost seconds, makes the movie advance a little faster trough time. At the end I was like: \"Really? Already?\"<br><br>Concluding I'd say it is a nice movie on the amateur level. Something a cosplay club could have thrown together. Script is consistent, all the way, in contrary to the Asylums recent \"Jack the giant killer\". Once I discarded Amstler's chunky acting and the amateuristic cinematography, the movie was really not bad. Was I entertained? Moderately. On a geek level, though.","user":"beef-638-121436","rank":[16,21]}]