[{"title":"A different take on the usual Brit gangster flick","rating":7,"date":"1 November 2014","review":"From the start The Smoke feels a bit different from your usual gangster carnage flick from the Tanters and the Sothcotts of this world - which might be why those fooled by the mis-marketing of this romantic crime thriller as a \"proper lads' film\" might feel a little misled.<br><br>The producers seem to have tried to up the ante with chases through underground train stations, exploding cars and a Paris-set finale with a reformed hooker given a second chance in life (and a dalmatian!) at the foot of the Eiffel Tower. Not your average gangster move.<br><br>And while they don't fully succeed in delivering the next Layer Cake or Lock Stock, at worst it feels like a noble failure.<br><br>Matt di'Angelo's turn as Brad, the lawyer having the baddest of bad days, deserves praise and plaudits - he's more than your average soap star and it shows. His co-star Lili Bordan oozes sex and vulnerability in equal measure with her damaged call girl Jodie. Without their performances, the film would possibly struggle to anchor but they act as a gel to the rest of the narrative. As good leads should!<br><br>You get the feeling that much of the film is on a cutting room floor somewhere though and that something bolder was on the cards. Jeff Leach, who plays Brad's best mate Dean, spoke about many of his best scenes not making the final cut for some reason, and Wikipedia refer to this 89 minute release as the \"studio cut\". So maybe a Director's Cut is bobbing around out there for people to really judge one day...","user":"dextersmith71","rank":[18,26]},{"title":"Couldn't wait for it to end","rating":1,"date":"28 October 2014","review":"It's not often that I end up watching a film almost entirely without merit purely by my own choice but unfortunately I have only myself and some misleading critic reviews to blame for this wasted 90 minutes. <br><br>The storyline is so unbelievable that it makes eastenders seem like a gritty east end documentary/drama. The characters are both exceptionally shallow and deeply flawed, the dialogue is mostly appalling other than a few mildly amusing interchanges between some of the villains and the most appealing part of the whole movie is the ending - not the content of the ending itself but the actual cessation of poor quality viewing that was truly like a weight being lifted from my chest. <br><br>I love a shameless \"glamorous\" gangster flick like lock stock, snatch or layer cake but this is nothing like those. It's a very cheap impersonation. This film is the movie equivalent of one of those fake aftershaves you see a street vendor selling for £5 on a stall in turkey. <br><br>Save your time and do something more productive like sitting in the dark alone rather than watch this.","user":"coldando","rank":[19,36]},{"title":"FREE YOUR MIND","rating":5,"date":"8 September 2018","review":"Possible midpoint plot spoiler.<br><br>Brad Walker (Matt Di Angelo) gets his walking papers in the first few minutes of the film and his girlfriend also leaves him (Anna Passey) for his friend Tom (Christian Brassington). While doing a few lines on a bowl in a nightclub he overhears about a drop-off which he copies down because...he does. Then by coincidence the car doing the drop off just so happens to stop in front of the little cafe he is sitting at...facing the license plate of said car. While the driver leaves for a quick pit stop, Brad steals the car, makes the drop, collects the cash in what would seem to be a clean get away. Not only unbelievably do the bad guys figure out it is him, but a high price mobster prostitute lands in his lap the same day.<br><br>Now I don't mind one or two freakish events in a story. Heck, if you are going for a weird cult film, the more the merrier. However this film lacks the over the top grindhouse style to get away with a bunch of stuff that just wouldn't happen. I found the main characters to be dull. Our two stooges who botched things up were the only decently written characters as the talked about films, i.e. \"Godfather vs Star Wars.\"<br><br>Could have been better.<br><br>F-bomb, sex, nudity (Lili Bordán, Anna Passey, Lindsay Armaou, Funda Önal, Nicola Kelleher ?)","user":"nogodnomasters","rank":[2,3]}]