[{"title":"Flawed but a lot of fun - I am a freak","rating":9,"date":"3 May 2014","review":"I heard about this film from the press reviews which were generally quite positive for a British comedy, so I thought it might have something to it. I downloaded it while the wife was out and loved it. It reminded me of being young, not fitting in and feeling like a bit of a loser.<br><br>I expected some kind of Inbetweeners cash-in but its much smarter than that, this is a film with something to say about youth, alienation and Thatcher's Britain. The characters represent different strata of the class system so we have rich kid Chunks who can't take life seriously, middle class Parsons and poor Jack, whose character is interesting because in socio-economic terms he is working class, but miles away from the usual working class Ken Loach clichéd archetype.<br><br>Its actually a very smart teen movie which subverts all those tropes like the geeky guy getting getting the girl - in this film she turns out to be a pill popping raver with issues. Or the bad boy learning something from a wise youth like in American Graffiti - in this film he kills him accidentally! In the end nobody learns anything which I understand will irritate a lot of people used to the 3-act Hollywood morality play. At least this is something different even if it doesn't always work.<br><br>The acting is good and its well-directed, a shame it didn't get more of a release but I'm sure its destined to become a cult classic in years to come with kids sitting watching it in their bedrooms smoking dope! I am a Freak!","user":"Justin-edgar-991-69186","rank":[3,3]},{"title":"A bit of a misfire","rating":4,"date":"28 June 2013","review":"A teenager awaits word on whether he has been accepted to the University he applied for. We watch him and two of his friends – the freaks – embark on an eventful night on the town.<br><br>Going into this one I was sold mainly on the idea that it was going to be a film about British teenagers in 1990. This would be something I could relate to having been one then and having very fond memories of it. So I was up for a bit of that. Unfortunately for me, We Are the Freaks turned out to be movie that didn't feel very 'early 1990's' at all. Despite a few pointers such as Margaret Thatcher's resignation, a chunky car phone and some music references this could easily have been set in the present day. There was no soundtrack to give the feel of the times; all we got on that front was some utterly pointless references to pop bands of the day.<br><br>Sadly, pointlessness is a good way of describing We Are the Freaks in general. There are many scenes that go absolutely nowhere and moments that happen for no overall purpose. It heavily feels like a film that is trying to 'be different' at all times, like it's too cool for school. The fourth wall is obliterated within the first few minutes and it's rammed to the gunnels with post-modern techniques that continually remind you that you are watching a movie. All of this would be okay in the right hands, as a skilled film-maker can use these devices to great effect. But We Are the Freaks is pretty poorly made and conceived. The writing is particularly terrible with a script that tries hard to be funny and clever but hardly ever is. The acting seemed under par as well but this may very well be a result of the awful script and the fact that all the characters have no depth to begin with. It's not a term I use much but this is a very self-indulgent movie. In fairness to it it's fast paced and visually interesting at times. But in the main it was a bit annoying to tell the truth.","user":"Red-Barracuda","rank":[9,14]},{"title":"And we don't really know where we're going","rating":5,"date":"1 July 2014","review":"As the opening credits rolled, our teenage 'anti-hero' gives us a monologue to set the scene about how he's waiting to hear whether he's got into university and all the things he hates during the early nineties. I actually found myself laughing quite a lot and looking forward to what followed. However, what followed didn't really live up to its opening.<br><br>First of all, it may be set in the early nineties, but it didn't really feel very early nineties at all – stick an iphone or two in the film and it would simply be set in the present day. We soon meet the cast – three young lads who don't feel like they confirm to the 'norms' of society and we follow them on their various adventures over the next couple of weeks. Unfortunately, their 'adventures' don't really take them that far. They just kind of drift from one situation to another with little in the way of story to tie it all together. You have the obligatory attempt to score drugs. The fabled party which they simply MUST attend and the – seemingly unobtainable – love interest that the hero is besotted with.<br><br>There are a few funny moments dotted along here and there, but many of the scenes seemed like they were trying a bit too hard to be terribly over-the-top and outrageous. The trouble is... if you like teenagers behaving badly then you've probably already seen American Pie or, if you're only into the British version, The Inbetweeners. Bother of these franchises are massively better than 'We Are the Freaks' and, just because the latter tries to film itself all stylish (ala 'Trainspotting') doesn't really make it worth watching.<br><br>It's okay, but you'll probably be better off watching Pie/Inbetweeners.<br><br>http://thewrongtreemoviereviews.blogspot.co.uk/","user":"bowmanblue","rank":[2,3]}]