[{"title":"Wacky and what I expected","rating":6,"date":"13 July 2015","review":"Some of the reviews of this movie are puzzling (its also hard to take some of them seriously with the embarrassing misuse of the word 'to').<br><br>I don't see that anyone connected to this flick attempted to make an earth shattering film.. It was just a fun ride for me. I had a good time with this movie. <br><br>In general I thought it was acted well. The music punched the Tarantino parallel, and added a fun tone. I thought it was worth seeing for sure.. <br><br>I guess if you go in expecting a Tarantino flick, you will be disappointed - and evidently displeased that a movie would resemble one.","user":"imdb-21226","rank":[21,27]},{"title":"Entertaining enough, while you're watching it.","rating":6,"date":"14 July 2015","review":"'KILL ME THREE TIMES': Three Stars (Out of Five)<br><br>A black comedy crime-thriller, starring Simon Pegg; as a hit-man hired to kill a businessman's cheating wife. The film was directed by Kriv Stenders and written by first-time feature film writer James McFarland. It costars Alice Braga, Sullivan Stapleton, Teresa Palmer, Luke Hemsworth, Callan Mulvey and Bryan Brown. The movie is surprisingly dark and brutally violent; but it's not as funny, or as shocking, as it wants to be. <br><br>Pegg plays Charlie Wolfe; an assassin for hire, and private investigator, working in Western Australia. When a successful motel and bar owner, Jack Taylor (Mulvey), suspects his wife, Alice (Braga), of cheating on him; he hires Wolfe to find out. After Charlie brings back info, that's not to Jack's liking, Jack hires him to kill Alice. While Charlie is attempting to complete the assignment, he finds out that another couple (Stapleton and Palmer) wants her dead as well. Things get complicated, and the story is told from three different points of view. <br><br>Pegg is fantastic as the movie's main villain; and it's nice to see him playing against type for-a-change. The supporting cast is all adequate as well, and the directing is decent. The script is somewhat clever, and it also has a few nice twists, but it's nothing too memorable. The film is entertaining enough, while you're watching it, but it doesn't offer much more than that.<br><br>Watch out movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=JaTQgKVh7fQ","user":"Hellmant","rank":[20,26]},{"title":"Fun movie. Don't let the reviews discourage you if you like the trailer.","rating":8,"date":"9 July 2015","review":"I have a habit of rarely being able to finish a movie. If I am bored, I just cannot go through with it. I was intrigued by the trailer of Kill Me Three Times and so despite the IMDb rating and poor reviews I started watching it. And it was the right decision. The movie kept me glued and I was not expecting anything too complicated. It told a simple fun story that had its own twists. Loved it. Recommended if you want a lighthearted action comedy. The acting is good and the plot slowly opens up to keep you on it. Does not deliver memento style story. But this is entertaining nonetheless. Loved Pegg and his beginning commentary. Would have loved it more if it continued a bit more throughout the movie.","user":"radi0608","rank":[19,26]}]