[{"title":"One minute can be a lifetime, if you live it right.","rating":9,"date":"4 November 2015","review":"The Venezuelan film Liz en Septiembre was shown in the U.S. with the title Liz in September (2014). It was written and directed by Fina Torres. <br><br>The film stars Patricia Velasquez as Liz--a lesbian supermodel who comes to a beach resort to celebrate her birthday. All of her friends, as well as the proprietor of the hotel, are lesbians.<br><br>By happenstance, a straight woman arrives at the hotel, and becomes the object of attention from everyone. Liz bets that she can seduce the outsider within a short time, and then sets about to do just that. As you might expect, there are problems ahead for Liz and the straight woman. The problems surface slowly--they are brought to our attention little by little.<br><br>The setting of the movie is so beautiful--as are all the actors--that the tragic moments of the film are hard to accept. The straight/lesbian situation isn't the problem. However, problems are there, and this makes the film a tragicomedy. <br><br>This is a powerful and beautiful movie. I highly recommend it. We saw it on the large screen as part of ImageOut, the excellent Rochester LGBTQ Film Festival. It won't work as well on a small screen, because some of the tropical beauty will be lost. Still, it's a great movie, and I suggest that you see it in any format that's available.","user":"Red-125","rank":[8,9]},{"title":"Wonderful","rating":10,"date":"16 June 2014","review":"Liz en Septiembre is a wonderful movie . Amazing work of Fina Torres and all the cast . Patricia Velasquez does a phenomenal job and carries the movie so well . The theme is great . Thank you for this Extraordinary piece .It was about time that we started talking about these issues in the Latin countries . This movie will remain in history The cinematography is beautiful . Thank you Fina for taking such a risk . I loved the humor in it and how she was able to combine it with the tragedy of the situation . The right to choose is the one message I walked away with . I laughed,cried and never lots hope . All the characters are winners . It made me cheer for them . You can see how much dedication and thought was put in it . Bravo to all the team !","user":"wondelin","rank":[7,11]},{"title":"All in one romantic film","rating":4,"date":"6 November 2017","review":"Liz in September by Fina Torres is a lesbian-centric take on the generic romance film. Liz (Velásquez) is a former model and a notorious player. Eva (Maturén) plays the role of the beautiful woman with the broken down car. Through a turn of fate, she ends up being sent to Margot's (Lazo) beachside hotel where all of the residents are lesbians. The romance between Liz and Eva begins, in standard rom-com fashion, as a bet between Liz and one of her friends about whether or not Liz can convince Eva to sleep with her within three days. Liz is not looking for anything serious. This is revealed to us through several, repetitive expositions between her and other characters as well as conversations that her friends have with each other. Every character in Liz in September seems to have an odd fixation on Liz. Despite this, we learn relatively little about Liz as a person other than the fact that she is completely irresistible. One of the other inhabitants of Margot's hotel is Liz's ex-partner Dolores (Lazo), whom Liz cheated on. We are never told why Liz cheated or how she and Dolores moved on to become friends, infidelity is just another part of Liz's bad girl persona. Throughout the film, Dolores's current girlfriend Coqui (García) makes several heavy- handed passes at Liz who feels neither the compulsion to inform Dolores or any apparent guilt afterwards when she briefly succumbs to Coqui's seduction. Even the romance between Liz and Eva, supposedly the central feature of the film, feels neglected in place of showing off how amazing and hot Liz is. Liz in September is notable for its unapologetic portrayal of women who love women. That being said, the movie feels at the same incomplete and overburdened.The irresistible playgirl, the unsatisfied wife, the dead child, the bet, the breakneck speed romance and the cancer all combine into a movie that is not displeasing to watch, but is disjointed and over-the-top cliché.","user":"alexrene-80054","rank":[2,2]}]