[{"title":"A thoughtful drama","rating":3,"date":"3 October 2012","review":"I tuned into this movie on Saturday evening and hesitated at first....do I really want to watch this? I deal with kids every day as an educator and it looked like just another teen flick at first, but, it soon caught me up in the emotion of a young girl who is facing prison for decisions made in one night of partying, drinking and driving. I dare say we all know at least one person who has been killed by a drunk driver.<br><br>The actors were real in their characters but a couple do stand out: Malara Walsh as the girl who died and Steven A. Miller as the young man who has turned to alcohol to assuage his guilt. I also enjoyed Kelcie Stranahan as Grace.<br><br>I hope this movie is viewed by lots of adolescents as a warning of what can happen when decisions are made after drinking and partying.","user":"kathicutler","rank":[4,4]},{"title":"Good Content","rating":3,"date":"3 October 2012","review":"This movie kept me hanging, there were great foreshadowing techniques. The actor who played Pete, Stephen Miller played a great role in the movie, I would like to see him in more movies. Like action thrillers, Love movies, something that shows off his talents. He played a character who was full of emotion, from elation to deep sorrow. What a wonderful role. I think Stephen Miller did an excellent job persuading the audience to believe his sorrow after the tragedy, as well as showing his positive emotions during the flashback scenes. Please let me see more of this talented actor... He is a star waiting to shine and show his talent to the Hollywood producers.","user":"debbie-estok","rank":[4,5]},{"title":"Amazing","rating":8,"date":"22 December 2013","review":"I thought this film was fantastic. The story line was very interesting and the ending was great. I have watched this film twice in the last 2 days and will probably watch it again. Although I would have made a few minor changes as a director like maybe not being able to see Jennifer's shadow. There was also a part where the actress was still in the background waiting for her cue but she was in full vision, these are just minor errors that could have been fixed by the editor but oh well it's done now and the acting was still strong and the characters were portrayed well. Apart from the errors it is definitely a film worth watching. Most people won't pick up on them anyway.","user":"weezarlouise","rank":[2,2]}]