[{"title":"\"A vagina is a like a coupon-book for alcohol\" (dialog)","rating":7,"date":"21 December 2015","review":"And, the really amazing thing, is that the above line of dialog was just a throw-away, not even something important enough to build a scene around. That's the kind of movie this is.<br><br>Reviewers Notes: <br><br>1. The first legitimate successor to the quirky Canadian horror flick, Ginger Snaps, which is doubly ironic because the two \"official\" sequels to that film were OMIGAWD terrible.<br><br>2. Completely insane and unpredictable yet strangely charming. By coincidence, this reviewer just finished a review of Quentin Tarantino's THE HATEFUL EIGHT and, in said review, pointed out how far QT has strayed from the charm and sly humor which demarked his earlier films. This strange little film could almost pass for an early work of QT, that is how offbeat it is.<br><br>3. Henry Rollins is great, almost re-defines the \"man with no name\" anti-hero persona first created by Clint Eastwood in the 60s. He does not say much, he just wants to be left alone, women initially are torn between wanting to date him and/or calling a cop, picking a fight with him is INVARIABLY A REALLY REALLY BAD IDEA, and his mono-syllabic responses to every question walk the fine line between autism and efficiency.<br><br>4. Engaging, charming, and generally a fun ride. Deserves a cult following.","user":"A_Different_Drummer","rank":[162,187]},{"title":"I think everyone wanted to be this guy at some point..","rating":7,"date":"9 January 2016","review":"One of the reviewers mentioned that this movie is the best portrayal of immortality he's ever seen. I must really concur, this was not a great movie, but it was interesting. And that's what really makes a good movie.<br><br>Our hero is an immortal being. Think vampire, then put that idea out of your head. He's worse. Completely unkillable and jaded to the point of blindness, this character has lived long enough to see it all and become so bored with existence that he figures he might as well not exist. And therein lies the interesting part. Henry Rollins plays the part well. He is stone-faced, wooden and cold (which is appropriate for the part) throughout most of the film. Just the sort of behavior you'd expect from someone who is so completely bored with his life that he is utterly uncaring about everything around him. Top that off with his superhuman qualities and you get a figure that simply demands impromptu action.<br><br>And of course, you get to see him in action. Action that he doesn't really want, but is willing to deal with. His handling of it is entertaining to say the least. Very enjoyable indeed, the scenes are played through very well and in a manner that seems both real and also a little humorous.<br><br>Since the film is entirely character driven, the writers know that in order to make the movie good, they have to make their viewers identify with the protagonist. And they do. The ancient man grapples with barely a shred of the common human needs that normal people deal with, and we see him as a stark contrast. It illuminates our human side, makes our own behavior and feelings that much more real. And even gives us a sort of sympathy for him. We want him to \"come around\" so to speak. Reawaken the spark of life that we all find so critical.<br><br>Devoid of most computer enhanced special effects, this movie relies on good old fashioned blood splatter and fire for the action. It has the distinct air of an old man dealing with an old problem. This is a strength in my opinion. It makes the movie seem much more real.<br><br>If there is any weakness, it would have to be towards the ending. Things change up a bit in the protagonist's character that I found somewhat confusing. Essentially, a moral is inserted. And whenever that happens in a film you always bring out the cynicism in viewers who sometimes decide that they \"disagree\" with it.<br><br>I give it a 7 out of 10. Much more entertaining than I expected it to be.","user":"rushknight","rank":[86,98]},{"title":"Worth watching more than once!","rating":10,"date":"23 March 2016","review":"Wife and I were cruising NetFlix for a B-Movie to watch and ended up turning on this sleeper. I mean sleeper in a good way.<br><br>Honest, if you like a movie that mixes up comedy, horror and drama with an expert casting of characters, you need to watch this one.<br><br>The casting of Henry Rollins is only second to his performance. With perfect timing, Henry delivers line after line without breaking character even to blink. He just went up several notches in my \"fav\"actor category because of this movie.<br><br>Add to it a well picked supporting cast, well thought out the script, great pacing and just the right touch of effects, we have a winner that should have been in the theaters. Honest, it could have been well received by a mature audience looking for something with more than just empty violence and snarky comebacks.<br><br>Want something to watch that will make you think, wonder, then nod when the reveal comes up? Watch this movie. It will not disappoint.","user":"doug-858-460599","rank":[74,85]}]