[{"title":"Not as great as many said, but really not as bad either","rating":6,"date":"16 May 2015","review":"The plot in this one is a little disjointed and by the end you are wondering what the heck is going on, but it seems to wrap everything up kind of neat. The relationship between Danny and Lexi is confusing and unclear as you are only clued in by his conversation with the detective. Danny and Lexi's conversations are mostly soliloquies, nothing you would hear normal people discuss. Sounds more like they memorized lengthy passages of a thought-provoking novel and repeated them back and forth to one another throughout the movie.<br><br>The cinematography and music are very well done. The acting was good, but really not as horrible as some people have reported. I think the relationship between Danny and Lexi could have been fleshed out more. They never even get to a point where they get uncomfortably close to each other, so you wonder why he spent so much energy pursuing her if there is no emotional energy created at some point. It all seems suspiciously platonic, but the why is never clear. Again, the end clears thing up a little in this respect.<br><br>Like I said, in the end the confusion is cleared up, but you are left wondering why you were even confused to begin with. You should have enough information to be uncomfortable with what you don't know, not confused wondering what you might have missed, only to find out you didn't miss anything at all.<br><br>So see it and make up your own mind. It's a good story regardless.","user":"bgarts","rank":[14,15]},{"title":"Unbelievably tortuous to watch","rating":1,"date":"4 September 2014","review":"Long time user of IMDb, but this is my very first review because I felt compelled to write as I read the unbelievably high scores given to this film by people that must have been on the crew or are relatives of the actors or producers. What an atrocious film filled with bad acting, terrible dialogue and poor pace! I was expecting a good film, then I saw the scores drop for this film in real time over a matter of days on Netflix. I should have sent the film back without watching it as the Netflix algorithms know a stinker from a good or even great film. I watched the whole thing because once I start I can't stop. It was almost a physically painful ordeal that I had to endure just to get through the 1 hr and 20 minutes. I will be on my deathbed and probably think about this film and wonder what constructive thing I could have done with that time instead, perhaps watch paint dry or look into a dark closet. Yikes! Please don't waste your time like I did.","user":"cmmyakman-550-348799","rank":[40,51]},{"title":"Glad I only paid half price.","rating":4,"date":"16 August 2014","review":"Empty headed lead who is 'so smart' he get used and abused for a 'mystery woman' - who he never gets to answer to any question. Sorry waste of time. Police know she emptied her trust account - but not her name? Video she sends him at end of film could be used to locate her - yes small Caribbean Islands will extradite murderers. Why did she mask out her face in the video - she has lots of photos - Drivers License, Passport etc. So many questions - not worth time to find-out answers - film was a 4 at best. Was suspenseful enough that we did not walk out in hopes of getting an 'aha' - did not. Actors did good work - even liked 'Spider'","user":"searover-503-203540","rank":[19,23]}]