[{"title":"Dumb Orcs with swords and shields versus guns don't work.","rating":4,"date":"28 September 2013","review":"After watching a great SAGA I had to see this one! But unfortunately it just doesn't work for me. Dumb Orcs with swords and shields, who are shot down and slayed in dozens by people with guns, who are more or less never missing their target, is not cool. Even the dead orc bodies are vanishing magically. Don't get me wrong, I want Arrowstorm Entertainment to go on, and I am looking forward for their new Mythica, but Orc Wars as a crossover Fantasy &lt;=&gt; our world just failed. For a low budget movie the costumes and effects are in general OK, the dragon is great, and the princess is very sweet (although Danielle Chuchran in SAGA is much cooler), but all the action with the shooting is just not my thing: The effects, when the Orcs are hit, are often quite bad and also the fighting scenes are not nice. And there is only a poor story. With a big bonus for Indie-movies it is just a 4/10.","user":"sven-49-694776","rank":[60,68]},{"title":"Awful but still entertaining","rating":4,"date":"5 October 2013","review":"I agree with the other comment on the stupidity of the Orcs and that the heroes of the film never missing a shot and about the dead disappearing. However I was still entertained by the movie up until I watched a dead Orc being rolled off the front porch. The Orcs were said to be from a dimension that did not have or understand technology or modern weapons and yet the one rolled off the porch had on a pair of modern boots with dimpled molded soles. You would expect anyone going over the film for continuity or accuracy would have noticed that small point.<br><br>I was entertained, there was nothing on the TV and I was bored, so it served it's purpose, but it is never going to win them any awards, nor make them their fortunes.<br><br>I see I had to remove the u from between the o and l in the word molded as I could not post unless I corrected it to a US dictionary spelling. Never mind the fact that the soles of the boots were made in a M O U L D.","user":"systemic-aps","rank":[21,24]},{"title":"not bad for a low end movie","rating":6,"date":"2 October 2013","review":"As a lower level film maker myself I see many small issues that are distracting from an otherwise entertaining low budget movie. (the \"after effects\" gunshots/muzzle flashes/ejecting cartridges) coming from air soft style or resin prop guns. this can be distracting as its done way too much, and if they would have rented an armorer, a few real weapons and given more training to the actors on the use of them (for example you don't fire a barrett .50 from the hip while kneeling on a rooftop and actually expect to hit something) it would have helped keep the distractions down. and people watching the movie rather than questioning what they just saw.<br><br>the acting is not too...bad, a bit more emotion, a little less dumb-a$$/redneck stereo typing and some back-story would be helpful. the camera work is adequate but depending on the shooting conditions it seemed they the must have had a very limited amount of space to film the battle scenes in. with a little more thought and camera work i feel that the limited space used could be made to look like a lot more... it reminded me of shooting in someones backyard. one way or the other that's falls back on the producer for choosing the spot and the DP for not using what he had to its fullest.<br><br>as for the battle scenes, if the intent was to show overwhelming orc forces than they should have hired more extras, recycling eight people in rubber masks at a time throughout the movie just didn't work for me.<br><br>I am unsure what they spent the 1.5 mil on for the production, I have seen better production value for about a quarter mil. I could always nickel and dime it further but I really don't see a reason. Overall I liked what I saw and with so much poorly filmed/acted trash out there this was a nice change.","user":"toddrobinson-350-467838","rank":[16,19]}]