[{"title":"A smart, funny movie for grown-ups","rating":8,"date":"3 June 2014","review":"So great to have a movie adults can enjoy amidst a summer of cartoon plots &amp; characters; a movie you can actually take your family to without being bombarded by violence, sex and f-bombs. I loved it. Clive Owen and Juliette Binoche as artists each struggling with demons that have crippled (in Binoche's case, literally) their creative abilities, deliver wonderful performances, as does the entire cast. The well-paced script rolls along at just the right pace, while giving us moments of pause to feel each character's pain and root for their ultimate triumph.<br><br>You'd have to be pretty cynical to not like this movie. Could one pick it apart? As with any film, the answer is \"sure.\" But why? Just go. Buy your popcorn and enjoy a really good-hearted film. The audience I saw it with (almost all over 40) was cheering at the end.","user":"jvmcblcar","rank":[48,52]},{"title":"Far more intellectually stimulating than your average romantic comedy","rating":7,"date":"7 July 2014","review":"This is an honest movie that could be classified as a romantic comedy, but offers something more cerebral than that.<br><br>Through its main protagonist, the witty but self-destructive Jack (who plays tennis in his lounge room when drunk) we see a glimpse of the kind of inspirational teacher from Dead Poets Society recast in the information age where students can answer any question by referring to their electronic devices, while never understanding the worth of the question in the first place.<br><br>Don't let the love story fool you into thinking this is a chick flick. It's about appreciating the creation and expression of new ideas, neatly summed-up in the title: Words &amp; Pictures.<br><br>This movie pleasantly surprised me with its clever dialogue and wordplay, despite the boy-meets-girl, etc storyline. Well worth a look.","user":"jason-47-508086","rank":[45,49]},{"title":"Wonderful and Poignant, thank God for a middle-agers romance although teens will like it, too","rating":8,"date":"18 June 2014","review":"At a posh New England secondary school, with an ocean setting, English teacher Jack (Clive Owen) is in the midst of a middle age crisis. Only, he doesn't know it. Not yet. Others have observed that he drinks too much and is often a few minutes late to class, with poor lesson planning. To his credit, Jack is extremely dedicated and bright, making the most of his classes and connecting well with students. But, he is headed for trouble. That is, until a new art teacher, Dina (Juliette Binoche) arrives at the academy, cane in hand, for she suffers from rheumatoid arthritis. Needless to say, Jack rubs her the wrong way almost instantly, although it is quite clear that Dina can give tit for tat. After a discussion in her art honors class, students tell Jack that Dina thinks words are far less important and meaningful than pictures. Ho ho, Jack pounces on this pronto. Now, he tells his pupils, this is war and lays out a strong defense of the power of words by reading many meaningful passages of literature. An ultimate challenge of the two dueling forms of communication may lie ahead. In the meantime, Jack is told he is going to be \"reviewed\" by the board of directors and may be let go. He also is having difficulties with his college age son. Happily, Dina may be showing some romantic interest in Jack. What lies ahead in the battle of words and pictures? This wonderful and poignant movie is most welcome in this age of flicks aimed at young adult males. It offers a romance between middle aged characters and has an alluring, finely written script. Owen and Binoche are pitch perfect in their roles while the supporting cast of Bruce Davison, Amy Brenneman, and well-selected teenage actors are charming, too. The coastal setting is absolutely lovely while costumes, photography, and a worthy direction by Fred Schepisi bring terrific results. Please go support this movie, true-blue film fans. Unless you do, Hollywood won't offer this kind of movie very often.","user":"inkblot11","rank":[48,54]}]