[{"title":"Respectful, even reverential, but honest and moving","rating":12,"date":"12 January 2014","review":"This is a film that is difficult to judge simply in cinematic terms since the subject is such a titanic figure in recent history, many older viewers (such as me) will have lived through most of the events depicted, and Nelson Mandela himself - the prisoner who became a president - unknowingly heightened the interest around his life by dying just weeks before the film was released. Yet, allowing for all of this, by any standards \"Mandela\" is a success, telling a powerful story in a honest and immensely moving manner with some outstanding acting. If it is somewhat reverential, this was to be expected, given the subject and the timing.<br><br>Unfashionably for recent bio-pics, \"Mandela\" chooses not to concentrate on a seminal incident in the subject's life but to paint on a huge canvas, covering many decades and lots of political events in a linear narrative that frequently deploys news clips from the time. It is based on Mandela's long 1995 biography of the same name which I bought on a visit to Robben Island and read with great admiration. British William Nicholson (\"Gladiator\") has done a skillful job of turning such a huge story into a manageable script and British director Justin Chadwick (\"The Other Boleyn Girl\") handles a complex of ingredients with genuine talent. It looks good with attention to period clothing and artifacts and use of actual sites and some breathtaking countryside (it was shot entirely on location in South Africa).<br><br>Ultimately, however, the success of such an ambitious work rests especially on the lead actors and the casting here was inspired. Idris Elba as the eponymous hero gives a towering performance, while Naomie Harris is a revelation as the more complex and less sympathetic character of his second wife Winnie. It helps that both are not major stars - although that is now set to change - and notable that both are British actors who affect convincing accents.<br><br>This is a balanced portrayal of multi-layered characters. Mandela is represented with great respect but he is not offered to us as a saint. He treats his first wife unkindly and his support for violence is not disguised. The film really impresses with its representation of Winnie, a woman who suffered so much, hated so much, and herself caused so much injustice. Mandela is now dead but his great project - the creation of a peaceful and prosperous multiracial nation - is still a work in progress.","user":"rogerdarlington","rank":[25,29]},{"title":"Mandela movie shows his vision and conviction but also the heartbreaking consequences to his personal life.","rating":10,"date":"9 September 2013","review":"I saw this movie on Sept. 8 at the Toronto Film Festival. It was an honest and powerful portrayal of Mandela the man and the toll his striving for a better South African society took on his personal life. The movie showed how his first marriage crumbled because his wife couldn't take his long absences from her and their 4 children while his role in the ANC and the anti-apartheid movement became his greater focus. Although he explained to her that he was doing this work for all of South Africa's black people and the children who were growing up in those oppressed conditions, his own children suffered for his strong convictions for the greater good. He married a woman he truly loved, Winnie, and had 2 daughters with her. Although Winnie supported and fought alongside Mandela for the cause, this family ultimately suffered, too, when he continued his campaign with the ANC and it turned to more drastic means to send a message to the South African government. As a result of his arrest and conviction for those actions, he spent 27 years away from his young family. There were some truly heart-wrenching moments and the actor who played Mandela, Idris Elba, convincingly conveyed the doubts and regrets that Mandela felt in not being able to be with his wife and children all those years.<br><br>The movie showed this personal side of the Mandela story well. It skipped through the facts that are well known and easily accessed. This wasn't the focus of the movie. Now knowing the great sacrifices he endured to achieve the freedom he desired for all black South Africans, it made me ever more grateful for having witnessed a small part of the Mandela story. I was part of the \"Free Mandela\" movement in the late '80's and I saw him speak when he came to Toronto in 1990. Seeing this movie, with it's inclusion of live footage from that time, brought back memories of the emotions of the era, the \"Boycott South African goods\" campaign, the elation when Mandela was finally freed, and feeling the goosebumps when he spoke. He was, and is, one of the most inspiring, great leaders of our time. I highly recommend everyone go see this movie when it is widely released. It will leave you wanting to learn more about Mandela (I plan to read his autobiography bearing the same name as the movie), and maybe even go out and do your part to make this a better society too, however small the contribution. As Mandela says in the movie, \"Alone we have no power, together, we have the power to change the world\".","user":"carmenmartino","rank":[53,71]},{"title":"Excellent film. Must watch.","rating":8,"date":"23 November 2013","review":"As a 37 year old white South African, who never really saw, felt or experienced Apartheid and the way SA was back then as I was too young, I now have a much better appreciation for all the suffering, discrimination and pain that was caused.<br><br>Nelson Madela gave up most of his adult life for a cause which has now come full circle and SA is now better off for it, mostly.<br><br>A powerful movie, that shows a man more passionate about equality and human rights than his own well being, and sadly at the detriment of his own family.<br><br>I strongly recommend every single South African to watch this movie, especially our current government!","user":"grantboonzaier","rank":[52,71]}]