[{"title":"Action packed. Expected storyline.","rating":7,"date":"20 February 2020","review":"What a dumb, fun, entertaining movie this is. There really is no real story in this movie, other than an attack on the White House. Then it's just straight up \"Die Hard\" after that, and it's so beautiful to finally get to see a good \"Die Hard\" movie again. Gerard Butler plays Mike Banning, who is basically just British John McClane. And then we have Aaron Eckhart as Benjamin Asher, the POTUS and Morgan Freeman as Allan Trumbull, the public speaker. They are very good too. This is just a very dumb action movie, and those are the kind of movies that I really love to watch.","user":"MR_Heraclius","rank":[36,37]},{"title":"Dumb Hard","rating":1,"date":"31 March 2013","review":"The entire movie I kept waiting for Leslie Nielsen to show up. This has got to be a parody right?<br><br>Olympus Has Fallen is the most blatant, and dumbest Die Hard scene for scene copy that has, or more likely, will ever be made. I don't know how security cameras, sub machine guns, rocket launchers or bunkers work, but I'm sure I know they don't work like they do in this movie. This is like a really bad cover to a great, iconic song. Same words, but man, is it painful to experience.<br><br>Not only does every single actor in this movie talk with the Jack Bauer and Batman Begins gravel voice, I think this movie is racist and discriminatory too. Not even toward the Koreans, it's also downright Anti-American. Look, there's some dummies that come and go from all levels of our government, but this movie makes reality look pretty sweet because everybody in this one is freaking IQ flat lined. The FBIs Johnson and Johnson (no relation) at the Nakatomi building were smarter than anybody in this one. <br><br>Did I mention how dumb this movie is? Don't you have to Arm a missile BEFORE you detonate it? Can you evacuate 30k US troops from the DMZ in 30 minutes? Or, you know the part where they send in the Navy SEALs knowing their own weaponry will cut these brave men down and the CSA, played by Robert Forrester for payday, refuses to call them back after 5/6 helos are smoking? Wait, these guys are probably still alive, they can get out of the chopper and get the job done...<br><br>Nah, the movie lets them be dead for the sake of the script so Butler bad dude can go in there and clean house. Even though all his security codes should be revoked for the White House after 18 months reassigned. :( My head hurts.<br><br>As an American, folks, I want to publicly apologize for this thing. Also, what the heck hit that first SUV at the beginning of the movie? I still have no idea what that was. But then there I go trying to think. Everything I've been taught to do, my entire life. You know using my powers of deduction and all that education, man forget it. You'll only suffer.<br><br>Live free or Dumb Hard. With a Vengeance Harder<br><br>P.S. hashtag is shift 3","user":"adrongardner","rank":[425,589]},{"title":"I never write reviews but I have to make an exception for this one...","rating":1,"date":"12 April 2013","review":"I thought the movie would be good - 7.1 rating and excellent actors. And that's actually all, which is good about the movie. So unrealistic and playing the lowest nature of human being, I have actually left the movie theater sad and disgusted with the fact how many people actually cheered out loud during the movie.<br><br>a) A plane makes it to D.C. before being intercepted by two raptors, which get shot down and after that only ONE raptor is sent to deal with the threat. b) Disregarding the fact that half of the army would already be all over D.C. when the two jets got shot down, the terrorists are now advancing towards the White House on foot - Humvees and choppers are sent out from across the river and the humvees get there first??? c) all the SS agents just run toward the bullets d) president gets captured and the U.S. chain of command will let the nation be destroyed just because of one man e) WH doesn't use the super secret weapon to defend the premises but somehow the terrorists are able to operate it??? f) Blowing up unarmed ICBMs will destroy the nation??? g) At the end when Butler calls in that they are okay, it takes them 5 mins to get out of the building and no one is going in???<br><br>And two things are absolutely worst: 1) Cheap and cheesy nationalism that should actually make people beware is still working to stir up some pretty strong emotions, especially among those whose necks are two feet wide and heads cleanly shaved. I was absolutely horrifies how many people stop thinking when a flag above WH has bullet holes in it and start punching the air, yelling and all together start behaving like animals... It's actually pretty scary, no wonder some people were scared of garrison state after the Cold War started. We are not far from it today... 2) I wonder who REALLY paid for this crap. So cheesy and appealing to the lowest animal nature of dumb people portraying North Korea as new terrorist threat??? (To be fair in one part of the movie they had to say that people in Middle East were celebrating when seeing the WH captured) How lame and pathetic is this... Yes let's go to war with every single country that doesn't necessarily love the United States. At least from the audience I had to sit in, you would probably get good 50 volunteers for the first lines.<br><br>Absolutely appalling and scary experience.","user":"josefscharfen","rank":[544,760]}]