[{"title":"Gruesomely lovely!","rating":10,"date":"25 October 2013","review":"This low-budget supernatural action horror film is proof that you don't need a billion dollars to make a good, enjoyable, and high-end movie - worth watching on the big screen...<br><br>I've watched the movie during the \"Screamfest\" horror film festival in LA, 2013, and although I had no expectations, I was surprised by the quality of the film...<br><br>Director Michael S. Ojeda has done beautiful work - with a wonderful little tale of revenge that turns epic, artistic shots and mise-en- scene, which fit perfectly in the slasher-genre, great actor-directing, fluent and precise editing, and excellent special effects...<br><br>In my opinion, having done most of the pre-production and post- production work on his own - definitely entitles Ojeda as being a new generation \"Auteur-Director\"...<br><br>The cast was awesome, each and everyone of them, and the producers have done great work - utilizing whatever budget they managed to scrape into making this slasher a great movie...","user":"GuyDGazit","rank":[36,53]},{"title":"Under-promises, Over-Delivers..","rating":7,"date":"6 April 2014","review":"The Holy Grail of B-Class horror films is, was, and always will be to duplicate the success of productions like Living Dead, Texas Chainsaw, or Last House. That is to say, to walk into the production with only the minimum production budget (in some cases not even that); \"volunteer\" actors whose day jobs usually doesn't even include contact with other human beings, yet alone complicated dialog; and a stageset which is temporarily borrowed from existing buildings or Mother Nature, to avoid having to hire carpenters and designers. If, from these humble beginnings, you can produce something entertaining, engaging, and (Duh) profitable, you will have succeeded where many before you have failed. I have seen a lot of these, more than I like to talk about, and, I have to say, SAVAGED, written and directed by Michael Ojeda, tries hard and, although wildly uneven, succeeds much more often than it fails. The first 20 minutes or so is actually the weakest. The script initially shoots itself in the foot by making the heroine very unsympathetic to the audience. A slim and pretty young lady, deaf and mute, grabs her late father's GTO and, entirely on her own, begins a road trip into the US south-west, her only protection being her utter naiveté. If that is not cloying enough, she chances upon a Native American being beaten by some local yokels and actually tries to intervene. Within minutes (a series of fast cuts tells the tale) she is captured, tortured, raped, killed, and left to rot in a half-open grave. To that point, the film is hardly at its best. However, from then on it gets very interesting. Her more-dead-than-alive body is found by a local Apache \"witch doctor\" and he tries to bring her back, only to find, at the last minute, that the spirit of a vengeful Apache warrior has hitch-hiked back, too. Equally clever (this is told via backstory at the half-way point) is that, it turns out, the re-animation would have failed without the piggybacking spirit, so while the girl is animated and ready to party, her physical body is decaying and her time is limited. Overall, pretty clever. The story gets to play simultaneously with elements of I SPIT ON YOUR GRAVE; a lot of neat zombie-like themes, and also a riff on the iconic Graham Masterton \"Manitou\" story. And the best part of all?? From the half-way point onwards, the film actually gets better and picks up momentum right to the final scene. Boy is that rare. Most of these productions run out of money, creativity and SFX budget at that point, but SAVAGED turns it all around. Nice job. Rating 7.5 but IMDb doesn't do halfsies.","user":"A_Different_Drummer","rank":[15,22]},{"title":"Made the best out of its budget and plot.","rating":6,"date":"6 April 2014","review":"Even ideas that were used and used can still make a small impact if executed correctly. Exactly the case with \"Savaged\" where you'll see some bad effects sometimes, or better say cheap ones, a plot that was used before a few number of times, but you will also see heart, a director that wanted to make a good movie, actors that were happy to play their role, all of these resulting into a good B horror.<br><br>It has some elements from \"Contracted\", some from \"Freakdog\" or maybe \"The crow\", anyway it was a fun ride, especially that they decided to limit the torture screen of the girl and show more of her vengeance. Maybe it lasted a tad bit more than it should have, but probably wanted to offer some deepness to it all.<br><br>So all in all, \"Savaged\" is an OK movie for many horror fans out there, not limited to one exact category, which is a good thing. So whoever you are and whatever your tastes are, you should give this one a try. Especially for those looking for a nice indie movie!","user":"gothic-fiction","rank":[14,23]}]