[{"title":"Don't read unless you've seen the movie - huge SPOILER!","rating":8,"date":"6 July 2014","review":"++++++++++++++++Spoiler Alert+++++++++++++++++ Half the other reviewers just didn't get it - this is a very good movie with a trick ending that ties all story lines together wonderfully. Most of the negative reviews were written by people that missed the entire point of the movie. Without going into great detail on the three (really four) story lines this is the hook: all the story lines are simply imagined by the author character (Liam) as he composes his novel. <br><br>A prize-winning author is in Paris working on a novel, having just suffered through the death of his young son in a swimming pool accident. The movie starts and ends with him at his desk in a hotel room - the opening scene fades out with a faint \"watch me\" heard (imagined) by the author. The movie ends with the same scene, but now we know the \"watch me\" was uttered by his son just before he died in the swimming pool. We even meet his son at the end, the little boy sitting on the fountain. Everything from the opening scene to the ending scene all took place in the author's head as he sat in the hotel writing his novel. The story lines and their characters are simply the author rationalizing away his guilt for the death of his son. As he realizes that all his characters are manifestations, twisted sometimes, of his own psyche, he alters them, going so far as to entirely remove them from his novel. Thus we have the lawyer finally diving into the pool and disappearing, (as he removes her from the narrative) and slowly all the other characters just disappear, as he removes them from the book. Even his publisher is a figment of his imagination, a character created when he realized that his writing was becoming jaded, and far too close to his own life. <br><br>That's it. The key to understanding this movie is to realize that everything between the opening and closing scenes all took place in the author's head as he worked on his novel. As he came to terms with his son's death, the characters he drummed up disappeared, each created and played out as he worked to soothe his inner guilt. My two cents!","user":"nikubo","rank":[349,373]},{"title":"Third person interpretation","rating":9,"date":"9 November 2014","review":"After reading various reviews, the interpretation of the film being about Liam's Neeson's novel seems to be quite accurate. He uses the characters of his book to symbolise his guilt and the significance of 'trust' through different situations. Towards the end of the film as the characters disappear, this reinforces the idea they are only a figment of his imagination. <br><br>Mila Kunis's character is symbolic to Liam as he feels overwhelming guilt due to the death of his child. This particular situation shows what may have been Liam's life had the child lived as there is no trust, she is severely hurt and depressed as she is unable to see her son. The scene where Mila breaks the flower vases symbolises the significance of 'white' being the colour of trust and lies and she feels she is not trusted. The significance of the affair that Liam's character has is also along the same lines as this manic and complicated woman he loves only feels comfortable with married men as she can leave when she wants and she can't be hurt, the theme again being trust. Perhaps the older man she sees through the film is in fact her father which shows the complicated relationship she has had and the pain she has feel as she cannot trust men even her own father, yet she is drawn to him in need for forgiveness. As she accepts her love for Liam's character and begins to be more vulnerable to the idea of love, her emotions show her sorrow and she is finally able to say goodbye to the dependence she has for the older man and is now devoted to Liam. The American thief is responsible for his child's death and craves her voice to live on. When he is conned by the Italian woman, this again has the theme of trust as he trusts too easily and this woman will do anything to get out of the situation she is in with what looks like a non-existent predicament with her daughter. finally when the American man is out of money giving away everything he has, he must wait to see if the woman will return despite his lack of money. She does return and they are able to live life aware of each other's faults and flaws, something he needs given his role with the death of his child. This is something his ex-wife is unable to forgive him for and therefore they had no chance of staying together. He must move on.<br><br>The characters parallel Liam's life and the different paths he could have taken. From my interpretation, the affair was part of his imagination created for his novel and his wife worries that while he is away in Rome to write his novel, he may have an affair as he is a romantic. This is why she says \"is she there\" but he responds with no she isn't in a confusion of reality and the story of his novel. <br><br>The recurring \"watch me\" said by the son is driving the creation of Liam's novel as he remembers the trust his son had and the moment (may have been an accident) where he dies. *Note the idea of white being symbolic is seen through Liam's lover wearing a white dress, the flowers, the colour of milk as Mila's son convinces his father she should be trusted.","user":"Gemma-aa2","rank":[28,28]},{"title":"The kind of artistic effort we don't see enough of.","rating":9,"date":"11 July 2014","review":"This is an excellent human drama. Any of the negative reviews you see about it are basically coming from a \"dumbing down\" stance. Like . . (duh) WHY is this director trying to be so intellectooul?\" It's a damned clever piece of work, and we don't get that much any more in this age of comic book movies.<br><br>It is also VERY moving, and finely acted. Watching Olivia Wilde's character, I kept thinking, wow such a \"borderline\" case, then we find out precisely WHY she's such.<br><br>You should go see this and bring your brain with you. Don't tell anyone else what it's about or what the spoilers are, and I'm not either.<br><br>\"White\" - the color of trust, and belief, and lies.","user":"Rogermex","rank":[81,100]}]