[{"title":"Brilliant","rating":10,"date":"25 September 2013","review":"Went to an advanced screening of this film with a Q an A with Dexter Fletcher at the end.<br><br>Well what a great film, the musical scenes were really well done, and it just felt that the cast were really enjoying themselves. Good all round performances from everyone, nobody stole the show, just everybody contributed their own accomplished style. My personal opinion is that its a really hard job to produce a musical, as it can so easily look amateurish, Mama Mia succeeded, and so does Sunshine on Leith. The locations were superb, especially the closing scene where it appeared as though all of the population of Edinburgh was present and joining in.<br><br>The Q and A was very informative, and I will leave you to spot the walk on appearances of Dexter and the Proclaimers.<br><br>A great night out,, well done everyone who had a hand in this production.","user":"davidplumridge","rank":[27,30]},{"title":"A guilty pleasure, actually a guilty ten.","rating":10,"date":"4 July 2014","review":"I should hate this. I thought I would. Take a band whose music is real. A band who don't do poxy love songs. Who do great Scottish songs of independence. A band I admit to loving. Now you try to shoehorn their songs into a musical. It is going to suck. Isn't it?<br><br>Actually no. No need to critique whats wrong with this movie. Everything is. It sucks. Its terrible.<br><br>I loved every minute. Its not Momma Mia (thank God) Its not Easy Rider. But it is a really enjoyable movie. Loads of fun. Bright, lively and well worth a watch. <br><br>This is the perfect date movie. If you, like me, don't like chick flicks. If its too early to watch \"The unbearable lightness of being\". Then this is a great option. It's just good fun.","user":"gacogan","rank":[19,22]},{"title":"A roller coaster of emotions, fantastically tied in with music... Must watch","rating":9,"date":"15 February 2014","review":"If your a drab and miserable hard hearted person this film is NOT for you. Also if you don't like the music of the proclaimers I wouldn't bother. <br><br>Im 24 years of age, and watched this on an extremely personal emotional day for me and as much as it added to my tears of sadness and heartbreak at parts , it added to my laughter and joy with real cheese and then elation of following dreams and going after what you believe in, its a real pick and mix film with ultimate highs to lows.<br><br>Yes it is quite cheesy but when you have \"lets get married\" by the proclaimers thrown in you expect nothing less. I think as a fan of the proclaimers they have managed to include the music by the lads in the film without turning it into simply a \"musical\" they have balanced the music and story to a tee. music nor storyline taking over. very cleverly done. <br><br>I actually enjoyed all of the actors, and as much as I found it weird to hear other people sing the proclaimers songs I think they all done extremely well.. and how the screenwriters tied in different scenes to one song was fabulous. The only thing I did find slightly off putting was watching Jane horrocks having seen her in so many adverts dramas &amp; TV programmes with a broad English accent it was odd, BUT in saying that she done a sterling job. <br><br>As much as it isn't a blockbuster hit, its a genuine warmth hit to the heart and for that I will watch this film when ever I feel low to re inspire me. It may be not for you? It may be... but if your not sure at least take the chance.. I must admit I slightly underestimated it... so I was not left disappointed. <br><br>I rate it a 9 fab music, actors, singers and dancers and I commend the fact yes its cheesy and a roller coaster of emotions but the accents are genuine and NOT over done to the point your cringing while watching river city.","user":"caiohmesmith","rank":[12,14]}]