[{"title":"A man-child drifting through life is forced to take responsibility","rating":9,"date":"25 December 2014","review":"One of the most successful things about the movie is that after all we've seen Otto go through, when he's presented with a major fork-in-the-road life choice, the viewer may still wonder which way he'll go. The scenes with Otto and his daughter were most affecting. The daughter is the most fully-realized female character; the other women are there for Otto to bounce off of, literally and figuratively. I found myself thinking about Otto after I'd seen the movie, recalling the lows he endures, the conversation in the back yard where he confesses his feelings of being adrift, and then how he ultimately responds. For me the statement made might be summed up as \"a meaningful life derives from doing your duties and paying attention to others.\"","user":"jrozzelle-195-751097","rank":[14,25]},{"title":"I loved it!!","rating":9,"date":"18 December 2014","review":"GOODBYE TO ALL THAT explores the aftermath of the abrupt dissolution of an 11-year marriage. Blind-sided, Otto Wall (Paul Schneider) receives the devastating news that his marriage is over from his wife's, Annie's, (Melanie Lysnskey), therapist (Celia Weston). This announcement has a profound affect on, not only Otto, but the couple's precocious daughter, Edie (a delightful performance from Audrey Scott) and makes for very funny, and at times, sad consequences as Otto discovers the rapturous joys and painful pitfalls of dating and single parenthood in our modern age.<br><br>4 stars to the strong cast that also includes Heather Graham and Anna Camp. 4 stars to Angus MacLachlan, writer and director, who also brought us the beloved JUNEBUG. And lastly 4 stars to the lovely North Carolina setting.","user":"betsy-189-998421","rank":[24,48]},{"title":"The last ten minutes is to define the title!","rating":6,"date":"24 December 2016","review":"Try to expect from the film what the title signifies. Then this will be a decent film to have. As we know there's no big names in the cast, as well as from behind the camera. But the whole film discloses is what people do when their marriage fails, in order to move on. That's not it, there's a message, that it ends with, especially about the children of the splitting couple. Seems it is a nice one from that angle, though overall film is not a clever enough to attract all kinds of viewers.<br><br>When his wife suddenly breaks the news that she wants a divorce, the husband in a surprise tries his best to convince her not to, but nothing works. All the separation affair can be solved easily as they have a good understanding. So they try to move on, particularly the father who meets many women, including his old school and college mates. But what they are not seeing is their young daughter who is affected by all this. So where the story heads from there is told in the remaining.<br><br>For the first time direction, this is not a bad film. A low budget, short film with a simple storyline. Well intended film on what it wanted to say. But nothing was told straight, everything was about not being single, that means dating and sex was the priority. Only in the last ten minutes it tries to turn around. That's where the story and the title overlaps. Really the nice performances, particularly Paul Schneider, who has been seen mostly in the supporting roles. So I think it is worth a watch if you are not forcing yourself.<br><br>6/10","user":"Reno-Rangan","rank":[2,2]}]