[{"title":"The only puzzling thing about Muscle Shoals is how this story went so long without being told.","rating":10,"date":"19 April 2013","review":"Have you ever heard of Muscle Shoals, Alabama? Let me rephrase the question – have you heard an Aretha Franklin song? Have you ever grooved to Wicked Wilson Pickett's Land of 1000 Dances? Have you ever thought \"Yes Percy Sledge, that is EXACTLY what happens when a man loves a woman!\" Have you ever driven way to fast while the Rolling Stones' Brown Sugar blasted through your speakers? If you answered yes to any of those questions, then you have heard of Muscle Shoals, Alabama or at least you're heard the Muscle Shoals sound, the subject of the documentary Muscle Shoals from director Greg 'Freddy' Camalier.<br><br>In the interest of full disclosure, these are my people ya'll! I grew up just east of Muscle Shoals, also on the banks of the Tennessee River – \"The Singing River\" to the Native Americans who made their home there for millenia before Rick Hall founded FAME studios. Driven by a need to escape the crushing poverty and overwhelming tragedy that befalls him, Hall is the central figure in the story of the famed \"Muscle Shoals sound\" – well him and a group of homegrown, white as cotton studio musicians known as the \"Swampers\". These men shaped what ultimately proved to be some of the finest rock, soul, and R&amp;B America would ever produce.<br><br>Music docs can really go either way, depending on such bureaucratic mundanities as rights and clearances. Muscle Shoals is a triumph, though. All personal bias aside, present day interviews with music luminaries, expertly deployed found footage and stills, and the greatest soundtrack a movie could hope for, all make Muscle Shoals one of the finest music documentaries you'll ever see. Let the participation of such bright lights as Aretha Franklin, Wilson Pickett, Mick Jagger, Keith Richards, Bono, Jerry Wexler, Percy Sledge, Alicia Keys, Gregg Allman, Clarence Carter, and Etta James serve as a testament to the enduring magic that is Muscle Shoals, FAME studios, and that greasy, soulful sound. The only puzzling thing about Muscle Shoals is how this story went so long without being told.","user":"prettycleverfilmgal","rank":[34,38]},{"title":"Entertaining, thought-provoking, and fun.","rating":10,"date":"1 March 2013","review":"I just saw this at the George Lindsey Film Festival in Florence, Alabama -- right across the Tennessee River from Muscle Shoals. I rarely give 10/10 but this film is a gem. Photography, editing, sound values, emotional through lines, entertainment value -- this film has it all. Lots of great interviews and a kaleidoscope of personal memories from great entertainers, as well -- including Mick Jagger, Aretha Franklin, Wilson Picket, and Alicia Keys, to name just a few. This film pulls you in and puts you there, back when a handful of friends got together and made music history in their own back yards. You'll be amazed at how many number one hits came out of humble little Muscle Shoals.","user":"yorkhouse-1","rank":[22,25]},{"title":"Wow!","rating":9,"date":"19 June 2014","review":"Easily one of, if not THE best music documentary I have ever seen. So often these docs go flat after the first 20 minutes, none of that here! The visuals are fantastic and carry the show (as well as establish the sense of place) when the incredible music is throttled back. Underlying all of this is an incredible story of an incredible man, Jerry Hall, a man born in numbing poverty who somehow managed to rise above poverty and numerous personal tragedies to produce some of the most incredible blues and rock and roll recordings of all time. If you have access to this show and love music all I can say is WATCH THIS TODAY and prepared to be blown away!","user":"colvin-4","rank":[8,8]}]