[{"title":"Classic Happy Madison Film","rating":6,"date":"16 April 2016","review":"I've noticed that there are quite a few people out there giving this movie a bad review. At first, I couldn't understand why. After thinking about it, I realized that these are not fans of Happy Madison Films. There are people that noticed names like, Harvey Keitel and Dan Patrick, and thought that this was some blockbuster film or something. Then, after watching it, they leave a bad review here because they found the film to be \"goofy\" or \"stupid funny\" and not much else. <br><br>HELLO! There are plenty of Happy Madison films out there, going back as early as the 90's! You didn't know this was going to be a goof fest?<br><br>For fans of Happy Madison Films, this movie is exactly what you'd expect. A ton of laughs and a good time, with a tiny bit of poking fun at the \"Western Films\" genre. Not too much though. I'm a fan of Westerns, and I thoroughly enjoyed this movie. Compared to other Happy Madison films, it's no Happy Gilmore or Billy Madison, but it's up there. <br><br>With that being said, it is what it is. It's a Happy Madison Film. Although I love these types of movies, they don't garner more than 6 stars...... unless they're Happy Gilmore or Billy Madison. In my opinion that is. <br><br>If you're looking for a good time and lots of laughs, you've found the right film. Who knew Taylor Lautner could play such a hilarious role?","user":"ThePiousPatriot","rank":[27,31]},{"title":"i liked it, sod it","rating":8,"date":"28 June 2016","review":"If you took this seriously I really feel sorry for you. Yes Adam Sandler isn't the best but in all honesty, why are you still watching him in the first place? There must be some sort of draw to him. Kind of like how most people feel with Nicholas Cage. there must be some kind of redeeming factor.<br><br>Anyway I personally loved it. Granted I like a lot of terrible movies. I just really really liked this as far as Adam Sandler movies go. Basically put, if you like Adam Sandler at all here and there, give this movie a go. If not, then why are you reading this review of it in any way, shape or form. It gets my recommendation as far as dumb comedies go. That is all. Gbye m8s.","user":"gamertrashed-4323","rank":[54,68]},{"title":"Just go with it.","rating":10,"date":"6 January 2016","review":"This movie is just stupid fun. It isn't trying to be the great American Western, and it doesn't take itself seriously. The cameos are great, and the acting is superb. Just suspend disbelief, have a glass or two of wine, and enjoy the journey. It is great to see Jorge Garcia in film again, His comedy chops are on point. This movie came recommended from a friend, after watching the first few minutes, I wasn't sure it would hold my attention, I am so glad I stuck with it. I haven't laughed this hard in a long time.<br><br>P.S. Rob Schneider really deserves a role that could bring him an Oscar, he is an awesome actor.","user":"castarling","rank":[22,29]}]