[{"title":"Kaufman's Bleak Outlook on Life and Human Relationships","rating":8,"date":"15 July 2016","review":"Every time I see a Charlie Kaufman film I'm reminded how fearless he is at examining the human condition and why I need to put a lot of time in between watching his movies.<br><br>In \"Anomalisa,\" his Academy-Award nominated animated film, David Thewlis and especially Jennifer Jason Leigh do tremendous voice work as an emotionally ill minor celebrity and the shy, awkward woman with whom he enjoys a one-night stand while at a conference at which he is the speaker. The film is an examination of middle-aged male discontent and loneliness, a subject a younger version of me was always impatient with and which the 41-year-old version of me now finds hits uncomfortably close to home. Kaufman creates a sad character who has many unpleasant tendencies but isn't necessarily a completely unpleasant man, and allows us to see how this one night in the man's life and his approach to human relationships is a stand-in for his entire adult life and the driving force behind his depression.<br><br>As in his masterpiece, \"Synecdoche, New York,\" Kaufman refuses to give in to the convention of happy, or at least hopeful, endings, and suggests that it is possible to live an entire life being utterly miserable if you don't possess the resources to do otherwise, a terrifying idea to anyone who has struggled with depression, anxiety, or even just prolonged bouts of general malaise. In so many Hollywood movies about unhappy people, the unhappy people just need the emotional connection to that one special person that shakes them out of their funk and changes everything around for them. One of the things I liked best about \"Anomalisa\" is its suggestion that, while those special people really do exist, happiness in any one person is something that has to come from inside and isn't going to be imposed on one by another. It isn't comfortable to think about the possibility of life being a long series of missed opportunities, but it feels honest.<br><br>Grade: A-","user":"evanston_dad","rank":[42,49]},{"title":"Offers a real insight into the human soul","rating":9,"date":"7 August 2016","review":"It's been 8 years since Charlie Kaufman's directorial debut, Synedoche, New York - that great but under-appreciated little film about a man (the late Philip Seymour Hoffman) who dreamed of building a scale model of New York in a warehouse. The critics seemed to like it but didn't voice their approval very loudly, and chances are many won't remember its existence. Funded by a Kickstarter campaign, Kaufman's latest is a stop-motion collaboration with Duke Johnson, an animator probably most famous for his Adult Swim works.<br><br>Beginning with mundane chatter in mundane locations, Anomalisa is in no rush to hit you with any visual splendour, which tends to be the norm for animated films. Instead, we follow our miserable protagonist Michael Stone (David Thewlis), a British motivational speaker whose book on customer service is the handbook for those unfortunate enough to be in the business, as he lands in Cincinnati. He grabs a cab ride with an annoying driver who seems to be completely unaware of Michael's depressed, frustrated state, and insists he visit the zoo and tries to Cincinnati's famous chilli. He arrives at his hotel, the Fregoli, where he is unnecessarily escorted to his room by an over-friendly bell boy who informs him of the delights of his standard, mediocre room.<br><br>It's probably at this point that you'll realise you haven't been imagining that all the characters look and sound alike, and instead that this is a deliberate tactic key to understanding the mindset of Michael and the themes of the film. The name of the hotel is a clue, as the Fregoli delusion is a condition that causes a person to imagine everyone else to be the same entity in disguise with the sole purpose of inflicting torment on the sufferer. Here, everyone has the face of an adult white male (even the women and children) and has been blessed with the soothing, distinctive voice of Tom Noonan. It is only when Michael stumbles upon two women in his hotel who are there to see his speech the following day that this spell is broken. One of the two women, Lisa, has a barely noticeable facial disfigurement and sounds like Jennifer Jason Leigh, and Michael is enamoured.<br><br>Michael's relationship with Lisa, who be dubs 'Anomalisa', gives the film a much-needed heart, as this may have otherwise been an exercise in misanthropy. There's no fantasy romance here, but a dinner date where everyone involved drinks too much, Michael's awkward invitation for Lisa to accompany him back to his room, and a sex scene which is, ironically, the most realistic I've ever seen on film. Michael accidentally rolls onto her hair, she bangs her head, he asks her the awkward question of whether she's cool with oral sex - there's certainly no pan to a roaring fireplace,<br><br>You would think that the heightened sense of realism would make the choice to film this in stop-motion slightly redundant, but oddly, it makes the film even more human. It also allows Kaufman and Johnson to show much more of life's ugliness - we are treated to Michael's middle-aged stark naked body jumping out of the shower and the sight of a random man across the way getting ready to masturbate in front of his computer. It's often difficult to sit through. I work in customer services myself and can empathise with Michael's internal struggle of feeling trapped within himself and that others are barely distinguishable from one another. Don't expect any tidy resolutions either, Kaufman is intelligent enough to realise that the excitement of meeting an interesting girl is only temporary, and life will still go on. It's upsetting, certainly, but Anomalisa offers a real insight into the human soul and makes a lasting impression.","user":"tomgillespie2002","rank":[49,60]},{"title":"Abstract Anomaly that Doesn't Quite Cut it","rating":6,"date":"31 January 2016","review":"Reviewed by: Dare Devil Kid (DDK)<br><br>Rating: 2.5/5 stars<br><br>'m a bit mystified by the accolades of \"masterpiece\" that are being heaped upon \"Anomalisa\", a stop-motion animation drama co-directed by Charlie Kaufman and Duke Johnson. It's a unique film, no doubt, and one that takes a lot of risks and has a number of scenes that work quite beautifully. It has the mordant, awkward bits of humor and wry observation we have come to expect from Kaufman, but not the insight; it's all surface, which is inadvertently personified by the artifice of the stop-motion animation. The film is supposed to tell us something about human relationships and the conflict between our ideals and our reality, but it's all muddled, which is what makes its near universal praise by critics so bewildering. Kaufman has certainly earned his share of deserved praise for his inimitable, boundary-pushing screenplays for Spike Jonze's \"Being John Malkovich\" and \"Adaptation\", and Michel Gondry's \"Eternal Sunshine of the Spotless Mind\". But, he's also hit a few critical bumps along the way, including an earlier collaboration with Gondry, \"Human Nature\", and his directorial debut, the unmitigated mess \"Synecdoche, New York\". \"Anomalisa\", while not quite like the latter, isn't also anywhere near to the quality of the former.<br><br>The majority of the film takes place in a nondescript upscale hotel in Cincinnati, where Michael Stone (voiced by David Thewlis), a published customer service guru on the lecture circuit, has just arrived. Though a conventionally handsome man in his early 50s who is clearly successful professionally and financially, Michael joins the ranks of miserable Kaufman protagonists whose lives are constantly running aground on their own ennui. Potential redemption arrives in the form of Lisa Hesselman (Jennifer Jason Leigh), a conference attendee he meets at the hotel and to whom he is instantly drawn. Severely lacking in self-esteem and poignantly awkward, Lisa is not the conventional object of male desire, but that is precisely what makes her so fascinating (and Michael's attention so surprising to her).<br><br>The film is irrefutably a technical marvel, spectacularly illustrating how stop-motion animation can be just as physically and emotionally convincing as any other medium of human expression or technical wizardry. The puppets, which were individually designed and printed using 3D printers, are amazingly lifelike - almost, but not quite, to the point of being uncanny. They stay just this side of the uncanny valley, never venturing toward that precipitous drop- off where animation that is too lifelike becomes weird.<br><br>The problems with \"Anomalisa\" stem from the two main characters, starting with Michael, who is such a miserable, self-absorbed mope that it's virtually impossible to sympathize with him. Michael's physical mundanity belies the intensity of his narcissism, which keeps him from connecting with anyone and ensures that he remains miserable and alone, even when surrounded by others. Early on in the film, we become aware that all the other characters — from a chatty cab driver, to the hotel bellhop, to Michael's wife and son and ex-girlfriend - all have the exact same voice (Tom Noonan's voice, to be exact). It's a clever, albeit potentially confusing, means of conveying the sameness with which Michael views everyone around him, which is heightened by the fact that all the faces on the puppets playing the other characters are oddly similar, as well. The key is the name of the name of hotel where Michael stays: the Hotel Fregoli, a reference to the real- life, but extremely rare Fregoli delusion, a psychological disorder in which a person comes to believe that different people around him are actually the same person in disguise. We aren't meant to think that Michael actually suffers from this disorder (although he says several times that he feels like something is wrong with him psychologically); rather, it plays as a kind of metaphor for Michael's interpersonal isolation, which renders everyone around him a single, undifferentiated mass to whom he cannot connect.<br><br>Except Lisa. When he hears Lisa's voice, he recognizes her as fundamentally distinct from all the others and immediately seeks her out. Jennifer Jason Leigh does a fantastic job voicing Lisa, and she makes her the most interesting character on-screen (which she is clearly meant to be - a lovable oddball). But, the film stalls emotionally because there is never any depth or meaning to Michael's intense attraction to her. The film is resolutely concrete in depicting his depressive moroseness, but then it gets all abstract when it comes to his propensity for love, which throws everything off-balance. Thus, even the film's most touching sequence - a rather graphic sex scene that plays fair with the inherent awkwardness of two people who barely know each other suddenly getting intimate - doesn't ultimately work because it has nothing emotional to connect to except an idea. Thus, it works in isolation, but not in concert with the rest of the film.<br><br>The fundamental problem with \"Anomalisa\" is that it's little more than the story of an unsympathetic narcissist assigning his piece of mind to a good-hearted oddball. As a romance, it doesn't work because we just want Lisa to get away from Michael lest he drag her into his sad- sack pit of despair. As an interpersonal cautionary tale it doesn't work because the film's attitude toward Michael is so vague. Had it been more clear about what we were supposed to make of his relationship with Lisa - is it a genuine spark of compatible souls meeting at the wrong time or is Michael just a myopic, misguided jerk with no idea of what he wants - then \"Anomalisa\" might have registered as something more, even if it were just an indictment of its protagonist. Alas, it ends up as a stew of potentially interesting ideas brought to life with amazing artistry that can't quite hide its hollow core.","user":"DareDevilKid","rank":[76,99]}]