[{"title":"Intriguing","rating":5,"date":"26 November 2016","review":"First of all, I just can't believe that this movie was based on a true story. It left me captivated to a point of going back to do research on the real story. I wanted to see pictures of these people in person. I just had to laugh while reading some of it. <br><br>After doing research on the real story, I found the movie to be very balanced in that it tried to find a humorous way to tell the story. I think that they actually pulled it off. Was it laugh out loud comedy? No...but entertaining, Certainly. It isn't something that I'd ever watch again, but I didn't feel as if it were a complete and total waste of time. There were a few funny moments and in some moments, I even felt sorry for the main character. It will definitely hold your interest. Worth a movie rental.","user":"msqua02","rank":[39,49]},{"title":"Hilarious!","rating":8,"date":"20 November 2016","review":"I loved it! I haven't laughed this much since Due Date with Robert Downey Jr; in fact I laughed even more during this. I read some very negative reviews on here about this and all I can say is that if you don't have a sense of humour for slapstick comedy then don't leave a negative review because of it.<br><br>An innocent guy working as a security van driver gets talked into robbing the company he works for by an attractive ex-employee that he has a real crush on. He thinks they're going to be living together, happily-ever-after, once all the heat has settled, but things don't quite go to (his) plan.<br><br>There are so many hilarious moments in this film and the rest is all pretty humorous, as well. It's comedically brilliant, fast paced, intelligently written and an all-round good film. Not a dull moment. Give it a go and DO NOT listen to any (\"meh, so-so\") reviews with less than five stars. One reviewer said it's the same kind of humour as Airplane and Naked Gun. It's not!","user":"michaelant555","rank":[88,124]},{"title":"The true story is more interesting than the movie","rating":3,"date":"27 December 2018","review":"There is something off with Masterminds. It just feels slightly off-kilter when it comes to the acting, the editing, the story and the humor -- and not in a good way. It's almost funny, but not quite. I don't recommend watching this half-baked comedy, but the true story it's based on is interesting.","user":"cricketbat","rank":[6,6]}]