[{"title":"Of Vets and Wolves","rating":8,"date":"22 November 2014","review":"I always loved grumpy old guys in films, and after Eastwood's Kowalski there was little left to desire...till Damici's Ambroze Mckinley stepped into the picture in Bogliano's latest feature.<br><br>Bogliano's something of a curious case, he never limits himself to one or two subgenres the man does it all. Secretly though, he loves comedy! So Late Phases are laced with subtle and quirky comedy aspects, it never takes itself too seriously. Normally, the abundance of humor in a horror flick is major offense by me, but here, it simply works.<br><br>Elderly, blind vet moves to retirement community on the edge of a forest to spend the rest of his days in peace, but as he quickly learns, there's trouble lurking in front of residents' lawns killing them quickly and efficiently.<br><br>Ambrose McKinley doesn't waste too much time investigating, instead he instantly figures out the root of this evil and does his own prepping in order to face the threat. And so it goes....small close knit community shows its true colors and Ambrose gets the chance to face the enemy in no time...<br><br>Cheesy creature feature, far and between but loud and clear gore don't sound inviting? How about Tom Noonan in supporting role - the trade he's mastered during his long career? Great cinematography, perhaps a bit off pace now and then, but patched up and ready to proceed with good action sequences and surprising dynamics withing community. I'd call this a throwback although the cinematography is authentically modern, effects, creature feature and humor resemble 80's flicks.<br><br>Weird, offbeat but never dull, this is quite original werewolf film, first remarkable wereflick after Ginger Snaps, in my opinion.","user":"Shadowplayed","rank":[25,30]},{"title":"Surprisingly Entertaining","rating":8,"date":"28 February 2015","review":"I say surprisingly entertaining, because at first I thought this was going to be campy. I am happy to have been wrong. This was a very enjoyable Werewolf film.<br><br>A full cast of recognizable faces, some I was shocked to see again. A couple I had to look up, because I knew them, but I couldn't remember from where, and then it was a cool \"Oh YEAH\" discovery.<br><br>This is a movie that I wish would've had a bigger budget, as the effects could've used some more attention, BUT, too much budget would've sent this to CGI, and that would be bad. Robert Kurtzman and company did a really good job with the make up and creatures, but the story was so good, I would've liked a little more.<br><br>And about the story, VERY cool original idea, this kept me watching from beginning to end, with a smile on my face. I've seen so many films in this genre that I am very jaded, and very biased, but this one, this one was fun. Good Job to all involved!!","user":"crdnlsyn13","rank":[24,29]},{"title":"A Powerful Release From Dark Sky","rating":7,"date":"3 March 2015","review":"Wounded war vet Ambrose (Nick Damici) moves to a place where people are dying from mysterious circumstances.<br><br>This is the most pleasant surprise in the horror genre in quite a while. Although a few films have caused a bit of a stir (including \"The Babadook\" and \"Starry Eyes\"), this may turn out to be the sleeper hit of 2014 when word of mouth begins on the DVD release.<br><br>Werewolf films are few and far between, and good ones are even more rare. Although Universal tried to reboot \"The Wolfman\" a few years back, it was hardly appreciated. The last great wolf film was probably \"Dog Soldiers\" (2002), now more than a decade ago. \"Late Phases\" now takes that spot as the last great wolf film.<br><br>Leading the way is Nick Damici, who makes a very believable blind veteran. If these sort of films won awards, Damici might even be a strong contender. Horror fans ought to know his background, too: mentored by Michael Moriarty (a Larry Cohen regular), Damici came into the realm of Jim Mickle and Larry Fessenden (who produced this picture). He tends to be the less-often-mentioned part of this team, but should be mentioned in the same breath.<br><br>Then we have an excellent supporting cast: beyond Damici and Fessenden, we have Ethan Embry (\"Can't Hardly Wait\"), Tom Noonan (\"Manhunter\"), Tina Louise (\"Gilligan's Island\") and even Dana Ashbrook (\"Twin Peaks\"). The strongest supporting role is filled by Lance Guest (\"Jaws: The Revenge\"), as the connection between Ambrose and the local church.<br><br>The effects are solid, with both Bob Kurtzman and David Greathouse constructing the creature. Greathouse even wears the costume, apparently. Mix this with a plot that is entirely original (with a nod or two to classics like \"Silver Bullet\") and you have a winner.<br><br>Oddly, reviews are mixed. Shock Til Your Drop says the film is \"obviously going for the Bubba Ho-Tep vibe\", a contention that is flat-out wrong. Other than this being a community of elderly folks, there is no similarity. They might have said \"goes for the Cocoon vibe\" and been just as wrong. Bloody Disgusting properly called it \"a masterpiece of the werewolf genre\".<br><br>Director Adrián García Bogliano may not be well known, but after \"B is for Bigfoot\", \"Here Comes the Devil\" and now this, horror fans better take notice.","user":"gavin6942","rank":[26,35]}]