[{"title":"Great Piece of American History - Well Worth Seeing","rating":10,"date":"8 July 2013","review":"My daughter and i saw this movie a few days ago. We loved it. It is a great period piece exploring Northern opinion during the Civil War. One town in the North (upstate New York), is divided between Southern sympathizers and fervent abolitionists. Note that this is not a war movie in the traditional sense of the phrase. No great battles are depicted and no leading generals are in sight. This is a political and emotional story of the war on the homefront.<br><br>All of the characters are well drawn and express their views without restraint. The movie is built around a love story between a boy (Casey Thomas Brown as Casey Brown) whose father (Billy Campbell as Abner Beech) opposes the war and a girl (Lucy Boynton as Esther Hagadorn ) whose father (Angus Macfadyen as Jee Hagadorn) is a religious abolitionist fanatic. The boy volunteers to join the army, along with many other young men from the town. With the young men off at war, conflicts threaten to tear the town apart and in some respects do.<br><br>The war itself is far away, but shows up as casualty lists are posted in the newspapers (and eventually as the dead and wounded return). The scenes of family members scanning the lists of dead, wounded, and missing looking for their sons, brothers, fathers, etc. are as sad, as they historically accurate.<br><br>The battles in the town end with both tragic and positive consequences. The movie if beautifully filmed and well acted. A great piece of American history. Well worth seeing.","user":"pschaeffer-733-922861","rank":[15,22]},{"title":"Gorgeous film with a great message","rating":9,"date":"28 June 2013","review":"This film is a treasure. It touches on themes that are as relevant today as they were in 1862 and whilst the tone is somber, the story is uplifting.<br><br>Well acted, beautifully filmed and not too long with a great deal of depth. This is a film everyone should see for both the overt and underlying messages regarding political fanaticism and the reprisals of not 'loving thy neighbor.' We agreed that this is by far the best film we've seen all year. Hopefully the Academy will take notice.<br><br>If you only spend your money on one film this summer - and are the type who wants to come away from the theater really pondering what you've just witnessed - this is the film for you. <br><br>9/10 (I would give it a 10, but I don't ever give any film a 10 as I have heard that IMDb doesn't count the 1's or the 10's in the meta-scores.","user":"jedimastercheryl-173-135766","rank":[18,28]},{"title":"good civil war era movie and better yet if you are a fan of those period movies","rating":7,"date":"8 April 2014","review":"before i watched this movie, i knew already that the director of this movie had also directed 2 very well known civil war movies, 1.gettysburg 2.gods and generals. both of those movies are very well known and focuses mostly on battles and strategies. this movie focuses totally on the civilian side and thoughts on the war. there is not one drop of blood spill in the making of this movie.<br><br>if you are a fan of movies with all dialogue and beautiful country scenery and also a period piece then you are in for a treat. this movie does not have any A-list actors or actresses and is an ensemble piece, but there was not one bad piece of acting in this movie.<br><br>the movie happens far far away from the battlefields and is instead situated in a town in upstate new york during the culmination of the American civil war. it showed that not everybody in the north share the same feelings about the war. in fact the title of the movie itself \" Copperhead \" means a person living in the north that is opposed to the war for whatever reason.<br><br>very very good ensemble acting, with one powerhouse scene done by the young actor Augustus Prew. what a remarkable young actor...he's one of the main characters in this movie but it was like he was there but not really there and i don't want to spoil it but he made the whole movie. the movie would have been good without him, but he put the oomph into the movie. what he did in the end is pure cinema magic and remarkable for so young an age. Augustus plays the son of the crazy preacher and brother of the schoolteacher Esther.<br><br>i am surprised this did not get any Oscar consideration...but then again not, because the director is not one of Hollywoods darlings even though he makes really real and good movies.","user":"bcheng93","rank":[7,10]}]