[{"title":"A Spy is Never Out of The Game","rating":7,"date":"19 September 2014","review":"(NO SPOILERS)<br><br>When I first heard about the \"November Man\" I was exited to hear that Pierce Brosnan would be doing another spy/action film, since its been 12 years since his last Bond adventure. But after seeing the trailer and hearing some reviews I was afraid this would turn out to be like Stallone's \"Bullet to the Head\" and be a bit of a flop.<br><br>However, \"The November Man\" is not only a very exiting spy movie, but also is an entertaining action movie as well. It has a perfect blend of slow burn espionage and gritty fight sequences that earn the film its R rating. It's plot is based off of Bill Granger's \"There Are No Spies\" and for the most part flows steadily throughout the run-time. My only major gripe is that one or two scenes could have been cut out entirely and it would not have affected anything.<br><br>There are a decent amount of action sequences in \"The November Man\", mainly gunfights, fist-fights, and one or two car chases. Instead of having a few longer and more drawn out action scenes, the film has many short burst type scenes, no longer than 3 or 4 minutes. The camera work and cinematography is different, but steers clear of that frustrating shaky cam that is seen in so many modern action movies. My one and only problem with the action was the usage of CGI blood and flares, However, everything else is done for real, it was great to see a film that does not rely on computers and just does stuff practically.<br><br>I did not have any issues with the performances of the cast, Brosnan, Kurylenko, and Bracy were all believable in their parts but did not provide anything that blew me away.<br><br>So, \"The November Man\" is a good spy action/thriller movie, with a decent story packed with twists and turns, along with enticing characters, but what sold this movie for me was it's action sequences, that were done (for the most part) practically. I would recommend seeing it for anyone who was a fan of Brosnan's time as 007 or just enjoys action films.","user":"wolfrarw","rank":[91,108]},{"title":"Not as bad as some guys reviewing here are telling you","rating":6,"date":"27 September 2014","review":"True, the plot is predictable to some degree and the movie is definitely not Bourne or Casino Royale (2006). This doesn't mean that is trash, though. There are lots o middle places between a master piece and an totally awful movie.<br><br>One of the main problems is that in a couple of moments the information is delivered in a sloppy way and this creates some momentary confusion on the viewer. But it doesn't last long. There are also some scenes that stretch too far the disbelief suspension that any movie of that kind invariably asks for. But if you can look past those flaws, you will be entertained by a movie that delivers. Brosnan does his thing, there are good action scenes, got some decent plot twists, acting is average...<br><br>Don't get put off by the haters. All in all, a decent spy flick. Just keep your expectations at a mainstream level and you won't be disappointed.","user":"salsiga-713-60558","rank":[74,90]},{"title":"I think some reviewers watched another film.","rating":8,"date":"5 November 2014","review":"The last film I saw Brosnan in - Love Punch - was almost as bad as Mama Mia. What was he thinking? Apart from Daniel Craig, I like him as the best 007. So, having read some of the reviews on IMDb I had very low expectations.<br><br>However, this is a good film if you like Brosnan as the secret agent. I don't understand why some reviewers don't get the story. It's pretty simple to follow even though the end is half expected. He is gritty enough (just) with the couple of scenes of him drinking not quite making the cut. The action scenes were quite good and Olga Kurylenko added the eye candy.<br><br>So, I disagree with the haters. This is definitely worth a watch.","user":"joffday","rank":[117,146]}]