[{"title":"I'M GOING TO BEAT THE SLUT OUT OF YOU!","rating":8,"date":"16 April 2018","review":"Janie (Alexa Vega) is a brainy young lady attempting to get a scholarship at a prestigious graduate university. Her roommate Dee (Spencer Grammer) is a \"slut\" who enjoys her vices. These polar opposite women compete to sell their eggs, a completion that evolves into a knock down, drag out cat fight.<br><br>We have all seen those horror films where there is a psychotic roommate who emulates the other one. I can think of four off the top of my head. However, in this movie, both the women believe the other one wants to emulate them, and they go out of their way to \"help\" the other one by destroying their lives all from the inside of their home (low budget).<br><br>The production is not a horror/thriller film, but rather a dark comedy. If you have seen 3-4 roommate type film, you should be able to appreciate this one.<br><br>Guide: F-bomb. brief sex. Male butt nudity.","user":"nogodnomasters","rank":[2,2]},{"title":"Positively surprising. Its ironic, symbolic, funny and ever so dysfunctional. It's really good.","rating":6,"date":"25 June 2016","review":"Well. I had a positive vibe when first putting this on and I gotta say. I'm positively intrigued by this movie. <br><br>We got 2 roomies, living together and trying to change one another frequently. Critiquing one another, thinking one knows better than the other and it makes for wonderful entertainment, good replay value and all together a nice fun to watch. <br><br>The acting is okay, as the film highlights itself: \"Lead character says: I believe in clichés\" this film is certainly that, but not so in a bad way. Which to me is a breath of fresh air considering a lot of garbage I've seen lately. <br><br>However this doesn't fall in that category for the reason that the setting, story and development of the plot is actually interesting whilst also being comical. Funny considering based on its selected genre \"Thriller\" and its poster, portraying Vega so spooky, the film itself is not entirely like that. Something I'd usually dislike but not here. <br><br>These two women represent 2 large parts of our late modern society. The conformists, and those who try to run their own show, wanting to stand out. And putting them together is bound to create a spark. (And that right there was a pun to those who decide to see the movie. Not to mention its legit symbolism of the many conflicts we see everyday. How we should live, who's not living properly, who's not mainstreaming)<br><br>Both girls are giving excellent argumentation as to why they are correct in choosing their lifestyles, whilst the film gets increasingly violent and hostile. The atmosphere is great because it remains comical at the same time, yet it does at no point become entirely ridiculous. because I couldn't help to notice these many symbolic gestures which were very appropriate from an artistic point of view when looking at Late Modernism. The ending is a real work of art, yet a bit surprise. <br><br>They end up connecting over something that would usually kill them but its structured, alongside the rest in a way that it encourages balance in life. <br><br>What usually would kill you wont, if you just do things a little bit, instead of being so extreme and radical. And this kind of thinking, put into the perspective of this film truly makes it really good in my opinion. <br><br>Of course if you choose not to overthink it you got a big cat fight on your hands, where two chicks are hating on each others lifestyles and that gets increasingly ugly. But there's more to this if you think, as you watch :) <br><br>I liked it, guys. And I'll definitely watch it again. Great fun, good ending, yet controversial considering. I wont spoil the ending because that was one of the cool surprises after seeing it. <br><br>Adding to the bi-polar aspect this film not only includes within its characters, but also in its plot itself. Because this ending highlights how when you least expect it, your world will be turned upside down. Cognitive dissonance all the way. :) <br><br>But yes. Good film. 6 out of 10. Its above average. Kind of film I'd get on DVD and enjoy when I feel like watching something okay and interesting. Decent replay value due to its setting and progress. 90 % of the film is inside their house where everything unfolds and its just all about character development and the spark between the two that gets increasingly volatile. I love movies like this.<br><br>Good movie if you have an open mind and don't expect a masterpiece. There's room for ordinary, above average movies too. And this film is one of those.<br><br>I feel like saying more but I not sure what, which highlights that its just one of those gems that don't have all that much to it. But what it does have...is good. And I personally appreciate those rare occasions where we can get an hour and a half movie that isn't rushed, annoying, stupidly cliché or just boring.<br><br>It's my opinion that this film is one of the good ones. Go give it a watch. It might not be worth a cinema trip as such but on DVD or a rental it's definitely good entertainment.","user":"angiris","rank":[5,8]},{"title":"Who wouldn't want to be roommates with Alexa Vega!","rating":6,"date":"12 October 2016","review":"Going into this film I was expecting a serious horror film or thriller. On the other hand, the film might be a mixture of genres. Sometimes the film feels like a comedy, sometimes like a drama, and sometimes like a psycho thriller. In the case of Roommate Wanted you have a better than expected film that is a lot of genres in one big blender. <br><br>The film can be best described as a dramedy about mismatched roommates who hate each other. You might be thinking to yourself that this does not sound like horror and you would be partly correct. However, when the film goes to the extreme it gets EXTREME. The film benefits from strong performances and from the fact that although it is a small movie, it looks great. The performances are really good. Honestly, the performances are the best part of the film. Alexa Vega is more than just a pretty face. She is talented, tough, a good actress, and I wish we could see her in more films. I also thought how even though there are only two real main characters, you can connect to them both. Meaning you can relate to both Alexa Vega's character and Spencer Grammar's character.<br><br>What I didn't like about the film is the writing is a little off. Meaning, the script feels like there are parts that drag, feel like filler, and at times doesn't know what it wants to be. <br><br>So these are my final B*tchin' Buddha thoughts on Roommate Wanted (2015). It is a film you are going to like, or a film you are going to hate. I honestly do not see too many people loving this, but I do see someone liking this. If you are looking for a simply minded horror, thriller, comedy, whatever it is. I think you will be pleased. I believe this film earns a<br><br>6 out of 10.<br><br>This review is brought to you by Boogie Buddha, and remember don't just get down, but get Boogie. Thank you for reading and or viewing, and I hope you all have an amazing day and night as always. :)","user":"NileFortnerBoogieBuddha954","rank":[3,4]}]