[{"title":"Cool black comedy - don't expect anything artful or serious and you're in for a fun ride.","rating":7,"date":"6 December 2013","review":"I just watched \"The Family\" and I for one have had a very good time. This movie is gleefully dark, wickedly funny and offers great acting from all the stars involved, (who really seem to relish their parts). I was shocked when I checked IMDb and found so many comments and reviews from disappointed film fans. How can anyone complain about the violence in this dark comedy and at the same time love films like \"Fargo\" (or practically anything by the Coen Brothers, for that matter)? I came to the conclusion that the main reason behind all the negative reviews is that people expected something more akin to \"Léon\", \"Goodfellas\" or \"The Godfather\" (where the violence isn't played for laughs), when in fact this is something completely different: This is a black comedy about a group of predators who have to hide among - unbearably arrogant - sheep. You can imagine how well that will turn out (for the sheep). Anyway, I admit that with other actors involved, this would probably just have been an average mob comedy, but with the kind of talent you get here, it's hard not to have a blast. My rating: 7 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[103,138]},{"title":"Watchable","rating":5,"date":"17 January 2014","review":"The Manzoni family is in Witness Protection in Normandy, France because Giovanni Manzoni (Robert DeNiro), who is now Fred Blake, ratted out the Luchese mob family. Don Luchese (Stan Carp), the old Don, now in jail, needs to find Giovanni to whack him. <br><br>This isn't exactly a comedy, not so much a drama, not really a thriller and I would say it's light drama with comedic overtones, although I didn't experience many chuckles. It's watchable and kind of enjoyable until we get 16-yr old daughter Belle (Dianna Agron) viscously beating up on a classmate with a tennis racket. Later Fred Blake takes a baseball bat to a local plumber. And, still later Fred beats up on the manager of a water distribution facility. The viciousness of the beatings were too extreme for this movie and went too far in my opinion. It was like watching someone beating a dead horse. Not good. <br><br>Fred's wife, Maggie (Michelle Pfeiffer), blows things up when she gets upset. I guess old habits are hard to die when one is attached to a mob family. <br><br>On a less violent side, the son, 13-year old Warren Blake (John D'Leo) gets involved at school with black market cigarettes and prescription pills. See, the apple doesn't fall far from the tree. <br><br>Then we have FBI Agent Stansfield (Tommy Lee Jones) whose job it is to protect the family. Later he learns that Fred is writing the story of his life and if that ever got out well<br><br>The acting by all is fine, but you somehow get the idea that all is not as serious as it really is. In other words the door is left open for somewhat comedic comments. <br><br>The interactions among the family are good, supportive and genuine. They have each other's backs and that will be needed when Don Luchese's men find the family. You didn't forget about them, did you? (5/10)<br><br>Violence: Yes. Sex: Yes, Belle and her tutor teacher against a door. Nudity: No. Language: Yes, the kids too.","user":"bob-rutzel-1","rank":[16,22]},{"title":"\"F**k\" is a great way to describe this one","rating":7,"date":"22 November 2013","review":"Wow, I just left the movie theater and I am shocked about the amount of bad reviews this movie had. I am a kind of huge fan of Tommy Lee Jones and Robert De Niro so perhaps my opinion about this movie is a bit influenced by that. Despite that, I must confess I truly enjoyed this movie. It was funny and it was very interesting to see how the family get used to an all new identity every time they had to move in. The plot is basically about a family, the Mazonis, that was relocated to Normandy under the witness protection program. So they had basically to try fitting in soon to avoid being caught by the mafia members who were trying to kill them. Michelle Pfeiffer and Robert De Niro were really great playing their characters and despite not being an excellent movie, \"The Family\" is enjoyable and is another great addition to Luc Besson's career.","user":"TiagoRicardo","rank":[117,200]}]