[{"title":"An emotionally good insight to mental health on the edge of society","rating":8,"date":"15 April 2017","review":"This is an emotional drama about a 15 year old boy, Richard, who has learning difficulties, he lives with Polly, his brother? he is a pikey/gypsy? with a liquid diet. They are struggling to live in in a small dilapidated caravan on a farm that has just been sold to new owners. Richard lives in his own world while Polly scavenges for work where he can. Richard's best friend is a Chicken called Fiona, his other friends are dead (roadkill) animals. Then along comes the daughter of the new owners of the farm, Annabell who befriends Richard. The performances by Scott Chambers -Richard, Yasmin Page -Annabell and Morgan Watkins -Polly are quite remarkable and show promise as future great British talent. This really touched me on a personal level and I couldn't hold back the tears at the end. A beautifully sad story, well worth seeing.","user":"gazmar62","rank":[13,15]},{"title":"Don't chicken out on seeing this one.","rating":9,"date":"6 April 2017","review":"What a marvelous emotional film this is , riveting from the beginning to the end. Scott Chambers plays Richard a fifteen year old lad with learning difficulties who talks to alive and dead animals with a chicken being his best pal. and what a part he plays so well.<br><br>He lives in a dirty run down caravan with his bullying brother Polly , who is under pressure seeing to him every day. but Richard is such a nice lad you can't help but like him , when he does daft stuff,but when he makes a friend in a wealthy rich girl whose family own the land that they are living on in their caravan things look up a bit for him.I won't tell you much more about this film only to watch it , as the acting is first class from everyone in it. I gave this film a 9 out of 10 and that's a huge score from me , but the film deserves it.","user":"hunsletramone","rank":[9,10]},{"title":"All good things come to those who wait","rating":8,"date":"18 April 2017","review":"That's not an a review of the plot line, more the need for the viewer to persevere. My initial reaction after the first few minutes was to switch it off. I found it difficult to understand what the 2 brothers were saying, and nothing annoys me more than the need to constantly ask \"what did he say?\". But after a while your ears become attuned to their speech patterns and you find yourself immersed and gripped by the developments. <br><br>I won't talk about the plot detail other than to say it's a proper drama that repays the viewer. <br><br>Oh and as for Scott Chambers . . . what a performance. This was the first time I'd seen him on screen and I had to check his background to see if he was acting or if this was just him being him - he was acting. I hope to see him in more movies soon.","user":"Vondaz","rank":[9,13]}]