[{"title":"A real documentary","rating":10,"date":"28 November 2018","review":"Forgive Don't Forget was a breathe of fresh air to watch. A documentary that showcases real people trying to do the right thing without creating a false sense of drama like a lot of what we see on TV these days. This is a real human interest story, and I highly recommend it to all audiences.","user":"kurtvisser-261-477665","rank":[3,5]},{"title":"Informative Documentary","rating":10,"date":"8 December 2018","review":"I liked the way this documentary explored and kept a focus on the differing views the Japanese and the Americans' hold regarding teaching/remembering WWII history and their country's role. Maybe it's understandable due to their side losing the war. I believe the quest to find the original owners' family was a worthwhile effort and for that one family, it may have mattered. Yes, this is a real human interest story, along with many historical facts, such as the value and meaning of the sword to pre-WWII generations. I highly recommend.","user":"cwcamper","rank":[2,4]},{"title":"This mans wife should have beheaded thief of her childrens inheritance","rating":1,"date":"29 December 2019","review":"Bottom line.. That sword instead of helping his American Family have a better life financially, he gave it away to a Japanese family that will one day very soon buy a luxury home in Japan.<br><br>This documentary subject insuted his own grandfather in order to bless his captors.\nHe should be sent to prison for the act of being an absolute moron.<br><br>His wife in fact should have beheaded him before he pissed away a fortune that could have benefited his won children.<br><br>The most repulsive egotistical  I've ever witnessed.<br><br>His wife should leave him and make him pay her for the fortune he gave away.<br><br>i believe there will be a home purchase in japans finest neighborhoods with a sign embossed on the front door that says. \" die with the sword , bought a house with\nthe sword.\"<br><br>A good read for the children of this fool who gave it away.","user":"bluewatercolor-39303","rank":[0,0]}]