[{"title":"Starts off promising but quickly falls victim to horror clichés and cheap scares.","rating":4,"date":"21 May 2015","review":"I've only seen the first Paranormal Activity so I'm reviewing this as a standalone movie, even though it's actually a spin off or whatever. It's the same premise though - found-footage, teenagers, ghosts, demons, and what have you. <br><br>The first 30 or so minutes I was invested in the movie. I really was. I liked the characters, I thought the filmmakers were doing something interesting and fresh, there are some comedic bits thrown around, it was just enjoyable to watch. Then it turns into cliché city. Easy jump scares, stupid mythology that isn't even explained and makes no sense, people running around from room to room with no suspense. It's like halfway through the movie the filmmakers were like \"oh crap, this has to be a Paranormal Activity movie. Let's just make a bunch of supernatural crap happen to these characters we developed and wrap this up as quickly as possible\". And that's how the entire third act feels: rushed and lazy. It basically went from being an intriguing murder mystery to a generic possession movie.<br><br>I won't say it's terrible because I didn't hate myself watching it. It just got really uninteresting really fast. Near the end I was just waiting for it to be over because you know there's not going to be any explanation or any depth to the story at that point. You just want these stupid jump scares to stop so you can go about your life not watching this movie. There are worse found-footage movies out there, but The Marked Ones is definitely one you can skip over.","user":"lnvicta","rank":[67,72]},{"title":"Ties Up All The Loose Ends, But...","rating":5,"date":"4 January 2014","review":"What I loved about the first three installments of Paranormal Activity was that the scares were subtle and tension was built over time. Unfortunately, the fourth and now fifth installments of the franchise have fallen by the way of generic horror films of our day. The 4th movie had so much potential but fell completely short, and the 5th movie relies on all of the tried and tired possession plot lines.<br><br>You will definitely find some great \"jumpy\" scenes. Some you know are coming because they managed to create the tension, but some are completely unexpected. I also found the main characters very likable and funny...character development did not fall short at all like it did with the 4th film. The very best aspect of the movie is the highly touted surprise ending, which ties up all of the loose ends of the franchise.<br><br>I think some people are very confused by the progression of the Katie/Kristi story so I want to explain this a bit better. The story really begins with the prequel (PA3), showing Katie and Kristi's family being terrorized by \"Toby\"...a demon with whom the girls' grandmother has made a pact (to deliver the firstborn son of the family line). She is the leader of a coven of witches. It continues with PA2, which intertwines a bit with the first movie. Kristi has the firstborn son and the demon comes after him. Trying to ease the family's strife from the demon's presence, Kristi's husband performs a ceremony to sic the demon on Katie instead. The original movie follows Katie's terrorization and eventual possession. At the end of the movie we hear Katie screaming downstairs and Micah running down to help her. Moments later, Katie throws him bodily into the camera. Cutting back to PA2, we see Katie leaves her house and goes to Kristi's. She kills both Kristi and her brother-in-law (Kristi's stepdaughter Ali was on a school trip), and steals Hunter. This is why the 4th movie doesn't make much sense when you first view. Hunter has been adopted by a new family and Katie moves in across the street with a random little kid who introduces Hunter to the demon \"Toby\". That movie ends by the coven repossessing Hunter and killing his adoptive family. <br><br>I hated the 4th movie and thought that it was just filled with potholes, until seeing The Marked Ones. Jesse's downstairs neighbor is a part of the same coven as Katie and Kristi's grandmother, and her job is to create an army of demon children (marked ones) who will \"activate\" when they turn 18. When she dies, they investigate her apartment and find a journal that talks about a portal to dark places. Turns out Jesse was a \"marked one\", and is slowly possessed by a demonic force. To complete the possession, however, the coven must take him to their headquarters (Katie and Kristi's grandmother's house) and perform a final ceremony. Having consulted Ali from PA2, his friends know where the house is and go after him to stop the final ceremony. As his best friend is trying to run away from a fully possessed Jesse, he enters the portal and we find ourselves back in Micah and Katie's house, with Katie walking down the stairs in a trance and pulling a knife out of the kitchen drawer. The friend approaches her hoping for help and Katie starts yelling for Micah. Micah sees the friend and goes after him, but Katie stabs Micah instead...now we know exactly what happened downstairs in the first movie and why. It also answers the questions I had in the 4th movie. The random little boy living with Katie was obviously a \"marked one\".<br><br>So, is it a good film for the scares? Not so much. Is it good for understanding the franchise? ABSOLUTELY. If you're a loyal viewer, you have to watch it.","user":"meaghandill","rank":[40,49]},{"title":"Specifically meant for the loyal audience of the franchise","rating":5,"date":"2 January 2014","review":"When the news of a new entry in the series came to my attention, the idea exhausted me; especially given the previous entries and their deteriorating quality. Nevertheless staying true to the reason these films are still being made, and fans of real horror, like myself continue to watch them, Paranormal Activity: The Marked Ones, rewards its loyal audience with a fairly sensible connection with the previous films and characters. <br><br>In a way, the film does show some maturity, and they seem to have graduated from chicken feet on the floor and utensils and sheets flying around the place...at least for the most part. Here to begin with the lead character, Jesse was given just enough footage to get the audience to like him. We begin to instantly empathize with his family and friends and unlike the previous movies, none of them are extremely annoying. The actors, all do justice to their parts, and if not extremely strong performances, are convincing enough to keep us watching<br><br>This entry does give the audience more action than the prequels, however they divert themselves into satanic rituals, rather than pay any focus to the actual demon they are to be dealing with. There are just enough scares to justify one watch, and enough back story to make sense of a few huge question marks the previous films leave us with. <br><br>With the exception of these, the film has not much else to offer, and it is best to be watched as a part of this series and not compared to several of the other strong demonic possession films we've had in the past few years.","user":"sanjna-polamarasetty-869-692642","rank":[51,71]}]