[{"title":"Ignore the morons, this is brilliant filmmaking","rating":9,"date":"14 October 2015","review":"The Boy follows the evolution - or the beginning of it - of a young boy from troubled son of a failed motel manager, to budding serial killer. Cinematography and music score are simply outstanding, as are the performances by the whole cast, and the film carries a tremendous atmosphere of brooding menace, whilst simultaneously capturing the carefree curiosity - and cruelty - of a lonely child. I am saddened, but not surprised, by the lazy, idiotic reviews given by some people on this site - just so you know guys, this is how stories are supposed to be told, unfolding naturally to a great climax rather than throwing five murders into the first few minutes and then having absolutely nothing else to say for the next ninety... and all shot on \"found footage\", blah blah blah. True kudos to the director; this is a terrific calling card from a real filmmaker that will hopefully start a great career.","user":"ronster100","rank":[68,84]},{"title":"Accurate depiction of a sociopath in childhood","rating":7,"date":"25 August 2015","review":"(Contains conceptual but not plot spoilers)<br><br>The Boy is a slow film because it needs to be. The audience is given much to think about. Ted is a 9 year old sociopath. What degree of that is due to his experiences and how much is down to his genetics is an open question for the audience to consider. It is set in the late 1980s, prior to the start of the pedophile panic in the mid-1990s so Ted gets the opportunity to interact with the guests, each of which he uses to further his goals. A modern audience will likely worry for his safety, but it quickly becomes clear that the guests are the ones who are unsafe as Ted uses his access and position of presumed powerlessness to get what he wants.<br><br>Like any sociopath, Ted is short on emotions. He is entirely goal-driven and utterly amoral in his pursuit of those goals. Other reviewers have described him as angry, but the only time he ever appears angry is when his father interferes with Teds goals. The rest of the time he is a typical sociopath with a flat affect, displaying no malice, anger, or any other emotion.<br><br>The classics are all there - abusing and killing animals, arson, manipulation, hurting other people just to see what happens, and unwavering pursuit of arbitrarily-chosen goals. Overall a chilling depiction of a sociopath and a warning to not expect moral restraint of their actions, regardless of their age.","user":"otakucode","rank":[35,42]},{"title":"Loneliness is a Disease","rating":7,"date":"18 August 2015","review":"...And it brings out the worst in people. Take Ted and his dad for example. John (David Morse) is depressed and bit of a drinker, running a run down motel in a middle of nowhere, where guests arrive only by accident. Ted is a cute little blond boy, who caught an acute case of sociopathy, he's fascinated with death and very weird young man.<br><br>The running thread in this film is vast, unavoidable loneliness of the place and characters, not a healthy situation for a kid, who's getting bored and his anger for being stuck there builds slowly.<br><br>Creepy kids are often quite annoying, that's just how things are, and it's kinda hard to actually root for them but there are certain aspects of his life that can make us feel bad for Ted. At least occasionally, and for a brief moment. Mom's run away with some random guest, so he's left with the father, a decent guy but kind of lethargic and a loner himself. And the dream that he'll one day leave this miserable place and join his mother.<br><br>The pace is very slow which of course stresses the atmosphere, the actual misdeeds that we witness break away from the overall melancholy and outbursts of anger provide much needed dynamics. There are moments of tension which get slowly drowned by the tone of the film, building on leisurely drama rather than lifting the horror elements. But the finale is certainly fitting, as all we'd seen before it led to the big resolution. <br><br>This film is not particularly original, let me mention brilliant The Good Son, as a reference; but it follows the recent trend in cinema where slow burn drama dominates even straight genre work, making them seem more arty and meditative at the expense of action sequences. Making even US films like this one, seem more...I don't know...European in tone and style.<br><br>The film doesn't really dwell on the boy's nature, it doesn't raise obligatory nature vs nurture question as we are aware this boy's life is not happy. On the other hand it deals with father - son relationship a bit, making it very clear mom's absence and isolation has really affected the kid. But has it really, or did he just want to break away from boring routine where nothing happens unless you make it so yourself? \"Oh well. We all do what we can not to think about life\" I suppose.","user":"Shadowplayed","rank":[58,73]}]