[{"title":"Picture of an auteur","rating":7,"date":"28 September 2014","review":"Altman's life merits a 10-hour documentary. This is only 1½ hours, but we are treated to a decent selection of Altman trivia. <br><br>Gosford Park, M.A.S.H., Nashville, Short Cuts, The Player. Just wow.<br><br>The downside of cutting it down to a feature length documentary is that you are forced to skim through many great films. First of all, he made so many movies it's hard to keep track of them. Second of all, his movies are so dense that they require multiple viewings, and more than two minutes of exposition, to fully appreciate.<br><br>Nonetheless, I think the film is well-made and never boring. <br><br>Family videos and photos, and on-location footage, provide access to a rarely-seen Altman, such as Altman-the-father. <br><br>But don't expect great revelations. There is nothing truly shocking here, no skeletons in the closet. Altman is painted as a suspiciously lovable, but subversive, Santa Claus figure. Perhaps that's just the way he was. <br><br>But one would have liked a few rough edges to be explored a bit more - like his family troubles, financial worries and personal addictions to gambling and booze. The movies gets too close to hagiography at times. But if one is to pick Saints for canonization, you could do much worse than go with Robert Altman!","user":"K2nsl3r","rank":[12,12]},{"title":"Portrait of an Artist","rating":8,"date":"2 November 2014","review":"I am fascinated by the artistic process, how things are created, what motivates the artist, what obstacles are encountered and how they are overcome. In this documentary, I think Ron Mann has succinctly put together the various factors that motivated Robert Altman and made his career so long and successful. I felt I learned a lot more about the movie making process and artistic creation in general.<br><br>Simple things we now take for granted are important. For instance, putting together a team of people that work well together, giving people a break and letting them shine. These were radical ideas in the era of C2C Command and Control studio structures, where the word was passed down from on high. How about two people arguing, both speaking at the same time. Adds to the emotion and conflict right? Altman pioneered the use of multiple soundtracks to get right into a dialogue.<br><br>What I found particularly interesting was how Altman dealt with career setbacks. Each time things did not seem to be going his way (at least by the standards of others), he simply reinvented himself by turning to a different genre of film or theatre or production. When confronted by harsh critics, he simply shrugged it off and kept on working with undiminished enthusiasm. What a wonderful role model for young people starting off on a career. Bravo, great doc!!","user":"clarkj-565-161336","rank":[6,6]},{"title":"Excellent","rating":8,"date":"16 February 2015","review":"A look at the life and work of American filmmaker Robert Altman.<br><br>For anyone who loves film and its history, this is a must-see documentary. The career of Robert Altman spanned many decades and he worked with just about anyone who was anyone, making some of the greatest films of all time. Some duds, too, but that will happen.<br><br>Rather than just talking to a handful of people about their memories, this mixes in plenty of home footage, Altman's own memories, and those of his wife. While his career could fit into a much longer film, for the time frame allotted they did a great job covering his whole life and leaving us wanting more rather than opening up the possibility we could get bored.","user":"gavin6942","rank":[3,3]}]