[{"title":"Don't see this movie if you want to see Dolph, Randy, or Vinnie","rating":1,"date":"17 October 2013","review":"because they are hardly in it. This movie is marketed to make you think it is an action-fest with these three guys, but it is really a boring movie about 2 wannabe big shot drug dealers played by unknown actors. One looks like David Swimmer and the other looks like James Franco.<br><br>This film actually played in theaters where I live and I wasted money seeing it.<br><br>Camera-work is extremely shaky and amateurish looking. Vinnie Jones is hardly in it and the scenes with him are pointless. There is also a lot of pointless and contrived nudity, swearing, and poorly done scenes of people getting shot.<br><br>This movie is complete garbage.","user":"diggler_inc","rank":[16,25]},{"title":"great action is hard to come by","rating":4,"date":"30 September 2013","review":"Since I am Swedish I try to keep myself updated when it comes to my fellow Swedes' new Movies, especially Dolph Lundgren, and thus I watched this one as soon as I could.<br><br>Admittedly, Dolph may have his best years behind him. Still, he has worked with most of the creme de la creme within the action genre, i.e. Brandon Lee, Stallone, Van Damme. To his defence, perhaps he is not handed the best of scripts these Days. I would gladly Watch Men of War, Rocky IV, Universal Soldier, Johnny Mnemonic, Red Scorpion again.<br><br>Plot: A scarface duo try to move up the ladder. One is uncertain if he really wants to and is involved with a sweet girl and really wants to do something else. Unfortunately for them they are preyed upon by a rogue cop and hunted by the DEA.<br><br>Sadly, this Movie lacks true depth. I could tell that the writer tried really hard to create depth and credibility for his characters. Instead he fails miserably and all the characters get stuck halfway. Dolphs character has an unexplored relationship with Another DEA agent, one of the bad guys (who really is the Movies hero) cannot deliver a believable characterization of a guy in torment about what to do in Life. The Dirty cop succeeds somewhat better, but the best characters, which do not have any depth to speak of, are the drug kingpin and the hero's partner.<br><br>Due to this fact that the script tries too much to be a Little bit deeper than most B-Movies and lacks, as well, a really likable hero I can only hand out...<br><br>...4 out of 10. Dolph does not deliver, but is excused by having a minor role and the bad script. However, there are some good Points in the Movie: Randy Couture is good as the Dirty cop and the final shootout scene is pretty good as well as the photography.","user":"vampiri","rank":[11,18]},{"title":"Entertaining, recommended for a watch","rating":8,"date":"2 October 2013","review":"Picked up Hard Rush for a quick watch over the weekend and I have to say I actually enjoyed it. Sceptical at first however it was in the charts at Tesco's DVD section so I gave it a shot.<br><br>Where to start? <br><br>Well, story centres two rising drug dealers who own a club and want to climb the ladder of success in Los Angeles. One named Frank and one named Eddie (who is a Scot). They steal drugs from the wrong man, Vincent. who in turn wants them to sell for him which they do successfully however a dirty cop, Reilly, wants in on the action. All this is happening whilst an FBI agent, Maxwell, is hunting them all down. They ultimately all meet up in a bedroom at the end of the film. <br><br>Writing was OK. Story lacked in some places and there were areas which were massively underdeveloped. There was a very weak relationship between Dolph and the undercover agent, that part had no impact on the story. Would have really enjoyed the relationship between the two to be taken further. Would have also been nice to see a further developed story line on the relationship between the two drug dealers and ultimately what happened to Vinnie Jones' character at the end. No closure? Also a little more written on Reilly perhaps? On a positive note, some of the characters he created were original and at times extremely amusing and I enjoyed how all webs weaved ended up meeting in one location at the end. I really enjoyed some of the dialogue too, had sound and original elements in it. Bravo.<br><br>The director did a good job as much as I can see with the budget he was given. Casting was great. I liked the shifts/breaks between scenes. I also like his choice of locations believe it or not. His choice of characters were daring and paid off. Some of the sky shots of the city as well as the shots overlooking the sea helped open it up a lot. Nice work! I must watch more from him. <br><br>Action. As far as this goes, it was all ground level but solid and acceptable. Fighting scene at the end between Couture and Lundgren was great. They used a rain machine in the last scene and it enhanced the fight. Great choice by the director. Also seeing Vinnie in action was on the money. <br><br>Acting. Dolph Lundgren is Dolph Lundgren. To the critic who gave this a bad score, you are not a good reviewer. If I wanted to watch Gosling or Di Caprio I wouldn't have picked up this film. This film is not comparable to anything like that. I am sure at a budget level, whatever that may have been, they did a good job. Dolph will not produce anything worthy of a good actor performance so get over it. In this he was acceptable, lets be honest, when his girlfriend was in serious danger at the bar he didn't change his expression one bit but I did care? No. As far as the others, Vinnie Jones was perfectly cast, he did a great job and wow did he beat poor Eddie to a pulp. Always menacing and threatening as ever. Randy Couture, he is one for the future to watch. I thought he played his part well, maybe he could've seemed a little more menacing at times but he did well. He displayed some softer sides to his character which I really enjoyed, wish I saw more of him doing that. Frank, (Daniel Bonjor) never heard of him before this, but he did a solid job and was well suited for that role. I liked his less menacing approach to his character, was good, possibly question the relationship side a little. Eddie, a Scot, Gianni Capaldi (Dr Who's relative), I thought did really well. As explosive as he was I enjoyed watching his crazy antics, excellent excellent casting, changed paces of scenes and was colorful. Did Peter give him tips? The rest were all solid. On a whole, I thought everyone did well and I enjoyed their performances.<br><br>Why I rated this film so highly? <br><br>Its exactly where and what this film is supposed to be. It seems like it was developed the best it could be. Its always nice to see a mixture of old faces mixed with new ones balancing out the possibly worn out actors introducing new blood to the screen. I was kept entertained through it and thoroughly enjoyed many aspects of this film. If there is a better film out there made at this level I would like to see it.<br><br>Thumbs up!","user":"arf003","rank":[16,29]}]