[{"title":"Hot! Do A Mash-Up With Red Sparrow","rating":8,"date":"21 April 2019","review":"Best Of the Theron movies.\nHands down better than any of the so-called action movies. I loved this movie when it first showed up on the silver screen back in 2017 and am watching it right now on DVD. This girl is tasty.","user":"abassarrington","rank":[146,185]},{"title":"Better than most","rating":8,"date":"23 May 2019","review":"What a great nights entertainment. Clever, well acted, sexy and demanding, with everything that a spy/action movie should have but classier. DO NOT believe any of the pretentious reviews that look to bag this movie - it's great. Both leads are terrific.","user":"coachjacques","rank":[107,135]},{"title":"Good action movie that does its job. Recommended.","rating":8,"date":"6 July 2019","review":"Great action sequences, photography, and acting, a solid action movie in a sea of garbage. The movie is very entertaining and just flies by.<br><br>The plot is relatively simple, standard spy movie stuff, and presented in an interesting way appropriate for the genre. The acting is good, with characters whose intent we're never quite sure of. Of course, Charlize Theron is perfect in this femme fatale role.<br><br>The action is very well made, with relatively long, well-choreographed shots (much like John Wick). It gives a really good sense of actual fighting as it really seems like they're beating each other up. Her fighting style makes sense as the slender woman that she is: quick, uses her environment, and frequently performs various Judo throws which is always nice to see.<br><br>The photography is great, and personally I quite liked the aesthetics of the purple and blue lights, and the gloomy depiction of 1989 Berlin.<br><br>\nWhat surprises me most is that this movie currently has the same rating as the last Fast and Furious, where the action seems to be filmed by someone high on coke who keeps cutting left and right, and with ludicrous plots and acting.<br><br>In my humble opinion, this is leagues above that, and hopefully action movies move in this and John Wick's direction.","user":"EnricoFn","rank":[38,46]}]