[{"title":"An amazing unknown story","rating":8,"date":"30 December 2017","review":"A great part of the movie was it's historical accuracy. Showing confederate soldiers without shoes and low on supplies, with the facts about the tributes to the group of cadets by the Virginia Military Institute today in the beginning and the end. It tells stories of perseverance, love, and sacrifice all at once. Right when it felt like it was starting to drag in the middle it threw a twist to keep things interesting. This movie is underrated, and a great showing of the side that isn't shown as often.","user":"tbenz-60561","rank":[8,10]},{"title":"I'm overly sentimental sometimes.","rating":7,"date":"26 August 2015","review":"The American Civil War is by far the war that lasts forever in this countries collective memory and was decreed in absentia by the flawed original signing of the Declaration of Independence leaving slavery intact. You would think that makes for great films and in many cases it did,however rarely do they have mass appeal. This 2014 release that sometimes seems longer then its 96 minutes,a flaw in pacing,is not preachy yet stark in some of its depiction that may seem uneven at times.Its based on a historic battle fought by cadets from VMI (Virginia Military Institute) that still exists today.However its also a coming of age film and in that sense some might find it corny,I didn't.The young actors were good but unknown to me.The \"b\"level adult actors were also good and you'll recognize a few,yet less screen time than the youngins.So if you like a somewhat different twist to a Civil War film yet keeping it \"real\"you might enjoy it.I certainly was pleasantly surprised.One of my lesser known gems.","user":"dunsuls-1","rank":[8,11]},{"title":"A Flawed Premise, but Still a Great Film","rating":9,"date":"4 October 2014","review":"The film Field of Lost Shoes is a wonderful, gripping picture concerning a group of VMI cadets and their valiant stand against grizzled Union veterans during the 1864 Battle of New Market. Jason Isaacs turns in a superb performance as General John C. Breckenridge, who during a particularly poignant scene prior to the battle, speaks frankly to the cadets. He asks each of them their thoughts on the war, and their dreams for the future after the war. Each of the main characters describes their future hopes, and why they are fighting. The cinematography with the battle scene is excellent, and is particularly surprising given the very limited budget used making the film. The only downside of the movie is the hackneyed perspective that the South fought the war solely to perpetuate the institution of slavery. Slavery was one of a many issues as to why the war was fought, but to single it out for particular attention is myopic. Taking this tact the producers acquiesce to current political correctness. That said, thankfully the film does not dwell on slavery for very long. This film is a real gem. It was well written, well filmed, and well acted. It is too bad that it has had a very limited release. The accolades that it receives are well deserved.","user":"RaphaelSemmes","rank":[21,38]}]