[{"title":"Basic budget sci fi that works.....","rating":6,"date":"21 March 2017","review":"Atomica is a basic budget sci fi, that works.....<br><br>The styling and design of this film, is what really stands out. Its futuristic elements are well rendered and stylish for a film that does not have a big dollar value associated with it. <br><br>The story line is alright too if not exceptional. Its a somewhat slow moving but it has enough going on, to keep your interest for the most part. <br><br>Lastly, the actors do hand in reasonable performances, that keep your interested enough to keep watching and try to unravel the mystery that's presented. <br><br>Not great but by no means awful either. Six out of ten from me.","user":"s3276169","rank":[68,83]},{"title":"Low Ratings not due to quality of film but rather viewing preferences","rating":6,"date":"29 April 2017","review":"No spoilers here. I added another point to my rating because I whole heartily disagree with the low reviews. Although those looking for high tech fancy sci-fi special affects, and action packed fight scenes, (this story is not about that),they will be disappointed. What it DOES have, is some very believable acting. And although a modest setting as most of the movie is shown in a debilitated run down power facility in the future, it is believable. Most of the movie has a lot of dialogue between two characters. That in itself may turn some viewers off. But the story/pace gives little bits at a time, to build suspense, yet gives enough that the characters aren't flat/one dimensional... It is a slow burn thriller, and for a lower budget film, I thought this was excellently done. The lower ratings are not fair. I believe it IS NOT due to the QUALITY of this movie, but rather, the viewing preferences, of the viewer.","user":"tdwillis-26273","rank":[64,82]},{"title":"Acceptable bangs for bucks.","rating":5,"date":"22 March 2017","review":"This film was obviously made to a tight budget, BUT the money was used pretty wisely. I give points purely for that factor as a canny director and producer will know where to pour on the dollars, and where to save a few cents.<br><br>The plot was a bit vague and it frustrates me that story lines aren't thought through properly. I thought the tension was good throughout and had me guessing wrong a few times. Was a bit slow in places.<br><br>The writer should have toned down the importance of the plant to make the actions of the characters more believable (a facility that feeds the entire worlds power grid is manned by 2 people?). I would have found it to be more believable that 2 men might run a nuclear waste disposal facility. No one would want to be anywhere near that. And the antiquated equipment would have looked more at home in my scenario.<br><br>All up I enjoyed the film, and I recommend it as a dull, rainy day time waster.","user":"Mikelikesnotlikes","rank":[18,23]}]