[{"title":"Most disappointing film of the year","rating":2,"date":"23 October 2015","review":"I don't even know if I want to do the review of this film. I feel like my review has more depth than the plot of this film. Good lord, I try to keep these reviews as professional as I can. I even try not to include spoilers, because I want people to go out and see the movie themselves, but good lord in heaven, I mean it quite literally, this film was possibly the biggest let-down all year. You can't spoil something like this, because there's nothing to spoil. I don't feel like the screenwriters took the time to write anything down. They kind of just wrote down brainstorms, and payed the actors to improv them on screen. <br><br>As usual with the other films, we seem to carry our cameras around almost obscenely. Nobody, and I mean nobody, carries a camera around for no reason like that. It makes the realism of the movie seem so faked, and unreal. That's something you can yell at the entire series for. What makes the obsessive camera-use even worse, is the fact that they try to address it in this film, but do so....miserably. \"Do these people film everything?\" Said one of the characters, and then goes on to see his brother film everything. <br><br>Good lord the plot was just so poorly written. They created a really good thing for themselves in this film. They started it out very well, except for one problem, they didn't carry it out very well. They for whatever reason, thought that it was a good idea to create wrinkles in the plots of the earlier movies, by showing older tapes of the 1988 events, and then cutting to \"ritual sessions\" that weren't part of the tape in the first place. They show the two sisters being able to see into the newer house. And then, it just stops. The writers must have forgotten that they put that in there, because they never mention it again. It literally had nothing to do with the plot. All it did was make way for a cheap jump scare. They left a lot of things unexplained, such as where Toby came from, what happened to Christi, where the ghost camera came from, and all sorts of other points. The producers butcher their old plots, with the plot of this movie. The worshipers need the blood of Hunter, and the blood of Leila to make one of the 7 fathers of Hell, real. So goodbye the premise of the first born son, and breeding witches to find the first born sons. It will not be missed. <br><br>The producers have to understand that throwing in jump scares, and creepy faces every 10 minutes, do not make for a scary film, and does not create suspense. All jump scares create, is a sense of not wanting to be scared. That is all the film is filled with. It does not make for a good film. <br><br>The visual effects were definitely low budget. Just because the \"ghost\" looks like a blob of oil, doesn't mean that it looks convincing. The movie looks like they added effects in right before it was launched to critics for review. Every special effect in the film was just poorly made, and felt rushed. Especially at the end, where Toby is in real form. First off, they thought that because he is in the night vision lens It was just a man, with bare feet. It was rather sad. They made Toby sound like he was going to be a Beezlebub lamb, with crazy inhuman features. Good lord we were sadly disappointed. That seems to happen a lot in this movie. <br><br>The only good part about the movie is that the acting is actually pretty decent. The actors were great for the terrible screen writing they had to deal with. Child acting is hard thing to deal with, and getting used to; it can make giving the sense of realism nearly impossible, but the child actors in this film were pretty decent. They definitely have a bright future ahead of them.<br><br>Please, for the love of God, do not go out and lose brain cells because you watched this film. It is literally in no way worth it. The writing was terrible, the effects were terrible, and pretty much everything about his movie was just terrible. Spare yourself.","user":"aceofspades96","rank":[23,30]},{"title":"\"Paranormal Activity: The Ghost Dimension\" should have stayed there.","rating":2,"date":"23 October 2015","review":"I've always had a lot of respect for the \"Paranormal Activity\" movies, if not a whole lot of love. \"Paranormal Activity: The Ghost Dimension\" (R, 1:28) is the sixth installment in the series, which has scared up about $1 billion in ticket sales worldwide, against less than $25 million in production expenses. The original \"Paranormal Activity\" (2009) was filmed in the house owned by Oren Peli, who was the film's producer, director, writer, cinematographer and editor. Peli made that film for $15,000 and it ended up earning nearly $200 million worldwide – almost 13 THOUSAND times what it cost. This, of course, was the film that started that billion dollar franchise and, co-produced by Jason Blum, helped establish Blumhouse Productions, which eventually brought horror fans the \"Insidious\", \"Sinister\" and \"The Purge\" films, as well as the Best Picture Oscar Nominee \"Whiplash\" in 2014. Now THAT'S a success story that anyone who has ever tried to make a buck on their own idea or vision has to respect but what Movie Fans really want to know about a movie is whether it's any good. That's what matters to us.<br><br>Personally, I liked all of the \"Paranormal Activity\" movies but I didn't LOVE them. As they were bringing us creative stories, helping to turn the found-footage subgenre from a novelty into a viable filmmaking option, redefining horror movies for the 21st century and giving audiences thrills, chills and our fills of plot twists, there was a downside to the fun. For one thing, the \"Paranormal\" movies did what the \"Fast &amp; Furious\" series did – give us films out of the sequence of the overall narratives of its characters – but even tougher to keep straight. The other problem with the \"Paranormal\" films has always been a lack of action. Although they've put some scary and interesting moments on the screen, in most of the movies, not a whole lot happens – especially in the first one which seems overly dependent on the single big payoff at the very end of the film. The advertising for \"The Ghost Dimension\" promises a franchise-capping story that will answer all of the fans' questions and take us where no \"Paranormal Activity\" has taken us before. The question is whether the sixth installment gives the series the ending fans deserve.<br><br>\"Paranormal Activity: The Ghost Dimension\" takes place in 2013, after the events of \"Paranormal Activity 2\" and reflective of the events in \"Paranormal Activity 3\", from a present-day perspective. Young married couple Ryan and Emily Fleege (Chris J. Murray and Brit Shaw) move into a house built on the land where the home of Katie and Micah stood in the first film. Ryan and Emily have a little girl named Leila (Ivy George), whom they call Lee, and Emily's sister Skyler (Olivia Taylor Dudley) lives there too. When Ryan's brother, Mike (Dan Gill), newly separated from his wife, comes to stay for a couple weeks, there are then enough unsuspecting people in the house for the ghosts to begin tormenting.<br><br>While setting up Ryan's Christmas decorations, Ryan and Mike come across a mysterious box that Ryan says isn't his. Inside there is a series of VHS video tapes and an old, but uniquely upgraded video camera. The tapes show the young Kristi and Katie, circa 1988, being introduced to Toby (as in the third film) and being taught to make the most of their psychic abilities. That camera has the ability to see and record spectral phenomena. As Ryan and Mike try to figure out what's really happening on those tapes and record increasingly prominent ghost-like apparitions, Lee is observed talking to an invisible \"friend\" and behaving very oddly. At first, the Fleeges try to solve the mystery and protect the little girl themselves. They eventually call in a priest (Michael Krawic), but it starts to look like it might all be too little, too late.<br><br>\"Paranormal Activity: The Ghost Dimension\" is a very disappointing ending to the groundbreaking series. The film suffers from the same malady as all the others – not enough action and not enough dread until the very end. The special effects are good, with paranormal wisps of black smoke looking a lot like those in \"Crimson Peak\", and the 3-D gives a very nice depth to the shots of that wide-open house and those spectral images and it serves the few brief action scenes pretty well. Unfortunately, contrary to what the movie's advertising would lead us to believe, our peek into the Ghost Dimension is frustratingly fleeting, with even the \"Poltergeist\" remake doing a better job of showing us \"the other side\". This movie has a half-way decent climactic scene, but the story's ultimate resolution and the final image on the screen elicited dissatisfied groans from my fellow theater patrons. Although I settled for the more subtle eye roll myself, I felt their pain. Basically, this movie gives us the standard \"Paranormal Activity\" formula, but without a worthwhile payoff. Much like the ghosts that the films portray, the 2015 installment shows that the \"Paranormal Activity\" movies have outlived their usefulness and should just fade away. \"C-\"","user":"dave-mcclain","rank":[46,66]},{"title":"This time, you will see the activity. And the lazy writing. And the cheap 3D gimmick.","rating":2,"date":"23 October 2015","review":"Remember Saw? Remember what happened to that franchise? After becoming a Halloween staple, it was immediately overshadowed by the newer, fresher Paranormal Activity series, with the last Saw using 3D as a final resort to churn out one more film from the dying franchise. Now, we're seeing the same thing from Paranormal Activity. In fact, the desperation to milk one last film is apparent, and it's sad. Alas, this is the cycle every horror franchise goes through. I have to admit, I personally enjoyed this series longer than I would expect. To call PA4 disappointing is an understatement, but The Marked Ones made up for it and surprised the hell out of me.<br><br>However, TGD is easily the worst film in the series, one of the worst films of the year, and a sad, cynical, soulless attempt to salvage whatever is left from this franchise. There's literally nothing memorable here, nothing iconic. It's all so generic and inept, from the constant jump scares, to the forgettable actors, to the 3D, which is used in the most clichéd way possible. The story doesn't make a lick of sense compared to all the buildup in the previous films, most likely due to the noticeable absence of Christopher Landon, who wrote all the sequels up until this point. And why the hell did it take two years for four writers to write the script? Was that really necessary? Overall, there's not much to be said about TGD because there's not much to actually talk about. By the time of writing this review, I've already forgotten about 90% of the movie, and you will too. So don't watch it. You don't need to see the activity. Whatever you come up with in your imagination is probably far scarier than this movie would ever dream to achieve.","user":"moviewizguy","rank":[37,52]}]