[{"title":"In awe of Darren Paul Fisher","rating":9,"date":"26 June 2015","review":"Some movies require you to take the \"reviewers rule book\" and toss it.<br><br>This is one of them.<br><br>The writer/director Darren Paul Fisher appears to be one of those rare auteurs who releases a work every four or five years and then disappears or hibernates or goes back to his home planet.<br><br>This is an extraordinary film. Even now I not sure if this is a love story sugar-coated with one of the most complex metaphysical scripts of all time, or a metaphysical script grounded in a wonderfully odd love story.<br><br>However, as one of the main characters quips in the very last scene, \"Does it even matter?\" <br><br>The film is mesmerizing and engaging and challenging. It makes the MATRIX look like a Bugs Bunny cartoon. The scenes in the present with the adult cast are perfect and flawless, but the flashbacks with the child actors are beyond even that, they are hypnotic.<br><br>A great film by a gifted auteur. Memorable. Enjoyable. Astonishing.<br><br>Highly recommended","user":"A_Different_Drummer","rank":[50,63]},{"title":"Most Intelligent Philosophical Sci-Fi I Have Seen This Millennium","rating":10,"date":"29 July 2013","review":"I saw the world premiere at Fantasia and chatted at length with writer/director/editor/producer Darren Paul Fisher afterwards.<br><br>The Universe he created and that the viewer slowly discovers is complex, coherent, intriguing and raise ethical and philosophical questions including the classic determinism versus free will dilemma. The arguments and points of view are quite interesting, with a caveat that in the end, perhaps who cares? <br><br>There is a love story in the midst (and a friendship) that builds and begs to reach you emotionally with fine acting and directing. Character development arise seamlessly through three different age period and the pacing and editing are quite remarkably on cue.<br><br>I don't want to reveal too much about this cerebral science fiction, but there are many clever surprises that awaits the engaged viewer both in the story twists and the underlying concepts explored. Even love has some deep philosophical implications at one point in the context of the film.<br><br>So there you have it: the best film of Fantasia so far this year and one of the best sci-fi ever, from the spectacular script to the screen.<br><br>Bravo Mr Fisher and thank you for sharing your thoughts and labour of love in this artistic and philosophical masterpiece.","user":"christian94","rank":[96,142]},{"title":"Affinities, Serendipity, Resonance, Universal Code, and more, all in one film.","rating":9,"date":"23 May 2014","review":"Although from the synopsis I thought this was not the kind of film I can enjoy, I decided to watch it after reading the (at the moment only) review, by Christian. I must say, he was right. This film is great! It had my complete attention from beginning to end. It is funny, original, mysterious, intelligent, intriguing, sweet, sad, mental, philosophical, emotional, from time to time thrilling. There are names of fictional characters which recall names of famous geniuses, and sort of gags/tributes to them, which to be fully enjoyed require you to at least know, for example, who Isac Newton was and how important for him things like weight/gravity and apples were. And probably if you are a somehow philosophical/mental type you may enjoy some aspects of this film differently. But I am sure that whatever kind of person you are, this film will give you much. And you will not forget it.<br><br>If the apparently complicated conversations about philosophical themes sometime confuse you, do not try to follow them. They are there to make you smile, so smile of their complexity, and enjoy the whole of the film, the romance, the comedy, the drama, the mystery. This film is really different. Oh. It was a long time that I was not so deeply and lightly and fully and gently pleased by a movie. The actors are also very good.<br><br>Somehow this film reminds me of \"Waking Life\" and of \"I Love Huckabees\", for its mixture of mentality and emotionality and comedy.<br><br>I do not give it a 10 just because nobody is perfect :D And like Christian wrote: please watch it! Please for you, not for me. Because you will like it. So do not miss this opportunity!","user":"Ucare","rank":[60,86]}]