[{"title":"Wow, veteran actors stuck with novices and horrible pacing","rating":4,"date":"4 July 2014","review":"Let's be honest, this is a terrible movie. What an odd mix of veteran actors (Susan Sarandon, Leah Thompson etc.) quite literally smashing up against terrible novices like the lead character's sidekick, Myles Massey. I continue to be amazed that people are actually paid to cast movies and they come up with bad actors all the time. The sidekick role is crucial here, yet they choose a kid who can't act. Go figure. Watching Sarandon, John Hannah and Leah Thompson attempt to add some flow to the movie while working with terrible actors reminds me of Natalie Portman struggling with Robot Hayden Christensen in the Star Wars prequels. I guess it has something to do with movie budget; perhaps they ran out of money after paying Sarandon, Hannah and Thompson.<br><br>Every once it awhile we see some promise, as when Rad and his family visit his Aunt and her husband. Amy Sedaris and Robert Longstreet show how it's done and provide a hint of what the movie might have been. Also Rad's sister was more than adequate in her role.<br><br>All this aside, the movie does well with costumes and general 1980s era eastern shore vibe, that's about it. The pacing is excruciating as we wait for lead character Rad to meet up with Susan Sarandon and when he finally does, it's almost a throwaway scene and before you know it we're (mercifully) at the finish line.<br><br>If the director was attempting some sort of filmmaking homage, I missed it completely. So much more could have been done for the eastern shore/Ocean City in a movie like this. I'm being brutally honest when I say that all during the movie I kept thinking how I could have rounded up some buddies and a mini HD camera and done a much better job. I kid you not. It's that bad.","user":"rcantabile","rank":[24,41]},{"title":"This was going to be good, but then it wasn't","rating":1,"date":"14 June 2014","review":"Pretend it's the Karate Kid, but lower the stakes and take out the character depth. <br><br>This script had potential, but every single thing that happened felt completely contrived. I wanted to like it, so it just made it that much worse that it sucked. The only surprises in the movie were how shallow the characters ended up being. Everyone's an archetype. Every event is formulaic. It almost felt like an outline of a movie where the scenes were placeholders for what should have been there. Seriously, don't waste your time.<br><br>Just for the record, the cast isn't terrible. The things they do that make this almost unwatchable were clearly intended by the director.","user":"LLWerker","rank":[14,24]},{"title":"Boring Garbage, Go watch The Way Way Back instead","rating":1,"date":"25 October 2014","review":"This movie is an interesting study if you compare it to last year's \"The Way Way Back\" (2013)- it has almost identical premise, a dorky teenager going on summer holiday with family with a pushy/pissy older sister. Somehow along the line this movie just gets worse and worse, as nothing is happening and you are hoping something is going to happen and suddenly it is the end.<br><br>First, there is no character growth, the movie's protagonist is a \"dork\" that came of age, and you expect there is something happening in the plot that force this dorky teenager out of his comfort zone for some real character growth, and meet some mentoring type who pity him and take him under his or her wing. But instead the movie is just all fluff - its like the director decided to do a period piece (early 1980s) and forgot about the plot - its almost like he let these clueless actors to improvise on the spot - nothing is happening, nothing is structured, its all just bits and pieces that are not funny nor entertaining to watch, its worse than some of the historical documentary I have seen - at least these documentary are edited to appear interesting, and structured. this here, is not.<br><br>Susan Sarandon was hugely underused in this movie - this movie is 1 hour 30 minutes including the credits - and 1 hour in (2/3 of the movie) and her character is finally kicking into gear. The whole time I was waiting for her to do something like Sam Rockwell's character in \"The Way Way Back\" - and she only appeared briefly for less than a few seconds. So 1 hour in, she appeared for less than 10 minutes as the \"mentor\" to teach the main character from getting out of embarrassing situation - and she is gone again.<br><br>Overall, this movie is just a dull uninteresting tedious affair. Its just like watching paint dry.<br><br>I got an advice for you director Michael Tully - if you don't have an interesting story to tell, shut the hell up and stop wasting people's time!","user":"dioditto","rank":[12,20]}]