[{"title":"Excellent Movie...Critics Too Harsh","rating":9,"date":"31 December 2014","review":"This is an excellent movie more attuned for children but cute/watchable for adults as well.. Critics forget what children like. They compare this to Spiderman because they want to see a Spiderman type of superhero movie that entertains adults. When they don't get that, they decide to tear into the movie saying it's a Spiderman ripoff. Sorry, critics, superhero movies, like they use to make them, can be built for children without implied sexuality, bad language, and soaked in darkness. This movie was beautifully shot and didn't need high tech gadgetry to entertain well. It was funny too (e.g. the kid's oblivious loser parents). It's also original (or at least unusual) in having a child portray a superhero.","user":"somedaze-200-767368","rank":[13,18]},{"title":"Totally watchable","rating":7,"date":"6 September 2015","review":"I've just seen Antboy and as expected, doesn't bring anything new to the super-heroic genre. It doesn't even bring anything new to the whole movie-about-child genre. But there's where the really interesting part is. All in all i feel like Antboy is a love letter to the superheroes stories most of us grew up with. It has almost every cliché from every single superhero movie you can remember without googling, and that's the reason that makes it so fun to watch. It might not be the best acting performance you'll ever see, but the kids are cool and the script is quite consistent all around. The tone is set properly and after seeing the trailer for the upcoming sequel i confirm what i said above. It's a fun, entertaining movie that doesn't bring any surprises but doesn't fall apart either (did anybody say Crap-tastic Four?). I would totally recommend it to someone who really loves superhero comics/movies. The rest might (and will) find it dull.<br><br>In a few words: Antboy is to the superhero genre what Fanboys is to Star Wars.","user":"facundo36","rank":[6,8]},{"title":"Antboy, with a strong parallel to the Spiderman story.","rating":17,"date":"17 October 2015","review":"I found this movie on Netflix streaming movies. Ever since I was a small boy I have enjoyed the escapism that superhero stories provide. This one is in Danish but was dubbed very well into English.<br><br>Oscar Dietz is Pelle Nøhrmann, and much like Peter Parker in 'Spiderman' is small and meek and mostly overlooked by his classmates. One day he is running home from the two bully brothers when he ducks through some bushes to hide. While there he gets bit by a large ant and, much like the spider this ant has been genetically altered. Pelle falls asleep in the yard and when he finally heads home just wants to go to bed. The ant's powers have begun to alter his body and the next day finds he has super strength for his size, like an ant does, and his fuel is sugar. Along with his good friend they think up a name and come up with Antboy when he is in costume.<br><br>So this movie, relatively short at just over one hour, mostly establishes Antboy and how he got his powers. In this story he has to fight the Fleaman who had kidnapped a classmate of Pelle's and eventually get him arrested and sent to jail.<br><br>While I enjoyed this movie enough it is probably best for children. I plan to also see the next one, \"Revenge of the Red Fury.\" And I see Antboy III is in post-production.","user":"TxMike","rank":[2,2]}]