[{"title":"Quite fair, but not comprehensive or fleshed-out","rating":5,"date":"10 May 2015","review":"I love Richard Pryor. He overstepped so many boundaries, partly on what a comedian's role should be, and partly where matters of race and what intrinsical fun is. This documentary scratches a little on the surface, as is witnessed by reading some of the biographies on Pryor and by hearing his material that evolved massively and changed stand-up comedy forever, which is not really reflected here. Sure, we get to hear Dave Chappelle say \"Richard Pryor is the greatest, full stop, end of story\" but I wish there'd been more flesh here. It's good that the documentary doesn't flash too much of the drama here, e.g. Pryor setting himself on fire (for real) or his fight with Gene Wilder, but all in all, it's a fair documentary, rather than a comprehensive one.","user":"pivic","rank":[4,5]},{"title":"Well-Paced & Interesting","rating":7,"date":"29 May 2015","review":"This documentary, I thought, was a well-paced and interesting look at the iconic comedian, writer, and actor Richard Pryor.<br><br>His epiphany early on in his career to be himself, thus to use raw language and the N-word, although giving him rough times at first, would eventually pave the way for his stardom and be a catalyst for many other performers to follow. It would also actually serve as a bridge for better relations between the black and white communities.<br><br>The movie delves somewhat into Pryor's personal life, looking as his difficult upbringing in a bordello, where his father and uncle were pimps and his mother a prostitute. Pryor was very close to his grandmother who actually raised him and set disciplinary boundaries for him. He had various personalities, per those that knew him well, and ended up marrying seven times to five different women.<br><br>The documentary also goes into some detail about Pryor's cocaine addiction, and how his physical and mental health especially deteriorated when he switched from snorting to freebasing the drug. This would lead eventually to the infamous traumatic event where he lit himself on fire, while high, and ran down his neighborhood street. He would miraculously survive extremely serious burns.<br><br>There's the usual array of interviewees in the film, from former colleagues, collaborators, and those that knew him well, including his widow Jennifer Lee Pryor, who obviously held great affection for him. There's also clips of Pryor's concert, film, and TV appearances which I thought were well edited.<br><br>Overall, as mentioned, I found this movie, directed by Marina Zenovich, to be quite engaging and informative, and I certainly learned more about the great comedian than I knew before.","user":"larrys3","rank":[3,4]},{"title":"Great Bio-Doc. About The Guy All Modern Day Comics Can Be Traced To...","rating":8,"date":"15 July 2015","review":"I could've sworn I had already seen a documentary about the life and times of Richard Pryor, but a friend recommended this one to me, and judging by it's year of release (2013)- don't think I had already seen this one..?? Well, anyway, I saw this one off Showtime the other night, and it's a winner!<br><br>I would say all modern-day comedians can be traced back to Richard Pryor- Louis CK, Chris Rock, Sarah Silverman, Steve Harvey, etc...in the ability he opened up to pretty much test all the boundaries of an audience, and WOW- did he test them! I'll occasionally go back and watch some of his live shows and think to myself- hmmm.... I really wonder if a comedian in the present day could get away with saying something like that-??<br><br>This movie goes into Pryor's life and upbringing, basically in a brothel where grandma was the madame, his dad was a pimp, and his mom was a ho!- talk about \"Father Knows Best\"!?? LOL Well, it sorta gives you an idea of where his roots shaped his sorta unconventional thinking for the time. The film also goes into his struggle with drugs, especially those incidents lived in the world-wide press. The first movies I remember seeing of his when I was a kid were \"Stir Crazy\", \"The Toy\", and \"Bustin Loose\"- where I recall him having a kinda weird, scaly skin texture. At the time I didn't know that was from his face being lit on fire from free basing cocaine!<br><br>Well, again, I'm sure there have been other docs. about this very important comedian, actor, all-around entertainer, but this one has got to rank up among the top. Thumbs up to a good film, and a life lived to it's very fullest!<br><br>Please check out all my reviews, plus lots of good interaction and group discussion about anything/everything movies/TV/entertainment at: https://www.facebook.com/groups/movie.holiks/<br><br>Email us at:<br><br>movie.holiks@groups.facebook.com<br><br>And don't settle for second best!- lots of copy-cat and imitation groups out there, but \"the REAL movie-holiks\" is THEE original one!","user":"MovieHoliks","rank":[1,4]}]