[{"title":"An insane fun horror anthology. Deserves more attention","rating":8,"date":"15 July 2013","review":"~I want to start off by saying that V/H/S 2 is a huge step up from its predecessor. It delivers more chills, thrills, action, and what we enjoy most...FUN! I was completely thrown off when I first watched this movie. I didn't know it was going to be so insane. ~For the people who haven't seen the first V/H/S, basically the movies are about a bunch of 'found-footage' short horror stories played through VHS tapes by people in a house. While they are watching these VHS tapes, something spooky is also going on in the house as well that stretches through the whole movie giving you updates on what's happening in the between changing of tapes. Now let's get to the tapes which is the main focus of this film. I won't give super spoilers, but i'll just give brief description of each tape.<br><br>TAPE 1 - \"Phase 1 Clinical Trials\" This ghost story tape is the only one that made me jump a bunch of times. It will be the jump scare tape and that's what it heavily focuses on in scaring you. I enjoyed it for it's jump scares, but there is a questionable scene in there that doesn't make any sense, but luckily, I, a horror movie fanatic, knows that you aren't suppose to take horror movies that seriously or think SUPER deep about it. This one gets a... 8/10 (generous)<br><br>TAPE 2 - \"A Ride in the Park\" Ever wanted to see through the eyes of a zombie? Well this is your lucky short. This is a pretty cool zombie short. It could have been just a little bit better, but it is still pretty good thanks to a few awesome scenes in it. This one gets a... 7/10<br><br>TAPE 3 - \"Safe Haven\" This insane short is definitely the best out of the bunch. It is completely insane, bizarre, violent, and fun at the same time. Easily the most craziest, but enjoyable short I have ever experienced. If you see this film, make sure you watch this tape. It's long, but the crazy ending is worth it. This one gets a... 9.5/10<br><br>TAPE 4 - \"Slumber Party Alien Abduction\" Well, the title of the tape speaks for itself. This short gets pretty fun and intense, but the most noticeable aspect about this tape, is the unique way that it's filmed. The camera is actually attached to the back of a dog, so we see what the dog sees and I had to give a big thumbs up for that. It's pretty creative and actually works out well enough. This tape will have you wondering what the f**k is going on but keep you thoroughly entertained. This one gets a... 8/10<br><br>Wrap Around Tape/Frame Narrative - \"Tape 49\" As I said before, this is the story that plays on while the tapes are being watched. Two private investigators are searching for a missing college boy. They break into his house, search for him a little, then start to watch the tapes (which are the horror shorts) that he has. This story had a pretty clever twist in it that leads up to it's ending (which ends the whole film). This one gets a... 7/10<br><br>OVERALL - 8/10. It's fun, has some scares, is over-the-top violent and insane, and a lot better than the first one. V/H/S 1 fans will LOVE V/H/S 2 and horror fans will love this as well.","user":"coolsavon","rank":[68,96]},{"title":"Better than the first because of Safe Haven","rating":7,"date":"25 November 2013","review":"I liked the original and this one surprised me. While not every story was top notch one stands out as original and had great direction.<br><br>Tape 1-Phase 1 Clinical Trials, This was a decent Ghost Story but was not very memorable. Did have a few scares and was fun to watch.6/10<br><br>Tape 2-A Ride In The Park, This one was fun and creative. Wasn't scary but I did like the set up and actually seeing the perspective of a Zombie was real cool. It has a lot of gore and while I don't really like zombies this one was nice to watch. 7/10.<br><br>Tape 3-Safe Haven, This is the best out of the bunch. Details an investigative team going into a religious cult and the outcome is insane and over the top. Has the best pacing and while there aren't many jump scares, it really manages to creep you out the whole time through. Also it is directed by the Mo Brothers who also did the ABC's Of Death letter L which was one of the best on that horror movie and did Macabre which I will link my review to that movie in the end. 9/10<br><br>Tape 4-Alien Abduction, Most people consider this the weakest of the bunch but Tape 1 was the weakest in my opinion. This has a nice set up and the effects are good for a short. Wasn't creepy like Safe Haven but it kept me interested in till the end. 8/10<br><br>Tape 49- The main story about two private investigators watching the tapes in a house where their looking for a kid from the first VHS. It was OK and while not the best story, it did give us a reason for watching the tapes which is nice. 6/10<br><br>Overall this movie gets a 7/10. Safe Haven was great and I never knew it was by the Mo Brothers in till I watched Macabre. That was great knowing that. My link to Macabre and my review. http://imdb.com/title/tt1447791/reviews-16<br><br>Check out my review for that movie as it is my surprise of the year for 2013. If you liked the first VHS then you will like this one. I find this one to be a little better and more creative. Not sure if they will do a third one but I would be open to it.","user":"andrewbarry6336","rank":[18,25]},{"title":"Nice Sequel with Twists and Gore","rating":27,"date":"27 October 2013","review":"V/H/S/2 (2013) <br><br>*** (out of 4) <br><br>Gory sequel to the 2012 film has a pair of investigators breaking into an apartment where they find an assortment of videotapes. The first story involves a man who receives a mechanical eye transplant that soon allows him to see dead people. The second story has a biker with a camera on his helmet getting bit by a zombie and soon he turns into one. The third story takes place at a strange cult school where the leader is being interviewed when \"it\" happens. The fourth and final story deals with a group of boys who keep playing a prank on one's sister when something joins them. I enjoyed the first film in the series and this one here is actually a tad bit stronger thanks in large part to the first two stories. The majority of the camera work comes from the camera being placed on people head's and I must admit that this gave me a headache at times but I will give the filmmakers credit as this did allow some familiar stories to be told in new ways. This is especially true for the second story when we get the POV shots from the zombie as he goes searching for people to eat. This was a rather unique spin on the genre and it really worked. The first story was also quite good, although this mechanical eye thing left some logical issues. Still, the episode is a good one and features some nice ideas. The fourth episode is one I won't ruin but there's a nice little twist along the way and I think it manages to be quite ambitious. The third film is without question the weakest but it does contain some very twisted scenes and a high level of gore. V/H/S/2 has the same look of the first film as the quality is quite different from one story to the next but this gives the film its own unique feel. Fans of gore will also enjoy that there's plenty of that going on here and especially in the third story, which is a downright bloodbath and even the second one contains a lot of the red stuff. For the most part the performances were just fine and at 95-minutes the film goes by fairly quickly. V/H/S/2 is a nice little gem that has a few flaws but for the most part it works well and I look forward to future installments.","user":"Michael_Elliott","rank":[20,29]}]