[{"title":"Nothing to see here.","rating":4,"date":"2 May 2014","review":"What we have here is what I like to call a \"null-point film\". Now typically when you go out to watch a film, or head to the store to rent one, you have something in mind for what you would like to see. If you rent a drama, you are probably looking for good acting mixed with touching real life scenarios. If you are looking for horror, you are probably hoping to see scary monsters and frightening circumstances.<br><br>If you decide to watch ANY sort of movie in the horror genre with the word \"blood\" in the title, you are most likely expecting to see some gore.<br><br>Surprisingly, this movie offers non of that. This is why I call it a null-point film. Everything I was expecting to see didn't happen. Oh sure lots of people died.. and each one of them died completely off-screen, with the killing blow happening off-camera. You hear bloody ripping noises and screaming, but see nothing. The special effects were limited entirely to red contact lenses and fake blood with something mixed in to look like intestines.<br><br>I am normally a proponent of not overdoing your special effects. The rampant CGI in movies today is annoying at best and it's always good to see amateur film artists looking to avoid that sort of thing. However, in this film the creators got excessively conservative.<br><br>Why would you make a slasher film with no slashing in it? Because honestly the plot, acting and atmosphere add next to nothing to the movie; slashing was really all that was left. It was the point, and for some reason it was avoided almost entirely.<br><br>Hence, a non-movie.","user":"rushknight","rank":[12,12]},{"title":"Awful Is not Enough to Rate This Movie","rating":2,"date":"10 September 2014","review":"\"Blood Shed\" is a low-budget movie with a story inside a self-storage facility that does not make any sense. The lead character is Gabriel, an epileptic young man that uses drugs for seizure and is living in his car. His stepbrother sends the key of a container in a self-storage facility in Los Angeles and tells that he might find the truth about his biological parents inside the container. Gabriel, who is dirty, unattractive, rude, homeless and penniless, meets the janitress Samira in the facility and she falls in love with him (love is beautiful, isn't it?). Meanwhile there is a deranged ghost hunting down the homeless people that spend the night in the storage. This is the first time that I see a crazy ghost. The plot point is that the ghost is Jezebel, who is Gabriel's mother. In the end, awful is not enough to rate this movie. My vote is two.<br><br>Title (Brazil): \"A Chave do inferno\" (\"The Key from Hell\")","user":"claudio_carvalho","rank":[11,12]},{"title":"Absolute Rubbish","rating":1,"date":"15 March 2014","review":"A complete bullshit movie with no originality. Frankly speaking this movie doesn't even have a plot. Don't waste your time watching this. The poster came up like its evil dead or something like that, but trust me, noting but a complete haplessness awaits you after you've realized the movie has reached its finish line. Very very bad movie. Question to the movie team: What's the message here? Why did you make this movie? Why does the mother appear nude in front of her son??? <br><br>A few boob scenes here and there and lousy acting everywhere. I don't know what made me watch this movie!!! <br><br>Don't waste your time watching this, YOU'VE BEEN WARNED!!!","user":"zahid027","rank":[17,22]}]