[{"title":"A wild Ride","rating":7,"date":"9 October 2014","review":"I was not expecting an overly good movie, but what I got in turn was an rollicking thrill ride. The Movie \"Stretch\" Takes place over the course of one night, and is about a man whom is a Limo Driver that owes six grand by the end of the night.<br><br>At times this movie reminded be a bit of \"eyes wide shut\" and \"Hanna,\" with similar colouring and locations to the movie \"cosmopolis,\" but with a much more light hearted and humorous tone. I did not view the credits beforehand, but was surprised with several cameos, and quite a few recognizable faces throughout the movie.<br><br>Some parts are a little mediocre, but as a whole the movie is a fun ride, and offers some good entertainment while contemplating on things like fate and taking action.<br><br>It was beginning to feel like Chris Pine was becoming a bit type cast, but in this movie he effectively breaks those bonds, portraying a wild, unpredictable man with a sense of mystery and insanity.<br><br>At first appearance, it looks like it will be another run of the gun, 'wild night' movie, but instead \"Stretch\" offers some truly unique aspects, with plenty of creative and funny scenes throughout.<br><br>Definitely a good movie to watch if your looking for some fun entertainment that doesn't take itself too seriously. Probably one of the directors best movies, if not the best. If you like wild adventure movies with comedy and action, then don't miss out on this one!","user":"rapidcereb","rank":[75,87]},{"title":"Stretch is a very good watch !!","rating":7,"date":"8 October 2014","review":"Going into this film i really had no idea what i was expecting, and looking back that's probably the best way to watch this one. It looks great, sounds fantastic &amp; entertains from start to finish ! The cast were all first class &amp; the cameo performances were a great part of the film. The performance of Pine as the crazy billionaire is a particular standout, but each and every actor pretty much nailed their parts. Stretch is one of those films, where you can just switch off for a couple of hours &amp; enjoy the ride (literally !!!)<br><br>This one is a must see !!<br><br>Sausage.","user":"Sausage1","rank":[63,75]},{"title":"I gotta say; I really enjoyed this.","rating":8,"date":"12 October 2014","review":"I just don't get the mediocre ratings I'm seeing for this one. I thought it was a perfect action-comedy - right up there with 'The (original) Hangover', 'Horrible Bosses' and the like.<br><br>Here's how it hit me..<br><br>Story: Tight, to-the-point, succinct and actually, pretty plausible. Pace: Fast from the first few seconds, then damn-near unrelenting. Stunts, Effects, Makeup &amp; Camera-Work: Top-shelf. Characters: Believable and uncomplicated by too much 'back story'. Acting: Each-n-EVERY actor in this film displayed their awesomeness. Predictability: You NEVER knew what was coming next. LOTS of surprises. Oh - and nice ending, too.<br><br>Viewer discretion: This is definitely a film for grown-ups. LOTS of drug use and some mild nudity.<br><br>My head's still spinning down. What a fun flick. Not familiar with much of the director's work, but this was cool.","user":"topsfrombottom","rank":[60,74]}]