[{"title":"Great, but I would have liked to get just a little beneath the skin","rating":6,"date":"19 October 2015","review":"The part of the title \"The story of Jeff Lynne\" does not describe the film very precisely.<br><br>I have always seen Jeff as probably a very nice and very reserved person and that impression only grew stronger by this movie which in essence does not really tell much anything about Jeff as a person. It's about \"Jeff, the songwriter-producer and some comments about working with him\". That is the reason I felt it honest to take off some stars from the rating. Music-wise it's what everyone knows: Doen't get sweeter than what Jeff's done in his musical area , 10/10. But the storytelling in this movie is the usual documentary patting on the back kind of thing while it oddly enough leaves out a huge portion of ELO and the members of ELO and Jeff's family-/personal-/emotional life is left out of the equation.<br><br>It is definitely worth a watch and will be very enjoyable for people who either know his music or in general like old school melodic music.","user":"yhteydessa","rank":[6,6]},{"title":"Just too much. Something was off.","rating":6,"date":"30 December 2013","review":"The superlatives never stop. The stories are all just a little to perfect be believable. Several of the interviewees appeared to be reciting from a script. For several, it didn't feel like it came from the heart.<br><br>There is absolutely no insight into his life outside of playing an instrument and singing (he seems to live like some kind of immortal musical hermit in his mansion above the city). <br><br>I couldn't shake the feeling that this was just one gigantic narcissism project by the subject himself. Which by the way culminates in a digitally created jam session with the subject playing all the parts (not very subtle).<br><br>All that aside, the music is excellent and was a joy to hear. I would have preferred fewer awkward interviews and simply more of the tunes. If you are a music geek; you will certainly envy his home and lifestyle.","user":"bcrox5","rank":[5,5]},{"title":"Fantastic and Well done.","rating":10,"date":"6 December 2012","review":"The documentary is obviously of Jeff Lynne. It features stories from people he's previously worked with, and is an all around enjoyable film. Whether you're familiar with Jeff's music or not, the documentary is fun to watch. Jeff Lynne seems to have always gone under the radar in terms of the musical industry, because he really isn't trying to achieve fame or fortune. What he's doing is really what makes him happy. It's a shame there aren't more videos like this, and from what I hear, it is coming to DVD, and hopefully Blu-ray in very early 2013. Jeff Lynne really should be in the Rock and Roll Hall of Fame, and this documentary just proves it. With all of the accomplishments Jeff Lynne has made, it's a wonder he isn't in there already.","user":"Chrisweil265","rank":[14,19]}]