[{"title":"People are missing the point","rating":10,"date":"4 May 2019","review":"By now, people know about Ted Bundy and what a monster he was. But people who are saying this movie is boring, I believe they are missing the point. It's not about the Gorey details of his crimes, it's about Bundy's relationship with people and how manipulative he was.<br><br>I am a true crime fan and have always considered myself \"too smart to fall for such evil\", but I have to admit, there were times when I found myself rooting for Ted Bundy and then realized what I was doing. If you let yourself be fully submerged in the movie and toss out any expectations and what you think you know about Ted Bundy, I think you will be pleasantly surprised at what you are able to feel about someone who was a living nightmare. It made me realize why so many women could have actually fallen for Bundy's tricks.","user":"jentrymoore","rank":[889,994]},{"title":"Dont watch the Ted Bundy tapes before.","rating":7,"date":"3 May 2019","review":"I love the cast but I think if you want to watch the movie dont watch the Ted Bundy tapes 1st. Watch them after then you will like the movie.\nAs I believe it is told mostly from Elizabeth's point of view.\nI saw the tapes first then the movie. So I kept scrutinizing the whole time or waiting to see scenes that didnt come up here.<br><br>Otherwise great work . Zack and Lilly were great as usual.","user":"nokuthuland","rank":[257,304]},{"title":"If you accept it as an exclusively performance-based movie, then you will enjoy it","rating":9,"date":"30 January 2019","review":"\"Extremely Wicked, Shockingly Evil, and Vile\" has been inspired by the atrocious murders committed by Ted Bundy. The director Joe Berlinger has chosen a different style to tell viewers the charismatic murderer's story. Maybe all the viewers may not like his style of storytelling, but I am one of those rare viewers who loved and enjoyed it.<br><br>The main reason I enjoyed it so much is because the director has not followed the so-called norms and rules of a clichéd serial killer movie ; for instance, showing all the murders in slow-paced and full details, repetitively confirming the fact that a particular character is really a sociopath by presenting 8 or 9 scenes of him/her in fits of violent anger, and so on . Instead, Mr. Berlinger has decided to show us how intelligent, charismatic, innocent-looking, and convincing a serial killer can be in real life.<br><br>The first half of the movie is conveyed through the perspective of Liz Kloepfer (Lily Collins), who was the girlfriend of Bundy. The second half is mostly based on the trials / courtroom sessions of Ted Bundy (played by Zac Efron). I would like to mention the fact that Zac Efron has given a brilliant, powerful, charming, and darkly captivating performance as the serial killer Ted Bundy.<br><br>Zac Efron's performance is the greatest highlight of this movie. He presents the killer's intelligent act of playing innocent so brilliantly. Other outstanding performances are that of Lily Collins, who plays his longtime girlfriend Liz, and John Malkovich as the sharp-tongued judge. This is a performance-based movie, and if you want to see great performances by good actors, then watch this one and ignore the negative comments that some people will make about flaws with the story, screenplay, and other excusable and unnecessary mentions of minor errors here and there.","user":"svhot","rank":[403,488]}]