[{"title":"Taken","rating":6,"date":"20 February 2020","review":"This is my biggest guilty pleasure of all time, I know this film is God awful, from the directing to the writing and the stereotypical villain but I honestly don't care it was just popcorn entertainment and seeing Liam Neeson as Bryan Mills is always good. The plot of this film is basically the plot of The Fugitive. This film is so bad it's good and that's why I give this film 6/10.","user":"MR_Heraclius","rank":[36,37]},{"title":"A shockingly disappointing finale, 'Taken 3' is a disgrace to its star Liam Neeson and an appalling display of ineptness by its director Olivier Megaton","rating":3,"date":"7 January 2015","review":"To set the record straight, no one gets taken in 'Taken 3', a condition that its principal star Liam Neeson laid down before he agreed to return for this third and presumably final instalment. That is perfectly fine with us; after all, how many times can ex- Special Forces operative Bryan Mills find himself having to deploy his very particular set of skills after a member of his family is taken away from him? Indeed, that is not the issue we had with this utterly disappointing third outing, which totally squanders what audience goodwill the first movie had accumulated and its immediate predecessor had not yet depleted.<br><br>Produced by French-based EuropaCorp, the Luc Besson and Robert Mark Kamen-scripted 'Taken' was one of the most notable action films in recent memory when it was released back in 2008. Key to its success was Neeson, whose viciously efficient qualities as the former CIA badass were excellent complement to the actor's natural gravitas and air of gentleman nobility. The inevitable sequel that followed four years later was a letdown to say the least; not only did it slavishly repeat the original's formula, it toned down the former's no-holds-barred brutality to make it more accessible to a younger audience, and in the process losing the former's gritty, visceral, and even transgressive edge.<br><br>Unfortunately, fans of the original hoping that the series would go out on a bang will be sorely disappointed to know that 'Taken 3' is cast in the same mould as the sequel. There are plenty of gunshots but no sight of blood. There is hand-to-hand combat that plays out more like a playground brawl between teenagers. Even a torture scene that sees Neeson waterboard fellow co-star Dougray Scott is extremely tame in comparison with a similar and brutally memorable one in the first movie, that if one recalls involved the use of electric clamps that Neeson stabbed into his nemesis' thighs. Not that we relish the portrayal of extreme violence, but 'Taken 3' seem to know not the difference between being restrained and being dull.<br><br>But the deadened violence isn't quite the movie's most critical flaw; that belongs unquestionably to its director Olivier Megaton. A Besson regular since 'Transporter 3', Megaton took over the reins from Pierre Morel on 'Taken 2' but has apparently learnt nothing from his previous directorial duties. If there was already a worrying ineptness to his ability to craft a proper action sequence in 'Taken 2', then this follow-up shows Megaton at his most incompetent.<br><br>Clearly influenced by Paul Greengrass' frenetic shooting of the 'Bourne' movies, Megaton insists on flailing hand-held camera-work, frantic over-editing and claustrophobic close-ups to ruin every single action sequence in the entire f**king movie (and yes, it is indeed that frustrating to watch). A freeway car chase is reduced to a flurry of close-ups and rapid edits that bear no continuity or coherence. A confrontation in a liquor store between Neeson and some of the Russian mobsters who took his ex-wife's life is shot in such close-ups it is impossible to make out who is doing what. And worst of all, there is no climax to speak of – not when a shootout between Neeson and another group of Russian mobsters protecting their boss Oleg Malankov (Sam Spruell) is so poorly staged it makes not a single iota of sense, or when a race between a Porsche driven by Neeson and a private plane ends in an collision that takes out the plane's front wheel but leaves no one hurt.<br><br>It is even more infuriating to think that Megaton manages to f**k up every single sequence when there aren't that many to begin with. Eschewing the simple set-up of the previous two films, Besson and Kamen have instead opted here for a more plot-driven narrative, setting Neeson up against Forest Whitaker's LAPD Detective Franck Dotzler even while the former hunts down his wife's killers. That certainly recalls the dynamic between Harrison Ford and Tommy Lee Jones in 'The Fugitive', but 'Taken 3' is nowhere as smart and Whitaker nowhere near as keen as Jones' ever was. Though Besson and Kamen's script opts for double-crosses, hidden agendas and whodunits to keep their audience's attention, it is quite clear right at the very start just who has been pulling the strings, a mystery that once solved makes the rest of the proceedings unnecessarily protracted.<br><br>Not that it actually matters – while Neeson went about methodically tracking down his kidnapped family in the first and second movies, he rarely exhibits the same kind of discipline clearing his name here. Too much time is spent on emotionally hollow character relationships in the first act, i.e. between Bryan and his young adult daughter Kim (Maggie Grace), or between Bryan and his ex-wife Lenore (Famke Janssen), or between Bryan and Lenore's current husband Stuart (Scott), while the second act is equally wasted on Bryan's strenuous efforts to contact Kim who is placed under the close watch of the LAPD. By the time Bryan actually gets down to investigating, almost everyone involved looks more keen on getting it over and done – none more so than Neeson, who looks tired and completely uninterested from scene to scene.<br><br>Perhaps Neeson is all too aware that the 'Taken' franchise has completely sputtered out; indeed, 'Taken 3' plays almost like a parody of the original movie, which was to action fans a sheer unbridled delight for its realistic stuntwork and hand-to-hand combat. Both these elements are sorely and sadly missing from a movie that can't even get its priorities right, no thanks to the utter shocking ineptitude of its director. Like we said, no one in the movie gets taken, but little did we know that the title was meant to be a joke on its audience, who are literally taken for a ride here. Spare yourself the agony, frustration and disappointment, and just NOT get on in the first place.","user":"moviexclusive","rank":[243,340]},{"title":"So terrible it was actually funny","rating":3,"date":"12 January 2015","review":"3 stars might be a little harsh seeing as I did enjoy this film, but I enjoyed it for all the wrong reasons. Seemed like a movie made by idiots for idiots. Anyone who is mildly intelligent will find it laughable.<br><br>Where do I start, the way this film was shot was poor at best, no scene lasted longer the 3 minutes to try and achieve the same relentless pace we enjoyed from the first Taken movie. This was even worse during any action sequence where there would be about 20 different shots in a space of 30 seconds showing pretty much the same event from pointless angles. <br><br>The dialogue, so cheesy, they put in every cliché line from any action movie you can think of, one dimensional characters sounding like idiots. There was a moment in this film where Mills plugs in a USB into a LAPD computer and the computers voices says \"You are currently accessing the LAPD hidden files\" just in case people in the cinema missed this. <br><br>This movie treats its audience like they are slow, and I feel you actually have to be to enjoy it for what it is. Some of the actions sequences were so unrealistic even a 9 your boy would find it a push to believe let alone us adults. Poor way to end a dying trilogy. Hopefully it will now stay dead.","user":"Mindu15","rank":[224,323]}]