[{"title":"Ruined by Over-The-Top Action Scenes","rating":7,"date":"20 September 2014","review":"A good South Korean thriller with a fantastic premise, but ultimately brought down by its over-the-top action sequences. Its really too bad the director though the movie needed more 'action scenes', when the suspense and storyline provides more than ample amount of excitement! South Korea is proving to be one of the most exciting filmmakers in the world, but this entry just barely lives up to that title. There are FAR more exciting and well put together SK movies out there, such as, 'Oldboy', 'Memories of Murder', 'Mother', 'I Saw The Devil', and quite a bit more.<br><br>Full Review at: www.simplefilmreviews.com/2014/05/confession-of-murder-2012.html","user":"MattBirk","rank":[23,28]},{"title":"Engaging Thriller","rating":8,"date":"26 September 2015","review":"In Korea, the serial-killer Lee Du-sok (Shi-hoo Park) has killed ten women and there is another one missing that the police department believes he is the responsible for her disappearance. After fifteen years, the statute of limitation expires on his last murder and Lee Du- sok publishes a book describing each murder in details. Detective Choi (Jae-yeong Jeong), who was in charge of the investigation of all the ten murders, chases Lee Du-sok and challenges him to tell where the eleventh victim is. Meanwhile, Han Ji-Soo (Young-Ae Kim), who is the mother of his last victim, seeks revenge with her family and friends. The owner of a sensationalist television network invites Lee Du-sok and Detective Choi for a debate live. Out of the blue, a man with the alias \"J\" calls the TV during the debate and tells that he is the real killer and Lee Du-sok is a fraud. Who should be the real killer?<br><br>\"Nae-ga sal-in-beom-i-da\", a.k.a. \"Confession of Murder\", is an engaging South-Korean thriller with a great story. The performances are top-notch but the main twist is predictable and explains the behavior of Choi, despite surprising many viewers. There is also a criticism to the behavior of the media and public in general, worshipping a serial- killer because he is handsome. The only remark is the excessive and exaggerated action scenes; however they are part of the entertainment. My vote is eight.<br><br>Title (Brazil): \"Confissão de Assassinato\" (\"Confession of Murder\")","user":"claudio_carvalho","rank":[17,20]},{"title":"Sacrificing a big punch for successive slaps. A good, creative thriller nonetheless.","rating":7,"date":"25 May 2017","review":"This movie was a strange mix of cartoon-funny, thriller, noir and drama, all packed in an adventure.<br><br>There are some twists you don't see coming, and when they do, they come down pouring. Some may find them predictable but considering the pacing of the movie I do not deem most of them predictable, except the first one, and this is not actually good all because of timing. Since I do not intend to share any spoiler here, it will be hard for me to explain my point of view, but I will give it a try: The movie twist-bombs you during a single scene of confrontation up until which you had time to dwell on possibilities but wouldn't, in my case at least, because I was too busy savoring the rich performances, an already gruesome and captivating story, and even if I saw a twist coming and try to wrap my head around it, it was hard for me to let the next twist sink in amid all the empathy the story and some of the performances forced me to experience. The shockers in this movie are serious in content and this crowd of twists causes a desensitization in the viewer that doesn't let the whole thing sink in. Where there could be a punch, these are like successive little slaps in your face.<br><br>I find the cartoonishly unrealistic scenes in the movie to be a treat. It was nice to watch but it also had a function: it gave a glimpse of the new characters that were introduced, the way a caricature does.<br><br>The social commentary is where the perfectly executed noir steps in. A great satire to public perception of psychopathy and how it is engineered by media. Might give some insight to those clueless people out there who haven't yet realized how we transitioned from denouncing behavior that exudes lack of empathy to glamorizing it, condoning the criminals it breeds, because, you know as well as I do how much we are attracted to people in Wall Street as they speculate and kill our future with a single phone call because of all that sexy hair and slick outfit and their \"intelligence\". Well, there is no \"high functioning\" psycho in the movie, but the commentary nails it nonetheless.<br><br>It is the pacing of the later twists with respect to twist content that led me to give this one an 7. The punch vs slap thing, in other words.<br><br>It is a great thriller tainted with abundance of stuff at the cost of more important stuff. The actors in this movie did a great job and character development could have been much better had the script allowed room for it. Come to think of it, this movie should have been at least half an hour longer. As it is, it feels like they crammed it all in 1.5 hour so as not to cut it short.<br><br>If you are binge thriller watchers, watch this one. It is a nice Korean thriller by all means. If you look for more in a movie, then I think it is still worth to give a shot. My guess is that you will be both delighted and disappointed but you will be nowhere near \"what did I just watch?\". No. This one's better than that.","user":"bricslove","rank":[8,9]}]