[{"title":"Nice little atmospheric horror film without any body count n jump scares but the tension is maintained.","rating":7,"date":"22 April 2018","review":"Saw this on a rented dvd. Been on my radar for a long time.\nThe plot is about a couple and their infant baby who moves into the backwoods of Ireland.\nThe male (Joseph Mawle) who is an expert in microbiology has come to inspect the trees for clearance. He is warned by the local (Michael McElhatton) not to trespass the forests as the \"hallows\" will trespass into his house n steal his baby. One nite the window of the infant's room is broken but the couple is assured by the local cop (Michael Smiley) not to worry as some bird must have done it. In the beginning one will wonder why the scene of the wife (Bojana Novakovic) removing the iron grill is shown. Even the repair guy tells the husband that his wife shudnt have removed the iron grills. There is an explanation for that but not a logical one. Even the film became a lil silly towards the end.\nThe film moves at a decent pace n from the beginning there is a sense of dread. Also whenever a baby is in peril, the film becomes even more tension filled. \nTension is maintained throughout n the effects were pretty good. Some may be bored as there is not enuff creature action n the body count is almost zero. But if u enjoy atmospheric horror film with enuff moments of tension then u will enjoy this film.\nI wish Michael Smiley's role was bigger as i like that actor's comic timings n his face itself is smiley like his surname.","user":"Fella_shibby","rank":[32,34]},{"title":"Starts OK, gets better, then gets silly","rating":6,"date":"17 August 2015","review":"The premise of \"The Hallow\" is nothing new: a family in an isolated house in the woods. Strange things start to happen. Is there a logical explanation (unfriendly neighbors who want the family away) or is there something supernatural in the forest?<br><br>Unoriginal concepts in the horror genre are not a problem per se; old stories can always be told in new, refreshing ways (see \"Insidious\" or \"The Conjuring\", for example). But \"The Hallow\" doesn't have the energy to keep things interesting until the end, despite a strong middle act and good performances from the cast.<br><br>The film starts OK, then it gets better and more tense. Some sequences in the second act - when it's fully revealed the cause of the disturbances - are genuinely frightening (plus, that poor baby suffers a lot). But then the script gets lazier and lazier, unfortunately. Inconsistencies abound, jump scares replace real tension, and by the end I was just bored. It's a pity. It could've been a small horror gem.","user":"your crowbar","rank":[57,76]},{"title":"Cinematically beautiful, Hardy's vision stands out in this marvelous indie creature horror","rating":7,"date":"29 October 2015","review":"Pulling from ancient Irish fables and mythology, The Hallow, also known as The Woods, takes the fairy tale atmosphere and destroys it with malevolence and foreboding darkness.<br><br>Tasked with unfortunate responsibility of going into rural Ireland's natural landscape, British conservationist Adam Hitchens must venture into the woods and choose which trees are right for milling. The townspeople warn him that he doesn't belong, that in those woods are land belonging to the Hallow, tiny little ancient tree fairies who were driven from their sacred lands. Ignoring their warnings, Adam and his family quickly find out there's truth in mythology, and fight to survive the night against these demonic creatures.<br><br>The Hallow is an effective horror because it does not rely on one type of horror, imperative of those select creature genre flicks which always end up disappointing. The horror is multi-layered, initially relying on the foreboding sense of unrest from the superstitious townspeople. Then it morphs into a creature horror, but just when you think its simplicity has reached a peak, it turns again, this time the utter terror and cringe inducing body horror of a dark essence invading your skin. But it's not over yet, then it adds the complete panic of a mother protecting her child at the risk of losing him forever. With all these ingredients, there is a type of horror for everyone to get you squirming.<br><br>It's rather amazing that The Hallow is Corin Hardy's first legitimate feature film. His grasp upon mood and ability to integrate story with scares while having the eye to make a visually stunning film that is overcast and dark is beyond impressive, with similar praise going to the cinematographer Martijn van Broekhuizen. His use of natural scenery, muted tones, and shadows to hide and highlight the ominous creatures of the woods is that of someone far beyond his experience. It is no wonder that, though a relative unknown, he is slated to direct the remake of The Crow.<br><br>It is clear that no aspect of The Hallow was beyond Hardy's creative reach. Everything is subtle, muted even. The music is practically subliminal, building tension naturally rather than forcing an emotion that is not organically present in the subject matter. And yet, Hardy's film has clear vision and makes a strong statement by veering past the standard three Act format and skipping from the first to the third with no middle act to be found.<br><br>Based on the execution of The Hallow, I think Corin Hardy is going to be one of the up and coming directors to watch the way James Wan took over the horror scene. The Hallow may not be as a resounding scream of an announcement of talent as Saw was for Wan, but is surely the whisper to get Hardy started.<br><br>7.5/10<br><br>Please check out our website for full reviews of ALL the recent horror releases.","user":"ArchonCinemaReviews","rank":[33,46]}]