[{"title":"American Marketing Scam","rating":3,"date":"4 October 2016","review":"This film was originally called Bind but then they decided to do some marketing scam in conjunction with the Conjuring films. They figured it needed it and they were right. This is one awful movie so if they don't get you buying it by mistake, chances are you won't.<br><br>A family moves into a house that used to be an orphanage at one time. Tragic events took place making even more tragic events take place and so on. The film has a few things moving on its own but the crux of the hauntings are more of the spirit taking over someone's body to make them kill. The acting was so bad in this and the ending was one of the worst I've seen in a long time. Avoid this one.","user":"shawnblackman","rank":[29,32]},{"title":"Shamefully bad.","rating":1,"date":"17 August 2016","review":"It's illuminating, I think, to consider the fact that \"bad\" movies have as much complexity and dimensionality, in their way, as \"good\" movies. After all, there are nearly as many facets to a bad movie is there are to a good movie. Just like a good movie, a bad movie must have music, sound effects, visual effects, a story, actors and acting, lighting, recording, editing, and so on.<br><br>In the same way that you could take an entire university course on what made \"Citizen Kane\" a great movie, you COULD similarly take such a course on what made \"American Conjuring\" a bad movie. You wouldn't want to do it, of course, but the point is that there would be that much information to study and learn about what made it such an incredibly awful picture.<br><br>That being the case, it would take far more than the space I have here to fully elaborate on the depth and breadth of the execrable- ness of this movie.<br><br>But I will make one observation. For every human endeavor, and especially in art of any kind, sometimes an example is so incredibly appalling that it makes you feel bad for the people involved with it. You get the sense that they've \"been punished enough\" by simply being associated with such a steaming pile that you don't want to be responsible for adding to their misery. Let them mercifully scatter into the dark and concealing night.<br><br>\"American Conjuring\" ALMOST achieves that forgivable state. Almost.<br><br>The reason it DOESN'T is because the movie is CALLED \"American Conjuring\". Anyone with a suspicious mind might think that the creators of this movie were attempting to capitalize on the success of other relatively recent but unrelated movies that have the word \"conjuring\" in their titles, and that they were hoping to confuse people into paying good money to watch this fly-blown manure accidentally. This would suggest evil intent and malice aforethought rather than a sad and hapless set of talentless people tragically exposed for their artlessness.<br><br>Personally, I'm not suspicious of such a thing at all. Nope. Not suspicious.<br><br>The sound and video masters for this movie need to be taken out on a moonless night and buried deep beneath cursed ground, sprinkled with salt, and hosed down with holy water. I'm precluded from suggesting what should happen to the people responsible for it.","user":"S_Soma","rank":[18,22]},{"title":"Tedious And Choppy (No Pun Intended)","rating":2,"date":"17 August 2016","review":"No great stuff to write here, just a (very) small chuckle for the title of a horror film set and filmed in Canada. If they'd left the original title 'Bind' it would at least have been a bit different. Regular (read boring and predictable) stuff happens here and the movie - especially the ending - has no cohesion or clear story line.<br><br>When one can't produce a scary enough story, they always go for killing animals - people hate that. Kill 100 people, okay - but kill one dog, oh the horror!<br><br>BUT if you want to fast forward to the end, you'll see a lot of famous names (and horror sites) listed under \"Special Thanks\". I wonder how many of them would pay to be removed from that list?","user":"shoy_Miss_Murder","rank":[10,12]}]