[{"title":"Ten stars for possibly worst film of this century","rating":10,"date":"29 April 2014","review":"This movie is fantastic - honestly, it's shooting up my 'So Bad It's Good' charts with a bullet (badoom-tish!) <br><br>I have no idea why Danny Glover's character is in it. Feels like he phoned someone and said, 'I need fifty bucks and I'm free on Sunday. Anything going down?' Peter Stormare, whilst generally good fun in crap flicks, is so utterly miscast it's borderline genius. What's that accent Pete? I can't tell if you mean to sound like a Canadian with palsy, or you were battling some gastro/intestinal thing, but damn bro, you sound pretty crook. <br><br>Cage with his helmet or hair or whatever that thing is on his head is brilliant. Injecting heartfelt emotion into scenes that don't need it, screaming in new and obscure ways, playing it cool after trashing 20 corpses and fifty cars, he just injects a well-needed shake-up on traditional acting. Let's be completely inappropriate and flip between ham and wood - hello Oscar! <br><br>Script has the bones of something in it, but the director has taken a leaf out of Cage's book here - let's not polish the turd, but rough it up some. Camera-work is just dire, dialogue makes the idea of a four-hour cunnilingus session on an angle grinder sound appealing, and seeing as Glover already took fifty from the budget, it left only another fifty for the rest of the film. And let's not forget such a momentous closing scene. Never have I cheered so hard for Cage. Top work fella, and the right choice. <br><br>I can't honestly ask anyone to sit through this utter tosh, but I do know I'll watch it again in the future, with a bottle of vodka in the wee hours, and laugh my ass off.","user":"manvanmusic","rank":[151,190]},{"title":"No Substance Whatsoever","rating":4,"date":"3 May 2014","review":"I thought given Nicolas Cage's recent and excellent performance in Joe that he started veering away from such mediocre movies as this one. Alas, being true to form of making both excellent and bad movies, he has made another movie which will go well when placed next to Bangkok Dangerous and the abysmal sequel to Ghost Rider. <br><br>The premise of the movie is simple enough. Cage is a reformed criminal who has left his past behind and become a successful businessman in order to be there for his daughter after her mother died. He has settled into his new legitimate life with his daughter and his new wife. One night when the daughter is left home alone with two guy friends, 3 masked assailants enter the home and kidnap the daughter. Cage's character then goes on a murderous rampage against the Russian Mafia and everyone else in order to find her. Chaos ensues. <br><br>Major Spoilers Ahead:<br><br>Soon his daughter is found dead, shot by a Tokarev (a Russian made) hand gun, and Cage's character assumes it was a retaliation murder for something that him and his two friends and partners in crime did years ago. And from that point the movie becomes one fight and chase after another with some beatings and torturing to boot. Cage's character goes ballistic and tortures and kills Russian mobsters. The police do nothing to stop it, and the Russians retaliate since they have no idea why they are being attacked in the first place. In the end, it is shown that the daughter was killed by accident by the gun that her father had in his house for years and conveniently forgot about. <br><br>Overall the acting is bland and the supporting cast contributes very little to the movie. Danny Glover unfortunately adds nothing to the movie which is a shame as he is a good actor who had nothing to do in this film.. Cage's performance borders on manic and in the end is not memorable for the right reasons. There is a scene where he is supposedly grief stricken and screaming on a rooftop after casually murdering someone and it wasn't believable. The story has so many plot holes and implausibilities that a tank could drive through them. For example:<br><br>Cage's character forgetting that he has a Tokarev handgun in his home, and assuming that it was the Russians who kidnapped and killed his daughter. What have they been doing for the last 15 years? Biding their time? And if they wanted to kill her why did they kidnap her first and not just shoot her in the house. The fact that Cage's character forgot about it and apparently knows little about guns is unbelievable given his criminal background. Then he assumes that one of his friends ratted him out to the Russians. The same friend who has been helping him from the start. Even though the Russians have no clue who is attacking them and why. The cops who know what he is doing but do nothing about it apart from warning him that if he keeps it up he will be arrested. This is after a massacre of Russian drug dealers in a house and a chase through the city the day after. Makes no sense. No policeman would allow a murderous rampage and say you go and I'll take care of it. These are just some of the weak points of this movie. And there are more of them.<br><br>In conclusion, I would give this about 3.5 out of 10. Not the worst action movie out there but not worth wasting your time on either. It has no substance whatsoever and the characters in the movie become increasingly unlikable as the movie goes on. It tries to emulate Taken and fails. Avoid it if possible. On the bright side, if you do watch it you will forget almost all about it by the next day.","user":"nebk","rank":[10,10]},{"title":"nick cage reaches new low","rating":3,"date":"25 April 2014","review":"Nick Cage has made some good movies, some mediocre movies and some bad movies; Tokarev is the worst. A trite, improbable plot, terrible directing, awful music and inane car chases. I kept hoping it would get better, but though hope may spring eternal, this film dashed all hope. At the end, I presume this was some sort of money laundering exercise for a criminal gang. You know, take a dog's breakfast of a script, use a major star,pay cash everywhere and sell the rights for clean money.<br><br>There is nothing to recommend this film. All the acting is sub-par. Not once is there an ounce of emotion created that would reach the audience. To the criminals who made this film I say, okay wash the money, but find a better film. It may be a crime to laundry money, but the real crime is making such a bad film","user":"meggafish","rank":[181,240]}]