[{"title":"Good movie, if you're not expecting a genre flick","rating":8,"date":"7 February 2015","review":"I kept having to double-check whether the IMDb rating I was seeing was for the right movie.<br><br>This movie is good. It doesn't even look low-budget, if you ask me. The production values, the sets, the props and effects, and even the acting are all pretty well up there in quality and are actually above-par for an indie flick. In fact, the only clue I can see for this even being an independent film is the lack of celebrity actors. Plop a couple famous faces in here and I think anyone would be hard-pressed to tell the difference from a Hollywood production.<br><br>The only explanation I can see for the poor ratings is that people were expecting a sci-fi flick and are judging the movie's compliance with that expectation. I've seen this phenomenon before, and it's sad, because good movies end up without the recognition they deserve.<br><br>This is actually a good movie, in nearly every way. It's basically a war movie with a touch of sci-fi, and in that regard it's actually rather exceptional. It's well-written and well-acted, with convincing combat, and an interesting and original story. It's my hope that people disregard the low ratings and give movies like this a shot anyway.","user":"equazcion","rank":[127,140]},{"title":"Most underrated film yet","rating":8,"date":"19 February 2015","review":"I'm truly grateful my instincts served me. The trailers were not great and the IMDb ratings for this film were awful... but I watched it anyway. IT WAS GREAT. No criticisms at all. I guess if you think 'hollywood nonsense' all flash no story makes a great movie, then this isn't for you. <br><br>If you liked movies like District 9, then this will be right up your alley. <br><br>Great characters, great story, great cinematography, great effects and great action!<br><br>I hardly EVER write reviews but just HAD to to try to make up for the poor reviews by idiots who have no idea...","user":"jager-marc","rank":[68,80]},{"title":"It's a good waste of time","rating":8,"date":"16 February 2015","review":"This movie deserves so much more attention and praise than it have gotten. You need to give this movie a chance, the acting is good. The story although slow to begin with is very engaging and well written. I have heard people say that the special effects are cheep, but honestly i have no idea where they get it from, first of all there aren't that many and the ones that are there looks perfectly fine.<br><br>Regarding the story, its feels like what a sequel to \"Battle Los Angeles\"could have been. So if you liked that movie, i guarantee you will like this one, even if you like \"war/conflict\" movies you will like it, if you like sci-fi you will like it.<br><br>I personally really enjoy these movies that come in from the side lines, having not been over hyped or expected for 6 months, and then out of no where it will provide you with an hour and 45 minutes of very well made entertainment.","user":"andersdalsgaard","rank":[44,53]}]