[{"title":"a different kind of job qualification","rating":5,"date":"2 November 2014","review":"Greetings again from the darkness. Familiar faces are everywhere in this crime thriller from husband and wife filmmakers Richard Gray (director) and Michele Davis-Gray (writer). The familiar faces make the most of a story with no shortage of characters or sub-plots, though sometimes the movie tries a bit too hard to be gritty and hard-edged.<br><br>Jerry O'Connell plays Joe Mulligan, a former basketball star turned club owner and drug dealer. Joe is dealing drugs to pay off his dead dad's debt to loan shark Luis Guzman, all while keeping his dream of hosting his own cooking show on the Food Network. See, Joe is mostly a nice guy caught up in an ugly world. This world includes his brother Holt (Justin Long) who may not be the straight-laced guy he first appears as, his drug boss Bobby (John Corbett), Bobby's henchman Frank (Steven Bauer), and William Spinks (John Savage) as the powerful guy who demands a set-up in exchange for a big pay day.<br><br>The set-up is on track until one of the freakiest fatal accidents strikes Sadie Hill, the object of Spinks' attraction. Desperate for the money, the bumbling drug dummies, decide to find a substitute. Enter Joe's customer and Holt's squeeze as the titular lookalike. Gillian Jacobs (TV's \"Community\") as Lacey does a nice job making us believe she is just desperate enough to agree to the job. Yes, desperation is a trait shared by most every character in the movie  even the detective played by the always reliable Gena Gershon. The final character of note is Mila (Scottie Thompson), who plays the \"girl walks into a bar\" role and proceeds to muddy the water in this big plan. Both Ms. Jacobs and Ms. Thompson flash the ability necessary for more ambitious projects.<br><br>Slow-motion and cheesy music negatively impact some of the dramatic moments and the sex scenes  especially an otherwise effective cross-cut between O'Connell and Long as they seduce Thompson and Jacobs, respectively. Still, for a rainy day mindless crime thriller that won't require much investment, this one is satisfactory and offers a chance to catch up with some of our most familiar character actors.","user":"ferguson-6","rank":[24,32]},{"title":"starsIT'S FOR A ROLE","rating":4,"date":"8 September 2018","review":"William Spinks (John Savage) is a successful business man who is willing to pay big money to have sex with his former business partner's daughter who he knew many years ago. He doesn't know exactly what she looks like today, but managed to confirm her identity with a phone call. Due to a light accident our gal Sadie expires. The men who made the arrangement need a lookalike (Gillian Jacobs) because they don't want to pass up the large sums of money involved. The quest then touches on our subplot of two brothers who deal and use drugs and the women in their lives. This also involves some improbable coincidences so that the story could have some interest.<br><br>The characters really didn't grab me. You find yourself rooting for the bad guys trying to do a little good. The film includes a deaf girl with a fake leg (Scottie Thompson), because...I am not sure why they wrote the part that way.<br><br>Would make for a low expectation rental. Not a keeper.<br><br>Guide: F-bomb, sex, stripper nudity (Emily Jessie Thomas +other)","user":"nogodnomasters","rank":[4,4]},{"title":"Pretty much a hot mess.","rating":5,"date":"4 May 2018","review":"Despite lots of good actors, this film (story line) is all over the place. Meg.","user":"Talos","rank":[4,5]}]