[{"title":"David takes on Goliath ,,, and David wins","rating":9,"date":"24 January 2017","review":"You have probably wandered into this review expecting some kind words about a \"good effort\" from Warner Animation but, of course, compared to the concurrent zillion-dollar Dr. Strange epic from Marvel, \"no cigar.\" Well, you would be wrong.<br><br>For two reasons.<br><br>First, in spite of the big budget, and the big Benedict, Dr. Strange suffers from all kinds of narrative problems, and gaps in continuity. Mainly, I think, the result of trying to cram too much into a film -- trying to give a typical Marvel backstory while at the same time trying to present an exciting self-contained thriller.<br><br>(Dr. Strange also suffers from following too closely the original arcs of the original comics. And, before you start pounding on the NOT USEFUL key, you should know that this reviewer not only read all the originals in the series but actually SUBSCRIBED to Dr. Strange back in the day, which meant that the nice Marvel people actually mailed me each issue as it came out. In an envelope. The original story arcs were far from Marvel's best, compared to its better-known heroes, featuring the same two villains over and over, Nightmare and Dormammu, each taking turns boring the reader to death.) <br><br>Which brings us to this ambitious JLA entry, an attempt to show that the mighty DC library can possibly take on the mighty Marvel library, sort of a David Goliath thing....? Frankly, they nail it.<br><br>Part of the fun is the script. Man, is it tight. One of the best I have ever encountered in a \"superhero\" animation. Early in the story, a hot babe who is actually the essence of Constantine's magic house does a 30 second analysis of Batman and concludes he is mainly pain and darkness.<br><br>\"How do you manage?,\" she asks sincerely. <br><br>\"I HAVE A BUTLER\" Batman responds deadpan.<br><br>That is one of the best lines of dialog I have ever encountered from DC. You could even hear the guys over at Pixar getting nervous. And, even better, the quality of the writing holds up for the entire film. Wow.<br><br>To sum up, the high score is because DC/Warner attempted the impossible, taking on a Marvel live action film with their own animated product at a fraction of the cost, and more or less pulled it off. And because the boyz at DC/Warner understood that sometimes less is more, and wisely kept the other (over-exposed) members of the JLA in the background. And, most of all, because this is an entertaining and engaging film.","user":"A_Different_Drummer","rank":[137,172]},{"title":"Different but ended up being the same in the end","rating":7,"date":"30 January 2017","review":"\"Beings with supernatural powers join together to fight against supernatural villains. This team of supernatural beings include John Constantine, Zatanna and Jason Blood also known as the demon Etrigran.\"<br><br>Directed by Jay Oliva, Justice League Dark brings a new story with different characters. It started off well, intriguing and different, but ended being a cliché movie. Still entertaining and fun to watch, but a bit disappointed at the end.<br><br>The actors were all great. Got to love Matt Ryan as Constantine, he's perfect, and he has a really good chemistry with Camilla Luddington who portrays Zatanna.<br><br>I feel like Batman was not needed and put in the movie for the sake of it, but I understand why DC wanted him in there, so that people have more interess in this film.<br><br>The film is rated R, but it could have been even darker... Anyone 13+ will have no problem with it, I don't see it as a 18 years old type of movie. But it's still more mature than other DC Animated movie.<br><br>Overall it's pretty enjoyable. I would recommend to take a look at it if you are interested in new characters and a different vibe. Worth a watch !","user":"TurtlesFever","rank":[19,22]},{"title":"A solid DC animated piece that will not be for everyone","rating":8,"date":"26 January 2017","review":"This movie is an interesting take on the JLD run. I do not agree with everything it does, but I do believe it holds it's own. One complaint people new to the magics of the DCU may have is that Zatana and Constantine seem to have limitless power. Trust me there are lomits, it's just this is a short animated piece, that really doesn't have time to go into that. <br><br>If you can overlook that, then this movie will entertain you, but it will fall short if they never do anything with JLD again. Over all the animation is toght, the plot is dense with out seeming to rushed, and they got personalities right.","user":"thatguyyouknow187","rank":[31,40]}]