[{"title":"Mesmerizing performance by William Hurt","rating":9,"date":"19 March 2013","review":"Recent revelations of the Lyndon Johnson taped conversations exposing the sabotage by Nixon of the Vietnam peace talks in 1968 had me reeling at the extent to which the pursuit of power and money causes politicians to cover up the facts, even if it costs lives.<br><br>Feynman was the critical independent factor which foiled such attempts when the Challenger exploded during take off in January 1986.<br><br>This factual account reveals Feynman was by chance adopted onto the investigative commission over the Challenger disaster at a time when he was critically ill. Unlike the rest of the commission members who had other agendas, Feynman approached the problem objectively and, through his popular demonstrations of physics for which he'd become famous, had the skill and passionate commitment to reveal the truth to the public. As he wrote in his report, 'For a successful technology, reality must take precedence over public relations, for nature cannot be fooled' Throughout this gripping drama you are taking the part of the underdog, frustrated at the increasing knowledge that the commission members, bar one or two, were driven by political agendas which meant the truth was trying to be covered up. Feynman represents the common man, and as such makes you part of the battle to foil the exasperating corruption.<br><br>William Hurt is magnificent playing Feynman, depicting non-conformist behaviour which is only tolerated because of his brilliance. I found his nuances of expression fascinating and wonderfully representative of how we, the public, would have reacted when faced with pompous authority attempting to control our behaviour. Brilliant stuff, and all the more telling because it is true.","user":"jegpad","rank":[36,38]},{"title":"Riveting","rating":8,"date":"18 March 2013","review":"How times flies when watching a good film! The story is compelling because it is based on real events, though the sets, script and acting also all contributed. The result is not only moving but you get a great insight into the dilemmas and vested interests that can exist at top of government and management. <br><br>The film is based on the last of Feynman's autobiographical works \"What Do You Care What Other People Think?\" so it is told from his perspective. The film shows how Feynman was pointed in the right direction. However the story is more complicated. For example there was not time to mention the role of Roger Boisjoly of Morton Thiokol who wrote a damning report about the O-rings six months before the disaster. The report was ignored. He lectured on work-place ethics.<br><br>William Hurt is physically similar Richard Feynman and did incredibly well with his impersonation. You can see Feynman in action in videos of him lecturing to a lay audience in Auckland and judge for yourself. Feynman died one year and nine months after the publication of the Rogers Commission Report with his appendix, and sadly his wife Gweneth also died the following year.","user":"johnmcc150","rank":[23,25]},{"title":"Absorbing, Entertaining, Factual. A must see to understand one of 20th Century's defining moments.","rating":9,"date":"14 April 2013","review":"After the dramatic opening scenes where realism is achieved by using actual footage of the \"Challenger disaster\", the movie slowly develops as the audience begins to realize that what they are experiencing is not merely a factual drama/documentary about an unfortunate malfunction, but rather a thriller with \"Good Guys\" and \"Villains\" The choice of William Hurt to play Richard Feynman was brilliant. Hurt is acknowledged as a character actor who lives and breathes every role that he accepts and as the movie progresses it is remarkable that the viewer becomes so involved with the character that they actually forget that it is an impersonation. Hurt who in real life is a complex, some say awkward person, brings aspects of his own complexity to the role.<br><br>Joanne Whalley is supportive as his wife, but the story is very much that of theoretical physicist Richard Feynman.<br><br>Bruce Greenwood is a vital link in the whole drama. He deserves a lot of credit for his strong portrayal of General Kutyna a disciplined loyal military man who acts as the catalyst for the truth to prevail. Greenwood looks like he was born in a uniform. He assumes the role as naturally as if he'd taken leave from the battlefield to make the movie.<br><br>Eve Best provides a solid and sensitive performance as Sally Ride (First woman in space). Her role in the Rogers Commission remains a mystery and we only learn of it just before the credits roll.<br><br>Brian Dennehy as William P. Rogers (Chairman and, former secretary of state) exudes the physical appearance of a persuasive man who has his own agenda and delivers a powerful performance. Dennehy is a master at conveying meaning in a story merely through the raising of an eyebrow, a glint in his eye or a subtle shift of body position.<br><br>One needs to make special mention of the good performance by many of the South Africans who were used in supporting roles. In particular Robert Hobbs who plays Allan J Macdonald a man torn between doing what is right whilst realizing the personal cost that might result.<br><br>There is no mention of the members who made up the \"Rogers Commission\". (Not even in the credits). The commission was comprised of some of the most influential members of the military and should surely be identified.<br><br>James Hawes directs with firmness and allows the story to flow and develop with fascinating insights into Feynman the scientist, but also Feynman the man and husband who had to fight his own person battles as a subplot.<br><br>Lukas Strebel camera shots are interesting. I feel the use of camera positioning where half the frame is blocked was at first novel, but maybe repeated too often and in some scenes it would have been better to allow the subject to take up the full frame.<br><br>The ending comes suddenly almost as if the editor had to condense the material into exactly 90 TV minutes. It is rumored that there might be a movie release where the running time will increase to 120 minutes. The Challenger is scheduled for the Discovery channel in the USA in November. Most probably renamed \"73\" – (Challenger broke apart 73 seconds into its flight).","user":"iwhoknows","rank":[16,17]}]