[{"title":"Plenty of Camp Just Not Much Fun","rating":3,"date":"14 October 2013","review":"One of the biggest divides that seems to exist between concept and approach in filmmaking is that of the B-movie – a lark simply meant to amplify camp, kitsch and fun to delirious levels. But what seems to be more often the case is the arrival of flicks which approach the genre superficially, revelling in lazy dialogue, dull slaughter and gore and boring characters rather than applying a grindhouse feel to well though out material. While there are some attempts to spoof the well worn tropes of this type of endeavour, too often does Zombie Hunter cheat the audience, revel in its laziness and fail even to live up to the gimmicky promises plastered on the DVD case. <br><br>Let me get the bluffs out of the way first, because these are not so much spoilers as they are an accurate description of events. In quick succession: Danny Trejo appears in little more than a cameo, the souped up muscle car exits the picture early on and the \"clown with a chainsaw\" represents little more than a blip. And in case you have no idea what this movie is about and why the heck I would bring this up, yes those were major selling points present in the advertising. What remain are inane and groan-worthy dialogue and timing and delivery that rival pre- school plays and repetition at all levels. <br><br>I hate to be too harsh on Zombie Hunter because when it's all said and done it's a rather innocent endeavour, never vying for much, featuring thesps who in some cases are experiencing their debut roles and, despite its many pitfalls, is never insulting. It's all just rather wrongheaded and draining. The weird highlight for me was in lead Martin \"Hunter\" Copping who's growling, monotonous delivery seemed to craft a character that was just as nonchalant concerning the apocalypse then about the junk in which he was starring. Don't get me wrong, it's all very bad and very one note but his attitude made the viewing more tolerable.<br><br>The rest of the cast is made of folks – truly no offense as I'm sure I would join their ranks if I attempted to act – who have little hope of securing steady jobs in Hollywood. The dialogue may be horrid but they make no effort to bring it to life. Even a hammy, hackneyed script can be given a weird sense of charm with the right performer delivering the lines. It's immensely clear across all fronts they are waiting on prompts and very likely gazing at cue cards. Their infuriating actions and their interactions displayed amongst one another do very little to right any wrongs. <br><br>But as I iterated early on, there are clear – and surprisingly successful – attempts to spoof the style of film in which Zombie Hunter eventually revels. Hunter has some amusing early scenes with the undead as does the prologue (which explains the outbreak) have some charm in its own way. Coupled later on with zoom-in shots of a girl's butt, substituted for her, you know, face when running away from a threat, or a puke-off that spoofs the \"grizzly discover\" cliché, there are scenes that show promise. But collectively their relative occupation of the running time leaves much to be desired. <br><br>In the end, Zombie Hunter is only something that could be recommend with the disclaimer it be played in the background while you and your friends shoot the *bleep* and sip some beers. The thorough distain for creativity and decision to wallow in camp rather than embrace or satirize it means this B-movie simply doesn't even get a similar grade to rival its intended stamp.","user":"Simon_Says_Movies","rank":[13,18]},{"title":"Wow, just wow...","rating":3,"date":"27 September 2013","review":"This movie was like watching a bad movie spawned from the \"Borderlands\" games mixed with elements blatantly stolen from the \"Resident Evil\" universe.<br><br>The storyline was fairly straight forward, and anyone who have seen just a single zombie movie should be familiar with the essentials of the storyline here as well. A lone stranger ends up with a small group of survivors in the midst of a zombie apocalypse.<br><br>The dialog in the movie was just horrible. It was so corny and bad, that there were times when you sit there curling your toes in disbelief.<br><br>Which leads us to the characters. Wow, are you kidding me? What a bunch of generic, stereotypical and totally irrelevant characters can you manage to put into one movie? Now, I am not saying that the people acting and portraying the characters were doing bad jobs, but the characters themselves were parodies on themselves and everything in the zombie genre. It was just an atrocity to witness.<br><br>The zombies, well they were your standard low budget movie zombies; shredded clothing and usually mangled faces. Yet somehow the necks, ears and hands were also spotless and never showed a sign of decay or damage. It is the classic low budget mistake to make. And sure enough, here it was. And what was going on with the hybrid mix of Nemesis and the licker creatures from \"Resident Evil\". I was ready to get up and find something else to watch when I saw these. It was just laughable.<br><br>For some reason, then the blood in this movie was purple, and it always had to spray directly on the camera. It was annoying and tiring to look at, and it got old really fast. Purple blood, sure, why not...<br><br>Without the risk of sounding sarcastic, wait, that is exactly what I am trying to do here, then the not-so-subtle advertising for their other movies put on display in the movie was really just fantastic. Watch the movie, and you will know it immediately when you get to that scene. Way to go Arrowstorm Entertainment...<br><br>If you are credited as 'Sexy Zombie' in a movie, then you know everything is not right here.<br><br>Yet, there is something to this movie that makes you stick around to the end, even though it is campy, cheesy and have low budget written all over it. However, I can honestly say that this movie is the type of movie that you watch once and never again. As much as I love everything zombie, then \"Zombie Hunter\" just didn't have that much to offer.","user":"paul_haakonsen","rank":[21,33]},{"title":"Worst Zombie movie I have ever seen.","rating":1,"date":"25 August 2013","review":"This movie is incredibly bad. Danny Trejo - which is probably the  reason for most people to watch this flick - is only seen in three  scenes and is just doing his usual job. Being the cool, archaic guy who  is looking into the camera with a grim face. And this is the best part  of the movie.  All the other actors are just crap. Their roles are clichés as you  would expect from a movie like this, but their acting is so bad, that  you cannot even take those clichés seriously. The dialogs have been  written by some computer software which tries to bring the most common lines of all scripts into some order.  The main character plays like he had been undergoing a lobotomy. And  still he needs crappy monologues with a cheesy voice to bring his point  across.  Then there is the very bad CGI of those special monsters, which just  look like they had been animated in the 1990s. Even the Pixar table  lamp looks more realistic than they do.  It seems like the director/writer/producer has seen Planet Terror and  thought \"I can do this too!\". Unfortunately they can't. And they should  have never tried. I want those 90 minutes of my life back!","user":"dennis-302","rank":[38,69]}]