[{"title":"God loves the broken.","rating":8,"date":"8 May 2014","review":"I'm going to get the bad out of the way. If you're hoping this movie \"solves\" all the problems of the so-called \"Christian movie industry\", it does not. It is too long by at least a half-hour, we never feel like the main character really is Mullins until almost a half-hour into the film, and it seems preachier than it needs to be, often using way too much dialog to communicate messages that filmmakers should be able to make with far less talking and far more skillful directing, acting and editing. Anachronisms abound for those who look for them (certain musical equipment and instruments appear years and years before they actually were available), the lighting seems to be an afterthought, and in many cases (as I implied earlier) paragraphs of dialog abound where lines would do.<br><br>If you think this movie is just as bad as so many Christian films (virtually all that I have seen in fact) are, you'd also be wrong. Refreshingly, this film does not sanitize the smoking, drinking, cussing (okay, maybe it eases up on the cussing, I'm okay with that), broken character that Rich apparently was. That, I found refreshing. And when Michael Koch finally \"finds\" the main character (or should I say, when we finally believe in him and the director finally sets the character free), he carries it well, warts (and there are many) and all. I was impressed with how Koch sings and plays the part so well (using his own voice by the way), too, right down to the occasional sloppy piano and idiosyncratic vocal stylings. The stress of growing up with such a broken father-son relationship plays a major role, as it should, and explains much of what we need to know about the character (reminded me of Johnny Cash, actually).<br><br>I was fortunate enough to meet Mullins during his too-short life, about 7 years before his death. By \"meet\", I don't mean shake hands after a concert, but in fact along with a small group of folks got to spend hours and hours with him talking and really getting to know each other. He was, by far, the most interesting person I have ever met. So I am a little biased in saying that beyond the flaws in this film (again, typical of so many Christian movies, and of so much Christian music for that matter), is the story of a man who was worth knowing and knowing about, not in spite of, but partly because of his flaws. I can probably count on one hand the number of Christian songwriters who come close to Mullins' talent and transparency (even if I'm missing a finger or two), and I'm thrilled that this film might introduce some new people to his work. Even more, maybe more people will come to grips with the fact that Jesus not only doesn't mind their brokenness, but loves them right in the middle of it all.<br><br>That would thrill Rich the most.","user":"peter-995-748677","rank":[21,21]},{"title":"Didn't think I would like it But I did.","rating":8,"date":"8 May 2014","review":"I knew and met Rich several times when I was a Christian Concert Promoter. I have mourned his loss for a very long time. I agree with one reviewer who said that the film was rather dark and perhaps some of our darkness reflects in the film so that makes it darker. I do wish that there was a little more of his quick humored funniness that came out in the movie, but I think I understand why it didn't as much. For one reason, it was done through the eyes of close family. They hurt for his hurts and probably are closer to that at times. Especially when he's gone and you were unable to fix it for him. Second because so few saw the struggles he had which just increases the realness and the authenticity of how God works with us. But let me say this. He was an amazing profound and deep poet. He was a saint who related to Christ's sufferings equally to his blessings and in doing so almost always seemed to be directly dialed to him. Second, he had huge talent! Third he had a truly sacrificial heart! He was amazing! Lastly, I thought I would hate the film any way because after all who could ever be Rich ? Even pretend or act to be Rich? I enjoyed the film more than I thought I would. I think they did a good job that was one of the toughest. When you play Lincoln or George Washington. There aren't too many people around to know how they were in real life. I would say they did as good as they could and it was awesome and entertaining and moving! It even touched my life as a father to my kids. Was it as good as seeing Rich do Rich? Well, it was the next best thing, but wish I had more time with him. He was once in a life! Love you Rich! See this movie. You'll not regret it!","user":"darylwball","rank":[13,14]},{"title":"Inspirational , but not your typical \"Christian\" movie","rating":8,"date":"19 February 2014","review":"Rich Mullins relentlessly pursued Jesus in his own life, of which fact this movie is not ashamed. However, the movie does not portray Rich as larger than life. Rather, we meet an enigmatic man who wrestled with rejection from his father and from the love of his life. While striving to live in obedience to the commands of Christ, he struggled with sin and often confused those closest to him. His struggles did not subside but rather were compounded by his own musical success as he lived with the emptiness that still remained. Unlike in many Christian movies, sin and rejection are not something that an unsaved person or lapsed Christian is ceremoniously delivered from, but are an expected part of living in this world.<br><br>Overall, I would give the acting an 8/10; it's not Hollywood, but it's not bad either. I would give the writing a 7/10, as the dialog seems contrived and heavy-handed in a few places. Fortunately, this happens seldom and the writing is overall pretty believable. For production and cinematography, I would give it 8/10; again, this isn't Hollywood, but it's great for an indie film. From a historical accuracy standpoint, I would give it 7/10. There are a few occasions where locations of events and names of people (even those closest to Rich) were changed, but overall it seems pretty accurate. Other reviews have also mentioned one particular anachronism, i.e. that musical instruments/equipment are seen years before they were invented; the reason for this is that the concert scenes in the movie were filmed live at Mitch McVicker concerts in 2012. Having a limited budget, this movie had to make do with what it could get. As for the accuracy of the details of Rich's life: Given that many of those working on the movie were close to Rich (such as Mitch McVicker, and his brother David Mullins), I have no reason to doubt overall account of his personal life.<br><br>Rich's music features prominently into this movie, and Michael Koch (himself a musician by trade, not an actor) does a pretty good job of approximating Rich's voice and re-creating his songs. Don't be disappointed if your favorite Mullins song is not featured, though; it's only a two-hour fifteen-minute movie! <br><br>****Spoilers Ahead**** <br><br>This film is quite open about Rich's faults: His struggle with alcoholism, his chain-smoking habit, his struggle to be accepted by his father, his hapless pursuit of his love interest, and his highly dependent relationship with Beaker (whose name was changed in the film). Twice in the movie he chides Beaker for leaving his vicinity for mere minutes to perform mundane tasks (such as getting a cup of coffee from the hotel lobby). One gets the sense that Rich, for all of his shameless demonstration of the love of Jesus on many occasions, was excessively dependent on those closest to him. It is also interesting what the film chooses to focus on and chooses to ignore. For example, while the Order of the Kid Brothers of Saint Frank is described, the Ragamuffin Band doesn't get a mention. Also conspicuously absent are the details of Rich's experience on the reservation and his interest in Catholicism. But this movie does focus well on the aspects of Rich's life that it chooses to explore.<br><br>In the end, this is a story about a man who is deeply enveloped in loneliness and rejection, but who finds his solace and comfort in learning to love and obey the God who made him. As he is ignored by his fiancée' in the midst of his burgeoning success,telephone calls home seeking comfort are welcomed by a tender mother but dismissed by a calloused father. One turning point for Rich in this story is his friendship with fellow alcoholic and ragamuffin author Brennan Manning. When Rich learns of the death of his father, with whom he was never really reconciled, he is devastated. Frequent flashbacks to the paternal castigation of Rich's childhood days still haunt the grown-up Rich, who feels like he never measured up in his father's eyes. He still has trouble viewing God as father, since his own father was so hard on him. Brennan leads Rich on a mini-retreat in which Rich writes a letter to himself from his father, and comes to realize that his father did truly love him, but that he had difficulty expressing that love verbally.<br><br>The movie is also careful not to pit Rich Mullins as the hero against the Big Bad Christian Music Industry (as tempting as that might be). In one poignant scene, Rich gets in an argument with one of his producers at the record label. Although Rich seems to have some pretty valid points in the argument, the producer points out that Rich is being proud and disrespectful. In a subsequent scene, Rich begins mowing the producer's lawn early one morning as an act of reconciliation.<br><br>This movie did a good job of helping to understand the man who wrote the music. It totally makes sense to me that the man who wrote \"Hold Me Jesus\" and \"Hard to Get\" would be the same guy who showed up drunk to a friend's funeral, threw a phone through a phone booth window when he learned of his ex-fiancée's engagement to another man, and struggled with deep-seated loneliness (Sadly, in some circles of Christian piety, admitting that one is lonely brings forth accusations that one does not have a close walk with God, or that one may not even know Christ at all). Although some might lose faith in Rich upon learning these facts, I think Rich would have been okay with that. He would have wanted us to put our faith in Jesus instead. Rich often alluded to his own struggles with sin and temptation in his concerts. While not going into a lot of personal detail, he never pretended to be anything other than a ragamuffin in God's Kingdom.","user":"twodogsofmercy","rank":[8,8]}]