[{"title":"Teddy and April need more screen time together","rating":6,"date":"29 March 2015","review":"April (Emma Roberts) is a sweet girl with a crush on her soccer coach Mr. B (James Franco). He's a single dad and she babysits his kid sometimes. She also likes Teddy. They flirt at a party but end up with different people. He's drunk and high, gets a blow job from Emily, hit-and-runs another car, gets caught and is sentenced to 12 months probation community service. Teddy's friend Fred is a talkative jerk. Fred hooks up with Emily and enables Teddy's destructive behavior. April starts a relationship with Mr. B which isolates her from her friends Chrissy and Shauna.<br><br>It's a rambling teenage high school romance. Emma Roberts is so tiny that she can still pass for a teenager. She's quite good in this role. Franco is flirting with super creepy. Jack Kilmer is a slacker teen. He should have the acting gene considering who his parents are. There is an immaturity in his acting especially compared to Emma Roberts. April and Teddy are kept apart for almost the entire movie. They need screen time together to develop more chemistry. The style gives a dreamy suggestive feel. However it's disjointed with April and Teddy basically in their own separate movie.","user":"SnoopyStyle","rank":[18,20]},{"title":"A film without a plot","rating":4,"date":"4 September 2014","review":"This film is about several suburban teenagers who live hedonistic lifestyles, and slowly their lives spirals out of control.<br><br>\"Palo Alto\" shows the teenagers getting up to all kinds of trouble, but there is not really a focused plot. We get shown various events that happen to various individuals, but it is all superficial and we don't get to see any real meanings behind their actions. The plot meanders but never seems to get anywhere, with no central message to get across. I thought it was as if I watched a bunch of events happening, and that was it. It did not leave me feeling satisfied, touched or entertained. In fact, I felt a little bored by it.","user":"Gordon-11","rank":[47,62]},{"title":"\"Palo Alto\"--Typically \"Shallow Alto\"?","rating":4,"date":"6 June 2014","review":"I really, really wanted to like this movie, filmed on the street where we lived for almost twenty years. I gave it every hall pass I could, especially since I think James Franco is a gifted actor, writer and artist. Still, this is not a movie worth seeing.<br><br>The narrative focuses on shy, bored April (Emma Roberts), who comes from a family in which her stepfather (Val Kilmer), appears to be a stoner although there is no backstory whatsoever on her connection to her stepfather nor her feelings towards him. She gets involved in a sexual relationship with her soccer coach Mr. B (a smarmy and predatory character played by James Franco) when she babysits for his son. Her classmate Teddy (Jack Kilmer, in a charming performance) has a strong attraction to April but has no ability to express his feelings for her and struggles to get her attention, but mostly fails miserably.<br><br>The city of Palo Alto is presented as one high school party of drugs, sex, and alcohol after another. But the story goes nowhere. No inciting incident to pull the viewer in. Just one party after another, and one teenage tantrum after another. \"Palo Alto\" bounces from character to character, in a \"coming of age\" story that is an epic failure.<br><br>What doesn't fit is the friendship between Teddy and his seriously disturbed friend, Fred, someone he hangs out with just because he needs a friend and Fred is just there. So far, believable and sympathetic to a point: two teenagers hanging out together because they have few other options.<br><br>High school is often painful and disappointing. So is this movie. Without Coppola and Franco, I wonder if this film would have been financed, let alone filmed!<br><br>[\"Palo Alto\" is currently in theaters under limited distribution. Another, lesser known film with the same title was produced in 2007.]","user":"diana-y-paul","rank":[39,54]}]