[{"title":"Subtle and gripping, Australia shows Hollywood how to do it","rating":8,"date":"23 April 2015","review":"With so much high-octane expensive Hollywood dreck crowding out our cinemas, real gems such as Felony, Animal Kingdom (which also has the very excellent Joel Edgerton) and Mystery Road seem to get sadly bypassed or even forgotten. That isn't to say that Hollywood can't make good films (or that Australia can't make clunkers), but they seem to be few and far between and distributors who are obviously and understandably in it for the money seem to take the easy way out. Oh, and I really haven't seen enough Australian films to list any clunkers, but what I have seen is of an enviably high standard. Some reviewers here have bemoaned the lack of 'action'. Well, boo-hoo for them. I far prefer the subtlety of writing, direction and acting we get in Felony. Three different kind of cops, all in their way a little flawed, though not in a clichéd way, get caught up in a sad situation, an unfortunate incident which simply spirals out of control.<br><br>Edgerton, basically a decent man is persuaded by Tom Wilkinson's old-school cop to tell a lie after he accidentally knocks a young lad off his bike at night while less than sober. Add to these to Jai Courtney's young cop who feels he must do the right thing - though his motives are a tad murky - and you get a complex psychological drama which satisfies at every level. None of the characters is 'bad' or 'good', and each works in a pressured environment.<br><br>Edgerton scores double because he also wrote the script. I shall now be off to see what else he has written. If you manage to catch this and like great filmmaking, watch it.","user":"pfgpowell-1","rank":[16,17]},{"title":"pretty good","rating":7,"date":"18 March 2015","review":"\"Felony,\" from 2013, is a film written by and starring Joel Edgerton, Jai Courtney, and Tom Wilkinson. These actors play Australian police detectives who are brought into conflict after a tragedy.<br><br>Edgerton plays Malcolm Toohey. After a few drinks, he is driving home when he hits a boy who is riding a bicycle. The boy is not wearing a helmet and is bleeding. Panicked, Malcolm calls for paramedics. He says initially that he didn't see anything, that he saw something in the street and it turned out to be the boy. Later on he says he saw the tail lights of a car as it turned the corner.<br><br>This discrepancy is noted by a new detective, Jim Melic (Courtney). Courtney's partner is a veteran, Carl Summer (Wilkinson). Melic doesn't understand the way the incident is handled. The car was not impounded, for one thing, and the discrepancy in Malcolm's statement isn't questioned.<br><br>Melic becomes obsessed with gathering evidence on the case, particularly after meeting the boy's mother and seems to become interested in her. Summer, on the other hand, wants him to stop investigating. Malcolm? His conscience is killing him.<br><br>Good movie, if not great, with an excellent performance by Wilkinson, as always. There is something about his presence in any film that elevates it, in my opinion. He is such an excellent actor, and has such a wide range, that he draws a viewer in immediately.<br><br>Joel Edgerton approached his role in an internalized way, probably not to everyone's taste, but his performance is solid. Jai Courtney comes off in his role as a determined detective who is able to keep his emotions in check until the very end, sort of inwardly seething.<br><br>All in all, very good, also quite dark. No one leaves this world unscathed.","user":"blanche-2","rank":[11,12]},{"title":"Intelligent, tense and superbly acted.","rating":8,"date":"18 September 2014","review":"A tightly wound crime drama that oozes class, this Sydney-set motion picture follows on from These Final Hours and Predestination to continue the stellar run for Australian movies in 2014. With an intelligent and slow burning screenplay by Joel Edgerton, Felony deals with one morally murky question: what price should a good person pay for making one bad mistake? Those hoping for a whodunit will be disappointed; the tension is built through a very precise pace and layered character development rather than a complex plot or shock-factor twists and turns. That the characters are so intriguing and engrossing can be equally attributed to the splendid actors on show. Edgerton leads the way as the respected detective, family man and all round top bloke who is forced to deal with a personally complicated situation, and he delivers an almighty performance with nuance and gravitas. He's not the only one though: Jai Courtney takes a break from hard-arse supporting gigs (Jack Reacher, A Good Day to Die Hard) to bring heft and subtlety to his new cop on the block role, whilst veteran Tom Wilkinson relishes his chance to portray the experienced department head who has misplaced old-school values. A special mention also needs to go out to Bryony Marks, whose moody score is utterly sensational and brings emotion all on its own. Due to a limited release it's unlikely you will be able to catch this on the big screen, but to the top of you 'to see' DVD list this should go.","user":"Troy_Campbell","rank":[28,35]}]