[{"title":"And so it begins. Again. Literally.","rating":4,"date":"1 October 2013","review":"From the talented mind who brought you White Noise 2: The Light, Mirrors 2, and the forthcoming Leprechaun: Origins and the highly sought after Mexican director ofwell, absolutely nothing comes a new vision of a new vision of horror. Fright Night 2, being a remake of a remake, takes the exact same characters as the first film, dumps them in Romania, and instead of continuing the story in any sane fashion, decides it's just easier to start from scratchagain.<br><br>Jaime Murray as the new Gerri the vampire is completely wasted in this throw away film that lives more for moments than anything else. Particularly impressive is her little sonar bit in the tunnel of a tunnel of a subway. The rest of the cast is absolutely boring. I don't understand why the filmmakers decided not to continue the story from the 2011 (*ahem) blockbuster. Or why didn't they just create a whole new bunch of characters? Or why not try and remake the original sequel—now, THAT would have been interesting.<br><br>And another thing, why is it that all these low budget straight-to-DVD horror sequels have to be so poorly made? There are plenty of great low budget films. All you need is a writer that cares enough about the story, a director that cares about more than getting another title under his belt or paycheck, and a studio that wants to deliver a quality product to its audience. Is that so hard?<br><br>Jesus.","user":"Gregburnscds","rank":[38,47]},{"title":"This 2013 film much closer resembles the 1985 original.","rating":5,"date":"31 October 2013","review":"'FRIGHT NIGHT 2: NEW BLOOD': Two and a Half Stars (Out of Five)<br><br>Sequel to the 2011 vampire comedy/horror film (which was a remake of the 1985 cult classic of the same name) about a teenager who learns his mysterious neighbor is a vampire. This sequel has none of the 2011 film's impressive cast (Colin Farrell, Anton Yelchin, David Tennant, Toni Collette, Christopher Mintz-Plasse, etc.) and was released directly to video (on a much smaller budget, I'm guessing). It's less of a sequel and more just another remake (and probably a more faithful one at that, if I remember the original that well) except this time the main evil vampire is a sexy female professor and the film is set in Romania (where a class of exchange students are studying). The film is not as entertaining as the 1985 original or it's 2011 remake but it does have a decent amount of amusing vampire thrills and a smokin' hot femme fatale villain (played by the gorgeous Jaime Murray).<br><br>The film focuses on three exchange students studying with their class in Romania: Charley (Will Payne), Amy (Sacha Parkinson) and 'Evil' Ed (Chris Waller). Charley is on the outs with his girlfriend Amy because she thinks he cheated on her. As he and his best friend Ed are checking in to their hotel room Charley sees a very attractive woman biting another woman in the building across the road from their hotel. He later learns that the sexy biter is his class professor, Gerri Dandridge (Murray). He also later learns that she's a vampire, as he secretly follows her into a sacrificial chamber, when she drains a prostitute of her blood and bathes in it (to restore her youth). Charley and Ed seek out TV paranormal investigation host Peter Vincent (now played by Sean Power) to help them stop the sinister vampire.<br><br>The original vampire antagonist, in the 1985 film, (played by Chris Sarandon) was also named Jerry Dandridge (with a J and a y) but the main villain in it's 1988 sequel was his sexy vampire sister Regine (played by Julie Carmen). I know I saw both films but I don't remember much about the second movie at all. So I can't say if this new sequel is better than it, or not, but I do know that this 2013 film much closer resembles the 1985 original (than it's 1988 follow-up). All of the characters names are the same, including 'Evil' Ed (who was originally played by Stephen Geoffreys), except for the slight spelling change of Gerri. The film was directed by Eduardo Rodriguez (who also directed the 2012 action film 'EL GRINGO', which was a lot of fun) and written by Matt Venne (who's made a career out of writing direct to video sequels, like 'MIRRORS 2' and 'WHITE NOISE 2: THE LIGHT'). I have no big problems with the film, it has some decent gore and frights, but it's just not very involving and is a little dull. For me the best thing about it is it's villain. I really like Jaime Murray (who also played a stunning femme fatale villain in the 2007 horror film 'THE DEATHS OF IAN STONE', which was pretty good). It's not a bad sequel but it's also not nearly as good a film as it's predecessors.<br><br>Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=llO-AVcYkfI","user":"Hellmant","rank":[11,13]},{"title":"Atrocious","rating":2,"date":"30 October 2013","review":"Having recently watched \"Curse of Chucky\", my long-held belief that DTV sequels were always crap was shattered as that film exceeded all expectations. So still reeling from my beliefs being shattered, I approached Fright Night 2 with a small sense of renewed optimism. However, dear reader, this DTV film sent me straight back to stark reality.<br><br>Firstly, despite the inclusion of the number 2, this is NOT a sequel to the Fright Night remake, but rather another remake. Yes a remake of a remake, and a grossly incompetent, boring one at that. No tension, no frights, indeed not much of anything that can remotely be considered entertaining. You won't want to spend 10 minutes with these characters, much less 100.","user":"movieman_kev","rank":[21,30]}]