[{"title":"And what drugs were they taking when this got such great reviews?","rating":2,"date":"11 December 2016","review":"I have to ask myself what drugs were people taking when this movie was given such great reviews? I mean, if this were an 8th grade movie project then maybe, just maybe this would be a 6 at best. Frankly, I would avoid this movie at all costs. It could be 45 minutes shorter and still the viewer would be left bored. Slow moving, a pretty shallow plot, a travel movie to support tourism in Thailand, two wooden actors who look like they are two anorexics in search of acting classes and there you have the basics of this movie that took about 102 minutes out of my life that I will never get back. I would highly recommend this movie as one to ignore and go watch something else with a plot, some meaningful dialogue, and two main characters who actually can portray some moods other than angry or depressed.","user":"lwfjohns","rank":[54,72]},{"title":"Run, run faster than ever before","rating":1,"date":"19 August 2017","review":"You should have stopped reading at the title of my comment. Leave this page and never again look back on this movie, I watched it because of the great rating that this movie has gotten. MAJOR MISTAKE. This was one of the most boring and slow paced movies I've ever watched. This movie has made me a more boring person. It's changed me in ways I cold not explain, run my friends run. Never look back.","user":"elinsfm","rank":[30,44]},{"title":"poor","rating":2,"date":"4 September 2017","review":"Some bored Americans hang around in Thailand with their smartphones, laptops and ipads trying to have a better day. it does not work. no good music, no good scenes. better watch something else or much better, live your own live than watching this... And why do I have to write five lines in my review when there is nothing more to say? there's really no story-line that would be worth being talked about. bored lives in a bored overrated and sensation-flooded world. no spirit, spice and fire anymore...","user":"m-farfele","rank":[16,22]}]