[{"title":"Natasha Henstridge is very good in the film","rating":6,"date":"13 August 2013","review":"Written and Directed by Richard Boddington, \"Against The Wild,\" is a story about two young children and their Alaskan Husky who have to survive in the wilderness following a plane crash.<br><br>The film itself, which screened at the recent FLICKERS RIFF, is okay, but I really enjoyed the performance of Natasha Henstridge, playing the distraught mother of the children. She is at a higher level than many of the other actors, but this is a reason to see this film.<br><br>It is both interesting and still family-friendly film worth seeing. In addition to Henstridge, there are some great shots of the wild-life in the film, and the animals are almost characters in this film.<br><br>Against The Wild is not for everybody, but it will fit a certain audience. And, if you like animal-driven children's films OR Natasha Henstridge, you already have a reason to see this film.","user":"prprincess90","rank":[46,59]},{"title":"Why?","rating":1,"date":"18 September 2015","review":"I agree with everything PrarieCal had to say. What a colossal waste of time and effort. Never before have I witnessed a movie more heavily weighted down with clichés. However, I will, generously mind you, award it one star for the scenery.<br><br>As horrible as this movie is my biggest gripe doesn't even stem from how bad of a film it is, it stems from how bad the information about the wilderness and wilderness survival is. If indeed the boy truly was a former Cub Scout he should be stripped of any related badges because he did Nothing right that had to do with the most rudimentary of survival skills.<br><br>There was just so much wrong with this movie...but I will limit myself to three examples which ought to give you a pretty good idea of the degree of thought that went into this flick...<br><br>1. My favorite moment of the film....the parents are waiting at search and rescue's command central for any word of their kids who have been missing in the wilderness for days...the father bursts into the mothers tent and spouts \"Great news hunny!!!\" with a massive smile on his face....\"Charlie is going to be okay!\"...Charlie being the pilot who had crashed the plane stranding the children but who was no longer with them and, weirdly, who had already been found and who they already pretty much knew was going to be okay. Any normal mother would have first punched him in the nose then burst into tears.<br><br>2. The kids have matches. Having seen the search and rescue helicopters they know people are looking for them and despite being surrounded by woods and supposedly possessing the training to know how to gut a fish and create a travois never think to light a single signal fire....okay.<br><br>3. My third example is possibly the only reason I would recommend anyone check out a moment of this film because you will be treated to, yet another clichéd moment, that features the most obese raccoon I've ever seen, quite possibly weighing 4x what a wild raccoon could ever hope to attain...sadly, I am serious, the poor critter could barely move, same goes for the prerequisite grizzly....But, simply put and to be brutally honest? There is no reason good enough for anyone to watch this movie, not even a 3 year old.","user":"alassnsane","rank":[4,5]},{"title":"Better Family Movies Out There","rating":2,"date":"25 January 2015","review":"This is a low-budget film, supposedly $2M Canadian, but I'm not sure where they spent the money. Writing is not good, cinematography is not good, editing is horrible, acting is bad. If you watch it with your 6-9 year old, then it's probably okay. Older kids than this will laugh at the movie (adults will too). This particular director and writer specializes in these family films with pet dogs. Good clean family movie though. But, I'd say spend your money elsewhere. Dialogue is very abrupt and awkward in many parts. The film has a decent beginning and middle, but ending happens very suddenly and is very contrived. If your kids like animals, then they will probably like this film - aside from the dog, there is a bear, raccoon, wolves and salmon!","user":"scottkissinger","rank":[5,7]}]