[{"title":"Braaaaaaaaaaaains!","rating":5,"date":"4 September 2014","review":"Cough, sorry about that, talk of zombies makes me hungry.<br><br>The zombie fascination has reached pandemic levels and Doc of the Dead examines how fans have reached voracious fixation from humble beginnings in the 1930s.<br><br>Examining the evolution of the zombie with a decidedly American perspective, Doc of the Dead researches the horror sub-genre in just 80 minutes.<br><br>This is not a historical documentary, nor should you expect an anthropologically critical probe into zombie lore. The film glosses over the true beginnings of human reanimation of the dead and how it came to be this inherent sensational fear within humanity.<br><br>Doc of the Dead is a documentary of the modern American zombie film. It starts with the widely acknowledge first zombie movie, 1932′s White Zombie, and then quickly skips right to George A. Romero's 1968 Night of the Living Dead. Romero is the focus of most of the film history perspective and he is attributed as the seminal father of the zombie flick. It then jumps ahead to the funny zombie of the 1980s with Return of the Living Dead and by the 20 minute mark we are at the modern day zombie of the 2000s as in 28 Days Later, Shaun of the Dead, The Walking Dead and beyond.<br><br>As the film delves into the zombie variations as a species it tracks back to other pivotal films like The Evil Dead and Re-Animator. Doc of the Dead investigates the fast versus slow zombie, the charming versus bloodthirsty zombie, and the arguments for different sides.<br><br>My greatest criticism of the documentary is its unnecessary focus on how zombie culture has evolved into this integrated and participatory immersion. 45 minutes are wasted highlighting the different zombie walks, products and consumerism. It completely veers off its clear direction for the second half of the documentary. Rather than charting zombie history chronologically as it does for the first twenty minutes, this preoccupation with pop culture causes the documentary to lurch about through time aimlessly.<br><br>Without that filler, the film's writers and director Alexandre O. Philippe and Chad Herschberger easily could have utilized the knowledge of the experts involved. Max Brooks, Tom Savini, Greg Nicotero and countless others' zombie insight is vastly underutilized. Further, the movie can not claim to be a comprehensive zombie documentary while ignoring foreign contributors such as Lucio Fulci and Italian zombie cinema, French zombie and Asian zombie horror.<br><br>More reviews of recent releases can be found at our website!","user":"ArchonCinemaReviews","rank":[22,22]},{"title":"Amusing but flawed look at the zombie in modern culture","rating":6,"date":"29 June 2014","review":"In the last decade or so zombies have left the underground and become mainstream. It's a somewhat strange state of affairs and one that this documentary tries to explain. It looks at zombies in two main ways – their evolution in the movies and their appearance in recent culture. The film history part is the more interesting. It looks at the old style somnambulist zombies of the 30's and 40's typified by the likes of White Zombie, through to the more modern incarnation invented by George A. Romero with The Night of the Living Dead. It would only be fair to say that this latter film is truly the year zero in how the vast majority of people in western culture understand zombies, i.e. shambling, rotting, flesh-eating ghouls who attack humans at every given opportunity and can only be killed by a bullet in the head. The old-style Haitian type of zombie is much less seen these days, nor the Japanese variant whichhops! No, its Romero all the way these days, which is what makes it rather a strange phenomenon to become embraced by mainstream culture considering how grotesque and frightening his concept for the living dead actually is. While the film history part is the strongest it doesn't have time to reference a lot of the most loved entries in the genre, particularly the work of Italian director Lucio Fulci. But the reason is simply that the focus is on the zombie idea in general and not just on the movies and there simply isn't time.<br><br>It did lose steam a bit once it leaves the film history side of things though and moved onto the wider cultural impact. It becomes a bit bitty and spends time looking at aspects that aren't terribly interesting. Not only that but, a very brief passing reference aside, it inexplicably fails to focus on the one true moment when the zombie truly tapped into mainstream culture, namely Michael Jackson's Thriller video. Chronologically it's all over the place and there isn't a feeling of understanding the progression from how we really got from NOTLD to the recent craze for zombie walks. I don't really believe in the assertion that it's to do with the September the 11th terrorist attacks which was suggested. But, whatever the case, the documentary does show that zombies really are everywhere now. It is a fun, if flawed, film. There are several very funny moments too. But unlike the undead themselves, it doesn't have a single purpose it relentlessly pursues and instead kind of splits its focus too much.","user":"Red-Barracuda","rank":[12,13]},{"title":"Zombie influence","rating":6,"date":"19 October 2014","review":"Why are zombies popular right now? How did they get so far? This is what this documentary is about. So if you expect to see many bits from horror movies, you'll be disappointed. This also isn't a history of zombie movies in general and you won't find much about the games here either. One omission I really thought should've been in there, is the \"bath salt\" thing that happened. Something that the media connected with zombies for some crazy reason. This might be in the extras on the DVD though, as the director said at Frightfest, where the documentary was playing.<br><br>One of the surprising things watching, was Romeros stance on zombie walks (another phenomenon that keeps getting bigger and bigger). The \"Godfather of the zombie genre\" (as he is called by many, with Fulci not available obviously for comments) has a big part in this. He is as normal as always, bedazzled/surprised himself about the success his undead (he wanted to call them Ghouls initially) have right now. Not the best documentary made, but if you like to look a bit behind the current hype (with not much knowledge beforehand), you could do worse","user":"kosmasp","rank":[6,6]}]