[{"title":"Bears worth seeing.","rating":7,"date":"22 April 2014","review":"Here's a family friendly movie that will be enjoyed by all ages. Outstanding cinematography takes you very up close and personal with a mother bear and her two cubs in their first year.<br><br>John C. Reilly narrates, sometimes as if for the blind. He is saying what is on the screen. The narration is a little too much when he speaks for the male cub. An excellent music track adds to the enjoyment.<br><br>You can't help but wonder how did they capture that action? Over the end credits there are behind the camera shots that show how some of the movie was made.<br><br>It is short, and there is nothing too scary for smaller children. The Bears make it through their first year, the salmon well that's a different story.","user":"Quietb-1","rank":[11,12]},{"title":"Family Entertainment","rating":8,"date":"21 April 2014","review":"I was delighted to find \"Bears\". What was so amazing about this movie were the close-up shots of many personal moments for this bear family. I just wondered throughout the entire movie how the film makers could have this repertoire with these wild creatures. Being a pro photographer myself, I could tell that the lenses they used were not extremely long telephoto lenses. This was better, more personal than a National Geographic documentary. The images were so sharp and colorful, it just lead me to want to visit, or live, in Alaska. The panoramas were huge, majestic, post card perfect. The narrative was helpful; I needed to know what motivated the bears through their journey; the narrative answered that. Violence between bears was muted compared to what I know they can do to one another. So, this movie is safe for little children I feel. Yes, they eat Salmon fish in the river, but I eat Salmon fish too, on a plate. Did you know that bears live at the top of the peaks of mountains? I didn't know that. They carve themselves out of their hiding place from the very top of a high mountain! This movie goes into the details of a bears life from its infancy. So, your heart will be touched and warmed up by their cute behaviors. Your city life woes will all melt away when you follow them through all of the problems that bears encounter during a year's time. Yes, I do feel that \"Sky\", the mother bear, should be nominated for an Oscar. If Snow White and her 7 Dwarfs were winners for the Oscar, \"Sky\" &amp; \"Scout\" &amp; \"Amber\" should also be considered. This movie has its villains and its funny friends. DisneyNature is a wide eye opening presentation. There was applause from the audience at its conclusion. I felt that this movie \"brought me back\" to a good feeling after I had been \"crashed\" by a scifi movie I had seen earlier. \"Bears\" is good family entertainment, and as I said, it will transport you to lush, clear and clean adventure in Alaska. Now I understand why people live there.","user":"timbermisc","rank":[18,22]},{"title":"The perils of survival of the brown bear during its first year.","rating":10,"date":"24 April 2014","review":"A documentary very easy to watch by kids and the young at heart who love nature. <br><br>It conveys the harsh challenges of the first year of life of a brown bear family in the Alaskan peninsula. <br><br>Parents or other responsible adults may face some tough questions about additional details on what it's not shown by naturally curious children.<br><br>If at the end the viewer is left amazed at how the making of this feature was even possible, just stay a while longer through all the credits.","user":"jeeidde","rank":[7,8]}]