[{"title":"Pretty good medieval action drama flick","rating":8,"date":"3 April 2015","review":"I am compelled to write my first review after 4 years on IMDb due to the bad reviews by critics. First off, I completely enjoyed this movie. I loved the initial setting which took about an hour which others complained to be too long but I felt that laid a good foundation for the plot to continue. <br><br>The second half could've been better but I'm not complaining. This was much better than Ridley Scott's Robin Hood when compared to a medieval story. What lacked in this movie was more character development and overall depth to both the story and characters. The details of storming the castle are also just gone through quickly without any importance. I feel like this could've been a 3 hour saga of excellent medieval story had the director gone with it. A fully developed story with multidimensional characters would've been perfect. Both Clive Owen and Morgan Freeman gave wonderful performances and as someone who loves their movies I felt satisfied just to see them in these particular roles.<br><br>Overall, don't miss this one just because of some harsh critic ratings. I felt entertained and this is one movie which did not let me down at all when compared with other medieval stories of the past few years.","user":"root99","rank":[250,333]},{"title":"A Movie Worth Watching","rating":7,"date":"4 April 2015","review":"I just watched this film and, honestly, I find the single review posted here to be wholly ludicrous - one star indeed.<br><br>There's a sizable group of talented actors and actresses in this film that give some very respectable performances. If fighting scenes are all you look for in a film like this then yes, it might feel boring to you. But for most others you'll find a well executed story that portrays honor in a time when honor was everything.<br><br>Production was accurate, continuity is good, and the story keeps you interested. It's not, by any means, a fresh story line - but there's a reason it's an old standard. Casting was well done, and Clive Owen, as always, does not disappoint. In fact, the entire cast did a commendable job and that can not be said for the majority of contemporary films.<br><br>So, to wrap up; if you're strictly an \"action\" viewer, you may not enjoy this movie. But if you enjoy a good story that isn't entirely predictable, you might just enjoy this film.","user":"matt-208-23276","rank":[211,287]},{"title":"Really good, and enjoyable, highly recommend it","rating":9,"date":"27 September 2015","review":"After reading the initial reviews of this movie I thought it might be a bit of a turkey. However, I like these type of movies so I thought I would give it 15-20 minutes and see how it goes. Happily, it went well, I was hooked on the storyline and the acting. Clive Owen was fantastic as he usually is in these type of roles, Morgan Freeman, again one of his better movies, and the supporting cast all very well acted. The CGI was good but plot and acting outshone it, which is a really good thing in my opinion. Anyway, I really do recommend this film to those people who like this genre. So please do not listen to the negative reviews to much, watch it for 15 minutes and then decide for yourself if it's for you.","user":"zidangus","rank":[42,59]}]