[{"title":"Kevin and Susan at Their Best","rating":9,"date":"13 September 2014","review":"I knew Flynn was an icon and a superstar in the golden age of Hollywood, a dashing figure who knew how to create controversy, was both loved and despised by many, and sort of remains a legend in the world of cinema. This film explores the last part of his life, as he became involved in another questionable relationship, which allowed to depart in the middle of another sensational moment.<br><br>Kevin Kline does a superb job bringing the star to life. He is at the moment when he has started fading because of financial and health problems. He has managed to hide behind his star facade, but if you get close enough, you can see how vulnerable he really is, and it's at this moment that he finds the \"last of his loves\", a relationship that we never really understand, but that hints at the possibility that both parties might have at least been fond of each other. In order to create that, we are given the character of Flo, a real life mother who has been living her dreams through her daughter's attempts to break into show business.<br><br>We learn she has driven her quietly, breaking rules, lying, exposing her to risky situations so she can achieve vicariously what she missed earlier in her youth. She's damaged good both physically and mentally, and later she finds she shares a lot in common with Flynn. It's hard to excuse either, and in the middle is Dakota's Beverly, who is hungry for attention, affection, and maybe fame. The problem is that she lands in the middle of Flynn and Florence, and she is a simple soul, with very little acting or singing talent.<br><br>The film takes you back to a time when society might have looked different and might have pretended to be different, but we have predators, victims, dreamers, and plenty of nightmares. Flynn and Florence have alcoholic demons in both their existences. Both lives will end as a result of the damages caused by that drug. It's here where both Kline and Sarandon are able to do their best work by showing as much as possible of what lives inside these people's souls. We can't hate them completely, and they try hard to earn our sympathy, but we could never really go along with it, yet we keep watching until the logical resolution.<br><br>The film is not perfect, but it's a good effort that shows the last part of the lives of three flawed individuals and how their interaction became part of a legend's final act.","user":"aharmas","rank":[18,19]},{"title":"Better Than I Expected","rating":7,"date":"4 March 2015","review":"After reading the poor reviews of this film I was expecting very little, but ended up surprised that it was better than I expected. I would say that this was mainly due to the superb acting of the 3 stars here, Kevin Kline, Susan Sarandon, and Dakota Fanning. I also had to take my own personal \"moral police meter\" and put it aside , to review the movie on its merits and not my moral judgments, something perhaps some viewers will not want to do.<br><br>Set in the latter years of the 1950's, the tale focuses on the 2 year relationship between the world famous actor Errol Flynn and the 15 year old Beverly Aadland. Kline is excellent as Flynn, known for his lecherous and playboy ways, and who spots the chorus girl and aspiring actress Aadland on a movie set and immediately takes steps to seduce her.<br><br>However, Beverly, also superbly portrayed by Fanning, does not appear to be your typical teen looking to bask in the fame and fortune of Flynn. She actually appears to like him and his company, I guess you could say as much as a 15 year old is able to.<br><br>Then there's Florence, Beverly's mother, and Sarandon just \"nails it\" here with her portrayal of the super ambitious \"stage mother\", who even has groomed her daughter to look and act older than her years ( having a fake birth certificate handy showing she's 18 years old). Florence seems to be pushing Beverly to succeed because her own career as a dancer was cut short when she lost a leg in an auto accident, and now wears a prosthetic device.<br><br>Thus the remainder of the film will focus on the enmeshed lives of the three personalities, and how they will try and hide what's going on from the public and the media. However, there will come a time after the death of Flynn, in 1959, when most serious repercussions will have to be faced.<br><br>I read that the filmmakers Richard Glatzer and Wash Westmoreland (Still Alice) tried to focus on the story rather than the morality of it all, and, as mentioned, that's what I tried to do as well. The movie itself I thought was quite absorbing, led by the strong acting of the three leads plus the fine supporting cast, and was enhanced by actual photos, at the end, of the real characters portrayed and some of what happened to them in future years.","user":"larrys3","rank":[14,15]},{"title":"Time Changes Things","rating":8,"date":"30 June 2015","review":"Not worst than any other biographical motion picture produced by commercial American cinema, and certainly not up to the highest achievements in biographical movies made by this industry. But it is done not only with affection but with respect, even to that \"moral majority\" that causes so much despair and sadness all over the world, with its stern point of view that changes whenever the wind blows. And above it all the film is graced with very good performances by Kevin Kline as Errol Flynn, Dakota Fanning as Beverly Aadland and especially Susan Sarandon, splendidly restrained as Florence Aadland, a role that Shelley Winters would have turned into a thunderous bitch. I liked it and enjoyed it very much maybe because I like every now and then a bit of television, or maybe because I have always liked Errol Flynn, an actor that was so incredulous of his own talent, when as a matter of fact he was a wonderful performer of action and gallantry expressions.","user":"EdgarST","rank":[8,8]}]