[{"title":"the first twelve minutes make this watchable...","rating":4,"date":"22 June 2013","review":"This would easily be a 8/10 in my opinion if the level of comedy from the first twelve minutes was held throughout.. Don't get me wrong, those 12 minutes are in no way hilarious but they are at least what I expect from a stupid spoof...<br><br>French Stewart literally saved the entire film.. Without having been entertained at the start like that, I doubt I would have continued this film. <br><br>Saying that... I still recommend this film to any spoof lover. This is definitely not the worst spoof there is out there. And some parts were quite funny, even funnier than the funny parts from \"A Haunted House\". Anyway, I felt like I had to write a review to justify only giving it a 4/10. Even though the score is low this film is still worth watching and cracking open a few cold ones with a few friends.<br><br>So don't be discouraged by the low score it is still worth a watch for any spoof fan. Funnier than \"Epic Movie\" and \"Disaster Movie\" but less funny than \"Meet the Spartans\" if that gives you any idea. IF you hated all three equally then you simply don't like our generation's stupid spoofs, so please stay away and stop bitchin' bout how you would rather gouge your eyes out, poop rusty nails or any other form of masochistic comments which you all seam to love writing about. Peace....<br><br>PS: \"F\" OFF DANA!","user":"oundjianm","rank":[10,12]},{"title":"*yawn* ... *sigh*","rating":2,"date":"7 February 2013","review":"One of the most boring films I've ever seen o.o This is supposedly a comedy, yet I haven't seen comedy worth of that name on it. The actors aren't bad (I liked Olivia Alexander, it has charm), though, so it was not their fault. But the plot, the way the film was made, the action, the satire... a hell of a awful movie. It lacked taste. It could have some potential but failed. A waste of time, which it was spent expecting the movie to get better - but it won't. \"30 Nights of Paranormal Activity with the Devil Inside the Girl with the Dragon Tattoo\" also made me understand that Paranormal Activity titles are poor movies, despite the suspense that sometimes exist. Perhaps this isn't just my type of movie or perhaps i'm being too harsh - but not recommended /:","user":"dark-riddler","rank":[14,22]},{"title":"whats to say?","rating":5,"date":"12 February 2013","review":"What do you expect from a film with a title like 30 Nights of Paranormal Activity with the Devil Inside the Girl with the Dragon Tattoo? It had its moments and my boyfriend found it very funny, I prefer darker humour. People who take movies like this too seriously need to ask themselves why they actually watched it, obviously it wasn't going to be something like a Spielberg masterpiece. If your going to watch this then expect nothing more that what the title suggests, it has its moments in places, it has cringe-worthy moments too (you know the kind, when you just want to wither away somewhere) and it has it utterly stupid moments too. <br><br>I have seen many movies, too many tbf, so I kinda know what I'm on about.","user":"pfitzpatrick17","rank":[10,17]}]