[{"title":"An ambitious but flawed film that is average at best.","rating":4,"date":"3 July 2016","review":"Regrettably, the great genre of film that is the Western struggles mightily in our present time. Most Westerns are now low-budget, like The Duel, but that does not mean that it should be written off (I was pleasantly surprised that the recent release Forsaken was a decent Western). There are some positives in this film, yet negatives are rampant and I will note the primary ones.<br><br>This film features a decent cast and an interesting story which involves an investigation surrounding missing people and an occult leader that has come to control the hearts and minds of the people of a small Texas town. However, besides a respectable performance by Liam Hemsworth, the cast is mediocre and forgettable with Woody Harrleson topping the list as being a cliché villain with forgettable, pretentious faux-intellectual dialogue.<br><br>The action is average at best, and above all else there is a feeling that the writers or producers wanted to inject their opinion regarding the current treatment of Mexicans (something a reviewer on Roger Ebert's website noted) into a script already bogged down with murder, missing persons, revenge, a husband-wife relationship, a mysterious town, and a religious occult leader. It is subtle. However, it seemed out of place and unnecessary but that does not stop Hollywood from forcing a narrative or agenda into a movie, does it?<br><br>Overall, this is a movie that had promise, but sub-par acting and a feeling that it did not know which plot point should receive the most attention weakened the film as a whole. If you like Westerns, you may find it more alluring because of the genre. Nevertheless, it is a one time watch that struggles and does not contribute anything of great worth.","user":"mjmegelsh","rank":[55,79]},{"title":"Harrelson and Hemsworth Are Both Excellent in Psycho-Western","rating":23,"date":"23 August 2016","review":"On the surface, \"The Duel\" is a classical western in the style of \"High Noon.\" But the main interest in not the traditional melodrama of hero and villain. Rather, it is a subtle psychological drama that explores deeper personal values in the two leading characters.<br><br>Woody Harrelson is good as a character known as \"The Preacher.\" He is a megalomaniac who has exerted his charisma and total control over a small town in Texas in the post-Civil War years. The traditional \"stranger\" who rides into town is a Texas Ranger, and the role is given a fine, understated performance by Liam Hemsworth.<br><br>The twist on this familiar plot is that the Texas Ranger is on a secret mission to spy on The Preacher, who has been wantonly killing Mexicans who have crossed over the border. But Hemsworth's character David has a second interest in The Preacher, who killed his father two decades earlier.<br><br>The film is effective in offering some depth to David's motives. Is he a dedicated Texas Ranger performing his job, or is his true motivation to revenge his father's death? The film never completely answers that question, but leaves it to the viewer to decide.<br><br>But there are other loose ends in the film that are both unresolved and confusing. The depiction of David's marriage to his wife Marisol is never fully developed in the film. Marisol was wedded to David without her consent when her father's life was saved by David. At the beginning, it appears as though they have a happy marriage. But the transformation of Marisol, who is won over to the side of The Preacher, seemed strained and unconvincing. And the film never even bothered to wrap up the narrative by informing the audience of what happened to Marisol! <br><br>Obviously, \"The Duel\" is not a perfect film. The historical backdrop of the development of Texas in the mid-nineteenth century was also superficial. It was almost as if the film could have been set in any historical period with a different set of costumes. Still, it is worth seeing for the excellent work in cinematography and the two fine performances of Harrelson and Hemsworth.","user":"lavatch","rank":[20,26]},{"title":"Excellent movie","rating":9,"date":"25 March 2018","review":"I was really impressed by this great movie and the low rating seems totally unjustified to me. Sometimes you see a painting where it is not the content that catches your eye, but the way that it is painted. I would say that i have that experience with this movie: a well crafted piece of art. The acting is superb, the sound, music and scenery fit well together and create the perfect atmosphere for this story. Not a complex or spectacular story, but intriguing, and beautifully painted. Absolutely a must see for those who appreciate quality.","user":"Yadasampati","rank":[20,27]}]