[{"title":"Kids just wanna have fun","rating":6,"date":"20 May 2016","review":"This is aimed at kids obviously and I have not read the books this is based on. But you get a pretty good idea, what it's about (the character and everything). It's a shame it wasn't successful, because it's lighthearted fun with a terrific cast. You can tell everyone was having a blast making this.<br><br>It's predictable and the characters are very easily to spot, but you don't always need complex stuff to be entertained. It's also enough to watch this with a kid (maybe not even a fan of the books) and having a blast with them. It's overall effort is more than decent and if you allow yourself to dive into this world (just don't look too long into her eyes), then you'll be entertained","user":"kosmasp","rank":[6,7]},{"title":"What a surprise(!)","rating":10,"date":"14 October 2017","review":"Before watching this movie, I didn't really have high expectations. I didn't know anything about it, and from the rating on IMDb (as of now: 5.4/10, with 738 votes), I was just expecting some B-movie. Well, I was very surprised in a GREAT way. I was really moved by this movie, even to tears, and moved my heart to think of my life and priorities. It truly was a great movie. And now I'm listening to the song at the end credits.... &lt;3 A great, touching, moving end. Thank you producers, actors, and support roles in all capacity of this movie. It will most likely remain in my heart for a lifetime, when I think back on movies that touched my heart/inner being.","user":"huyzer","rank":[2,2]},{"title":"Charming, but not much effort","rating":5,"date":"1 February 2017","review":"It's funny how this movie escaped my radar. Back a few years I was actually an AVID reader of the Molly Moon books. And this movie being made 2 years ago when I found out stunned how I had no idea of it before. And after watching it, I can see why. It was a very poor adaptation, and it seemed either the budget was low (I mean, the studios were MINUSCULE compared to the big names) or the screenwriter wasn't caring that much. It had a bit of a clunky pace and it struggled to stay on tracks. While some scenes seemed word by word from the book, with even some funny nods (like a flip of a page in Molly's notebook shows a sketch of the book's cover) while some scenes were jumbled out of place. And I really don't see why, when the movie was barely 1 hour and a half, when 2 hours could've covered the book page by page.<br><br>However, the movie material was actually good. Raffey Cassidy was DELIGHTFUL. Her acting felt very natural and she was really pulling out how I imagined Molly. The other children were really natural at their scenes, when we know how hard is for children to act, the younger, the hardest. As a stand-alone movie, it felt harmless, but fun and enjoyable. As an adaptation, I felt SO MUCH disregard by the screenwriter I feel really sorry for the book and I sure wish the writer felt disapppointed, her series was marvelous and could've done much better as a cartoon.","user":"cesar_augusto","rank":[2,2]}]