[{"title":"Complete waste of time","rating":1,"date":"16 November 2014","review":"This is the stupidest \"documentary\" I've ever seen. How exactly do interviews with 3 year old kids and long montages of said kids running around contribute to a rational discussion of the GMO debate? He at no point presents any useful information one way or the other. All he does is interview non-experts who provide their opinions on the matter - opinions that are not necessarily based on any facts. <br><br>Only one scientific study was presented, from a paper that was later retracted due to widespread criticism from the community. The director indicates that all of the scientists who criticised the paper were somehow linked with the biotech industry, but this would not be enough to force the journal to retract the paper. There had to have been enough independent critics for the journal to have taken it seriously. If you look up Prof Seralini, he is a highly controversial figure in the scientific community. Why were no other scientists interviewed? Could it be that the director only wanted to interview people who supported his point of view?<br><br>This is basically just a bunch of ignorant, ill-informed, anti-science scaremongering and it makes me disgusted to think that there might be people out there who actually think this is a valid presentation of the GMO debate.","user":"samantha-y-gan","rank":[41,58]},{"title":"Big Letdown","rating":1,"date":"23 December 2015","review":"A huge disappointment. Failed to provide a balanced argument about the GMO. Arguments were based in fear mongering with his innocent children as his marionettes. Failed to consult any science professionals. He states early on in the film that there are two types of GMOs. It takes a very minimal amount of research to realize that there a plethora of GMOs beyond the two he mentioned...Nutritional fortified sweet potatoes to ameliorate malnourishment or disease resistant GMO to increase yields in underperforming landscapes, and this list is by no means exhaustive. There is a clear oversight of anything remotely scientific in his arguments. There is something to be said about the fact that the majority of peer reviewed literature focused on the topic of genetically modified organisms are in their defense. I am not speaking from the perspective of a corporate sponsor rather from a concerned global citizen who fears for the future of growing populations that deserves to be fed.","user":"nicholas-16139","rank":[17,22]},{"title":"Biased, and not informative","rating":4,"date":"7 October 2016","review":"It took all of 10 minutes for me to start asking \"is he going to present any facts, or will this be entirely him making assumptions?\" Didn't take long after that for me to start laughing at it. And not much longer after that i just gave up on it. If you're already anti-GMO you'll probably really enjoy this. If you're hoping for information, on the other hand, don't waste your time. He makes claims about GMOs being bad for you, while also saying there's no credible data about GMOs. What? How does that work? The opening of the movie set the tone perfectly: very biased parents trying to protect their kids from all chemical threats. It's one thing if you actually understand what you're afraid of, but it's another to make a documentary claiming that all GMOs are bad when you don't know what your dealing with. At one point, he says he's ready for a fist fight... hopefully he meant to fight off angry viewers who wasted money on this fact deficient propaganda film.","user":"kobra8706","rank":[10,12]}]