[{"title":"Batmobile lost a wheel, the Joker got away","rating":7,"date":"4 November 2013","review":"Having never seen nor played any of the Lego movies or video games this was my first venture into their blocky incarnation of various franchises. I was fully expecting nothing but a feature-length cut-scene but was surprised at how cinematic it actually is.<br><br>Opening with Danny Elfman's brilliant Batman theme (no offense to Zimmer but Warner knows that fans prefer this version), we learn that Lex Luthor and Joker have teamed up and have gained the upper hand over Bats and Supes. If only Bats had the humility to ask the rest of the Justice League for help. Skipping back a couple of days, the story of their dire situation unfolds. It's not an original framing device, but it was better than I was expecting.<br><br>Director Jon Burton (no relation to Tim) uses many atmospheric locations that look wonderfully photo-realistic, while building as much of the world as possible with actual Lego bricks. Builders will get lots of ideas when watching this movie. Rob Westwood's score, while very entertaining, does get a little overbearing at time though. He should have let a couple of scenes speak for themselves, but it's still good enough to warrant a release on CD.<br><br>There is a fun sense of humor permeating each scene, meaning that if the vivid sets and cute action don't entertain you will still be smiling. It does suffer a little bit from the \"smashing skyscrapers\" cliché that is common in many comic book movies but it's not too much of a distraction.<br><br>Far better than I expected. I will certainly invest time in a sequel.","user":"CuriosityKilledShawn","rank":[17,19]},{"title":"Despite Supe's RidiculeFUN!","rating":8,"date":"14 June 2013","review":"Actually, I've had enough of Batman these days. Every time I watch one of the animated movies, he's okay until he or the storyline starts to downgrade the greatest hero of our fictional time: Superman. This \"movie\" is no different.<br><br>That said and disregarding the display of Batman being a dick again to Superman, LEGO Batman: The Movie - DC Super Heroes Unite is an absolute pleasure.<br><br>My roommate/landlord has played the game where the majority of these shots were side segments and he states some scenes were added to make it a full-fledged filmif you can call a 71 cartoon a \"film.\" Since I have not played the game – whatever it's called, this entire video was brand new to me.<br><br>I loved almost every minute of this. Laughed hard, marveled a lot and actually enjoyed the journey of these characters lego'ized.<br><br>It was clever, fun and adventurous, despite the limitations of being just about Legos. And above all that, it was clever; just when I thought it had flaws, the movie sideswiped me and explained what I would normally criticize.<br><br>Basically, Lex Luthor and Joker team up so Lex can be President of the United States, but both Batman and hilarious Robin set out to expose his evil plots. Sometimes calling upon the likes of our lovable Justice League players.<br><br>Even if you're only mildly interested in either Batman, Legos or Animation, this is an absolute must see. Especially if you fall in that \"mildly interested\" category; it's only 71 minutes! That's not a lot of time invested.<br><br>You'll thank me. This was fun.","user":"thesar-2","rank":[8,8]},{"title":"Calling All Justice Leaguers! Super-Villain Alert!","rating":6,"date":"16 January 2015","review":"And, meanwhile - Back at the Batcave.... Batman kicks some serious butt (with a little help from all his super-friends, of course)....<br><br>Even though LEGO Batman's story of over-the-top, superhero crime-fighting pretty much went over the same, old ground, I still enjoyed this particular CG offering a helluva lot more than I did the likes of Christopher Nolan's live-action \"Dark Knight\" movie-series. I really did.<br><br>Besides LEGO Batman containing some often-humorous one-liners (nicely delivered by both Batman &amp; Superman), I also got quite a delightful kick out of the LEGO-look of all the characters.<br><br>From having some very amusing facial expressions, to their squat stature and stubby legs, I'm actually looking forward to checking out other LEGO movies once they become available through my city's library system.<br><br>Of all the superhero characters featured in this picture's ultra-violent, fast-paced story, it was Flash, in his brief, but pivotal appearance, who I liked the most.","user":"xyzkozak","rank":[5,5]}]