[{"title":"This Year's King's Speech","rating":8,"date":"11 September 2013","review":"As several critics have observed, this wonderful film, just shown at TIFF, is destined to become this year's King's Speech (which began its Oscar run in Toronto too, though Philomena has already picked up accolades in Venice). Both British films have strongly emotional undercurrents leavened by wry humour, feature outstanding performances from the leads and are based on true stories.<br><br>Judi Dench, as the Irish woman whose out-of-wedlock son is taken from her by Catholic nuns and sold to a rich American couple in the 1950's, has never been better. She imbues the role with a mix of wisdom (after all, as she reminds us repeatedly, she was nurse for 30 years) and naiveté that would seem to be impossible were it not so deftly handled. While the cynical atheist portrayed by Steve Coogan rarely misses an opportunity to poke fun at her, more often than not she enjoys the last laugh.<br><br>Despite the consummate acting, and Frears' slick directing, the greatest treat of the film is Steve Coogan's screenplay. Given its subject matter, the story could easily have veered into melodrama, but just when it is on the verge of doing so Coogan pulls us back from the edge. Thankfully, Coogan himself is there to convey precisely the proper blend of sarcasm and compassion.","user":"RolyRoly","rank":[148,160]},{"title":"Much more subtle and interesting than I predicted","rating":9,"date":"1 November 2013","review":"The film starts with the message that it is based on true events. Although you might wonder what was changed for the film, you soon forget that and accept it as a whole. In short it was brilliant. It could have been a predictable story but instead it had other dimensions and took unexpected directions with strong characters and some humour. I thought I knew an outline beforehand and was pleasantly surprised when that part was covered in the first twenty minutes. It was intriguing where the story would take us and that happened a few more times later. In addition to Philomena's journey, there was also Martin Sixsmith's journey from the beginning as just a detached journalist doing a human interest story on someone, whom he thought was beneath him, to being totally involved and offering not to publish it. To illustrate the depths of this film you can see how it attacks cruel, narrow-minded, sanctimonious Catholicism and at the same time shows how the faith gave strength to Philomena and the ability to forgive rather than to wreak vengeance. The acting was totally convincing. It is going to be a competitive year but Judy must be up for another Oscar. Just watching Steve Coogan's almost imperceptible expressions of irritation as Philomena told him the interminable plot of the book she had just been reading, was wonderful. This is definitely the best film I have seen all year. After writing this I read the interview with Martin Sixsmith on the Guardian web-site. It fills in more detail about Michael Hess (Anthony Lee) but confirms the whole truth of the story.","user":"johnmcc150","rank":[71,76]},{"title":"Brilliantly delivered story by supreme actors","rating":10,"date":"3 November 2013","review":"My wife talked me into going, I wanted to see Captain Philips but she was adamant this time. We both grew up in Ireland and I didn't want to see another one of those movies focused on stereotypes, the marketing blob types like the Quiet Man and Ryan's Daughter...stereotypical nonsense that lampoon our history and our culture. Steve Coogan and Judy Dench, especially Judy got it just right from the very start. They were smart, witty, serious and most of all, Judy was 'Irish' They really got the spirit of an Irish mom, that cocktail of guilt, generosity, inferiority and a heart to care for the entire world spot on. Dench in the hotel thanking everybody for being 'so nice' and getting who her son was as a child as others were today trying to 'break the news' to her...she wasn't just a step ahead, she was years ahead. Really excellent, really well done. Beautiful!","user":"fchristopherleidenn","rank":[126,138]}]