[{"title":"Wow! Do see this movie!","rating":9,"date":"27 January 2015","review":"I saw this at the US premiere in Santa Barbara. It was shown to a sold-out house of some 2200 people. It received a long ovation at the end. The story is based on the true story of the male lead. He wants to be a dancer, and the Iranian regime frowns on dancing. The tension is palpable, the cast of \"good guys\" and \"bad guys\" and \"maybes\" is good, there is some good male-female chemistry, and the ending is heartwarming. The dancing and the acting are top-notch, as are the photography and the music. I had some difficulty with the accents, but it certainly didn't ruin the movie. If I wrote much more, I would spoil it. So I won't. Just this advice: Go see it for yourself, you won't regret it.","user":"tex805","rank":[37,47]},{"title":"We Shall Overcome","rating":8,"date":"12 April 2015","review":"This is THE movie Islamic countries don't want you to see. This movie will be banned in Iran. It could not have been filmed in Iran. Everyone would have been arrested! I expect conservative Muslims to give this movie low \"1\" or \"2\" scores on IMDb to discourage other Muslims from seeing it. It might give them ideas!<br><br>Based upon a true story, it relives the tragic story of a young man and his friends who simply want to practice and perform modern dancing on stage in Iran. Dancing is forbidden there.<br><br>This is a \"quest for freedom\" movie; a universally loved theme by audiences who believe in free speech and freedom to make expressive choices. It will leave you with a satisfying feeling. A few \"twists\" and surprises in the film heighten the tension you will feel. I thought of Alfred Hitchcock at those moments.<br><br>One lone movie critic dismissed this movies' call for Iranian freedom. I say if an African American from the 1950s were to be recorded looking and speaking into a camera saying: \"I want freedom; Freedom Now!\"; Any movie viewer in America would take this act seriously. Here, this movie critic simply dismisses the Iranian use of \"We Want Freedom Now\" as a platitude or homily! How sad is that? Who's side is this critic on?<br><br>One man gave a description of a beating by the Morality Police; and he spoke about \"freedom\". The movie critics call this \"speaking with platitudes\" and to a movie critic this is a no-no for Iranians. Who is this critic?<br><br>If a person enjoys beauty and dance, this interest will be a plus to the further enjoyment and appreciation of this story. This movie should win an award for \"The Most Worthwhile Film of the Year\". With the political motions in the Mid East, this movie sets the viewer straight that Iranians are a modern people, but Islamic rule creates restricting conflicts in the souls of their people. What these people do to cope is laid out in this movie. <br><br>Also explored in this film are the social and political aspects. We walk the streets of Iran and visit an underground society that lives out alternative lifestyles. This was an eye opener for me because it is easy to fall into the belief that everyone in Iran goes along with the \"party line\". Even with the threat of death and imprisonment, there are these brave souls that carve out certain alternative ways of living there.<br><br>There is no sex in the movie. Even kissing is prohibited in public in Iran. The movie shows the Morality Police punishing citizens for being members of the Green Movement; of citizens holding hands in public, and other moral violations. I felt relieved to be living in the good old USA.<br><br>The direction of the film was well executed. Every scene flowed well back to back. I was never confused. There were no jumbled ideas or flash forwards to make it more complicated. It was all straight forward story telling. The soundtrack was barely noticeable. When I decided to really listen to the soundtrack, it was emotionally appropriate for the scene presented. The acting was natural. I saw no \"over acting\". I believed every feeling that the actors played out. They were all sincere. The budget for this movie was $4,000,000. <br><br>The main stars are Reece Ritchie and Freida Boniad who also starred in \"Slumdog Millionaire\" winning Best Picture of the Year.<br><br>What is freedom worth? This film will make you think again about those freedoms that you take for granted living in America. I would show it to a class of High School students to give them an introduction to life in the Middle East. And, because the story revolves around University level students and their problems and lifestyles, I would think that people in the ages of 19-35 years would most identify with this film. But older people who have followed the Mid East conflict will enjoy it too for this play out of everyday life there. It is for anyone who would like to visit a foreign country (safely) for a short time. <br><br>After seeing this movie, I would never, ever want to live in Iran. They have these women who check the female University students as they enter through the front gates of the University for \"too much cosmetics\" each morning. They will wipe the face of the student with a cotton pad! There are Morality Police that look to see that a student is carrying the \"right books\" under their arms. They will grab the books out of the arms of the students to take a look! They trespass into student homes and search! How demeaning! They prohibit two people from holding hands in public. Now, this is an eye opener for any High School Student in America. And yet, the Iranians are computer literate and they drive modern cars. These contrasts are great ones for American or European eyes.<br><br>I have a critical eye for dancing and professional visuals. When I say that this film is good, believe it. The \"wow\" in this movie is in the dancing. The \"wow\" is seen in the conservative customs of this Islamic society.<br><br>I got my monies worth and I do recommend this film to anyone. There is no bad language; but there is some violence. There are times when you will be closing your eyes in defense; but there are many more times that you will be experiencing beauty wrapped delicately in a personal and tragic story. It has a heartwarming ending.","user":"timbermisc","rank":[26,34]},{"title":"Entertaining & Compelling Story","rating":10,"date":"23 April 2015","review":"I viewed this movie after hearing about it through a friend. It didn't seem like a film I would usually be interested in after seeing some of the reviews from critics and users, but I gave it a chance anyway.<br><br>I was very impressed, the story was great, the fact that it was based on a true story, and political facts made the film more put together and gave it a lot of depth.<br><br>A lot of work and studying was put into this film, and I always give acclaim to those in the film industry who try hardest to put a story out there that is meant to be heard and for that reason I rate the film a 10.<br><br>Definitely recommend everyone to see it, this is in no way a \"boring\" film.","user":"mr-ronen-eitan","rank":[18,23]}]