[{"title":"Portrait of a woman confronting the demons of age and obsolescence.","rating":9,"date":"3 November 2014","review":"This was an amazing movie, to a large extent because of its lead actors. I expected Juliette Binoche and Kristen Stewart to make a great team, and they did; there was never a moment when I thought one of them was out-acting the other, or drawing attention from the other. They worked in perfect tandem as far as I could see. <br><br>The first thing that needs to be mentioned is the technique of telling the story in \"layers.\" Many, if not all, scenes are on multiple levels, filled with subtext, and it all mixes effortlessly with the central story. <br><br>Binoche plays famous and respected actress Maria Enders, while Kristen plays her devoted personal assistant, Valentine. Enders is preparing to play an important role: the character of Helena, an older woman in a remake of the play in which she once starred brilliantly as the more powerful younger character, Sigrid. Valentine is helping her rehearse, and they both travel to the picturesque mountain town of Sils Maria to work on the play. That's the main \"layer\" and it makes a perfectly good story on its own. But in this movie, any piece of dialogue can, at the same time, refer to the characters in Enders' play; to Enders and Valentine themselves; to Binoche and Stewart; or to other actors, movies, directors, or events which are not directly mentioned in the film. Yes, even the real life actors are referenced; Olivier Assayas confirmed in an interview that in this movie, the identity of the actual actors is part of the story. It sounds as if it should be weird and confusing, but it's not; it's done very smoothly, with the main story easy to follow even while taking in the other layers of reference as if they were background music. <br><br>The basic story, which is beautifully told, is about a woman struggling to deal with ageing in a profession that doesn't always respect older women, that may consider them irrelevant. Maria Enders is also trying to be true to her art while making the necessary concessions to fame, the media, the fans, fellow actors, and critics, concessions she resents to some extent. It would be a fine story all by itself. But the added layers provide a sort of ongoing commentary on the story, that makes it much more interesting, and a little strange. Seeing obvious parallels with the lead actors' real lives is odd, but like the parallels between Maria Enders and the character she is preparing to play, it only adds depth to the story and gives us more insight into what is happening.<br><br>Maria's struggle is made worse when she meets the young, brash, gossip-ridden Hollywood actress, Joanne Ellis (Chloe Grace Moretz), who is to take on the role of Sigrid. Joanne is smart, fearless, and media-savvy. At their first meeting she flatters Maria and claims to be an admirer, but may simply be feigning respect. Maria is easy to sympathize with when she looks into Joanne's background and sees that the rising star displacing her is a crude, grandstanding girl who manipulates the system to her advantage, and who acts in ridiculous sci-fi drivel. <br><br>Gradually, the difficult relationship between the characters in Enders' play becomes blurred and overlapped with Enders' relationship with Valentine, each relationship providing commentary on the other. It is interesting to watch Binoche simultaneously rehearsing a scene in which her character, Helena, has a confrontation with Sigrid, and in subtext confronting Valentine. It gradually becomes unclear whether she is Helena addressing Sigrid, or Maria addressing Valentine, because it becomes both at once. <br><br>Maria's conflicts over becoming obsolete in the field where she's excelled, and by extension possibly in her life, causes ongoing friction with Valentine, who tries to help her and encourage her to change her perspective. Finally, in a brief surreal moment, Maria, it is implied, manages to take on Valentine's perspective and her confidence. As Valentine tries to express at one point, Helena and Sigrid are really the same character; by extension, so are Maria and the young, pragmatic, fearless Valentine. Ultimately these opposites are reconciled, the conflicting layers are brought together, and Maria is able to accept her new reality and move on. It's not necessarily a happy ending, in terms of Maria's diminishing professional range, but it is a satisfying one.<br><br>This is an enjoyable, well written and well acted, serious and yet consistently entertaining movie from beginning to end.","user":"Mamabadger56","rank":[90,106]},{"title":"The female version of Birdman","rating":8,"date":"27 March 2015","review":"\"In the play you all know, Maloya Snake, he gave me everything I need to build a career on, my career.\"<br><br>Olivier Assayas and Juliette Binoche reunite after their previous collaboration (Summer Hours) in this wonderful meta film that has some slight similarities to Birdman. This could be the female version of that movie although not as entertaining and without all the technical achievements. It is also a little more subtle in its approach. The story begins on a train as re-known actress, Maria Enders (Juliette Binoche) is heading to Zurich with her personal assistant, Valentine (Kristen Stewart) to receive an award on behalf of a dear friend, Wilhelm Melchior, who is the reason why she is now a famous actress. Twenty years ago, he offered her the role to play the lead character in the stage and later on in the film adaptation of that play. On their way to Zurich they receive the terrible news of his passing which deeply saddens her. After the ceremony Valentine arranged a meeting with Klaus (Lars Eidinger) who wants Maria to play the older character in his adaptation of Wilhelm's novel. She continues to identify with the strong younger character and doesn't feel its correct for her to play the weaker role of Helen, but ultimately she agrees to do it. The lead character will be played by the promising young actress Jo-Ann Ellis (Chloe Grace Moretz) who has had her share of scandals with paparazzi's recently. In order to prepare for the role, Maria and Valentine travel to Wilhelm's former home in Sils Maria surrounded by the gorgeous Alps. Here, Maria is forced to reflect on her career and come to terms with the fact that she's an aging actress. <br><br>Clouds of Sils Maria is another film that reminds us that life imitates art because we are always finding ways to express ourselves and the means to do so is through art. Maria is forced to come to terms with her reality through the acceptance of this character she's not thrilled about playing because she doesn't seem to understand her. There are several scenes in which she is rehearsing the lines with Valentine that kind of blur the line between fantasy and reality. There were moments in which i didn't know if they were actually arguing or if they were simply reading the lines of the play. Those scenes were memorable and unique and I believe are at the center of this film. There are also some great conversations between the two about art and blockbuster Hollywood movies portraying the opposing two point of views. The film is rich with strong female characters exploring art and life in a rather authentic way. Clouds of Sils Maria may not be for everyone because it is slow paced and some scenes can become tedious if you aren't a patient viewer, but I found it a rewarding experience and a solid exploration of the passage of time and coming to terms with it. The classical music score (Pachelbel's Canon in D Major) also gives the film a touch of class. The scenery is also beautiful and it makes each conversation all the more profound.<br><br>Juliette Binoche has always been a wonderful actress so it comes as no surprise that she deliver yet another solid and touching performance. The real question everyone had was whether or not Kristen Stewart could hold her own next to this talented actress. The two share a lot of screen time together and at no point did I feel that Binoche was eating up the screen. Stewart gives in my opinion the best performance of her career (and I did really like her in Camp X-Ray and Still Alice) and she truly shines here. She won the Cesar (France's version of the Oscars) for best supporting screenplay and she proves that with the right material she can deliver solid roles. Chloe Grace Moretz also delivers a strong performance despite not having much screen time. She's hilarious in the scenes where Maria looks up her name on the internet and we get clips of the scandals she's been involved in. All in all, this is a solid film exploring some interesting subjects with solid performances and a beautiful landscape. <br><br>http://estebueno10.blogspot.com/","user":"estebangonzalez10","rank":[61,78]},{"title":"No \"action\"?","rating":9,"date":"1 June 2015","review":"Look, people, European movies are just different from American films. Particularly, French movies are different; they deal with the mysteries of human existence -- growing old, looking at the future of one's profession, grieving over loss of an old friend and mentor AND a divorce at the same time. Europeans still talk; conversation is important; debate is a delight. But to do that, one has to have ideas, a vocabulary, a sense of history, some new concepts to test -- and a feeling that human beings can still be heroic and worth spending time with. All too little of this exists in the US these days. Worse, American films have been in profit-only franchise mode for years, thus poisoning the next generation by raising their adrenaline level. Paris is currently the epicenter for world cinema and with reason. By driving for money only, Hollywood has driven the public from the theaters.<br><br>NOTE: SPOILERS TO COME 1. Maria's not in crises; she has a full plate. Overwhelmed, too much to do at once. Then her mentor dies, as she's traveling to pick up an award for him. Meanwhile her ex-husband is hassling her about money. 2. She trusts her assistant, Val, who seems committed to her and respects her. Being young, Val thinks it would be helpful to \"bring the old girl up-to-date\" with her insightful comments on movies and acting. We don't have any evidence that Val knows anything more about either than gossip and LA obsessions. But that never stopped a youngster from arguing about stuff. Maria playfully teases her back. 3. Maria would like to remain the same character she played 20 years before, when she was 18. Wild horses couldn't drag me back to 18, or 20, or 25, but it's an understandable point of view for someone who's had to adjust to being in the public eye. She doesn't really like Helena, didn't like the actress who played her, and doesn't want to end the play being left, seen as undesirable, exploited and abandoned. 4. While Maria says, \"I'm not concerned about the lesbian angle in the play; I've always been straight.\" Well, who asked her? Clearly some sexual tension is going on here with all three women, though there's nothing from Jo-Ann to Val (Jo-Ann is as cold a little bitch as required). But Val seems to be increasingly attracted to Maria and Maria seems to be healing/opening back up within the boundaries of friendship. She also peeks at Val when she's asleep. 5. As the erotic intensity increases, Val throws up by the side of the road. Seems like the well-known old \"homosexual panic\" to me, wherein one realizes that one could be in love with someone of the same sex. Whoa! Where's this coming from? Me? Eventually she only has two choices, as she's already suffering. She can ask Maria for more in the relationship (and does, only to have Maria dismiss the \"line\" from the play and Val at the same time), or she can leave. No one wants to be imprisoned in a hopeless, heartbreaking situation where one is never going to be valued or prioritized. 6. As a French woman, Maria isn't going to get all anxious about the possibility of an affair with Val; after all, she's cut her hair and is wearing more masculine clothes to \"live in the part.\" She also has played a young gay seducer before in the earlier play and film. Surely she would consider what an affair with a woman would be like. Val hasn't, I wager.<br><br>Binoche as always is a revelation; Stewart is a little too flighty, constantly in motion, but I was impressed anyway. (Still, I wondered what Lea Seydoux would have done with Val.) Moretz didn't too much for me. I really loved this film and hope others will see it with an open heart and mind..","user":"kvc2","rank":[27,33]}]