[{"title":"Well shot and well interpreted","rating":7,"date":"26 January 2014","review":"I went to see this movie mainly because it was shot in surroundings I know very well (the surroundings of Varese, in the north of Italy)and was more curious than interested. In the end, I had to say I saw a good movie, with a good photography but also a convincing story, based on an American novel, but fit for a movie which lies between a thriller and a social portrait, showing some evils of contemporary Italy. The splitting of the story into four chapters, seen from the point of view of three characters, plus a final chapter, may not be that original but works effectively and keeps the viewer's attention alive for almost two hours. So, considering the mediocrity of Italian contemporary cinematography, it is a good product and I also appreciated the performances of the whole cast, with Fabrizio Bentivoglio and Fabrizio Gifuni at their best. In my country the movie was criticized for pointing the finger at the north of Italy as the source of contemporary decadence: on the whole, besides its ideological orientation, I found it more entertaining than socially committed or politically sided.","user":"yris2002","rank":[32,37]},{"title":"Great Movie","rating":10,"date":"20 January 2014","review":"I have seen many movies in the last months, but this is very remarkable! I don't remember one that can be compared with. Amazing history, from Stephen Amidon's book, but located in Brianza, a very rich address(one of the richest in Europe), near Milan, Italy. Wonderful actors: Fabrizio Bentivoglio a 'stupid' house-agent (10/10), Fabrizio Gifuni the typical 'rich' Milanese, arrogant &amp; heartless (10/10), Valeria Golino a very compassionate psychologist (10/10),Matilde Gioli a beautiful and 'alternative' girl(yes in Italy Gioli is pronounced like Angelina Jolie) 10/10, Valeria Bruni Tedeschi (sister of the famous Carla Bruni Sarkozy) an empty minded woman in search of herself, but who pronounces the final sentence of the movie (10/10). Who killed the waiter in that foggy night? Wonderful photography by Jerome Almeras. In my heart I give one Oscar to this movie!","user":"skyluke2006","rank":[24,30]},{"title":"Finding the truth behind a mistake.","rating":8,"date":"11 September 2014","review":"Lately I have been watching lots of movies from the book adaptation and here it comes another one. This time an English language novel transformed into an Italian movie. But what I heard is that a few changes were made to bring the Italian flavor. Well, what could I say more, if you know the director you will say he's the right person to make it happen and he did excellently. Recruited the best cast and extracted best out of them.<br><br>The story of the two families narrated in the different streams when a cyclist got hit by a car on the Christmas eve. So the question has been asked, how did it happen? And who did it? The characters from two families begin to expose their role on that accident night revealing who did what. Dino, a realtor sees an opportunity to get into a big earning league so he decides to invest a large amount on it. Followed by the recession he has to face the reality of business that puts his life on a stake. Carla, the wife of a multimillionaire gives a financial support for the struggling company. Later she has to let it go when her husband's business begins to fall apart. Serena, the daughter of Dino and Massimiliano, son of Carla are the close friends. Their story follows where one of them finds their true love and another one get into sadness for some reason. When all these three episodes concludes the final chapter begins to unveil the truth with a twist.<br><br>''I know it does not look much like you, I tend to make things uglier.''<br><br>The story was told in layers which were divided into the four chapters. The story that happened between the particular timeline was repeated again and again with another character's perspective and with different camera angles till truth reveals in the final chapter. As it's still developing the opening was confusing which was the first chapter. Without holding-up in development, it straight goes with the main intention of the theme. If you pass that then the following segments interest you to make you guess the possibilities the suspense it hold. Kind of impossible to predict because of the introduction of the related characters to the particular incident consumed by the three quarters of the film. Which mean twist comes at the latter part which was really a good one. Each character that comes in the different episodes were incredible. Like, for a moment it was unhooked from the rest and centralizes that specific story stream, but the common event holds the story all together. I liked all the main characters, but the character Serena steals the final show. The role who played it was a new face and I kind see a great career ahead of her. (God, she's kind of attractive, hope its not me the only one to say that.) This was one of the recent best neo-noir. If somebody asks, I definitely recommend it.","user":"Reno-Rangan","rank":[21,26]}]