[{"title":"Great pacing - enjoyable movie","rating":8,"date":"27 December 2014","review":"This is a 'heist' movie with a fairly standard story and the usual range of characters and events.<br><br>One little difference is that it is set in Australia.<br><br>But one large difference is the pacing of the movie. It never gets bogged down and it never goes OTT - so we don't see people flying through the air, in slow motion, shooting two guns at once.<br><br>The acting is of a level where it well represents the sort of randomness found in such characters as well as offering up a hero for the audience to follow.<br><br>If you want a fun action movie with enough of a story to follow and which moves along and keeps the interest up - this one is for you, my son.","user":"mformoviesandmore","rank":[56,72]},{"title":"Australia's heading in the right direction.","rating":15,"date":"15 October 2014","review":"This film gave me shivers and not just because of the intense first act which sees us locked in a prison with some pretty ruthless men but because I regained hope for a flailing Australian film industry. I feel obliged to support my industry so often I go to the cinema reluctantly and am thoroughly disappointed by the lack of respect for the audience the filmmakers have, they believe first and foremost they must get their unworthy stories on screen and then I'm left out of pocket and dissatisfied. This time was a different story, Son of a Gun has given us a MOVIE!!! Finally, an actual movie which I could disengage and go on a ride with the characters. This isn't trying to be a groundbreaking heist film and yet it is groundbreaking for Australia, it is so well made, performances are stellar and the score is epic. We have space for our kitchen sink dramas but we also should make way for these type of films and also judge it as an Australian film. That's why I gave it 10 out of 10 because this film should be judged like all other Australian films are judged and not judged harshly because it has a big star and feels like a bigger story. I highly recommend this film.","user":"bunshin","rank":[60,84]},{"title":"Violent but good-hearted villains","rating":7,"date":"18 February 2015","review":"Movie packed with a little scent of action-drama of the 1970s. This Australian movie gets better as it is unfolded.<br><br>Good acting, good photography and a brief dose of humanity and thriving. Even if the script is nothing out of the normal, the film itself shows us a fast-driven story of convicted criminals trying to live under a small \"mafia\" organization - Love, lust, betrayal, death and commiseration will be the ingredients to cook up this story.<br><br>PS-&gt; Don't watch the trailer because it sucks and deviates you from seeing a good movie. (I avoided myself from viewing trailers years ago for any movie) - They are simple a pure commercial beacon that use the best scenes as a vehicle of opportunism to forge you into seeing something that ultimately it does not translate into what you are expecting.","user":"jpgonc","rank":[18,23]}]