[{"title":"Disaster movie for the whole family","rating":26,"date":"26 October 2014","review":"'Stonados' are appearing near Boston, i.e. tornadoes which are throwing stones (or exploding ice cubes). A science teacher and a TV journalist try to warn the population and develop a theory what's causing the storm. Two kids are meanwhile not staying home as daddy told them, but they are going to a stadium that will have to be evacuated before the storm arrives.<br><br>The advantage of a disaster movie where they don't have to save the whole planet, but just one city, is that it can tell the story in a more personal way. This is basically a movie for the whole family about a guy who saves his two teenage kids. Nothing extraordinary, but watchable. The funniest moment is when the woman accuses the weather guy of a poor forecast and is immediately killed by a falling stone - clearly a meteorologist's vengeful fantasy. Miranda Frigon from 'Primeval: New World' was the only actor I recognized, she plays the police officer helping the scientist and falling in love with the journalist. Besides, I noticed one cliché that recently appeared a lot in disaster movies: if a camera operator tries to get close to the Dangerous Thing for a good shot, he is always killed. What is it with camera operators that script writers don't like? And where is the trade union when you need them?","user":"unbrokenmetal","rank":[8,9]},{"title":"Entertaining but Brainless","rating":24,"date":"24 November 2013","review":"Stonados (2013) <br><br>** 1/2 (out of 4) <br><br>Silly but entertaining film from SyFy has Massacusettes coming under attack from tornadoes but these aren't your typical ones. No, these tornadoes have sucked up Plymouth Rock and now they are shooting large stones all over the state but even worse is that these stones blow up after a few seconds causing more damage. STONADOS is being called a rip-off of SHARKNADO but it should be noted that this film was made first and was set to air in April but due to the Boston Marathon bombing the station held its release. With that said, the film for the most part is pretty fun as director Jason Bourque manages to do a nice job at keeping the viewer entertained. I think it's always important not to let the action stop in a picture like this and the director doesn't let that happen and in fact it goes by pretty fast. The entire film has a very good pacing, which is a major plus and it also doesn't hurt that the entire thing isn't taken overly serious. The film offers up some better-than-you'd-expect performances from Paul Johansson, Thea Gill, Sebastian Spence, Jessica McLoud and William B. Davis. Another plus is that the special effects are slightly better-than-average but please don't go in expecting Oscar-winning work. The effects are all obviously fake but they're certainly much better than you normally see on SyFy. The one strange thing is that the gore level is at zero and I really don't recall there being a single drop of blood. I'm not saying this here is a bad thing but it's quite rare for one of these movies. Fans of the disaster genre should find enough here to keep them entertained just as long as they don't take it too serious or expect too much.","user":"Michael_Elliott","rank":[9,11]},{"title":"Oh Please","rating":2,"date":"1 July 2015","review":"The SyFy folks are nothing if not predictable. All you have to do is look at the director's credits to see what you're in for here. And as to the writer of this nonsense, Rafael Jordan, he has absolutely no shame. He's got a couple dozen of these horrid movies to his credit. I presume someone is paying him to do it, but I can't imagine why.<br><br>Tornadoes tossing boulders. OK. Well, I guess they had to make something, and this is actually no more insipid than Ragin' Cajun Redneck Gators or Chupacabra vs. the Alamo. Do we call this a job well done? If you were aiming to make a stupid movie, then absolutely yes.<br><br>Kudos to all involved here. This movie is a mess and the makers just have to live with that.","user":"Calaboss","rank":[5,7]}]