[{"title":"Uneven low budget movie...More ambitious than it can handle...","rating":28,"date":"28 November 2015","review":"This is a low budget movie (not that $4M are to be considered as a low budget per se) with unknown to me actors with the exception of Indiana Jones's iconic actor John Rhys-Davies (who may actually look better in his 70s).<br><br>Anyway this is an uneven movie, and by that I mean that, because of its ambition, it excels in some of its aspects and fails miserably to other.<br><br>Music has an epic Zimmer-ish feeling and sets the tone right especially when the hero goes to America. It is obviously sampled orchestras but it has the volume and the feel that you would expect from a major movie.<br><br>The editing is stellar too. A couple of fights in the beginning of the film, like inside a carriage and later in a small hut, were edited superbly and mask the otherwise lame fight choreography. Usually a shaken camera and fast edits ruin any effort for a decent fight, that looks eventually fake, but in this the result is beyond expectation.<br><br>The acting though is really, really bad. Even laughable. The 2 leads Andrew Cheney and Kara Killmer give performances for the Golden Raspberry Awards. I thought for a moment that I was watching a rehearsal from \"The dancing cavalier\" (Singin' in the Rain (1952)). The other actors (with the exception of Davies) give abysmal performances too.<br><br>The CGI are terrible and unnatural. I understand that it was necessary to give the impression of a big film (ships of the 17th century, zoom-in aerial shots etc.) but they had the opposite result.<br><br>The plot is good enough. The costumes nice. So you end up with an uneven film... I don't hate it. I found it cute here and there but maybe it would be better to pursuit a milder less ambitious goal and make better use of their budget...","user":"Dr_Sagan","rank":[23,27]},{"title":"Surprisingly fun movie","rating":9,"date":"6 April 2015","review":"I went in to see this almost completely blind, as is my habit with movies. I am a liberal atheist, so imagine my apprehension when I saw commercials for Focus on the Family, Homeschooling, and Libertarian Home Study programs! I was sure I'd walked into a preachy bit of tedium. <br><br>My worries were completely allayed by the movie, however, which was an enjoyable story which cared more about pacing and world-building than it did proselyting. A story of essentially a hired secret agent who wishes to escape a world of death and destruction for something more peaceful around the beginning of the American Revolutionary War, it's more Assassin's Creed than it is what you might think when you picture a Christian indie. Indeed, God is dwelt on so infrequently that I'd imagine in real life at this time God was mentioned more often.","user":"dustin-koski","rank":[42,72]},{"title":"Deserve better rating. 8 out of 10","rating":9,"date":"5 January 2016","review":"Simply outstanding. I cannot believe why this movie got poor ratings. May be they did not cast top rated celebrity. But everybody on this film has just nailed it. Very nice story, good adventure, action, romance, suspense more over acting what is missing just named it.Seriously it doesn't deserve this poor rating. Viewer must be misguided if they see the rating. I think IMDb authority should do something about it. Anyway each and everybody in this movie get my huge applause. In addition, a massage for those viewers who is looking for adventure, fantasy, romance, action etc. This movie will give you a package of everything. I must say again this movie deserve at least 8 out of 10.","user":"dzrony009","rank":[10,14]}]