[{"title":"Offensively unfunny.","rating":2,"date":"9 May 2015","review":"I love Elizabeth Banks. She's one of my favorite comedic actresses and I was happy to see that she got a starring role in a comedy. Well technically she was a lead in Zack &amp; Miri but in this movie it's all about The Elizabeth Banks Show. Literally. She plays a news reporter who spends a night out with friends, gets a little too drunk, goes home with some guy, then the next morning when she leaves to go to work she realizes that she left her phone in the apartment, finds out her car was towed, and of course that she left her purse in the car. So basically it's a walk of shame since everything goes horribly wrong for her and she has to get to work on time because some news execs are looking at her for a promotion or something. Let me just say I did not laugh once throughout this movie. I chuckled at a couple parts sure, but it was at stupid things like Bill Burr as a policeman telling a guy to drop his cookies, or Bill Burr calling a kid an asshole. Burr gets all of the good lines in the script basically - him and Kevin Nealon who barely gets 5 minutes of screen time.<br><br>Seriously, this is bottom-of-the-barrel humor. It's basically \"hey look at that girl, she's totally hopeless and a lot of sh*t is happening to her.\" But yeah, that's not funny, and after a while you just start to feel bad for her. I mean, everyone in this movie is SO stupid. The police in this film are probably the dumbest in any movie ever, and they're usually pretty stupid in movies so that's saying something. I know it's a nitpick but holy crap there are so many things wrong with this movie. It's borderline offensive at times, like everyone thinks she's a hooker because she's wearing a dress and no matter how many times she denies it they still treat her like one. It's just uncomfortable to watch. And the dialogue is horrendous. Whoever wrote this movie needs to be arrested because it is just mind-numbingly awful. Some scenes left me like \"wait... what was the joke? was that really it?\" Every character in this movie is incredibly stupid. Frustratingly so. None of it is believable. Not one word coming out of anyone's mouth holds any merit. It's a garbage script and this should not have been green-lit. Seriously. Awful.<br><br>I have to give it a 2/10 for Elizabeth Banks. If nothing else, this movie proved that Banks can carry a movie as a likable leading woman. She was kind of typecast as the trashy girl, but the hot sexy kind of trashy, but still trashy. But here she's a good girl with a good job who gets dragged out to a bar with her friends and things just go wrong. She's a great actress and she's the only reason I kept watching this movie. She is gorgeous. She glows on screen, literally. She's in a bright yellow dress. She does what she can with the script but there's just nothing for her to do. It just isn't funny, and it's not her fault at all, or any of the cast for that matter. There are so many funny people in the supporting cast whose talent is wasted here. And James Marsden, what are you doing man? It's a filler character, a generic romcom lead, but with a lot less screen time. Everything in this movie has been done before, all of it is generic, all of it is filler, none of it should've been put on screen.<br><br>This movie made me feel bad for Elizabeth Banks, and I hope she scores a good script that can actually put her comedic talent to use. This was just a disaster. Horrendous film. The writers need to take a walk of shame right out of Hollywood.","user":"lnvicta","rank":[81,120]},{"title":".. in fact the dress deserves casting credit","rating":30,"date":"30 September 2014","review":"No matter what else is said.. the movie officially begins at the eleven minute mark when she puts on that 'can't hardly describe it' yellow dress. From that point on, it is the honest reason why you're staying watching this movie. Overall the film is cute, and has a chuckle or two (some scenes are in fact very funny).. but it's that dress sticking in your mind keeps you watching. That and the perfect hair... that's 'wanna own up to it or not' is the essence of this film. You'll watch all the rest, and not very long after will not easily remember any of it. But should the vision of that dress come back to mind, it'll bring back much more than you thought you'd ever recall.","user":"bjarias","rank":[16,20]},{"title":"Grils Night out","rating":6,"date":"4 February 2015","review":"You know how it is: Strange things happen when you least expect them. But this is of course more like a female (tweaked) version of Hangover. The situations occurring here are a crude mix of what might have happened to someone on many different nights. Elizabeth Banks is a good sport, having to endure and go through a lot. If you want to see one, there's also a message about strong women here (which is not a bad thing at all, considering the stereotypes we get to see here).<br><br>Clichés and jokes may not always mix well, but the passion of the actors involved (even if James Marsden is merely a bystander in this one as are most of the other in the Banks show on display) do help the movie to elevate above other comedies. Not much, but at least a little bit. Obviously comedy/humor is not something that will be viewed the same by everyone. Tastes are different and this might not be your movie to watch","user":"kosmasp","rank":[6,7]}]