[{"title":"Absolute garbage - give it a wide berth","rating":1,"date":"14 February 2013","review":"Expectations can never be much above rock bottom when \"The Asylum Presents\" pops up on screen, but here they have plummeted to all new and uncharted depths.<br><br>This blatant rip-off of 2012 is simply atrocious. The acting is poor, the story is absurd, but the biggest flaw of the lot lies with the so-called \"special effects.\" They are only special in that they are probably the worst I have ever seen. You don't for one moment believe that what you are seeing is real. Not even the slightest attempt has been made at realism. This is one of the greatest insults to movie watchers' intelligence that has ever been unleashed, and it should rather have stayed unmade.<br><br>In conclusion - stay away.","user":"matthew-609-432855","rank":[40,43]},{"title":"Dreadful in every way imaginable","rating":1,"date":"13 January 2013","review":"I'm afraid I have to agree with all three reviews here, 40 Days and Nights is dreadful and quite possibly the worst movie I've seen in a while. It is almost certainly down there with The Asylum's worst, and when they are bad, bad isn't enough to describe it. And while I'm mostly encouraging with reviews and ratings, I have seen a lot of bad movies recently. Visually, it looks terrible. The scenery is too compact and dully lit, while the special effects- which 40 Days and Nights is very heavy on- at best are artificial and at worst diabolical. Even the camera work is bad, even when the ship was on turbulent sea I never got that sense as it was all too stable. Shots of Monica Keena's cleavage fared a little better, but this idea feels like a low-budget film and Asylum cliché and feels very thrown in. And if anybody is fussy about continuity I guarantee that you will have a field day spotting all of the numerous errors scattered throughout 40 Days and Nights. The music does nothing to match the movie's mood either, while the dialogue constantly feels awkward and almost as if the writers had little to no idea of how to make a movie script make any kind of sense. The story is a major failing as well, there is never anything exciting, fun, suspenseful or thrilling, the events are incredibly predictable and rushed, the scientific errors- of which there are too many to list, though the ones involving the DNA specimens were the absolute worst- make the film ridiculous and you never feel the extent of what damage the storm will do. The characters are underdeveloped and obnoxious and the acting is either wooden or over-compensated, in Monica Keena's case it manages to be both. In conclusion, a real disaster on every level. 0/10 Bethany Cox","user":"TheLittleSongbird","rank":[38,41]},{"title":"Real disaster movie","rating":2,"date":"9 March 2013","review":"I wonder how copies of this movie have not all been destroyed upon request from the actors... My favourite scenes in the movie were the ones where it was showing heavy rain, but you can see the clear shadow of lamp-posts and other objects, even the shadow of the actresses hair on their faces. You may also see that while normal people would try and wear something warm/waterproof in a bad storm, for the sake of showing Colonel Nipple's cleavage, she had to wear t-shirts even in the worst weather. And once out of the storm, her hair would be all dry, as well as her clothes. Brilliant! I guess it is actually entertaining catching these golden moments of the movie.","user":"istvan-barta-jr","rank":[24,26]}]