[{"title":"Excellent historical drama","rating":9,"date":"28 April 2014","review":"I saw this film at the San Francisco International Film Festival. I don't usually see two films in one day and was tired after already seeing another film, but Belle woke me up. I really enjoyed it. <br><br>This film would have been OK as a total fiction but given that it was based on a true story, I found it fascinating. Set in England in the late 1700's, it shows the impact of the slave trade on society. The patriarch of the family is a justice of the High Court of England and takes on an important case regarding a slave trading ship while confronting the reality of limitations faced by his mulatto niece. It shows that when someone becomes part of your family, and you love that person, it changes your perspective on cultural norms. This film has prompted me to look into the history of the actual legal case involved. <br><br>The film also showed the similarities between his white and mulatto nieces: as women both had a price on their heads and suffered due to their \"place\" in that society beneath men... This film showed that while much has changed, many attitudes have not changed in 300 years... The two brothers who court the nieces could have come from any current film if they just updated their styles of clothes, hair, and accents.","user":"sfdphd","rank":[82,95]},{"title":"Mesmerizing and romantic true story","rating":10,"date":"29 April 2014","review":"I just saw an advance screening of BELLE--and I absolutely loved it. The dialog, directing, performances, costumes, locations, and cinematography were all fabulous. <br><br>It's based on the mesmerizing and romantic true story of the beautiful, intelligent, mixed race daughter of an admiral, who was raised in Georgian England by her aristocratic great-uncle and his wife. The script hits all the right notes as Belle struggles to find her place in a society that doesn't quite accept her, and with the help of an idealistic young vicar's son (Sam Reid-- fantastic), influences an important anti-slavery case. <br><br>Congratulations to director Amma Asante and writer Misan Sagay for bringing this story vividly to life on the screen. Gugu Mbatha-Raw was luminous as Dido Belle, and I think Tom Wilkinson gave the best role of his career. Both are Oscar-worthy performances. The film is highly recommended.","user":"authorsyriejames","rank":[64,77]},{"title":"Mbatha-Raw drives the film","rating":8,"date":"9 May 2014","review":"In years hence, audiences will be able to point to this film, as the moment the world knew Gugu Mbatha-Raw was going to be big. Belle is Amma Asante's feature-length directorial debut, and her work here is astonishingly confident. Tackling a period piece may seem daunting to most, but in Asante's case, she has the benefit of a top-notch cast, and a truly fascinating story. Loosely based on the story of Dido Elizabeth Belle, Dido was the daughter of an enslaved African woman and an English admiral.<br><br>As the film begins, although she is born illegitimate, Dido's father (Matthew Goode, Stoker) gives her over into the care of his great-uncle, William Murray, the first Earl of Mansfield (Tom Wilkinson), who acts as the Lord Chief Justice of the British courts. As she grows into a young woman, Dido's life at the palatial estate of Kenwood is full of mixed blessings. While her uncle and aunt (Emily Watson, Breaking the Waves) treat her as if she were their own—they raise her alongside their other niece, Elizabeth Murray (Sarah Gadon, A Dangerous Method)—social conventions of eighteenth century society are immovable; no matter how much they love her, Dido feels the sting of being forced to eat with the servants, when company comes calling.<br><br>The greatness of the film comes in its intricate plotting, and in the parallels drawn between gender and race. Author Jane Austen dealt with the position of women in English society through the use of dry humor—though the rage at a young woman being forced into marriage in order to secure a safe future was always very much present. In Belle however, there is no satire to soften the blow. As Elizabeth comes out, venturing to London in search of a husband, she points out to Belle the inherent unfairness of a system that allows women to be treated as male property. Dido doesn't necessarily have the problem of a search for a husband, as the inheritance of her father's fortune ensures that she is financially secure; but for a radiant young woman in the prime of her life, her uncle's insistence on keeping her out of sight understandably rankles her.<br><br>Matters are complicated by the arrival of John Davinier (Sam Reid), the son of a local clergyman. Ambitious and wide-eyed, John wants to try to rise in station, training with Lord Mansfied to become a lawyer. His outspoken, radically abolitionist views on a notorious legal case Lord Mansfield is trying annoy the Lord considerably; but he rouses all the passionate feeling in Dido that she has been forced for so long to suppress.<br><br>As Lord Mansfield, Wilkinson (Batman Begins, Michael Clayton) plays the exasperated father figure with the correct touches of humor and warmth. As a judge, he projects the inner conflicts of a man with the weight of the entire economic system on his shoulders; you can see him try to deflect from the strong-arming of local politicians, who want to ensure that the presence of the \"mulatto\" in his house will not affect his ruling on the case. As Elizabeth, Gadon takes what could have been a very stereotypical role of the flighty, romantic English girl, and brings a deep sense of hurt to it. Having been left with her uncle after her new stepmother successfully wrote her out of her father's will, Elizabeth's cheery exterior hides an emotionally hurt young girl.<br><br>And finally, there is Mbatha-Raw. As Dido, the engine that drives the film, you may deeply feel her two-fold frustration as a woman, and as a person of color. You will be carried away by her passion—her belief that things should not remain the same. On a more general level, the camera absolutely adores her. She moves and projects with a vitality and ease that forces one to stop at several points. Her characterization and her performance are so accomplished, that her independent-minded heroine could stand toe-to-toe with the multiple incarnations of Jane Austen's Elizabeth Bennett. If Belle is any indication, and if there is any fairness in this world, there should be more great things to come from her.<br><br>-Nick Kostopoulos - See more at: http://www.mediumraretv.org","user":"MediaPanther","rank":[40,48]}]