[{"title":"Overused CGI and terrible performances.","rating":5,"date":"23 February 2020","review":"Not as bad as i thought it was going to be, but the casting was a major issue. Why didn't the gods of EGYPT look EGYPTIAN? The earth's place in the cosmos and the lore was neat and interesting. But the overuse of CG took away from it and the ending was cheesy. The giant snakes were pretty cool though.","user":"MR_Heraclius","rank":[36,42]},{"title":"SURPRISE: Actually quite good!","rating":9,"date":"20 July 2016","review":"Do not trust \"movie professionals\" who know nothing about the Kemet - the original ancient Egyptian religion. Yes, this is an action movie. Yes, it diverges a lot from canonical ancient Egyptian religion. Yes, it is \"too white\" for ancient Egypt. Yes, there is a mixture of Hellenic interpretation which kinda does not fit in. Building an \"Super Seth\"? A pure nonsense.<br><br>But you know what? It does not matter as it captures the spirit of Kemet pretty well. Seth versus Horus? Oh yes. Flat Earth with day side and night side and never ending fight of Ra with Apopis? Yes. Debates between the humans and gods leading to sort of understanding and sort of tolerance? Yes. Nepthys, the wife of Seth, \"excellent goddess\",protective goddess, feeling sadness for people dying? Yes. Multiple Thowt servants, mapping the knowledge? Yes! (Please do complain, black racist people here: Black Thowt is displayed respectfully here!) Hathor, \"cursed by love\"? Yes! Isis, the super model of double betraying women that will betray her son to betray his enemy to allow her son win? The nasty manipulating goddess that is so sensitive to people in love? Oh yes! Anubis, the inert god that feels nothing towards gods of men yet fights for the order of the underworld? Yes! Lots of action in between Egyptian gods? Oh hell yes! Actually I do appreciate the effort to capture the feeling of Kemet. Yes, this is not the Kemet. But considering all the alternatives I have ever seen, this is the very best. Actually, the Christian overtones of God understanding the nature of suffering the mortals are not damaging, they are helping! Dear \"professional\" reviewers! Any single of you who reviewed this movie less than 40% - please ask me for a diploma that certifies you have sh*t for brains, you know sh*t of history, culture and you should focus on movies like The Independence Day. In such movies your cultural ignorance has no distortive value.<br><br>For all others: This is a fairy tale. An American fairy tale. But the American fairy tale that has *the feel* for the dynamic of ancient Egyptian religion. It is an excellent movie, it is fun, full of action and actually does not insult ancient Egyptian religion.","user":"the_wolf_imdb","rank":[182,285]},{"title":"Awesome fun spectacle","rating":8,"date":"22 June 2016","review":"This movie is pretty much what you get when Alexander Proyas saw Clash of the Titans (2010) and Wrath of the Titans (2012), and says to himself \"What the hell is this? This isn't Harryhausen!\" ... and then he goes off an makes a pitch-perfect film that pays homage to the classics - Clash of the Titans, Jason and The Argonauts, etcetera.<br><br>It's awesomely done, with fight scenes reminiscent of Wuxia films from the 1980s, a color palette that's sublime, and a sense of humor that shines through.<br><br>Ignore the critics. Just enjoy a damn fine movie that hits all the right spots to enjoy with a bucket of popcorn.<br><br>Bonus: It has zero product placement - which makes up for I, Robot.","user":"Spectec","rank":[78,126]}]