[{"title":"Bland even by holiday TV movie standards","rating":2,"date":"15 December 2013","review":"Christmas Bounty follows a young Manhattan teacher, Tara, who has all the pieces of an upscale life coming together. Then she has to go back to Jersey to her life as a bounty hunter to track down an ex con coming after her. Her Manhattan boyfriend complicates things by following her and getting in the middle of the firefights, but also making things awkward for her Jersey ex, Mike. This movie has the feel of a t.v. family film, but then stages scenes where bounty hunters and criminals are pointing guns at each other. And instead of feeling any kind of tension, I'm thinking, \"They can't actually have someone get shot on an ABCFamily movie, can they?\" I don't know what kind of family would want to sit through this anyway, because it doesn't work for kids--the story is all gun fights and love triangles. It has nothing to do with Christmas, by the way, which will probably complicate the network's plan to turn it into a perennial holiday classic. The acting is cartoonish and the action is completely bland. I can't imagine anyone finding it entertaining. Possible career-ender for The Miz and anyone else involved.","user":"jfgibson73","rank":[8,8]},{"title":"This was a big \"MIZtake\"","rating":3,"date":"18 September 2014","review":"A former Bounty Hunter (Francia Raisa) leaves her tumultuous life behind when she decides to kick it to the curb for an easier lifestyle. She becomes an elementary school teacher, finding a fiancé in the process, who has no idea of the life Tory once lead. Tory is forced to go back to her old life when an old nemesis wants revenge. I don't wanna come across as the Grinch. I really did try to go into this movie with an open mind! I'm not that easy to please. I love wrestling, but I'm not a Miz fan. Naturally, when I found out about this movie I decided to avoid it like the plague. Don't ask me why or how, but for some reason I decided to give it a look! curiosity is a terrible thing sometimes, especially when you're a wrestling fan about to watch a WWE Studio's production. This movie is bland as you probably expected it to be. Every once in a while, a made for TV movie can wind up catching you by surprise. No such luck with this one. Movies involving Bounty Hunters rarely ever work out. There are so many things wrong with this movie that I don't know where to begin. Let's start with the awful Christmas tunes that made my ears bleed! It's full of cringe inducing comedy and sentimental BS, which gets tiring fast. The main problem with this movie is that there is not one likable character in this movie! Everybody is extremely annoying and very cartoonish, suffering from the pratfalls of the overly predictable script. The Miz's character isn't all that distinguishable from his persona in real life. He comes across as overly arrogant, but doesn't have the charisma to pull it off. \"Mikey Muscles\" ? Give me a break! When I heard him say \"You're smoking hot ex-boyfriend\" , I knew I was in trouble. Francia Raisa is thoroughly annoying and pretentious as our heroine. I couldn't stand to watch her. The love triangle with Miz &amp; Greenberg was painful to watch. Will Greenberg plays the buffoonish fiancé well, annoying the crap out of me. <br><br>Boring action, painfully predictable romance, terrible characters, and poor writing really sink this movie. This is as bland as you can possibly get! I got what I deserved by choosing to watch this movie. Don't make the same mistake<br><br>3.8/10","user":"callanvass","rank":[5,5]},{"title":"Ridiculously Stupid","rating":2,"date":"1 December 2013","review":"There hasn't been a new Christmas movie that has been worth watching in a very very long time.<br><br>This movie reminded me of bumbling three stooges type of antics.<br><br>SPOILER WARNING BE ADVISED. STOP IF YOU DO NOT WISH TO KNOW MOVIE DETAILS<br><br>A very unrealistic slapstick goofy dumb and dumber type of film where thousands of gun shots are fired by not only the bounty hunter family and co-workers, but the bad guys as well.<br><br>NOT ONE of those thousands of gun shots ever hit anyone. Bounty hunters that can't hit their target? Really? Every thing else was hit BUT the actual target.<br><br>Maybe this movie was meant to be a slapstick type of comedy where you're not supposed to take it too seriously, but it went way past that.<br><br>C'mon ABC Family, Hallmark, Lifetime and other networks that normally put out new Christmas movies every year. Please make a Christmas movie that is truly worth the viewers time. It is rare to see a really good heartfelt holiday movie with great acting and a very good script that was executed brilliantly. While rare, they ARE out there but they're few and far between.<br><br>These dumb holiday movies that they throw at you every year are tiring and a waste of time.","user":"judyjholland","rank":[6,7]}]