[{"title":"So underrated yet so Powerful!","rating":10,"date":"2 January 2019","review":"What a film! What a measage it carries!<br><br>Alot of the critics reviews don't seem to like this film but I think thats because they simply don't understand and haven't taken the time to be sucked into the story line and see the wider picture.<br><br>Throughout this film, the story will take you on a rollercoaster of confusion and feelings. You'll feel confused, you'll feel like you don't know what's going on, you'll feel like you missed something but believe me, thats supposed to happen.<br><br>With all these feelings going around, it takes the ending of the film for everything to be brought together and for the message to be found.<br><br>The message and the realisation is so strong that you will then feel heavy inside.<br><br>This film has been put together brilliantly. It takes just that bit of patience and understanding to realise what is going on, and that is just like the real thing.<br><br>This film has really opened my eyes and I thank it for that.<br><br>Again, brilliant movie, ignore what the critics say and just put the time in to truly understand it and enjoy.","user":"ndmartin-37144","rank":[12,12]},{"title":"Probably one of the most under-rated films I've seen.","rating":9,"date":"21 February 2017","review":"Wow the critics went hard on this film and I don't know why.<br><br>It's probably one of the most under-rated films I've seen, and I'm glad I did, as it was excellent.<br><br>I'm not a huge Shia LaBeouf fan but his performance in this was outstanding! I hope he wins some type of award for his amazing acting.<br><br>It was a little slow in the beginning but the back and forth between time lines was interesting enough (and kept getting more interesting) to keep me hooked in. Although I'm not a fan of back and forth time lines (I actually hate too much of it), this was done very well, and it was necessary to keep the viewer guessing and in suspense of what happens next.<br><br>The film did very well in getting a strong point across about vets and PTSD. <br><br>It's too bad the critics couldn't see the glory in this film - directing, acting, cinematography, score, etc... all top notch!<br><br>A well deserved 9/10 and a must see film!","user":"TheTopDawgCritic","rank":[127,180]},{"title":"Must watch till the end","rating":10,"date":"8 January 2019","review":"Must watch till the end, then it suddenly makes so so so much sense &amp; puts you in the mind of somebody with PTSD, the ending broke my heart.","user":"benbeggins","rank":[6,6]}]