[{"title":"\"The issues for KILL YOUR FRIENDS stem from a very unfocused script that never seems to have a chief goal to aim for\"","rating":5,"date":"10 March 2018","review":"\"Get fucked, you wouldn't last 10 minutes\" quips Steven Stelfox (Hoult) right into the camera early on in KILL YOUR FRIENDS, the adaptation of John Niven's 2008 novel. He's aiming this put-down at the viewer as an exclamation of his superiority over us. He wants us to be envious, jealous, maybe even hate him. He's an A&amp;R man in the music business, and he wants us to know that his life is awesome, and ours is not when compared to his. This set-up is then followed by roughly 90 minutes of the sort of drug-taking, jet-flying and partying exploits that could be expected, with the odd merciless killing thrown in for good measure. By the end though, it's difficult to feel envious of him, because when it comes down to it, his life (and by implication; this film) is really not that great.<br><br>Set in the year 1997, Stelfox is consistently hunting for the next big thing in music. In doing so, his excessive lifestyle can be permitted to continue. He will stop at nothing to be successful in this business and he's not afraid to step on toes to get there. When even that won't work, there are always... other options.<br><br>Nicholas Hoult, at first glance appears too young to play this role. The baby-faced actor is a little difficult to take seriously as a top A&amp;R man when the majority of his colleagues appear at least 10 or 15 years older than him. Hoult however, carries himself nicely in the lead role, doing all that can be reasonably required of him. Unfortunately the issues for KILL YOUR FRIENDS stem from a very unfocused script that never seems to have a chief goal to aim for. The story attempts to make up for this by throwing in some genuinely shocking scenes of violence that will long be the images engrained in people's mind when they think back to this film.<br><br>The consistent fourth-wall breaking nature of Stelfox's character, coupled with the ever-present voiceover means we always know exactly what's going on in Stelfox's head. But this doesn't necessarily ensure we always know why he's doing the things he's doing. His eventual foray into murderous tendencies is not handled with any clear focus and subsequently just feels out of character, even for someone with his levels of excess.<br><br>John Niven's adapted screenplay is keen to hammer in the point that the music business is full of people, tasked with pulling the strings of artists who all have egos that outweigh their talent by a considerable margin. Niven himself worked in the music business for ten years, so its more than likely his characters are loosely based on real people that he has came across during this time. This adds a certain authenticity to the proceedings here, and it's not exactly too difficult to imagine some of the people were genuinely like this, especially in the 'experimental' 90's music era.<br><br>For all the good intentions involved here, KILL YOUR FRIENDS comes across as a distant British second cousin to both THE WOLF OF WALL STREET and AMERICAN PSYCHO, paying homage to both but never really finding its own identity.","user":"Oli_palmer23","rank":[10,12]},{"title":"Moments of brilliance","rating":6,"date":"10 November 2015","review":"I loved the book. The book is laugh-out-loud funny. The problem with this cinematic adaptation is that there are only a few laugh-out-loud moments. Tone is the problem. The opening sets up the tone as dark and unpleasant and the main character as thoroughly unlikeable. We have to spend an hour and a half with this guy? It's like having to sit beside a racist drunk on a night bus. But it's hard to not like Nicholas Hoult (and the scathing honesty of his character) and the film did grow on me - perhaps like a tumour. There are moments of brilliance and a few great lines (no pun intended) but ultimately the buzz doesn't quite feel worth it.","user":"melmoth1972","rank":[23,34]},{"title":"Entertaining enough to me","rating":7,"date":"23 April 2016","review":"The movie is all about Steven Stefox (played by Nicholas Hoult), a guy working in the music industry, as a guy that is supposed to discover and sign new bands. He's not very good at his job, so he tries other ways to achieve his goals. I'm not sure why it's also categorized as a comedy because you won't laugh one bit. It's more a crime story with a lot of drugs and a narrating voice describing what to do to make it in the music industry. It's entertaining to watch. Steven is a narcissistic person, addicted to fancy drugs, and doing everything it takes to make it to the top. There are no likable characters in the movie but that's not the point. They are all career driven and very egoistic. Since it is about the music industry you have a lot of tunes, some good ones but also bad ones. It's not a bad movie even though I saw better similar ones.","user":"deloudelouvain","rank":[15,22]}]