[{"title":"Cute. Hilarious. And entertaining.","rating":7,"date":"2 May 2014","review":"I watched the trailer last night and saw Sasha Pieterse in it. Since I have always been a huge fan of PLL I decided to watch it.<br><br>I must say, i never thought i'd like this movie. Since i never watch a gay movie before, i really don't know what to expect. But it was not that bad. It was a really fun movie to watch. I was surprisingly entertained. It was hilarious that I couldn't stop laughing throughout the movie. It was well-acted. I literally loved every character in the movie even the mean bee and drama queen. The movie was well made. Plus, i love what it stands for.<br><br>Gay or not, this is definitely a movie everyone will enjoy.","user":"PotatoChips9","rank":[10,11]},{"title":"So much fun","rating":26,"date":"26 September 2013","review":"This film is about a gay guy who got outed in high school. He instantly becomes the most sought after guy by the hottest girls in school.<br><br>The script of \"G.B.F\" is great! The story is hilarious right from the start, with the hottest girls wanting to have a gay best friend for various reasons. Tanner enjoys the new found attention, and he instantly becomes the coolest guy in high school. Watching the girls battle it out for the gay best friend title is so funny, the battle is so full on, with loads of attitude. The characters are all very developed and differentiated. I really like the fact that even the supporting characters are memorable, like the Asian guy and the Mormon guy. It's such a drama filled fun film, I really enjoyed watching it.","user":"Gordon-11","rank":[26,34]},{"title":"Darren Stein's epic comedy of high-school peer pressure madness","rating":8,"date":"1 May 2013","review":"G.B.F. is a great comedy, a tender best-friends love story and a wild and wacky take on high school popularity, peer pressure and what it takes to \"find yourself\" in today's media saturated world for teenage gay boys and their female friends. Did I mention its also hilarious? Because it is. Seasoned director Darren Stein (Jawbreaker) enthusiastically serves up candy colored images, laugh a minute chatter and a whole lot of heart with this dizzying satire of three-dimensional high school characters who are so hyper-aware of the cultural stereotypes they embody, that they turn your expectations continually on their ear. The top flight cast includes Natatsha Lyonne, Megan Mullahy, Xosha Roquemore, Jonathan Silverman, Rebecca Gayheart and Michael J. Willett as Tanner, a newly out of the closet gay guy who \"Doesn't act like the gays on Bravo,\" according to the school's three most popular girls, who quickly give him a stylish queer makeover to make Tanner their idea of a proper new \"Gay Best Friend.\" All this leads up to the prom in the classic teen comedy tradition, and its all silly and fun, but the heart and soul of B.B.F belongs to Paul Iacono, who plays Tanner's flamboyant best friend Brent who happens to be gay and more \"femme.\" Iacono's crack comic timing still allows for emotional depth of his character's soul to come forward. In a delightful movie full of cake and ice cream, Iacono's serves you the deep main dish. Don't miss this one.","user":"bloodbank-643-817114","rank":[32,43]}]