[{"title":"Landscape is Destiny","rating":5,"date":"11 January 2015","review":"Greetings again from the darkness. The Hatfields and McCoys family feud has long been a favorite topic and inspiration for literary and film projects. Lesser known, but ultimately more tragic and historically vital, is the 1863 Shelton Laurel Massacre during the Civil War. The novel from Ron Rash is the foundation of director David Burris' film that explores the fallout of that incident more than 100 years later in the very rural Appalachian hills of Madison County, North Carolina.<br><br>It doesn't take us long to get a line on Travis (Jeremy Irvine, War Horse), a high school dropout with authority issues who hangs out with his equally aimless friends, including Shane (Haley Joel Osment, The Sixth Sense). We have seen many film depictions of hillbillies over the years, so the grim atmosphere of unemployment, isolation, lack of education, drugs and lack-of-hope aren't surprising, and the undercurrent of the 1863 event is what should have set this one apart.<br><br>Interest picks up when teacher-turned-drug dealer Leonard (Noah Wyle) takes Travis under his wing after Travis has an unfortunate run-in with Carlton (Steve Earle), another local drug dealer. Travis moves in with Leonard and his drug-addicted girlfriend (Minka Kelly), and takes a real interest in the journals of Civil War soldiers that Leonard has collected. These stories spark a curiosity within Travis, in particular the saga of 13 year old David Shelton – one of the victims of the massacre.<br><br>It's the fact that Travis is oblivious to the history of his family, and how this event has so affected life in his hometown, that makes this story difficult to buy into. In spite of the communication void between Travis and his father, it's just not possible that the massacre would not have been a frequent topic of discussion throughout the years. Beyond that, this is little more than a typical small town battle between drug dealers  albeit two very articulate drug dealers. And yes, guns and turf do play a role here.<br><br>Jeremy Irvine, Noah Wyle and Steve Earle each make their characters someone interesting to watch. On the other hand, the female characters are mostly after-thoughts or plot devices. Travis' mother maintains a forlorn look that registers her resignation to fate, while Minka Kelly mostly gets knocked around (save for one excellent scene while alone with Travis), and Adelaide Clemens provides the rare sparks of light and optimism as Travis' love interest – and then just as quickly becomes a non-entity.<br><br>The fine acting and excellent camera work deserved a better story, especially given the framework of history. There is a recurring hillbilly philosophy in the movie that states \"Time don't pass. It's just layers. It's all still happening.\" That philosophy could have better tied the current story into the past, which would have elevated this film to a new level.","user":"ferguson-6","rank":[37,48]},{"title":"A gorgeous film- way, way under rated!","rating":9,"date":"6 February 2016","review":"This is a lovely little film. Wyle plays a fascinating, and multi layered character, that is well written. And he played it very well. The entire film was very well written. I suspect some of the poor reviews were due to the fact that this film was written for adults! It had historical value, as well as interesting characters, that were well developed. The cinematography was excellent, and the editing was also very good. A tight production, that was well directed. The film had a real sense of time and place. The characters seemed genuine, and real. The historical context of the story was well played out. <br><br>In the current climate of Hollywood, which is essentially suffering from creative bankruptcy, a film like this is a breath of fresh air. More please.","user":"latinfineart","rank":[9,10]},{"title":"Good Acting & Believable Characters in This Gritty & Depressive Drama","rating":7,"date":"1 May 2015","review":"If you're looking for a feel-good type movie this isn't it. However, if you can get into a very gritty, at times grim film, that has excellent acting and believable characters then this indie might be worth a watch. Set in the 1970's North Carolina Appalachia country (the cinematography is superb), Noah Wylie stars as Leonard, once an Illinois school teacher, but now a small time drug dealer and Civil War buff, living in a trailer with the sexy Dena. Minka Kelly very ably portrays Dena, a drug addict with zero self esteem, who appears to be living comfortably with Leonard, but when the drugs run out, will sell herself and her body to whomever can supply the next fix.<br><br>Jeremy Irvine also gives a strong performance, as Travis, a lost soul seemingly going nowhere with his life, who will end up staying with Leonard and Dena, after his abusive SOB father (Alex Van) doesn't want him to return to their home. Despite being a school dropout, Travis is a voracious reader, and becomes quite interested in Leonard's Civil War books, and they will begin to bond with their common interest.<br><br>One central theme of the movie will be the so-called Shelton Laurel Massacre, in 1863, where Travis learns that several of his kin were accused of Unionism during the Civil War, and killed by a firing squad made up of a local Confederate regiment. They'll be some key surprises revealed as the film progresses, regarding both Leonard and Travis's relatives and the massacre over 100 years before.<br><br>Much of the tension and drama will revolve around Leonard's low-life drug dealing neighbors, the brothers Carlton and Hubert. I thought Steve Earle was exceptional in the role of the older brother Carlton, and Marcus Hester also does well as Hubert. Also, Adelaide Clemens (who reminded me so much in appearance and mannerisms like Michelle Williams) adds well to the mix as Lori, a nurse and possible love interest for Travis. The involvement of these characters together will eventually provide a most combustible situation and lead to quite the tragic and gloomy finale, but offering a ray of hope for some of them.<br><br>David Burris does a most credible job here with directing, from a solid screenplay from Shane Danielsen, based on the novel by Ron Rash.<br><br>All in all, this gritty indie will probably only appeal to a certain audience, but I found it engaging throughout with it's believable characters. To be honest, I wasn't thrilled with the rather ambiguous ending, but I felt the overall strength of the story was enough to outweigh that aspect.","user":"larrys3","rank":[5,5]}]