[{"title":"Best DTV Action Movie Ever?!? Possibly!","rating":10,"date":"25 September 2013","review":"Saw this early at the Fantastic Fest in Austin, Texas and it is quite possibly the greatest DTV action movie ever made.<br><br>Though many would not be proud of it, but I am a DTV (direct to video) expert. I subject myself to watching pretty much every DTV action movie ever made. Though most of them are just absolutely awful, it is all worth it when a Unisol Regen or Blood and Bone comes along and blows you away.<br><br>The main problems with dtv movies are: 1. Zero budget 2. Shaky cam/quick edits 3. Actors not willing to put in the work for the fight scenes to look realistic 4. Stupid plots with dumb romances<br><br>Though Ninja Shadow of a Tear is on a small budget, all of the aforementioned problems are fixed. The movie is completely without shaky cam and quick editing. The plot is very basic and there is no fat to try and make it anything other than what it is....an incredible action movie. And finally, the incredible Scott Adkins and the amazing stunt team put in some amazing fights.<br><br>One scene in particular is Scott Adkins versus 6 guys in a dojo and the entire fight is filmed in one take with zero editing...like the Alphonso Cauron of DTV shots. It was absolutely amazing.<br><br>Just an amazing fight movie that takes the best fight scenes ever and mixes it with Rambo, old Cannon movies from the 80's, and Enter the Dragon and other Asian flicks from the 70's. Just a perfect movie that looks like a big budget Hollywood flick. Not a single dollar was wasted and no goofy cgi or wires were used. <br><br>I can't recommend this movie enough. The action is incredible and everything came together to make one of the best fight films of all- time. <br><br>Hollywood, please wake up and give Adkins/Florentine a budget and I think you would be amazing at what they can do.<br><br>If you are looking to check out other great DTV movies and save yourself the trouble of all the nonsense and garbage I have seen, check out the following. But most importantly, check out Ninja Shadow of a Tear when it is released. It is a definitely blu-ray buy for me.<br><br>1. Universal Solider Regeneration 2. Ninja Shadow of a Tear 3. Blood and Bone 4. Undisputed 3 5. Wake of Death (pretty much all of the Van Dammes are watchable) 6. Undisputed 2 7. Universal Soldier Day of Reckoning (just watch the last 45 minutes)","user":"Ivan_Drago21","rank":[83,108]},{"title":"Not the best plot, but definitely the best action","rating":10,"date":"19 December 2013","review":"I will start by saying, I have never reviewed a movie on IMDb before but felt compelled to do. Scott Atkins is the new van damme.<br><br>I cant say much for the plot / storyline however the acting was fine, and the action was beautifully choreographed. It looked so real. The action more than makes up for the lack of depth within the story itself. Scott for me, carries the film but he does it so well. <br><br>I hope Hollywood pays attention to this guy as he is extremely talented. As crazy as it sounds being that this was a Direct to TV movie, I was thoroughly engaged and entertained throughout the whole film. Its Fast paced almost from the get go and action packed.<br><br>I hope to see Scott in some big budget block busters next year and beyond.","user":"marlonsmith1234","rank":[33,42]},{"title":"Probably Isaac and Scotts finest hour!","rating":8,"date":"1 July 2014","review":"I have long been a fan of Isaac Florentine, for many many years now.<br><br>His films always aim to grab that feel from the 80's classics of Hong Kong cinema, yet are often marred by weak story lines and silly acting.<br><br>That said, one thing that always stands out is the fight scenes - and none more so than this awesome sequel, Ninja: Shadow Of A Tear!<br><br>I liked the first Ninja movie and thought Scott Adkins, as always, proved his worth as a martial arts actor. There was just a small hint of 'meh' that surrounded the first causing it to be slightly forgettable.<br><br>It seems though, with Shadow Of A Tear, that hint of 'meh' has been thrown to the side!<br><br>Again, acting and story line plays second fiddle to what is possibly some of the best fight scenes ever put to film in a Western production!<br><br>Beautifully shot, crisp with amazing choreography, I felt that Ninja: Shadow Of A Tear stands punches and kicks above the over-rated hit, The Raid...","user":"Movie-Misfit","rank":[10,11]}]