[{"title":"An Intoxicating Thriller. Incredible.","rating":10,"date":"15 August 2017","review":"Sometimes I cannot understand the dissonance between me and a great number of movie reviewers on this page. I had not seen any trailers of the sort because I didn't want to preview parts that may spoil he movie. With that said, I'm so glad I watched this film. This ranks with Green Room as a real edge-of-your-seat kind of movie but for entirely different reasons. While Green Room is just a unhinged speed chase offroad in complete darkness, leaving you dizzy with blurting holy sh't every 10 seconds, The Invitation takes it's time while not letting the story flatline. The use of ominous shots and reverberating violins really give you that sense of unease. <br><br>The buildup, the paranoia, the character-structuring, the heavy atmosphere all build up to a short and worthy second half of the film. <br><br>Honestly, it's frustrating to see so many people give this movie a criminally low rating because 'nothing happens'? Was I watching the same movie? Because what I saw building up to the climax was some of the most gorgeous shots with very grounded characters that immersed me into the story. People react to a movie that they were expecting and it wasn't, so they rate it a 1. Really? This is a quality thriller that I recommend everyone check out.","user":"afrodome","rank":[230,319]},{"title":"Incredibly tense, oddly realistic","rating":9,"date":"26 May 2016","review":"I couldn't believe my eyes when I saw the score for this film. It doesn't do it any justice, and some of the reviews I've read here don't make valid points in my opinion. So, I felt I owed this film my own review.<br><br>First of all, the tension: man this thing has a killer build-up! You could call it slow (if you're a Transformers kind of guy), but it never gets \"boring\". You're on the edge of your seat from the moment the film starts, partly due to a very subtle but creepy soundtrack, which reminded me of sound effects in some of David Lynch's movies. Adding to that is the fantastic performance of Logan Marshall-Green as the tormented Will. He, and the events that follow, will keep you guessing about his mental health and whether his paranoia is justified or not, almost until the end. Michiel Huisman plays the very smooth and lulling host to great effect, and the rest of the group of friends is also very believable and natural.<br><br>THE scene (no spoilers, you'll know which one I'm talking about when you see it!) was so well done I really had the feeling I was there. It all happens so slow, so eerily apropos, and so jaw-droppingly unexpected that you really get the feeling of \"oh my, that could be me out there\". The little twist in the last couple of minutes is the cherry on the cake, and makes you even more uncomfortable than you already were.<br><br>This is a case of an \"ignore the scores, just watch it already!\" film, and I hope you enjoy it every bit as much as I did!","user":"funky-archibald","rank":[211,305]},{"title":"A thriller for people who don't watch horror films","rating":9,"date":"14 March 2017","review":"I'm not going to give a review of this film. I'll leave that to others who can argue whether it was worth watch or not. For me, I feel it was one of the best thrillers with a horror bent that I have seen in a long while. But here's the thing, I don't really like horror films, avoid them most of the time, unless I heard a good word of mouth from someone. That's how I found The Invitation.<br><br>After reading the reviews here, I would say the criticism falls in to two opposing camps. Those that thought it was thrilling, terrifying and well done movie and those who thought it was a waste of their time, slow and they saw all the punches coming.<br><br>I think the difference is this, the latter camp watches a lot of horror films, nothing surprises them, they are looking for all the little nuances of all the other horror movies they have watched and are comparing them to the film they are currently watching. They are two - three steps ahead of a conventional audience and thus, nothing surprises them. To these folks, I can understand why the film fell flat, it's clear if you put the movie under a microscope you can tell what's going to happen and naturally with the purposefully drawn out pace of this film, they get bored waiting for the payoff.<br><br>I, as well as the people who I have give / shown this film to, fall in to the other camp. We rarely watch films like this and therefore are willing to let it all play out without trying the guess what's going to happen next. It's certainly a creepy film and while we might imagine where it's going, we are willing to suspend our expectations and go along for the ride.<br><br>My advice, watch this if you enjoy the ride up on the climbing roller coaster without thinking about the plunge when you reach the top.","user":"crazycokedupdream","rank":[110,159]}]