[{"title":"A 6 if you didn't see the original a 4 if you did","rating":5,"date":"24 September 2016","review":"The third American remake of Akira Kurosawa's Seven Samurai. It has a great deal of the same issues but they are exacerbated in this third iteration. This movie of the three has weakest storytelling but some of the best action, but it doesn't feel like a western. And it isn't quite an action movie instead it is this kind of middle ground that just makes the movie feel lost and out of place. And that is one of the over arching issues with this movie, it doesn't know what it wants to be.<br><br>*LIGHT SPOILERS BELOW*<br><br>Everyone besides Denzel Washington has no motivation. The big bad guy an evil corporate industrialist (who honestly gains nothing by destroying the town...he has the mine rights already and would greatly benefit from having a town nearby) decides to destroy the town, murder half the inhabitants and set the church on fire in the first 5 min...just so you know he is evil. Chris Pratt's character Faraday is motivated to get his horse back and an obscure promise of some payout. But he realizes early on that he has his horse back and the payout isn't that much, so he kind of stays and dies for no reason. Ethen Hawke's \"Goodnight\" and Byung-hun Lee's \"Billie\" show up because Denzel asked nicely (again no talk of a payout). And this repeats itself with the rest of the characters, (except for the good Comanche Indian Denzel ate a raw deer liver so they became be-sties). And it gets worse because all the magnificent seven are the same stereotypes you have seen in Hollywood since the 70's. Mountain Man into Jesus, Noble Indian Savage, Mexican Bandit, Confederate Soldier with PTSD, Gambling Cowboy, token woman that can shoot, Asain samurai with a pistol, and the only real character Denzel Washington as Chisolm. <br><br>The action in this movie is however fast paced and over the top...Think of a western \"SHOOT EM UP\" and you have it. They do not use the traditional idea of western movies that build up the tension over the course of a movie. It is suddenly, Chris Pratt kills 8 bad guys in 15 seconds. Billie (the samurai gunslinger) runs in the open and stabs 4 cowboys with knives (despite having two pistols), and Mountain Man tackles a horse (despite having a pistol, rifle, tomahawk, knife etc). It is cool to watch but will have you at moments go WTF.<br><br>If you think about the story you will have a bad time. If you want realistic western action you will have a bad time. If you want a mediocre action movie that takes place in a western town, this could be worth a shot but only if you watch during a matinée. It doesn't hold a candle to the original (1960). But it does have better action than the 1998 one...but the story is worse. So it is basically on the same level as the made to TV movie.","user":"aj1218","rank":[160,223]},{"title":"Western caricature, a far cry from the original","rating":2,"date":"28 September 2016","review":"The movie is a remake of \"The Magnificent Seven\" by John Sturges (1960), which is itself a Western adaptation of Kurosawa's masterpiece, \"Seven Samourai\" (1954). Despite a few flaws, the 1960 version was balanced and entertaining: cast, dialogues and music, notably, have now become legend. In comparison the latest version delivers almost nothing. If anything, it proves that quality is not about plot (which is roughly similar for the two Westerns), but about style.<br><br>*** WARNING: CONTAINS SPOILERS ***<br><br>The three films have the same structure: 1. Context and recruitment of the seven mercenaries; 2. Village life and training of the villagers; 3. Showdowns with the villains and conclusion. On all these parts, the movie fails.<br><br>1. CONTEXT AND RECRUITMENT OF THE SEVEN MERCENARIES. The context is over the top. The villains are horrendous, overstaffed for such a small village and ready to kill at any rate. By the way, Bogue, if you can murder \"half a dozen\" villagers for no reason, why do you even bother offering them to buy their land? Just start shooting to make them go away.<br><br>The recruitment is so incredible it becomes funny: reasons for joining the band remain completely obscure, if not absurd. Sure, I'll join this suicide mission just because you have my horse (Faraday). Of course I'll join because it will get just one single bounty hunter off my back, out of the dozens chasing me (Vasquez). No, I won't join you, I am going away... well, after all why not, even though I don't know why I changed my mind (Horne). Hey, let's share deer liver for breakfast and I'll go along with you (Red Harvest).<br><br>2. VILLAGE LIFE AND TRAINING OF THE VILLAGERS. Village life, where? Villagers, who? We barely see any of this, we don't know how they live, what they think, how they feel. They are reduced to a simple background for the action. The character we understand most is Emma Cullen, which says something. In the previous movies, the villagers debated about options, asked advice to the wise elder, hid the women, betrayed the mercenaries. We saw them discussing, working, celebrating, building defences, training.<br><br>Here we only see a few minutes of the villagers' training. At first it is a disaster, but afterwards... but afterwards nothing, we don't see how they progress, technically and psychologically, to be able to confront the villains.<br><br>3. SHOWDOWNS WITH THE VILLAINS AND CONCLUSION. In the previous movies, there was a build-up of the action, with limited confrontations that eventually lead to the final climatic showdown. Here there is a first fight as the mercenaries enter the village, and then we wait, and wait... until the final showdown that lasts forever. Loads of explosions, of shooting, of deaths, more deaths. It is impossible to keep track of the body count, however it seems much more than the original villain bunch. In terms of strategy, Bogue, since you have such a terrific machine gun, why do you use it AFTER most of your men have been massacred, not BEFORE? We will never know. Also, why do you even bother coming to this fight, endangering your life? Surely not because Chisolm would have called you a coward, since you don't remember who he is anyhow.<br><br>The movie ends in utter ridicule, with Chisolm trying to make Bogue pray with him. And when the three remaining mercenaries leave, letting the villagers sort out the mess, the latter repeat \"thank you\" as a mantra, even though most of their men died and their village is completely ravaged. Was that better than moving away? On a moral and symbolic ground it could have been, but then it would have required the movie to have moral and symbolic insight, instead of just inflated action.<br><br>-----<br><br>This is where it doubly fails. First, it is a standard no-brainer action movie, while the two previous films (especially \"Seven Samourai\") were talking about values, honour, courage, purpose and dangers of fighting, characters, friendship, solidarity. Their ending was meaningful: villagers (life) win, mercenaries (death) lose. Dialogues were to the point; here, they are reduced and plain: just compare for instance the Quotes section of the three films on IMDb. There is only one scene when the main characters could have a real conversation: the dinner in the saloon. At that point we hope the movie will lift off the ground where it is stuck... unfortunately, dialogues remain dull. Earlier, it makes two weak attempts to add substance, to no avail: Bogue's opening speech on capitalism and the ethnic diversity of the mercenaries.<br><br>Second, it does not even succeed in being an efficient action movie: it is full of stereotypes, lengths, overblown scenes and inconsistencies. To some extent it tries to imitate Sergio Leone's style (or Clint Eastwood's inspired by Leone): outfits, close shots, macabre tone, incongruities. However it is a far cry from this Western master because it lacks essential elements: pacing, measure, second-degree humour and class. A typical example of superficial form without purpose. I am not a huge fan of Tarantino (another possible reference), but at least he would have provided rhythm and coolness to the same story.<br><br>The only quality that emerges is the solid acting. A special mention to Denzel Washington as usual, to Ethan Hawke as a past legend now drowning in despair and fear, to Haley Bennett as a sensitive yet strong woman. Actually everybody is performing so well that it makes the movie enjoyable at times.<br><br>If you haven't seen Sturges' and Kurosawa's films, you are lucky, you will appreciate them considerably after this one.","user":"Teyss","rank":[155,225]},{"title":"Lacks just about everything","rating":3,"date":"24 September 2016","review":"Yes, Denzel makes for one very cool bad-ass with his shiny Colt .45 strapped to his hip with the butt forward, but that's about it.<br><br>There is almost nothing in this picture that is a surprise or unpredictable. Dialog between actors is awkward and stilted (and sometimes completely unintelligible). Very little background on any of the characters is presented and offers no development what-so-ever. <br><br>Take \"Red Harvest\", the crack Indian archer outcast. We practically beg to know more about him, but all we get is his announcement, \"The elders have said I'm on a different path\", and boom, he's in the club. Please. The movie is over two hours long, and that's all we get? <br><br>There is a few laughs and a decent stunt here and there, but all that could have been accomplished in a much shorter run time and on a fraction of the ridiculous $95 million dollar budget.<br><br>More plot holes than you can count, and a final gun battle that is so technically improbable it will ruin what little suspension of dis-belief you had left. Example? The Gatling gun that fires hundreds of rounds on a single clip and magically zeros in on strategic targets... from a quarter mile away!<br><br>Also present is a fair amount of politically correct 'hate whitey' propaganda. When Red Harvest isn't pegging bad guys with his bow and arrows he frequently complains about 'white man's food', and all the white heroes are the only ones who get killed. <br><br>I wasn't amused.<br><br>This movie is a perfect example of why I rarely venture out to see a first run picture for the same amount of money I could have spent on a half tank of gasoline.<br><br>Maybe your kids will enjoy it, but you will not.<br><br>For real, don't bother","user":"rioplaydrum","rank":[398,627]}]