[{"title":"Surfer finds God","rating":3,"date":"11 July 2014","review":"The film is a drawn out tale of a young man seeking to find the perfect wave but in the end finds a different kind of wave. Scott's character appeared aloof, as he should have, but it left the viewer unconvinced and unable to connect. His mother only laughed, cried, or prayed, leaving one with the sense Ian was really running away from the \"perfect\" family. While the cinematography was reminiscent of Endless Summer, showing superb footage of New Zealand, Australia, Bali/Indonesia, South Africa and Mauritius, and the first song set the tone early on with the waves, and made sense, the overly-loud musical interludes distract the viewer away from the plot. The characters were clumsy and the timing of some of their lines appeared forced and wooden. Ian, spoke without an accent, yet the car pulling into the family's driveway with a foreign license plate gave away that they were not in America, yet it isn't revealed where he lived until after the second act. Some parts, such as when Ian got stung were over-dramatized and drawn out too long, or his mother getting a sense that something was wrong with her son, with no explanation as to why or how, or praying on end, while the important parts, such as the \"breakup,\" which were never seen, left the viewer guessing about Ian's friendship with Anabel, or how he is unaware of her relationship with the brother-in-law whom he was previously friends with. Unsure who the intended audience is, but this isn't a surf movie. While the main message is thought provoking, the movie leaves one asking a lot of questions, but ultimately leaves one with, \"Why did I watch this movie?\"","user":"ozziegreen2001","rank":[29,39]},{"title":"A laugh in all the wrong ways","rating":3,"date":"4 March 2014","review":"Being a surfer, I saw the poster and figured why not... I could settle for a mediocre storyline and even mediocre action so long as the riding was good.<br><br>Unfortunately I got bad acting, mediocre storyline and ultimately a free church service.<br><br>There were moments when the acting caused laughing in the audience, and truly took one away from the movie. And while the movie started out fairly decently, things got progressively worse. There were narrative areas which stated what could have been concluded in the end, about 40 minutes before the end, thus giving away half the mystery.<br><br>The last 20 minutes however was the point where I wanted to walk out of the theatre. The movie took a dramatic turn from a movie about a man's desire to catch the perfect wave, into a direct and unashamed attempt at converting viewers to religion. Since it was based on a true story, there are elements that are inescapable and to be expected, but had I known that I would spend 20 minutes being preached to about how everyone needs to find God - I definitely wouldn't have gone to see this.","user":"nb_sin","rank":[27,38]},{"title":"Perfect letdown","rating":1,"date":"16 August 2014","review":"I can't remember having ever seen such a bad acted film. Ever! Wooden acting throughout by all, really all, actresses/actors. Awful music choice. Too loud and too bad.<br><br>The no longer young man starts out to find his perfect wave. You don't know where from he actually starts out until they mention it way into the film. If I would have had that mother I would not have waited until I was 24 - I would have run away as soon as I could. Dear, she was either stupidly grinning or telling her story how she found Jesus, or crying or praying while crying and rolling on the floor. You sit there and watch and think what is that all about? I can understand a strong bond between mother and child, but that was so over-dramatic and inexplicable - it just left one wondering and hoping that they finish that scene soon.<br><br>Is that film just a way to sell religion? The end was seriously the worst choice in a film full with bad choices from the beginning. Why do you have to get the man who inspired the movie to get his 3 min of preaching time? And write the name of his church in the screen credits, should I go and donate money for a sequel? Join the club, because I converted? <br><br>Only watchable were the scenes with pure nature without any interruption by bad acting.<br><br>And who on earth casted the very untalented son of Clint Eastwood? That man should go and find a profession that does not involve talking to an audience.<br><br>This film proofs there is no god, she would never let us suffer that much.","user":"penny-prosperity","rank":[16,25]}]