[{"title":"Lazy and Poor Depiction of Single Motherhood","rating":1,"date":"21 October 2014","review":"Over the weekend I decided to finally watch Tyler Perry's The Single Moms Club. In the spirit of full disclosure, I didn't have high expectations. Very seldom do I see single motherhood being portrayed with any degree of honest accuracy. The usual standard is to depict single motherhood as a caricature at the extreme end of the spectrum. The spectrum, according to media, is at one end, a single, black mother on welfare, who is struggling to overcome all manner of obstacles just to survive. On the other end of the spectrum you'll find a rich, white woman, who has a high paying executive job, a nanny of Hispanic ethnicity, and, bless her sweet heart, she has everything but the respect of her bratty, entitled kids. Not surprisingly, Tyler Perry's depiction of single motherhood fed into both of those stereotypical depictions with relish.<br><br>The movie revolves around the lives of 5 single mothers. Incidentally, I give it a thumbs up on being very diplomatic in regards to diversity. Two black women, two white women and one Hispanic woman- I guess Asian women didn't make the cut. All of these women follow a very predictable and stereotypical path.<br><br>There's the obligatory, fat, sassy black character named Lytia. Lytia is working the hard shift at the Waffle House, while trying to keep her youngest son out of jail and on the right path. Her problems are solved when she meets a rich, tall, handsome man.<br><br>The other black woman, named May, is a middle-class writer, who is supposedly \"struggling\" to raise her son and publish her book. Conveniently, her problems are solved when she meets Jan. She also finds herself a tall, handsome, hardworking man.<br><br>Jan, is one of the two wealthy and affluent white characters. She is a publishing executive that puts her work ahead of her daughter. Her problems are solved when she puts all of her wealth into starting her own publishing company. It's easy when you're rich. She too, finds herself a man.<br><br>Then, there is Hilliary. Poor Hilliary is divorcing her high-powered attorney husband, and is supposedly struggling because her spousal support has been lowered, Now that she can no longer afford her live-in maid. Hilliary's big, single-mom-dilemma, is that she has to stay at home- not that she had a job outside the home, in the first place- and take care of her own children. (Gasp! The HORRORS!) She, of course, finds her obligatory tall, handsome and helpful man, located just next door. How convenient.<br><br>Last, but not least is Esperanza. Esperanza is silently suffering because her daughter's father has afforded her a certain lifestyle, so long as she's willing to follow his rules. It's a problem that's easily solved for Esperanza, because, as it turns out, they have laws enforcing child support for a reason. She too, has a tall, handsome, new man all lined up, to help her transition out of being a single mom.<br><br>The common theme among all of the characters was that each of them found a hard working and good looking man to save the day. Turns out, that no matter what your socioeconomic background, no matter the color of your skin, if you can just find a good man, then this whole single mom problem can go away, and everything can go back to normal.<br><br>With almost 50% of all babies being born into single parent homes, Tyler Perry had an opportunity to write a movie that really spoke to the experience of a group of women who are quickly becoming the norm in America. That sort of approach might have lent some validity and depth to what instead turned out to be a superficial ploy to gain the viewer-ship of single mothers.<br><br>So, there you go, ladies. Tyler Perry just solved the plight of single mommies everywhere. All you need to do, is go find yourself a man. But not just any man. Oh, no. You need a nice, hard-working and extremely good looking man. Now why didn't we all think of that?","user":"adeleamra","rank":[9,10]},{"title":"Not a good story development","rating":3,"date":"29 March 2014","review":"The story follows five single moms, each one with her own problems, got together and decide to form a support group for themselves after they meet at their teenage children's school. The single moms are Jan who is a successful career woman with a teenage girl whom she rarely spend time with; May, a fledgling writer with a teenage boy, and her ex-husband disappoints their son over and over again; Hillary who is a mother of three, with her oldest daughter is on the time of turning into a physically mature woman; and Lytia is a waiter with a guy crazy about her yet she keeps rejecting; while Esperanza has a boyfriend whom she keeps secretly in fear that her ex-husband will cut her off child support.<br><br>The basic story somewhat relates to many women, whether in the US or other English-speaking countries. No wonder this movie can manage to get to Box Office. The cast selection shows that this movie wasn't designed for greatness from the very start. The acting is achieved overall is thus a so-so. That thing made character development limited only to what the story and screenplay provides, that even those are insufficient. One more thing that boggles me is that the story is not given a chance to develop completely. It is as if the movie is forced to meet a target of being about 90 minute in length. The ending is even so abrupt because the final conflict is plainly strange.<br><br>For a movie that falls into Comedy genre on IMDb, the jokes are mostly corny or just plain not funny at all. There is the drama element, alright. But even the drama isn't developed well. And when there is a scene of heightened emotional moment, the acting spikes drastically from so-so up to overacting. One thing though, I was surprised to see Terry Crews here, and it is a comedy in itself.<br><br>I guess I don't really have a say on the other aspects such as costumes, makeup or music scoring and soundtrack. Not because they are bad, I think they are just okay. It's just that the overall quality of the movie is just relatively bad. So I guess this is the second time, back to back, Tyler Perry has made a movie that is not of a relatively good quality, after last year's \"A Madea Christmas\".<br><br>For me, it's a 3 out of 10 scoring movie. No, I don't recommend you to see it. Well, if only the story is developed better, maybe that'll help.","user":"Seraphion","rank":[11,13]},{"title":"So-called film about women, made by a man","rating":4,"date":"4 April 2015","review":"This - according to the blurb, is a film about women coming together, formed by a bond of all being single mums. Unfortunately, it being a male writer and director, strong independent women aren't allowed to stay single for long, it seems, and all they really need to be happy and content is for a man to come into their lives EVERY SINGLE ONE of the five lead characters found the happiness they were missing in their lives when a new man comes along - i.e. being a single mom was an unempowering situation, and now they have a testosterone-fuelled bloke to look after them, everything is rosy. Really?!! Is this really what men think about female solidarity? That they're only doing it in lieu of having a man in their life? Really? I hoped we'd moved on from that a long time ago.","user":"melodyfears","rank":[5,5]}]