[{"title":"A work of art!","rating":10,"date":"9 September 2018","review":"I accept that I am not among the sophisticati who live and breathe movies and contribute frequently to IMDB. But as a U.S. diplomat I served at the U.S. Embassy in communist Budapest Hungary in the Cold War 1970's. Much that was depicted in this movie ran true back then -- dilapitated decaying wall-peeling apartnents and buildings versus relatively elegant government buildings, bugging of even private apartments, etc. etc. Much was the same in Moscow too. I write rarely on IMDB and only when some movie especially intrigues me. This one did. No grotesque slasher torture-, gun- or hyper-violence here, no f-words. Rather, intelligent dialogues, gorgeous repeat gorgeous cinenatography, delicate music and I venture director's and financial backers' love for this movie's concept make this movie a true work of ART. I am glad it came to be nade.","user":"dtlongo","rank":[26,31]},{"title":"Despite the Falling Snow","rating":10,"date":"24 February 2017","review":"Despite the Falling Snow is a romantic drama with elements of an espionage thriller which intersects events from post-Stalinist Russia with the United States in the 1990s.<br><br>Rebecca Ferguson has created an unforgettable image of a young Russian woman trapped between two men. Enchanting faces and majestic landscapes with falling snow and an expressive score – all of this creates a passionate and mysterious atmosphere. The film is full of tension, drama and emotion.<br><br>Some critics objected to the supposedly unrealistic costumes and details of the lifestyle of Russians. However, I can not agree with that. The style of life of Russian people has always been dependent on the social status of people, even at that time and the elite which was depicted in the film certainly were not ordinary folk. To the director's credit, she has avoided the thoroughly traded road of vulgarization of the Russian people on the silver screen.<br><br>The actors have created characters which are true to life and difficult to forget. There are no doubts that the film will become one of the classics of its genre.<br><br>Sarif has definitively made a great casting, the role of older Misha was played by Anthony Head who brilliantly accomplished the difficult task of creating highly emotionally charged scenes at the end of the movie.<br><br>Read more at: http://indie-cinema.com/2016/08/despite-the-falling-snow/","user":"indiecinemamagazine","rank":[30,39]},{"title":"An unexpected surprise","rating":29,"date":"29 May 2016","review":"This film tells the story of three soviet spies, who smuggle secrets out to the Americans. They have a complicated love triangle, which is further complicated by one of them defecting to America.<br><br>It tells a story that spans two generations and two countries, involving love, idealism, regret, healing and many life and death decisions. The story is not strictly chronological, as it reveals bits of the story when appropriate, creating suspense and making me look forward to see how the plot will unfold. It is a story that tells how tragic societal circumstances tear lives apart, and its effects ripple across time and space. I certainly did not expect \"Despite the Falling Snow\" to be so gripping and so touching.","user":"Gordon-11","rank":[28,41]}]