[{"title":"Kids Will Love It! Adults Wont.","rating":4,"date":"10 April 2015","review":"The staple of some of the finest animations of recent years has been their capability to excite both the young and the old, the children and the parents. Films such as 'Up', 'Toy Story' and 'How To Train Your Dragon' have all achieved this feat, and to great box office and critical success. A Mouse Tale on the other hand, chooses to aim directly for the children's demographic, which of course isn't inherently a bad thing. <br><br>The story follows mice named Sebastian and Samantha, voiced by ex- Nickelodeon co-stars Drake Bell and Miranda Cosgrove, who attempt to find a magical crystal in order to save their kind from a rampage of rodents. Both the casting and vocal performances from these former siblings on Drake and Josh are nothing to write home about, but they do manage to energise what is an entirely predictable yet sufficient narrative through their exaggerated intonations and shrieking. <br><br>What's testing is that the vast remainder of the characters in A Mouse Tale are instantly forgettable, even characters who seem to be in grave danger just aren't that appealing and their fate appears merely trivial. The animation style is very forgettable, with obvious constraints to a tight budget resulting in a style which is uninspired but efficient nonetheless. Whilst the charm and nostalgia some of the voice actors does offer a slight motive to watch the film, the film is on the whole utterly irreconcilable with anyone over the age of six.","user":"JoshuaHarryMurphy","rank":[7,11]},{"title":"*sigh* It's from Venezuela. What do you expect?","rating":4,"date":"16 February 2017","review":"Look, if you even know this movie exists, chances are you're either a die-hard animation buff, a furry, or nursing delusions of doing a bad movie review channel like the Nostalgia Critic.<br><br>If you're #1 or #2, this is. . . Passable. And if you want a really bad movie to write a scathing review of, you'll be disappointed to learn that this movie's badness is predominantly of the bland and uninspired variety.<br><br>I will give the movie two compliments: It was ambitious in its scope, and it has a great foundation for a movie, combining the typical \"chosen one\" trope with the \"little big world\" theme commonplace in movies and shows with mouse protagonists. Perhaps the ambition was to produce something like \"Epic\", only with mice instead of. . . Whatever those leaf-people were.<br><br>The movie's ambitions, however, are undermined by a very clear lack of capacity; it WANTS to be big and epic, but in doing so, it stretches its already shoestring budget, leaving us with PS2-era graphics, uncanny character movement, and lip movement that is only just barely good enough to not be hilariously terrible.<br><br>As for its foundation, while it can be mildly amusing to hear the generic sage character refer to something grand and whimsical only for it to turn out to be something commonplace, it does very little to excuse the movie's generic characters, generic plot, generic humor, etc., etc.<br><br>Chances are that, if you saw the trailer, you did not need to read this review. Of course, as noted above, chances are also that you would not know this movie even existed were it not somehow in your proverbial wheelhouse. So if you were curious to its existence because you belong to an overlapping fan base, and if you see it for cheap in a thrift store (as I did) or online, or stumble across it on one of the movie channels. . . Well, yeah, this movie will probably be tolerable. Not really worth the money, but if you're snowed in and want to spend an hour doing something other than browsing around IMDb looking for hilariously brutal reviews of horrible movies, it might be worth your time.","user":"Terastas","rank":[1,1]},{"title":"A rather charmless Mouse Tale","rating":3,"date":"11 August 2015","review":"There were some talented names in the voice cast, so that was the main selling point. However, instead of the cute, exciting and funny animated film that it could have been, A Mouse's Tale just ended up bland and charmless.<br><br>Albeit with a few things that prevent it from being any worse. The Land of Giants scene is cute and imaginative, the one time where the film is any one of those things, the scene is too short but compared to the rest of the film it's a breath of fresh air while not quite being enough to make up for it. There are some nice colours in the animation and the voice cast try their best with what they have and mostly do a decent job, the big names like Tom Arnold, Cary Elwes and Jon Lovitz have had much better material but they hardly embarrass themselves either.<br><br>On the other hand, the animation on the whole is lacking, the backgrounds are nothing dreadful but not much memorable sticks out and some could have had more detail, textures are bland and rushed-looking and very cheap plastic toys look more professional than the character designs here. The lip-synching also is very sloppy, and while the soundtrack is not bad on its own it generally needed more drive, maybe more variety and doesn't fit within the film as much as it could have done, sometimes sounding too upbeat in more suspenseful-meaning scenes.<br><br>The script is a meandering mess and never seems to find the right tone. The humour is overplayed and juvenile (don't ever remember cracking a smile once, let alone a laugh), there never seems to be a sense of threat and when it does try to be darker it feels abrupt and tonally weird and the emotion felt forced. The story struggles to sustain the length or momentum, so it feels dull and too stretched, and it is not helped by that it doesn't bring anything fresh, almost everything in A Mouse's Tale has been done before and better. It has one good scene, which showed glimpses of the qualities that the film should have had throughout, but it was too short.<br><br>A Mouse's Tale is also a film that is devoid of a single interesting, let alone likable, character. All the characters are done to death stereotypes with little personality and next to non-existent development, Sebastian and the villain being especially one-dimensional. Sebastian and Samantha also suffer from that they feel too much like secondary characters when they ought to be the ones that we should care for the most, instead we barely remember them. Wasn't expecting an awful lot in the first place from Drake Bell and Miranda Cosgrove, and they didn't disappoint. Very wooden with lots of shrieking, Bell is particularly annoying.<br><br>In summary, while it is unwatchable and has moments A Mouse's Tale is a charmless affair. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[1,1]}]