[{"title":"A funny and underrated short","rating":9,"date":"1 July 2013","review":"I liked a lot this animated short. I simply don't understand why it was rated so low here on IMDb. I mean, even when the plot isn't anything \"complex\" or \"meaningful\", it was very funny and enjoyable to watch.<br><br>\"Goodnight Mr. Foot\" reminded me the animated series that Cartoon Network from the nineties. Considering that this short was directed by Genndy Tartakovsky (The creator of \"Dexter's Laboratory\") this is definitely not a coincidence.<br><br>If there ever was an animated series inspired by \"Hotel Transylvania\" I think that it would awesome making it with the same visual style from this short instead of bland CGI, like the boring animated series inspired by Dreamwork movies.","user":"Rectangular_businessman","rank":[8,10]},{"title":"old style primitive animation","rating":5,"date":"22 January 2017","review":"This is a short connected to the animated franchise Hotel Transylvania. Bigfoot walks from North America to Dracula's hotel resort. He is dead tired and falls asleep as soon as he get in his room. The Witch Maid is eager to clean. While trying to kill a spider, she wakes the sleeping giant.<br><br>This is an old fashion primitive-looking style. I like the style and don't mind the change from the movie. It's actually quite charming. There isn't much to the story. It's a short time but I would like it to be something more compelling. Other than the style, there isn't much to this.","user":"SnoopyStyle","rank":[1,2]},{"title":"No real need for this to be made","rating":4,"date":"16 February 2019","review":"\"Goodnight Mr. Foot\" is an American 4-minute animated short film by Sony Pictures Animation. The director is Genndy Tartakovsky and maybe this is already enough information for you to realize that here we have a little spin-off from the successful Hotel Transylvania series. But yeah, it has nothing to do with the now three films already honestly other than the location and that at the center of it we have normally creepy characters that are more about the fun though. Even Bigfoot, after roaring aggressively, goes back quickly to relaxed and sleepy and smiling. Youj could say he is the star of the first 90 seconds, then a cleaner takes over working at the hotel and trying his best that Bigfoot won't be disturbed. Oh well, until she ends in the creature's face with her broomstick. Thatg one's really for cleaning here. The actual HT characters don't make any appearance which is always a bad sign because you didn't even need to cast the actors, well maybe the voice actors and there are other HT short films where they do indeed appear. Also I must say the animation style has nothing really to do with HT and I gree with another reviewer that it looks cheap and hurts the film. Doesn't speak for the Annies at all that they nominated this one honestly. It lacks in terms of comedy (the key out of mouth moment was mildly funny, but that's not enough, everything afterwards was rather lame) and in terms of story-telling and drama even it is even more disappointing. My suggestion is to skip the watch here. Even if you like the HT films just like I do, then you will be disappointed.","user":"Horst_In_Translation","rank":[0,1]}]