[{"title":"What Indie films should be about","rating":17,"date":"17 October 2014","review":"Independent films aren't what they used to be. They rarely get much play. These smallish, low budget niche films famously launched newcomers and gave opportunity for more experienced performers to take risks, doing something new. At the same time the venue often times created films far more interesting than what the studios were financing. With the occasional exception, those days are all but gone. <br><br>Catch Hell is one of those exceptions. Written, produced, directed, starring, and promoted by Ryan Phillippe along with his partners, this is the little film that could. It rests on the shoulders of mostly unknown performers who give it their all and show the depth of talent that's available should the big film makers only take notice. Catch Hell is part horror, a little bit thriller, and most parts character study. It tells the story of a man who shares Ryan's initials and POV, an actor who is kidnapped while on rather remote location for a film he's been forced to sign onto because of a fading career. Mike, the older of the two kidnappers, believes the actor had an affair with his wife and has enlisted his passive yet young and strong nephew to help kidnap and torture Reagan Pierce.<br><br>Reagan is taken to a shack in the swamps of Louisiana, violently beaten, chained and held captive. Not just satisfied with maiming him, his captors use his phone and laptop to start posting homophobic rants in his name. He suffers several more beatings and is starved. The future seems grim and hopeless for Reagan. <br><br>While held captive Reagan spends most of his time with the nephew, Junior, played by Stephen Louis Grush. Junior is not very intelligent and seems to be more of an instinctive creature of the swamp than of modern civilization, but if you think that makes him a one note mental defect, you'd be wrong. One of the most intriguing parts of this film is how fascinatingly and, yes, even sympathetically, Junior is portrayed. Without relying on shallow sentiment or corny back story, but by virtue of performance and dialog alone, Junior quickly becomes the heart of this film, a strange little half man who the world has never known and will quickly abandon.<br><br>Ryan Phillippe has described this film as a simple short story. I can't disagree with that. Ultimately, Reagan Pierce survives his capture and the two kidnappers suffer primitive justice handed out by their desperate prisoner in order to escape. The story is pretty straightforward. But that doesn't mean it is shallow. It's a fascinating character study of the kidnappers and of Reagan Pierce. There are some beautifully done moments in the film: Junior's knowledge and kinship with the swamp, his preparation of gator stew, and Pierce and Mike, the older bearded kidnapper, having a drawn out conversation about Mike's wife. You can feel the testosterone fumes in air as these two men face off as Reagan in his outrage seems to have no regard for his helpless state. And, there is Junior's shy infatuation with his prisoner and the way Reagan starts to flirt with Junior as a way to lower Junior's defenses. It's a slow swamp dance that Junior thinks is in his control, but proves to be his undoing.<br><br>Ryan Phillippe layers his own character with a sense of what it is to be an actor in today's social media mad world. It's interesting to see how even Junior understands such things as the Internet and sites such as TMZ. Hmmm, could Ryan be giving us a statement on the mental acuity of the people who post such vile comments on various sites? <br><br>Tig Nataro, the comedienne, has a small part in this film as Mike's sister. She is so good that I wish her part had been larger. For all of the above reasons, this film shows that it is the hands of a new, but gifted filmmaker. <br><br>I can't close without remarking about two things. One is the beautiful way that the Louisiana swamp is filmed. The cinematography is overall beautifully done. And lastly, the closing credit sequence. Such a surprising choice. Funny as hell. A little tip of the hat from Ryan Phillippe to thank us for giving his film our time.","user":"aGuiltySoul","rank":[25,31]},{"title":"Impressed","rating":8,"date":"19 January 2015","review":"I wasn't too sure what to make of this when I first read up on it however, after watching it I was really surprised. <br><br>The story line was really good, so was the acting. Maybe my expectations of the film were quite low as I hadn't heard much talk about it. So when I actually watched it, it exceeded the low expectations I had.<br><br>This movie keeps you gripped all the way through and has some twists and turns you weren't expecting which is great in any movie!<br><br>I'm no movie critic but in my opinion, this film is well worth a watch. Not the best kidnap film ever made, equally, it's still a good film with a strong story line and one I would recommend.","user":"seanface","rank":[20,26]},{"title":"Swamp Thing","rating":3,"date":"25 October 2014","review":"Greetings again from the darkness. Ryan Phillippe has hit the big Four-O, so it makes sense that he would want to explore the other side of the camera with writing, directing, and producing. He's had a pretty successful acting career given what could be termed a minimal lack of range and a quiet screen presence. His feature film directorial debut utilizes a script he co-wrote with Joe Gossett, capitalizing on Phillippe's lot in Hollywood right now ... the once promising star looking to recapture the magic with a \"game-changer\".<br><br>The film opens with a dramatic shot of actor Reagan Pearce's (RP ... get it?) stunning mansion. We see him catch a flight to Shreveport, Louisiana and take a meeting with a slightly spastic director and blow-hard producer. He decides to stick with the project in an effort to re-establish his career ... he's just out of rehab (of course). The next morning, things go really badly as Reagan is kidnapped by a couple of Louisiana hillbillies and locked up in a swamp cabin.<br><br>Brutal torture scenes follow and we soon enough learn that one of his captors (Ian Barford) is seeking revenge for Reagan's dalliance with his wife on the set of a movie. The plan is to destroy his reputation and then kill him once he is hated by all. The script attempts some Hollywood satire and makes some obvious commentary on the whole tabloid and celebrity world, but mostly it comes off as a bit self-indulgent for Mr. Phillippe.<br><br>There are some flashes of interesting moments, mostly involving Stephen Grush as the second hillbilly with homosexual overtures towards Reagan. Unfortunately, the film does not take advantage of the colorful swamp setting and instead takes place almost entirely within the run down cabin. You will note dashes of Deliverance, Black Snake Moan, and Misery, but this one isn't at that level. Instead it comes off like a bucket list item for Phillippe ... director/writer/producer/star of his own film.","user":"ferguson-6","rank":[27,39]}]