[{"title":"I was surprised I liked this film so much.","rating":9,"date":"8 January 2015","review":"While I grew up enjoying Johnny Carson, he wasn't somebody I felt driven to know more about. But this almost 2 hour documentary does a terrific job of dovetailing both the public and private sides of the man to give a portrait of a tremendous talent who could handle anything on his show with amazing spontaneous grace and humor, but had a much harder time dealing with people, love and family out in the real world. A complete extrovert on-stage, he was a true introvert away from the lights, struggling with drinking, anger and extra-martial affairs. Yet while the film doesn't flinch in looking at his sad and dark sides, it does so with compassion and never feels like a hit job. It balances these darker, sometimes very moving sections with great clips from \"The Tonight Show\" that remind one just how damn funny the guy could be, in spite of his troubled personal life. <br><br>For a film I wasn't sure I even wanted to see, it did an excellent job of hooking me in and riveting me in telling the story of a great entertainer who was far more complicated than I imagined.","user":"runamokprods","rank":[7,7]},{"title":"Maybe it's just me, but this episode made me feel rather sad.","rating":9,"date":"20 May 2012","review":"This episode of \"American Masters\" was well made--I have no complaints about this in any way. In fact, it was EXCEPTIONALLY well made and because of this it depressed me. This is because with a 'warts and all' biography, you get more than just effusive praise--you get the good AND the bad. So, while you learn about all of Johnny Carson's many on-screen successes and accolades, you also hear about what an absolutely screwed up guy he was as well. Because of this, instead of focusing on his triumphs (and this made up most of the show), I kept getting bogged down with his failings. He had a difficult mother--one who had a very hard time praising Johnny or connecting with him. In turn, he had a horrible time connecting with his own children--and seemed to be very distant. He also struggled with alcoholism (or at least a serious drinking problem) and his very public divorces. And, while there was lots of praise for him as a performer, it was sad that no one interviewed for the show ever felt close to him. It's an odd contradiction--with such a public figure having such an incredibly private life--and often, he was alone.<br><br>If you want to feel happy, don't watch this. However, if you hate biographies that gloss over problems and only paint a rosy picture (a very common problem), then this is for you. You learn a lot about the man and I can really respect the job the \"American Masters\" folks did with this one. Very good and the definitive biography on the man.","user":"MartinHafer","rank":[16,22]},{"title":"King of Late Night Forever","rating":10,"date":"22 May 2012","review":"This show nails the essential complex host/man/loner Johnny Carson was.<br><br>It has all the major talkers Carson competed with, plus a lot of his classic clips and stories about a major television figure who tried to keep his private life private.<br><br>What is interesting to me is that the special mentions the love affairs that Carson had that broke up his marriages. Other than scandal sheet articles, I have seen very little tell all books from women Carson had affairs with. I guess not all women kiss and tell.<br><br>The special does bring up Angie Dickinson's claim that she wanted romance with Carson but things never worked out. There was always a lot of sexual innuendo used on Carson's Tonight show. This Carson special is available through a link on You Tube for anyone interested.<br><br>It covers the Joan Rivers Feud, and many other topics. Most interesting thing - very little reference to Mclean Stevenson who was the guy who guest hosted Tonight the most while Carson was there.<br><br>The Carson family issues which were never seen when Carson was on and alive are brought to the surface here in a very direct way. This show is \"spot on.\"<br><br>http://www.pbs.org/wnet/americanmasters/episodes","user":"DKosty123","rank":[4,4]}]