[{"title":"Good movie, definitely different, definitely not what I expected","rating":7,"date":"8 September 2013","review":"I just saw the gala premier at TIFF and overall, I enjoyed the film. The acting was terrific, with Jude Law playing Dom Hemingway in the lead. The first few minutes of the movie had me wondering what I had gotten myself into, as it really starts off with a bang (or a blow, perhaps). That feeling of not quite knowing what I was watching stayed with me for a bit, as the movie is vulgar, violent, funny, and awkward, sometimes all at once. In the end, I liked I really liked it and found myself rooting for Dom despite having a bunch of reasons not to. It's worth watching for the terrific acting, and the moments between Dom and Dickie when things get tense are great.","user":"Beju-lakhani","rank":[54,70]},{"title":"Terrific performance from Jude Law","rating":8,"date":"11 September 2013","review":"A disorienting and ultimately disarming movie about a brutal Cockney ex-con with Jude Law playing a part Bob Hoskins would have played 25 years ago. With slicked back, receding hair and mutton chops, Law acquits himself very convincingly as a profane, poetic thug. Just saw this film at the Toronto International Film Festival and it's very entertaining, edgy and often gripping, with a satisfyingly soft heart, given all the criminality portrayed. Props to Richard E. Grant as his wiser sidekick and the rest of a wholly believable cast, most of whom I don't recognize. Dom is a character akin to the crazed gangster played by Ben Kingsley in Sexy Beast and you can see why Law would relish this part. And he attacks it with relish, bravado and just enough vulnerability to actually make this brute likable. You end up rooting for him due not only to story circumstances, but his basic humanity despite his despicable behaviour. I don't know if real Cockney gangsters would buy Law in the part, but I did. Worth seeing.","user":"sugith-1","rank":[79,106]},{"title":"Jude Law gives the performance of his career as \"Dom Hemingway\".","rating":5,"date":"3 April 2014","review":"Admittedly there's not much to this film outside of Jude Law's force of nature performance, he's a filthy, foul mouthed monolith of vulgarity and nastiness, and a joy to watch, it's a true revelation of a turn for the actor, breaking his posh, pretty boy image to pieces and gobbing on those pieces. Sure there's not much to the script or story, which are threadbare and under nourishing, plus Richard E Grant is somewhat wasted despite being rather wonderful, and there are many coincidental contrivances that sully the film a bit towards the end, but enjoy it for Law, for the stylish, off kilter approach to the British gangster movie genre, for the many gloriously profane monologues and the general fun depravity of the thing, plus it gets extra points for being surprisingly moving come the third act, which does not seem remotely likely given the first two thirds. A solid cult movie in the making.","user":"TheMovieVlog","rank":[36,48]}]