[{"title":"You got any tools in this place?","rating":2,"date":"7 March 2019","review":"I got this film because it stars Clint Howard. Howard doesn't show up until 12 minutes from the end and as a hologram. He doesn't even bring ice cream.<br><br>The film centers on a church being sold, not being sold, being sold in Philadelphia. The principals got together in the church and are trapped by the Romanian spirit that lives and protects every church from being torn down and turned into a strip mall. The acting was as bad as the script and dialogue. It appears Dom Frank writer/director/producer Dom Frank attempted to merge African-American spiritualism and Romanian myth. It didn't work.<br><br>Guide: No F-words, sex or nudity.","user":"nogodnomasters","rank":[6,8]},{"title":"Not really worth the effort...","rating":3,"date":"20 July 2019","review":"Okay, well it is no secret that I was more than thrilled to get to watch the 2018 movie \"The Church\" from director and writer Dom Frank given the fact that this is a horror movie and it has the iconic horror legend Bill Moseley in it.<br><br>Well, you might want to hold your horses there for a minute. This movie was bad. Let's not beat around the bush. It was horrible. Whereas the 1989 movie with the same title, \"The Church\", from director Michele Soavi seemed like a grand masterpiece in comparison. Sure, the 2019 movie wasn't a remake of the 1989 movie.<br><br>The storyline in this 2019 movie \"The Church\" is simplistic. A pastor stands at the threshold of cashing in to a company and selling his church in favor of a large cash reward, which could buy him a new church, a new house, a new car and send him on a dream vacation. However, when confronted with the greed and arrogance of his folly, the spirit of Alexander James (played by none other than Clint Howard) comes forth to set things right.<br><br>On paper, the storyline might have seemed good. But in translation to the screen, it just all went south pretty fast. And not even Bill Moseley could manage to salvage this train wreck of a movie.<br><br>The special effects team really got around their job and task so easily, because the special effects in \"The Church\" were atrocious when taking into consideration that the movie was made in 2018.<br><br>As for the characters as the acting, nah. Let's not venture there. The only thing worthwhile mentioning here is Bill Moseley.<br><br>All in all, \"The Church\" was a massive disappointment. Yet I managed to endure through the movie in its entire length, hoping that the movie would eventually take a turn for the better. Sadly, that never happened. \"The Church\" lands a meager three out of ten stars rating from me.","user":"paul_haakonsen","rank":[6,9]},{"title":"Bad","rating":1,"date":"23 November 2019","review":"One of the worst movie I have ever seen. Please don't waste your time.","user":"hjelmbjerg","rank":[2,2]}]