[{"title":"The sequel was slightly (but not significantly) better than the original.","rating":5,"date":"23 April 2014","review":"The sequel takes up immediately after the point where the first film ended.<br><br>Pike got free and continues to look for Chad at the behest of Phillip Turk. Turk is emerging as a world leader. Cooper has been imprisoned by Pike, and Cooper unexpectedly gives his captors a strong clue (Chad's brother's last location) to Chad's current whereabouts.<br><br>Pike's forces close in on Chad as he prepares to depart his brother's last home. Chad finds a way to locate Dr Siriwat, who was a leader in the chip program. He tries for a meeting, but is intercepted by Pike's men.<br><br>Do they find Dao's sister alive? Does Chad survive having the chip inside him? Will Turk get control of Chad? Can anyone undermine Pike's pursuit? <br><br>-----Scores-----<br><br>Cinematography: 6/10 The camera work was better than in the first film. There were fewer minutes of shaky camera, for instance. The flashbacks were unpleasant to look at from the choice of filtering techniques.<br><br>Sound: 6/10 The voices of many of the actors seemed hollow. The incidental music was a bit florid for my taste.<br><br>Acting: 3/10 Wretched. The male leads, Sheffer, Gary Daniels, Ivan Kamaras, were all terrible. Eric Roberts was better, but only in a small part. Sonia Couling and Johann Helf were also somewhat better. Most of the actors in the bit parts were quite bad.<br><br>Screenplay: 2/10 The dialog was repeatedly awkward where Christian messages were forcibly injected. As a tool to convince people of a point of view, I think this movie was a failure. As with the first film, there was not much story stretched over 94 minutes. Some of the chase scenes looked like very poor imitations of the fourth Bourne film. The ending more than hinted at a sequel.<br><br>SFX: 5/10 Neither convincing nor horribly bad; just so-so.","user":"suite92","rank":[4,7]},{"title":"An Okay Sequel","rating":5,"date":"13 July 2014","review":"This movie begins where its predecessor \"The Mark\" left off with \"Chad Turner\" (Craig Sheffer) and the stewardess \"Dao\" (Sonia Couling) having escaped by parachute from the airplane they were on and landing near the outskirts of Bangkok. The rapture (i.e. the disappearance of true Christians from the Earth) had just taken place and all sorts of chaos and destruction has followed in its wake. This gives one certain person (known in Biblical terms as the anti-Christ) by the name of \"Phillyp Turk\" (Ivan Kamaras) the opportunity he needs to establish his power over the world. To help him accomplish this task he needs \"the mark\" that has been implanted into Chad's arm while he was unconscious. The firm that made the implant (\"Avanti\") also wants to recover their merchandise but unfortunately for them their CEO \"Dan Cooper\" (Eric Roberts) has been captured by the anti-Christ's henchmen and is in the process of being tortured for any information involving Chad or the microchip. In any case, Chad is a wanted man who realizes that the anti-Christ will stop at nothing to get him. Now, as far as this movie is concerned I thought it was an okay sequel by and large. Although there were a few rather slow scenes here and there I liked the performance of Sonia Couling and the use of Bangkok for the location of this movie. In short, it's not a great film by any means but it's a decent sequel all the same.","user":"Uriah43","rank":[3,5]}]