[{"title":"Unless a key to a time-traveling device made up of a deity's enormous penis or Donnie Yen's peeing like a water cannon is entertainment, this 'Iceman' will freeze you over","rating":4,"date":"17 April 2014","review":"Let us begin by setting the record straight. We are big Donnie Yen fans. Even before he became a household name with 'Ip Man', we admired the kung fu star for his uniquely thrilling moves in 'SPL'. Still, even his most loyal fans will probably be wondering just why he has appeared in one bad movie after another in recent times. Indeed, his last good one was Peter Chan's 'Wu Xia' back in 2012; since then, 'Together', 'Special ID' and 'The Monkey King' have not only been bad movies, at least the first two have approached the point of being unwatchable, which is something we'd thought we'd never say about a Donnie Yen film.<br><br>'Iceman' could very well have been that turning point in Yen's string of duds. Its source material was Clarence Fok's 1989 martial arts fantasy 'The Iceman Cometh', an entertaining blend of action, comedy, romance and period drama starring Yuen Biao, Maggie Cheung and Yuen Wah. Its budget is an eye-popping HK$200 million dollars. And even before its release, there has been much hype about a climactic sequence set on Hong Kong's iconic Tsing Ma Bridge which cost an additional HK$50 million dollars to film because the authorities wouldn't give the filmmakers permission to do so on location. In essence, this Captain America of the East was supposed to be big-budget action blockbuster spectacle, weighty enough to warrant a two-parter release not unlike 'Red Cliff'.<br><br>Yet after all that hype, 'Iceman' is worse than 'The Monkey King' and almost as bad as 'Special ID'. Much of that has to do with the tonally incoherent plot by Lam Fung which manages to be overplotted and dramatically undernourished at the same time. Working upon the original's concept of a Ming Dynasty warrior who awakens 400 years later to find himself in modern-day Hong Kong and continue a feud that began as far back, Lam throws in multiple subplots criss-crossing present and past. There is Yen's search for a time-travelling Golden Wheel of Time that is operated by a key called the Linga. There is a corrupt Police Commissioner (Simon Yam) bent on recovering Yen and his fellow frozen guards to apparently sell them to the North Koreans. And last but not least, there is Yen's budding romance with a nightclub hostess (Eva Huang), who is caring for her sickly mother in an expensive old folks' home.<br><br>The combination of so many disparate parts makes for an extremely disjointed whole, and it doesn't help that director Law Wing Cheong seems entirely overwhelmed at maintaining some semblance of coherence. His storytelling lurches backwards and forwards across time with little narrative flow or momentum - and what makes it worse is just how tonally jarring the shifts are, from comedy to romance to period fantasy and then to surprisingly graphic action. Law also seems to have gone way out of his league from the Johnnie To-like rom-coms ('2 Become 1' and 'Hooked on You') and crime dramas ('Punished') to large-scale blockbuster territory - notwithstanding his little-seen 'The Wrath of Vajra' last year - and simply lost his footing even on the very basic level of staging a compelling enough sequence.<br><br>The same could be said of lead star and action director Donnie Yen. Even when everything else was a letdown, the very marquee name of Yen promised that at least the action would not disappoint; alas not even in that regard does 'Iceman' count for anything. Save for the much touted finale on the Tsing Ma bridge, the rest of the action sequences here seem almost like an afterthought, too reliant on the kind of unrealistic wirework that B-grade properties oft relied on. And when we finally end up on the bridge, Yen becomes too obsessed with making this a 3D movie by hurling all sorts of weaponry towards his audience that it just becomes too gimmicky to take seriously. It is scant compensation for the seemingly interminable one half hour wait, and ultimately disappointing because neither Wang Baoqiang nor Kang Yu as his nemeses are anywhere near close to being Yen's worthy on screen opponents.<br><br>There are occasional pleasures though, and these often occur at times when the movie simply refuses to take itself seriously. We're not denying that these slapstick moments will be utterly cringe-worthy to many, but hey we take what we can get. For instance, we laughed when Yen first bursts out of his cryogenic tomb and then releases his urine like a water cannon. Ditto for his favourite catchphrase literally translated as 'your mother's breasts' in Chinese. Or how about when Wang and Yu start learning words like 'chicken curry spaghetti' from a gang of Indian grifters after saving them from the cops? There are also other fish-out-of-water comedic moments that border or belong in cheese, but that's the only kind of entertainment you're going to get out of 'Iceman'.<br><br>If you're going to try to enjoy 'Iceman' therefore, it's important to set your expectations just right. Don't go in expecting the kind of popcorn blockbuster that 'Captain America' ever was, for Chinese cinema has yet to produce a modern-day superhero movie that didn't suck (think Benny Chan's 'City Under Siege'). Don't go in expecting the kind of good old-fashioned martial arts action Donnie Yen presented in 'Ip Man' or the kind of gritty MMA fighting in 'SPL' or 'Special ID', for there is nothing but a gimmicky 3D sequence right at the end that matters at all. And don't go in expecting this to be any better than Yen's recent batch of movies, for this is just one more in a bad streak that we hope will be frozen forever in time.","user":"moviexclusive","rank":[34,50]},{"title":"Why?","rating":2,"date":"22 June 2014","review":"Why is Donnie Yen doing something so idiot? Apart for some decent fight scenes, the plot is stupid, the acting is superficial, the comedy side is really low level, and the end, is it a joke? I never EVER in my all life saw ANY film ending worst than that! It makes absolutely NO SENSE at all. I cannot spoil it, but I at least warn you, because personally I can tolerate a mediocre film if at least the end makes a sense, and I can accept with sadness a good film which ends badly, but it makes me very angry if after losing time with a stupid movie I am given what probably is the worst end in the history of Cinema! Donnie Yen, if you have to keep going on like this, just stop acting and let us remember you for your good films.<br><br>EDIT: I have found out that they are supposed to make a sequel. 1) they could and should have made it VERY CLEAR since the beginning, that this was a movie in two parts. 2) nevertheless, there is NO WAY that this end can be acceptable. Under no possible excuse or circumstance.","user":"Ucare","rank":[26,42]},{"title":"Fails on all levels","rating":1,"date":"20 August 2016","review":"\"Iceman\" is a movie that doesn't make sense at all, and it doesn't even seem to be trying. It feels like a couple of friends got drunk together and decided to mix some scenes from the garbage bin where bad ideas go to rest.<br><br>The story seems to be a fantasy action comedy, but please, someone explain what all means. Donnie Yen's Ho Ying wakes up after 400 years and decides to go to the toilet and then run away, crash a party of young people and make a friendship with a young woman called May. At the same time, a couple of his classmates from the army have also woken up and are trying to find him, because they believe he betrayed them. Also a very shady Simon Yam (what else could he be playing?) is trying to catch all three of them and will do anything to do so. Why? It doesn't really matter because the movie isn't even trying. The direction is lifeless, the plot all over the wall, the ceiling, the floor and somewhere else, and the acting is all kinds of over-the-top-really-we-don't-know-what-acting-means variety. If that wasn't enough, the action is lame, the CGI sub-par and the comedy goes for the not-even-on-the-level-of-juvenile kind of. Oh, and Donnie Yen seems to be half- asleep all movie through. Did this idea make sense in the scriptwriters' heads? One has to wonder, because on the screen... nope, not at all.<br><br>\"Iceman\" is horrible on all levels. An incredible, horrible mess.","user":"tenshi_ippikiookami","rank":[6,8]}]