[{"title":"The Last Jedi was just magical","rating":1,"date":"2 January 2018","review":"SPOILER: This movie was just magical.<br><br>The Force has become like Harry Potter magic, with a new spell every day or so.<br><br>Rey is just magical. With practically training whatsoever she can take on Luke and Kylo and win.<br><br>Snoke is magical. He appeared out of nowhere in The Force Awakens and in The Last Jedi has such fantastic Force powers (never before seen in the entire Star Wars Universe) and yet can't tell when his protege is scheming to slice him in two (but could fell his every throught earlier, and even manipulate him and Rey's thoughts and get them to intergalactically Skype each other and even send water through space).<br><br>Luke is magical. He can magically project himself light years away and even bring solid things (the lucky dice) with him. Then dies magically for no apparent reason.<br><br>Yoda is magical. His Force-ghost actually has more Force powers than when he was alive! Calling down lightning from the sky??? Heck, why don't the Jedi just do that when fighting on Tattooine or whatever? And if Force-ghosts still have Force powers why not the whole gang of Anakin, Ben and Yoda take on Snoke?<br><br>Rose is magical. She appears out of nowhere and just happens to go along with Finn on a completely unnecessary mission to find a code breaker, and find not one but TWO code breakers, one of which is in the SAME CELL as they are. I mean, is that magical or what?<br><br>Leia is magical. Previously in 7 movies only having the barest abilities in the Force, she now can survive in space for quite a long time and even open her eyes without getting them immediately frozen, and Force-Mary Poppins herself back to the space ship. Magical!<br><br>I could go on and on. The biggest problem with The Last Jedi is that it's one shameless Deus Ex Machina after another. And don't even get me started on the stupid feminist nonsense, the inane attempt at comedy, the stupid characters who go nowhere in their characterisation, the stupid casino subplot, the stupid \"saving\" of Finn who wanted to sacrifice himself by Rose who magically now has feeling for him and both of them magically survive without getting shot at by the entire First Order army. Oops, I did go on and on.<br><br>If you make a movie, you need to make sure your movie stays in the universe it came from. Not invent new rules, new powers, new super villains, new behaviours from old characters, etc. out of bloody nowhere.","user":"yupman","rank":[4,5]},{"title":"I made an account just to say how disappointed I am","rating":3,"date":"14 February 2018","review":"This didn't feel like Star Wars. Now, I know people said that after viewing The Phantom Menace, but the prequels, despite their flaws, delivered a picture of a larger and more complex galaxy than the one we were introduced to in the original trilogy. The prequel characters were poorly written, scene direction felt off at times, Jar Jar existed, but at the end of the day I'll take the prequels over the new Disney films because they painted a universe. They made me want to see more Star Wars, and I appreciated the original trilogy's story arc even more after watching them. <br><br>The Last Jedi did the complete opposite. It killed my interest in the Star Wars universe because there seems to be nothing left to care about. The Resistance is just the Rebels. The First Order is just the Empire. No end is in sight. Rey is perfect already. Snoke is dead and no one cared enough to even explain his existence in the first place. The original trilogy might as well just have never happened. We've had three death stars. No stable political structure seems to be possible in the galaxy, and if it were we wouldn't visit it in the films. For all we know the conflict could be taking place in one tiny sector of the galaxy with the rest of the galaxy completely out of the loop. Sure, some people in a space casino make money off selling weapons and a slave kid has a Rebellion ring now, but that's not enough to establish why I should care about the story anymore. \"They blow you up today, you blow them up tomorrow.\"<br><br>The humor was cringe-worthy. Even the characters don't care. Poe's prank-call at the beginning dissolved any anxiety we might feel about his character right out the gate. Star Wars doesn't have to take itself seriously 100% of the time, but its characters should feel like they're fighting real battles. I don't even want to talk about the casino scenes. Disney has no right to lecture us on capitalism. <br><br>Much of the movie was just scenes lifted from The Empire Strikes Back and Return of the Jedi, cut-and-pasted around in a different order as if we couldn't figure that out. I sense a tone of disrespect for viewers' intelligence. Additionally, it is deeply disturbing to me to see critics give this movie such a high rating and then see news outlets publish articles questioning how seriously we should take the backlash. It is not a flaw in the ratings system. Sure, casual and young viewers will enjoy. But the backlash is real, and it's not all crusty old fanboys nostalgic about the good ol' days and complaining about political agendas (not that the fanboys always have illegitimate arguments). I'm a twenty-two year old woman and I was very disappointed. <br><br>Star Wars is for everyone. That should include fans, and people who love good stories.","user":"shoresk-37122","rank":[2,3]},{"title":"Unfunny Comedy","rating":8,"date":"8 March 2020","review":"I am all for interracial relationships... honestly they are a beautiful thing... but this one was so forced and out of nowhere that boggles the mind.\nThen the coincidences: they happen to have a robot with the.. they happen to be thrown in the same jail as... they happen to have matching speeds...<br><br>When did Star Wars become a cheap joke????<br><br>Elsewhere, aaron_kyle writes a review and 5 minutes later has 100 upvotes for his 'review.' This shyster is upvoting himself.","user":"james-dupa","rank":[19,20]}]