[{"title":"Corruption, revenge, comedy, Americana","rating":7,"date":"7 May 2017","review":"Medal of Victory is a very funny film, but better yet it is an original story that delivers the comedic goods in a unique way. This film begins one way and really ends up taking you down a path that you don't expect. The central theme centers around revenge, with elements of political corruption, which is at the time of me writing this somewhat apropos. While this film is a quirky comedy what really impressed me was the elements of Americana. Everything from the rural landscapes, landmarks, cars (what is more Americana than a red Corvette?) and even small town politics offer an almost nostalgic view of America that sets the stage for a good time.","user":"patrickBOOTH","rank":[4,6]},{"title":"Original, hilarious, action-packed comedy!","rating":10,"date":"14 March 2017","review":"I first saw Medal of Victory at the Wisconsin Film Festival, and then in a theater. This satirical comedy is set in rural Wisconsin, where a series of madcap escapades and mistaken identities ensue. The movie reminds me of some of my favorite screwball comedies (Caddyshack, The Big Lebowski, Raising Arizona).. it was hilarious and thoroughly entertaining. Recognizing some of Wisconsin's landmarks was the icing on the cake.","user":"drstarbuck","rank":[12,30]},{"title":"Solid first feature film from Warehouse District Productions","rating":8,"date":"4 May 2017","review":"Pros: Beautiful cinematography, with enough time given to each shot to not feel rushed while at the same time moving the story along. - Acting was very good, with strong performances from each of the lead actors. The mayoral candidates especially demonstrated their chops and brought professionalism and wit to their roles. -Script was efficient and funny, and left room for the actors to move around in their characters and scenes. -Set in Wisconsin, with many familiar locales that locals will enjoy, and which I appreciate because this film could have been made most anywhere. The roots and pride of the production team are on display here.<br><br>Cons: The two lead characters, while funny and well played, did not receive the kind of character development that had me rooting for them particularly. I couldn't tell much about their back stories, other than the situations that played out on screen.<br><br>Overall, I liked this movie very much, especially considering the scale of the production, I feel that this is a very well made, truly independent production.","user":"quinnerbinner","rank":[3,6]}]