[{"title":"One That Sticks With You Emotionally","rating":9,"date":"16 October 2019","review":"As the climax of the movie wanes and you slowly begin to realize the true meaning of this film, you can't help but feel overwhelmed and ask yourself, \"what if I got another chance at life?\"<br><br>It is not a sci-fi film. This is a true love story. Not a romance, but as the Greek call it, Agape. The highest form of love. She knows how her story ends, but she chooses to relive her fate.<br><br>I don't really want to give anything critical away here because this movie needs to be watched, and it needs to be felt. Anyone who has had pain, disappointments, or regrets, needs to watch this movie for its beautiful message, and enjoy it for what it is- a well made movie that is unique and beautiful in every way, something sorely lacking in Hollywood these days.<br><br>One note: Max Richter's \"On The Nature of Daylight\" was perfectly utilized in this film, I truly do not think the moment it was used would not be as impactful if not for this beautiful song. The end was definitely the highlight of the film, and when you hear the faint, weeping strings come in, it's almost automatic, you begin to feel like the events that are unfolding are happening to you. Truly a remarkable film in every way.","user":"RexAtTheMovies","rank":[38,42]},{"title":"No CGI overkill, just some fine acting and directing","rating":9,"date":"13 February 2017","review":"Denis Villeneuve is without a doubt an upcoming director and I can't wait to see Blade Runner 2049. Prisoners, Sicario and now Arrival (haven't seen Enemy yet, or some of his earlier work). Denis knows how to capture the tension. It is almost the strongest point of all of his films. Minimal use of computer generated images, and main focus on story, characters, acting and thrilling scenes. Back on IMDb board, I have noticed a lot of people calling Arrival a boring movie. So many hypocrites these days. People trying to point out every possible flaw to look and sound smarter while at the same time hailing far worse movies. Calling it boring and slow while at the same time complaining no originality in Hollywood, only giant CGI laser explosions extravaganza. Go watch Independence Day. In Arrival there is no action, no explosions, just some amazing acting performances combined with good directing, editing and cinematography. There was not a single moment I felt bored.","user":"SilentEyes_","rank":[500,641]},{"title":"Time. Life. Gift. You. Gift. Life. Time.","rating":10,"date":"11 January 2019","review":"As a kid, my dad used to tell me stories at night just like any other dads out there. I grew up, got busy with life but those priceless timeless beautiful storytelling moments that I once shared, that amazed me in wonder, curiosity, imagination and desire to know more..<br><br>I know if I think hard enough I might remember some of them, but that's not the point. The point is all those stories had characters and people and objects and places and things that I could either imagine or something that I could picture and understand and visualize in my young mind. If not for those imaginable characters and people, I would have never understood those stories, the true meaning of the story, the actual story behind the story that my dad probably wanted me to understand.<br><br>Arrival, for me is such a story. Aliens are just fun characters that help me understand the story so I can actually see beyond it and understand the untold story. You see, the way I understand it is that the director had to dumb it down for us and wrap this movie in a sci-fi genre and add aliens so you could relate it to something you are familiar with and hoped, really hoped that we try to understand the true purpose, the message behind all this. It simply couldn't have been portrayed better than this!<br><br>This movie teaches you a lot of things, if you are ready to learn. About 'time' and how much we are bound by it, about life and death, about loving unconditionally, about believing in yourself that everything happens for a reason, and so much more..","user":"tahseenahmed","rank":[188,241]}]