[{"title":"The God Particle","rating":14,"date":"14 July 2018","review":"Well, maybe I didn't have very high expectations or my inner cynic has taken a holiday, but unlike the bulk of critics and reviewers here I found this to be a perfectly serviceable piece of pulpy sci-fi/horror entertainment. It's no '2001', granted, but it's a very good looking film with nice visual effects - especially considering the budget - with solid performances by a talented cast, and it doesn't bore you for a second. I'm willing to bet most genre geeks like me (by which I mean people who have a soft spot in their heart for any halfway decent looking sci-fi or horror B-movie), would describe this film as fun.<br><br>And while admittedly about as scientifically credible as a superhero movie, it's not quite as dumb and far-fetched as many of the most scathing reviewers seem to think it is. What quite a few people apparently didn't get is that 'The Cloverfield Paradox' riffs on the very real hysteria that broke out a couple of years ago when the CERN in Geneva (Switzerland) conducted an experiment to find the Higgs Boson (aka the \"God Particle\" - which incidentally was also the film's original title.) The CERN scientists hoped to find the God Particle by simulating conditions in the Large Hadron Collider - the most powerful particle accelerator on Earth - that were supposedly similar to those in the immediate aftermath of the Big Bang.<br><br>A lot of people worldwide got scared shîtless by that idea, because they thought such a simulation could have unpredictable and possibly catastrophic consequences, and a couple of scientists even tried to stop the experiment by filing a case to the European Human Rights Court. The wildest theories started popping up in the media, like the experiment would cause black holes that would suck up Earth or open doors into other dimensions; heck: even a portal to Hell was considered a possibility, allowing demons to roam the Earth. So of course it was only a matter of time until a genre film would exploit the idea of a particle accelerator accidentally causing a rift into other dimensions and parallel realities across the space-time continuum.<br><br>And let's be fair here for a moment: in the history of stupid ideas for movies - especially genre pictures - this certainly isn't the dumbest concept ever to base a sci-fi/horror film on. Also, by putting a Cloverfield spin on it - which, btw, actually is kind of fitting given it offered the chance to explain how the creature from the first film \"stranded\" on earth - the filmmakers managed to get the film a kind of attention it otherwise certainly wouldn't have had. It was a smart marketing stunt (as was selling the movie to Netflix) and probably crucial to keeping the film cost effective and being able to put as much money as possible into the visual effects (the budget for the whole film was only 25 million, and practically the only P&amp;A costs this film had was the Super Bowl ad).<br><br>What I also don't get is why people expect \"hard\" science from the kind of pulpy sci-fi/horror movie 'The Cloverfield Paradox' clearly is; there's obviously nobody who knows what would or wouldn't happen if other dimensions and parallel universes existed, let alone how physics would behave if they somehow \"crashed\" into each other. And of course it's all speculation and characters behaving erratically: that's part of what makes those films FUN. And believe it or not, that's exactly what I had. But don't take my word for it, make up your own mind; chances are, if you're into genre picutures (where solid entries with very decent visual effects are few and far between), you'll experience a similar sensation.<br><br>P.S. In case you don't know whether to trust this review or not, just check out the lists below, and you'll see exactly what kinds of films I like:<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[186,231]},{"title":"I could have watched Norbit","rating":1,"date":"6 February 2018","review":"I swear this was written by a 10 year-old. A few quick examples roughly in order of occurence:<br><br>1) \"The world is almost out of oil and everyone is going to die if we don't find this theoretical energy.\" I guess solar, geothermal, wind, and hydro-electric solutions don't exist in this universe. Plus it's the future, these technologies would almost certainly be much further developed/implemented by then to boot.<br><br>2) Within 10 minutes some random dude pretty much says, \"If we conduct this experiment we could have monsters rise from the sea in the past!\" Uh...kinda specific there, buddy. Almost like you've seen Cloverfield.<br><br>3) After the experiment goes awry and all the station's systems shut down, they can't detect Earth...and half if not most of the crew of scientists automatically assume it's because Earth disappeared. Not because, you know, the systems are down.<br><br>4) After confirming the Earth was gone they didn't think to use the stars to find their location until way, way later. Maybe I just don't know what scientists are.<br><br>5) When the Russian is thrown on a table and immediately dies, you hear a flatline. He was never connected to any equipment. This is one of the only enjoyable scenes.<br><br>6) Many drug trip-esque random events that have nothing to do with anything and don't even jive with the \"different realities smashing together\" theory. Example: a guy for some reason gets his arm sucked into a nonsensically morphing wall, the wall takes it off painlessly and spits it out, then the arm comes alive with a mind of its own ala The Addams Family (or Evil Dead 2), writes down \"Check the dead Russian's stomach!\" and in his stomach they find the exact battery they needed to do something.<br><br>7) Example 2: a tank full of worms loses only all the worms and they suddenly appear inside the Russian, killing him as mentioned from before. This, and many other stupid things, aren't \"random events\" but would take intelligence (or stupidity) and coordination to pull off. Though the woman appearing in the wall was kinda cool.<br><br>8) Wall Girl, who suddenly appeared from another universe, has to wear another dude's uniform because hers got chopped up in the wall's wiring. Good thing it's fitted perfectly for her size and shape. Future clothes rocks.<br><br>9) Wall Girl doesn't know Asian Girl because SHE (Wall Girl) is the alternate universe's Shepherd (experiment name) engineer. But later she (Wall Girl) says that Main Girl was never on the ship in her alternate universe because she (Wall Girl) went on the mission in Main Girl's place. Main Girl and Asian Girl have completely different jobs. This one's a thinker but it's a nice fat plot contradiction, even in a movie with alternate universes.<br><br>10) Favorite line: \"Shepherd smashed a Higgs Boson, overloaded, somehow ended up here.\" I bet they just looked up trending science topics on Twitter and injected them randomly in dialogue, because these are just words.<br><br>11) So why did the metal glue grab the guy and stick him to the wall? And don't say the unexplained magnetism because that was pulling consistently in one direction and to achieve what happened it had to succumb to the magnetism then (after grabbing him) somehow completely resist the intense magnetic field and suck him to the wall like a monster, even though all the other metal did not experience this effect.<br><br>12) A room filled with water is instantly completely frozen when exposed to space, but a room filled with air exposed to space doesn't see as much as a speck of frost although water's thermal conductivity is way, WAY less than air's. Go science!<br><br>13) A group has to manually eject a giant spinny thing so the ship doesn't explode. The commander heroically seals himself in with it to eject it easier. A crew mate yells, \"No! We can do this remotely!\" I love it.<br><br>14) The miscalculated Shepherd experiment makes a bunch of random chaotic things happen including sending their ship to a different universe. How do we get back? Press the button again, make more more random chaotic things happen and of course it'll perfectly transport us back to the spot we came from but change nothing else.<br><br>15) Main Girl, before transporting back to her original universe/Earth, sends a message with constructional and operational plans for the Shepherd machine (what they're in space experimenting with) to hopefully save that alternate Earth's fuel supply. Though Wall Girl from that alternate universe/Earth is there to begin with because she's on the same mission, in the same space station, with the same device that malfunctioned. I think they forgot.<br><br>16) And best for last: They never say what \"The Cloverfield Paradox\" is. Do they mean the chance of multiple universes colliding? Because that's not a paradox, it's an effect. This supports my hypothesis that they just picked fun science words to scatter about.","user":"viddyd33","rank":[413,538]},{"title":"Disappointing","rating":2,"date":"5 February 2018","review":"Although the performances were fine, the story was a muddled mix of bad science (gravity doesn't work like that, not in any of the scenes) and sci-fi cliches, with several random mentions of the word \"Cloverfield\" shoe-horned in inexplicably. The film introduces several \"haunted house\" elements that are never explained.<br><br>There is less than a minute of content that connects this to the other Cloverfield movies, and as minor and inconsequential as the connection is, they still manage to contradict the events in the other films. <br><br>No one can watch this and find it faultless. The 10/10 \"Must see!\" user reviews were presumably written by publicists.","user":"Shijuro","rank":[325,464]}]