[{"title":"You Get What You Expect","rating":8,"date":"11 April 2017","review":"The best part about this movie is seeing Morgan Freeman, Michael Caine, and Alan Arkin all on screen together. They have fantastic chemistry, and you really feel like their characters have actually been friends for 30+ years. They just glow on screen, and seeing them riff on each other and have a good time made for me to have a good time as well. They all gave great performances. The supporting cast was also really good. It was fun to see Christopher Lloyd pop up in a film again. We also got see some good performances from Kenan Thompson and Ann-Margret. Look, with this movie, there are no revolutionary jokes. It's everything you would expect there to be. I do tend to prefer edgier comedy than this, but I made my peace with it the second the first joke hit. This isn't meant to be a Seth Rogen kind of comedy. This is supposed to just be a fun, light- hearted, feel-good comedy, and it was really good for what it was...","user":"themovieparadise","rank":[136,145]},{"title":"Like Eating Comfort Food","rating":7,"date":"11 April 2017","review":"The new film, GOING IN STYLE, is the equivalent of eating a Grilled Cheese Sandwich with&nbsp;Tomato Soup on a cold, rainy Sunday afternoon - very familiar, very welcome and very comforting. &nbsp;It's not going to win any Academy Awards or change the course of movie history, but this film delivers - competently and professionally - what it promises to deliver with no fuss and no muss.<br><br>Starring film veterans Michael Caine, Morgan Freeman and Alan Arkin, GOING IN STYLE tells the story of how these three are pressed against the wall, financially, and their last resort is to rob a bank to get the money they need.<br><br>And...it's fun...not hilarious...not groundbreaking, but fun. &nbsp;Caine, Freeman and Arkin believably play 3 long time friends who are nearing the end. &nbsp;There is a comfort there with each other and it was pleasant to spend time with them. &nbsp;Joining them was the one and only Ann- Margret and the always fun Christopher Lloyd (in, hands down, the best performance and most interesting character in the film).<br><br>Notice, I've used the words comforting, pleasant and pleasing. &nbsp;I did NOT use the words groundbreaking, hilarious or epic. &nbsp;I certainly enjoyed myself and am glad I saw it.<br><br>And you will too, whether you see this film in the movie theater or run across it as you are lying on the couch some rainy Sunday afternoon.<br><br>Letter Grade: &nbsp;a solid \"B\"<br><br>7 (out of 10) stars and you can take that to the Bank (of Marquis)","user":"bankofmarquis","rank":[88,105]},{"title":"Old Guys Rule!!!","rating":8,"date":"10 April 2017","review":"Remakes shouldn't carbon copy the originals. \"Garden State\" director Zach Braff of \"Scrubs\" and \"Hidden Figures\" scenarist Theodore Melfi have jettisoned more from the original \"Going in Style\" than you might expect, but they also have lightened up the tone with amusing shenanigans and gags galore. Initially, \"Going in Style\" (1979) blended low-key comedy with grim drama in its straightforward depiction of brazen oldsters who engineered a bank heist wearing little more than dime-store disguises, essentially Groucho Marx masks, with big black glasses, big bulging noses, and big droopy mustaches. George Burns, Art Carney, and Les Strasberg starred as the ambitious old geezers who held up a bank because they were bored with their daily routine of sitting on a park bench. Sadly, those three old-timers didn't live happily ever after once they got away with the goods. Two of them croaked after the crime, and the mastermind surrendered and served time. Ultimately, the mastermind refused to divulge the location of the loot. In the end, he decided that he could break out of the prison with little difficulty. Imagine George Burns imitating the perennially pugnacious Humphrey Bogart, and you'll have a good idea what a hard-boiled egg Burns made as the ringleader of the elderly triumvirate. If you've never heard of George Burns, he was the cigar-smoking comedian who made the \"Oh, God!\" trilogy. <br><br>In their \"Going in Style\" remake, Braff and Melfi have preserved the premise about three seniors who decide to stage a bank robbery. Braff and Melfi stick with the same three names of the original characters: Joe, Al, and Willie, but change their color and nationality. Typically, Hollywood prefers to reward altruistic characters who perform good deeds and punish villains for their selfish, wicked ways. Comparatively, Braff's \"Going in Style\" remake relies far more on feel-good fantasy than abrasive drama, and the characters are not the original skeleton crew. Braff and Melfi have gone to considerable lengths to flesh out each character so these individuals boast stronger motivations about turning to a life of crime despite the possibility of not only shooting up a bank but also being shot by anyone during the robbery. Michael Caine, Morgan Freeman, and Alan Arkin step into the shoes of George Burns, Art Carney, and Les Strasberg as the three codgers who committed the crime. Happily, the new Willie, Al, and Joe enjoy greater success than their predecessors after they carried out their criminal enterprise.<br><br>\"Going in Style\" never lets one of the three heroes outshine the other two in terms of extended or abbreviated screen time. Willie (Morgan Freeman of \"Driving Miss Daisy\"), Al (Oscar-winning actor Alan Arkin of \"Argo,\" and Joe (Oscar-winning actor Michael Caine) neither live together nor contend with the dried-up, depressing, boring lives that their predecessors endured with death looming on the horizon. Rather than robbing a bank out of sheer boredom, the three new protagonists resort to bank robbery because the company that employed them for 30 years has frozen their pensions and it is stashing that pension money in a local bank for other purposes. Willie, Al, and Joe attend the public meeting at their old company, and they walk away with rage in their hearts. Willie teeters on the verge of death from a bad kidney, but refuses to alarm them. His doctor warns him he must locate a donor because his chances of acquiring a new kidney are slim to none. Al gave the best years of his life to the same company, but he abhors the idea of sticking up a bank. Eventually, he decides to join them. Ultimately, the driving force behind the bank robbery caper is Joe because he has overdrawn his checking account and is poised to lose his home. In the original, Willie, Al, and Joe all shared the same house. Furthermore, the original protagonists were all Caucasian, while the latest group emerges as diverse, multi-cultural triad. African-American, Jewish-American, and British, without a White Anglo-Saxon in sight. Like the original, the individual who formulates the strategy for stealing thousands of bucks at gunpoint is Joe. Not only does Joe fear he will lose his house, but he also dreads the prospect that his granddaughter, Brooklyn (Joey King of \"The Conjuring\") and her mother, Rachel (Maria Dizzia of \"Margin Call\") won't have a place to live after his eviction. <br><br>Joe is oblivious to his monetary woes until he visits his bank and discovers his dire straits. While he is learning about his woebegone financial status, three masked felons decked out in black suits with assault rifles burst into the bank and threaten to shoot anybody who doesn't cooperate. They make all the customers lay on the floor and they go from one bank cashier to the next watching each as they dish out the dough and put it in their satchels. The efficiency and speed of these three bank robbers stun Joe. Indeed, this robbery scene reminded me of the scene in director Michael Mann's classic caper \"Heat\" (1995) with Al Pacino and Robert De Niro. Like his predecessor in the 1979 original, Joe has a difficult time persuading his two lifelong friends to accompany him to the Williamsburg Savings Bank in Brooklyn with pistols and masks. Unlike their predecessors, these three decide to learn a little about bank robbery from a pro, Jesús (John Ortiz of \"Kong: Skull Island\"), who operates a dog grooming business, but moonlights as a bank robber. Jesús trains them in every aspect of a hold-up, and they cut him in for a quarter of the loot. When Willie, Al, and Joe enter the bank, they have a clue about what they're doing, and they maintain a timetable so as to escape before the police arrive.<br><br>\"Going in Style\" generates lots of comedy and some spine-tingling suspense. Predictable in certain respects, this immaculate bank robbery caper never wears out its welcome, with heroes that you can respect and root for in their efforts to make good.","user":"zardoz-13","rank":[37,44]}]