[{"title":"Melancholic zomcom","rating":7,"date":"8 January 2016","review":"Version: Grimm Up North festival screening<br><br>Actors: 7/10<br><br>Plot/script: 7/10<br><br>Photography/visual style: 7/10<br><br>Music/score: 7/10<br><br>Overall: 7/10<br><br>It's astonishing how broad the range can be even within a sub-genre of films. Life After Beth is best described as a 'horror comedy', and yet it is completely different to other horror comedies I saw on the very same day.<br><br>The comedy comes from the situation, not the characters, who are played pretty straight. Beth (Aubrey Plaza) comes back from the dead, forcing her boyfriend Zach (Dane DeHaan) and parents (John C Reilly and Molly Shannon) to confront their grief and the conflicted feelings they have about her and their lives with her. Over the film, her behaviour becomes more abnormal, and other undead appear, causing increasing chaos.<br><br>The pacing and balance of the film are remarkably well managed. Plaza does a great job with her performance, slowly showing increasing signs of deterioration from ordinary teenage girl to mindless zombie, and each other character's reaction to the bizarre situation is shown to be ridiculous at one point or another. I note that director Jeff Baena's main other contribution to film is co-writing the script for David O. Russell's surreal comedy 'I Heart Huckabees', and I think he should really be seen as a writer who has taken up directing.<br><br>Lots of ideas are explored through Life After Beth, such as grief and the way our memories change as time passes. There is a little bit of action and tension, but mainly this is a melancholic, thoughtful piece which brings humour out of the behaviour of normal people in an abnormal situation. It's a writer's film, and an actor's film, and I found it rather touching as well as entertaining.","user":"justbob1982","rank":[30,33]},{"title":"Unique zombie movie.","rating":9,"date":"8 April 2015","review":"In my opinion Dane DeHaan is an amazing actor. Even though I have vowed to never see a found footage movie again, I did struggle through the entirety of Chronicle which was to no one's surprise...a found footage quality movie.<br><br>But then I saw DeHaan in Amazing Spiderman 2 where he successfully helped the audience understand why he is so angry and why he has reason to be a villain. So similarly, in this movie he conveys realism under surealistic situations.<br><br>If zombies were real... this is how it would go down. I am trying to understand why I loved this movie but it all comes down to one fact. Real characters.<br><br>I keep mentioning again and again how some movies kill off characters and sad music is playing and you are supposed to feel sad yet...you feel nothing at all. And all the Hans Zimmer in the world wont make you cry.<br><br>But then, there are movies whose plot revolves around a robot with scissors for hands, or a kid that grows up after a wish, or a dude who lost his volleyball in the ocean.<br><br>And this is a movie with real characters for whom you care. Realistic dialogue, awesome situations. Truly a one of a kind movie. Neither a horror nor a comedy flick...not even a romantic one.<br><br>Just a story of how it would go down with a little bit of silliness in it.<br><br>Beth's parents are in denial about their daughter which is only natural. Dehaan's reaction after finding out Beth is still alive and how he goes temporarily insane and re falls in love with her. How Beth loses touch with her humanity gradually and how a zombie uprising is about to occur are all awesome elements.<br><br>I loved watching this movie. The cast is wonderful and Audrey Plaza earns my respect as someone who is not afraid of destroying her image. <br><br>I have reached a point in my life where I am bored as hell of watching clichés and formulas. Every alien movie needs a \"bomb\" the mothership ending. Every possession movie needs a girl acting silly and talking in voices. Every zombie movie needs people barricading themselves in malls. Every disaster movie needs explosions and footage of the Aiffel tower and the Acropolis getting destroyed.<br><br>Not Von Trier's Melancholia that had a different approach to destruction movies.<br><br>Nor Jeff Baena's Life After Beth that had a different approach to zombie movies.<br><br>If you want the same old sith,a typical zombie movie ...go for Land of the Dead [2005]. If you want a different approach...Life After Beth is excellent.<br><br>I wish the audience was a little bit more supportive to movies like this.<br><br>I know that a 9 score is reserved for super awesome movies that are classics and that will stand the test of time, with awesome acting, photography, story telling techniques, music and the whole package.<br><br>Regardless, I am going to give this movie a 9 because I loved watching it and given the ridiculous material they had to work with (a dude in love with a zombie) they did an excellent job.","user":"Nikker1985","rank":[19,25]},{"title":"Outside the box","rating":10,"date":"9 February 2019","review":"This is a horror comedy. Except, it's not. People who expect the usual mix of jump scares and laughs from this movie end up most disappointed. It's a love story with zombies. But not a happy one like Warm Bodies. Much more sad and dramatic. And humor is much more dry and subtle. Unfortunately, people who sit down to watch a zombie comedy do not really expect subtle. And people who want subtle do not look into zombie comedies. This is why this little gem is one of the most underrated movies on IMDB. Watch it without expectations and you might enjoy it much more.","user":"Gradomyr","rank":[9,11]}]