[{"title":"Why isn't this being more widely reported?","rating":9,"date":"7 June 2013","review":"A courageous film that brings the truth of America's war crimes to our movie screens. Pregnant women murdered in Afghanistan shot to death by US special forces in their own home. Innocent villagers in Yemen blown to pieces by US cluster bombs. Somali warlords paid by the United States government to kill foreigners. Meanwhile, young Americans celebrate outside the White House after the President announces that a man has been in his own home.<br><br>It would be hard for anyone to watch this movie with dry eyes, but how can an American sleep at night after seeing the murders our tax dollars are funding and elected officials are ordering? Hopefully this movie will spark a national outrage against America's crimes against humanity and bring America's military aggression to an end once and for all.","user":"DougWilliams88","rank":[152,182]},{"title":"Amazing Documentary","rating":10,"date":"1 June 2013","review":"The documentary covers the story of Jeremy Scahill's discovery of a secret war, without bounds, which the US government has been waging in the name of fighting terrorism. <br><br>We see Scahill travel the world interviewing families in Iraq, Jordan, Yemin and Samalia who have had family members killed when they were declared to be suspected terrorists. <br><br>I left the theatre feeling that it is one of the best documentaries I have ever seen.<br><br>I was lucky enough to catch a screening of this at the Seattle International Film Festival, where Scahill did a Q+A afterwards. He was extremely eloquent answering every question.","user":"daniel-naderi","rank":[112,139]},{"title":"Why aren't more people watching this film?","rating":10,"date":"8 July 2013","review":"I watched this film at home yesterday. It opened my eyes and broke my heart. I didn't realize the United States of America has hired War Lords in Somalia, on our pay roll. I didn't realize the raids and mass killings in other countries where we are not currently at war with. I didn't realize we killed an innocent young teen just because he might grow up to be a threat (wtf). This film opened my eyes and I haven't been able to get it off my brain since watching it. I don't understand how the USA is getting away with committing crimes against humanity. This kill list they have keeps growing and at anytime your name could be put on it. It keeps growing and growing and there is no end in sight. Watch the film, have a your friends and family watch this film. Everybody needs to watch!","user":"rpduffy861","rank":[71,86]}]