[{"title":"Visually good and entertaining, could've done with a better script","rating":7,"date":"26 November 2013","review":"Although visually I feel this movie does live up to its expectations the script does not seem to match up as well. The plot itself is fine, and towards the end it draws you in much more. The dialogue, the development of secondary characters and the transition between scenes could have been much better though.<br><br>It was interesting to see how despite the weakness in the script and lack of direction the lead actor still plays out his role as Tristan very well, a character which seems to prevail throughout the entire movie. The stereotypical tall, dark and handsome hero possesses a powerful screen presence and delivers a very charismatic and enjoyable performance.<br><br>The battle scene towards the end is also quite gripping, and the action gets even better in the one-on-one segments. Nothing too graphic, which justifies the PG rating, but it keeps you on edge until the the very end.","user":"geegeeharrison","rank":[30,35]},{"title":"Weak Script, Strong leading Actor","rating":8,"date":"23 July 2019","review":"I find it fascinating how a strong leading actor, and yes in this case also very handsome can turn around a weak script. I only just watched this movie which is also titled Avenging the throne. The story itself is quite straight forward and to be totally honest is rather intriguing all the way to the end, however amongst other areas the script definitely falls short when it comes to details and linking all the scenes together. I would normally switch to something else if a movie doesn't grab my attention within the first ten minutes. Well in spite of the script's shortcomings and a low production value I carried on watching this one. I would have to give all the credit to the actor playing the role of Tristan for this though.","user":"alvincacciattolo","rank":[8,8]},{"title":"the good, the bad and the outcome","rating":7,"date":"30 November 2013","review":"The Good - This was a very ambitious project, so I admire the executive producers for taking the risk and investing in such a production. Any experienced filmmaker will tell you that the hardest part of this business is always related to funding. Which brings me to my next positive point, the setting. The visuals of this film are actually very good, the way each set is designed and the lighting used really enhance the feel of this medieval story, so well done to the set designer and the director of photography. And last but certainly not least I applaud the main actor (Andrei Claude) for his outstanding performance as Tristan of Leon. Quoting from a recent review on The Sunday Times \"Claude has good screen presence and portrays well the noble hero that has seen his sense of idealism dissipating before his eyes by the callousness of the world around him.\" I should add that this is also a credit to the casting director who must have had a clear vision of what this character had to represent.<br><br>The Bad - I don't like being negative but I have to be honest. The story wasn't well structured and many areas remain unexplained. Some of the acting was rather poor, and I found this a bit distracting.<br><br>The Outcome - I still enjoyed watching this film and I recommend it. Yes it could have been much better, but so could World War Z (which cost $190,000,000) and millions of people watched it anyway.","user":"maltafilmcritic","rank":[26,31]}]