[{"title":"Great Acting But Bad Editing","rating":4,"date":"29 January 2014","review":"Trying to get away for a weekend and focus on their relationship, Carl (Sam Huntington) takes his wife Sue (Meaghan Rath) to a mountain lodge for some skiing and wine tasting. Unfortunately for Carl, upon arrival, he discovers that his ex-girlfriend Robyn (Emmanuelle Chriqui)—who he used to bring quite often to the same lodge back in the day—is now the owner of the lodge. Wackiness ensues as Carl tries to keep as much of his previous relationship hidden from his wife as possible. Though the acting is of high quality—both Huntington and Rath are regulars on Being Human, though Huntington will always be Jam from Detroit Rock City to me—the editing for Three Night Stand is so unsightly and choppy that it became a constant distraction throughout the film. The worst scene involves Carl and Robyn walking through the woods with their skis, then suddenly they pull up on a snowmobile, which they dismount and find themselves back with the skis as another character approaches them on the same snowmobile they had just been on—the editing is unpleasant to say the least. A tip of the hat to Huntington, Chriqui and Rath—and to Jonathan Cherry, who steals many a scene as the husband of Carl's best friend/co-worker Stacey—but between the egregious editing and the overall weak plot line, Three Night Stand is sadly insufficient.","user":"SLUGMagazineFilms","rank":[23,28]},{"title":"Not worth the effort.","rating":3,"date":"13 September 2016","review":"Carl and Sue get ready for a weekend at a ski lodge. Carl plans to get Sue a new ring, and for them to renew their vows. When they arrive, they find that Carl's ex Robyn, who now calls herself Ryan, has bought the place and is running it. Carl also hoped that during this weekend, he and Sue might iron out some turbulence in their relationship. On top of that, Carl slips out now and then to telephone Stacey, his best friend and co-worker. Stacey tries to help Carl as best she can, but has her husband Doug to contend with at the same time.<br><br>Worlds collide!<br><br>The rest of the film is about the consequences of the collision.<br><br>If you hate women, you might like this film. If you hate men, you might like this film. Both men and women are portrayed as being beneath worthless. If you despise romance, you might like this film. If you hate laughing, you might like this film. There was no romance, but only callousness and cynicism. I did not laugh while watching this movie.<br><br>Since I do not fit into any of those categories, the picture had little appeal to me.","user":"suite92","rank":[5,6]},{"title":"It's not quite the worst movie I've seen...","rating":3,"date":"22 June 2015","review":"It's not quite the worst movie I've seen...it really isn't - but I'd be hard pushed to think of anything I've seen recently which comes close. <br><br>I can't fault any one thing, the story is OK, the writing fits, the cast, love 'em, location, nice, but put it together and, well, it just doesn't flow. <br><br>The sex scenes, such as they were, were dreadful (even in context) and seem forced in (no pun intended) and the editing seems to have been a bit hit and miss to the extent that I wonder if they lost some of the footage - or maybe had to re-shoot after losing an actor. That might also address why the story seemed to have gaps and why we didn't see enough character development.<br><br>On the cast, for me, best performance was Emmanuelle Chriqui, the character could have been so much more. Sam Huntington puts in a good performance too and takes the character well but doesn't get anywhere.<br><br>I'm left disappointed by the whole story. More could have been explored between Robyn and Carl, something deeper than at aborted quickie on a snowmobile, something more tender, something unfinished, we could have been left wondering what if.....? Instead we get that Carl would jump his ex literally minutes after rowing with his wife, nobody comes out of this 'clean', I can't find anyone to root for.<br><br>Sadly, this Canadian film even incorrectly name checks the Yamaha snowmobile as a 'Ski-Doo' - the latter being a brand name of the Canadian Bombardier Recreational Products.<br><br>I'm sorry to leave a largely negative review but if you are looking for funny or dramatic, look elsewhere.","user":"imdb-5760","rank":[7,11]}]