[{"title":"Great movie, but it was a wasted chance for an 'unforgettable' movie","rating":7,"date":"19 May 2015","review":"After watching a movie like 'Blow' (about George Jung) or Goodfellas (about Henry Hill) this movie seemed horribly irrelevant from Escobar's life. The movie, and plot, are both excellent but the main focus is not Escobar himself, and his story was not fully told but rather a story of this white dude who becomes friends with him and gets in trouble.<br><br>I think this would have made a great movie if it didn't have the title of \"Escobar\" because it really isn't a movie about him. Escobar (character) appeared in many other great movies but wasn't the main focus, and that worked. This title, however, is unfair because now this movie will be the main one about Escobar while it shows nothing of him.<br><br>Hats off to Benicio del Toro, another solid performance!","user":"athoura_dragon","rank":[26,31]},{"title":"The Powerful Reach of Evil","rating":9,"date":"30 June 2015","review":"I went into this film knowing very little about who Escobar was, so I went through an experience similar to the main character in the film, as he realized that he had encountered one of the devil's true incarnations on Earth. Escobar, as portrayed in the film is a figure of mythical proportions, someone whose deeds are really difficult to believe because it seems almost impossible a human being is capable of committing such actions.<br><br>Del Toro, in a towering performance that is at least worthy of an Oscar nomination, makes Escobar come alive, though they are not very similar physically, but the behavior, the charm, very similar to a snake's, one that you can't ignore or walk away, though you know it's lethal. Escobar in the film grows from just a man who has immense amounts of money at his disposal to someone who commands much power through the darkest of means.<br><br>The story in the film doesn't dwell on Escobar in biographical terms. It deals with a Canadian young man who happens to fall in love with Maria, Escobar's niece, and little by little, realizes he might have just wandered into a nightmare that will have serious consequences for him and his closest relatives.<br><br>Nick is welcomed into a world that doesn't make any sense to him, a world populated by people who have amassed insane amounts of money and flaunt it ostentatiously to anyone who attends their social functions. It is obvious they are \"new money\" because many of the women walk around in outfits that are expensive and mostly having the color gold. They sometimes appear out of place when they are wearing an expensive gown in the middle of the day, or we see outrageous presents given to each other. <br><br>Eventually Nick discovers how deep the darkness is. He finds some of Escobar's associates washing blood off themselves. He begins to see that some of the looks he's given are a bit on the threatening or intimidating side. It is uncomfortable, and as the situation changes for Escobar, so do the plans he has for Nick.<br><br>The last third of film deals with the way Nick has to find a way back so safety and escape the worst of fates. This film has some of the most exciting pieces I have seen in 2015, and the tension mounts, as Del Toro's quick directives to dictate Nick's ultimate fate. There are some chilling scenes where we hear Escobar's interactions with his family, while he juggles a change of plans in order to ensure the demise of his enemies.<br><br>It's not an epic masterpiece, but a good film that shows a dark period in Colombia, the depiction of a monster at his worst, wonderfully played by Del Toro, who is able to show whatever exists in the soul of this complex criminal. If you didn't know anything about this piece of history, you will definitely be interested by the time the film's last frame ends.","user":"aharmas","rank":[11,12]},{"title":"Brutal, Intense and Scene Gripping","rating":8,"date":"11 February 2015","review":"Pablo Escobar the most powerful drug lords in human history.<br><br>This movies gives you an insight to how he would have been viewed by his family, associates and of course the public of Columbia.<br><br>You'll find that life is cheap, trust is thin and power is everything. <br><br>It also leaves you with a questions.. <br><br>Is the wealth, power and money worth the sacrifice of family, simplicity and freedom?<br><br>Would recommend you make your own opinion of this movie, personally I found it enthralling and couldn't look away.. <br><br>If this review helped, please leave a like or what have you. <br><br>Cheers, Thomas Lyons","user":"tomjoseph-lyons","rank":[70,95]}]