[{"title":"Worse Version of Esther","rating":1,"date":"25 October 2013","review":"I would not recommend this movie to anyone--especially those who don't know the story of Esther. It does not follow the Bible accurately. In fact, it shouldn't even be called, \"The Book of Esther\" because it hardly even follows it! It contains so many shoot-yourself-in-the-mouth scenarios. For instance, in the beginning of the movie, Mordecai tells Esther never to reveal her people and yet you see him presenting her as his daughter while quoting Scripture which is clearly from the Jews! Haman keeps repeating to the king that Mordecai is a Jew and it's so obvious that the secret is out about Esther's heritage. And the court room case at the end of the movie???? Tacky! That never happened. The king banishing Haman to be killed was done while Esther and him were having the banquet. This version completely takes away the drama in the real story. Horrible! And Mordecai would never have recommended her. The Bible clearly states that she was taken-- along with thousands of other young ladies. If you want a more accurate version, watch the Esther version that came out on TV a couple years ago with Louise Lombard. The movie, \"One Night with the King\" is even more accurate but not completely. Don't waste your time watching this-- it is such a disappointment!","user":"joyc20","rank":[35,40]},{"title":"comedic, really.","rating":3,"date":"3 September 2013","review":"The only reason I give this movie a score higher than 1 is that it made me laugh repeatedly. It was that bad. Production values were down to nil, and boy does it show. Oh, and you know the kind of acting where it's been rehearsed so often as a group that everybody knows what's going to be said next, so that everybody looks at the guy with the next line as soon as the current guy finishes his line? Yeah, that's the kind of movie this is. I absolutely couldn't believe somebody agreed to put it up on the big screen. It was totally the stuff of a high school play, okay, college, but no more. Again, hilarious.<br><br>Now, the cast. When I first saw Hadassah (Esther) I thought, sure, pretty face, but completely lacking any hint of an actual Jewish bloodline, as typically there are certain distinguishing features. (Nor does much of anyone else look Persian.) Also much older than the 'girl' of the biblical narrative and, accordingly, a bit paunched. Paunched? Really? The most beautiful virgin in the whole wide kingdom was paunched? I don't think so. Again, hilarious. And I'm still trying to get a handle on why Mordecai had a California-grade tan while almost everyone else was a nice, soft shade of pasty.<br><br>Okay, the acting. Stiff. Sometimes vacuous. Often sappy. Invariably affected. Watch this movie just for the exercise in squirming. Simply put, not believable. No, not ever.<br><br>Finally, (and, honestly, most importantly), this effort at a story drifted ridiculously far from the biblical one. They announce at the start of the film that the story is missing biblical elements and that it contains non-biblical ones, all in the name of dramatic effect. Really? Read the Book of Esther. It'll only take ten minutes. But despite its brevity it's one of the most inherently dramatic narratives in all of scripture. The idea that someone decided to change it for dramatic effect is absurd. It's also disingenuous. Following the story as it is written would have cost more. Tweaking, condensing and changing the order of events allows for a more concise script and a more abbreviated screenplay. Shame though. Too bad the producers weren't more well connected.<br><br>Someday someone will do this story up right. It'll be spectacular.","user":"tmraywood","rank":[73,91]},{"title":"Atrocious","rating":1,"date":"25 June 2014","review":"I am saddened to say that this film is absolutely atrocious. I watched it a couple of months ago at a Youth Bible Study, and still cannot fathom the atrocities that I saw. Before I begin, I'd like to say that I am a fan of PureFlix and respect the fact that the production company does its best to make high quality Christian films as a means to spread the Gospel. However, the 'high quality' thing I just said up top extends millions of miles away from what one sees on 'The Book of Esther.' It is one of the worst movies I have seen in my entire life. (And I've watched crappy TV movies from both Lifetime and Sci-fy channel.)<br><br>To make my list of reasons easier, I will number them: 1. The CG is laughable. 2. The acting is as if the producers hired volunteers off the street instead of legit actors. 3. The props looked as if they were bought at Walmart - no lie. (e.g. Queen Vashti's wig looks like it was bought at the after-Halloween clearance section from Walmart. 4. All actors had different accents. (e.g. Queen Esther sounded like she came straight out of Los Angeles, which really threw me off). 5. Slight inaccuracies to the biblical account here and there, but nothing too major. <br><br>All in all, this movie is horrible. I know that budgets are not high enough to turn the movie into a big action-y straight-out-of-Hollywood movie, nor do I expect it to be, but I believe PureFlix could have done way better than this.","user":"biancaofthecaribbean","rank":[15,17]}]