[{"title":"A new(er) sport gets validated","rating":9,"date":"3 April 2013","review":"To fully understand the extent of this film, it's probably best to be fluent in the language of mountain biking and everything that entails. Given that some people may not have enjoyed the characters involved and their attitudes that came with, it's easy to see that this documentary can be misjudged from an outsider. For starters, there are only a handful of riders in the world who can navigate a mountain bike down one of these virgin trails. Adding front flips and scrubbed jumps at 40+ mph into the mix ups the adrenaline ten fold. A film that captures less than 120 minutes of condensed footage from over two years of planning and shooting is not going to be your accurate portrayal of a man's travels. When sitting at home and watching this movie from the comfort of your surroundings, it's easy to forget that many of the tricks performed could result in fatal injuries. For athletes that have experienced endless crashes and pain, it's necessary to act quick in order to prevent major damage. The same way a situation is handled on a football field or a basketball court, these riders must pay careful attention to their bodies and how they've reacted to tumbles. After all, these men are paid to mountain bike around the world, whether its racing or pleasure. There's no future if you're in a wheelchair for the rest of your life. <br><br>For a mountain biking documentary, there are few films that have ever approached this level of commitment and direction. Jeremy Grant doesn't rush any of the scenes, and he provides plenty of great cultural scenes in between the action. For those who have never experienced mountain biking firsthand, this seems to be a great introduction to the sport. I was fortunate to catch this movie in theaters here in Atlanta, as part of the Atlanta Film Festival. Many of the audience members were vocal about their mountain biking ignorance, yet all were pleasantly surprised with the movie itself. It's hard to ignore the human accomplishment that this film captures, both in the success of the riders and their interaction with differing cultures.","user":"matt-wooddy","rank":[14,15]},{"title":"Simply Epic","rating":10,"date":"21 March 2013","review":"The creation of some of the greatest athletes in modern free-ride Mountain Biking and expert choreographers ... intense action and unremarkable skill seamlessly and beautifully placed into Film This production will likely be ranked as one of the top ten MTB (or outdoor/travel) films for some time to come.<br><br>Filmed in some of the most remote and inaccessible places to exotic and unbelievable areas of the World including. The vast treacherous high desert mountains above Virgin Utah ,in the astonishing Gobi Desert of China ,the very distant and rural region of Mustang Nepal ,into the wilds of British Columbia Canada ,and peaceful remote Cafayate Argentina ... The Sacrifices and Dedication of the producers ,professional cinematographers and riders ,along with the very real People they interact with along the journey is unbelievably humbling and to say anything different would be completely biased.<br><br>I believe this to be not only a film about the nature of the modernization of the sport. But of the principle of being ambassadors and spreading friendship and new thoughts to all no mater what Your aim is","user":"josephhenry91","rank":[10,11]},{"title":"Stunning in every way","rating":10,"date":"8 October 2014","review":"I sat for the entire duration of this movie in awe. In awe of the riders and their skill, the landscape they chose to challenge themselves and their bikes, the amazing cinematography and the high production values.<br><br>There was clearly a lot of love and passion, hard work and commitment gone into making one of the most epic free ride movies, let alone any kind of sports movie, ever.<br><br>It's simply jaw dropping from start to finish, humbling, inspiring, and down right fun to watch.<br><br>If you are into thrill seeking of any kind, off road riding, or just generally admire people with a serious talent who push the limits beyond your imagination, watch this movie.","user":"lewis-henderson","rank":[2,2]}]