[{"title":"He yells a lot. Sooo he must be a great chef/coach/teacher/captain...","rating":4,"date":"4 January 2016","review":"There are a lot of movies out there where the leader of a team, talented, strict and know-it-all, tries to discipline his group, in the background of a match or a contest of some sort. Music, sports, army, classes, even spelling contests and of course ...haute cuisine.<br><br>Common factor in all these movies: The leader ...yells a lot! And he is mean to his pupils. And he doesn't forgive the tinniest of mistakes. And he has enemies. Or rivals. And an old teacher who was mean to him like he is now mean to them. And there is a purpose. A trophy. And a love subject.<br><br>Pretty much this summarize Burnt too. So, the premise is not so original but in the end it's all about the execution and the fun and the interest.<br><br>Well, I think in this department 'Burnt' succeeds. The plot has some clever twists. The pace of the film is right and there are some great natural performances especially from the chameleon actress Sienna Miller and the always serious Daniel \"Nikki Lauda\" Brühl.<br><br>You wont get any cuisine lessons with this movie though. I know this is not the point, but other movies leave you with some knowledge and an increased interest about the special craft. What is that haute cuisine all about? We only get a glimpse of that. Something about 'Culinary Orgasms' but we never get to understand what this could actually be.<br><br>Overall: Not boring. Good Pace. Miller's and Brühl's performances are very good. Plus the movie itself is not ...fattening! (unless you eat a lot of popcorn!) So, What else do you need?","user":"Dr_Sagan","rank":[85,116]},{"title":"Visually appetizing, but bland taste","rating":6,"date":"5 January 2016","review":"Movies like burnt are so frustrating to watch and in cases like this, the fault almost always lies with the director and / or meddling producers. I am not 100% sure, but I believe that this script was on the black list and even if it was not it probably was damn good to attract the acting talent to such a project. The acting was well done (no pun intended) and none of the actors mailed in their performance. So why does the sum equal less than the parts?<br><br>In my reviews, I like to rate movies based on promise and delivery. The trailer is the promise and the viewing experience is the delivery. And I always try to give films the benefit of the doubt. Rating a movie a 1 or a 10, is not helpful to your fellow users.<br><br>When you decide to spend your valuable time and money on burnt, you know you're not getting a big budget, special effects extravaganza or a gripping whodunit. You want the movie to show you the inner workings of a kitchen, the struggle and cut throat atmosphere of creating and maintaining a top rated restaurant and some relationship drama that feels possibe. Doesn't have to be good will hunting emotion, but enough to keep us invested. The story and character motivations should never be so illogical or vague as to distract the viewer.<br><br>Burnt is not a complete misfire. I enjoyed the scenes in the restaurant kitchen, they were beautiful shots. And most of the scenes themselves were well acted, Bradley seemed invested in the role. The role actors also did an adequate job. The major problem was there was no real tension. The stakes never seemed remotely high.<br><br>SMALL SPOILERS: Bradley's character had a vague back story about drug abuse and wanting redemption, but he never seemed to really struggle. He vanishes from the restaurant scene after burning out, and then, after some self penance, he is able to finagle his way into running a brand new restaurant and in no time at all wins a Michelin star? There is some tension with the debt he owes, but you never feel worried because he could always borrow the money from the super rich Maître d'. And in the end his gorgeous ex waltzes in and pays it off?<br><br>You can tell as you watch the movie that there are some plot points that were probably compelling in the screenplay, but unfortunately just got lost in translation. I read that when the movie was edited, an actor's entire role was edited out. Maybe that was why the movie seemed kind of disjointed. Every genre of movie has fatal flaws. In niche genres like this, you never want your movie to feel \"like a day in the life\". It's a movie, give us some stakes. Burnt felt like I got a behind the scenes peek at running a top restaurant. If I wanted that I could watch a 30 minute Food Network show.<br><br>Final verdict: Bradley Coopers fans would enjoy. Otherwise, wait till it comes out NetFlix and you're bored one rainy night.<br><br>This question probably makes more sense in the forum section, but I find it an interesting parallel. Another food movie came out around the same time called Chef. It was marketed more as a family drama / feel good, subtle comedy. The main character also finds semi redemption by falling back in love with cooking, by going back to the basics after burning out. He also reconnects with his young son. I had the same after taste watching that movie. Cool scenes involving food, but no real stakes or unexpected turns. That movie, however, got stellar reviews. Sometimes I just do not understand professional movie critics at all.","user":"Jazzy31133","rank":[78,111]},{"title":"Predictable and shallow","rating":4,"date":"18 November 2019","review":"The only good thing about this movie is the theme. I love cooking, and I'm a foodie, so obviously the theme appealed to me. Unfortunately, this movie is predictable and shallow. Shame. I won't bother listing all the flaws. If you've seen it then you know what I mean.<br><br>I also just want to say: why in the hell would she kiss him after he grabbed her shirt and screamed in her face? For me, that would be the nail in the coffin on any possibility of a relationship. In fact, I found his behaviour throughout the whole movie to be completely over-the-top.","user":"schuwomann","rank":[6,6]}]