[{"title":"well researched, well executed, very emotional....a documentary you won't forget","rating":9,"date":"26 August 2013","review":"Being a martial artist (Kung Fu) myself I was very excited to watch this documentary. Although my expectations were high \"Drachenmädchen\" still managed to exceed them.<br><br>I've seen many documentaries about Kung Fu but this one was very unique as it does not just exhibit some monks during their training but shows what happens when you start to \"manufacture\" martial artists. \"Drachenmädchen\" was very well researched. The filmmakers really understood the problem and knew how to present it in a non-cheesy manner. The cinematography was amazing. There were lots of great shots and images I will never forget.<br><br>Basically there were two very different settings covered here. Most of the time we see the Shaolin Tagou Kung Fu School where you see interview with students, trainers and also the headmaster. The headmaster proudly presents us the school's principles. He explains that they are forming a harmonic society by educating their students physically, mentally and culturally.....with all means necessary. The second setting is the nearby Shaolin temple. There we see an interview with the monastery's abbot where he talks about his (the traditional) way of teaching Kung Fu.<br><br>It is shocking to see how far the Shaolin Tagou Kung Fu School's teaching methods and morals differ from the traditional ones from Shaolin Temple. Often times we see the school's headmaster explaining something and right after the end of his statement there is a cut to the Abbot saying the complete opposite. This harsh contrast is also illustrated by the areal shots. The vast and empty training grounds of the Shaolin Tagou Kung Fu School are visually compared to the temple's richly decorated pagoda. Another contrast we see in this documentary is the one between the militaryesque drill from the outside and the girl's still emotional inside. We also see that in some cases it is just the parents abandoning their children. What is also a big problem but not the focus of this film.<br><br>In conclusion \"Drachenmädchen\" is a brilliant, well made and very focused documentary you shouldn't miss; especially if you are a martial artist yourself. It offers a unique look on a problem that isn't often addressed. <br><br>+++Please excuse grammatical errors. I am not a native speaker, but due to IMDb's regulations reviews have to be written in English+++","user":"genji-hth-106-891191","rank":[17,19]},{"title":"Impressive reality","rating":9,"date":"23 September 2014","review":"Very very very impressive. I actually started to watch the film not from the beginning. While i was stressed by the amount of work, training, training, hard staff, hard conditions, and bright little girls, but then i've seen Shao Lin on their jackets. Everething became so clear.<br><br>You have not even a slice of idea how much hard work and how many training, how many overcoming and yet clear minds is there. Looking at 26 000 motivated all-day-training children to become best fighters in the world European and American mind would definitely obtain the new perspective on what hard work and true competition is. <br><br>Recommend to watch - if you don't like it - just turn it off in 30 minutes.","user":"erichkoff","rank":[4,8]},{"title":"Some after thoughts","rating":22,"date":"22 November 2018","review":"These are the inevitable thoughts when and after I watched this film:<br><br>-This documentary was well made.<br><br>-All of this young kids were from poor families, especially from the poor, rural Chinese villages. Rich kids' parents would never send their brats to such training school. In order to unburden the tough financial status of these lower class families, parents usually would send their kids to such free boarding schools.<br><br>-The so-called \"Kung Fu\", the traditional Chinese martial arts, in modern days MMA, is just a so-so fighting technique that sometimes proved to be inferior to other countries traditional martial arts. Most of the time, it's useless and pointless. Kids from such schools would never have the realistic and practical ways to make a decent living when they grow up and out of such schools.<br><br>-Such kind of schools in China is a subtle method to control the Chinese mass, especially the young kids from the lower class, the very poor, to force feed the disciplines to them, narrowing down their mind and body in order not to become criminals or rebellious anti-Communism members, and achieve the goal of a \"Stabilized\" society. These kind of schools is just another form of \"Reforming\" schools, some kind of concentration camps but in a milder but still very strict and harsh form. More like military training camps, what they are training are the very young kids.<br><br>-Taking notice of the terrible polluted air quality in China everywhere. The heavily PM 2.5 smog inhaled 24/7/365 year around by these kids. They won't have healthy lungs to perform, their potentials would be limited.<br><br>-Chinese Kung Fu in mass production? It's a false and pointless hope, a wishful Chinese way of thinking. I just feel sad for these kids.","user":"LogicIsEverything","rank":[0,5]}]