[{"title":"Echoes of Wong Kar Wai in this beautiful film","rating":9,"date":"8 August 2014","review":"Echoes of Wong Kar Wai resonate beautifully throughout this very moving and understated, and yet very funny film. It can be viewed as a study in grief and cross-cultural misunderstanding or even prejudice. Two people try to comes to terms with the death of the person they each love the most. They are on conflicting sides of desperate love triangle. Each seeks recognition, and each needs to place their love in, an unexpected, context. Each needs to be understood.<br><br>In many Wong Kar Wai films the actors speak to each other in different languages with seeming full understanding. It suggests a disjuncture between time, place and culture, where language, usually the unifying factor within the narrative, becomes the source of each character's isolation. Lilting is self-conscious in its language play and it works powerfully to both comic and emotional effect. This has the magic effect of bending time. Locations are practically sparse, but the film gives the feeling of having moved us quite literally around the world.<br><br>The film demonstrates that with translation, there is always something essential that is lost. This might be cultural sensitivity, the feeling that we understand when, actually, we do not. Thus, it questions the assumptions we all make. It might also be the feeling that we know something or someone when actually we do not.<br><br>This may sound a heady, difficult mix. Far from it.<br><br>The film is beautifully shot, and again we experience something of the camera work of Christopher Doyle (Wong Kar Wai's leading cinematographer) in the delicate and soft palate of colours, and subtlety of framing which are as evocative as the language play in evoking mood and location. Nothing is wasted in this film. Even landmark pieces of music (another Wong motif) sit perfectly within the cross cultural narrative.<br><br>This is a film I will watch again and not simply for the references to Wong Kar Wai, It's a seamless depiction of loss in a world of seeming falling borders.<br><br>I hope you enjoy the film as much as I have.","user":"dominic_brant","rank":[51,55]},{"title":"\"Lazy bitch\" and the amazing Ben Whishaw","rating":10,"date":"14 April 2015","review":"\"Lilting\" is a quiet study of two people at opposite ends of grief. After the sudden death of Kai (Andrew Leung) his boyfriend Richard (Ben Whishaw) is left to piece together the compartmentalized fragments of Kai's brief life. Single most among them, that Kai has left his mother, Junn (Pei Pei Chen), stranded in a rest home. Though Kai had kept his and Richard's relationship a secret from her, Richard nevertheless initiates contact with Junn. Meeting with her at the rest home he discovers that she has made an \"acquaintance\", Alan (Richard Bowles), with whom she shares no spoken language. Their relationship is based on sensations and a complete lack of any practical knowledge of one another. Seeing this Richard takes it upon himself to hire a translator, Vann (Naomi Christie). Richard tells Vann that Junn speaks six different languages, and that one of them is NOT English despite having lived for decades in London. Vann responds, \"lazy bitch\" and he responds with a pained smile, \"so selfish\". Those simple lines are filled with sympathy, awe, and irony. Richard and Vann fully comprehend this. With that they establish an on screen chemistry that is endearing and comforting. And that moment is the start of how this movie uses grief, loss, and profound sadness, to explain the absolute necessity of understanding the meaning of words - and the absolute irrelevance of the meaning of words. The trajectory of these two grieving souls, Richard and Junn, coming face to face, is now set. <br><br>Richard repeatedly extends himself to Junn in an effort to pick up where her son left off. Though his efforts are generous and from the heart, they are not without some self interest. When Richard is close to Junn he's close to someone who, though in a different way, loved Kai as much as he did. Through flashbacks we come to know that Richard had a healthier and less conflicted perception of Junn than did her son. Kai was afraid to explain fully who Richard was to his mother and she grew to imagine him as an impediment to her relationship with her son. And by bringing Junn and Alan together through a translator, Richard allows himself, once again, to be placed on the perimeter of Junn's life. It is the familiar place he was kept in when Kai was alive.<br><br>Junn searches Richards eyes trying to figure out who he is, why he is helping her, and what exactly her son meant to him. She hears him speaking English, but she searches his eyes for the real meaning that she knows is beyond the translated word. Richard holds back his own grief over Kai allowing Junn to be the grieved one. At one point Junn references a picture of Kai and Richard's emotions well up. Choking back tears and barely able to speak, he asks Junn, \"do you like living here?\" The disconnect of hearing such pointless chitchat from someone so emotionally devastated is jarring. Over and again, Richard chooses to suppress his grief. Junn has lost the only person in the world she loved. So has he. And she can't know.<br><br>Kai is never seen \"alive\" in this film. He appears in flashback as he is being remembered by either his mother or Richard. Because this is not known immediately to the audience, we go through our own experience of loss and grief as we come to realize that he is gone. The bedroom scenes with Richard and Kai are ethereal and touching. Breathtaking cinematography creates a halcyon beauty to their connection with one another. Filmed from one side of the bed, with light from the window on their skin, memory is implied. Filmed with the window in the background suggests reality. These bits are cut together, continuously, throughout the scene. The dialog sometimes comes from their mouths as though spoken and alternately in voice-over as though being remembered. It is genius, subtle, and very moving. And that is just one of the ways this film conveys the absence of the character around whom this story is being told. Connecting these related scenes and flashbacks are tableaux of cold gray skies, landscapes entombed in frost, leafless, lifeless, trees, and an underlying music score of haunting contemplative beauty. These winterscapes are the connective metaphor for death and loss that underlies this story.<br><br>The ocular interplay in this film is a whole separate script from the written dialog. It heightens the emotional dexterity of the narrative and is powerful in the hands of this cast. Listen with your ears, but watch everyone's eyes. Pei Pei Cheng's performance is astonishing. Especially to the \"English only\" ear. We experience her reality as she rails with grief and frustration in a language we don't understand. That is her life, every waking minute of every day, now that her only human connection to the world is gone. Naomi Christie is affable, sweet, and unselfishly torn between the separate worlds of Richard's and Junn's loss. But it is Ben Whishaw, who's character has to balance ALL these realities in this drama, who gives a shattering and achingly constrained performance. Only Richard knows where all the pieces of this tragedy puzzle are. And only he can reveal them or choke them back when, and if, the time is right. He carries the full weight of this sad story alone and you feel it, through him, deeply. A role as complex and multi-layered as this cannot be in lesser hands and be effective. Wishaw is just brilliant. He not only delivers a riveting but quiet performance, he also chooses his film projects intelligently. Which brings me to first-time writer/director Hong Kahou. He has written an original, and complicated screenplay, and executed it with masterful directing. More than telling you a story, he tells you a feeling. And it is one that will stay with you for some time. The sad but hopeful ending was a complete stunner. And in retrospect, perfect.","user":"hughman55","rank":[25,26]},{"title":"The problem of communication","rating":9,"date":"13 August 2014","review":"This is a gem. I wouldn't have watched it unless I had been taken. (Thank you, Beryle.) If it had been on TV, I might have watched some of it, but that is the joy of cinema. You have no distractions. I thought it might be depressing; it wasn't. I thought it wasn't my sort of film; it was. Thought-provoking.<br><br>It was easy to forget that you were watching actors. The performances were that good and very moving. It was very much like a French film.<br><br>It was interesting how much back-story was left out and yet it still worked. I asked myself a few questions because I wanted to know more. (Perhaps I felt I could help.) Where were we? (North-east London/Essex?) How long had she lived in England by depending on her husband and son for all communication with the outside world? What did people do for a living? Where did the translator come from and was she being paid? Without her son would she at last break out into the world? However I realised the back-story didn't matter. It told you all you needed to know. The nub was all that mattered: an insight into communication, memory and grief. Some things have to be said and some things are perhaps best left unsaid. The characters kept asking the translator not to translate after they had said something because they had time to see the effect it would have, (something that does not happen with a common language) but even the translator could not help but get involved.<br><br>You could speculate on a happier outcome but the final scene where she drifted back to the last meeting with her son perhaps indicated it would be a while yet before she could move on.<br><br>Very, very good.","user":"johnmcc150","rank":[38,42]}]