[{"title":"Don't Follow The Sheep On Here","rating":8,"date":"14 June 2014","review":"OK, I've signed up to IMDb just to comment on this Movie. First Off I'm not A Seth McFarlane Fan. I don't like Family Guy and I Thought Ted was Childish.( But I am over 40) So when I read the reviews on here I had to go and see this movie for myself. Nothing could be that bad (I thought): And I was right. There is nothing wrong with this Movie. Its never going to win an award but I don't imagine they thought it would. Its funny, the characters are likable and the actors are excellent.<br><br>It would appear that somebody wrote a bad review on here and as usual, The Sheep jumped on The band Wagon.<br><br>This is as good a comedy as any I've seen in the last few years and better than a lot I've seen in the last ten years. The story was good and kept me entertained throughout the Movie. It was crude in places but its Seth McFarlane Folks ! What did you expect?.<br><br>I was glad I went to see this and came out with a smile on my face. I understand that maybe Ted was aimed at an age group a lot younger than me, but I just didn't like it. However, I did like this movie. As I said at the start, don't follow The Sheep. Give this a go and you wont be disappointed.","user":"carlcasso","rank":[400,569]},{"title":"A good watch!","rating":7,"date":"9 September 2014","review":"I've sometimes enjoyed watching Family Guy and actually even enjoyed Ted. Reading the reviews on this movie made me not go see it in theaters, but I am satisfied with my choice to finally watch and to have given it a chance. Because of this, this is my first review posted on years of being on this site.<br><br>Seth knows his niche and the audience the directs his work towards. It was nice to have a genuinely funny movie that falls in line with the sense of humor I expected. <br><br>If you don't like his regular work, I don't recommend it, but if you do, you'll probably enjoy.","user":"vcollin6","rank":[31,42]},{"title":"Deserves a much better rating than what people have so far given","rating":10,"date":"5 June 2014","review":"I'll start off by saying I'm a huge Seth Macfarlane fan. I love Family Guy and American Dad (Cleveland show has its moments too!) Ted was also a great film in my opinion so I hoped this one would live up to my expectations and it did not disappoint. I feel it got a low ranking mainly from people who don't understand the sarcastic humour that was obviously apparent throughout. I thought the film was incredibly witty, extremely funny with constant laugh out loud moments and it also had a decent plot with some great acting from Seth himself (who would have known he was just as great in front of the camera?) The great cast showcases to me that people could see great potential in the script and all actors involved really held their own in making this film a brilliant comedy. PS this is the first review I've ever written and I registered specifically to help make the rating of this film more acceptable.","user":"dud_les","rank":[130,200]}]