[{"title":"Great","rating":10,"date":"16 February 2020","review":"One of the best romance movies I have ever seen and one of my favorite movies that I have ever seen. I loved the book and I loved the movie even more. The writing, plot, story, and screenplay were fantastic. Shaileen Woodley and Ansel Elgort's performances in the film as Hazel and Augustus were spectacular. The Fault in Our Stars is gorgeous, funny and sad at the same time and it shows true love can be found no matter what. Loved it so much.","user":"MR_Heraclius","rank":[42,43]},{"title":"Sad, But Incredibly Beautiful","rating":9,"date":"3 June 2014","review":"I went into this movie not having read the book and not knowing anything more than the overall plot. I am a sucker for a good love story, especially love that I can relate to. The pain and emotions felt by the characters felt so real, as if I was feeling the same emotions.<br><br>Though this was THE SADDEST movie I have ever seen, it was also one of the most beautiful, as it truly showed how exhilarating and comforting and exciting love is. <br><br>I probably cried throughout about half of the movie, along with the rest of the audience. I cried to the point of heaving out loud and needing more than the 2 tissues I came in with. Again, the actors really expressed the emotions of the characters well and I felt that. <br><br>I am going to see it again for sure.<br><br>GO SEE IT IF YOU LOVE EMOTIONAL MOVIES!","user":"kristinelizabeth1","rank":[272,356]},{"title":"A Beautiful Love Story: Going to love it for the longest of the infinity","rating":10,"date":"21 July 2014","review":"'Some infinities are bigger than other infinities' says my favorite quote from the movie (and the book) and its true because I am going to love this movie for the longest of the infinity. I am a huge fan of the book and one thing which really makes the movie stand out is an amazing performance by Shailene Woodley. She is outstanding in every scene she is and I have to say I am kind of in love with Hazel. Even though its a love story of a girl who has terminal cancer I wouldn't say that the film is tragic rather the film is about living your life to the fullest in your 'little infinity' If you have already read the book, the film is true to the book and the great acting, directing and music adds another dimension to the story. The Fault In Our Stars is definitely one of the best romantic movies ever. When you see this movie you are going to laugh and you are going to cry and when the end credit roles I can guarantee most of you are going to be completely in love with this love story.","user":"AniConrad","rank":[116,150]}]