[{"title":"Not Actually A War Movie","rating":9,"date":"19 March 2017","review":"This will be short and to the point. Billy Lynn's Long Halftime Walk is not a \"war movie\". It is not a propaganda picture about American Imperialism, it is not a recruitment poster, and it is most certainly not an action movie. War, in all its complexity, is incidental to this film. Billy Lynn just happens to be a soldier and the events that kick off the film happened at war. <br><br>This is a film about labels.<br><br>From the moment Billy is labeled a \"hero\" by the press for doing something he didn't have time to think about, his life is consumed. He comes a symbol to everyone he meets, even those who are supposed to love and know him best. <br><br>To the Army, he becomes a recruitment tool. They send him on tour to be the Face of the War despite accomplishing nothing more than anyone else in his unit.<br><br>To Hollywood, he becomes a character. A fiction to be utilized in winning more accolades for people who already have plenty of it.<br><br>To his admirers, he becomes a \"hero\". A walking uniform onto whom one can pin all their unfulfilled aspirations and unrealistic expectations. One whose hand they can shake and be freed of all responsibility.<br><br>To his sister, he becomes a victim. An unwilling pawn of an unjust war, no matter how he himself feels about it.<br><br>To everyone, Billy Lynn becomes everything except Billy Lynn. The flesh and blood and memories of the person disappears into the mystique of heroism, until the only people left who still see it are his fellow soldiers. And the only place left where he isn't a symbol, the war.<br><br>This is not a war movie. If that is what you are expecting, don't see it.","user":"ssunzhong","rank":[49,55]},{"title":"This movie is far more than anti-war.","rating":10,"date":"12 November 2016","review":"Many people said it is an anti-war movie,I don't think so. This movie is far more than anti-war.Because it is not a rich story ,but a rich truth and an emotion. It doesn't want to give you an opinion about what war is, but show you an emotion about a young man and a war. A so-called hero came back from Iraq, how is his life?<br><br>In the real world, the truth and emotion are complicated. So it is hard to say what its theme is. Maybe the theme is to doubt our fake society Maybe the theme is to show the hero's confused life. However, they are parts of this movie. It is more like a section of Billy's life. He has family,battle companion, stranger and girlfriends. Sometimes he is distracted at his important moment,sometims all in front of him remind him of war. He sees and thinks.He might find that life is difficult to choose,finally he go back to the place where he belongs.<br><br>If you can feel you are Billy Lynn, you can feel how ridiculous this society is.Nobody understands you,people see what they want to see.the sad thing is, you can change nothing but follow the direction of fate.<br><br>If you don't have sensory substitution,this movie is boring.<br><br>From the beginning of Billy's halftime show， I can't help crying. I even can't detail the reasons of my tears. The emotion is so strong, so complicate and so advanced. I feel so sad about Billy's life.<br><br>I think it is a good movie, not very fun, but revolutionary.","user":"wanglivalley","rank":[142,182]},{"title":"'The bullet's already been fired'","rating":10,"date":"28 February 2017","review":"Ben Johnson's novel has been exceptionally well adapted for the screen by Jean- Christophe Castelli and directed with the expected sensitivity of Ang Lee. It is a kick in the gut for those who see it – an anti-war statement placed in front of us as the never- ending wars in the Middle East continue to fester and destroy lives on all sides of the war zone and beyond. But it is also a biting statement about the time in which we live, a time when entertainment and gross spending of money is directed toward the insatiable appetite for big shows and stars and shallow moments of pleasure that appear to obsess us. The manner in which returning soldiers face 'instant glory' is overshadowed by the inherent bully-ism by a public that does not understand the cancer of war and how it metastasizes throughout our troubled planet.<br><br>The film is told from the point of view of 19-year-old private Billy Lynn (Joe Alwyn) who, along with his fellow soldiers in Bravo Squad (Garrett Hedlund, Arturo Castro, Mason Lee, Astro, Beau Knapp, Ismael Cruz Cordova, Barney Harris and Vin Diesel) becomes a hero after a harrowing Iraq battle and is brought home temporarily for a victory tour. Through flashbacks, culminating at the spectacular halftime show of the Thanksgiving Day football game in Dallas, Texas, the film reveals what really happened to the squad - contrasting the realities of the war with America's perceptions. Billy's family's response to his Silver Star heroism is conflicted with Billy's damaged sister Kathryn (Kristen Stewart) who pleads with Billy not to return for another tour in Iraq. Billy finds a possible entry to fame through a film about Bravo by Albert (Chris Tucker), thwarted by the wealthy insensitive would-be backer Norm (Steve Martin), an introduction to love by one of the Dallas cheerleaders Faison (Makenzie Leigh), and in the end, though disenchanted with America's reaction to what soldiers suffer in war zones, Billy makes the 'long halftime walk' back to his beloved buddies of Bravo as they prepare to return to duty. <br><br>The film seems all glitter on the surface until the inserted flashbacks of the realities of war in Iraq – a factor that makes the film even more poignant as an anti-war statement. This is a strong film that will move sensitive viewers – hopefully to action.","user":"gradyharp","rank":[36,50]}]