[{"title":"Sincere Historical Drama is Incomplete, Slow-Paced, & Dry","rating":27,"date":"27 January 2017","review":"The goal of the film was to put a human face on the tragedy of Guernica, the market town in Northern Spain that was destroyed by German bombers during the Spanish Civil War. Unfortunately, the romantic narrative was far-fetched, and the dialogue was often strained in this labored, slow-paced drama.<br><br>The filmmakers were successful in conveying the complexity of the Spanish Civil War. The opposition of the fascist \"loyalists\" supporting Franco versus the \"republicans,\" who were allied with Stalin, was well presented. But the film failed to convey the idealism of the Republicans. It was the passion of the Republicans to preserve their government against a military coup that captivated the world in the 1930s. Yet the passion was inexplicably missing in the film.<br><br>The main character was an American journalist named Howell, who was evidently modeled on the British writer George Steer who broke the story of the atrocities at Guernica. But Steer, along with other like-minded writers like Ernest Hemingway and George Orwell, also witnessed the passion of ordinary people resisting the forces of fascism in the 1930s. Where was the passion in this film?<br><br>The character of Teresa, who was a censor, was essential for demonstrating the uses of propaganda. But her character did not demonstrate to Howell why the cause of the Spanish Civil War was important in taking a stand against European fascism. The filmmakers seemed unaware of how important it was in the 1930s to resist another nation turning to fascism. That SHOULD have been the main focus of this drama.<br><br>In the final analysis, the romantic intrigue was not compelling or believable. And despite the beautiful photography of Northern Spain, the true soul of the nation was not captured in \"Guernica.\"","user":"lavatch","rank":[14,17]},{"title":"A horrifying episode of the Spanish history depicted carefully and emotively.","rating":8,"date":"9 October 2016","review":"Here in Spain, every time we see a movie about the Civil War the first thought is \"oh no, same old story\". Well, this is broken by this story made by Mr. Alba, Mr. Clavijo and Mr. Serra. Without paying attention to political issues, the film describes the happenings of that awful day of the bombs in Gernika through a love story and being respectful to the real events. It is wonderful to see a film carried out so carefully, with so much passion and looking for the spectator's heart. It is impossible not to see this movie without throwing a tear at the end. Furthermore, the Original Soundtrack is awesome, it lays under the story always making the perfect accompaniment; it is worth to listen to it while reading a book ;)","user":"ibarreno","rank":[11,13]},{"title":"A classic war drama","rating":7,"date":"2 August 2016","review":"Guernica could have been one of my all time favorites but unfortunately, as it happens too often these days, the culmination was badly executed. The first act is wonderful, a perfect setup for the upcoming events in the movie, with breathtaking cinematography, decent script and superb acting. The sets and the costumes were top notch, whoever could pull this off with 5 million deserves utmost respect. The first 30 minutes really feel like you're watching one of those great classics and I was pretty convinced that this movie is going to be ten star material. Unfortunately, as the movie progresses past the second act, it starts to lose its charms. The focus turns on the love story, which somehow manages to be underdeveloped, despite the huge screen time that it has. From there on, we have a cascading chain of blatant clichés which, combined with a final act that feels disjointed, really ruin the whole experience. Now if you pay attention, you'll notice that the final act is where we lose the German perspective. A scene on a bomber, a pilot reaction or even the German colonel watching the ongoing bombardment from a far would've kept this perspective alive and could've added some needed dramatic effect. Instead, the focus falls entirely on the events occurring in Guernica, which wouldn't be so bad if the whole act wasn't filled with severely overused clichés. All in all, this is a pretty decent war drama, which could've been something really special, had the writers come up with more original ideas.","user":"procletnic","rank":[35,49]}]