[{"title":"Mediocre story with great visual effects","rating":6,"date":"13 December 2016","review":"Tim Burton refused to direct this movie..and there is a reason..simply the script is terrible. There is no real and solid story behind this movie if not a marketing operation. The direction works well, nothing special but nothing you can complain about, also the rhythm and the storytelling works good, the problem is the script. The movie is visually stunning , probably visual effects are the only reason to watch this movie. Jhonny Deep is probably on his worst interpretation, he isn't able to transmit anything not even the madness of his character. Mia Wasikovska is the only one who truly believe in the project and tries to produce a decent interpretation. Sacha Baron Coen is funny on his character but maybe he could add more personality in his interpretation. As I already said you can watch this movie just for the amazing visual effects..but without a decent story isn't so entertaining","user":"Venom_81","rank":[24,28]},{"title":"Pretty much as sequels usually go...","rating":5,"date":"17 September 2016","review":"I enjoyed the 2010 \"Alice in Wonderland\" that had that unique Tim Burton touch to it. But I wasn't in any rush to get to see the 2016 sequel \"Alice: Through the Looking Glass\". Why? Well, because just what more could there be to tell about this story?<br><br>With that being said, then don't get me wrong. \"Alice: Through the Looking Glass\" is not a bad movie, it just seems like a movie that hardly was necessary to have been made. It is a good movie in itself, and works quite well as a stand-alone, if you will.<br><br>The effects in \"Alice: Through the Looking Glass\" were great, as they also were in the previous movie. And it was nice to see the beloved characters from the first movie return, and also to see the amazing job that the special effects team pulled off at bringing the world to life. Lots of details, vivid colors and memorable characters.<br><br>The actors and actresses in the movie were doing good jobs with their given roles, and it was a great treat to have the original cast return to play their characters once again. The Time character was interesting, but it left a less than savory taste in my mouth that they had cast Sacha Baron Cohen for this role. He is not an actor that I am too fond of, so in my opinion another cast would have been preferable. I do enjoy the Mad Hatter character and Johnny Depp does a great job in portraying him. And it was nice to get to see more of that quirky character and get to know more of his background.<br><br>The special effects and wardrobe teams really are the ones shining in this movie, because there are just so many wonderful things to look at throughout the movie. And the level of creativity is just astounding. No matter where you look there is something breathtaking.<br><br>\"Alice: Through the Looking Glass\" is certainly an entertaining movie, but it is hardly one that you will sit down and watch again any time soon.","user":"paul_haakonsen","rank":[32,44]},{"title":"I feel burned.","rating":2,"date":"27 May 2016","review":"I usually don't go in depth much about my thoughts on movies, and that's because in most cases, I feel like everything there is to say about a movie has already been said because so many people, not just critics, are able to voice their opinions now with the advent of social media. I also understand that it's very hard to make a movie, especially a good one, so I generally try not to give much attention to bad movies or waste my time and energy bashing them.<br><br>With \"Alice Through the Looking Glass,\" though, I feel like I have to put my opinion out there. I'm in the minority with this one in that I loved \"Wonderland\" and was incredibly excited to see \"Looking Glass.\" Having finally seen the movie, I'm really disappointed. I feel burned.<br><br>Tim Burton directed \"Alice in Wonderland\" but chose not to direct this one - in his place is James Bobin, director of the two most recent \"Muppets\" films (the first of which I thought was great, the second much less so but still fine). I think it would be unfair to put all of the blame on him, but he's certainly responsible for some of what went wrong here... as is screenwriter Linda Woolverton, who I almost can't believe is the same person who wrote \"Alice and Wonderland,\" \"Maleficent,\" and the original \"Beauty and the Beast.\" While her previous work is whimsical but subtle and sophisticated, \"Alice Through the Looking Glass\" is an uninspired mess, and I can't help but suspect that she really didn't care about this at all.<br><br>You know, it seems like almost no one involved in making this movie cared. Mia Wasikowska is probably the only member of the cast who deserves any praise, and I thought she did an even better job playing Alice here than she did in the first movie. Everyone else though, ESPECIALLY Johnny Depp and Anne Hathaway, should be embarrassed. Johnny's Mad Hatter was one of the best things about the first one, but here, he's just really weird and annoying. Like, super annoying...<br><br>I don't even think the composer, the usually amazing Danny Elfman, put forth much of an effort here. The score for \"Alice in Wonderland\" is one of my favorite scores for a movie ever, but it's like for this one, he thought he could just recycle the stuff he wrote for the first one and that no one would notice? Well, I did, Danny. I noticed.<br><br>The visual effects and production design are pretty great, as they should be, but you never get that sense of wonder or escapism that you should get with a movie like this because so much of the movie is just people standing around bantering or delivering boring exposition. The movie is loud and sometimes frantic but rarely fun or engaging. It's a major disappointment and a major step back from \"Alice in Wonderland\" and Disney's other recent live-action fairytale adaptations. It's just not good.","user":"ozfan08","rank":[141,234]}]