[{"title":"Great characters - but deeply lacking as an \"outbreak\" movie.","rating":5,"date":"25 April 2017","review":"A virus breaks out causing the infected to lose their faculties and attack the healthy. In a small American town two sisters try to survive on their own when their parents are locked outside the quarantine zone.<br><br>This film starts off really well. The two female leads are excellent, with strong engrossing characters. Watching them live their ordinary lives is great viewing. The relationship between the two sisters, one who is sexually active and the other not, is played out with great skill. As things start to head south they deal with the situation as best they can.<br><br>This is where my praise for the movie ends. You can actually hit the pause button and see the exact second where some company executive taps the director on the shoulder and says \"hey, bud, you remember this is a Sci-fi right?\"<br><br>The director and writers obviously weren't up for this. I think they probably asked the guy from the local comic book store for advice. As all the hard work and investment in the characters is thrown away to stick some ridiculous tentacles in - then try and pass it off with some very flaky biology.<br><br>I am a big fan of sci-fi, especially post apocalyptic stories. This fails to deliver on both accounts. Despite my tastes I would rather this had panned out as a coming of age movie.<br><br>Watch it for the characters, then turn it off to avoid the laughable appearance of the actual virus.","user":"thekarmicnomad","rank":[15,17]},{"title":"Had potential....","rating":3,"date":"14 April 2017","review":"Viral starts out interesting and compelling. Forget that it follows every cliché in the book concerning viral outbreak / zombie / infected films. Even the main character was likable. Until the events started to cause uproar and chaos. <br><br>Then suddenly cautious Emma Drakeford (Sofia Black-D'Elia) becomes a total idiot. What is the point of a mask if you keep removing it? I swear she keeps taking that damn thing off at moments where it was needed the most. That kind of stupidity is just infuriating. Her big sister Stacey Drakeford (Analeigh Tipton) is even worse who for some reason can't be bothered to care what is happening around her outside her little world. She gets bored by breaking news reports,warnings and presidential speeches about health care and safety measures. Instead she chooses to ignore what is happening not so far from her home and party instead. She even suggests her little sister shouldn't take things so seriously. Yeah, real good advice Stacey! Still I was fine with that since I was hoping that the film at least would give us something nice on the side to chew on. Like some real hair rising thrilling scenes or some bloody and gruesome action. But no, the jump scares are predictable to a tee. And the few scary or creepy moments that could have been terrifying are ruined by the severe lack of tension or dread. The whole movie suffers from not making it clear how dire the situation is. It relies too much on the imagination of the audience and in this case I find that unacceptable. The clicker zombies or infected sounded too much like the ones in video game Last of Us. I am not sure what to think of that. If directors Henry Joost and Ariel Schulman have borrowed or were heavily inspired by the fungal zombies of that game would it have hurt them to take it to next level and come with some of their own ideas thrown into the mix to make it more interesting? Predictable monsters are boring. So all you have to do is make them unpredictable to make it fun. These clickers were as scary as fluffy bunnies and cuddly bears.<br><br>I already wasted too many words on this since I can't tell you how disappointed I was. Viral had real potential. But nothing creative has been done to make this film stand out from the rest. If you have seen a million zombie / infected films like I have you expect more. This is a complete waste of your time. So do not watch this!","user":"chrichtonsworld","rank":[21,27]},{"title":"Great Little Non-Zombie Zombie Movie","rating":7,"date":"29 July 2016","review":"Did I have a good time watching this? Absolutely. Would I watch it again? Yep. Would I recommend it? Certainly.<br><br>If you don't nitpick it to death, this is an entertaining, well made, contagious critters in your blood movie. The actors all do a good job, some of the characters are memorable, the writing is fresh, the photography looks good, and the director knows his job. I wish more movies in this genre were this good.<br><br>As for those panning this movie, I'm glad I don't have to sit through watching a movie with them, or anything else, for that matter. They're probably the type who complain about everything but contribute nothing of their own.<br><br>The people who made this movie spent the money they had, and they spent it well. They ended up with an entertaining, scary movie about highly contagious blood borne parasites....nasty little buggers too, and I had a great time watching it.","user":"yossarian100","rank":[40,58]}]