[{"title":"Maybe overly ambitious, but still a spectacular expression of the artform","rating":7,"date":"14 June 2016","review":"This production is not for everyone, and I admit to not being particularly interested in the integrated video game / CGI type of fantasy sci-fi production myself, but this was interesting enough to warrant a watch, and I'm not regretting having done so.<br><br>Admittedly, the plot is rather clumsily constructed, which detracts somewhat from what this could have been.<br><br>Having said that though, the actual artistry committed to this creation is something to behold. <br><br>Having been confined to a relatively limited budget, this was an impressively ambitious effort, perhaps overly so, but it is visually a spectacular expression of the artform.<br><br>For me at least, Mélanie St-Pierre's character as Khara made the film. Without her, not sure how well this effort would have fared.<br><br>To be fair, this production starts out very strong, with Khara and her cadre of clonettes on board their warcraft, the inital scenes with the mysteroius Driud entity and it's wily cohort, prying their way into the AI core, the invasion battle scenes . . . but OK, no spoilers here.<br><br>But then, as the story begins to stretch out as a meandering journey through various travails, it just seems to lose steam along the way, with various action scenes tossed in as props to keep the excitement level artificially inflated.<br><br>By the ending scene (the film is divided into a series of acts), it just seems that the writing was getting tired, and just had to throw in the proverbial \"to be continued\" invading hordes of the whatevers as a sort of departing plot prop (no spoiler here, there are numerous other details not included in this description).<br><br>It's somewhat unfortunate, as there were several potential story threads and philosophical ponderings which could have been much more richly enabled and elaborated upon, but were left somewhat vacant.<br><br>Garm Wars is an interesting template which could be further developed, but definitely could benefit from more finely honed story crafting to match the remarkably rich visual motifs into which this template has been enmeshed.<br><br>I want to give its creators credit for a fascinating effort, and wouldn't be against seeing another, more well developed (and funded) effort in this direction.<br><br>I'm torn between a 6 and 7 rating . . . but am giving a benefit of a doubt, let's go with a 7.","user":"charles000","rank":[19,21]},{"title":"Visually beautiful","rating":7,"date":"29 February 2016","review":"I am a big fan of Mamoru's work. He has a specific style in which many aspects of the story are not explained. Here we have Final Fantasy like computer graphics with live actors and one Basset hound running around. Very unique vehicles, ships and armor design. Quite good action/battle scenes. But plot is hard to understand and should have more detail, it is hard to follow since you are dropped in the middle of entire culture clash with just scraps of information to go on.<br><br>I enjoyed it since it was like watching newer Final Fantasy movies, some scenes reminded me of Avalon (also Mamoru's work). And give it 7 out of 10 especially because of amazing graphics and fights scenes. Dialog could use improvement.","user":"nocpan","rank":[14,15]},{"title":"Live-action anime","rating":6,"date":"14 October 2015","review":"This seems to be an experiment in live-action-slash-CGI anime filmmaking. Visually creating that crossover in itself seems to take center stage, with the story coming in second.<br><br>At many points, the film succeeds beautifully in its proof-of-concept. The re-creation of anime-style scenes via live-action is often pretty startling.<br><br>I found the CGI integration a bit weak, probably due to the low budget. Although the 3D animations themselves were fairly impressive, their \"green screen\" blending with live actors and scenery was usually much too conspicuous. The authentic anime flavor was much more pronounced during scenes that used old-fashioned cinematography, lighting, and filter effects to evoke the feel of drawn Japanese animation cels. But when that did work, it really worked.<br><br>It also appears there wasn't enough left in the budget for certain transitional shots, resulting in a jerky pace.<br><br>I'm a fan of Lance Henriksen and Kevin Durand, and they do provide some substance to the characterization, but again this wasn't quite enough to make the story feel like it had real depth. This movie seems more about looks than anything else, but I think that was the intention. If this gets Mamoru Oshii some studio attention to pitch a similar but bigger-budget movie, we can probably call this a success.","user":"equazcion","rank":[24,28]}]