[{"title":"Pretty decent indie flick","rating":7,"date":"29 January 2014","review":"Well what can I say about this movie, first off I rarely watch low budget movies, in fact I didn't even realize that this was a low budget movie until I finished watching it and decided to take a peek at what people thought of it. <br><br>Wow what can I say a $40,000 budget is to me really simply amazing to come out with such a well done project, the movie is certainly not without flaws but the skills of all involved pull this micro budget off really well. <br><br>Bottom line is this movie is a very entertaining time killer and for it to be set on a plane and still keep you interested the whole way through takes some real skill to pull off, plot wise it's not the strongest script to hit the shelfs, but by far nothing worse than most Hollywood big budget movies.<br><br>My praise really is not so much the script (not that its bad) but the fact the director/actors and editing is so flawless, basically one of the better movies I've seen in the last 6 months and to find out it was done on a shoe string budget WOW!!","user":"stvb2009","rank":[22,27]},{"title":"Listen after the Credits are done!","rating":9,"date":"31 May 2014","review":"All of you reviewers have no clue do you? First of all this is one of the best movies made for such a low budget. Most of the acting is good and it kept our interest to the end.<br><br>Spoiler Alert : OK so we finished watching the movie and we ALWAYS watch thru the credits to see them to the end and the projector shuts off etc. What apparently NONE of you did was listen to the credits and when they were done rolling guess what? : What came from my theater setup was amazing! From one side to another side of the room was plane noise roaring ! And get this : A quick sound of tires hitting the ground for a normal touch down and safe landing (but was very brief!!) There you go! So next time before ranting and raving about no ending, sit thru the credits before you conclude your movie viewing time! Lesson Learned!!","user":"lewbr2002","rank":[23,29]},{"title":"Flight of confusion","rating":6,"date":"29 January 2014","review":"I've never taken time to write a review here on something along the lines of this type of film. I will hope that my attempts do not spoil this.<br><br>An unknown 727 flight with seven passengers on board who wake at nearly the same time. We are taken on a trip at 65,000 feet with these individuals who rather quickly expose their personality types and the view can easily see how each effects the outcome.<br><br>The Secretary of Transportation, Government Contractor, IT Expert, Master's Degree Student, Language Specialist, House-wife and a Truck Driver. Interesting, diversified group. What could they have in common?<br><br>Cole, the first to wake from his drug induced sleep, becomes the leader of the passengers and the misfit as he didn't belong to the \"group\". I liked his character and found him to be a believable individual and a likely leader due to his even temper and levelheadedness.<br><br>Sadly the strength of the other participants, to included the remaining three individuals, are weak, but are supported by a script that seems to be lacking depth. Confrontations are cold, unfeeling, unrealistic and even seem stiff at times.<br><br>The premise is a good one and one that I enjoyed. For a 90 minute film, it did keep me watching due to the story line and I was interested to see how it played out, although I had it nearly pegged about halfway through.<br><br>I believe it ended properly. In fact, I am happy that the director and writers decided to end the film the way it did. Had this ended any other way, I think it might have ruined what was already a not-so-great movie.<br><br>A watchable film and somewhat likable flick.","user":"hondo_sinclair","rank":[29,38]}]