[{"title":"definitely worth watching","rating":7,"date":"24 March 2013","review":"Ferguson is definitely my favourite late night show host. Right from the start, his tenure as Craig Killborn's successor amazed me. His wit, intelligence and improvisational ability makes him one of the funniest man on television. <br><br>In this special, Ferguson delivers his familiar style of riffing on bits about parenthood, addiction, Sean Connery, etc... Familiar themes, nothing groundbreaking and a bit safe, but still he delivers the laughs. <br><br>My only problem with the whole thing was his first routine on parenthood, I heard it all before (Jim Gaffigan, Louis C.K., Bill Cosby). These jokes felt familiar and tired. Still, this show is definitely worth watching. <br><br>I give a B- for the jokes and a A+ for the contagious personality and charismatic delivery.","user":"stephenmurphy-876-236498","rank":[7,9]},{"title":"More Good Laughs From Ferguson","rating":7,"date":"11 April 2013","review":"If you have seen his late night show or his other stand-up, you should have a pretty good idea of what Craig Ferguson is all about and what sort of jokes he is going to tell.<br><br>If you do not know, here is a sample: we learn about the hypothetical fat Brad Pitt, and how Jennifer Aniston could still be married to him today if she knew how to make (or purchase) better desserts.<br><br>We learn about Hitler having a nice butt and also having a talk show or NPR program wherein he discusses watercolors and vegetarianism.<br><br>And we get an impression of Mick Jagger as Buffalo Bill. What more could you want from a comedy show?","user":"gavin6942","rank":[3,6]},{"title":"Some good laughs.","rating":7,"date":"18 March 2019","review":"It's my first show from Craig Ferguson. I like offensive humor so when I read that he was not shy of a bit of sarcasm I was all up for it. The beginning was a bit slow and hesitating so I was not sure if it was going to be my kind of humor but the more the show advanced the better I liked it. Craig Ferguson is a bit of a slow starter but once he's on the move he's going full speed ahead with some good jokes and mimics, a bit of interacting with the audience but not that much. He isn't that offensive as Jim Jefferies, Ricky Gervais or Frankie Boyle but he'll manage to chock the easily offended. I will for sure watch his other shows.","user":"deloudelouvain","rank":[0,0]}]