[{"title":"Well worth seeing and much better than its current rating.","rating":7,"date":"7 April 2015","review":"I must say, I wasn't expecting much going into GIRL HOUSE. I was expecting your average, run-of-the-mill slasher film that didn't offer anything more than I've seen a hundred and one times before...but I was okay with that because I'm a dedicated horror fanatic. I grew up in the 80s. I love slasher films! Even the crappier ones. But thankfully, GIRL HOUSE was not crappy. Nor was it your average, run-of-the-mill slasher film. That's not to say it didn't have its faults, which is fine. I've only watched a handful of films that I feel are without fault.<br><br>The great opening sequence set the movie up nicely. I don't recall there ever being a dull moment throughout the film, so the pacing was very good. Of course there was a lot of nudity and that alone made moments that otherwise may have been dull, not dull. The acting was also much better than I expected. Everyone did a pretty good job. There was more blood than I thought there would be, and that's always a good thing. I don't want to say anything that may spoil something, so I'm gonna end this brief review shortly. I will say though, if you're a fan of slasher films, then you should see this at some point. You won't be disappointed. Even if you're not a fan of slasher films, you should still see it. Maybe you're a fan of nudity? I don't know. You could do much worse than GIRL HOUSE. Give it a shot.","user":"Reaper-of-Souls","rank":[31,40]},{"title":"Girl House","rating":8,"date":"10 July 2015","review":"\"Girl House\" has been called a slasher film for the digital age. The theme was done to death before the turn of the Millennium, though here there is a new twist, a couple of dudes are watching the carnage live on-line but are unable to warn the victims as one by one they are done to death by a disgruntled weirdo who has been driven into a frenzy by a cruel joke. Actually, it wasn't that cruel, but stranger things have happened in real life. In March 2014, a woman was given a 12 year sentence at Snaresbrook Crown Court after throwing acid in the face of a former friend. Mary Konye went to incredible lengths, disguising herself as an Orthodox Moslem woman, totally veiled, tailed her victim from the Underground station, and then attacked her. The motive was a throwaway remark that most people would have forgotten within a day or two if not an hour or two. Here it is not a remark but a caption on a photograph that unhinges a guy who although clearly highly intelligent is not exactly good looking, and is somewhat lacking in social skills, not to mention short tempered. <br><br>Okay, this dude is not just mad, he's insane because there are better things to do with a houseful of nubile young things than murder them, but if this tale has a moral it is never be unkind to anyone, even by accident. Or alternatively, once you knock the bad guy down with a golf club or a hockey stick, hit him again, and again, and again, and again...","user":"a_baron","rank":[13,17]},{"title":"A surprising slasher gem!","rating":8,"date":"14 March 2015","review":"I didn't have high hopes given the premise and thought it would be a cheap excuse to show more porn than actual horror, but boy was I wrong: as a fan of slashers, I can say this is quality stuff! There is some really slick direction going on in some scenes ala other films like You're Next where a scene will suddenly transition into slow motion during the action, the acting is surprisingly impressive given the fact these actresses had to be comfortable showing some skin at various parts of the movie (that usually tends to attract lesser-quality actresses), there is some nice tension, some great and inventive kills, and a truly hair-raising killer. The mask and outfit are crucial in a slasher film, and this one gets it right. The killer also runs (heck, he hauls butt at various points) and is physically foreboding, all adding up to a menacing villain. Treat yourself to one of the few good slashers to come along in quite some time because I know I enjoyed the heck out of myself with this one. P.S. The score is great, too!","user":"recklesscow","rank":[23,33]}]