[{"title":"Music effectively combats the ravages of Alzheimer's and dementia","rating":10,"date":"22 June 2014","review":"What if there were a truly inexpensive way to materially improve the lives of Alzheimer's sufferers and those who have other forms of dementia? If you see \"Alive Inside,\" you will discover that there is such a thing. All it takes is an Apple iPod and the right music--music from the person's past. The music makes a connection with portions of the brain least ravaged by neurological disorders and it connects with the person that's still alive inside. Really alive.<br><br>This film shows you the proof, over and over again. The demonstration of the power of music from a person's past being able to bring the person into the present seems irrefutable. It is miraculous but you won't believe unless you see the film.<br><br>To think that a $40 music player and headphones can do what drugs cannot is mindblowing. The music doesn't necessarily extend a person's life the way drugs do, but it does awaken the person. Patient after patient shown in this movie awakens as the camera watches. The effects and the repeatability are positively stunning.<br><br>This film is about to go into limited distribution. It will be showing in San Jose at the Camera 7 theater starting August 8. Please find a way to see this film. It will change lives.<br><br>We saw this movie as part of the San Jose Camera Cinema Club and it was one of the most moving films we've seen through this organization.","user":"steven-leibson","rank":[21,23]},{"title":"An important documentary","rating":9,"date":"27 December 2014","review":"How many times does one visit the nursing home? Feed the hungry? Or volunteer in any other way? It's an act of caring and giving that takes a lot to stomach. Many people these days, including myself try not to pay attention to these things because of how uncomfortable it is visually and physically see right in front of us. It's a quiet pity that we all hold and tend to push to the back of our minds. Hoping that all of our other daily tasks can distract us from such awkwardness. In some ways it's almost like today's generation is too embarrassed to acknowledge the issues and don't expect it to happen in our lifetime. When in fact, this is the exact opposite.<br><br>Now that's not to say when we get older, we will all develop alzheimer's and be put in nursing homes, but it's important to understand that it's also not the most uncommon of diseases like vitiligo or polio. Alzheimer's affects numerous elderly individuals and once it's diagnosed, there really isn't anything anyone can do from stopping it. However, one man has found a remedy to help slow it down, along with exposing various aspects of today's healthcare system. Dan Cohen (a public social worker) and filmmaker Michael Rossato-Bennett team up in this stunning documentary about how bringing music to alzheimer's patients can help bring back some, if not most of the life and soul of what used to be the youth of the early to mid 1900s.<br><br>There really isn't much to dispute about here. Both the writer/director and social worker duo demonstrate the power of music simply by putting headphones on the older folk. To watch them go from slumped over and quiet or mumbling to bouncing around and crying or laughing is astonishing. The results are phenomenal and it's quite honestly baffling because how come no one had ever thought of doing this before? You didn't even need iPods to figure this out; someone back in the late 1990s could have tried this with Walkmans or portable CD players. It all seems so obvious now and it's weird that no one considered this as a type of therapy. I mean, there are therapy dogs and other types of animals that are used to help jog patients' memories, so why not music? It's better than just feeding them pills and vitamins constantly everyday. Where's the enjoyment in that?<br><br>Perhaps the strangest thing of all is that even with all the positive results, the film crew displays continuous rejections from top authority figures in the healthcare system. It's tragic because who would deny such optimistic opportunities? Viewers should not only get a kick out of the end result to these amazing transformations but also how this particular story unfolds. The way this documentary is told, is by looking through the eyes of Dan Cohen when he first started trying this particular study. As time plays out, the viewer will see the struggles he had to face, the turndowns and even the surprises. An example of this would be how this particular film came to light. All it needed was to be released onto the internet and it got people motivated. I didn't even know about this until a friend of mine who plays in a group shared the link.<br><br>Another thing to think about are the possible futures that lie ahead for the currently old and the one's who will become old. Michael Rossato- Bennett brings into play how the number of elderly people have increased over time and if it continues at the same rate, there will be less supplies available to take care of them. It's a grim outlook if things aren't looked at carefully. As for the actual quality of filmmaking, it looks very good. Itaal Shur's musical composition perfectly blends in raw emotion and tenderness for each scene. Shachar Langlev's cinematography shows many POV shots giving viewers an idea of how bland and lifeless a nursing home looks like no matter how friendly the people who work there are.<br><br>This is perhaps the only drawback to this involving movie. It is a tad one-sided (although rightfully so for everything explained prior). But there are some things that aren't explored. For one, has there ever been a patient that was not willing to listen to music? Or has there ever been a patient willing to listen but it did not have the positive effect it had on so many others? These special scenarios would've been interesting to see as well. What would Dan Cohen's next step be to counter such a roadblock? These kinds of questions are important. Perhaps with a little more running time, the crew could have added that to this production. It is a very intellectual film that any viewer should watch because at some point, everyone gets old and just like Dennis Haysbert would ask from Allstate - \"Are you in good hands\"?<br><br>Aside from being a bit one-sided, this documentary explores the alternate avenue of fighting alzheimer's with the power of music. The provided information, music, patients and emotion are all authentic and it is exactly what makes this so uplifting to see.","user":"breakdownthatfilm-blogspot-com","rank":[9,9]},{"title":"a tremendous, moving experience, not to be missed","rating":10,"date":"30 July 2014","review":"\"Alive Inside\" is the work of director/writer Michael Rossato-Bennett and Dan Cohen, who is the founder of the nonprofit organization Music &amp; Memory. Cohen goes into nursing homes and sets patients up with ipods and earphones, and plays the patient's favorite music. This is sometimes learned from the family, sometimes from the patient, sometimes it's an educated guess.<br><br>The transformation in these patients is, I guarantee you, one of the most remarkable things you will ever see. It is pointed out that there is no medicine that can do this for these people, that they are overmedicated, and that the U.S. can save literally billions and billions of dollars by introducing this program into nursing homes. And it keeps elders out of those same nursing homes and with their families.<br><br>The music awakens memories in the person, it socializes them in a way they haven't been before, it calms them, it brings a smile to their faces. People who were sitting slumped over in a wheelchair not only begin to sing but dance. Truly remarkable.<br><br>The film shows one woman who has been cared by her husband for ten years without medication by playing her music for her.<br><br>I have never seen anything like this documentary, and it has really caught on with the public. A youtube video of one patient, Henry, went completely viral; the states of Wisconsin and Utah are adopting the program into all of their nursing homes, and the list of nursing homes incorporating Cohen's program is growing daily.<br><br>What Music &amp; Memory needs now are donations, headphones, and ipods. These are always a need, though I suspect once this documentary is released he will have much more support -- but he will also have a lot more interested nursing homes and people.<br><br>The idea is to not throw away our elderly, but to involve the younger generation so that they can receive the gifts these wonderful people have to offer.<br><br>Alive Inside is opening nationwide but only in some major cities. Hopefully this will be on demand on cable, and the DVD itself is going to become available. I urge you not to miss this incredible documentary. It will be a life-changing experience not only for you but for your loved ones.","user":"blanche-2","rank":[13,14]}]