[{"title":"Very good, consistent with the televised standard","rating":8,"date":"29 December 2012","review":"I watched this expecting just over an hour of hilarious, and occasionally fascinating material from the Top Gear lads. And it delivered. <br><br>Rather disappointing, Hammond was absent from the DVD, but Clarkson and May stepped up and delivered a brilliant DVD. We begin with as you'd imagine, some old, cheap cars that no one has ever heard of. At this point I was fearing the entire DVD would just be cheap cars of the past, but thankfully it changed. They explain that the worst car would be one that fails to deliver what is expected of it. And so the search begins. There were a couple of parts that were slightly disappointing, such as when they compared to 1970 American cars to a modern BMW, since they outcome was so predictable, yet it dragged on for 10 minutes. But other than this, the rest was brilliant, and well worth the money.","user":"grandmaster53","rank":[6,7]},{"title":"Better than usual for Clarkson's DVD","rating":10,"date":"13 January 2013","review":"By far the best of the \"Christmas DVDs\" Clarkson made lately. Little bit of top gear, little bit over the top, but May's presence made it better as Clarkson didn't push his metaphors beyond threshold of pain. (ie.: no Indian F1 driver, no ice skates/flippers, no diy rockets and so on...]) It is nothing as brilliant as Top Gear's F430-Zonda-GT, Carrera GT or SLR reviews, but it is nowhere as bad as the James Bond, Indian, Middle East specials. The mix of both presenters make the video nicely presented without either presenter nagging on for slightly too long and personally I like when May and Clarkson agree on the big things. As usual some nerds may get offended by remarks about Ford GT, Escort Cosworth and F50. ...and Panda gets crushed!!! I wasn't too keen on their view of X3 - which I think made a huge improvement from the last generation. (and everyone by now knows that BMW's idea of off-road is broken pavement or small curb)<br><br>All in all, I was pleasantly surprised.","user":"martin-tuky","rank":[7,9]},{"title":"This is very funny","rating":12,"date":"12 November 2019","review":"If you watch this for anything else than laughs dont bother, but for the laughs its bloody funny!","user":"IceCharon","rank":[0,0]}]