[{"title":"Not as good as I hoped it would be","rating":5,"date":"30 April 2014","review":"Mr. Jones is a relatively fresh take on the found footage format, with an intriguing premise which involves the occult and has a Lovecraftian vibe to it. <br><br>As a horror fan, I was at least hoping for something interesting, if not scary ('cause I think found footage films lost their touch a while ago). Unfortunately, the film fails to provide any thrills throughout its brief running time, and ends up being very annoying (especially in its second half).<br><br>Mr. Jones himself is probably the most interesting aspect of the film, and manages to build up a bit of tension with his appearance, but whenever he goes offscreen we're back to a flat, suspense-free movie. Both of the main characters were okay and acted quite well, but they were given very little backstory, thus ending up being unsympathetic. But hey, at least they weren't screaming all the time... <br><br>Another good thing about the movie is its somewhat captivating first half which is presented as a documentary about nature (though switches its main subject to mr. Jones when the main characters become aware of his presence). But the second half betrays its found footage format and turns into a trippy, nightmarish mess. It's an unwelcome change of pace because it tries too hard to scare and fails.<br><br>Anyway, if you're planning on watching it, lower your expectations considerably or you will be disappointed. If you don't like found footage horror films, or trippy experiences, then I suggest you skip it.","user":"alain-kapel5","rank":[30,37]},{"title":"Mr. Jones, Mr. Jones, Wake Up Now","rating":4,"date":"28 April 2014","review":"I will start off by saying that I'm a very big fan of found-footage horror. If this is already a genre you like too, then you'll probably enjoy the first half of this film. <br><br>If also you enjoy going on crazy acid trips (personally, I don't), then you'll also enjoy the second half.<br><br>My biggest criticism of Mr. Jones is that it is a very uneven film. Some of this is standard for the found-footage genre: starts off tame and ordinary and then escalates into something horrifying. Mr. Jones starts out as a story about a couple who move to a remote woodland location to make a nature documentary. When the documentary idea flops, the couple happen to stumble upon \"Mr. Jones' workshop.\" Penny -- half of the aforementioned couple - - is a photographer who is very familiar with the weird \"art pieces\" associated with Mr. Jones: bizarre totems mailed out to random people over the last few decades. No one knows who Mr. Jones is and Penny and Scott believe they have found him.<br><br>Here, the film becomes a documentary again. Scott goes to New York to interview \"Mr. Jones experts\": art curators, anthropologists, and supposed recipients of his \"art pieces.\" Meanwhile, Penny sets out photographing the totems out in the woods and records Mr. Jones (ceremonially?) setting them up.<br><br>If that had been the tone for the rest of the film -- mockumentary of couple profiling a potentially dangerous crazed weirdo engaged in some kind of bizarre folk magic -- that sounds like a pretty good film, right? Maybe half documentary, half couple panicking in the woods?<br><br>Alas, no such dream was produced. Instead, it turns out Mr. Jones' \"art pieces\" are a way to keep the \"dream world\" and our world separate. Penny and Scott disturb this balance and end up inside a literal nightmare. This ruined the film for me: earlier, the filmmakers took such care to establish a kind of verisimilitude in terms of who had cameras, how they were recording, etc. -- but then, in the \"dream world,\" Penny and Scott are seen from angles without any cameras. Because dreams, I guess? They run around and scream a lot for half an hour and then the film has some kind of vague \"full circle\" effect ending.<br><br>Perhaps as two separate films, they wouldn't be bad. It's the uneven genre and tone that spoils it, though. Clear found-footage / mockumentary for the first half, weird (definitely not found-footage) acid trip for the second.","user":"tyler-danger","rank":[15,18]},{"title":"Interesting and entertaining but not quiet a great film","rating":6,"date":"8 May 2014","review":"I am writing this after watching Mr Jones. I don't write many reviews, only about a dozen in a few years and only when something really interests me. Mr Jones falls into this category.<br><br>To begin with I found the introduction a little thin. A guy wants to create a nature documentary so uproots his life and with his girlfriend they go into some rural wilderness. So lets assume that they have the money to do this.... then what? There is no mention of a pending deal with a film distributer, and from what I can tell the 'wilderness' is not really wild; there is hardly anything that warrants a nature doco. And his girlfriend Penny is really going to put of her photography dreams for this!? As I said, thin.<br><br>We learn that the Scott is on 'meds' which he decides he doesn't want to take while out there, which causes him to become sullen and lazy, and his documentary falters.... until one day whilst filming some one dressed in what looks like black robes takes his bag and runs off. Does Scott chase him? Sure, but he has to get his girlfriend first! Together they break into the house of this person who after looking at some of his 'art' Penny identifies (without a doubt) that the person is the infamous and illusive Mr Jones, an mysterious artist from the 70's who created dozens of pieces and mails them to different people around the world.<br><br>Of course Scott believes her and takes off for NYC to interview a number of people with some knowledge of Mr Jones. Must be great being rich! Of course he leaves Penny there alone. I know I would knowing there is a strange man wondering around who makes strange 'art' and has already stolen from them, and knows they were in his basement.<br><br>From here the movie turns. The best way to describe it would be to possess the body of some one having an acid trip. Though experiences and those of others it is expressed that the art are Totems or Talismans and for some reason the characters who are sent the art start experiencing bizarre images and dreams. Wont say more as it would give away to much. The best comparison would be yellowbrickroad.<br><br>Premise aside the movie is quiet decent. The character of Penny is much easier to watch and care for then Scott who comes across as a pretentious selfish prat. The tone and atmosphere presented is very successful and I was brought into the movie. The overall direction is convoluted and a straight out film may have worked better then the handycam nonsense that hasn't worked for me since the The Last Exorcist (though Paranormal Activity 5 is a guilty pleasure). <br><br>Overall I give this film a 6.","user":"Michael_Takes","rank":[19,26]}]