[{"title":"Crime and characters explored in 1970's Australia.","rating":8,"date":"18 September 2015","review":"Cut Snake is the latest feature from Australian director Tony Ayers. I enjoyed his 2002 feature 'Walking on Water', and thought he was one to watch. Weaving between single dramas, mini series and feature films, Tony's latest Cut Snake is of interest for his name, and secondly for that of leading man Sullivan Stapleton. An actor on the rise, Sullivan has also been carving out a name for himself across different mediums, and he makes the most of his leading status, piercing the lens with his brooding frame and affect. It is at times a bold and shocking performance; one that elevates him, rightfully to leading status in this country. Alex Russell and Jessica De Gouw were both discoveries for me, and the former emerges with the more fleshed out and compelling character. It is beautifully designed and directed and an interesting interplay of genres and characterizations.","user":"david-rector-85092","rank":[15,16]},{"title":"An entertaining thriller... but it could have been more","rating":7,"date":"19 July 2015","review":"In many ways 'Cut Snake' is a wasted opportunity: it could have been a worthy social drama about how young men sent to prison cope with their prison history when they're out. Critical acclaim and award ceremonies would have followed. Instead, it's packed with macho violence, swearing and drag queens. So fewer filmsnob points, but probably more box office success.<br><br>It's Australia (in the 1970s, judging from the outfits). Ex-con 'Sparra' (the personable Alex Russell) is going straight and working in a broom factory when an old mucker from prison, 'Pommie' (Sullivan Stapleton) turns up. Pommie quickly inveigles his way into the home of Sparra and fiancée Paula, despite the former's reluctance - it is clear there is some prison-based connection between the pair, a connection Pommie is determined will continue. Meanwhile, his violent tendencies come to the fore.<br><br>Although it is fairly obvious early on what the connection is between Pommie and Sparra, this isn't explicitly stated until late in the film - meaning the viewer cannot be sure s/he fully understands Pommie and Sparra's motivations. But other aspects of the story rattle along at a fair old pace. As for the acting, Russell does well enough in portraying Sparra's confusion, but Stapleton seems so intent on channeling every one-note psycho who has ever featured on screen that by the time his big emotional scene rolls around it is hard to take him seriously. Still, caught as it is between the two genres of social drama and action thriller, 'Cut Snake' is an entertaining film and I would be happy to watch it again.","user":"euroGary","rank":[12,14]},{"title":"Unexpectedly New and Refreshing Crime Thriller","rating":8,"date":"16 October 2015","review":"Cut Snake is not your average/usual crime thriller. It is luckily much more. Somewhat based on the actual events that happened in Brisbane, Australia at The Whiskey A Go Go Night Club Fire that left 15 people dead in 1973. But the star attraction here is Sullivan Stapleton, known from 300:Rise of An Empire, Strike Back TV Series, Animal Kingdom and other movies and TV shows. He plays a testosterone filled criminal, full of anger and rage. He is most surely deserving of an award for his performance here. Sullivan's character is also a much more complex and not really what he seems to be at first. His character Pommie is an emotionally disturbed and hurt, character out of jail looking to rekindle with an old flame played by Alex Russell, that made a promise to him when they were in jail together. One of the surprises here is that both male leads are gay/bi and very masculine (unlike most false Hollywood characterization of a gay male being effeminate) Cut Snake will take you for a ride ( a good one at that) and leave you wanting more. Be sure to see it.","user":"aaronthompsonm-35140","rank":[14,19]}]