[{"title":"What lengths a mother would go to...","rating":7,"date":"20 April 2015","review":"The Harvest is a nice little thriller. I wouldn't call it horror though. At the beginning I even thought I was just watching another drama or so, because it starts all really slow and gentle, but after a while you start feeling there is something wrong with this family. Samantha Morton gave us a great performance playing her evil role. You start hating her at one point and that goes on until the end. Good job with her acting. Michael Shannon is like usual perfect in his role as well. I can't fault any other actor of this movie. They all did a good job. The story was well written with a slow start building up to a strong ending. Certainly worth a watch.","user":"deloudelouvain","rank":[36,44]},{"title":"The Harvest: Remarkable little thriller","rating":8,"date":"20 January 2018","review":"Settling in to bed for a movie I did my random pick and mix and was presented with The Harvest which was mistakenly advertised as a horror, I can assure you that it isn't. <br><br>Starring modern day Zod himself Michael Shannon it is a well constructed fascinating little mystery that tells the story of an ill child with his overbearing mother.<br><br>It's one of those films that I was drawn into but didn't know quite why, however was eager to find out just quite where it was going. <br><br>The pivotal reveal turns the tide of the movie, and I mean that in a good way. The story takes shape, the cast do a stellar job and this under the radar movie I'd never heard of actually succeeded in blowing me away.<br><br>I can't say much about The Harvest without ruining it, I will merely say this is a masterworks in filmmaking and though not flawless is still a highly impressive little film.<br><br>The Good:<br><br>Very well written<br><br>Performances are flawless<br><br>Perfectly paced<br><br>The Bad:<br><br>A couple of unanswered questions linger<br><br>Things I Learnt From This Movie:<br><br>Michael Shannon has one facial expression, I'm starting to think it's a mask","user":"Platypuschow","rank":[15,17]},{"title":"Great Thriller with Top-Notch Performances","rating":7,"date":"4 March 2016","review":"The girl Maryann (Natasha Calis) has just moved to the house of her Grandfather (Peter Fonda) and Grandmother (Leslie Lyles) in the countryside after losing her parents. She is lonely and misses her former friends and decides to wander around the area. She finds the secluded boy Andy (Charlie Tahan), who lives alone with his mother, the surgeon Dr. Katherine Young (Samantha Morton), and his father, the nurse Richard Young (Michael Shannon), in an isolated house. They immediately befriend each other and she enters in his room through the window to play video game with him since Andy depends on a wheelchair to locomote. On the next day, Maryann visits her new friend again and Richard let her in to play with Andy. On the next day, Katherine does not allow Maryann to visit her son and she goes to the house of her grandparents to forbid Maryann to visit her son. However Maryann insists on visiting Andy when his parents are absent; out of the blue, they return and Maryann is trapped inside the house. She goes to the basement expecting to find a way out and stumbles with a dark secret. What has Maryann discovered about Andy's creepy parents?<br><br>\"The Harvest\" is a great low-budget thriller with top-notch performances, highlighting Samantha Morton. The immediate impression is that there is a flaw when Maryann finds the truth and does not call the police. However, if she is not able to convince her grandparents, imagine the police department of a small town. The plot becomes predictable in a certain moment after the first plot point, but keeps the tension until the very end. My vote is seven.<br><br>Title (Brazil): \"A Ameaça\" (\"The Menace\")","user":"claudio_carvalho","rank":[16,19]}]