[{"title":"Utter pile of crap","rating":1,"date":"8 March 2013","review":"I read one of the shill reviews on here comparing this movie to Citizen Kane and the Godfather...LOL First the effects are just crap. There are scenes where everything just looks a 5 year-old's Photoshop project. I am not exaggerating. I'm not 100% sure but I think they recycle locations over and over(warehouse). The CGI looks like it's from the 90's and the interface on the monitors for the beam look like a little too simplistic for such a powerful device.<br><br>The acting is atrocious to the point of being annoying. The lines the actors were given are just as ridiculous. I'm of the mind that this was someone's idea of a joke.<br><br>The plot is so full of holes it's not even funny. I've seen better movies that portray this kind of disaster much better, Twister anyone? Save your time and money and pass this one over, or you'll regret it.","user":"viciousdeath","rank":[45,47]},{"title":"Not worth watching","rating":2,"date":"5 March 2013","review":"Hey no worries about writing a spoiler. 20 minutes of painful acting and storyline, I switched off as I could not be punished any longer. Why do they actually make films like these? They are a waste of money and the actors in these films will find it hard to get another job afterwards. As for the worst actor I have ever seen, Bryan Head should be re named Bryan foot. If he was my son I would have thrown him out of the car and let him die in the Storm. The winds are supposed to be 500 mph yet he is actually racing it in his 4X4. I did not know that a 4X4 can actually do such speeds. Woooowwwww. They must have made this film on a tight budget as I have not seen most of the other actors previously and about the only decent thing in the film is Casper Van Dien's wife. She is very pleasant to look at but again not much of an actress. Please do not bother watching it unless you like pain.","user":"wnourallah","rank":[50,57]},{"title":"awful","rating":1,"date":"14 March 2013","review":"let your enemies watch this movie. you will not be a suspect. because they will die of heart attack because the movie sucks big time! what the H is Casper doing in this crap. my 4th year class could make a better movie than this director. if there is lower than 1 rating, this will be the movie. WORST MOVIE EVER!!! i didn't even finished it because it's disgusting!! the CGI is like a grade school doing it. the actors sucks big time. the costumes, everything sucks in this movie. I could write all the invectives in this movie and it would not be enough to describe this terrible movie. It really sucks big time. I wonder why IMDb included this in there list.","user":"kepner_march","rank":[25,28]}]