[{"title":"\"Because good help is hard to find\"","rating":8,"date":"5 March 2014","review":"Nothing truly special or unusual: Just a really good crime drama that's a little too well-acted and realistic to be labeled a \"thriller.\" COLD COMES the NIGHT is grimly riveting and constantly leaves you wondering what will happen next. Some layers, twists, and reversals, but it's still very easy to follow and, therefore, may be a little too episodic and simple for some tastes.<br><br>CCN has a minimalistic low-budget appeal to it. We don't know a whole lot about the various players in the smaller town Mid-Atlantic setting. Nevertheless, it shows us all we really need to know. Violent, disturbing, but without cheap schlocky gore. I kept thinking, \"This is how real murders must look and, especially, sound.\" Alice Eve gives a plain yet memorable performance as Chloe, a tough but compassionate single mother who manages the sleazy motel where all the trouble starts. The other actors do likewise in their roles. The script and cinematography are similarly real. Nice ending. Good, fitting soundtrack too. Though it doesn't try for anything big, COLD COMES the NIGHT accomplishes all it sets out to do and is a very watchable little film.","user":"doug_park2001","rank":[26,28]},{"title":"It's Hard to find a good film, but this is one of them","rating":8,"date":"16 January 2014","review":"For me this movie was very moving from the beginning. I personally have never seen Alice Eve in a movie where she wasn't playing the \"hot\" girl for lack of a better term. Even in Big Nothing (which if you haven't seen I highly recommend), she was in a way set as the \"hot\" girl. Same as ATM for any of you fellow watch to many movie folk like myself.<br><br>From the get go she played a persona unlike any other I have seen her do so I was a bit skeptic going in. Hardly any making, acting very depressed and withdrawn from life. Her being withdrawn I believe was completely intention because it set up the characteristics needed for the 2nd half of the film.<br><br>Bryan Cranston was absolutely amazing in his portrayal of Topo. I have not seen a simple hit-man have such depth since iceman. Chloe hits it right on the head when she says \"What is a hit-man supposed to do when he is almost completely blind.\"<br><br>I followed the movie from beginning to end and the only slow spot that didn't quite jibe with me was the very last part of the film. Without giving away to much the ending I felt the fate of Topo was rather misplaced. A character that displayed so much finesse and ability, should have known someone that had a grudge for him in that town would be looking for him.<br><br>Fans of a good keep you guessing will love this movie and everyone else like it just as well. I suggest picking up and giving it a shot, so ENJOY!<br><br>rlyonsii.net","user":"rlyonsii","rank":[19,22]},{"title":"Entertaining","rating":7,"date":"17 January 2014","review":"Entertaining little movie. I can't come to any major complain in general. It was watchable and involving, had a very good pace and a convincing role of the lead criminal. Acting was fine. I also found the movie somehow natural and charming. I think that the director Tze Chun is a gifted filmmaker. My impression is that this movie wasn't made with some great budget, yet it is much more interesting than many blockbusters of the same genre, if you ask me. I also believe that Cold Comes the Night is a bit underrated on IMDb. So I can say I recommend this movie. My message to director would be - pretty nice work, keep on working!","user":"dusan-22","rank":[49,63]}]