[{"title":"Fantastic Fun","rating":10,"date":"20 August 2015","review":"A friend recommended this one to me, and it sat in my list for a good long while. But I started to watch it on impulse and found myself laughing so much. There were a few jokes that didn't work, but the overwhelming majority of them were brilliant, and overall this was the kind of offbeat comedy that I would rank up with Heathers...which obviously it took one or two inspirations from!<br><br>The performances are strong across the board, the dialogue is snappy and feels not only natural (which is amazing in such an almost surreal film at times), but also extremely clever. It's rare to find such a gem of a movie that is not only insightful and moving, but also hilarious and ridiculous. It never takes itself too seriously...just seriously enough to make you think, and then it's all fun again. But it does such an excellent job of everything that it's easy to love. You can easily forgive a couple of missed laughs when you end up laughing so much more, and even getting a little warm and fuzzy feeling. Not to mention hot guys all over the place!<br><br>At the end of the day, this not only deals with serious issues, but does it well and in a hilarious way. It raises questions that should be raised, and it's a lot of fun. I think this is a film that everyone should watch, because honestly it has the right idea in every way. Bravo.","user":"moonmonday","rank":[9,13]},{"title":"Nice Little Irreverent Surprise","rating":8,"date":"22 May 2015","review":"So to be honest, I was scared to watch this one (partly because I feel the descriptiveness of the previous reviews might lead me to believe they're fake). But since it was free on streaming Netflix I gave it a chance. I am very glad I did.<br><br>This movie won't be for everyone, but for those like me that like their comedy a little silly, a little cynical, and extra random, it's perfect. Imagine if John Waters directed the high school portions of Romey and Michelle's High School Reunion on a shoestring budget. This movie is what you get. The innocence and campiness of Hairspray mixed with the irreverence of his earlier work, perfectly combines with the random silly comic sensibilities of the lead actors. I was laughing almost the entire film.<br><br>True, there are a few jokes that fall flat. (Like a toilet scene that was predictable and just not well done.) But most of the jokes fly a million miles a second, and I'm already planning on watching it again to catch the jokes I missed. Sometimes a single strange side glance from one of the leads was enough to make me bust out laughing. Not to mention the actor playing Cassie could basically have a movie all about Cassie and I would watch it in a second.<br><br>The thing that really struck me about this movie though was its treatment of all the characters. Most silly low budget films like this lose their way in the third act when they try to learn a lesson or become serious. It often comes off incredibly insincere. That isn't the case with First Period. During the third act we learn more about the characters and all of them become very relatable. I even was shocked to find myself smiling sympathetically during a very tense conversation with Maggie and the main antagonist. It was surprisingly well done. Even though the movie is often cynical, crude, and relishes making fun of its characters, it never loses its heart and understanding that these are real characters who have real emotions and feelings.<br><br>I was shocked I loved this movie so much and will definitely be showing it to my boyfriend and friends for some late night laughs. Second Period anyone? \"You're welcome.\"","user":"toodarkpark-08049","rank":[8,12]},{"title":"I laughed, and I laughed, and I laughed....","rating":9,"date":"15 July 2015","review":"It's once in a blue moon that a film can make me have to stop laughing for a second because the back of my head is hurting and my cheeks feel like they are going to fall off. The evening started out as surfing Netflix with my boyfriend, how every excellent movie find goes nowadays, and without saying anything to me he picked this movie and we were off on what we thought was going to be an absolutely terrible film with low budget and zero laughs from the first 10 minutes. (Just really rocky, and you have to get a feel for the film.) Don't be fooled with this one though folks. About the time the teachers and school are starting to be introduced is when it really kicked into gear for me.<br><br>Written by and starring Brandon Alexander III, this man brings us a surpassing in hilarity parody of 80s teen satires that is wrapped up in the perfect amount of pizazz and sincerity that it comes off as a genuinely funny piece of work, and not another run of the mill independent comedy. The main character is most definitely the best thing about the movie. Cassandra \"Totally Rockin' Superstar Extraordinaire\" Glenn, You're Welcome, brings to the movie nothing but constant joke after joke, as the writer would have the best lines and character for himself. Sometimes jokes so quick and witty, others so slapstick that it juggles that laughing trigger in your mind to the point where you will be laughing carrying on into the next hilarious scene for all different reasons. <br><br>Yes, as with any film that tries really hard, not all the jokes are a hit. There are just some parts that are a bit awkward, and like I said it is very obvious they are trying really hard to pull all the laughs out of the audience they can get, which I usually hate, but hey, it totally works in this case! This is a completely joyous experience from beginning to end.<br><br>The supporting characters are all completely memorable and in their own skin as well. Maggie is an excellently portrayed best friend till the end by Dudley Beene. Though Alexander is the star, Beene brings his own flair and personality to the screen in the best way possible. The Heathers are snotty and unlikable, how they are supposed to be, but in that way likable. Their boyfriends even have a nice role as the misunderstood gay guys of the group, and their mother played by none other than Cassandra Peterson (Ms. Elvira) has heartfelt speeches the audience has heard a million times over in any teen drama with a positive message. All of it was great material to work with and the actors captured it perfectly.<br><br>An excellent comedy, more so if somewhat dark, somewhat raunchy, drag comedy is your thing. Even with low budget, there are scenes that feel more professional and put together than most blockbusters nowadays. I will definitely be watching this movie again soon, and will definitely be showing it to my friends.","user":"Dragoneyed363","rank":[12,20]}]