[{"title":"Not a bad slasher flick","rating":5,"date":"26 October 2016","review":"My quick rating - 4,8/10. You don't always have to reinvent the wheel to get noticed. This movie takes a typical slasher approach, minus any super-human powers ala Jason or Michael but just an everyday person turned killer by circumstances. I won't go to much into that since it is part of a twist or two but the killer (revealed early in the film) is pushed over the edge and hunts down a group of young adults that are taking a day off school to party. Nitpicking this film would be far too easy but if you just sit back and take in the old school slasher that it is, you won't be disappointed, well, not much that is. The kills are fairly mundane and don't get focused on gore, which is fine. The killer (Bill Oberst Jr.) is pretty convincing in his role, often letting his facial expressions do the talking. I will say the \"kids\" in this film all but one act pretty stereotypical but the goth chick steps out of the norm (scene is pretty funny, all I will say about that). Worth a watch for slasher fans but don't use this to try to recruit a newbie to the genre since it doesn't wow you at all. For a small budget and a lot of newcomers from cast and crew, this is nicely done.","user":"jackmeat","rank":[3,4]},{"title":"Underwhelming","rating":3,"date":"2 February 2019","review":"A film that tries hard and takes itself seriously but is far from being good. The plot is boring and typical, and the characters are uninteresting, especially the protagonist and the slasher. Not a fun slasher at all.","user":"adeleysim","rank":[1,1]},{"title":"Ditch Day Massacre a fun Slasher!","rating":8,"date":"20 July 2014","review":"So many horror movies today try to out gore the viewer, it's nice to see a horror movie that throw's you back to a time when the story, music and the actors made the film fun to watch. We see in many movies in varying genre that the hero and villain are clearly outlined. This is one of those movies that might leave you asking who is who.<br><br>Enter into the arena \"Ditch Day Massacre\" a slasher film that brings it and adds some of it's own little fun twists. The movie starts out like your old school slasher with a little back story and tragic events! Fast forward to a cute school girl with a dark secret and her nice looking boyfriend hiding out from dad! Folks are leaving so it's time to party like a bunch of high school kids right. Back at the school word goes out and some of the cool good looking kids are going to a fun ditch party. We have the good looking couple and the freaky friends that share that \"tension\" between them. Kind of standard I know, but it's a time honored formula that works for a reason.<br><br>When we see our villain, we get into it right away. Non stop action and I must note some really good lines. Bill Oberst Jr. really works it as the villain. He brings his talent and passion into the role like you wouldn't believe. He made me question if he was really a mad man with an ax or trying to get his own brand of justice. The music in the film goes with the scenes. The pace of the film starts out a bit slow but when it hit's the gas hold on. The mechanical effects are really sharp and nice to see that CGI hasn't taken over everything that we've seen on the screen today. The sound was really good and on mark to say the least.<br><br>With so many Horror movies out on the market it was nice to see a movie that was a joy to watch. This movies made me watch, listen, and pay attention for the little details in the movie. Kind of makes you sad that there are few movies that get it. This was a 1st time shot in the the Horror movie genre from the crew. I must admit for a 1st timer on the block they have lighting in a bottle. There are few movies out there that a must see. This is one of them. If you like horror movies and watch them for the fun the bring watch this film.","user":"bladeofstrife78","rank":[5,21]}]