[{"title":"Great movie","rating":10,"date":"5 January 2014","review":"Taken for Ransom/ Final Recourse is a thrilling drama about a wife (actress Tio Polo playing Brooke) who is driving her young son and gets into a car accident that results in the son's death. Brook then enters a deep depression as she can't get over being responsible for his death. She becomes unproductive at work and eventually is toxic for her young daughter and husband, who are already going through enough mourning their loss. Booke later get's kidnapped and held for ransom, until a couple of unexpected twists take the movie from good to great. Overall, the movie had the perfect amount of unpredictability and drama. I highly recommend it.","user":"atvbballrob","rank":[6,9]},{"title":"One of the more memorable TV movies of modern times - at last a positive message","rating":10,"date":"5 January 2014","review":"*** WARNING: THIS REVIEW CONTAINS SPOILERS!! ***<br><br>\"Final Recourse\" (aka \"Taken for Ransom\") is a superb movie -- I really enjoyed it and thought it had a great message.<br><br>It was extremely well acted, and the early part was very convincing about the deterioration of the woman played by Teri Polo (Brooke) after the tragedy with her son. Her decline and dissolution was heartbreaking to watch. You could feel for her, and it was a very convincing portrayal. In fact it made me uncomfortable, but not enough to turn away from the movie, and I pressed on.<br><br>I have to admit that the whole kidnapping part seemed like a setup almost from the get-go, and I was very suspicious of that. And it _really_ felt like a setup as soon as she met that kid in the next cell. But you never knew if it was a setup, you didn't have any proof, and there was always that nagging doubt, \"What if this is the real thing?\"<br><br>But it was odd because, you're thinking, \"These guys (the kidnappers) are not going to sit there and go to all that trouble with a victim.\" You figure they either kill them or get what they want. To go to all that trouble seemed like a lot.<br><br>But again, you kept going with it because of this sort of reverse suspension of disbelief.<br><br>Chazz Palminteri of course was great. And the attempted escapes were scary because you just didn't know what was going to happen.<br><br>When she came back with the authorities and there was no trace left, I was sort of puzzled because I kept thinking, maybe some higher criminal forces are at work here. I could envision that the mob or somebody swooped in and cleaned the place of all evidence, using bleach, etc. Just like in other movies and TV shows where that kind of thing is done. Maybe they cleaned up their tracks. Alternately, you wondered if she was in some sort of hallucinatory mode and she'd imagined the whole thing.<br><br>Then of course you see the husband and the assistant and you're thinking, \"Aha, affair.\" And you felt for Brooke as she found out that the two had visited the jewelry shop a few days earlier. And when she discovered the paintings, and that they hadn't been sold, contrary to what she'd been told, you couldn't help feeling that there was a sinister plot afoot -- that the husband and his lover had concocted this whole thing, maybe to kill her, or to get the ransom money in a deal with the crooks, or just to fake the whole thing to get the money, and then they'd run off and leave her with all the bills or whatever. At any rate, all roads pointed to evil intent.<br><br>When it was revealed at the end that the whole thing was an exercise in \"immersion therapy,\" that was a great conclusion and in fact the one that I think everybody would have wanted. I mean, if it had been me, I would have been incredibly angry, and in a sense you're wondering why Brooke isn't more enraged when she finds this out. She had a right to be angry at this \"kidnapping\" because the whole thing was dangerous at many points, including the imprisonment, everything -- someone could have gotten killed. (Oh, and during the kidnapping, when they took that guy out and shot him, you knew that was done to scare her. Same thing with when the kid said his father paid up but they were still keeping him to try to get more.)<br><br>But what a relief! And it's a great idea that you could shock someone out of their self-destructive stupor into finding the inner strength to fight a larger battle for survival. I'm guessing that was the message, and it came across loud and clear.<br><br>It was a nice thought of taking someone so distraught and destitute because of the family tragedy and shocking them out of that and mobilizing their inner strength because they have to fight to survive, which elevates them above their state of feeling sorry for themselves. In fact, in reality, that might be the only thing that would shock her out of the depths of such a tragedy with her son -- or let's say it would require something at that order of magnitude to give enough of a shock to mobilize her out of her state and back into being a capable human.<br><br>It was nice when the people at the end confessed their roles -- Chazz Palminteri as the well-meaning therapist, and probably most importantly, the assistant (Tia Carrere) as the one who had set this all up in an effort to help Brooke. And of course the father as being faithful and wanting nothing more than to help his wife. It's funny how you're thinking all these negative things like infidelity, collusion, co- conspiracy, criminal enterprise, blackmail, and all the rest, and it's all benign in purpose and motive.<br><br>So the father was trustworthy after all, and loyal, as was the assistant. And the therapist and his crew played their parts.<br><br>The overall message to me is that it's possible to rise up above the tragedies and downfalls of life and find strength to go on even after such great loss.<br><br>I will say that it's a movie that stays with you well after it's over, and the message will last a long time. I think the folks who made this movie did a great job, and it's a movie that adds something to the canon. It's more than entertainment. It has a positive, uplifting message. And I'm glad I had the chance to see it. It definitely adds something to my life.<br><br>A job well done. Kudos to the filmmakers, actors, and crew for creating a great and noble work of art.","user":"StevieeJay","rank":[6,10]},{"title":"Solid thriller","rating":8,"date":"7 July 2015","review":"This was a solid movie. The performances were good throughout. One weak actor can ruin a movie, but there were none. Teri Polo was very good in a difficult role. Chaz Palminteri is always compelling. He manages to bring honesty to every role and underplays beautifully. The writing was clever, and a nice departure from what normally passes as a thriller. The screenwriter did a nice job of conveying a lot without repetition. Good use of misdirection. I thought the score could have been better - it felt inserted at times. Most importantly, though, the story flowed well and accomplishes the key task of any film - it keeps the viewer wanting to know what will happen next.","user":"mensabyhalf","rank":[4,6]}]