[{"title":"Hi JJ Abrams And Kathleen Kennedy","rating":2,"date":"12 January 2020","review":"Thanks for your input and all the upvotes here.<br><br>Now back to reality and a review for us viewers and Star Wars fans:<br><br>The film is bad, as bad as the rest of the trilogy that was wholly unneeded and attempted to reboot the whole thing for Disney's kiddie demographic via copying what Lucas had done albeit with weak actors and actresses, no character development and cheap directing.<br><br>Face it: the dark side won. The emperor is back and can return anytime, Yoda is dead and his vision has been quashed and a Mary Sue is running around magically Mary Suing the universe. The minions of the dark side are deep inside Disney and Bad Robot headquarters and making a billion dollar a pop from their evil visions and hordes of lemmings pay it to them.<br><br>PS: I love the ignorant and the spammers constantly writing 'oh JJ fixed it.' WHO DO YOU THINK RUINED IT IN THE FIRST PLACE? Your beloved sith JJ was the director of 7 and producer of 8.","user":"hdmfsds","rank":[868,1]},{"title":"Capitalism/Materialism/Greed Strikes Again","rating":2,"date":"1 January 2020","review":"Let us be frank with one another okay? This film is not needed, the whole trilogy was unneeded,there is no rule that says that Star Wars or any film needs to be a trilogy.<br><br>Star Wars under Disney is a series looking for a reason to exist. Lucas, before he became a greedy sell-out, had a vision and an idea. he also had talent. The current crew are uniformly sad. There is no reason for the emo, masculine Mary Sue, fake clone or the impostor emperor to exist and they all require us to suspend disbelief anyway. The current gang has no story to tell.<br><br>This film is stitched together to plug the holes JJ and Disney themselves created.\nDo not watch it.","user":"wsigtbqtz","rank":[534,698]},{"title":"The RISE (???) of Skywalker","rating":2,"date":"5 January 2020","review":"The good:\nCinematography\nMusic<br><br>The bad:\nNo storyline. Palpatine came back somehow, was confronted by Rey and died again. It took her less than 2 minutes to finish him in the end all because dead Jedi suddenly decided to talk to her, comfort her she wasn't alone.<br><br>The ugly:\nPoe's speech before going into battle reminded me of every medieval movie I can remember. Then, 2 minutes later I saw a bunch of horses running across the deck of a Star Destroyer, freakin HORSES!<br><br>Rey dies (why??) then Ben resurrects her (how??), they kiss (why??) and then he dies (vanishes), how&amp;why??<br><br>The RISE of Skywalker?? The 2 last remaining Skywalkers DIE!! There is NO Skywalker left.<br><br>PLOT-BLACK-HOLES<br><br>I remember downloading the storyline of all 9 chapters 16 years ago. The final trilogy was supposed to be about Leia &amp; Han's kids, Luke's kids, a cloned version of Luke, a cloned version of Vader/Anakin and Luke eventually becoming the most powerful Jedi of all time after finally defeating the Sith in their ancient temple. The entire trilogy felt mystic, dark and after reading all 9 chapters the final 3 were undoubtedly going to be a \"save the best for last\" scenario. I am so disappointed. Star Wars is dead. Count me out.","user":"danielkanemusic","rank":[961,1]}]