[{"title":"Euro's Response To Big G The Correct One","rating":10,"date":"3 September 2013","review":"Scanning the world's books is just the tip of a double-edged sword representing the increasing domination power of Google and other Silicon Valley players. But copyright is copyright ... it takes precious time for an author or any creative artist to imagine a work, create it, edit it and copyright it. According to the movie, Google digitally hoovered up these books, did not ask proper copyright permission as presented by the writers' reps/library spokespersons featured in the movie, and avoided meting out due compensation to the copyright owners. If this is the case,why should Google pimp out the books for its own commercial purposes at some future time without proper compensation back to the content holders? Once you give up a data scan to another, you cannot put that genie back in the bottle. <br><br>One could see how smaller, niche collections might swallow the pitch on how Google's mother-of-all-xerox can enable whole world access to their tomes. And that's the dilemma -- access is a good thing, but at the expense of stiffing copyright owners. The unrealization of compensation for copyrighted material is one of publishing's most enduring plights. <br><br>The European response in the movie was pro-writers/copyright owners but ultimately against Google's questionable copyright actions -- and seems to be the thoughtful and correct one; the Google opponents reacted to all the right issues -- compensation, copyright permission, what is fair use, and the blanket giving of power to one organization.<br><br>Libraries can digitize their own collections and index/promote their abstracts to the internet. Each library can control its material, and writers have the right to get paid for use of their material.<br><br>This review is regarding this book-scanning project only, it is understood that many benefit from Google's other services. But the movie prompts taking sides. So much power cannot be given to one organization, especially now that we have seen it spread its tentacles outside of its core business search model, including building robot armies and controlling internet backbone. There will be no facet of life that Google does not have its hand in.","user":"cinerepo","rank":[26,36]},{"title":"incoherent paranoid","rating":3,"date":"31 August 2015","review":"This movie is a pastiche of paranoid insinuations about Google's book scanning project. It confuses legal debates around the Google book search settlement with the entire scanning project itself, but those are two different topics. In fact, by the time this film came out, the Settlement had been rejected and so the film was out of date. The book project is not a world brain. Google might be, who knows, but not because of its book project.<br><br>The film tries to create a connection with H. G. Wells' work from the early 20th century but the connection is just implied. And the point of the analogy is never made. It's just suggested that it's bad for us.<br><br>The filmmakers struggled to find visual material for a topic that isn't visually compelling. Some of its animations are just awful. The libraries are pretty. (Are they not \"global brains\"?) My point is simple: the film doesn't add up.","user":"berkeleyk","rank":[10,24]},{"title":"Order out of Chaos","rating":7,"date":"9 January 2019","review":"The main point is that the whole case was a hoax to force the Europe, China and Japan to scan their books and put on the internet to speed up the actual World Brain project because it would be a huge amount of work if Google has done it by itself. All data will be interconnected and All Seeing Eye will sharpen.","user":"abdulladif","rank":[1,1]}]