[{"title":"Fun and charming film doc about a cult hero","rating":6,"date":"27 June 2014","review":"Like the title of this documentary picks up on, Dick Miller is an actor that loads of people say 'hey it's that guy, fromsomething else'. Most people don't know his name but sure as hell know his face. That's because he appeared in loads and loads of films, mostly in smaller parts and tended to make an impression because he was always good value. Well, the good news is that now we have this film, so no one has any excuse for not knowing what this guy's name is again!<br><br>Miller started out acting for Roger Corman in the 50's, starring in cult classics like A Bucket of Blood, he carried on appearing in an array of exploitation flicks throughout the 70's, hit the mainstream in the 80's in the films of Joe Dante and has continued knocking them out until the present day. This good natured documentary recounts Miller's career and includes lots of clips from the films he starred in. It also focuses on the many people he worked with too. The clips are a lot of fun and showcase the variety of flicks Miller was involved in, his body of work is bound to include a several films you will have seen before and it certainly will also have a few you haven't even heard of. Miller himself is a great guy and someone who is a lot of fun to spend a little time with, he is accompanied mostly by his long term wife Lainie Miller, who I was shocked to discover played the stunningly gorgeous stripper in The Graduateoh yes indeed. On top of this we have several contributions from an array of other folks such as Corey Feldman, Fred Olen Ray and Mary Woronov, amongst many others. Overall, this is a fun, charming film biography. Even if you don't know much about Dick himself, give it a whirl anyway, you'll have a good time. Who's that guy? It's Dick Miller of course.","user":"Red-Barracuda","rank":[6,6]},{"title":"\"There's that guy\".","rating":8,"date":"29 December 2018","review":"A face so recognizable, most times appearing out of nowhere. There's something about Dick Miller that simply stays with you. No matter the role, large or small, lead or cameo, he just embodies the character. In doing so, the quality of the production is of no concern as he always manages to leave an impression in whatever he appears on; including this documentary. \"THAT GUY DICK MILLER\" is a wonderful, insightful and often humorous celebration on the personal life and acting career of journeyman, character actor Dick Miller.<br><br>From his beginnings in Roger Corman's AIP quickie, low-cost productions to the exploitation boom in the 70s under New World pictures, he became their good luck charm and then finding his way into mainly small parts in studio films of the 80s/90s. He was a face that seemed to pop up everywhere. We are provided with an entertaining, and endearing bunch of elastic interviews by family, friends, and fellow colleagues through to tidbits, film clips and home footage/photographs from his time in the industry.<br><br>Learning how he wasn't too interested in acting at first, showed the natural talent he became and why he was so well-liked around those he worked with to constantly pop up in so many films/TV shows throughout years. The structure's timeline does breeze by, where sometimes I think it becomes a little too focus discussing the film at hand, but still it stays interesting and never does forget who's the centre piece. Watching Dick Miller interacting with wife Lainie was pure delight, so was those moments in his house looking over movie memorabilia, reliving encounters/relationships and showing other talents (animation/illustrative art) which is hard not to be blown away by.<br><br>If you're a fan of Dick Miller (and who isn't?!), do not pass it up.","user":"lost-in-limbo","rank":[3,3]},{"title":"Excellent Look at Miller's Career","rating":12,"date":"12 October 2015","review":"That Guy Dick Miller (2014)<br><br>*** 1/2 (out of 4) <br><br>Excellent documentary on that character actor who you might recognize but not know his name. Dick Miller started his career working in Roger Corman pictures like A BUCKET OF BLOOD and THE LITTLE SHOP OF HORRORS and this here led to a fifty year career that had him working in exploitation pictures as well as horror and comedies. He became known to a new group of fans thanks to director Joe Dante putting him in all of his movies.<br><br>If you're a fan of Dick Miller then you're going to love this documentary as you really get to hear a complete history of his work in films as well as get a few nuggets about his personal life including his marriage to Lainie. Both Dick and Lainie are interviewed here so we get to hear about how he got into the business, how he met Roger Corman and how that meeting led to a long career in the business. We get clips from some of his most popular movies.<br><br>Best of all are the interviews. Not only are the Miller's on hand but we also get interviews with Corman, Dante, Steve Carner, David Del Valle, Julie Corman, Ernest Dickerson, Corey Feldman, Robert Forster, Jonathan Haze, Jack Hill, Leonard Maltin, Jonathan Kaplan, John Sayles, William Sadler, Fred Olen Ray and many, many more. All of them telling wonderful stories of how they met Miller, what it was like working with him and so much more. THAT GUY DICK MILLER was funded through a Kickstarter campaign and it was certainly money well spent.","user":"Michael_Elliott","rank":[3,3]}]