[{"title":"for once the academy got it right","rating":10,"date":"19 September 2018","review":"With all due respect to Eastwood's American Sniper, the academy actually got it right with this pick for best picture. Every actor and actress in this given the space to breathe life into characters, every monologue and dialogue hits like a ton of bricks, every scene tries to get towards some fundamental truth of human nature only to have the next scene undermine that character and that purported truth. It's amazing that in the era of comic book universe movies that something like this can get made at all. An absolute must see before you die movie.","user":"PIST-OFF","rank":[52,65]},{"title":"It's satire people!","rating":10,"date":"24 February 2015","review":"I have to say I am shocked and how many bad reviews I have seen on this site for this movie. It seems to me that the majority of moviegoers who have chosen to review here are only capable of viewing a movie at face value.<br><br>This movie is clearly a satirical look at Hollywood and the constant need to remain relevant in the entertainment industry.<br><br>I will admit that the film does appear unnecessarily \"artsy\" in places, but some Hollywood actors love being unnecessarily artsy as they think it gives them depth.<br><br>That was the entire point of this film, for Hollywood to turn the camera on itself and expose all of it's own crap.<br><br>What I took from this film is what I have always felt about Hollywood, which is also what I love about it. Actors are inherently insecure, which is why they choose to be in an industry where there is a need for constant approval. The actors who are worth their salt risk everything to entertain...us. For that they will forever have my respect.<br><br>Definitely worth watching and worthy of it's Best Picture Oscar.","user":"apbryant","rank":[737,1]},{"title":"True Definition Of A Masterpiece","rating":1,"date":"1 January 2015","review":"Whilst viewing 'Birdman', I spent the first hour of the film trying to decipher my emotions and opinions towards it, what I was watching was a weird, yet wonderful work of art. Truly though, 'Birdman' is a technical masterpiece. Michael Keaton has generally been undermined as an actor (despite a few notable roles as Batman or Beetlejuice) and has instead faced Hollywood picking more acclaimed and popular actors, 'Birdman' however might just be his ticket to an Oscar nomination, and possibly even a win, his performance is mesmerising. Alejandro González Iñárritu has created a truly spectacular character study that arguably features this year's strongest acting performances, alongside a well- executed script, booming soundtrack and a monumental achievement with cinematography from Emmanuel Lubezki in which he attempts a Hitchcockian approach, reminiscent of 'Rope', and displays the story through a seemingly single and unbroken sweeping shot. This is the true definition of a masterpiece.","user":"CalRhys","rank":[426,690]}]