[{"title":"No attempt to be a realistic war movie","rating":4,"date":"26 February 2013","review":"I am watching Company of Heroes presently. The story is set in the Battle of the Bulge period. The force on the attack are Americans. Normally in a war one uses the weapons of your own side. The \"sniper\" hero is carrying a post-war FN-49 rifle. It was first issued to a military unit in 1949. Another soldier in the unit was carrying a British issue Number IV Mark 1 or Mark 2 SMLE infantry rifle.<br><br>Their historical sins were not limited to the American unit. It may sound trivial, but the babe spends half the movie in pants. That may sound trivial but the Feuhrer forbade women to wear pants. She wouldn't go into a Nazi base in tight fitting slacks.<br><br>Well, you may think that's all trivial but that's just immediately ended the suspension of disbelief for me. It only gets worse from there. The plot is equally ludicrous. Let's just say that by the time the whole mess had happened, we have managed to run into a Russian who speaks excellent English and a British bar brawler who both save the day in their own way.<br><br>So, is it a \"stay away\" movie? No. If you REALLY need something to soothe your craving for some violence or a 21st Century politically correct WW II movie, this will fit the bill quite well. But that's about all.","user":"mike-ryan455","rank":[76,89]},{"title":"where's Capt. Dye when you need him?","rating":4,"date":"2 March 2013","review":"With seasoned war film veterans this film really disappoints. Mainly because of the 1990's CGI effects and not being realistic. <br><br>They use several clichés; unlimited ammo, inaccurate spraying of bullets when they shoot they're machine pistols, guys falling BEFORE the shot hits, and they fall several meters when they get shot, the Russians and the Germans speaks perfectly good English. <br><br>I don't know how much Jürgen Prochnow got to play a part in this movie, judging by his acting, not enough...<br><br>The only good thing is that that you get to see Vinnie being Vinne and beats up several guys on his own, which would be expected. <br><br>A lot of not great acting in this movie..","user":"smaaback","rank":[42,50]},{"title":"Could have been much better with simple Director changes","rating":5,"date":"15 February 2013","review":"On viewing this film I was excited by the cast. As a fan of both Saving Private Ryan and Band of Brothers seeing cast members from both made me giddy with anticipation on watching the film.<br><br>All in all the film story is quite good - I liked it. The acting is fine on most parts as you would expect from the cast - lets face it, several of the cast crew are more than qualified to fulfil their roles.<br><br>I cannot believe the annoyance allowed to be taken over by this film by the dull and out of place sound effects and music - music being my main gripe. What on earth was the sound production crew doing? If you watch any good war film dating back to the 40's the music is not the bug of any film, until I saw this. There was absolutely no need for the music over the scenes, it made the film feel cheap (OK it is low budget) where no music would had made it feel realistic. The sounds of tank movements, back ground noise, shots, explosions would have made this film feel 200 times better rather than the music. Why? The sound effects ruin the picture and atmosphere.<br><br>In general, the effects on video are OK. If there was a way to improve this picture just leave the voices in, delete pretty much all music and replace with sound effects. Score would then be an 8/10 (for a low budget film).<br><br>I am at a loss why the hell the director commissioned the music.<br><br>This could probably be sorted with someone with skill re-recording the sound. It takes away \"the edge\".","user":"Sharpe528","rank":[113,146]}]