[{"title":"Yawn","rating":3,"date":"5 September 2014","review":"A troop of actors gather together in an isolated Gothic mansion in autumnal Pennsylvania to rehearse a play. The play is as Gothic as the setting and centres around the romantic and murderous intrigues surrounding a medieval Transylvanian merchant's family. Cue the actors being unable to differentiate the play from reality, a cursed book, assorted gypsies, witches, vampires, slow motion running in forests, killer hounds and other assorted hokum. It isn't bad. It's just run of the mill - which is worse. A shame really as, given the unusual premise, in more creative hands it could have been much better. On the plus side it does have Justine Griffiths who would look good even reading a telephone directory, which in this case might be more engaging.","user":"nabokov95","rank":[15,17]},{"title":"Boring and uneventful...","rating":3,"date":"9 September 2014","review":"I sat down to watch \"Kantemir\" solely because Robert Englund was in this movie. But not even this iconic horror legend could do much to salvage the sinking wreck that was \"Kantemir\".<br><br>The story is about a group of actors and actresses coming to a secluded mansion to perform in an act. They haven't been shown the script and have little idea what they are about to embark on. When the mysterious director show up with a strange book, the boundaries between play act and reality becomes a blur, and what might be a story is all but too real.<br><br>Right, well the storyline didn't really offer much of anything. Sure it had potential, but it was just not skillfully utilized much less so brought to the screen. If they had opted to go another way with the script, or had a different set of creative minds at work, it might have been something much more enjoyable to witness.<br><br>The storyline was dragging the movie down, but the who feel of the movie wasn't working in favor of the movie either. You just don't really buy into the storyline of the movie at any point during the length of the feature, and it seemed that some of the acting talents didn't either.<br><br>Granted that Robert Englund was the one pulling the load here, the rest of the cast weren't really anything memorable.<br><br>For a horror and/or thriller movie, then \"Kantemir\" was frightfully devoid of anything that would even put the audience on the edge of their seats. Everything was too scripted, too forced and too unnatural on the screen.<br><br>\"Kantemir\" scores a meager 3 out of 10 stars from me. I have seen worse horror movies, but this wasn't just anything extraordinary. Your money and time is better spent elsewhere, unless you are a die-hard fan of Robert Englund.","user":"paul_haakonsen","rank":[7,7]},{"title":"Good-looking but very tedious, with a waste of Robert Englund's talents","rating":3,"date":"4 September 2015","review":"Robert Englund, whose Freddy Krueger in Nightmare on Elm Street is rightly one of horror's most iconic characters, was my main reason for seeing Kantemir. He has been in quite a number of stinkers or not-so-good movies in recent years, but always gives his all no matter what.<br><br>Kantemir does have a few good things in its favour. It does look good (which to be honest was not expected, considering the reputation with low-budget movies looking cheap or even amateurish) with a real Gothic charm, some real atmosphere in the lighting, clever use of colours and photography that seldom looks cheap. It also has a good music score that sets the mood very nicely.<br><br>Unfortunately, that is where the redeeming qualities for Kantemir end. One does have to credit Englund for playing a role different to usual, for him this is restrained stuff, and shows that he does have more to him than having a wormy character, and although he does give the movie's best performance his underwritten role and very cliché dialogue is quite frankly beneath him and although he does try, he is somewhat too reserved and doesn't do anything to distinguish what he's been given (which is in all honesty worthless for any actor with any talent). The very less known names are no better, Justine Griffiths looks pretty but phones it in and there is a lot of forced overacting, Daniel Gadi's overplayed smugness is particularly annoying. The characters have no development and just as little personality, they are just there.<br><br>The script is incredibly hackneyed and never sounds natural and with an increasing lack of rhythm. Even more of a problem is the story, which has to be the movie's biggest problem, there is very little to it, often it is uneventful, and much of it is very tedious with no suspense whatsoever and just as little mystery. A decent idea, quite a unique premise considering the budget, but with nothing of note done with it.<br><br>Overall, looks good but very dull stuff and does nothing with Englund's talents, which is unforgivable really. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,4]}]