[{"title":"Not a Typical Jackie and I Liked It","rating":7,"date":"19 April 2014","review":"The reviews I have seen that rate this really low mostly have the same complaints. \"Not enough action,\" Not enough humor.\" Personally I liked the fact that Jackie is going in a different direction. He is admitting that he's getting older. Instead of pretending he can still kick ass like when he was 30 ( *cough* Stallone, Schwarzenegger *cough* ) he is following more in the steps of Clint Eastwood. <br><br>In a way he reminded me of Robin Williams. When Robin gives up his clown persona and makes a movie like One Hour Photo, he shows he can really act. Well Jackie is moving away from his Kung Fu Clown persona and relying more on his acting. And he's showing that he has the chops. <br><br>I originally rated this movie higher, because I was unfairly judging it as a Jackie Chan movie.But I changed my score to a seven because I think that is a more objective rating. The movie does have some problems with the script, directing and editing. But it is by no means horrible. Perhaps some of the problems could have been fixed with a bigger budget. But then again, Hollywood size budgets are certainly no guarantee of quality either. <br><br>In short. If you do not require constant impractical martial arts action, or silly slapstick, then you will enjoy this for what it is. An action-drama, with enough action to satisfy your blood lust, but also an attempt at telling an interesting story.","user":"libraryguru","rank":[18,20]},{"title":"Heroic and Bravery of Man not by using mere action","rating":28,"date":"28 December 2013","review":"We had seen Jackie doing incredible stunts in his career and it is time for him to move on doing something different. While the movie opening was quite loose and uninteresting, as the story slowly unfolds, it captured my heart and emotions. I must admit that Jackie actually act better than many action stars. I personally think that he has quite successfully transform himself to an actor not merely good at action but convincing in his role as well. This is not the usual good-and-bad-guy movie, and fighting scene is really minimal. There are many moments in this movie that clearly demonstrates a bravery of man and heroic act without expressing though action scenes with huge budget and CGI. It is so natural that fighting is really unnecessary in this movie. I am happy that Jackie has found a new way to blend his action talent with drama, only if the script is good, and this is a better one than Shinjuku Incident.","user":"garywongkleek","rank":[31,39]},{"title":"Amazing Film! (Except For The Editing)","rating":8,"date":"14 February 2014","review":"This movie was great! Bottom line it is nothing groundbreaking but it kept me entertained the whole way through! I'll start with the positive first! The story I thought was great, the characters were awesome, the setting was awesome, action was awesome (although its nothing as crazy what were used to from Chan for the type of film the fight scenes are very well suited) and best of all I thought Jackie did an amazing job at being serious and exploring different areas.<br><br>the only things that were negative about it was surprisingly THE EDITING.<br><br>The editor tried way to hard to make it fast and crazy (this was only for the action scenes, most notably in the car chase scenes), but the truth is, it is just way to damn fast, the cuts are incredibly fast and also you can notice tons of jump cuts (look that up if you don't know what that is) which as many filmmakers know is a no no, on top of that too I love the fact that things happened throughout the film that trick you and it turns out its just an alternate scenario, but there are some pretty cheesy editing going on here sometimes for example when they freeze the frame (to me this felt extremely amateurish.<br><br>My final conclusion I cannot stress enough how much the editing bothered me, and about 10 percent of the special effects shown. I am literally serious but if the editing was great then this would be an easy 10/10 for me, there honestly isn't anything at all I didn't like about it other than the editing overall.","user":"Adam_venedam","rank":[20,26]}]