[{"title":"Surprised that this film is great indeed for kids and adults too.","rating":10,"date":"27 September 2015","review":"Hotel Transylvania 2 is a 2015 American 3D computer animated fantasy-comedy film. The film is the sequel to the 2012 film Hotel Transylvania.<br><br>Hotel Transylvania 2 takes place seven years after the first film, with the hotel now open to human guests. Mavis and Johnny have a young son named Dennis, whose lack of any vampire abilities worries his grandfather Dracula. When Mavis and Johnny go on a visit to Johnny's parents, Dracula calls his friends to help him make Dennis a vampire. However, an unexpected visit from Dracula's old-school human-hating dad, Vlad soon turns things upside-down.<br><br>As an adult,I quite enjoyed watching this excellent movie. If you are looking for real Comedy/Adventure movie with perfect action from start to finish,then you should see this masterpiece movie.","user":"basilbenaz","rank":[97,134]},{"title":"Number 1 movie in most countries.","rating":10,"date":"6 October 2015","review":"\"Hotel Transylvania\" is truly an excellent family movie with all elements of success included: good script,perfect entertainment,wonderful direction and great comedy.<br><br>I saw it with my girlfriend after hearing this film has been achieving international success.<br><br>Honestly \"Hotel Transylvania\" was extremely funny for adults and the movie theater was crowded. People were looking for a real comedy that would make them forget their own problems and the movie was absolutely hilarious from the beginning till the end.<br><br>The voice acting was stunning and honestly this lovely film is worth seeing for all ages,you will move into another fantastic world for 90 minutes.<br><br>I am not surprised at all why this movie has been number 1 in most counties around the world.<br><br>Well Done!.","user":"olalara","rank":[81,115]},{"title":"Not As Good As the Original But Fun!","rating":8,"date":"5 October 2015","review":"It is not as good as the original. But it is still very funny. And really shows Adam Sandler who has starred in some flops recently, still has his charm as Dracula.<br><br>With his girl now grown up and married Mavis to human Johnny. Played respectively by Selena Gomez and Andy Samberg. As they become parents later on to a boy named Dennis. With curly red hair and Dracula hopes he becomes a vampire like his grandfather.<br><br>In order to prove he is a vampire with his only child and son in law to visit his human grandparents, Dracula and friends like Frankenstein must take off with young Dennis, without Mavis knowing about it.<br><br>Mavis gets to discover a bit of the outside world along with doing things that she never did like ride a bicycle or drink slur pees. Much to Johnny's amusement.<br><br>Still it is about accepting people no matter what in their hearts. Not just with words. There is a \"cameo\" with Mel Brooks as Dracula's estranged father. <br><br>Not as good as the first one but still fun.","user":"ShelbyTMItchell","rank":[17,21]}]