[{"title":"Great movie of 1D","rating":10,"date":"28 May 2014","review":"I really love the movie because first I am a big fan of this boy band and I really like them, the another reason for I like the movie its because in this movie we can see the life of the boys of the band, for example his houses and his family's, another reason is that in this movie we can see his concerts of his world tour called take my home tour and really I like this because they have never come to Venezuela, because of this I have not had the opportunity to see them in a concert in alive, other thing that we can see in the movie its all that happens in backstage (for example things like them playing and fleeing of the security guards,they practicing for his concerts, they mitting his fans in the meet and greet from his concerts and another things), also it is possible to see many of his interviews,all the country's that they visit around the world like Japan, Spain, Italy, Mexico, etc. For these reasons really I like the movie and I think that Morgan Spurlock (the director) and all his team did a really good work.","user":"alejandra302000","rank":[6,6]},{"title":"Brilliant","rating":10,"date":"30 December 2013","review":"Okay, so I'm a massive directioner, I can understand why people are commenting saying they do not like it because it is about a boy band whose fans in general are teenagers like themselves. I don't understand though why people are commenting saying its sh*t and a waste of time, surely if they think so strongly that way, they would of realised near enough at the start of the film if it was for them or not, and if they decide it wasn't then go and 'make better use of the your time' I think that it is a perfect film for directioners, and the boys should be proud of their achievements and their stories, and making this film is one of them.","user":"maallen269","rank":[29,38]},{"title":"I'm 46, a guy, a Beatles' fan, and I liked it!","rating":7,"date":"4 September 2013","review":"I'm 46 and the father of five daughters, the three youngest being in the One-Direction target age: 12th, 8th, and 6th grade. My daughters (including a 22 and 20 year-old) have managed not to go gaga over the Back Street Boys, N-Sync, the Jonas Brothers, Justin Bieber, and the like. 1D has been a little different, in that they caught my girls' interest and have kept it. My youngest three wanted to see this, and I surprised them on Labor Day by taking them. I thought about just dropping them off, but am glad I didn't. I read a critic's review that basically said that these guys are truly nice, decent guys, and that that comes through in the movie. It does. <br><br>I'm a huge Beatles' fan, so for me, much of the movie was spent not only enjoying the music (really, it's not bad stuff) and their humble and charming personalities, but also evaluating the sociological aspects of their \"Beatlemania\"-type popularity. <br><br>Here's what's interesting in the comparison. Unlike the Beatles, these guys are not skilled musicians and phenomenal songwriters. Mainly, they just sing, and they're good at that. What lies under their popularity are two things that also lay under the Beatles': 1) they are very humorous and relaxed (lots of quick, on-the-fly, funny comments); and 2) they're working-class boys (lads) who are really great friends and enjoy each other. With the Beatles, I've always thought that their palpable friendship and fun humor were the factors that made them so magnetic--they enjoyed each other, were great friends, and had fun with each other on stage and off. This is even more true for One Direction, as you don't have the leadership struggle with 1D that was there between John and Paul, nor the building resentment of a George. None of One Direction is trying to become the leader, and all are avoiding being the Justin Timberlake or the Sting. They really care for each other, are great friends, and, most striking to me, are tremendously and truly humble about their success. Along with this, they verbalize many times how each member is necessary, how they'd be less successful (or may not have even made it) had one member been missing, how it was a freak of nature/act of God, so to speak, that they wound up together, and that they'd all be doing menial jobs back home right now (factory worker, fireman, working in a bakery), were it not for their fans making them big (and they're really appreciative of their fans, and treat them well). Last thing on this: there's a segment when they go back home, and we see none of them acting like a big deal with any of the folks in their home towns. That was really refreshing.<br><br>Certainly these guys aren't the musical giants the Beatles were--not even close. But just as fun, even to adults? Yes, and maybe even a little more so. This movie, the \"Hard Day's Night\" of One Direction, was a really fun watch.","user":"claytonchurch1","rank":[86,131]}]