[{"title":"Unexpected fun","rating":7,"date":"23 May 2014","review":"I didn't expect to have such fun watching this. It obviously aims to be for an adult audience with all the blood and sexual situations the characters get themselves into. Having Lucky McKee doing a movie like this might be the biggest surprise though. I never thought we would see a light side of this director, but obviously I was wrong. And that is a good thing, because the movie works.<br><br>Giving the cheerleader to do what they want and making this all about women/girls was a really good decision, even if at one or two moments I thought some of the guys where painted to dark, without some shades. But this is about having fun, so don't let that distract you from some obvious flaws","user":"kosmasp","rank":[43,60]},{"title":"Surprised by the low ratings...","rating":9,"date":"19 September 2015","review":"I'm shocked by how harsh the reviews are for this film. No, this is not Gone with the Wind or Citizen Kane, but for what it is, the movie is pretty great. I caught this film after it came out on Netflix and was pleasantly surprised by how good it was. Compared to 90% of horror films being made today, this one is infinitely more engaging and clever. At the same time, it has all the classic elements of a teen scream that one would look for if you were in the mood for that type of film. Honestly, it's an inventive take on a classic move genre and well worth your time if you are in the mood for some silly, gory fun. Highly recommend you ignore all the people who trashed this movie and see it for yourself. You'll be glad you did.","user":"lusciousmuffins","rank":[17,22]},{"title":"McKee/Siverston Show Us Their Play Side","rating":5,"date":"9 September 2013","review":"I still don't know what to make of writer/director Lucky McKee. It started strong with May (2002) which I thought was a wonderfully crafted drama/thriller that put McKee on my radar. His venture into television as director of the Masters of Horror episode titled 'Sick Girl' was OK, but didn't capture my attention as much as May. Then came The Woods (2006) and Red (2008) which were both relatively competent, but hardly memorable. The Woman (2011) was definitely memorable and made headlines for its festival showing and a paying attendee that was less than thrilled with what he saw on the big screen (YouTube it, you'll thank me).<br><br>McKee's newest project, All Cheerleaders Die, got a coveted spot amongst the 10 films picked as part of the Midnight Madness series at this year's Toronto International Film Festival (TIFF) where it will be making its World Premiere.<br><br>The title sounds rudimentary, but the film is anything but. Maddy (Caitlin Stasey) is an outcast amongst her High School peers and she has a particular hatred for the cheerleading squad. That leads Maddy to try out for the team in an attempt to infiltrate and ultimately bring down the all too popular clique of good looking teens with great looking adult breasts. The opening scenes before the title card set up a plot device that really comes full circle by the film's final shot and the audience at the packed Bloor Cinema collectively gasped and clapped with the first fatality.<br><br>Fans of horrors films would likely yawn at such an introductory synopsis. But the movie hardly heads in directions one can foresee and before long, Maddy, school friend Leena (Sianoa Smit-McPhee) and the whole squad of short skirt/white sneaker females are battling the opposite sex with a supernatural element under toning the struggles.<br><br>McKee and fellow director Chris Sivertson throw the proverbial kitchen sink at the audience and I can best describe All Cheerleaders Die as a movie which if the creative makers behind Heathers, Carrie, the television Charmed and Jennifer's Body all took a big dump in a blender and the resulting mixture was then baked into a soufflé would be the result.<br><br>Most of what is being cooked works. The comedy surely does with High School verbal jibes thrown at a Mean Girls pace. And the acting is definitely there to back up the promise of the script ideas. Unfortunately, the film ultimately just falls short of hitting a triple. Man, there is a lot to ingest. Witches, evil quarterbacks, zombies, walking dead, supernatural, conjuringlike we said, \"the kitchen sink\" I liken All Cheerleaders Die therefore to last year's Monster's Brawl. It's a lot of fun with an audience and there are some elements of originality, but if sitting in a darkened basement screening the film by one's lonesome, you might not enjoy the audience effect fun-factor that can sometimes elevate a reviewer's response.<br><br>McKee is definitely out of his downer-phase. Most of the director's earlier work was depressing and dry. But with All Cheerleaders Die, he dug deep into his inner cheerleader to bring a labor of love to the big screen (McKee and Siverston made a video All Cheerleaders Die in 2001 to launch their careers).<br><br>The ending to the film more than hints that this is just the first installment of what may be many more Cheerleaders Die films if this entry hits the market running. We are hopeful, yet skeptical. It would have been a great AMC movie, but as a theatrical release, we are not sure this effort is worth the hard earned dollars wearing away in our wallets.<br><br>www.killerreviews.com","user":"gregsrants","rank":[29,47]}]