[{"title":"Really could've been better","rating":10,"date":"10 August 2014","review":"I sort of appreciate what this was trying to do, honestly. I just wish it had done it better. The film really isn't the typical mainstream slasher/horror flick, and it knows how to build atmosphere... to a point. It just slogs throughout most of its running time, and it really seems like it goes nowhere. The biggest crime a horror film could make is be boring, and at times, this is incredibly dull. I like the destination and I like how it doesn't feel the need to speed up its pace, but the really thin screenplay and some questionable acting make this not very good. It's a pity too, because it really does have some nice scenes and atmosphere.","user":"Red_Identity","rank":[43,59]},{"title":"Bits of nonsense does not a Horror make!","rating":2,"date":"24 September 2014","review":"A fragmented bundle of story pieces, At the Devil's Door doesn't add up as the sum of its parts.<br><br>The film effectively opens with a runaway teenage girl in the arms of a teenage boy in what looks to be a mobile home in the desert. He takes her to play a shell game unlike she's ever played and wins $500. While at her home later she is viciously attacked by an unknown force. Fast forward to Leigh, a hardworking real estate agent trying to sell the very house the girl in the last scene was attacked. While surveying the house she comes across the girl, who we believe is the daughter of the couple selling the house, and becomes the target of the ominous supernatural force; unknowingly bringing her sister Vera into its sights as well.<br><br>That convoluted summary and plot description is due to the plot being a loosely jumbled mess. To call At The Devil's Door a narrative would be an offense to all other narratives because it is so discordant from a typical plot. Nicholas McCarthy desperately and ineffectually tries to splice the tale together loosely by connecting the satanic undertone throughout. For a film marketing itself as a 'horror' it shies away from the truly terrifying aspects of demonic rage as a satanic being clamors to take a human form and is underwhelmingly tame.<br><br>At The Devil's Door is unnecessarily overcomplicated and contrived in trying to be different from typical demonic possession films. Incoherent perplexing chunks of the film should have been amputated and reevaluated. Editors are resigned to fade to black scenes to attempt to piece together a film with no cohesive plot direction. The fragmented plot and poorly conceptualized screenplay by McCarthy is only highlighted further by the forced dialogue between the characters.<br><br>Further, there are three protagonists. There is a formula to horrors and supernatural thrillers, a very simple formula, you must have one clear protagonist for the audience to follow. Ashley Rickards is great as the disturbed teen assaulted in the first scene who menacingly skulks about, tormented by the decision she makes to allow this dark force to enter her life. The next protagonist Leigh, played by Catalina Sandino Moreno, unfortunately gets featured far too much and further splinters the story. The film could have contained a single scene with her as a minor character in order to connect Rickards' plot to Vera, the sister, played by Naya Rivera. If it were not for the sufficient performances of Rickards and Rivera this film would be unwatchable. Once Vera is the primary focus for the film it picks up slightly but pathetically shuffles its way to a weak finale.<br><br>At The Devil's Door is a bland and disjointed interpretation of the hellish thrillers of yesteryear when humanity was afraid of losing its soul to Satan. With no clear plot and no serious scares it expediently fast forwards through the various shorts attempting to be key plot events to an ending the audience can not care or be invested.","user":"ArchonCinemaReviews","rank":[26,38]},{"title":"a really good paranormal horror movie","rating":9,"date":"20 December 2014","review":"If you like insidious and the conjuring then you would love this movie. I don't why it doesn't have better ratings. it pulled me in, had me interested, kept me on the edge of my seat. there was quite a few jump scares and the atmosphere of the movie was really creepy. it's a good scary demonic horror movie. At first I was confused but it all got explained later on in the movie. I didn't really understand the ending, that's probably why it doesn't have the best ratings. I however loved it, and I recommend it to any horror and paranormal fans. It's got a whole different story to it. it's not like your average demon, haunting and possession type of movies. it's different and really scary.","user":"paranormal14","rank":[21,31]}]