[{"title":"Larry Gaye brings just enough hilarity to not crash entirely.","rating":5,"date":"11 June 2015","review":"This is the story of highly self-absorbed flight attendant Larry Gaye, a name which is certainly designed for obvious word pun. Most of the comedies are crude uncomfortably sexual innuendo in shameless fashion, the vain larger than life persona doesn't really take off in this regard. The exhausting tired jokes aside, it does deliver several good moments with witty awareness and fourth wall breaking quips, the few nods to Airplane! are also nicely done.<br><br>There's not much plot to be had. Larry Gaye is made from bits of choppy drama and aviator humor, both of which present barely adequate material in sporadic manner. The way it presents its humor is relentless, so if one particular scene doesn't work, the excessive effort is wasted and the film can be tedious. Unfortunately, this involves repetitive sensual undertone and the Gaye jokes can be tiresome after a few jabs.<br><br>It is when its best when Larry self-deprecates himself in mainly clueless manner or the film mocks on its own silly plot with an ironic seriousness. The tongue in cheek approach works with the help of the diverse actors who are experienced in the genre. Several scenes at latter half fare better as it deal with relatable and light banters instead on forcing the flamboyant aspect too much.<br><br>There are a few good chuckles underneath the turbulence of painfully narcissistic jokes and nasty sexual innuendos for a light popcorn flick.","user":"quincytheodore","rank":[21,29]},{"title":"A gay womaniser in a terrible movie.","rating":1,"date":"7 June 2015","review":"A contrite turd avoid at all cost. If someone gives you free tickets kill them and bury them under the porch and never speak of it again. Honestly there is nothing here to warrant this ever being produced, ever, it makes me plead for more Hollywood reboots...<br><br>But seeing as I have to spew out 10 lines of text to submit a review. The story is basicaly barney goes to camp adapted to a gay womanising flight attendant were nothing of value is added and all we learn is how gay the main character is, Henry Winkler stars in this and considering its been 40 years since he was relevant it should be a nice warning to stay the hell away.<br><br>/10char","user":"mstanton-588-856166","rank":[27,57]},{"title":"Junk.","rating":1,"date":"2 March 2018","review":"The entire movie I was on the edge of turning it off and walking away. I didn't, it had just enough to keep going 'another ten seconds' but by the end, wished I had.","user":"james-2374","rank":[6,12]}]