[{"title":"At first glance, a witless retread; on a closer look, a smart, sweet story that deals very well with its themes of redemption and romance.","rating":7,"date":"18 October 2014","review":"Stop us if you've heard this one before. A writer with a huge hit under his belt stumbles headlong into obscurity, but unexpectedly gets his mojo back when he befriends - and falls in love with - a woman who jolts him out of his comfort zone. It's not just the plot of Music And Lyrics, a film made seven years ago, starring Hugh Grant and written and directed by Marc Lawrence. It's also the plot of The Rewrite, a movie made seven years later, starring Hugh Grant and written and directed by Marc Lawrence. This blatant recycling of plot, star and director should be quite enough to turn even the most undiscerning of audience members cynical and dismissive of the final result. And yet, The Rewrite surprises rather than annoys, revealing a newfound and very welcome maturity in both director and star.<br><br>Oscar-winning screenwriter Keith Michaels (Grant) is down in the dumps: he can't get a job in Hollywood anymore, and he's been estranged from his family for years. To stem - or perhaps as part of - his downward spiral, he reluctantly agrees to teach a screen writing course in a small, remote college town as far-removed from the excesses of Hollywood as it's possible to get. He promptly gets into trouble when he arrives, diving into an inappropriate sexual relationship with student Karen (Bella Heathcote) and offending stern Professor Mary Weldon (Allison Janney) with his vaguely sexist opinions. But, as the term progresses, he begins to find inspiration in his students, ranging from a Star Wars nut through to a writing prodigy, but most importantly, optimistic single mom Holly (Marisa Tomei).<br><br>On paper, it's a recipe for dire predictability. Arrogant, formerly famous writer brought to his knees and taught the value of humility, feminism and love. Of course Holly will win Keith over with her spirit and heart. Evidently he will find in teaching the meaning that has been lost in his life for far too long. Obviously it means that our protagonist will become - gasp! - a better man. As it turns out, it's pretty safe to make all of these assumptions: The Rewrite doesn't re-invent the romantic comedy, nor does it fling any huge surprises at the audience. Keith's rehabilitation is a foregone conclusion the moment he cruises into town.<br><br>But The Rewrite subverts expectations by being, well, really rather good. You might be able to see the big plot twists coming from a mile away, but Lawrence's script and characters are sharp and funny enough to provide plenty of tiny, pleasant surprises throughout the film. Keith's Hollywood arrogance and casual sexism are never excused or passed off as part of his roguish charm - instead, he's called out on them at every turn. The women he encounters, especially Karen and Holly, are also very far from being the disposable stereotypes that tend to populate rom-coms. The former isn't simply a brainless, sexual diversion, and the latter gets firmly into Keith's face and refuses to let him take the easy way out, as one suspects he's been doing for a very long time.<br><br>Even the supporting characters who typically waltz in and out of scenes for a hit-and-run gag or two are memorably drawn, aided by the fact that they're played by some of the best character actors in the business. J.K. Simmons is a hoot as Dr. Lerner, the English department head who gets all weepy at any mention of his wife and daughters; and Janney, marvellous as always, hits the perfect note of imperious disdain as an Austen enthusiast horrified as much by Keith's skirt-chasing as his belief that movie scripts can be considered great literature.<br><br>It's refreshing, too, to see Grant embrace his age and really exercise his acting muscles. He may be playing the older version of many a suave, shallow-but-not-really character he's played before, but there's a depth and sadness to Keith that feels real. Tomei is just as appealing as Holly - the character is a little underwritten (the fact that she's a single mom barely factors into the film, her daughters appearing for only one brief albeit charming dance sequence), but she doesn't feel that way in Tomei's hands. Grant and Tomei share a sweet, credible chemistry, if not exactly a combustible one, and this adds weight and colour to their unlikely on-screen relationship.<br><br>Given the nature and quality of Grant's earlier collaborations with Lawrence, most people probably aren't expecting The Rewrite to be anything more than a fun but forgettable rom-com, designed to entertain rather than to engage. And yes, as most people would imagine, the film doesn't reinvent the wheel and its plot is as predictable as it gets. But, as Keith realises during the semester, there's always time to look at things with a fresh eye - to give someone or something a second chance - and The Rewrite, imbued as it is with such welcome wit, heart and maturity, very much deserves that consideration.","user":"shawneofthedead","rank":[75,87]},{"title":"Hugh Grant & Marisa Tomei = great chemistry","rating":8,"date":"22 March 2015","review":"What a fun and charming movie. It's so good to see Hugh Grant in a film that utilizes both his comedic timing and that let's him ground himself in things a bit more serious. It would be easy to dismiss this film as formulaic (and I suppose it is to a certain extent, but what movie isn't these days?), but it does allow Grant's character to peel back some layers to reveal a man more complicated and not quite so lacking in depth as you might expect at first. Marisa Tomei is wonderful as Grant's student and confidant. It's so nice to see two talented actors of comparable age building a terrific camaraderie and rapport with each other and the dialogue. JT Simmons is terrifically funny with a nice supporting role as the dean. In fact, the whole supporting case is great. This is the movie that happens when you have a tremendous cast, taking a nice story, and making it believable and funny without some of the hackneyed tics that Hollywood always likes to tack on. Really worth your time.","user":"easheehan","rank":[26,29]},{"title":"Surprisingly Watchable","rating":7,"date":"16 April 2015","review":"Film of Choice in a Boeing 767 at 36,000 feet - The Rewrite. I wanted something light and predictable for a 7 hour transatlantic flight and had about 50 films to choose from, how times have changed. The rewrite stars Hugh Grant as a once bright young Oscar winning screen writer who hasn't written anything of note since. Divorced from his wife, alienated from his son and so broke his electric gets cut off, he is forced to take a teaching position in a small American town in the back of beyond. This is a typical Hugh Grant vehicle, and while there is nothing outstanding about this film, if you are a fan of his acting style and the way he bumbles through his film is the same fashion time and again, you are guaranteed to like this film. I find I can watch his films and enjoy them, and he is helped along here by Marisa Tomei who is a single Mum taking his class. Unlike its main character, this film is not an Oscar winner but is a fairly watchable effort.","user":"Figgy66-915-598470","rank":[26,31]}]