[{"title":"Battling adversity in 8 x 4 ft","rating":8,"date":"9 January 2015","review":"The Pacific Ocean is 63 million square miles in size. Larger than every single square inch of dry land on the entire planet.<br><br>In January 1942, just over a month after the devastating Japanese attack on Pearl Harbour and the United States entry into WWII, the aircraft carrier USS Enterprise was on patrol west of Hawaii.<br><br>Enterprise was one of only four remaining US carriers in the Pacific. Constant reconnaissance was crucial to detect Japanese ships and aircraft. Lingering in one place was a recipe for potential disaster - but pinpointing a moving ship roughly 800ft long and 100 ft wide, a minuscule speck in such a vast ocean, was a much greater challenge for pilots. Unfortunately that made life difficult for friendly as well as hostile fliers.<br><br>On the 16 January 1942 a Douglas Devastator torpedo bomber ran out of fuel without sighting the Enterprise. Pilot Harold Dixon, radioman Gene Aldrich and bombardier Tony Pastula managed to survive ditching in the sea.<br><br>This film tells the story of what happened next. Dixon, Aldrich and Pastula had few resources and faced great dangers - trying to survive on a raft measuring only 8ft x 4ft.<br><br>Such a small intimate setting is a challenge to put on screen, and this film succeeds in being engaging and enjoyable because of the well written script brought to life by a talented cast.<br><br>Tom Felton as Tony Pastula may be familiar as Draco Malfoy from the 'Harry Potter' films, Jake Abel from 'Percy Jackson: The Lightening Thief' and TV's 'Supernatural' and Garret Dillahunt from 'Justified', 'CSI' and 'Deadwood' on the small screen as well films such as '12 Years A Slave' and 'No Country For Old Men'.<br><br>All three are excellent in their respective roles, and their collective experience and ability hold and entertain the viewer.<br><br>The film remains as faithful as possible to the actual story and the real history - and amid all the seemingly endless sea and limitless sky, an imposing vastness visually conveyed powerfully from the first opening scenes, is never in any danger of coming adrift.<br><br>Very enjoyable and well worth watching.","user":"tombyr","rank":[47,53]},{"title":"Decent Small Budget Movie","rating":7,"date":"16 February 2015","review":"I'm not going to concentrate my review on one scene involving a CGI shark. I will say it looked obscenely fake and did somewhat detach you from that scene as you were too busy preoccupied with the leftover Sharknado prop. Otherwise the film was pretty good. Felton, Delahunt and Abel were all very solid and really evoked the feelings of desperation and humanity relating to the subject of the film. Their performances were enough for me to actually care about the characters and given its also a true story, I found myself more than adequately emotionally invested in the film. There's definitely issues with the film. The score is very hit and miss. Especially the second rate Jaws music in some of the scenes. I've watched hundreds of films worse than this in the last year or so. Did more than enough to keep me watching for 1hr 40mins.","user":"cuthbertjoel","rank":[18,20]},{"title":"Strong story, and great acting by Tom Felton","rating":9,"date":"23 November 2014","review":"Saw this movie at a Special Screening in New Orleans at the WWII Museum and I highly recommend it. It's an incredible true story honestly told and very well acted. As someone with family in the military who loves true stories about American history, this one hit all the right notes for me.<br><br>Historical films can feel a bit stiff or over dramatized, but this hit the sweet spot of good acting and an engaging story. <br><br>It was a trip seeing Tom Felton is something other than Harry Potter, but once you get over the initial double take, you realize he is a fine actor who has a bright future ahead of him.","user":"bryce-167-776553","rank":[33,43]}]