[{"title":"Nice animation, passable story","rating":6,"date":"2 February 2019","review":"The animation is very well made (say, rating 9/10 for that part), but the story is predictable. The scenario lacks a pretty moment; it is difficult to get into sympathy with any of the characters. It reminds me of James and the Giant Peach (1996): something attractive and unpleasant at the same time; childish and adult at the same time. Not satisfying.","user":"franbelle10","rank":[7,9]},{"title":"I wanted to rate it higher","rating":6,"date":"6 June 2018","review":"I gave 6/10, which felt like I should hand my passport back in. A stellar Irish cast, but the storyline was derivative and vaguely predictable. \nThat it was meant to be about the animation first and foremost is understood, but the film stood to gain from better pacing and perhaps another 15 minutes run time could have achieved that. Far too rushed as it was.<br><br>Tommy Tiernan was recognisable barely a syllable into his first word, but his part in it was never ever explained... (other than as a plot device) If they were to push on and make a TV series of this, I could see them plugging all the holes in the script very easily indeed. <br><br>Jason Byrne was unrecognisable by the same token... and while it might have been the sound, it seemed much of his dialogue was mumbled. <br><br>Neil Delamere, sure that fella could be picked out of a crowd of millions, and his small part was pretty funny. <br><br>Child actors being chosen for child characters? Hollywood wouldn't approve... Keep up the great work! <br><br>Will 100% watch any sequel or TV series *if* they keep as much of the cast in situ as possible - I hate when they recast voices.","user":"murphy-mediji","rank":[2,6]},{"title":"Weird next movie ever","rating":1,"date":"3 March 2019","review":"Right from the beginning we were wanting our money back. Wish I could unsee this. The animation was weird and a little creepy. Could not even finish the movie.","user":"h_vitzthum","rank":[1,12]}]