[{"title":"When something looks good, but not really","rating":6,"date":"9 December 2017","review":"Sweet Virginia, where dreams come to die. The movie is dictated by Lila (Imogen Poots) hiring Elwood (Christopher Abbott) to murder her husband, which he ended up killing two more people.<br><br>I don't really know what was the exact goal of the director, Jamie M. Dagg, with this movie. It's a mix of well placed scenes with some seemingly random scenes. Some scenes helped me understand what motivated the characters, giving a good background and their point of view on the reality they were facing and/or faced. But some scenes throughout the movie, especially scenes involving Sam (Jon Bernthal), just looked like that they were there to fill time until the end, not giving any real purpose or content to the story itself. It made me feel confused, in a somewhat small movie of 93 minutes.<br><br>I also got the impression that the real goal of the movie was to show how screwed up people are, with all the lies, deceit and lack of truth in their actions. I was able to feel the tension in almost every part of the movie, which was a good thing.<br><br>I enjoyed watching Jon Bernthal play a character outside his normal roles. Here he is someone non-violent, that shows patience and compassion. Was surprising to say the least, but a good surprise.<br><br>It was good to see a reality that I personally never experienced. A reality filled with secrets, lies, opportunism and, at some degree, fake. What threw me down to not give a better rating was the way the story was told, I felt kind of empty while watching it, becoming lost in my thoughts \"why is this happening?\", \"what's the point of this?\", \"did they forget about her?\". They could have delivered it a bit better, with more consistency. I really wanted to like this movie, had potential, but, unfortunately, I have to give it 6 out of 10.","user":"NoPantsBatman","rank":[29,34]},{"title":"Pros and Cons of \"Sweet Virginia\"","rating":7,"date":"30 June 2018","review":"Pros:\nScenario 6/10 (Terse script, plain scenario not complicated, no plot holes but nothing that we haven't see before... not much character analysis, covered by good acting though)\nDirection 7/10 (Jamie Dagg made a good dark Neo-Noir/Neo Western thriller)\nCinematography 7/10\nJon Bernthal 7/10\nChristopher Abbott 8/10 (Really convincing as a psycho character... scary convincing!)\nCons:\nActually I found no important weaknesses in this movie.\nNice movie. 7/10 by me.","user":"Vlasios_Tzomos","rank":[22,26]},{"title":"Like... They got a budget reduction while filming or something","rating":6,"date":"5 August 2018","review":"So. They set up the characters really well. Super engaging scenes that makes you learn about all of them. They open a ton of threads about all of them in subtle, natural ways, plus relationships between some of them...<br><br>And then all ends in a few sequences in a non-climax. I honestly believe they thought they could film for more time in a two hour film, they were noticed that wasn't going to be the case, and rewrote the end so they could at least sell the movie.<br><br>Having said that, the acting and script of the good parts (2/3) of the movie was so good that I couldn't give this movie less than a six...","user":"educallejero","rank":[18,21]}]