[{"title":"Some of the film is quite good...","rating":4,"date":"31 July 2014","review":"This film is directed, co-written and stars the Italian-Uruguayan actor, Luca Barbareschi. And, incidentally, aside from acting, writing and directing, Barbareschi is also a member of the Italian Chamber of Deputies--making him like a member of Parliament or the US Congress!! Now THAT is pretty weird...and, incidentally, so is the movie. Now I am not saying it's necessarily good or bad...just very strange and like nothing I've ever seen.<br><br>The film begins in China with Jiazhen (Jingchu Zhang) discovering her young son is dying. It seems that the boy was poisoned by some adulterated food. Exactly what is in the food and who did this is unknown. The scene then quickly switches to a criminal known by his alias as 'Mr. Mercury' (Barbareschi). His sleazy business is selling adulterated food--by which he's worked his way up through the organized crime world and is both powerful and rich. So, obviously, he's a sociopath with no soul to do such things. He's also quite paranoid--and for a good reason. When he goes out to eat, he's very careful and either orders kosher or checks out the kitchen to make sure he's not eating food he and his associates have provided! During one of these occasions, he visits the kitchen and the chef is offended---and this chef is Jiazhen. Later, after the meal is over, he excuses himself from his guests and goes to talk to her as well as to apologize for any offense. It seems that Mercury is smitten by the chef and tells his friend and their two 'ladies' (I use that term VERY loosely) to go on--he'll catch up with them later. However, soon the friend and women are dead...and when the police question Mercury he cannot account for his whereabouts. Now you know Mercury didn't kill them---but after leaving Jiazhen's restaurant, he has no alibi. So, later, he asks Jiazhen to lie and tell the police that he stayed with her in the kitchen until 3 am. Oddly, although she barely knows the guy, she provides him with an alibi. Soon after this, the pair become lovers. There is naturally MUCH more to the movie---but I don't want to give you any spoilers.<br><br>There were a few things I really liked about the film. I am happy that they had an interracial relationship---it was interesting and isn't seen all that often. And, I liked the idea of a film about a scum-bag who sells adulterated foods--which has actually been the case in a few well publicized cases. Also, while he is far from the traditional handsome leading man sort of guy, Barbareschi was pretty good in the lead. However, there is a lot to dislike as well--and some significant reworking of the script would have eliminated these issues. Problem number one was that the idea of a sociopath who murders children by selling tainted milk and other products is hardly the romantic lead you'd want in a movie! Problem number two is that someone like this would NOT suddenly change into a nice guy. After all, an amoral sociopath is not going to change....or, if he would, it sure wouldn't happen quickly or because of the love of a woman. Why? BECAUSE HE'S A SOCIOPATH!!!! Murdering mobsters don't change their ways overnight--and this happens with this film. Problem number three is something I don't want to describe in detail, as it would give away too much plot, but when Jiazhen learns about Mercury's real job, she sure as heck would NOT react the way the lady did in this film...unless she completely lost her mind. Problem four is that the whole mobster, sleeping with 'professional girls' and tainted food theme are NOT conducive themes for a romance film!!! What were they thinking?! This is NOT a date night sort of picture!! Overall, there is some stuff to like in this film but the story is just very weak. I am not saying that you should avoid this film completely. It's more a time-passer you might watch if there is nothing better on your television.","user":"MartinHafer","rank":[2,2]},{"title":"Barbareschi far from being as good as wine","rating":1,"date":"16 May 2014","review":"Yet another awful flop from the untalented Italian actor Barbareschi. Light years far from being as good as the wine whose name he bears.<br><br>Terrible, predictable, awfully acted, pretentious and embarrassingly boring. Script was probably put together by copy-pasting parts of stories from bad action-drama movies from the 80's.<br><br>Barbareschi as wooden as Pinocchio, without being as funny and interesting. Somebody must have told this guy he is good looking and incredibly enough he believed them. Maybe he will have better success as a plumber, because acting is simply not for him.<br><br>Avoid by any means unless you like to pay for being clichéd to death.","user":"cablooie","rank":[5,9]}]