[{"title":"Fun for a weekend night with your buddies","rating":9,"date":"20 November 2015","review":"If you're looking for a solid horrific Zombie story-line then you'll be disappointed. This movie is about mixing comedy, romance and some funny horror into your movie night. The story is built on funny quips portrayed in scenes. The story-line on the other hand is simple. A nerd guy who is happy because he just landed a \"perfect job\" with an upcoming horror feature and just found the girl of his dreams when things start to get worse, and the worst is when all the film extra's become zombies and he finds himself in a battle for his and his dream-girl's life.<br><br>The film is very amiable. Especially with the fun nerdy, baby-faced and insecure Wesley Pennington (Harley Neville) yet some scenes you feel that the scenes are longer than they should be and some jokes are really being pushed. I believe it should be better if the movie was shorter to avoid these points, yet, the makers might take a note of that for their next feature.<br><br>All-in-all it was a fun experience watching a movie from New-Zealnd, where you rarely see movie breakouts from, and I believe it's a good movie to watch with your buddies on a weekend night when you need to give your stressful brain a break from all the stress of the week and the pressure of the bad news you say on a daily basis in media and have some pure horror-styled fun as your stress-relief weekend night.","user":"hqaddomi","rank":[4,4]},{"title":"Gory zombie fun from New Zealand.","rating":7,"date":"31 August 2015","review":"On his first day as a lowly runner on a zombie film, aspiring film-maker Wesley (Harley Neville) meets the girl of his dreams, pretty cook Susan (Jocelyn Christian), but also finds himself fighting for survival against real zombies who have invaded the set.<br><br>From its broad characters, absurd humour, and outrageous gore, right down to its awkward nerd-turned-hero who falls for a nice 'girl-next-door' in the midst of a zombie epidemic, it seems pretty clear to me that the makers of New Zealand splatter comedy I Survived A Zombie Holocaust set out to emulate Peter Jackson's Brain Dead (Wesley couldn't be more like Lionel if he tried). And for much of the time, they get it right: the gruesome effects are suitably messy, the crazy and sometimes delightfully crass comedy mostly hits the mark, and the cast do well in creating some memorably fun characters.<br><br>Unfortunately, where the film does suffer is in its pacing: things take an awful long while to get going, and at 104 minutes, 'I Survived' is far too long to sustain the central joke. Some judicious editing to trim away all of the fat, and this film could have been great rather than just good. As it stands, it is still the second best low-budget Kiwi zombie film I have seen, but with only the disappointing Black Sheep as the other contender (I've yet to see Last Of The Living), I suppose that could be considered faint praise.<br><br>6.5 out of 10, rounded up to 7 for IMDb.","user":"BA_Harrison","rank":[7,9]},{"title":"Silly cliché laden fun","rating":6,"date":"25 November 2015","review":"Even though zombie horror in currently en vogue, and the lighter side of it (ie. comedy) has its pearls, this one is actually better than average.<br><br>This one does the meta-thing: on the set of a zombie movie, a real zombie apocalypse breaks out. And even though the entire movie is laden with clichés, does not mind being trashy and silly, it sill manages to be fun. I assume the budget was tiny, but in my opinion this requires the makes to actually put some thought into the story, the characters and the script. In this case worked out okay.<br><br>However, there are some shortcomings. Some scenes are a bit too slapstick, some dialogue lines are plain too silly (instead of being funny). Also, the end is, IMO, a bit lackluster. I thought the writers simply had no idea how to finish it properly, so they reverted back to the meta-story. Seems they reference the entire meta-theme here, since the writer of the first meta-movie had also no idea how to end the movie.(Breaking 3rd, 4th wall?) We end, where we started, at the set of low-budget zombie movie. Unfortunately without any explanation on how the characters managed to escape the sticky situation they were in.<br><br>Spoiler alert: two people stand opposite a whole town turned into zombies. CUT and we're back in the meta-level. Huh?<br><br>If they would have resolved this little conundrum, the entire movie would be much more fun and more consistent. Apart from that it's another nice NZ production, certainly not en par with Deathgasm or Houseboud, but still fun to watch.","user":"Bantam","rank":[3,3]}]