[{"title":"Mess","rating":3,"date":"16 March 2018","review":"My advice is go to this movie for the first 30 minutes to see the stellar performances and then immediately leave and don't look back and whatever you do don't stay for the last 20 minutes. This movie is a horribly written film school mess with a clear dissonance between all creative components. Great acting, a seemingly decent director who /tried/ their best but with a script that feels like it structured through mad libs not even they could save it.","user":"Eaksoy-958-353012","rank":[72,97]},{"title":"Zoey Deutch's acting talents surpass the movie by a mile or two","rating":4,"date":"31 March 2018","review":"\"Flower\" (2017 release; 93 min.) brings the story of Erica and her family and friends. As the movie opens, Erica and two friends expose and blackmail a cop who accepted a blowjob from Erica, a 17 yr. old minor. We then get to know Erica's mom, with whom Erica is close, and her mom's boyfriend Bob, whose 18 yr. old son Luke is being released from rehab and moves in as well. Luke claims that years ago he was molested by his teacher Will, and when they run into Will at the bowling alley, they decide that justice needs to be served. Did Will molest Luke? What becomes of Erica and Luke? At this point we're 15 min, into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to eee for yourself how it all plays out.<br><br>Couple of comments: this is the feature length debut of co-writer and director Max Winker, best known for his TV work. Here he brings the tale of a rebellious and well-meaning 17 yr. old girl who manages to get herself into trouble time and again. The movie benefits tremendously from Joey Deutch's acting talents, but alas the movie suffers visibly from a lack of focus. I mean, this is really three movies in one, as the focus shift and one movie becomes another one, before it becomes yet another movie again. By the end, the story has become utterly improbable and, frankly, preposterous. And that's a shame, as there are some good elements in the movie. But it is clear that Zoey Deutch's acting talents surpass the movie by a mile or two, There are some great songs in the movie, including a very nice cover of \"Daydream\" (the 1969 hit single of the Belgian band the Wallace Collection) by a guy I've never heard of before.<br><br>\"Flower\" premiered a year ago at the Tribeca Film Festival, and finally opened at my local art-house theater here in Cincinnati this past weekend, No idea why it has taken so long to get a theatrical release, but better late then never I suppose. The Friday early evening screening where I saw this at was attended poorly (4 people in total, including myself), and given that this movie won't benefit from strong word-of-mouth, this will not be playing long in theaters. In the end, \"Flower' is notable only to see Zoey Deutch, but I encourage you to check it out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[26,33]},{"title":"You won't want to plant this 'Flower'!","rating":2,"date":"8 February 2018","review":"Sometimes you get a film that seems so good on paper, but after you watch it, you can't help but be sorely disappointed in just about everything you've witnessed. 'Flower' is that kind of movie that had a lot of potential, but just couldn't get it together for anyone to really relate to, even though it tried to be realistic. The film was directed by Max Winkler who hasn't really done anything before this, and was written by three male writers, which is weird, because the main characters are female, which causes some strange dialogue for sure.<br><br>\nThe story centers on a teenage girl named Erica (Zoey Deutch, the chick from 'Everybody Wants Some'), who is a fast talking, inappropriate young woman who loves to eat at the bowling alley, draw penises in her notebook, and give anyone blowjobs that crosses her path. She seems to love giving blowjobs, but she blackmails everyone she does it to for all the cash they have with the help of her two dumb friends who sneak up on her victims with their camera phones. Erica's mother (Kathryn Hahn) is trying to pick up the pieces of recent breakups and Erica's biological dad who is in jail for something \"awesome\", but she has new boyfriend now named Sherm who comes with a teenage son who is awkward to say the least.<br><br>Erica has no intention of being nice to this new kid who has moved in, but she changes her tune when she walks in on him trying to commit a ridiculous suicide attempt. From here, she learns that her future step brother has problems due to a former teacher who has molested him, which is the same person (Adam Scott), she has the hots for at the bowling alley. She tries to conceive a plan to blackmail this guy who has a different story of things. This is where the film turns into a ridiculous 'Very Bad Things' situation for no real reason at all and it just gets more disgusting from there. The problem here is that the writers and director failed to make Erica and her friends likable or redeeming in any way, shape or form.<br><br>Right form the get-go, you hate this girl and her friends. You'd think if this was a coming-of-age film, there would be some sort of redeeming quality or someone would learn a thing or two, but not here. Everyone is just so annoying, unfunny, and just awful people, with the exception of Sherm and Erica's mother. With this aspect, you can't expect to love or connect with the main protagonist at all. Even if this movie was in the remote bit realistic (it definitely isn't), it still would seem far-fetched and unlikable.<br><br>As for the performances themselves, I really like Zoey Deutch and she plays this part very well, but the character just gets in the way of being any sort of charming or witty. Adam Scott is fantastic in a role that's very subtly off in a bad way and he kills it in every frame. Hahn again is excellent too as the frazzled mother. 'Flower' should have been a great film, but due to the super unlikable characters and the film taking an over-the-top turn, there's just no redeeming part about it.","user":"dvd4040","rank":[48,72]}]