[{"title":"I don't understand it","rating":17,"date":"17 April 2017","review":"This&nbsp;film tells the story of a man, whose girlfriend goes missing all of a sudden. He decides to look for her, using some mysterious photographs that his girlfriend left behind. As he digs deeper, he finds that the truth gets further away.<br><br>\"Come and Find Me\" starts off promising, as the mystery surrounding the girlfriend's disappearance captures me. Towards the middle of the film, the plot gets confusing. The supposed government agent is clearly phoney, but there is little explanation as to what really is going on. The ending just gets me confused even though I rewatched relevant parts of the film, and I still don't understand what exactly leads to the disappearance and the role of the films are.","user":"Gordon-11","rank":[45,54]},{"title":"Good or Bad, You be the Judge","rating":1,"date":"18 January 2017","review":"I have never written a review for any movie, but this movie touched my sanity and requires me to comment.<br><br>Having read all 14 reviews presently available, I am non the wiser what this movie is supposed to tell us. To me it is a totally muddled up movie, a mix between the present with flashbacks to the past. It started off well but soon lost its way.<br><br>We meet a number of characters throughout the movie without ever knowing them as good or bad and how they fit in the plot. We are not given a proper ending and have to use our imagination how it all ended. If this was supposed to heighten the mystique it failed miserably and left me and probably other viewers completely disillusioned.<br><br>A most dissatisfying movie which is best forgotten immediately.","user":"pietclausen","rank":[41,58]},{"title":"Entertaining but missing something","rating":5,"date":"7 December 2016","review":"I opted for this movie because of Annabelle Wallis, I liked her in the Tudors and Peaky Blinders. <br><br>The movie had a great idea. Girlfriend vanishes but no one seems to help want to find her. She has no background, no family and no backstory. Something only a beautiful woman in a movie can get away with. Boyfriend loves her so starts looking around while \"weird things\" start to happen.<br><br>OK, interesting, keeping my attention. He Forrest Gump's his way through searching for her with a lot of heavy breathing (and not the good kind) while wielding a hammer. Starting to lose me.<br><br>All in all not a bad little film but it had no meat. No substance to the story line. Too many questions left unanswered that really would have made the story line work. The movie never answers these questions, and just fades to black with a very predictable ending. <br><br>So, I rate it a 5. That's being generous. not bad, semi entertaining. wouldn't buy it or rent it. But meh, not bad.","user":"mompaxton-481-121381","rank":[27,38]}]