[{"title":"We see you","rating":4,"date":"12 February 2018","review":"The film opens by letting us know what is going to happen. Small cameras are going to be hidden at bad angles throughout a home....maybe a 100 of them and then a break in happens and the family must fight for their life. This is either live or delayed streamed to the Internet. We then get introduced to the family with teen daughter Jamie (Bella Thorne) set up as the final girl. She doesn't like her young step-mother while her kid brother thinks she is hot. At 40 minutes into the film, the introductions are over, As expected they fight for their life against an intruder. <br><br>Bella Thorne was good in her role in a film that was shot at bad angles for a realistic effect. I am not sure placing a camera in a sink drain was necessary. There are better home break-in films out there. Killer had no character. Oh where oh where is David Hess? <br><br>Guide: No F-words, sex, or nudity.","user":"nogodnomasters","rank":[10,10]},{"title":"Pity the Poor Actors","rating":1,"date":"18 July 2018","review":"Because I'm very kind by nature, I'm not going to mention any of the actors in this turkey by name. They suffered enough while making it: stumbling around in the dark, running, and speaking dialog that is unrelated to human speech.<br><br>Sony Pictures sat on this for right at three years before giving it a one night very limited release. That should tell you something.<br><br>If you want to watch a home invasion movie that has real suspense I'd suggest YOU'RE NEXT. The title of this epic tells us to keep watching, but I'll confess to using the fast forward button more than once. It should have been called WATCH SOMETHING ELSE.","user":"bababear","rank":[14,15]},{"title":"Predictable and slow moving","rating":1,"date":"11 February 2018","review":"This is one of the worst wastes of time I've ever experienced. Im not sure why the family didn't just walk out the front door at the beginning. I guess then we wouldn't have movie. I'm also not sure how the killer(s) can make the lights flicker throughout the house...sometimes they work and sometimes not. Oh and that drone somehow has an endless battery life, flying around the entire movie. It takes FOREVER for anything to develop and the characters continuously do stupid stuff that just makes you angry. For example, stun the killer but then don't grab his weapon for protection later...or actually make sure he's dead. Or, on your way trying to sneak out of the house, make sure you stop to grab some gauze that happens to be in the kitchen to wrap up that cut on your arm. Absolutely nothing about this movie is good at all. Avoid at all cost .","user":"nbruesch-65170","rank":[39,47]}]