[{"title":"Gas mask goons vs. the single-shot shotgun","rating":6,"date":"17 February 2015","review":"'The Well' was the opening film at the inaugural Other World's Austin  Sci-Fi festival this year. Directed by Tom Hammock, the film is set in  a post-apocalyptic Oregon where we are informed that 'the rains' have  simply stopped some ten years ago (from the not too distant future) and  the last remnants of a once fertile valley struggle to survive as their  most precious resource - water - systematically becomes more and more  scarce.  Teen Kendal is one of such survivors that hides out in an abandoned  farmhouse with a character whose name I forget. Meanwhile we learn that  there is villainous figure surrounded by his many zealots that scour  the valley, hunting for survivors who he claims are using his water  without his permission (as he has claimed the remaining water in the  valley and thus the land). As one of these few remaining holdout  survivors, Kendal scrounges for water and supplies why searching  fruitlessly for a distributor cap to aide in the repairs of an old  airplane (that her group dreams of escaping in).  The film itself started off fairly slow though it kept my attention  with an intriguing plot and a fairly convincing performance by Haley Lu  Richardson. She grows to be a bad-ass through the film battling her  foes with her trusty shotgun and eventually a katana. It isn't  outrageous or over the top like you'd see in a Tarantino or Rodriguez  style film but it still has that 'this is still a low budget sci-fi'  charm to it. She gives a decent performance that is not only mildly  genuine, but also just felt right for this type of survival flick.  The cinematography is decent and gritty at the same time and really  lends itself to feeling the sparseness of the wasteland. Other than  Kendall and maybe the villain played by Jon Gries, the characters and  their development aren't too memorable, but it isn't glaringly sub-  par.   It's a solid little movie with some fairly decent suspense and action  sequences as well as the much needed creepy-factor from both the  landscape and the gas-mask wearing henchman.At any rate, I enjoyed The  Well for what it was and what it was not. It's clearly not a big budget  film, but yet it still manages to capture the magic and intrigue of  films like The Hills have Eyes, Mad Max, The Road, as well as a host of  other post-apocalyptic films.  Like I said  the dialogue isn't all that great and some of the  supporting characters are occasionally painful in their deliveries and  screen presence, but overall it was still a fun little movie to watch.  If you're like me, you'll probably get annoyed by some of the hiccups  in the 'attention to detail' category as well as the fact that in a  completely barren wasteland, the main character has inexplicably  fantastic hiding skills. Seriously, she just runs across the desert and  no one spots her or thinks to check behind the door-frame when she's  hiding out in a house.","user":"Drive-in_Zeppelin","rank":[31,41]},{"title":"Some Things I learned from The Last Survivors (2014)","rating":4,"date":"16 July 2017","review":"May Contain Spoilers <br><br>01. Large, attention-getting bonfires may be started in dry sand with one charcoal briquette propelled from a slingshot. The tactic is sound, provided you have access to a slingshotand a charcoal briquette.<br><br>02. Even if water is so scarce you need to count every drop, you will never have to worry about appearing dehydrated or suffer the indignity of chapped lips. Furthermore, dry cleaning of the hair, nails and clothing will keep you looking snappy, even if H2O becomes something the next generation only knows about in legend.<br><br>03. If you do all the work and fighting, give all your water to the annoying emo guy who does nothing but look pale and whine about his kidneys shutting down. Never worry you will offend his sense of gallantry or honor: \"don't waste it on me,\" is not in his vocabulary.<br><br>04. Don't add to the annoying emo guy's problems by informing him that the well has been dry for days -- he has enough to worry about alreadyinstead, give him more waterafter all, he has to at least be able to cry if necessary.<br><br>05. Food and water are not strictly necessary for human survival, they are really addictions. Hence hunger and thirst are cravings and may be overcome with enough patience and determination. This revelation awoke gooey, nostalgic memories of the film Ghost (1990) which demonstrated that death is just a disability that can be mastered if you only try hard enough.<br><br>06. About every 5-20 minutes, introduce characters who sequentially speak in lower and lower registers. Your audience will thank you for distracting them from your film by having to regularly play with the remote.<br><br>07. About every 5-20 minutes, be sure to have the screen go dark for what appears minutes at a time. Your audience will thank you for providing them with opportunities to imagine that something interesting is actually happening even if they can't see it.<br><br>08. Ten years without rain will make Oregon look like the Lucerne Valley of the Mojave Desert. Even at Crater Lake and along the Pacific coast. Apparently Alaska, points North and the Great Lakes will have evaporated as well. In fact, it is well known that a single tanning booth turned the Sahara from a rain-forest into a wasteland in one afternoon.<br><br>09. If you see strangers in the distance, leave your weapons lying on the sand as they approach so you don't hurt their feelings by implying you might not trust them. When they arrive and start killing your people, continue to not go for your weapons and stand in a line to make it easier for them to shoot you one by one. This is known as etiquette, although some unrefined types who don't know any better call it idiocy.<br><br>10. Costuming the Big Bad Guy in a cassock, or at least a ministerial collar, for no particular reason adds layers and layers of subtle nuance, depth and dimension to the character and is not, by any stretch of the imagination, just a clown-like, ludicrous and trite cinematic cliché.<br><br>11. When hiding from bad guys, look in the direction opposite from where they are so they won't be able to see you. For added protection, turn your face away as well. It's best not to know where they are.<br><br>12. Some bad guys like to bag their heads in burlap and lay buried supine in the sand on the off chance someone will pass by. In case none of the other 8 or 9 people in the cast comes along, it's always possible a spontaneous remake of Mad Max will occur instead.<br><br>13. In the future, anything viewed through a telescope or a pair of binoculars will be distorted and blurry. This is known as DystopiaVision or ApocolypseScope. The technique has had a profound effect on film-making, equivalent to the effect Citizen Kane (1941) had on Francois Truffaut, or the effect Racket Girls (1951) had on Ed Wood.<br><br>14. In the future, telescopes will be rectangular, even though the optimal shape for high-quality optical lenses is circular -- a fact discovered by glass-makers even before the invention of the telescope. On the other hand, a rectangular case has the added advantages of being bulkier and more difficult to hold and focus.<br><br>15. As already noted by the alert reviewer randall-50: In the future, internal combustion, prop-driven, light civil aircraft will dispense with magnetos in favor of distributors. Such crisp screen writing and attention to detail is worthy of Kubrick, or at least Microsoft Flight Simulator.<br><br>16. After ten years without rain there will not be anyone left in Oregon with an IQ greater than 35.7. Exactly.<br><br>17. When making a dramatic film, never hire someone who is clinically depressed to be your location scout.<br><br>18. When making a dramatic film, be sure to use 100% genuine actors.<br><br>XYZ","user":"AlexanderAnubis","rank":[9,11]},{"title":"Post Apocalyptic Sci-Fi For Teen Girls?","rating":4,"date":"2 October 2016","review":"I guess. If beautiful teen models struggling to survive a violent, widespread water shortage isn't silly enough, the dialogue and acting in \"The Last Survivors\" are too weak to convey believable struggle. The actors just don't have the chops to offer much more than their beautiful faces as entertainment. Put a little makeup on the male lead and he'd be kissable too.<br><br>No offense, but based on most of the reviews on Amazon, young viewers enjoy it as a beautifully shot post apocalyptic teen romance. Fair enough, but I can't imagine any intelligent person over 30 sitting through this vapid chain of artfully composed scenes. I had to fast forward through almost half of the film to see if there was any payoff by the end of this uninteresting, slow moving, cliché ridden story. Nope! And, \"better than the \"Road,\" as one reviewer wrote? Not even close.<br><br>I generally enjoy the low budget post apocalyptic sci-fi sub genre. However, the lack of grittiness and believable survival savagery made this movie too lightweight to sit through.","user":"mr-thousand","rank":[11,15]}]