[{"title":"A Perfect Tribute to a Larger than Life Musician","rating":10,"date":"22 July 2013","review":"Wow! I haven't had this good a time at the movies for some time. <br><br>Usually when I post reviews I mull things over for quite a while but I wanted to put my two cents in while this is ultra fresh. What a great tribute to The Boss. The people who live, breathe and identify with Springsteen's music get the spotlight and showcase in the best possible way why we, the fans, like the man so much. <br><br>The stories they tell range from funny to really touching to downright hilarious on occasion. The way Springsteen connects with his audience is really special and it's displayed through some well chosen clips from relatively recent shows. The rare footage from live shows from way back-when is also a real treat for the die-hard fans. <br><br>I identified with a lot of the people and most likely every viewer will find something they related to as well. I'm a Springsteen nut so, to me, this was a perfect night at the movies. 10 out of 10. <br><br>As an added bonus there was a six song show/compilation from the Hyde Park concert last year (knockout performances of \"Shackled and Drawn\" and \"We are Alive\") that concluded with the Beatles songs \"I Saw Her Standing There\" and \"Twist and Shout\" with Paul McCartney. Seeing it in a theater with the sound yanked up way high is the next best thing to actually being at a Springsteen concert. <br><br>And that \"Epilogue\" was fun too. Seeing those fans meet the man and how gracious Springsteen seems to be; well it was a great ending to a fantastic film and show. <br><br>If anyone has ever wondered what the big deal with Springsteen is...well; \"Springsteen and I\" is the response I would give.","user":"ODDBear","rank":[11,12]},{"title":"Non-Springsteen fans and and casual fans will probably struggle through it, but for those who have him at #1, it's bliss.","rating":8,"date":"8 August 2013","review":"For those who know me, it's no secret that I'm a huge Bruce Springsteen fan. Ever since I got into music properly he's been my #1. Not only does he have what I consider to be the biggest and best discography but his songs speak to me in an overwhelmingly emotional and personal way. I find it difficult to articulate all my feelings towards his music but at the very least he was the artist who introduced me to how great an album could be. I used to just like songs on their own or greatest hits set to shuffle. But with Bruce and albums like Born To Run and Darkness on the Edge of Town, it was the first time I looked at songs as having a place and time and it made music 10x better for all my other favourite artists. Shortly after my big Springsteen obsession was when I started looking at music critically.<br><br>So it certainly looks like this documentary, Springsteen &amp; I, is built for me. Even better, it's coming off the back of Life In A Day, a 2011 documentary I saw when it came out, immediately fell in love with and it remains in my top 10 of the year today. I feel almost honoured that its crowd-sourced footage style is being used next for a Springsteen documentary when it could've been used for anything else. I remember the day they first asked for footage and I quite regret contributing. Unfortunately I was busy at the time and I didn't have all the Bruce merchandise I wanted on me. But I am quite glad I didn't end up a part of it because it would've been rather strange to see myself. And having seen it, I see what they wanted now. They wanted the charming flaws and quirks of real people.<br><br>They keep in the outtakes. They keep in the eccentric people. They keep in the people who can't stand Bruce. They focus on people of contradictions as a young woman working on her masters degree who works as a truck driver and a middle aged man who breaks down crying while he drives. Just like the diversity of Bruce's songs, the film has its emotional ups and downs with its great sense of humour and people who are overwhelmed in trying to articulate what Bruce means to them. There's also some really entertaining anecdotes of people who've had encounters with him too which I'm glad they included and as they show people describing the events, it's matched with the concert footage. The documentary just encapsulates why I love Bruce. It's in the life he pumps into the world. How he makes everyday life feel like living life to the fullest. He brings people together. Through mutually liking his music and being together at concerts, in movies and now in movie theaters.<br><br>Unfortunately, the film is rougher and not as sharp as Life In A Day. Of course, when you have a film that's from the footage of everyday people and there's no standards of equipment, it inevitably leads to technical flaws besides the one area the director has control of - editing and structure. Although pacing can't really be controlled in each clip, the latter is the one department Springsteen &amp; I really struggles with. But then there's no real structure to follow so it ends up as stream-of-conscience which sometimes feels like repetitive fan worship rather than cutting deep into why Bruce deserves his many fans. Fortunately Bruce's music interspersed throughout ties it all together. Non-Springsteen fans and casual fans will probably struggle through it but for the small but warm community that considers him #1, it's bliss.<br><br>8/10","user":"Sergeant_Tibbs","rank":[8,9]},{"title":"BRuuuuuuuuuccce!!!!","rating":10,"date":"23 July 2013","review":"Well this is my very first IMDb review so here goes.. I have to say I'm somewhat of a latecomer when it comes to Springsteen and his music. My uncle has always been a huge fan and I never truly understood why until recently. I went to one of his concerts for the first time and it was something truly special, something I had never experienced before. I was there for intrigued about this film\\documentary about the boss so thought I would go see it. What can I say it was a great tribute, funny at times but also very emotional. From the Elvis impersonator to the boss playing and singing in the street with a busker I thoroughly enjoyed this from start to finish. Springsteen's passion and energy on stage is truly captivating. The London concert at the end was a great finish, I was tapping away like a teenager at a 1D concert. Go see it, I am now a true convert!!!!!","user":"dcoultas4","rank":[10,13]}]