[{"title":"A Welcome Relief","rating":10,"date":"19 January 2015","review":"I'm a big movie buff and I focus on the values of writing, production, and entertainment. I'm tired of all the buddy-cop, cookie cutter action movies these days. They are ALL THE SAME. I look for movies that have interesting ideas.<br><br>Frontera was a welcome relief to my annoyance with the current movie industry. The writing was very well done and the pacing was perfect. I felt interested and engaged the entire time. I like how the Mexicans actually spoke Spanish. Even though there were a lot of subtitles, it was much more realistic. <br><br>I loved the implications of importance placed on the family. The families of Miguel, Roy, and the sheriff are all placed in extremely difficult situations which must be overcome. I feel like most people could relate to these situations in some way-- I did. In addition, the things that Miguel's wife goes through sheds light on the circumstance and difficulties of those looking for a better life. The maltreatment and suffering they go through are real.<br><br>Finally, I loved the ending. My heart was racing because I had established a personal affection for the characters. This movie was well worth my time.","user":"doggett-clint","rank":[19,20]},{"title":"Very well done stuff, excellent acting, rich plot, vivid locations shooting","rating":7,"date":"21 January 2015","review":"Frontera (2014)<br><br>Part of me says: any movie that helps our understanding of the real illegal immigration situation from Mexico should be watched. This does that.<br><br>The problem is made immediate and intimate, and you are meant to understand both sides of the issue. It also avoids for awhile the sensationalism of lots of these cross- border dramas. A young man crosses into Arizona in one of those remote areas where it seems possible to sneak through and walk away. Some American kids taking pot shots at him with a high powered rifle end up accidentally killing an American woman on her horse (she falls off when the horse is spooked) and the immigrant becomes the main suspect.<br><br>This all happens early in the movie, and it is the dead woman's husband, played by Ed Harris, who holds up the other half of the movie. We follow then the Mexican (played by Michael Peña) as he flees and encounters \"justice\" (and later his wife, played by Eva Longoria arrives to help him). And we follow Harris who steadfastly digs into what really happened. <br><br>So there is plenty of drama here (one reviewer on rotten tomatoes said this had no drama, and that is completely false—just wait until you get to the coyotes kidnapping people). And yet there is a sense of balance, that there are good guys and bad guys and misapprehensions on both sides. You might say this makes the movie too balanced, so it lacks punch, but instead I think it has depth, which is better.<br><br>It's imperfect, for sure, as things get wrapped up and plots become increasingly intertwined. But overall I found it strong and well intentioned. And well acted, set in some genuine looking arroyos and deserts (it was filmed in New Mexico).","user":"secondtake","rank":[12,12]},{"title":"Made For Ed Harris...","rating":10,"date":"12 December 2014","review":"Having worked as a photojournalist in New Mexico I am always a bit hesitant to watch movies purporting to depict the \"Border Problem.\" Thus when I ran into this movie on Netflix I was at first hesitant to give it a try. Happily, my reservations proved unfounded as this turned out to be one of the best movies I've seen in the past year or two. The lead role was virtually made for Ed Harris and his stoic, unwordy, acting style fits into the theme like a hand fits into a custom made glove...just right! Residents of the American Southwest are not known for wordiness and Ed's quiet although intense acting more than rings true throughout...lending an air of authenticity all too rarely encountered these days.<br><br>Michael Peña, Amy Madigan, and Eva Longoria were all excellent and the cast fit together as well as the hand fit the custom made glove referred to earlier.<br><br>As far as comments made by other reviewers relating to the movie sidestepping the more controversial aspects of the current immigration scene I'm not sure I agree. It's a complex issue and any movie attempting to render solutions will fall flat. Surely it's more than enough to attempt to put a human face on what's become a political hot potato and media frenzy bullseye and this movie more than succeeded in doing that.","user":"bikerhiker46","rank":[19,21]}]