[{"title":"Have your tissues handy","rating":6,"date":"14 March 2016","review":"Fathers and Daughters is an entertaining film that at many times will have you reaching for the tissue box. The film mainly revolves around Katie a young woman who struggles to form any real relationships in her life. The film moves between her childhood to present day throughout the film. Some movie goers find this annoying, however I thought this added to the film and was done well. On the downside, there were times when some scenes didn't need to be there and this resulted in the film ending rather abruptly instead of exploring deeper issues which I feel viewers would have responded well too. Overall, a good watch but not a 'must see'.","user":"amandataylor-03790","rank":[19,23]},{"title":"A beautiful tear-jerker","rating":8,"date":"30 October 2015","review":"Fathers And Daughters: A movie that would have made me book the first flight home without waiting for holidays if I still lived overseas. I mean it. Yes, I'm a \"daddy's girl\", and I've been lucky enough to enjoy this beautiful movie with my father (well, my mum and brother were there too, but dad was a 'must' from what I'd heard about the film). As one can easily guess after seeing the trailer, it's a touching piece, and the cast does a great job in reflecting the story on screen. Gabriele Muccino delivers the plot with a non-cliché flow, he's very successful with the flashbacks, and one of the strongest aspects of F &amp; D is the amazingly beautiful music, in my opinion. Particularly the Carpenter's cover by Michael Bolton, Close To You adds so much, not to mention that it squeezes your heart during a particular scene. Speaking of heart-squeezing, I think Russell Crowe has made a habit of making his audience cry, especially with The Water Diviner and now, with Fathers and Daughters. As expected, he does not just act, he 'becomes' Jake Davis, and forms multiple lumps in your throat with the character he portrays. As one of the best actors of our time, if not the very best, he's simply amazing. Also, the chemistry between R. Crowe and Kylie Anne Rogers is great, it's heart-warming and so 'real', if I may say so. Kylie Anne is the sweetest potato chip, that goes without saying, and I need to add that at some point I did hate Bruce Greenwood and Diane Kruger.. well, not them, but the characters they played, of course. Needless to say, Jane Fonda was one of the shining stars of F &amp; D, and I think Amanda Seyfried and Aaron Paul were well-chosen for their respective roles, *thumbs up* to them both. Taken together, I loved the story, it was beautifully transformed into a tear-jerker on screen, and I sincerely hope this movie gets released in every country -because it's a sweet piece of art which reminds you of the most important and valuable things in life. PS: Keep tissues nearby when you're seeing F &amp; D. Am not kidding.","user":"ipekmine","rank":[74,104]},{"title":"Incredible Acting & Emotion Covers Up Almost All Faults","rating":8,"date":"27 February 2017","review":"Based strictly on content, \"Fathers &amp; Daughters\" is not the type of movie I would usually see. However, after watching the trailer and seeing the star power of Russell Crowe, Amanda Seyfried, and Aaron Paul, I decided to give it a try. While the plot of this film can be a bit shaky at times, one almost doesn't realize it because the quality of the acting invokes such strong emotions all the way through.<br><br>For a basic plot summary, \"Fathers &amp; Daughters\" opens with writer Jake Davis (Crowe) struggling to cope with his life after the loss of his wife in a car accident. Fortunately, he still has his lovely daughter Katie (Kylie Rogers), but even that is threatened when his seizures and medical problems begin. Flash-forward 20-some years later, and Katie (Seyfried) has grown up to become a successful social worker...who is also as promiscuous as they come in terms of love life. However, when a new little girl named Lucy (Quvenzhane Wallis) is put in her care, and then Katie meets Cameron (Paul), she begins to be confronted by the demons in her life that have caused her so much pain.<br><br>I wish I could say that \"Fathers &amp; Daughters\" is a \"best of all-time\" type of movie, but the fact is that it isn't. The writers/producers/director make some head-scratching choices about how they play the narrative out, and there are a few key plot points missing that probably needed to be included to make this a \"tighter\" film. So, this is really more of a \"niche\" film built on emotion.<br><br>But boy oh boy, though, does that niche ever get filled perfectly here! I'm not usually one to get overly emotional during a film-watching experience (at least visually), but \"Fathers &amp; Daughters\" moved me to tears on a few occasions. It truly is that powerful of a film, as it deals primarily with the relationship between a father and daughter (something that isn't always seen in these types of films). It would have been very, very easy for this film to turn into a typical tearjerker, as all the elements for it are indeed present. Fortunately, although not without a few hiccups along the way, it ends up producing natural instead of contrived emotions, which I have a great deal of respect for. All the emotional moments in the movie feel earned.<br><br>In large part, I believe that is due to the incredible acting performances in the flick. It has been awhile since I've seen a movie where every performance was this spot-on. Crowe really commits (and when that happens, he's always golden), Seyfried is (as usual) perfect for her role, and Paul is absolutely killing every role he takes these days. Even the youngsters, Wallis and especially Rogers, bring the emotion perfectly.<br><br>So, while \"Fathers &amp; Daughters\" may not rise to elite heights due to a few storytelling difficulties, it has more than enough acting and emotion to be a solid film. It uncommonly moved me during my viewing of it, and I will always remember the experience because of it. Even if this doesn't look like your \"cup of tea\", you may want to give it a chance, as more than likely you'll be moved as well.","user":"zkonedog","rank":[9,10]}]