[{"title":"Must see for any fan of this genre","rating":7,"date":"20 February 2015","review":"I just watched this film and came away completely surprised by it. At first I thought it was just another run of the mill horror flicks as I didn't watch any trailers and just went on the movie artwork. How wrong was I. I was so impressed by this film I logged onto IMDb hoping to see some well written reviews of this gem but to my shock Im presented with a 4.4 score!! Who is coming up with this stuff?<br><br>Let me just make this simple for you, if you liked the film Drive and don't mind a bit of violence and want a strong female lead then this is the film for you.<br><br>Fantastic score and visuals and a real moody vibe to the whole thing. Yeah, some scenes are a little bit unnecessary but I can totally let it off.<br><br>Great flick.<br><br>7/10","user":"alex-eastaugh","rank":[22,32]},{"title":"Above average","rating":9,"date":"9 February 2015","review":"The ratings is not really doing this movie justice at all in my opinion. Technically its superbly shot and in this aspect the director has really done a good job. I just loved the soundtrack of this movie and it greatly blends and embellishes to again suit the specific atmospheres. Tracks of Lark, Vuvuvultures and Ske are featured among others. Acting is also above par.<br><br>The main issue with this movie has to do with its script that undermines all the positives above. As a man I was uncomfortable watching this. The woman are brutalized by a huge group of almost ordinary educated young men, her male therapists stay faceless until the end of the movie when he is also revealed to be a monster as the \"breakthrough therapy\" (with the \"100% success rate\") he sells involves murder. Again, like in so many movies men are portrayed as monsters. The generalizing theme go further when the lead totally reject all males after the incident and become lesbian. I was thinking about how hypocritical the whole movie and gaming industry has become. GTA5 for example is heavily criticized for its stereotyping of women, yet no sex is more stereotyped and dehumanized than males.<br><br>I did however realize that one may be a bit oversensitive about the stereotyping aspect. Reason is it would be difficult to make a horror movie without some degree of stereo tying. Also the victims themselves become savagely brutal in their revenge, killing some characters that did not do her harm. Is this the directors way of saying that revenge on this scale turns you into a full spectrum monster? We don't know because she is never caught or show any regret. Or will some viewers see this as a society that made her a vengeful monster playing into the hands of the male hating radical feminists? This is the problem.<br><br>Although a morose topic this is definitely worth watching if you can look past the possible thoughts of stereotyping.","user":"skyrim2011","rank":[22,36]},{"title":"Modern-day, Reality-based Blood & Gore","rating":6,"date":"13 February 2015","review":"6.5 of 10. While the Saw films accomplished the same modern-day, reality-based blood and gore, the extremes and contraptions involved took a willingness to fantasize to believe something like that could happen. With Julia, there's no need for imagination or fantasy and nearly everything that's left to imagination in other films is visualized on screen.<br><br>Amongst other parts of it to enjoy are the soundtrack integration and the focus of the film. It doesn't try to be something more or imply something other than what the story is about.<br><br>What's missing seems to be pacing and acting and a few unedited non-sequiturs. Otherwise, you get a goth/emo-chick horror with some mystery without suffering through make believe monsters or heroes.","user":"in1984","rank":[13,20]}]