[{"title":"Super w Long Shelf Life","rating":10,"date":"3 February 2015","review":"I saw Me &amp; Earl last week at Sundance and have not stopped thinking about it. That is a long (6 day) shelf life. What more can one ask from a film? The writing and execution is elite quality. All scenes seem necessary. Parent/child relationships, peer relationships, teacher/student relationships all are captured in humorous and touching ways. Life and death realities are also visited through the lens of \"kids\" who make as much sense as possible when facing the grim possibilities of severe illness.<br><br>Sorry to be redundant from other reviews but this darn film has HEART and should be required viewing for anyone who sees at least one movie a year.<br><br>Thanks to the team that made this one happen.","user":"tomtobias-230-837004","rank":[194,230]},{"title":"Brilliantly authentic and deeply touching","rating":9,"date":"12 October 2015","review":"There are about four films that can overcome the \"seen it\" cynicism I have, unlock my heart and make me feel genuine feelings. In other films I can appreciate that the film is beautiful and emotional, but there are only four that can really get to me. The first was Crash, the second was The Green Mile and the third was Boyhood. Me and Earl and the Dying Girl just scored the fourth slot on that extremely small list. Alfonso Gomez-Rejon's film is a beautiful cocktail of wonderful things. Its quirky and charming and witty and touching and somber and delicate and completely beautiful. Its got elements of about six of my favourite films of all time, and the fact that it slam dunked Sundance doesn't even surprise me a bit. <br><br>Thomas Mann's Greg is a weirdo. Imagine that Napoleon Dynamite went to Cady Heron's school from Mean Girls, hated all the clicks and became a cynic. Mann shades what could've been a completely unlikeable protagonist with wonderful colours and depth, so much so that when his friend Earl explains to Rachel why Greg is so averse to being friends, we realise we've actually known the whole time. That's probably the most beautiful part of Gomez- Rejon's direction - he never comes out and beats you with information, he leads you gently to it and makes you realise it yourself. RJ Cyler takes Earl, a generic Pedro-type sidekick and makes him just the slacker you'd expect, but with incredible qualities underneath. Olivia Cooke makes the audience love her with her quietly devastating portrayal of a girl with leukaemia. All I can say is that she is a worth recipient of my annual Patricia Arquette Award For Character I Most Want to Hug.<br><br>Considering this film has maybe one actor I'd ever heard of, there's a huge pool of talent even in the supporting cast. John Bernthal is good in everything. Nick Offerman is amazing as Greg's stay at home intellectual dad, and Molly Shannon steals every scene as Rachel's emotionally destroyed mother. Keep an eye out for Matt Bennett's utterly bizarre but hilarious Scott Mayhew as well.<br><br>Jesse Andrews' screenplay strikes an incredible balance between comedy and drama. Its very easy for a film about cancerous teens to become completely depressing and tedious, but the witty dialogue, incredible spikes of humour and quirky characters make the film beautiful. Andrews isn't trying to make a statement, he's just telling a story about a normal boy who strikes up a friendship with a normal girl. The dialogue is as real as any movie I've ever seen, and the use of minimal effects and hand-held camera really created an authenticity that made me walk away feeling like I've just watched a highly personal reflection, and not a work of fiction.","user":"luke-a-mcgowan","rank":[66,75]},{"title":"Me and Earl and the Dying Girl: Proof That Laughter Can Help Ease the Pain of Dying","rating":8,"date":"8 July 2015","review":"Me and Earl and the Dying Girl offers a very accessible, honest, and humorous look at not only how someone deals with being diagnosed with cancer, but it also turns the clichés of the coming-of-age story on its nose, and the people behind this film are able to do that by finding the perfect balance between drama and comedy within this unfortunate tragedy. <br><br>Me and Earl and the Dying Girl centers around Greg (Thomas Mann), a very sarcastic and self-loathing high school student going into his senior year. Greg believes that if he shuts everyone out of his life so that he won't have to deal with anything, then things will be okay, and this gives him a sort of self-gratification. So to uphold his philosophy, he doesn't try to be friends with anyone, but makes sure he's on low-key, good terms with everyone in his school. However, he does spend his time with his co-worker/\"friend\" Earl (RJ Cyler) making parodies of classic foreign cinema together. However, when Greg learns from his mother that a childhood friend of his, Rachel (Olivia Cooke) is diagnosed with Leukemia, Greg begins a blossoming friendship with Rachel; a friendship that would take him through the best of times, the worst of times, and eventually shape him into the person that he will become. <br><br>While this film definitely shares characteristics with 2014's The Fault in Our Stars (which is a pretty good movie in my opinion), this film to me is more heartfelt and inventive than TFiOS ever was. And most of this has to do with the brilliant screenplay written by Jesse Andrews, who happened to write the book that his film is adapted from. The way that Andrews addresses how to deal with this sickness is wonderfully human and clumsy; whether through comedy, wit, or drama, Andrews finds a way to make the whole scenario relate in some way, shape, or form to anyone and everyone.<br><br>The direction and cinematography are absolutely incredible. Alfonso Gomez-Rejon, who is known for his work on American Horror Story, and was a personal assistant to Martin Scorsese, shows not only his inventiveness, but his quirkiness as a director on this film. Gomez-Rejon shows his talent with stop motion animation, long panning shots, flashback sequences, and some very long takes that really allow the actors to give the best performances possible. There are even times when this feels like a Wes Anderson film, and this can also be contributed to the gorgeous cinematography. Chung-hoon Chung oozes with style behind the camera, and ultimately the film has a very vibrant look that gave the story being told so much life. These people tell this story with so much care and thought, it's evident that the filmmakers truly respected Andrews' work on the screenplay and wanted to do it the justice it deserves. And thankfully, we got it here.<br><br>The performances in this film are all magnetic. Every single one of these actors were able to hold their own on screen. The parents in the film, played by Molly Shannon, Connie Britton, and the always delightful Nick Offerman, all do fantastic work. Their relationships with their children are all very grounded in reality and realistically portrayed. Jon Bernthal is incredibly funny as Greg's history teacher, and is able to depict the \"generic cool teacher who understands the main protagonist\" in a different, refreshing light. However, the three leads all steal the show. RJ Cyler serves as a foil to Greg's character. Instead of BS-ing people in order to avoid any direct confrontation, Cyler's Earl is very frank with his language and emotions, and gets right to the core of the problem with Rachel. Olivia Cooke gives a very heartfelt and understated performance in this film, and watching her suffering through this sickness that's eating her up is truly heartbreaking to watch. However, the whole film rides on Thomas Mann's shoulders. His detached performance, and the way he handles Rachel's sickness is so realistically somber. His character actually reminds quite a bit of the characters Anthony Michael Hall played in older John Hughes films. He does a fantastic job with the darker comic moments in the film, and the way his character develops throughout the film is nothing short of stellar. <br><br>This film won both the Grand Jury Prize and the Audience Award at the Sundance Film Festival this past January, and it's not hard to see why. Me and Earl and the Dying Girl is a film filled with heartbreakingly realistic performances, quirky direction, gorgeous cinematography, and spectacular writing. Whether your an art-house fan, a fan of cinema in general, or just the casual moviegoer, there's something in this film that everyone can relate to. It's in wide release right now, so do yourself a favor and go see it, because it's one of the best films of the year.","user":"jbroc62","rank":[108,130]}]