[{"title":"\"Sometimes a blind pig finds a truffle\"","rating":8,"date":"18 March 2017","review":"Bank robberies have been featured in many hundreds of films since the early days of cinema: The Great Train Robbery for example dates back to 1903! More recent heist classics such as \"Oceans 11\", \"Die Hard\", \"Run Lola Run\" and \"The Dark Knight Rises\" tend towards the stylised end of the act. Where this film delivers interest is in aligning the protagonists' drivers with the banking and mortgage 'crimes' featured in last year's \"The Big Short\". Add in to the movie Nutribullet a soupçon of the West Texan setting from Arthur Penn's 1967 \"Bonnie and Clyde\", turn it on and you have \"Hell or High Water\".<br><br>Chris Pine (\"Star Trek\") and Ben Foster (\"Inferno\", \"The Program\") play brothers Toby and Tanner Howard trying to rescue their deceased mother's ranch from being foreclosed on by Texas Midlands bank. Rather than taking one of the \"get out of debt\" offers advertised on billboards – cleverly and insistently introduced in long panning highway shots – the brothers have their own financial plan: a scheme that involves early morning raids of the cash drawers of small-town Texas Midlands branches. But the meticulous planning of Toby, as the calm and intelligent one, are constantly at risk of upset by the unpredictable and violent actions of the loose-cannon Tanner.<br><br>Since the amounts of cash stolen are in the thousands rather than the millions, the FBI aren't interested and the case is handed instead by aged and grumpy Texas Ranger Marcus Hamilton (Jeff Bridges, \"True Grit\") and his partner Alberto (Gil Birmingham). The pair have a respectful relationship but one built around racial banter, with Hamilton constantly referring to Alberto's Mexican/Comanche heritage. A cat and mouse game ensues with the lawmen staking out the most likely next hits. The sonorous cello strings of the soundtrack portend a dramatic finale, and we as viewers are not disappointed.<br><br>The performances of the main leads are all excellent, with Chris Pine given the chance to show more acting chops than he has had chance to with his previous Kirk/Jack Ryan characters. His chemistry with Ben Foster is just sublime. Similarly, Jeff Bridges and Gil Birmingham make for a formidable double act. It is Jeff Bridges though who has the standout performance and one that is Oscar nominated for Best Supporting Actor. (In fact with Michael Shannon also getting nominated in the same category for \"Nocturnal Animals\", we can add 'West Texan lawman' to 'Holocaust movies' (a Winslet \"Extras\" reference there!) as the prime bait for Oscar nomination glory!)<br><br>The real winner here though is the whip-smart screenplay by Taylor Sheridan (\"Sicario\") which sizzles with great lines: lines that make you grin inanely at the screen regularly through the running time.\"In your last days in the nursing home, you'll think of me and giggle\" schmoozes Tanner to the pretty hotel check-in girl: a come-on clearly worth remembering as it delivers the goods, as it were.<br><br>The trick here is in building up a degree of empathy and sympathy for the characters on both sides. The 'bad guys' here are successfully portrayed as the banks. Before the 2017 awards, you could get 25/1 odds on this winning the Best Original Screenplay Oscar – but I would personally rate it right up there with \"Manchester by the Sea\".<br><br>Deftly directed by Scot David Mackenzie (\"Starred Up\") this is a film (the first of two!) that might well have elbowed it's way into my Top 10 of 2016 if I'd seen it during its cinema release. Well worth catching on the small screen.<br><br>(For the graphical version of this review, please visit bob-the- movie-man.com).","user":"bob-the-movie-man","rank":[76,85]},{"title":"Gritty and Engaging - Great Addition to the Crime Drama Genre!","rating":9,"date":"26 July 2016","review":"With Taylor Sheridan as the writer and David MacKenzie at the helm, I had high hopes for this movie. Both of their last respective projects (Sheridan - Sicario, MacKenzie - Starred Up) were gritty, violent, and engaging. All of those hold true for Hell or High Water.<br><br>The main characters, Chris Pine and Ben Foster turn in great performances. Ben Foster plays the ex-con brother. And as usual, he turns in what I think was the best performance of the movie. He has a knack for playing a top notch supporting role, and often times gets overlooked. Chris Pine also nails it as the more straight laced brother. For a pretty boy of Hollywood, his portrayal is authentic. Jeff Bridges also compliments these two well as the older, sort of jaded officer. Both him and Foster even provide a good amount of laughs, but neither overdo it.<br><br>The setting of the movie really sets it above others in the genre. I would say this movie is more crime/drama or heist film than Western, but it definitely has a Western vibe due to its northwest Texas setting. The area has been hit hard by the recession, a failing farm industry, and big oil. It all makes the recklessness and danger Foster and Pine engage in that much more enjoyable, and even sort of relatable. The audience can at least sympathize with them as they do what they think is right. <br><br>Overall, this film is well worth a watch. It can be put in a league with more recent films like The Town, Drive, and The Place Beyond the Pines.","user":"ehost7","rank":[196,236]},{"title":"Refreshingly original, brilliantly acted, thoughtful western/crime film","rating":10,"date":"13 August 2016","review":"In a summer (or should that be year or decade) of vapid sequels, remakes, and overblown superhero catastrophes, who would have expected an entertaining, intelligent, well-crafted, suspenseful, character- driven, modern-day western with a brain. Riding on Taylor Sheridan's razor-sharp script and David Mackenzie's nuanced direction, Jeff Bridges, Chris Pine, and (especially) Ben Foster (along with everyone else who appears on the screen) inhabit this film as wryly humorous, heartfelt, vicious, painfully tragic, and realistic members of a society reaping the fruits it has tragically sown. Best film so far this year.","user":"rick-j-walsh","rank":[217,270]}]