[{"title":"Don't waste your time","rating":1,"date":"15 November 2016","review":"This movie can be summed up in a single word: awful. The performances were phoned in, the plot was weak, and the premise was ridiculous.<br><br>***** SPOILERS *****<br><br>The person who wrote this drivel apparently expected everyone to believe a number of complete implausibilities: that a catatonic boy who requires extreme care would be released to a home that lacks any accommodation for his condition other than an adjustable bed; that someone could convincingly fake being catatonic for six months; that despite his need to never be seen moving about, he also managed to slip his mother frequent doses of a tranquilizer that had been prescribed to him (we aren't shown how he managed this); that somehow the missing pills were never noticed during the six month period; that a raccoon rummaging in the garbage outside would wake her from her drug- induced sleep feeling compelled to investigate, but her supposedly catatonic son running around the house at night didn't disturb her a bit; and that the little boy trapped in the house only managed to make it to Naomi during the night when she was in drugged slumber and the fake catatonic was free to run around, not during the day when the fake catatonic had to sit passively in his chair or reveal his farce.<br><br>In my experience, the care the makers' of a movie take with the minor details shows how much they care about the production as a whole. Here, they apparently didn't give a f---. An unexpected visitor tells the mother that the huge storm raging outside has already deposited so much snow that the end of her driveway was blocked when the road was plowed. Yet a little while later, when she runs outside, her driveway appears freshly plowed and there is a well beaten path to a dock on a little lake or pond. Despite the supposedly raging winter storm, the dock is free of snow and ice. Although it is supposed to be bitterly cold, there is not so much as a crust of ice on the pond/lake. This list could go on and on, but that's enough.<br><br>In short, there are so many good movies out there, that it would be a shame to waste any time watching this one.","user":"ddbeuth","rank":[77,100]},{"title":"Predictable thriller....","rating":6,"date":"19 February 2017","review":"Shut In is a rather predictable thriller that treads a well worn path.<br><br>That's not to say this is a poor film, its just that this concept has been recycled so many times, its become rather obvious whats happening and where its going.<br><br>Naomi Watts hands in a decent effort in the lead role and indeed, the cast in general hand in competent performances. The tension builds nicely but I felt, the reveal was too sudden and robbed the film of much of the scare factor that had been built up to that point. <br><br>The actions of the key character also seem a bit absurd at times as does the overall concept, which stretches credulity to a degree.<br><br>In short, not a bad film if you like a few scares but regrettably nothing terribly special either. Six out of ten from me.","user":"s3276169","rank":[22,28]},{"title":"A movie with really good acting but just never really settled into something I could get involved in.","rating":5,"date":"31 January 2017","review":"\"I just want to help you.\" Mary Portman (Watts) is a child psychologist that has lost her husband and is taking care of her invalid son. She does her best to counsel other children while her life is crumbling down. She becomes concerned with one child in particular and now she has to decide to do what is best for the child. What she wants, or what others think. This is a movie that is worth watching because of Naomi Watts. She does everything she can to hold this movie together but it still just doesn't work. The movie starts off OK, but by the end it was hard to tell what was actually happening and what was real and what wasn't. I do like movies you have to think about, but this one just didn't make sense and you are left thinking about what is happening, then something else strange happens and you are trying to figure out how it fits and then something else happens and you just give up. That is not a good thing to happen in a movie. Overall, a movie with really good acting but just never really settled into something I could get involved in. I give this a C-.","user":"cosmo_tiger","rank":[27,36]}]