[{"title":"A great story. Incredibly heartwarming.","rating":9,"date":"22 February 2020","review":"With Stephen Chbosky's top-notch direction, a clever and elaborate script by Jack Thorne, Steven Conrad and Chbosky, a beautiful soundtrack by Marcelo Zarvos and Bea Miller, great makeup and amazing performances by Julia Roberts, Owen Wilson, Jacob Tremblay and Izabela Vidovic, Wonder can be exciting, a lot of fun and one of the best movies of 2017","user":"MR_Heraclius","rank":[46,48]},{"title":"what's the issue, people?","rating":9,"date":"3 November 2018","review":"Geez, reading some of these reviews makes me feel sad for some people that they couldn't enjoy this movie.<br><br>First, I should state that I read the book. The movie adaptation stays pretty close to the book, and definite captures the tone and structure.<br><br>Second, what the heck is wrong with this being lighthearted? No, it was not meant to be a poster of what bullying is always like. I saw comments along the lines of, \"I was bullied and this is crap bc it's so much worse.\" Please don't compare your experience to this fictional movie/book. It is not meant to be a representation of bullies and the bullying experience everywhere.<br><br>Third, if you found this shallow or thought it was just meant to talk about bullying you're just plain wrong. Several characters were deeply developed and multi-dimensional. Not one character is perfect (although Summer comes pretty close).<br><br>Fourth, the point you missed. This story is about a family that struggles with their own personal things as well as an issue with one family member that affects them all in different ways. The friendship storylines are similar. The point of this book (and it was definitely written for younger audiences, that should be noted), is to give kids a broad overview of how bullying affects others and ways they can combat it. I love that the ending raises Auggie up: the point is how a family can support one another and how that can create resilience in a child and then how the larger community can work together (and in some instances, confront and change) to cheer one another on. Is this idealistic? YES. Is it meant to be, to teach and illustrate a lesson on how things can be if we work together, first in our own homes and then in our communities? YES.<br><br>One final note, because I see people do this over and over again now with movies and literature. To the person who said something along the lines of, \"it's so hypocritical that we're supposed to be rooting for people to not judge Auggie and then he judges people by their shoes.\" Did you just need to feel offended and self-righteous? My gosh. This is real. awe all judge people, if Auggie didn't, who himself is constantly judged, then how would he be relatable at all? The author (and the movie) go on to challenge these assumptions. The \"hand-me-down\" kid is a friend, then messes up, then tries to make it right. The \"crazy\" girl consistently pushes back against the bullying in a way that many kids do (it's less confrontational and more socially acceptable); that's real. And the \"trust fund\" kid continuously pushes his privilege around in often mean ways, that we all sometimes do without thinking. There had to be a bully somewhere for the story to even unfold, right? And turns out his mom does the same: back to the point of it starting at home.<br><br>Okay, I'm done being annoyed with humanity now. &lt;3<br><br>Just enjoy the movie and use it to teach your kids to support one another in the home and stand up for what's right when they're not home.","user":"staycfishbates","rank":[104,116]},{"title":"A perfect family movie","rating":10,"date":"19 November 2017","review":"We Need this type of movies nowadays!<br><br>It is an emotional, funny &amp; uplifting story. I was fully sympathized with August Pullman. It was so wonderful to see and feel everything through him. The way he describes everything is so beautiful. Also, knowing the story from the perspective of certain characters made a strong connection between me and them.<br><br>I read the book. It was awesome too. Some details were changed in the movie but were good changes and there are some details from the book I hoped the movie to show it and it didn't but that didn't affect the movie in a negative way. Everything was simple, clear and on point. The movie has strong messages about kindness, love, appreciating everyone for who they are and true friendship.<br><br>Jacob Tremblay proves again his talent as an actor. You won't recognize him because of the makeup but his expressions, voice and eyes were really persuasive. All the kids are amazing. Izabela Vidovic surprised me a lot. Julia Roberts is excellent and Owen Wilson was great. He was exactly as I imagined him while reading the Book.<br><br>Finally, Stephen Chbosky. Great job man! Once again he made me care about the characters and he portrayed them beautifully specially the kids. He let them shine in every scene.<br><br>I loved this movie so much. I had a great and enjoyable time with it. I laughed and cried. It is pure and heartwarming. This is a perfect family movie.","user":"Fadi_Michel","rank":[137,172]}]