[{"title":"Not bad, not great","rating":6,"date":"1 March 2014","review":"Another action movie where one man messes up with a lot of people and he shows what he can do on his own. This guy's name is Frank, but we will remember him as Bullet, and he is a cop. Not a usual cop, though.. They kidnap his grandson, he gets angry and he is going to do anything to get him back to his mother. The lead actor is Danny Trejo. I really appreciate him, I like his face and the way he is acting in action movies. He looks quite badass. Well, I prefer the \"Machete\" style, but he is OK at this movie, even as a cop.<br><br>Don't expect too much from this movie. There are definitely better at this kind, but you won't be disappointed. Its short lasting (1 hour and 20 minutes) helps the viewer to watch the movie without getting bored. If you have seen a lot of action movies and you are trying to find another one to see, give this movie a chance, I think that it won't be harmful. But don't expect too much from that particular movie. If you get bored at the beginning, don't shut the film down, because it's getting a lot better at the last 30 minutes.<br><br>Not bad, not great.","user":"akiskanaris","rank":[14,15]},{"title":"Watch the Director's Cut!","rating":9,"date":"11 March 2014","review":"I've been at 2 different screenings and have seen two different versions of the movie - the US cut distributed &amp; cut by Giant Ape and the much better Director's Cut distributed by SC Films International. I just recommend everyone - WATCH THE DIRECTOR'S CUT - these are 2 completely different movies! As a huge fan of Trejo I can't believe what these incompetent guys at Giant Ape did with this movie! The Director's Cut (International version) is really a great cinematic action-thriller, but the Giant Ape / US version is a slow-paced drama which reminds of a typical boring TV crime movie. The slow-paced US cut misses a lot of necessary scenes which are very important for the story, for the characters and for the pace of the movie. Instead it seems like they just put together the worst &amp; most boring scenes with an absolutely boring score (Chris Ridenhour's score in the Director's cut is much, much more better!). The Giant Ape cut should be seized immediately!<br><br>This should be shown on all film schools worldwide as a classic example how editing &amp; scoring can change &amp; ruin a movie.<br><br>Everyone who watches both versions will understand my anger. If you want to see a good movie just watch the Director's Cut (International version)! 9 of 10 stars for the Director's Cut. 1 of 10 stars for the US version.","user":"x-out-945-253120","rank":[9,10]},{"title":"Mostly bad stuff","rating":9,"date":"9 March 2014","review":"I like a lot of direct to DVD movies, and I also happen to like Danny Trejo, so I thought that I would enjoy \"Bullet\". But it turned out to be one of the worst movies I've seen for quite some time. The signs of a troubled production are quickly made evident by the opening credits, which list five (!) writers - too many cooks spoil the broth, and too many writers result in the movie having a lot of moments that are somewhat unclear or don't make the least amount of sense. The low budget also hurts the movie at times. While there are some bits that look very slick despite the low budget, often the movie looks underlit or has rotten photography. Also, the decision to use CGI for bullet wounds just doesn't work, with the splatter looking really phony. The movie is also directed with low energy, with the action mostly coming across as flat and not the least bit exciting. The low energy behind the camera may also explain why Trejo seems to be phoning his performance in instead of going all out. In short, this is pretty lame stuff.","user":"Wizard-8","rank":[8,9]}]