[{"title":"Much better than it's rating...","rating":7,"date":"30 September 2016","review":"This film was really enjoyable, if not a little tacky to start, all the elements worked really well throughout and to the end. I liked the daughters immensely and Robyn Butler was obviously great. Quite a lot of the running jokes throughout were very funny and i often laughed aloud. Hamish Blake was very good, Robbie Magasiva--as handsome and charming as ever. Lucy fry as Honey even wins you over in the end. The weakest link is Portia de Rossi (who I usually like) terrible overacting, unconvincing and extremely weak in comparison to the natural acting styles of the other Australian cast members. The personal relationships between all the supporting cast were interesting as well. I almost didn't watch it because of it's low rating and bad review but it moved along quickly enough to get good and keep me watching. Anyway, I felt bad for it and decided to write a review in the hope more people might watch and enjoy it. I think Australia make spectacular films and always look forward to choosing one from the vast range offered.","user":"dewinteralexandra","rank":[10,13]},{"title":"The title is the most clever element in this movie","rating":5,"date":"7 October 2015","review":"I like Robyn Butler and the writer/producer is the best thing in the movie; it is just a shame that as writer she did not gift herself with a better vehicle for her talent. I found this a bit of a mess, really. There are too many competing characters and story lines and in the end none of them feel satisfactorily resolved or executed. <br><br>With the clever title, and her previous work with husband Wayne Hope on the small screen series like Upper Middle Class Bogan and The Librarians, Robyn Butler gets to do the best shtick and has some great lines but she has surrounded herself with an unlikely and unlikable group of characters making it hard to root for her and her brood. The actors playing her daughters are fine, and 'Wicked' star Lucy Durack has some lovely moments, but the overplayed and contrived tangled web with her sister played by Portia de Rossi and her insufferable daughter played by Lucy Fry give the movie its artificial and irritating elements that for me the movie never recovers from, and they are introduced within the first 10 minutes!<br><br>There are some significant themes and ideas fighting for screen time here, but ultimately they are buried underneath the contrived set of slapstick and mostly unfunny situations that befall the leading character. Maybe 15 year old girls and their mothers will enjoy this more than I! As a female empowerment tale, it feels muddled and compromised; as a screwball comedy it simply isn't compelling enough or humorous enough to forgive some of the extraneous characters viewers are forced to endure, and as a familiar motif of outsider crashes in on an ordinary family and inevitably changes the dynamic, it is not sharp enough in its crafting. As much as i admire the work of this pair of writer/performers, i think they bit off more than they could chew with this project. Robyn Butler's talent alone could carry a project without so many shoehorned elements to compete with.","user":"david-rector-85092","rank":[10,23]},{"title":"Terrible Film! Simply Terrible","rating":2,"date":"25 November 2017","review":"We should stop giving films the okay to do unbelievable things and to you the say \"It's just a movie\" to get away. The whole plot line revolves around the mother of the 16 year old famous Honey trying to lose her innocent look by getting her to become a pop star whose line are all about sex and to have naked photos of her leaked. While the mothers excuse is believable that she wants fame and is on pills, but the rest of the film falls quickly apart. A Local Paparazzi takes window photos of a 16 year old girl and tries to blackmail the family, although in Australia he would've broken dozens of laws and would be facing a big number in prison. The whole husband twist was so foreseen that it added nothing to the story, neither did the romantic interest or the extra detail of the sisters.","user":"dlatorets","rank":[3,7]}]