[{"title":"A great film and welcome break from the jump scare flicks","rating":8,"date":"26 December 2015","review":"I was getting pretty sick of those jump-scare-there's-something-lurking-in-a-dark-corner style movies like Insidious and the Conjuring. And Guillermo Del Toro must have thought the same thing because Crimson Peak is a gorgeous looking Gothic style movie with awesomely designed sets which have an incredible amount of detail to them. This adds a great dark and brooding atmosphere to the film and alleviates the need for these aforementioned jump scares. The story is well written and has great characters played by Mia Wasikowska, Tom Hiddleston and other well cast actors. Unfortunately it got only moderate critical reviews and was also somewhat ignored by the audience in favor of Goosebumps no less. Damn kids, they ruin everything! wink emoticon<br><br>But it might get a second life in the video circuit as people might still discover this very enjoyable movie. Big thumbs up for me!","user":"Jerghal","rank":[49,59]},{"title":"Visual treat","rating":7,"date":"18 October 2015","review":"I only saw this film because I am a del Toro fan--Pan's Labyrinth is my favorite movie. While Crimson Peak does not come anywhere near the quality of Labyrinth in terms of the script, it still showcases del Toro's unique skill for beauty and suspense.<br><br>The sets, costumes and general atmosphere are sumptuous in that signature del Toro way. The luxurious train on the heroine's robe that audibly thumps behind her as she sweeps down the staircase? Yes, please. There is a nod to all the images our minds ever conjured while reading fairy tales. The rich colors, the music, the textures all help draw us in to this world and settle us in for the story.<br><br>The film is not without its flaws. There are a few glaring plot contrivances that had me groaning. There is a superficial quality to the scenes involving Thomas Sharpe's clay mining business.<br><br>I was impressed with Jessica Chastain's talent for conveying two conflicting emotions at once, all playing out on her face, reminiscent of Gillian Anderson in Bleak House.","user":"rivkasue","rank":[92,124]},{"title":"Hauntingly Beautiful Gothic Romance","rating":8,"date":"16 October 2015","review":"Guillermo del Toro is a director and artist whose films fall into two distinct categories: big budget English language blockbusters like \"Hellboy\" and \"Pacific Rim\" and lesser known, low budget Spanish language horror films like \"Devil's Backbone\" and \"Pan's Labyrinth\". His latest film, \"Crimson Peak\" is what happens when these two worlds collide, in other words, a big budget English language horror film.<br><br>\"Crimson Peak\" is set in the late 19th century, first in New York, then in rural England. Edith Cushing (Mia Wasikowska) is a young budding writer who is intelligent, beautiful, and strong willed, refusing to allow Victorian sensibilities dictate what she can and cannot do, and as a result butts heads with those around her. Thomas Sharpe (Tom Hiddleston) is an English aristocrat and inventor who is in New York seeking financial backing for his mechanized clay mining business back home. When tragedy strikes, Thomas marries Edith and brings her to his home, Allerdale Hall in Cumberland, where his sister Lucille Sharpe (Jessica Chastain) is waiting. As Edith tries to fit into her new surroundings, she discovers that secrets abound and nothing is as it seems.<br><br>The visuals in \"Crimson Peak\" are so glorious, they are almost overwhelming. The sets are spectacular visions of beauty and decadence in decay; costumes are intricately detailed and gorgeous; the lighting and over saturated color bring depth and meaning; the ghosts are grotesquely beautiful; and, of course, the del Toro trademarks of insects and clockwork gracefully found their way into the story as well.<br><br>Because \"Crimson Peak\" is a rather large studio production, it is being marketed to a large audience. I believe this accounts for some of the lackluster reviews I have been reading. If one is not familiar with del Toro's prior Spanish language films, they may not understand his unique cinematic perspective. For some, this will mark the beginning of a journey into del Toro's fantasy world, for others it will be a disappointment. For me, it was almost everything I wanted it to be.","user":"jen-lynx","rank":[189,273]}]