[{"title":"We have got a generation of offenders we don't know what to do with.","rating":7,"date":"7 April 2014","review":"Special ops interrogation officer Jimmy Vickers (Danny Dyer) is out for serious revenge on the gang who violated and killed his parents. As he goes about his business, he has to stay two steps ahead of the police and his military employers who want their lethal weapon back.<br><br>Slow justice is better than no justice.<br><br>OK! Lets cut to the chase here, this is ultimately a gruesome revenge picture, the only thing new on offer here is the methods of the executions administered by the seriously brooding Jimmy Vickers. This adherence to formula, a basic modern update of the Death Wish filmic telling of a tale, is enough to send many critics scurrying around for their most poisonous pens with which to articulate their venom. Add in the Danny Dyer factor, a fella who strangely seems to rile so many in entertainment circles purely because of the genre branches of entertainment he works in, then Vendetta was never going to garner favourable reviews in many quarters.<br><br>This isn't revenge. This is a necessity.<br><br>Yet there's a question that springs to mind here, namely, what were they expecting? Tag lines and media headings said Danny Dyer enacts bloody revenge on the murderers of his parents because the law is an ass! Do critics and film fans really go into a film like this, one that isn't hiding under false pretences, expecting a scathing and intelligent observation on the lawlessness of Britain? Or a snarky aside to the failings of the law system? Seriously? Stephen Reynolds (writer and director) has put some thought into his picture, there are some potent passages of dialogue, even if they fall by the wayside as the kills come thick and fast, but it was never marketed to the highbrow seekers.<br><br>You'll be demoted before you can say Katie Price is a virgin.<br><br>Vendetta delivers the goods for those looking for a good night in with a beer and some blood and brooding on the screen. Dyer (a real nice bloke in real life) gives good value as a son hell bent on revenge, whilst he also doesn't look out of place in his fight scenes. Haider Zafar's cinematography is superb, the blues and golds magnetic in their visual appeal, and there's good and solid work done by the supporting cast. <br><br>Vendetta has fans, it really does, so much so that a sequel is currently in production. That news is sure to send those critics sitting up there in their ivory towers at The Guardian and The Telegraph crying over their shrimp salads. But you can bet your last British pound that they will be going to view the sequel expecting a far different movie to the one the man and woman of the street knows they are going to get. Death by cement! Hooray! 7/10","user":"hitchcockthelegend","rank":[19,22]},{"title":"Solid Action-Drama","rating":8,"date":"5 January 2014","review":"When I checked this film it only had a 5.6 rating. My ONLY reason for writing this review is to RIGHT that WRONG.<br><br>There is NOTHING so wrong with this film as to rate it so low. 5.6, to me, means 'boring, predictable, cookie-cutter, Hollywood action films with no 'substance' to them....And even some of those can rate a 6 or so just for pure action fun-entertainment value...But THIS film is MUCH better than those dime-a-dozen action/revenge films and \"Vendetta\" is so well executed. If I HAD to criticize anything it would only be that I don't think the way Alistair Petrie's character, 'Spencer Holland', was written was realistic. It's just my humble opinion that any ranking detective that is next in line for super, would NOT be as dumb as 'Spencer Holland' is written to be. If you like this genre, I don't think you will be disappointed and I'm sure you'd rate it higher than 5.6! ;)<br><br>CAVEAT: Most of the negative reviews of this movie seem to be comparing it to 'GREAT FILMS'...or classics... When I review or recommend a film, I review/recommend it based on the genre and what the movie is INTENDED to be. E.g.You don't compare a Steven Seagal film to a Ridley Scott movie! So what I'm, saying (badly, I admit), is that, for what it's MEANT to BE, \"Vendetta\" is a solid 7-8. (It's not MEANT to be a classic guys!)","user":"jager-marc","rank":[33,48]},{"title":"Cookie Cutter Action movie","rating":5,"date":"5 January 2014","review":"I went into this movie, not expecting anything too crappy, but nothing too brilliant either. I was pretty much bang on the money.<br><br>So a guy seeks revenge on the guys who killed his parents. He bumps off the offenders one by one, yet the police have a hard time trying to figure out who is doing all the killing. The writer tries to make the protagonist into a hero but, in my opinion, fails. <br><br>Vendetta is just another standard revenge movie, with predictable scripting and a character that you try and empathise with. However, I felt that I could not relate to the character (there was just no dimension in any of the acting) and just enjoyed the action.<br><br>If you want to watch a run-of-the-mill action movie, then Vendetta is worth a look. Just be prepared to look beyond some scripting holes.","user":"besimms","rank":[14,19]}]