[{"title":"I should stick to my plan not to watch sequels anymore.","rating":3,"date":"17 August 2018","review":"It does not matter who your parents are,\nwhere you came from,\nwho believed in you\nand who didn't.\nWe are a family now, and we are earth's last defense.<br><br>What amazed me the most was the fact that I couldn't remember much of \"Pacific Rim\", even though I thought it was an original-looking film years ago. No worries. Little by little everything is explained again in such a way that I partially knew it again. And even though \"Pacific Rim\" wasn't high-quality cinema and simply a very expensive monster film with superb looking computer-generated images, the film impressed me at the time. \"Pacific Rim\" was brainless amusement with a high entertainment value. This sequel is simply a duplicate with other main characters in identical Jaegers. But it's so irritating and annoying mostly. I was hoping this time the Kaiju's took control and destroyed planet earth. That way we don't need to be afraid of a possible sequel in the future.<br><br>Since the design and subject are identical to that of the initial film, one could say that it's thanks to Guillermo Del Toro the first film was kind of a success. But that's a bit simplistic to state, in my opinion. I rather think there are several factors that ensure that you can't really call this a successful film. This time the entire Jaeger program shifts from a mature world to that of teenagers. We end up in a cadet school where young people are trained to become Jaeger pilots. A bit like in \"Ender's game\" but now it's not in space. And of course, there's one of the cadets who can't stand the newcomer Amara Namani (Cailee Spaeny) and believes she doesn't belong there. And who will be the hero in the end? Yep, not hard to guess. Anyway, it all feels a bit like a kindergarten. The Goonies in giant robots who save the world. Haven't we seen that before?<br><br>Also, the acting wasn't something to get enthusiastic about. Cailee Spaeny was acceptable with her youthful enthusiasm and rebellious behavior. John Boyega sometimes played the indifferent Jake with reluctance. Scott Eastwood was again suitable for the character Nate. And not only because of that creepy resemblance to his famous father. But the acting by Burn Gorman, Charlie Day and Tian Jing was at times simply bad. Bad enough to make me squirm.<br><br>Only the graphical part remains. Just like the 2013 film, it's a visual spectacle. And just like the acting, there are also ups-and-downs here. It's fun to see huge robots and enormous monsters smashing into one another. But to be honest, it's the same old thing as in the previous movie. And the final battle in a Japanese city close to \"Mount Fuji\" just looked ugly. It wasn't as if this clash of the titans took place in between blocks of flats made from cardboard. Just like in those ancient Godzilla films. But it's a close call. The duel on the ice, on the other hand, looked extremely great. A computer-graphic masterpiece.<br><br>Do you like to watch huge robots and by extraterrestrial created monsters battle each other? Then I guess this film is right up your alley. Have you seen \"Pacific Rim\" years ago? Then you can safely skip this one because you won't be seeing something really new here. To be honest, I sometimes had the feeling that I was watching a modern version of the Power Rangers. Only the creatures who emerged from another dimension resembled those that the Power Rangers fought against a long time ago. Ridiculously long time ago.","user":"peterp-450-298716","rank":[247,279]},{"title":"I Suppose There Isn't Much Room To Criticize This Film","rating":3,"date":"20 October 2018","review":"As bad and boring as it was it is a sequel. Anyone who thought there would be anything redeeming in it does not know recent history.\nHollywood (or whatever the Chinese equivalent is) really needs a rethink.","user":"qqh-57167","rank":[77,85]},{"title":"Weak acting","rating":2,"date":"30 August 2019","review":"Just accentuates the weak story.<br><br>It seems they really need to stop making sequels. They universally blow.<br><br>I will lead the way: no more sequels for me.<br><br>Pro tip PS: if you see any actor or actress from Disney movies just skip it.","user":"dean-grey-director-sales","rank":[68,75]}]