[{"title":"Not your average by the numbers filmmaking","rating":22,"date":"22 December 2014","review":"Cop movies are nothing new, neither is terrorizing someone in a room. I thought the movie was gonna be a Saw meets cop movie sorta thing based on some reviews. gotta say though, this movie was way cooler than that. It reminded me of Guy Ritchie movies - tracking back an forward in time, funny surreal moments, people breaking fourth wall to explain things, characters switching places, etc. <br><br>The acting was solid and cinematography and editing were top notch. The beginning felt a tad weak, but i'm really splitting hairs here. They really got everything on the screen with this movie. I think if there's any real 'problem' with it is, it doesn't follow the typical arc people expect these days. More of an oblique 70's feel, where you don't have the satisfaction of a neat resolution or the hero doing the final heroic thing. But that's a good thing. It's unexpected.<br><br>All in all, it was actually one of the better movies I've seen this year. Hope it gets legs. It deserves it.","user":"krazykat29","rank":[59,95]},{"title":"Well worth watching.","rating":7,"date":"2 January 2015","review":"An intriguing story, told stylishly and in an interesting way.<br><br>Add to that a cast of character actors that everyone must enjoy watching, and this couldn't really go wrong.<br><br>Saying that, it was a bit messy early on, giving the distinct impression it was going to be a headache to stick with, style over substance perhaps.<br><br>I feared the worst, but it began to fall together nicely. Despite a nagging feeling it should have been even better given the premise, it was a good-looking and enjoyable film.<br><br>And I loved the killer's flashback to his old life. A funny interlude in a generally grim movie.<br><br>I'll look forward to the writer/director's future work.","user":"stemal-1","rank":[37,60]},{"title":"A fun ride","rating":8,"date":"4 January 2015","review":"This film deserves more publicity than it is getting.. An impressive cast and a pretty good thriller in its own right.. The different stories that each cop puts forward on poker night are in itself pretty good. Each story is different in their own way and its really depicts how a legit detective team would handle the same case. The negatives that I have are really slight.. Maybe the plot could have been a bit more taut and focused on the killer a bit more. The acting is well handled.. I enjoyed the ending and I wish the team behind this all the best in their next venture. I went in without any expectations but the rating on IMDb (which I think it deserves at least a seven) and I liked it. If you are into thrillers, give it a try.","user":"potterbond007-51-23461","rank":[31,53]}]