[{"title":"Possibly the worst natural disaster movie ever made...","rating":1,"date":"28 August 2014","review":"\"Disaster Wars: Earthquake vs. Tsunami\" was a disaster movie in every sense of the word, literally.<br><br>The storyline was fairly generic for a movie of this genre. Mankind sets off a massive natural disaster that proves deadly and it is a race against time to find a way to stop this event before it lays destruction and waste to the world as we know it.<br><br>Right... Nothing new there in the storyline department. Aside from it being very boring and uninteresting.<br><br>The effects in the movie were abysmal, and I wonder how a special effects team in 2013 could look at the effects that they made for this movie and seriously go \"yeah, this looks good. The audience will really buy into this.\" It was without a doubt the worst CGI effects I have ever witnessed in a movie, and believe you me I have seen many a bad movies in my time.<br><br>As for the acting, well just watch the first 5-10 minutes, with the submersible scene, and the level of acting for the rest of the movie is pretty much determined. It seemed that no one on the cast list were buying into the storyline, and it showed blatantly on the screen, because the performances were not even half-hearted.<br><br>There are many really bad movies about natural disasters, but \"Disaster Wars: Earthquake vs. Tsunami\" really is the icing on the cake of bad disaster movies.<br><br>Not even 20 minutes into the movie, I was starting to drift to do other stuff and it was a losing battle to keep the attention span to the movie, because it was just so bad.<br><br>I suffered through the 85 minutes of this movie so you don't have to. Heed my warning, and stay well away from \"Disaster Wars: Earthquake vs. Tsunami\".<br><br>A generous 1 out of 10 stars...","user":"paul_haakonsen","rank":[37,39]},{"title":"This is the first time I've ever said this. I could make a better movie.","rating":1,"date":"12 September 2014","review":"I have a sickness. I find appalling movies gratifying. I've become so fond of them that I'm literally filled with glee when I see one. The worse it is, the more joy I appear to gain from it.<br><br>Thus, I am a living, breathing meter of terrible. And I can tell you that my meter is off the charts on this one. I'm practically reeling in elation, and trust me, this is bad for you sane people.<br><br>(The following text will be a series of hyperboles designed to push forth the general impression that the movie was bad. If you feel the need to stop reading now, I forgive you. Go in peace.)<br><br>This is the first time I've ever looked at a film and said to myself, \"You know what.. I think I could do better. By myself even.\" The special effects are downright horrifying. Horrifyingly bad that is. I have seen a friend of mine work with freeware software for a class project, and even he did better than what I just saw. These special effects are on the same level as \"Birdemic\" and \"MegaPiranha.\" They are that bad (I recommend both movies, by the way.. Though you may hate me for it).<br><br>How about the acting? Believe me, watching a dog bark at itself in a mirror will give you more empathy than anything you'll get from the acting in this one. How any director could look at this and say, \"Yes, this works. It's really creating the mood,\" is a mystery to me. I don't think any other actors could possibly make an impending catastrophe appear to be less worthy of heartfelt emotion. The dialogue was so incredibly dry, and deeply inept.<br><br>The best acting in the whole movie had to be the bums. They were great.<br><br>What about the plot? Plot holes don't just exist, they hit you in the face with a shovel. The level of stupid is so high that it might actually seep out of your screen and get on you. I'm not going to bother giving examples, that would be cheating. But trust me, common sense doesn't exist in this one.<br><br>I realize that budgetary concerns are commonly used as an excuse, but realistically there is no excuse. Amazing movies have been created on very tight budgets. If your special effects are bad, tighten your acting. If the acting is poor, smooth out the plot. There are ways to concentrate on the winning points of your feature. Even with everything else being terrible, your movie can still be entertaining and fun! This director failed to pick a winning point, but instead attempted to do everything at once, and the film had almost no noteworthy moments. Sadly, there was simply just no entertainment.<br><br>The acting producer should be able to tell right away that something is wrong, and make appropriate course corrections for the production. For instance, the special effects: \"Let's see, earthquakes, falling debris, tsunamis, satellites, lasers, nuclear explosions, submarines, bullet wounds and military technology ambiance. And I have a budget of.. Ah hell no. Something's got to go.\" This would have been a better answer than, \"Awwright! We have a computer! Let's do it!\" <br><br>Lastly, I confess that it brings me joy to inflict this sort of insipid cinema on people. Please watch it. For me? xxoxxo, bye bye now.","user":"rushknight","rank":[25,26]},{"title":"What budget?","rating":1,"date":"23 November 2014","review":"Now in my top 20 worse movies ever made. The only person I recognized was the lady who played the Vice-President. She played the President in \"24\". Hard to believe. Was she that hard up for work? <br><br>If you do start to watch this terrible movie, you'll probably find yourself skipping ahead until you actually see something happening. Special effects looked like it was done by a few 12 years old. Avoid headaches by skipping this disaster.<br><br>A bit puzzled how this got even 3 stars. People could give all the spoilers they could and this still would not upset many people. Is the man in the bathrobe the hero? You won't care one bit.","user":"otter-stl","rank":[13,14]}]