[{"title":"Slightly better than average","rating":6,"date":"5 October 2013","review":"Picked it up because I recognized the names on the cover and thought it was worth a watch. <br><br>Film revolves around Axel (Dolph Lundgren) trying to figure out who killed brothers Quinn (Billy Zane) and Kurt's (Gianni Capaldi) father. Other subplots in the film show Campbell (Vinnie Jones) and his uncle trying to take over the family business once he dies and there's also Kurt, who is now an FBI agent, trying to figure out who killed his father who was a mob boss. (No background checks from FBI?)<br><br>I understand that this is not a 100 million budget so I went into the movie knowing that. But my problem with this film is not so much any acting or action its the ridiculous gaping holes in the story. <br><br>So at the start of the film we see Dolph with a machine gun then he is apparently shot with a hand gun next to his hand. ??? Vinnie Jones tells Billy Zane's character that he was in jail for 4 years whilst we were told he was in for 3, you think that someone would know the difference between 3 and 4! The two very close brothers never once come into contact when Quinn gets out of jail. Did they forget who each other were?? Quinn's comment to Mr Huang in a deal where he says \"How many people do you have here?\" The Asian guy, (such awful acting), had 2 men there and Quinn brought one. Why wasn't Davi's character running the business and not Campbell? Did he go on vacation? Lundgren bought a bottle of wine yet he says don't drink stay sharp. <br><br>I know these are getting into details but the audience is not stupid and at this level doesn't the editor see these problems? <br><br>CGI in this could've been a lot better. Felt amateurish. The hacking part was bad! <br><br>Worse thing about this film must be the ending. Too much narration by Axel, and shooting as a sniper was such an anti climax to the film, was hoping for some more action or something a bit more exciting. There seemed to have been a deal made with Axel and Kurt but we should have had more of the FBI influence towards the end. <br><br>What I did like was the way we saw some of the story twists and turns, I thought the sub stories should have been developed more. Axel chasing Campbell down and then Campbell chasing Axel for the final confrontation (a fight scene between those 2 now that would have been sweeeet!). Dolph's other fighting scenes are always enjoyable. Fighting with some sexy girl is always enjoyable! Some of the chases were good with FBI Kurt and some of the action sequences. <br><br>Billy Zane and Vinnie Jones performed exceptionally well and there were solid performances from Robert Davi and Gianni Capaldi. Dolph this time round was not at his best. <br><br>Summarizing, this film was a good Thursday night film to keep you entertained, it has some good elements and its far from perfect but that is why we love these type of films. <br><br>A 6 out of 10.","user":"randyprivate003","rank":[10,10]},{"title":"plot twists and secrecy do not always make a movie","rating":5,"date":"5 October 2013","review":"Once again Serafini, Lundgren and Capaldi hook up to make a Movie. And they fare somewhat better this time around.<br><br>Plot: small time Corleones need to step down to avoid jail time. They cannot agree on how among themselves, but some are prepared to kill to get their way...<br><br>Rush, which I reviewed a couple of Days ago, was far too complicated for its own good due to too layered characters although 3,1 is too low a rating. On this Point Blood of Redemption succeeds much better with not so complicated characters.<br><br>On the other hand, the plot twists and secrecy gets the better off of this one. In this Movie the writers try too much to create suspense whereas in Rush they try too much to create interesting characters. Perhaps the next Movie will get these things right. I like Movies that have different groups of people and/or individuals with different goals that at the end Clash together because they usually tend to be entertaining. but here it does not quite convince which may be due to lacking script, budget and acting performances.<br><br>However, the current rating is 4,1 which I Think is unfair. The acting is good enough and Lundgren, Zane, Jones and Capaldi do their job (at their capacity anyway) and the action sequences are decent enough, at least to the level where they do not bother you. the only thing that bothered me is that some of the bullet holes/blood splatters looked like CGI work to me, which is something I do not appreciate (CGI or not, they still look bad).<br><br>I give it 5 out of 10 because it is entertaining enough. The quality of the Movie is like Caught in the Crossfire, Nico, Marked for Death and Under Siege 2 for instance.","user":"vampiri","rank":[10,13]},{"title":"One of Dolph's worst in recent years","rating":17,"date":"17 September 2013","review":"Bodyguard Axel (Dolph Lundgren) spends his time looking after a mob family - patriarch Serge (Robert Miano) and sons Quinn (Billy Zane) and Kurt (Gianni Capaldi). Things get complicated when Hayden (Robert Davi) asks Serge if he can bring his nephew Campbell (Vinnie Jones) into the fold. Sure enough, Serge is soon dead, Quinn is arrested and Axel is on the run as he is framed for murder. Naturally, he doesn't sit back and just take it and, with the help of Quinn's girlfriend Loryn (Jelly Howie), aims for his redemption. Lundgren has spent the last decade or so wandering from personal projects to big budget stuff like THE EXPENDABLES to tough-for-cash (in both senses) roles. Sadly, this is the latter. <br><br>This is really rough stuff, shot like a telenovela with some cheap CGI (gun flashes, head shots). On the directorial side, this thing is a mess. Sure, the dislike of the use of flashes of character names when they first appear on screen is a personal bias on my end, but you can't make up some of the stuff co-directors and co-writers Giorgio Serafini and Shawn Sourgose screw up. The script is overly complicated (it is mostly told via flashback as Lundgren maps out the usual suspects on a bulletin board) and laughable. There is one scene where a line of dialog is repeated twice (\"His name was Boris\") and a fifteen minute span where characters alternately refer to an earlier event (the death of Serge and Quinn's arrest) as happening two, three and four years ago. The worst is the finale where Lundgren's character is shot while toting an M-16. His shooter comes up to him and there is a handgun laying next to his body. And who casts Robert Davi as a Brit? Just embarrassing. Of course, this is just a direct-to-video action flick so it can be saved by some good fights. Sadly, none are on display as the choreography is as lazy as the directors. And it is only hand-to-hand fights and shootings. Not a single car gets over 30 mph. The highlight is probably Dolph getting into a fight in a dominatrix den with a lady while a topless lady tied to a frame screams in the background. Yeah, really. I really wish Dolph would be more selective, but I know the rent ain't gonna pay itself.","user":"udar55","rank":[17,26]}]