[{"title":"Very entertaining","rating":8,"date":"5 November 2014","review":"This movie accomplished what it set out to do. And that was to show what the guys who emulate Santa at Christmas do the rest of the year. I felt this movie gave an interesting cross section of Santas. This documentary had engaged all my emotions from blinking back tears to rolling in the isles laughter. Most of all it exposed their vulnerability to life like the rest of us. I found that it did reveal the one thing they all had in common was Love for humanity expressed in living the Christmas spirit year round. The claymation figure was a nice addition to the cast and it keep things on the light side. DO NOT VIEW THIS WITH ANY YOUNG CHILDREN. ADULTS ONLY. So pull up your easy chair, get your popcorn and enjoy some truly entertaining moments.","user":"ballinda2","rank":[14,14]},{"title":"Warm, touching, emotional and funny. Excellent for the Holidays!","rating":10,"date":"5 November 2014","review":"I Am Santa Claus is a must-see documentary that follows the lives of four men that portray Ole Saint Nick during the Christmas season. It also follows WWE Legend, Mick Foley, giving himself the challenge to fill in the boots and see if he has the ability and skill to become Santa Claus himself.<br><br>Each individual has different lives. One being near homeless and jobless, living with his daughter, trying to struggle to get back on his feet again and being Santa Claus during the month of December can be a little stressful to him, yet gets a brief feeling of joy. Another man is openly gay and proud of it, visits his long distant significant other as much as he can before the busy Holiday. Third individual's dream job by opening up a BBQ business. Fourth man is a real estate agent that wants to get a break into singing Holiday tunes.<br><br>As for Mick Foley, he makes a PERFECT Santa Claus! Just like in his wrestling career, his mission is keeping others entertained and happy. It's a big transition from being a Hardcore Legend to Santa Claus, but he pulls it off very well. It's almost like it's his calling and it's in his blood.<br><br>The documentary is very straight-forward. Lots of laughs, chuckles, and also emotional scenes, especially with first two \"Santas,\" that I just mentioned. From beginning to the end of this film, my smile never left my face. I strongly recommend to watch this film for the Christmas Season. You won't regret it!","user":"Roadwarrior85846","rank":[15,17]},{"title":"Ho! Ho! Ho! This Santa Claus documentary, indeed delivers! What a gifted movie!","rating":7,"date":"26 December 2015","review":"Started by a Kickstarter campaign &amp; currently streaming on Netflix; 2014's documentary, 'I am Santa Claus', is worth watching! Directed by relative newcomer, Tommy Avallone, and produced by Morgan Spurlock, the man behind several hit documentaries like 2004's 'Super-Size Me'. This film documented the lives of five real-life bearded professional Santa Clauses during an entire year. Each one of them, is pretty unique in their separate way. First off, you got Santa Russell Spice, an unlucky unemployed man who walks around, probably takes his Santa gimmick, a little too serious to hold a normal job. His cantankerous outlook on life might seem a bit bleak to some viewers, but the majority, of his scenes weren't too much depressing. The claymation sequences of Russell, trying to find a job was a nice addition to the film, because it did keep things on the light side. It really help make Russell seem like a real person. By the end of the film, you really want him to find a new home and put his life back together. To some, the next Santa, Jim Stevenson, might come off as a cheap ploy to sensationalize the movie and grab attention, and it kinda was, because the fact, he's a gay Santa; however, the film does focus on other issues, he has, other than his personal gay life with his lover, Alex. Scenes like him, talking about work at the antique store, shows a little range. I just wish, the filmmakers flesh out that other side of him more, because he seem more like a gay figure head than a real-life complex person. I can understand, why some audiences find his scenes, to be a bit too uncomfortable to watch. After all, seeing an elderly man strip to his undies for a photo shoot, is kinda risqué and too bizarre for even some gay men to take. I know, some conservative viewers, dislike him; however in my opinion, Santa Claus, Rob Figley is a little more alarming to watch than mostly likable, and jolly, Jim. Like Jim, Rob's portrayal in the film also comes across as one-dimensional and cartoony; but unlike Jim and the others; Rob isn't given much screen time to showcase any other side of him; besides his wild swinging sex habits. Not only, was he first introduce, toward the middle of the film; but he was also edited out, after that point. You never see, any conclusion to his whereabouts. That's not good, at all. I didn't like, what they did with him. In my opinion, they should had, just cut his story, off, if they weren't really, wasn't going to use him, much. The only highlight about Rob's story, is seeing the west coast, laid-back, Santa Bob Gerardi and east-coast, 'Robert De Niro' like swagger, Santa Frank Pascuzzi debate on what does it take, to makes a great 'Santa Claus'. It was nice to see, two different views on life, work together to be very open and accepted to the multiple lifestyles that make up the Santa world. I love the little odd things that comes along with these two men; such as a church made out of Santa Clauses. While, each of the other Santa Clauses are very interesting in what they bring to the part. They're not the linchpin of the film, as that honors, goes to ex-pro wrestler, Mick Foley. Foley serves as the best example of an overall story arch in this film. We follow Foley from the inception of him, thinking being Santa Claus, until the end, where he indeed transform himself into Santa Claus. His journey from newbie to seasoned veteran, is some of the clearest and most understandable moments in the film. While, the other Santa Clause's stories might not seem needed for this movie; Foley's part, sure was necessary for the narrative. For the most part, seeing men from a variety of backgrounds, lifestyles, and economic circumstances have a common passion, and each pursues that passion with vitality and determination, made for a very interesting watch. While it may hold more entertainment value during the holiday season, this documentary is something that maintains a level of intrigue during any season. Just note, it might not be 'watchable' for small children, due to some shocking imagery and profanity. In my opinion, the film for the most part, does a great job at pulling down the beard and show us, the true faces of the men everyone thinks they know; because of that reason, alone, it's deserve to be watch time after time again.","user":"ironhorse_iv","rank":[6,6]}]