[{"title":"Director Gomez-Rejon has serious skills","rating":8,"date":"30 November 2015","review":"Hate to tell the truth but whether or not you personally \"liked\" a film does not necessarily qualify you to review it.<br><br>This reviewer was hosting horror festivals when the original NIGHT OF THE LIVING DEAD came out, and the hardest thing to do in a horror flick is be subtle.<br><br>But this director has mad skills. And can do subtle.<br><br>The framing in many of the scenes is incredible, there are times you almost feel the characters on-screen are the only people left on the face of the earth.<br><br>And Gomez-Rejon also is shrewd enough to get more mileage out of Addison Timlin's face than a Prius.<br><br>And a nice face it is. I counted over 50 closeups and then stopped counting. Her character is the glue, the connection, for this story and she is set up as a shy girl who (quote) never gets asked out.<br><br>Which is why this story is fiction and not a documentary.<br><br>And you the viewer get to watch the whole story through her eyes.<br><br>The juxtaposition of the new movie and the \"old movie\" only makes my point -- putting this film alongside Whedon's Cabin in the Woods for cleverly deconstructing a tale from within the story arc itself.","user":"A_Different_Drummer","rank":[19,23]},{"title":"An interesting REQUEL!!","rating":7,"date":"23 October 2014","review":"The original TTTDS was one of the earliest slasher films in the genre that even came before (in 1976) popular franchises like Halloween &amp; Friday the 13th and I've always been a fan of that flick for its humor, suspense &amp; docu-drama like narration style &amp; last but not the least the haunting ending. So when I first heard about there will be a new TTTDS, I thought it'd be another pointless, some cash-in effort but last night after watching this new take on T3DS, I'd like to admit...I was pleasantly surprised!!<br><br>Directed by Alfonso Gomez-Rejon (the most frequent director of American Horror Story), this new film is a strange version to categorize as a remake, reboot or a sequel; actually it's neither a straightforward remake or sequel...I'm not sure but I think REQUEL (a sequel-ish remake!) can be a more appropriate term for it. After more than half a century of the actual events of The Moonlight Murders that resulted the very making of 1976 original film, this new story is set on present day at the same town, Texarkana that once again begins to plagued by \"The Phantom\" murders. Interestingly, the 1976 original film is also very much alive in this movie as a film that we know in our 'reality', as in the film the town now maintains a tradition in every Halloween to show a drive in screening of the original film. So, as the film progress we see a fine blend between this version &amp; the original film where some scenes from the original brought back through a kind of flashback style while also creating some copycat murder sequence in this new one. I liked this approach of providing homage to the original; bring it to an entirely new generation. This new &amp; refreshing kind of take &amp; treatment to this already known &amp; filmed story is the most appreciating part of this version. And overall the film is beautifully shot, liked the camera works, the character development was fine for a slasher flick, but still as a slasher it's not above the clichés as well as it comes with a routine ending &amp; weak motive for the killer which I couldn't find much point to it. And lastly there's another strange part of it and that's the Town itself! It looks like the town hasn't really age after all this years!! May be for the homage issue but though the film is set on late 2013, it still got the 70s vibe almost all over it.<br><br>Anyway, there's not much masked killer-slasher flick comes out this days with good or decent budget &amp; film making like this one and still despite some clichés &amp; the ending, as a slasher flick it's pretty good one, IMO.","user":"sanjidparvez","rank":[25,33]},{"title":"Good idea with some clichés","rating":7,"date":"18 October 2014","review":"Some 60+ years since a serial killer left the town of Texaracana in fear the killer seems to be back for more, but one girl will stop at nothing to uncover his identity.<br><br>This film is really intelligently shot, it mixes in several scenes from the original film while also creating some copycat scenes with different characters, I really enjoyed it. Good acting all around.<br><br>That being said this lost a lot of likability with its death scenes, there are several characters with less then five minutes of screen time, yet they leave us thanking the killer for offing them. you'll notice the mpaa rating says it has strong sexual content, I'm not one to really complain about unneeded sex and nudity that being said the sex scenes were really used to degrade the characters.<br><br>Overall this was a nice slasher film, fans of the sub-genre will enjoy it. Not a slasher fan? you should probably pass on it.","user":"LinkGoku","rank":[32,48]}]