[{"title":"Worst movie I've ever seen","rating":1,"date":"29 November 2013","review":"Ridiculously terrible movie. Horrible, obnoxious acting. Not scary at all. Extremely predictable. These ratings must have been written by the director, as no man in his right mind would enjoy this. I'm 99.9% positive the director created a number of fake accounts to skew the ratings. I wouldn't be so mad if I didn't pay $7.99 on on demand for this piece of junk. I feel like I was scammed, as there are no refunds for bad on demand movies. The director is 25 years old or something... And it shows. Bad story, bad acting, bad directing, and worst of all bad business. And I wouldn't have written so much about this movie but IMDb has a requirement of there being at least ten lines in a review, so I felt it was a necessary sacrifice in order to save others eight bucks!","user":"davidvrcoralgables","rank":[38,49]},{"title":"Total garbage! Stay away.. Damn liers and scammers!","rating":1,"date":"27 March 2014","review":"The film is absolutely dreadful. I must be fair though and point out that the beginning had me going for some time. The atmosphere, the storytelling... but all in all it turns into this poor excuse lame teen flick where nobody takes anything seriously other than to get it on with one another... Its an uber stereotypical cliché piece of garbage. <br><br>The film actually had potential but the execution of this is so poorly done that whatever hope I had for this evaporated after about 30-40 minutes. I had actually looked forward to this. The Impaler. I thought like..YES! Finally! A historically based film on Vlad Tepes himself. Boy was I wrong!!!<br><br>And honestly!! Whats up with all that witchcraft and devil worship... VLAD NEVER SOLD HIS SOUL TO THE DEVIL!!! Not even literary Dracula did that!!! He turned against GOD!!! and was punished for doing so. Well the Bram Stoker kind anyway... <br><br>God....that ending too...so anti climactic... I swear to god the \"Oh my god was it all a dream...did I just imagine all the killing and all the evil I committed??\" factor is just the icing on top of a huge c r a p cake. Not joking. We get this cliché move that just out of nowhere forces us to question EVERYTHING we've just seen...only to see Vlad..in the shape of some young dude 500 years after his death...LOOKING EXACTLY LIKE HIM....Yea!! not kidding... die and awaken as....you know it.....no one other than... Dracula HIMSELF!! What the F U C K!!!! <br><br>Dereck Hochenbrough... If Vlad Tepes were alive today..I have not a shred of doubt that he would have you impaled for creating such a poor piece of garbage and associate it with him... <br><br>Please don't ever touch this horror genre EVER AGAIN!! <br><br>Ohh yea... And Dereck...You can take your fake reviews..your fake accounts and their fake ratings that resulted in this lousy piece of s h i t got a freaking 6-7 out of 10 and SHOVE THEM RIGHT WHERE THE SUN DON'T SHINE! <br><br>How DARE YOU TRY TO SCAM US LIKE THIS!! How ignorant do you think we are! <br><br>False advertising...thats not only illegal but its also SOOOOOO LOOOOOW!!!!!! Anyone remember the Limbo Song?.... How low....can you go.? <br><br>And honestly....Why is this film even called the Impaler..when there is like NOT A SINGLE HUMAN BEING IN THE FILM BEING IMPALED.. There one of the teens who end up getting a pipe of something forced through their gut... BUT HONESTLY!! THAT DOESN*T QUALIFY WHATSOEVER!! Get a grip and go read a history book....or simply go read freaking wikipedia or something... What...was it impossible for you to like stage Dracula returning and impaling the other girls and dudes in the film...that would've been immediately better...at least entertaining horror-wise..<br><br>God... This is just another disgrace to the Dracula Franchise. Just another slap to the face to Dracula and all his fans... <br><br>STOP EXPLOITING THIS TITLE!!!! WE LIKE IT!! MAKE SOMETHING PROPER!!","user":"angiris","rank":[20,26]},{"title":"It's what you will feel like doing after viewing this film!","rating":1,"date":"1 November 2013","review":"I watched this film based on the External Reviews. I was hesitant but the reviews were all positive and I love GOOD horror films, but there are so many lousy ones made these days.<br><br>So, I gave it a shot and I now wonder if they saw the same film I did! There is hardly anything to examining the story of Vlad, just an opening scene that was pretty poor. The rest of the film is the same stuff you see in so many horror films these days - a group of college kids visiting Vlad's castle with the same cast of characters you always see. Several attractive women, make sure you have a blonde in the group! The acting is wooden and pathetic, the \"horror\" is laughable and it couldn't end fast enough. I am really upset that I was duped again, either the reviewers' expectations are low already from the many poor movies out there or, need I say or suggest what the other option is. I promise myself to NOT be taken again and all I can say is the old adage - \"let the buyer beware\"!!!!","user":"iraz","rank":[32,48]}]