[{"title":"A true story that packs a punch","rating":10,"date":"13 October 2013","review":"I had the opportunity to see \"Victor Young Perez\" at the Hamptons International Film Festival. The story of a Tunisian Jewish boxer who rose to fame in prewar France, only to be consigned to Auschwitz during the German occupation of Paris, real-life Olympic Gold Medalist Brahim Asloum portrays Perez with convincing athleticism and surprising confidence. While parts of the film are difficult to watch--the boxing scenes are realistically bloody--\"Victor Young Perez\" is alternately inspiring, horrifying, enthralling and infuriating. The film is beautifully shot, well directed and consistently gripping. Actress Isabella Orsini, in the part of Perez's love interest, is a luminous beauty who is every bit the 1930s movie star she portrays. When all is said and done, \"Victor Young Perez\" is not to be missed.","user":"stevek4511-576-94878","rank":[8,12]},{"title":"Fact based story of the Jewish Boxer sent to the death camp","rating":7,"date":"1 April 2016","review":"The original title of this French made film was 'Victor 'Young Perez' as this is essentially a biopic of that man's life. Born Tunisian, but also a Jew, he seemed to have boxing in his blood. He gets talent spotted by a French scout and taken off to make his fortune in The City of Light.<br><br>Now he was actually World Flyweight Champion in 1931 and 1932 and so was very well known. Then he went off the boil but Hitler was about to take Europe by storm and as the title suggests Victor Perez was swept up in the horror of war and sent to the most notorious Death Camp. This is his story.<br><br>Now the make up here is excellent and the period detail is wonderful. The dialogue is mostly in French – even the Germans speak mostly en Francais albeit one Officer with a deliciously dark German accent. The acting is all above average with some very moving scenes. However, this is far from being the brutal honest version of this dark part of history, but there is nothing wrong with that. This also shines a light on another victim to that dreadful war and as such this is one I can recommend.","user":"t-dooley-69-386916","rank":[2,2]},{"title":"Story is more compelling than the movie","rating":7,"date":"12 February 2016","review":"\"Victor 'Young' Perez\" (2013 release from France; 110 min.) brings the story of Victor Perez. As the movie opens, we are told it is \"Poland, November 1944\" and see an older guy running rounds while shadowboxing in the grounds of Auschwitz. Then the movie flashed back to \"Tunis 1929\", and we get to know that same man as a young boxer wanna-be. It is Victor Perez, a Tunisian with Jewish roots. One day, he gets the chance to box for real, and it's not long before Perez rises through the ranks and attracts the attention of a sports agent in Paris. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie is a traditional bio-pic of an extraordinary man, and I say this with the most respect for the movie's producers. They must be praised for bringing this story to the big screen, as it deserves to be seen and heard. It is therefore unfortunate that for me the movie feels like a \"bio-pic by the numbers\", with little tension and a surprising lack of background information on the title character himself. Yes. we see him box but what was it like for him to grow us as a Tunisian with Jewish roots? That is never addressed! The scenes at Auschwitz are of course harrowing but it still doesn't make up for the movie's other shortcomings. But I am still giving it 7 stars as the story is so compelling and more people needs to be exposed to it.<br><br>I recently saw this movie at the 2016 Jewish &amp; Israeli Film Festival here in Cincinnati. Given its original release in 2013 in France, I have no idea why it has taken this long to reach US audiences, but better late than not at all, I suppose. The Cincinnati screening was attended very nicely. \"Victor 'Young' Perez\" is, warts and all, worth checking out.","user":"paul-allaer","rank":[1,1]}]