[{"title":"13 vignettes recreate the paintings of Edward Hopper","rating":8,"date":"14 June 2016","review":"Edward Hopper was one of the most influential modern American painters, who took his inspirations from the cinema and literature of his time (1882 to 1967). His pictures reflected contemporary America in spare but very detailed scenes that appeared to be frozen moments in time. His use of light and shadow was evocative; his color palette reduced but intense. <br><br>Gustav Deutsch attempts to recreate 13 paintings of Hopper, creating 13 vignettes that highlight life and history in the USA between 1931 and 1963. The story follows the life of Shirley and her thoughts throughout the vignettes. News clips, music and poems - the movie is concerned as much with the inner workings and thoughts of Shirley as in recreating the scenes that encompass the Hopper paintings. This is in the spirit of Edward Hopper, who was very much interested in psychology, which influenced his work. Gustav Deutsch has succeeded in translating Hopper's work into a movie and created a unique work that unfreezes the paintings and gives them life. <br><br>The movie moves slowly and you need to approach the vignettes as you would approach a painting - take your time, bath in the colors and lights, soak in the details and let the stories unfold. The red line is elusive in this movie but exists, if you are willing to search for it. This movie is a unique vision that will appeal to those, who like Hopper, the realism movement in art, and movies about art.","user":"aoc777","rank":[10,11]},{"title":"Colorful","rating":7,"date":"4 August 2013","review":"A very odd movie I got to see during the Berlin International Film Festival. Odd might be an understatement and I'm sure I didn't completely comprehend what it was trying to tell me. But I was mesmerized nevertheless. By the different settings, by the way the actors behaved, by the colors. Actually just by everything.<br><br>It is tough to talk about something, that was clearly inspired by paintings, though I couldn't tell you which ones. I'm not even sure I want to read more about it, just to keep that cloud of mystery over it and making up things I imagine are true of what the story is supposed to be (or if there even is one). It's not really a structure to be seen, so that fact alone will not get too many people engaged into watching it. You have to be in the mood for this. A special kind of mood I suppose","user":"kosmasp","rank":[26,33]},{"title":"possibly more suited to a gallery installation","rating":7,"date":"11 June 2019","review":"This is not a particularly easy film to watch due to the lack of specific narrative flow but it is even more difficult to write about. Based upon the realisation of thirteen of Edward Hopper's paintings, this is a mesmerising experience as the pictures appear, filling the screen, with characters then appearing within the immaculately contrived images. The orange, yellow, green and brown are immediately recognisable and there is always a clear light source, usually open window or cinema screen. The concept is not entirely spurious as Hopper apparently utilised film or literary sources as inspiration but it is a most unconventional film and possibly more suited to a gallery installation. Certainly looks good though.","user":"christopher-underwood","rank":[1,1]}]