[{"title":"Not pure genius but definitely one of the better horror movies of the year.","rating":7,"date":"17 June 2014","review":"Solid acting, a quite original concept, and a well woven tapestry of a... shall we say, alternative culture, make this into quite a strong movie. I found myself invested in the main character enough to care about the outcome, and intrigued enough in the \"elder power\" around which the community revolves to want to know more about it. I will say it is not a conventional horror movie, so those who hope to get jump scares and loads of blood are better off looking elsewhere, but if you want a thoughtful little film that still has an element of supernatural, this might be a good one for you. Definitely worth watching, and all the better considering what an expanse of recent garbage this little gem shines out on.<br><br>Addendum: I saw some criticisms of this movie and they mostly seemed to center around the idea that it left too many questions unanswered, that it didn't have enough of a story, or that it didn't wrap up to a particular viewers satisfaction. I could not disagree more. The premise is that there is an entity whose older than man whose thinking is unfathomable. To answer the nature of such a creature in your narrative would destroy that property of it... wouldn't it? Personally, I like the unfathomable aspect of it. I like wondering about it but never being given an answer. As to the ending and the lack of a story, without giving anything away, well, a group such as this would have developed a kind of relationship with the entity which would have become very entrenched over time. This tale is a slice of time... not a closed end, and I think the ending we are presented with is the perfect one for the, shall we say, nature of the beast. It is precisely these kinds of things that make the story a bit more innovative and not just another Hollywood style tale designed to satisfy the person who prefers things to be more predigested.","user":"sstetsko","rank":[27,30]},{"title":"Inspired Madness","rating":7,"date":"1 August 2015","review":"I have just finished watching JUG FACE for the first time and I must admit that this is not at all how I expected to feel. The title alone does nothing to promote high expectations. Neither does the few clips that have been showing on the previews from other dvds. This is by all accounts a low budget affair but it still has ...something. There's not a lot of astounding visual effects to distract you or sugarcoat the story but the one thing this film has which is easy to spot is authenticity. It is not the shadowy beings that roam the woods that scare you. It's not the unknown entity that dwells in the pit. Those things are really just there to provide a focus for the real horrors in this movie which are the people that live there. The unshakable faith that the followers have in their myths and the fervor that is palpable in their rhetoric seems to dance just behind their eyes. The conviction that empowers them to commit unspeakable acts. These are the things that stand out about JUG Face. It's an absolutely enthralling depiction of single mindedness and ignorant worship. The characters here are convincing if not always polished. You really feel that they don't believe they have any other choices than the ones which they are compelled to make. They don't question their lives they simply live them out until the pit chooses them. However, once she is chosen, Ada must make a choice of her own...With a larger budget this could have been a masterpiece of modern horror. As is, this is recommended for fans of true dread and moodily atmospheric thrillers. 7 out of 10.","user":"avidnewbie","rank":[12,13]},{"title":"Nicely offbeat backwoods horror","rating":7,"date":"26 April 2013","review":"Ada is a young girl who lives with her backwoods hillbilly moonshinin' clan. A close knit community, they all share a rather arcane religion. Every so often, The Potter makes a ceramic jug adorned by a face. Every face that appears on the jug is a member of the clan and any face that appears must be sacrificed for the good of the community. Sacrificed to The Pit, which lies in the woods. Because The Pit wants what it wants and The Pit must be sated as this is how it's always been. If The Pit doesn't get what it wants then whatever dwells within it gets angry. And when The Pit gets angry, the community will be punished.<br><br>One day, while exploring The Potter's shed, Ada finds the latest jug face. It's her own...<br><br>Will she allow herself to be sacrificed, for the good of the clan? or will she set in motion a plan to spare her own life?<br><br>Jug Face is a straightforward but pleasantly offbeat horror that puts an interesting and unusual spin on the hillbilly horror/hicksploitation sub genre, with a nice turn by Larry Fessenden as the clan leader and a surprisingly great turn from Sean Young as the overbearing matriarch.<br><br>Executively produced by Lucky Mckee and with FX by Robert Kurtzman, it's a satisfying and solid horror that's well worth checking out overall, for fans looking for something just a little bit different.<br><br>7/10, decent little film and recommended.","user":"Corpus_Vile","rank":[53,71]}]