[{"title":"Lost in the Screenplay","rating":3,"date":"16 August 2017","review":"After losing her baby and finding that her husband Gabriel Jones (Eric Etebari) has a love affair, the housewife Mirium Jones (Shari Shattuck) travels to Venice and makes a pact with the devil to become pregnant again. When she returns, she moves with Gabriel to an isolated house for a new beginning, but Mirium is unstable and disturbed with evil daydreams and visions. After a violent argument with Gabriel, he vanishes and Mirium is tormented by her neighbors. Is Mirium really lunatic or part of the Devil's plan?<br><br>\"Scream at the Devil\" is a film with good ideas from other movies, special effects and performance of the lead actress Shari Shattuck. However the storyline is a mess and the director / writer Joseph P. Stachura is totally lost in an awful screenplay. In the end, \"Scream at the Devil\" is boring but never scary. My vote is three.<br><br>Title (Brazil): \"Grito de Pânico\" (\"Scream of Panic\")","user":"claudio_carvalho","rank":[9,9]},{"title":"Good idea...bad everything else","rating":1,"date":"4 April 2016","review":"\"A beautiful schizophrenic woman is pushed over the edge by her husband's illicit affairs, and when her hallucinations become reality the Devil comes to take his due.\"<br><br>Nothing in that description is actually true. The woman is not \"beautiful\" and \"her husband's illicit affairs\" didn't pushed her \"over the edge\" nor \"her hallucinations become reality\".<br><br>So when a movie says \"the story is about unicorns\" and it's actually about horses...you have a serious problem at hand.<br><br>The movie tells the story of Mirium Jones, a woman suffering from schizophrenia that decides to \"leave it all behind\" when her husband cheats on her with a younger woman. She also lost her unborn children due to a miscarriage. See? And you thought your life was bad.<br><br>So she decides to take a trip to Venice and goes to a Basilica (a very old and magnificent church) basically to pray to the Devil (?) for a chance of getting pregnant again. Because everyone knows that if you need to make a Pact with Satan...the obvious place to go is a church.<br><br>Then without any kind of explanation the emotionally scarred woman decides to go back with her husband, who buys a huge house in the mountains and builds a \"studio\" for her and her paintings.<br><br>But then...everything goes to hell when all of a sudden all the characters become like corrupted versions of themselves. Again, without any sort of real explanation.<br><br>Strange things start to happen all around Mirium and the obvious question Writer/Director Joseph P. Stachura wants you to ask is \"is it all real or not?\" \"are all these due to the schizophrenia or is the Devil's work?\". A very interesting idea (albeit not an original one at this point) that Stachura completely ruins with his awful directing job and a worse script.<br><br>The acting in this movie is an insult to the senses and not even Tony Todd is able to deliver a worthy performance. Shari Shattuck as Mirium is a complete mess and most of her performance just jumps from overacting to plain pathetic acting. The rest of the cast is just...well...let's just say \"bad\".<br><br>Photography is forgettable, except for the Venice portion of the movie (the first 7-8 minutes of it).<br><br>The SFX are something straight out of a B Movie. The Syfy original movies' FX are almost something out of Industrial Light &amp; Magic compared to these ones.<br><br>Oh...and the ending completely disregards everything you see just minutes prior to it.<br><br>Seriously, this movie couldn't be any more worse even if it were 90 minutes of still pictures of grass.<br><br>Just do yourself a favor and skip it. This is probably one of the worst movies released in 2015.","user":"Orpheus_Unlimited","rank":[14,16]},{"title":"Don't waste your time on this one","rating":2,"date":"24 March 2016","review":"I tend to only review movies that were so bad I feel I must warn others not to bother with them.<br><br>This is a good example of that. The acting is terrible, the story goes nowhere and no one seems to know what's going on. It was like a student film, and a bad one at that.<br><br>I thought the premise sounded good, so I watched it, but this movie just inundates you with one scare after another until you grow immune and after a while the \"scary\" parts become comical.<br><br>And these characters that show up at her door demanding to be invited in. How stupid is that? That's like the old vampire lore even though they aren't vampires. And those stupid \"country\" girls who can't even talk right. Why are the stereotypes always the same in junk like this? Don't these writers ever do any research?<br><br>The best part of the movie was the scenery from Venice. I guess the crew and director did the whole thing just to get a free trip to Italy, because it had nothing to do with the rest of the story.<br><br>Well, enough time wasted on this dog. There are plenty of really bad horror movies out there, but this one is so lame it makes you laugh and cry at the same time.","user":"MoviesRT","rank":[12,14]}]