[{"title":"Worst acting ever!","rating":10,"date":"10 August 2014","review":"This straight-to-TV movie probably served well as an acting class for the unknowns. The acting in this movie was so horrible it makes Sharknado look like Gone With the Wind! It was so bad, I think some of the \"actors\" weren't even professionals. I think it was more Ed Wood style where he let friends and contributors have parts in the movie. Really, really bad acting and bad movie with really, really bad acting. The plot wasn't horrible, but there was a lot of unnecessary pauses and scenes that could have/should have been cut. Actually, the entire movie should have been put on the shelf and left there until such time as one of the younger actors became famous enough that it would have embarrassment value.","user":"tes796","rank":[31,37]},{"title":"When, will i, will i make a good movie?","rating":1,"date":"30 August 2014","review":"Okay, let's get this straight....i love bad movies, hey, i seen loads..Frankenstein meets the space monster, Robot Monster, deadly spawn,Plan 9.....i could go on and on...but this movie? It's a different kind of \"bad\"..as in total excrement! The acting is so bad, the scooters, the chase scenes, Luke Goss,this is a new kind of low.....boredom guaranteed The bad boss guy looks like Max Wall, enough said! Someone mentioned Ed Wood in another review of this film, hey Ed Wood was a genius and would never have wasted time on this. I cannot understand how this even made it onto DVD!! The accents slip and slide all over the place. In these dangerous times that we live in, this film is a mockery of true life, it's an embarrassment to the art of cinema....it's AWFUL!<br><br>Avoid at all costs!","user":"stuartbell64","rank":[21,26]},{"title":"Don't Waste Your Time","rating":1,"date":"6 July 2014","review":"I was watching this movie on July 5th, 2014 - and the release date was June 4, 2014 - one month from release to cable - direct to video I guess.<br><br>I wont bother with a plot summary other than to say there is a \"secret\" government agency, a terrorist plot using Vespa-type scooters (and....one high speed chase using said scooters)and some horrible acting, writing and directing.<br><br>But...................<br><br>Look closely children of the 80's..........VINCENT SPANO IS BACK!!!!! And no....his acting hasn't gotten any better.<br><br>If you dare watch this - make sure you're ready to say \"WHAT?????\" at the end.......","user":"slfitzpa-10-2780","rank":[32,42]}]