[{"title":"Found footage finds no fan","rating":1,"date":"6 March 2013","review":"A film almost devoid of interest combining the worst aspects of the \"found video\" genre into something almost completely unwatchable. The film careens from an intriguing premise (that the Frankenstein monster is real) to an appalling sequence of events, each more predictable than the last. Full of dreadful acting, character stereotypes, inane character behavior and a litany of crying, screaming and heavy breathing as members of a documentary crew are popped off one by one by the \"monster.\" ***SPOILER*** Mary Shelley's monster was an articulate fellow who might be able to shed some light on his condition. This brute just roars and clomps about in a big pair of winter boots and says nothing. Why waste the opportunity to do something interesting with such great source material? Bigfoot has a lot more character.","user":"tellstar","rank":[96,117]},{"title":"This is very BAD, It Should Have Stayed A Theory","rating":7,"date":"7 March 2013","review":"I don't know if you can call this a \"movie\". It's not a horror movie for sure. It's more of a theory. It's a \"Bad Movie\" theory. Take and destroy a piece of literature like Frankenstein and insult it by not sticking to the book in basic details and by making the monster sound stupid with silly sound effects that are not scary. That's about all you get, because you barely even see the monster. You may see it a few seconds and you miss it, if you blink. That is ridiculous. <br><br>Then you take amateur actors and put them in fake found footage situation which is unbelievable. They are looking to see if Frankenstein was really in Alaska. Poor Mary Shelley. It's just really nonsense. The dialog is long and boring and irritating the viewer with no relevance to the story. You feel like it never stops. Some of the locations are okay if you like to see the arctic, but I can watch that on National Geographic. This was just a terrible waste of my time and bad.","user":"Sandy6019","rank":[57,72]},{"title":"Quite possibly the worst film I have seen.","rating":1,"date":"6 March 2013","review":"I am by no means an experienced movie reviewer but I've seen enough films and have been an avid horror film buff for 30 years to know when I've seen a terrible movie. I've seen the lowest budget to the major studio releases and every film in between. This is my first review on IMDb which should speak volumes since I decided to take time to warn people not to waste your time with this movie. You'd be better off taking the hour and twenty minutes raking a cheese grater against your forehead! Even the lowest budget shlockers offer something for entertainment. Whether it be excessive gore or scantily clad girls...they do SOMETHING to try to catch your attention, even if it is the most low brow base function. <br><br>As I watched this I kept waiting for something to happen.....something PLEASE! It never delivers. A regurgitation of overly used clichés and zero originality is what you have in store for you. If you want something to bore you to sleep, I suppose renting this is cheaper than a bottle of sedatives. Or if you have an overpowering desire to become so irritated at the rubbish that you are witnessing on screen to the point of shoving your finger in your eye and swirling it around a bit, then by all means watch this film. Otherwise avoid it like the plague.","user":"frylock69","rank":[74,96]}]