[{"title":"It fell between American comics and Japanese manga, and it hit bottom","rating":6,"date":"21 April 2013","review":"The animation was good, like most Japanese animes. The voices were OK, without them being neither great nor grating to the ears. I didn't even consider the film having a soundtrack until the time of this review, so if it was, it was completely ignorable. What else is there? Oh, yes, the story. And the story is pretty much crap.<br><br>I see a pattern here: somewhere between the releases of big Hollywood productions, some low budget animation features appear, usually straight to video, and usually made by the Japanese. Is it an attempt to squeeze more money out of fans or one to bring more American productions to Asian markets? Probably both.<br><br>The problem with this idea is that the difference in quality between the big budget movies and the animated features is huge, and not always in a predictable direction. Look at the Resident Evil animated movies; some of them were way more enjoyable than the live acting ones.<br><br>So, what am I to think of Rise of the Technovore when the Stark hero is way off the image that Robert Downey Jr. created (let's face it, he pretty much carries the films by himself), the villain is practically copy-pasted from Japanese animes (bad ones) and, as many reviewers observed, the dialogue is boring and pretentious.<br><br>So I have to mark it as a failure. Not a big failure, mind you, we are talking about comic book heroes, so the expectations were low to begin with. However, I was kind of hoping for an interesting story that somehow escaped the censure of the Hollywood politburo. Alas, they had an American write the plot and that sealed its fate.","user":"siderite","rank":[16,19]},{"title":"Tony Stark is......Gundam?","rating":6,"date":"3 May 2013","review":"To coincide with the release of IRON MAN 3 in cinemas, Marvel has returned to direct-to-video animation with Iron Man: Rise of Technovore. Yes, everything rises. Machines rise, Apes rise, Guardians rise, prices rise; too bads story standards have not. Iron Man Rise of Technovore has more clichés in it than its title, showcasing all that is good and bad about modern Japanese anime.<br><br>Our story seemingly takes place within the Marvel Cinematic universe. The characters look like their live action movie counterparts, and there are references to events in the live action movies. We start off with Tony Stark about to launch a \"Big brother\" surveillance satellite that will be able to track all criminal activity worldwide. Ooh, intriguing! What are the moral implications for such a move? Will a crime free world justify the loss of privacy? Well, we never touch on these instead moving into an attack by mobile suits piloted by the silly named \"Raiders\" intending to stop the launch. How original. Iron Man tries to save the day but encounters a nubile teenage boy clad in weird nano-techno-organic armour far more advanced than Iron Man's. Lives are lost, and since Stark is the only survivor, he is taken in by SHIELD for questioning. <br><br>Now here is where things stop making sense. Instead of hearing Nick Fury out and joining forces to stop this new threat christened \"The Technovore\", Iron Man bails out on SHIELD and stupidly makes himself a wanted man. Now with SHIELD agents Hawkeye and Black Widow on his tail, Iron Man has to find a way to defeat this Technovore despite being outclassed in every way possible.<br><br>True to modern anime, this movie favours flaire, extravagance and all round coolness over narrative, pacing and the usual things that matter. Take a leading Japanese anime studio, give them an American sized budget and technological backing and Iron Man Rise of Technovore is the end result. It looks marvelous! The CGI (computer generated images) are blended seamlessly with the traditional animation, action is fast paced and in-your-face, character movements are smooth while still keeping an insane level of art detail. Overall, the show is a real thrill with wicked aerial combat and state of the art tech.<br><br>For fans of anime, this is truly a visual treat. There are numerous little shout outs to other anime shows, most notably gundam. Yet like most modern anime, the visuals are about the only thing good going for it. As stated earlier, the story makes little sense. Stark could have saved himself a lot of trouble with SHIELD if he just stopped for a bit and listened. But no. Our character of Stark is a one trick egotistical pony, dead set on having things his way. The other characters also come across as flat personalities, more typical anime fodder for fanservice than actual contributors to the story. We even have your typical angst ridden teen out to \"remake the world\". <br><br>All in all, the story bears a lot of similar elements to Steins;Gate and Texhnolyze, 2 other anime series directed by Technovore director Hiroshi Hamasaki. The script is a hodge podge of, again, anime clichés. Thankfully, the voice cast do great job of becoming their characters, both English and Japanese cast. They bring their best performance to the roles, especially Keiji Fujiwara and Matthew Mercer as Tony Stark. This is not Robert Downey Jr's Iron Man, which is refreshing; you do not have any of the corny humor that plagues the live action movies. Instead you have a Tony Stark that is not as comedic as the movies but still as snarky; more like in the comics. On a whole, Iron Man: Rise of Technovore is merely superficial entertainment. There is no way anyone can be emotionally invested in any of the characters thanks to the cliché ridden script and story. Character relationships are simplistic to the point when death of characters become a mere passing moment. He's dead, on with the story. Pacing is too slow in many places to the point where it gets boring. Oh and the Punisher gets shoehorned in for absolutely little reason.<br><br>Pretty graphics and good acting cannot save an otherwise unimpressive, uninspired, and mediocre anime movie. At best, this is an extremely long showcase of studio Madhouse's animation capabilities when given the right backing. The \"Invincible Iron Man\" animated movie from 2007 is still a better animated feature than this.","user":"xamtaro","rank":[12,14]},{"title":"Good for time killing.","rating":3,"date":"19 April 2013","review":"Quite a disappointing movie. Before the conclusion, let's take a look step by step:<br><br>1. Story: Empty beginning, anti-climatic ending. Everything in between barely making sense at all. The ludicrousness of the plot reminds of Promotheos(sarcasm intended). But there is a big gap between a deep Sci- Fi movie with upcoming sequels and a DtV anime for the fans. It took me some time to figure on the net, who the heck were the antagonists(beside the story told in the movie). Even then, it has almost nothing to do with their canon comics. Where did Zeke get his powers from? What's about Sasha's DNA?(Wiki says nothing about her powers being DNA-related in particular)Why did the events unfurl the way they did(the final clash)? And why did it end so... peacefully? I doubt these questions will ever be answered.<br><br>2. Animation: Cute and cuddly. Would almost like it, if it wasn't cliché to the anime. Looks like I'm watching Iron Man themed Evangelion or something. I guess that's the only reason Japanese animators took this movie - it has android-tech in it!<br><br>3. Cliché: Mechas. Androids. Tentacles. Monsters. And utterly ridiculous \"suit\" of Zeke. Which anime was it borrowed from?<br><br>4. Cameos: Okay, Shield was fine. Hawk was too off, but Natasha compensated him. And, wow, Punisher? This deserves a plus.<br><br>Conclusion. I had to kill some time while waiting for download, the movie did it's purpose. I did not enjoy it, but neither was I totally disgusted. This movie could be tolerable at it's best, if not for the points 1-3, which I listed. Could've been 6-7 with a better plot and stuff, but unfortunately it's a 3, which roughly stands for \"cute, franchise and cameo\".","user":"Wirxaw","rank":[8,9]}]