[{"title":"We are so oppressed...","rating":1,"date":"16 September 2014","review":"I've heard some good thing about this movie, so I give it a chance (even tho AfterDark movies are usually hit or miss).<br><br>While it started out OK, then turned weird since it had no dialog for the first 20 minutes or so (which I actually liked), it sacrificed it's premise for more of a standard movie, because message has to be heard, right?<br><br>and the feminist(ic) overtone in this movie are so obvious that it really start to hear your ears. While I have no problems with some feminist tones in movies like Stepford Wifes (original): it had feminist ideas within the story, but it still treated itself like sf horror movie, but in Silent Run? Hell no! <br><br>Most of the dialogues consist of usual feminist tropes like \"We are so oppressed, no one wants to hear us, man want to change us\" to the point that movie become too annoying. Every man in this movie is complete psycho who want women to bi silent, obedient and \"perfect\" wives for themselves who must be at kitchen (they also want girls for their wives purely based on their looks!). They even showed the \"woman in kitchen\" mame image treating it like serious thing for brainwashing young girls. I am not even kidding. Creature itself that happens to be in the woods for some reason is also a female (also in sign of feminism).<br><br>Robert Nolan is only saving grace, he is really good in most of his scenes. Other two lead actresses are also rather descent, it's not their fault that movie is so absurd.<br><br>There are some FX scenes which are well made, descent amount of gore for this type of movie (maybe even too much), some blood. Creature design was descent, but not too original, you'll swear you've seen it in some other movie.<br><br>Ending was ridiculous with needless fight scene at the end, because hey, you must satisfy the casual audience (who will probably be bored by then anyway). If movie ended with strong emotional scene that happen before it (also, applause for two lead actresses, it was carried purely on their acting, because script didn't do anything to root for any of their characters), it would end on high note, but nope, let's do the generic fight scene and end the movie.<br><br>Honestly, if this movies wasn't \"So-obviously-feministic\" movie, I would probably like it more, but I really couldn't stand annoyance of majority of lines being \"we are so oppressed by those evil man\"... or at least keep your feminist views at minimum and don't use your movie as way to express your own socio-political ideas. <br><br>Look how Stepford Wives turned out (which I actually liked). It managed to poke at feminist ideas, but it was still enjoyable, creepy and \"legit\" horror movie. It was never used as a way to spew ideas right into audiences faces.","user":"alucardvenom","rank":[25,59]},{"title":"Why are we being so quiet?","rating":7,"date":"21 November 2014","review":"There's a girl running through the woods, panicked, beaten, with a leash around her neck, and begging for forgiveness. We hear growls, and the louder they get, the more panic overcomes this girl. Something unseen creeps up on her, and violence ensues. Death becomes her.....<br><br>This is a story about a young lady named Janey, a girl with a painful past, who was sentenced to a month at a retreat for behavioral modification. Upon arrival at the camp she meets Dr. Prince. He immediately comes across as a prick as he explains her the rules: NO TALKING, NO HAND GESTURES, NO PHONES, NO EYE CONTACT. NO MORE THAN 5 GIRLS CAN BE UNDER THEIR CARE AT A TIME. We already know from the opening that something more awaits the girls in the darkness of the woods surrounding camp, but what role does the Dr play, with the help of his only employees, his 2 sons Albert and Paul? She is settled in and her \"treatment\" begins.<br><br>As the girls begin to rebel, with Janey's influence, we meet Alexis. Together, Alexis and Janey are determined to get down to the root of the real purpose for the camp. As they begin snooping and spying, and some vomit inducing trickery, we soon find out the real Purpose of the camp. It's not to reform bad girls. It's not to teach them any skills, so don't expect to see any of the girls earning their badge for wicker weaving either. There's a deeper, darker bit of mind fuckery going on here.<br><br>What is this fuckery I speak of? I'm glad you asked. Come to find out, the judge that sentenced the girls to the camp is the brother of Dr Prince. They have this bible thumping fanatical idea of how women should carry themselves. It is their life's goal to break these girls down, through intense and drug induced brainwashing, turning into voiceless, weak, perfectly obedient wives, and the ones that fail the treatment test are sacrificed to what lurks in the woods. The ones to succeed will be their brides, only none thus far have been able to be completely broken down, and ultimately become dinner to the thing hiding in the woods.<br><br>Will Janey, Alexis, and the other 3 girls overcome the Prince family's tactics, and escape their horrible fate? Will they escape the thing in the woods that lurks around the camp borders? You will have to watch and find out. There were some slow moments in the film but it makes up with a twisted tale and a nice amount of guts and gore leading into the films climax. I enjoyed watching Silent Retreat, and I think many of you may too.","user":"theshockchamber","rank":[8,17]},{"title":"Canadian Award Winner","rating":6,"date":"4 September 2014","review":"Janey (Chelsea Jenish) is a trouble child. And for her efforts, or lack thereof, is sent off to a remote retreat for nonconformist girls under the guidance of a doctor (Robert Nolan) whose methods are .a bit radical. The Doctor, and his staff of male accomplices, uses hypnosis and other extreme techniques to get their subjects to comply with their rules that command their patients to be completely obedient through deafening silence. Failure to obey the directions beyond their imposed 'two-strike rule' will result in the subject being fed to a lurking creature that inhabits the surrounding woods.<br><br>Janey is hardly the conformist. And her rebellious attitude towards the retreat's rules and regulators eventually lead to unavoidable confrontation. But with other girls simply disappearing, Janey must weigh her defiance against the risks of being overpowered by either the male administrators or the evil yet to be revealed from the outside.<br><br>Director Tricia Lee makes her feature film debut with Silent Retreat and shows a high degree of talent in transitioning genres. The film's opening scene is unquestionably horror, but the film switches gears and takes more of a dramatic path for the middle act focusing on Janey's relationship with fellow prisoner Alexis (Sofia Banzhaf) and the regimented retreat rules. We got lost ourselves for a while forgetting for a few moments that there was something mysteriously lurking within the forest. A mysterious something that reveals itself in the film's final chapters reminding us that Silent Retreat is horror plain and simple.<br><br>Characters as portrayed by Chelsea Jenish, Sofia Banzhaf and Robert Nolan are perfectly cast as they lend their combined talents to a tale that all three seem committed to pulling together. Lee does not seem to be in rush to allow blood splatter consistently through the film's full 95-minute running time and instead uses her DVD chapters wisely to form a setting and atmosphere that the film will heavily rely upon.<br><br>Silent Retreat won Best Canadian Film at the 2013 Toronto After Dark Film Festival, but you can remove the \"Canadian\" from the award plaque and you would still be left with a viable and enjoyable film worthy of our attention.<br><br>www.killerreviews.com","user":"gregsrants","rank":[11,26]}]