[{"title":"Completely irrelevant and grossly disappointing","rating":1,"date":"24 September 2017","review":"I'm shocked at the amount of good reviews thus far. There's the first 10 minutes of this film... then there's the last 10 minutes... NOTHING in between contributed to an acceptable origin story of Leatherface. We got a brief look at his childhood (first 10 min)... eventually we learn how he became disfigured (last 10 min)... but how he became this giant, semi-mute, monster... there's NOTHING about this story-line that explains this or gives us ANY additional insight. For the most part we find out what we already knew (in the first 10 min)... his entire family is sadistic and insane... THAT'S how he became Leatherface... not anything you're going to see here.<br><br>This was nothing but an attempt to tell a story that ultimately has nothing to do with the origin of Leatherface. The leap from how this guy became Leatherface is astronomical and nonsensical. What we already knew was sufficient and should've been the focus of an origin film. <br><br>THIS was just an opportunity to take advantage of a successful franchise with a story that was FORCED to tie into the original Texas Chainsaw Massacre. Complete with a bunch of forced twists and turns in attempt to appear to have more depth than it actually does. This was pure garbage and the only thing good about it was Lili Tayler, who wears \"psychopath\" very well.<br><br>Look for me on Twitter and YouTube for audio reviews. MovieBuffChick1 https://youtu.be/XwrSFnaEymA","user":"moviebuffchick","rank":[109,158]},{"title":"Dull and underwhelming, not directly bad, just barely OK.","rating":5,"date":"24 September 2017","review":"This movie in itself is not exactly bad. It looks alright, has some OK gore, decent acting for the most part, some slightly interesting characters. It doesn't suck. But as a origin story to one of horror's biggest icons? Eeeh, yeah. It's not great.<br><br>Actually, right off the bat the biggest problem with this movie strikes me. When you're making an origin story to such a famous character, you should make sure that the story you make up and make into a movie is really awesome. Unfortunately, it's not. We see Leatherface's family and stuff, and it's just meh. The opening scene is just not very interesting. What follows though, isn't bad. They have some kind of story to tell here, not relying too much on TCM- lore, and I thought it was somewhat entertaining.<br><br>You wouldn't have to cut a lot here to make this movie totally unrecognizable as a Leaterface origin-story, though. That's a shame. And it's also pretty tame, I'm sorry to say. Actually really tame. Like I said initially, the origin story to such a gruesome character should really be a lot more horrific, gruesome and ghastly. It's not. It's pretty watered down. I think the die hard fans of Leatherface will be disappointed with this. But who knows, I may be wrong.","user":"Finfrosk86","rank":[56,81]},{"title":"A prequel that doesn't hold much value! [+33%]","rating":3,"date":"24 September 2017","review":"When the directors of 2007's gore-spectacle 'Inside' (Alexandre Bustillo &amp; Julien Maury) took over the reins of a supposed prequel to 1974's Tobe Hooper classic 'The Texas Chainsaw Massacre', expectations had indeed sky-rocketed. But what we get isn't even worthy of being called a tribute to the TCM franchise, let alone be regarded as its worthy canon prequel.<br><br>The screenplay offers very little in terms of the surprises it throws at the viewers (and TCM fans), thereby ending up strictly ho-hum. We see a bunch of eccentrics creating a riot at a mental health facility and escaping, with tidbits of the Sawyer family thrown in to engage the viewer. In fact, the makers are trying to sell this movie around the mystery of which character amongst the the leads ultimately evolves into 'Leatherface'. Well, much to our dismay, even this stretch appears annoyingly contrived (and to be honest, the poster kinda spoils it already!). <br><br>What we're subjected to for most part, is literally a lunatic couple shotgun-killing their way to notoriety on their supposed escape (even the big chainsaw-kill comes in too late) with a helpless nurse named Lizzy (Vanessa Grasse) who has unnecessarily been dragged along with them while also being accompanied by a duo of brothers (the somewhat compassionate Jackson and the bulky Bud). Lizzy is the character we're supposed to root for, but sadly this does not work. We know as little about her as we know about the rest of the zany troupe. <br><br>The directors who're known to stage horrifically-exciting set- pieces, resort to cheap tricks here (like a partial necro scene) in order to augment the shock-value. The shot of a woman's derriere walking into a barn surrounded by badlands (during one of the opening segments, clearly reminding us of previous TCM films including the Michael Bay funded remake) had just about raised my hopes a teeny weeny bit before everything came crashing down. <br><br>With no real thunderbolts in store for fans or non-fans, this prequel falls head first into a pit of quick-sand, the real difference-maker in the story being the weapons (shotguns, knives) that the characters possess and not their personalities. You're bound to forget this movie as soon as the credits roll.<br><br>Verdict: Terrible!","user":"arungeorge13","rank":[46,69]}]