[{"title":"The Blue Umbrella is yet another charming Disney/Pixar short","rating":8,"date":"24 June 2013","review":"This is yet another Disney/Pixar computer-animated short shown before their main feature which in this case is Monsters University. This one has a different look as initially, it looks like real live action with the depiction of city streets in the rain. But then, the title character comes to life-complete with eyes and a smile-and as the score starts playing, so do many of the city's inanimate objects also come to life. And then, this blue umbrella sees a red one and...well, watch the short if you want to know. In summary, The Blue Umbrella has a wonderful charming atmosphere that permeates throughout the brief running time and should leave a long enough smile on your face as you wait for the main feature to begin...","user":"tavm","rank":[6,7]},{"title":"Some Amazing Animation","rating":7,"date":"7 July 2013","review":"The Blue Umbrella (2013) <br><br>*** (out of 4) <br><br>Fun short from Pixar, which was shown before their feature MONSTERS UNIVERSITY. This film here deals with a blue umbrella who sees a red umbrella and quickly falls in love. The rest of the film pretty much as the blue umbrella going through a wide range of events trying to make its way over to the red one. This idea might seem quite simple but director Saschka Unseld does a very good job at making it move at a very good pace and also keeping the viewer interested in what's going on. The most amazing thing about this short is how real all the animation looks. There were times when we see a large number of umbrellas from the top that you'll actually think you're looking at something real and not just a piece of animation. There's also some funny moments where various items \"come to life\" to try and prevent the blue umbrella from being hurt. I'm not sure how much kids are going to enjoy this one but parents should be fascinated by the animation and the style, which really looks like some avant garde stuff from the 1920s.","user":"Michael_Elliott","rank":[5,6]},{"title":"How One Finds His Life In Rain And In Life","rating":10,"date":"22 June 2013","review":"Pixar continues its tradition of airing entertaining shorts prior to its main feature with \"The Blue Umbrella\" prior to \"Monsters University.\" From the short film's beginning, I immediately noticed that the scene didn't feel cartoony or animated at all. From the rain to the automobiles to the sidewalk and hoards of crowded pedestrians, the art style was one of almost unnerving realism. In short, the realism was unbelievably believable! And then you notice the slow introduction of music in the very sounds of the city coming alive during a sudden rainstorm. The grates gurgle, the pipes puff, the pedestrian meters flash. Simply beautiful is its mood and execution.<br><br>The plot quickly becomes unveiled as an unknown man's blue umbrella catches sight (and is smitten with) an unknown woman's red umbrella amidst the multitude of black umbrellas. As the whole city's mechanical, architectural and functional denizens observe and participate in the love affair, the blue umbrella maneuvers his way to the one that could be his perfect mate for rain and life.<br><br>Overall, I thoroughly enjoyed the film's warming plot, breath-holding twists, realistic graphics, well-matched musical score and heartwarming ending.","user":"white-jessica-r","rank":[6,8]}]