[{"title":"A failure of a Hollywood blockbuster","rating":2,"date":"30 August 2016","review":"The story of Ben-Hur is back on the big screen this time directed by Timur Bekmambetov starring Jack Huston, Toby Kebbell and Morgan Freeman. The movie is set in Jerusalem and tells the story of a prince who goes by the name of Judah Ben-Hur. Judah's adopted brother Messala Severus is part of the Roman army that occupies the city. Both brothers have a different idea of what is needed to keep the peace in Jerusalem and this eventually causes the brothers to directly oppose one another. Ultimately this causes the enslavement of Judah and his family made possible by the betrayal of Messala himself. What follows is a story about Judah trying to regain his life and his road to revenge.<br><br>The movie starts out trying to establish the relationship that Judah Ben-Hur (Jack Huston) and Messala Severus (Toby Kebell) have. This is however not done in a very convincing manner due to the very stupid screen writing. It seems as if no thought has gone into the writing of the dialogue as almost every conversation feels fake. The story itself is presented in an incredibly dull fashion with story- arcs that have no real purpose paired with an ending that is completely ridiculous. What also does not help is that the acting is never really anything to write home about. The two main actors at least seem to have tried to bring some depth to their characters, but the same cannot be said about the many supporting actors. This is especially true for Morgan Freeman who seems to bring as much life to the screen as a decapitated sock puppet.<br><br>The direction of the film also leaves a lot to be desired. Almost every scene was shot by using hand-held camera and instead of enhancing a certain aspect of the story this achieves the opposite effect. During the many conversations the director puts a heavy emphasis on the characters through excessive use of close-up shots. Once again this achieves the opposite of what it sets out to do as no one is really interested in seeing characters that are as flimsy as possible.<br><br>Most of the times the only redeeming factor of these kind of movies is the action itself, but Bekmambetov's incompetent direction also finds a way to ruin this part of the movie. Quite a lot of action sequences only seem to exist to liven up certain parts of the movie, mostly to no avail as the movie still manages to come to a crawling pace halfway through its runtime. The action sequence themselves are filled to the brim with shaky cam and quick cuts. This in turn causes the action to be extremely hard to follow as it is never really clear what is going on. This was of course the intention of the director to be able to hide the poorly choreographed stunt work. In a lot of scenes characters pull of certain moves that they would not have been able to if they did not have control over the power of editing. For these reasons it is very hard to become invested into the action especially since we never really see the actors do certain stunts themselves.<br><br>In the end 'Ben-Hur' is a complete and utter trainwreck. Nobody really asked for another retelling of Ben-Hur's story and I am fairly certain that nobody really wanted to create it either as it seems that almost no love and devotion has gone into making this failure of a Hollywood blockbuster.<br><br>My Rating: 2/10","user":"Fiurilli","rank":[67,95]},{"title":"You already know his name.","rating":7,"date":"19 August 2016","review":"Last time I watched the Ben-Hur with Charlton Heston the thought did not cross my mind that perhaps the world needed another version of the story directed by the guy who brought us Abraham Lincoln: Vampire Hunter and that weird movie where they make bullets bend. <br><br>Anyway, the Heston version is one of my favorite movies. I saw it when I was 8 and two times when I was about 20. I love it and quote it all the time. <br><br>But this is not a review of that version because (surprise!) it is not that version. This is a review of the 2016 version and I don't feel it is fair to give this movie a bad rating simply because it was an unnecessary remake. In case you are wondering, this is the sixth version of Ben-Hur.<br><br>The story follows Judah Ben-Hur, a Jewish prince in Jerusalem at the time of Christ, and his adopted Roman brother Massala. They love each other but they get in the middle of an attempted assassination on a Roman leader and wind up on opposing sides. They both feel they are in the right, get in a very sticky situation, and thus begins an 5 year journey of survival, revenge, forgiveness.<br><br>I liked the movie. The chariot race was thrilling. I was worried about it because the trailer showed a scene which an obvious CGI horse running through the stands. To my delight that was the only part that really used a CGI horse (that I could tell, anyway). The rest of the race was intense even though I already knew how it was going to end.<br><br>The movie focuses very heavily on the relationship between Massala and Judah as well as Massala and the rest of the Hur family. Massala's intentions and actions were understandable and he wasn't just some evil man who betrayed his family.<br><br>The main actors and actresses do a good (not great) job. I felt Morgan Freeman may have phoned it in a little, but he delivered one of my favorite lines of the movie. My favorite actors were the slave drivers on the galley along with the drummer. They have small roles but I loved them.<br><br>I didn't care for the Jesus scenes though. He is a hard character to portray, and I just didn't like it when he spoke. I'm probably picky, but I would have preferred to hear him speak in King James English or not at all (like in the Heston version). I just felt something was off with the scenes and they could have been more powerful.<br><br>Overall, I felt it was a pretty good movie that succeeds in many aspects chiefly with the themes of revenge/forgiveness and delivers one exciting race. It's not perfect but a good movie overall.","user":"rexking410","rank":[146,222]},{"title":"I Can Never Get My Two Hours Back","rating":1,"date":"12 September 2016","review":"Where do I begin with such a deplorable movie? Let's start with cinematography. The vast majority of the scenes are filmed in a frustrating haze of darkness; the excessive use of close-ups is nauseating; and, worst of all, the camera is constantly jerking throughout the film, which left me with a splitting headache when I left the theater.<br><br>When compared with the classic 1959 version, the 2016 story is as humorously silly as it is shamefully insulting. Here's just a few examples: In the chariot race, our hero falls out of his chariot; manages, somehow, to hold on to the reins; is dragged for an entire lap around the arena; finds the incredible strength to pull himself up back into the chariot; and, most astounding, not a scratch is on him. Oh, by the way, Ben-Hur's chariot breaks up at the end, permitting him to have a climatic finish, literally rolling across the finish line.<br><br>Then, there is Ben-Hur's mother and sister, who are miraculously cured of leprosy, but they do not have a clue as to whom they owe this miracle. They are totally unsympathetic characters - as, in fact, all of them are.<br><br>The adoption of Ben-Hur by Roman Counsel Quintus Arius, which is crucial for setting the dramatic scene of Ben-Hur's return to Jerusalem from the galleys, is totally missing. Instead, in this latest version, Ben-Hur is reduced to a fugitive slave, running from the Judean authorities like a scared rabbit.<br><br>In the 1959 version, the evil Macella dies in the chariot race, but with his last breath informs a bewildered Ben-Hur - in a triumphant tone - that his mother and sister are lepers and that \"the race goes on.\" Ben-Hur, naturally, is crushed by the news. In the 2016 version, in stark contrast, Macella lives (minus a leg); the two tearfully forgive each other; and, at very the end, they ride off on horses into the sunset like some Grade B western.<br><br>Please. PLEASE! Watch the critically-acclaimed 1959 version and you will enjoy perhaps the greatest Hollywood film of all time. However, if you choose, like me, to go see this latest version out of curiosity, remember that you have been warned.","user":"tputter","rank":[73,107]}]