[{"title":"Got to admit, It starts off stupid but ends brilliant.","rating":6,"date":"19 March 2016","review":"It seems like just another slasher stereotype: a group of young attractive camp Counselors, alone in the woods trying to get to know each other before the kids come. This time around however, a strange outbreak turns anyone exposed into a raging murderer for a small period of time. It eventually wears off, but do to the nature of how it spreads, anyone at anytime can become the slasher and as easily not become the slasher.<br><br>It makes for a very suspenseful film not knowing who was going to be the slasher or the victim at any given time, and it was very impressive that they kept this up with so limited resources for 83mins. <br><br>It's starts off slow and very corny. The movie is filled with a lot of OMG and WTF moments that are very slasher campy, but as the mystery of the outbreak begins to unravel the camp turns form bad to really good. Summer Camp seems to go for one big punch line instead of a few good kills, which turned into a smart tactic that makes this cleaver film work.<br><br>It's the type of Horror film all slasher fans should check out.","user":"subxerogravity","rank":[28,40]},{"title":"Wow! It worked!","rating":5,"date":"15 August 2016","review":"You need to see around 10 minutes of this movie to realize it's everything you've seen before 1000 times. All the moves, the reactions, the plot, the actors and so on.<br><br>But look what happens if you pass 25 minutes: it gets better! It gets somewhat different, and you start to actually enjoy it. To connect with the characters a little, to feel the tension around, even to start to wonder. Rarely have I seen something that starts out from bottom and ends up nicely indeed.<br><br>I will recommend it as I do consider it better than many such productions. It was a pleasant surprise and I'm glad I found this one. You just have to make it through the first 25-30 minutes. But it will all be worth it.<br><br>Cheers!","user":"gothic-fiction","rank":[19,27]},{"title":"Tedious","rating":4,"date":"25 September 2017","review":"Shot in Spain this starts off reasonably interesting but quickly descends into an hour or so of infected people chasing non-infected people which becomes tiresome &amp; tedious. It's also confusing as the infected become uninfected, then infected again. The ending is reasonably good but it's too little too late. The title sound more like a slasher movie, perhaps it would have been better had it been one instead.","user":"Stevieboy666","rank":[7,9]}]