[{"title":"Fences Is 2016's Most Well-Acted Film","rating":9,"date":"25 December 2016","review":"\"Some people build fences to keep people out, and other people build fences to keep people in.\"<br><br>The first thing movie-goers should understand about Fences is that it is very much a filmed play. An adaption of August Wilson's Tony- winning play, director Denzel Washington has kept the project as minimalist as possible. There's good reason for this. Wilson's words are exciting enough that there is just no need for big action, large sets nor grandiose cinematography. Fences is a small, intimate story about Troy Maxson (Denzel Washington) and his close-knit circle of family and friends. This small cast of characters is used to speak volumes about how far the Black community had come in overcoming prejudices by the 50s-era the story takes place in, but how far they still had to go. It talks about the roles of husbands, wives and children; the sacrifices we all make to support each other, often giving up our own dreams but never losing sight of them.<br><br>Much has been said of the performances here, and with good reason. They're terrific. Viola Davis will get her Oscar this year, there's little doubt in my mind. Her Rose Maxson is so reserved and subtle for much of the film, allowing Troy's continual imperfections and abuses to store inside her and chip away at her emotionally until the final straw causes her to erupt near the final act of the movie. It's an emotional and painful performance to observe, and one many, particularly long-time wives and mothers, will find easy to relate to but at times difficult to watch.<br><br>As for Washington, I find it difficult to understand why he isn't the front-runner for Best Actor this year. I've seen front-runner Casey Affleck's performance in Manchester By The Sea and it is excellent and look forward to Ryan Gosling's turn in La La Land; but what Washington does in Fences is special. Simpy put, it's one of the best performances I've ever seen an actor give. Troy is a very imperfect man to say the least. He's not necessarily a \"bad guy\", in fact most men will be able to see a little of themselves in Troy. He's a likable personality who does some despicable things. HIs tough love approach to raising his son seems more out of spite than love. And while there can be no doubt that he loves Rose, his behavior proves that love and respect are not the same thing. Washington crawls into this raw and complex character, becoming Troy to the extent that no matter how big a star Washington is, you forget you're watching an actor.<br><br>The supporting cast fairs well, particularly Stephen Henderson as Troy's friend and work-mate Bono, Jovan Adepo as his son Cory and Mykelti Williamson as his mentally-challenged brother Gabriel. Everyone seems to be working their hardest to do Wilson's words justice, and their efforts result it what may be the most overall well-acted film of the year.<br><br>Fences won't appeal to everyone. Those looking for action and extravaganza, this is not your movie. But if you're like me and enjoy watching good actors perform a well-written script, then you'll be enthralled by every minute of Fences.","user":"KingKongKyle","rank":[194,260]},{"title":"Performances outshine 'stage bound' script","rating":8,"date":"8 December 2016","review":"First let me say that this is a powerful, engaging film. Seemingly, however stereotypical, the opening of this movie feels like a stage play exposition. Although moving forward I found myself increasingly involved in the life of, to me, a thoroughly selfish, almost despicable, protagonist. Denzel Washington inhabits his role as one would fit into a perfectly tailored suit. The depth of his character fits him like a glove. The dislike of his \"Troy' is palpable. It is Viola Davis' performance that gives us any acceptance, and even a modicum of empathy, for his unrelenting dis- likability. Her 'Rose' is a tour-de-force and one of the most honest performances ever put on film.<br><br>I personally see it as less a film about a man coming to grips with prejudice than as a damaged child trying to make sense of a world over which he was unable to reconcile his life. In the greater scheme of things, yes, he had a menial job, but he did have a job. He has a family that he treats as possessions rather than people. When his son accuses him of not wanting him to surpass his father in life, there is a validity to the claim.<br><br>The direction, cinematography, music and period feel, with the exception of an uneven opening, proves Washington a masterful film maker. The difficulty in adapting a stage play to the screen is almost overcome with only a few scenes playing like a filmed stage set.<br><br>If it were up to me both Denzel and Viola would receive the top 'Best' academy awards with Denzel also receiving a nomination for best director. Unfortunately the stiffness of the script, in my opinion, should keep it from a best film nomination (although it will probably get one). As a side note, it seems silly for Viola Davis to be entered into the competitions in a supporting category. She is the strength of the movie and in too many scenes to even be considered 'supporting.'","user":"Neil-15","rank":[79,107]},{"title":"Brilliant Screenplay, powerful film.","rating":8,"date":"25 January 2017","review":"This film is about a man. A man who carries the burden of generations of hardship, who couldn't fulfill his own greatest dreams because of the oppressive context in which he lived and who tries to close himself off from the world with fences. Tragically, in closing himself off he loses site of the changing times, he boxes his loved-ones in, and he creates an oppressive environment that emulates everything he tried to guard against. The timeless question lies within this story (adapted from a Pulitzer winning play) is: can we hate a man like this? Or, when we consider his circumstances and trials, is he a hero to admire?<br><br>It's worth seeing and is worthy of praise. If not from the acting (particularly Viola's), from the captivating and poetic screenplay. Every word uttered seems calculated by the mind of a genius.","user":"brynjolfson","rank":[13,15]}]