[{"title":"Nadda Bring Nadda Thing","rating":5,"date":"21 February 2015","review":"Premiering during a special presentation at the Toronto International Film Festival (TIFF), October GALE is a dramatic thriller that's too devoid of tension to be considered thrilling and far short of emotional and relatable characters to be considered dramatic.<br><br>It's a shame because the opening sequence of sweeping Parry Sound long shots and Steadicam shots of Helen (Patricia Clarkson) opening and cleaning the family's vacation cottage offered a promising segue into what appears to be (on the surface), a study in normative bereavement with a murderous twist. Likewise, the film's setting is a beautiful contradiction of comfortable isolation that quickly dissipates as the story's nonsensical and improbable choices become too incredulous to be believable.<br><br>Grieving the loss of her husband (played in silent flashbacks by Callum Keith Rennie) in a wild storm the previous year, Toronto doctor Helen Matthews (Clarkson) decides to return to her family's isolated cottage in an effort to move on. After single-handedly opening up the warm and comforting home in Georgian Bay, Helen begins the arduous task of sifting through and removing some of the mementos accumulated during their 32-year marriage.<br><br>The visual and aural planes of this transition from acceptance to perseverance are well crafted; the non-diegetic musical score gives way to diegetic empathetic sounds of the bay that feel crisp and renewing. Fortuitously so considering Helen shortly thereafter comes face-to-face with an unexpected and mysterious gentleman (Scott Speedman) crawling and bleeding on her floor with a gunshot wound. After treating his wound and grabbing her rifle, Helen waits for the stranger to wake up and when he does, Will is vague about the attack and about his life thus far until local handyman Al (Aidan Devine) decides to pay Helen an unexpected visit. Will relents and reveals that he had spent time in prison for manslaughter after a bar-fight and that the guy's father 'is not going to stop until he's killed me'.<br><br>As the storm gains momentum outside, Helen agrees (stupidly I might add) to allow Will to stay in her home as they lazily prepare themselves for Al and the gunman to return. The script here is utter wish-wash: writer/director Ruba Nadda (INESCAPABLE) fails to build any suspense and tension for the ensuing action causing it to fall flat, it fails to explain how Helen's appears to be a survivalist doctor who's also a crack shot, nor the circumstances of Will's incarceration and Helen's inconceivable trust in a man she just met.<br><br>Clarkson and Speedman should however, be applauded for their performances: extracting every nuance they could from their two-dimensional characters to at least be creditable. Overall, if 'it's OK' are the only two words I can come up with after 91 minutes, it's probably safe to say you might want to wait to watch it on video.<br><br>You can catch me on my handle @TheSachaHall or at The Hollywood News.","user":"theSachaHall","rank":[20,25]},{"title":"Very slow and very disappointing and not a whole lot more","rating":3,"date":"21 July 2015","review":"I was wondering why this movie with a such a good cast like Patricia Clarkson, Scott Speedman and Tim Roth managed to have a mere 5.1/10 (current rating when writing this review)<br><br>But when I started watching it, it started to make sense<br><br>In the first half hardly nothing of substance happens and there are plenty of everyday scenes of Patricia Clarkson reading a book or remembering a romantic moment with her husband or fixing with the wood- pile for the fireplace and stuff like that with very little dialogue as she's by herself in the beginning<br><br>Tim Roth doesn't show up until the last 20 minutes, he's supposed to be menacing but comes off as bored<br><br>The plot itself also doesn't make a lot of sense to me, it's extremely simple really but the characters relations to one each other are daftly written, and it's boring, extremely slow and could have easily been cut down 30 minutes and you wouldn't have missed anything","user":"Seth_Rogue_One","rank":[18,25]},{"title":"More of a nondescript breeze, actually...","rating":4,"date":"24 February 2015","review":"October Gale is a VERY apt name for this film. Like the wind, it blows briefly... And then is gone from the memory for good, leaving behind no trace it was ever there. At least the last film I reviewed, as irredeemably dreadful as it was, gave me something to talk about. This one sets up the most minor of conflicts, and proceeds to follow it to the most predictable outcome... All the while, dwelling on uninteresting scenes to pad out the length to 90 minutes, and giving us a romance/friendship which fails to convince on any level.<br><br>After finding this gunshot wound victim on her estate on her island, the heroine is nowhere near a hospital and lacks the requisite supplies to treat him. So, leaving him ALONE... She gallivants off to buy what she needs from the mainland. This is just the start of many risks she takes with this stranger, who for all she knows could be a murderer. Yet, within a few days from being at death's door, he's up and about... Saving her life after she accidentally falling into the sea and exchanging stories with her about each other's 'dark pasts'. She's just lost her husband (As we're constantly reminded through tiresome flashbacks) and he's on the run after killing his adopted brother. Gripping. NOT. 60 minutes of brainless fluff ensues.<br><br>Things get a LITTLE (In the mildest sense of the word) more interesting when the bloke's dad turns up to AVENGE HIS REAL CHILD, and we think we're going to get a bit of action. No such luck. More talking, more walking-around-in-the-dark-not-doing-very-much, and the most obvious of conclusions. YAWN. It all feels like a placeholder for another film, one with proper characters, not these off-the-shelf one-dimensional cyphers. When you've found it, can I watch that one instead, Pls? 4/10","user":"natashabowiepinky","rank":[13,18]}]