[{"title":"'People leave, you know? But for some people, it just doesn't seem fair.'","rating":10,"date":"5 September 2015","review":"BOULEVARD will always remain a remarkable film despite the fat that it did so poorly in the theaters. Written by Douglas Soesbe and directed with immense subtlety by Dito Montiel, this film is a fitting tribute to one of America's greatest comedians, the star Robert Williams who offers a performance that echoes the lives of many men who elect to lead their lives as gay men in the closet for whatever reason. Williams was 63 years old when he died of apparent suicide following a long struggle with depression and this, his last film, is dedicated to this memory.<br><br>Nolan Mack (Robin Williams in a performance so understated that it makes us forget during the film that he was one of the funniest crazies in the comedian arena) is 60, quietly married to an independent Joy Mack (Kathy Baker), quietly working in the same desk in the same back for years, tending his dying father, up for promotion as a bank manager, who turns down a wrong boulevard one evening – a street for hustlers and prostitutes and almost inadvertently picks up a young hustler Leo (Roberto Acquire) and begins a 'relationship' with him, supporting him financially and with attempts to find work for him, but never having a physically consummated act – just being in the hustler's presence is enough. We discover that Nolan is gay and has known since he was twelve but elected to never acted out on it. He has a close friend Winston (an Excellent Bob Odenkirk) with whom he communicates but never admits to anyone except his barely conscious father that he is gay. How he deals with his new discovery of the life for which he has yearned is the manner in which the film plays out – his confession to Joy, the rejection by Leo who has his own interpersonal relationship issues and flaws (a very impressive bit of writing that shows the insecurities of a hustler's mindset), and the trauma that finally exposes his real identity makes for a deeply moving though very quiet story.<br><br>The film, in retrospect, seems an homage to the other side of the comedy mask Robin Williams wore. In many ways it is his Ave Atque Vale. Sensitive, subtle, deep, and heart- wrenchingly real, it is a fine yet sad way to say goodbye to Robin Williams.","user":"gradyharp","rank":[46,50]},{"title":"A heart wrenching story about being honest with oneself","rating":6,"date":"26 April 2014","review":"Robin Williams takes on another serious role here as Nolan, and he does another good job in playing a serious role like this and handling a lot of raw emotions that really diverge from the image of Robin Williams in the role of comedy, although there's certainly some humour he brings to some scenes.<br><br>Really though, the film tackles a very somber and difficult topic as Nolan, long since married, takes a sudden leap into trying to acknowledge his homosexuality when he picks up a young guy off the street, paying him just to spend time with him. The idea of someone in a marriage having an affair usually is linked with boredom or disinterest, or some sort of deficiency present. What makes this powerful is that there is no deficiency in the marriage, it's simply something that Nolan can't choose to be. There is love between him and his wife, but they seem to be different loves.<br><br>To an extent, I found the film difficult to watch, particularly the scenes with Leo, the young man that Nolan develops an infatuation with, but part of the power of the film are those scenes, the awkwardness and uncertainty that Williams brings to Nolan, and the overpowering feeling that he's not sure how to accept what it is he wants. It's a very different sort of story than what I've seen of dealing with someone being gay, but it's strongly shown that it is a story that deserves telling.<br><br>Most poignant about the film, for me, wasn't the film itself so much as what was discussed during the Q&amp;A, and an unusual coincidence that happened during the shooting of the film. One of the filming locations belonged to a couple that had been married for decades, but where the husband came out only a few years prior to being contacted by a location scout. That just adds something powerful to it for me, perhaps just as it really added to the sincerity of the film to have someone stand up and say that the heart-wrenching and painful scenes in the film can be very real, but that the underlying love, even if not quite romantic, is also very real.<br><br>I did find the film dragged, and there was a slow agony to it, somewhat like slowly removing a band-aid, so while I think the core of it is a very powerful set of emotions, as a film I was less impressed, and that as a film it was solid, but not stand out.","user":"Lowbacca1977","rank":[68,83]},{"title":"A Final Bow","rating":7,"date":"9 July 2015","review":"It's been nearly a year since we lost Robin Williams to a long-standing  bout of depression that eventually led to his suicide. This led to an  enormous outcry of grief all over the celebrity and social media world  from those who had grown up on his movies, television and standup and  caused many to reflect on this talent that we had perhaps taken for  granted. No one can deny that his movies weren't always diamonds, but  his work in them was almost always admirable and memorable. The fact  that he spent the last couple of years of his life giving great  performances in terrible little-seen direct to VOD films (\"The Angriest  Man In Brooklyn\", \"A Merry Friggin' Christmas\"), with the occasional  cameo in something truly awful (\"The Big Wedding\"), is a rather tragic  thought. But fortunately, with Dito Montiel's newly released film  Boulevard, Williams goes out strong, if not quite on top.  Williams plays Nolan, a man who's stuck in your typical indie-film  marriage, i.e. loveless. He's friendly and cordial with his wife, but  is clearly missing something vital. One night he's driving home and  spots a group of gay hookers on the sidewalk and after nearly  accidentally running one over, he befriends him and starts to confront  his closeted homosexuality.  He gets advice from his friend Winston, played by Bob Odenkirk, who  brings all the levity and spontaneity that you'd hope for from the guy  who plays Saul Goodman in a role that could have felt a tad  superfluous. He's clearly only in the movie to give Nolan a person off  which to bounce his thoughts, but with an actor like Odenkirk in the  role, it's hard to complain about such matters.  If you feel like you've seen this film before, you probably have. We've  seen this suburbia set-up many times over the last couple of decades,  so when a film goes for this, you really have to count on strong  performances and interesting surprises to make it worth your while.  Thanks to Williams' tender, vulnerable, aching performance, the film  always stays on the side of watchable, and often fascinating. An  electronic synthesizer score often tends to call too much attention to  itself and distract from the fine performances by not just Williams,  but also Roberto Aguire as Leo, the young man whom Nolan befriends.  Fortunately though, once the film firmly establishes what it's about,  such distracting little director quirks either ceased altogether, or  just stopped bothering me.  Certainly for someone like me, a huge fan of his work, it's impossible  to watch Williams play such a sad, morose character and not be reminded  of what happened shortly after this film was finished. It's just  unavoidable. But thankfully, that would just be me reading too much  into the story. The man was an actor, and an excellent one at that.  Remove all of the comedies from his resume, and you're still left with  one of the most impressive collections of dramatic performances in  recent memory. This film is no exception. Every time he smiles to avoid  confronting the pain and confusion that Nolan feels so strongly, we  don't question him in the slightest bit. When we see him look at Leo  with his expression of sorrow and pity, it's impossible not to feel  right there with him.  It may not be best film of Williams' career, and it's a real shame that  he never experienced the ultra renaissance that I'm sure was on the  horizon for him, but as a film for an actor of this stature to go out  on, he could have done much worse than \"Boulevard\".  Grade: B","user":"soncoman","rank":[55,67]}]