[{"title":"A dance show wrapped in a cheesy minimal movie.","rating":1,"date":"1 November 2014","review":"Don't be fooled. This is not an actual movie. It is a dancing show! The plot is minimal and cheesy. Young people who want to have a chance to fame while doing what they love most. Dancing. Any other plot elements like a couple of small dramas are short-lived and superficial.<br><br>Soooo, it all about modern dance. Pop music, hip-hop, breakdance.<br><br>In that department the \"movie\" is OK. If you aren't too much into it, you may find your self bored near the end since the later moves are not better than those at the beginning of th movie.<br><br>This is the 5th part of a series of films, but it doesn't matter if you missed the previous ones.<br><br>Overall a dance spectacle more than a movie with lots of modern music and some fancy acrobatic moves.","user":"Dr_Sagan","rank":[14,17]},{"title":"Stepping up into tiredness","rating":4,"date":"20 July 2014","review":"The fifth installment of Step Up is back in \"Step Up: All In\" with introducing more inventive choreography from expert dancer crews and containing almost all-star member of the series (minus Channing Tatum of course) into a dance competition in L.A. The movie brings a first class and entertaining show that is wanted from their fans. All the dances and flash mob are taken beautifully that has already been a trademark from all the series and what differentiates it from other dance movie. <br><br>Unfortunately there's a contrary and unbalanced between dance and whole elements in this movie. \"Step Up: All in\" suffers with mediocre yet predictable storyline, horrible written script, forgettable chemistry and some average acting from it's entire casts. The movie focuses only on the Vortex competition and how their ambition and preparations to win this thing without care less about anything that would bring boring moments and reduce emotional feelings for the character itself. In other words, this film felt stunning when it related to massive movements with loud R&amp;B soundtrack mixed but once it touches drama and storytelling stuff, it's just that awful. Overall, \"Step Up: All In\" isn't a game-changer of the series, in fact it's definitely just a similar movie from the previous franchise with this time L.A as the background. It shows never-ending competition that is so exhausting to see, but as long as it still delivers spectacle and great moves, it seems would satisfy it's fans and safely stick them from their seats until end credits appear.","user":"aldri-feb","rank":[28,41]},{"title":"Should have all in with the stunning choreograph, and folded the cumbersome script and screenplay","rating":6,"date":"15 July 2014","review":"One of these days Step Up will realize that it's better for the characters to just whimsically dance like in old musical movie without forcing an already stagnant plot. The movie boasts a dynamic choreography and stellar music to go with it, some are timed just right and they are admittedly entertaining. It commendably tries to bring a dancer's perspective on their life style and tribulation, but the plot often contradicts the effort by putting overly flamboyant characters or tired plot. In the end it's just another drawn out excuse for a dance battle, albeit a rather spectacular one.<br><br>Story revolves around characters from previous installments, collaborating to make a crew to win the high stake dance competition. No Channing Tatum though. If this sounds familiar, it is. There are monetary issues, personal issues and dances in between. For what it's worth, the two leads try to bring more emotion to the mix, although only a few good moments come out of it. Adam Sevani (Moose) is a star, the uncrowned lead of the series. It's quiet amazing that his side story resonates more than the actual main plot.<br><br>Problem arises when the movie attempts to exaggerate flamboyant lifestyle, especially those of celebrity's and their reality television. It's far from witty; in fact the humor tends to fall and becomes tiresome to watch. The main antagonists are mediocre unsavory characters; the male is copied directly from the typical random thug that messes with Chuck Norris or Steven Seagal at a bar, while the female is a botched version of Stanley Tucci's character from Hunger Games.<br><br>When the characters don't banter they perform well. Using odd props and good dance moves, they manage to produce a spectacle. Most of the cast are primarily dancers, so they convince the audience better using motion than poorly written script. Wardrobe looks good, each dance is represented with unique costume, the steampunk one is particularly exceptional. With simple yet effective effect, these dance sequences are the heights of the movie.<br><br>Like any other installments, the plot is almost a hindrance as audience waits for another dance scene to erupt. It does try to make audience relate, although it misses the mark more often than not, which is a shame since it invests plenty of time for it. The glossy choreograph and heart-thumping soundtracks present an enjoyable light flick, and to be fair it's what viewer would expect, but sadly nothing more.","user":"quincytheodore","rank":[20,29]}]