[{"title":"Deserved a better fate","rating":6,"date":"15 June 2019","review":"I must admit, what intrigued me about this movie was less the subject matter (I'm neither a big fan of rap nor conspiracy theories) but rather the fact that it was shelved after production. It just isn't that common for a big budget movie featuring A-list actors to get completely shelved--particularly in this day when Netflix and Amazon are always a way for studios to recoup production costs on movies they don't think will earn a profit. One had to wonder whether the movie was just a complete train wreck in terms of quality, or whether the content was just too controversial for the studios involved.<br><br>So I was eager to see for myself. Having seen it, it was a little disappointing in that it is neither a train wreck furthering nails into the coffin of Johnny Depp's disappearing career, nor was it particularly explosive in terms of content. It was a little above just \"OK\" (5.5 is a little more accurate than the 6 stars I ended up giving it). In terms of quality, it is reminiscent of Zodiac, but lacked the pathos that Fincher was able to imbue to characters who similarly couldn't put an unsolved murder behind them. In terms of content, Lt. Poole's story has been out there for quite some time and this adds nothing new.<br><br>The first half of the movie involves Depp and Whitaker reminiscing about the facts of the Christopher 'Biggie' Smalls murder case, which are related in a series of flashback scenes to 16 years earlier. This part of the movie is successful and engrossing.<br><br>Unfortunately the 2nd half of the movie really stalls out, as one can't help but wonder what the two main characters have been doing over the past 15 years. Why are they still obsessed? What leads have they been trying to turn up? What compulsions are driving them?<br><br>Rather than explore this, the movie spends too long on a seemingly pointless side-plot about Poole's estrangement from his son and some minor troubles the reporter has with his boss and the police, some 16 years after the facts of the case.<br><br>The finale is as unsatisfying as the actual investigation in the murder.<br><br>Again, the movie is OK, with the first half being engrossing and educational. But much like the actual case, it faltered in follow-up and resolution. Ultimately viewing it gave me no insight on why it was shelved. Everything about this affair seems like it deserved a better fate than it has received.","user":"jaoneal","rank":[31,43]},{"title":"Interesting Film","rating":7,"date":"24 June 2019","review":"I wasn't expecting much going in. Both Leads are on the downward arc of their careers and both have made some turkeys in their days.\nNot the case in this movie, Johnny Depp is very good as a retired detective who has all the answers but no ability to get things done and Forest Whitaker as the reporter whose star has faded. The two leads play off each other very well and Whitaker complements Depp whose character just might be unstable. Depp is the lead character and Whitaker is definitely the consummate supporting actor.\nThis is a murder mystery with intrigue about the Biggie Smalls murder.\nI know very little about rap and was engrossed with story of corruption and the toll that the search for the truth has exacted on the two male leads.\nA entertaining film with a above average performance from Depp.","user":"jimmyjoe583","rank":[11,16]},{"title":"a little slow, but good","rating":8,"date":"17 June 2019","review":"Jonny depp is an remarkable actor, and fit the detective role very well. tupac and biggie,i dont know much about them, but now i know a little more, also about racism and corruption among los angeles police officers, and some of the coverage made on it.<br><br>its a bit slow at times, and it is a little confusing at moents but allover a good biopic. the grumpy old man recommends city of lies.","user":"ops-52535","rank":[18,30]}]