[{"title":"Julian Fellowes certainly knows his audience","rating":7,"date":"25 August 2019","review":"The creator of Downton Abbey wrote the screenplay for The Chaperone, a story ostensibly about legendary silent screen star Louise Brooks' first trip to New York. Louise's cultured and elitist mother has big dreams for her daughter, which won't happen if she stays in Wichita. Louise (Haley Lu Richardson) can go to New York only if accompanied by a chaperone, and Elizabeth McGovern's Norma eagerly volunteers, for reasons later revealed. Richardson transforms wonderfully, capturing Lulu's energy and insouciance. Brooks quickly becomes the star pupil at the Denishawn Dance School, holds court at a swank Speakeasy called the Velvet Cat, and resents being told what to do by Norma, whom she likes but doesn't necessarily respect. The push-pull between Norma and Louise is a highlight.<br><br>Norma, with her nineteenth century sense of propriety, lives in quiet disappointment and repressed anger. Shocked by what she caught her husband (an excellent Campbell Scott) doing, and haunted by murky childhood memories, in which she was abandoned at a Catholic orphanage, waiting for adoption. The only thing that excites her is tracking down her birth mother and pining for a late life renewal. The film has a pleasing symmetry in how the two women's stories are told: For Brooks, it's just beginning, but also for Norma, in a feel-good twist of irony that is so very Downtonesque.","user":"AlsExGal","rank":[14,16]},{"title":"Nicely done","rating":8,"date":"11 April 2019","review":"Elizabeth McGovern is the reason to see this. She brings to life what, in other hands, could be a cliched character. She has become a much more interesting actress as she's aged; you can't take your eyes off her (those eyes!). The Louise Brooks subplot serves its purpose but seems a bit strained. Blythe Danner, Miranda Otto, Campbell Scott and other familiar names essay their supporting roles well, and the period is recreated nicely. Overall, very entertaining and not nearly as predictable as you would think.","user":"nikatnyte","rank":[17,25]},{"title":"Julian Fellows triumphs again","rating":9,"date":"27 April 2019","review":"Julian Fellows creator of Downton Abbey and 2002 Oscar Winner for Best Original Screenplay for Gosford Park is a master of storytelling and character development.<br><br>The Chaperone is such an interesting insight into the differences in attitudes , judgements and moral and racial prejudices of the early 1920's between 2 American cities Kansas and New York.<br><br>I really liked the way Julian Fellows has made The Chaperone Norma the main character rather than her much later famous ward Louise Brooks played beautifully by Haley Lu Richardson , recently also very impressive in Five Feet Apart.\nThe story is seen through the life experience of Norma ,who at first seems uncomplicated and sweet but as the story develops we soon know why Norma's not in Cherryville Kansas anymore .<br><br>I think this is the best role I've seen Elizabeth Mc Govern play we're so used to her famous role of Cora Crawley Countess of Grantham that this role as the Chaperone at times very dramatic and other times so touching and intelligent is a refreshing example of this actress and her range.<br><br>Louise Brooks went on to become one of the most famous and at times infamous Silent movie Jazz Age Stars and this movie is only a snapshot of Louise before her Hollywood fame. Haley Lu Richardson gives us a glimpse of why her determination and devil may care attitude propelled her to stardom but later sent her crashing to earth and virtual retirement in 1938 until much later her memoir Lulu in Hollywood published in 1982\n3 years before she died caused such a renewed interest in her films and talent.<br><br>As in previous Julian Fellows productions the attention to detail in costumes sets and direction are faultless .<br><br>I really loved this film and thoroughly recommend it.","user":"tm-sheehan","rank":[14,20]}]