[{"title":"Fantastic Romantic Movie","rating":8,"date":"16 February 2020","review":"Absolutely brilliant film. Those who criticise it for dealing with the subject of disabilty should look past the fact Will is disabled and look at the film in the light of what it aims to be, a touching, romance film. Emelia Clarke is great. Sam Claflin is brilliant. A definite must see film.","user":"MR_Heraclius","rank":[41,42]},{"title":"A Most Beautiful Love Story","rating":10,"date":"9 September 2016","review":"At times I feel that humanity has forgotten, or never really knew, what it is to really love someone. Jojo Moyes obviously isn't one of those people. Love isn't the lust we feel at the beginning of a relationship. It's not the thoughtful vision we compile of what the future could be like or how compatible we are. It's not about how financially successful a prospective partner is. It's certainly not all about sex, although it would be hard to come to this conclusion when the media generally plays strongly to that idea. It's the undeniable, overwhelming pull from our hearts that grows only when we really let ourselves care about someone unselfishly. <br><br>Thank you Jojo for playing this out so beautifully. Thank you Emelia and Sam for either knowing this experience or fabulously, convincingly portraying it on screen. This movie is a treat to watch and a glimpse of what it feels like to be a person who lives their life with a moral conscience, an open mind, a respect for beliefs that are different than yours and a desire to see the best in the world. <br><br>I feel absolutely cleansed of negativity after watching this and my hope for the world is renewed. A glorious experience!","user":"pattypiazza","rank":[190,220]},{"title":"Clarke is adorable and the critics get it wrong","rating":9,"date":"3 June 2016","review":"How can so many people get this this movie wrong, especially the critics? The high point of the film is the performance by Emelia Clarke. She is hair-brained, and scatty, completely adorable and wonderful.The camera-work is gorgeous and the soundtrack is second to none.<br><br>Lou (Emilia Clarke) gets a job as a carer to a man (William) who is paralyzed more or less from the neck down. A budding friendship/romance develops; and this is 90% a feel good movie.<br><br>The criticism of the movie that it depicts a life with profound disability as almost worthless is completely mistaken. The movie depicts William's life as worthwhile and precious. It is William's own judgment that his life cannot go on as it is, and that he would prefer to die.<br><br>With regard to this, the movie does tend to downplay the pain and suffering that William experiences. Instead it focuses on the good times and precious moments he spends will Lou. And as already stated, the character of Lou is completely adorable. I am in love.","user":"whitbyscallyred","rank":[334,409]}]