[{"title":"The Power of One","rating":7,"date":"13 April 2014","review":"Greetings again from the darkness. Here's what happens when you don't read carefully. I picked this from the Dallas International Film Festival schedule because I assumed it was a documentary. I was a bit shocked to discover that it's a biopic from director Stephen Bradley, starring his wife Deirdre O'Kane as Christina Noble. Fortunately, Ms. O'Kane and Ms. Noble are friends and the passion and respect shown in the performance allows the film to deliver the message and pay tribute to such an amazing woman.<br><br>If you are unaware of the Christina Noble Children's Foundation, it's worth researching her inspirational story. The film picks up her childhood in Ireland (with fabulous Gloria Cramer Curtis as young Christina). We see the gradual destruction of her family due to her mother's death and her father's (Liam Cunningham) alcoholism. The six children are split up and Christina is raised by nuns in similar fashion to what you might have seen in Philomena or Magdalene Sisters.<br><br>This (and some visionary nightmares) turns out to be her motivation to head to Saigon/Ho Chi Minh City in 1989 as a middle-aged single woman to try and make a difference for the ignored and abused street kids. Her tenacity and bulldogedness not only help raise funds, but also turn the tide for the local police and citizenry.<br><br>Christina Noble's network of homes have helped thousands of children in Vietnam and Mongolia. She is still working tirelessly today and everyday to make a difference. If you are looking for inspiration or proof that one person can make a difference ... look to Christina Noble.","user":"ferguson-6","rank":[22,24]},{"title":"Incredible and beautiful film","rating":10,"date":"15 May 2014","review":"I had the pleasure of seeing a screening of Noble in London a few days ago and this film really blew me away. I had read Christina's book 'A Bridge Across my Sorrows' and I was excited to see how the book translated to film. Christina is played by three wonderful actresses at different stages in her life. Gloria Cramer Curtis who plays the younger Christina was a delight to watch. Sarah Greene who plays teenage Christina was incredible, and she really pulls you in with her terrific performance. Lastly, Deirdre O'Kane who plays the grown up Christina gives an outstanding performance that will make you laugh and cry. Supporting actors are also impressive including Ruth Negga, who provided many laughs from the audience, and the Vietnamese children were surprisingly good, especially the boy playing Lam.<br><br>I liked the pacing of the film, although I feel the film could have benefited with a few more scenes of Christina's childhood. If you have read Christina's book, you will notice a lot of things are not shown in the film. I can understand why the filmmakers did this, as the flashbacks needed to relate to Christina's strength and key events in her childhood.<br><br>The cinematography by Trevor Forrest was beautiful, and shot incredibly well. Another great thing about Noble is the score by Ben Foster and Giles Martin which is one of the best scores I have heard in a long time.<br><br>I am thankful for director Stephen Bradley, his wife Deirdre O'Kane and the producers for getting this film made. It's an incredible story and a film people need to see.","user":"alwynhuk","rank":[21,24]},{"title":"A global look at humanity at its best, and some of its worst","rating":9,"date":"26 April 2014","review":"While this is all sourced as being based on a true story, I almost find that hard to accept, simply because of the sheer number of hurdles involved, on top of the appropriate naming of the titular character, Christina Noble.<br><br>The film straddles two different arcs; on one hand is the early life of Christina, and all the hardships she faced, and it's incredibly bleak. It makes it all the more impressive to me with how bright and energetic a character Christina is by both actresses that play her as a child and a young woman, and it does feel like the same character the entire way. Christina's Irish upbringing also is somewhat familiar cinematically now as the state of Ireland's treatment of children was showcased recently in another true story, Philomena.<br><br>While her early life is simply, well, tragic, the other arc is of much more mixed tone, as she travels to Vietnam after her kids have grown up, now played by Deirdre O'Kane, and she does a great job as Christina, from the humour and tenderness to the strength and determination. She takes the role very naturally, and her portrayal of Christina is very warm, and I think part of this may be O'Kane's involvement with Christina Noble's charity beforehand, so I think her performance was strengthened by her personal investment. As she finds a calling helping the homeless children of Vietnam, and tries to figure out how to help, she serves as this great and uplifting protagonist, all the more impressive given that this is, again, actually a true story and really did happen, to at least some extent.<br><br>In Vietnam, the story isn't simply carried by O'Kane, but has a great set of supporting roles. Right off the bat, the employee at the hotel front desk that calls himself \"Mr. Front Desk\" or some such thing has a great role as this begrudgingly helpful curmudgeon, and almost all his lines were great, both in writing, and in performance (and I'm somewhat annoyed that I don't remember a name ever being used for him for me to give the actor proper due). The children in the film are great, and a few of them even have more involved roles, and they actually have all been, or still are, helped by Christina Noble's charity and that makes me all the more impressed by their involvement as well.<br><br>It would be very easy of me to criticise the overly dramatic nature of this film and it's lack of believability, but what's so impressive is that I don't think it actually did take that many liberties to make it the story it is, and as raw as the film is, it's genuine. It does make the film much more powerful, and the points it makes about being poor being a constant experience anywhere is a very salient one, and the way Christina steps up the challenges in Vietnam is extremely compelling. There's so many social elements on both small and large scales that this film touches upon, and that's quite impressive.<br><br>There's something I find very moving about a film with such a vibrant person as Christina Noble (as depicted, but apparently fairly accurate) that faces so many challenges with that strength.","user":"Lowbacca1977","rank":[16,18]}]