[{"title":"A rather disappointing movie that proves that CGI cannot cover a bad story","rating":2,"date":"29 June 2016","review":"***Spoiler Alerts***<br><br>The first thing you will likely notice about this movie is the absolutely GORGEOUS animation. And well, that's about all you'll see. I've not watched a lot of Matsumoto's work, but I'e read enough to know this isn't the true backstory for some of the main characters. In general they tried to make a series from the 80's that could very well take weeks of binge reading and cut it down to about 2 hours. Which will not cut it. If you are already investing some $300 million on a movie, it means you have enough money to make a 3-4 parter. Because that's how long it would take to inform the average Joe of everything that's going on in the universe. Because aside from that, nothing would be memorable. If i hadn't read or seen some of the manga or anime beforehand, I would think that this started out as Star Wars in the beginning and throughout, combined with Halo 2, with Final Fantasy, and combined with Cowboy Bebop. Here's the story for you poor confused souls, 1) Big war happened because of too many births. Apparently they found this out when the human population reached 500+ billion. 2) Resentful from the way he was treated and cast away from home, Captain Harlock uses the power of the dark matter, basically super nukes made from the alien's essence, and decides to rid the Earth of all life. 3) Ridden to the core in guilt he flies around the galaxy looking for a way to just end all suffering because he royally f*cked the Earth up, so he finds some 100 galaxy sized nukes that was basically like doing an easter egg hunt inside an empty barrel. 4) Kiddo from the basically Star Wars Empire (Here its called the Gaia Coalition) decides to try to make his unappreciative brother happy for a mistake he did as a kid, and plays a saboteur. He becomes attached to a pirate crew (pirate being used loosely because they're only after the big galaxy nukes) and decides, \"Imma be a pirate!\" and plot twist happens. 5) Plot twist happened and after a small discussion with his older brother, he decides after having a flashback of an accident that happened when he was like 8-10 years old and only wanting to do his mom proud that he will finish what started. Plot twist happens again. 6) After this plot twist he finds himself unable to kill the captain so he decides to take a stroll on Earth, somehow still inhabitable by one person because a patch of flowers are still alive, but don't worry about the ash and debris or smoke filling you up, and picks some flowers while an interstellar war is going on. This i guess was a way to show the captain life still lives, but life adapts. It doesn't mean that that flower is a symbol that the Earth is safe again. 7) So after the heart-felt moment between Captain Harlock and his flower, we decide its time to take back the ship. Well that goes about as awfully as they could've planned, as the entire Coalitions fleet is there, and they got a toy still functioning after one use in 100 years. Looks like an exact replica of a Halo (video game) ring. And it fires what appears to be the Death Star on meth. And it misses the Earth AND the Arcadia (The ship). Threads that tiny space needle. But if the ship auto repairs why do they ever fear it being completely destroyed? In fact the original pirates of the Arcadia were fearless freedom fighters that often mindlessly obeyed Harlocks orders. But they cowered time after time in some really basic concepts of being rebels. Fighting the government. If you made it to the end of this movie still wondering what happened, you weren't alone. The movie made an impression like it was Pirates of the Caribbean: Curse of The Black Pearl, if it was in Will Turner's POV the whole time, whereas it mentions very little about Captain Harlock, his crew, or even the main kiddo here that cant decide which side to be on. The movie failed to even deliver to me memorable names, because aside from Harlock,I hardly remember any of them. It was space fight, go find the big bomb detonator that for some reason is in plain sight, another space fight except a little less action, and then finish with the kiddo becoming the captain even though the original came back to life from the powers that be. Overall a very boring and time consuming experience, but worth a watch to allow all these greedy game devs or 3D animation studios that top quality graphics can NOT cover a crap story. Because I remember the manga in the 80's featured a lot more depth. This is like the shadow of the real story. If that much.","user":"razoredge-34061","rank":[12,12]},{"title":"A great opportunity is lost. It has everything except a good script.","rating":5,"date":"13 October 2013","review":"The film was released yesterday, Oct 12h at Sitges Film Festival, here in Barcelona. This is a brief summary of my impressions:<br><br>The first half hour of film announces an awesome movie: with a great intro the movie is presented visually stunning with a wonderful soundtrack, interesting characters, great action, but soon deflated by the poor script.<br><br>Note that this is a Harlock film where Harlock is not the main character!<br><br>The resources and ideas in some of the action scenes are weary of repeated over and over again...<br><br>The cinematography is great until after the first 45 minutes aprox. , then the film becomes very explanatory , with many dialogues and voice- overs. It's from there when the script becomes poor.<br><br>The changes in the character of Harlock are very large and they even betray the original spirit. In addition, i was tired with that \"dark matter\", an element of the movie used as a deus-ex-machina over and over again throughout the film.<br><br>A great opportunity is lost because the movies is visually stunning and the artistic design work is very good. If they had wrote a simple script , elaborated but not so complicated and keeping the essence of the character, the result would have been much better.<br><br>It's a shame, but i had an entertaining audiovisual 3D experience and i could discovered a beautiful soundtrack that i want to listen again and again imagining my ideal Harlock film.","user":"harlockbcn","rank":[116,159]},{"title":"Nice animation hindered by inconsistent gibberish","rating":5,"date":"21 July 2015","review":"There's a strange tendency in Japanese animation , it often uses cryptic and vague script to give the illusion of depth. Those who are familiar with animes or games would recognize this outdated pattern, the quirky storytelling would seem to be meaningful as the characters brood over a crisis, yet it barely tells anything relevant to the audience. In some cases it might even alienate the viewers.<br><br>This is the persisting problem with Harlock. It certainly presents good quality visual as it floats across the light show, but the vague narrative hurts the presentation. The dialogues may sound flamboyant, yet it is actually shallow and superficial. Backstory is glossed over while the interactions are deprived of enjoyment. The characters, even though looking attractive, just can't generate enough interest as they banter with foreign jargon.<br><br>It even resembles teen drama instead of space voyage at times. Development is often crude, only to give dramatic scenes without substance. The main story follows Yama as he tries to catch the titular Harlock. Both of them are not that audience friendly, they are already in lamentation with barely any introduction. It's hard to relate since they look like generic RPG cast with average mellow issue.<br><br>Then it becomes heavily convoluted as the movie tries to mix strange terms, they sound ominously impaction like dark matter or ancient race, but material is too thin. After a hefty amount of scenery changes, cool poses and starship fights, the movie can barely hold interest for characters and with relatively long runtime it turns into a plodding endeavor.<br><br>This is Final Fantasy: The Spirit Within all over again, glossy effect and drab boring story. It will be hard to either garner interest for new audience or please old fans with such lackluster narrative, but at least it works for an eye candy.","user":"quincytheodore","rank":[22,28]}]