[{"title":"At last - BRAINIAC!","rating":8,"date":"15 July 2018","review":"This adaptation of the modern day story of Brainiac by Geoff Johns, possibly the greatest Superman writer of all time, is well done. It leaves out the death of Pa Kent, but he does do some world saving. Brainiac, voiced by John Noble (Fringe, Denethor) is quite menacing. A really well done animated movie.","user":"mhorg2018","rank":[6,6]},{"title":"DC's apology for \"Brainiac Attacks\"","rating":8,"date":"13 May 2013","review":"Kal-El aka Superman has spent a lifetime defending his adopted homeworld of Earth. For years, he had thought of himself as the last son of Krypton. Only his fortress of solitude and his cousin Supergirl serves as a reminder of the world Superman was born on. But now, Superman will be faced with a dark figure from his planet's past. What seems like another typical day of foiling heavily armed kidnappers turns into a fight for Earth's survival as a dangerous robot probe from outer space is identified as a drone of \"Brainiac\". Brainiac, as Supergirl recalls, was responsible for the disappearance of Krypton's capital city, Kandor, along with Supergirl's parents. Superman leaves to confront Brainiac while Supergirl dishes out her own brand of justice on earth.<br><br>What follows is possibly the most epic of all Superman battles ever put to screen. We have Superman taking on hordes of advanced machines strong enough to hurt the man of steel. We have Superman facing down the cybernetic enhanced Brainiac who is smarter, faster and more powerful that he is. The movie earns its PG-13 rating with blood and violence. After all, Brainiac seeks to hoard all knowledge in the universe. What better repository of knowledge than the brains of living creatures? Ouch!<br><br>The conflict against Brainiac truly pushes Superman to his physical limits. Staggering action, epic in scale, is beautifully animated by Moi Animation who bring graceful fluidity to the movements of the characters.They manage to blend the 3D CGI vehicles seamlessly with the traditional 2D characters while giving everything a slightly more \"Japanese anime\" touch.<br><br>Our characters are, once again, voiced by a wholly different cast as is the case for each DC animated movie production. What stands out is how witty the humor is in the script. The humor works and it fits perfectly without feeling forced. Delivering a near perfect performance are the voice cast directed by the impeccable Andrea Romano. Special mention goes to John Noble as brainiac, Stana Katic as a very Margot Kidder-ish Lois Lane and Matt Bomer as Superman/Clark Kent. Bomer especially takes great pains to have different accents when playing the dual personality of Superman and Kent, helping to highlight Kent's Kansas upbringing. The story devotes a good amount of time in developing the relationships Superman has with Lois and Supergirl, which in the end makes for a very human look at the Man of Steel.<br><br>Central to our narrative is the theme of one being protecting others to the point of intruding into and controlling their personal lives. The way Superman is constantly looking over Lois' shoulder even in peacetime, the way Supergirl intervenes in international conflicts, how are they different from the way Brainiac keeps his captured subjects in line by policing their actions under the excuse of protecting them? That parallel is drawn more than once, along with the constant question of whether Superman's loyalties lie with Earth or other Krypton survivors.<br><br>For all its good points, Superman Unbound is one of the more visually inconsistent DC animated projects to date. The character designs are angular, somewhat skinny and rather similar to the designs seen in 2005's \"The Batman\" TV series. It does take some getting used to, particularly for those who did like Gary Frank's art in the original \"Superman: brainiac\" graphic novel. The least they could do was to keep the art consistent though. Just take a good look at Superman's chest-to-head size ratio which expands and shrinks from scene to scene.<br><br>Then you have some obvious animation mistakes that just look weird, especially this one scene where Superman seems to have a hilariously long arm. The level of detail in the artwork is good for the most part, with metallic reflections in metal surfaces on the robots, folds in Superman's costume and cape and a good light/darkness contrast in the colours. But then you have a good number of scenes where the level of detail drops to the level of a low budget TV series. Oh and remember that bit about trying to give the show a more \"Japanese anime\" touch? You have scenes just like Japanese anime; a still frame with minimal motion tween movements, complete with exaggerated anatomy, weird angles and action lines. <br><br>If one can look past some of the visual shortcomings, there is much to enjoy about this animated film. The music by newcomer Kevin Kliesch takes cues from both Hans Zimmer and classic Jerry Goldsmith while still paying due respects to the timeless John Williams style. The way Clark Kent and Lois Lane play off each other is cutely reminiscent of the Christopher Reeves Superman movies, and the humor is truly funny without being corny. Overall, this would have been truly awesome in live action. Hopefully July 2013's \"Man of Steel\" would be able to top this in all aspects of storytelling and characterization.","user":"xamtaro","rank":[16,24]},{"title":"Has enough right elements, but still lacking","rating":6,"date":"16 February 2015","review":"The showdown between superman and Brainiac has a lot going for it, but I couldn't help but be bored. Mainly because I found the movie lacking any real intriguing substance. Despite the world being in jeopardy and all that, which has been done millions of times before. I just couldn't get into the cause of it all. There are some philosophical messages, which I did agree with. And I thought the reason behind Brainiac obsession with control and what happens when he loses to somewhat have depth. And one of the message that Superman's uncle Zor-El gives him. All in all, it had enough right elements to make it a above average animated superheroes movie. But I just didn't feel all that invested in it from start to finish. <br><br>6.7/10","user":"KineticSeoul","rank":[3,3]}]