[{"title":"The hooligan version of Yuri Boyka (?)","rating":7,"date":"21 October 2013","review":"The truth is that this part of the trilogy Green Street is not like the previous movies. It's completely different from the other two parts, especially the first. This film doesn't care about the violence between the football fans and its bad consequences. The movie is just showing us some people, who are training to compete in an underground fighting tournament. Of course the leading actor is looking for revenge about his brother's murder, but the viewer doesn't really care about it.<br><br>I enjoyed a lot Scott Adkins in the movie. I prefer him with tattoos, beards and more wild style (I'm talking about Yuri Boyka in Undisputed 2, 3) but he was enough good here too. I like his style of fighting and the way he trains his team in this movie. Definitely, there is a lot of fighting scenes and that's why this is not a dull movie.<br><br>If you are looking for an action movie with people kicking some asses all the time, this film is a good choice, without thinking. Watch it. But if you want to see a drama like Green Street Hooligans 1, you won't be satisfied.","user":"akiskanaris","rank":[26,35]},{"title":"This should have been cancelled for play long before it became a franchise","rating":4,"date":"31 October 2013","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning<br><br>Danny (Scott Adkins) turned his back on football violence long ago, and now devotes his life to mixed martial arts fighting, until he learns of the death of his little brother. Determined to find out who is responsible, he returns back to his old stomping ground and sets about trying to turn the new 'firm' from flabby, beer swilling no hopers to the top boys they once were. But along the way, he finds everything is not as it seems.<br><br>More 'repellent, brain-numbing bilge' then...obviously the first, direct to DVD sequel to 2005's Green Street did well enough that some bright spark decided a second instalment was needed, with martial arts star Scott Adkins in the lead role. Directed by James Nunn, who previously helmed the infinitesimally superior Tower Block, there is at least a little more meat on the bones and less of a boorish hooliganism love in here, but it still can't help but feel like a meaningless, decidedly odd way to spend film making money.<br><br>As others have noted, it seems to have moved away from the original street corner/back alley street fighting and seems to focus more on professional looking fighting (which may explain Adkins in the lead role), with constant references to 'how it's all a lot more organized and sophisticated' now, which further shows how far from the original source material it's strayed. It's filled, as well, with plenty of laughable slow motion, opera drenched 'men marching in to battle' moments and Rocky wannabe training montages. And Adkins is a wooden lead. This series should have been kicked to the touch lines long before it even tried to become a franchise. **","user":"davideo-2","rank":[11,15]},{"title":"Scott Adkins has to be more picky in his choice of movies","rating":5,"date":"23 October 2013","review":"First of all, I have to say that I haven't seen the first two movies, and I don't know if I have missed anything. But if you deem this one a autonomous movie, then I can say a few points about it.<br><br>Regarding the story, it is your everyday martial arts movie story. Our hero's brother is murdered in a tournament (firm!!!), and the hero enters the tournament and avenges his brother. I don't think I can even this review as containing a spoiler, because this kind of story has been known and predictable since the good old days of Bruce Lee.<br><br>But there are many plot holes. We don't know what's the point of the fight at the beginning of the movie. We don't know why the two police officers release Scott. and some other \"we don't know\"s.<br><br>Scott Adkins' acting is acceptable, though not an Al Pacino. The guy who plays his kinda fat friend, though, outdoes Scott in acting. The saucy girl who is done by Scott wasn't bad either, she was, however, casted for something else as you know, not for her acting.<br><br>Regarding the fight scenes, we have almost none of them till the middle of the movie (except for the short meaningless fight at the beginning of the film). The final fight is surely the best one in the whole movie.<br><br>All in all, it's quite an average flick, but Scott can be very higher than that. I hope he gets more picky in his choice of movies and makes better ones in the future with all the talent we know of him. Good Luck everyone. my Score: 5/10","user":"david-martial-artist","rank":[9,15]}]