[{"title":"His best one..IMHO..","rating":10,"date":"28 December 2013","review":"Very funny, didn't drag on too long as some have done, was entertaining throughout, along with adding enough drama to keep you interested. Larry the Cable Guy and Tyler Perry should work together more often, they were very funny in their scenes together. The scene where Madea stopped in and used the rest room, and the klan was gathering was hysterical. I wish Joe Simmons and the Brown's had made an appearance or two, they were some of my favorite characters from the previous movies. Nothing is funnier than when Tyler Perry playing Joe Simmons and Madea start arguing with each other. That kid Noah Urrea who played Bailey in the end is exceptionally talented, his future is very bright.","user":"edgmonjeff","rank":[17,27]},{"title":"Merry Christmas, Madea Style!!!","rating":10,"date":"15 December 2013","review":"Tyler Perry is a very interesting person. He gives Tommy Wiseau a run for his money. In pretty much all his movies, there is random sub-plot drama that I love to make fun of. There is always some woman in an abusive relationship or trying to better herself, up to a family member slowly dying from a disease. Personally, I just wish he'd stick directly on the Madea character. She's the main star that everyone wants to see. That's what was great about her last outing, Witness Protection. It was basically focused on her and dealing with Eugene Levy's family. <br><br>A Madea Christmas kinda returns to the basics with a little family drama, but not overkill. It was the right amount of drama and the right amount of Madea. It's filled with good comedy, cheesy but funny one- liners, good messages, and should hopefully put you in the Christmas spirit. <br><br>Madea is working part-time at a department store for the holidays with her friend, Eileen. Eileen is depressed because her daughter, Lacey won't be able to make it home for Christmas. Eileen asks a reluctant Madea to help drive her out to Alabama to Lacey's for Christmas. Lacey is startled because she has not told her mom that she has married a white man named Conner. Lacey soon has to deal with in-laws, keeping secrets from her mom and trying to get the Christmas Jubilee to keep its religious tone. If you love Madea and Christmas movies, I highly recommend A MADEA Christmas!!!","user":"Pumpkin_Man","rank":[13,21]},{"title":"\" A Madea Christmas \" - 4 Thumbs Up for Christmas Laughs","rating":10,"date":"15 December 2013","review":"\" The hilarity of Larry The Cable Guy, and Tyler Perry keep this Christmas picture moving with over 115 laughs. \". Russell &amp; Cissy <br><br>Madea (Tyler Perry) accompanies her niece, Eileen (Anna Maria Horsford), to the small town of Buck Tussel, Alabama to pay a surprise visit to Eileen's daughter, Lacey (Tika Sumpter), who has refused to come home for Christmas. The real reason Lacey is avoiding her judgmental mother is that she has secretly married Connor (Chad Michael Murray), a white classmate from college. When Eileen and Madea arrive at Lacey's farm, she tells them that Connor is an employee, but her lie soon spins out of control.<br><br>R &amp; C Warnings: sexual references, crude humor and language (3).<br><br>Audience Emotional Responses ( Based on a near to full house ) Laughs 116, Ooooos 2, Awe moments 1.<br><br>Rating: PG-13: Parents Strongly Cautioned <br><br>Lions Gate Films - 1:52 - Release Date: December 13, 2013 <br><br>Russell &amp; Cissy, the Two Movie Critics rate movies based on ENTERTAINMENT VALUE only. Follow and LIKE us on facebook at TwoMovieCritics to receive new review updates.","user":"iMovieCritic-666-701399","rank":[15,25]}]