[{"title":"Don't take it too seriously, or you'll miss out","rating":7,"date":"1 February 2015","review":"You may find yourself asking just what in the hell you're watching within the first 15-20 min. Press onward, and don't take it too seriously - you'll miss out on the fun ride. It's akin to something like 'Todd and the Book of Pure Evil.' The acting is good. Writing, wardrobe, sets, sound, effects, etc, are all on par with the budget - again it all works for what it is. You can tell the entire production team had a great time making this film, and made something they were proud to screen.<br><br>Bottom line, I know this review sucks, but for someone looking for a fun, raunchy indie horror-comedy based on Lovecraftian mythos, look no further.","user":"snakepaws","rank":[28,37]},{"title":"A micro budget horror done right.","rating":6,"date":"2 November 2015","review":"This is a fun micro-budget horror-comedy with some decent (some not) acting and practical effects. Simple, yet interesting plot with full of Lovecraft references and some expected gore n' nudity. Of course there are some boring parts here and there but it is watchable (even more than once with the right company of people) Although makers of this movie say they are inspired by the works of H.P. Lovecraft, I think their biggest influence is Troma films. The tone of the movie, colors, special effects and yes the penis monster reminded me of good ol' Aroma du Troma. Call Girl of Cthulhu isn't Chris LaMartina's best film and H.P. Lovecraft wouldn't be proud. But Lloyd Kaufman would!","user":"GWShark","rank":[10,14]},{"title":"\"Answer the call\"!","rating":7,"date":"26 February 2016","review":"If you are like me and have come across this movie and think the title alone is hilarious and worth watching, Call Girl Of Cthulhu will not disappoint you. Call Girl... is a very tongue in cheek, micro budgeted horror/comedy that delivers the campy and gory goods. Considering of course this is centered on our leading lady of the night Riley and her occupation is to fulfill the needs of all kinds of horny men, the film has a whole lot of sex appeal and delivers in that area as well. Riley, is a smoking hot hooker with a heart of gold that ends up in a romance when meeting an awkward, but sweet artist and virgin who paints her portrait. Things go awry when Cthulhu cultists search for their god's bride who is a hooker that bares the birthmark destined to be Cthulhu's mate and bring about the end of the world. For this Riley is destined and only her boyfriend and his punk/industrial noise artist chick and roommate can put a stop to this. For a movie dealing with prostitution, alien gods, cult worship and Armageddon, the film has an innocent quality to it an has mostly a light tone. Although this movie was extremely cheap, the performances by the actors are actually good and the characters are developed well throughout the course of the film. The f/x are cheap and cheesy, but are practical at least. Plus this film is cheesy, but in a good way. Call Of Cthulhu is good for what it is. There are no shortage of horror movies based on the writings of HP Lovecraft, but I do like writer Jimmy George and director Chris Lamartino's take on the material. If you want to see a more serious adaptation of Lovecraft's works that has more of a budget to work with the I suggest to check out director Stuart Gordon's films. He made a lot of good films based on Lovecraft, some of them are great and absolute genre classics.","user":"dworldeater","rank":[7,9]}]