[{"title":"When low budget sci-fi's are done right","rating":7,"date":"13 May 2016","review":"Kill Command is a solid movie, there's no doubt about it. I'm a big sci-fi fan and I've watched many, many low budget sci-fi productions. Kill Command is by far, the best one yet. Putting aside the awful script, the movie looks very professional and the acting, although a bit stiff in places, is decent. Considering the modest budget of 1 million, the special effects are fantastic. The robot designs are nice and detailed and the battle scenes are made very well. The sound effects and the music are top notch. Unfortunately, as I've stated above, the script is bad. Although all of the scenes are shot with taste, the lines that the actors must deliver are terrible. Some of the scenes feel incredibly artificial because of the bad script. There is a constant tension throughout the movie which will keep you interested but it leads to a weak culmination. All in all, I feel there's a lot of wasted potential when it comes to the script but despite that, the movie is enjoyable - 6.5/10.","user":"procletnic","rank":[142,153]},{"title":"Worth the watch","rating":6,"date":"16 May 2016","review":"If you're like me, you are very leery of low budget sci-fi and horror films that are written and directed by the same person who is relatively unknown and not yet an established filmmaker. More times than not, the script and acting are embarrassingly amateur and a complete waste of your time. Well, this film is a definite exception to that generalization. Apart from the lame title, this film is actually quite entertaining and worth the watch. The special effects are quite impressive and the acting and plot is good enough to keep your interest from beginning to end. If you are a fan of movies like Skyline, Predator, and Terminator, you will probably enjoy this film.","user":"electricrain","rank":[78,86]},{"title":"Solid sci-fi thriller","rating":5,"date":"5 May 2016","review":"Just got back from seeing this, and I'm glad I did. Kill Command is a relatively straight-laced sci-fi that takes itself seriously - and is the better for it.<br><br>A military team are sent to training, when they are attacked by robots. They are accompanied on this mission by an upgraded woman. I'd go so far as to say it is best to leave the summary here, as the story unfolds in an organic and sometimes surprising way. Dialogue is always solid and acted well, thankfully.<br><br>Pacing of shots is excellent in my opinion, although my friend felt it could have been tighter. There are a few jump scares, but the best tension as always is when a scene drags on while we're not quite sure if the team is being observed.<br><br>There are some plot holes, but nothing that can't be ignored. Frankly, it just about works in-universe because of the light touch with world building.<br><br>Worth the watch, especially for fans of sci-fi.","user":"atmhso","rank":[93,109]}]