[{"title":"Decent dystopia/apocalyptic tale. Visually and tonally impressive.","rating":8,"date":"19 October 2014","review":"First up I'd really like to counter the earlier reviewers claims that this is \"A story that had true potential was crippled by a lack of character development, and the nonexistence of focus\" What utter nonsense, just because a film uses subtly instead of a sledgehammer to get it's message across and credits the viewer with at least a glimmer of intelligence does not make it a bad film. On the contrary this is a fantastic film with a story arc that builds to a satisfying conclusion. Yes the pace is slow but clearly this is to enforce the ideas within the narrative, a parched existence if you will. For me the pacing wasn't an issue at all and created a pleasant tension. Visually it is stunning and the production design and the near-future technology was extremely well realised and executed. Fans of 70's sci-fi should look no further.","user":"neilrudd999","rank":[73,91]},{"title":"Art house Sci-Fi 'must see'","rating":8,"date":"29 December 2014","review":"If you love the artistic and non-mainstream risks taken by art-house films, then Young Ones belongs on your watch list with other indie Sci-Fis such as Lars von Trier's Melancholia, Juan Solanas' Upside Down, and Terry Gilliam's The Zero Theorem.<br><br>A gritty film about pioneers in a drought ridden landscape, it's a futuristic dust bowl tale as grim as Grapes of Wrath. It's memorable and keeps your attention, while portraying Sci-Fi in a very believable way. The mix of poverty and high technology, the extremes of the haves and have-nots, and water shortages in the US, amplifies the current state of a society as all good sci-fi films do.<br><br>Good actors and acting, and gorgeous to watch. What's not to like?","user":"Htbug","rank":[35,42]},{"title":"Rating Should Be Higher","rating":7,"date":"24 February 2015","review":"This is a good movie. It looks good. It's interesting. It has a decent plot. It also has a few well defined characters, one of which is Ernest Holm, the father of two teenage children and the owner of a barren stretch of farm land turned desert. Holm is played by Michael Shannon in convincing fashion. He is determined without being unscrupulous. He is flawed yet humble enough to know it. He has convictions. He loves his family. This film reminded me of There Will Be Blood. The Daniel Day-Lewis movie is, of course, superior to this one although there is a similar perspective of harsh land and desperate men whose fates lie in their ability to coax wealth from it. The other major difference its that this is set in the near future and has the conceivable technological improvisations of a world where water has become the most rare commodity. All in all a pretty good movie well deserving of a much higher rating than it currently averages.","user":"avidnewbie","rank":[23,28]}]