[{"title":"Ridiculous","rating":2,"date":"21 June 2015","review":"I didn't give this a one because I finished watching it. This is one of those movies where you ask yourself, are people this dumb. The things the characters do is well you wish you can reach into the screen and slap one of them. I enjoy monster movies and time traveling but this didn't do it for me. The acting is lousy and I have to mention I am glad it was a free movie. I would have been upset had I been the one to pay for it. A movie you can watch if it comes on free TV in a late late late movie. I really do not know what else to say here because I need to write more lines. There really is not much else to write about without giving movie dialogues. I basically already wrote the obvious. It is a lousy movie and watch it when you have nothing else to do but don't buy it A civil war with Frankenstein's.","user":"keko922-2","rank":[20,29]},{"title":"Like actual Frankenstein's monster, it's an abomination of poorly made sci-fi and horror stitched together, but it's highly ludicrous it might trigger some sympathy laughs","rating":3,"date":"23 June 2015","review":"Within the first few minutes we can see the less stellar caliber of acting and production. Nearly everything is made for ironic purpose, either it's intentional or not. There's so much exaggerated premise and clumsy delivery, it's hard to take the movie seriously and even as parody it can barely register any response, aside from a few chuckles when the film delivers terribly out of place scenes where you can't help but slightly grin.<br><br>The plot is a jumbled mix or time travel and a bunch of sci-fi gimmicks, none of these really fascinate. Actors are often cringe-worthy in their performance, although the lead may be funny since he looks adequately like a normal guy. Characters are variety of unsuitable personalities with jarring costume and hairdo, or just simply over the top misinterpretation of the era. Even it plays with historic and scientific backdrop, the film has no accuracy in either aspect. I guess it's a tad optimistic to hope for those.<br><br>It will get worse towards latter half, if one can make it pass an hour of characters waddling on a random field and tons of gibberish. The effect is abysmal, literal green screen mess. It has slightly lengthier runtime than most movies but there's really not much it has to offer. You might find some amusement, but it's recommended to invest time elsewhere.","user":"quincytheodore","rank":[11,16]},{"title":"We're from the future and it's time to kick Frankenstein's ass!","rating":2,"date":"10 August 2015","review":"This film is supposed to be a horror/comedy parody however it falls slightly short and is a lot less amusing then the film makers hoped for. The acting is bad, effects are cheesy, narrative is high-school simple, and the plot has more holes than Cheddar cheese - pity because the title alone conjured up loads of potential entertaining visions in my head, oh how dearly the reality of the film let this down. The funniest part of the film for me was in the opening where an American Civil war soldier gets his arm torn off by a Frankenstein who then beats the soldier with the bloody part of the stump, from here it all went downhill for me. Even despite the best efforts to use modern technology and times gone past to create a Steampunk feel in the later parts of the film didn't quite hit the mark for me. Special mention has to go to the costume department for the first half of the film, you will not believe how incredibly fake the moustaches and beards are in this, Groucho Marx would have laughed!<br><br>I'm going to use the word Frankenstein a lot as I mention the monster in this film, I do know that Frankenstein is the name of the scientist who built the monster and not the name for the monster. This film doesn't seem to understand this but if I went off on a rant saying that this ruined the film for me then I'd need a lot more page space for a ranty review, instead of that I'll just use the stance the film did and refer to the monster as a Frankenstein.<br><br>The story in a nutshell is that the descendant of a Civil War soldier is feeling down on his luck after his girlfriend turns down his marriage proposal. On a long walk home he is assaulted and kidnapped. He wakes up to find he part of a mad scientists experiment and is about to lose his eye ball. During the procedure of building a Frankenstein something goes wrong and the Scientist, his young Igor, the kidnapped man and a handful of Frankenstein's are sent back in time to the American Civil war. At first the Frankenstein's attack everyone but a slave girl manages to communicate with the monster and in effect get him to fight on her side. Unfortunately it wasn't just people who travelled in time but also parts of the lab where the Frankenstein was being put together, on that note the opposition forces in the war managed to procure some serum which could turn the living into monsters. On top of the man vs man fighting it later becomes man vs man vs monster vs new monster, all a bit messy really but it's not hard to follow who is who's side. The war eventually comes to an end but then the hero's of the film are beckoned to Washington to meet Abraham Lincoln who has a mission for them, he wants to stop the newly created monster and the leader of the opposition forces who themselves are plotting with John Booth to assassinate Lincoln. Despite everyone's best efforts to change history it doesn't work. After all the Frankensteins are dead our hero travels back to the future where once again he is turned down for marriage by his girlfriend however this time he isn't as worried as he's grown as a man and can understand the rejection more. <br><br>I was hoping for something better than what unfolded on screen, I feel this was a little bit of a let down. It also felt like this was two films tied together, everything that happens from the end of the Civil war leading to Washington felt like a lot cheaper film - perhaps the budget had been blown by then, but there was more green room and CGI in a studio than the first part of the film. I'd go as far as saying the amount of bad CGI and green-screen in the second part of the film is off putting. The star of the show was a young Christian Bellgardt who played the grave robbing, scene stealing \"Igor\". Despite seeing his back story and following him around the film your affection only lasts for a while as he is yet to fully become a convincing actor.<br><br>There was a lot of promise which wasn't delivered, as far as parody horror comedy during the Civil War goes I'd watch \"Abraham Lincoln: Vampire Hunter\" any day over this.","user":"one-nine-eighty","rank":[3,3]}]