[{"title":"Performances: Great, Story: Okay, Climax: WTF? [+46%]","rating":5,"date":"31 July 2017","review":"While the title and synopsis suggest a survival drama, this movie in fact gives you very little detail on the actual measures taken to 'survive' in a situation of prolonged power outage. Two sisters, Nell and Eva, are left orphaned after their dad succumbs to the injuries he received from a chainsaw accident, leaving them helpless at their house with no electricity.<br><br>This is a story that tries to highlight the bond between the two sisters played by Ellen Page and Evan Rachel Wood who deliver terrific and above-average performances respectively. As such, the film packs an emotional punch but fails terribly as a survival thriller. For instance, one wonders how they look as gleeful and healthy as they are, even after a year of no-power (the reason for which isn't explained clearly either). How were they able to procure clean water? Surely, they must have decided on some constraints in the quantity of food they eat. But this doesn't seem to take any toll on their bodies (not even a minor blemish); Page's cheeks look round and rosy as ever. <br><br>They must have had to hunt for food on more instances than what's shown in the film. They should have had to fend off more intruders than just the one guy who ends up raping the (supposedly) older sister. There are a plethora of possibilities that could have taken place in the lives of the two sisters. But alas, the director doesn't seem interested in expounding any of it.<br><br>Logical reasoning does take a backseat too often, in between the highly emotional moments. Like Eva almost springing into a comfortable upright position just after she has gone through a painful delivery. Like Eva deciding to go ahead with childbearing after being raped. Like the posh house that starts falling apart in like a year and half of not-so- great maintenance (so much for modern architecture!). Like using their last available bit of fuel to burn their house down during heavy downpour and deciding to take shelter in a tree stump instead (with an infant, mind you!) while they could have at least used the gasoline to warm themselves later on.<br><br>Nevertheless, the movie does score high on performances and this is probably why one wouldn't want to write off the film altogether. I just wish the movie probed more into the actualities of survival than staging emotional scenes.<br><br>Verdict: Writing department needed to do a lot better!","user":"arungeorge13","rank":[66,72]},{"title":"A somewhat implausible End of the World movie that struggles with pace","rating":6,"date":"3 February 2017","review":"Another in a seemingly endless string of movies about going into the woods sees a small family unit of dad and two older daughters surviving after a mysterious power outage hits the country.<br><br>The movie is set in the near future, as we see from somewhat more sophisticated computer interfaces in the home. Strangely, this is where the technology ends, as our trio is left woefully unprepared for when the disaster strikes. They are living at a beautiful forest home, yet have no gas for the jenny and the solar panels do not work.... uh yeah.....<br><br>The strange disruption of the radio signals is also very unexplained.<br><br>So with the cause, ramifications, extent, etc of this catastrophe left blank and with that, a lot of suspicion on just how much the director thought this through when there are plenty of real world disasters available (solar flare? magnetic pole flip? Gamma ray burst?) we are left with 'Oh... OK... just a PLOT DEVICE...' to move on with. Which means, the story and the acting and the plot better be freaking GOOD....<br><br>Instead, we see the small family unit go through classic denial stage, then depression, then motivation stages. There are only two major plot crisis events in the movie, and at times we are left with wondering the ultimate purpose... as the movie starts to seem like a survival instructional video, then slides into a 'sisters 4eva!' girl power movie.<br><br>Another very strange point... their gorgeous forest bungalow home begins to self destruct for some reason after only 6 months... and is unlivable after 1 1/2 years.... not saying much for modern construction! No explanation for this very weird self destructing house (and those reading who are lazy on cleaning gutters, please rest easy - it takes YEARS of not cleaning them before the roof starts caving in...)<br><br>I didn't score lower, because, despite the many flaws, the actors themselves are top notch and bring their A game, and the beautiful setting is magic to get absorbed in, you can almost smell the pine.","user":"targe1314","rank":[17,18]},{"title":"How to not survive when the power goes out.","rating":1,"date":"15 January 2017","review":"At first I thought it was going to be little interesting to see how they all survive, but as the movie goes on you find out the characters are the kind that would not survive any kind of apocalypse in the long term. If that's the point of this movie, then they nailed it. The movie might seem like it has a good ending, but in reality they wouldn't last a week with an infant without a decent shelter. <br><br>Deciding to burn the house down because of 'black mold' and then living in a tree stump while it's beating down rain (and winter is coming soon) is one of the stupidest things I've ever seen. They could have fixed the roof eventually, or at least weatherproofed it. Or they could have just found another house, since they were all abandoned. Instead they decide to live outside with an infant. Just plain stupidity.","user":"drossvirex-89438","rank":[95,118]}]