[{"title":"Interesting film that makes the best of its narrow scope","rating":7,"date":"14 August 2016","review":"I'm frequently antagonized by found footage films that tend to follow no logic and interrupt any significant action with electronic video interference. Leaving D.C. doesn't fall into any of those traps and presents a straightforward but interesting narrative about an average guy who moves out to the woods, where he's beset by what just may be supernatural phenomena. The film's mystery builds slowly and much of the interest involves simply observing star/director/writer Josh Criss doing his logical best to rise to the occasion of confronting a wave of spookiness. It's entirely watchable and Criss does a creditable job carrying the film as its primary on-camera presence, explaining the reasonable steps he's taking to identify and deflect the bizarre intrusions. While the conclusion could have used a little more oomph, the film is a good ride and an excellent example of what can be achieved with limited resources.","user":"tellstar","rank":[29,31]},{"title":"Amazingly good for zero budget.","rating":6,"date":"29 October 2018","review":"The actor gives a good, solid performance of someone who, you (a little too quickly) realize was not wound all that tight to begin with, then thrusts himself into an unfamiliar territory thinking it will be good for him. His possible issues come more and more to the forefront in subtle and not-so-subtle ways. Unfortunately the lack of a budget means the ending will make you think the time spent wasn't worth it ( the end of the original Paranormal Activity was a showstopping extravaganza by contrast) but then you think, maybe it was--just to see one guy pull something like this off all by himself.","user":"lisabecka","rank":[10,10]},{"title":"Brilliant, really.","rating":10,"date":"21 February 2017","review":"It was not an easy task to acquire this movie, let alone learning about it (IIRC I found it on someone's \"best found footage horror\" list here on IMDb).<br><br>This is probably the best found footage horror movie I watched made by one guy with little to no budget. It's extremely realistic and things happening during the movie are really scary and authentic. The movie consumes you fully, I needed to eat at some point and didn't even wanted to do that because I was too absorbed by it.<br><br>No typical tropes and no clichés, I watched hundreds of horror movies and never seen a story like this. No, the premise itself is nothing really original, but the details and the way they're presented makes the story unique. <br><br>The movie doesn't have a single freakin' jumpscare or all that stupid \"noisy glitches\" on the footage. Not even a \"super dark\" soundtrack. It just doesn't need that. Just pure, smart horror.","user":"SashaDarko","rank":[22,27]}]