[{"title":"Definitely interesting","rating":5,"date":"5 November 2014","review":"This is the sort of film that kind of immediately grabs you from its opening scene, for no apparent reason really. It's not visually stunning or doing anything outrageous, it just has a very clear tone and seems to know what it's doing. The ride throughout is interesting, even if it has some parts that don't entirely work. The directing is smooth and has an off-kilter vibe that many would be proud of. I think this sort of film has the capacity to establish a real fanbase, and I wouldn't be surprised if it did. Overall, the running time also needed to be a little shorter, for such a limited story, but I recommend this uneasy, weird film.","user":"Red_Identity","rank":[15,19]},{"title":"The Deviant, Slacker Version of \"Napoleon Dynamite\"","rating":7,"date":"2 March 2015","review":"Paranoia forces small-time scam artist Marty (Joshua Burge) to flee his hometown and hide out in a dangerous Detroit. With nothing but a pocket full of bogus checks, his Nightmare Power Glove, and a bad temper, the horror metal slacker lashes out.<br><br>The film starts off strong, great impression of the main character without even showing his face. We then transition to a clever, devious and hilarious bank scene. Which gets better as it goes... heck, the film could stop after the first five minutes and it would be a winner.<br><br>There is no doubt the creator of this film loves horror. There are references to horror classics like \"Nightmare on Elm Street\", \"Return of the Living Dead\", \"Wicker Man\", \"Demons\" and \"Suspiria\". Heck, there is even a full-sized poster for \"Leviathan\", which is a rare find.<br><br>In summary, the film is one great scene after another. Treadmill Bugles? Brilliant. The spaghetti incident? Brilliant. Scamming a McDonalds? Brilliant.<br><br>Some critic smarter than me says the film is \"notable for reigniting the angry young man niche, both in aesthetic and voice.\" Now, whether or not that is true is beyond me. Seems it is hard to reignite anything by itself... would it not have to create a trend? But it does have a man fighting against his own futility -- a futility he largely creates. And there is a message in there somewhere.","user":"gavin6942","rank":[10,12]},{"title":"Rage on!","rating":10,"date":"17 March 2014","review":"I loved everything about this film. An angry young mortgage worker starts to get into trouble with his scams and basically goes off on the world. Shot in MI (I think) with the bad side of Detroit on display. Lots of metal music and horror homages. Super cool through and through. Very funny characters, but not too wacky or intentional. They seem like real guys from my high school (even though they're probably in their late 20s.) Its funny sometimes, and dark and weird a lot of other times. A great blend that doesn't really fit into any genre. I was lucky enough to catch it at SXSW in my hometown, and cant wait to show my friends once it comes back to town. No romance no gushy crap!","user":"zoozersadd","rank":[15,20]}]