[{"title":"Odd but interesting","rating":6,"date":"2 January 2017","review":"Stephanie (Jane Levy) wants to be a singer and gets a chance to perform for a talent show in New York City but her dad prevents her. She also idolizes an actor Bobby Shore (Justin Chatwin). An accident happens at the chemical plant in town and people start to mutate. Bobby Shore arrives and meets her. More crazy stuff happens after that but I don't want to give the story away.<br><br>The movie has a David Lynch feel to it and also has musical numbers which entertaining as well. I have to wonder if some of La La Land was not inspired by this movie but I doubt it.<br><br>Worth watching if you get the chance.","user":"jrneptune","rank":[13,20]},{"title":"It's an absurdist comedy musical, unless it's not.","rating":7,"date":"27 February 2018","review":"Before people get swamped by the reviews looking for the \"intellectual message\" (cringe) and the one person who thinks Steve Buscemi is John Waters (weep for humanity), it's just one of those hyper-stylized absurdist comedy musicals.<br><br>It's not the best of the genre, it's not the worst. It's well cast and has some great funny moments, but as others have said it could do with a slightly better ending.<br><br>It is not Lynchian, it is not like a John Waters movie. Especially not the latter. It's just a silly light strange comedy complete with mutants and young love and unmet dreams and some unfortunate but ridiculous deaths. And singing. And purple mist. That's all. It's not quite Little Shop of Horrors level good, but it's better than a night bingewatching the Bachelor. <br><br>Then again, every absurd thing in it could have just been a delusion after the incident in the car with Fabian. In which case it's a really sad film. Just a young girls metaphorical way of dealing with tragedy.<br><br>If you're looking for moral messages you should probably be doing some internal searching for meaning instead of watching movies.","user":"kay_rock","rank":[1,1]},{"title":"WEIRD film that carries itself well but ends poorly","rating":7,"date":"27 May 2017","review":"I liked very much Bang Bang Baby, until the very end, when all the sudden the film ruined it for me.<br><br>Bang Bang Baby is the story of Stephy, a young highschool girl in 1950s America; she dreams of becoming a famous singer and maybe filmstar too. Stephy has a nerdy friend who helps her record her demos, and he wants to kiss her too, but she is out of his league. <br><br>One day, a famous actor from Hollywood has a car breakdown in Stephy's town; they meet and he woos her with his charms and fortunes. <br><br>Ecstatic, Stephy pack her bags and gets ready to leave behind smalltown America for her newlyfound Hollywood fame. <br><br>The main appeal of this film is the *extremely* unusual filmography. Everything is filmed as if to make it appear that this is a dream, an onstage theater production, a fantasy musical, anything goes as long as it's weird and surrealist. <br><br>***SPOILERS BELOW***<br><br>I loved this film until 3/4 through. Pretty standard plot, standard characters, but when i'm ready for the change of scenery, when Stephy is due to move to Hollywood and face her dreams, the movie just says NO. The famous actor character is killed off, and Stephy loses with him all hope of completing her character arc. <br><br>I must assume that this was planned from the beginning, but this move left me very disappointed. <br><br>Anyway, the film is still worth watching. The filming is just superb, and there is something for everyone here, if you are into film making. <br><br>I do recommend Bang Bang Baby, while it might have a bad ending, it's still good. <br><br>My vote: 7/10","user":"digdog-785-717538","rank":[1,1]}]