[{"title":"Annoying","rating":5,"date":"29 October 2019","review":"Poor, unimaginative and illogical script. Protagonists continuously made unrealistically silly decisions and everything always end up with the worst possible result. I know we have to suspend disbelief to enjoy works of fiction but come on...there still needs to be a semblance in reality of how folks make decisions and odds play out. Sequence of events were so far fetched that it was obvious the writer/s were simply trying to keep story going to fill an average movie run time. The mere fact that victim, a younger and fitter female can not overcome the villain, an old and frail lady, sums up the irrationality of this film.","user":"elfulge","rank":[29,34]},{"title":"Dragged down by too much nonsense","rating":6,"date":"4 March 2019","review":"Fairly straightfoward and predictable, but nonetheless Huppert brings a chilling performance as the unhinged title character that may make you wary of helping strangers out from now on.<br><br>The big reveal is spoiled in the trailers, and it come pretty early on. It would've been better had it been delayed a little, after the 2 characters had spent more time together and a few scenes of Greta acting crazy at times to have Frances grow some suspicion.<br><br>But the main problem is how illogical/stupid the other characters are, beginning with Frances either unable or unwilling to block Greta's number despite the obvious problems, and upping the ante with the ending.<br><br>All the ridiculousness is summed up one face-palm worthy quote:\n\"What do we tell the police?\"\nGee, what actually happened might be a good idea.","user":"piggulu","rank":[98,128]},{"title":"Decent","rating":7,"date":"10 September 2018","review":"The acting was great and there was definitely some real suspense created but also a lot of cliche and unbelievable things occurred (mostly things secondary to the plot actually). \nI felt that the movie could have been shorter/ended earlier. \nOverall though the movie was very well acted and enjoyable. Left with a slightly different (and more cautious) view of the world.","user":"sassa_11","rank":[151,217]}]