[{"title":"A film that raises public awareness","rating":10,"date":"18 July 2015","review":"In our world of capitalism in which greedy corporations seek to meet their year-on-year profit margins, collateral damage is regarded as acceptable risks. We, as the public, often pay no thought to the potential consequences and risks of placing our trust in such corporations. Indeed, the public often have no choice in some of the things that are used on a daily basis. This film deals with one of those things that is called flying.<br><br>It is concerning how little regard there is for collateral damages (in this case, the health and safety of the paying customer). Especially in light of the fact that the problem is known. And yet, what can the public do to force a change in regulations when the regulations are not set up with the customer in mind. It is disturbing that there has been no move to take any form of action (https://en.wikipedia.org/wiki/A_Dark_Reflection#References).<br><br>The film's style and atmosphere is similar to many British-made political conspiracy thriller. It conveys a message without the need for theatrics or a melodramatic soundtrack. In this regards it is well done. My only criticism was the unnecessary introduction which served no purpose but to give a background introduction to the protagonist.<br><br>There need to be more films like this that promote public awareness, and help the struggle against multi-conglomerates that rely on us to meet their profit margins and yet, place so little importance on the customer's well-being. It is exactly because they can afford (and are allowed) to do so that this issue still remains.","user":"tdevil9","rank":[9,12]},{"title":"Aerotoxins lead to chronic illness...","rating":4,"date":"27 May 2015","review":"Surely, if you have been flying a lot over the past decade, then you have most likely smelled some gas fumes here and there, when you boarded the plane and/or while flying. This film does an excellent depiction of how large aircraft companies try to escape liability and do whatever they can to deter potential claimants that could initially destroy their business. The ugly truth is that consumers are exposed to aero toxins while breathing in cabin air. The solution at the end of the film is convincing, an air filter, (which should have been made available in the first place) is now protecting the future consumers from being exposed to aero toxins. Undeniably, this film has raised my awareness of the types of health risks that comes with flying frequently. I think it was time to shed light on such concerns as our health should come first.","user":"Burny18","rank":[29,62]},{"title":"Must Watch","rating":7,"date":"18 June 2015","review":"Everyone should watch this movie. This is not a great movie or you will enjoy it very much. But this film conveys a very important message o the viewer. After watching this movie you could imagine what might have been happened to the missing Malaysian Airlines Flight MH370.<br><br>The film was made by volunteers with funding from unions, passenger groups and concerned aviation figures. It is based on actual events surrounding the issue of Aerotoxic Syndrome.<br><br>Big airplane companies never tell how harmful it is inside of a plane. Because of the engine fumes the air inside of the airplane get contaminated with toxic gas.<br><br>This movie is build to raise awareness among general people but lack of publicity and big rival they could not do much.So I think everyone should watch this film and recommend it to his/her loved ones.","user":"niaz_islam","rank":[8,14]}]