[{"title":"Hazmat Suits and Bad Decisions","rating":4,"date":"24 February 2018","review":"This movie takes quite a while to get going and when it finally wraps up, you're left with more questions than answers. It's about a team of people who go into an old asylum building to assess it for hazardous materials. Or something. A sort of librarian goes with them to grab any records that might be worth keeping. They end up being the worst hide and seek players ever in a cat and mouse game between them and an unknown adversary. The kinds of decisions most of these characters make throughout the course of the movie will leave you with little sympathy for them. I found myself hoping they would die - especially the team leader. I did find it scary, creepy, and suspenseful, and I thought it was well shot and performed. I would have liked more of an explanation for what was happening and why, but if the intention was for us to be just as in the dark as the people in the movie, I sort of get it. But I didn't like it. I've seen other reviewers saying that this ripped off Session 9, and I can see why they said that, but I wasn't thinking of Session 9 while watching this. Session 9 was definitely better, though. See that instead.","user":"WisdomsHammer","rank":[5,5]},{"title":"Don't read too much into the negative reviews and just watch it.","rating":7,"date":"5 February 2020","review":"It's a decent watch. People seem to be giving it bad reviews because it's not as good as the first or its like another film... Who cares. Just watch it for what it is","user":"jasonleighward","rank":[4,4]},{"title":"Bad. Bad. Bad.","rating":4,"date":"12 December 2015","review":"Nothing to do with Villmark 1 !! They barely managed to make a small and quite insignificant connection to it, but that's all, just so they can take advantage of the name and get some attention.<br><br>If you read the plot, you'll realize you know the movie, you've seen it before, many times and this right here brings nothing new. It's a horror movie in an old building, apparently abandoned but not quite, where people start to get missing or even...dead!<br><br>And this is all. From head to toes, nothing more than what so many other similar productions brought on screen so many times before. Can't believe I was excited to see this. Anyway, the movie itself, as a stand alone is still a weak production in my opinion. I will not recommend it.<br><br>Cheers!","user":"gothic-fiction","rank":[17,25]}]