[{"title":"Strong execution of strong story around end of US Civil War, however not about slavery and related violence. Not Django Unchained II, but something completely different","rating":10,"date":"14 October 2013","review":"I saw this film at the Ghent (Belgium) film festival 2013, where it was part of the section American Independent. You may wrongly assume this is Django Unchained II, given the key words in the synopsis, but it is something completely different. Its main topic is not about slavery nor its embedded violence. Of course, the environment is unmistakeably derived from the end of the US Civil War, and bounty hunters looking for escaped slaves are present in a prominent role too. Nevertheless, the civil war is not the main issue in this film, but rather the unsettling circumstances and the chaos resulting from it, in which process everyone has to make difficult decisions.<br><br>The whole film kept my attention throughout the full 94 minutes running time. It perfectly showed dilemma's that are prevalent in times of war, like who to follow and who to trust. Not the ending you'd expect, however, which is a surprise until the last 5 minutes.<br><br>All in all, I cannot say I enjoyed this movie, as \"enjoy\" would be not the appropriate word for the subject at hand. But casting and acting are spotless, and developments are evenly paced over the time, among which a few you did not expect. I certainly felt drawn into the story along with the main characters, neither of them completely good or bad, just trying to cope with the sorry circumstances. This film ranked 11th for the audience award, score 4.28 out of 5.<br><br>There was a Q&amp;A after the screening with director, editor and writer Chris Eska, Below paragraphs are not a review, but only reflect some notes I scribbled down during this Q&amp;A.<br><br>Given the uncommon combination of functions, the very first question was how it is to be a director and an editor in one person. His reply sounded logical, since editing is actually where the final film is made. He admitted that it is not easy to cut away good footage. It still is a very difficult process, but marketing pressure dictates rules for the optimal feature film length.<br><br>About the writing process: It was not exactly clear from the outset that the US Civil War would become the main subject. Still on the lookout for power structures as a central theme, like in his previous films, and given the 150 years anniversary of the civil war, the chosen subject seems a natural choice only in hindsight. The additional element of black people being used to catch other blacks, just emphasizes the power structure theme, power hierarchies never being simplistic and straightforward.<br><br>About casting, especially the amazing young boy, 14 years old at the time, and his first time on screen. Looking for a suitable boy, he went to many schools 200 miles around to finally have him. Subsequently he found out what type of character the boy wanted to be. Everything he needed to play such roles, was taught him on the set. It is a delicate process since you cannot easily unlearn things.<br><br>About the obvious realism in this film, the reply was that he attempted to make a more mainstream film. Maybe the art-house variety, but still making a move in the mainstream direction, where it is most important to grab the audience. At all cost, he avoids to be constrained by a genre, like coming of age.<br><br>About filming locations: All parts of this film are shot in places that are somewhat symbolic, in the direct neighborhood of the last hold of the confederacy. It proved difficult to find natural spaces, without obvious symbols of modern times, like noises of airplanes or automobiles, or electricity poles and street lights.","user":"JvH48","rank":[30,38]},{"title":"Slow-Paced But Powerful & Compelling Tale","rating":7,"date":"19 April 2015","review":"This slow-paced but compelling and powerful tale is probably geared towards a certain audience, those having the patience to allow characters to develop and a story to unfold in its' own timing. The movie kept me absorbed and guessing till the end what the outcome would be. There's a strong sense of realism, fine cinematography, and first rate acting here.<br><br>As mentioned, the acting leads in the film are all top-notch. Set in 1864, in the woods of Virginia (although I read the movie was actually shot in Texas) as the Civil War raged, a young boy Will (Ashton Sanders) and his uncle Marcus (Keston John) have been forced, under penalty of death, to work for the vicious slave hunter Burrell (Bill Oberst Jr.).<br><br>Will and Marcus have been given the assignment of traveling North to find a man called Nate (Tishuan Scott), who is digging graves for the Union Army. They are told to use the ruse that Nate's brother is dying (although he's already passed) and that he's requested to see Nate one last time.<br><br>When they find Nate they convince him to travel back South, and a good part of the film will revolve around the perils and travails the men and the boy will face through the Virginia woods and swamps, as Civil War battles occur all around them.<br><br>To me, the heart of the movie is the bonding that occurs between Nate and Will, and the continual tension whether Will will let Nate know he's walking into a trap. It will all culminate in a haunting and shocking finale that stayed with me for quite a while.<br><br>I thought this was a fine effort from Chris Eska, who wrote and directed the movie. I would be interested in seeing any future efforts he comes up with.","user":"larrys3","rank":[6,6]},{"title":"THE RETRIEVAL is One of The Best Movies I've Seen.. EVER!","rating":9,"date":"10 April 2013","review":"This has to be the most beautiful movie I've seen in a long time. It's pitch perfect in almost every way.<br><br>I saw this film at the 13th Phoenix Film Festival, where it received much deserved awards for directing and the ensemble acting, as well as being voted the audience favorite.<br><br>D'JANGO UNCHAINED was about slavery, its brutality, the violence, the humiliation, and the nightmare. THE RETRIEVAL addresses slavery and allows it to be a thread to its story by neither shying away from it nor allowing it to overwhelm the narrative. It's about the bond between two characters and the sacrifices they make.<br><br>Every character is rich and real. There's humor, tragedy, a riveting story and beautiful cinematography. <br><br>This film deserves to be seen, and everyone connected to it deserves an opportunity to continue their work.","user":"greenlantern2","rank":[36,50]}]