[{"title":"This movie's got everything - yet delivers nothing","rating":3,"date":"18 October 2013","review":"Wow, was I impressed after the first five minutes...<br><br>Wow, was I overwhelmed after the first ten minutes...<br><br>Wow, was I speechless after the first 15 minutes...<br><br>and wow, was I bored after the first twenty minutes...<br><br>It never stops. It never comes to rest. It just keeps going and going and going. Between the tides, night and day, spring and autumn, summer and winter, life and death, breathe in, breathe out, jump up, jump down, vrooooom, it just never stops.<br><br>This is INSANELY good footage of, well, kinda everything. This is not a freeride movie, it's not a spiritual movie either, it's not an ongoing introduction clip of great athletes, it's not a permanent product placement film either. It's an ongoing flick about showing off how much budget was burnt. It is meant to feel inspiring - yet it quickly becomes tiring. Have I already already mentioned that it just doesn't stop? It keeps bombarding the viewer with probably the best footage ever assembled for a film with this, uhm, theme.<br><br>Everything is so perfect, ...for a moment. But its relentlessness to stay top notch in every second ruins the whole adventure. You can't get attached to anything because the film won't let you. It just speeds on in light speed and doesn't give you any insight on anything except pure awesomeness. In the end, after seeing and hearing all this expensive material you end up feeling kinda empty.<br><br>Also the \"chapters\" are very forced. In fact there are no chapters as there is no developing story. Instead we have very cryptic titles for the forthcoming music video (called \"chapter\"). It actually makes me sad. There was obviously so much potential, so much money, so many talented people - but in the end the film appears like a life long trailer of itself.","user":"surfs_up1976","rank":[52,70]},{"title":"Innovative and extremely clever movie","rating":9,"date":"10 October 2013","review":"This is (with a few exceptions) a visual masterpiece, and the storytelling is extremely beautiful and clever. Just don't expect a ski movie.<br><br>First, why is it so good? The cinematography and editing is some of the best i have ever seen. There is a lot of eye-candy, and if you don't pay attention the film might strike you as a long music video, and you miss the actual story. Every frame is very thoroughly chosen to represent thoughts, memories and feelings in the mind of the main character. The best word to describe Into The Mind is innovative, and there is no movie quite similar to it except maybe All I Can.<br><br>The film has received quite a few negative comments from frustrated and disappointed hardcore fans of ski movies. I completely understand why some are disappointed, the film is simply not primarily a ski movie. Into The Mind is, as I see it, first of all an exploration of some of the most fundamental aspects of being a human being, and it only uses extreme skiing as a symbol in its metaphorical (and strictly visual) way of telling the story. Sounds pretentious? Absolutely, if you want skiing and think that all other scenes are just there to look good (and believe me, this is planet earth-quality photography). A very CGI-intense scene with snowboarder Benji Farrow, and a segment of Callum Pettit growing a fake beard have received most criticism, both of which are very symbolic and, of course, look exactly the way the filmmakers wanted them to look. I don't believe the connection some people make between not liking the movie, and not getting the movie. Into the mind simply isn't everyones cup of tea.<br><br>My guess is that this movie will continue to stir up feelings, and it will probably be widely appreciated beyond the skiing-society. Hopefully, for the prodigious Sherpas Cinema, this is a step towards even more thought-provoking films, which does not necessarily involve skiing.<br><br>9/10","user":"criticismquotes","rank":[37,51]},{"title":"Into the Mindless","rating":5,"date":"27 October 2013","review":"If you are going to watch this movie make sure you do so in front of a large high def TV with the surround system on because its only redeeming features are the special visual and sound effects. This is really cool for the first five minutes but after 15 minutes it gets a little tiring and after an hour it is downright boring. Enough of the owls, waves, and old sherpa dude, this is supposed to be a ski movie! Where are the cool skiers and story line? This is purely a frivolous exercise in showing off CGI and I hope it doesn't set of a new trend of one-upmanship in the ski film world. It would be massively disappointing if the entire genre went in this direction of trying to provide some sort of deep extensional meaning to every scene. one other thing: the \"chapters\" to each scene are totally meaningless and nothing but a futile attempt to provide some context to a story that doesn't exist. In my opinion, if you want to watch a great ski movie pick up something from Matchstick Productions or, better yet, see Steep, which is a mesmerizing documentary on the history of big mountain skiing. That movie truly succeeds at getting Into the Mind of these daring athletes.","user":"Ben-cherniavsky","rank":[18,25]}]