[{"title":"An education on things I never knew happened","rating":10,"date":"5 February 2013","review":"OK, so we all know ThePirateBay and the majority of netizens have visited it on at least one occasion to share files. What do we really know about the Pirate Bay ? Not a lot it seems. I was luckily invited to see an advanced screening of this documentary. I expected it to be an interesting story. I got what I expected and more. The twists and turns of the reality of how The Pirate Bay was formed, how the authorities went after them and how much The Pirate Bay has affected the lives of so many people, is such an intriguing tale. I definitely recommend this film to all netizens as a 100% must watch film about our generation and at it's core, our online culture and the attempts of the powerful to control the internet. Even if you are just a casual internet user who is mildly curious about internet culture, this is a must watch documentary. 10/10 because... gripping story that has never been told and doesn't end up as you expected... is truly... \"gripping story\"","user":"jimmydoyle1977","rank":[167,186]},{"title":"Great documentary","rating":10,"date":"8 February 2013","review":"Excellent story about real people taking the blame for dinosaurs failure to evolve. It is amazing too see how different generations fail to communicate. Please give the power and money back to the artists, make them understand they have to work to have an income, that culture is a commodity that is cheap because of the extreme supply and abolish the right to own other peoples copyrights. <br><br>Simon Klose makes an objective documentation of our time and puts the people ahead of the story. This is not a film in the end about piracy, it is a film about however unlikely an insurgent, an ideologist and a techie ended up together against the rest of the organised world. About individual loss but the win of a just cause.","user":"Stoffe","rank":[98,111]},{"title":"Great Film, Long Live the PirateBay","rating":10,"date":"10 February 2013","review":"The film is excellent at portraying how corrupt large corporations are especially the Media, they will stop at nothing to squeeze every penny they can out of your pockets and Piratebay are liberators, they allow us to download the movie then decide if we want to pay for it or not it's a truly fair system, I bought Avatar, Batman, Saw series, Harry Potter etc. Disappointing films like the Skyline will not see a penny from my pocket. <br><br>A Big thank out to the creators of the Piratebay, you have truly changed the world!<br><br>Max","user":"maxb198","rank":[51,57]}]