[{"title":"Agent 47","rating":5,"date":"1 March 2020","review":"There seems to have been a great opportunity here to do something very Bourne-esque with the premise, but alas, it's just another average Hollywood action movie where everything is very silly, totally unbelievable and lacking depth. Still, if you just want to watch something with some action, then this is as good of a time-killer as anything else, maybe even more so if you're a fan of the video games that it's based on, although I suppose that would depend on just how faithful they've been to the source material. There's been better and there's been worse.","user":"MR_Heraclius","rank":[40,43]},{"title":"It has nothing to do with Agent 47","rating":4,"date":"26 October 2015","review":"If you have played one of the video games for at least 45 minutes you know that Agent 47 is all about discretion. DISCRETION!<br><br>It's all about how he blends in, how he hides in the shadows. If you have to physically engage guards or any other people except your target you feel like you did something wrong.<br><br>This movie was just an action movie that tries to get some of the video-game franchise fans to pay for the ticket. Bu that's about it. So instead of discretion, finesse, elegance... you have speed, force, super-intelligence... Not bad but NOT AGENT 47.<br><br>Looking forward for a real Hit-man movie.","user":"ozcosmin","rank":[146,197]},{"title":"Unfortunately, only an action movie","rating":7,"date":"28 October 2015","review":"Despite good casting, very good performances, more than a correct direction, camera work, sfx, editing and music, this movie is not excellent. It has no soul, as previous version (with Timothy Olyphant, 2007) did. Comparison is inevitable. This is only an action movie: a good bunch of action scenes and essentially a mindless fun. However, no character development or an explanation who, why, where, when and so on. Previous version had it all and if someone planned sequels (or a franchise), they should have done it eight years ago. Then it would make sense. Don't get me wrong here. This movie is not a bad one and the cast gave it all to make it entertaining. But for me that is just not enough, considering the template (video game) and possibilities to develop a good idea into a more complex and challenging story. This movie returns all to the level of the video game (maybe even below that). I think that these characters deserve more. So do we. Recommended for \"set-brains-to-off\" fun on a weekend afternoon.","user":"Maleplatypus","rank":[66,96]}]