[{"title":"The National Lampoon name means little.","rating":4,"date":"4 April 2014","review":"This movie just goes to show you that the National Lampoon name doesn't really mean anything anymore. This feels like a low-budget TV Movie, with a simple linear story, basic acting, and a stereotypical cast. However, it isn't \"awful\"... it is saved by some interesting outcomes I wasn't expecting at all, and a cast that doesn't try to hard with their limited dialogue.<br><br>I don't know why they called this \"Surf Party\" as their is hardly any surfing, and hardly any partying. It's about a stolen surf board, and the short quest to venture from Ventura (see what I did there) into the Valley to recover it.<br><br>Since this is National Lampoon branded film, you might be expecting a lot of nudity. But this film doesn't deliver much even on that front... so you will be disappointed if that is all you seek.<br><br>Not much to recommend, really. If you're from Ventura or surrounding areas you'll see familiar sites (I enjoyed that aspect at least). However, the \"Wonder Years\" style of opening and closing seems to be a particularly cheesy flavor for this genre of film.","user":"david-2829","rank":[10,12]},{"title":"Surfs UP and not 'alf as bad as the other two reviewers are making out....","rating":6,"date":"28 October 2009","review":"All in all this was way funnier and fresher than I'd expected.<br><br>Three buddies go in search of a handmade beautiful surfboard that gets stolen.<br><br>Nicely put together and all in all an easy view.<br><br>It's never gonna win an Oscar but it is well made and if you like stoner surfer movies then this ain't bad at all - nothing' too offensive but as a buddy movie I've seen a lot worse.<br><br>We enjoyed the summer of our youth vibe, it really is pretty good if you just want to chill and watch a movie. Some nice surfing sequences and the obligatory stoners and chicks - no brainer stuff...","user":"intelearts","rank":[13,19]},{"title":"Not funny enough...","rating":5,"date":"8 January 2014","review":"I saw this movie at the video store, and i am a bit of a sucker for those type of \"teen overnight\" movies. I decided to rent it and to be honest, i felt it was pretty disappointing. First, thankfully i didn't saw \"Endless Bummer\" cause i just saw its that movie repack with a new title. Awkward...<br><br>So i start to watch it and it start as a typical presentation of all the movies protagonist, then incident happen(surf get stolen) and we can start the overnight. Problem is, its just not done right.<br><br>This concept has been done many times, movies that did it right where the ones like Superbad, 21 and Over and so on. This movie just follow the group during that night but nothing really funny happen.<br><br>They more or less find the guy, dad acknowledge what his son did was wrong, let them punch him a couple time and thats it. You would expect the thief to have friends, our protagonist trying to get back the surf board but always coming short of it, getting screwed and then eventually planning some kind of big revenge, i dunno. But the thing is, they find him, dad let them in, they pick the surf board, and thats it. How they wait and want revenge on the guy is extremely silly as well...<br><br>Couple stuff happen to the secondary characters, but nothing major and i dunno what else to say, its just not as funny as this kind of movie should be. At the end you got a speech telling us about what happened to the characters like this was somewhat a real story, i dunno, but its not.<br><br>I wouldn't say its totally terrible, just that it really lacks funny moments and for a 2009 movie repacked in late 2013... you wonder what was the motivation. Lets just say i am generous with a 5.","user":"destroyerwod","rank":[6,8]}]