[{"title":"A Perfectly Balanced Tribute","rating":12,"date":"12 November 2013","review":"I was privileged to attend the premier at the National Film Theatre. The audience was asked not to give away any spoilers, so I'll respect that wish (not that I wouldn't have done so anyway, of course). <br><br>The programme was far more emotional that I had expected and the audience's reaction - laughs, tears and much rapt silence - showed I wasn't alone. Admittedly, the place was packed with Doctor Who fans, so it was hardly going to send any of them to sleep, but they could also have been counted on to be highly critical of any factual errors.<br><br>The time frame covers 1963 to 1966 and is as much a biography of William Hartnell, the first Doctor, as the early years of the show he fronted. The Doctor is played by David Bradley (no complaints from me about his crotchety but committed portrayal) and is pretty much throughout seen as ailing in physical health or mental agility, which seems like a true depiction but is rather unfortunate for his legacy as someone often described, in his earlier years, as a fine character actor. Hartnell's granddaughter, who was in attendance at the post-screening Q&amp;A) referred to the fact that prided himself on remembering his lines, so his problems with this as depicted here should be taken into context, although it would have been a tall order for the programme to have tried to focus on any more of the man's life without overrunning its 90 minute time.<br><br>Many of the key production staff have key roles, although (as writer Mark Gatiss acknowledged during the Q&amp;A) not all of them were included as to do so would have been made the programme too difficult to follow. Thus there is no David Whitaker, for example, but there is much screen time for the Sydney Newman, the Canadian Head of Drama at the BBC, amusingly played by Brian Cox. His pivotal role in appointing and supporting Verity Lambert, the Doctor Who producer, was one of the unexpected revelations here.<br><br>Without giving away any really key moments (and there are plenty of lovely surprises) the show is both reverential of the programme as well as poking fun at the ridiculousness of making a prime time science fiction programme on a BBC budget with no computer technology and live editing. Plenty more such contrasts abound: the daleks are both funny and awesome at the same time; Hartnell's crotchety but committed personality is shown to be a benefit and a hindrance. <br><br>If you are even slightly interested in Doctor Who I'm sure you'll love it as much as the audience who gave it a standing ovation. Young children would probably be unlikely to find much of interest in it but older ones with more than a 30 second attention span may well enjoy it. Considering that much of the story of the programme is known to many of us and that there are no deaths or love affairs involved (that's not a spoiler - surely you weren't expecting that?) it is to its credit that it managed to be so entertaining for a film-length duration.","user":"awfulalex","rank":[57,59]},{"title":"Birth of a Legend","rating":10,"date":"22 November 2013","review":"An Adventure in Space and Time chronicles the birth of Doctor Who, and broadly covers the period 1963-66, the tenure of the first Doctor William Hartnell. Without giving too much away (I hope), this drama really centres on the original creation of the show - the strength of character of Sidney Newman and his idea for a Saturday tea-time sci-fi programme, the uncertainties of (female - unheard of in the early 60's) first-time producer Verity Lambert and Indian director Waris Hussein, and the crotchety Hartnell, dragged from his typecast grumpy on-screen persona to play the grouchy but mischievous and mysterious alien Doctor. It latterly moves forward apace, and concludes with a weary Hartnell basically having been removed from the show and reluctantly handing over to his successor at the end of The Tenth Planet in 1966.<br><br>The first thing to say is that nobody does these self-referential television movies better than the BBC. Mark Gatiss' excellent script teases the initial wonder and subsequent popularity of the show out beautifully, but doesn't shy away from the many budgetary and performance shortcomings that are clearly there on-screen if you re-watch the original material. The casting is universally superb, as are the performances (David Bradley as Hartnell especially) and this is a handsomely mounted production full of nostalgia and pathos, with a clear undying love for the source material. The scene near the conclusion demonstrates this the best, with a tired Hartnell staring into the distance on \"his\" TARDIS set, wondering what will become of \"his\" show and \"his\" Doctor after he leaves - to be confronted by a grinning but clearly reverential Matt Smith as the latest incarnation - is bursting with the magic and charm that made the early show the phenomena it was, and demonstrates why it's still on today. No true fan could watch this without welling up I suspect.<br><br>It's the last drama to have been made at BBC Television Centre in Shepherd's Bush prior to its closure, and it never looked finer. Well done BBC. I couldn't think of a better tribute to one of your greatest creations. One final note - many of the early Who's were wiped and no longer exist in the archives. Why not reassemble the cast of this drama and do shot-for-shot B/W remakes to plug the gaps? I'd certainly watch - and I bet there are legions of fans who'd say the same after watching this.","user":"tony-howe","rank":[20,20]},{"title":"In three words: It is inspiring","rating":8,"date":"23 November 2013","review":"When the success of a show is defined by its main protagonist for 50 years, then there is no better tribute then this drama movie. Based on true events, this movie/documentary focuses on the first actor and producer that defined and shaped the first doctor of the British television show Doctor Who. It shows how the production got started back in the 60's and how the actor William Hartnell (beautifully portrait by David Bradley) opened the minds of children and adults to fantasy and sci-fi.<br><br>It is however not entirely a happy story, for all good things must come to an end. Without spoiling it for everyone I would like to say that the end is very heart-breaking but filled with hope for the future.<br><br>In short, the movie was beautifully told with a fine pace. The acting was good conveying emotions at the right time. Furthermore, I'm very happy that this movie used almost no CGI and a lot of props which I think is becoming a lost art.<br><br>I give this movie an 8. <br><br>People I really recommend this movie if you want to see a good drama.","user":"hennyxu","rank":[16,16]}]