[{"title":"Poseidon Rex: 100% what you'd expect","rating":3,"date":"31 August 2018","review":"Going into a movie called Poseidon Rex you'll have naturally low expectations, and right here I assure you they're met!<br><br>It tells the story of a series of explosions that have awakened a dormant dinosaur, a \"Poseidon Rex\". Essentially it's a t-rex that can swim, and may I just begin by saying it looks ruddy awful.<br><br>Starring terrible movie veteran Brian Krause we see our big ugly cgi beasty going on a rampage and a rag tag of people forced to stop it right up until an incredibly bad cliched finale.<br><br>This is the kind of film that is constantly repeated on the Scyfy channel and why nobody takes that channel even remotely seriously anymore.<br><br>The acting is terrible, the sfx are cringe inducing and the plot is about as original a the average slasher movie.<br><br>True dire stuff.<br><br>The Good:<br><br>Meh<br><br>The Bad:<br><br>Awful cgi<br><br>Some laughable acting<br><br>Characters are stupidly unrealistic in their behaviour<br><br>Creatures size isn't consistent<br><br>Things I Learnt From This Movie:<br><br>Seeing a dinosaur footprint in 2013 won't shock a person in the slightest<br><br>If you find an egg of an unknown large creature, maybe leave it there?!<br><br>Scientists are notorious for having beer in their labs fridge and drinking during experiments<br><br>The creators clearly could only get the license for one single song!","user":"Platypuschow","rank":[8,9]},{"title":"Really should have been left down at the bottom of the sea","rating":2,"date":"16 November 2013","review":"Poseidon Rex is one of those movies where you can tell that you shouldn't be expecting much from it. Even when that was taken into account, from a personal perspective it was still a load of rubbish that only has some nice scenery and underwater shots going for it. The creature, who is basically a half-dinosaur and half sea-monster, is another entry in the long line of terrible-looking SyFy creatures. There is a complete lack of fluidity in movement, texture or anything convincing in the design, and the it isn't menacing either with its \"towering\" presence most likely made possible by stilts. The scenes in which it appears in suffer from being hurriedly edited(in fact the whole movie looks rushed and murky-looking) and from having too much unintentional humour rather than genuine tension. The dialogue is at best trite and stilted, with the \"snappy\" banter marred by excessive cheesiness and wooden line delivery(the worst of them are absolute howlers). The story is very unexciting- with a fair amount of filler than could have been trimmed down or cut- and predictable stuff, anybody can smell the ending a mile off and any action comes across as heavy-handed and with overuse of fire-power. The characters are poorly developed and cardboard, they are just there and you don't know why, and some of them do some stupid things that make them even less easy to root for. The acting is very poor, with Brian Krause's lead performance lacking any kind of charisma(reading of a very last-minute replacement, Corin Nemec would have been a much better choice if it weren't for his terrible accident) while on the other side of the spectrum the obligatory stereotypical villain is played in a \"hamming-it-up\" style that's pretty embarrassing at times to watch. In conclusion, not the worst there is but it did come across personally as a rubbish movie- regardless of how low my expectations were- that should should be left uncovered. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[21,30]},{"title":"One of the better SyFy movies, but that's not saying much","rating":4,"date":"1 January 2014","review":"I have a bad addiction to SyFy original films, and I unfortunately see almost all of them. This one actually had a decent plot and could have been done VERY well if it had a Hollywood (really anything but TV) budget. Out of all of the SyFy movies I have seen, it followed the same basic plot, a giant monster of some kind comes out of the ocean and attacks crappy actors, who were written by crappy writers and directed by a crappy director. But this one wanted SO BADLY to be GOOD! The T-Rex was actually ALMOST really cool looking. It ALMOST didn't look like a teenager in a computer class made him. All in all, it was a decent film, almost like a tribute to Godzilla, not a rip off mind you, because this actually was worth a watch. Three stars out of ten is fair for this, and it should be kept in mind before watching this. Any fan, or not fan, of SyFy, should check this one out!","user":"KEmerton1992","rank":[15,21]}]