[{"title":"A Disappointing Sequel","rating":5,"date":"4 July 2016","review":"Crouching Tiger, Hidden Dragon remains one of the greatest martial arts films ever made. The breath-taking cinematography and graceful fighting sequences led it to become the highest grossing film in a foreign language in North America, helped open up the west to Asian cinema and is quite simply a masterpiece. But sadly The Sword of Destiny seems to capture very little of the beauty that made Crouching Tiger so incredible and instead feels more like an attempt to cash in on the legacy of Ang Lee's original film. <br><br>Taking place 18 years after the original film, Shu Lien (Michelle Yeoh) returns to defend the sword Green Destiny once again, this time from the evil Lord Hades (Jason Scott Lee). She is assisted by Silent Wolf (Donnie Yen), her ex fiancé who she believed was dead. Meanwhile a young woman known as Snow Vase (Natasha Liu Bordizzo) who is training under Shu Lien begins to fall for Wei Fang (Harry Shun Jr), a young thief who attempted to steal the sword for Hades. The film rehashes several story beats from the original film but recreates them with far weaker characterisation and lacks the same depth of its predecessor. <br><br>The only returning cast member from the first film is Michelle Yeoh, who does deliver a good performance by bringing the same wisdom and nobility that she bought to the first film. However every other character suffers from a screenplay that is incapable of doing anything other than filling up time until the next action sequence. The main romance in the film between the two young lovers is never able to create any real chemistry. Even Donnie Yen, one of the greatest Chinese action stars, is unable to do anything with his little screen time and the incredibly bland script other than fight and look stoic. <br><br>The cinematography mixed with the vast landscapes looks nice at times, but at others the film suffered heavily from an overuse of CGI that feels like a very misguided departure from the natural beauty of the original film. Also instead of being filmed in Mandarin like the original film, the actors instead all speak English. Obviously this is done to appeal to a wider demographic, but it ends up distancing itself even further from the tone of the original film. <br><br>Out of everyone who could direct a sequel to Crouching Tiger, Woo- Ping Yuen could at first seem like a good choice. He's directed some of the greatest action films from China (including Drunken Master and Iron Monkey) and was even the action choreographer for the original Crouching Tiger, Hidden Dragon. And he is able to pull of some great fight sequences throughout the film, including one creative sequence battling along a frozen lake. But as impressive as the fight choreography is, it never recaptures the tone of the original Crouching Tiger, Hidden Dragon. Whereas the fights in Crouching Tiger played out like a delicate dance through which two warriors communicated, Sword of Destiny is an impressive display of fighting skill and stunt work, but nothing much else. <br><br>Also whilst Woo-Ping Yuen is quite possibly one of the greatest action directors of all time, his style just wasn't suited here. Crouching Tiger, Hidden Dragon wasn't really an action movie. It was a romantic drama cleverly disguised as a martial arts flick. But Sword of Destiny is instead just an action movie with a weak romantic sub-plot tacked on.","user":"rcolgan","rank":[32,35]},{"title":"A weak sequel with lots of forced plot elements...","rating":13,"date":"13 March 2016","review":"Sword of Destiny (2016) tries to pick up several years after the events of Ang Lee's Crouching Tiger, Hidden Dragon (2000).<br><br>Yu Shu Lien (Michelle Yeoh) holds again in her hands Li Mu Bai's legendary sword, known as the Green Destiny, and here is where the forced elements starting to emerge... A ferocious villain and his clan is after the sword. A conflicted young couple is needed to enrich the plot and to give a feel of Zhang Ziyi who is missing from the cast. A character who I wont spoil you who he is, played by Donnie Yen, and who has an unbelievable connection with the first movie. And of course the usual revenge sub-plots etc etc.<br><br>Unfortunately, the feel of the movie has nothing to do with Ang Lee's multi-awarded film. It feels like a generic wuxia movie. Too much cable-flying, most of it unnecessary if you ask me, uninspiring fights, over-processed and unnatural imagery... and the music, despite the reprize of Tan Dun's original theme from 2000, is not a perfect fit.<br><br>Overall: Yuen Woo-Ping, the grandmaster of kung-fu choreography makes a sub-par movie with CTHD2. You might want to check it out, out of curiosity if you liked the original more than 15 years ago. But honestly, despite the return of Michelle Yeoh don't expect much...","user":"Dr_Sagan","rank":[27,36]},{"title":"Very weak, brainless and heartless sequel.","rating":5,"date":"27 February 2016","review":"I definitely expected this to be weaker, more superficial and more action-obsessed than the original just judging by its trailer, but it was actually worse in many more ways than I had thought of.<br><br>First ugly thing that hits you is the ruined color gamut, with all colors squeezed into two narrow bands around red and green (like the \"teal and orange\" madness that has gripped Hollywood this past decade, but shifted to the side toward red and green). Why must you do this to our eyes, movie studios, why? What have we done to deserve this? What's next, having to buy premium versions of the movie just to get the rest of the color spectrum?<br><br>Next comes the complete lack of originality of whatever crumbs of a story there are in there, the entirely boring and soulless dialogue, the cardboard-thin characters that couldn't make you care about them if their lives depended on it, and ending with the mediocre fight scenes. The whole thing was centered around the fighting and they couldn't even get that part at the level of grace and artistry and impact of the fights in the original film.<br><br>And to top it all off, they reversed the languages and wrote the original dialogue in English and added Chinese as a dub. This isn't catastrophic - at least the dub is there so you can make the experience reasonably similar to the original -, but it's still somewhat annoying and a bad production choice.<br><br>This was a very poor use of Yeoh's potential. All in all, my favourite character ended up being the girl fighter from the villain's crew, who just did her job and did it well, without wasting our time with too much meaningless dialogue or with any other hopeless attempts at gaining a depth the screenwriters never gave her in the first place.","user":"fjmsoftware","rank":[74,115]}]