[{"title":"The best film on 'the Troubles' so far","rating":9,"date":"1 November 2014","review":"In 1971 I was living on the fringes of Derry's Bogside. On several occasions my home was 'collateral damage' in a number of bombings and I remember lying on the floor of my bedroom in case I might fall victim to a stray bullet from one of the gun-battles raging outside. I drank in pubs that would be bombed in time and I was on the march on Bloody Sunday. Things were bad in Derry in 1971 but they were a lot worse in Belfast which is where and when Yann Demange's terrific movie \"'71\" is set. Maybe it's because I had first-hand experience but I've never really taken to films about 'the Troubles'. Irish film-makers have usually shied away from the subject, (a rare good exception being Jim Sheridan's \"In the Name of the Father\" and that was set mostly in England), leaving it up to the English and the Americans to tackle them, mostly ineptly, (exceptions again being Alan Clarke's made-for-television film \"Elephant\" and Steve McQueen's \"Hunger\"), so my expectations of \"'71\" were far from high, yet I believe this will be the film about the Northern Ireland 'Troubles' by which all others will be judged. Firstly nothing happens on screen that seems far-fetched or exaggerated, (and here is a film that doesn't pull its punches in showing the collusion between the British Government and paramilitaries on both sides). It's a film that could never have been made in the seventies and even 20 years ago it would have been banned here in Northern Ireland. Politically, it's dynamite but it's as a nail-biting, nerve-shredding thriller that it really makes its mark. In may respects it's a very minimalist work, taking place almost entirely over the course of one night and is really made up of two lengthy set-pieces. It's about Private Hook, (a superb Jack O'Connell), a young British solider who, on his first day of active service in Belfast, is separated from his platoon and forced to go on the run in a totally alien landscape where he is seen as 'the enemy' to be hunted down and killed. We've seen this story before. In \"Odd Man Out\" James Mason was the IRA man on the run in an equally treacherous Belfast but as they say, it's a tale as old as time. Outstanding American examples have included \"Deliverance\" and \"Southern Comfort\", albeit in very different settings, but few have packed the punch of \"'71\"; this is a terrifyingly tense thriller.<br><br>It's also the feature debut of Yann Demange who handles the material with all the assurance of a Paul Greengrass. He shoots it as if it were a newsreel, using mostly a hand-held camera, (the DoP is Tat Radcliffe), putting the audience in the centre of things. For once, all the performances are superb. In the past actors playing either Ulstermen or the occupying forces have often been reduced to nothing more than mouth-pieces; not here. Everyone on screen is utterly believable. This is one of the finest films you will see all year.","user":"MOscarbradley","rank":[188,214]},{"title":"A superb debut from this team - Brilliant piece of film making","rating":9,"date":"13 October 2014","review":"Set against the complex backdrop of the beginnings of Northern Ireland in 71 but before Bloody Sunday really turned the tide in the favour of the IRA in 72 this is an extremely well made taught piece of drama. With an assured performance by rising star Jack O'Connell in the lead, he plays a young soldier Gary Hook recently deployed to Northern Ireland who finds himself out of his dept when going on his first patrol thanks to the incompetence of his CO (Sam Reid) - Separated from his unit and lost in a city he doesn't know he's forced in a fight for survival as its hard to tell who is friend and who is foe in this extremely well written piece of drama. The writer here has taken care not to paint one side entirely good or bad and that is how it was. Wounded and armed with nothing but a knife Hook has enemies closing in from all sides as the film draws to a bloody climax. <br><br>I don't want to be accused of gushing praise, but there is much to compliment the whole team involved here, from the tones of the production design, beautifully capturing the mood feel and look of the 1970's in drab pastels and the grey of urban decay. The editing, directing, lighting is all bang on the money but greatest of all is the casting, for it is not only O'Connell who shines here, but the younger members of the cast almost upstage him with their brilliant performances. Two stand outs of the younger cast were Corey McKinley (Listed rather almost like an extra on here as 'Loyalist Child which seems a little unfair) and Barry Keoghan - The former is clearly a star in the making with his ballsy performance while Keoghan with almost no lines makes an amazing impact with simple looks conveying the struggles of emotion he feels inside when it comes to committing to a path of violence. Veterans Sean Harris brings his creepy presence to the duplicitous under cover unit commander but it is an energetic performance by O'Connell that brings it all together. Let us hope we do not loose him to Hollywood entirely. The film also takes time to give Hooks character some context, so we have some idea of his own life and attachments back home. A man almost without a family but not without people who are depending on him, this is a true depicting for many whom join the army, an alternative to spending life on the dole. <br><br>This film is living proof that we can make thrilling and exciting cinema in the UK but still leave some room for Social Commentary within the context of a great story - an excellent thriller which hints at the dark path that was to follow in Northern Ireland for many years. Strongly recommended.","user":"azanti0029","rank":[95,111]},{"title":"Uses the setting well to create tension, but also struggles with the weight of it too","rating":27,"date":"27 March 2015","review":"I will be honest and say that I generally am touchy about films using the sectarian terrorist organizations, the troubles, or other aspects of Northern Irish politics as a base for thrillers or films – mainly because when they do, they do so in a rather heavy-handed and thoughtless way such as The Devil's Own, The Jackal, or many other such films. So with '71 there is a certain odd feeling that uses the streets of Belfast in the early 1970's as a launching point for a thriller involving British soldiers, terrorists on both sides of the divide, the RUC, and civilians of the time. This is not only an odd feeling that I had, but it is also one that the film itself seems to be all too aware of.<br><br>To talk generally the film does provide some good tension, with its fast pace, shifting ground, and hand-held camera-work; when it is doing this it is fine – not perfect, but fine. The sense of being trapped between all sides is apparent, and with the stakes high it does move well with what it does. The need to have all the players be clear and be positioned does rather reduce the pace a bit, but what does limit the film a bit is, ultimately, the politics of it. So, for some of this it is not the film that does this but rather the viewer – I guess particularly if you are familiar with the Troubles then it is hard to detach your personal opinions from the drama, which can make some of it harder to get into. The bigger thing though is that the film itself is conscious of this being a real situation, and as such it does know it carries a certain weight with it compared to if it had created this story in a fictional situation.<br><br>The cast carry this weight too, although mostly they do play out their characters as a more straightforward thriller – which helps the film be just that. O'Connell, Harris, Dormer, and others all play solid roles in the thriller side, even if the weight of the politics stop them just being genre devices, or being too details as real people. The pacing and structure of the film is good, and mostly it does manage to present the city streets of the Belfast roadblocks and no-go areas as oppressive and ensnaring if you are on the wrong side of them.<br><br>So as a thriller it mostly does work well thanks to the shifting narrative, and pace of delivery, however it is a film that senses the weight of the real story that it is using for the purposes of the thriller, and this knowledge does make a difference across the delivery.","user":"bob the moo","rank":[28,32]}]