[{"title":"Very impressive small budget sci-fi thriller","rating":8,"date":"17 November 2014","review":"Time lapse is an independent film about a group of friends who discover a camera that can take pictures of the future. It's a nice concept and is executed very well. <br><br>This is only a small budget film with few special effects, instead it relies on a sharp script, good acting and an interesting story. It doesn't take long to set the scene and is always interesting. As things go from bad to worse for the three friends there are a number of tense scenes and some surprising plot turns. <br><br>As the film is set in one location it really requires strong performances from the cast and thankfully all three leads excellent as are all the supporting cast. <br><br>This is a clever, impressive and very entertaining film which really shows what can be done with a limited budget. This film deserves a much higher profile and I would expect it's current rating of 6.9 from 437 votes to increase over time. <br><br>Highly recommended.","user":"MattyGibbs","rank":[153,226]},{"title":"A Balanced Review","rating":7,"date":"6 January 2015","review":"I spent the first part of this film umming and ahing as to whether or not I was enjoying it, but towards the end I was totally gripped and at the end I absolutely loved it.<br><br>The story and pacing of this film are practically perfect, making it a definite winner in my book, but any prospective viewers might benefit from being aware of a couple of things before they decide to watch.<br><br>Firstly it looks kind of like a cheap made for TV movie. Some of the camera shots are creative and well thought out but the whole thing just oozes film-making on a budget, and some people might find that hard to get past.<br><br>The style reminded me of the remake they did of The Outer Limits in the 90s, rather than a film from 2014. Also, much like the aforementioned series the incidental music is horribly generic and uninspired (but thankfully used pretty sparsely.) The acting is mediocre from the three leads. Some people will find this grating, so prepare yourself. They won't be winning any Academy Awards anytime soon for their performances, trust me.<br><br>So why should you definitely watch this movie? Because despite the clunky dialogue and wooden acting the plot is entertaining, unfolds brilliantly and is executed just about as perfectly as a plot can be executed in a movie. It is a wonderfully self-contained story that builds to a satisfying denouement and keeps you guessing and totally gripped along the way. <br><br>If you go into this movie expecting every aspect to be amazing, you're probably going to be disappointed. Instead bear in mind the criticisms above and trust that despite these weaknesses it is an uncommonly enjoyable watch and well worth an hour and forty minutes of your time.","user":"johnbkaramazov","rank":[110,163]},{"title":"A highly enjoyable little gem of a science fiction thriller","rating":7,"date":"16 January 2015","review":"Time lapse is a very well-made and entertaining little movie, something that should satisfy the average science fiction/thriller fan. The three leads all perform at a high level. Matt O'Leary as a young artist is appropriately fragile, Danielle Panabaker is not the 'good girl' you might assume from her appearance and George Finn conveys real menace in his portrayal as their friend, sinister from the middle point on.<br><br>Settings are simple but effective and the atmosphere is well held together by the staging and the clean production. There won't be any awards for set decoration but it works and isn't a distraction to the story. Unlike many low budget efforts it doesn't have that 'cheap scenery' feeling at all.<br><br>The lean script has enough science in it to work, but not too much to make it muddled. You aren't going to cheat on your next physics project by borrowing from this movie but you won't be offended by the theory in play. The good news about the story is that it works and by the end of the experience you will feel entertained with intelligent and clever writing. Your brain will be teased by this film.<br><br>There are several dark moments in the movie that show some real Hitchcock influence, though a film maker worker in this milieu is wise to borrow from the master. In addition, from time to time the score swells into a legitimate (though very minor) homage to Bernard Hermann. Again, a very good idea. The windup is complete and clean, revelations during the body of the film become evidence that tickle with satisfaction as it ends.<br><br>Low budget, but you aren't going to feel like you are watching some derivative film school project. This is a good movie with young actors creating their own characters. I think almost all viewers will find it artistically fresh. This is the first work I have seen from this director and after seeing Time Lapse I will look for his name for future entertainment, along with the names of his young stars.<br><br>When you find a film like this with unknown actors, a director you don't recognize and subject matter that could easily become boring you are forgiven if you don't fully commit to a full viewing when the streaming or broadcast starts. Personally, I gave it 15 minutes to prove itself when I began and was quickly stuck on it until the end. You should allow it to be the only content showing at the moment for you and your co-viewers, this is one to pay attention to in order to really enjoy. But, I think enjoyment is nearly a done deal.","user":"bob-larrance","rank":[71,108]}]