[{"title":"You Will Love Me: Confusing mess","rating":2,"date":"4 February 2019","review":"You Will Love Me, otherwise known as The Poltergeist of Borley Forest is a messy awful excuse for a horror made even more complicated by the fact it's also known as American Poltergeist 2. Why is that complicated you ask? How about the fact that American Poltergeist came out in 2015, 2 years after this!<br><br>A messy uber low budget haunting tale that tells the story of a girl who gets targeted by a malevolent spirit after visiting some infamously haunted woods for a party.<br><br>Basically everything that happens from opening credits to closing you'll have seen before. The film doesn't have a single original moment, which wouldn't be so bad if they'd actually done a good job in crafting the movie.<br><br>Mostly lifeless and boring it's made worse by just how poorly put together it is. Shoddy editing, random audio spikes and a highly uninspired script make this a chore to watch.<br><br>I could rant but I'll resist the urge, there isn't much to say about a movie as unoriginal and shoddily made as this.<br><br>The Good:<br><br>Competent enough young cast<br><br>The Bad:<br><br>Dreadful sfx<br><br>Unforgivably bad sound balancing<br><br>Plain boring","user":"Platypuschow","rank":[9,9]},{"title":"Unwatchable... GOD AWFUL!!!","rating":1,"date":"25 November 2015","review":"Don't pay attention to any review that paints this catastrophe on film in a positive light... these were mostly likely written by one of the morons involved in its production. It boasts horrid acting, horrid cinematography, and horrid writing with barely any creativity. The best part of this... I won't even call it a film... fodder-ridden, straw-stuffed horse **nt is the title sequence, which kept me in the movie for five minutes before the pervert in me found the FFWD button to see if this $#!t fest had any redeeming value in the form of nudity... big surprise there... NONE! *yawn* The acting is laughable as is the contrived nature of the story, but not enough to warrant you or anyone on earth watching it. Your time is more valuable than that even if mine isn't... trust me on this if on nothing else. God, we should just outlaw low budget horror distribution and work on getting every horror film from the 80's digitally remastered and redistributed... I've had enough of crap like \"The Poltergeist of Borley Forest\" sitting on shelves in the fleeting number rental shops in America. Do they even know what a poltergeist is? It's evident through the movie that they do not. Did they figure they covered their tracks by having the ghost throw Paige's ridiculous paintings all over the room and randomly rearrange flowers? I'm sure that d-bag professor who turns into a cartoon just before he's dismembered comes up with some half-cocked explanation in that scene I watched on &gt;&gt; x8. Stupidity begets stupidity, and I suppose I am proof of this.","user":"aloysius_predato","rank":[20,23]},{"title":"A who cares, slow, plodding nodfest.","rating":1,"date":"4 June 2015","review":"A cast of character that one could not identify with nor care about. I think there is a plot here that could make fifteen minute short perhaps. Let us elongate that pain into almost two unbearable hours and one attempting to view said film could find themselves at their stove attempting to boil their own head. <br><br>This constant preoccupation with one frame? Digital video runs 25 frames per second so a 1 frame anomaly would not be noticed. Plus cleaning up 1 frame that has an artifact for complete clarity would be impossible. I am a digital editor as a living. <br><br>It is amazing that everyone these days can be in movies and NOT everyone is an actor. Just do not watch it unless you need a catalyst to put you to sleep.","user":"bernardlcrawford","rank":[13,16]}]