[{"title":"The height of perversity","rating":1,"date":"23 June 2017","review":"On the basis that other reviewers have very adequately covered the glaring objections to this film I will keep this brief.<br><br>In an action packed life of 80 years involving 2 world wars and one other significant war (The Boer War), a momentous political career, a life filled with both failure as well phenomenal achievements, that the filmmakers should think it necessary to MAKE UP a story about Churchill seems like the pinnacle of perversity. It just defies any logic hitherto known to mankind.<br><br>\"Poetic license\" is nothing new in movie making. However this movie is more like a \"license to kill\", kill a man's reputation, kill the concept of history, and kill the truth. The preservation of actual history in the light of revisionism is difficult enough without the general public being exposed to downright lies to further confuse and deceive them.<br><br>I give this movie a 1 as a protest, in the probably forlorn hope that if enough people do the same to all movies that mess around with history, movie makers will get the message and steer their movies in a way that treats people and history responsibly.","user":"p-seed-889-188469","rank":[229,259]},{"title":"A car crash","rating":1,"date":"16 July 2017","review":"Wow. What a waste of an opportunity to make a brilliant film. To summarise it in 5 words: BORING, INACCURATE, EMPTY, UNINSPIRING AND REPETITIVE. <br><br>What really makes me angry about this film is the thought of the thousands of people who know very little about Churchill who watched this to gain more insight into him. What they'll come away with is the sense that Churchill was a bumbling alcoholic, did nothing during WW2 and was a senile, absent leader. Of course, no such thing is true. <br><br>Shame on the writers of this abomination for taking 'artistic license' and redrawing history. <br><br>The very low budget shows, too. With a bizarre lack of any battle scenes despite the entire film being centred around one of the largest battles in military history. The film is also littered with needless time-wasting shots of Churchill getting into cars, getting out of cars, then back into cars and so on. <br><br>Cox's performance is good, but his accent irritatingly varies widely, particularly in shouty scenes, which ruins any sense of genuine character. This is the first film where I've sat in the theatre and honestly wished it would end sooner. For that reason, this is one of the most disappointing films I have ever sat through. AVOID AVOID AVOID.","user":"sammyhammy-55305","rank":[104,121]},{"title":"Melodramatic nonsense","rating":3,"date":"5 June 2017","review":"All evidence points to Churchill being the main actor behind the idea of the Normandy landings. He pushed for it for over two years with increasing impatience, trying to persuade Roosevelt to agree. The second front was seen in Britain as an absolute necessity in order to prevent Hitler defeating the Russians, consolidating their mainland European forces, and gaining the resources they needed, including oil from the Caucasus, to mount a full-scale attack on England. After the Russian victory at Stalingrad, it was seen as necessary to shorten the war, and to stop the Russians becoming too dominant on the continent.<br><br>As the noted historian Martin Gilbert notes: \"It was Roosevelt, not Churchill, who postponed, the Second Front for a full two years. In the long run-up to D-Day, Churchill was convinced that a cross-Channel landing was the way to Germany's defeat.\"<br><br>Churchill was the inspiration behind the floating Mulberry harbours needed for unloading heavy weaponry and equipment from ships - hollow concrete, floating blocks that were towed across the Chanel by tugs. He was also intrigued by, and personally oversaw, the projects to modify tanks specially developed for tackling the particular difficulties of landing in sea water and mounting beach defenses. Far from being out-of-touch and stuck in ideas held in the previous war, as falsely portrayed in the film, he was a very strong advocate of modern, technical solutions to the problems of the defeat of Germany.<br><br>Again, according to Gilbert: \"In the last months of 1942 Churchill was still seeking August or September 1943 as the date of the cross-Channel landing. At a Staff Conference on 16 December 1943, however, the three British Chiefs of Staff, headed by General Sir Alan Brooke, told him that it could not be done.\" Brooke, the very man portrayed in the film as resenting Churchill's 'reservations' and 'fears' about the landing.<br><br>On the History Today site you can read: \"Addressing a joint session of Congress, Churchill warned that the real danger at present was the \"dragging-out of the war at enormous expense\" because of the risk that the Allies would become \"tired or bored or split\"—and play into the hands of Germany and Japan. He pushed for an early and massive attack on the \"underbelly of the Axis.\" And so, to \"speed\" things up, the British prime minister and President Roosevelt set a date for a cross-Channel invasion of Normandy, in northern France, for May 1, 1944, regardless of the problems presented by the invasion of Italy, which was underway. It would be carried out by 29 divisions, including a Free French division, if possible.\"<br><br>On the evening before the landings, Churchill happily phoned Stalin to tell him the attack was finally on.<br><br>The film's basic premise seems to have been conjured out of a remark that was recorded in Churchill's wife's diary, when, again, on the night before the attack, she writes that he \"lamented that by morning 20,000 young soldiers would be dead.\" Of course he was concerned about the loss of life, but not in the way that the film shows as being a debilitating condition, almost suggesting senility, and such an obstruction to his generals.<br><br>None of this would matter so much if the film were a dramatic success. Unfortunately, it is a tawdry, over-sentimentalised bore, with contrived emotional, schmaltzy scenes, and quiet, tinkly fairy music in the background. The scene (also historically inaccurate) between Cox (Churchill), and Purefoy (the King) is played so gauchely that at one moment I thought, as the gentle music started to rise and Purefoy moved forward, that Purefoy would kiss Churchill.<br><br>That scene distorts a much more interesting reality, turning something that in reality was actually very clever into fictional schmultz; a case of fiction being much less interesting than reality. Churchill did insist to Eisenhower that he wanted to sail on D Day on HMS Belfast, even insisting, if necessary, that he would obtain a naval commission to do so. Churchill did not ask the King to go with him. In fact it was the King, on being told of Churchill's plans, who cleverly insisted he would go along too. This put Churchill into an interesting difficulty since he saw the King's gesture as a foolhardy and an unacceptable risk to a far too important symbolic figure, and so Churchill refused to countenance it, seeing at the same time that he would also have to abandon his own foolhardy plan.<br><br>Other scenes, especially those between Churchill and his assistant, were typical, overblown, and contrived set pieces for the sake of some 'stirring' rhetoric, with about as much subtlety and nuance as a party political broadcast.<br><br>Good actors, some good performances, some terrible casting (Purefoy) but really, who wrote this drivel?","user":"robertclark-1","rank":[118,142]}]