[{"title":"Above average footage style low on gore high on mystery and creeps","rating":8,"date":"20 May 2014","review":"This is a generous 8 many because its low budget and particularly for some reason it just hit the spot for me. I'm a veteran horror movie buff and started watching this 'found footage' style movie with a meh, another one. It isn't actually found footage but more a footage style in that due to the Vatican team experiencing some grizzly occurrences previously the Vatican wants everything filmed as part of new regulations. Hence we have characters with camera headsets on and fixed static cameras in places. All the shots are then taken from these points of view so we do experience some viewing as what the characters see but it's a tool not 'found footage' so shaky cam does not go over the top. Its a bit of a slow burner but sucked me in unexpectedly within minutes. There's something quite natural about the lead characters and its so far removed from the majority of US generic stuff that I was totally intrigued instantly. This movie also did something very rare - it creeped me out. Everything is quite subtle even the humour and religious and life philosophy is touched upon in what seems like normal interactive banter. It had me guessing all the way through and surprised me with its ending, which I was even able to trace back many subtle references to throughout the movie. I actually laughed as it is very rare I'm surprised by a movies ending. If you want pizzaz and action and gore this is not for you I've never actually read HP Lovecraft but I think this is something somewhat in that vein. A kinda creepy slow burning mystery would suit the description and there is not one single young attractive woman who can't run straight without falling over in it.","user":"jonnytheshirt","rank":[29,37]},{"title":"Brilliantly creepy and atmospheric found footage horror masterpiece","rating":10,"date":"16 April 2014","review":"I decided to watch this because film critic Mark Kermode thought it was great and he almost felt compelled to leave the screening because the film was really getting to him. Kermode is a huge horror fan so that's really saying something and I had really high expectations for this movie. Luckily, I wasn't disappointed. <br><br>I really don't have anything bad to say about this movie. The actors were great, they all felt very natural. Despite of its found footage style it doesn't forget plot and character development. They took their time in setting up the characters and didn't throw a lot of scary stuff at you in the beginning which made it all the more compelling when bad stuff starts happening. At no point was I baffled at the characters or wondered why the hell they were acting as they were. The character dynamic between Gray and Deacon is especially interesting and entertaining. <br><br>On the technical side the sound design was especially brilliant. If you have a good pair of headphones, all the better. I had some proper spine-tingling moments with this one watching it in a dark room with my headphones on. The movie really has that feeling of everything getting worse and more horrific till the end. The tension and suspense were absolutely terrific and built up perfectly culminating in a brilliantly frightening ending.<br><br>The movie didn't feel gimmicky at all which is always a risk with these found footage movies. I'm not sure if it's groundbreakingly original and all that but it was very effectively made. This is the best found footage horror movie I've seen besides the Blair Witch Project, you should definitely give it a chance.","user":"lornloxor","rank":[51,70]},{"title":"Dark and creepy fun","rating":8,"date":"6 April 2014","review":"Wow, what a great little film. I'd seen trailers for this quite a while ago and was waiting for this to come out on the big screen. However, it seems that this has just played at a few film festivals and then been released on DVD, so this film will pass quite a lot of viewers by, which is a huge shame.<br><br>The story concerns a Vatican team of investigators, conducting an investigation into a 12th (I think) century church in rural England. The local priest has reported supernatural goings on that he considers to be miracles, but these so called miracles soon turn out to be something far more unpleasant.<br><br>Most write ups of this film have focused on the fact that this is a found footage film. Please ignore this, as I find that this does the film a huge disservice. Found footage these days has mostly negative connotations, but The Borderlands effectively avoids the pitfalls of this most lazy of filming styles. There is very little time spent here watching empty rooms, or being confused by wildly shaky camera work. This is no half hearted causally thrown together film. Instead, this is an expertly crafted little film, with lots of great ideas and wonderful characters.<br><br>What surprised me the most about this film were the characters. The two central characters, Deacon and Gray, are the warm beating heart of this film. Watching their relationship develop from awkwardness and barely concealed disdain for one another to something much more akin to friendship was great. I had worried that Gray, who serves as the film's comic relief, would begin to grate after a while, but he serves effectively as our guide into the film's darkness, at first full of quips and digs aimed at everyone and everything around him, but he then becomes more serious and increasingly uncomfortable and alarmed as the situation spins out of control.<br><br>The religious aspect of this film also serves to add to the film's depth, with the religious characters serving as the skeptics and Gray, the only non religious member of the investigation team, being the most willing to believe. This, plus the dawning realisation that the supernatural elements at play here may be something altogether more malevolent and older even than Christianity, means that this is a very human film and one filled with chills and effective scares.<br><br>And then there's the end, and this goes back to my comment on the film's ideas. Wow! I loved the end to this film, although I have read comments from those who feel that this was out of keeping with the rest of the film. Without going into spoilers, I will say that the film's final section delves into altogether deeper and darker territory, but as long as you're paying attention, this is well built towards throughout the entire film. The film drip feeds in information and nods in the direction of what is a superbly original and downright horrible sting in the tail of this wonderful film.<br><br>No, it isn't the 'scariest film ever!!!!' as some of the critics have described it. But then again I'm not easily scared when it comes to this type of film. But it is a darkly creepy and nasty little film, with a great plot and nicely developed characters. And as such, I thoroughly enjoyed The Borderlands and would recommend it highly.","user":"stephen-bromley","rank":[57,83]}]