[{"title":"Denver Film Festival Showcase - Conversation Starter","rating":8,"date":"6 November 2017","review":"This past weekend, I was fortunate enough to attend the 2017 Denver Film Festival premiere \"Submission.\" In a quick summary, writer/director, Richard Levine adaptation of Francine Prose 2006 novel, \"Blue Angel,\" is a bold conversation starter. I found myself laughing at Stanley Tucci performance as the drowning, some-what famous college professor. Laughing in a sense, of relatability. Tucci delivery of the film's narration and in-head page reads were on point. The entire movie Tucci's character deals with an inner struggle of feeling CLICHÈ and washed-up. His performance comes off very personable. You trust this character... <br><br>As the movie progress and the lines of student and teacher relations become blurred, actor, Addison Timlin begins to steal the show. Her performance is not just mesmerizing, but manipulative. <br><br>Without saying any more about the overarching story, the scenes between Tucci and Timlin were designed in a way to create a conversation. Sexual harassment, the power within that situation and becoming the clichè you don't think you are, are discussed on screen in several different lights. <br><br>I thoroughly enjoyed the experience of the Denver Film Festival screening and would suggest this film to most moviegoers. Enjoy!","user":"grantiworden","rank":[26,31]},{"title":"\"Submission\": Whose conning who?","rating":6,"date":"26 February 2018","review":"The games are dirty and the stakes are high in the new drama \"Submission\". Stanley Tucci (sporting a toupee that doesn't look half-bad) is as solid as ever as Ted Swenson, a dispirited college English lit professor in desperate search of a follow-up to a successful debut novel. Addison Timlin is Angela Argo, an admiring and enigmatic student who persuades her prof to critique chapters of her own go at a book. At first Angela projects as timid and unsure of herself and her craft with Ted. But we watch as she transforms from a seemingly scattered coed into a poised and purposeful young woman, and all the while shrewdly laser-focused on a prize she covets above all else. <br><br>As the mentorship develops matters inevitably become increasingly complicated between teacher and student. Eventually the relationship makes a volatile shift from nurturing common bond to flashpoint cataclysmic intimacy. Screenplay writer and director Richard Levine presents a dynamic in which it becomes increasingly difficult to discern who is in fact playing whom in the quest for literary fame and fortune.<br><br>The supporting cast are quite good across the board in \"Submission\". The multi-gifted Janeane Garofalo-one of my all-time faves-brings a sense of humor and pathos to the story as Magda, professional cohort and personal confidante of Ted who must help determine a wrenching verdict regarding her friend late in the film. The routinely reliable Kyra Sedgwick makes an impression as Sherrie, a dutifully supportive working wife who has her comfy world shaken upside down in the wake of devastating disclosure. The pivotal restaurant dinner scene between husband and wife is powerful stuff from both of these pros. But it is Sedgwick's performance in particular that infuses these emotionally jarring moments with searing sorrow and strength. <br><br>\"Submission\" opens in New York City on March 2 and in Los Angeles along with other markets nationwide March 9.","user":"jtncsmistad","rank":[20,24]},{"title":"Brilliant","rating":9,"date":"5 July 2018","review":"Brilliant, and so current within the bounds of sexual harassment, and the bringing down of notable figures within our society. This story, however, shows the other side of the coin, how the female \"victim\" insidiously manipulated to reach her goal of success, at the cost of ruining the marriage and teaching career of the professor. Excellent performances all around, and to add, this is a very brave film! Highly recommended!","user":"WVfilmfem","rank":[19,29]}]