[{"title":"The Interview: An Actual Honest Review","rating":7,"date":"25 December 2014","review":"The Interview has created a lot of crazy rumors and a lot of things have been making this movie one of the biggest happenings this year. A lot of speculations were made when Sony got hacked and they suspected that North Korea was behind it. This generated a lot of interest for the movie and people were talking about it over and over again. So, after several threats they decided to pull the movie from all theaters. Later on, they decided to release it for streaming purposes, and that's how we finally got to watch the hard work that was put into The Interview.<br><br>Let's get to the IMDb rating first; they are obviously fakes and there are even people on 4chan telling everyone to rate the movie a 10. This is really just to give the creators of the movie the support and love they need after suffering this sad conflict. Also, it is a great opportunity to actually show movie distribution companies that putting movies earlier to watch at home too streaming, WHILE running in cinema will generate A LOT of money. <br><br>I got the opportunity to watch this, and I figured, what the heck, it's only 5,99 USD, so why not give it a shot, since everybody is talking about this film. Honest opinion now, a lot of reviews here are fake, by people who has NOT seen the movie. So here's your opportunity to actually read an HONEST review.<br><br>The movie is in no way perfect by all means, but it does have it's surprisingly funny and shocking moments. Yes, the movie is overloaded with toilet humor and profanity, but it does not necessarily make it a bad movie. I found a lot of the jokes mildly amusing and I chuckled through almost the whole movie with some laugh out loud-moments too. The chemistry between Franco and Rogen is perfect and they always work well together when it comes to acting. The story has set a goal in movie history, and Rogen actually had the ba lls to mock a world leader. I adore Seth's hard work into this movie and I adore everyone else who were part of this project. It's a shame that people get so butt-hurt over a f****nag comedy film. While skeptical about the movie itself, seeing as Rogen's humor is childish and contains a lot of toilet humor and continuous jokes, I found myself enjoying the whole film. The script was very well written, the characters felt real and it had the perfect blend of humor, action and drama. (and a little bit of romance, too) I found both Franco's and Rogen's performance to be flawless and the chemistry they have on screen is wonderful, making this a very believable film. However, I found Franco's character to be a little annoying, but I guess that's what they aimed for. Franco's character felt a little flawed because at one moment, he acted like he was retarded, and then the other second he's starting to act like he's some kind of Sherlock Holmes. This was a minor problem to me, but I kind of wish that they would have worked on Franco's character a little more and made him to be more believable, in my honest opinion he was annoyingly stupid and almost too stupid, even though that was what they were aiming for. They made Seth's character seem so much more intelligent than Franco. I have no idea what they were trying to do but in my personal opinion it always bothered me.<br><br>The scenes where Franco got to meet Kim Jong Un were truly amazing, but at the same time, quite awkward. Even though Kim is the bad guy, you couldn't help but feel bad for him. They actually made him a misunderstood individual, just like Franco's character, and I found that to be very funny and clever. As for the actor playing Kim, he does an amazing job and he does not waste any of his acting talents. You actually believe him as a person and that makes the movie a sh*t load better. <br><br>I do not want to spoil the movie for you, but what I can tell you is that this surely is worth a watch at home. I would not have been pleased if it was a theatrical film, but if you're just looking for a funny film, with lots of shock humor, and Rogen humor screaming all over it, this is your choice. Turn of your brain, maybe take a beer and enjoy the movie as it is. <br><br>Summary: The Interview was a pleasant surprise with believable character development, an interesting plot that only gets better after the second half, with plenty of toilet humor and gags that do not fail to amuse. This will most likely be the most anticipated movie of the year, or at least of 2015, causing the trouble it did, making more people interested in what made this movie so threatening and offensive to North Koreans. Sit down, grab a beer and enjoy. It is a movie that doesn't take itself seriously, meaning you should not take it seriously. It is a great effort from both Rogen and Franco, and I recommend this film to everyone who can actually take a joke AND has a sense of humor, especially those who likes the type of humor Rogen has been featuring these past years.<br><br>The movie deserves a strong 7 out of 10. Hopefully, the fake ratings will be reset and The Interview will have an average rating of about 7-8.","user":"sweetboyy_99","rank":[189,291]},{"title":"People are really stupid. Great movie for it's category","rating":10,"date":"9 January 2015","review":"Reading some of these reviews and I find myself looking for a pair of pliers to help some of these people remove the stick out of their ass. To note, I only made an account for this review because I was afraid some people may get the wrong idea about this movie. No, it will not win an Oscar, no it will not have an Oscar winning actor. Was Chevy Chase, Chris Farley, Eddie Murray, Chris Rock, Adam Sandler, Bill Murray, Mike Myers, Will ferrel did a any of them win an Oscar? No, however were their movies not one of the funniest of their time? Exactly. Seth and James will not win an Oscar because the committee doesn't rate comical aspects. However this movie is hilarious. Without being one of the \"typical\" comedy type movies that have come out recently. It's different comical aspects then what has been common in movie cinema in the past year. Obviously it's a comedy, and in the category of comedy movies it will rank as one of the higher ones. When you watch this movie you expect that. It's not a Beautiful Mind or Titanic. It's a comedy, and a damn funny one at that. When you watch a comedy you want to laugh, and this movie will make you laugh. End of story. Please don't listen to those who critique this movie as if it is a nominees for a best movie award.","user":"Mrjafa12","rank":[152,238]},{"title":"Dumb and Dumber do The Interview","rating":3,"date":"25 December 2014","review":"For the sake of film criticism, I will pretend that I watched the film without the political maelstrom that has raised it to a level of interest that it would otherwise never have attained.<br><br>This is the typical mass produced, lowbrow, comedy that Hollywood cranks out to appeal to 15-year-old boys. There are a few slapstick laughs in the tradition of the Three Stooges that break the monotony. I would not elevate the film to the level of a satire as that would imply that there was some intelligent thought behind it. There is not. All the humor, both physical and verbal, is completely obvious. It will not go down in history as one of the great comedies, which is probably what upset Kim Jung Un the most.<br><br>The attempts to make political observations are all based on time-worn points (people are starving, Kim is not a god). The sections that imply Kim has psychological problems may be more irritating to the regime. Most of the attempted humor deals with Kim fighting his homophobia and dealing with a father who gave him little support.<br><br>There is no need to comment on the acting as there really is none. No one will win an Oscar nomination here. The story is predictable: You can guess what will happen before you begin watching it. It's the kind of film you watch to see a few gags and, maybe, get a few laughs. They will be very few, indeed, unless you are 15 or under. However, knowing the media attention that this film has received, it is unlikely a poor review will stop anyone from watching it. Just remember, I warned you.","user":"SteveMierzejewski","rank":[973,1]}]