[{"title":"entertaining bleak and dark Western","rating":8,"date":"13 March 2015","review":"this is probably one of the best western in years. It's a dark and harrowing film, a la \"the proposition\" or \"unforgiven\". This movie is not for the squeamish: innocent people are killed without a thought, and the film does a good job portraying the lawlessness and \"anything goes\" ethos of the times. Mads Mikkelsen is excellent as a hardworking taciturn Danish immigrant who's spent years trying to make a living in this land of opportunity. Unfortunately, tragedy strikes when he brings his family to the country, and then the rest of the film is basically about survival and revenge. At 1.5 hours, the pacing is good, and there are no unnecessary scenes or fat bogging down the story. Action scenes are realistic and very well done, and there's some pretty good cinematography throughout. All in all, a very well crafted and entertaining Western!","user":"HotlineSF","rank":[44,46]},{"title":"Smørrebrød-western.","rating":7,"date":"9 September 2014","review":"On the one hand, 'The Salvation' is a classic western. Good citizens versus evil villains. A steam train. A stage coach. Horses. Lots of shootouts. Barren desert landscapes. A dusty frontier town. Name a western cliché, and it's there. Except Indians. They're only talked about in this film. <br><br>On the other hand, this is also a western with original, non-classic elements in it. Lots of languages. Parts are spoken in Danish, but you can also hear Spanish and Italian from time to time. Plus: a very strong female character, who radiates power although she is mute. Thirdly: the South-African locations. They're not very prominent, because they look very much like the American West. But when you know it, you can't help but think about it. <br><br>The film tells the story of a Danish immigrant, who kills two men who raped and murdered his wife. One of them is the brother of a local outlaw, who terrorizes the town until the culprit is found. But the Dane, an ex-soldier, is not easy to capture and confronts the outlaw. <br><br>Overall, this film seems to be very much inspired by the Sergio Leone westerns. The visual style is superb, and director Levring uses every trick in the book. Aereal shots, slow motion, close-ups: it's all there. I was amazed by the colours in some scenes - it looked as if they were heavily digitally enhanced. The result is astonishing. And just when you think you've seen it all, Levring surprises with a beautiful and, in a way, revealing end shot. <br><br>Sergio Leone created the spaghetti-western. Maybe the time has come now for the smørrebrød-western.","user":"rubenm","rank":[111,127]},{"title":"Intense and unforgiving","rating":8,"date":"23 May 2014","review":"Saw this on premiere-night in Denmark and left the cinema relieved and with a smile on my face. Director Kristian Levring delivers a very believable, dark and uncompromising western set in a very classic western atmosphere.<br><br>The story is straightforward and although it moves along slowly at times (fast paced at others), it's quite intense and is generally beautifully shot.<br><br>If you're going for a feel good movie, this is not it, but if you like classic westerns, you'll enjoy it.<br><br>Mads Mikkelsen and Mikael Persbrandt deliver solid performances as the danish brothers Jon and Peter who've emigrated to America after fighting the Germans in the danish/German war of 1864. But for me, Eva Green steals the show as the mute Madelaine (princess). She has a very mystical and powerful presence and leaves you wondering, wanting more. <br><br>All in all a very enjoyable picture that is a great testament to how far danish cinema has come. This is quite uncharacteristic for a typical danish movie, but Levring really pulls it off and I think any lover of westerns will find this a solid addition to the batch of quality westerns in the past 10 years (The Proposition, 3:10 to Yuma, True grit, Django Unchained etc.) It doesn't quite reach those levels, but it's close and it's enjoyable.","user":"nphilip21","rank":[101,124]}]