[{"title":"For Lovers of Cheap Shoddy Chinese Merchandise only","rating":21,"date":"21 July 2018","review":"Smart people, qualified people, people with good teeth won't appreciate unbridled lies. MAGA and Ivanka Chinese imported merch fans though should get two copies","user":"chantal-pastorek-bigniggs","rank":[132,151]},{"title":"Right-wing money takers and scammers lik Dinesh dumb foold people","rating":13,"date":"13 April 2018","review":"Dinesh D'Souza is a convicted criminal who peddles crap to make money from the tricked and the deluded. This is written not as a piece of history, but to appeal to ignorance and misleading facts. America is great but Dinesh doesn't care. He wants your mullah. (for his conviction defense?). Dinesh tries his best to manipulate the narrative to show that Leftists are only plain wrong, but he forgets to explain how the new deal, unions, taxes and comraderie built America and its great middle class. Conservatives only succeed in ruining the best society the world has by convincing us to give them even more money and make the gap between the rich and the poor wider. Of course our founders and every generation knew this, but we are still being conned by Sinclair Broadcasting, Fox News and the right-wing media. This is the worst misleading piece of fiction that I have ever seen (and I watch Fox News' rage machine) and one of the most lying movies of my long life, because Dinesh's refutation of a kind and cooperative America is a stunning middle finger to all that is good and beautiful about America!","user":"egx-33206","rank":[132,151]},{"title":"If this is a documentary","rating":11,"date":"11 October 2017","review":"then I am Peter Pan and my wife is a leggy supermodel and Donald Trump is a leader and he cares for the poor and there is such a thing as clean coal and Trump is draining the swamp by hiring all the standard insiders, generals, CEO and millionaires to his staff and cabinet and his wife didn't do softcore porn when she came here and worked as an illegal alien and those Made In China tags on his merchandise are just jokes like a gag and he actually manufactures them here and right-wingers believe in freedom of speech and government staying out of people's business except when a football player wants to speak his mind etc etc etc.<br><br>Conservatives and just that. Cons.<br><br>PS: Dinesh and his buddies think NRA money is more important than American lives. Killing schoolchildren is not a problem.","user":"sma-86297","rank":[137,157]}]