[{"title":"Much better than than the reviews have one believe!!","rating":9,"date":"18 April 2015","review":"If you enjoyed other Nicolas Sparks movies, you will enjoy this one. It is heartwarming and one with integrity that depicts what it is to love someone unconditionally. It is a sweet, and sensual romance of a young couple struggling to come together while each follows their dreams. Sophia, wants to follow her passion of art, and Luke, follows his passion as the world's best bull rider. Their love story is entwined with the memories of a relationship of love long ago, told and acted by Alan Alda, who plays Ira, as he reads letters he wrote to his dear wife, Ruth. The scenery of the movie is lovely, the bull riding is exciting, the script, thoughtful and touching. Have Kleenex on hand, you will cry. At the end of this movie the audience clapped because it was good all the way through.","user":"carierandolph","rank":[79,99]},{"title":"'The Notebook' meets '8 Seconds'","rating":7,"date":"16 August 2015","review":"Enjoyable tearjerker flick paralleling modern love story between bull rider and college student with that of an older gentleman who is on his deathbed. I personally thought that the story of the older couple was more developed and less cliché. The plot is overall enjoyable. The cinematography of North Carolina mountains is beautiful. My favorite scene was the last bull riding scene which is in slow motion and uses punchy bass (only real use of LFE effects in the movie). <br><br>On a personal note, I was saddened to read that Rango the Bull passed away after shooting the movie but before the film was released. Apparently he was a real life superstar in the rodeo circuit.","user":"ouskullz","rank":[26,33]},{"title":"Half A Good Romance Tale, Yet One of The Better Sparks","rating":7,"date":"10 April 2015","review":"Every year we get another Nicholas Sparks movie. These movies try to emphasize \" true love\", but are usually simplistic mushy plots, where eye candy fills the screen. Well this weekend I dive into the dark, surround sound trenches to review his latest installment, The Longest Ride. Out of annoyance, I quickly lowered my expectations at what was in store. What is in store? Read on to find out.<br><br>Most know what to expect from Sparks, a good-looking boy and girl meet up and magically start a romance. One of our characters is the perfect specimen of looks, sensitivity, and romance that drives the ideal romance, until it goes to pot for some reason eventually working out in the end. This is only partially the case, the tale of Sophia (Britt Robertson) and Luke (Scott Eastwood) act out following the typical Sparks plot. The beautiful people form another ideal couple that women idealize where chiseled abs, a handsome face are complemented by incredible feats of consideration and sincerity. Naturally I rolled my eyes at the drastically overplayed perfection, but there were many enchanted by the stereotypical romance he painted. A \"nice\" distraction that spices things up are the hot scenes, which you can guess involve sex. This movie sex ,starts with another shower scene filled with plenty of butts, and evolves to her riding the bull after he rides the animal of the same name. Some may find it hot, but I found it shallow, pointless, and a waste screen time. <br><br>You might think that there are some surprise twists in this half of the story, something that makes you say OH MY GOD. Sophia and Luke's tale unfortunately has little to shock you, foreshadowing revealing all that is to come in the tale, with the only mystery about when it would happen. I can't deny this was one of my favorite endings, but it took a bit to get to the ending. <br><br>However, there is a saving grace for this film and that is the second story of Ira and Ruth. The tale of the 1940's relationship could have been a movie by itself, truly showing a developing relationship and the troubles they face. This was the type of relationship I like to see, emphasizing care and compassion for the one you want to share your life with it. The gifts were heartfelt, a tribute to the love they truly felt only to be undermined by the struggles they faced. It was real, and an example of the type of relationship I pray many actually get instead of the shallower loves seen in most movies. This relationship was obviously to show how much love has changed, the comparison illustrating the differences between real and superficial love. Obviously this was the meant to drive Sophia and Luke's relationship and overcome their few challenges, but it was the more engaging and emotional of the tales. <br><br>Despite the great morals, sweet romance, and good looks though what else does this movie have in store. In terms of positives, the beautiful settings of North Carolina will take your breath away and offer you a taste of the country life. I also felt the camera work and sound editing did a nice job combining their talents to bring out the emotional spectrum. Many times the music was more emotional than the actual acting, the orchestra work nearly bringing a few tears to this reviewer's eyes. The acting is also decent, especially in terms of the young Ira and Rose (Jack Huston and Oona Chaplin) who really brought their characters to life. I felt great chemistry between these two, almost as if they were really in love and a married couple, something I normally don't say. <br><br>As for negatives, I've already mentioned a few. First off is that the tale is predictable and still follow closely to the Spark's formula. I know to expect it, but that doesn't mean I can't dock the score for unoriginality, which this movie is. In addition the movie was a little too long for me. Again the editing needs to work on what is necessary. I'll go ahead and say that a 2 hour Spark's romance is not necessary. There was not enough drive to carry my attention for the whole time, and half of the scenes, especially with her sorority life, could have been left to the director's cut. <br><br>The Longest Ride is definitely not the perfect film, and in the end is another Nicholas Spark's novel come to life. Yet I can say it is one of my favorite tales of this author, but only due to the first half of the film. I would have liked to have seen more integration of the two tales, but I was pleased with the balance overall. Is it worth a trip to the theater? Not really, but it is a decent romance film definitely good for a RedBox rent. The recommended audience are those that love Nicholas Sparks, want to see romance, or are just looking to stare at beautiful people. <br><br>My Scores are: Drama/Romance: 7.5-8.0 Movie Overall: 6.5-7.0","user":"rgkarim","rank":[49,72]}]