[{"title":"Requiem for a star","rating":7,"date":"25 May 2015","review":"Starry Eyes is not for the faint of heart. I've seen many horror movies and this is definitely on the more extreme side so if you have a weak stomach then this isn't for you. However, it's brutally real in telling its story about a girl who wants to be a star and is willing to do whatever it takes to reach that goal. It's darkly comedic at times and horrifically gruesome at others. I cringed and winced plenty of times during this movie. And it's not even solely because of the graphic imagery, which is horrifying enough (but thankfully never crosses into torture porn). It's also because Starry Eyes sheds a dark light on Hollywood and on human nature itself by exploring the most vile, revolting aspects of both.<br><br>The movie is heavily reliant on atmosphere, and it definitely gives off a David Lynch and Requiem for a Dream vibe throughout. It's watching someone go through a downward spiral, from quitting their job, to abandoning everything and everyone, and the filmmakers don't sugarcoat a thing. It gets genuinely disturbing and hard to watch at times, but what draws you into it in the first place and what really makes you *believe* is the performances. Alex Essoe is absolutely terrifying as Sarah. The supporting cast is surprisingly great too, and it's amazing how quickly we sympathize with Sarah and how we gradually end up sympathizing more for her friends later on. After a while it's like you're not even watching actors - the story comes to life on screen. This is a testament to everything working in harmony: the filmmakers' vision, the actors' devotion to the roles, the eerie retro electronic score, the bleak cinematography. It all comes together to create a powerful, haunting piece of art.<br><br>This movie had potential to be truly groundbreaking. As I said it's brilliantly written, acted, and directed. What threw me a bit was the ending. I won't spoil anything but they take an odd turn in the final act and you'll know it when you see it. It's not even that it's bad - the movie still left me in utter shock. I just know it could've been much more effective had they gone the deeper psychological route, which is teased at for the first three quarters of the film. Regardless, the journey itself is disturbing enough that by the time the ending comes you're already speechless and exhausted from the experience. It's just that little step that could've made it a psychological masterpiece as opposed to a highly effective insight into the darkness of human ambition.<br><br>Starry Eyes disturbed me. It really did. If you like Lynch-esque movies that make you think but also make you feel unnerved then you'll definitely get some chills and thrills from Starry Eyes. These filmmakers have proved enough to cement themselves on any horror fan's radar; even if you aren't into the extreme side of the genre you can appreciate what the filmmakers set out to achieve here. This is a movie that sticks with you after the credits roll. It is a wild ride for its brief runtime and certainly worth a watch for any fan of dark psychological horror.","user":"lnvicta","rank":[92,110]},{"title":"Better Than Expected","rating":8,"date":"12 May 2015","review":"Since it's still on Netflix, everyone who enjoys horror movies should take the time to watch Starry Eyes. It is a deeply unsettling exploration of ambition and just how far down a horrifyingly dark path that ambition takes the protagonist. Of course this is a god awful extreme and wholly impossible example of the dangers of ambition, with a suitably gory and violent climax; it is, after all, a horror movie. It really is a fascinating story though, complete with a cult consisting of Satanic Hollywood producers, the occult, and murder. There is a lovely meta element to the movie, wherein a movie producer talks about how disgusting and pathetic ambition makes people in the filmmaking industry...which serves as a bit of foreshadowing just before everything goes terribly sideways. I noticed that it was still available on Netflix this afternoon and decided that I should recommend it.","user":"Necroambulant","rank":[29,40]},{"title":"I wanted to like it. It wouldn't let me.","rating":4,"date":"5 April 2015","review":"Four stars positive for a fairly innovative score and Argento-esque visuals, plus some pretty solid acting by the lead and one or two supporting actors. Beyond that, I have to admit, I watched the entire thing (resisting the urge to turn it off many times) because I wanted, hoped for, the ending to bring everything together in some redeeming way. Instead, I was disappointed. The movie was difficult to watch all around but not because of horror elements - it's hard, for one thing, to feel invested in a story when you can't empathize with its protagonist - admittedly there are exceptions to that but this isn't one of them. I also felt like some of the plot devices relied on clichéd, negative stereotyping (can't say more without spoilers) and that the end just didn't make sense in any narrative or metaphor driven way. I'm sure there are some who'd argue otherwise, and they are welcome to their opinions, but overall, Starry Eyes was just a huge letdown for me.","user":"hilbertjl","rank":[53,80]}]