[{"title":"Could have been so much more","rating":3,"date":"22 September 2013","review":"I wanted this to be so good. The concept was good and it's a subject that should be explored and played with.<br><br>Why was there an Instagram-ish filter on it? It had a black cloudy filter that made me feel like my eyesight was clouded. Very uncomfortable.<br><br>Acting wasn't very good but some scenes were filmed beautifully. <br><br>I think there was a mistake too. When Mark met Evelyn she said she had some files he could look at if he didn't mind a dirty basement. Then when they were down there, she said \"I'll be downstairs\" as if they were in the attic.<br><br>The effects were super cheesy. The cutting-out static effect they put on things was kind of lame.","user":"kmtackett","rank":[8,8]},{"title":"Not so bad it's good, just bad","rating":1,"date":"19 September 2013","review":"First sign this movie is going to be terrible... two guys go out to an old ruined home in the woods, one guy sees an old lady, the first guy says, why are you freaking out about old ladies? Second guy doesn't point out the fact that she doesn't exist? lol... The writing is just that bad... and that's the very first scene, so I have my trusty popcorn and my kitty cat, but it looks like this one is going to be really bad. <br><br>I love horror films, paranormal films that take place in an asylum so I gave it a shot, I don't mind independent movies, amateur actors, if the story is really good. <br><br>I was interested in the story being told here, but the problems are many.<br><br>The script is not very well written, the scenes are poorly utilized, such as when a guy goes to see archives, he doesn't seem to find anything and the whole scene comes off as worthless, adding no depth or tension or reason to the film.<br><br>Something begins to happen but then just cuts and it's over and no one's that impressed or surprised, which makes no sense. <br><br>Poorly written characters throughout.<br><br>No one has any chemistry, the friendship, the girlfriend? No one has any believable connection or emotion to the relationships they're supposed to be portraying... Laura Gilreath and Aaron Mathias do an alright job with the maddeningly bad script and direction. <br><br>I love when the half brother is giving Andy sh*t about borrowing his boat, and then when we finally see the boat it's a pretty cheap boat with cheap plastic back yard chairs tied together. <br><br>There's some decent story twists that I enjoyed, such as Mary finding him and getting taken back to the hospital and Aaron pursuing, showing you the movie really could have been better if they had just kept the story more human and not tried to be so \"smart\" with the dialog that really hurt the film. <br><br>1/10","user":"jmbwithcats","rank":[15,17]},{"title":"if you can sit through this flick you are ready for the asylum","rating":3,"date":"2 June 2014","review":"I was afraid to start watching it and not for the scary parts if they were involved but for the title. It contains the word Paranormal and of course you are immediately linked to the Paranormal Activity franchise. And when it is written on the sleeve Inspired By True Events then you know you have to be carefully. <br><br>The first 15 minutes you start to know the main leads and it works but of course the activity is already there and it didn't look convincing. It is even done like the original franchise with Day 1 and Day 2 so you also know that it is going to be a slow movie. In the beginning the activity is done by sound. Later on the activity becomes more active in lights going on and off, windy area's, shaky cam shots. You have seen it all before but I kept watching to see more. Then the activity takes place in the camera itself and slowly it did lose my attention. <br><br>The ghost on the rail track was a bit ridiculous. And from there on it's clear that it was a low budget flick, where were the effects? The acting should show the possession but that just doesn't work that way. Here and there we had the fast movement of the possessed girl but after a while the movie fast forwarded too, I pressed the button on the remote. To be honest, the best part was after 65 minutes when Michelle (Laura Gilreath) was walking around in her underwear...and her face changing into a fake Goth, well it wasn't intended to be funny but it was. <br><br>Gore 0/5 Nudity 0/5 Effects 1/5 Story 1,5/5 Comedy 0/5","user":"trashgang","rank":[6,6]}]