[{"title":"If you stick with it, it's well worth it.","rating":7,"date":"24 October 2018","review":"I'm one of those people that came close to switching it off, I found the first half of the film excruciatingly boring, I've never watched a horror thriller before and found myself nodding off, with this I did. Possibly because I didn't quite get what was going on with the story, it wasn't explained in any sort of way, which I found frustrating, but once you become involved as a viewer, which is just over half way through, the film becomes gripping, captivating, and thoroughly enjoyable.<br><br>Very well acted, Adrien Brody is terrific, as is Sam Neill. Some terrific special effects, and good music, which doesn't overtake the film.<br><br>Second watch, and I'll enjoy it all the more.<br><br>The only scenario I can think of for this film, imagine being invited to a party where you don't know anyone, half way through you get to know the guests, have a drink, and engage. This film is the same.","user":"Sleepin_Dragon","rank":[21,22]},{"title":"Tricky","rating":7,"date":"14 December 2015","review":"The movie does play with expectations, but not in a \"wink wink\" way, we know you know or anything like that. It does feed into fears and it is very atmospheric to say the least. The main actors help elevate this into territory it might not have gone with lesser talent (no pun intended of course).<br><br>The story might be simple (if you look back at it), but it's the way they achieved what they set out to do. A thriller/horror/suspense hybrid, that takes you on a ride, without knowing where it will end and how we got there. There are the occasional jump scares and some might feel cheated by them, but it works all in favor of the movie. I'm not going to talk about the story, because you should dive in and find out, what is going on along with the character, peeling away layer after layer ...","user":"kosmasp","rank":[54,74]},{"title":"Adrien Brody nails it again.....a must see....","rating":7,"date":"28 February 2016","review":"When Adrien Brody stars, you know it will be good - you just are not sure HOW good. This movie is REALLY good and a better actor could not have been chosen to play this tortured soul struggling to hold onto his grasp on reality. To not lose his mind, he knows he must delve into his past where 'some memories are so unacceptable, we do whatever we can to keep them buried'- it has every element you want in a thriller. It is utterly haunting, moody, unpredictable, creepy, and emotional. Did I leave anything out? It is a cerebral thriller - not quick-paced - just enough to keep building suspense. And make no mistake - just when you think you have it figured out - you will be wrong.","user":"wildsparrow16","rank":[30,40]}]