[{"title":"I kinda thought it would be a stinker - NOT!","rating":6,"date":"20 August 2016","review":"In my experience when a movie changes its title - it is a sign of bad things to come. so approaching viewing this one, I had no high hopes. Being on the older side of many members here, I admit I didn't really recognize the actors by name - as I started to watch I did know a few. The story line is not new, SLIGHT SPOILER ALERT, when the location changes from the U.S. to where the majority of the movies takes place, it gets better. The setting is beautiful, the plot takes time to get to the 'action', but, it does, and it doesn't stink! I am an easy reviewer, I just like to be entertained, and having no great expectations, this was a very entertaining movie.","user":"kenfromcanada","rank":[33,43]},{"title":"Enjoyed It","rating":6,"date":"19 November 2018","review":"It's good. Remebered watching this alone in the cinema sad it was not received well","user":"RC81","rank":[6,6]},{"title":"Excellent!","rating":9,"date":"24 August 2016","review":"Once again I am shocked at the low 5.3 average score for this movie.<br><br>I'm hoping once people read my review, they will rate this movie appropriately.<br><br>I gave this one a 9. Why? Because you can't compare apples to oranges. What I mean by that is a movie needs to be rated on the investment/production value as well as entertainment.<br><br>Let me explain; Let's take Barber Shop 2 as an example (that has a 5.9 average). It has how many top rated actors (how many DON'T you know?) as well as a 20 million budget (which went where exactly?). Yet it was boring, biased, stupid, NOT funny etc...<br><br>Now take this movie... I didn't recognize any actors, budget was clearly low as it wasn't even disclosed, yet the story line was great, acting was good, the scenery was amazing, and I was pleasantly entertained!<br><br>If a movie has a high budget with A-list actors and top directors/producers and is terrible, it deserves a low score. <br><br>But going into a movie that is a B type movie with no name actors (of which the acting was not bad at all) and is made well and is entertaining, it needs to be rated appropriately! <br><br>So hopefully everyone else who sees this enjoys it as much as I did and rates it accordingly.","user":"TheTopDawgCritic","rank":[46,79]}]