[{"title":"Ploey is a young bird, who encounters a lot of drama in his first year.","rating":6,"date":"25 July 2018","review":"Ploey is a young bird, who encounters a lot of drama in his first year. This sentence in fact covers the entire movie. Totally unnecessary if he just did an effort to fly. \nPloey loses his father, and after an attack by a cat the flock leaves without him, assuming he did not survive. He wants to see his girlfriend again (and never mentions his mother), and tries to reach Paradise Valley to survive the Winter until the flock returns in Spring. All this time he refuses to fly... To get to Paradise Valley, he gets help from Giron. \nThe kids truly enjoyed the movie, but it was quite a predictable story and, probably because we are spoiled by Hollywood multi-million dollar animated movies, the animation was not that good. Overall not a bad movie.","user":"ivopooters","rank":[20,22]},{"title":"Nice cartoon, but his can spoil the shortcomings!","rating":7,"date":"1 May 2018","review":"The main drawback of the cartoon as a whole is its pattern: the protagonist, according to the laws of the genre, has a kind heart; an antagonist because evil; the one character who lost his family because of the antagonist, and wants to settle accounts with him once and for all. The plot itself is a bit like the Soviet cartoon \"Seraya sheyka\". Another drawback is the repeated demonstration of the termin of \"death\", especially in the children's cartoon.\nI myself am confused by the graphics, it sometimes looks crooked and sloppy, and weak, unlike other similar cartoons about birds.\nOne character a ptarmigan Giron looks like a yeti-bird and looks as a permanently drunk middle-aged uncle.\nIn general, I recommend this cartoon to regret and forgive.","user":"soto350","rank":[29,34]},{"title":"Lots to love, Lots to improve.","rating":7,"date":"24 July 2019","review":"I did not look for a rating for this children's movie, but I assume it was supposed to be T, and not PG, or it could pass for PG 16+. I did like this movie as a whole. The voice acting was incredible. The landscapes were breath-taking. The environment was flawless the whole time. The detailing in fur and feather was fantastic, and you could see every individual feather crease. The shaders and bump maps of the local scenes were great. Dialogues were actually follow-able and understandable, nothing too complex!\nBut on the downside, as far as I am concerned, was the plotline and/or theme and or/atmosphere together (I am not sure which one to call it), the 3D models' bases, and the animation.\nWhen it came to the plotline or themes portrayed, I found myself noticing re-occurring attempt to pull the viewer's heart strings, with the deaths and close-call-deaths of many characters, at least 3-5 characters. It disturbed me a lot as the viewer, and it almost made me immune to watching another near-death or assumed-death because there were so many plays on it. I would certainly not want a child watching this and having nightmares about how many deaths they seen in one sitting. Also, how oddly, overly  charged the two young birds were at such a young age.\nNow when it comes to 3D models, I personally found the copy-paste mice off-putting, the fox was off-putting, the cat was off-putting, the models were just, not matching the atmosphere that well with how beautiful the backgrounds were, and then they came in looking like 3D scribble lines compared to the beauty of the environment. Some of the models, such as the mice, and the protagonist, did not properly reflect the lighting the majority of the time when it was dark. Their details were beautiful though just not what was underneath.\nAs for animation, I noticed a lot of points to be improved. Any fight scene that I seen, went on for way longer than I think would have been alright, especially the end. Dancing towards the end was actually looped and I could tell, also along those lines I could see a character model clipping feathers through their body as a glitch in the animation. And sometimes I noticed the characters emotions portrayed, sometimes did not match the intensity in which it deserved, Al ot of the faces were very stiff, but this is where the good voice actors came in handy! They did a good job there!<br><br>Sorry, that was a lot, but I covered everything I could!","user":"angelii-68816","rank":[12,13]}]