[{"title":"Inspiring","rating":8,"date":"13 March 2014","review":"\"Life of a King\" is a good movie with a great story, good actors and an excellent Cuba Gooding Jr. as main character. It's all about morals, ethics and the meaning of life and constantly reminds us that we are responsible for our own actions. <br><br>Sure we've seen the same kind of movie before. \"Dangerous Minds\" for example to name just one. However, it does not get old and keeps you entertained the whole time. There was not one single boring moment. The chess \"theme\" I really liked. For once it's not football! And even as an experienced chess-player myself I can say that everything is totally legit and realistic.<br><br>Nothing more to say. Watch it.","user":"JayDoubleU84","rank":[12,13]},{"title":"Different enough from the previous \"helping inner city kids\" movies to make it interesting and worth seeing. Never went cheesy.","rating":7,"date":"8 February 2014","review":"\"This is a king. This is your life. One mistake and it can be taken away.\" Eugene Brown (Gooding Jr.) is an ex-felon who is struggling to find a job and relate to his kids. After finding a job as a high school janitor he is asked to watch the detention kids one day until they can find a replacement. When he brings up the topic of chess he begins to change the lives of the \"troubled kids\" forever. I love movies based on true stories, but I was worried about seeing this going in. One one hand a true story with Cuba Gooding Jr, that is good. On the other hand though I thought how many times can they remake Lean On Me? After movies like that one and Dangerous Minds, Freedom Writers, Fame, etc... I wondered how different can this one be. While I have to admit it wasn't 100% different it was very very good and much much better then I was expecting. The best part about this movie is that it stayed just a step or two away from being way to cheesy to be enjoyed but it did a good job of changing things just enough to keep it feeling real while keeping the emotion that it needed. Different enough from the previous \"helping inner city kids\" movies to make it interesting and worth seeing. Overall, very good and never took the over-the-top cheesy way out that so many of these types of movies do. That is a good thing and because of that I highly recommend the movie. I give this an A-.","user":"cosmo_tiger","rank":[18,21]},{"title":"Excellent","rating":10,"date":"20 January 2014","review":"There are not many \"feel good\" movies out there today, but this one really counts among those that fill this category. Cuba Gooding has long been one of my favourite actors. He possesses a wide range of acting abilities as evidenced by \"Snow Dogs\" on one hand with his somewhat bland comedic style to \"Gifted Hands\" wherein he brings to the screen a dramatic style that is uniquely his own. It is this latter gift that he portrays in this feature as he moves from an ex-con to a giver that gives back to the community and its young confused residents, a new hope that most had never known. He portrays the real life story of Eugene Brown, a man who'd known nothing but crime for most of his life, but once he was through serving many years for armed robbery, he dedicated his life to helping other young men to see that there was more to life than crime. It's a good story made better by the fact that it was based on real life.","user":"maxaira","rank":[24,32]}]