[{"title":"Never thought I would care so much for a man and his pig","rating":8,"date":"14 January 2017","review":"A pretty tragic story actually. This is the first Diego Luna directed film I've seen and I think he has some interesting things to say. Especially about the subject on how animals are treated and cared for.<br><br>I've always liked Danny Glover as an actor and he was really good in this one. The care he has for his best friend, the pig Howard, was very nice and heartfelt. That is what really made the movie. The fact that he wants Howard to have a nice home was a sweet gesture and I really cared for the bond they had.<br><br>The locations are good and the plot is simple and straightforward. It's a road movie too and I really like that genre. There's something very genuine and relate-able about them. The movie surprised me and I never thought I would care so much for a man and his pig on a road trip. I didn't want anything bad to happen to them.","user":"paulijcalderon","rank":[9,17]},{"title":"Mr. Bojangles","rating":4,"date":"2 September 2017","review":"This is not my most memorable Danny Glover film. Mr. Eubanks (Glover) is a disorganized farmer who likes his drink. He is getting ready to lose his farm and opts to sell his prized pig to a relative...in Mexico. Unfortunately he has named his prized pig and doesn't approve of \"Howie's\" living conditions. His daughter (Maya Rudolph) catches up with him in Mexico and bonds with her father through finding \"Howie\" a suitable home....you know like on a tropical island somewhere.<br><br>The acting was good, I just thought the story kinda stunk...watching an old dying man driving a pig around Mexico while drinking. Oh yea, he does bond with his daughter.<br><br>Guide: No swearing, sex, or nudity","user":"nogodnomasters","rank":[6,11]},{"title":"Hog roadtrip...","rating":5,"date":"16 May 2017","review":"When I found \"Mr. Pig\" I can't say that it was a movie that I knew anything about. I picked it up solely because I saw Danny Glover on the cover, then I read the synopsis and thought that it did have the potential to be an interesting movie.<br><br>Now, I will say that while the movie is entertaining, it was a bit too mundane and generic for my liking. Sure, I was entertained well enough by what the movie turned out to be, however I had just expected somewhat more from it at the hands of director Diego Luna.<br><br>The story, briefly summarized, is about an aging man named Howard, whose Health is declining, who takes to the road for Mexico with his beloved pig Howard.<br><br>Of course there is more to the story that just that, because it also deals with family connections and bonds, and the attachment that stands between man and animal.<br><br>\"Mr. Pig\" did have some good acting performances, and Danny Glover was quite enjoyable in the role of Ambrose. It was also good to see Maya Rudolph in a role that stepped out of the usual comedy characters that she portrays.<br><br>The characters in the movie were quite well-defined and well-rounded, with lots of depth and characteristics to them. And that was a good Foundation for the movie, especially when much of the movie was based on a select few characters.<br><br>However, \"Mr. Pig\" turned out to be a mediocre movie for me. It had some entertaining enough moments, but the overall picture was just one of mediocrity. \"Mr. Pig\" is not the type of movie that seems to sustain multiple viewings, because it just didn't have that particular quality to it. \"Mr. Pig\" is entertaining enough in its own rights and for what it turned out to be, just don't set your expectations too high though.","user":"paul_haakonsen","rank":[4,7]}]