[{"title":"Good episode of the Twilight Zone","rating":7,"date":"28 August 2014","review":"I rarely watch a romantic comedy, and I wouldn't have watched this one based on the IMDb plot description, so thanks to the then 15 reviews that changed my mind. That was a very pleasant hour and a half.<br><br>I like to be told a story, and that's what the movie does. This story is completely centred around its characters, the young couple next door, portrayed with simplicity and in a way that lets us relate and empathise. They also act and react like sane and sensible people, which is so uncommon nowadays that it's worth mentioning.<br><br>I'll sum it up as both intriguing and amusing, a double source of entertainment. One way to achieve that is to confuse the viewer as much as the protagonists. A very right thing to do, and done in the right proportion in my opinion. We can get confused for a minute, yet we always understand what's happening. There is also a constant undertone of drama. The ending alone can be felt very differently based on our mood of the moment.<br><br>Rich writing and solid delivery can satisfy you on several levels. A theatre screen is not necessary though; renting it is fine if you're on a budget.","user":"voyou-703-655350","rank":[73,91]},{"title":"From Malcolm McDowell's son...rom com grows a brain","rating":10,"date":"24 August 2014","review":"It's hard to relay the joy I felt watching The One I Love, Charlie McDowell's first full-length feature. It's the kind of film you'll remember for a long time because it breaks so many boundaries. It's the kind of film Spike Jonze might come up with, minus some of the academic pretensions he sometimes clings to.<br><br>The trailer for The One I Love is almost perfect. It doesn't spoil the premise of the film, and neither will I.<br><br>Mark Duplass (who also produced along with his bro, of course) and Elizabeth Moss are excellently cast as Ethan and Sophie, two not-so-newlyweds who are encountering all too typical problems \"relating.\"<br><br>At the suggestion of their therapist (Ted Danson, in a just-right cameo) they spend a weekend at a rather large rental house, unsuspecting of the lengths their counselor is willing to go to in order to motivate them to \"connect.\" <br><br>The One I Love is a high-wire act by anyone's standards. The script is especially brilliant, but it doesn't spit its brilliance in your face constantly and then ask for your approval with laughter or the occasional tear. Instead, it dabbles in elements of Sci-Fi and Fantasy but doesn't let the main characters (or the audience) off easily by subjugating the human story to questions of logistics. In other words, this isn't a movie for the compulsively left-brained and anal. The performances and plot are engaging enough to make you accept this often absurd but always engaging film for what it is.<br><br>It takes guts to break the rules, even more talent to make it work. With The One I Love, Charlie McDowell seems destined to reprove the adage that talent runs in the family.","user":"bob_meg","rank":[66,84]},{"title":"A Unique and Superbly Executed Relationship Study.","rating":9,"date":"25 September 2014","review":"Pros: - Two incredible central performances from Mark Duplass and Elisabeth Moss. Both of them overcame the challenge of having to play two very similar but crucially different characters each.<br><br><ul><li>A refreshingly new study of relationships. Themes such as the idea that both a husband and wife are different people during the courting period/start of the marriage than they are years into the marriage. Also, the theme that everyone behaves differently depending on who they are with and that flaws in a relationship can be a good thing and that a perfect relationship isn't necessarily the happiest one.</li></ul><br><br><ul><li>The tonal balance between drama and comedy is admirably achieved by first time director Charlie McDowell.</li></ul><br><br><ul><li>Writer Justin Lader's script also contributes this and is both very real and refreshingly, playfully profane at times. </li></ul><br><br>-The existing music and originally composed score both do an equally admirable job in achieving this tonal balance.<br><br>-The subtle aesthetic differences between the clothing and accessories of the four main characters is cleverly used to avoid confusing the viewer and to accentuate the similar but uniquely different personalities of the four main characters.<br><br>-The almost photobook perfect setting is the ideal staging ground for the dark and dramatic events that unfold later in the movie.<br><br>-Ted Danson has a short but sweet cameo. <br><br>Cons: -The movie is caught somewhere between fully explaining the science fiction elements of the story and not explaining them at all. The movie would've worked perfectly fine without any explanation of the phenomena but once the scene with the laptop popped up, it should've fully explained things or otherwise should've been cut.<br><br>-Sometimes the interactions between the characters and issues touched upon got to be annoyingly familiar and repetitive.","user":"readybrek82","rank":[26,33]}]