[{"title":"Lot of pretenses but going nowhere. No plot, no takeaway message, no conclusion and no morale, other than that our way of life may need re-evaluation","rating":2,"date":"19 October 2014","review":"I saw this film at the Film Fest Ghent 2014, where it was part of the section Global Cinema. To state my lack of appreciation upfront: I cannot find anything positive in this movie. The outset is not clear, and does not become clearer later on. Only those who have read the synopsis before, have a bit of a clue what it is all about. The evening games and their underlying rules remain unclear as well. Even more unclear is the purpose of the (home made) coffin that is set alight, a ritual that we see in the beginning with a repeat later on. Only one scene was interesting, viz. when a 5th person arrived (an ex-boyfriend). Much to his regret his ex-partner announced that she was much happier than ever before. Alas, the potential drama faltered and he left shortly after.<br><br>I only understand half of the title. The word Hide seems a reference to being away from \"normal\" civilization. Nevertheless, I'm surprised about the amount of \"bourgeois\" stuff they obviously had available in that remote cottage, for example given the Christmas related attributes which they showed in much more variety than I ever had. Further, the word Seek is completely lost on me, be it that it may refer to finding a new future in living your life. This second part of the title promises that there is a message, a conclusion or even a morale, but I found neither.<br><br>The 4 actors (plus 1 for a short time) did their best, and worked believable through their respective roles. Neither got the opportunity to reveal much of their background and expectations. And neither is there any drama on the table, except (see above) in one isolated case (which failed). They cannot show their strengths on those fields, but I don't think that is their fault altogether. In the final Q&amp;A the question was raised how much of the action was improvised and what was rehearsed. Apart from that it was a bit of both, I did not hear a clear answer. So what is left to admire?? I observe only pretenses that this film will provoke thoughts about your own life as it is (but it failed miserably for me). Possibly I'm not the appropriate target group??","user":"JvH48","rank":[23,28]},{"title":"Four Go Mad in the Country in this Indie Relationship Drama","rating":4,"date":"12 November 2016","review":"The synopsis of this film is that four vulnerable young adults flee London to start an unconventional life in the country and find their very own Utopia. They have not all met before either so this has all the hallmarks of being interesting. Now I can't say any more than that without revealing parts of the plot – needless to say this has a few issues which I will deal with next – but please do not read if you do not want any reveals. <br><br>Plot Spoilers ahead<br><br>The film explores how they decide to explore this alternative lifestyle and this is basically by having acting and improv workshops as a prelude to a free for all in the bedrooms. They have rules too to underscore that there, effectively, will be no rules. They are also dyed in the wool upper middle class as nothing practical is covered at all. The food seems to magically appear – but they do have a rota for the terribly leaden part of life that is the cooking.<br><br>There is a spark of interest when an outsider comes a calling and the apple cart looks like it may be upset, but this is a 'bridge' for a tune that is basically all more of the same.<br><br>Now this has received mixed critics reviews – some are very favourable indeed but user reviews tend to be less applauding and I am leaning towards those. There is a lot of nudity here too and simulated sex as well as 'self pleasuring'. If that is meant to be indicative of Utopia – all well and good – but cinematically and even artistically it is as new an idea as having a 'twist' in a thriller – unless of course you are doing 'art house porn'. And we all know that means it is just porn with more subtle lighting and untidy pubic hair.<br><br>So all in all a bit of a miss – I did watch the whole thing but was left non plussed by the experience. I could still see a lot to merit here – cinematography for example – and the acting was very good indeed. However, as an ensemble piece it barely passes muster so only go for it if you really are a massive fan of the auteur art house scene and a good bottle of wine to aid your viewing digestion.","user":"t-dooley-69-386916","rank":[5,5]},{"title":"A profound waste of time","rating":1,"date":"30 July 2017","review":"OK, I tried mightily to see the \"artsy\" aspect of this film. However with a lack of (1) a story line, (2) character development, (3) a plot, along with (4) insipid cinematography, there really wasn't much of anything going for it. The setting was 'meh' and the actors' lack of attractiveness (which might have made the supposed concept more plausible) also contributed to the feeling that I was being ripped off by watching.The idea of polyamorous relationships or even the nudity on display did not turn me off. I was just left with nothing but questions, not the least of which was, \"Why was I wasting my time watching this?\" The 'idea' behind the movie was perhaps revolutionary but it didn't seem in the least plausible. No wonder they had trouble finding backers as this wasn't more than a whisper of a film. Just hope the actors kept their day jobs!","user":"beiseckers","rank":[7,8]}]