[{"title":"As real in the rear as it gets","rating":9,"date":"18 October 2017","review":"I took my mother to see this film so that she may understand through a movie what I could not share with her verbally but what she has witnessed physically with me. This is not a war movie but a film of what war does to you and how it affects you after you are no longer in physical war but your mind stays in mental war and no one understands ( EMPATHY) except those there with you. After 3 combat tours I identified with things that went over a lot of peoples heads but the movie moved me and Dream Works did a spot on job with what we with PTS go through and why its so hard to deal with and maybe if everyone saw this film they could see the inner turmoil a soldier, a marine, a airman, and a seaman goes through after experiencing physical and mental trauma. Thank You for your service hits on all aspects from the ptsd sufferer to the spouses and all around them. this is a must see to spread compassion to all who served.","user":"dmacws-01336","rank":[127,162]},{"title":"A wife of a Service member","rating":10,"date":"12 May 2019","review":"This movie is a cold true reality for the family's that struggle with PTSD from combat. This is exactly how it is. This movie is the first in a long time that shows the truth. The opening scenes, are exactly what it is like. And this is a hard movie to watch for those who have served and the family's that struggle with the effects of war on there loved ones. For those who never served, You have no place to judge this movie so harsh.","user":"vharter","rank":[11,12]},{"title":"Good film, great message, way too slow and dragged out to be a winner for me","rating":7,"date":"20 January 2018","review":"The acting, writing, directing and cinematography were all on point for this film but it fell short for me as its 1hr 49min length was way too long and made the film seem boring at times. Some scenes where pointlessly dragged out and should have been edited shorter. This film would of held my attention and still got the point across had it been cut down to 1:20. Not sure if the blame belongs to the director, editor or producers. Still a decent movie that sends a great message. 7/10 from me","user":"TheTopDawgCritic","rank":[20,29]}]