[{"title":"Scare-free cash grab that killed the possibility of a great franchise.","rating":2,"date":"7 October 2016","review":"Sinister was one of the scariest horror movies of the past decade for me. Was it perfect? Absolutely not, but it got the basics of the genre right. The atmosphere was brooding, the imagery was disturbing, the pacing was deliberately slow, the acting was convincing, the suspense was constantly lingering, the scares were genuine, and you were on the same page as the protagonist the entire time. Sinister 2 cheapens everything that made the first film effective. Chilling atmosphere? Gone. Interesting characters? Nope. Good scares? Not a one. <br><br>Sinister 2 spoon-feeds everything to you in the clunkiest, most annoying way possible. For starters, this movie is a prime example of why I generally hate kid actors. A good chunk of the story revolves around these two brothers and how the ghost children are leading them into the Boogey-world or whatever it's called, and their acting is horrendous. Some scenes are just the kids talking back and forth and it's painful to sit through. Also, the creepy 8mm tapes are blatantly shoehorned into this movie because, hey, they worked in the first one so we gotta throw them in here. In the first Sinister, Ellison had to watch these tapes because it was part of his job. He was investigating the murders and was forced to sit through these horrific tapes to find clues to help him (and the audience) learn about what was happening. Here, the evil kids lure one of the human kids into the basement and say, \"Hey, watch this! Or else...\" So the kid watches the tapes, and they serve absolutely no purpose other than to show gratuitous violence for the sake of having gratuitous violence. None of it is scary or disturbing on a personal level because it's such a sloppy plot device that breaks up the momentum of the main story.<br><br>The main story isn't good either. Their mother is hiding out from her abusive ex-husband, another cheap plot device that adds nothing to the story other than to have a detestable character to root against. He shows up to make everyone agitated and mad, literally, that's his sole contribution to the movie. The deputy from the first Sinister is the only recurring character, and he's likable enough. In fact, the chemistry between the deputy and the mother is the best part of the movie. If they had developed their characters more and focused on them investigating the mystery behind these tapes, it could have been a serviceable sequel. But no, the kids take center stage here and make it excruciatingly hard to care about anything going on. <br><br>Mr. Boogie also takes center stage, dressed to the nines (like any great horror movie villain), popping up here and there with his long hair and suit looking like Michael Jackson. It becomes a joke after a while, and not a funny one. Jump scares are scattered throughout like a minefield and you're just waiting for them to go off. Nothing in this movie works. It's aggravating to know this is the sequel to Sinister because it ruins the possibility of a franchise. Sinister 2 should have never been made, and if you haven't seen it, then pretend it doesn't exist. Sinister stands on its own, while Sinister 2 lays in the pile of pointless, unwanted, cash grab horror sequels that deserve to be erased from human history.","user":"lnvicta","rank":[57,62]},{"title":"I wanted to like it...","rating":2,"date":"11 October 2015","review":"Being a huge fan of the first Sinister, I was beyond excited for this movie. After seeing the trailer, it looked like they were going to go over the top with this one and make it intense. I really wanted that to happen. I really wanted this to be even better than the first.<br><br>I didn't get what I wanted.<br><br>This is my first review, so I'll keep it short. Everything that I was hoping this film would have, wasn't there. Not really a spoiler, but I felt like it tried to be more of a family drama movie with some supernatural stuff going on in the background. There were non-genuine jump-scares and the acting was less than average. Even with the glaringly bad plot, I sat there trying to look at some positives. The positives are that some scares got me. I'm jumpy even when I know jump-scares are coming, so they got me on that. But when the movie ended, I couldn't help but reflect on how bad the overall story was and how stupid some of the scares were. I won't spoil any of them, but let's just say that you'll probably be wondering how the scares were \"genuine\" when you really put it into perspective.<br><br>I give this movie a 5/10. Mostly because I just really, really wanted to like it. I kept searching for any redeeming qualities throughout the movie and they are slim to none. I recommend watching if you're bored one night and you've seen just about all the horror movies out there. It'll pass the time, but it's just a plain jump-scare fest with a nonsensical story. Don't go in having high expectations like I did.","user":"lukenutt5","rank":[56,66]},{"title":"So and so","rating":5,"date":"15 December 2015","review":"Sinister 2 isn't as bad as some make it out to be. It's not a good movie either. Like most sequels, it struggles with the novelty gone and never manages to succeed in new ways or areas. It is a mediocre and forgettable film, just as the name of it's main character.<br><br>I very much enjoyed the first movie. While it's not without its faults - I actually don't think it was that scary with too heavy reliance and textbook-use of \"creepy\" sounds and the children were too cliché for my taste; it was a very absorbing movie, well directed with excellent music, a good sense for mystery, mood, pace, a solid twist and awesome ending. It cleverly managed to outbalance it's shortcomings.<br><br>Sinister 2 starts off promising enough - at first it looks and feels just as it is supposed to, the snuff-flicks are still here with their grainy look and new, obscure kills complimented by creepy music. We find out what has happened after the first movie and continue the investigations surrounding the murder cases involving mysterious events, now with a new family (with twins - which could've provided an interesting twist to the story) and more involvement of the deputy from the prequel which at this point pretty much has inherited the knowledge of the previous main character. Everything you could possibly want in a sequel to Sinister is here, but sadly it is meaningless as they never manage to do something as interesting or memorable with it.<br><br>The death-flicks are useless this time as they don't provide anything to resolve the puzzle or any kind of new information. Even worse: the pace of them is pretty much straight to the point giving them a very rushed, uninspired and uninvolved feeling - not enough build-up and no intensity. As opposed to some in the first movie, none of them made me wonder or left me amazed how they were filmed. Instead some of them involve CGI rats and crocodiles - don't even ask. Even the characters argue to watch them all through in one sitting almost as if just to be done with.<br><br>The movie also suffers from too much exposition provided by the ghost children. The family, the deputy and Bughuul I found to be decent, but also problematic. While the deputy continues to be the same, likable character, you'll never fear for him because he seems to be too safe from all of it. The character of the mother is another one we should fear for, but oddly enough she is almost entirely absent in any of the horror events; her struggle is only on the family-issue side which doesn't quite sit right with this kind of movie and is more or less a subplot which lacks emotional depth, partially due to the father being so over the top. There is just overall little sense of danger in this movie which is its biggest fault.<br><br>To it's credit it does try to provide new things while being true to the first movie. It has it's moments where it shows potential and ideas, but never quite manages to expand on it in suspenseful and creative ways. It does however bother to explain some things surrounding the history and what if's, just about in the right amount without ruining too much, which is always nice. It also has its fair share of plot holes and faulty logic, just like the previous one did (some are even still the same), but I found it to be forgivable as it's not something I should be too concerned about with a movie involving supernatural events.<br><br>It's not exactly trash. I wasn't really bored watching it, but it also didn't provide enough suspense either, which is something it definitely should have. With a third Sinister movie seemingly sure to be made it'll be interesting to see where he series is being headed and if it'll reach cult status as any other popular horror franchise. The first one has potential to become a classic, this one is a much weaker entry which makes me wonder how they will handle the next one. Sinister 2 had potential and could have used more polish in almost every aspect. Hopefully the makers will learn from it and allow them more time to come up with good material.","user":"grintemcstinger","rank":[27,31]}]