[{"title":"Australia's Best Film of 2017!","rating":9,"date":"24 August 2017","review":"Ali's Wedding is a film of many gifts. It's funny, heartfelt, and not quite what you'd expect from Aussie cinema. It's an Islamic focused film that is an honest look at the pocket of communities in Melbourne. And on top of that, this is all a true story, focusing on Osama Sami's struggle at Melbourne University going through an identity crisis.<br><br>For such a specific cultural play-set of story, Ali's Wedding shows the good and welcoming side of the Islamic religion while mocking aspects of family life, Muslim or not. Family's a tricky thing to portray in these comedies without being overtly stereotypical or offensive given a somewhat alien culture within Western society. There's grounded Islam and funny Islam in this; it's an open-minded film that utilizes its heritage to explore terrain unseen in Aussie cinema. It's a cultural milestone and could prove to be an international cult classic in the 21st Century.<br><br>I highly recommend this film. Even if you're an Aussie who's not into Aussie-cinema, give this one a shot because it is a film with international appeal and entertainment. 9/10.","user":"Johnny-the-Film-Sentinel-2187","rank":[39,51]},{"title":"Sweet movie, Romantic and intelligent, always nice to know true love wins in the end","rating":8,"date":"10 June 2018","review":"Saw this movie on Netflix and chose to watch it on a lazy Sunday <br><br>Characters were very relatable and fell in love with the fathers teachable stories. Could relate to the expectation to conform(for the main character), in a religious sense. Loved the lead character and felt he did a great job showing his struggle to please parents with their expectations and finding what he in his heart wanted to do. Even if his timing was bad and his execution was suspect. Loved that the lead female character smart strong woman, who had a mind of her own and not someone who is just going to go along with the program she had her own wants and needs and was not willing to sacrifice them to make a man happy or to make him fall for her- very refreshing <br><br>If you are looking for a lighthearted romantic comedy try this movie! You will be happy you did.","user":"christner4682","rank":[13,15]},{"title":"Thoroughly entertaining movie","rating":8,"date":"27 May 2018","review":"I really enjoyed All's Wedding. It's funny, poignant and although it's about Arab and Muslim culture, it really transcends culture to illuminate truths about us all.\nI especially like that it pokes gentle fun at Arab culture but simultaneously pokes gentle fun at the stereotypes so many of us carry about immigrants, and especially Middle Eastern immigrants.\nThis movie, aside from easily standing on its own two feet as entertainment, is timely and makes a contribution to our multicultural society, through understanding.\nKudos to all involved.","user":"aelement","rank":[20,25]}]