[{"title":"Quirky and endearing deadpan humor.","rating":7,"date":"12 May 2015","review":"Kristen Wiig had already won me over with Bridesmaids and this is just further proof that she has the comedic chops to carry an entire movie. It revolves around her character Alice Klieg, who was taking meds for her Borderline Personality Disorder before she won the lottery and subsequently ditched her psychiatrist and used the money to make her own talk show. She's a die-hard fan of Oprah so her show is basically Oprah except there are no guests or anything. It's all about her. Hence, the title of the show (and movie) \"Welcome to Me\". <br><br>The comedy in this movie is extremely deadpan. If you're not a fan of that style, then you will not like this movie. It's like the awkward humor of Bridesmaids mixed with the underlying seriousness of Love &amp; Other Drugs, and the usual quirky Wiig mannerisms that make her such a likable and charming lead. There are sad moments in the movie, there are laugh-out-loud funny moments as well, most if not all of which come from Wiig and her drab interactions with other people. Alice is completely in her own world - she acts almost sociopathic towards other humans. She's very crass and has no filters with what she says making for some extremely uncomfortable and hilarious situations. But it's obvious that she has good intentions and a good heart, which makes her great as a sympathetic lead.<br><br>The supporting cast are all great. I can't single out every one but I will say that this is James Marsden's best role in a while. He plays a network executive who picks up the talk show, and he has some good material to work with this time. It shows the more dramatic side of his acting chops instead of being a cardboard cutout romantic lead like he was in crap like The Best of Me and Walk of Shame. The whole cast is brilliant really, with the obvious highlight being Kristen Wiig absolutely embodying this character to a tee. It's the performance of her career so far without a doubt.<br><br>The only real complaint I have is that the tone of the movie isn't very consistent. It's not even due to the subject matter, because Love &amp; Other Drugs and 50/50 also dealt with both disease and comedy and found a perfect balance between them. Welcome to Me just feels clunky at times, pacing wise, and it makes for a few dull spots here and there.<br><br>Again, if you're not a fan of deadpan, dry, sarcastic humor then this movie is not for you. However it is a wonderful dramedy that makes you think, laugh, and maybe even appreciate life just a little more.","user":"lnvicta","rank":[84,96]},{"title":"my sister has borderline.","rating":10,"date":"27 May 2015","review":"I cried the whole movie. Happy happy enlightening tears. I felt like I was watching my sister on screen. It felt like one big old metaphor being in the audience, as I feel kind of like an audience member of my own family.<br><br>My sister who has BDP is the strongest person I know. This disorder is a rough one and those who have it are true warriors, however as a result of my sister's disorder, I have been neglected by my family my whole life. It took me a really long time to fully realize this, but now that I do I am finally starting to find self worth. <br><br>This movie not only captures what it's like to have BDP, but whats it's like to close to someone with BDP. Seeing Alice's relationship with Gina hit me really hard. Gina is so strong and I hope I can be like her once I find more confidence in myself. Seeing her stand up for herself is something I hope I can one day do. <br><br>The fact that someone out there decided to add some humor to such a hidden, stigmatized, mental illness, really truly brings light to the my broken heart. I am so so so so so so thankful for this movie. <br><br>Bravo.","user":"ld-31974","rank":[78,96]},{"title":"Interesting but not entirely satisfying","rating":7,"date":"14 February 2017","review":"Welcome to Me is a distinctly odd movie about a woman with a boderline personality disorder diagnosis and millions of dollars in lottery winnings who decides to have a vanity TV show all about her. It's an interesting idea, and it kept my attention, but I feel it wasn't quite the movie it might have been.<br><br>First off I'd like to talk about borderlines, because I've known a couple. Googling around I've found a few articles describing this movie as either a good or bad portrayal of BPD. Since BPD simply means you exhibit a large number of traits from a list (impulsivity, self-harm, etc.), Alice is acceptable as a borderline. And since being borderline can exist with other conditions, like depression or narcissism, you can't really complain about less typical borderline behavior.<br><br>That being said, Alice doesn't seem like borderlines I've known, and lacks some commonly known BPD qualities. For example, borderlines are often very good at feigning normalcy. I once saw a BPD friend, ranting and raving after sneaking out of a psyche ward and trying to kill herself, instantly become calm and rational when the cops came to check on her. Many psychiatrists don't like working with borderlines because they can feel tricked when that patient convinces their doctor that they're fine now right before a suicide attempt. <br><br>Alice, on the other hand, is just purely odd. And her oddness seems to come entirely from her mental illness. It is as though Kristen Wiig was so concerned with getting the symptoms right that she never thought about who Alice would be without her mental illness. But in truth, people with mental illnesses have traits that have nothing to do with being mentally ill (although some psychiatrists do try to fit everything about their patients into their diagnosis).<br><br>Because of this, Alice is an interesting character but not a really compelling one. <br><br>Meanwhile, the intriguing premise never quite gels. Is the movie a satire of celebrity and our fascination with trashy talk shows? Is it an attempt to portray mental illness? Is it an attempt to get laughs out of mental illness? <br><br>I never really felt this movie had a vision, or a point of view. Like the main character, the story feels like it's a bunch of ideas stuck together rather than a cohesive drama.<br><br>While the movie feels a little undercooked, I did enjoy it. Wiig may seem more like a mildly autistic narcissist than a borderline, and the story may feel unsubstantial, but it is amusing to watch Alice create her entirely peculiar show and get into weird dietary fixations. The movie may not make a coherent whole, but the pieces are pretty good in themselves.","user":"cherold","rank":[15,16]}]