[{"title":"Mainstream comedy done right","rating":8,"date":"22 February 2018","review":"While unlikely to ever be regarded as a classic side-splittingly hilarious comedy kingpin, Game Night is a refreshing and original mainstream experience, which is far and away the best high-profile Hollywood comedy to come our way in sometime. <br><br>Directed by Horrible Bosses writing duo and Vacation director's John Francis Daley and Jonathan Goldstein, Game Night takes the one-time nerd only board game night to the big-time as we find ourselves a part of a games night with a difference as Jason Bateman and Rachel McAdam's game loving couple Max and Annie and their collection of friends find themselves trying to rescue Max's successful brother Brooks (played brilliantly against type by Kyle Chandler) from a real-life hostage situation. <br><br>It's a high concept central idea and one that works thanks to Daley and Goldstein's assured and often imaginatively constructed direction and the ability for the film to both not take itself too seriously or not playing to the lowest common denominators. <br><br>It feels like many moons since a comedy of this ilk wasn't filled with unnecessary profanities, sex jokes and loud-mouthed side characters but thankfully Game Night largely avoids these comedic pitfalls and just focuses itself on telling a genuinely good story with a large collection of jokes that work on their own merits. <br><br>It's great to see Daley and Goldstein advance from their Horrible Bosses writing breakthrough and the relative misfire of their updating of the Vacation series as Game Night is without question the most assuredly filmed Hollywood comedy in sometime.<br><br>David Fincher himself would be proud as the duo give the film a visual flair and pizazz not often found in such genre films, from the way in which they shoot some establishing shots like a real-life board game or an eye-popping keeping's off sequence in a glamorous house, Game Night is filled with visual gems that when combined with Drive and Neon Demon composer Cliff Martinez's score, create a memorable mood and setting. <br><br>Coinciding with Daley and Goldstein's wins is the work of the films cast. Jason Bateman is as Jason Batemany as you'd expect but surrounded by the likes of Rachel McAdams (who looks like she's never had this much fun) and a downright hilarious Jesse Plemon's as Max and Annie's super awkward and potentially serial-killer like neighbour Gary, the whole cast elevate each other's work to a level that makes you hope this isn't the last game night we will be spending with this colourful bunch. <br><br>Final Say - <br><br>Like any good games night, Daley and Goldstein's film provides a lot of fun, laughs and genuinely memorable times. Game Night is Hollywood comedy filmmaking done right and by avoiding the problems that have faced its recent cohorts (overlong running times, unnecessary vulgarity, annoying characters); Game Night becomes a highly recommendable night out at the movies. <br><br>4 Fabergé egg's out of 5","user":"eddie_baggins","rank":[223,295]},{"title":"More Entertaining Than The Average Board Game","rating":7,"date":"19 February 2018","review":"7/10<br><br>GAME NIGHT may not be a great film by any stretch of the imagination, but it's definitely a genuine blast and an entertaining ride from beginning to the very end (seriously, stay for the post-credits scene!) The rare major studio comedy that actually feels like a film, rather than a soulless exercise in assembly-line filmmaking, thanks to such creative choices like Cliff Martinez's thumping score and Barry Peterson's cinematography, which not only introduces new locations as if zooming in on a board game piece, but also sports a surprisingly well-executed long take. Lamorne Morris and Billy Magnussen are some of the obvious standouts among the film's enjoyable cast of characters, but Jesse Plemons is the true MVP, stealing every single one of his scenes with ease. The film isn't without its problems, with the convoluted third act jumping the shark almost to the point of parody, and not all of the jokes land (although most do thanks to the cast's great comedic timing), but nonetheless GAME NIGHT makes for a perfectly fun time at the movies.","user":"roblesar99","rank":[177,246]},{"title":"Movie Review: Game Night","rating":8,"date":"6 April 2019","review":"This is not a movie I went in expecting to love, in all honesty it was just the next film showing. Imagine my surprise when I was treated to one of the best comedies I have see in quite a while. Bateman and McAdams are as likeable and charismatic as you would expect and the rest of the cast are pretty great too. It helps that this cast were given well written, interesting characters to work with. This film also boasts brilliant and creative camera work as well as very imaginative transitions that help to draw the viewer into the story and show that a lot of thought and effort was put into the making of this film. There are a small handful of jokes that don't land and a small number of logical errors but for the most part it is a very funny and entertaining thrill-ride, also stay during the beginning of the credits as they are very well done. Keep away from trailers for this film as they do give some things away that are better not to know going in, once this hits Netflix definitely check it out.","user":"Nathan_Needs_A_Username","rank":[32,41]}]