[{"title":"Absolutely stunning","rating":6,"date":"6 October 2013","review":"How could one not enjoy this visual feast thoroughly is beyond me. It's a sad state of affair that this movie doesn't rate higher on IMDb. Granted, the narration is rather obscure, the ending a bit botched (hence not a 10/10 for me).<br><br>Once you let go and you stop trying to understand every second of it, this movie becomes like watching the most fantastic nightmare you've ever seen. Visually, sound-wise, music-wise, it's simply mind-blowing. It's extremely poetic and disturbing rather than terrifying, which might explain some ratings. It's Murnau's Nosferatu meets Ring meets Kung Fu Hustle.<br><br>The Japanese horror elements are there but carefully blended with Chinese folklore and shooting style, so the movie remains original. The story ends up making sense overall if you're patient enough, even though some elements of it remain a bit fuzzy. Watching this movie is like getting a shot of something strong, getting slapped in the face and kissed by a beautiful woman (my wife) all at the same time.<br><br>One of the most enjoyable - if puzzling at times - movies in a long, long time.","user":"castelangelo","rank":[61,76]},{"title":"Visually stunning and unexpectedly moving, Juno Mak's homage to the 'vampire' movies of the 1980s is also an unusually ruminative piece of meta-cinema","rating":7,"date":"24 November 2013","review":"You probably wouldn't figure pop star turned actor Juno Mak for a serious filmmaker; after all, the singer cum fashionista is best known for being one of Gillian Chung's ex-boyfriends. That is precisely why his directorial debut 'Rigor Mortis' will take you by surprise. A visually stunning homage to the 1980s heydays of Hong Kong cinema when the vampire genre was very much alive (mostly in the form of the \"hopping vampire\" horror comedies), it proves itself to be so much more than a feast for genre fans, packing a surprisingly amount of emotional depth and establishing itself as a refreshingly different kind of meta- cinema. <br><br>Vampire aficionados will immediately recognise lead actor Chin Siu-ho from the opening scene, one of the last surviving alum of the classic 1985 'Mr Vampire' series (Mak dedicates the film to the two other deceased members, Lam Ching Ying and Ricky Hui) who plays himself as a washed-up movie star who moves into a dilapidated tenement building to commit suicide. That act of despair introduces him to Uncle Yau (Anthony Chan Yau, erstwhile drummer of the 1970s band The Wynners as well as Chin's supporting star from 'Mr Vampire'), a veteran Taoist vampire hunter who now runs his own food stall around the neighbourhood.<br><br>Besides Uncle Yau, Chin also gains the attention of the other mostly elderly tenants of the complex played by equally venerable veterans of Hong Kong cinema. Nina Paw and Richard Ng are a devoted couple whose bond of love is tested when one of them meets with an accident and winds up dead. Chung Fat is a local temple priest who happens to be dabbling in the backroom of his apartment in the dark arts. Kara Hui is a single mother to an albino boy whose tragic past is linked to the apartment which Chin moves into. And last but not least, Johnnie To regular Lo Hoi Pang is the building's sole security guard who watches the comings and goings of the block with a wary but watchful eye.<br><br>As one of the screenwriters, Mak (who co-writes with Philip Yung and Jill Leung) likes to keep his cards close to his chest. There is no hurry in the way he slowly reveals the backstory of each of the characters, opting instead to build an eerie and unsettling atmosphere of suspense and dread with every frame. While that does demand a certain level of patience from its viewer, Mak is surprisingly effective at getting under the skin of his audience with a strong visual style heavy with musty subdued colours. The influence by producer Takashi Shimizu of 'The Grudge' is undeniable, but Mak holds its own with some truly hypnotic images in slo-mo no less.<br><br>Borrowing a leaf from his 'Revenge: A Love Story' director Wong Ching Po, Mak stages the action sequences with a fair amount of graphic violence. Yes, more faint-headed audiences should take note - some of the scenes not only get bloody, but can get rather disturbingly violent, and will surely startle the more squeamish at heart. But even as Mak clearly intends for his film to appeal as well to a younger audience who crave for such vivid details, he never does get excessive, demonstrating a fair bit of restraint in scenes which could have easily been much more explicit.<br><br>Mak also pairs his gory thrills with a generous helping of visual effects, relying less and less on his natural surroundings and more on lavishly designed dreamscapes that only make sense if one understands the rituals at the heart of the film (indeed, that's something very likely to be lost on a Western audience). Truth be told, the VFX-heavy climax was somewhat alienating to watch at first, but eventually made complete sense when viewed in the context of the love-it-or-hate-it coda. Don't say we didn't warn you - it doesn't quite end the way you want it to; instead, Mak throws in a last-minute twist that will undoubtedly throw you off-kilter, but in our opinion, is a unusually elegant eulogy to a genre and its stalwarts who have long since gone out of fashion.<br><br>Unmistakable throughout the film is a distinct sense of loss and regret, whether in the form of a loving wife who tries all she can to preserve the life of her deceased husband or the inability of vengeful spirits to let go of their tragic past or even an individual's desolation at having f**ked up his life with his loved ones. The same could be said of the veterans who make up the ensemble cast; despite being icons in the past, they have largely been forgotten by modern Hong Kong cinema, and just going by each of their compelling performances here, reason to mourn for the passing of a significant era of the industry. Like 'Gallants' from two years ago, there is a palpable sense of nostalgia one gets watching these veterans take to the screen like they never left.<br><br>And 'Rigor Mortis' deserves to be appreciated in that very light, as a tribute to the 'keung si' genre as well as Mak's personal thoughts on their fortunes since. The fact that he is a newcomer to filmmaking makes this an even bigger triumph for Mak, who delivers a thrilling and unexpectedly poignant horror movie steeped in its own unique visual aesthetic. We're not denying that there will be those who dislike Mak for pulling the rug from under their feet right at the end, but it is to us a graceful and thought-provoking turn that makes it an unusual and inspired piece of meta-cinema.","user":"moviexclusive","rank":[39,47]},{"title":"A movie with complexity, reflecting upon the double life of an actor...","rating":8,"date":"3 February 2014","review":"At first, I wasn't clear about what happened at the start, then, clarity formed closer to the end of the movie when parts of the plot started tying up, and finally, got confused again by the ending. I must confess that I initially thought the ending botched the entire movie, sort of anti-climatic (much like The Myth, when Jackie Chan refused to acknowledged his past, making the entire movie a scam)<br><br>Then, I started reading about the main actor (Chin Siu-Ho's) real-life issues, and using his issues, relooked at the movie in its entirety, and finally, I understood the movie and how it ended. Bear in mind, that my interpretation is perhaps but 1 perspective of the movie. Someone else could have a different view. However, I must say that this movie is complicated so much so that anyone who goes to watch this without (1) an understanding of Chinese folklore, (2) understanding that the actor is acting as himself and (3) understanding a bit of the actor's past, may think the movie is really bad and would give a bad rating on IMDb.<br><br>All said, here's my SPOILER ALERT. I will be commenting on the ending now.<br><br>The ending seems to be an alternate reality, where every character has a different path, and the main lead died by hanging, without any ghosts, or vampires appearing. It seems pretty mundane, death is also mundane (no great sacrifice, no dying with a cause). <br><br>And yet, that's where the gist of the ending is. Whereas in the 1st death, where the lead lay dying after a major combat with the vampire-ghost, the final scene was just a boring \"he hung himself\" <br><br>When you looked into the real-life history of the main actor, he had issues, he was a rather successful actor in his hey-day, when vampire movies were extremely popular, and he had lots of movies to work on. Later, as interest in vampire movies die down, he began to have less work, having to work backstage, his career going downhill, and also his divorce with his wife. Chinese have a saying, that \"Real-life is like a movie, and movie is like real-life\", thus they can become murky and muddled up for an actor. <br><br>The movie thus, in my view, is deliberately murky and muddled, with the majority of the movie reflecting upon the movie aspect of the actor's life, and the ending reflecting upon the real-life aspect of the actor's life, that despite how a movie can be dramatic, life is just mundane. <br><br>Also, that the movie-aspect and the mundane-aspect of the movie seemingly happening at the same time (both started with his moving into the apartment, and both ending with him dying) reflects upon the double life an actor lives (the movie aspect, and the real-life aspect) In the end, his 1st death may be representative of his wanting to leave showbiz on a high note, and his final ending death may be representative of his willingness to accept reality, that leaving on a high note will not happen, and to let go of his past and look towards the future. <br><br>I view the final scene, when his son came to identify his body, as a representation that he is putting his past to rest, and embracing his future with his family. <br><br>Anyway, that's my interpretation. All in all, a movie with complexity, not just a pure horror movie. Quite a good one in my opinion, so 8/10 for me.","user":"angelvaldric","rank":[13,16]}]