[{"title":"Great Potential","rating":4,"date":"29 December 2018","review":"This low budget twisted thriller had some great acting by Matthew Tompkins (lead actor) but even his acting chops couldn't bring this one out of the sloppy script. The premise is original enough and redone with a new script and a bit more money thrown at it, it could become one of the greats. It's lacking in good CGI's and the \"demons\" leave a lot to be desired as for being frightening. It's worth a watch just for the acting and originality.","user":"ferdmalenfant","rank":[4,5]},{"title":"Is this the real life?","rating":4,"date":"23 December 2018","review":"Vice detective Ryan Calhoun (Matthew Tompkins, Sicario) is one of the best cops on the force. But after his partner is ritualistically murdered, his need to discover the truth takes over his life, sending home to a hospital that becomes his own private hell.<br><br>Even worse, Calhoun is suspected of the murder. Going undercover in a mental hospital, he tries to keep himself sane while remembering his life - he's married, he's a good cop and demons can't be real. He learns that nothing is - or isn't - the way he believes it is. Yes, that sentence is confusing but so is the life our hero is about to plunge himself into.<br><br>The Harrowing has some star power, with Arnold Vosloo from the Mummy films and Michael Ironside. I really liked the film's look and how it gets progressively grimier and weirder as we get closer to the inevitable conclusion. It's very Shutter Island but that isn't a bad thing. I mean, that movie didn't have demons with branches and blood spraying out of their heads.","user":"BandSAboutMovies","rank":[3,4]},{"title":"A suspenseful, thrilling ride","rating":6,"date":"18 June 2019","review":"Full of suspense! This film wrapped me up in its chilling world. I was all in! The entire cast did a fabulous job of bringing some pretty wild characters to life. Very well done and directed! You'll have to watch it again and again and maybe one more time after that to make sure you didn't miss something and you'll have questions after, many questions. BUT...it pulls you in. Well played sir!!","user":"aprilhartman","rank":[1,1]}]