[{"title":"Bad Samaritans","rating":23,"date":"23 June 2014","review":"\"The economic anarchy of capitalist society is the real source of the evil.‎ The result of these developments is an oligarchy of private capital, the enormous power of which cannot be﻿ effectively checked even by a democratically organised political society.\" - Albert Einstein<br><br>In May of 2011, Dominique Strauss-Kahn, presumptive French presidential candidate and head of the IMF (International Monetary Fund), was arrested at JFK airport following an alleged assault on a hotel housemaid. Strauss-Kahn denied violence but admitted \"inappropriate\" behaviour. The civil suit was later settled out of court. <br><br>Directed by Abel Ferrara, \"Welcome to New York\" retells this scandal. It stars Gerard Depardieu as Devereaux (a stand in for Strauss-Kahn), a corpulent corporate-type who spends his days pommelling prostitutes, engaging in casual sexism and gorging on mountains of food. Devereaux, in short, is addicted to pleasure, power and excess. Emblematic of a ruling class which abuses its privileges, exhibits insensitivity toward others and remains protectively cocooned in its ivory towers, Devereaux is shocked when his attack on a lower class black woman gets him arrested. \"I have diplomatic immunity!\" Devereaux cries. <br><br>Ferrara's recent films have all been about capitalism, addiction and their overlapping ills. In \"Last Day on Earth\" this results in ecocide, in \"Go Go Tales\" this results in a club owner developing gambling addictions in an attempt to \"diversify\" and \"compete\" on the market place, and in \"R Xmas\" a couple of upstart businessmen find their dreams of upward mobility shattered. In \"Welcome to New York\", we see the \"cause\" of such collapses and calamities. Entirely without empathy, self-knowledge, forever unable to distinguish between consecration and rape, and viewing everyone and everything as a possession or commodity, Devereaux is the product of a culture which glorifies and normalises sociopathic behaviour. \"I don't have feelings,\" Devereaux tells a psychologist, \"I don't give a s**t about the people!\" <br><br>\"Welcome\" is divided into three clear sections. In the first, we nosedive into Devereaux life of debauchery. Here, sex and nudity are presented without a hint of titillation, and all of Devereaux's sexual rendezvous are sketched as something pathetic and hollow. The film's second section then bluntly contrasts a dehumanising prison system with Devereaux's life of privilege, whilst its third and best segment finds Devereaux consigned to house arrest. During this segment, Jacqueline Bisset steals the show as Devereaux's ex-lover.<br><br>Though well intentioned, \"Welcome to New York\" is mostly bad art. The film is packed with clichés, its dialogue is obvious and cringe-worthy, Ferrara's aesthetic is far too literal and the film climaxes with a hokey shot in which Devereaux looks at the camera in a moment of forced and failed profundity. Worse still is Ferrara's disinterest in embedding Devereaux's debauchery within a socio-political context. Ferrara, whose filmography is filled with films about addictions, seems interested in Devereaux only in-so-far as the man is held prisoner by his own body; consumed by consumption. The larger workings of the IMF – responsible for tens of millions of deaths, wars, coups (one currently going on in the Ukraine), the arming of terrorist and far-right groups, indebting countless countries etc – goes ignored. The dubious implication, as with most art which attempts some kind of economic critique, is that our system \"works\" if only people were a little more compassionate and a lot less greedy. <br><br>Incidentally, the IMF's \"Independent Evaluation Office\" has recently admitted that, quote, \"the IMF's advocacy of fiscal consolidation proved to be premature for major advanced economies\". In short, the IMF is attempting to portray its recent disastrous policies, which saw austerity measures and bank bailouts occurring in most First World nations, as \"blunders\", rather than entirely deliberate. Many of these Strutural Adjustment Programs, imposed on countries to serve the interests of creditor banks and mega-corporations, were at the time being opposed by Strauss-Kahn, then the IMF's managing director. Judging by history, in which non-compliant types (Scott Ritter, David Kelly, William Colby, Michael Connell etc) are routinely suicided, assassinated, discredited or slandered, it's possible that Strauss-Kahn was framed so as to install a more malleable director. Time will tell. Which is not to say that Strauss-Kahn isn't a giant sleaze-bag, just that he's small fry. The monster runs deep, and its always sacrificing its own priests to keep the game alive.<br><br>5/10 – See Passolini's \"Salo\", \"Eyes Wide Shut\" and Ivory's \"The Remains of the Day\".","user":"tieman64","rank":[46,59]},{"title":"Wecome to New York brutal and unflinching","rating":7,"date":"2 April 2015","review":"This film has many different rhythms and paces. At first the prolonged sex scenes last so long that they became uncomfortable and disturbing.Although the sex with the prostitutes was consensual Depardieux grunted in almost pig like fashion as he lost himself in debauchery and lust. It had the feel of a porn film but with believable characters. The scenes with Depardieux and Bissett often have the feel of improvisation particularly at the beginning. It would have been nice to have seen more of the victims reactions to the abuse that they were subjected too. The unrepentant nature of the lead character is alarming and brutally honest.He does not seek to be cured even after his arrest makes his life fall apart. He shows no feeling for his victims and just is a serial abuser. His blunt attempts at seduction is seen to be successful in one instance due to his wealth and status and overt womanising. Like Bad Lieutenant this film delivers moments of brutality and spiritual abandon. In both films the central characters are spiralling out of control. The Gauguin nudes on the walls of the apartment are well placed. In all despite the lengthy sex scenes and drawn out almost real time arrest the film is well constructed and well acted. The surreal almost \"bad actor\" dialogues between Bissett and Depardieux as they confront the aftermath of his arrest fluctuates between the inane and the poetic. I really liked the line that,\"The reverse of Love is not hate but indifference\" delivered by Bissett. The fact that this film is based on true events adds weight to the subject matter. A difficult film to watch and an adult film on more than one level.","user":"losriley-1","rank":[17,21]},{"title":"Abel Ferrara is back on form and Depardieu delivers a superb performance","rating":8,"date":"25 September 2014","review":"\"Welcome to New York\" is based on a real-life \"scandal\" that involved the french diplomat Dominique Strauss-Kahn who was a member of french Socialist Party and also the Managing Director of IMF (Int. Monetary Fund) from 2007-2011 until he resigned due to allegation that he had sexually abused a hotel maid. <br><br><ul><li>Ferrara's \"Welcome to N.Y.\" hands this affair in a masterful way, that you would find it hard to remove your eyes from the screen even for a second. This is not something Ferrara has done in the past - elaborate a certain real life event to the last detail. And for Ferrara this is just the right kind of stuff, cause he has been provocative for all of his carrier and he knows how to handle this kind of material.</li></ul><br><br>On the other hand, Dapardieu gives one of the best performances of his carrier. He's so convincing as Deveraux that one can say he's the real man (DSK). The script doesn't exaggerate, - written by Ferrara and Zois (who worked previously with Ferrara in \"New Rose Hotel\"),- it handles the story plain and proper for Ferrara to do his thing behind the camera. <br><br><ul><li>The best part of the movie is when he (Devereaux) boards the plane and then is asked to step out and the whole police procedure begins. Depardieu feels very comfortable during this complex scenes as does Ferrara, who doesn't hesitate even for a second to show us what the real man experienced. </li></ul><br><br>Ferrara goes as far as to treat yet another situation that Strauss Kahn found him self in. Ferrara's Devereaux after the N.Y. arrest tries to rape a journalist, in real life this allegation happened to Strauss-Kahn who was accused for such an act and is scheduled to appear in court for trial in 2015. Bisset plays Devereaux's wife and fulfills the other part of the story...<br><br><ul><li>Now i'll try and give you some reason why you should watch it or stay away from it: If you are familiar with the real life story of DSK then give it a shot, you wont be disappointed... If you are not an Abel Ferrara fan then skip it (it will be your loss)... If you want to see Depardieu on one of his best roles he has ever done then watch it, the man was the perfect choice for this role.</li></ul><br><br>Hope this helped.","user":"Atdheu90","rank":[36,50]}]