[{"title":"An excellent companion piece to L'Amour Fou","rating":8,"date":"21 January 2014","review":"I have just watched Yves Saint Laurent and found it to be a visually sumptuous film which totally captures the dying days of the elite formal couture houses before bursting into the hedonism of modern global fashion brands. An excellent companion piece to L'Amour Fou (2010), giving an insight into the tempestuous but private relationship between YSL and Pierre Bergé through the pitch perfect acting of Pierre Niney (Yves) and Guillaume Gallienne (Pierre).<br><br>The film charts YSL's career from his early years at Dior in the late 1950s through to his iconic Ballet Russes collection of 1976. The world of the late 1950s is perfectly captured with elegant Dior designs, stylish models and a jazz score that matched the chic Parisian apartments the characters inhabit.<br><br>In one such apartment Yves meets Pierre Bergé, the man he will spend the rest of his life with both privately and professionally. For Pierre is the man who orchestrates the creation of YSL as a couture house. He gives Yves the confidence to \"create on my own terms\" and show the world his own particular view of feminine beauty and elegance.<br><br>Their relationship mirrors Giancarlo Giammetti and Valentino Garavani who together also created an iconic fashion house and sustained a personal relationship for over 50 years. Their story too is wonderfully and humorously captured in the documentary The Last Emperor (2008). However, one is left with a sense that Giancarlo and Valentino had a much more stable relationship to that of Yves and Pierre. The YSL movie captures during the 1960/70s Yves' erratic excesses with drugs and sex and Pierre's jealousy and need for control.<br><br>But this expose of their difficult relationship in no way detracts from the exquisite design throughout the movie. From the elegant, well documented interiors of Yves and Pierre's Parisian apartments, to the bohemian Moroccan lifestyle they enjoyed with the likes of Loulou de la Falaise and Karl Lagerfeld.<br><br>This film was a joy to watch with a standout performance by Pierre Niney, whose voice and mannerisms made Yves live once again.","user":"thedozinglion","rank":[43,54]},{"title":"Beautifully Shot but Ultimately Superficial Biopic of the Great Fashion Designer","rating":6,"date":"8 October 2014","review":"YVES SAINT-LAURENT traces the career of the eponymous fashion designer (Pierre Niney) from his early days in the late Fifties to the zenith of his fame two decades later. The film concentrates on his professional as well as his personal struggles with long-time lover (and manager) Pierre Bergé (Guillaume Gallienne).<br><br>Director Jalil Lespert makes a lot out of Saint-Laurent's background as an outsider; born in Algeria during the colonial period, he never really felt at home in mainstream Parisian society. He began his career by following existing fashion patterns; but after being dismissed as \"boring,\" immediately after leaving the house of Dior (Patrice Thibaud) he branched out on his own. This proved a wise move, as the film shows how he shot to stardom with a series of daring and often innovatory designs. There are several shots of Saint-Laurent working on his new creations day and night, to the despair of Pierre.<br><br>YVES SAINT-LAURENT offers a sumptuous recreation of Fifties and Sixties Parisian society. Deliberately shot in washed-out colors, the film conjures up a lost world of large saloon cars, packed streets and never-ending parties where Saint-Laurent spent most of his leisure-time. The models' hairstyles are deliberately ostentatious, especially that of principal mannequin Victoire (Charlotte Le Bon) who at first attracts and then repels Saint- Laurent.<br><br>Lespert's film doesn't tell us much about Saint-Laurent's life, other than the fact that he was something of a tortured genius, always on the lookout for personal as well as professional satisfaction but never seeming to find it. He enjoys a close relationship with his mother (Marianne Basler), and later on in life he always runs back to Pierre for emotional as well as professional support. With his black horn-rimmed lenses and increasingly disheveled hair-styles, Niney gives a convincing portrayal of the designed. On the other hand, perhaps the script should have offered more insight into how Saint-Laurent became such an iconic figure of the fashion world; what was it about him that made him so popular with both high society and the ordinary consumer.<br><br>As Pierre, Galienne has to make the best of a supporting role, and succeeds brilliantly. He comes across as a patient person, ever ready to forgive Saint-Laurent's excesses; but nonetheless dedicated to the fledgling fashion-house's future success. In several backstage sequences he is shown managing the models, designers and other assorted hangers-on with quiet efficiency, clipboard in hand. It was mostly down to his efforts that the house of Saint-Laurent enjoyed its global success; without him, the designer might have only had limited appeal.<br><br>YVES SAINT-LAURENT is definitely watchable - some of the party- scenes where the hero enters a drug-filled world of fantasy and hallucination - are particularly memorably shot. But I still think the film represents something of a missed opportunity to dramatize the life of an icon.","user":"l_rawjalaurence","rank":[18,21]},{"title":"Well intended but wafer-thin bio-pic lacks drama and depth","rating":6,"date":"12 June 2015","review":"\"Yves Saint Laurent\" (2014 release from France; 105 min.) brings the story of one of the biggest names ever in the fashion design industry, YSL. As the movie opens, we are in 1957, where we see young Yves with his family in Oran, Algeria (not long before the revolutionary war breaks out). During the opening titles, we jump to today, where YSL's partner explains why he is selling all of the art they had collected over the last 4+ decades. We then jump back to the late 50s, and it's not long before the crazily-talented YSL is off to Paris, where he works under that other monument of the French fashion industry, Christian Dior. When Dior unexpectedly passes away, YSL becomes the head designer (he was barely 22!). Meanwhile. we also get to know the personal life of YSL. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: first, there are dueling biopics on YSL currently out there. Besides this movie, there is also the similarly titled \"Saint Laurent\", also from France, so be careful to be sure that you don't mistakenly confuse one with the other. Second, this movie tries to give us both a look at YSL's professional life and his personal life, but in the end really doesn't do either one justice. It all seems very hurried (the movie covers 1957 through 1976), and as a result the movie lacks depth and drama. That is really a shame as there are some good moments in it. One of those is when YSL is under observation at a military hospital, and YSL's partner tells him: \"Do you want to live or do you want to die?\" Another good moment comes much later when the same partner observes \"You are happy only twice a year: in Spring and in Fall, when the collections come out\". I wish there were more such key observations. The two lead actors, Pierre Niney as YSL and Guillaume Gallienne as his partner, give their all in performances covering 2 decades, and it's certainly not their fault that the movie, while promising at times, ultimately falls short. Last but not least, tip o' the old hat to the production design of the movie, with the immaculate reproductions of Paris in the 60s and 70s (check out the old cars!).<br><br>\"Yves Saint Laurent\" opened without any pre-release hype or advertising last summer (July, 2014) at my local art-house theater here in Cincinnati. I figure it wouldn't be playing long so I went to see it right away (I was right, as it disappeared after only 1 week). The early evening screening I saw this at was not particularly well attended. The other YSL biopic I mentioned earlier is finally opening this weekend here in Cincinnati and I'm looking forward to check that out, just to see how different it is from this one. Meanwhile, well-intended as it is but flawed, I still might suggest you check out \"Yves Saint Laurent\" when it is released on DVD/Blu-ray. If on the other hand you are a fashion aficionado, then this movie is a must-see!","user":"paul-allaer","rank":[10,12]}]