[{"title":"All the basic elements of Japanese fantasy, sadly none of the graceful production value","rating":4,"date":"12 May 2015","review":"For those who have seen or played Japanese video games, Battle for Skyark would be awfully familiar. It closely follows the aspects of role playing game, from the brooding teenage boy who is destined to save the world, intricate yet impractical costumes, cheesy one-liner and stereotypical one dimensional characters with outlandish hairdo. I was seriously having flashback of childhood memories when watching the movie, unfortunately it does not even remotely create the same fond memory it's inspired from.<br><br>If one searches the image of Final Fantasy or any other Japanese RPG, it should show a character similar to Rag, the main protagonist. Rag is destined for greatness as a savior. He must journey to fulfill this prophecy, meeting new allies and defeating monsters along the way. The movie is, in the very sense, a live action inspired by anime or video game. It borrows so heavily till the point of cringe-worthy.<br><br>Most fantasy games have excellent visual and incredible CGI, this is not so in this case. Battle for Skyark is frankly a low budget flick. It tries to deliver the style with the same complicated outfits and extraordinary hairdo, but it's trapped with typical tedious scenes with little coherency. The monsters and setting seem very uninspiring as it only shows bits of special effects, these are too few to create any convincing atmosphere.<br><br>Sadly, this formulaic \"teen saves the world\" gimmick was already dull in Japanese fifteen years ago. Using same artificial rigid characters, like the stern companion or silly sidekick, can feel very monotonous. The screenplay doesn't work well either, often glossing over details or stutters slowly in the middle. The dialogues are corny, they might work on games or animations, but given the real life interpretation, they feel bizarre at best. Lastly, narrative doesn't clearly explain nor does it conclude in satisfying manner.<br><br>I wanted this movie to work, maybe due to sentiment or nostalgia. However, in all honesty Battle for Skyark might copy the look of characters, but the plot, setting and overall atmosphere merely produce a lackluster movie.","user":"quincytheodore","rank":[29,32]},{"title":"So Much Potential, So Little Budget...","rating":4,"date":"8 May 2015","review":"INTRO: Unfortunately, I was bittersweetly disappointed with this movie; let's break it down...<br><br>BUDGET: Clearly Too Low. Movies are expensive, but it seems clear to me that this movie was out of it's budget's league. At least the movie got finished, which is in and of itself an accomplishment, but it seems like there wasn't enough to give it the polish and finesse that the concept really deserved. I think this could have been a gem, but I get the impression someone got a little too ambitious and jumped the gun. <br><br>FX: Not bad, but rather sparse for Sci-Fi. The environment, and elements that required obvious Motion-Graphic/3D treatment were pretty well done; they didn't distract or disconnect you from the movie, and that's really all you NEED. Having said that, given that it's a sci-fi flick (and that the cover sort of gives a similar impression), it didn't seem like there was a whole lot going on in terms of digital effects; much of the visual effects seemed to be done on set, which is fine for keeping costs down, but also doesn't allow you to edit and refine things in the post-production stage; that can make all the difference when trying to add more intensity to an otherwise 'flat' scene.<br><br>ACTING: It felt forced. It didn't come across as natural at all; there were a couple actors and a couple of moments where things 'felt right', but it was a really mixed bag, feeling forced overall. Maybe (again) the budget constraint caused the process to be rushed, or maybe because the movie's target audience is kids, the decision was made to just 'rough it'... or maybe there was too much work placed on too few people, causing burnout(?)... Either way, direction, takes, and/or talent were lacking for a polished experience.<br><br>PACE: Too slow. The movie really seems to drag on more than anything and emotionally flat-line throughout large swaths of the film. Due to the level of acting, lack of effects, and lack of developing/fleshing out the overall storyline, it feels like lots of time is wasted with what can only be described as \"awkwardness\".<br><br>STORY/CONCEPT: Good, but needs some fleshing out. Overall, the concept was actually great. The problem, however, was its vision. The animated introduction was a little complex (given the amount of info vs time), then throughout the movie we have long periods where really next to nothing is developing, and then nearly everything is revealed at the end. The middle, where conceivably the conflict would REALLY begin to gaining traction, was more of a whimper; not even the characters were fleshed out or understood as individuals to a point where one could connect with them on an emotional/personal level. Also, most of what was revealed at the end was rather predictable and not really much of a revelation by the time it was formally stated. Thus, much of what was displayed at the beginning of the movie and unveiled at the end should have been evenly spread out throughout to make it less turbulent to digest.<br><br>DETAILS: Too many \"ugh\" moments. - Even though I loved how the SkyArk looked, it drove me nuts seeing it within Earth's atmosphere, and then seeing it clearly orbiting the Earth in space only moments later. It seemed rather inconsistent. - The monsters aren't scary, and often-times they were just so lethargically slow and awkward. They looked a little neat, most notably the semi-transformed individuals near the end, but they didn't seem super-human enough in terms of speed and ability. - No blood... really? This movie needed a little more blood; the weapons were always clean, and even the only gun-shot in the movie didn't have any audio/visual weight/impact to it; you'd almost have been better off to zoom out the window, make a flash, and have it be an implied death. - As an adult, I found myself rolling my eyes and sighing too often in regard to the acting/character progression. The mannerisms, the gestures, the movements, the lines... there was just way too much lacking, giving the impression of extreme cheesiness. Part of me thinks this should be a series of movies or a web-series, and the story should begin earlier; that whole intro should have been a movie on its own where you focus on getting the fundamentals spot on, and then use this base as a springboard to get on to the more complex sequences in a sequel.<br><br>FAVOURITE LINE: \"To survive in a world of monsters, you have to become a monster. You can stop this; all this pain and suffering... Drink!\" - Rusty I'm so glad this movie had a line to really reflect on and provoke thought; in my case it actually reminded me of something Hitler is said to have believed regarding control and how the only way one can change a given power structure is to rise to the top.<br><br>CONCLUSION: All in all, my frustrations with this film are bittersweet and in a sense almost a compliment; the concept has SO MUCH AWESOME potential to be a solid family movie, but it currently isn't fleshed out enough in any area. I definitely wouldn't throw out the concept, but I'd start it over in a few years after REALLY fleshing out the story/'universe' more and developing the characters with increased complexity.","user":"tommylangzik","rank":[52,64]},{"title":"An excellent sleeping pill.","rating":2,"date":"5 June 2015","review":"Battle for SkyArk: a movie with no battle for the aforementioned Ark. All we get are a handful of kid bums with laughable weaponry, pitted against unconvincing \"monsters\" who could die... of laughter when they see the so-called weapons. The whole movie drags through, the one massive monster is yet another take on the guy-turned-giant-monster- with-mask-and giant-weapon we've seen hundreds of times, from Mad Max Beyond Thunderdome to the Resident Evil and Silent Hill movies/games franchise. No development at all, just kids scurrying through what seems to be a huge junkyard. I had few hopes, considering the score given by other viewers, but I didn't think it'd be such a sad sight. The kids do what they can, I won't throw them the stones, they're all very young actors. Whoever made the movie though, should consider a change of career and run said junkyard instead. At least, they'd get an honest pay for piles of rubbish.","user":"vidocq-4","rank":[33,40]}]