[{"title":"Not the worst movie I've ever seen is the nicest thing I can say","rating":3,"date":"24 January 2019","review":"Okay so, to be fair, there are worse films one could point to than this odd snoozefest, but make no mistake, from start to finish you will find yourself wondering if your 98 minutes could be better spent doing something else. Nevermind the affront to science, there are bigger problems. The acting isn't the worst but it's pretty bad, maybe slightly better than an after school special but I'll admit I might be giving it too much credit. The characters are more like caricatures, and it's hard to care what happens to such shallow, exaggerated cliches. I wouldn't even really call this a scifi, more like a drama with science fiction undertones, and a bad one at that.<br><br>I watched this movie clear through so you don't have to, and don't endure to the end expecting to be rewarded for your sacrifice. I've seen some films that started out terrible but ended up surprising me. This was not one of those films. My suggestion is this: If after the first five minutes you find yourself hoping it gets better, know that it won't and stop wasting your time - I wish that I had. On the other hand if you're bored to tears and there's nothing else to watch, you could do worse (just not by much). I realize not everyone is going to agree with my low markings but if I really liked this movie I'd avoid going all in on five stars because it's so clearly bad that I'd look like a shill.","user":"goonta","rank":[31,37]},{"title":"Intriguing premise ruined by a film that ends up centering around the father's mental illness","rating":3,"date":"21 January 2019","review":"I had high hopes for this film, sounded like an interesting premise. Instead terrible writing combined with a low budget created an absolute snooze fest with contrived unrealistic interpersonal drama substituting for any real action or plot line. By the end of the movie you are hoping at least half of the family won't survive, they're so g'dmned annoying and stupid.<br><br>Most of the movie centers around the \"family\" that basically hates each other hanging out in the house waiting to die. The worst part of the film is that they DO NOT.","user":"plato-42119","rank":[35,43]},{"title":"bland and boring","rating":3,"date":"20 January 2019","review":"I watched this movie based on the synopsis, it sounded like it could be somewhat interesting. Well I got about twenty minutes in and realized it was going to be one of those nothing movies.<br><br>Almost nothing happens for the 90 minutes and the drama between the family isn't tense or interesting all the characters I just didn't really care about. The father is definitely the most interesting character in the movie but that isn't saying much.<br><br>Movie isn't god awful bad but just a complete bore of a chore to get through imho.","user":"danfurtado-11221","rank":[22,29]}]