[{"title":"Unbelievable movie with no redeeming qualities.","rating":1,"date":"8 April 2014","review":"Well, it has one redeeming quality - it ends! The lighting and direction may please IF you are a fan of this director or possibly if you're addicted to watching the gyrations of mindless disco dancers (the actors) who are all bombed out of their minds moving pointlessly (the acting) whilst illuminated by annoying flashing disco lights (self explanatory - the lighting). The plot, such as it is, is inanely simple: bad guys take a hostage from a disco or a pub with faulty lighting, wantonly kill lots of people in the disco/pub whilst doing so, then they go to hide in a big and impossible to defend parking lot. Conveniently for the scriptwriter it's Christmas eve and everybody is working late in the offices within the building and the bad guys kill most if not all of them also. Why did they kill them? Your guess is as good as mine but gratuitous violence is used throughout the movie to hide the absence of any sane and sensible plot. The bad guys then spend the remainder of the movie killing off most of the rest the cast whilst trying to get into a bank account to steal money electronically. Okay, it's not a hostage/demand plot - what a surprise - and the (VIP) hostage is the only person that has the bank account password - another huge surprise - sarcasm. Inept cops, inept SAS, inept bad guys all acting out their inept script. The entire movie is cliché ridden and to make use of the title of an old British television series, it's all Never Mind The Quality, Feel The Width. You'd better make sure that you have health coverage for a lobotomy because you'll want one if you make it all the way through this unbelievably bad movie.","user":"m_lecarre","rank":[28,35]},{"title":"i dare u to watch this till the end","rating":1,"date":"12 April 2014","review":"Hmm, i do rather watch Power Rangers or Ultraman as action movie than this anytime.<br><br>I don't understand why this is like a film produced by amateurs and even worse. There is way too MUCH unnecessary effects used. Slow-motion here, then flash flash there, slow-mo again, and most of the time, it's better without any effect. It feels like someone is getting really hyped about effects and applying it everywhere like a first timer get excited with a new toy.<br><br>Then, SAS? Seriously? ONE thing is surely missing in the opening of this film, and it's this line \"This is for entertainment purpose only. Any resemblance to real persons, living or dead is purely coincidental.\" A real disgrace to the elite soldier community and in this movie, it just seems like gang fights, rather than SAS vs Terrorists.<br><br>It's really that bad that i forced myself to write this.","user":"wow101","rank":[18,22]},{"title":"Take Truth, This Dare's Not Worth It.","rating":1,"date":"10 April 2014","review":"Quite possibly the most inept and ridiculous depiction of the SAS ever committed to fiction. These lads look like they've never staged any operation in the field before. For elite experts, they come across as unwary and amateur. The story could have been marginally interesting, but there are far too many nonsensical actions take by the kidnappers. <br><br>What makes this film truly unwatchable, though, is the style! It looks like someone is trying to make a hip music video with unwarranted flashes of light, superimpositions, and jarring effects. Far from capturing a sense of anything (is there any sense to be captured?) this approach simply ends up with us detached from the action and feeling as though it's all being trivialized.<br><br>Do. Not. Watch.","user":"tjbdtp","rank":[18,22]}]