[{"title":"Talented, though underdeveloped feature from 17-year-olds","rating":3,"date":"23 April 2014","review":"To appreciate this you really need to know some basic info before viewing. Otherwise you're most likely to find the film awful. Like if I didn't know that Roberto Rodriguez first feature \"El Mariachi\" was made for a total of 8000 dollars, you wouldn't really think that the film is more than OK. When you get to know it's made in one shot due to the cost of 35mm film, you simply cannot be more impressed.<br><br>What you need to know about this film, is that it's made of a couple of 17 year old Norwegian high school kids with all amateurs in all roles. Then it's easier to get impressed. However this doesn't make this film more than a curiosity, due to this, because there's too much not functioning, though the idea is good enough, photography work is well done, the effects are OK for it's budget and the score functions very well. On the worse side is amateurish acting, incoherent storytelling, badly spoken English and cheesy dialog from most of the actors and a confusing rhythm. It's made with English dialog just to make the market for the film bigger.<br><br>But being made for less than 10.000 dollars, there's quite a lot which surprises. This film actually made it to Cinema release at a couple of cinemas in Oslo, with quite good turn up, and is released on Blu-ray and DVD in quite a handful of countries by Another World entertainment.<br><br>We're in a future world where teleporting is as common as making phone calls, when 18 year old Ian Finch loses his five year old adopted brother Dylan, when he disappears like half the population of the world goes missing. Dylan seems to be a bit sad, and he strangely enough puts a paper note into his brother's pocket. When Ian later on finds the note, he immediately runs back home, only to find some dusty remains of Dylan in the bathtub. He is then surprised by a boy at his own age, facing him with a gun.<br><br>The film could have been much better if it wasn't made out to be an action movie. The fear in threatening and the use of weapons make the bad acting come to be too obvious. This is shot digitally, which means they could have managed to train away the bad acting with more than one take. Can't say anything other than that the bad acting ruins it for me. <br><br>The best scenes are shot in Oslo (which is not supposed to be Oslo, though), without any actors. Another running scene with no dialog is the film's best scene. The two main actors, Harald Evjan Furuholmen and Hugo Hermann, related to the missing 5-year-old, have their moments, and shows there's some acting talent there, but mostly runs around looking cute and estranged cheeky. They should have had some hours of theatrical training to use their voices. I think it would have been better if shot in Norwegian. A couple of the lesser roles are played brilliantly, though. Graeme Whittington is by far the best. Maybe this was bad casting in several roles?<br><br>Well, it suits as an example of what is possible to do on a shoestring budget today with digital technology. The two teenage creators Jarand Breian Herdal (writer and director) and Jens Peder Hertzberg (Visual effects creator) are talented, but in need of a more time and professional supervision when it comes to many things. Using 10 minutes of the running time of the film on character development in the film would have helped a bit, and much more rehearsals for almost everyone involved. The two trailers made for this, both featured on the DVD and Blu-Ray are giving the impression of a better film than it is, and shows more quality and talent than the film. <br><br>See what youngsters today are capable of achieving in both film making and distribution, even if it lacks some serious quality, is very interesting, though. We haven't heard the last of these two film makers. Let's hope they attend film school before they do another feature, while rehearsing on making short movies and improves on their own quality measures.<br><br>The DVD and Blu-ray version, very professionally packaged by Another World Entertainment has a 3 minute (why not longer??!!) \"the making of\"-interview with the two young film makers, also in English, and this gives some of the thoughts behind the project as well as how they managed to make the film in less than 10.000 dollars.<br><br>I think this film might be used in start of film schools and media classes, but maybe just in parts, as a discussion around how it shouldn't be done. It's suited to inspire young film makers, no doubt! I give a weak three stars (out of ten) for the overall effort, obvious drive and talent. More precisely: Packaging (9), score (8), sound effects (8), photography (6), trailers (5), visual effects (5), plot and idea (5), locations (5), casting (4), But dragging down is dialog (1), instruction (1), acting (2), script (3).<br><br>Still will be looking forward to see what's next, but in a few years time. Far away from low budget young debuts of the likes Steven Spielberg (18 when made \"Firelight\") or Xavier Dolan (19 when made \"I killed my mother\"). Hope they doesn't take as long as Uwe Boll, but more like Peter Jackson (both with directorial debut as 27!) has in turning out decent movies, and hope they are connected with talented people along the way. There's loads of film talent in Norway, so my hope is hanging up there!","user":"OJT","rank":[45,52]},{"title":"Good idea - very bad implementation","rating":19,"date":"19 June 2014","review":"First of all: I'm German and watched the movie in English, so i can't really say much about the vocals.<br><br>That being said, my thoughts about this movie: The general idea may not be original but it is good none the less.<br><br>I'd rate the movie as follows (out of 10): score (3), sound effects (8), photography (7), visual effects (6), plot and idea (2), locations (4), casting (5), acting (4), script (3)<br><br>The worst thing are the immense holes in the script and nearly impossible things like killing yourself by drowning (seriously: Did the writer read about suicides committed in the bathtubs and assume it would be by drowning?) Children dying by drowning didn't commit suicide, they either had an accident or were murdered. Secondly: Why do suicidal people have to be \"cleaned up\"? They either kill themselves or are of no harm (other than having a god complex it seems while watching the main characters).<br><br>The story just doesn't make sense - and for me a low budget doesn't excuse that.","user":"player8472-1","rank":[7,7]},{"title":"Interesting concept and attempted storyline","rating":5,"date":"17 April 2014","review":"So to be honest, I'd normally give this a 3/10 for the general feel of the movie, but I bumped it up a bit because I thought the concept and attempt deserved some bonus points. While it is definitely an amalgamation of previous time / space travel ideas and won't really provide anything new to any fan of that genre, I think this film had a unique flavor.<br><br>With that said, the rest of the movie was definitely lacking in polish. There were a couple scenes where you could see the shadows of the film crew (I thought someone with a gun had walked into the room, but after rewinding I'm pretty sure it was the boom operator), guns with suppressors aren't suppressed in the audio track, stuff like that. The acting is mediocre at best, but I wouldn't say it's horrible. The major issue is the execution of the plot. The scenes seem to jump around a lot in time, and it really wasn't necessary. It was hard to tell if they were trying to go for some Memento-style reveal at the end or if they were trying to trick the audience into thinking related things weren't related and vice versa, but failed to do both. It's definitely not a movie to mindlessly watch, because you'll lose track of what's going on very quickly. But if you're desperate to see something that isn't the same Hollywood blockbuster as last week, then this might do it for you.","user":"krotkruton-447-902827","rank":[30,39]}]