[{"title":"Important and interesting film - must see","rating":8,"date":"4 November 2014","review":"The first thing everyone notes about this film is that it's Jon Stewart's directorial debut... and he did a great job. His characteristic humor is definitely present and rightly downplayed in deference to the serious subject. It flourishes when necessary, and when it does, his wit is as sharp as ever.<br><br>Stewart took some chances. Most importantly, he set the film in English instead of Persian with subtitles. While this brings a broader audience it diminishes the film's authenticity a bit. It's a calculated cost/benefit decision that I reluctantly agree with. The story is important and should reach as many people as possible. Still, he could have mixed in more Persian for a slightly better balance.<br><br>The language decision also opened the door to casting non-Persian actors, particularly the lead. Gael García Bernal played his highly nuanced character superbly but the role could have gone to one of many talented and available Persian actors. They would have added to the film's authenticity without sacrificing its artistic merit.<br><br>Once we get past these relatively minor language and ethnicity issues with the actors we find they are realistic and believable. To Stewart's (and Maziar Bahari's) credit, the Iranian officials are not the usual flat, black and white caricatures we love to hate in mainstream media; they are dynamic, regular people, crazed and ignorant to us, but \"normal\" in their own world. As Bahari said in an interview, even his torturer saw what he did as \"a job\", with benefits and overtime. This shifts the focus onto the corrupt institutions of the Iranian regime instead of mere personalities that can be summarily dismissed. <br><br>By countering the norm for demonizing all things Iran-related, Rosewater sets itself apart as a uniquely thoughtful, fascinating, important and relevant film.","user":"behzad-1","rank":[73,91]},{"title":"Power of good writing.","rating":9,"date":"28 June 2015","review":"I am pleasantly surprised when I find a well written film which relies on acting, enhanced by subtle art direction. So I was absorbed in this film from its beginning. The relationships between Maziar, his mother, his sister, his father, his Iranian peers and his persecutors are intertwined beautifully.<br><br>Gael Garcia Bernal is probably one of a handful of international stars who could light up this story with consistently excellent acting. Kim Bodnia and Haluk Bilinger are also part of that group. The cast carries the storyline which is rather uncomplicated and well worn. The political, cultural and social issues for Maziar Bahari are not. Bernal's interpretation of the tortured and isolated journalist is painfully realistic. It is not the over-the-top Hollywood version of blood, nudity and brutality. This sets this film apart.<br><br>I came away from the interchanges between Bahari and Rosewater with a better understanding of the repressed sexuality in theocratic Iran. Its patriarchy is twisted by its own harsh theology. The relationships between Bahari, his father and Rosewater could represent the core struggle between Iran's past and aspirations for its future. This is definitely a thinking person's film.","user":"paulcreeden","rank":[7,7]},{"title":"Outstanding","rating":10,"date":"29 August 2014","review":"John Stewart does an outstanding job skillfully portraying an incredible journey by a western journalist caught in the Iranian post-election revolt. a must-see thriller. The acting is captivating, and the sets are truly realistic as they filmed in the middle east. Definitely a work that will not be forgotten. This movie is particularly relevant with the current prosecution of journalists in Ukraine and the middle east. The audience is thrown into the riot environment with the amazing work of the directors. Jon Stewart does a great job. The actor playing Maziar is truly captivating. It is great to see an original film that captures some of the problems of our generation. Will look forward to Stewart's future works.","user":"mano2443","rank":[58,90]}]