[{"title":"Atmospheric","rating":8,"date":"8 June 2018","review":"After watching this film I read the reviews voted \"most helpful,\" which all were long lists of plot holes and logical inconsistencies. They are absolutely right. I didn't think about it while watching the film, but when it's pointed out, yeah, nothing in this movie makes much sense.<br><br>But I still really liked it. It's creepy and atmospheric and more concerned with the psychology of people on a suicide mission than on the nuts and bolts of scientific investigation. It's often intense , usually beautiful, well acted, and had some really weird and mesmerizing moments. <br><br>I won't argue that you should forgive it for its plot holes, or that it has any deep meaning, or anything like that. In fact, it's probably easier to make a convincing argument against the movie than for it. I'm just saying, I really liked it.","user":"cherold","rank":[720,953]},{"title":"Throw all logic out the window!","rating":2,"date":"10 March 2018","review":"First of all this movie was not confusing, nor was it thought provoking. I get the idea of morphology, the shimmer refracting dna and the idea of one's own self destruction to becoming something new/ different. Those ideas were cool, but that's not what I have issues with. It's hard to take this movie as a deep, intellectual movie when common sense and basic logic is all tossed aside.\nHere is a list of things that I couldn't get passed in this movies:<br><br>1. The team. Only one person had military training yet they were all given automatic weapons?<br><br>2. The biologist doesn't wear gloves when swabbing specimens? Who cares about contamination right?<br><br>3. Everyone they sent into the shimmer has died and never made it back except one guy who is dying and coughing up blood. They kept him in a quarantined area and wore hazmat suits around him, but they go into the shimmer unprotected?<br><br>4.This is a military/government operation, where's the military? It would have made more sense to send a team of scientist in with a team of trained military professionals. I get the girl power in this, but you could have sent them in with an all female unit.<br><br>5. You kill a giant, vicious mutated gator and decided the best mode of transportation is to get in the water on tiny row boats? People! We are talking about a gator that is on steroids and has severe roid rage! This place is a swamp!<br><br>6.Their idea of standing on guard at night is to have one person on the ground 200 ft away from everyone in a small guard shack that has no walls where something can grab you from all angles while everyone else was high up in a lookout tower. There was a balcony on the tower that had one set of stairs that went up it. That is where you put your guard.<br><br>7.Who the hell packed their gear? No night vision goggles? No secondary side arms? No masks in case of deadly spores? The side arms and night vision googles later in the movie were stripped from the soldiers equipment they found.<br><br>Now. I am not saying do not watch this movie. You can do whatever you want. It's your choice. You might like it and not be bothered by the things I listed.What I am saying is that I cannot agree with those that are praising this as the best sci-fi movie or that it's the most intelligent one. For every intellectually stimulating subject that's touched in the movie is quickly overshadowed by some boneheaded decisions and actions.<br><br>There are (in my opinion) better Sci-fi movies out there.\nArrival, Blade Runner 1 and 2, Ex Machina, Any Star Trek movie, District 9, 2001, Alien and Aliens, Predator, The Maze Runner, The Matrix, Close Encounters, The Edge of Tomorrow, Minority Report, Interstellar, Dune...<br><br>You want thought provoking movies?\nCheck out these:\nArrival, Memento, Fight Club, The Sixth Sense, The Number 23, The Count of Monte Cristo...","user":"cooltoys007","rank":[2,3]},{"title":"Strange, abstract, mesmeric","rating":8,"date":"14 March 2018","review":"I've thought about this film for days after seeing it. I don't even know what specifically I've been thinking about, all I can say is it left a big impression on me. I disagree with those who say it's intellectual. I don't think it is nor was it intended to be. It's visceral, primal, just like the world inside The Shimmer.<br><br>For me, films work on three hierarchical levels: at the very basic, they should be entertaining. All films should succeed here (but not all do, which is why we should rightly slam those that don't!). Then, there are films that are not only entertaining but also elicit an emotional response; they move us in some way. Finally, there are entertaining films that are moving but also have meaning; they resonate on a deeper, often metaphysical level. To my mind, Annihilation achieves all three.<br><br>Forget the plot holes. They exist in every film, otherwise they wouldn't be stories. Some of my favourite films have canyon-sized plot holes and inconsistencies. If you analyse any film you'll find them, and often you don't have to look very hard, e.g. Back to the Future. Do the plot holes and gaps in logic stop BTTF from being a great film? Not to my mind, because I'm invested in the movie. Plot holes only matter to me when they draw me away from the film; if it fails to entertain me.<br><br>Does the plot in Annihilation even really matter? The film is about the experience, the visuals and audio, the curiosity, the suspense. A world that could only be accessible to us in our imaginations is here brought to life on the screen. It asks a lot of questions but isn't interested in the answers. It's bold, brave, challenging. Some of it is spectacular, some of it less so. Naturally, that will split opinion, but we've become too accustomed to the ready-packaged \"Happy Meal Movies\" that the studios churn out for us. We're addicted to them like we're addicted to sugary fast food. We should welcome any film that attempts to wean us off that and broaden our palates. <br><br>This is a proper cinematic film, so what a shame it is that here in the UK (and many other countries) we were denied the pleasure of seeing it on the big screen. I can only imagine how even more beguiling and entrancing the experience would've been.<br><br>Turn off the lights, switch off your phones, and sit back and feed your imagination and sense of wonder. I know that's why I watch and love films. 8.5/10.","user":"ajwh-53593","rank":[735,1]}]