[{"title":"Nothing that original but it is tense at the right times and keeps you guessing just enough to make it entertaining & watchable","rating":1,"date":"1 March 2014","review":"\"Don't bite the hand that feeds you, understand.\" Hannah Lee Baker (Breslin) is a teenager who lives with her older sister Amber in her drug addicted Uncle's Donny's house. Her other Uncle Frank (Bean) runs the family business, a drug smuggling ring, with the help of his brother. When Donny's drug use threatens to get Hannah and her sister taken away Hannah comes up with a plan to pay the bills and keep things as they are. She goes to work running drugs for Uncle Frank, but the offer he gives her isn't enough so Hannah finds a way to make a little more money. This action affects the entire family. While this movie is actually much better then I expected I will admit that it is because of the cast. If the cast was not full of big name actors it would be a forgotten about B movie, but as it stands the acting really brings the movie up. Breslin does a great job in this and smoothly handles the transition to a more adult role very well. The movie itself isn't anything that original but it is tense at the right times and keeps you guessing just enough to make it entertaining and watchable. I did enjoy this much more then I expected to. Overall, nothing amazing or new but it is entertaining and worth seeing. I liked it. I give this a B+.","user":"cosmo_tiger","rank":[23,30]},{"title":"Blood is thicker ... so that's how thick headed thinking starts","rating":6,"date":"29 August 2014","review":"This is a decent thriller that is more than predictable. Even if you haven't seen too many of those you can see where it goes. It's still nice to watch, if not really that great. The actors do a very good job with the clichés they get to portray. It's the girl that has to carry the most (and you might have seen her in a few other movies already) and she pulls that off.<br><br>For a movie with \"Blood\" in its title, there is not too much in the movie though. Still the violence can be disturbing (especially one scene involving the always reliable \"crazy\" guy Vinnie Jones ... that's crazy in movies of course). Not the greatest movie, but decent","user":"kosmasp","rank":[11,15]},{"title":"Mediocre movie but a solid commitment of the actors and actresses","rating":5,"date":"1 September 2014","review":"\"Lose not the Queen, for ten to one... if she be lost, the game is gone.\" \"Wicked Blood\" is a standard mafia movie, but then on a smaller scale. The story of the teenage girl Hannah (Abigail Breslin) who's being taken care of, after the loss of her parents, by her uncle Donny (Lew Temple), which has the appearance of Dr. Emmett Brown from \"Back to the Future\" but with too much \"hillbilly crack\" in his system. And then there's also Uncle Frank (Sean Bean). Frank is the local bad guy and head of a mini gang of mobsters. Besides running a striptease tent he has also a lucrative business as manufacturer and supplier of crack. The one who assists him throughout the film is his somewhat crazy, retarded younger brother Bobby (Jake Busey),. Apparently Bobby became slower after Hannah's mother bashed his head with a baseball bat.<br><br>Hannah is a passionate chess player (something she probably inherited from Donny who once was State Champion), and she applies the rules of this game in her daily life. Thoughtful and with reason she performs every next move. Eventually, she devises a sophisticated plan to escape from this violent, drug-related world. Throw in an undercover agent, an assault on Hannah's sister and the final revenge, and you have a complete picture of this standard crime film. A film with a story like there are already a thousand made of.<br><br>And yet it's not an unpleasant film. And that's thanks to Abigail Breslin who manages to give shape to the character Hannah in a natural and wonderful way. She reminded me of Saoirse Ronan repeatedly. She also has that innocent look, that determination and the all-pervading calmness. Maybe Ronan outclasses her a bit but only with a small lead. Despite the fact that the whole story is a bit exaggerated, improbable at times and thinking about it after wards sometimes pretty laughable, the acting of Abigail Breslin was very convincing and plausible. A small, young girl only skilled in chess who goes to battle against a bunch of ruthless drug gangsters, who are not shy to liquidate someone who complains to much, is something that only could happen to Nancy Drew.<br><br>The one I enjoyed the most, was Lew Temple as the crazy, drug addicted low-life Donny. The chess games with Hannah briefly hinted a different picture of him though. That of a reasonably intelligent man who, because of past events and the current situation he is experiencing, recreated the individual as we see it now. The moments when he takes a shot (probably to check the quality) and starts to thrash about, accompanied by loud rock music, I found grandiose.<br><br>Sean Bean (Who I've recently saw in CleanSkin) looks like Boromir teleported into modern times. The same faraway look and stoic calmness he constantly shows. I expected him declaring a sentence like \"One does not simply ... steal my drugs\" any moment.<br><br>Despite the mediocre storyline and some irritating (The city where it all takes place is apparently so deserted and desolate as a ghost town along Route 66. Totally no inhabitants to detect) and hilarious (The FBI infiltrating such a crappy,small gang.) moments, it's still a movie you continue to watch. And that is merely due to the solid commitment of the actors and actresses.<br><br>More reviews at http://opinion-as-a-moviefreak.blogspot.be/","user":"peterp-450-298716","rank":[5,6]}]