[{"title":"More like 90 minutes of your life massacre","rating":1,"date":"27 August 2014","review":"First of all, when I saw the title Jersey Shore Massacre, I thought it was a movie based on the Jersey Maneater from 1916 - the great white shark that killed a few people, which is what Peter Benchley based Jaws on. It kinda made sense since Shark Week just ended. I thought someone was trying to piggyback on the popularity of that series. Then I saw the poster. Way wrong!!!! From the poster and the description, it looked like an indie that was so bad it's funny, which could make it rather entertaining. Boy, was I wrong, again. The cast includes pornstar Ron Jeremy. He's only in it for a few minutes, but he's the best actor in it, which kinda gives you an idea of how bad the movie has to be. The opening scene includes a topless, big boob blonde, and it's produced by JWow, telling you all you really need to know. It has a stereotypical gay man in the beginning who has a feminine Spanish accent and gestures like a woman. Oh yeah, and he works as a hairstylist. I guess they thought it would be funny, it's not, just stupid. Gays should be insulted by the character.<br><br>I'm not sure if they could've hired six more repulsive girls - nine if you count the three Hispanic chicks who were only in it for a short time. The script was stupid. An example: \"None of us eat meat,\" says one girl. Another adds, \"Yeah, we're all veterinarians.\" Eye Roll. One of the girls wears a big, gold \"SINGLE\" charm on her necklace. Gee, I wonder why she's single. (sarcasm).<br><br>When the tramps...I mean girls go to the beach, they meet a bunch of guys who one might mistake for Sha-Na-Na, except these guys can't sing and can't act. One of the girls has to relieve herself quickly, so she runs into the ocean and does a number 2, which some guys proceeds to step on. Was that supposed to be funny? It wasn't. That was really gross, unnecessary, and it showed a total lack of any sort of talented writing, and that's 39 minutes into the movie, with almost another 50 minutes left :( In the nightclub, the tramps...sorry, I mean, girls are dancing, and they get into a fight, and the bouncers suspend them from the club. I was wishing they'd suspend them from the movie. Could they have drawn up characters that were more disgusting and obnoxious than these girls and guys? I have my doubts.<br><br>The movie has plenty of boobs, butts, blood, gore. The tough jocks are anything but tough when danger is near. There's a shower death, a tanning bed death, and many others. There were so many horror clichés used, they could've called this Cliché Massacre. Clichés are not necessarily bad, but there was nothing good about this movie. And no, it was NOT one of those \"It's-so-bad-it's-funny\" movies. I was rooting for the killer, even though they gave no reason for him killing people. When I brought up the Jersey Maneater at the beginning of the review, I really was hoping a shark, piranha, rabid squirrel, insane fleas, anything would kill these characters. They were poorly written, extremely underdeveloped, obnoxious as hell, and the storyline was anything but original. The script sucked. The acting sucked. It would be a shorter list if I say what DIDN'T suck. Actually, that list doesn't exist. I didn't expect to give this a 5-star rating, but I thought I'd be able to give it at least 2, maybe 3. Nope. This is a 1-star movie, and not even a solid 1-star at that :/","user":"chrismackey1972","rank":[31,56]},{"title":"Complete Garbage _ JWow not producer material","rating":1,"date":"13 September 2014","review":"First off, you can see that it is someone without much experience trying to produce a low budget movie. The acting, if you can call it that is pathetic. I would venture to say, the producer had her friends get together and attempt to make this poor attempt at a horror movie. The intro didn't seem to have anything to do with the rest of the film, usually there is something that relates to what is coming up. This intro made it seem as though there was going to be another direction for the film to take. They tried to make a Mafia film, then turn it into a Friday the thirteenth sort of horror flick, with a bunch of no talent fairly unattractive New Jersey girls. Later we meet the just as dumb Jersey boys that are in the film, and sadly their attempt at acting is probably worse than that of the girls. Not all people from NJ, are complete idiots and talk like they only made it as far as the second grade. The plot was ridiculous, and to top it off you have Ron Jeremy as the only (Famous) lol, actor in the film. DO NOT WASTE YOUR TIME with this piece of junk.","user":"stmichaelwarrior","rank":[7,11]},{"title":"Not the Best but not the Worst","rating":6,"date":"8 September 2014","review":"This movie was way better than I though it would be. I have seen a lot of crappy horror flicks but this one was not one of those. This movie was one of those Comedy Horror type movies. Lots of gore and lots of boobs. Plus this movie will be a plus for us Howard Sterns fans as they are some cameos by Stern staff and whack pack. if you have nothing to do on a weekend and want to see a decent horror flick than this wont disappoint.<br><br>Also I have to say that the acting in this movie was not to bad. You usually get really cheesy actors to do these types of movies. To my surprise it was actually pretty good. A thing that low budget horror flicks suffer from is crappy FX. This movie delivered when it same to special efxs. Listen hands down the movie is pretty decent for a view when there is nothing else to see and if you are a Howard Stern fan.","user":"robbyrobmusik","rank":[5,8]}]