[{"title":"Average action thriller","rating":5,"date":"12 September 2018","review":"This is a passable action thriller. As many review have indicated, it is pretty much a Attack on Precinct 13 storyline. Once it gets going, the action is pretty consistent. Why only 5 stars? One unnecessary character was tasked with blurting out non-funny comedic one liners. Very few films can mix gun action and comedy successful, while maintaining the required tension(DieHard and Lethal Weapon did it best). This movie did not. So too many scenes where you are trying to slightly be concerned with someone's safety, dumb one-liner is inserted for no reason at all(think JarJar Blinks). Outside of that, it could have been a decent action movie.","user":"elliotte2","rank":[5,5]},{"title":"Sharp Comedy and Balls-To-The-Wall Action!","rating":7,"date":"15 October 2015","review":"As a fan of 80s and 90s action movies, I had an absolute blast with this movie. Fans of that era/genre will no doubt love this movie and all that it has to offer. The film stars Dominic Purcell as David Hendrix, a hardcore, highly skilled detective forced to assist Hollywood actor Brody Walker (Cody Hackman) with his court-mandated sentence. After a recent run-in with law, Walker has been sentenced to ride along with a police officer instead of doing real time in prison. The gruff, no-nonsense Hendrix and the smart-ass, wise cracking Walker definitely butt heads, but are forced to put their differences aside when a criminal attack occurs at a police station.<br><br>This highly lovable throwback by writer/director Allan Ungar, who co-wrote the film with Rob Robol, wears its obvious influences on its sleeves, but has enough original and modern charms of its own. The film may deliver plenty of laughs, but the violence and action does get gruesome and realistic. Still, Ungar and Robol do great work in balancing the two, though a small amount of the jokes fell flat for me. The movie boasts an amazing cast in addition to Purcell and Hackman which includes Stephen Lang, Trish Stratus, Danny Glover, Vinnie Jones, and Saul Rubinek. If my positive review still hasn't persuaded anyone to seek it out, three words: Funky Cold Medina!","user":"hueyshadwell","rank":[26,38]},{"title":"Great 90's Style Action Movie","rating":8,"date":"9 June 2016","review":"I originally heard of Gridlocked through the website Twitch, who had said that it was like a throw back to 90's action movie. They were not wrong. Felt like I was watching an old PM Entertainment movie. The only thing missing was an appearance from Jeff Wincott.<br><br>Originally I was a bit apprehensive, as star Dominic Purcell has not got the best track record. No fault to him, as he is always a welcome presence, but his films of late have been poor. This may be down to the fact that they have mainly been directed or produced by Uwe Boll.<br><br>Luckily there are no such drawbacks this time round, with great production values, and excellent action scenes, this is definitely one of the better DTV actioners I have seen in a while.<br><br>Performance wise, Purcell is his usual reliable self as the lead. Stephen Lang is great as the villain, although could have had a bit more screen time. Danny Glover gets limited screen time for his usual too old for this role. WWE superstar Trish Stratus still looks great and gets a number of decent action scenes, and Vinnie Jones is thrown in for good measure.<br><br>The only drawback is Cody Hackman, as the film star that has to work with Purcell as part of his Community Service. He can be slightly annoying, and the fact that he is playing an A list movie star, it would have been better to get someone that has movie star quality. This is a minor problem, and with the rest of the movie being of higher quality than usual, its not much of a complaint. Surprisingly Hackman is a karate champion, but he actually doesn't really participate in a lot of the action in the film.<br><br>There is a slight slow build to the siege part of the film, but once it begins it doesn't let up, with there being a number of violent shootouts taking place. The film definitely earns its R rating. The Director is going to be someone I will be keeping an aye on.","user":"darrenmurray84","rank":[19,31]}]