[{"title":"Sub-par suburban Canadian horror","rating":3,"date":"9 November 2014","review":"Twenty minutes in, I decided to go clean my kitchen instead. That should give you a good idea of how good this movie is.<br><br>Let's use the \"things I learned\" motif:<br><br>Balcony railings collapse no matter what force is applied.<br><br>A body in motion tends to stay in motion unless you are the good guy. <br><br>Barricading a house necessitates a montage. <br><br>Livestreaming vloggers stay on line until someone sends a video chat. Go ahead. You are undoubtedly the first one to think to do this.<br><br>Never trust a guy named Chad. Even if he is Canadian. Especially if he is Canadian<br><br>A glass sliding door will only ever be used once as a means of entry. <br><br>A person choking next to you should never distract you from web-surfing. <br><br>Christmas tree lights are remarkably strong. <br><br>College students don't swear nearly as much as you remember.<br><br>It's really hard to tell the difference between the aftermath of a really good New Year's Eve party, and a home invasion.<br><br>I don't have any quibbles with the fictional cause of the outbreak, its effects or its treatment. We long ago gave up on any sort of logic about those things in these types of movies.<br><br>It is hard however, very hard, perhaps even impossible, to make your protagonist both adorable and bad-ass. But I'll be damned if they don't try.","user":"forgetful_man","rank":[13,17]},{"title":"Clever","rating":6,"date":"28 October 2014","review":"Five university friends gather at a house party to ring in the New Year. Unbeknownst to them, an epidemic has erupted outside, causing outbreaks around the world.<br><br>Scott Weinberg of Fearnet says, \"If you can get past the fact that the flick is composed of 75% recycled ideas and 25% new ones, you may find that something to like.\" Sounds to me like Weinberg does not understand how the horror genre works -- few movies today have less than 75% recycled ideas. Why gripe about this one? <br><br>Indeed, this was an interesting satire and attack on social media. Silly, maybe, and certainly nothing that can be taken too seriously. But not the terrible film critics (especially Rotten Tomatoes) makes it out to be. When compared to the technology-themed \"The Den\", this is the more mature and accomplished approach to the Internet Age.","user":"gavin6942","rank":[9,11]},{"title":"Not bad.","rating":6,"date":"28 November 2019","review":"Whenever I see a horror movie on IMDb rated between 4.0 - 4.5 I can be sure it's going to be fairly decent budget at least, as even the best horror usually doesn't crack 7+.<br><br>This isn't the most original story ever, but as far as \"zombie\" flick, you gotta give it some credit for not being the exact same as 99% of zombie films.<br><br>The story itself is just okay, but enough to keep you watching. 6/10<br><br>The budget was solid. No iPhone 4s filming. 8/10<br><br>Acting...it was fine. 6/10<br><br>Overall it kept me entertained and if someone brought up the film, I'd remember it more fondly than negatively. Take that for what it's worth. Also, I think this was much better than the sequel.","user":"mvike","rank":[4,4]}]