[{"title":"Different Ashes","rating":7,"date":"24 June 2018","review":"Hubert Monteilhet's novel has been filmed three times I saw two of them. The 1960's Return From The Ashes and this one, Phoenix (2014) - the one I haven't seen is a TV version from the 1980's Le retour d'Elisabeth Wolff, but now I really want to see it. Phoenix is a moody, painful journey to a rebirth. Nina Hoss is lovely as the survivor, Ronald Zehofeld plays the husband, object of her obsession. He's an interesting actor, a mix between Benicio del Toro and the young Orson Welles. Their scenes together have a realistic, tangible suspense. But Christian Petzold, the director of Jerichow (2008), gives the whole film a severe pace and tone, the 1964 version has a sharp, sophisticated script by Julius J Epstein with titles like Casablanca to his credit and J Lee Thompson at the helm, Thompson directed films like The Guns Of Navarone, Cape Fear and What A Way To Go. So his version, Return From The Ashes, is a whole other experience, at time it's even funny. With a superlative international cast cast, Maximilian Schell, Ingrid Thulin and Samantha Eggar - So one can see both films as it they weren't even related.","user":"arichmondfwc","rank":[25,28]},{"title":"Great acting and interesting themes propels this simple and successful film.","rating":8,"date":"13 September 2015","review":"Phoenix: Ziemlich großes Kino!<br><br>Phoenix is a simple film with complicated themes of identity, survival, and loss. It is not your normal post WWII film, nor is it your typical concentration camp survivor story. The main character, Nelly, was in a camp and her trauma is reflected in the desperation of a divided Berlin. Her interactions with others are clearly influenced by her time in the camps, and Nina Hoss wonderfully portrays the protagonist. <br><br>Unfortunately, the actor who plays the lead male, Johnny (Ronald Zehrfeld) is relatively ineffective compared to the stunning Hoss. I am not sure whether is is the script or the acting, but he clearly isn't up to her level. Nelly's best friend, Lena, is performed with skill by Nina Kunzendorf. While not as remarkable as Hoss, she holds her own in their scenes together. <br><br>The look of the film is lovely, but it is clearly made on a budget. The music is appropriate for the mood and the era, though a couple of times too loud and overly dramatic. The pace is deliberate and effective. <br><br>It is a good film that offers us no answers to the questions it poses: how do we survive after everything is taken away, how do we return to a life that no longer exists, whom do we trust now when many of our old friends were Nazi or collaborators during the war, how do we react to someone who returns who we thought was dead, and where do we go when nothing is left of our former life. In the film, like life, there are no easy answers. That only strengthens the film's appeal. <br><br>Rating: Pay full price. <br><br>I don't want to say to much for fear of giving too much away. The film, while not shocking, is not predicable. <br><br>Peace, Tex Shelters","user":"texshelters","rank":[29,33]},{"title":"The curtain descends, everything ends....","rating":9,"date":"28 January 2015","review":"Will the references to Alfred Hitchcock's Vertigo never end? A very  blatant citation is in David Lynch's Twin Peaks, with Sheryl Lee  playing both blonde victim Laura Palmer and her cousin, brunette  doppelganger Madeleine. Before and after that, there have been several  instances, some more successful than others.  Christian Petzold's glorious war drama, \"Phoenix\", falls firmly into  the first category.  Disfigured Jewish musician Nelly Lenz (the ever luminous Nina Hoss) has  to undergo a painful facial reconstruction, after having survived the  horror of the concentration camps.  Helped by close friend Lene (Nina Kunzendorf), Nelly slowly comes back  to life, but her main goal is to find her beloved husband, Johnny  (Ronald Zehrfeld).   We are at the end of World War II and Berlin is nothing but a heap of  rubble. People roam the streets aimlessly and, among the destruction  and the uncertainty, there is a sense of a nation having lost its  identity.  Nelly looks at herself in a mirror and sees a stranger and when Lene  tells her \"You're Jewish\", as if to assert at least one undeniable  truth, Nelly refuses to accept it. The only thing that tethers her to  reality is the love for her lost husband and she stumbles on him by  chance, working as a busboy at the Phoenix cabaret. He doesn't  recognise her, but acknowledges a passing resemblance to his allegedly  dead wife. Nelly is heartbroken, but doesn't have the courage to reveal  the truth.  Johannes (who is not Jewish and no longer wants to be called Johnny)  knows that his wife has an unclaimed fortune in a Swiss bank, so he  devises a plan  and here's the Vertigo nod  to transform this  stranger into his dead wife. Nelly agrees to the plan, hoping that by  living at such close quarters, he will eventually discover her real  identity. He doesn't.  Even when it becomes quite evident that, as Lene suggested, he'd  betrayed her to the Nazis, Nelly keeps her side of the bargain, growing  more confident as she resumes her former identity, as she struggles to  be the woman she no longer is.  The finale is powerful and moving: I won't reveal it, but I'll just say  that it involves a tattoo and a Kurt Weill song. It will stay with you  long after the words \"the end\".  The premise of \"Phoenix\" is obviously rather far fetched, but the  acting, cinematography and direction are all stunning and I am quite  surprised the film has not been more widely praised (I was expecting it  to get an Oscar nod).  Nina Hoss, who is a Petzold regular and was great in \"Barbara\", gives a  career-best performance, fine-tuning the metamorphosis of the character  from haggard and desperate concentration camp victim to brittle, yet  strong and confident survivor. A real Phoenix, rising from the ashes of  a past that can no longer be recreated.  Ronald Zehrfeld, who also starred in \"Barbara\", is wonderful as  Johannes, a man whose refusal to see what's in front of his eyes is  steadfast at first, but slowly crumbles as the film unfolds, and  finally collapses in an emotional reveal that the actor depicts with  understated emotional mastery.  But the real star of the film is the director, the fantastic Christian  Petzold, who has crafted a moving, intelligent and unforgettable story,  one that never tries to cheaply tug at your heartstrings.  Regardless of his historical setting, it's a universal tale that tells  of how we all strive for identity and meaning and of how, in the face  of the worst possible betrayal, we can still find the strength to turn","user":"leigh-marker","rank":[61,76]}]