[{"title":"Great fun !","rating":8,"date":"13 September 2015","review":"Seen at the Etrange Festival where it won the Audience Award. One of the coolest stoner comedy with a - as always - fantastic Ron Perlman and a Rupert Grint who obviously wanted to exit from the Harry Potter era. Regardless of the subject, this movie was for me an enormous laugh from the opening credits to the very end. It was even better because I didn't know anything about it, in particular that it was a comedy. Ron Perlman is sent by the CIA to England to shoot a fake movie of the moon landing directed by Stanley Kubrick in case of failure of the Apollo 11 mission. Of course, nothing happens as expected. Don't expect Citizen Kane, but I hope you will enjoy it as much as I did.","user":"acromegalix","rank":[70,82]},{"title":"Laugh out loud hilarious!","rating":9,"date":"14 January 2016","review":"MOONWALKERS is the first funniest movie of this year even though we just started on 2016 but I'm confident enough to shout that aloud because it really is going to be tough for other comedy films from this point forward to top MOONWALKERS. It's so outrageously funny, you're going to be gasping for air from laughing too hard.<br><br>Written by Dean Craig and directed by Antoine Bardou-Jacquet, the legendary Ron Perlman plays an unstable CIA agent, he's a Vietnam war vet suffering from post-traumatic stress disorder, but he's been assigned by the agency to locate and hire filmmaker Stanley Kubrick so that Kubrick would film a fake moon landing just in case America's actual moon landing fails. One unsuccessful rock band manager (Rupert Grint) and his confused friend (Robert Sheehan) see this as an opportunity. But things get complicated.<br><br>It's part con man comedy, it's part gangster comedy, MOONWALKERS is basically something that Guy Ritchie would concoct back in the day. And on top of that, the story is set in a psychedelic era, so it adds to how fun and unpredictable MOONWALKERS can get, you see these characters who are in way over their heads, and a war vet who's just aching to unleash his frustrations. It's a comedy that relies on mistaken identity, misunderstanding, and ignorance, MOONWALKERS doesn't try too hard to make you laugh because the characters themselves are already doing a fantastic job at that. Well-written, well thought out and well-acted, Rupert Grint and Robert Sheehan have excellent comedic timing, Perlman's take no-prisoner-approach is entertaining. I haven't laughed this hard since 2007's \"Death At a Funeral,\" it's good to have that feeling back.","user":"Ramascreen","rank":[35,42]},{"title":"Moonwalkers: an enjoyable flick.","rating":7,"date":"17 January 2016","review":"Looks like an American film but is not: although shot in English, is a French-Belgian production on the script of English screenwriter Dean Craig.<br><br>It's a funny and ironic film, celebrating the psychedelic atmosphere of the swinging London (we are in June '69). You won't really laugh but you will have a good time watching: who doesn't like to watch magic mushroom-eating guys playing the good ones?<br><br>Everybody acts sensationally and the characters are so good that you will easily imagine a sequel. One word about the cast: Ron Perlman and Rupert Grint steal the scene but males will surely also notice beautiful Belgian actress Erika Sainte, previously unknown to greater American and British audiences","user":"niutta-enrico","rank":[23,28]}]