[{"title":"Action adventure on a budget","rating":5,"date":"1 March 2018","review":"While this movie wasn't \"great\", I gave it 5 stars for mixing fact and fiction with liberal doses of Zachariah Sitchin and Eric Von Daniken stories of Mayan mythology intertwined the \"Gods\" of ancient Mayan codex with a dose of Nibiru and Annunaki lore for good measure. <br><br>Acting isn't bad and could have done more with substance in the storyline.<br><br>I enjoyed that they used the current resurgence of interest in ancient archeology as the basis for this adventure action film, as there is many many places left to reveal in the South American jungles still hidden from modern eyes. No matter how corny some may see this movie as, there is an interesting mix of truth and storytelling introducing Reptilian Archons (AKA evil mirrored Chitarauri) as the exo planetary dopplegangers of every human soul, laying dormant until released by bumbling hands.<br><br>Made by a better Director or with a bigger investment this movie could have been absolutely brilliant with a lot of potential. As it is, this is a fun adventure story that should not be thought about too deeply.<br><br>Well worth 5 stars for it's overall content and potential. Not for it's casting, acting or average editing and cinematography.","user":"dubwize","rank":[15,20]},{"title":"There's a reason it's only 2 stars","rating":2,"date":"23 April 2019","review":"The best thing about this film was the Bolivian Angelina Jolie in short shorts. Basically some William katt impersonator takes a bunch of ppl into a jungle cave and unleashes some rubber lizard people who only show up in the last 5 minutes and never really do anything. This no-budget movie spends an hour getting u worked up, then tells u it's got to go home and leaves u hanging.","user":"jfost75","rank":[3,3]},{"title":"Had potential - wasted it brilliantly","rating":2,"date":"4 March 2018","review":"First clue that this wasn't going to be a good one was the intro-sequence that took 10 mins...<br><br>To be fair - I thoroughly enjoyed how the cast switched from English to Spanish to Mayan (or something made up ?) seamlessly. No extraordinary accents, nothing so thick you couldn't make it out. Just a bunch of actors with great language skills !<br><br>When 4/5 of the movie has gone by the diving and action starts taking place...the CGI and effects were effective and surprisingly good but not enough to save the movie....<br><br>SPOILER ALERT\nAlso an extreme logical blunder that really ruined it for me. WHY is it necessary to hold on to a timed explosive device to \"fight them off as long as possible\" ? Set it and forget it - run you fool ! Or in this case - swim.<br><br>Also - why collapse the walls and stuff when 3-4 of the aliens ALREADY has pass you by and you just MIGHT NEED to know more about the containment devices used ??? Seriously - some scriptwriter was sleeping during class and when writing the script...ruined even more of the movie for me.<br><br>Gave it a 2-star because of the actors doing a good job...perhaps even great given the material - hope to see more of them later !","user":"imdb-13014","rank":[8,12]}]