[{"title":"Of all films ever...","rating":10,"date":"27 September 2014","review":"Absolutely loved this film. I laughed, I smiled and I cried. <br><br>The script is quirky and wonderfully imaginative. In an hour and a half 'What we did on our Holiday' manages to dissect family life and reconstruct it to embrace every aspect of the complete gamut of the generations and their interactions. And it does so with both sympathy and hilarity. <br><br>Of all films ever, it's the one that has made me feel best about being human. Flawed is fine in each and every generation, but the beginnings and endings are infinitely easier than the muddle in the middle. <br><br>The acting throughout is exceptional but the child actors deserve a sky-fall of medals. Great stuff!","user":"helen-holdsworth-118-75529","rank":[112,124]},{"title":"Funny and philosophical","rating":8,"date":"27 September 2014","review":"Brilliant acting by all 3 children. Many clever lines that had the audience laugh out loud. Super Scottish scenery and great advert for Wester Ross as a wonderful escape location, Slightly contrived happy ever after resolution but good light hearted family viewing. Great ostriches. And a view of kids grasp of the adult world. Enjoy the violin playing and jig at the end but bring air plugs for Thr practice sessions. Traditional portrayal of Scottish rural police! Imrie is in her element as a small character role; heart warming.<br><br>Good look at family dynamics and relationships. Connolly plays a wonderful loving Grandfather who shows wise approach to difficult members of his family as he comes face to face with his own death.","user":"milton2808","rank":[67,73]},{"title":"Moving, Funny and Family Friendly","rating":9,"date":"30 September 2014","review":"We all loved this - me, my friend and my 2 daughters, 13 and 11. It's about a warring couple on the brink of divorce who take their three young children on holiday to Scotland to visit the husband's father, who has terminal cancer, on the occasion of his 75th birthday. It turns into an even more surprising birthday than anyone has imagined. David Tennant, Rosamund Pike, Billie Connolly, Ben Miller and Amelia Bullmore are all wonderful actors playing their parts to perfection and the children were as stunningly natural and funny as the children in the TV series Outnumbered. Andy Hamilton and Guy Jenkin had a great idea and have turned it into a funny and moving film. An extremely poignant scene was beautifully acted and directed and there were a fair few belly laughs as well as tears shed. There was some swearing but nothing worse than they hear routinely at secondary school, so though it was rated 12A I was never uncomfortable I'd taken my 11 year old daughter. Go and see it!","user":"neilandjo-120-342587","rank":[62,68]}]