[{"title":"Rapturous Choices","rating":5,"date":"25 September 2014","review":"It was the wedding day of Dan and Skylar. Their best friends were all there: the best man Jack, the maid of honor Allison, and the photographer Tommy. Everything was going on perfectly until suddenly, a lot of people suddenly dropped to the floor dead. This was followed by a series of disasters of such magnitude the world had yet not known until that time, killing even more people. <br><br>All five friends survive and seek shelter with other survivors in a church. There they begin to realize what this major worldwide catastrophe was actually the Rapture previously described in Biblical prophecy. As they eventually realize the true meaning of these events, important spiritual decisions will have to be made in order to determine which life they will choose to live. <br><br>While this was still very much a B-movie, writer/director Casey La Scala did well in telling the story at a fast clip. The atmosphere of suspense and tension were effectively developed. The special visual effects were pretty good considering this was film with no name actors to speak of. La Scala did well not to blatantly show those supernatural beings which snatched people off to the sky. I must admit though that the shaky camera work did make me dizzy a bit, so I could not keep my eyes on the screen all the time.<br><br>Though it was not obvious from the title nor the trailer, this film is actually a vehicle for Christian preaching. The message was not subtle. It is out there for the audience to listen to and reflect on. I do not think I have seen such a horror film with an overtly religious intent. As a Catholic, I did not mind it. However, if you are one of those who do not like religion mixed with their film entertainment, this will not be for you.","user":"3xHCCH","rank":[66,91]},{"title":"As Advertised","rating":6,"date":"9 February 2015","review":"Unlike the people that were complaining that they didn't know this was a Christian movie, I read the description and watched the trailer. It clearly mentions judgment day and the preacher calls it the Rapture. I had no doubt what this movie was about. I also enjoyed that it was a Christian themed movie. Not a 100% biblical it still gave a sense of the rapture. For Christians that like the horror genre this was a good little movie about the choices we make even if it causes us suffering, we have to choose.<br><br>The acting was okay for this type of movie. The special effects were pretty good too.","user":"dwright3271","rank":[21,28]},{"title":"Don't Waste Your Time!","rating":1,"date":"14 February 2015","review":"The whole end of the world biblical rapture story fascinates me. Naturally I wanted to give this a chance. Lord was I wrong! This was just bad.<br><br>The movies begins with this couple getting married and their close friends are all in attendance. Minutes later people are seen dropping to the floor, the building begins to shake and all of this destruction rains down upon them. Now usually in a rapture situation the person disappears leaving just their clothes behind, but this one is different. The bodies just fall and their eyes glaze over so you assume okay their spirit is what left.<br><br>Anyway so the ones who are left behind see this and it's like they really don't care! They just immediately run outside and buildings are collapsing and hail is falling from the sky. One guy casually says \"Oh are we under attack from aliens!\" And then they look for a bible and one of the girls with fake tears reads a passage from Revelation and they are all just so causal about it.<br><br>The story and the bad acting just ruined it. The characters didn't know how to react to a situation like \"THE END OF THE WORLD!\" Here you are under attack from these flying demons and people hiding in this church are just kinda hanging out and chatting like it's a bright sunny afternoon. The pastor is sitting at the front of the church with a crazed look on his face. He looks more like a bum. And then they gotta throw in a woman having baby in the back. Acting was over the top and just every situation looked thrown in for nothing. No real sequence of events. Made no sense to me. <br><br>The special effects were about the only impressive thing about this film. It was old style movie making with real props and sound effects. It was effective and good for a low budget film.<br><br>But do no not waste your time with this crap unless you are just easily entertained. If you want to see a good horror end times movie then I recommend Tribulation with Gary Busey, Howie Mandel and Margot Kidder. Strong acting, good story and I think secular audiences can enjoy it very much despite it being a film geared from Christian audiences.","user":"yauchiejo","rank":[47,70]}]