[{"title":"this film seriously offends me","rating":1,"date":"18 September 2016","review":"I wanted to throw my popcorn at the screen!! This is cash grab garbage, crock of s***. The director has turned Bruce Lee into a caricature. This is spitting on the memory of Bruce Lee. As a loyal fan of Bruce Lee and as an Asian, this film seriously offends me. ENOUGH! We in the Asian communities will make sure this film earns ZERO dollars. The script is shockingly dull and absurd, the fight scenes aren't exceptional, the stunt guy who plays Bruce Lee captures zero essence of Bruce Lee, his acting pure ham. The director should go back to writing to spare us further torture. ******** BIRTH OF A DRAGON is NOT sanctioned by the Lee family ******** http://www.yomyomf.com/your-1st-look-at-birth-of-a-dragon/","user":"chrisleeisworking","rank":[191,288]},{"title":"Misses the Mark","rating":1,"date":"28 September 2016","review":"It's been 23 years since the last major Hollywood biopic on Bruce Lee. While we're a full generation forward, the 20-odd year interval wasn't sufficient to outlast the durable media biases that afflict how minorities, in this case, Asian-Americans, are depicted. <br><br>Birth of the Dragon will pull in fans off the street by claiming to tell the story of Bruce Lee, an iconic figure in American history. However, they may be surprised to find that the movie actually has very little to say about Lee. About his love life. About who he is as a human being. In fact, he is dealt with in such a stylized, mysterious manner -- and not as a full human being -- it's unclear the movie gives the viewer anything more than he already knew. Instead, Lee's primary purpose is to serve the white protagonist Steve McKnee in various ways.<br><br>First, the film gives short shrift to the actual epic fight between Lee and his rival. We do not even know how that fight impacted Lee's life afterwards, what he learned from it, or how it changed his fighting style. But we do know Lee went through all that trouble, and the animating force behind it was that Lee's rival was against Caucasians like McKnee being trained to fight. What's happening here is that - this really isn't about Lee. It's more about some character we've never heard of but somehow has the country's greatest martial arts fighter fighting on his behalf.<br><br>It doesn't end there. Lee, a role model for Americans, including Asian-Americans, is seen as flat. He is shown as without a romantic interest. In contrast, McKnee has an Asian Girlfriend...and lo and behold he needs Lee to fight for him again to get the girlfriend back after she's abducted by \"bad Asians\". And Lee does.<br><br>I think we came to watch Bruce Lee. Not Bruce Lee aid some random fictional nobody on his mission to belong, and then his mission to get back said nobody's girlfriend.","user":"omegle-66767","rank":[121,184]},{"title":"I am Asian American - Why I LOVE this movie!!! (Why it's not ONE dimensionally all Bruce)","rating":10,"date":"22 August 2017","review":"I have seen all of his movies. Yes, even \"Dragon-The Bruce Lee Story.\" First, I am NOT racist toward anyone because I am friends of all races! This is NOT racist toward Asians as MANY of you suppose because it's from 3 people's angles!<br><br>Stop focusing on what is dividing this country today because this country is made up of EVERYBODY, and all colors. <br><br>Here are the 3 angles: This was a 3 dimensional movie about how people grow (not literally) because of 3 main characters: #1 Steve - He went from \"I learn Kung Fu to gain respect,\" (self) to \"I am willing to die for someone else.\" (love others unconditionally). Personally, he was a stumbling, bumbling quirky guy with a quirky Asian friend (there were amusing parts to their characters.) #2 WJM - He learned from nearly killing someone to being able to have self control. Thus, he liberated himself from his tormented past. (Wouldn't it be nice to learn from your past and be victorious when presented with a similar challenge?) #3 Bruce - He went from bragging all the time to learning some humility and maturity (even working together to form 2 heroes that saved many women's lives in the end.) He learned how to liberate his own style and re-create himself so he definitely grew into an even more awesome martial artist and STAR.<br><br>What a powerful, inspiring life message for us all! THANK YOU director for honoring these things: respect for one another (WJM and Bruce), teamwork, living unselfishly, wisdom of Kung Fu, self-actualization. Asians win, Whites win. the beautiful Asian art of Kung Fun wins. Win - WIn.","user":"noll-249-396697","rank":[48,72]}]