[{"title":"The Ultimate fiftieth celebration.","rating":8,"date":"23 November 2013","review":"I have just finished watching the doctor's fiftieth anniversary celebration 'The Day of the Doctor' and it is a wonderful tribute to the longest running sci-fi series in history.<br><br>The fiftieth anniversary is full of 'spoilers', see what I did there. So on the off chance you haven't see it yet, it is the team-up of the two most famous doctors since the reboot in 2005 and has them revisiting the 'moment that defined him' .<br><br>The TV show lasts one hour and fifteen minutes, a perfect length and is full of twists and turns and brilliant fan service and dialogue. It is a tribute to all the doctors from past, present and future and combines humour, emotion and brilliance in a fabulous concoction.<br><br>'The day of the doctor' is a television event that won't easily be forgotten and is the ultimate way to celebrate 50 years.","user":"jgarbett-510-54203","rank":[98,109]},{"title":"Steven Moffat's Best Yet?","rating":9,"date":"23 November 2013","review":"Steven Moffat has been a mixed bag at times. His scripts for \"A Christmas Carol\" and \"The Girl In The Fireplace\" are two of the better episodes in recent years. Sentimentality suits him. But when he goes to great lengths to explain the mythology of Doctor Who and begins creating new connections to the past, he can also be quite wordy. The entire last season has been victimized by this and most of the episodes were less than satisfying. We just want an adventure, not a treatise on Who history or an impossibly tangled web of River Song and a dozen other characters.<br><br>But this time, he pulled it off. While this past season, topped by \"The Name of the Doctor,\" seemed to be painting him into a plot heavy corner, \"The Day of the Doctor\" unwinds the whole mess nicely and adds just the right amount of clever twists and, most importantly, delights us with its sense of humor. Suddenly, it all makes sense.<br><br>To add to the fun, this is one of those times when more doctors actually ratchets up the good time. Plus there's at least one wonderful surprise cameo to top it all off. A good time for all. Highly recommended and makes watching the previous season well worth it. This may be Moffat's best script yet.","user":"Br007","rank":[93,110]},{"title":"Confusion 'No more'","rating":10,"date":"23 November 2013","review":"Just finished watching the day of the doctor, and my God!!! I've waited a LONG time to feel what I am felling right now. By far, this episode was the best one yet in the Doctor Who series. <br><br>Before I saw the episode, I was both excited and worried at the same time because I did not want to be disappointed after waiting for so long to see it after watching the teaser trailer. But Setven Moffat pulled it off, and in a way you can never imagine. He takes us for a ride into the realms of Gallifrey with such detail and yet with the hint of humor. <br><br>I can swear that there were more than one instance where I had tears of joy in my eyes. This is by far the only episode/show/movie where I have given a solid 10 on 10 on IMDb till date.<br><br>If you haven't seen it yet, mark my words, \"you are in for a treat\".","user":"pirateatbay","rank":[50,58]}]