[{"title":"The Riot Club is a riot","rating":7,"date":"22 September 2014","review":"Founded in approximately 1780, the Bullingdon Club were notorious for booking out a restaurant, trashing it beyond recognition and handing the owner a cheque for the damages on the way out. The unofficial club, which still exists today, consists of a select group of male elites at Oxford University and is the inspiration behind the latest cinema release, \"The Riot Club\".<br><br>The Riot Club begins with the group looking to recruit two new starters, as Alistair (Sam Claflin) and Miles (Max Irons) emerge as possible candidates. However, over the course of a single evening, the club's reputation is put on the line.<br><br>The film itself is very much an emotional roller-coaster. Initially, there are plenty of laughs to be had, mostly executed through witty one-liners, though it becomes a lot darker with some shocking scenes that make for extremely uncomfortable viewing. It's the latter which highlights the film's superb acting, as the young cast give genuinely convincing performances. Holliday Grainger, who plays Lauren - Miles' love interest, particularly stands out here.<br><br>Playwright Laura Wade adapted the film from her own play \"Posh\", and it clearly shows, as a large portion of the film is based at the table in the restaurant. While it comes as a slight disappointment that The Riot Club doesn't stray too far from its theatrical origins, it does seem to work in the film's favour, adding to the suspense before the highly dramatic climax.<br><br>Wade unsubtly incorporates a number of themes in The Riot Club that are reflective of the society we live in, including the inherited privilege and power culture in the country. There's also a lot of political satire, which comes as no surprise considering some of The Bullingdon Club's ex-members include the current British Prime Minister David Cameron, Chancellor of the Exchequer George Osborne and Mayor of London Boris Johnson.<br><br>Overall, The Riot Club is an excellent play-adaptation that makes for a highly gripping film. There's laughs a plenty, shocks a plenty and a great cast. This is a must-see.","user":"wriggy","rank":[53,64]},{"title":"A genuinely uncomfortable, shocking film about yobbos in waistcoats that met and surpassed my expectations","rating":8,"date":"5 October 2014","review":"After an amusing introductory scene that informs you of the club's centuries old origin, the film turns to contemporary Oxford and presents us with the latest generation of students and Riot Club members. It follows first-year students Miles Richards (Max Irons) and Alistair Ryle (Sam Claflin), both are of 'good stock' but the former is normal and down-to-earth and the latter is a malicious, fascistic sociopath.<br><br>During the fresher's activities, Miles quickly befriends the middle- class Lauren (Holliday Grainger), a friendly girl from Northern England; the romantic pair have a sweet naturalism as they playfully talk about and erode their differing heritages. The scowling, aloof Alistair however proves to be not much of a conversationalist.<br><br>Both are soon inaugurated into the Riot Club, whose other members include Harry Villiers (Douglas Booth), the pretty boy who struck me as the de-facto leader of the club; Hugo Fraser-Tyrwhitt (Sam Reid), a closet homosexual with an attraction to Miles; Dimitri Mitropolous (Ben Schnetzer), a horribly rich Greek student, and James Leighton- Masters (Freddie Fox), the smug little squirt who's somehow the president of the club. Some have said that it is littered with caricatures, however the film isn't about ordinary Oxford students or ordinary privilege, it is about an elite circle of extreme wealth and aristocracy.<br><br>After Miles and Alistair make up the Riot Club's ten members, the group soon have their risibly pompous suits tailored and set off for a night's debauchery to The Old Bull, one of the few establishments they haven't been banned from. By the time this happens, I thought I had the measure of the pretentious characters and the film's narrative and tone, however as the 'dinner' progresses, both the characters and the course of events become veritably loathsome.<br><br>As most will know, The Riot Club is inspired by the Bullingdon Club, an Oxford University dining society infamous for its destructive hedonism that boasts alumni such as David Cameron, Boris Johnson and George Osborne. The film's main target of attack isn't the purported anti-social behaviour of such people, the obnoxious decadence we witness is not endemic to the highly disagreeable 'Riot Club', what it attacks is rather the characters' raging, blue-blooded superiority complexes that causes it. Some may disagree with its politics, they may consider it a gross exaggeration; it is indeed vehement in its depiction of class wars, however I think it is undeniably a very well executed piece of filmmaking.<br><br>The film is adapted from the stage play Posh by Laura Wade, and the middle section of the narrative, which is one long scene, certainly feels like the work of a playwright. Like Tracy Letts' Killer Joe (2011) and Bug (2006), it is another example of how punchy stage material often makes an excellent transfer to the cinema.<br><br>Much like Letts' work, The Riot Club contains a maelstrom within a cramped four walls; the scene goes from embarrassing to plain excruciating as the decuplet, fuelled by alcohol, drugs and each other's presence, become increasingly hateful and immoral, the vile crescendo eventually reaching a climax that's genuinely shocking. It is all witnessed by the unassuming pub landlord. He is initially honoured to host the boys, the sight of him sycophantically at the beck and call of people half his age who look at him the way they would dog mess on their shoe is pathetic in the true meaning of the word.<br><br>The worst offender is Alistair, Sam Claflin is excellent when delivering his well-written diatribes with drunken, acerbic hatred. Alistair's genocidal contempt for the working classes and those bereft of prestige bore similarities to Adolf Hitler's loathing of Jews; he gets so angry that he's reduced to saying 'I'm sick to f*cking death of poor people!' Alistair is the most odious example of unearned privilege and arrogant sense of entitlement, he rants about the successes and innovations of the ruling classes and the proletariat's supposed jealousy as if he's had a part in it, after all, what exactly has he achieved apart from winning the genetic lottery? Claflin proves himself as an accomplished villain actor, he gives his character a sociopathic quality; when there aren't flashes of his vulgar jealousy, resentment and massive hubris, Alistair has an unnerving emotional vacuity.<br><br>The Riot Club is not simply 107 minutes of pretty boys holding champagne flutes, it is a sharply made thriller that is perhaps politically divisive but rivetingly executed.<br><br>84%<br><br>www.hawkensian.com","user":"Hawkensian","rank":[84,106]},{"title":"An infuriating watch.","rating":6,"date":"16 July 2015","review":"It's hard to distinguish what's fact and what's fiction in The Riot Club. On one side secret societies will always have their debauchery and initiations, so a level of trouble-making's to be expected. On the other, TRC exaggerates the misbehavior of a notorious Oxford University group. It's a not so fine line between the two. One single dinner event escalates out of control, subjecting the divide between the rich and the working class. The Riot Club's an infuriating watch, with the majority of the club's members basking in their 'importance', looking down on those they believe to be beneath them. The performances are solid, especially from the club's newest members (Sam Claflin and Max Irons), but two thirds of this film is spent focusing on their petty squabbles than relatable facets.","user":"troyputland","rank":[13,15]}]