[{"title":"Hints of De Palma but then the story ends up going nowhere","rating":5,"date":"20 December 2016","review":"This was a beautifully shot film and at points I thought I was watching a Brian De Palma film, but all of that went out south in the last ten minutes.<br><br>The story had built up nicely and I was salivating at the prospect of a wild twist of an ending. The cast and the acting were all top notch and it held up nicely as the period piece it intended to be, but then things started going haywire and it all just fell apart.<br><br>It really seemed as if the movie perhaps ran out of money in the budget and then they just slapped together some incoherent garbage and called it a day. There has to be some explanation. I mean, the first hour plus of the movie was really well done so what the heck happened? It's a shame too because with the right editing it could have been great.","user":"randymcbeast","rank":[59,68]},{"title":"Great start, rubbish ending.","rating":4,"date":"27 December 2016","review":"I wasn't that interested in this film in the first 10 minutes, then I realised that Patrick Wilson was acting quite well, the direction was good and the sets were totally authentic. The story whilst nothing new or exciting was solid enough, and by about half way there I was well into it. Who dunnit, why did they, are they gonna get caught, I was having a drink and thoroughly enjoying it until the end. Yeah the end just came, out of the blue, from nowhere. And not only that, but it left me wondering, what the heck happened then? Who did what and why? The biggest anti climax in a very long time. I gave it 4 stars but that really was for the great acting from Wilson and Marsan, and the excellent filming. It's lucky to get that tbh because of the way it abruptly came to an end.","user":"Boristhemoggy","rank":[45,52]},{"title":"Did he or didn't he?","rating":6,"date":"26 July 2017","review":"I must admit I'm still not absolutely sure what happened in the end and I watched it twice. \"A Kind of Murder\" is a quirky little story; a bit like an episode on the old \"Alfred Hitchcock Presents\".<br><br>Patrick Wilson plays Walter Stackhouse, an architect and amateur writer who is becoming disenchanted with his neurotic wife, Clara (Jessica Biel). He becomes fixated on the case of Marty Kimmel (Eddie Marsan), a man who may have murdered his wife. When Walter's wife turns up dead, an apparent suicide, a detective, Lawrence Corby (Vincent Kartheiser), suspects it may be a copycat killing and pursues both men with the single-mindedness of Peter Falk's Columbo, but with none of his affability. Finally we seem to be left not really knowing if Walter did it or is simply guilty of an overactive imagination? <br><br>Patricia Highsmith's novels are tough ones to bring to life on the screen; they never end up as profound as you think they will. The films usually start with a clever idea, but run out of puff by the final curtain - The \"Ripley\" films and \"The Two Faces of January\" come to mind.<br><br>Good looking Patrick Wilson and Jessica Biel play against type creating unexpected characters, and this combined with Eddie Marsan's strange little bookshop owner and Vincent Kartheiser's unpleasant detective give the movie an odd edge; it's a hard one to love.<br><br>The film has a subtle score with a seductive lilt by Danny Bensi and Saunder Jurriaans, the go-to composers for the slightly off kilter (\"Enemy\" and \"The Gift\"). <br><br>Credit also for the early 1960's setting. From the clothes, the cars and the interiors to scenes at bus terminals and train stations, it captures the look of the period and, if you were around at the time, brings back memories. It also gives the film a point of difference, especially as a film such as this has to compete with dozens of high quality, film length dramas and mini series that pour in through TV, cable and satellite.<br><br>However, it remains to be seen if \"A Kind of Murder\" with its fairly contrived scenario and rather annoying ending will stay in the memory.","user":"tomsview","rank":[16,17]}]