[{"title":"Wow, much better than I was expecting, especially considering...","rating":9,"date":"3 March 2019","review":"Wow, much better than I was expecting, especially considering this is a non-Hollywood international (Indonesian and Australian) low budget B-grade film.<br><br>When I review a film, I don't compare apples to oranges, and thus rate it on its production merits. This is the 'first' ever film by director, writer, editor and producer Corey Pearson. WOW did he hit this one out of the ballpark - especially considering all the hats he wore for his first film!<br><br>Right from the start, the cinematography and directing seemed like it came from a seasoned film-maker. Excellent shots - pans, zooms, angles, etc. - all perfect.<br><br>Sure we've seen many of these types of hit-man films, but this one still felt refreshing, especially due to the films location setting. The films 91 min length was perfect, and the pacing was spot on.<br><br>The casting was mainly no-name actors or C-listers, but all performed really well, although I wasn't too impressed with Paul O'Brien's performance - or even as the casting choice. He seemed very stale, and in the beginning, uninteresting.<br><br>The choreography for the fight scenes was decent, with a surprisingly perfect amount of gore. The sound/score was on point.<br><br>Overall this was a real treat to watch, especially knowing that this was Corey Pearson's first dabble in film-making. His production was better than some of the big budget Hollywood-backed A-list productions I've seen lately. This film-maker is certainly one to watch!<br><br>It's a well deserved 9/10 from me, and if anyone questions my review as being fake, click on my username and you will see my almost 600 reviews and 1000+ ratings. Ignore the haters and wannabe critics and watch this film, I'm sure you will be as surprised as I was.","user":"TheTopDawgCritic","rank":[51,62]},{"title":"Entertaining action movie","rating":6,"date":"27 February 2019","review":"An entertaining action film, starting after the first 30 min. Before that there's not much going on, just some nice island shots and rather uninteresting scenes that are supposed to serve as some sort of introduction for the \"heros\" later motives, I suppose.<br><br>But then the real \"story\" (very basic) kicks in and along with it the action. Quite a couple of brutal knife killings and shootouts from there.<br><br>Some compare it to brilliant The Raid films as I read, but that's nonsense.\nWhile the knife action might be similar in brutality, the fight scenes are not not as many and they surely are not as well choreographed, definitely no Iko Uwais skills here.\nThe takeouts are executed quickly and with lots of blood, tho.<br><br>Pretty entertaining, if you like a high bodycount.","user":"LoremIpsum321","rank":[14,21]},{"title":"Indonesia action movie 👍,","rating":8,"date":"7 November 2018","review":"Indonesia action movie 👍,\nGood set in pulau seribu","user":"satriani-87647","rank":[31,54]}]