[{"title":"What a great little 'B' movie","rating":8,"date":"1 November 2014","review":"Please don't misunderstand me. This movie is just crap. Wonderfully so. Tarantino, Rodriguez, et al, eat your heart out. This was not an 'A' movie pretending to be a 'B' movie. It is most definitely just a 'B' movie. The best I've seen in at least a decade.<br><br>I downloaded it simply because I thought it might be an interesting 'B' movie (and no, I wouldn't have paid to see it - I will however try to pay them as a thank you though).<br><br>You know how it goes, sitting at home alone, family at a jazz festival, me working. Need some non thinking down time.<br><br>Have no expectations other than badly scripted, badly acted, nonsensical plot, but a wonderful representation of this second tier, cheap genre. Which I kind of expect was the producers point.<br><br>Just what I was looking for. The best nonsense I've watched in years.","user":"amunro-368-74378","rank":[23,31]},{"title":"Hire to fire","rating":23,"date":"23 October 2015","review":"Somewhere in Northern Africa, back in WW II. Nazis discovered dragon eggs, raised many grown up dragons a little later, and hire four witches to control the dragons by psychic powers. Then they attack allied forces, planes and tanks are destroyed by the fire of the mythic beasts, until a British general develops a cunning plan: shoot back...<br><br>Another trash movie from director Mark Atkins I remember best for 'Princess of Mars' and 'Sand Sharks'. The budget was obviously very low, for example the pilots in the cockpits are always shown in a close-up with a narrow focus range against a blue studio background, so nobody can see interior details of the planes. The acting is ridiculous, just for example take the the French pilot. Well, you knew from the subject of 'Dragons vs. Planes' it wouldn't be Shakespeare, still this is entertainment on a very modest level. The fantasy element of the co-operating witches is interesting, but will work better in a different background, i.e. a pure fantasy movie. The best scene of this movie was, which is telling a lot, the drinking contest. Maybe I'll recommend the same to 2 people I really don't like some time.","user":"unbrokenmetal","rank":[3,3]},{"title":"A 4 year old could actually make a better film","rating":1,"date":"1 November 2014","review":"This, just like Mark Atkins other attempts (generally rip off's of other big movies in order to trick people into buying the DVD, \"Jack the giant killer\" is his perfect shameless example) is yet another flop in literally every way possible, there is literally no saving grace at all.<br><br>To cut a long story short, the directing, cinematography, writing and acting is all shocking. I watched it purely out of curiosity and I wish I could have that time if my life back. I am generally a very positive person and find \"something\" good on most things, but this is just abysmal - needless to say, don't bother.","user":"dreamwalk1986","rank":[13,20]}]