[{"title":"Not exactly perfect but surprisingly good","rating":8,"date":"25 October 2015","review":"This film currently has an undeservedly low rating here on IMDb so it was with a bit of apprehension that I sat down to watch it and it proved to be much better than I had expected. The reason for the low rating I think is that the audiences today got too used to dumb 'action packed' crap like Taken that consists of little more than clichés and boring camera work. This movie dares to be different, it dares to be slow paced, watching it is like reading a book, it actually requires a mental effort on the part of the viewer to keep track of what's going on and naturally people these days don't like that. This film is from a different epoch, it's just too big and too multi-layered for the short attention span of the modern viewer weaned on vine videos. If you want to get an idea of what this movie is like without spoilers - think Tinker, Tailor, Soldier, Spy. Don't be discouraged by the low rating, it's just that slow-burn thrillers are not everyone's cup of tea these days. <br><br>It should also be noted that it's not just in its approach to story telling that this film dares to be different it's also in its cinematography. Once again, it feels like a film from a different time period that hearkens back to the classic noir movies of yesteryear, something like Three Days of the Condor. <br><br>And last but not least, it's quite refreshing to have a main character that thinks ahead rather than simply barging in and relying solely on the script writers to help him prevail in whatever situation they may find themselves in.","user":"igorfazlyev-01869","rank":[55,75]},{"title":"Blackhat is another fantastic Michael Mann movie, and here is why","rating":9,"date":"16 January 2015","review":"I have been looking forward to Blackhat for a couple of months now, and was able to see the movie on the am showing on it's first full day. What a thrill ride! Before I go into the details of why I loved this movie, I should point out where my perspective on a movie like this will be different than most, as reflected in some of the bad early reviews. <br><br>I have a Bachelors in Information Systems and a Masters in Information Security Assurance. I have worked in technology for 18 years now, the last 5 of that almost exclusively in the security end of the tech pool. Based upon my experience in the field and my recent exhaustive research into information security, I found the film to be a refreshing change from the typical rehashed Hollywood fantasy that is put out regarding anything with a computer chip installed. <br><br>The problem with how computers are depicted in most movie in television is that the capabilities of computers are completely overstated or just plain irrational. It is as if directors think technical hyperbole will make up for a lack of everyday viewer sophistication with computer science. I get that the majority of the population hasn't studied computers as a major and most know only as much as they need to to get online and send emails or watch Youtube. This is completely understandable. <br><br>However, with technology being so ubiquitous in today's world, I am a bit astounded at he flack a director gets when he attempts to use realistic computing in a movie. With all of the Androids, iOS devices, multiple computer households, and the increasing popularity of Linux operating systems, one would think that the average computer IQ of America was much higher than it was 20 years ago. <br><br>In reality, if computers are depicted in realistic terms in film, most people just wont get it. I blame this partly on shows like Star Trek and Star Wars (which I love, for what they are) that fantasize what computers may be like in 200 years. I also blame it on the epidemic of fantasy movies that seem to base nothing on reality but continue to rake in hundreds of millions of dollars from movie goers world wide. <br><br>At the end of the day, Michael Mann did a FANTASTIC job of depicting the real life of network engineers and computer scientists in this movie. Commands entered on screen followed conventional Unix command line format and were syntactically correct. You could tell Mann had done his research and hired true computing consultants in the writing of the script. <br><br>In addition, the attacks on the PLA systems that run the pumps used to cause the reactor meltdown and later planned for the mines was almost flawlessly realistic. That is in fact how those systems work and how attackers would compromise them across the Internet. Further, the types of attacks are entirely plausible given real world research conducted by the NSA, Department of Defense, Department of Energy, and others. In addition, passing malware through PDF files by email is one of the most prominent ways that attackers take over computers in the real world, but viewer comments indicate they believe this to be too silly to be believable. Well as a security analyst, I can tell you to believe that scenario happens millions of times every year But, because we didn't have excessive flashing lights and cartoonish villains with a master plan to take over the entire world, the movie gets panned. <br><br>The reviews for Blackhat remind me of those for Miami Vice. In each instance, extensive research was done into the worlds of the criminals that served as the basis for the lead characters. But too much realism tends to bring out the boo birds who would rather focus on comic book heros that shoot lighting out of their eyeballs or fly around in steel suits too impossibly heavy to be powered by anything short of a large nuclear reactor while fighting off giant skyscraper-sized space worms. <br><br>Perhaps audiences would rather have compete fantasy in their movies. Perhaps we cannot appreciate anything that attempts the least bit of realism. However, I absolutely loved Blackhat for the same reason I loved Miami Vice. Michael Mann made an adult movie largely based upon fact that requires minimal amounts of escapism while requiring the viewer to use their intellect and actually think during the movie. For his efforts, I applaud him. <br><br>Lastly, this movie should serve as a warning to all those who are unaware of the rampant security issues that the US (the whole world actually) faces in this day and age. From a security analyst's perspective, the realism was welcome cautionary tale that needs to continued to be told until the general public gets it.","user":"robk-952-110475","rank":[394,613]},{"title":"surprised in a good way","rating":8,"date":"14 April 2016","review":"I waited a long time watching this movie because of all the bad summaries and ratings, but, here is my opinion. - Blackhat is an entertaining movie with an interesting visual language and I was really surprised how \"not that bad\" it is. Yeah sure, it doesn't have the dept of a Heat or Aviator, but it is still a solid peace - I Have a feeling that a lot of the people didn't understand Manns intentions in terms of camera, picture language and dramaturgy. The same thing happened with Miami vice! - My advice, watch it and form your own opinion and do not make the same mistake as me not watching it due to the opinion of others.","user":"desperradoo","rank":[29,42]}]