[{"title":"I couldn't see myself liking this film, but I did.","rating":8,"date":"17 October 2018","review":"This film had none of the traits I look for in a film - suspense, thrills, drama, action, fast-pace, etc... or in other words, your typical big budget Hollywood blockbuster. Yet I was still drawn to it for it's complexity of the four very different yet typical, oddball and not really even ordinary people.<br><br>The pace was very slow, but the interesting story, spotless directing, decent cinematography, great acting and perfect score were enough to keep me drawn in. <br><br>This is clearly a low budget indie film with C and B list actors - the only big name actor being Jeremy Irons (and Jane Seymour in a very small role), but Alex Sharp and especially Analeigh Tipton, were just perfect in portraying their characters in this film, as was Jeremy Irons.<br><br>This film is not for everyone (it wasn't for me), but I still enjoyed the romantic and character conflicts. It is heartfelt and heartwarming with some dark humor here and there. Reviewer zoeparry-94573 basically took the words right out of my mouth. I would still recommend it to those who enjoy a film with substance.<br><br>A surprisingly well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[15,22]},{"title":"nice example how to make a movie","rating":8,"date":"13 October 2018","review":"There has been made lots of roadtrip movies,and this one was just as unremarkable as the others,but it shows how to make a film on low budget,with a good storyline without glitter and glamour.\nits about an old disabled army veteran grandfather, his more or less related relative grandson, a totally lost girl with some adhd tendencies,and a young african american straycat that fusions into the group by incident.. there is a kill,so the law and fbi are doing their best to retain the fugitives.\ni like the way this film show the rural kind of usa,with dinoparks and other strange features popping up and flashes in your face wereever you are on the road.\ngood filming and decent story, and a very nice jeremy irons for once.\ni think ''the straight story'' was great,and this one is a good addition to the folk-road-trip genre.","user":"ops-52535","rank":[10,19]},{"title":"Remember the insight and hilarity of \"My Name is Earl?\"","rating":2,"date":"16 October 2018","review":"Well, \"Better Start Running\" has NONE of the positive traits of that brilliantly-conceived series from a decade ago. It's more like \"Bill and Ted's Excellent Adventure,\" but without Bill and Ted, and without adventure, and with absolutely NO excellence.<br><br>Utterly woeful script, acting and directing more reminiscent of a high school assignment than the substantially-funded production that it is. Irons and Seymour must really be down on their luck to take parts on in this movie.","user":"Angry_Santa","rank":[10,21]}]