[{"title":"Brilliantly Awful","rating":1,"date":"23 August 2013","review":"While I give this one star, I strongly encourage everyone to see this movie. Not because it is good or has a single redeeming factor, but because if Ed Wood set out intentionally with an unlimited budget to make the worst movie ever, he could not have made something this bad.<br><br>The law of large numbers would seem to imply that in 86 minutes you'd have to get something right by accident, and yet this movie doesn't. A second look at Alien Apocalypse (which admittedly requires a masochistic nature to undertake) at least reveals passable cinematography and consistent lighting. And yet Sharknado rises above mathematics to give us a film that is bad in every single possible way.<br><br>Continuity is shrugged off completely. The same scene moves from daylight to dusk, rain to sunshine, storm surge to quiet beach, with every single new camera angle. It is so blatantly bad you are distracted from the more subtle inconsistencies like objects moving around, attire, wind, or quality of film from one cut to the next.<br><br>If you manage to close your eyes you are immediately taken in by the sound. How the sound editor managed to get to work on what had to be an acid-enhanced bender of epic proportions to warrant these results is beyond me. I'm reluctant to suggest using your stereo's sound-leveling technology for fear your sound system will simply melt from the strain.<br><br>One is almost loath to point a finger at suspension of disbelief when it comes to a movie whose premise is sharks in tornadoes, but whatever level you plan to come in with is almost surely going to fall far short. This movie has more WTF moments in 86 minutes than Lost could pull off in 86 seasons. And everyone gets to play, not just those with a working knowledge of wind shear or the physics that keep a helicopter in the air. If you've played pool, fished, surfed, driven a car in water deeper than two inches, been exposed to gravity, or otherwise in any way have interacted with or gained some understanding of the world around you, this movie has something for you to go \"wha!?!\" about.<br><br>And while you would think that once you had bad special effects, bad editing, and bad sound strung together you'd get at least one Bruce Campbell out of the cast to latch on to. Not so here, as every actor turned in a performance that shows they were more confused than the viewer about what was happening. We could guess it was because they were given the script out of order, but as a viewer of the final product I'm not sure I've seen the scenes in order, they are that disjointed.<br><br>I've tried very hard to find something that was done well or noteworthy about this movie and the only thing I can come up with is that it is the only movie I have ever seen that has failed on absolutely every level. If you tried to make a movie this bad you would inadvertently get something right purely on accident. And that is its one bright, shining point of light. That it would be almost impossible to make something this terrible ever again.","user":"mafia-grim","rank":[135,150]},{"title":"Like Finding Nemo but with all sharks...and tornadoes.","rating":10,"date":"11 July 2013","review":"For anyone who hasn't seen the SyFy original movie, Sharknado; it's a heart-warming, coming of age story about a ragtag group of sharks uprooted from their home by mother nature's fury. The sharks must band together and overcome adversity and strife while trying, desperately, to make their way back to the only home they've ever known. Battling chainsaw wielding humans and B-list actors trying, desperately, to throw themselves into the displaced sharks' mouths every chance they get. If you love sharks and tornadoes, well...now you don't have to choose! Do yourself a favor and see this one before the Oscars! Sharknado is, truly, the cinematic experience of a lifetime.","user":"halen13420","rank":[761,908]},{"title":"Gloriously Incompetent and Gleefully Terrible","rating":8,"date":"12 July 2013","review":"And yet with a group of pals you would be hard pressed to find a better time. Absolutely nothing make sense. Physics and natural laws are ignored. Horrible CGI and cringe-worthy dialog. Outrageous continuity exceeded only by horrible color correction and clunky editing. The all together wooden acting no doubt achieved in single takes is sincere, earnest and fails on levels that should win awards. <br><br>And you can't stop watching. My friends, yelled, laughed, joked, stomped, laughed some more and had a fine time. Now how many times can you say that watching a movie? It literally becomes an interactive experience. <br><br>It is surely a classic. Not sure exactly what kind. But it is a classic.","user":"flixspix","rank":[346,425]}]