[{"title":"Bird Box","rating":9,"date":"20 February 2020","review":"I didn't read the book before I watched the movie and I saw lot's of people on Facebook saying they had questions after they watched the movie but those who read the book said that not everything from the book could've been included into the movie. I've started reading the book and I'm only two chapters in and can see that this is true. I loved the movie but I'm already loving the book more. So judging by those who gave this movie scathing review, I'd say they didn't read the book and if they did and still didn't get the movie, that's sad on their part. If they didn't read the book, give that a try. I bet it'll change their perspective.","user":"MR_Heraclius","rank":[46,53]},{"title":"A Lot of Filler, Little Substance","rating":6,"date":"20 December 2018","review":"I have to say, the most sensible reviews are those that doesn't say \"10/10\". It wasn't easy to rate it, I had to think long and hard about this one before I could give it a seemingly justified mark.<br><br>Sadly, \"Bird Box\" is nothing revolutionary in neither the horror genre &amp; the apocalyptical movie isle. It has a great cast, a truly great performance by Sandra Bullock, real good looking, big-budget-all-over cinematography, visual FX, shooting locations, action, makeup, etc., etc. Many aspects of a masterful filmmaking are on a high enough level - my only complaint on this matter is that there wasn't enough horror in this horror movie. A few moments of gore, mayhem and suspense fits the genre, but overall I'd describe \"Bird Box\" as an r-rated apocalyptical adventure movie that could easily have a lot of teenagers in it's audience. I'm seeing a lot comparisons with the recent \"A Quiet Place\" among the reviews, yet I'd like to try and avoid comparing these two, but, to all those who compare them, I say - \"A Quiet Place\" was a better horror movie (emphasis on \"horror\").<br><br>So why only 6/10, you wonder? Let me tell you why: the plot. It is so lousy in so many ways. Note that I have not read the book, but if the story there is as unpolished as here, I will definitely never read it. \"Bird Box\" leaves the viewer with a lot of questions and plot points that doesn't make much sense. What are the entities? There are no origins, no explanation for how and why it struck the earth, it's shown as extremely powerful yet, for whatever reason, it can't enter any buildings etc. From the start of the movie to the end there is no development whatsoever regarding the reasons for the apocalypse and the process of it. Why are some people not killing themselves when exposed to the entities but are killing others? Well, I guess because they needed someone to kill the protagonists, when the entities couldn't.. There is never an explanation, not even a subtle hint. The entities can make you hear voices of close people, dead people, yet, 5 years into the apocalypse, it still comes as a surprise to the main charachters, what a climax, eh? In the end, after the long journey, our main character finds the place she was looking for - a school for the blind. In the middle of a rainforest. Very plausible indeed. Also, who calls their children girl and boy for 5 years, only to deliver the scene at the end where she names them after the two now dead charachters. I guess they had to wait until the father dies, otherwise there wouldn't be the sentimental reason to name the son after the father. Also, the character development is pretty predictable throughout the movie &amp; the 2nd half gradually becomes more... generic.<br><br>It might sound like I'm thrashing the movie, but, mind you, 6/10 is a good mark &amp; I enjoyed this movie for its high entertainment value, but the depth here is shallow &amp; the setting is an unpolished excuse for a story of a charachter's survival which brings almost nothing new to the cinematic history. An underwhelming yet entertaining thriller that will successfully reach a big audience for its too mainstream to be called anything other than a popcorn horror.","user":"TwistedContent","rank":[1,1]},{"title":"Not Understanding All The Hype","rating":5,"date":"28 December 2018","review":"The movie was OK. Definitely better than the Happening, and that's not saying much, but the Bird Box certainly did not live up to the hype.<br><br>In a post-apocalyptic world where a supernatural entity is making people kill themselves once they see \"it\", Sandra Bullock's character must make it through the forest to a safe haven with two young children in tow, all while blindfolded - so she won't see \"it\". That's the premise and it's not too plausible. Walking through a dense forest blindfolded? Yeah, right. Hell, some people wouldn't be able to halfway walk through the woods without tripping over a log with full sight, yet we're expected to believe she can navigate blindfolded just fine with two children in tow?<br><br>Anyway, we do get to see how Bullock's character got to this point via flashbacks, and quite frankly, those are the better parts of this movie. I think the best scene in Bird Box was when the initial survivors at the house in the city ran out of food and had to make a trip to the grocery store. Without giving away any details, this sequence is one of the few bright spots in terms of originality that you will see in this film.<br><br>Besides that, we just see survivors surviving and then getting killed off and not much else. If you're looking for: who, what, why, or how? Good luck, you won't find \"it\" here. Otherwise, decent cinematography and acting by Sandra Bullock, John Malkovich, Trevante Rhodes, and the little girl are the only things holding this movie together. It's worth a look. 5 stars.","user":"Marc_Action","rank":[609,846]}]