[{"title":"A Cinderella Story","rating":8,"date":"11 June 2015","review":"The critically acclaimed but underrated audience film Top Five is genius. Not only is it a return to glory for Chris Rock, it's a really great dramatic film. IMDb doesn't list it as drama, but I think the dramatic moments of Top Five were even better than the inevitably hysterical moments. It tells the story of Andre Allen, a comedian and movie star who is struggling to reach the heights of his early career while simultaneously being interviewed by a journalist and preparing for his wedding.<br><br>Top Five caught me off guard. I figured with the cast it has and the premise that it presented, the film would be a goof ball comedy and a throwaway film. Instead, it felt like a mixture of a Richard Linklater and Woody Allen script, with tons of great Chris Rock comedy thrown in. It only takes place over the course of a night or two, and the screenplay is absolutely brilliant. Rock and Rosario Dawson share great chemistry together and light up each others lives, which are otherwise pretty depressing. The back and forth with them and the ability they had to change each other's world views, was reminiscent of Celine &amp; Jesse in The Before Trilogy. I also tend to believe this was loosely based on how Chris Rock viewed himself in the industry and quite possibly several other celebrities. It sheds a light on what may be the many struggles celebrities and past-their-prime actors go through when they are trying to change their career.<br><br>Now I don't know how explicit the film needed to get. At times some of the goofy comedy and characters took me out of the film. I would have much rather the film stay closer to the contained humor that made the film work so well. Besides that, I was really impressed Top Five. The fact that a film involving Chris Rock walking around New York City for a full 2 hours was that interesting is a testament to the script and Rock's directing.<br><br>+Hilarious <br><br>+Dramatic moments hit even more <br><br>+Felt like a Linklater/Woody Allen script <br><br>+Potentially Rock's own story? <br><br>-Stay away from the silly comedy <br><br>8.5/10","user":"ThomasDrufke","rank":[19,25]},{"title":"Surprised me, in a good way","rating":7,"date":"10 December 2015","review":"I am sooooo not in the audience for a Chris Rock film--or so I would have thought. I'm white, in my 60's, liberal but not urban or indeed hip in any sense, and the only five rap artists I could name are those who went on to acting careers.<br><br>And yet...this was a definitely movie for me. It's observational, mature, witty, good-hearted, mostly a rom-com but also about the battle between external expectations and inner desire, young adulthood and maturity.<br><br>The plot of the movie, which has everyone but a few good friends wanting poor Andre to keep doing his funny stuff, the talking bear movies, while he wants to do more significant work? That ends up perfectly predicting the audience reaction you see here via the reviews. \"Where's the hysterical Chris Rock **** jokes?\" people stuck in 1992 want to know.<br><br>There is some of that in here...and it's exactly the stuff I hated (Cedric and the whores; the tampon thing--ish, edit them both out) and that made me rate this a couple stars lower than I might have otherwise. So as I pity Andre in the film (omg, having \"Hammy!\" shouted at you 1000 times day!), I pity Rock even more for living out this life, even in the year since this movie's release, even right here on IMDb, with angry comments by old-school fans of his. Man, that's life imitating art imitating life.<br><br>I hope I see more like this from him.<br><br>I enjoy that I was able to like all these characters and sympathize with them. I liked the set up for the reveal about Chelsea. I liked how Silk was a stock character you thought you knew, until he wasn't in the final 1/4 of the film. I was tickled. I was moved. I was pressed to think.<br><br>(and I did sort of like the rap song running over the end credits, so one never knows, eh?)","user":"grnhair2001","rank":[17,24]},{"title":"Okay, how about an action comedy in English (with Kreyol subtitles) about a slavery-fighting bear?","rating":7,"date":"18 April 2015","review":"Eight stars while Rosario Dawson's on screen, otherwise six. Chris Rock is Andre Allen, a successful standup comic who's arrived at his \"Stardust Memories\" moment—he's done a couple of dumb action comedies about a crime-fighting bear and wants to redeem himself with a serious film about Haitian slave rebels that nobody wants to see. Some of the plot mechanics are a little creaky, some of the comic set pieces are just distracting (especially the gross-out foursome with Cedric and the topheavy hookers), but the two leads have great chemistry, and the scenes with the two of them just \"wandering around bullshitting\" (as Ethan Hawke says in \"Before Midnight\") are totally engaging. <br><br>The comedy sideshow stuff is hit or miss. An extended sequence with Tracy Morgan, Leslie Jones et al. as Andre's old cronies from the 'hood—maybe meant to illustrate Chris Rock's claim that he was only the tenth funniest guy on his block—mostly hits; the shtick with J.B. Smoove coming on to every plus-size woman he meets mostly misses (except when Gabourey Sidibe tells him to knock it off...). Romcom convention dictates that the two leads have a falling out that keeps Rosario out of the picture for a while, which requires a nonsensical plot twist and results in a few flat scenes near the end, but all in all it's an entertaining film. <br><br>Maybe the example of Louis CK has encouraged Chris Rock to base his character more on his own life, instead of playing, e.g., a dweeby investment banker (\"I Think I Love My Wife\"); as with \"Louie,\" the NYC locations are a big part of the story. He claims that this is the \"blackest\" film he's made so far, but I have to say that a standup guy from Bed-Stuy who remakes an Eric Rohmer classic (\"My Wife\"), costars with Julie Delpy (\"Two Days in New York\") in a film set in Tribeca and steals from Preston Sturgess and Woody Allen is my kind of postracial auteur.","user":"The_late_Buddy_Ryan","rank":[12,16]}]