[{"title":"Cute Movie, But A Bit Over-hyped","rating":7,"date":"12 July 2016","review":"After hearing people praise this movie, and seeing how much it was advertised, I was curious to see this. Now, I've never loved Illumination's movies, but I've never hated them either. I don't mind any of their films, but I feel like they're not as innovative as certain other animation companies. Hearing how much people loved Secret Life of Pets gave me a bit of hope that perhaps this movie would be Illumination's breakthrough. The one that would have the best animation, story, characters, emotions, etc.<br><br>Unfortunately, Secret Life of Pets just ended up being another okay movie for me. Right when I saw the trailers, I was reminded of Toy Story with the plot. I feared that the plot would be predictable, and it definitely was. A few different things were thrown in, but as a whole, the story was pretty predictable. One of the different things that was thrown in had potential to be a really emotional scene. This is a spoiler, by the way. Anyway, Duke finds out that his original owner had died, which could've led into an emotional scene, like in Finding Dory when Dory was made to believe her parents were dead. But the whole scene failed. Firstly, it was told, not shown. A random cat just gives the news to Duke. Second, Duke barely reacts to this, despite the movie going out of its way to show us a montage of him with his owner. He just gets mad at the family that moved into the owner's home before getting caught by animal control. After that, it's never mentioned again. Duke is just fine with his owner being dead, and living with a new owner and Max. This really bothers me, since as I said, this scene had potential to be emotionally provoking. But it didn't take the chance.<br><br>Our main characters didn't interest me. Max is just another typical good guy that just wants a good life. Duke was just another lovable big guy who may be a bit slow. However, the only characters that made me laugh/I enjoyed were Gidget, Snowball, Tiberius, and Pops. Gidget and Snowball were the ones that really shined, though. Gidget was just plain adorable, and hilarious. As for Snowball, I'm not a big fan of Kevin Hart, but he really did a great job for his first animated film. I personally prefer him doing voice work than him in live action films. He managed to make me laugh multiple times as Snowball. That bunny may be cute, but he's totally psychotic. As for the rest of the characters, they didn't really interest me. I don't hate any of them, but they were pretty generic.<br><br>I also am sick of the Minions. They got old when their own movie was made. I won't mind seeing them in Despicable Me 3, since we'll only get small doses of them, but having them constantly shoved in our faces is getting annoying. The short that came on before Secret Life of Pets was just stupid. No experimentation with the animation or characters. Just plain stupidity. They also had one of the dogs in Secret Life wear a Minions costume, and I just rolled my eyes. Minions may make Illumination money, but not many people care about them anymore. I certainly don't.<br><br>I do have some positive things to say about this film. The animation was impressive. I was particularly impressed with how they animated water, and the mannerisms of the pets. Which leads into the next thing I liked about this. I admire how much the creators of the film did their research on not just dogs, but most pets people keep. They were spot on with how dogs, cats, birds, etc. act. As a dog and cat owner, I appreciate the humor/realism that went into the pets, and they reminded me of my own pets.<br><br>As a whole, this a cute, but flawed film. I wasn't impressed with most of the characters. The story was predictable. Nothing about this film was thought or emotionally provoking. However, I appreciated some of the film's humor, animation, and the research that went into the mannerisms of the pets. It's a shame that this wasn't Illumination's breakthrough. Sure, it's making a lot of money, but it's still just an alright movie. Hopefully one day, Illumination will make a film just as great as the likes of Zootopia or Inside Out. The Secret Life of Pets just isn't that film.","user":"meshjoy","rank":[35,46]},{"title":"Very silly but enjoyable","rating":8,"date":"13 July 2016","review":"Animated film that takes place in NYC. Two dogs named Max (voiced by Louis C.K.) and Duke (voiced by Eric Stonestreet) get separated from their owner when out for a walk. The film chronicles their journey back home.<br><br>This is clearly aimed at kids but has plenty of humor that adults will enjoy. I'm in my 50s and laughed long and loud at some of the antics. The script is good and moves quickly. I was never bored. With one exception the voices perfectly fit the characters. The one exception was Snowball. He's a psychotic rabbit voiced by Kevin Hart. Hart can be funny but not here. He YELLS every word out at the audience. It gets annoying quick. The animation is great--very fluid and pleasing to the eye. The backdrops of NYC are breath-taking. The only real debit is there are some glaring lapses in logic but it IS a kids film. Recommended.","user":"preppy-3","rank":[24,33]},{"title":"Don't keep it to yourself - \"The Secret Life of Pets\" is great family fun!","rating":8,"date":"9 July 2016","review":"When you see as many movies as I do (and you start writing reviews in your head while you're watching them), certain movies, parts of movies, plot points or characters remind you of other movies. In my reviews, I often note those parallels, using them to comment on the movie I'm reviewing. Sometimes I note similarities between movies to say that the more recent film is unoriginal. Other times, it's just to help explain what the new movie is like. The animated adventure comedy \"The Secret Life of Pets\" (PG, 1:30) reminds me very much of two other animated features but that's not necessarily a bad thing.<br><br>Tell me if this sounds familiar: Someone's possessions (as he or she views them) actually have secret lives of their own which are only really apparent when the owner is not around. These anthropomorphic possessions relate to each other and form friendships. When a newer version of the original is brought into the group, jealousy emerges and the original tries to get rid of the interloper. This struggle results in both of the rivals being thrust out of the comforts of home into the little-understood big, bad world, a situation which requires their compadres to venture out of their own comfort zones to mount a rescue.<br><br>That set-up fits Illumination Entertainment's 2016 \"The Secret Life of Pets\" as well as it does the 1995 Pixar/Disney classic film \"Toy Story\". (Think, \"Pet Story\", or \"The Secret Life of Toys\".) But considering that the 2016 film is about animals rather than toys, maybe the better comparison is to another 2016 animated feature (also from Disney) by the name of \"Zootopia\". In both of those 2016 films, a couple of anthropomorphic animals (among many others living in a big city) form a partnership which develops into a mutually beneficial friendship. I guess it's not unfair to think of \"The Secret Life of Pets\" as a mash-up of \"Toy Story\" and \"Zootopia\". Nevertheless, this one charts its own unique course and is as entertaining as those other two or the \"Despicable Me\" films, also from Illumination Entertainment.<br><br>Now that you know what \"The Secret Life of Pets\" is LIKE, here's what it's ABOUT: The movie focuses on a small brown and white terrier named Max (voiced by Louis C.K.) and his relationship with the other pets in his apartment building. Max lives in a small Manhattan apartment with his owner, a young woman named Katie (Ellie Kemper). When Katie goes to work each day, Max sits at the door wondering where she has gone and waiting for her to come back and play with him. Meanwhile, the pets in the building across the alley and above and below his apartment (and one guniea pig lost in the air ducts) are more active in their daily lives (and more mobile) than is readily apparent. (Thus, the title of the film.) Some of the neighborhood pets include an overweight white cat named Chloe (Lake Bell), a bulldog named Mel (Bobby Moynihan), a dachshund named Buddy (Hannibal Buress), a canary named Sweet Pea (Tara Strong), and Gidget (Jenny Slate), a white Pomeranian who has a secret crush on Max.<br><br>Except for missing Katie during the day, all is well in Max's little world until one not-so-fine day when Katie brings home another dog she rescued from a shelter. Duke (Eric Stonestreet) is a large, shaggy, dark brown dog who has no problem throwing his weight around to get the best place to sleep, or as much food as he wants, or anything else. Max starts scheming about how to get rid of Duke, but one such attempt while they're in the park with Katie's dog walker back-fires and sets both Max and Duke off on a wild and dangerous journey around the city. When Gidget realizes that Max has disappeared, she enlists their mutual pet friends, plus a caged hawk named Tiberius (Albert Brooks), and a few other neighborhood pets (including the Dana Carvey voiced \"Pops\"), to help her find Max. Meanwhile, Max and Duke have to try escaping from animal control workers, a disfigured alley cat named Ozone (Steve Coogan) and a small, but crazed and bitter bunny named Snowball (Kevin Hart), who was discarded by the magician he worked for and now leads a sewer-dwelling group of radicals called The Flushed Pets, who are bent on wiping out all the humans – and who decide that Max and Duke are also their enemies.<br><br>\"The Secret Life of Pets\" is every bit as entertaining as you'd hope, based on its theatrical trailers, or its movie posters, or just its title. Co-writers Cinco Paul, Ken Daurio and Brian Lynch exploit many of the well-known quirks of different kinds of pets, but give each character in the film its own personality. Then, once the script clearly establishes who each of these characters are, it gives them plenty to do, but without making the story unnecessarily complicated. Co-directors Chris Renaud (who also voices the aforementioned lost guinea pig) and Yarrow Cheney bring this promising concept and excellent script to realization by keeping the plot moving and not overdoing any of the film's big ideas or overplaying any of the gags. Finally, with the film's impressive voice cast and the filmmakers' \"Despicable\" history, the performances and the visuals are excellent across the board. On the critical side, I found a subplot involving Duke's backstory and a \"Grease\"-inspired sausage-fueled dream sequence to be odd and unnecessary diversions, and I would've liked to see just a little more originality and inspiration sprinkled throughout the movie. However, there's no denying that \"The Secret Life of Pets\" is very well-done good, clean fun for the whole family. \"A-\"","user":"dave-mcclain","rank":[24,35]}]