[{"title":"Strip pole opera has terrible lines","rating":3,"date":"26 November 2014","review":"I could not hear the mildest swear word in forty minutes of this film. I really don't like too much profanity, but it's absence does not match the characters, setting or situation. It's set in a strip bar, yet a sermon from my minister couldn't be as holy. The dialog is cleaner than an after-school special or religious drama. The strip routines are just ho hum and Catherine Annette is supposed to be a newscaster, not Annette Funicello. She talks like a child not old enough to have finished junior high school. The main frustration was too many flashbacks giving hints about who the murderer was.. always belonging to the person who supposedly hadn't witnessed the crimes. Fred Olen Ray used his own name in this film when he should have stuck with Nicholas Medina. He seems to be stressed out by some kind of personal hassles of his own behind the scenes in his career. Just like the mainstream names, low budget film makers often get spoiled by success so it dulls their edge or they take themselves too seriously.","user":"Hollywoodshack","rank":[8,13]},{"title":"A notch above many of the other low budget suspense films","rating":6,"date":"27 August 2019","review":"I am not sure why this has such a low rating but I can only assume that many of the other IMDB ratings are low because the reviewers were disappointed that there was minimal T&amp;A in the picture. The acting wasn't Academy Award standards but neither was it Razzy award caliber. The story line was decent and there were at least a dozen suspects who may be responsible for the multiple murders taking place at the strip club.<br><br>Would I watch it a second time? Probably not, but I would rate it slightly better than most low budget slasher films that are filled with gratuitous T&amp;A. So if you want to watch a decent story line with some murder and suspense than you won't be disappointed. If you are looking for a bunch of naked ladies at a strip club, there is some of that but the film is more of a main stream suspense film with a decent ending.<br><br>Tawny Kitaen's closing line is priceless.<br><br>I give the film a 6 out of 10 rating","user":"Ed-Shullivan","rank":[4,6]},{"title":"Quite Awful. Boring Strip Teases","rating":2,"date":"26 March 2015","review":"Its a basic murder mystery story with a sister trying to find out who murdered her sister. But it is held back because it appears to have been written by an amnesiac rhino. Characters actions make no sense because the script tries to make them all out as possible killers, so there's about 8 red hearings wandering around. A MAJOR plot point gets dropped halfway through the movie, like it was added last minute. The main girl becomes a stripper to find out what happened to her sister. And not a single line said by the owner, the barman, or the other strippers makes sense. Some of the lines are REALLY cringe worthy. The handful of effective scenes were immediately ruined. I didn't see the twist coming, but I wasn't really paying attention.<br><br>As for the nudity, there's a lot of strip scenes. Maybe two are good. Not really worth it for the nudity.","user":"plutoburns","rank":[5,10]}]