[{"title":"Babysitter in peril","rating":5,"date":"21 February 2015","review":"This is a rather conventional home invasion horror story that fans of the genre will find familiar.<br><br>As horror goes, this has some thrills. The villains are scary, as is their pursuit of the inhabitants. And the house itself is a star, with rooms that are very visual and a plethora of corridors and hiding places. The lead character evolves from mousy and helpless to develop the grit to fight back.<br><br>The story follows a well-trodden path with a facade of originality. It gives no motivation to the villains, who take tremendous risks for little benefit. Law enforcement is laughably incompetent. Parents are predictably clueless. The kills aren't very gruesome and lack intensity and catharsis. Twists are predictable and unimpactful.<br><br>The story finishes predictably and satisfyingly enough--it's a journey, not a destination. But then, as if the filmmakers decided they wished they made the movie very differently, a whole separate scene is tacked onto the end that is completely over the top. Apparently the film found itself with an overabundance of casting extras and gory makeup to use up. Maybe the filmmakers are auditioning for a sequel.","user":"moviefansme","rank":[15,17]},{"title":"Just another genre ripoff.","rating":3,"date":"13 September 2015","review":"I had high hopes for this film, honestly. I went in after hearing a recommendation from a friend whose opinion I usually trust. I don't know if he was playing a joke on me or what because this film was so bad I found it hard to watch. The storyline is a lazy blend of \"When A Stranger Calls\" and \"You're Next\", and it never once brings anything new to the genre. It's about as cookie-cutter and predictable as it gets. Confusing plot twists and irrational decisions made by the female lead whom, in my opinion, wasn't strong enough to carry the entire film on her own. She reminded me of Ali Larter only even more boring on camera. That and she was blatantly too old to be playing a 17 year old. I mean, Jesus guys... You really expect us to buy that? You've got to be kidding me! <br><br>On the technical side of things, the audio through-out the entire film seemed very flat and awkward as though it was never leveled properly. Almost all of the dialogue sounds hollow which leads me to believe the entire film was dubbed over. I suppose that can give some sort of explanation for the lack-luster performances? The location was pretty cool, but the footage looked a bit flat and blah and at times looked over-exposed. I feel like that may have been an artistic choice for certain shots but it looked cheap to me.<br><br>I would say the worst part of the whole thing to me is that there really seems to be no explanation for the events of the film. None at all! I'm sick of this whole \"killing to kill\" trend in horror cinema. At first it seemed creative but now it's just over-done and to be honest it just comes off as lazy! I'm not going to give away what happens at the end, who the killer is, or who survives but honestly... this ending had to be one of the absolute LEAST satisfying finales I've seen in the last ten years. I mean, come on guys! Do you really think the viewers are that stupid? Give us something that makes us think. Surprise us for once! Personally, I'm getting sick and tired of the same old story with the same old plot twists and the same old shots of a masked killer stalking through a house while a hot young female hides out of sight with her hand over her mouth. We've seen it all before. Give us something new, dammit!","user":"ScreamQueer","rank":[15,19]},{"title":"Great beginning but steadily declines throughout","rating":4,"date":"16 February 2019","review":"This movie started out with a lot of potential. AJ King's character Kylie is very relatable. She's very pretty but not in a model sort of way that's distracting. She's a little insecure and and got pressured into sexual activity. She has a strict mother who doesn't understand what she's going through.<br><br>From the beginning of this movie we see a kind girl who is the victim of cruel bullies. The scene of Kylie crying in the shower was very well done. I was able to really feel for Kylie and step into her shoes.<br><br>The problem is this movie doesn't take the first act anywhere. When Kylie goes to babysit in a creepy house, we don't see her grow as a character when she is attacked by creepy intruders wearing pig masks.<br><br>Kylie is smart and pretty good at keeping her cool, but she doubts herself. I would have liked to see Kylie channel her anger from the bullying into self-confidence and growth.<br><br>Instead, we get Kylie on the phone with a suspicious sounding 911 operator for almost the whole middle of the movie.<br><br>The ending is even worse. The student who assaulted her (Markus) shows up for no good reason. There are a few highlights: Kylie was able to turn the tables on Markus and use her ingenuity in the truck to handle her attackers.<br><br>The highlights are good but still left me wanting a lot more.<br><br>The ending scene in the hospital was so unrealistic I wish I could unsee it. I could excuse one major plot hole (Markus showing up randomly) but not that hospital scene.<br><br>Berkshire county would be a much better movie if they used Kylie's trauma to help her develop over the course of the movie.<br><br>Instead, Berkshire County was written in a way that makes the first part unnecessary really. We don't need to learn about Kylie being bullied if it doesn't contribute to the rest of the plot.<br><br>In a nutshell, this movie didn't make use of its strong points. Maybe the director and writers were trying to make the plot unpredictable, but I found it discombobulating.<br><br>I would have preferred Markus and his girlfriend being behind the attack and Kylie getting revenge on them through her superior intelligence and character. This was what I was expecting but we got a bunch of fakeouts instead :(<br><br>Sometimes being predictable isn't so bad.","user":"anushas-01098","rank":[4,5]}]