[{"title":"Intriguing and Fascinating","rating":8,"date":"19 August 2014","review":"Though we know very little about some of the great artists of the past, many say that it is not important because we have the works. Yet the world still longs for knowledge about the living, breathing human being, the man or woman behind the name on the painting or the title page. This element of mystery is what makes John Maloof and Charlie Siskel's documentary Finding Vivian Maier so intriguing, yet also leaves us wanting to know more. The subject of the film is an unknown photographer whose art has been compared to the masters, though she never exhibited her work and little is known about her life.<br><br>The photos, discovered by Maloof, display a segment of society invisible to many in the 1950s - the old, the poor, the black, the young, and the disenfranchised, a kaleidoscope of stunning images that poignantly capture the faces of humanity with humor and rare sensitivity. The story begins with John Maloof reporting how he purchased a box of negatives at an auction in Chicago in 2007 for a book he was working on. Told that the photographs were by Vivian Maier, he did not recognize the name and could find nothing about her on Google. After stashing the box away for two years, Maloof decided to scan some images and post them on Flickr.<br><br>Writing on the website that he had about 30,000 negatives of Maier's work that cover a period ranging from the 1950s to the 1970s, he requested direction, asking whether the photos are worthy of an exhibition or a book. Shortly after that, an article appeared in a British newspaper and the Chicago Cultural Center presented an exhibition of her work in 2011. Kickstarter provided the funding and this documentary began to take shape. Still digging for more information, the second half of the film is devoted to discoveries the director made about Maier and they are not all pretty.<br><br>What we do know is that Maier was born in 1926 and spent some time in France before working as a nanny for upper middle class families in the Chicago suburbs (including a brief time with Phil Donahue). Always dressed in an old-fashioned suit, Maier would walk through streets and alleys with the children she cared for, snapping black and white photographs with her Rolleiflex camera that she held down by her waist. Interviews with past employers and grown children, though often contradictory, reveal a private but very complex individual with strong opinions that she did not hesitate to share. They also indicate that she had a dark side and her reported bizarre behavior may have indicated serious emotional problems.<br><br>There are also stories about her room being filled with newspaper as high as the ceiling, that she used a fake French accent (though some do not recall any accent at all), and changed her name with each family she worked for, often giving phony names. One woman remembered that Maier told her that she was \"sort of a spy.\" Some of those interviewed have more upsetting memories about coercion and bullying, but the film does not dwell on them, nor provide anyone to either counter or corroborate them. We do learn, however, that when Vivian was much older, two of the children she cared moved her into an apartment and finally into a nursing home where she died in 2009.<br><br>Unfortunately, neither of these loving children was interviewed, leaving a tantalizingly vague idea of who she really was. Though admittedly he has a commercial interest in its promotion, Maloof has done a public service by making the world aware of the work of this great artist and has been willing to spend an enormous amount of time and money in the process. Though this has resulted in her work now being displayed in galleries all over the world, the question of why her photographs have not been accepted by the Museum of Modern Art is left unexplored.<br><br>The bigger mystery - why she chose to withhold the photos from the world, of course, is still unknown and the film sheds very little light on this puzzle. Like last year's Searching for Sugar Man, a documentary about Sixto Rodriguez, another unknown but very talented artist, Finding Vivian Maier is a fascinating ride. Unlike Rodriguez, however, Vivian Maier will never hear the applause.","user":"howard.schumann","rank":[29,29]},{"title":"Piecing together the puzzle of a life","rating":8,"date":"10 January 2015","review":"The documentary \"Finding Vivian Maier,\" written and directed by John Maloof and Charlie Siskel, tells the fascinating tale of a woman who lived and died in obscurity - then, through a serendipitous fluke of fate and an undiscovered talent for photography, became well known and celebrated long after her death. So much so that they even went and made a movie about her.<br><br>The saga began when Maloof, a young historian/filmmaker, bought a box of negatives at an auction in 2007. The negatives, it turned out, belonged to a woman named Vivian Maier, born in 1926, who had spent most of her adult life taking pictures of the world around her - more than 150,000 of them to be exact. Vivian never shared her work with the people in her life, even though the images were of a quality to rival some of the world's greatest and most famous photographers. Intrigued by what he had unearthed - the treasure trove included many 8 MM films as well - Maloof decided to re-create the life of this talented woman by seeking out those who knew her and using their knowledge of her to help piece it all together. It seems that Vivian spent her life as a nanny to the well-off families of Chicago; in fact, she was hired by no less a figure than Phil Donahue to look after his four children for a short time.<br><br>Through the movie, there emerges a portrait of an eccentric, intensely private woman, who never married and was seemingly devoid of family, who kept her personal background a secret, frequently used pseudonyms, affected a phony French accent (despite the fact that she was a native New Yorker), voiced strong opinions on politics and society, and traveled the world with only a camera for a companion, continually documenting, through both stills and film, the world as she and few others saw it.<br><br>One of the interviewees describes Vivian's work as reflecting \"the bizarreness of life, the incongruencies of life, and the unappealing- ness of human beings.\" Yet, what comes through most vividly in her work is its humanity, her ability to capture the essence of people from all ages and walks of life in a single moment in time.<br><br>However, if you thought \"Finding Vivian Maier\" would turn out to be one of those unalloyed \"feel good\" movie experiences, you'd be sadly mistaken. For not everything we learn about the woman behind the camera is uplifting, charming and inspiring. In fact, the movie takes a decidedly dark turn in the latter half, as a number of the children she oversaw recount some of the abuse - both physical and emotional - they suffered at her hands.<br><br>She is described by some who knew her as \"damaged\" and \"past eccentric,' riddled with mental illness, paranoia, and a compulsion for hoarding.<br><br>She became more and more isolated from the world as she entered old age, reduced to dumpster-diving for food. and becoming increasingly reliant on the kindness of strangers before death finally came for her in 2009.<br><br>Yet, now her work adorns the walls of many an art gallery the world over, as ever-increasing legions of admirers come to appreciate her talent.<br><br>For all its speculation, the movie demonstrates at least a certain amount of self-awareness by admitting that it may be a trifle unfair to judge a person and the life she led based entirely on how others saw and felt about her, without the person being given a chance to clarify or defend herself. <br><br>In a way, Vivian Maier is a stand-in for all the nameless, faceless people who surround us unnoticed, the vast majority of people who live their lives in relative obscurity and leave little real mark on the world after they're gone. Except, thanks to the fickle finger of fate and her own unique talent, Vivian did leave a mark, one that will be admired and appreciated for generations to come.","user":"Buddy-51","rank":[24,24]},{"title":"Wonderful documentary with two main interwoven stories.","rating":9,"date":"15 April 2014","review":"I saw Finding Vivian Maier last night and thought that the movie was very interesting and riveting. I've been following the story of Vivian Maier's photography ever since the story first appeared on PBS-WTTW, Chicago. At first pass, the story was lacking in general information about her, but the many 1950s/1960s street photos of Chicago (mostly) and New York City were wonderful. The photos, I think it's fair to say, took the international photo art world by storm.<br><br>After she died, the bulk of her photos and negatives were bought by John Maloof, a co-director of the movie. Vivian Maier's personal and photographic story, along with John Maloof's story relative to purchasing the photos and fleshing out information on Ms Maier are the subject of the movie and the two interwoven stories are most interesting.<br><br>Interviews of those that knew her or her work are in the movie, many of her photos are shown, as are shows of her photos.<br><br>I, like the previous reviewer, would like to see the movie again. If it comes out in CD or similar form, I'd be a buyer.","user":"munnh","rank":[26,29]}]