[{"title":"Not very good","rating":3,"date":"11 December 2014","review":"Just saw this and was terribly disappointed. I'm a fan of Robert Patrick but unfortunately he had a smaller role in this movie. The acting by everyone was average and almost seemed as if they all sort of phoned in their performances. Not sure if this was the directors fault or just a lack of interest in the material by the cast, but it really affected the film. The story covered no new ground and felt quite dated which made it a bit boring. It didn't help that the storyline was not very original. The dialogue was filled with clichés and the humor missed its mark. There's some action, but definitely nothing too engaging or inventive. There are so many better action dramas to watch than this one. Tell seemed to miss the mark in most areas and consequently wasn't worth the time to watch it. I gave this a 3 star rating because I like Robert Patrick, but otherwise I would have rated this even lower.","user":"suelyon1989","rank":[28,47]},{"title":"Bad Script + Dreadful Acting = Complete Rubbish","rating":2,"date":"27 December 2014","review":"I hate for this to sound cliché, but this is one of the worst action comedies ever made. Whoever wrote this jive should seek another profession. It's not humorous at all! If you must forge ahead, go back to school and learn your craft or, at the very least, take the time to study action comedies that work like \"In Bruges,\" \"Hot Fuzz,\" \"Kick-Ass,\" etc etc. The acting in this was downright foolish. Some of these actors have been in watchable shows before but it looked like they were trying so bloody hard to make whatever they were given work, that it came across like one big giant improvisation gone very wrong. Every character in this is git and not much differentiates one from another. I'm sure some of this has to be attributed to the director who by now, is likely wondering if waiting tables is what the future holds after this lackluster attempt. I rated this 2 stars because they were clever enough to compile a trailer that duped me into renting this. Fool me once, shame on you...","user":"fredcolbert11","rank":[24,40]},{"title":"Straight-to-video schlock!","rating":1,"date":"24 December 2014","review":"This movie, like many other bad movies, was trying to be something it's not: Good. I watched it hoping to find something I like about it but couldn't. <br><br>Katee Sackhoff, who has been in Battlestar Gallatica on television looked decent, unfortunately she wasn't in enough scenes. The other actors were so-so, the action scenes weren't too action- filled, there were no twists that you didn't see coming, and the premise was so basic and unimaginative. Also, the sound on this was really, really poor. Why make crap like this? Doesn't the movie universe have enough terrible titles that customers have to wade through without littering it with more poorly-made movies like TELL? <br><br>Someone should TELL the people behind this film that just because you can make a film, doesn't mean you should. Straight-to-video schlock like this is waste of consumers time.","user":"cutslikeaknife33","rank":[27,46]}]