[{"title":"This is why I love horror movies","rating":8,"date":"26 July 2016","review":"This film has been popping up around horror circles so I'll admit i was intrigued...people who had seen it mentioned that it was kind of like a zombie movie but not, so then I was little less intrigued (i've seen enough zombie movies) but I had the lucky opportunity to see this film at the Shock &amp; Gore fest in Birmingham and it was definitely worth it.<br><br>It's not a zombie movie per se. There are some similarities, but these guys put a little twist on the genre and it's a really interesting take on the whole thing. Would love to know if this is a commentary on a certain heated global topic but I don't want to give anything away so I will leave it at that and guess that perhaps the filmmaker is sending out a message maybe thru film. Which is the beauty of filmmaking. You tell a story and reveal a truth now and then. But I digress.<br><br>This film has really good pacing. Never once was I bored, nor did I roll my eyes. It kept me engaged at all times and I really loved Wren Walker's performance as the lead. She was smart, caring, funny, tough and vulnerable at the same time, a leader and talented. All the things that make a person, in this particular case, a woman, beautiful.<br><br>There are definitely some things (i.e. stripper stunts) that were...interesting to say the least and some really great kills, espeicially for a low budget film.<br><br>I'm more of a cricket man myself but the baseball element throughout was a nice touch. Whenever you put little touches of sport in an otherwise non-sport movie, there's something about that that I like. I don't know what it is.<br><br>Overall, had a fun time and will definitely look forward to seeing this one again.","user":"wassupoutside","rank":[73,101]},{"title":"Peelers: Slightly above average zombie movie","rating":6,"date":"7 May 2019","review":"Peelers tells the story of a zombie-ish outbreak in a strip club and despite being cliched it's passable stuff.<br><br>Though advertised as a horror I have to say it's arguably a comedy horror, some of the jokes are far too silly for it to be otherwise. This does screw up the tone a tad because they are few and far between, but it doesn't damage the movie thankfully.<br><br>The last time I watched a Canadian zombie comedy it was Ahockalypse (2018) which was a fair bit better than this. Not saying Peelers isn't a good movie, it just plays everything so safe and doesn't really have its own identity.<br><br>Think of all the tropes you're used to seeing in zombie movies, Peelers grabs them with both hands and grips them tight for the full 90 minute duration.<br><br>The cast, unknowns but they do a good enough job especially our leading lady. The effects, passable. The script, not half bad. But the movie itself again just comes across too color by numbers and won't deliver any surprises.<br><br>Passable stuff and a decent enough watch for zombie movie fans.<br><br>The Good:<br><br>Wren Walker<br><br>Has its moments<br><br>The Bad:<br><br>Very little originality","user":"Platypuschow","rank":[5,5]},{"title":"Successful Mix of Comedy, Kill Scenes & Over the Top Fun","rating":6,"date":"2 April 2017","review":"On the final night this strip club's open, the owner gets more than she bargained for. Infected patrons come in for more than naked women, nasty beer and bear which is served on the menu. Besides bear, Peelers serves up a healthy mix of boobs, blood and hilarity. At first glance Peelers seems like another cheap thrills, boob filled, horror film. While all of those things are true, it also successfully pulls off comedy in between it's many kill scenes. Something most movies fail at doing.<br><br>With a set-up similar to From Dusk Till Dawn once they get to the bar. The overall pace of the movie is closer to Feast. The comedy is definitely crude and immature and won't be for everyone. If you like John Gulager movies and you're ready for some fun, Peelers packs a lot of enjoyment.<br><br>Peelers suffers from the traditional low budget horror condition of bad acting, corny dialogue and a weak premise. Horror fans should expect this from any low budget horror film going in. Where Peelers succeeds is they don't take themselves too seriously. <br><br>After a couple of hilarious stripper dance scenes, I was waiting to see what they did with the pregnant stripper. If I have any issue with this cheap thrill ride, it's that I didn't get to see the comedy, that scene would've provided. Opportunity wasted and all for a Winnie the Pooh scene. They lacked contact during their kill scenes as well. They could have used a Tom Savini helping them out but at least they didn't go with enough animated effects for it to ruin anything.","user":"Jipper2","rank":[18,24]}]