[{"title":"Not a masterpiece but worth watching despite its bad critics","rating":6,"date":"26 May 2015","review":"I watched this movie despite its bad reviews because I liked the fact that it is a horror movie in a pyramid and I also quite like movies that have to do with Egyptian history. So after having watched it, I have to say that the one and a half hour I spend doing that was worth it. The pyramid might not be a masterpiece but it is definitely a horror movie worth watching.<br><br>Firstly, I have to say that the settings were well made as well as the monsters. The actors did a good job too. I can't say that they were amazing but their acting seemed quite natural and they were well directed. Another fact I liked about this movie is that it was decently scary(enough to scare the average watcher) and intense. I quite enjoyed most killing scenes too. In that aspect I think it was better than most horror movies I've seen lately . It could have been more intense though.<br><br>Coming to the bad points now, as you can probably can guess already the plot is not something new or groundbreaking. You won't see something entirely new here. The only thing that's somewhat \"new\" is that the killings happen in a pyramid. In addition, the movie is not evenly good for its entirety. It starts well, shows promise and is pretty good for a big part but the last part of the movie ruins that feeling. Some scenes of the last part of the movie are not that well-though. Add to that the fact that they probably overdid it a bit with the selection of the \"monster\" and you can understand why it has bad critics. They involved Egyptian mythology a bit too much I guess but I won't spoil further. <br><br>To sum it up, The pyramid is a horror movie worth watching despite its flaws. They did a good job for a low budget movie like this and an average horror movie fan will surely have a nice time watching it.","user":"timelesswind","rank":[48,59]},{"title":"Uninspired, uneven, uninteresting, and un-scary.","rating":3,"date":"3 November 2015","review":"This is not a very good movie. The premise may sound promising. The archaeological angle on horror is one that's always interested me, and The Pyramid throws some Greek Mythology in the mix for good measure. Well, the most mythological thing you'll experience during this movie is wishing Hades would drag you into the underworld so you'd never have to remember this atrocity. It's so bad.<br><br>Visually it reminded me of Alien vs Predator and As Above, So Below, so it's not very original. Atmospherically it reminded me of The Descent, which dealt with claustrophobia infinitely better than this. It's your standard \"team trapped underground\" story where they get picked off one by one. Problem is, every character is one-dimensional so their deaths leave absolutely no impact. The characters themselves are irrational and annoying. \"Hey, we just heard harrowing screams from our friend back there, let's split up!\" Great plan. Oh, and the villains in this movie are one of a kind: Pussy cats. Yeah. Killer cats. And don't worry, the big bad wolf shows up too but I'd rather not say anymore because it's truly a catastrophe best seen for yourself. <br><br>This is just a dumb movie. I don't know how else to say it. The characters are dumb, the mythos is dumb, the deaths are dumb. There is one jump scare that kind of works but other than that it's horribly directed (going back and forth between found-footage and regular filming was a horrific idea), generic trapped underground story with a third act so ludicrous it's almost worth watching for the laughs. The Pyramid is nothing new, don't waste your time.","user":"lnvicta","rank":[54,73]},{"title":"Promising, but disappointing","rating":3,"date":"4 March 2015","review":"I was looking forward to this movie, despite it's IMDb score.<br><br>I loved the mood &amp; setting, loved the creatures, loved the historical twist. But I'm just sick and tired of the forced character roles, where men are portrayed as dumb cowards or brutes, and women as brave and strong.<br><br>It would have been easy enough to balance the roles out, and create a more interesting dynamic. As it stood, the characters were just irritating, and stood in the way of enjoying the movie.<br><br>Too bad, because the rest of the movie was pretty good. Especially the sets, props, and creature designs. I just couldn't enjoy it because of the roles the cast had to play. Very disappointing.","user":"konrad-40-205915","rank":[81,123]}]