[{"title":"Divinely crafted","rating":14,"date":"14 August 2017","review":"I never thought I will appreciate movie genres like this.Lately I have been watching sci-fi, suspense and romance themed movies. At first I have no plan of watching this movie, but my attention was caught when a friend of mine told me what was this all about. I must say, the movie was \"divinely crafted\". This was the first movie that really punched my ego and played my emotions. Some parts of the movie can rip your soul and enlighten you about the divinity of God, the nature of life, the circumstances that we do not understand. The story was beautifully and intricately written, absolutely.<br><br>If you watch the movie, you will really feel that God was there, in front of you, talking to you, loving you, giving you ideas that encompass human comprehension.<br><br>\"Why does it have to happen?, why do we have to suffer?, If God does exist, why wont he show then?\", these are questions common to us, surely you have asked these questions yourself.<br><br>If you are that person who questions the incomprehensible course of fate, circumstance and life, this movie is for you.","user":"cabsjohnmark","rank":[94,124]},{"title":"Not your typical Christian film","rating":9,"date":"6 March 2017","review":"I am not a regular church goer, nor did I have high expectations for this film at all, and I do not cry in films, but this movie made me ball. Most Christian films fall flat and can be subjective, but this was different. I knew people who were fans of the book and highly anticipated the film, but seeing it is not a movie, it is an experience not to be missed. The values of forgiveness and true faith are challenged and as the viewer it was overwhelming. Better than any of the Oscar nominations this year.","user":"missrachelsch","rank":[187,288]},{"title":"The Best Spiritual Movie I've Ever Seen","rating":10,"date":"4 March 2017","review":"If you are spiritual, but not religious, see this movie. If you are religious, see this movie. If you have suffered a great tragedy or loss, and you are in pain, see this movie. If you have tried to make sense of spirituality and religion but could not, see this movie. It is full of wisdom and metaphor and not your standard religious dogma. It's the best spiritual movie I have yet to see.","user":"danielendy","rank":[237,370]}]