[{"title":"A realistic and non sensationalised account of bipolar patients","rating":24,"date":"24 June 2016","review":"This film tells the story of a man and a woman who meet each other in a psychiatric ward in a hospital. They bond over poetry and other artistic aspects, yet they trigger each other's manic illness that naturally causes much concern to the people around them.<br><br>\"Touched With Fire\" is the name of a poetry book that I had to study in my GCSE English literature course. Hence, I wanted to watch this film. To my surprise, the story is very because it is real and convincing. The two bipolar patients behave exactly like what people having a relapse behaves. Their highs and lows are realistically portrayed by the director and the acting talents. When the guy proclaims his love for manic relapses, it is almost heartbreaking to watch. <br><br>It is unusual that a film can portray bipolar lives so accurately. I really like the fact that Kay Jamieson, the author of \"The Unquiet Mind\", has a cameo in the film as well. \"Touched With Fire\" is really a hidden gem.","user":"Gordon-11","rank":[11,12]},{"title":"Moon and Sun","rating":6,"date":"19 February 2016","review":"Greetings again from the darkness. We all have good days and bad. Sometimes we energetically leap from bed, while other days we barely muster the energy to push off the covers. For those who are bi-polar, those peaks and valleys are mere child's play. When \"up\", they often are filled with frenetic creativity and hyper-energy. When \"down\", life holds no purpose and the simplest daily actions are deemed impossible. Medication seems to be their only hope for \"normal\".<br><br>Writer-director-editor-composer Paul Dalio admits much of the story comes directly from his life and that Carla and Marco carry much of him. Katie Holmes plays Carla and Luke Kirby (Take This Waltz, 2011) plays Marco  theirs one of the few on screen meet-cutes to occur in a psychiatric hospital (not counting McMurphy and Chief). When the pendulum swings, Carla frantically scrawls out poetry based on nature and feelings. Marco is also a poet – the rapping kind – but he seems more addicted to the energy and spirit that goes with being up.<br><br>The film is really two-in-one  a star-crossed love story and a commentary on treatment (to medicate or not to medicate – that is the question). The writings and work of clinical psychologist Kay Redfield Jamison play a vital role here, and she even appears as herself in a critical scene. Carla really wants to get \"right\", especially when she discovers she is pregnant. Marco, on the other hand, spends much of his time trying to maintain the \"high\" as he finds life so much more fulfilling and interesting when not medicated. Marco uses the track record of many suspected bi-polar types as proof that greatness is near – Emily Dickinson, Tchaikovsky, and Van Gogh.<br><br>Bradley Cooper was Oscar nominated for his bi-polar role in Silver Linings Playbook, and both movies pay some attention to the challenges faced by families. Carla's parents are played by Christine Lahti and Bruce Altman, while Griffin Dunne is Marco's dad. The best intentions often fail miserably, leaving all parties feeling frustrated and emotionally distraught. The movie seems to make the argument that medication is the only real hope if a sufferer wants to live anything approaching a normal life, and it's Ms. Jamison's stated contention that medication will neither change the personality nor negatively impact creativity.<br><br>Katie Holmes offers up her best work since Pieces of April in 2000. Of course, there was a \"marriage\" mixed in there that stomped down her career. This role reminds that she is capable of finding the core of a deep character. Welcome back. Spike Lee is listed as a Producer here, and Mr. Dalio says Lee, who was his NYU Film School professor, encouraged him to explore this facet of his affliction. Dalio's wife Kristina Nikolova shared cinematographer duties with Alexander Stanishev.<br><br>The film, previously entitled \"Mania Days\", does a nice job of showing us the extremism involved with being bi-polar, as well as the challenges that come from being part of the medical field or familial support staff.","user":"ferguson-6","rank":[19,25]},{"title":"A realistic portrayal","rating":8,"date":"12 November 2016","review":"Love and mania and the love of mania -- these are some of the powerful themes explored in this gritty movie about bipolar states of being. The fine script inspired solid performances from the lead and supporting cast alike. They wanted to make this movie and gave it everything they had to tease out the difficult material that was presented in this film. It will probably not be to everyone's taste but if you are looking for a movie that challenges you to examine what society calls 'mental illness' and how that label affects those thus labeled and the difficult relationships that these people have with those who love them most, \"Touched with Fire\" is definitely a show that you want to check out.<br><br>It would be too depressing to make a movie that hews too close to reality when it comes to the bipolar mind because an unwatchable tragedy just seems inevitable; \"Touched with Fire\" takes the audience close to where they would turn away but manages to inject enough hope to keep you going. And that is the central tension in the film -- a glimmer of hope when all appears to be lost. Many people would disagree and say that this picture is too depressing, but I tend to think that these people want movies to narcotize them with a massive dose of feel-goodism.<br><br>Otherwise, for the few grown ups out there, this movie is worthy of your time.","user":"mingsphinx","rank":[7,8]}]