[{"title":"Low-budget science-fiction deserves attention for its wit and energy","rating":10,"date":"10 November 2013","review":"A mind-bending and very entertaining independent science-fiction film, Coherence takes place over a single night in which a group of old friends (an ex-lovers) gather for a party on a night when a comet is expected to pass unusually close to the Earth. One of which is played by Nicholas Brendon of Buffy the Vampire Slayer in a scene-stealing role. I missed him.<br><br>At first, glasses start breaking and cellphones shatter. Then the power goes off, except at one house down the street. Then there are strange bangs on the door and bizarre notes left at the house. Things get stranger when two of them decide to go to the lit-up house to make a phone call.<br><br>It's a good film to me because the science-fiction concept ends up reflecting the real-life conflicts between the characters in a very clever way. I'm still not sure how I feel about the ending, but the film is a wild and entertaining ride before it gets there. Scenes propel themselves to other scenes with fast and snappy dialogue. Though it will be compared to films like Primer and Timecrimes, it's a pretty original film overall.","user":"outdoorcats","rank":[202,251]},{"title":"Inventive, Suspenseful Film spoiled by Baffling Character Behavior","rating":6,"date":"7 April 2016","review":"There's a lot to like about Coherence. It has an original premise. It's well acted and the dialogue has a nice naturalistic feel.<br><br>Unfortunately, the conflict and paranoid atmosphere felt forced to me. It's all well and good to have one character, Mike, who has a drinking problem and such hostility toward himself that he assumes that his Doppelganger will try to kill him. But why are all the other characters in this film so paranoid and on edge from the beginning? They're a bunch of self-absorbed yuppies, not escaped murderers from a maximum-security prison.<br><br>You're at a dinner party, there's a power outage so the lights go out, and then there's a knock at the door so. . . you startle as if they threw a rock through your window? And then grab a baseball bat before answering? This seems odd, especially when two members of your party have just left to go investigate the house up the street with the intention of asking to use the phone. If it were me, I'd just assume that someone was probably coming to my door to ask the very same thing.<br><br>And once these characters figure out that reality has fractured and that there are duplicates of themselves from another reality running around--I still don't understand what they're so afraid of. I mean, obviously that would be a freaky and unsettling situation. But once your doppelganger has demonstrated, by leaving exactly the same note that you wrote on your front door, that he behaves exactly as you do, wouldn't you at least be somewhat curious to meet him or her? Most of these characters seemed reasonably intelligent and rational. Why should they be so automatically fearful of these alternative selves--even after they've accidentally spent time with them and found them to be benign. <br><br>I think the writer needed a stronger trigger for all the fear and hostility.<br><br>And as several commenters here have mentioned, the camera work is bad. I understand that hand-held is used to add energy and tension to a scene, but there's no excuse for things like that interminable opening shot in which no part of the frame is in focus. It's just annoying.","user":"davejones","rank":[96,123]},{"title":"movie we saw is just a single frame of the larger story","rating":10,"date":"20 March 2017","review":"<ul><li>and so would my rating, if possible, break out the limits of 1-10 What is most funny is that we cannot be sure of absolutely anything depicted, because it is likely this movie is only limited period of a story far beyond it's frame.</li></ul><br><br>It is clearly shown that Laurie and Mike have no recollection of each other, as if they haven't met before. A director's clue is almost explicit in line \"I guess it must be another girl that Kevin dated and Amir is hooking up with\". Besides, it is stated the technology failures occurred during the day of the dinner party, the comet was affecting the world throughout some time.<br><br>The whole \"original house\" may not even be as original, because the group goes outside to watch the comet, and when they return in, one glass on the table is broken. It seems the have changed the entire setting (the house itself) as a unit.<br><br>Bonus clue for the never-ending ending debate: there are two rings after the comet falling apart. If material objects are preserved, so may be are people as well.. Especially if we consider another line told by Lee (or someone else), how the house is the box and they are the Schroedinger's cat. Therefore anyone in the house is not affected by outside turmoils. Original Emily has left her double in the bathtub, in the house. She simply.. cannot be dead or evaporated. Besides, if the strange effects started before the nighttime of previous day, why would they end with the sunrise? Another interesting phenomenon is the last house itself. It seems not to have been impacted at all, by the comet. No note, no one knocking, no interferences according to their behavior.<br><br>The other interesting phenomenon are the electric blackouts, happening for unknown reason. In one interview the director clued on following Emily at all times. However these blackouts are cutting us from her, and that may also be significant.<br><br>The last thing I'd like to mention is the scene by the car, where Emily and Kevin meet, and realize they're not from the same realities. This scene is one of the most eerie scenes I have ever seen.<br><br>Thank you for this movie, it is a treasure for humanity.","user":"AndreaBeaumont","rank":[65,83]}]