[{"title":"Well-conceived fun in a gory setting.","rating":8,"date":"2 October 2015","review":"What a roller-coaster ride!<br><br>I was not expecting that much watching this movie. I thought about a bad C movie with a cheap producing. Already in the first minutes I realized that my thoughts were wrong.<br><br>I really enjoyed the movie very much. It's an elegant mix of comedy and horror, where the classification in the one or the other scope is not always obvious. Both genre are successfully assisted by the whole techniques and instruments of film making.<br><br>The story is pretty flat but that is not the point of the movie and you won't miss it. The focus is much more on the presentation of the different scenes, underlined by some suitable/ non suitable music, and good camera views. Last but not least the screenplay is pretty smart, so that you won't always know if you what you are watching is supposed fright or make you laugh.<br><br>Thank you for the experience mister Roday.","user":"furfur-1","rank":[20,30]},{"title":"Over the top humor that the \"Psych\" guy brings","rating":6,"date":"12 October 2015","review":"My quick rating 5,8/10. First off, let me start by saying I really like the TV show \"Psych\". OK, that being said, James Rhoday wrote and directed this which is already a plus in my book. For a first film, this offbeat comedy (much more comedy then horror by far) was actually pretty entertaining. Basically 3 people kidnap 6 people at a bar for the soul intention of eating them. And how casual and nonchalant this is makes the whole atmosphere that much funnier. The jokes are often inside jokes,and over the top but still funny. The gore does not disappoint in the slightest. Each death in this movie is original to say the least leading up to a pretty interesting climax. Look forward to more from him and maybe even a sequel?","user":"jackmeat","rank":[6,7]},{"title":"Rather enjoyable but too kooky effort to really impress","rating":5,"date":"22 April 2016","review":"Arriving at a Mexican cantina, a group of criminals hold the remaining employees hostage and force them to participate in a series of depraved games intending to devour them afterwards and forcing them to fight back in order to avoid becoming a meal.<br><br>For the most part this one here ended up being quite a bit more bizarre rather than outright horror effort. One of the main challenges facing the film is the fact that this one just doesn't seem to be concerned at all with logic or coherent motives, making for quite a challenging time here trying to figure out what's happening here. The initial plot of choosing this particular restaurant doesn't come up, how long the group's been doing this or how they even turned to cannibalism, making this so confusing as to their motives that it doesn't really strike any kind of chord at all because the inherent goofiness really undermines how they could've been portrayed. By playing them as frightening figures in an absurd situation and then gone off-the-wall with the goofiness could've been an enjoyable time here, but instead we get completely goofy characters acting in a totally confusing manner which really undermines this one considerably. That said, the goofy humor and rather jarring tonal shifts between everything here is another problem, as on the one hand there's certainly an attempt to make them seem tough and imposing with the way they hold the group hostage and begin spelling out the different games with them, but then it goes for goofy off-the-wall humor with the utterly irritating and endless manners in which they overtake the restaurant, deal with the group and basically just the very hard- boiled nature of not taking anything seriously despite the entire purpose for being there being to kill and eat them. That alone should've made this a lot more chilling in nature, but it's jarring tonal shifts make for a wholly off-beat experience. Still, there's a lot of positives on display here, which begins with the rather impressive kills here resulting in some rather brutal and graphic kills throughout that are just so silly while also being admittedly quite unique as well, and the fact that there's quite a large amount of really bloody deaths within here. As well, the comedy featured in here does get in a few good moments here where it generates a laugh due to the outrageousness of the situations presented here and really giving this the part of the film's overall best quality in the exciting and enjoyable pace here. This one doesn't really slow down all that much and stays involved for the most part, keeping this one going forward with a lot of interesting confrontations, lots of action and a generally fun air about it that gives this one plenty of bizarre and really entertaining parts to it as it whips through the zany situations. There's still some some problems here, but it's not that bad.<br><br>Rated R: Extreme Graphic Violence, Graphic Language and minor sexual acts.","user":"kannibalcorpsegrinder","rank":[3,3]}]