[{"title":"Tedious","rating":1,"date":"14 October 2015","review":"I'd have to say that most reviews here are spot on (as ever) apart from the obvious 'shill' (who even kindly reminds us it's on Amazon!) The film struggles throughout. Struggles for pace, coherence, atmosphere and most of all any scrape of originality. Even Nicole Kidman clone Kate Bosworth again shows she can't act for toffee as do the rest of the cast with alarming consistency. The film yearns to be Misery or any decent film of the Psycho Stalker genre but falls so far short it is funny. Bosworth's inaudible mutterings attempt to give a semblance of coherence to the dreadfully thin plot, the only convincing performance was the one from the cat who, in fairness delivered his 'miaows' with sublime skill and is the highlight of this dreary, poorly produced mumblefest.","user":"jackstupidjack","rank":[30,39]},{"title":"worst film in history","rating":1,"date":"9 September 2015","review":"I've set up an account just to rate this outrageously dull movie. Trust me do not waste your time. How it actually got made is beyond me. Really do not even waste your time. The 'twist' at the end is just as boring as the rest of the movie. I'm tempted to write to sky and ask for a refund. Ridiculous acting Ridiculous plot A complete waste of money I should have taken note of the other reviews and not even bothered with this movie............................................. .................................................. .................................................. .................................................. .","user":"dave-32952","rank":[38,57]},{"title":"I must be weird","rating":7,"date":"26 September 2017","review":"I really enjoyed this film. I found the lugubrious pacing and slow menacing atmosphere quite interesting and it drew me in but then I have strange tastes. Reminds me of \"Misery\" but with a totally different angle.<br><br>What surprised me even more is that I always thought Kate Bosworth was a terrible actress and I have now changed my opinion somewhat as she was really very good in this role.<br><br>The twist in the tale was totally unexpected and made the film even more interesting. I guess when the story draws you in and you become immersed you are less likely to try and work things out and criticise but just let the story take you to the endpoint.<br><br>I think I must be the only person in the reviews section that has given this a good review and I don't know why as the film was really rather good, apart from some plot holes; like who was the previous husband in the cupboard and why did the new guy not know about it or maybe he did as he had lost his memory and went along with it all because he did in fact love the main protagonist.","user":"omendata","rank":[11,15]}]