[{"title":"Shaun the Sheep - a film that the whole family will enjoy","rating":8,"date":"18 February 2015","review":"I considered Aardmans last stop motion effort 'Pirates - in an adventures with scientists' to be a bit of a let down when it was released three years ago and wondered if they had gone off the boil a little bit by trying to appeal to the mass market and thus diluting their witty humour as a result. However after 80 odd minutes of Shaun the Sheep I am happy to report that they are back on track.<br><br>Shaun is extremely well animated and manages to keep the story ticking along and funny enough to keep your interest without really feeling stretched. Considering as the film has no real dialogue to speak of that is no mean feat, and is reliant on top notch production design, expressive animation and a script that is entertaining and funny without being overly ridiculous. Whilst the Shaun the Sheep/Timmy Time TV shorts are aimed at young viewers, there is a decent amount of underlying humour here that adults will also engage with and thus it doesn't insult your intelligence the way some films do.<br><br>After Aardmans infamous falling out with DreamWorks (who wanted them to Americanize Wallace &amp; Gromit) I did wonder if Aardman had sold out for the mass market after feeling the Sony Pictures distributed Pirates had a whiff of compromise to it, and that's partly why I felt Pirates fell a bit flat. However Aardman have teamed up with an independent European distributor for Shaun and as a result it seems they were allowed to make the film they wanted to make this time round. In effect I was not disappointed with Shaun, the simple but hilarious premise of the TV show is expanded successfully to the big screen with no noticeable compromises for the mass market. That the film is also dialogue free should make it an easy sell abroad too and I'm glad to see the film has been well received.<br><br>So well done to Aardman for making one of 2015's most enjoyable, entertaining and amusing films so far.","user":"trevorwomble","rank":[48,51]},{"title":"A gift for the fans.","rating":10,"date":"9 February 2015","review":"I never ever go to the cinema (I rather wait for the Blu-ray to be released and just paying once but yet I went to London from Spain just to see this movie. I didn't wanna wait for it to be released here. <br><br>Shaun the Sheep is a brilliant TV show so when I found out a movie was being made I was totally thrilled. Even though going from the 7-minute episode to a full length movie was a big step, I was confident in Aardman to made the transition easily. They didn't disappoint. First, let me say that I love stop-motion; it's such an \"intimate\" technique due to the fact that you always have to literally be on top of the character to change it every time he makes the slightest movement. But not only is the technique beautiful, the story doesn't disappoint either. This doesn't feel like a dragged out episode of the show, it feels like a story that goes beyond the usual surroundings of the show while still maintaining how everything works. This movie made me laugh a lot. If there's something that Shaun the Sheep always achieved was the ability to create humor of the most simplest situations. But I also cried a lot. Tears of sadness and happiness. And truthfully, I never expected Shaun the Sheep to reach me so deeply. There's a scene where you can see so much pain in Shaun eyes. And that's just clay! My God, congratulations to whoever did that, it was so moving. And I also had a sweet spot about Slip, the dog that Shaun meets early in the movie and come along for the adventure. She was a new character but she felt like and old member of the gang. <br><br>I haven't enjoyed a movie so much in a long time. And I haven't felt so many thing with a movie in a long time either. So thank you, Aardman, for giving a fan such a great gift.","user":"martinyfelix","rank":[62,68]},{"title":"I was late for The Interview","rating":9,"date":"6 February 2015","review":"I am a grown male and got the timings wrong to see The Interview and could not be bothered to wait for the next screening so I selected the next film starting.<br><br>I have never seen the series, so cant judge if this is a good or bad adaptation all I can say this is a truly funny film though aimed at children is funny enough to keep me entertained.<br><br>The animation is uniformly excellent and honestly kept me guessing from the start to the end whether it was CGI or stop motion, I am still not sure even after reading all the credits. Maybe I didn't read them properly because the theme tune is very catchy and bounces round the head even now. <br><br>The story is easy to follow, the characters are likable and there is no trite wince inducing dialogue, everything is mumbled by the humans and the sheep communicate in a variations of bahs. There are some cracking running gags and a smattering of fart jokes. The sheep in disguise have to be seen to believed and the viewer would be surprised what goes on with a horse.<br><br>The closing credits though long are a fun roll with a funny bit at the end.<br><br>Watch it. I bet The Interview wont be as much fun.","user":"Braindead09","rank":[81,95]}]