[{"title":"Ip Man 3 is a touching ending to the Ip Man Trilogy, a movie with more depth than the previous two","rating":10,"date":"23 December 2015","review":"I will try to keep this spoiler free. <br><br>Donnie Yen returns for Ip Man 3, and despite being produced by the same team, the theme that is explored... is that much deeper. <br><br>Ip Man focuses on \"Survival\", Ip Man 2 focuses on Everyday Life and Making a Living, while Ip Man 3 focuses on \"Life\" itself.<br><br>The audience will need to pay attention to details to enjoy the movie fully, starting from the first scene, and really understand how the first scene relates to the whole story. So... REMEMBER the first scene! (The Butterfly Scene)<br><br>There are subtle hints hidden in the move, be it Bruce Lee's quote of \"Be Like Water\" or \"One-Inch Punch\" where viewers really need to pay attention to the story and choreography to understand.<br><br>Ip Man 1 and 2 focuses on grounded action, and realistic choreography. Ip Man 3 has that, but added another layer of beauty to the movie, thanks to Yuen Woo Ping(Matrix, Crouching Tiger Hidden Dragon)'s choreography. The details of every fight scene can be enjoyed and explored. <br><br>While many think that Ip Man 3 will be just a martial arts exhibition, but the team managed to bring in a layer of emotion we have not seen in 1 and 2. <br><br>Donnie's Ip Man is now a much more grounded, humble and just that neighborhood family guy we all love. <br><br>Donnie Yen's performance here is nothing sort of amazing.<br><br>Lynn Hung's performance is also outstanding.<br><br>All in all, the movie may not please all critics and fans who ONLY loves hard-hitting action, but if you are looking at an Ip Man movie with Great action, great humour and that sense of touch with a love story, then Ip Man 3 is the best in the series.","user":"tiger-lion_eternalenemie","rank":[89,113]},{"title":"Very beautiful and captures true value of life.","rating":10,"date":"17 June 2016","review":"What a lovely and meaningful movie. This movie emphasize why martial art is important, to defend but not to offense. And it also highlights the true meaning of love, not leaving thy lover when she needs us most and spending your last moments with the person you love and willing to give yourself for your loved one is the true meaning of love. And one of the most remarkable trait is that respect one other and accept defeat with equal favour. Perhaps this may easily be one of my favourite movies of all time. Donnie Yen portraits ancient Grandmaster YIP perfectly without any doubt he captures Mater Yip's Kindness and Generosity.","user":"jweeraka","rank":[13,14]},{"title":"elevator scene is unforgettable","rating":8,"date":"11 March 2016","review":"Yes, I do \"get\" that the third entry is intended to be more spiritual and more metaphysical and less exploitative.<br><br>No problem.<br><br>But, that said, there a fight scene in an elevator which will have even the most jaded viewer standing up because of the sheer exhilaration of the moves. And is worth the price of admission.<br><br>Just as Matt Damon seems destined to be the ultimate Jason Bourne, fans all over the planet have voted with their wallets and proclaimed Donnie the ultimate Ip Man. He does not disappoint. Cool as ever, I never get tired of watching his punches speed up at the end of a fight (which is how the viewer knows that maybe, possibly, he is getting just a little annoyed.) As a token of my respect for this film, I will not mention the performance of Mike Tyson. Which takes more self-restraint than you realize.<br><br>A tiny bit slow here and there, but a wonderful film overall and highly recommended.","user":"A_Different_Drummer","rank":[30,36]}]