[{"title":"Great History Lesson that Helps You Appreciate the Rights We Have Today","rating":9,"date":"10 October 2013","review":"\"The Watsons go to Birmingham\" is quite an interesting film and keeps my attention throughout.<br><br>Kenny, (Bryce Clyde Jenkins) and his family are African Americans. They live in a time period where segregation is still happening. Their family takes a trip to Birmingham, Alabama to visit their Grandmother Sands (LaTanya Richardson). In Birmingham, they take a stand for what is right. <br><br>I absolutely love the story line in this film. It's powerful, gives me a better perspective of what people went through back then and gives me an appreciation for the rights that I have today. Some of the scene sequences are extremely intense and the actors are doing a spectacular job in portraying their characters with the emotions. The young actors such as Bailey Tippen (Naomi), Skai Jackson (Joetta) and Harrison Knight (Bryon) are to be commended for their outstanding performances. They are so believable. The set, makeup, wardrobe and antique cars are great to see with so much attention to details. It really gives you a feel of how it was back then. My favorite character is Kenny because I can relate to him and in some scenes I would probably act the same way. My favorite scene is when Bryon is kissing his reflection on the car window and his lips are stuck. He has a hard time getting them off of the window. I can tell this really hurts, but it is extremely funny to see.<br><br>Director, Lenny Leon (A Raisin in the Sun), does a great job in directing this film and understands the history and the story line. There is a lot attention to detail with the human behaviors and uniqueness that's makes this film so much more believable. A message in this film is that we are all created equal. It does not matter what skin color you are, you have the same rights as anyone else. Please treat people the way you want to be treated. <br><br>I recommend \"The Watson go to Birmingham\" for ages 10 to 18 and for the entire family. I give it 4 out of 5 stars as the overall production is put together extremely well.<br><br>Reviewed by Brianna Hope B.,KIDS FIRST! Film Critic","user":"rannynm","rank":[20,21]},{"title":"Why Did This Film Get Buried?","rating":10,"date":"17 July 2015","review":"This movie is based on the book by Christopher Paul Curtis, a well respected children's author. The movie is about an African American family living in Detroit, Michigan who spend the summer in Birmingham, Alabama. The Watson children don't know about Jim Crow laws and segregation in the South. The children soon learn about the civil rights movement and discrimination. A scene like in the diner where the waitress tells them to go in the back or the cinema where whites and blacks are separated from each other. The film has a harrowing climax with the reality of the church bombing. The Watsons have made a life in the North but their Southern relatives face discrimination and segregation on a daily basis. This film is appropriate viewing for children. In fact, the movie and book could be used in the classroom.","user":"Sylviastel","rank":[8,8]},{"title":"Watsons to Birmingham-Another Bountiful Trip ****","rating":10,"date":"6 October 2013","review":"Excellent film where a black family from Michigan go to Birmingham, Alabama one summer at the time when the civil rights movement was definitely gaining momentum throughout the nation.<br><br>The elder son is troubled and destined to get into big trouble. The younger brother is much more of the intellectual type, a real bookworm. The sister is sweet.<br><br>Anika Rose is quite good as the mother.<br><br>This trip will bring the family together. Note how quickly the eldest son matures. It is a revelation of integration of his personal problems with what is occurring in America circa 1962.<br><br>When the bombing of the church occurs, this event would give rise to Spike Lee's excellent documentary,\"Four Little Girls.\" This tragedy would serve as a wake up call to America.","user":"edwagreen","rank":[6,7]}]