[{"title":"Pleasantly delightful... or delightfully pleasant","rating":7,"date":"29 July 2014","review":"I find all of woody allen flicks interesting. Always an interesting subject no matter how good bad ugly great the movie is. This new one is no exception.<br><br>MITM is a totally pleasant whimsical delight... the actors are charming especially Emma Stone and Eileen Atkins as Colin Firth's aunt. <br><br>The humor is very light... whimsy is a good term... is it funny? For me NO... but it's also not unfunny. It's just this one long smile.<br><br>The scenery is gorgeous.<br><br>The story is smart hidden in a cute jacket. <br><br>The age difference between the two is maybe a tad much but the rom in this romcom is not the leading factor... at least for most of it. Maybe a Colin Firth from 15 years ago would have been a better lead but unless Woody has access to that time travel device in Midnight In Paris that was not an option. <br><br>As with some other Allen films there is a turn in direction at some point. Won't give anything away. Your enjoyment of the movie might hinge on how you feel after it goes after this point.<br><br>For me it may have lingered around too long towards the end. <br><br>Firth is good and likable but I did find some of his character's decisions to be too abrupt. But maybe that's just me. And some of his duologue felt a bit rushed and acted. <br><br>I wouldn't personally rank this as one of his recent greats like Paris, Jasmine, Match Point or VCB... but it's a fun summery concoction of scenery, whimsy and costumes.","user":"goofyball","rank":[67,87]},{"title":"A Widely and Profoundly Misunderstood Gem","rating":8,"date":"20 August 2014","review":"Most viewers are taking this film as a conventional (and admittedly entirely predictable) romantic comedy which happens to be about a magician who debunks fake spirit mediums, and a beautiful young woman whom he believes is just that. But that's getting it *entirely backwards*. It is in fact a thought-provoking exploration of the extreme materialistic worldview -- the view that holds that modern science has eliminated the possibility of the existence of the soul, an afterlife, and God -- and an exploration of the psychological relationship between embracing that worldview, and being pessimistic and unhappy. As such, it is one of Allen's most personal and thought-provoking films in years.<br><br>And if that sounds \"heavy,\" the miracle of the movie is its very lightness. Obviously, the themes enter in so effortlessly that many people are missing them entirely! You need to be interested in the tension between the materialist worldview and the conventional one that accommodates the spiritual and the mysterious, but if you are, you will be astonished at how delightful and entertaining an exploration of those deep themes can be.<br><br>The age discrepancy between Frith's and Stone's characters, which I am sure will bother many, is in fact completely necessary: he must be old enough to be set in his pessimistic ways, and she must be young and beautiful enough to challenge them at first sight.<br><br>Obviously there are happy atheists and there are miserable spiritual people, so the question that Allen is asking here is whether some unhappy atheists have embraced the soul- and God-denying position too vigorously, as a sort of defense mechanism to shield themselves from the fundamentally irrational possibility of falling in love. The way the movie knits together the materialist / spiritualist question, the possibility of love, and the metaphor of magic -- well, it's sheer magic itself.<br><br>This is far from Allen's funniest movie, and it's only a 7/10 as entertainment. But not only does it easily gain an extra point for its depth, it almost gains two. Admittedly, I am fascinated by the movie's themes, but I think that anyone who is interested in them may find themselves as charmed and, ultimately, as deeply moved as I was. 89/100.","user":"emvan","rank":[157,222]},{"title":"Magical, what else? Lovely story, great acting, beautiful sets, shall I go on?","rating":9,"date":"19 August 2014","review":"Stanley (Colin Firth) is a famous magician in the Roaring Twenties Europe. He performs in a Chinese costume, the rage at the time. Yes, he is great. But, he is a little dictator to the rest of his crew, spewing out orders right and left. One day, an old friend, Howard (Simon McBurney), also a magician but not quite as well known, comes for a visit. Its more than a friendly chat. Howard brings word about a young medium named Sophie (Emma Stone) who he, Howard, believes is hoodwinking a wealthy family who lives in the south of France. However, Howard has seen her in action and CANNOT discover her secret. Could Stanley come and investigate? Ho ho, indeed he can, for in addition to magical tricks, our Stanley loves unmasking frauds who claim to have paranormal powers when everyone KNOWS there is no such thing. There is no spirit world, no afterlife, no ghosts, etc. That's what Stanley firmly believes and he has ripped off the disguise of many a huckster. So, to France the two go. Yet, Stanley is about to face a formidable foe. He finds Sophie beautiful, intelligent, and gifted. In addition, after seeing her in action, Stanley is aghast to discover that he can't understand her talents either, especially after she tells him some of Stanley's family secrets. This man runs to the home of his nearby aunt (Eileen Atkins) and plots how to further the cast. Will Sophie be found to be, gulp, the genuine item? Is there a paranormal world? This lovely film has it all, my view. It has a great story, with many a memorable line. Allen is surely the best screenwriter of all eternity. Then, the actors are terrific. Firth and Stone are dazzling stars while McBurney, Marcia Gay Harden, Atkins, Jackie Weaver, and all of the rest give terrific support. Next, the scenery is the kind to put your eyes out while the costumes, cinematography, and lively direction make for a most enjoyable film. My only criticism is that Firth and Stone are too far apart in age to really be a romantic couple, especially with Stone made to look as young as possible. Nevermind, because its not really important. What's important is that YOU go see these magical film before the next moon rises.","user":"inkblot11","rank":[50,67]}]