[{"title":"Mischief Night - Don't get too excited..","rating":3,"date":"21 July 2014","review":"The blu-ray cover tells us it's \"An Old School slasher\". I don't remember them being so boring. It also tells us it's \"The Purge meets The Strangers\". Or you could also say \"Halloween meets You're Next\". All of the above titles I love, this mix doesn't deliver in any way. <br><br>In the opening sequence we're introduced to a couple of annoying characters but maybe that's deliberately done because they'll be dead before the credits roll. Unfortunately, it's not and the rest of the fairly unknown cast is mediocre at best. We have an aged Ally Walker (Universal Soldier, When the Bough Breaks) with too limited screen time, because she's the only convincing character. In the beginning of the movie when the blind girl is picked up by her father we have a shot from the front were his jacket is open. In the next frame from the side, his jacket is mysteriously closed. This contingency error is repeated not twice, but four times.. It's also hard to swallow the fact that the blind girl seems to know her way around the house perfectly when we've been told they only live there for 2 months. <br><br>The biggest problem however is that the writers or director didn't know what to do with the story. We have vague flashbacks of the car accident which ended the life of the mother. Than we have our usual suspects like the Ally Walker character, the boyfriend or the father. But he turns up in the closet at the end, bounded by the killer (\"Scream\" anyone ?). This all had to have something to do with the identity and the motivation of the killer(s). Since none of the makers could possibly find an explanation, it's simply revealed by one of the killers that they did it because \"it's Mischief Night\". The body count isn't impressive and the special effects are very limited to gunshot wounds and a knife in the throat. (the highlight, but ruined by the fact that the blood comes from the elevated hand of the killer instead of the actual throat of the victim. <br><br>Is there any good news here ? The masks are scary, certainly in combination with the yellow raincoat. Too bad the killers aren't, particularly when one of the follows the blind girl instead of just killing her. <br><br>Can't recommend it. Watch the excellent \"You're Next\" instead. I have already seen that one three times in the last year. \"Mischief Night\" is certainly not worth another look - ever.","user":"homecoming8","rank":[4,4]},{"title":"A Very Weak Endeavor at Being Scary With a Painfully Derivative Script","rating":4,"date":"6 November 2013","review":"Reviewed by: Dare Devil Kid (DDK) Rating: 1.5/5 stars<br><br>A mediocre, run-of-the-mill horror film, with a done-to-death plot, flimsy back-story, and completely derivative scare elements, which we can now conjure up ourselves even in a state of slumber.<br><br>This weak endeavor at chilling our senses might have encountered some moderate success 10 to 15 years ago, but now with the gargantuan influx of myriad horror films that have flooded our cinema halls and DVD shelves, such a derivative film must at least be treated uniquely and the characters need to be given some depth to make it enjoyable for the viewers.","user":"DareDevilKid","rank":[14,22]},{"title":"It's just a plain Burger","rating":5,"date":"17 July 2017","review":"A-Z Horror Movie of the Day...\"Mischief Night\" (NR - 2013 - US)<br><br>Sub-Genre: Slasher/Home Invasion<br><br>My Score: 4.9<br><br>Cast=4 Acting=6 Plot=5 Ending=6 Story=3 Scare=5 Jump=6 F/X=4 Blood=4 Invasion=6<br><br>Young Emily Walton, who has suffered from psychosomatic blindness ever since the car accident that took her mother's life, must summon every instinct at her disposal to protect herself and her loved ones from a mysterious intruder. <br><br>This was not without it's merit...there were a couple good jumps and it made for a decent home invasion thriller. Unfortunately, the story, F/X, and blood lacked in every part of the film. The plot was good, but been done before. It's like reading a menu and seeing \"chopped sirloin sandwich\" and you bite into it and realize that it's just a plain burger. Don't go searching for this one...but you could do a lot worse.","user":"lojitsu","rank":[2,2]}]