[{"title":"It's an outrage that I'm the first to review this","rating":7,"date":"12 May 2016","review":"I'm really quite shocked that no one besides myself has taken the trouble to spend a few minutes ranting about this wonderfully dark and weird comedy. If you are reading this review then I highly recommend you track down and watch this gem.<br><br>This film was on television a couple of days ago and being a German film about a bunker I had foregone the conclusion that this would certainly be something to do with the war- not even close. I was further enticed by the mention in the description of perversity because it was late at night and I'm a guy that had no plans that particular evening.<br><br>All that aside, there was no perversity. There were one or two comical sexual scenes but this film is a brilliantly awkward comedy based around the strange characters that make up this secluded family, the student who comes to stay with them and the mysterious \"Heinrich\", who I shall offer no further description of lest it somehow depreciate his mystery.<br><br>I cannot claim to have seem many funny German films, I'm sure they must exist but I can't think of any other ones that have made it as far as for me to find on English television. Usually anything in German on English television will in some way reference the war, something that this doesn't. So in that context it's special.<br><br>I almost missed this film, but I was unable to find it to download anywhere so stayed up and watched it and am very thankful I did. I'm not sure why it isn't more widely known because it's really great and stayed with me for quite some time. I think I saw it about a week or two ago and it keeps popping back into my mind. Anyway, enjoy it if you can find it.","user":"alex_van_beek","rank":[26,30]},{"title":"A freak show, but an entertaining one","rating":6,"date":"27 September 2016","review":"\"Der Bunker\" or \"The Bunker\" is a German movie from 2015. The writer and director is Greek-German filmmaker Nikias Chryssos and I am kinda surprised how much awards attention his work here received. This film does not strike me as something that awards bodies may appreciate, but I am clearly wrong. Of course, the likes of the German Film Awards did not honor it, but it scored awards all over the planet, even in Mexico for example. And I am positively surprised by that as these 85 minutes were a pretty interesting watch, and certainly quite entertaining. You cannot categorize this film easily at all. It is a touch of drama, a touch of coming-of-age, a touch of comedy, a touch of thriller, a touch of horror and probably more. This is the story of a student who starts working as a teacher for a boy who lives in a bunker with his parents. These four are also all the cast members in here. All the action takes place in the bunker and only very rarely you see a shot of the snowed-in outside of the bunker. Civilization has clearly forgotten about them. The fact that this boy is played by an actor who is actually the second-oldest cast member here says a lot about the absurdity of the film. But it does so in a good way as it also helps in showing us how the movie never takes itself seriously. It is difficult to say whether the character is also intended to be around the age of 30 despite being the \"son\". There is one occasions when the teacher says he looks much older than 8 years, so maybe yes. But it's not important either. I believe the story here could have easily turned this film into a huge piece of ridiculous garbage, but the actors and the filmmaker are so good that it is actually working. This is not only thanks to Chryssos, but especially thanks to actor Daniel Fripan, who plays the boy, (admittedly the Angela Merkel haircut is helping too, and Oona von Maydell, who was absolutely brilliant in depicting the characters insanity apparently caused by an evil wound on her leg that makes her somewhat possessed. (And man was she hot. Absolute fetish material her character here.) Of course, Bukowski and Scheller were good too, they just did not have as much to work with as the other two, even if the former is probably playing the central character. The ending made me think of \"One Flew Over the Cuckoo's Nest\" a bit with the way things turned out. Not sure if that was intended by the filmmaker, but it reminded me a lot of that. There was nothing in this film I really disliked apart from a couple moments here and there. For example, I did not like that the teacher also started sucking on the mother's breasts on one occasion. The only explanation I had for this scene was probably that it had to do with the evil spirit inside her. And the last shot with the student doing the work in the house for the parents was also a bit strange I think. It came out of nowhere and honestly, I expected the student to die after he was stabbed. But all in all, these minor flaws in here should not distract you from how good and atmospheric a film this was. It is closer to a ****/***** than to a **/*****. I certainly recommend the watch to everybody who likes subtle horror (and who despises splatter and gore) as much as I do. See it now!","user":"Horst_In_Translation","rank":[8,9]},{"title":"Very good but you need to like weird movies","rating":8,"date":"15 May 2016","review":"In German but the subtitles are excellent and once you get into the movie you hardly notice that you are reading them. It is dark humour so don't expect to laugh, just enjoy the weird plot and characters. The twist of a minimal Science Fiction core just makes it all the more intriguing. At the end, I just wanted to see a follow up and prequel to this as all of the characters had so much more to be explored character wise.Thoroughly recommended if you like foreign off the wall movies (old-boy, lady vengeance etc). The opening scene just hooks you in, things are not going to end well for the guest. The introduction of a previous an alien encounter by the wife / landlady just intrigues but does not in anyway dominate the plot. Watch and enjoy.","user":"jimferguson-45007","rank":[13,17]}]