[{"title":"Mike and Dave need a better movie.","rating":3,"date":"3 August 2016","review":"'Mike and Dave Need Wedding Dates' had some promise when the trailers first came out. I honestly believed this film would capture the tone of the first 'Hangover' movie, but something went wrong early on.<br><br>1. I know this film was based on true events, and I guarantee the true events would have been far more entertaining than the ones depicted in this film. For he most part, the movie has a strong opening where we see how these two brothers party, but we also witness the aftermath of their wild antics. Things move well enough till we get to the point where they actually end up on Hawaii. At this point, things take a tumble off a cliff.<br><br>2. Mike and Dave and played by Adam Devine and Zac Efron respectively. These two make an okay pair as brothers, but Adam Devine (especially) pushes the limit. Aubrey Plaza and Anna Kendrick are probably the worst additions to the cast, cause they are terribly unfunny. You would assume both Devine and Plaza would bring a certain level of comedy and timing, but they unfortunately don't and the jokes are misplaced.<br><br>3. I'm not saying the movie is completely unfunny, but the most you get are a few chuckles here and there. Efron and Kendrick are better actors to star in a film like this, frankly this is below their standards. This should have been a direct to TV or DVD movie which featured some unknown/up-and-coming actors instead of bigger names filling the void. The side characters are annoying as f#%k, which in turn lowers the bar on the comedy.<br><br>The movie fails to redeem itself and it's only passable as maybe a rental. No one should waste their time and especially money on going to the cinema to watch this.","user":"bodhi-13262","rank":[72,105]},{"title":"mike and dave need a better script","rating":1,"date":"14 July 2016","review":"two adult brothers with the personalities of thirteen year old's must find dates for their sisters wedding; what we get is tiresome repetitive try - to - hard forced jokes that land flat. The dates are annoying as hell, acting like female rap stars especially with their speak. I had high hopes for this and as ALWAYS the trailer is misleading. I laughed maybe three times and I cried once when I opened my wallet, twenty bucks to take a nap. Well, it's cheaper than getting a hotel. This was perhaps the longest film I've ever slept through. I don't need to see hairy bush, this isn't 1977. The last twenty minutes is soap opera drama and I tapped out, walked away and ripped my movie ticket. I need a refund.","user":"drdeathforpresident","rank":[36,50]},{"title":"Unbelievable","rating":2,"date":"17 July 2016","review":"What happens when we take some of the strongest young talent around, mix it with a script that has limited use of some of the most recognized words in the English language, manages to avoid an NC 17 by some miracle and asks the audience to leave their brains outside? You get this offensive, tasteless, and mentally impaired movie.<br><br>Loosely inspired by various comedies we have seen before but without any redeeming quality or grace, we witness a family that hasn't somehow killed any of its members, treat each other with the utmost disrespect and seems only concerned with coming up with the next opportunity to use foul language supposedly to keep the audience believing something funny is happening. I'm not against hearing a colorful word, but it's like using spices in the right amount, and pretty soon we're burned and bored.<br><br>Here's a movie that makes the younger generation look pretty useless and dumb, Hawaii becomes a rather plain scenario because all of its charms disappear as we are confronted with every possible display of vulgarity and ignorance. There's not a single clever, cute, or funny moment. Well, maybe the reconciliation of one of the couples is a fresh moment of fresh air but that can't overcome the prevalent stench.<br><br>There are issues with the proper use of language, too. As far as I know there was a man in the massage scene, but people kept using the feminine term. If that slipped by, I wonder if it was just intentional or just another instance of the effort to come up with anything memorable. All through the movie I was waiting to for a surprise since Zach and Anna were there, or maybe some of the inspiration would follow one of the leads from his hit TV show. An absolute waste of time, money, and talent. Stay away.","user":"aharmas","rank":[32,46]}]