[{"title":"Pretty good until the last 10 minutes.","rating":6,"date":"20 October 2019","review":"I don't want to spoil anything so I won't go into detail, but this film was going along pretty well, with enough mystery, drama, character development, redemption, acceptance, relationship, family, love, etc, etc....very interesting concept and held my attention throughout trying to figure things out and what exactly happened. There were a few ways this could go and the film maker did a good job to showcase those avenues to keep things interesting and mysterious and leave plenty of room for a twist and surprise ending. Well the surprise was they basically ruined it all in the last 10 minutes using that old time tested and overused method of suspense, which frankly bugs the heck out of me, which is having characters make implausible decisions and do things that no normal, rational or even irrational person would do. The decisions and actions made by several characters in the ending scenes were just so implausible that I docked 1 star, being generous too. So this gets just a 6, watchable, but I believe it could have garnered 7, a fair movie, easily with just a little better writing when they wrapped things up.","user":"safsurfer","rank":[16,18]},{"title":"An enjoyable noir-thriller about grief, belief and the things we keep hidden","rating":8,"date":"7 September 2019","review":"This is newbie director Rowan Athale's second full length feature film (plus one short), and aside from a few technical errors and editing issues, he pretty much nailed it behind the camera and in directing his cast.<br><br>The film is an adaptation of the novel (I haven't read it) of the same name by John Searles, turned into a screenplay by novice writer Eric Garcia. The pacing started out decent, then slowed down midway, and felt dragged out towards the end, that the 96 min run-time felt longer. I wasn't a fan of the non-climatic stretch of cross-cutting time lines, and I felt the story would've been better told in the proper order.<br><br>Casting was excellent and all actors were convincing in their roles, especially Margaret Qualley, who was outstanding in her starring role.<br><br>The cinematography was on point, and the score perfect for this type of film.<br><br>For a low-budget B-grade film by unseasoned filmmakers, this was a surprisingly enjoyable noir-thriller about grief, belief and the things we keep hidden.<br><br>It's a recommended watch and a well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[38,56]},{"title":"Different thriller and scary in parts","rating":7,"date":"8 September 2019","review":"This isn't a typical thriller. The cast is quite good even supporting cast so that should indicate that it's not a second rate show. It's different. Starts off like a psychological thriller. Then things become more crime drama with an unexpected villain. The conclusion is unexpected but at least doesn't leave you hanging totally.<br><br>Margaret Qualley is getting lots of good roles and she is quite watchable. Amy Ryan plays the bitter Mother and divorcee quite well.<br><br>Worth a watch.","user":"phd_travel","rank":[22,32]}]