[{"title":"Had to turn it off","rating":2,"date":"24 March 2014","review":"Iliza had some good jokes but she ruined them with that super annoying horrible dolphin/goat sound she made constantly. It might have been kinda sorta funny once or twice, but it was done TO. DEATH...and then some. I tried really hard to put up with it to hear the material that I actually liked, hoping that for the love of god she would please stop making that terrible terrible sound soon, but it increased in both frequency and irritation. It made me cringe every time I heard it, so I gave up with about 15 minutes left. I couldn't handle anymore. It was just the worst sound I have ever heard. I couldn't take anymore. At a certain point the awfulness of the sound outweighed whatever humour the material had.","user":"JayDee420","rank":[20,37]},{"title":"PLEEEEEAAAASE!!! Do MOOOOOORE goat noises!!!","rating":1,"date":"17 February 2015","review":"Iliza is awful and her routine is just plain ANNOYING. she constantly does this annoying goat noise that is both misplaced and ubiquitous. It's literally like she randomly breaks into an impression of Jim Breuer's Goat Boy impression from SNL. Except it's for an hour straight. For the most part they don't tie into her \"jokes\", but they are obnoxiously EVERYWHERE. There are a few other annoying voices/accents that she does, which she is not good at, and only take away from her \"jokes\". They include a surfer-type guy, a death-metal-sounding guy, an airhead girl, and a tiny elfish-sounding thing. All rival Jim Carey's EEEHEEHHHHHHH noise in Dumb and Dumber. <br><br>But just in general, the worst is that SHE IS NOT FUNNY. There's no way a professional comedian wrote them, and again, she adds the voices/accents/goat noises to spice them up. Total fail, I don't know why she is the slightest bit famous. Obviously people out there like her, or she wouldn't be. But I just can't stand her. The only thing I will say positive about her is that she has good energy on stage. Oh, and lastly, her total lack of talent takes away from the fact that she is a very good looking woman, and that's very easily overlooked, when you're cringing because of those GODD**N GOAT NOISES!!! This is a total PASS!!!!","user":"Drew0062","rank":[22,43]},{"title":"Animal noises","rating":1,"date":"16 July 2018","review":"She does these incredibly annoying animal noises for the whole show and the jokes aren't funny. I would have been very dissatisfied if I had paid to see this show.","user":"emeraldgoddess","rank":[10,17]}]