[{"title":"This months football hooligan based crime movie....","rating":6,"date":"16 October 2014","review":"Following the death of Katie in part 2, by some bad geezers who swear a lot, her boyfriend and his mate Eddie travel to kill the bad guy. But just like any stupid villain should know, there is a bit of spiel from the boyfriend, instead of him just doing what he came to do.<br><br>So he ends up getting killed and Eddie gets pinched....<br><br>back home, Eddie attends the funeral, where he is the only one there, but there is a shady character in the background.<br><br>To cut a long story short, it's the boyfriends brother, he wants revenge, so he and Eddie go to Rio to exact revenge, but wouldn't you know it, there is the small matter of the world cup going on too.....<br><br>It's meat and potatoes stuff this film, it's nothing any different from any other Brit crime based movie that has been released every single month in the UK since Dyer made The Football factory.<br><br>But, if you enjoyed the previous two instalments, it begs to be watched, because it ties everything up, in big fat stupid knot.<br><br>The acting is beyond poor, the brother is dreadful, and makes one wonder where he came from, but he was in a Nick Love film, but he doesn't have any life or emotion in his eyes, so when he is angry, you cannot help but just stare at his eyes to see the deadness. Much like Ghostriders penance stare.<br><br>But it's not awful, the one liners are laughably bad, and if you like these sort of film, you could do a lot, lot worse.<br><br>Just rent any film with the word Essex in the title","user":"FlashCallahan","rank":[5,7]},{"title":"Less than stellar","rating":2,"date":"6 December 2018","review":"Another mindless entry in the unwanted and needless WHITE COLLAR HOOLIGAN series; I had the misfortune to watch this under the title MEET THE FIRM: REVENGE IN RIO. It's another slow burning, revenge-fuelled character drama in which a couple of moronic thugs go after a crime boss who had one of their brothers murdered. Simon Phillips, that charisma-free talent of numerous straight-to-video titles, bags most of the screen time here and seems to be trying to be funny, but the effect is less than stellar. The film is a mixed bag of crime staples, stupid dialogue, gratuitous sex scenes, grubby violence and random prison scenes. There's no reason to tune in.","user":"Leofwine_draca","rank":[1,1]},{"title":"I CAN'T TURN MY HEAD 365 DEGREES ALL THE TIME!","rating":8,"date":"22 April 2018","review":"This is also known as \"Meet the Firm. Revenge in Rio.\"<br><br>If you are like me, you forgot about the other films. There is no character build up for Eddie (Simon Phillips) but there really doesn't need to be as it develops nicely. There are flashbacks to the earlier films in the beginning, but it didn't really help me, and I have seen the films. It isn't until they mention the credit card scam, that I recalled the movies, which really wasn't necessary to enjoy this feature. Phew!<br><br>Eddie helps Mike avenge the killing of his wife by going against Russian mobster Dimitri (Akbar Kurtha). Not to give too much away, but Mike dies in the first scene. Damien (Josh Myers) who claims to be a friend of Mike's wants Eddie to tell him who was Mike's killer. Eddie balks at the idea, but then the title \"Revenge in Rio\" kinda lets you know what happens...like naming a book \"Return of the King.\"<br><br>Be that as it may, Simon Phillips plays a great Eddie, reminding me of a British Paul Giamatti. The film is best described as an entertaining light crime drama.<br><br>Parental Guide: F-bomb, sex, nudity (Sephora Venites)","user":"nogodnomasters","rank":[1,1]}]