[{"title":"Hungarian philosophy","rating":9,"date":"13 August 2015","review":"So now I have read some of the reviews of White God here, and I felt like I needed to contribute with a different perspective on some of the things that are being said. I usually do not write reviews so bear with me. <br><br>First and foremost, when going in to watch this movie one has to be prepared for it to be a genre movie - One that features dogs in a way that could make the movie dull if you're not an animal-kind of person, the other thing to bear in mind is that the movie is not meant to be realistic (though it may seem like it in the first half of it) - It is rather more of a \"revenge fantasy\". <br><br>Second: Multiple reviews criticizes the fact that the streets we see the dogs run through are empty: Why does everyone in this fantasy-Hungarian universe hate dogs? Well they don't. And I think people are forgetting that the dogs had already killed human beings when they escaped the dog pound (where they were held awaiting euthanasia because they had been declared: Dangerous to people) - So in the news they warn about the dogs and people are told to stay indoors because these dogs are killers and because there are a couple of hundreds of them and anyone who knows dogs also knows that dogs sometimes become even more dangerous when they are a big group together: Its called pack- mentality. <br><br>I really think the critic on this point misses the mark completely, no one in the movie is represented as hateful or evil (except the abusers of Hagen - which is the main dogs name, and not Max, which is a name the abusers give him). An example of this is the 13 year old main characters father: In the first scene we meet him on his job: He works as a meat inspector on a meatpacking plant and this scene is maybe one of the most powerful in the movie. We see the cold, sterile room and a cow carcass being cut open in all its gory - Shortly thereafter we see the father outside the building and then the scene closes with a man walking two cows into the butchery - Its very powerful: Life and death: What is a life? What is a cows life? To the father animals are food - They are resources. When the father realizes that the daughter is bringing a dog to live with him he is still in a kind of platonic cave - pre-enlightened and even though we as viewers (and animal lovers) are deeply frustrated with his treatment of Hagen, a lot of us also recognizes this type of attitude towards dogs (and other animals alike) or at least aspects of it. But the point here is that the father eventually evolves: Or you could say that the daughter takes up, what in Plato's story is the role of the philosopher: the job of freeing her father from the shackles of the cave and she does so by the way of love: Another powerful message: Not only is love the only thing that conquers all - but the father is testament to the human beings ability to get enlightened - to have empathy and to grow. <br><br>This was what struck me the deepest: That it would have been so easy to fall down into the clichés of bad people and good people - But the movies message is opposite: In the end we have the power to look a creature in the eyes and feel something - To understand that they have value besides being resources for human consumption or clothing. <br><br>The last thing I want to point out as a main point of the movie, is the theme of loneliness. The main character (the girl) is a teenager - She is clearly estranged from her father - The mother has left, it seems like she has no real friends and the one boy that she likes, likes someone else. One of the other reviews here mentions that the scene in the club was way to long and didn't have a point: I tend to disagree. I think the point was to show the post- modern paradox of a club filled with people - with alcohol and drugs - A place where people go to go out with others and still it can be a place where loneliness is felt more deeply than almost anywhere else - Just like the girl feels in this movie. She is surrounded by young people: And she is SO alone - The same loneliness fills her life even when she is together with her father: There is a space in the human heart where no other person can go. And here is another strong message of the movie: The relation between human-dog is such that you can be still together - that a look is enough to understand and feel understood, that there is some kind of armor that we wear when we are with other people, that simply falls away when we are with other living creatures.","user":"miav3","rank":[52,60]},{"title":"A proper Hungarian movie","rating":9,"date":"15 July 2014","review":"I have never left a review on any movie before, but I was surprised by the bad reviews, so I decided to write my own one. <br><br>First of all, people were complaining about the 'bad acting', which was actually not horrible in my opinion, and it was the only dark spot of the film. Yes, I did not like the acting of the director, because of the accent he chose, but the others were quite good. The little girl, who played 'Lili', was annoying in the first 5 minutes, but when the story got more intense, how she acted was so real, actually so Hungarian.<br><br>I've never watched the trailers, and I am so happy I haven't. I did not know what to expect, so I got a shock in every 10 minutes. I felt sorry for the dogs, and actually cared about every character. Very exciting.<br><br>The ending is perfect, no more or less than needed. I loved it.<br><br>My advice would be: DO NOT WATCH THE TRAILERS, GET SURPRISED !","user":"arielistic","rank":[87,121]},{"title":"White God is a technically and emotionally marvelous film","rating":9,"date":"23 January 2015","review":"White God 9/10 - This is a wonderful movie that plays as a parable about separatism and Hungarian politics during democratic rule. On the surface however lays an entertaining revenge flick against animal cruelty and a drama about the love of an animal towards it's human \"the White God\". The director uses a mish mash of genre's to keep the audience on it's toes, while paying homage to everything from Fuller's White Dog, to Hitchcock's Birds. The best part of the film was that they hired hundreds of shelter dogs and spent months training them, and after the film, the director and crew worked hard to get every dog adopted! These dogs are some of the best actors I have ever seen. This is a marvelous yet challenging film.","user":"willden21","rank":[65,89]}]