[{"title":"Complete let down","rating":1,"date":"10 September 2015","review":"This movie is terrible. I've read the book and this is not a representation of it. This movie is a let down on every front. The story line is scabbed together. The cinematography is terrible. Acting is less than second rate. Cohesion sucks. There is less climax in this movie than there is in a retirement home. What's with the music in the movie? Every transition scene has this grandiose symphony playing, making it seem like there is a plot point or twist coming up. <br><br>I suffered through this junk because I had a fast forward button. Which is sad since I thought the first movie in this series was pretty well done. Then the second movie sucked. The third movie (this one) was so exponentially terrible compared to the first two that scientists are still trying to come up with a logarithmic formula to accurately represent the decaying quality from the first to third movies.<br><br>Watch the first movie and accept that it never goes anywhere. Don't watch this.","user":"profff-01020","rank":[36,49]},{"title":"why am i doing this to myself?","rating":2,"date":"15 November 2015","review":"When i thought that Part II was worse than Part I, Part III went one step further. With another change in the cast, it's been difficult again to follow what's been going on.<br><br>With the ideas of Ayn Rand diluted in sub-par writing and below average acting, Atlas Shrugged: Who Is John Galt? became a perfect background for an afternoon nap. No pun intended.<br><br>Once again, i'm not sure why the producers insisted on making three movies instead of opting for a TV show. Nowadays this seems to be a gateway to a broader audience. Besides, the book Atlas Shrugged had enough contents and ideas for eight to ten one-hour episodes.","user":"dragokin","rank":[24,32]},{"title":"It gets worse","rating":2,"date":"4 August 2015","review":"It's the curiosity more than anything. I've already seen the first two \"Atlas Shrugged\" movies; can't really leave the trilogy unfinished, right? This is what drove me to finish an unsatisfactory series of movies. And the final entry finishes things off in the worst possible fashion.<br><br>I'm not even concerned with Ayn Rand's philosophy, only with Part III's complete mishandling of it. This is a cartoon with robotic performances, non-existent production values and haphazard direction. The dialogue's stilted, none of these TV actors have any breathing room, and the story rolls out in a hurried low-standards manner. It's so cheap and so cut-rate that any message (even one delivered with a smug sledgehammer) is smothered in the execution. At a certain point, it just becomes unintentionally funny. Just not funny enough to be entertaining.<br><br>Is this at all like the book? I have no idea, but once was more than enough with this movie. What a sad end.","user":"Mr-Fusion","rank":[20,27]}]