[{"title":"For the inquisitive minded","rating":10,"date":"21 October 2014","review":"For the inquisitive minds about the inherent flaws in our current monetary system and how money works in general, this simplified overview of Bitcoin is truly refreshing. Many complex issues about the protocol is explained in laymen terms to enable any family member to appreciate the invention for what it accomplishes. The internet of money has been spawn and naysayers would one day regret not having explored this invention beyond first misconceptions. This documentary provides a great intro into the early adopters' lives and why the community is blossoming in a time when the rest of the world is sinking deeper into depression and debt. It invites one to look beyond mainstream misrepresentations and that it is only a black market currency. Great documentary indeed. Would recommend it to any friend.","user":"dawiepoolman","rank":[85,112]},{"title":"I watched and totally enjoyed it.","rating":8,"date":"21 October 2014","review":"I watched and totally enjoyed it. It is quite easy to watch and almost completely non technical which is good for the non-bit-coiners. It covers basically all the highs and lows of bit-coin from almost day one and right up to the fall of the biggest exchange . <br><br>There is no hiding of all the problems bit-coin had and faces in the future but at the same time it is very optimistically told (of course).<br><br>Even if you are not interested in investing in this- it is good to know what it is all about- and this movie can introduce the subject in an interesting way .<br><br>It would be interesting to hear an opinion of someone who basically doesn't know anything about bit-coin - whom I think should really be the people to watch this.","user":"ari-saltiel","rank":[67,92]},{"title":"This documentary shows both sides of Bitcoin for everyone's benefit","rating":9,"date":"21 October 2014","review":"Bitcoin is indeed in an accelerated stage of its existence. While a few trolls here have chosen to label the first-ever grassroots bootstrapped financial system as \"tulips\" and a \"ponzi scheme\", this documentary shows quite the opposite.<br><br>It begins with a typical Bitcoin participant, an average man with a wife and kids, as he explains his gradual involvement in Bitcoin, and his hopes for the future. It also shows pivotal individuals that have been involved with Bitcoin in some way, without glossing over rough spots in Bitcoin's history.<br><br>The takeaway here is Bitcoin is a system that is being built, for normal people, so they can take control of their own financial future. Unlike the legacy system, there aren't onerous controls and rules, its up to you to determine your level of engagement.<br><br>Seeing someone pay someone on the other side of the globe, without having to worry about banking hours, wire fees, or any of the other associated nonsense is what really hit home for me.<br><br>This documentary is about people working with Bitcoin, and the positive influence it will have on our collective futures, and is well worth the viewing.","user":"tradertimm","rank":[47,65]}]