[{"title":"Just Dumb, Not Funny","rating":1,"date":"24 April 2014","review":"I have not seen the first \"A Haunted House\" film, but after sitting through this dreadful sequel I don't think I would like to. Why this trashy unpleasant film was released on Easter weekend is beyond me.<br><br>There is no coherent story. Upon getting over an ex-girlfriend who got possessed by evil spirits, Malcolm hooks up and moves in with a new girl Megan and her two kids. What follows is an embarrassing mishmash of scenes from recent big hits in the horror genre, \"Sinister\", \"Insidious\" and \"The Conjuring,\" as Malcolm continues to be terrorized by demonic events. <br><br>Marlon Wayans plays Malcolm in the most irritating and annoying manner, with his non-stop loud screaming and nonsensical ranting. He has a prolonged, uncomfortable and unfunny sex sequence where Marlon gets it on with a doll that looks like the diabolical Annabelle from \"The Conjuring\". More awful jokes of such sick sexual nature would recur through the rest of the film.<br><br>You go into a spoof film like this to have a shallow laugh out of jokes inspired by your favorite horror films. However, within the first few minutes, you already get the feeling that this film will not entertain you at all. In fact, it could even be quite boring, with very long humorless scenes that overstay their welcome. There are many scenes which would offend pet lovers, Catholics, Mexicans, women, and practically everyone else. <br><br>I found it interesting only when it tries to recreate a recognizable scene from those modern horror classics, like the group hanging from \"Sinister\" or the \"Hide and Clap\" game from \"The Conjuring\". But unfortunately, I wind up disappointed because its spoofing just falls terribly flat. I would have had a good time if a film was dumb and funny, but this film is just plain dumb, not funny. 1/10.","user":"3xHCCH","rank":[44,78]},{"title":"Best Marlon Wayans movie yet had me Laughing for Days later Every Time I would think of it","rating":9,"date":"5 December 2017","review":"I have not been usually a fan of Marlon Wayans in movies. I loved his brother Damon and loved the family in sketch comedy in In Livin Color. But in Scary Movie I thought he over played his parts. So much that it wasn't funny. And White Chicks was only funny because of Terry Crews. In face the only Scary Movie I liked was the \"Grab my Little Hand\" one and the one with the Spoof genius Charley Sheen who dominated Hot Shots and Part Deux in a way that would make Monty Python or Mel Brooks proud. A Haunted House 1 fell short as well although some parts made me snicker. A HH2 though was pure genius. I can see a lot of people not getting the humor but I'm pretty sure anyone my age understood it perfectly. Us 90's kids grew up hearing these type laughs. From them moving in all the way to the Warrans I laughed and laughed out loud non-stop. I am definitely buying this and watching it until I wear it out and the humor isn't funny anymore. Give it a shot and don't worry about the plot. Just listen to Marlons take on women problems, and how he handles or should I say can't handle the paranormal. All stereotypes are touched just as the Great Dave Chappelle. Actually that is a perfect reference. If you liked the Dave Chapelle show and laughed hard at that, you'll love this. If not, then go watch CSI or How to Lose A Guy In 10 Days. You will be better off","user":"jtheswit225","rank":[5,6]},{"title":"Really, really bad..","rating":1,"date":"23 July 2014","review":"A Haunted House 2 is an American 'comedy' 'horror' film directed by Michael Tiddes and starring Marlon Wayans. The film is the sequel to the 2013 film A Haunted House. Having exorcised the demons of his ex, Malcolm is beginning fresh with his new partner and her two children. After moving into their dream home, however, Malcolm (Marlon Wayans) is once again plagued by strange supernatural events. <br><br>From the opening sequence, right up until the closing credits, the film is a complete calamity. The film's screenplay is aimless, stupid and staggeringly unfunny – not a single gag throughout the entire film resonates with audiences. This, taken in combination with pointlessly constructed racist stereotypes and unbelievably dull horror clichés, means that sitting through the films short runtime of eighty six minutes becomes almost impossible. <br><br>Wayans's performance is excruciatingly painful to watch. Malcolm is an astoundingly unlikable lead protagonist – and in all the wrong ways. On no occasion do his bizarre actions and ear-splitting shrieking ever seem necessary, and his lack of any sort of morality or even awareness of the reality that surrounds him results audiences hastily attempting to distance themselves as much as possible from a character that presumably is meant to be engaging and amusing. <br><br>The film manages to surpass the stale mediocrity of its predecessor. It's a tortuous waste of time which could have been better spent doing almost anything else. The film's only asset is that it's almost instantly forgettable. As the credits roll, the sensation of a deep exhale of breath and thinking, \"I never have to watch A Haunted House 2 again\", is certainly something to savour. The film is an unmistakable catastrophe.","user":"JoshuaHarryMurphy","rank":[33,60]}]