[{"title":"Nothing special, but great monster makeup and a suspenseful finale saves this movie.","rating":7,"date":"18 February 2014","review":"I have to say, after reading some reviews I wasn't expecting much, but I was pleasantly surprised. It wasn't great, for sure, it took from pretty much every backwoods horror/Blair Witch Project type movie, but at the end of the day, I really like those kind of movies.<br><br>I was most impressed by the monster. The makeup was actually quite spectacular and creepy, it looked great. There were only a few jump scares but they weren't cheap, there were genuine jump scares without that annoying loud \"bwong\" sound. (You know what I'm talking about.)<br><br>It starts out kinda shaky, the beginning of the film builds and loses atmosphere and it feels kind of awkward, the acting isn't anything special; but the last 40 minutes were great. The ending was kind of darkly comedic and a little goofy, but it tied everything up very well without just coming out and explaining the movie.<br><br>Overall nothing new or innovative, just another entry in the ever growing library of found footage movies, but entertaining at the very least.","user":"CameronCashman","rank":[9,12]},{"title":"Vampire found footage","rating":7,"date":"27 January 2014","review":"In the town of Black Water, WA, four women have been killed in the woods within the last forty years. Documentarian Danielle decides to make of movie about the events and brings a production crew of three to the town to investigate.<br><br>The women had been found mutilated and with bite marks. No blood was found at the crime scenes. A man is on death row for the murders and Danielle doesn't believe he is guilty.<br><br>They interview the convicted man, who seems crazy, and writes a symbol on the partition glass in blood, but doesn't give them much by the way of answers.<br><br>Next they go on a hike in the snowy woods to visit the crime scenes and gather what information they can. This is where the real action starts. The movie gets pretty interesting here as they are stalked in the woods. <br><br>People will draw comparisons to The Blair Witch Project here, fairly, since it does follow the same formula. The one review I skimmed said that it was wrong to show the creature, that what you don't see is scarier, a la Blair Witch. This is not true of course. Depending on what movie you are making and what you intend for the audience, both ways can be very effective, and it works here.<br><br>I had a lot of fun with this movie, especially the last two scenes, which pay homage to two very popular horror movies. 7/10.","user":"victoryismineblast","rank":[16,26]},{"title":"Oh my God, Why?","rating":3,"date":"30 January 2014","review":"This is just terrible. There was a long drawn out beginning that amounted to a very poor middle and a pathetic end.<br><br>I get the concept of \"Found video tapes\" but feel that it was done and gone away with Blair Witch.<br><br>This film and story line would have suited a traditional filming method but the ending should have been given a lot more thought.<br><br>There is no originality with this film, which is a real shame because there are so many books out there that can provide the film makers with a truly terrifying story that could be portrayed on film. <br><br>The vampire him/itself was very much along the lines of the original Nosferatu, with no fangs to speak of, but actually the only highlight of the whole film.<br><br>Opinion is really a personal thing, and if you like this whole found tape thing, then you might enjoy it.<br><br>Me, I am going to stick with the proper way of filming and watch the \"jump out of your skin\" films.","user":"waynehackett6","rank":[11,20]}]