[{"title":"This Mulatto Loved this Film","rating":9,"date":"31 January 2015","review":"I was not surprised to read that this film was based on actual events. I am sure that these situations have played out numerous times when it comes to mulatto children. The one thing that did surprise me is that Kevin Costner felt so strongly about this film that he financed it himself (along with his wife). Being mulatto myself I was happy to see that a film that broached the subject was finally being made and it could not have come at a better time with all the racial issues of recent days. Mr. Costner recommended that you see this film with someone that does not look like you; and I agree. This film is about two grandparents that deeply love their granddaughter, Eloise (Jillian Estell). With the death of Elliot Anderson's (Kevin Costner) wife, Rowena Jeffers (Octavia Spencer) feels like she would be the better person to raise Eloise than Elliot and the battle ensues. Rick Reynolds (Bill Burr) is engaged to handle Elliot's case and Jeremiah Jeffers (Anthony Mackie) is representing Rowena. Both of these attorneys have their hands full because both Elliot and Rowena have issues of their own. The character that I enjoyed the most was Duvan Araga (Mpho Koako) who is the tutor hired by Elliot to help Eloise stay focused on her studies among other things. The theater was pretty packed and I think that everyone in the theater was enjoying the film. You can tell that it is a good movie when everyone else reacts the same way that you do to certain situations. This film has the potential to generate a lot of dialog which I think was the intent to begin with. I had never heard of writer/director Mike Binder, but I think that after this film, his name will be more recognizable in the future. What I got out of the film is that it is not Black OR White.. It is Black AND White. I think that the entire cast did an excellent job and I would highly recommend this film to everyone.","user":"cattjones","rank":[31,37]},{"title":"Race Done Well","rating":9,"date":"11 October 2014","review":"Racism as a plot line has become a very safe and simple one as of late. In the past any film that even approached race was a risk, anyone working on the film would have to be very gutsy to attempt it. However as of late racism has become kind of a cop out and has become a very safe option. This however it not true of Black and White.<br><br>As soon as the movie begin we are faced with tragedy, our main character (Played by Kevin Costner) has recently losed his wife and is forced to raise he bi-racial granddaughter all by himself. As you could imagine this is no simple task, especially when you have a drinking problem. Throughout the movie we see our protagonist struggling to raise his grand-daughter alone and struggling with his heavy drinking problem that he has. To make matters worse the grandmother on the other side of the family want custody of the child.<br><br>The depth this movie goes into is incredible. In the raging custody battle both sides attempt to bring up dirt on the other to prove that they are not suited to raise a child. With twist and turns and even a downright suspenseful finish Black and White tackles many things movies haven't done before. First and foremost out hero is called many times a racist and even brings up racist remarks from time to time. Many black stereotypes are brought into question and reviewed throughout the court trial. And without spoiling anything the end contains a both amazing and very controversial monologue (The highlight of the film in my opinion) <br><br>Amidst tragedy, family, fear, and prejudice Black and White is a film that needs to be seen. It is a movie that is able to throw all this sorrow at you but still leave you with a smile when you leave the theatre. A must see.","user":"Simonjoe","rank":[33,41]},{"title":"Phenomenal don't-miss-it film.","rating":10,"date":"9 November 2014","review":"IMPORTANT TO NOTE: the title is no longer \"Black and White\". In the film, it is now \"Black Or White\".<br><br>Wonderful script and beautifully acted film. It honestly tells the story showing the love, anger, hurt, tolerance and intolerance on both sides. A human drama that truthfully addresses issues of race and family issues with an interracial child in the middle. And FUNNY! Some great laugh-out-loud moments in the film. Terrific cast lead by Costner and Spencer but the two young actors playing Eloise and Duvan are flawless.<br><br>It is very rare for me to gush about a film. And I rarely ever post a review. But...do NOT miss this film. I'm afraid it may not get much of a push. This film will make it on word-of-mouth. So see it and spread the word.","user":"alwaysfuelingthefire","rank":[39,52]}]