[{"title":"Absolutely original, and very powerful","rating":10,"date":"13 December 2014","review":"We watch at least 4 or 5 movies every week, and I have to say that this is the best film I've seen in a long time. Brit Marling seems to choose her films very carefully, and I'm coming to suspect that anything she's involved in is going to be different, and very well done.<br><br>This film is inspiring - not just because of it's content, but because of the way it's made. Hollywood can NOT make films like this. They can do a lot of things, but they can't seem to write scenes, scenarios, and certainly not dialog like this. This feels like real life, and because of this, it really effects you and draws you in. You really get to know, understand and care about the characters, in a way that just doesn't seem to happen in 'Hollyweird' films.<br><br>I don't want to go into any detail about the film here. I just want to say that it is truly amazing, unpredictable, beautiful, powerful and worth your time.<br><br>IMPORTANT: Be sure not to turn it off as the credits roll - there's a great little additional scene at the very end, which ads another dimension to the way the story wraps up.<br><br>Truly excellence in film making. If there were more writer/directors like this, the world would be a better place. He makes us think and challenges us. Truly inspirational.<br><br>My highest recommendation.<br><br>Will Middle of NowHere, in some snowy, remote Canadian mountains","user":"michellamoss","rank":[316,433]},{"title":"Wonderful","rating":9,"date":"22 December 2014","review":"This is one of the best movies I've watched this year. Breath taking and such a beautiful story. The cast is wonderfully chosen and you keep having goosebumps all through the movie. Watched it twice in a row. Wonderful. Seeing the title being classified under sci-fi I was not expecting such a love story behind it. The feeling of insecurity throughout the movie and passion. The constant battle between science and religion shown in a beautiful way. The scenery is perfect well chosen locations. Michael Pitt did a wonderful job in showing a constant battle between his emotions and radical thinking. I love writing reviews but this movie left me into a dark abyss where I don't know what happens next.","user":"ivancitta","rank":[143,215]},{"title":"Good story idea, very poor character development/execution","rating":5,"date":"16 July 2014","review":"I wanted to like this movie, after enjoying the director's previous film \"Another Earth,\" but this one just seemed half-baked.<br><br>Major character flaws with the main character Ian who repeatedly states he only believes in the scientific process and in data, suddenly acting according to superstitious numerology following the number 11 to try and track down this girl he slept with once and now is actively stalking. Long story short, his stalking is not confronted by either his subject nor the people at his workplace who see it plainly, and the numerology aspect is dropped as soon as it's brought up.<br><br>Moving on, the women characters in the film are pretty one-dimensional, with Ian's first \"wife\"/stalking subject Sofi being a stereotypical foreign whimsical sex goddess who entreats him to believe in the supernatural because love or whatever, but her beliefs aren't ever explored or defined in the slightest, and he still goes through with \"marrying\" her even though they don't really see eye to eye at all. Pun intended.<br><br>The marriage, by the way, is ridiculous. They're both adults and show up at a city office to get married completely oblivious to how marriage works. So whimsical, so romantic! They then exchange rings anyway and proclaim themselves married. So whimsical, so romantic! Skipping a bad scene at the lab, his new \"wife\" dies the same day in an elevator accident. So whimsical, so disposable! <br><br>His second wife and lab assistant Karen seems to latch onto Ian as soon as Sofi dies, because clearly this stalker is marriage material (she even caught him creeping on Sofi earlier in the film, but rather than be repulsed by it oh whatever). Years later, his science book comes out based on what seems in the film to be mostly her work done while he was out stalking, but whatever, he becomes famous and she becomes pregnant because that's what she's there for I guess.<br><br>Oh, and forget about the Bechdel Test, I'm pretty sure this film fails that.<br><br>Moving on, the film's climax is when Karen, the scientific type, entreats him to go to India to track down/stalk this girl who might be the reincarnation of his first wife because they share the same eyes. Because that's what a rationally/scientifically minded wife would do. This after some other doctor runs a test on their son for autism but really she wasn't testing for autism but for reincarnation, because that's what doctors do in real life. Guess what though, this doctor is also promptly discarded in the plot even though you'd think maybe duder would have wanted to follow up with her on their shared hypothesis-slash-lunacy.<br><br>Weeks after Ian arrives in India, he finally finds the 7-year-old girl, brings her back to his hotel room unchallenged (because that's what you do with your plot when you're a lazy writer) and runs a test to see if she remembers her previous life as his \"wife.\" Are you rolling your eyes yet?<br><br>Well, surprise, she fails the test, and he feels foolish. Then they go to take the elevator back downstairs again and the girl breaks down crying and they hug and apparently that disproves science so The End! It's the feel-good disaster of the summer.<br><br>I actually liked the idea of science and religion being put to the test, but the execution of this film, its poor character development, and people doing what no real person would do make this just sort of fall apart. There's still some very nice feel-good moments that are pulled off successfully, but there's so much bad to overlook it's not really worth it.","user":"stephentheh","rank":[210,339]}]