[{"title":"What happens when a soundtrack and script work against each other.","rating":3,"date":"14 June 2016","review":"Firstly I have to give credit to the visual design and acting in this film. Despite some too- modern dialogue, and a dull overuse of static shots of people standing talking to each other, the characters look convincingly like they inhabit a darkened between-world-wars Europe lit by dim lights through heavy curtains. It feels like a realistic period piece without the Downton Abbey gloss. And the story itself should have been gripping, but - and I must add a SPOILER warning - unfortunately, due to the strident music telegraphing that this kid is bad news right from the start, the ending loses most of it's power. I'm sure some people will love the music, but a score should serve the story, not detract from it. Maybe the music was pumped up to stop people losing interest during the early parts of the film, which is quite slow and features way too many repetitive scenes of a grouchy child being reprimanded. But there are other ways to keep audiences awake, like working on the dialogue, camera angles, editing etc, rather than loud ominous music that tells the audience more than they should know about where the film is going. The exact nature of the ending still manages to be surprising, but it doesn't have much power, and instead of being frightening it was just a relief to not have to watch more scenes of the cranky kid. The music at the opening of the film will put you on edge more than anything else in the film!","user":"MatthewInSydney","rank":[44,59]},{"title":"Manipulative and Second-Rate","rating":2,"date":"17 July 2016","review":"The film begins with a musical score (by Scott Walker) which is too loud, manipulative, domineering, and pretentious. It takes itself very seriously indeed, but, when listened to closely, is second-rate.<br><br>The film imitates the music.<br><br>The story of Childhood of a Leader comprises scenes in the upbringing of Prescott, the rich, spoiled son of an influential American diplomat and his beautiful wife. The father is hammering out the details of what will become the Treaty of Versailles, which ended the First World War, and set the stage for the Second. Neither parent has much time for Prescott, and he is raised by servants, who can be dismissed on a whim.<br><br>Prescott eventually grows up to be (here's the spoiler): a fascist leader.<br><br>The takes and the scenes go on for far too long, leading to boredom. But the director and writer, Brady Corbet, isn't interested in making a good movie. He wants to deliver a message, even if he has to hit you on the head with it. He wants you to know that there is no free will; that your attitudes and place in society are determined by your class and upbringing; that any child raised under these circumstances would turn out this way.<br><br>What he fails to notice is that nearly all upper-class children in pre-WWI times were raised like this. Yet somehow they did not all end up leading fascist coups.<br><br>Childhood of a Leader's only redeeming feature is the acting. It is excellent throughout, especially Liam Cunningham as the father, who expects his orders to be obeyed and his son to be disciplined. Cunningham is completely believable playing this unattractive character.<br><br>We shouldn't blame director Corbet for making such a second-rate film. Given his class and his upbringing, it was inevitable.","user":"BNester","rank":[58,91]},{"title":"Tosh","rating":1,"date":"25 August 2016","review":"Pretentious tosh. The most disappointing film I have seen recently, having read the glowing reviews. How can I expand this succinct review to 10 lines? The music is bombastic, the length of the shots self-indulgent on the part of the editor/director, the psychology superficial: \"abused child grows up to be a bastard\". I have not read Sartre's original, but I doubt whether it was as vapid as this. Some of the supporting actors were good, but Liam Cunningham, in particular, looked very uncomfortable in his sketchy role. The Robert Pattinson character was particularly mystifying: who was he? What was he doing there? Why was the actor used to play the adult Prescott?","user":"chris_joubert-62765","rank":[33,50]}]