[{"title":"Happy, Uplifting, Feel Good Movie","rating":9,"date":"8 August 2014","review":"I did not expect such a talented cast of actors mostly in small parts. Jon Favearu has a lot of friends. The actor who played his son is a find. He was great. Low key, sweet and very natural and believable. The story is good. It is about the chef and then the food truck, but it really is about him and his son. I liked that he was friends with his ex wife, Sofia Vergara, who did a great job. That struck home for me, because my ex and I get along well and it brought a lump to my throat to see how happy that made their son. It is special when divorced parents can get along and do things with their kids. The story moved quickly and I loved how the son used twitter and they incorporated social media into the story. Very realistic. I highly recommend this movie. Really a joy to watch.","user":"jk-692-236394","rank":[226,296]},{"title":"Good food guide","rating":7,"date":"7 February 2015","review":"I'm no foodie but I really enjoyed this road-trip / father-son / buddy movie, written directed by and starring Jon Favreau, based on the recent life and times of a perfectionist chef who struggles to suppress his own innovation to the demands of his conservative paymaster boss. More than this, he gets involved in a spat with the town's number 1 food critic, sees his relationship with his son founder under pressure of work and still pines after his glamorous and super-rich ex-wife.<br><br>There's not much more to the story than that and I feared for all the anticipated parental-bonding scenes I would see the second I clapped eyes on his flop-haired 10 year old son but I was very pleasantly surprised to be engaged by this lighthearted, fast-moving, feel-good movie, right up to the predictable happy ending for all concerned.<br><br>With a busy but enjoyable soundtrack of soul and salsa in the background, nice realistic acting by all the leads right down to son Percy and of course lots of scrumptious shots of freshly made food, this movie certainly mixed its ingredients together well, delivering in the end a most palatable dish.<br><br>Perhaps the star-power cameos were a little unnecessary, maybe the father-son stuff did get a little hokey at times and the wraparound happy ending did seem somewhat forced but on the whole I found this a very watchable and occasionally funny movie which more than whetted my appetite for a decent Saturday night stay-in movie.","user":"Lejink","rank":[48,58]},{"title":"I loved it","rating":9,"date":"9 May 2015","review":"Jon Favreau is Chef Carl Casper working in a restaurant for a boss he doesn't see eye to eye with. He ends up leaving his job after he becomes fed up with the menu and receiving some bad criticism from a food critic. He exchanges insults with the food critic via Twitter and of course it goes viral and Carl's reputation is really on the line. He's also having some problems with his own personal life after he and his wife split and he is trying to build a relationship with his young son. The story follows Carl as he looks to get his career back on track and build stronger bonds with his loved ones.<br><br>The whole cast was very likable and easy to relate to, Carl and Tony had a very funny working relationship and are then joined by Carl's son, Percy when they get the food truck going. Then we have smaller roles for Scarlett Johansson, Robert Downey Jr., Dustin Hoffman and Sofia Vergara...some cast list that.<br><br>This is certainly a feel good film, I couldn't help but smile when watching. There was some lovely looking food on display and a great soundtrack to boot. Although it was mostly a comedy (and it was pretty hilarious in places) the film also had some heated arguments for dramatic effect, I felt this worked really well to show the viewer just what the characters are going through. Overall it was just a fun, unique film.<br><br>A really enjoyable film, heartwarming, feel good fun, one of the best films of 2014. 9/10.","user":"tr91","rank":[41,50]}]