[{"title":"Finally An Intriguing And Original Film","rating":29,"date":"29 July 2018","review":"It seems to me that Hollywood has been pushing out endless childish sequels with poor actors recently.<br><br>Red Sparrow is none of those things. It shows a topical issue, gives its viewers lots of action and heart pounding moments. The actors are impressively good and take chances and push boundaries. <br><br>I am impressed that films like this still exist.","user":"nby-83430","rank":[478,620]},{"title":"Could Have Used More Flaunting And Violence But This Is As Good As it Gets","rating":8,"date":"1 December 2018","review":"In Hollywood nowadays. I mean it is this or the umpteenth sequels and remake (is the fifteenth remake of Grinch and reboot of Star Trek out yet?).<br><br>Even Jennifer Lawrence has made a career of sequels and franchise films so to see this film makes one feel a little better about the improvement in this world. The director does a fine job here. The film begins with Soviet Russians' mercilessness and takes on a life of its own. The leads dispense with glamour and embrace the gritty without dramatic shadows and light, and the plot (about modern inhumanity) is without hyped up dramatics. This is a movie as down in the mouth as the world it represents, and it's all deliberate, and smart. I love how Lawrence deploys her beauty and allure and how the super powers launch into warfare depicting their immorality.<br><br>This is the stuff of a breakthrough movie. It isn't quite as gripping now, I think, but it still sucks you in. Although the cold war has restarted, hasn't it? There are many scenes in cars, including a speeding car scene and many good old street stuff. The plot and pace of things is more steady and exciting than anything else.<br><br>Check this film out. A special movie that actually reveals something about spook life, hard core, no glitz. Yeah, even as a woman I have to say Lawrence has nice breasts.","user":"yqokkicj","rank":[249,322]},{"title":"Not For Children Or Moana Fans","rating":7,"date":"7 August 2018","review":"This is a cold war thriller about a Russian of privilege being manipulated by the Russian state appatchiks to violate themselves and those around them. Deployed to fight the American enemy the beautiful and downright ideal Russian woman rolls up her sleeves to fight for herself above the enemy and so-called friend.<br><br>In a world dominated by Star Wars 7 and 8, the eighteenth Marvel film and sixteenth DC comic film this film stands out. Although on its own merits there is quite a lot to see... unless you prefer to watch yet another JJ Abrams sequel or something.","user":"zhh-36945","rank":[320,432]}]