[{"title":"A Simple Story","rating":9,"date":"11 October 2014","review":"Manglehorn is in essence a small simple story. No CG-I, no huge twists or plot points but rather a amazingly woven story of a lonely man attempting to overcome the loss of his old love. Al Pacino plays a role very different from the norm, hes a sarcastic, sad and sometimes bitter old man who spends his days either alone at his locksmith or mourning over a love that \"could have been\". Without spoiling anything, Manglehorn our main character slowly learns to love life again with the help of a friend. David Gorden Green does an incredible job at making this simple story pop by making many almost surreal like scenes (Most notably the watermelon scene). There are even scenes that are downright poetic (Scenes sometimes play out as Manglehorn recites a poem in the back, this is better than it may sound). As the story progresses it get quite deep, going into interesting back-stories about Manglehorns family (Mostly about the father and son relationship) and even at times very magical elements are hinted at. <br><br>I was lucky enough to see Manglehorn at TIFF this past September. If you get the chance this is a film that needs to be seen.","user":"Ausmahboi","rank":[47,65]},{"title":"A security lock","rating":7,"date":"22 April 2015","review":"Greetings again from the darkness. For those of us who grew up with 1970's cinema, it's been painful to watch Al Pacino's career over the last two decades  with only a couple of exceptions. We have longed for the actor who became Michael Corleone, and cringed with each outing that seemed to parody his Oscar winning performance in A Scent of a Woman (1983). Along comes the latest from director David Gordon Green and with it a reappearance of that actor so worshipped by John Travolta's character in Saturday Night Fever.<br><br>A.J. Manglehorn is an elderly locksmith who lives each day under his self-designed cloud of despair. His droopy eyes, droopy shoulders and droopy social skills are eclipsed only by his love for Fanny the cat, and his daily letters to Clara – the long lost love of his life. The only other signs of life in Mr. Manglehorn are displayed when he is telling a customer that it's time to wash their car, when he is hanging out with his granddaughter, or when he is exchanging Friday flirtations with bank teller Dawn (a sparkling Holly Hunter).<br><br>Director David Gordon Green is best known for comedies such as Pineapple Express (2008), The Sitter (2011), and TV's \"Eastbound &amp; Down\", and while this one (filmed in Austin, Texas) has some awkward and offbeat comedic moments, it would have to be categorized as a drama. Symbolism is everywhere as Manglehorn keeps his emotions \"locked\" away from his snooty yuppie son (Chris Messina) and retreats into his imaginary relationship with Clara, rather than embracing Dawn's brave come-on.<br><br>There are a couple of extraordinary scenes  Pacino and Messina talking around, rather than about, their relationship and the type of men they are; and the excruciatingly awkward and heart-breaking first date between Pacino and Hunter. The forlorn Manglehorn remains behind the locked door and allows the shadow of his dream girl to cast a pall, despite having a real life dream girl sitting across the table.<br><br>Pacino recaptures his mastery of the close-up. Such emotion from so little apparent movement is the work of a once great master who proves he still has it. Some may be put off by the lack of big action, but these are people living life and trying to make the best of it. There is a line from the movie, \"When you choose this life, there is no one\". It's a line that tells us so much about Manglehorn's daily approach. Whether he finds the right key matters to us for one reason  Pacino makes us care.","user":"ferguson-6","rank":[38,52]},{"title":"Most underrated movie of 2014? Possibly.","rating":10,"date":"23 July 2015","review":"Out of all the roles Al Pacino has gotten in his career, that of A.J. Manglehorn must be his most unusual one to date. This might put people off (as I suspect is the case, given the mixed reviews), but you know what? I think it's one of his best performances. Life is never easy, especially when there's a big obstacle slowing you down from trying to get through it. Something that you keep thinking about, can't STOP thinking about, maybe don't even want to. And this is the case for Manglehorn. No matter how hopeless it is, how meaningless it is to keep pondering about it, he keeps writing letters to Clara, the long-lost love of his life. His contact with people is very limited and the only true friend he has is his cat. He's working as a locksmith, but doesn't feel like he contributes much to society. His sorta pal keeps talking about his new salon, which he doesn't care about. He doesn't see his son very often either.<br><br>He keeps being isolated because he doesn't see much meaning in life as Clara doesn't respond to his letters.<br><br>This was a very fine, down-to-earth little character study about a man with low self confidence and tough luck. And it was beautiful. The conversations flowed well and felt natural, the cinematography made great use of imagery to illustrate feelings and most of all did Al Pacino blow me away completely. It was to the point that he didn't even play a character, he was... anyone. Anyone you could happen to know. There are plenty of people out there like Manglehorn and this actor gave such a figure not only flesh and bones, but also intestines.<br><br>You'd have to be a fool to skip out on such a simple, yet special and poignant film.","user":"mattiasflgrtll6","rank":[25,36]}]