[{"title":"This is propaganda. DON'T PAY TO SEE THIS!","rating":1,"date":"2 July 2014","review":"English is not my first language but I will give it a try. I went to see this for free today on the premiere in Portugal, I wasn't expecting much because I saw the IMDb score, and YouTube comments saying it was propaganda, I honestly taught everybody was overreacting and went to see it with an open-mind, besides that I love Tim Roth with all my heart. <br><br>Oh boy was I wrong, the movie is 2 hours of showing FIFA like martyrs that went against the world for football, even when they almost admit they were corrupt with was just for the greater good - football, showing that FIFA don't care about money, the only money they need is for Football, but for me the most f*cking shocking part was Tim Roth's role - Joseph Blatter.<br><br>They show him like he was the Mahatma Gandhi of Football , if that sounds offensive it's because it is. I isn't subtle it's just plan offensive, this is as low as the propaganda movies Hitler used to convince kids joining the Nazis. On the bright side the movie lacks so much subtlety that it's almost hilarious. <br><br>Speaking on the technical side, the sets and clothing are nice, not great but nice, everything else is terrible, terrible directing, terrible editing, generic music that sounds like it was taken from a free sound archive, disgusting color grading. It seems like they spend every dollar on the main cast, that I like but they couldn't save this movie. Nothing could. <br><br>It's depressing to see FIFA resort to this, I don't know if using the same strategy that Hitler used will make people see them in good eyes. For me I lost the little respect I still had for organization.","user":"marcofrias","rank":[295,309]},{"title":"Awful, Terrible, Avoid","rating":1,"date":"10 July 2014","review":"A film about FIFA, an organisation which is renowned for corruption and skulduggery, finances a film about itself. This should get the alarm bells sounding immediately. The basic plot is simple, football commences as a global sport, FIFA creates itself to manage this new international phenomenon. FIFA is amazing. The end. This is a film about an organisation in which corruption is rife, which pays no taxes, yet has 'billions' in its bank accounts, and which forces countries which win the bidding to host the World Cup to their change laws. FIFA were even allowed to edit the script to their choosing. If you like watching propaganda, then this is the film for you. Otherwise, I suggest that it is given a wide birth.<br><br>It's very strange that the one person here who has written a 10 star review only joined IMDb 2 weeks ago and must have done just to write a heavily biased review for this film.","user":"martyncymro","rank":[219,232]},{"title":"no...just no","rating":1,"date":"13 March 2015","review":"You know all those great sports movies about the underdogs and their fight to overcome incredible odds and still win? Yeah, this movie isn't one of those. It's a movie by a sports organization full of shady people about how not shady they are. There, it's like you just watched it.<br><br>FIFA has full reigns of this production and used it to make themselves seem like the bestest people in the world, which sounds ridiculous considering all of the scandals they are involved in. As previous reviewers have said, this smells a lot like propaganda. I guess you could enjoy it if you either 1. are a desperate fan boy/girl of anything related to football, or 2. an employee of FIFA contractually obligated to like it. <br><br>As a final note, you know a movie is bad when the IMDb tag line sounds sarcastic.","user":"dune_3001","rank":[118,127]}]