[{"title":"Tight masterful storytelling wins out","rating":9,"date":"25 July 2013","review":"In places like the West Bank truth is the first casualty. This fictional tale takes real life tensions and offers very believable characters to make that point. <br><br>The 3 friends (Omar, Tarek &amp; Amjad) plus the sister Nadia are constantly kept off balance by the political tensions that come from living in Palestine. <br><br>The director manages to add just enough warmth and naturalness to the various story loops to keep us on side with the lead characters.<br><br>The Israeli lead protagonist (Rami) has clearly read Machievelli's the Prince. He uses half truth, insinuation and educated guesses to rattle Omar and his friends. <br><br>Just when you think you know what is going to happen it all changes. This is a great movie. I saw it at a film festival but I hope it goes on to wider release.","user":"conannz","rank":[56,72]},{"title":"A Must","rating":10,"date":"18 January 2014","review":"To start with, I want to admit that I might be biased, as this movie is a local movie, with local actors, and local financing. Therefore, my review could be affected by what is so called local patriotism.<br><br>Nevertheless, I think that this movie is the best movie that I've watched in a long while. This movie tells the story of the Palestinian-Israeli conflict from the Palestinian point of view in a way that no movie did before. Yet, this movie could apply to any weak side that is living under oppression, anywhere on earth, such that everyone that has a heart can empathize with the oppressed, that is symbolized by the hero Omar. In addition, this movie contains numerous elements that one looks for in a movie: it has action scenes, dramatic events of betrayal and honesty, a pure and naive love story, friendship, funny scenes, and above all, it makes the audience ask questions and think. <br><br>To conclude, this movie is a must watch as it tells a story in a moving manner (some people even cried at the end..). In addition, by watching it you'll be supporting the uprising of the Palestinian movie scene, that has many great talents.","user":"mahmood-sharif","rank":[69,93]},{"title":"A film Shakespeare could have written","rating":9,"date":"14 January 2014","review":"If the saga of Omar were a wine, it would have to be described as \"Shakespearian, with notes of Dante, Orwell, Golding, and Sartre.\" Omar is a basically decent, seemingly uncomplicated young bakery worker who is inexorably drawn into the violent political warfare of the West Bank through his love for a girl, his increasingly radicalized circle of friends from childhood, and Israeli injustice. Right up to its unexpected, yet expectable, ending Omar is more victim than protagonist.<br><br>Clearly anti-Israeli in tone, the film explores the many reasons why Palestinians maintain an abiding antagonism toward Israel and Israelis. A driving metaphor in the film is the 25 foot high wall that Omar scales regularly to visit Nadia, his intended. Although The Wall was ostensibly designed to separate the Jewish West Bank settlements from Palestinians, it even more effectively separates Palestinian towns, families, and friends from one another--and from their water supplies in many places. To visit a neighboring town along is course has often become virtually impossible for having to detour long distances around the wall's tortuous path and passing through multiple checkpoints. Similarly, the Israeli military and police strive to divide and isolate individuals and groups psychologically just as the wall does physically. It's a classic use of divide-and-conquer strategy, which is one of the film's principal plot threads. Whatever your views of the Israel-Palestine situation, this thoroughly absorbing film will challenge them.","user":"HedgehoginPS","rank":[46,62]}]