[{"title":"Nothing terrible but nothing amazing either. I liked the use of flashbacks. I give this a C.","rating":4,"date":"23 July 2015","review":"\"Don't get caught. Don't get caught.\" Three high school friends have been backed into a corner. They need money, a lot of it, fast. Out of options they decide to simply rob a bank. They have the perfect target and things start smooth, but when one is recognized things take a turn for the worse. What started off as a way to get out of a jam now becomes a fight for survival. This movie is a different take on the heist movie genre. The robbery takes 7 minutes, but during that time the reasons and back story of each robber is told through flashbacks and that really is a neat way to do this. Each person has their own story, which really helps in the emotional connection to every person involved. On the other side, that is really the only thing keeping this from being 100% generic. There are a few twists in this but nothing mind blowing. All that said this is actually a decent movie to watch, but I found my mind wandering every once in a while. On the plus side this wasn't all that convoluted of a plot and even zoning out for a few minutes I was able to understand what was going on. Overall, nothing terrible but nothing amazing either. I liked the use of flashbacks. I give this a C.","user":"cosmo_tiger","rank":[13,16]},{"title":"An impressive début from Jay Martin.","rating":7,"date":"4 August 2015","review":"\"In and out within seven minutes\". That's the plan for three guys staging a brazen armed robbery at a local bank. Of course if the job had gone smoothly there wouldn't be any reason to make a movie and so naturally the job goes pear shaped. Bullets fly and unexpected circumstances arise. Suddenly, what they thought was a close-knit plan, becomes an all in-affair with other persons stepping into the equation. <br><br>7 MINUTES crept up on me and took me by surprise. In fact I had never heard of it up until the point of it landing in my hands. The cover art and poster treatments were confronting and my attention was perked immediately. It is an accomplished piece of independent film-making from a first time director Jay Martin. He has constructed a multi-layered crime film with an intentionally disjointed narrative that uses the robbery itself as the backbone. The course of the film switches its focus from one character to the next and details each of their movements leading up to the crime itself. They each their own reason for being involved and when faced with the botched job it's every man for himself. <br><br>The performances here are all good. Former Aussie HOME &amp; AWAY star Luke Mitchell has made the transition to the American scene with ease and he makes a strong impression here in his first leading role. The support around him includes players such as Jason Ritter, Kevin Gage, Kris Kristofferson and Joel Murray. All give solid turns with the stand-out being Kevin Gage. He conjures up a terrifying and psychopathic performance that lifts the film to another level.<br><br>Technically 7 MINUTES is also savvy and skilfully structured. The cinematography is awesome with wide sweeping shots and creative angles that are never so pretentious as to be distracting. The use of slow motion with an effective score by tomandandy compliment the design and offer the movie an extra coat of polish.<br><br>Of course there are also a lot of clichés and obvious tropes exploited in the film, as well as some convenient plot holes and irrelevant explorations of character traits. Ordinarily such things would irk me but with an ensemble of solid performances paired with a concise production design and a kinetic score the film moves at a breakneck pace and never oversteps its mark. With a structure not too far removed from RESERVOIR DOGS and an atmosphere of THE TOWN meets HEAT, 7 MINUTES is a surprise crime film that ought to impress most fans of the genre.","user":"toxiemite","rank":[10,12]},{"title":"Pointless but watchable","rating":5,"date":"27 June 2015","review":"If you are looking to watch a movie that you won't have necessarily to follow, keep reading. Otherwise, you will be disappointed. This movie starts well: it follows an interesting style of narration (Flashbacks which carefully explain the main Event through the single introduction of characters) and employs good actors. Unfortunately it also lacks an ending: the feeling after the ending credits reminds that sour sensation that something more could (should) have been done.This movie does not aspire to anything more than a decent box office outcome, but it could have been something more, if they had believed it to mean anything. It is just incomplete,and because of that, pointless to watch in the first place.","user":"dorian-23403","rank":[16,22]}]