[{"title":"Lazy Direction","rating":1,"date":"25 December 2014","review":"I think the director was attempting to complete a movie with the fewest possible camera moves. It was drudgery at the highest level...what a terrible effort. And what the heck was the storyline??? Acting was marginal. The history leading to the events we saw was poorly explained. Too much foreign language spoken. The camera shots were endless with nothing changing in them. The written summary must have been gleaned from reading the book because there wasn't any of that explanation in the movie. I wonder if this was the directors first movie? That would explain everything. I'm not even clear on what countries they were in, and what nationalities they all were.","user":"chlopan3","rank":[13,15]},{"title":"Bleak but compelling, believable and well acted.","rating":7,"date":"11 August 2014","review":"I think this film deserves more than the stars it has accrued. I believe this score is just due to lack of reviews (by anyone with a brain...ha ha) . It's VERY Bleak but compelling, believable and well acted. This film is looks beautiful and the musical score is gorgeous. Catherine Keener is brilliantly cast in the role of this wasted woman who still has the tenacity to try. Light Saturday night movie with popcorn this is not. From the title you might think there will be conflict and violence but you'll be disappointed if that's what you are looking for. This film is dramatic and poignant and very thought provoking. The themes of post traumatic stress, depression and friendship were very well portrayed for me.","user":"caribouster","rank":[16,23]},{"title":"Didn't enjoy the film; just like the character isn't enjoying herself","rating":7,"date":"23 August 2014","review":"I am very surprised to see that the film has such a low score (4,9 at the time this review is written) and gets negative to mediocre reviews from most critics and viewers.<br><br>Yes, this is not an enjoyable film. But it is so for a reason! It's the story of a traumatized war photographer, told from her point of view. And the way the camera tells the story stays definitely true to this character's confusion, denial and pain.<br><br>The highlights are Keener's performance and the beautifully minimalist score by Dave Eggar and Amy Lee.<br><br>I'm sure Jackson knew that this style of filmmaking is highly unpopular, especially in the blockbuster-driven and feel-good-indie-film-filled US. I give him additional kudos for deciding to go for it anyway.","user":"saveourlives","rank":[12,17]}]