[{"title":"Superohero Gold!","rating":10,"date":"30 July 2013","review":"This was awesome! Some of the details in the story are different that its comic book counterpart, but overall is an amazing adaptation.<br><br>I have to recognize my opinion may be a little bias as I'm a huge DC Comics fan and the Flashpoint event was the biggest thing since 1985 in terms of continuity as it rebooted everything from a new start point for all of DC characters. It has a lot of action and most cameos of characters I've seen so far. All the battles are epic, characters are well portrayed and animation's very interesting with obvious anime influence.<br><br>A lot of fun, totally worth it and if you're new to superhero animation this is a good starting point.","user":"hate-607-972762","rank":[70,81]},{"title":"The BEST DC animated movie I have ever seen!","rating":10,"date":"30 July 2013","review":"I just finished the movie minutes ago and couldn't wait to write a review.<br><br>The acting is superb.<br><br>The writing excellent.<br><br>The music is great.<br><br>The animation is fresh. <br><br>Oh, and for those of you who like their stories with a little darkness to them, hold onto your seats because this is movie delivers. <br><br>If you are ANY sort of DC fan and have not seen this movie, go NOW.<br><br>GO!<br><br>Thank me when you're done.","user":"sciencekarl","rank":[89,105]},{"title":"Best DC Animated So Far","rating":10,"date":"15 August 2013","review":"I know men and women(!) from all walks of life who watch DC Animated shows/movies religiously. A lot of us were expecting a Flash-specific movie after the awesomely climatic culmination of events at the end of the JLA series season 4 (Divided We Fall)... which pretty much told us DC fanatics what we already knew all along... that the Flash is probably the most powerful superhero in the DC universe, period. So why don't we know more about him? This movie serves three amazing purposes, each executed to perfection; first, bring the DC animated movie series to an even darker, more violent, mature place and audience; second, give us a glimpse into the Flash's personal back-story, top villains, and character development; and third, to showcase a period in DC comic book history that is crucial to further plot developments. But really, its just a beautiful film and great opportunity to showcase some of the newest animation tactics, and to give the animators some freedom to be a little more 'adult' in their drawings. This is definitely the best of the DC animated movies thus far, (that's saying a LOT, btw), and is truly one to get excited about watching. New Earth is portrayed hauntingly as a gritty, sullen place to exist... Aquaman is finally given full credit and accurately shown as a nigh-invulnerable multi-powered heavyweight... the Amazonians are beautiful and fearsome... and for the first time ever I was actually a little creeped out by the true alien that Superman is. But you'll get a little creeped out by all the characters, and that's the point (except the Flash, of course!). It was great to see the interpretation of the New Earth variants well voiced and drawn, especially Slade and Black Manta. Also huge kudos to the producers for making Yo Yo's voice the same as Harley Quinn's. I totally agree.","user":"visijared","rank":[49,57]}]