[{"title":"Ratchet & Clank is indeed an excellent movie for everyone.","rating":10,"date":"29 April 2016","review":"Ratchet &amp; Clank is a 2016 American-Canadian 3D computer-animated science fiction action comedy film based on the first game of the platforming video game series of the same name. The film stars the voices of Paul Giamatti, John Goodman, Bella Thorne, Rosario Dawson, James Arnold Taylor, David Kaye and Sylvester Stallone.<br><br>Series creators Insomniac Games helped with the film's production, screenplay, character development, and animation. The film was directed by Jericca Cleland and Kevin Munroe, featuring an original story written by Munroe and former Insomniac Games Senior Writer T.J. Fixman, who started writing for the series with the Future saga. Several cast members from the games reprised their respective voice roles, and assets from the video games were utilized in the film.<br><br>The film is an origin story that retells the events of the original Ratchet &amp; Clank, depicting how Ratchet and Clank met each other as they attempt to save the Solana Galaxy from being destroyed by Chairman Drek and the Blarg. However, the film expands on various plot points in greater detail, and incorporates some elements from later series entries, such as the introduction of Doctor Nefarious and the Galactic Rangers.","user":"mehmet-46991","rank":[71,104]},{"title":"Great movie, ignore the critics, trust yourself","rating":10,"date":"1 May 2016","review":"I don't understand on why critics are responding so negatively to the movie. In my opinion, it was a really great movie. It was my childhood game, I loved the game, I loved the movie. Great humour, great characters. I think the critics just need to cool off a bit and take it a little lighter. I don't know what they have against video game movies but the critic to it is way too much. Ratchet and clank movie was made for the fans! Those who already know and love these characters and this style of humour will find a lot to love about the movie, but the uninitiated will likely write it off as just another animated movie. It's a shame, because of the fans who get it. Critics who have no idea about the game should keep their opinions to themselves. Who are they to judge if they don't know anything? Fans know better than you so shut the **** up. Ignore the critics! If the game was your childhood, it's gonna be a memorable movie, taking you back to the past to relive those great memories. Go watch it, you won't regret it.","user":"courtneylee-82507","rank":[54,90]},{"title":"Ratchet and Clank fans will love it.","rating":1,"date":"1 May 2016","review":"Well animated, good cast, but misses the charm of the games.","user":"Invader9","rank":[32,52]}]