[{"title":"Consider my mind blown--a monumentally smart, fresh, and totally fun low-budget horror/film noir/black comedy","rating":8,"date":"31 October 2014","review":"I saw this under-the-radar low-budget gem at the New Orleans Horror Film Festival a couple weeks back, where it pretty much blew myself and the entire packed house away and went on to walk away with that festival's Best Feature Film award.<br><br>It's such a difficult movie to describe, especially without giving too much away. The story begins as a classic Film Noir Love Triangle. Regular guy Milton is lured by the scorching femme fatale Skyler into a scheme to cook up a gargantuan batch of crystal meth for her psychotic corrupt cop boyfriend, Russell. You've seen this story many times. But just when you think you know exactly where the whole thing is going, it begins taking delightfully clever supernatural twists and turns that keep on coming and coming, right up until the end of the movie. <br><br>But unlike a lot of movies that try to take you on a ride like this one, the twists and surprises that keep unfolding here never feel forced or unmotivated. The movie is incredibly smart in its storytelling and direction and really respects the intelligence of its' audience, challenging them to put two and two together on their own rather than spoon-feeding them information. The three young actors who play the leads are also really impressive and convincingly carry the movie, keeping their characters grounded in reality and believable as real human beings, no matter what inexplicable chaos or craziness is berserking around them.<br><br>In some ways, some might consider this more of an art-house movie than pure horror, more early Cohen Brothers than Sam Raimi--but it somehow manages to maintain that sense of rollicking good fun and attitude that is definitely rooted in the very best tradition of low-budget horror flicks.<br><br>If you told me that a little movie like this could come along out of nowhere to seamlessly and successfully blend horror, film noir, and black comedy, I would have scoffed. But Blood Punch has made a believer out of me. See it if you can--highly recommended.","user":"hinghammark","rank":[32,43]},{"title":"Revenge of the chemistry student","rating":9,"date":"21 February 2015","review":"Breaking Bad never made murder this much fun! This innovative, intelligent thriller dark comedy with a dash of sci fi traps its characters in a never ending story full of false leads and false endings that takes the audience along for the ride. In a story that's nothing but twists, the audience finds itself trapped in the same puzzle as its characters, and even ways out are not what they seem.<br><br>The clever premise is misleadingly straightforward: Femme fatale Skyler gets herself sent to rehab to recruit a crystal meth cook, where she meets college boy chemistry student Milton who got busted for running his own meth lab. Skyler has her hands on 100 lbs of pseudoephedrine and has one day to make it into meth for a multimillion dollar payday. Well actually, her boyfriend Russell has the pseudo. And Russell's psychotic. With trust issues. But on the plus side, he has a plan to break them out and a secluded cabin for the cook. Yet it turns out that making the meth is easy. Getting back out and cashing in on the payday--that's the hard part, a dilemma the characters struggle endlessly to resolve.<br><br>What makes the storytelling so much fun is that the audience knows from the beginning that in this somewhat conventional storyline, nothing is what it seems, sharing in the characters' bewilderment to figure out what's really going on. The story starts on the morning of the cook, where Milton finds a video he's already made to explain to himself what's really going on. As he unravels the mystery of his own circumstances, the characters are trapped together and the audience is trapped with them.<br><br>Filmmakers Paxson (director) and Guzelian (writer) are a husband-and-wife team who've built their resumes in Los Angeles developing Disney entertainment. They wanted to make a movie of their own and for it to be a departure. They met the cast in New Zealand while filming a season of the Power Rangers. A group collaboration from the beginning, Guzelian wrote the story with input from Paxson, specifically for their New Zealand friends. Filmed in three locations around Los Angeles, the film has an indy feel, limited budget but professionally produced with substance (story and characters) over flash. Tennet plays Skyler with layers of subtlety, and Cawthorne portrays Milton's evolving confusion convincingly, a nerd who's made bad life decisions. Boyland can't quite portray Russell to be as deeply psychotic as he's supposed to be; the actor seems like just too nice of a guy. Special mention to Holloway who took the over-the-top Archer and even went beyond that.","user":"moviefansme","rank":[20,29]},{"title":"Wow! A shocking and totally unexpected low-budget masterpiece!","rating":9,"date":"9 December 2015","review":"I had various friends and blogs recommend this movie to me, but I kept avoiding it, mostly because the title and poster made me certain that I would be getting just another brain-dead horror movie gore-fest. Boy, was I wrong.<br><br>What I got instead was one of the best low-budget indie movies that I've seen in years. I know, I know. It feels weird to be lumping those kind of lavish praises on a movie like this, but what can I say? This movie took a somewhat bitter and skeptical viewer like me and converted me into a believer with an incredibly ambitious and clever script, three really solid performances from the lead actors, and a fun sense of style that somehow made the movie feel both classic and modern at the same time.<br><br>I really don't want to give away anything specific when it comes to the plot and story. It's much better going into it cold and knowing as little as possible. It's a blend of film noir, horror, science fiction, and black comedy and yet somehow comes together almost perfectly, blending and juggling all these familiar genres into its' own incredibly unique and distinctive vision. I watch a lot of movies and often feel like I've seen it all and know where most stories are headed, but this is a movie that really keeps you on your toes. The script was always one step ahead of me and had me guessing right up until the very end.<br><br>In general, the look and production values are quite good, but you could definitely feel some of the movie's lack of budget and resources in some areas. But I found myself way too swept up in the story to ever really mind or care. And the three main leads, who are playing very familiar and almost cartoonish archetype characters, do an incredible job of making these characters come across as totally believable and real human beings.<br><br>This is an amazingly underrated and totally overlooked little movie. I highly recommend it.","user":"colleenpryoritize","rank":[19,29]}]