[{"title":"Loved it!","rating":9,"date":"7 July 2018","review":"My wife and I went to this on the opening night. We both love Jo Brand and have read the book, so we were a little worried that the film would not come up trumps. Well, we knocked for six by the film. Wonderful to look at, the performances were all stunning - especially Sheridan Smith, Mark Addy, Sally Phillips and it made us both laugh out loud one moment then have a tear in our eyes the next.<br><br>The young lead, Ella Hunt, is a star in the making - what can I say?! Go see it. I had an aunt who suffered from mental health problems and it truly brought back the memories of her, good and bad.","user":"dibsdale-70185","rank":[23,31]},{"title":"Not a comedy","rating":6,"date":"23 November 2018","review":"The performances of all actors was exceptional, mental health very cleverly depicted requiring hours of research. Whilst some of it was amusing, it was not funny and definitely not a comedy. Did not live up to its billing.","user":"Abrazarse","rank":[6,7]},{"title":"Beautiful and accurate film.","rating":7,"date":"10 November 2018","review":"Having worked with patients suffering from serious mental health problems for many years I am always interested in how the subject is portrayed on film. The film is set in the seventies and eighties and in terms of options available to people with bipolar disorder (this is essentially what is being portrayed) the options were largely around lithium (which is still used) and old style injectable phenothiazines that patients feel dulls their experience. Although the patient here appears to have bipolar disorder she is treated with injectables which did happen and probably still does. The picture presents the effect of such management well and the picture of someone who is too demotivated to leave their chair, sits smoking for hours and is unreactive is familiar to anyone who would have worked in mental health in the eighties.<br><br>I think the beauty of this film is that it is very engaging and very quickly I began to care about the characters. Jo Brand is always very good value and although she has been a writer, actor and comedian for many years the psychiatric nurse is just below the surface and this comes across in the film very well.<br><br>Keith English's direction brings one very close to the characters and I think accurately portrays the concerns of families caring for people with mental health difficulties. There are some minutes of high comedy but the tagline of 'you can't choose your family' is very accurate. You really can't choose family members and some of the ones depicted here you really would not want. I did think that the film depicted the concerns of family members well, from their lives being caught up with caring for a relative to the worry about whether they are in some way responsible for their relative's illness (they are not).<br><br>The nineteen-eighties are not that far away in time and with no internet, no mobiles and a world in which much of what was happening came through the television it was fun to see how far things have moved on. The over crowded décor of the seventies and eighties - the house being too cold for comfort and the isolation of small communities from urban centres all rang very true to me and although I live near London at the moment I grew up near many such places where a bus coming through was the highlight of the day. Keith English captures this all very well and there is massive attention to detail in making sure the illusion is not shattered.<br><br>A warm, kind and gentle film which stirs up some genuine emotions.<br><br>Happily for people with bipolar disorder there are better options too and the days of people being either so ill that they need hospitalisation or being overly sedated are now way behind us.","user":"timb0-966-53179","rank":[4,6]}]