[{"title":"Accomplishes its purpose ...","rating":7,"date":"22 February 2016","review":"What do you expect? You know what kind of movie this will be.<br><br>It is a bit dumb and full of clichés. The story is paint by numbers and you can predict the ending after the 30 minutes. The characters are as stereotyped as possible (ranging from no non-sense cop to diabolical, good looking evil mastermind and very attractive female side-kick).<br><br>It is a bad movie though? No. I've actually enjoyed it. It is the kind of movie to which you go, have a laugh laugh, go home and forget all about it. It won't enter any top movie list and it won't teach you anything useful. But it will make you laugh and that's a good thing.<br><br>I guess there were better movies out there for which to pay $10 to see, but I don't regret the time spent. It was like eating a bar of chocolate, good and then you move on with your life.","user":"razvan-rogoz","rank":[33,43]},{"title":"Keep riding","rating":4,"date":"12 April 2016","review":"After the success of Ride Along comes along this lukewarm retread with less plot and less funny lines.<br><br>Ice Cube and Kevin Hart are still the prospective brothers in law to be but Hart is a probationary police officer. An interesting beginning as Hart ends up being responsible for Cube's partner, Tyrese Gibson getting shot.<br><br>After that the plot moves to Miami where the two head off to find a hacker, Ken Jeong who is there to trade comedy with Hart while Cube can get on with the main plot of taking down a crime lord, Benjamin Bratt.<br><br>There are a few amusing scenes, the pair trade insults and banter with each other as Hart desperately tries to impress Cube. There is some decent action in the last part of the movie but it just feels like a lazily inspired sequel that brings nothing new to the table.","user":"Prismark10","rank":[17,21]},{"title":"Kevin Hart being his Kevin Hartiest","rating":4,"date":"14 June 2016","review":"Ben Barber (Kevin Hart) is a rookie cop and getting married to Angela Payton. Police detective James Payton (Ice Cube) is going to Miami to track down computer hacker AJ (Ken Jeong). Angela talks her brother into letting Ben join him. They find help from Miami police detective Maya Cruz (Olivia Munn). AJ is involved with villainous Antonio Pope (Benjamin Bratt).<br><br>After the original, I thought the sequel has a chance. I thought the guys' chemistry would make a good buddy cop comedy if they can turn friends. They're still not that friendly but I'm still going to say I'm wrong. Kevin is doing the same thing and it's getting tiresome. Maybe the repetition is getting to me. It's actually getting a little annoying. He may be losing me at this point. It's time he consider something different.","user":"SnoopyStyle","rank":[7,8]}]