[{"title":"Hollywood loves pointless remakes AND sequels","rating":3,"date":"16 July 2015","review":"I hated this movie almost as soon as it started. Everything was just off. It tried way too hard to be funny forcing Rebel Wilson to have to act extra weird and quirky as opposed to just naturally weird and quirky. Becca's working at a lame recording studio while trying to tell the Bellas she's going to quit. There's like two or three new girls that I can't remember because they're not memorable.<br><br>Then they go on this lame camping expedition where Audrey now works having graduated. The group of German singers they're going up against really suck and wouldn't even be hard to beat except that the Bellas suck too. Their end performance was crap especially compared to the first movie. Pitch Perfect was hilarious, charming, original, and had great performances. Pitch Perfect 2 was strained and pointless.","user":"doofuspoofus","rank":[133,219]},{"title":"I loved all of these women.","rating":10,"date":"29 May 2015","review":"Pitch perfect 2 is a hilarious comedy and musical movie with lovely women.amazing music and fantastic acting. <br><br>It's been three years since the Barden Bellas (Anna Kendrick, Rebel Wilson) became the first all-female group to win a national title. All seems well until a botched Lincoln Center performance for the president leads to a scandal that strips them of their performing duties, causing internal tension and strife. With the world championships on the horizon in Copenhagen, Denmark, the women must get their act together for their one and only shot at redemption.<br><br>Lesbians and feminists must see this excellent movie.","user":"cikamikiriki","rank":[117,202]},{"title":"Misunderstood and actually brilliant!","rating":8,"date":"9 September 2015","review":"Let me lay my cards out there straightaway. I'm a 31 year old bloke, married with two kids, who loves films and music.<br><br>And I love this film.<br><br>I Ioved the first film, and this one builds on it. But you have to appreciate that the film is based around college. For anyone that's actually been to college they should have experienced parties/people/incidents replicated in this film. I don't really understand why people show so much disdain for the 'childish' humour!<br><br>That aside...<br><br>Hats off to Elizabeth Banks for her directorial debut, you'd never know there was any change from the first film. And her inserts with John Michael Higgins are excellent, if you take them at face value for exactly what they are intended to be; humour! And pretty sexist, misogynistic humour!<br><br>Anna Kendrick is, as always, stunning (yes, the wife knows!) and simply brilliant. Shows just how much of an actress she is having improvised almost half her lines and proves once again that she can actually sing (albeit that the singing is not on set and pre-recorded).<br><br>The rest of the cast is brilliant and it's nice to see a little more of Esther Dean actually singing/rapping rather than her usual producing.<br><br>Hailee Steinfeld has stepped in seamlessly. I don't think we saw enough of Rebel Wilson though, reckon there'll be a few deleted scenes that didn't make it.<br><br>Good to see a lot of humour applied to the Ashley/Jessica situation (unless you know the film you won't get this).<br><br>The final song was actually very good. Maybe not as unexpected as the first film but brilliant with an original start and an excellent surprise at the end that I think added a very personal and moving touch.<br><br>It will be a shame if the franchise is over!","user":"Chris0184","rank":[26,40]}]