[{"title":"The boldest finger to political correctness I have ever seen - and tons of twisted fun","rating":8,"date":"8 July 2014","review":"The first one was a gory blast. But the second one tops it in every conceivable way: This is a no-holds-barred splat-fest from the beginning to the end which would make (the early) Peter Jackson proud!<br><br>I can take a lot of splatter, but I must admit: some scenes were so disgusting that I was as much retching as I was laughing (a very confusing experience - believe me), this movie really takes no prisoners. And it really seems to want to make a statement against political correctness: the elderly, the disabled, kids, mothers with strollers, gays, heck: even babies(!!!) all get blown up or hacked to pieces in such creative ways that even an old gore-hound like me was a bit shocked (I must shamefully admit). Then again, when you're dealing with Nazi-Zombies, that was to be expected.<br><br>But the film is also very well done; the camera, the music, the sound-effects, and - most importantly - the make-up effects were absolutely fantastic. Nazi-Zombies have never looked better. <br><br>A word to the wise, though: This film is absolutely not for the easily offended (or people, who - unlike me - have a certain amount of taste, decency and general common sense left). <br><br>Watch at your own risk - 8 stars out of 10 from me.<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[105,115]},{"title":"Better than the first movie in every sense...","rating":9,"date":"14 July 2014","review":"Can't believe it has been 5 years already since the first \"Død Snø\" movie was out. Time really flies by fast, and this sequel has been long awaited. And it was with a great amount of expectation and high hopes that I sat down to watch \"Død Snø 2\".¨<br><br>Whereas the first movie was entertaining and loosely similar to \"Evil Dead\", then \"Død Snø 2\" has added more comedy, but also a great upgrade in budget, and it really shows.<br><br>Everything in \"Død Snø 2\" is just a step up from what it was in the first movie, from the camera-work, to the zombie make-up, to the production value, and the list goes on and on. And for the gorehounds, then \"Død Snø 2\" really offer a good amount of entertainment.<br><br>\"Død Snø 2\" is entertaining, just bear in mind that there is a fair amount of comedy throughout the movie as well, and if you enjoy movies such as \"Evil Dead\", \"Shaun of the Dead\", \"Dead Alive\" and the like, then you will most definitely like \"Død Snø 2\" as well.<br><br>I was more than genuinely entertained and surprised by this movie, and it is a very worthy addition to the movie collection of any zombie aficionado. And the movie has enough contents to sustain more than a single watching. \"Død Snø 2\" is well worth the time and effort to sit down and watch.<br><br>I am rating a \"Død Snø 2\" a solid and well-deserved 9 out of 10 stars.","user":"paul_haakonsen","rank":[55,86]},{"title":"Dead, Dead, Good.","rating":10,"date":"15 July 2014","review":"Having been a horror fan for longer than I can almost remember, I've seen countless zombie films, and while the genre has had life pumped into it on several occasions (the speedy zombies of 28 days/weeks, and the comedy zombies of Shaun of the Dead) in recent years it's kinda fell by the wayside once again. I enjoyed Dead Snow (the first film) but I'm not sure I gave it the praise many others did, preferring to just think of it as another (slightly gorier) Shaun film. So I came to DS2 with low expectations, I knew I'd probably like it, but gawd, I really didn't expect to fall on my knees and worship the thing. . Dead Snow 2: Red vs Dead is without doubt the most fantastic comedy horror I've seen in years - period. I saw Wolf Creek 2 just a few weeks back and while the improvement in that film over it's first part is sky high, Dead Snows is interstellar. It's extremely gory, almost to the point you'll wonder if you should be laughing at things like child kills, wheelchair kills, even baby kills, but man it's fun with a capital F. And, it looks absolutely beautiful too, with the Norwegian countryside just sparkling (no snow this time). I don't want to spoil anything for anyone here, but this movie manages (once more) to revive the undead sub-genre. It's action packed, and dare I say it, maybe even a little moving at the end? I loved every, single, blood splattered second of it and can't wait to buy it on bluray. And make sure you watch to the end of the titles by the way. Stunning stuff. Long live, the living dead.","user":"horizon2008","rank":[44,70]}]