[{"title":"UnProfessional Acting and DIrecting Make This Film A Complete Mess","rating":3,"date":"18 May 2015","review":"Firstly, that guy above me who wrote one review for IMDb - for this movie - and gave it a 10 - that guy just about admits to being on the crew of the film.<br><br>This is a fairly bad movie and most definitely not worth the time to view. The acting is that of a poor high school drama club, the \"special effects\" essentially consist of occasional blue glowing eyes and the direction is virtually non-existent.<br><br>The plot line nothing you haven't seen before, exposure to radiation gives teenagers mutant super-powers. Right.<br><br>The movie openly adopts a graphic novel approach with occasional cuts to an comic book overlay of the current scene. Nice but I'm pretty sure we've seen that before too.<br><br>We live in an age where almost anyone can make a film because the tools to do so are so easily accessibly. This film once again proves that not everyone should.","user":"imdb-976-736766","rank":[15,23]},{"title":"Absolutely Terrible","rating":2,"date":"28 May 2017","review":"This film was absolutely horrible.<br><br>I'll get to the point. The plot was terrible. I would be surprised if anyone could make it past 20 minutes without turning this mess off. It was extremely predictable, and I do not see the point of watching a movie if you already know what is going to happen.<br><br>The acting was awful. It was more like a high school play that was double cast, and that this was the alternate cast.<br><br>The graphics are basically non-existent. And the graphic layout has been done in practically every superhero movie, so it did not add anything new.<br><br>I'll be blunt, skip this movie. It is terrible. Even if there is nothing else to watch, find something. Don't waste your time on this outrageously awful film.<br><br>Also, the director cannot blame the budget for how terrible this movie is. I have seen better feature length films made on a smaller budget.<br><br>Lastly, don't waste your time watching this movie. Find something else to do with an hour and a half of your time. There has got to be something better to do that wasting your time watching The Posthuman Project.","user":"MoreAir","rank":[5,10]},{"title":"Pleasantly surprised","rating":8,"date":"22 March 2016","review":"We popped in the Blu-Ray and the menu came up as expected. What wasn't expected was the amount of work that went into the menu alone, and this surprise set the tone for what we'd soon discover was true of the entire movie! If I only had one word to sum up this film, it would have to be this: impressive. It delivered an entertaining and engaging story with a fairly high production quality for a tiny fraction of the budget of a mainstream production.<br><br>There are some really funny moments of writing in this film. When Gwen says, \"Us in charge of the world. What could possibly go wrong?\" and then we cut to Denny's teacher writing \"Mutually Assured Destruction\" on the chalkboard. Tasty. Or when the assassin spits out \"Shoot an unarmed man? You don't have the...\" (nut shot) \"Balls!\" I laughed out loud. Or when Archie tries to disappear but belches instead. Too cute. I appreciated the silly moments like these in a film that doesn't take itself too seriously. <br><br>As for the film's other accomplishments, here is a modest list: the opening credits, chapter titles and transitions, and the special effects were each masterfully executed, and indistinguishable from those of any mainstream blockbuster hit (though the green screen scenes in the car were fairly obvious). The soundtrack was a pleasant surprise, and the car scene with everyone singing along was just too precious and reminded me of that classic \"Tiny Dancer\" singalong on the tour bus from Almost Famous. The filming locations were varied and interesting--abandoned fairgrounds? Yes, please. The choreographed fighting and accompanying sound effects were fairly convincing to me. The cinematography was reminiscent of J.J. Abrams with his stunning use of light. One of my favorite moments on film was a gorgeous, slow-motion flashback to a bygone Halloween that sucked me right in with a full dose of nostalgia. It melted me.<br><br>There is one major fault of the film that can't be directly attributed to the low budget: with the exception of the main star, some of the performances from each of the actors felt forced from time to time. Naturally, that pulled us out of the story. I'm not in the industry, so I may be wrong, but I don't think this can be attributed to budget because the rest of their performances would suggest these were fully capable actors. With an extra take or two, I think the poorly-delivered lines could have been re-shot (though I'm sure that would probably have its own costs). In my opinion, the relatively high production quality and the original premise and creative script were enough to overlook those occasional insincerely-delivered lines and missed opportunities for directorial intervention.","user":"gdespinoza","rank":[4,9]}]