[{"title":"At less than 40 minutes, a fascinating little film.","rating":14,"date":"14 May 2015","review":"I came across this one on Netflix streaming movies. It is narrated very pleasantly by Forrest Whitaker. <br><br>I am both a Scientist and a long-time amateur photographer. I have at one time or the other been curious about each of the short subjects presented here.<br><br>\"Unseen\" is used broadly, not just for the invisible or tiny. For example, by use of very high frame rate photography we are shown things like how a bullet shatters an object, or how a drop of water reacts and bounces multiple times when it hits a pool of water. Things that we see, but happen so fast that we can't really tell what is happening.<br><br>Or the opposite, slow frame rates, or time-lapse photography. By this technique we see flower blooms opening, seeds germinating, vines growing and climbing. <br><br>And then there is the true microscopic world of creatures so tiny they can only be discerned with high power microscopes, even the ultra high power electron microscope.<br><br>A very interesting short film that comes in just under 40 minutes.","user":"TxMike","rank":[8,9]},{"title":"Stunning images and very interesting to listen to","rating":10,"date":"30 April 2018","review":"Well after reading the other reviews I come to the conclusion that I'm the first one that loved this documentary. It's only fourty minutes long but I feel I learned more in those fourty minutes than in a complete school year. And not only it is instructive but it is also beautifully shot, with stunning images from different techniques as high-speed and time-lapse photography, electron microscopy, and nanotechnology. I don't know wich one I prefered, they all brought something special to this documentary. The nanotechnology was amazing and sometimes a bit creepy, but oh so interesting. All the things our eyes are not capable to see are shown in this documentary and it's just amazing. Forrest Whitaker is in charge of the narrating voice and that was also a pleasant voice to listen to. If you have fourty minutes time and you like science and nature this is a must-see.","user":"deloudelouvain","rank":[3,3]},{"title":"Only visually interesting","rating":4,"date":"16 October 2015","review":"\"Mysteries of the Unseen World\" is a 39-minute documentary from 2 years ago and the narrator is Academy Award winner Forest Whitaker. Certainly, always nice to listen to him. Director Schwartzberg and writer Richards have made films for several decades, so lack of experience is certainly not an issue for this one. This documentary takes us into the breathtaking world of time lapse photography and microscopic creatures, basically everything we are not really able to perceived the way it exists, because our eyes are not capable enough. And while this documentary was certainly a success from the visual side, I cannot say I was too amazed by the contents in general unfortunately. It's by no means a bad piece of filmmaking, but it just wasn't that interesting to me and the only thing I really took from it is that there are more creatures living on my body than people are living on our planet. A pretty disturbing thought actually. All in all, I am not sure if I would recommend the watch. Maybe check out the description/trailer first and decide for yourself.","user":"Horst_In_Translation","rank":[3,7]}]