[{"title":"Mistress America: A surreal, strange, slice of life unlike any other","rating":8,"date":"19 July 2015","review":"Taking place in New York City about now, \"Mistress America\" focuses on the life of Tracy who is a freshman in college. She aspires to be a writer—easy to tell because she's aloof, detached, alone, and looking for friends. Her mom's getting remarried so Tracy has an older sister-to-be in Brooke, one of those cinematic forces of nature like a young Katherine Hepburn, perhaps. Brooke takes Tracy into her life of late-night concert performances, high-output spinning, fashion, finance, clandestine apartments, absent lovers, and a nascent restaurant business. In many ways, this is a buddy movie as Tracy learns fierce independence from Brooke, who she greatly admires.<br><br>Like all buddy movies, Tracy's and Brooke's relationship has ups and downs, complicated by the literary understory. Then the whirlwind pace goes surreal as the New Yorkers head to Greenwich, Connecticut in search of—something. We think it's one thing but it's not. I guess Greenwich, seat of the uber wealthy in the US financial arena, is actually a surreal place.<br><br>This is an intensely witty movie with a very chewy script handled ably by the very smart cast. Many call \"Mistress America\" a comedy but funny is clearly not this movie's main goal. To call it a \"screwball comedy\" is to not properly describe its intellect. The movie is saying something about envying the lives of others, which most of us do to one extent or another. It's a thoughtful movie, and it will be uncomfortable for some to watch if you, like Tracy, are not centered within your own mind and body. And after all, who is?<br><br>We saw this movie thanks to the San Jose Camera Cinema Club.","user":"steven-leibson","rank":[61,79]},{"title":"Excellent acting and excellent writing make this an excellent film","rating":9,"date":"21 December 2015","review":"There are several reasons why Mistress America may be considered a wonderful movie. It doesn't take itself too seriously, and has a very sophisticated sense of humour. The main actors all have exaggerated characters that always behave in certain ways (kind of like the cast in The Office) -- and the actors play these roles to perfection.<br><br>The writing and delivery of dialogue in the climax of the film is particularly amazing, with fast, witty exchanges filled with little jokes. Yet, the movie vacillates from hilarity to melancholy without warning the viewer, which makes the film all the more special.<br><br>The depiction of and commentary on NYC, youth, etc. is all spot on, making this movie worth the watch.<br><br>Finally, the soundtrack is excellent too, giving the movie a very alt/indie feel. <br><br>Many negative reviewers sadly fail to appreciate the sophisticated writing and humour, along with the truly wonderful job that the lead actors have done in this unpretentious flick.","user":"aa3636","rank":[34,42]},{"title":"Welcome to New York","rating":5,"date":"9 September 2015","review":"I'm having a lot of trouble reviewing this film. On one hand, I really like all the actors, and even their performances, but I don't think this film really worked on all the levels it attempted to. Greta Gerwig is one of the top up and coming actresses working today, and i actually thought Lola Kirke did well in her first starring role. But the narrative never grabbed me like Noah Baumbach's other film Frances Ha did, also with Gerwig.<br><br>But the film is also not at all bad, in fact this may very well be the case of myself just not understanding what was intended with the script. It was just hard to buy into the premise when nothing is really set up at all. The film just pretty much jumps into the plot of Tracy and Brooke spending time together as they get to know each other before officially becoming step-sisters. Their relationship was interesting, but I didn't find it to be profound or anything like that. The latter half of the film takes place mainly in one area with close to 10 characters and it seemed to be way too dramatic and theatrical for a low budget story on a few relatively regular human beings. <br><br>It's unfortunate because the soundtrack and score are really quite good and seemed to fit for what they were going for at first, but the film just wasn't appealing enough for the score to really shine like it should have. I just feel like for a movie that is titled Mistress America, it should have been a more memorable outing. Sadly that's two Baumbach films this year that have been a bit of a letdown.<br><br>+Score/soundtrack<br><br>+Likable leads<br><br>-Why do I care about this story?<br><br>-Not much set up or payoff, to anything<br><br>5.5/10","user":"ThomasDrufke","rank":[31,44]}]