[{"title":"Great Movie that Inspires Right Thinking","rating":8,"date":"3 July 2015","review":"Though some of the sports scenes are not as convincing, the story line, interactions and dialog are. This based-on-a-true-story movie takes you on quite a journey that is safe and entertaining for the whole family. It will also challenge you to think more carefully about your life and inspire you to look for, and trust, how providence is working out the direst of circumstances in your, and your family's, life. This movie may not be 100% 'Hollywood quality', but it is very close. The acting, cinematography and screenplay is excellent. Only some of the sports scenes could have used a bit more authenticity, but it is easily overlooked because of the excellence throughout the rest of the movie. Well worth the watch and the purchase!!","user":"jaf-27960","rank":[13,26]},{"title":"Sappy, religious after school special.","rating":3,"date":"24 November 2016","review":"Somehow this movie garnered 4 stars on Netflix and is based on a true story so I decided to give it a try. It has the quality of a made for TV hallmark special. The writing was very weak and the acting was made for TV quality. Some familiar actors are present but the movie is very cheesy with its message of just have faith in God and everything will be fine. They are beyond bankrupted, about lose the farm, literally, and he buys his 18year old daughter a new used car. Ridiculous.<br><br>Somehow at the end Hoovey wins the game with a 4 point play, and Mom goes on to become a motivational speaker supposedly gaining financial independence selling supplements. She was a housewife who's husband would not let her work while he worked three jobs. I think this movie was very loosely based on a true story. High school basketball player with brain tumor and housewife turned motivational speaking con artist were likely the truth, but not much else. I wonder where these people are today. My recommendation, skip it.","user":"lakegrovefc","rank":[7,14]},{"title":"Is that truly a movie!!!?","rating":1,"date":"30 September 2016","review":"The movie seems to be more of a Sunday sermon rather than a work of art. It perfectly fits the intentions of preaching the almighty will of god to the infidel and the shaky ones. It replaces the human will, that is normally filled in with many various sources including the belief in super beings with the inevitable and only one source of strength people can get from their gospels' clerics As the movie synopsis goes: \"Life can change in an instant, and turn your whole world upside down. And as the preacher would tell: It's all god's will\" So that's what happens to the living American dream that is the Midwestern firefighter Jeff Elliott and his wife who live with their beautiful, healthy children, family farm, horses, sports, church groups, and all other typical components of that dream. One day though their terrific teenage son Eric \"Hoovey\" Elliott collapses and is rushed to the hospital, where doctors find a tumor as big as an orange in his brain. This life threatening operation renders Hoovey short of many key capabilities, yet what keeps him going is the faith he has in God not the power of will that would normally be available both for religious and non religious ones","user":"lamr","rank":[11,27]}]