[{"title":"SMOKIN'","rating":6,"date":"11 October 2019","review":"Best catch this movie before it disappears, whoops, too late. Here's what you missed. Buried somewhere In the ever expanding James Franco universe - seems this was made back in 2016 - The Pretenders, or Pretenders not only has a flippy-floppy title but a plot that does likewise.<br><br>What starts out as an interesting ode to new wave French cinema, forming a soft-focused love triangle full of fresh faced hope, aspiring arteests, and constant chain smoking, devolves into a bit of a mess. Too bad, cuz the first course is quite yummy. As aspiring filmmaker Terry (Jack Kilmer, son of Val, inheritor of stoic face and acting skill) falls for an Anna Karina lookalike in the theatre crowd whilst watching, wait for it, Anna Karina on the big screen. They meet over smokes (natch), but poor Terry needs some nudging and prodding from his Casanova photographer pal Phil to get to first base. You know where this is going, but do you?<br><br>Bed hopping ensues, feelings are viciously attacked, confusion prevails, time passes (though no one ages - natch), and just when everything seems to be coming full circle for the boffo ending, we find a red herring swimming in the soup.<br><br>Shame, cuz the lead up is quite good, and anyone fond of the French will surely be pleased with themselves pointing out the stream of referential material, but is it enough when the clumsy wrap dethrones all that throning? Probably not. Still worth it for breakout star Jane Levy as the mysterious object d'amour, and the puzzling and super short appearance by wizened Dennis Quaid as the grumpy dad, which makes absolutely no sense at all, but there it is. Bet there's several alternate endings on the upcoming DVD version.","user":"js-66130","rank":[10,14]},{"title":"Surprisingly good","rating":12,"date":"12 November 2019","review":"James Franco has been in a lot of indie films of dubious quality, so I had little expectations before I watched it. And I have to say this film far exceeded by expectations. I can actually say that it is a good film.<br><br>The story is good, as it makes viewers think just why the film is called \"The Pretenders\". Just as I thought I figured it out, there is a twist that really surprises me. Then there's another twist. Wow.<br><br>Try to watch it if you can find it.","user":"Gordon-11","rank":[5,7]},{"title":"Can't stand James Franco as an actor, but this is pretty good","rating":8,"date":"28 December 2019","review":"No superheroes or explosions in this film, just a solid film. The first hour is 9/10, but the last half hour I felt was rushed and didn't keep my attention as much as the first hour. When I saw the box cover for this film, I kept thinking what a jekr-off Franco is but to humor myself, I decided to see how Franco's vision works and found it was a pretty good movie. I can be honest, unlike others when they can't stand someone. he's in this movie and as soon as i saw him i wanted to punch him in his head, but his character wasn't in it long, so it the film wasn't affected negatively at all.<br><br>7.5/10 (rounded to 8)","user":"EveAngel-666","rank":[2,2]}]