[{"title":"A Calm and Relaxing Watch","rating":9,"date":"15 September 2018","review":"When have you ever been able to sit back and watch a man commit a crime with a smile on his face and not even feel remotely bad for the people he is victimizing? Personally, I always watch heist movies and feel bad for the victims, regardless of how truly endangered they are. If your leading man or lady has good intentions, then it becomes easier to watch, but I've never quite had an experience like The Old Man and the Gun before. This is a film that takes its time telling the story at hand and there's hardly ever an exciting moment, but it never feels like it drags. This is (surprisingly) a true story that I believe everyone will get a kick out of and here's why.<br><br>Following Forrest Tucker (Robert Redford) after he has escaped from prison, The Old Man and the Gun is really just about a man who doesn't have many years left in his life and simply wishes to do what makes him happy. Robbing banks in the most polite way that he possibly can, without ever harming anyone, and pretty much always getting away with it, the character of Forrest is absolutely perfect for the way this film portrays him. Whether he's in a high-speed chase to the sound of a calm country song or sitting in a diner with a woman whom he's trying to form a connection with, this is truly one of the most relaxing experiences I think I've ever had at the movies in quite some time.<br><br>Robert Redford has always been a likable screen presence. Since his early days in movies like Butch Cassidy and the Sundance Kid to even small roles in films like Pete's Dragon today, he has always had the charisma to charm his audience. This may very well be his final performance and if that's really the case, I believe he has gone out on a very high note. I don't believe this film isn't going to win any awards or really be nominated for all that much, but in terms of purely enjoying a character on-screen, The Old Man and the Gun delivers on everything you'd expect, and then some.<br><br>Yes, as I said, this is a very calm film, so what's a calm experience without the much-needed elements. For a movie like this, you'd expect a slow score and music that will put you at ease, along with some solid comedy in the moments where he may be going a little too far for his particular characteristics. The film provides all of that and more. There were moments where I felt he was about to go out of character, but then the film either came up with a joke to make you feel comfortable about his choices or played a country song that was so on the nose that it makes you laugh. For as slow as this film is, it never once had me checking my watch. This 90-minute film flies by, even with its slow pace.<br><br>In the end, The Old Man and the Gun is the type of film that's very hard to find a complaint about. It has a specific direction and it sticks with it throughout its entire duration. It's about a wanted gentleman who goes under the radar and robs banks, finds love and is continuously hunted by the police (namely a cop played by Casey Affleck, who is also extremely enjoyable in the movie). Look, if you're looking for a complex cops and robbers story, then I would look elsewhere, but if you just want to relax at the movies and have a good time, this is the perfect film for exactly that. The Old Man and the Gun comes highly recommended from me.","user":"kjproulx","rank":[162,213]},{"title":"Interesting true story, but lacklustre execution","rating":5,"date":"13 November 2018","review":"'The Old Man &amp; The Gun' is Robert Redford's final acting role. It's not quite a fitting finale - he's great as Forrest Tucker, the aging bank robber, but the overall film fall's a little flat. Based on a true story, most of his exciting adventures and prison breaks are glossed over, in favour of him finding late-life love with (Spacek). He can't curb his compulsion to rob banks however, and it assisted by Teddy (Glover) &amp; Waller (Waits), but underutilised.<br><br>Detective Hunt (Affleck) is the Texas cop out to catch him - we also spend unnecessary amounts of time with his home-life. The chemistry between Redford and Spacek is good, and he's still as charming as ever. Affleck plays an exhausted cop as almost too dreary. Instead of seeing any heist planning or prison breaks (besides a montage), we instead get Redford and Spacek talking in a diner, walking, or making tea.<br><br>Thankfully, it's a quick 90min film, but the pacing and action could've been much better. Tehre's some chuckles, but nothing hilarious. You're better off re-watching 'The Sting'!","user":"gavinp9","rank":[75,103]},{"title":"A well-made, old-fashioned yarn, but the laid-back ballad-like tone will be too insubstantial for some","rating":7,"date":"27 December 2018","review":"Of all the young American writer/directors to break through in the last few years, for me, <a href=\"/name/nm2158772/\">Jeff Nichols</a> and <a href=\"/name/nm1108007/\">David Lowery</a> stand tall; in particular, Nichols's <a href=\"/title/tt1675192/\">Take Shelter (2011)</a>, and Lowery's <a href=\"/title/tt2388637/\">Ain't Them Bodies Saints (2013)</a> and the existential masterpiece that was <a href=\"/title/tt6265828/\">A Ghost Story (2017)</a>. Both filmmakers are five-for-five thus far, with even Lowery's mainstream Disney remake, <a href=\"/title/tt2788732/\">Pete's Dragon (2016)</a>, managing to impress in all sorts of ways I wasn't expecting. Apart from being enjoyable in its own right, it also showed us that Lowery is as comfortable making personal small-scale character dramas as he is big-budget special effects blockbusters. With The Old Man &amp; the Gun, he stands somewhere between - it's not as intimate as <a href=\"/title/tt1124058/\">St. Nick (2009)</a>, Ain't Them Bodies Saints, or A Ghost Story, but neither is it as mainstream as Pete's Dragon. Originally touted as <a href=\"/name/nm0000602/\">Robert Redford</a>'s final performance, although he has walked that claim back somewhat, The Old Man &amp; the Gun is a laid-back ballad-like elegy to both the character Redford is playing and to Redford himself. Filmed in the style of a 1970's indie, Old Man is so tied to Redford as a performer as to be virtually self-referential. In short, if you're not a fan of the actor, you will get absolutely nothing from this film.<br><br>Telling the \"mostly true\" story of Forrest Tucker, Lowery's script is based primarily on David Grann's 2003 New Yorker article of the same name. By the time of the article, the 83-year-old Tucker, who had been robbing banks since his early 20s, had amassed at least 80 successful jobs and escaped from prison 18 times. Usually described by the tellers from whom he stole as \"gentlemanly\" and \"charming\", his M.O. never changed - he would walk into a bank and ask if he could open an account. When asked what kind, he would pull back his coat, showing his gun (which was often unloaded, and which he never fired), assure the teller that he didn't want any trouble, and quietly talk them through the process of emptying their till. He would then wish them the best, tell them they'd done well, and walk out. The story takes place in 1981, when Tucker was 61 (although in the film, he's 76), and had recently escaped from San Quentin. Meeting a widow named Jewel (<a href=\"/name/nm0000651/\">Sissy Spacek</a>), after pulling off a job, they strike up a tentative romance. Meanwhile, he is pursued by Det. John Hunt (<a href=\"/name/nm0000729/\">Casey Affleck</a>), who is starting to respect him more and more.<br><br>The first thing you'll notice about Old Man is its pace, which is measured, to say the least. Ostensibly, this is a heist film, but the crime narrative is very much secondary to tone and character beats. Lowery is relatively uninterested in excitement, suspense, plot twists, or any of the usual generic tropes. Instead, approaching the material casually, he focuses on a year of Tucker's life, with a tone as mellow as a film can be; rather than a shot of absinthe, it's a fine Irish malt drunk at a fireplace. Indeed, even within this structure, there's not a huge amount of character development, nor is there much of a dramatic arc. And that's not a criticism. Rather, the meditative, quasi-somnolent pace is very much one of the film's charms. Additionally, Lowery almost completely ignores what, for many, would be the most interesting part of Tucker's story - his 18 escapes. Instead, he puts them all together into one superb montage.<br><br>However, for all that, Lowery's primary goal is to create an ode to an icon, and that icon is Robert Redford. Tucker's story is a vehicle which Lowery uses to celebrate Redford; the character is always there, but he exists behind the actor, rather than the other way around. The audience is never allowed to forget that this is Robert Redford on screen, to the point where the performance is self-referential. Indeed, during the escape montage, there's even a clip of Redford from another film, <a href=\"/title/tt0060232/\">The Chase (1966)</a>. There's an obvious correlation between Tucker and Redford of which Lowery wants the audience to be very aware - they are both elderly, and still doing what they do best, reluctant to stop. We can never look past the fact that Tucker is played by Redford, and for the most part, Redford is playing Redford, with the film existing in large part only because it explicitly leans on his back catalogue and real-life legacy. Essentially, the whole thing is an extended metatextual allegory for Redford's own impending retirement, not to mention his reluctance to let go.<br><br>As one would expect from Lowery, aesthetically, the film is fascinating. Lowery is very unusual in the sense that, thus far, he has never used the same cinematographer twice. Here, he uses <a href=\"/name/nm2208050/\">Joe Anderson</a>, whose cinematography is extremely unique, with the celluloid having a gritty, grainy quality, almost as if it were an amateur project. This is because Lowery shot on Super 16, doing so because he wanted it to look like it had been made in the period in which it was set. This is in direct contrast to, say, how <a href=\"/name/nm0000520/\">Michael Mann</a> shot <a href=\"/title/tt1152836/\">Public Enemies (2009)</a>, with the use of fast, seemingly anachronistic, digital photography creating a sense that what was happening on screen wasn't necessarily taking place in the past, but could easily have been taking place right now. Lowery, in contrast, tries to suture the viewer into the past milieu.<br><br>Another important aesthetic point is how much Lowery has obviously been influenced by Michael Mann, to whom there are several homages - a scene in a diner recalls a similarly shot scene between <a href=\"/name/nm0001001/\">James Caan</a> and <a href=\"/name/nm0001839/\">Tuesday Weld</a> in <a href=\"/title/tt0083190/\">Thief (1981)</a>; the scene in the toilet where Hunt approaches Tucker is an obvious nod to <a href=\"/name/nm0000199/\">Al Pacino</a> confronting <a href=\"/name/nm0000134/\">Robert De Niro</a> in <a href=\"/title/tt0113277/\">Heat (1995)</a>; and the scene of Tucker gaining inspiration whilst sitting in a cinema recalls a scene where Dillinger (<a href=\"/name/nm0000136/\">Johnny Depp</a>) does the same thing in Public Enemies.<br><br>In terms of problems, there are a few. For many, the film will depend far too much on Redford, specifically the self-referential allusions to his career and legacy. If you're not a fan of his, you will get zero from this, absolutely nothing. Similarly, if you aren't familiar with at least some of his previous work, and his status in Hollywood, the whole thing will probably seem inconsequential. Another problem I have concerns Affleck. I know he's a celebrated actor and so forth, but for me, he plays himself in every single movie. There is virtually nothing to distinguish Hunt from Robert Ford in <a href=\"/title/tt0443680/\">The Assassination of Jesse James by the Coward Robert Ford (2007)</a> or Les Chandler from <a href=\"/title/tt4034228/\">Manchester by the Sea (2016)</a>, or either of his performances in previous Lowery films. Every performance he gives, he plays a character with the weight of the world on his shoulders, shuffling around, speaking in a low-key hang-dog voice, reluctant to make eye contact, shifting on his feet.<br><br>Lowery also has a strange habit of introducing themes which seem to be setting something up, only to completely abandon them without any kind of engagement. This is most obvious in relation to Hunt's inter-racial marriage to Maureen (<a href=\"/name/nm1754366/\">Tika Sumpter</a>) and their two mixed-race children. This is a fictional element added by Lowery, so one assumes there was some thought behind it. But this is Texas in 1981; there wouldn't have been a huge amount of mixed marriages. Yet Lowery seems to portray it as if it's the most normal thing in the world. Indeed, for the wife and children, life is fairly idyllic, with not a hint of any kind of societal disapproval. Why would you introduce a mixed-race marriage into this milieu without commenting on it?<br><br>These issues aside, however, The Old Man &amp; the Gun is a fine film. As much about Robert Redford as it is Forrest Tucker, although that won't appeal to everyone, there is much to praise. Made in a key so low, it's practically subterranean, Lowery hinges everything on Redford's presence, and, for the most part, it works well. There's little in here to get overly excited about, but neither is there much to criticise. Yes, the film is somewhat insubstantial, and there's virtually nothing here beyond the Redford/Tucker character, but it's still beautifully made, and, honestly, there's nothing wrong with spending 93 minutes hanging out with Redford, whether he's playing Forrest Tucker or Robert Redford. Whether or not this is actually his last performance remains to be seen, but if it is, it's as fine a send-off as any Hollywood icon could hope for.","user":"Bertaut","rank":[53,73]}]