[{"title":"A win!","rating":8,"date":"21 June 2014","review":"I wasn't expecting much, but this came as a pleasant surprise! The editing uses flashbacks in between rounds to tell the motivations that drive the two fighters, revealing their personal dramas little by little.<br><br>This helps to keep you interested on the movie, and ultimately on the outcome of the fight.<br><br>It also works because there's no 'villain' on the ring - both characters have good reasons to be on this match, and it's difficult to root just for one of them (though for me Dominic Purcell has a slight edge, if anything for being older).","user":"teoalcantara","rank":[13,14]},{"title":"Pretty Good","rating":8,"date":"21 June 2014","review":"The movie is all about human life and their stories. I wasn't really expecting what I watched but I really liked it.<br><br>Unlike an usual movie, it starts with the action. So, you are not really sure what the characters are... I mean, you don't really like or dislike anyone yet even though the stories is already happening. So they keep crossing characters life over and over again in a pretty interesting way.<br><br>What I really like about fighters movies is that we are all fighters in our life... we fight for our friends, our family, ourself. We need to overcome our challenges, be ready to \"take a punch\" from life and don't never give up. In the end, life is more about how much you can take and keep going than how hard you can punch. It is just and simple human stories... human life.<br><br>I understand why not everyone will love this movie, but I had a really good time watching it!","user":"roliveira83","rank":[13,14]},{"title":"I wasn't expecting something this good. I really enjoyed this. I actually liked it more then The Fighter. I say A-","rating":8,"date":"13 June 2014","review":"\"The best we can do is to forgive ourselves.\" Sailor O'Connor (Purcell) is an aging fighter with a past that won't let him go. He is trying to move on when he is approached by a local promoter for one last fight. After agreeing for the biggest payday he's ever had he tells his mother and old trainer, neither of whom is happy about it. His opponent is an up and coming young kid with a past he is also trying to change. Together they fight not only each other but the past they can't forget. As many of you know I am a huge fan of sports movies. Being a lower budget one that not many people have heard of I wasn't expecting too much from this. I'm not sure if that had any effect on my feelings toward this but I really really enjoyed it. Every other boxing movie I have seen tells the story of the characters then ends with the fight. This one switches between the fighting and the story which I really enjoyed. You see some punches then part of the fighters life which segues beautifully into the break in between rounds. That gives extra meaning to the rest period. I could go on and on about this but I'll end by saying I highly recommend this. Overall, not sure if it was because I wasn't expecting something this good but I really enjoyed this. I actually liked it more then The Fighter. I give this an A-.","user":"cosmo_tiger","rank":[11,13]}]