[{"title":"Macbeth","rating":8,"date":"13 February 2020","review":"William Shakespeare's famous tragedy is brought to the screen on a large scale. Full of his intricate and unique style of writing, this play focuses on Macbeth.\n....\nWhat I did not expect to see is that the landscape of Scotland becomes not just the scenery background but one of the main storytelling streams. One sees too many modern adaptations of Japanese interpretation of Macbeth that one seems to forget where the story came from in the first place. Truly magnificent cinematography in this version of Macbeth and it really lives up to bloodbath on the battlefields as stated in the Bard' s words. One of the best movies in 2015","user":"MR_Heraclius","rank":[38,40]},{"title":"Gripping, Intense, Beautifully shot, with Unforgettable Performances","rating":9,"date":"14 October 2015","review":"HAIL MACBETH, HAIL MACBETH, HAIL MACBETH.<br><br>WOW, that was a gripping, intense, beautifully shot film with unforgettable performances and has to be the best retellings of not only 'Macbeth' but all of Shakespeare's plays on screen. This movie did an incredibly amazing job at sticking to the source material whilst also incorporating a visually stunning cinematic style. It has a very interesting cinematic style using slow motion effects and sped up film in order to capture the emotions that the characters are feeling at every moment. I was in awe at how beautiful this film was, the wide shots of the landscapes were incredible whether there was something going on or nothing at all. And i don't know where the cgi in this film was if there was much at all because it all looks so incredibly real and grand and it only adds to the scope of the film. The movie's amazing cinematography is accompanied by many amazing performances including two of the best performances this year. <br><br>Sean Harris and David Thewlis were standouts in their supporting roles as Macduff and Duncan and really displayed some of their best performances but the show was stolen by the two leads. Michael Fassbender and Marion Cotillard as Macbeth and Lady Macbeth were absolutely mind- blowing and amazing and encapsulated these characters as perfectly as you could get. They did incredible jobs at playing these extremely complex personalities and led me to see only Macbeth and Lady Macbeth, forgetting their previous roles. They pull of their monologues so well that you are fully engaged in what they are saying and can see that what they are feeling is not only expressed through what they are saying but just from the expressions on their faces. And Lady Macbeth's most iconic scene/monologue was represented so perfectly that it was one of the best and most gripping scenes in the film. The Oscar race is heating up and Fassbender and Cotillard have to be the front-runners for Best Actor and Actress, truly amazing. <br><br>Having read the play a little while ago i was able to still recall many of the key events and know mostly what was coming up next. So hearing plenty of familiar lines from the play and seeing these scenes was incredibly rewarding. And reading the play i feel helped to follow along with what is happening at all times. But for someone unfamiliar with the story of Macbeth i think it might be a little hard to follow at times. This is definitely not a film where you can look away for even a minute and still know what is going on. If you miss a few lines of dialogue or zone out during a scene, when you zone back into the film you will probably be lost. The Shakespearean dialogue is probably going to be a barrier for people to understand and if you can't understand that dialogue you really won't like this film. But as i was saying i felt that if i hadn't read the play i would have been quite lost during the film. If you aren't paying careful attention and reading into even the most subtle of hints some scenes will seem random and you'll have no idea what is going on. So i think this is definitely not for general audiences who just want to relax and check out a film, it requires a fair amount of attention. <br><br>So in the end, it is beautifully shot, intense, extremely well acted and a great adaptation of this incredible play. Maybe not for the general audience but any fans of the source material or lovers of film should love this movie. - 8.6/10","user":"stephendaxter","rank":[82,113]},{"title":"Mumbles And Mumbles","rating":5,"date":"15 December 2015","review":"Well it was certainly very artistic and certain parts were just gorgeous. However there is not much more to recommend Macbeth. The worst part to me was how the dialogue was spoken, or not spoken since it was mostly whispers and mumbles. Just mumbles and mumbles. Shakespeare's prose just begs to be enjoyed but here I couldn't understand what they were saying half the time.<br><br>Also they seemed to have no idea what to do with the talking parts and just tried to invent weird action scenes to go with them that felt out of place. Too theatrical is how I would describe this film. It tries to be realistic and set in historical times, but it just makes the theatrical stick out more in awkward ways.<br><br>Performance wise there is nothing to complain about as everyone did a great job. Overall there are sparks of brilliance here but I just get the feeling that the makers gave up before reaching the goal and the final product is hence mediocre.","user":"AliceofX","rank":[166,238]}]