[{"title":"Something Beautiful","rating":10,"date":"13 July 2014","review":"I was a backer of this movie on Kickstarter that got a online viewing. Zach Braff has created a beautiful movie, something realistic that many can relate to. I have no idea why people would give this such a low rating, even if it's not your cup of tea you can not deny the movie of what it deserves, it is a great film.<br><br>I laughed and I cried. Wish I Was Here touched me on such a emotional level mainly because I had to watch my Father die of cancer like so many people in this world have had to. And I could relate to the character Noah (Josh Gad) that played Zachs brother in the film.<br><br>The performances were great, especially by Mandy Patinkin who just BLEW me away. His acting class. The depth of each of the characters in this movie was amazing, and this is the reason why so many people should be able to relate to at least one of the characters.<br><br>I'm not much of a writer, nor am I a reviewer, in fact this is my first ever on IMDb, but I felt compelled to write about it to help give this movie the respect it deserves. So glad I invested in this movie and helped make it happen. If you are looking for something that will tug at your heart but also make you laugh, then go and see it if you get a chance, you won't regret it. Will be watching it again as soon as I can.","user":"Kuuzzz","rank":[124,172]},{"title":"Another Winning Film From Zach Braff","rating":9,"date":"21 July 2014","review":"In my opinion, the critics have it all wrong with this film.<br><br>\"Wish I Was Here\" from director and writer Zach Braff (\"Garden State\") is another terrific film that deals with real life issues that most can relate to. Not only does Braff's direction capture Southern California and human emotion quite well, his screenplay is witty, smart and deep.<br><br>To top it off, Zach Braff's performance as a 35-year-old father, husband and struggling actor is terrific. He works well with his supporting cast including Kate Hudson, in her best performance in a long time, Mandy Patinkin, Joey King and Josh Gad. <br><br>If you are looking for a film about self discovery topped with comedy and deep human emotions, then give \"Wish I Was Here\" a try and ignore the critics. This may be one of my favorite films of the year.","user":"mjnicoski-59-517764","rank":[67,94]},{"title":"A surprisingly deep and poignant movie with a lot of heart.","rating":18,"date":"18 October 2014","review":"Don't listen to the critics. Zach Braff's new movie is actually very good with a lot of heart and emotion to it. In some ways, it surpasses Braff's other movie Garden State. You can tell this is a movie that he wanted to make for a long time. Whilst Garden state was a more autobiographical movie, this is more of Braff making you go on an experience . It somewhat reminds me of Lost in translation. There's not really a plot of kinds but is like going on some sort of experience. It's really about the relationship between the character of Aidan Bloom (Braff) and his family and not much else. Also, like Lost in Translation it has many comic moments due to the comedic talent of its two main stars. Throw in some entertaining cameos from Braff's Scrubs co star Donald Faison and Jim Parsons and you have a well rounded movie. If there's one \"indie\" film you have to see this year, go see Wish I was here. By the end of it, you'll be glad you were there.","user":"ollie1939-97-957994","rank":[39,57]}]