[{"title":"Awful. Cheap. Stupid.","rating":1,"date":"12 March 2015","review":"Great thing about IMDb is that users can submit reviews. Bad thing is that people directly involved with the film also get to submit reviews. I wonder why anyone involved would want you to see this. It's an embarrassment. So here's the real review. First off, I love prison flicks, I love Australian movies and there are some awesome Australian prison flicks. This is not one of them. The actors are amateurish and wooden. The cinematography is cheap looking. The script is idiotic. A plot is a series of connected events that logically progress to tell a story. This film has a situation instead of a plot. A situation can be fully portrayed in about 2 minutes. That makes this nonsense about 90 minutes too long. Bad directing, bad script , bad acting - it's a complete waste of time.","user":"flikey","rank":[18,29]},{"title":"Great prison flick","rating":9,"date":"17 November 2014","review":"I really enjoyed this movie. A man goes to prison for accidentally killing someone and has a very tough time in the clink due to the warden receiving a bribe to make it so. <br><br>As with most films there are plot holes. Firstly, as it was self defence due to managing to avoid a knife attack he should never have gone to prison in the first place. Next, the warden could have blamed the guards death on him instead of some other inmate.<br><br>Putting those things aside I really liked the fight scenes and the way Ray deals with gang politics. All the things you want to say and do in real life would be suicide but Ray steps up and if he wasn't released would definitely be a gang leader like it or not. Its a prison film so you see a fair amount of gory violent scenes where inmates are murdered. which in itself makes you never want to be in a place like that. Loved it.","user":"boc321","rank":[16,26]},{"title":"Wow.. Just watched this gem, and I can assure it is extremely underrated !","rating":10,"date":"8 February 2015","review":"As soon as I was done watching, I immediately felt like writing a review. Which is something I quite rarely do. <br><br>I think some of the reviews it's gotten so far are quite unrealistic. <br><br>I've watched tons of prison movies. This is by far one of the best I've ever seen! <br><br>Don't wanna give anything away, but I will say I enjoyed every minute of it. I couldn't recommend this more if you're into prison films! <br><br>I can't possibly understand why it has such a low rating. I mean, the acting + story was spot on! With visuals also on point, how can you complain?<br><br>Was shocked when reading through reviews with people complaining about there not being anything new here, and here I was, being surprised at every turn of the movie! <br><br>This is quite the gem of a prison movie! It even has a pretty decent emotional aspect! Giving it a 10/10 because this deserves well over 8 in my opinion!","user":"ganjafor420","rank":[13,25]}]