[{"title":"Reality is boring when compared to this band.","rating":8,"date":"16 March 2017","review":"Making a documentary about a subject that is intentionally and carefully shrouded in mystery (and sometimes mythology) is not an easy task, but it can be done -- the excellent and quite scary 'Jandek on Corwood' from 2003 is an example.<br><br>The Residents are one of America's greatest ever pop bands (seriously!), spanning over four decades of work and succeeding in creating interesting and unconventional avant-garde pop concept albums over and over again throughout the period, from pseudo-ethnographic field recordings of Eskimos to perceptions of human life through the eyes of different animals.<br><br>They are also completely anonymous: we don't know their names (besides the occasional offerings of nicknames like 'Mr. Skull' or 'Randy', 'Chuck' and 'Bob') or anything about their personal lives. Of course, to any big fan of the band (of which I am certainly one), we really do know who the members of the Residents are; and for anyone new to the band that watches this documentary, it won't take a genius-level IQ to work it out either.<br><br>But who the members of the band really are just isn't the point -- the Residents is a concept, a creation, they aren't a group of personalities or celebrities, they're an artistic idea, a rejection of the convention of fame and ego in rock 'n' roll, and this film seeks to highlight this.<br><br>'Theory of Obscurity' is a talking heads-style documentary with input from some of their famous fans, like Matt Groening, Penn Jillette, Les Claypool and members of Ween and Devo. There's a lot of the history of the band that isn't touched upon or is mentioned only briefly, but considering the band's four decades of creativity this was inevitable.<br><br>There is some fascinating, extremely early footage of the Residents featured (before they even had their band name or recorded an album), from when they first moved to San Francisco and would hijack their peers' hippie performances with Dada free-jazz pop nonsense. This is contrasted next to footage from the 'Wonder of Weird' 40th anniversary world tour, the band now a collection of wizened old pros, yet still full of mischievousness and aiming to subvert.<br><br>Your interest in alternative/experimental rock and weirdo art will decide your enjoyment of this film, but it's a well-crafted and loving piece of work that features the input of Homer Flynn and Hardy Fox. What they give us here is the most information we are ever likely to get about the history of the Residents, and for most of us, that's enough -- the music speaks louder than whatever the reality is. Reality is boring when compared to this band.","user":"sunheadbowed","rank":[8,8]},{"title":"The Eye! THE EYE!","rating":7,"date":"13 May 2017","review":"A well-made documentary about 'The Residents'. Contains fantastic footage, high caliber interviews and just the right sense of humor. Those who are looking for an expose will be disappointed (though I feel like you can draw some reasonably intelligent conclusions if you're looking), this is really more of a love letter to the band, or perhaps even a great introduction.<br><br>The Residents can be hard to stomach sometimes, and even then I've found a lot of their digital work hasn't aged terribly well, but Hardy does a great job of editing down and keeping the pace up and interest/energy high.","user":"ginmillcowboy","rank":[4,5]},{"title":"Turned me on to the band","rating":8,"date":"8 February 2019","review":"Awesome documentary- really well done, regardless of what the subject matter is. Just a quality film. It happens that while I've been in the know of many great bands before my time on Earth (I was born in the 80's) and a big fan of bands that are directly influenced by the Residents (Primus), I have never knowingly heard their music until watching this documentary. It has since spun me into YouTube concert footage binging, and reading about their history and listening to some of their more well-received records from the late 70's. Something that I thought was really fascinating was that the band members are interviewed throughout the documentary, but older now and under the pretense that they are just old associates/friends of the band. A documentary so focused on the anonymity of the band members, meanwhile they constantly appear onscreen discussing their history in third person, as if they were just observers who were close to the group. So cool.","user":"umimelectric","rank":[1,1]}]