[{"title":"Take this on.","rating":8,"date":"15 April 2020","review":"Watch this now - FALSE COLORS deserves a broad audience. Considering the current state of global-affairs and recent revelations of the Deep State cabal, this movie is political grist to chew on and digest. Impressive production value for an indie film, solid acting, and clearly William Norton is a writer/director to be watched.","user":"donzerly-1","rank":[2,2]},{"title":"Amazing Indi film!","rating":9,"date":"15 April 2020","review":"I read about how this film was made and was really amazed by what they accomplished! The story was compelling and really kept moving. Amazing production value for an indi film.","user":"jamesmlyons","rank":[1,1]},{"title":"An indie of epic scope","rating":10,"date":"14 April 2020","review":"All good movie reviews must take into account how a movie was made, preventing smaller efforts from being overlooked, and thus avoiding total domination of the industry by deep pocketed studio fare. A $200 million dollar major studio production shouldn't be judged against a true independent film relying on boundless resourcefulness rather than unlimited resources. This debut feature from writer / director William Norton is one such film whose indie roots should be understood. Considering its reportedly minuscule budget, this film succeeds in delivering a fascinating story of epic scope. Instead of relying on the finances of multiple funding partners, False Colors uses ingenuity to achieve its goals. It will be an inspiration to anyone who has ever dreamed of making an independent feature that would be enjoyed around the World.\nThe story, centering around the discovery of a biological weapon of 'mysterious origin' in Iraq in 2003, is easily related to the events which have recently and dramatically changed the face of civilization across the globe with the outbreak of Covid-19. The movie can be seen as a cautionary tale or one possible version of reality today, depending upon one's willingness to explore deeper than front page news headlines. False Colors is a film that carries the torch of the earlier political thrillers by the likes of Pakula and Pollack while keeping current with elements reminiscent of The Bourne series, Enemy of the State and Jack Ryan to name a few. This film deserves to be seen.","user":"d416","rank":[1,1]}]