[{"title":"Pointless...","rating":2,"date":"8 June 2018","review":"\"Cowboy Zombies\" (aka \"Walking Dead in the West\") is a zombie movie, and that is reason enough for me to sit down and watch it. Which I did. Which I now regret, because that is about an hour and a half of my life that was flushed straight down the drain. Sure, I had my expectations about this movie being another one of those awful low budget zombie movies. And it was. In every sense of the meaning.<br><br>The storyline here in the movie was quiet simple to grasp and easy to follow. However, it was just a bit too simplistic. And it didn't help to further the movie in any way that the character gallery was every bit as mundane and pointless as the rest of the movie. That just meant that you didn't invest anything in the characters and as they died off you barely even flinched.<br><br>The zombie make-up in the movie was low budget. You know what I am talking about. The type where they just threw on some grey powder on the face and a few fake cuts and bruises, and forgot about the rest of the body. Yeah, that is just an awful thing to put in a zombie movie. When you make a zombie movie, you have to go all in on the make-up and special effects. This kind of horrible zombie make-up is not even up to a level where it is laughable. It is just downright sad.<br><br>I managed to endure to the bitter end of \"Cowboy Zombies\", but to no avail, because the movie never improved for the better. And I must admit that more then often were my attention elsewhere. This movie does not make for a memorable addition to the zombie genre.","user":"paul_haakonsen","rank":[3,3]},{"title":"He's coming back to life! Arrgh. Arf! Arf!","rating":2,"date":"16 October 2017","review":"A man who claims he didn't commit all the crimes he is accused of, is hung. But before that happens he asks God for a sign of his innocence which causes a lightning bolt...but he is hung anyway. The next thing you know there is a zombie apocalypse. The cause and effect needed some work.<br><br>A group of people of the town of Crumpit, Arizona (April 1876) hold up in the Double Peach Saloon (one without swinging doors and modern hinges) and that is it for much of the film which includes a boring Marshal monologue from director Paul Walker. Apparently no one had else could read lines better. The acting was horrible. The zombies made noise from a barking to a pirate aargh. The dialogue was boring and they insisted on having quiet sit down scenes. Sam Keller who played Deputy Clem bordered on camp in his performance and made me wonder if this was supposed to be a comedy. The opening gun fight needed choreography. I don't know why the bad guy stands there holding a gun, watching the sheriff kill the whole gang before he starts to fire, and then miss on multiple occasions from 10 feet away.<br><br>Guide: No swearing, sex, or nudity","user":"nogodnomasters","rank":[3,3]},{"title":"Horrible Rip Off Of A Movie","rating":1,"date":"1 August 2015","review":"Why don't you come up with your own idea for your home video, school project of a (movie) instead of ripping people off! The Dead and the Damned was the FIRST ever Zombie Western.... Don't forget it! This one is a JOKE! Give It Up!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I can not believe that the director would do such crap and not be embarrassed to put his name on it...... If you have the choice of watching this movie or shooting yourself in the face.................... Buy a gun! Please people, spend a little time, use your imagination, read some books, do some drugs......whatever.......but please come up with one original thought.","user":"beggknives","rank":[7,17]}]