[{"title":"One Of The Funniest And Most Violent Action Films In Years","rating":10,"date":"26 December 2014","review":"I'm going to be honest about this: I like unabashedly violent action films. I'm 42 years old, I'm from Texas and I can take it. Growing up with films like 'Rambo', 'Die Hard', 'The Terminator' and 'Robocop', I can't stand that watered-down \"no-blood-no-swearing\" gutless kiddie fare that is being served as \"action\" these days. I know the real thing when I see it - we used to see it all the time back in the day - and I hardly ever see it anymore.<br><br>Which brings me to this movie. 'Kingsman: The Secret Service' was being shown just around the corner from where I live, and because I loved two of director Matthew Vaughn's previous films, 'Layer Cake' and 'Kick-Ass', I naturally took the chance to see it. I had already read some comments from previous screenings that this film was totally bad-ass, and I can now say that's actually putting it mildly. This film is nothing short of bat-shît crazy.<br><br>Years ago Tarantino said in an interview that he had written a James Bond script and that he would love to direct a Bond film. Sadly, that never happened, but ever since I read that I wondered what an R-rated Bond might be like. I don't know, maybe Matthew Vaughn has read that interview too and saw the potential, because 'Kingsman' is pretty much that: An ultra violent, funny, crazy, foul-mouthed James Bond film (with a little bit of 'Men in Black' and 'Mission Impossible' thrown in). You could say that this is to Bond what 'Game of Thrones' is to 'Lord of the Rings': Where the former can't and dare not go (for marketing and box office reasons), the latter joyfully and gloriously ventures. Dirty and (very black) humor - check. Bad language - check. Gratuitous violence - check. Needless to say, I was thrilled.<br><br>But it's also a fantastic action film with an amazing cast (Oscar winners Colin Firth and Michael Caine, plus Sam Jackson AND Mark Hamill) and spectacular, over-the-top fight-scenes that in some instances even rival films like 'The Raid' for their sheer visceral intensity. In short, if you're as fed up with lame wannabe Die-Hards and Terminators as I am, go watch this film. Apart from the rare 'John Wick' or 'Equalizer', 'Kingsman' seems to be pretty much the only antidote to the toothless, generic tripe Hollywood tries to pass for action these days. 9 stars for the film and the story, 11 stars for the balls to pull this off the way they did. Average = a perfect 10.<br><br>EDIT:<br><br>P.S. I recently stumbled upon an article on the importance of R rated movies. If you're a film fan (especially of films that don't cater to teenagers), you might find it as enlightening as I have:<br><br>www.the-fanboy-perspective.com/the-importance-of-the-r-rating.html","user":"bloodnguts29","rank":[667,915]},{"title":"Quintessentially British, Hilariously Funny, Brutally Violent","rating":24,"date":"24 February 2015","review":"Stylish, brutal and hilarious. 'Kingsman' is an extremely quintessentially British flick full of over-the-top yet hilarious comedy, brutal violence and a quirky image of England. Since James Bond's debut in 1962, a number of films have attempted to reinvent the genre, with films like 'Johnny English', 'Get Smart', 'This Means War' and many more, however, none have come close to displaying the perfect blend like 'Kingsman' has. Matthew Vaughn has become renowned for taking on action-comedy projects, for instance 'Kick-Ass' (which is still stronger than this but only just), and along the way has kept that feel-good British aspect to it that makes our greatest secret agent (James Bond) such an icon. All-in-all 'Kingsman' is a brilliant, well-executed film.","user":"CalRhys","rank":[300,443]},{"title":"Crazy, over-the-top ultra violent fun!!!","rating":10,"date":"22 December 2014","review":"I just came back from a pre-screening of 'Kingsman' and let me tell you: if you liked the first Kick-Ass, you are going to LOOOVE this film! I would never have thought that a stiff Brit like Colin Firth could pull off action - but boy, does he whoop ass in this one. I thought the story was rather original (don't know the Comic), it's a bit like an ultra violent James Bond parody. Or better: a crossbreed of Bond and Kick-Ass. Finally an action movie that doesn't use kiddie-gloves. The kid who plays the recruit is also worth mentioning. I've never seen him before but he really nails it. There's a lot of humor in this film, it really doesn't take itself too seriously, but it's not overdone. And Sam Jackson finally found something he hasn't done yet. I guess his role was already spoiled a bit in the trailer, but believe me: you haven't seen Jackson in this kind of part before. This is an excellent, over-the-top bloody and sexy film for fans of old-school action films. I give it 10 stars. Highly recommended!","user":"funwithflags1992","rank":[386,591]}]