[{"title":"This one is different, in a good way.","rating":8,"date":"19 June 2017","review":"If you're into horror movies, you already know that a modern, moderately unknown horror movie receiving over a 6 on IMDb is a good sign. As usual, with the films I like, I think it deserves better.<br><br>This movie is different than others in this genre. It's well done and the subject matter is perfect for a horror movie. Oh sure, there's things you can pick apart if you're into dissecting every plot hole or unbelievable character action. But if you just sit back and enjoy the ride, I guarantee you'll find a movie that surpasses many in this genre in sheer plot alone. The acting is good and the movie builds and builds to a satisfying ending.<br><br>I've re-watched it over three times. Half the horror movies nowadays, I turn off in 10 minutes.<br><br>8/10","user":"Ghost33","rank":[96,108]},{"title":"Found-footage Horror 101 - Other movies, take notes.","rating":6,"date":"4 May 2015","review":"This is one I was excited for. The found-footage genre has been on life support for a while now but this one had a cool premise in a great setting - the catacombs. Seriously, that alone makes the movie worth a watch if you're a horror fan. The unsettling atmosphere, the claustrophobia, the creepy imagery, all while delving deeper and deeper into the Earth.<br><br>I feel like this is a no brainer but if you're not a found-footage horror fan then you won't like this one. You've seen it all before and this is no different. All the usual plot devices and tropes that come along with the genre are here - it's just executed with finesse. The setting has a lot to do with it: It sets up the tone of the movie and keeps that ominous vibe present throughout. There aren't many surprises to be found here. It's a found-footage movie so it takes a little while to get going, but once it hits its stride it becomes a truly exciting adventure to be on. You really get the first person feel in this movie. They don't need excuses to be documenting this - they're explorers. We're just watching what they saw. That little sense of believability goes a long way in helping the movie's credibility and effectiveness. <br><br>There are few actual scares in As Above So Below. It has an atmosphere similar to The Descent and keeps the slow eerie pace throughout the first two acts of the film. That in my opinion is the greatest strength of this film, and any others of its ilk - the focus on atmosphere rather than shock horror or jump scares. In the third act, sh*t starts to go down, and it goes down big time. It's not anything spectacular, none of the film is honestly, but I was satisfied at the end of this movie and that's more than I can say about a lot of the found-footage movies I've seen recently.<br><br>A pleasant surprise in horror is good acting, and this movie thrives on it. Even though it takes a while for the movie to kick off, it's fun being introduced to these characters and starting this adventure with them because they are convincing in their roles and they actually have personality. You can identify with the two leads - one is the ambitious adventurer, the other is the neurotic realist. Then there's the eccentric and unreliable \"tour guide\" that introduces them on this hellish quest. It's just a lot of fun to be a part of this journey because none of us know what will be waiting for us on the other side.<br><br>Overall this is just a well made found-footage movie. It has the chills, it has the thrills, and the added bonuses of good acting and an excellent premise. Horror fans will certainly get a kick out of it, and even if you're just looking for a midnight creep movie then As Above, So Below will not disappoint.","user":"lnvicta","rank":[139,161]},{"title":"Pretty good. Much better than expected.","rating":7,"date":"31 August 2014","review":"First of all, there aren't a ton of good Horrors out there that are truly original. I'm not saying this movie is one of them, but that lack of originality shouldn't be the reason to give any movie a lower score. Bringing fresh ideas to the Horror genre is difficult, mostly because it's difficult to find new ways to scare people. There aren't a ton of moments that make you jump, but I think the genre isn't really about making people jump anymore. Audiences have gotten good at predicting when these moments happen.<br><br>Where this movie does well, along with the rest of my favorite horror movies, is atmosphere. For me, having a dark, creepy atmosphere is far more important to success in this genre than getting people to leap out of their seats. The shaky-cam, found-footage style isn't that much of an issue for me either. Actually, I think still does a good job portraying realism, despite being a bit disorienting and annoying.<br><br>Story-wise, I'd say it's pretty unique. How many other horrors involving descent into the earth to find historical relics can you think of off the top of your head? One, two maybe... How many horrors can you think of off the top of your head involving a haunted house, a possessed child or doll, exorcism, a guy with a mask, or a cabin in the woods? 100? Not to say this is bad, but I'll gladly welcome anything outside traditional horror settings and scenarios. It does dip into the realm of ridiculousness as some points, but nothing too over-the-top and far-fetched for the situation. The acting is good and the characters are believable for the most part. I would have cleaned up the final act a little bit more, but it was good enough to keep me satisfied.<br><br>Not sure what the critics are bashing it for. If there is anything to really complain about it's not this movie, but the genre itself. That being said, lower your expectations and you might like it. I'd give it a solid 7 out of 10.","user":"spiral_nemesis","rank":[140,183]}]