[{"title":"Interesting, but could have been better.","rating":6,"date":"25 February 2019","review":"This film had a lot of potential. It dealt with a sordid business, which the film did not whitewash, but successfully made appear sympathetic. This aspect of the film was consistent throughout--and was only one of two things that was consistent. The film-making aspect, however, was less successful. While the scenes depicting the sex workers' performances were surprisingly tasteful, despite some full-frontal female nudity, the editing was choppy and some of the scene choices were questionable.<br><br>The film was interesting because of the dual storyline. The first time the story is told, the main character is also seen in a sympathetic light. He presents himself as the missing girl's father, who is concerned over her failure to appear at a celebration of life for her deceased mother. The father of the missing girl takes extreme steps to locate his daughter's coworker, who he befriends. He has photosensitivity, which makes his search for his daughter even more difficult, but the sympathetic sex worker helps him with the investigation. They solve the mystery of his daughter's disappearance, in which one of the business owner's, as well as a dirty cop, is implicated.<br><br>The film then \"rewinds\" to the beginning. The man who presents himself as the girl's father is a stalker and not her father at all. The girl who goes missing bans him from her page, which enrages him. In his anger, he bribes a sex worker that appears on the first woman's page to meet him in a \"face-to-face.\" He briefly convinces her, as well as the business owners, that he is the first woman's father, until she declares that he is not her father. It is then that this man is revealed to be mentally disturbed and his photophobia is a symptom of that illness. His psychologist, who was presented in a different role in the first storyline, expresses concern that he may be dangerous to himself or others. The second ending also solves the mystery of the woman's disappearance, showing that he was the true perpetrator.<br><br>I truly enjoyed this film, although it almost lost me in the beginning due to the full-frontal nudity. In the end, the viewer is shown that the main character is still an unreliable narrator and that the truth may still be hidden. It might have been better to shorten the first telling of the story and show this third possibility. It was short, at only 86 minutes, but a third retelling may have brought it over 110 minutes, which might have made the film too long for the story being told.","user":"LoupGarouTFTs","rank":[1,1]},{"title":"Fail","rating":1,"date":"1 May 2018","review":"Avoiding this film will be a very smart choice.<br><br>The story of the film was quite amiss. It has not much connection with the scenes which made the film out of sequence sometimes. And the acting part was worst than that. Everybody did a incredibly terrible acting job with an exception of Marielle de Rocca-Serra. She tried to deliver quality reactions but her co-actors were no help. It was a complete eyesore to see them acting.<br><br>NOT RECOMMENDED.","user":"niaz_islam","rank":[1,3]}]