[{"title":"Social Nightmare (Mother): Asylum's Best Movie?","rating":5,"date":"7 June 2015","review":"The Asylum is an awful company, truly embarrassing. They essentially ripoff existing blockbuster movies, yet every once in a while do something original......like this.<br><br>Daryl Hannah may well be the biggest star The Asylum have ever had in one of their movies and she hams it up perfectly in this drama/thriller.<br><br>The whole cyber bullying theme won't be new to you and has been done a great deal better but this isn't without its merits. A bearable cast makes the mundane script and beyond belief predictable \"Twist\" watchable.<br><br>Though this brings nothing new to the table you can do a great deal worse. If however you want something similar but made better then give \"Nowhere Safe\" a go.","user":"Platypuschow","rank":[12,13]},{"title":"Very good Lifetime movie","rating":10,"date":"3 May 2014","review":"I don't understand all the hate that this movie gets. I found the movie very entertaining, and thought I feel Daryl Hannah's acting wasn't the best, it didn't hinder the movie by much. And Kirsten Prout it very talented and attractive. <br><br>The plot is that high school senior Kat Hardy (Prout), an academically successful student who's class president and recently accepted into Brown university, has her future jeopardized by a hacker who posts inappropriate and insulting things, turning her friends against her. The hacker's actions slowly cause her life to unravel, ultimately causing her to be pulled to the edge of sanity (that's a little extreme, but she does have to take pills for it). <br><br>The plot is very intriguing and the acting, for the most part, was very good. But the twist at the end (which I won't spoil) is pretty obvious after a while. Here's some more negatives I have: 1. The movie's DVD title. I won't say it, because it spoils the entire movie. If they HAD to release the movie under a new title, they should have chosen the working title, Offline. 2. Daryl Hannah's performance as Kat's mother, Susan, isn't the best. But it isn't the worst, either. <br><br>This is still a great movie to watch. But I suggest watching it on TV so you don't get it spoiled by the DVD title.","user":"authorb22","rank":[6,6]},{"title":"Ridiculous and Offensive","rating":1,"date":"20 November 2013","review":"This film wastes a potentially interesting subject (an abusive mother who intentionally sabotages and destroys the life of her daughter and friends) by falling into lifetime movie clichés. It was actually disgusting to see all of the shallow, unbelievable and lazy plot points that come up, for instance someone emails a blurry picture of a girl drinking a wine cooler (but it could be a bottle of lemonade for all we know) to admissions at Yale, and they not only open the email and read it, but they revoke a student's admission as a result? It's so bad, though maybe there was some amusement in seeing what actors agreed to slum it for this production; such Rachel True's role as a (vice principal? teacher? counselor?--apparently all three) which she didn't even bother to phone in, and it's always fun seeing Tuvok from star trek voyager. But not only was the depiction of events unbelievable and impossible, so was the end scene ultimately infuriating. Her daughter tells her she's not responsible for leaking naked pictures of her daughter online, drugging her, physically assaulting people and slandering, defaming dozens of students at her daughters school, and she replies that \"I know, that's what my therapists told me too, it's just a chemical imbalance.\" When no, it isn't; you're a criminal and should be in jail, you don't have a right to abuse your daughter or other young people. This kind of abuse is a deep seated pattern that you do need to take responsibility for in order to change. No qualified therapist or mental institution would say \"it's not your fault\" after all of that. I hate lifetime!","user":"LoraceDem","rank":[12,16]}]