[{"title":"Pointless and almost no plot.","rating":3,"date":"15 May 2016","review":"Crocodile movie with very little crocodile, screen deaths, but tried to copy Lake Placid as much as possible.<br><br>In order to understand the copy cat reference you'll have to watch it, but that's a sin right there, as there is no reason to do so. Even tho it is a short one, it seems to last forever, and the ending just goes on and on. The acting is amateur, the camera is weak, almost no crocodile action, and some gore coming from different directions.<br><br>It was a complete waste of time. I don't get the comedy part so much, I guess it just couldn't take itself serious. And the ending. That part was truly unbearable!<br><br>Cheers!","user":"gothic-fiction","rank":[26,33]},{"title":"Weird but watchable......","rating":6,"date":"12 October 2016","review":"The Hatching is a weird but watchable horror spoof, from the UK.<br><br>This film is so indescribably odd, its actually quite hard to review. Imagine, for a moment, a film script about a rustic village, a spot of serial killing, with a crocodile or two, throw in, just for fun. That's what you get and its such an exotic and implausible mix, on a certain level, it actually works. <br><br>The standard of acting is reasonable, if not exceptional. The characterizations are for the most part, on the money but that's not to say there are not some noticeable shortcomings. <br><br>The story meanders, more than a little and the characters don't really feel \"complete\". There's also a real lack of meaningful dialogue and whilst some opportunities for rustic Brit humour are taken up, just as many are missed. <br><br>In short, not a bad film. Its quite watchable but nothing special either. Its a shame too, because with wittier, more concise scripting, it could have been more. Six out of ten from me.","user":"s3276169","rank":[11,13]},{"title":"British killer crocodile movie","rating":11,"date":"11 November 2016","review":"'The Hatching' tells the story of Tim (Andrew Lee Potts, known for the TV series 'Primeval' which had plenty of dinosaur fights to prepare him for this). 15 years ago as a kid, he released 2 crocodiles into an English swamp by mistake, after they stole eggs from the zoo nearby. Now he returns as a grown man because he inherited the company of his father. In between checking the books and partying with old friends, he goes fishing in the swamp - and finds two crocodiles grown to enormous size. And they're hungry. Many people disappear in that area or only parts of their bodies are found. Not all of the deaths are to blame on the crocodiles, though. Some members of the community have more terrible secrets to hide...<br><br>I really enjoyed it and was surprised to see so few reviews here. This British movie is a nice variation from the typical American monster movie formula. Instead of screaming bikini chicks, you get a sick sense of humour here, and the story manages an unusual combination of monster movie and serial killer movie. I think it works, except for the unnecessary sequence attached after the actual ending: a narrator telling you what became of each character, as if it wasn't enough to know who died and who survived. They should have skipped that bit.","user":"unbrokenmetal","rank":[3,4]}]