[{"title":"Could and should have been better.","rating":6,"date":"24 February 2018","review":"The only conclusion I have after watching Extortion is that it could have been much better. The movie is entertaining, there is no doubt about that, but there are too many plot holes in the story. Many times I was thinking \"How the hell could he knew that?, That's not possible, Yeah right, and so on\". And that's never good in a well balanced story. The acting wasn't bad though, but it could have been better sometimes. The ending wasn't great either, I thought they were just tired of writing a good ending for a movie that could have been much better if they put a bit more effort into it. But to watch once it's okay if you just want some entertaining and you are not to fuzzy about the perfection in a story.","user":"deloudelouvain","rank":[5,5]},{"title":"Better Than I Expected","rating":7,"date":"16 May 2017","review":"I didn't know what to expect from this film with no reviews posted as I write this. What I found was a thriller that contained wild twists and turns as it progressed, but which also contained, at times, such highly implausible plot elements that I found myself shaking my head in disbelief.<br><br>Eion Bailey stars here as Dr. Kevin Riley, who is about to embark on a much anticipated Caribbean vacation with his wife Jules (Bethany Joy Lenz) and their six-year-old son Andy (Mauricio E. Alemany). Upon arrival,they rent a boat from a local, but, at the urging of Andy, end up exploring a deserted island far out at sea. However, with their outboard motor failing and with no food or water, they will find themselves in a most precarious and dangerous predicament.<br><br>From there, a series of wild and life threatening events will begin, and without writing too many spoilers I will say that a local fisherman named Miguel sees a golden opportunity for extortion here. Barkhad Abdi, who was nominated for and won numerous awards for his motion picture debut in \"Captain Phillips\" again turns in an amazing and most believable performance as Miguel.<br><br>Overall, this movie, written and directed by Phil Volken, was better than I anticipated and certainly kept my attention throughout, but be prepared for some extremely implausible plot elements along the way.","user":"larrys3","rank":[36,53]},{"title":"far from a B movie","rating":7,"date":"25 June 2017","review":"I read a few of the reviews who hated the movie. \"how did this make it to Netflix?\" - I can tell you how :)<br><br>It is entertaining. I read people complaining about how unrealistic the movies are. But those are the same kinds of people who love the Transformers series :) Not saying the movie is unrealistic, but let's face it. It's a movie, not a documentary.<br><br>There are a few plot holes, I give you that. But as a software engineer I just roll my eyes when someone 'hacks into a system' (again) in some movie for the sake of storytelling.<br><br>I do not need every single detail of the movie to be well researched. Which is why it is a movie.<br><br>So much about the disclaimer :) The movie itself is good. Main characters do a great job, it takes you around a few turns in the Caribbean - and the overall message of the movie is great. Family matters more than money.<br><br>I rate it 7/10 because of the things that other people actually hated the movie for. I liked it, I just consider those gaps in research 'flaws', not total failures :)<br><br>It is definitely worth watching. It is well cast and entertainingly written and filmed. It's far from a B-movie or a low-budget production.<br><br>Whoever calls this low-budget doesn't know the first thing about production value.","user":"zeller-5","rank":[33,50]}]