[{"title":"It wasn't that bad, but it was bad indeed","rating":5,"date":"26 July 2013","review":"I despised the very idea of this movie existing, but after watching it... it turns out it wasn't that bad! But... that doesn't mean it was good.<br><br>I'll try to be as objective as possible, since some people here aren't reviewing... they're just spewing their hate.<br><br>STORY 1/10<br><br>It's pretty decent and acceptable... within the first 15 minutes. Then, something that had so much potential (a crown that could help you dominate the world) is all wasted... on a high-school. And instead of an epic fight or something of the sorts (in order to retrieve the crown)... we've got a high- school dance. It all goes downhill from this point. Clichés are everywhere, and of course, as you might expect, the villain steals the crown just in time, turning into a sort of demon who can mentally-control others... and yes, she wants to rule Equestria. How original.<br><br>However, I'm giving it 1/10 instead of 0/10 because of how good the adapting-to-the-human-world-and-tech thing was. It was pretty original and it made me chuckle plenty of times. Everything else was... shameful.<br><br>-----<br><br>CHARACTERS 4/10<br><br>Every pony in Ponyville has a mirror version in the \"human\" world (they even have the same name... how lazy you have to be to give them the same name, Hasbro), so personalities and character development are pretty much the same as the ones seen in the show. However, we've got an archetypical spiteful/bossy teenage girl as a villain (yay originality) and plenty of fan-service throughout the movie (4th-dimentional Pinkie, a \"so awesome!\" from Rainbow Dash and an extremely moe Fluttershy).<br><br>One thing I really disliked about the characters is how pretty everyone is. There are no short/fat/ugly people. Everyone's tall, with an athletic body (despite most of them not even practicing sports) and a gorgeous face (heck, even the nerds are gorgeous... they're just pretty people with ugly clothes), and the school's one and only bully is our villain: a teenage girl. Really?<br><br>And last but not least, the society-portrayal made when Sunset Shimmer turns into a demon was downright pathetic. Pretty much nobody panics after seeing a FRIGGIN' DEMON, and nobody else outside of the school seems to care about the intense and noisy beams of magic/explosions. It's like they're used to it. And what's worse: when Twilight and friends defeat Sunset Shimmer, the once spiteful/bossy/I'm-gonna-rule-Equestria villain is now a crybaby who just wanted friends. What. The. Stuff.<br><br>-----<br><br>ANIMATION 8/10<br><br>The animation was pretty good. No complaints at all. They did a really good job and the character design ended up being cute! That was a surprise.<br><br>-----<br><br>MUSIC 7/10<br><br>The soundtrack was good as well. The songs were cheesy, girly and catchy, just like you'd expect from a My Little Pony movie.<br><br>-----<br><br>BREAKDOWN - 5/10<br><br>Good animation/soundtrack but terrible plot and character development. It perpetuates a sexist view of both genres (boys play rock &amp; roll, girls put on their make-up) and it was made to sell new merchandise, so yeah, not really a good movie, even though I love My Little Pony.<br><br>Don't give it a higher note just because it's for kids and don't give it a lower one because you were disappointed. There's a whole lot of masterpieces in the film history that were originally made for kids. Rate this with the same criteria that you'd rate a Pixar movie.","user":"YaroLord","rank":[25,32]},{"title":"This is not what lured millions to MIP:FIM","rating":4,"date":"1 July 2013","review":"First off, I enjoyed the beginning of the movie where they're still ponies. I like how it picks up right after season 3 ended. Its a great set up but then it shows its true colors, and that would be a movie designed to rival with the Bratz Monster High doll collection. The legs are three-fourths of their body. They ALL wear short skirts and knee-high hooker boots. It only worked for Apple Jack because she would wear cowgirl boots but a skirt? No she'd wear denim shorts or jeans. Rainbow Dash especially was reduced to playing soccer in a skirt. We get it Hasbro, they're girls but they don't all have to dress that way. The skin doesn't bother me just because it eliminates racist thoughts. In Equestria, fur color was never meant to show race. They're all different colors. However, Rarity and Sweetie-Bell look like corpses. I liked seeing all the ponies from the show shown as humans, even though their design overall was done in a much more mediocre way than what I've seen from the fandom. Other issues that really bothered me was the cliché high school drama, which is what turned me off in the first place. The antagonist uses cell phones to cyber bully Twilight, which is far from what I expect from this show. The love-at first sight had my eyes rolling like many other things. Some of the characters don't seem to be \"in-character\" such as Fluttershy. There's no ways she would break out into song in front of the entire school. I had to skip through some of the songs, which I've never had to do for the TV show. The big turn off was Sunset Shimmer setting out to rule the high school. Really, being princess of the high school, that's just lame! Like it or not this movie was made to sell creepy humanized pony dolls, which will fail in my opinion. Hopefully season four of the show will get it back on the horse.","user":"lx-sosna","rank":[44,66]},{"title":"A blatant marketing movie that undermines the show...","rating":4,"date":"24 June 2013","review":"For a start... it definitely did not warrant a theatre release.<br><br>No additional effort was put into the animation beyond the TV series other than the opening credits animation, at all. Would have been a nice two-parter to link the existing My Little Pony seasons 3 and 4 together.<br><br>Two, it's so obvious the entire movie is a giant advertisement for Hasbro to sell anthro-based dolls based on popular characters. The way the characters are introduced and stylised, it's just glaring and grating.<br><br>The basic story? As predictable as ever, even for a MLP episode. Which is fine for a MLP episode, but not for a movie, hence back to my original belief it didn't warrant a theatre release. The fact that it's set in such a tedious and over-used setting as a school formal? Awful. So much opportunity for this to have been done better was wasted on a cliché. The ponies are regressed to teenage years when in Ponyville they are already mares, ie mature. The movie should have reflected this, and used it to encourage girls (and guys) in a more positive direction than what it does.<br><br>The writing was about as standard as the series, but I'm disappointed with the whole image of the movie. Everyone is thin and anaemic, with the exception of Snails, and lo and behold, the unpopular \"bad guy henchman\" is fat. The ONLY fat person in the entire movie. In the series, all the ponies are rounded, or at least full-bodied; all this movie does is perpetuate the stick-insect mentality of fashion that girls are now being encouraged to pursue. Which leads to...<br><br>Concepts of friendship are nice to see in this movie, and I'm glad they are there. But the series does a much better job of teaching those concepts in a manner that isn't muddied by imagery that is counter-productive to many children's' self-esteem. This movie is a step backwards for the quality of the show, not a step forwards.<br><br>So, overall? Poor. It *could* have been so much more. Instead, we got dreck. It's 4, perhaps a 5 out of 10. For the absolute littlies only, and I say that with hesitation given the body-image impressions it's setting up for them.<br><br>I hope this stays a one-off, and is never attempted again.","user":"elsol-3","rank":[69,109]}]