[{"title":"These people need Bear Grylls","rating":6,"date":"11 May 2015","review":"Backcountry is a good example how one simple premise can still be thrilling with clever production and a few grisly scenes. Using scenery and only minimum amount of characters, it succeeds on creating the sense of isolation and overwhelming helplessness. The movie doesn't venture to cheap scare territory and while it can be slow at times, its modest nature delivers what it sets out to do.<br><br>Jenn (Missy Peregrym) and Alex (Jeff Roop) go into a camping trip. The weekend is meant for a romantic escapade to see a beautiful lake, unfortunately they lose their way in the thick forest. The concept is simple, it has been done before, but Backcountry does it with smart approach by keeping the focus on the confused couple and develop their personalities. Both the lead actors deliver convincing performance.<br><br>They look like an ordinary couple, complete with their own issues and occasional bickering. It makes it easier for audience to invest on their survival. When the danger comes and they find out the trip isn't going well, the reactions are believable without being overbearing or resorting to excessive screaming and blaming even though some poor decisions have been made.<br><br>The movie keeps the flow without distraction, in this case the less is better as build up for the encounter with the threat is silently ominous. Practical effect and makeup do wonder at creating the deterioration of battered man and woman. Relying on only two characters alone could be risky, the film doesn't veer off from its original path, although the pace does stumble on halfway point. Granted, the investment on the couple might take a while.<br><br>Backcountry provides a survival tale in its natural form. It may not be fancy, but it stays on it course to deliver a decent thriller.","user":"quincytheodore","rank":[71,91]},{"title":"Spoilers follow ...","rating":7,"date":"8 June 2017","review":"A young couple Alex and Jenn (Jeff Roop and Missy Peregrym, turning in excellent performances) decide to backpack through the Canadian forests. They are sprightly, funny and highly likable. So much so that when they are joined by a third, Brad (Eric Balfour), he is immediately unwelcome, no matter how friendly he seems to be. And friendly he is, though there's no denying he has a darker side, which occasionally manifests in their conversations. His appearance some way into the film makes us pretty sure we'll see him again later  The other player here is Nicholas Campbell who is great in the small role of the grouchy Ranger-on-the-make.<br><br>Likable though Alex seems, it is difficult not to resent him when he 'reasonably' insists they continue their trek despite strange noises at night and other unnerving occurrences – we, the audience, know Jenn is bound to be right in wanting to go home, and Alex's foolhardy refusal to take a map guarantees trouble.<br><br>In fact, the more we get to know Alex, the less likable he becomes. When he reveals his bullheadedness extends also to relieving Jenn of her mobile phone and leaving it in the car, and then succeeds in getting them both lost, our sympathies lie 100% with his partner. Of course, being lost with no way of communication with the outside world is integral to stories of this nature, and here is made entirely believable due to Alex's need to prove himself by turning down any offers of help. This allows Jenn to move centre stage and salvage a situation that descends from Very Bad to Even Worse, when they unknowingly wander into black bear country and become of great interest to a large, predatory killer. When Alex is frantically looking for his axe to ward off an approaching bear, I commend Jenn for resisting the temptation to say, \"Maybe it's with my phone.\" We wait a long time for the attacks to come, but when they do, they are expertly handled and very effective. And more gory than we expect. This is an extraordinary debut from writer/director Adam MacDonald and I hope he has a long a fruitful career, because this a film with only four cast members, is extremely easy to enjoy. It should be said, however, that the ending is slightly disappointing, although the atmospheric use of the incredible location – crisp, taught camera angles; at one point, the swaying of the trees has an almost hallucinatory effect – ease the shortcomings due to a lack of proper pay-off.","user":"parry_na","rank":[13,15]},{"title":"Hauntingly Realistic!","rating":7,"date":"5 April 2015","review":"I was glued to this movie from start to finish. The main characters were believable and the acting was very good. The male character, Alex (Jeff Roop), had an uneasiness about him that kept me watching with nervous anticipation. The female character, Jenn (Missy Peregrym) was superbly realistic. I connected with her vulnerability and ultimate strength and perseverance.<br><br>*****WARNING: MAJOR SPOILERS AHEAD*****<br><br>I am a fan of the horror genre and feel that I have pretty much seen it all and that nothing fazes me anymore. Well....I have to say that the bear attack scene in this movie still haunts me today, weeks after having watched it. From the chillingly realistic cries of agony as Alex is being mauled - made more horrific since most of the gruesome details are left to the imagination - to Jenn's excruciating shock and helplessness....it's incredibly satisfying to watch because the realistic emotions touch close to home.<br><br>I have to mention Eric Balfour's character, Brad. I have read a lot of comments with regards to his scene being pointless or irrelevant to the movie. I actually think that including this scene in the movie was a brilliant red herring. After Brad left, I was left with an ominous feeling. Where was he lurking and when was he going to pop out again? I was totally caught off guard when it turns out that the real threat to the couple turned out not to be Brad. What an effective way to amplify the couple's real plight. This scene provides some foreshadowing, as well. Brad's appearance is menacing. Similar to the bear, he preys on Alex's weaknesses/insecurities. He builds up Jenn, who ultimately prevails.<br><br>Great movie. I would watch it again!","user":"Torera","rank":[40,56]}]