[{"title":"NICE CONCEPT, WEAK FOLLOW THROUGH","rating":5,"date":"14 September 2018","review":"There are tons of movies being made these days, some ranging from spectacular to others the bottom of the heap. Most movies tend to fall into the category of not bad but not quite worth repeat viewings. Setting aside those movies made for zero budgets that cater to a special crowd (splatter drenched horror films, which I love, come to mind) and looking at movies intending to be better we are now presented with HIGHER POWER.<br><br>The concept is nice. A maniacal scientist (Colm Feore) is intent of saving the world in spite of itself. His project abandoned he moves forward with it on his own. He searches for the perfect subject to employ and finds one in Joseph Steadman (Ron Eldard). Steadman has a scarred past of alcoholism and violence. His wife now deceased he's no longer in touch with his children, one of whom is a college student who wants nothing to do with him the other a junkie on the streets. <br><br>Knocked unconscious Joseph wakes to find a heck of a headache and someone talking to him inside his head, the scientist. He's given instructions on what to do and if he doesn't follow through images are transmitted to his brain that allow him to see his daughters and the danger they are in. With no choice but to follow along he does so, moving from one task to the next. Each task makes him angrier and angrier, those long held back rages he's been dealing with coming to a head. <br><br>And with each burst of anger and rage a power is building inside of him as well. Eventually his tasks lead him to a huge generator and it is from this generator that he will be transformed into a hero, one that we need to save the world from a destructive gamma beam headed for our planet that was mentioned briefly in the film's opening moments. <br><br>What sounds like a great story is pretty good but would have made a much better episode of say THE TWILIGHT ZONE than a 93 minute film. The effects are the most amazing thing about the film and set it above many others in the same genre. The cinematography is well done as well. The acting is much better than one would expect from a film like this too.<br><br>But the pacing of the film does it great harm. It feels like it takes forever for the story to move forward. This is why it would make a better TV episode than film, the amount of time wasted to develop what is happening. The characters feel more like cardboard cutouts, characters we recognize without having to invest much thought into. Even Eldard who I consider a much better actor than the roles he's been presented in the past, can't save this film from mediocrity. <br><br>This is also one of those films that if you've seen the trailer then the odds are pretty good you'll be able to figure out what's taking place long before the film itself tells you. It will also provide you with enough footage to figure out what the outcome of the film will be. The movie is not the worst thing I've ever seen and some might find it mildly entertaining for a night but it's not one that will result in repeat viewings or on a list of films you tell friends they must see.","user":"kirbylee70-599-526179","rank":[14,15]},{"title":"Enjoyable","rating":7,"date":"23 November 2018","review":"I got into this last night without knowing anything about this movie, not seeing reviews, trailers, honestly never heard of this movie before last night and I was a bit skeptical...slow opening then about a qtr of the way through it hooked me..the ending was very unique, a hidden message was in the final scenes if you looked hard enough....don't skip this one.","user":"jayflores-29562","rank":[7,7]},{"title":"Pleasenly surprised - see it, ignore the rating","rating":7,"date":"7 July 2018","review":"Well, another proof that IMDB rating and review quality is going downhill.<br><br>After seeing the reviews I almost skipped this one. Glad that i didn't.<br><br>Story: 7+ and actually a fresh take on the superhero saga\nCinematography: 7\nSpecial FX: 8, they where actually better than Justice League and on a tiny budget\nActing: 5+. This is what makes this film hurt. Better star power would make it a true success.","user":"kanenasanonas","rank":[24,30]}]