[{"title":"Very typical indie slasher","rating":3,"date":"8 June 2017","review":"SCARRED is a very typical example of your indie horror movie. It sees four girls heading off to an abandoned building in order to shoot photos for their modelling portfolios. Cut lots of posing in underwear and bikinis for what seems like forever. Eventually, a masked killer goes on the rampage and begins bumping them off one by one. The second half of the film is full of torture porn-style kill segments which are dealt with in an uninteresting and distasteful way while the film as a whole is made without grace, flair, or wit.","user":"Leofwine_draca","rank":[5,5]},{"title":"Just because you want to make a movie, doesn't mean you should.","rating":2,"date":"24 January 2019","review":"Horrendous acting, writing, lighting, and especially the sound. ADR should not be used for the majority of a movie. Watch a YouTube video, and learn a few things before your next project. Please. This movie seriously felt like a late night Cinemax flick. Man, this was bad.","user":"charliecoffell","rank":[1,1]},{"title":"I love nature shoots","rating":4,"date":"11 December 2017","review":"Four models, a photographer and a token fat guy go off to \"the lodge\" for a photo shoot, except they camp out in small tents instead. Whatever happened to those large green canvas monstrosities anyway? There is the story of Jonah Kandi who apparently died with no one bothering to find a body. A midget claims he is still alive.<br><br>This is a slasher film, so I can't imagine there be much of a plot spoiler except for \"final girl.\" The film had a low budget sound system that was choppy and ill suited. Too much outdoors sound at beach, too much munching when midget was eating, and other sound had an echo effect. Typical slasher with various implements including a chainsaw and other questionable brand new items.<br><br>Appears to have originally been released in 2013 under the groan title \"Kandi Land\" without much fanfare.<br><br>Guide: F-word, sex, nudity (Jessica Lauschin) Minus a star for crappy sound.","user":"nogodnomasters","rank":[1,1]}]