[{"title":"Spoilers follow ...","rating":4,"date":"26 August 2016","review":"Corey (Robin Dunne) and his new wife Sarah (Katharine Isabelle) move into a fairly isolated house, with Corey's son Liam. Sadly, little Liam (Peter DaCunha) resents Sarah because he misses his mother, which is understandable. However, as is so very often the case, scenes with a minor acting in a brattish and petulant fashion immediately causes audience rankles to rise. Corey's endeavours to 'understand' the child make me wish he'd just wallop the little sod and cause me to become irritated by his ineffectuality (\"Promise me you'll give her a chance, boss,\" he implores more than once). From the very beginnings of 'Torment' I find this a big hurdle to overcome.<br><br>One night, after hearing some noises around the house, they find Liam is missing. Instead of celebrating, they call the police. Thus begins another in the sub-genre known as 'home invasion', where the calm and comfort of home is forcibly interrupted by some nightmarish killer or other. As a sub-genre, its immediate limitations mean any film to fall under this category is virtually guaranteed to be surprise-free.<br><br>This doesn't mean such projects cannot succeed as horror films if they are well done. And thankfully when the often silent invaders strike, dressed in tatty animal head-pieces things liven up. For even though their features are masked, they are more interesting than the remaining two bastions of 'family'.<br><br>As the opening quote indicates (\"When one has not had a good father, one must create one\" – Nietzsche), it is the concept of 'family' that tries to propel this story. Just as Sarah is given the thrilling prospect of adding further children to Corey's litter, the barely-glimpsed mutants are looking for their own 'new' mothers and fathers to add to their clan. That such a perfunctory thriller results from this, should we then be heart-warmed when, (spoiler) after Corey has been killed and Sarah has been repeatedly beaten, munchkin Liam finally 'forgives' his new mother and decides she isn't so bad after all? Personally, I would have been more satisfied if the little twerp had somehow been behind the horrific events.","user":"parry_na","rank":[5,5]},{"title":"Bleh!","rating":1,"date":"21 June 2014","review":"It seems like horror movies these days fall into 3 categories: good or excellent (less than 5% of all horror movies per year); \"I've seen worse\" (30% of all horror movies per year); and utter garbage (the remaining 60-plus% per year). This is one of those \"I've seen worse\". <br><br>The entire movie is a mishmash of different horror movie elements you've seen in plenty of horror movies before:<br><br>1. deranged redneck family. 2. unsuspecting yuppies are stuck in a rural area with no cell phone reception. 3. decent actors wasted on a terrible script and poorly developed characters (although the kid was annoying). 4. long torture scenes where the victims are bound and gagged. 5. \"BOOM!\" jump scares whenever we see a shadow. 6. the heroine is pinned down by the villain but then finds a conveniently placed weapon nearby to defend herself with. 7. despite the fact that she's been through a physically trying ordeal through mud, blood, and grime, the heroine's hair, makeup, and nails are great. 8. the victims will knock the killer out but never make sure the killer is dead.<br><br>I was just shaking my head throughout the entire movie, constantly saying, \"Wow...this is reeeeaaally generic...at best...\". It's never a good sign when I start fiddling with my phone out of boredom. But I was doing that throughout the movie. Before I knew it, the movie was virtually over and everything seemed to be okay. Then the lame twist ending came around and I thought, \"Well, unnecessary and mediocre twist endings are the norm these days. So why am I not shocked by this.\" I think the only interesting thing were the villains' masks. Why were they wearing them? I understand they wanted to keep their I.D.s a secret, but they could have chosen better masks. The masks are stuffy and hard to see through. In real life, any killer wearing those masks would have ripped them off in frustration.<br><br>All in all, this is a forgettable movie for someone looking to kill time. After watching it you'll think, \"Well, I didn't hate the movie. But I have no desire whatsoever to watch it again.\"","user":"davannacarter","rank":[18,27]},{"title":"Not terrible, but lacks purpose and clarity.","rating":6,"date":"9 August 2014","review":"The other reviewers give this movie some pretty low scores. Realistically it's no worse than a variety of other horror films out there. To say that it has no redeeming qualities is outright false. It's filmed well, the acting is reasonable (where it counts), and it has a certain creepiness right off.<br><br>Also, it has Katherine Isabelle in it, which is the reason I watched it to begin with. OK, I confessed. Back to the review.<br><br>Unfortunately, like most horror movies, the scare/creepy factor lessens considerably toward the middle of the film as things start to emerge from the dark to the light. The villains, who are clearly insane, make very little sense to begin with, and the writers should have left it at that. You can't explain insanity, and you shouldn't try.<br><br>But instead the writers keep hinting that there is a method to the madness, and that the villains are up to something very specific. Crazy, yes, but specific. But there are simply too many unanswered questions, and the motivations behind the characters' actions are just convoluted at best.<br><br>Essentially, every element of a reasonably good film is here except that the bad guys don't really make sense, which just kills it for me.","user":"rushknight","rank":[10,14]}]