[{"title":"Not bad for a mid day action movie.","rating":7,"date":"11 March 2014","review":"Dolph Lundgren is pumping these out pretty fast these days. This one is one of the better ones that has come out with him in it. The camera work is not anything special, the lighting needs to be worked out, but when it gets down to the action Lundgren is his usual rock against which all of the waves think they can make a mark, and the addition of Chun Le only ever makes things better. The supporting cast do a decent job of giving us a reason for all of the drama, and the final showdown though a bit short, and sudden does play out well Vinnie Jones is always a good bad guy. I Enjoyed this for what it was, an afternoon action movie, no tear jerking around here. I recommend this one to action fans who have already run through the top 500, this is getting pretty close to scraping the bottom of the barrel, but there has been much worse in the past few years than what you are given here.","user":"face-819-933726","rank":[20,26]},{"title":"A simple DVD action film that follows the formula and won't surprise you in any way","rating":4,"date":"13 November 2014","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning<br><br>John Ngugen (Cung Le) is a former army vet who's struggling to adjust to civilian life, blah blah blah, who finds redemption when he comes to the aid of a damsel in distress, blah blah blah (at least it's none PC), and incurs the wrath of crime lord Hollis (Dolph Lundgren), blah blah blah, and sets out on a mission of revenge when his parents are murdered, blah blah blah.<br><br>I care about writing this review as much as I can when there seems so little point in doing it. It's hard to give a distinctive summary of it as a film in itself when it is so indistinctive from any other similar film out there. A Certain Justice follows the action movie formula by the book and fires out a none stop battering ram of clichés at a rate of twenty to four. The result is a film that can pass the time maybe if you're on a late night plane flight home or trying to nod off after a long hard day, but that you will care precisely nothing for. Likable but not awfully charismatic leading man Le is, well, likable but not awfully charismatic, while bad guy Lundgren has reverted back to his Johnny Mnemonic get-up, with imposing facial hair and biker hair.<br><br>Formulaic. Generic. By the numbers. Take your pick, but there's really no other superlative for this pot boiler. **","user":"davideo-2","rank":[4,4]},{"title":"A tough sit","rating":3,"date":"22 June 2015","review":"John Nguyen (Le) has all sorts of problems. After serving his country in Iraq, he comes home to L.A. and has to deal with not just his PTSD, but also his lazy, none-too-bright roommate (not sure of his name, but he could possibly be in the next casting for Jersey Shore, if his acting was better). One night Nguyen unleashes his Martial Arts skill on some toughs harassing local prostitute Tanya (Evigan, daughter of My Two Dads' Greg Evigan), and some of the guys die. This upsets crime boss Hollis (Dolph). So Hollis sends some more of his goons to kill Nguyen's family. Now in full revenge mode, Nguyen vows to go after Hollis - but to get there, he must get info from Bennett (Jones) and figure out what the detectives investigating the case know. Will Nguyen get revenge? Will someone die of PUNCTURE WOUNDS? Man, this Cung Le guy looks like Cuba Gooding, Jr. I mean, he REALLY looks like him. Note how on the box art, his Cuba-face is strongly emphasized, while no actors' names are present. Could this be a trick? Well, that aside, it's a dark day in DTV-land once again, as these modern-day productions prove time and again they cannot hold a candle to their far-superior 80's and 90's counterparts. You know it's a bad sign when two separate directors get two separate credits (and on the version on Netflix streaming at least, it's shown under its alternate title, A Certain Justice). Here is no exception. The stupidity is all-encompassing, as everywhere you turn in this movie, something dumb is happening - with the possible exception of Dolph. Whenever he's on screen, things are better, but he and his walrus 'stache can't save this turkey from its own sophomorically-written ways.<br><br>It is indeed hard to believe someone over the age of 14 actually wrote this inanity down on pieces of paper. Hey, writers - instead of writing down to us, how about writing UP to us for a change? We're action movie fans, not automatons that will just accept any old slop. From the unnecessary narration, to the gratuitous use of slow motion, to the puzzling stylistic choices such as quick cuts and foggy, blurred edges on screen, to printing the names of the characters on screen as if that matters/has never been done before, to the nu-metal-esque soundtrack, the whole thing seems targeted towards the 'stupid market'. It all screams \"NEW DTV production\", to its detriment. Yes, we're glad Dolph is still working, and it's nice to see mainstays like Vinnie Jones and Robert Lasardo (who is in one scene), so we don't want to seem ungrateful, but Puncture Wounds is just not enjoyable to watch. We're sorry, but there's no getting around that, no matter how hard we try.<br><br>The premise is even very similar to fellow Cung Le vehicle Dragon Eyes (2012) - Cung moves into an apartment complex in a bad neighborhood in L.A., beats up a bunch of people, and there are crackheads running around. But thankfully Dragon Eyes was directed by John Hyams, so it was better than Puncture Wounds. While we liked seeing Dolph as the baddie, and we thought that was a nice change of pace, it was really a wasted opportunity.<br><br>So, yes, Puncture Wounds does have some action, but at what cost? The movie typifies some of the worst aspects of modern-day DTV, unfortunately. We thought it was a tough sit","user":"tarbosh22000","rank":[3,3]}]