[{"title":"Sincerely Authentic","rating":9,"date":"4 December 2013","review":"This film \"Ilo Ilo\" put Singapore on the map of world cinema when it won the Camera D'Or at the Cannes Film Festival this year. Finally, it is now being shown here in the country where the titular place name originates.<br><br>We do not even hear the word \"Ilo Ilo\" mentioned during the film's 99- minute running time, though we do hear the maid Terry speak in the Ilonggo dialect of Iloilo province when she makes a long-distance phone call back home. I doubt if non-Filipinos will recognize that little linguistic detail, so they might wonder about the English title. The Mandarin title of this film is actually \"Father, Mother Not At Home.\" This was exactly what the movie was all about.<br><br>We meet a middle-class Singaporean family, the Lims, feeling the crunch of the Asian Economic Crisis during the late 1990s. The father has lost his job in sales and has to make do by accepting a more menial job. The mother is pregnant with their second child, and has a thankless clerical job, typing letters for employees about to lose their jobs. The son Jiale is a naughty little rascal who is obsessed with the lottery, his Tamagotchi and getting himself sent to the Principal's office.<br><br>To help with the household chores and to take care of Jiale, the couple decide to hire a maid from the Philippines, Teresa. It was a huge challenge for Terry to get integrated into the family system and into Jiale's troubled life, but she eventually does. But as the Lims continued to experience escalating monetary woes, they need to make an important decision about Terry.<br><br>This is actually a simple story of a family going through rough financial times and their relationship with their helper. We usually see this type of story from the point of view of the helper, but this time we see the employer's perspective. The actors who play Lim family are very real in their roles. Tian Wen Chen essays the down-on-his-luck father role with just the right amount of humor. Yeo Yan Yan portrays the frustrations of her character with her life, her husband AND her son very well. Her inner conflicts when she sees Jiale bonding with his Auntie Terry were eloquently reflected on her face. The child actor who plays Jiale is quite the natural in his portrayal. It was surprising to find out later that this was his first ever film role, maybe that is why it was bereft of artificiality.<br><br>As for Terry, we don't really know who she was before she came here. She has several skills like cutting hair or driving, but what exactly did she do for a living before going to Singapore? We will also not know what will happen to her after her last scene. Teresa was not really the main character here but she was the important catalyst for the family's story to be more interesting. Filipina actress Angeli Bayani hits the right notes in this role, perfectly mixing her character's timidity and subservience with loyalty and dignity.<br><br>Director Anthony Chen toned down everything in his treatment of this story, the script of which he himself wrote based from his own memories about his childhood and his Filipina yaya (or baby sitter). The colors were muted to a pale sepia. There were no scenes of exaggerated melodrama, no over-the-top shouting nor crying, which makes the emotions so authentic. The actors were all subdued in their acting, which makes the performances so realistic. You can feel that the intentions of the film were only modest, but the sincerity is very palpable, and that is what makes the film connect so well with its audiences. 9/10.","user":"3xHCCH","rank":[20,23]},{"title":"In love with Ilo Ilo","rating":10,"date":"11 September 2013","review":"Sincere and heartfelt, this little gem will tug at your heartstrings. <br><br>This film is director Anthony Chen's debut , but it is executed with such finesse one cannot tell just by watching the film alone. A conscious lack of music allows the acting and characters to really shine--- the former never stilted or cheesy (a common problem in local Singaporean films) ; the latter very believable and connectable. From the retro kitchen tiles to the cassette tapes in Teck's old car, the movie paints a vivid picture of life in the 1990s, without explicitly stating it. The director gives the audience freedom to wander, infer and to truly feel, on their own--not just about time and setting, but also the relationships and nuanced emotions of the characters involved. The camera work also deserves praise as many shots are cleverly done and lighted. <br><br>The main story is simple, like a home cooked meal. But like a home cooked meal, it is precious and close to the heart.....I found myself laughing but also really close to tears at certain parts. Growing up in 1990s Singapore, many facets of the movie resonated very strongly with me. But at its core it is a universal human story of love and longing, of growing up and painful goodbyes. The movie will creep up on you, sweep you into it, and hit hard on the emotions.","user":"ttys12","rank":[19,22]},{"title":"A sensitive, closely observed and well crafted film!","rating":8,"date":"26 August 2013","review":"Ilo Ilo tells a deceptively simple story with a lot of care and heart.The film is roughly set in the middle of the Asian financial crisis which also affected this small island nation.It tells of a friendship which grows between a young and rebellious boy who has just lost his beloved grandfather and his maid who arrives from Philippines to help his pregnant mother with her hectic schedule. The boys father loses his job and his mother juggles the tantrums of the brat and the increasing demands of her job which she needs to retain at all cost.<br><br>Ilo Ilo demonstrates that the role of a nanny and domestic servant is very special.The tightrope that both employer and employee walk in balancing \"you are a paid servant\" and \" you are a part of the family\" can be so tight and the casualties so subtle that we don't notice the injuries until much later.In a dramatic scene, the school bully teases Jialer that his maid does not actually love him, she is just doing a job for which she is paid.This infuriates Jailer who lunges at the bully in a fit of rage. The director says the film was based on his personal experiences and how he felt that its very cruel for parents to allow maids to become like surrogate mothers and suddenly sack the maid for some reason.This can be a huge emotional trauma for the child who is unable to appreciate the reasons.While the film does not indict the system of foreign domestic helpers, it frames its argument for considering the human cost involved in a gentle way.<br><br>The character of Teresa reminds us that those of us who were raised by nannies owe so much to them, and we often never acknowledge the debt fully.I completely admired the performance by Yan Yan Yeo who played Jailan's mother as the slightly humorless but ultimately kind woman.She navigates the role with the responsibility that the character must have felt, with her world crumbling around her in trying circumstances. Her performance is pitch perfect and I was amazed to know that her character was not conceived as being pregnant but after she was cast she became pregnant.She managed to convince the director to rewrite the role.Angela Bayani as the diminutive maid Teresa also delivers a stellar performance in a role that requires her to be vulnerable, strong, emotional, stoic and pragmatic at different points.Her chemistry with Jialer played by a very natural Koh Jia Ler is excellent and completely believable.<br><br>The beauty of this film emerges when we juxtapose its sombre sepia images with the glitz and glamour of present day Singapore.Needless to say the intimate and de-glamorized cinematography by French lensman Benoit Soler plays a big role in creating this magic.The humour is one of the strengths of the film and although I may not have understood all the jokes about growing up in Singapore, going by the reaction of the audience Mr Chen has been successful in his efforts.Yes I did go in with very high expectations and the film did not meet all of them but that should not take anything away from this sweet and intimate film.The quality of the craft is impeccable and there are no rough edges in the film which is remarkable for a debutant director.<br><br>I recently saw another period Singapore film – That Girl in Pinafore, which although not as elegant as Ilo Ilo tells an equally touching and boisterous tale of a group of teens being typical teens against the backdrop in xinyao music.These are the only two Singaporean films I have seen so far, but we foreigners who live in Singapore need to discover Singaporean cinema, which offers a window into its unique culture.<br><br>Anthony Chen is the new poster boy of the fledgling film industry of Singapore after winning the Camera d'or at Cannes this year.This is his first full length feature after making eight highly acclaimed short films. Ilo Ilo is certainly a glittering debut film and hopefully the first in a long and interesting career.It may be Singapore's first Cannes winner but there must have been better films which have not garnered this kind of limelight.One hopes that Ilo Ilo is a watershed moment in Singapore cinema.","user":"amit_imt2002","rank":[18,22]}]