[{"title":"Poetic and mesmerizing","rating":8,"date":"28 May 2017","review":"I absolutely adored this movie and I am only not giving it a perfect score because of the ambiguous ending. I had no trouble following the pace and flashing forward and backward in the character's mind. This may be a little confusing and irritating to some people though. The framing reminded me very much of the movie Closer. I think this movie Comet would best be suited for artistic, creative people and hopeless romantics.<br><br>I found the dialogue to be very real and I was on the edge of my seat the entire time. The two main characters have amazing chemistry together and I didn't even realize until someone else pointed it out in their review that they are pretty much the only people in the entire movie.<br><br>The scenery was absolutely beautiful and very inspiring. I think Kimberly was more wacky like Dell than she chose to believe. I think they were both very strange, offbeat characters and that is why they fit so well together but also why they tend to clash. The acting was absolutely amazing, definitely Justin Long's greatest performance.<br><br>I personally would like to believe in the optimistic ending which is that \"being pregnant and not leaving Jack\" is Kimberly's lie which she had never gotten to tell throughout their relationship. Dell had specifically told her the night that they met that she needed to choose the moment of her lie for a time when he was least expecting it and for when he was in A TRULY VULNERABLE STATE. So when he kisses her in the end and interrupts her, I think she was definitely about to tell him that was her lie and she finally fooled him. That is what I believe because I too do not want to live in a world where Kimberly and Dell do not end up together!","user":"Sweetigal85","rank":[21,22]},{"title":"It's a puzzle, an enigma you need NOT to solve.","rating":9,"date":"23 January 2015","review":"This movie was presented like a puzzle. You may want to solve it but the truth is, it has been pieced together all along. <br><br>Throughout the movie, the 6-year long relationship of Dell and Kimberly are flashed but not in a chronological manner. In fact, stages of their relationship are shown in clips that interchange the past and the present.At times, you could find yourself doubting if the events are real or were they some sort of a dream or a mere product of imagination.It may seem confusing, but it's really not. Basically, like how relationships are, the movie shows how they met, broke up, got together,etc... That's it. But what's endearing about this movie is how the story was told,how the characters were portrayed and the conversations they had.It's a masterpiece on its own. <br><br>Kudos to the director and of course, to the palpable chemistry of Justin Long and Emmy Rossum which has played a major contribution in making this film a masterpiece indeed. <br><br>Watching this movie might be confusing at first. Nonetheless, you never stop watching. That's how wonderful Comet is. It's wonderful. Truly a must-watch.","user":"yakirue","rank":[75,91]},{"title":"Cosmic Convergence","rating":7,"date":"3 March 2015","review":"This film is about the relationship of Dell and Kimberly, a young couple from Los Angeles. \"Comet\" follows their six year love affair in good times and in bad, with random scenes of private conversations set in various locales. The main pride of this project is its insightful and witty script brought to life by two sensitive actors.<br><br>The script is written by director Sam Esmail. It is amazing as a debut script for a debut film. His ambition seemed modest, but the final product can be enchanting. The script was full of memorable quotable quotes and eloquently-worded sentiments throughout its 90 minute running time, like the following:<br><br>\"He called himself a Bob Dylan song and proceeded to call me a Britney Spears song. I don't know what it means, but it sounds insulting.\" \"You're a now person. I'm a 5-minutes from now person.\" \"You said you believe in love. I don't. So let's put it to a test. Date each other, me and you, In a relationship. Let's do it.\" \"I don't belong in a world where we don't end up together.\" \"I never thought love was real, now I think life isn't real without it.\" <br><br>Justin Long and Emmy Rossum have excellent chemistry together. That is one big reason this film worked, despite feeling pretentious at first. Those long conversations may seem like senseless 'flights of ideas\" on paper, but these two actors make these lines believable and real. Glib Long plays Dell consistently throughout, the hip, pothead narcissist that his character was, around whose point of view the story is told. Beautiful Rossum plays his dream girl Kimberly going through a whole range of emotions like she was being two different women as she falls in and out of love with Dell.<br><br>Of course, we have already seen many movies like this. The \"Before\" series by Richard Linklater immediately come to mind. But instead of a continuous straightforward narrative, \"Comet\" breaks up the scenes into seemingly random order. This gives the film a more cosmic air that it aspires for. The gauzy, filtered photography and innovative camera angles also contribute to the dreamy effect. That final scene, a minute of silence as two suns rise over the horizon, packed such an emotional wallop.<br><br>This film is not literal. It leaves the audience to decide what the film means to them as individuals. You decide which was reality and which were dreams among the various events that flash before you on screen. Dell was telling himself (and us) from the very beginning, \"This is not a dream\". But is it, or isn't it? Now I think I want to watch it again. 7/10.","user":"3xHCCH","rank":[49,58]}]