[{"title":"Glad I rented this","rating":3,"date":"13 June 2016","review":"Glad I rented this, instead of seeing it at a theater. I'm shocked Reese Witherspoon agreed to this film. A very poor, silly comedy. I did however, see a glimpse of good acting ability in Sofia, when she showed her evil, serious side. I believe she could portray a great criminal, but that glimpse was simply that, a 20-30 second glimpse. I must admit, my wife was laughing and giggling throughout the movie at some of the more female oriented jokes. She seemed to enjoy it much more than I did. I was shaking my head almost the entire film. There was just too much slap stick to suit me. If you are a Sofia fan, you need to rent this. I don't think they could have showed much more of her body than they did without going to a higher rating. She is nice to look at but that screaming she does gets a bit irritating after a while. The film was only around an hour and thirty minutes long, I don't think I could have lasted much longer.","user":"UGA-Brewer","rank":[23,35]},{"title":"Hot Pursuit is a dismal comedy and a criminal waste of talent.","rating":2,"date":"28 July 2015","review":"I had low expectations going into this and even then I was shocked at how offensively unfunny this movie is. I can forgive a movie when it tries to do something inventive or experimental and falls flat, but Hot Pursuit is the most cookie-cutter \"buddy\" comedy you can imagine, using cheap gags that have been done a hundred times before and two talented leads that cannot save this abomination of a movie no matter how hard they try.<br><br>Reese Witherspoon and Sofia Vergara are talented and funny when given the opportunity. Hot Pursuit however goes out of its way to make them as unlikable, unfunny, and downright annoying as possible. Witherspoon uses a terrible Southern accent the whole movie, which is weird because she used a similar accent 20 years ago (Freeway) and it sounded perfectly fine. Vergara's accent is hard enough to understand but it's amped up to 100 here making half her lines indecipherable. There are moments where you can tell the two actresses are having fun, but the material is so lazy that none of it comes across in the actual dialogue. In fact the most enjoyable banter between them is during the outtakes where they're not obligated to follow the horrendous script.<br><br>I can nitpick this movie to death but what's the point. Watch the trailers - if it looks funny to you then you'll probably get a kick out of it. If not, avoid this like the plague. However as a fan of action comedies and stupid humor in general (The Other Guys and Harold &amp; Kumar are hilarious to me), Hot Pursuit failed on every level and then some.","user":"lnvicta","rank":[166,310]},{"title":"Irresistible girls and a great movie.","rating":10,"date":"9 May 2015","review":"Hot Pursuit is a 2015 American action comedy film directed by Anne Fletcher and written by David Feeney and John Quaintance. The film stars Reese Witherspoon and Sofía Vergara. The film was released on May 8, 2015, by Warner Bros. Pictures, New Line Cinema, and Metro-Goldwyn- Mayer.<br><br>Texas police officer Rose Cooper (Reese Witherspoon) grew up tagging along with her father, who was also a cop. After an accident, Cooper gets assigned at a dead-end job at the police station. One day she gets assigned to protect a drug dealer and his wife Daniella Riva (Sofía Vergara), who are going to testify against a drug lord. The pick up goes awry and Cooper must protect Mrs. Riva from criminals and dirty cops.<br><br>I totally loved this funny movie which has entertaining action scenes and girls that are sweeter than sugar.I wish I could hug and kiss Reese and Sofia because they are irresistible actresses.<br><br>See this movie, have terrific fun and forget the problems of life.","user":"avirariva","rank":[198,408]}]