[{"title":"Dark and twisted yet beautifully insightful.","rating":9,"date":"1 May 2015","review":"Somehow Courtney Cox managed to capture some of the everyday complications of life, parenthood, sexuality, marriage and adolescence and shaped them into a wonderful piece of beautifully twisted dysfunctional art. <br><br>Fine performances from everyone in the cast. Especially Sean William Scott as I am used to his 'stiffleresque' performances. He really shined in his performance which was quite refreshing and a good change of pace. <br><br>I wasn't sure what I was walking into when I sat down to watch this film but what I discovered was a rare gem of a film.<br><br>Great job Courtney Cox. A truly unexpected find this film was.","user":"DeviantHitman","rank":[75,106]},{"title":"A funny and heartfelt movie that wasn't what I thought it was going to be. It was better.","rating":7,"date":"11 May 2015","review":"\"My life had been a complete failure sure, but at least I could get my death right.\" Ted (Scott) has given up. His marriage has just fallen apart and he is left with only one option. He is returning to his hometown to tell off his old teacher, fight the man that bullied him in school and then kill himself. After finding the teacher, things don't go as planned and he starts to re-think his plan. This movie is surprising. It is at once funny, sad and entertaining. I expected this to be a very funny movie, and while it had its funny parts the movie is much more sweet and heartfelt that I expected. This deals with some very heavy issues, but in a way that it doesn't seem preachy or in your face about it. I did like this but it wasn't what I was expecting, not that that is a bad thing. Overall, a funny and heartfelt movie that wasn't what I thought it was going to be. It was better. I give it a B.","user":"cosmo_tiger","rank":[34,46]},{"title":"Really good film","rating":8,"date":"4 May 2015","review":"Excellent character creation, simple but thought provoking concepts.<br><br>Those expecting something like American Pie will be disappointed, its kind of more a movie for grownups.<br><br>Dramatic comedies are super hard to get right. Too much humor and the drama is overshadowed, too much drama and not enough laughs and the humor seems totally misplaced. The mix here, is really well done.<br><br>The humanity of everyone involved was awesome.<br><br>I was expecting a lot less, I just got watched it as a time killer and was so pleasantly surprised. In the same week I watched Jupiter Rising which was kind of the opposite quality.<br><br>Characters you didn't care about. A ridiculous plot that required all common sense being suspended.","user":"helpme-488-305631","rank":[56,82]}]