[{"title":"More of the same, only less so","rating":5,"date":"24 August 2013","review":"I enjoyed The Dead, which was an excellent old school zombie film fitting perfectly into the George A. Romero \"Dead\" universe. Many zombie films now are more action orientated, but The Dead had a haunting, even lyrical quality and it was beautifully shot and scored. It reminded me of survival adventure films I grew up with, like The Naked Prey and even Nic Roeg's Walkabout. <br><br>In this sequel the zombie plague spreads from Africa to India and we follow a new main character, who is strikingly similar to the lead in the first film. Some of the virtues of the first film are still evident here. The cinematography is beautiful taking in some stunning landscapes, the score is great and there is an emphasis on atmosphere similar to the original.<br><br>Unfortunately the second film contrives much more of a human drama and that's where the sequel becomes problematic. The hero has to rescue his pregnant Indian girlfriend, who comes complete with a traditional, disapproving father and neither the writing nor the acting are up to the challenge. The film lapses into melodramatic cliché and inadvertent comedy every time we spend time with the female lead and her family in Mumbai. Both \"The Dead\" films cast mostly non-actors. In an ideal case this can lend characters a sense of authenticity but here results in some awkward performances. In the first film the necessary alliance between the the engineer and the soldier was understated and not a lot of emoting was required. Here the lead actress looks uncomfortably out of her depth and her character lacks any qualities that would make us understand why our hero would be traveling 300 miles across the country to save her. To be fair, the actress tries hard but she isn't given much to do apart from crying and screaming.<br><br>Instead of the dignified, stoic soldier of the first film, here the hero gets a cute orphan right out of Indiana Jones and Temple of Doom as a sidekick. By not having a local character fighting next to him, the sight of a white character killing his way through hordes of brown skinned zombies becomes uncomfortable to watch. <br><br>On top of these problems, this is a film where characters do unbelievably stupid things in situations where they are surrounded by zombies to repeatedly get themselves into danger. And these folks never seem to learn from their mistakes. Twice the lead talks to his girlfriend about something confidential on the phone and twice her father snatches the mobile from her mid-conversation to overhear something not meant for him, which then sets him off shouting at her paramour. By the second time this almost comes to qualify as a running gag.<br><br>On the up side there are a few tense sequences and some decent set pieces. The non-computer enhanced gore is plentiful and inventive, which still makes this worth watching for zombie fans but every time the film takes us back to Mumbai for the ensuing family histrionics, the film stops dead for some eye-rolling Bollywood melodrama. At least it spares us a musical number.","user":"Boris_Day","rank":[23,33]},{"title":"excellent effects, story so-so","rating":7,"date":"21 September 2015","review":"Sequel to the much acclaimed The Dead (2010). On part of the effects when the zombies are biting in the human flesh that's okay. But what do makes it a bit cheesy is the fact that the main lead comes in contact with an orphan and takes him on his journey to save his girl.<br><br>Even that, that an American man falls for an Indian girl makes it awkward. Not that it isn't possible but she's pregnant of him and of course the father doesn't agree because he's deciding who she's going to marry.<br><br>So when the dead finally attacks India he has to save her an take her home to the US. And the orphan follows him all the way. That could deliver some nice action but it wasn't. Once the orphan is saved this flick becomes better especially the railroad scene with the crashed car. Still, it isn't a bad flick due the way it was shot, excellent of course just like in part 1. <br><br>Can't say that I was sitting on the edge of my chair, not really any suspense. A bit of Romeo and Julliet story combined with those damned biters. But the main question is, how many bullets can a gun take?<br><br>Gore 1,5/5 Nudity 0/5 Effects 3,5/5 Story 2,5/5 Comedy 0/5","user":"trashgang","rank":[4,4]},{"title":"The Dead 2 India: Stylish but flawed","rating":3,"date":"19 June 2018","review":"The first The Dead movie back in 2010 was an impressive looking film, the unique cinematography made it stand out from the hundreds of zombie movies out there but sadly that was all it had going for it.<br><br>The Dead 2 is a separate tale set in India and once again British made. It tells the story of a man fighting across rural India to get to his pregnant girlfriend and the perils and challenges he faces along the way.<br><br>The Dead 2 looks outstanding and even better than the first movie. It is a visual feast and touches upon areas that other zombie films never have before and that at least makes it memorable.<br><br>Sadly the film itself is generic, its weak in its writing and simply fails to entertain. <br><br>Don't get me wrong I respect the hell out of what they've accomplished here but it's like a video game with stunning graphics but very little actual content.<br><br>Worth it for the sights but little else.<br><br>The Good:<br><br>Some great visuals<br><br>Fantastically shot<br><br>The Bad:<br><br>Poorly paced<br><br>Weak writing<br><br>Things I Learnt From This Movie:<br><br>Despite both movies getting a combined 6 points out of a potential 20 I'd still like to see one more film in this franchise","user":"Platypuschow","rank":[4,5]}]