[{"title":"Dull and Forgettable","rating":3,"date":"27 March 2015","review":"The word \"insurgent\" means to actively revolt, implying some distinctiveness that sets its participants apart from the norm. Ironically, the film Insurgent, a faded photocopy of other teen- scifi-dramas, doesn't have a single unique bone in its body. Not that it's aggressively terrible. There are some decent scifi elements and even a couple of mildly intriguing moments. But like clockwork, every slight turn for the better is quickly overwhelmed by extreme boredom. Like a forgettable SyFy channel series masquerading as a blockbuster film, Insurgent is simply a dull and uninteresting sequel. That word \"sequel\" should connote a progression of sorts, but no. As little as I remember about the previous entry in the Divergent Series, I can tell you this: shaky cam action scenes, bloviating about \"special ones\", and constant fighting for the McGuffin-of-the- week were the focus and are still in full form here. At the center is Woodley, an actress with a whole heckuva lot of talent that simply doesn't have the presence of strength to carry this sort of role. She presents a microcosm problem for an entire film full of great actors terribly miscast. Teller and Elgort manage some natural charisma and charm from their otherwise absent characters, Watts and Spencer are all but completely missing, and Winslet is just plain wasted. It's none of their fault; they just can't make the embarrassingly constant melodrama palatable. Even if it was laughably bad there might be something to cling to, but it's not bold enough to even warrant that reaction. Insurgent only serves as a lame, achingly dull placeholder until the next Hunger Games installment.","user":"matthewssilverhammer","rank":[197,263]},{"title":"Genuinely Terrible","rating":1,"date":"21 March 2015","review":"I will preface this by saying that I have not read the books. I did see the first movie and actually enjoyed it. I usually watch movies such as this with a skeptic mind and the first one wasn't bad. This movie, however, was terrible. (Heavy spoilers roasting over an open fire to follow)<br><br>I've heard that the movie deviates almost unforgivably from the book. If that's the case, I can't speak for the book but the movie script looks to have been written by a high-schooler, at best. <br><br>The movie is riddled with clichés: Main character with a dark inner battle raging due to prior decisions made (boring!). People (and armies) showing up just at the perfect time (forgivable once, not around the 5th time). Bad guys who couldn't hit a target 20 feet in front of them while shooting an automatic weapon (man those guys suck). And the ultimate \"faked death with poison/paralysis\" scene (wow that whole scene was bad). <br><br>Throughout the whole movie the main character (the annoying tom-boy girl), Tris, keeps being painted as \"tough\" and \"deadly\". She is neither of these. In fact, she is quite laughably the opposite. Could her personal trainers not put her through some weight-training classes? (Her hairstylist was definitely present as her hair looked like she just stepped out of a Hollywood salon right after the scene where she cut her OWN hair with a pair of rusty scissors....) It looks like she couldn't even do 10 push ups yet she was fighting people and saving people falling over ledges with ease. But she looks like a huge wuss! Her little girly grunts and squeals she made when fighting or doing \"action\" made me bust out laughing. And the scene where she breaks through the glass is meant to be bad-ass and instead just left me hoping she would bounce off the glass and fall flat on her back (man, I wanted to laugh so bad). <br><br>And probably the most unforgivable part of this whole movie was how POINTLESS everything was. Examples: They fight the faction-less on the train, killing several and doing serious damage to many more (not really sure how because Tris fights like a sissy girl). Then the main character, Four, says his own name and the leader of the vagabonds through bloodied teeth is like, \"Oh we cool bro. Never mind you just head-butted me in the face and killed my friends.\" (the Hell??) (Oh and Tris's brother is a huge pussy). They continue to fight hard and kill people to narrowly escape the perfectly- uniformed drone guards of the \"capital\" so that they can go in to hiding. Then the main character just gives herself up. I think it was because the villain was threatening to kill innocent people with her mind control devices (never seen that before), but it doesn't really matter. Then she's given the chance to escape by her double- double crossing 'friend' (didn't see that coming) and yet she chooses to stay to open the mystery divergent box. Well what was the point of anything if you wanted to open it anyway??! I was DYING to contain my frustration. (also, how does the evil capital lady have this perfectly built divergent-box-opening proprietary chamber system, complete with bulletproof glass and mystery-box holding pedestal, just already set up? Does no one question this stuff???)<br><br>And to top it all off, the super-secret, must-be-preserved-at-all- costs message in the box, (the ENTIRE point of the movie): \"Divergents are cool, don't ostracize them. Oh, and the rest of humanity is living outside the wall. Cheers.\" What? No one has bothered to check this whole time?????? Gag.<br><br>Enough roasting. To conclude, lots of movies, even good ones, have clichés and information that you are just supposed to assume. But this movie was genuinely terrible. Maybe all the people reviewing this with an 7/10+ saw a different movie than I did.","user":"paintballisbasic","rank":[180,241]},{"title":"Bad enough to make one doubt IMDb ratings forever","rating":5,"date":"14 May 2015","review":"Divergent was not brilliant, but it was your average young adult movie. Insurgent is way below that. It is so bad that I wanted to leave the theater and read my book.<br><br>But anyway, let's talk about the movie. In the first film Tris learns she is special, in the second she learns she is *very* special, but just if her boyfriend lets her do anything. Seriously, I actually had to ask my wife if girls like guys like him or is it just the submissive fantasy of the author. Apparently, a lot of girls like overbearing assholes who think they know what is better for you. And guess who makes her appearance in the sequel? The mother in law!<br><br>Bottom line: the sci-fi aspect of the film was marginal, the characters clichéd to the point of monomolecular cardboard and the basic story was learning to accept yourself as your boyfriend tells you what to do while he deals with his mommy issues. I am not kidding: the most sympathetic character in Insurgent was Peter, the asshole who always insults and betrays everybody.<br><br>P.S. The Erudite test was remembering something that had happened to you two nights ago? Really? That's what makes you smart?","user":"siderite","rank":[166,229]}]