[{"title":"Even the brilliance of Anthony Hopkins couldn't save it.","rating":5,"date":"14 October 2015","review":"Amsterdam 1982, the recession has hit hard. A group of friends and builders are down on their luck and are refused a bank loan. It's spokesman Cor van Hout proposes an outrageous plan, to kidnap local millionaire, the successful Freddy Heineken. The group test the waters by carrying out a bank heist, then carry out the daring dead, taking Heineken and his driver, holding them hostage, issuing a huge ransom demand. Cracks appear in their unit, and their family lives suffer too.<br><br>Most of the positives surround Hopkins, he gives a masterclass in acting, his performance is understated and yet believable. Some of the best scenes in the movie revolve around his demands for Chinese food, books, Schubert etc, it's very random but enjoyable.<br><br>One entertaining moment when the team realise they've left the ransom note in a photocopier nearby.<br><br>Sadly the film didn't keep my attention, it's the kind of film you'll need a crossword or Sudoku puzzle. Unfortunately it is quite boring, the plot was a good one, I think possibly had some humour been added to it that may have helped, as a thriller it just doesn't work, there's no tension or drama caused, you never feel at any point that the gang truly mean business.<br><br>As for the accents, some of them wanted to go Dutch, some of them didn't, it felt inconsistent.<br><br>It could have been so good. I've only seen a trailer for the Dutch production, but that seems to have the atmosphere that was needed, this production is sadly a week old unwanted glass of Heineken, FLAT.<br><br>5/10","user":"Sleepin_Dragon","rank":[18,18]},{"title":"Anthony Hopkins is kidnapped as Freddy Heineken in 1983.","rating":4,"date":"4 August 2015","review":"The events of 30 November 1983 when Freddy Heineken was kidnapped in Amsterdam are well-documented. It resulted in the highest paid ransom up to that point in history. <br><br>The movie is a bit disconcerting because it features an all-star cast of British actors, and a former Brit as Mr Heineken, but overall did not detract too much from the story when you finally realize they are all Dutch.<br><br>The group of five men are depicted as needing money, they have what seems like a legitimate business but need a bank loan. Unable to secure that they resort to crime. The plan is to kidnap Freddy Heineken, hold him for ransom, and expel all their financial woes.<br><br>Anthony Hopkins, former Brit and now American citizen, is very effective as Freddy Heineken. As history witnesses the men were able to get the money, split it up, and get away. But only for a short time. Even though two of them managed to get to France, and one to Paraguay, they all ended serving prison terms. Not all of the money was recovered.<br><br>There is nothing very special about this movie, mainly interesting because of its historical account. The crooks are depicted as mostly bumbling, they had no real strategy for the aftermath of the kidnapping and ransom delivery.","user":"TxMike","rank":[7,7]},{"title":"Fine Hopkins turn in mediocre crime film","rating":2,"date":"2 March 2015","review":"Anthony Hopkins lends his name and histrionic talents to uplift an otherwise pedestrian real- life crime thriller KIDNAPPING MR. HEINEKEN. Without his presence this would be just another direct-to-video feature of European origin.<br><br>Don't get me wrong -I've been a huge fan of European-made caper and action movies since childhood, growing up watching innumerable dubbed -into-English low-budget imports on TV via syndication packages back in the '60s. At the high end, Jules Dassin's RIFIFI remains the unbeatable greatest caper movie of all time, and the various big-budget, in-joke titles like the original and update series of OCEAN'S ELEVEN are watchable. But give ma a silly Brad Harris-Tony Kendall intl. co-production and I'm in heaven.<br><br>With a weak script by William Brookfield, based on Peter de Vries' reportage and book about the beer company magnate's 1982 kidnapping, this film turns out to be lacking in entertainment value. The criminals, a rag-tag group of businessmen/slackers who turn to crime when their unreasonable application for a business loan is turned down, are simply an uninteresting bunch and their reluctance to resort to violence (lethal or otherwise) is morally laudable but leads to dullness - the picture has no sex and no real violence, hardly suitable for today's audiences. And it lacks humor, not even of the Disney or OVER-THE-HILL GANG puerile variety.<br><br>Only interesting structural note (which ultimately backfires) is the script's purist approach whereby every scene is presented from the criminals' point-of-view. In a kidnapping story the viewer is used to time-honored clichés regarding the police (or FBI or Interpol) and the victim's family and associates -what they are doing to get Heineken back alive and catch the baddies. But here we have none of this, only scenes about the kidnappers and their apprehension at getting caught. This novel structure (cops only appear sans dialog to pursue or make arrests) violates Hitchcock's famous dictum about suspense -all we get are surprises because we (like the kidnappers) are narratively left in the dark. We never see the net closing in on them, apart from a few red herrings based solely on the criminals' own paranoia.<br><br>Jim Sturgess as head kidnapper Cor, a family man with pregnant wife who inexplicably throws all that away to become a fugitive merely longing to return home from his Paris hideout, is empathetic and acts well enough, but can hardly carry a film. The role called for an A-list name, perhaps his supporting co-star Sam Worthington, miscast as Cor's brother-in-law, written as a hothead but unconvincingly played by Sam who the viewer is used to seeing (after AVATAR) as a leading man.<br><br>Hopkins in as brief a screen time as won Judi Dench an Oscar for Shakespeare IN LOVE, easily dominates the film with his brief but pungent &amp; idiosyncratic monologues -he gets to speak unanswered because the hooded kidnappers don't want to respond to him verbally at all. You can see the wheels turning in Hopkins' head as he cleverly tries to get into the heads of his adversaries and casting him was a bold stroke (probably the reason Worthington signed on to an unpromising project at this stage in his career).<br><br>I did not like the camera-work and editing of the movie, especially during action &amp; chase scenes such as a boat vs. cars sequence on Amsterdam's canals after the boys had robbed a bank delivery van to raise capital for their big Heineken snatch score. And the musical score is horrendous, sounding like a distant copy of those classic 1970s British action movie scores, notably echo-chamber brilliance for Roy Budd's GET CARTER (a movie by Mike Hodges that was among my very favorite films when I saw it several times in 1971 in first-run).<br><br>Regarding film's factual basis, that issue is irrelevant to me - I love both LAWRENCE OF ARABIA and BRIDGE ON THE RIVER KWAI regardless of either's allegiance to the original text. HEINEKEN merely proves that a purely fictional movie has more leeway to be entertaining and fanciful - the details here are pretty mundane, the degree of jeopardy for Heineken and his also-kidnapped chauffeur being minimal. The actual bank heist and people snatching are over in seconds, robbing the viewer of the fun which crime caper movies (TOPKAPI, RIFIFI) can provide, even in a silly one like Connery/Zeta-Jones' ENTRAPMENT. And the decision to make HEINEKEN the usual faux-British movie with all principal roles given British accents and speaking English (why not Dutch accents, as Holland with Derek De Lint, Rutger Hauer and endless beautiful actresses has the best English-speaking talent in all of Continental Europe) hurts its real-life credibility. I half expected a certain class of characters here to speak Cockney like Hollywood movies used to do in the 1930s for working-class characters in German or Russian set stories.","user":"lor_","rank":[68,95]}]