[{"title":"Breaks the golden rule of a good slasher flick","rating":6,"date":"30 September 2016","review":"The rather blandly named, The Windmill Massacre, breaks the golden rule of a good slasher flick and pays the price.<br><br>Let me start by saying this is a film with definite potential. Its far from utterly bad. It employs a good cast of capable actors, a rather novel and fresh premise, plus some good horror elements. That said, it breaks the key rule of any good slasher flick, its not all that scary. <br><br>Th reason The Windmill Massacre is not overly scary lies in its scripting. After the first death, there's very little uncertainty as to who, how and when the next person, will die. Indeed, there is a \"lead in\", that tells you for the most part, whats about to happen to who, next. <br><br>The net result is a film robbed of the sudden death, \"jump in your seat\", surprise factor. That's what good slashers are really all about. Not the final dispatch but the dread and tension, leading up to that suddenly and violently realized moment, when the killer strikes. <br><br>Its a shame too, as this film looked promising. Even making a second film may not solve this issue, as the approach taken is more or less, \"locked in\". That is, its intrinsic to the legend built around the killer. As it stands then, a moderately entertaining horror film, that offers some entertainment value, but could have been so much more. Six out of ten from me.","user":"s3276169","rank":[20,26]},{"title":"Decent slasher with good kills, ....","rating":7,"date":"23 October 2016","review":"...n a supernatural touch to it, with good character development n picturesque cinematography. I was really excited to see this film. Had read somewhere that the extended clip of this film was released way back in 2013. Been on my watch list for a very long time. Finally bought a pirated DVD for 50 rupees. I think that my DVD was a different version as the scene (the killer in yellow jacket chasing a female in broad day light n piercing her hand from the centre of her palm) shown in the you tube trailer was not there. Considering that this is Nick Jongerius debut film (Producer of Frankenstein's army), he did a decent job. I skipped his Frankensteins army as m not a fan of hand held camera. Well this is not a great film but not bad either. Horror fans may like it. Slasher fans will enjoy it more. It has shades of Hatchet part one, Jeepers creepers part one. Some solid gore n killings. Being a debut film, it did showed the directors lack of creating suspense n tension. But he managed to develop the characters well. Some nice writing there. Some lovely cinematography by Bart Beekman. Decent editing. The only thing I did not dig was that of the marine's \"sin\". Wasn't it an accident? Also the doctor's? Can someone explain plz.","user":"Fella_shibby","rank":[11,13]},{"title":"I liked it","rating":6,"date":"29 October 2016","review":"Windmills are cool - we all know this. So naturally when I saw there was a horror movie centered around a windmill, I was all in. When I saw that it wasn't another shitty found footage movie, I was even more intrigued. After watching it, I can honestly say it's one of the more enjoyable horror films I've seen recently (and there aren't a lot of those, let me tell you). It's a slasher flick basically with an interesting setting and some creative and gory kills, at least two of which genuinely took me by surprise and gave me a bit of a jump. The windmill backdrop itself is the movie's biggest plus although I was disappointed they didn't make better use of the location scenery. Most of the movie takes place on what appeared to me to be an obvious set. Had more of it taken place where they filmed the initial windmill stuff it would have been better, in my opinion. But I guess that would have made doing proper special effects more difficult on a low budget. As it is, there's nothing really 'wrong' with the set, just that I think it would've been more effective using more of the location shooting. Anyway, the cast is good. There's a guy who reminds me of Long Duk Dong from Sixteen Candles. There's never anything bad about that. As I said before, the kills are mostly creative, and some of the gross-out stuff is funny. It's definitely worth a look if, like me, you are tired of most of the horror output today, which seems to be found footage and knock-offs of horror classics like Exorcist and Poltergeist.","user":"utgard14","rank":[8,9]}]