[{"title":"The best the producers could make!","rating":9,"date":"18 January 2016","review":"I am a fan of Alvin and the Chipmunks since 2013. This is a review from my heart. I really loved the movie. For it is the best of the four movies. The movie is funny, have a wonderful songs and a great story. However there are two things I disliked. All right, I understand why the Chipettes' role was smaller, but why it had to be in that way? The second thing I disliked on the movie was the lack of affection between Simon and Jeanette, I understand that they had a movie for them (Chipwrecked), but the producers could had put something like Simon calling Jeanette during his trip. I love them so much ! Anyway, the movie is perfect and it worths the money!","user":"sidneyfmn","rank":[18,25]},{"title":"This cured my cancer","rating":10,"date":"21 July 2018","review":"That's all I need to say. BEST MOVIE IN THE HISTORY OF THE OMNIVERSE.","user":"superryan-65608","rank":[16,22]},{"title":"Me and my dear son Muhammad enjoyed watching this great family movie.","rating":10,"date":"21 December 2015","review":"I can not believe how this great family movie is so underrated despite the fact it is a terrific movie.<br><br>Me and my dear son Muhammad enjoyed watching this perfect family movie from the beginning to the end. The low ratings does not clearly prove that the film is bad.Also,the negative comments by movie critics and IMDb critics don't necessarily mean that this movie is bad at all.<br><br>It is important to tell you that this film: \"Alvin and The Chipmunks:The Road Chip\" is currently achieving enormous international success at the movie box office. In the USA,it is a new entry at number 2 and elsewhere,it is number 1.(This is a very good evidence that despite the low rating,the movie is successful ).<br><br>Finally,I advise every person whether an adult or a child who want a fantastic comedy/adventure movie is to see this movie and you will be quite happy.","user":"muslimbellydancer","rank":[90,160]}]