[{"title":"UFO enthusiasts will like it . . . others - not so much.","rating":7,"date":"7 April 2017","review":"I scored the film quite highly because I genuinely enjoyed about 80% of, but I went into it knowing it wasn't exactly going to be a groundbreaker.<br><br>Without wanting to give too much away, it incorporates a lot of UFO mythology and people who are into that kind of thing will probably enjoy it, as I did. The special effects are very well done, for a film without a huge budget and the UFO's are genuinely ominous and 'other - worldly'.<br><br>The plot isn't too bad really, it ends in an interesting way that you probably won't expect and there are some scenes in the last 20 minutes that are actually quite spectacular.<br><br>It's bad points though - the actors are a bit annoying and not very endearing. The main couple are quite nice and their story plays out well, but everybody else in it seems to just be there to add filler to the plot. One of the guys in it is actually very annoying, from start to unfortunate end.<br><br>It's all a bit loud and flashy and over the top in parts as well. The musical score is definitely not up to a very high standard in my opinion.<br><br>I think it deserves a little more respect than some reviewers have given it - but not much. ;-)","user":"fexibepass2","rank":[12,13]},{"title":"Really fun late 80's adventure horror - just three decades too late.","rating":7,"date":"15 May 2015","review":"As I look through the IMDb scores for Extraterrestrial, I have a theory that the lower ones are coming from children of the 90's and aughts - those who have grown up to expect a particular bleak atmosphere from alien abduction movies such as that set by efforts like 'Dark Skies' or 'The Fourth Kind'.<br><br>I suspect the reviews giving it the higher scores are from kids who grew up in (or are just fans of) the older school 'adventure' horrors that became popular in the late 80's. Movies like The Lost Boys, Waxwork, Evil Dead 2, Night of the Creeps, Return of the Living Dead 2, Creepozoids, The Blob remake etc. - you know the ilk, movies whose subject matters varied wildly yet they always had the same sort of vibe - a fast-paced, popcorn-entertainment 'adventure' feeling.<br><br>That, I feel, is what the Vicious Brothers were purposefully going for in Extraterrestrial. Although they mixed in a generous dollop of the 90's cabin in the woods type characters and the 2000's abduction movie clichés, it's the late 80's vibe that rings clear throughout. If Extraterrestrial had been made 25-30 years ago, it would likely have starred the Two Corey's, or perhaps Zach Galligan and Brinke Stephens. The cop would have been Tom Atkins or Lance Henriksen; and the crazy Michael Ironside character would have been Dick Miller... or perhaps Michael Ironside, come to think of it.<br><br>Bottom line is, Extraterrestrial clearly has a primary intent of being fun rather than scary. There's a few creepy moments - most memorably the skeletal body of a dead alien vanishing into the murky waters of a swimming pool - and a few more serious turns towards the end, but overall, it's more of an adventure/survival flick than a psychological/terror flick. If we still had drive-ins, it would be playing in them right now to crowds of frisky teens instead of on Netflix.<br><br>Check your expectations before you turn it on. You're not going to get scared, or grossed out, or made to think too hard, or put on the edge of your seat with tension... but if willing, you are going to have a lot of fun. 7/10.","user":"The_Dead_See","rank":[27,36]},{"title":"Am i the only person who really enjoyed this?","rating":9,"date":"27 April 2015","review":"Yeah, there are some plot holes, and some bad acting. BUT apart from that, the overall performance was amazing! Very intense and contains a lot of breath taking and jaw dropping moments. I loved this movie because it was a great sci-fi movie with amazing special effects which incorporated everything that one would expect when you think about 'little green men'. Another reason i liked it was because it ended greatly. (NOT SPOILING) but the ending to this film is very different to other films. It did not leave you saying \"what the heck\". This movie did have some pointless moments that didn't really need to be included, but when you think about it, without them.. The movie would be a waste of time. I will definitely be buying this movie on DVD, or better yet on Bluray! It is definitely an original film that you can watch over and over! Recommend this to almost everyone!","user":"joshuaburles-646-993208","rank":[55,83]}]