[{"title":"More of an Infomercial than a documentary","rating":6,"date":"10 June 2015","review":"Right off the bat you see that the \"documentary\" is made by Insomniac, the same people who host EDC. It follows a few groups of concert goers to the Electric Daisy Carnival in 2013. It starts off entertaining and visually spectacular, but soon digresses into what seems like a promo piece. Approximately 350,000 people show up to this event and it's pretty much just about the positives about the event (which I am sure it mostly is).<br><br>Other than a little puff piece about EMTs helping people in need, there is no coverage of the economics, sanitation effort, parking, traffic, food, actual security, event erection, and teardown, local public opinion, actual injuries, drug/alcohol overdoses, legal hurdles, logistical challenges, etc.<br><br>Where they lose me is when the Texas girl gets picked out of the crowd of vast people to get up on stage with her beloved DJs Above and Beyond, and gets to participate in some token gesture of pushing a button starting the music up again. This was clearly scripted.<br><br>Overall it's an enjoyable watch, but fairly repetitive. Watch the 20 minute 2012 Tomorrowland official video on youtube (which is fun), if you want that video to last for 85mins, then this is the flick for you.","user":"NurgleTheUnclean","rank":[6,6]},{"title":"Best dance documentary of all time","rating":10,"date":"9 July 2014","review":"\"EDC: Under the Electric Sky\" captures why people go to parties and why I became a DJ. Everyone has their own \"why\" and when we all come together as one, to laugh, dance and celebrate, magic happens.<br><br>A connection between common strangers woven together by music, love, good energy and respect. Whether you have been to EDC every year or have never heard of it, see this movie! <br><br>Everyone has something they can relate to in this film. If you don't understand why we go, see this movie and you'll know. House music is something felt more than heard. Same thing with this film, see it but \"feel\" it too and you will understand the message.","user":"brian-26-891932","rank":[14,20]},{"title":"Honest, uplifting documentary","rating":9,"date":"30 October 2014","review":"It was quite surprising the group of people that Insomniac chose to follow for this event - not going for sexy &amp; stylish, but the real, raw, silly, and the sometimes foolish to truly capture the diversity of people drawn to events like EDC. It was very refreshing in a documentary. <br><br>I've seen many documentaries where the influence of the camera is very felt in the final product - one can imagine that we are not witnessing actual real life but something deeply influenced by a camera there to watch it all. I don't get that feeling at all in this documentary. It's an authentic look at these people's lives and what events like EDC and the music means to them.","user":"sdeep27","rank":[5,7]}]