[{"title":"\"I don't know when to quit!\"","rating":8,"date":"16 November 2017","review":"Well, I'll tell you what. I'm not a big fan of animated features but this one was a blast and a half. Just when I thought Flash the Sloth at the Zootown DMV couldn't be topped, we wind up meeting Mr. Big doing the Marlon Brando \"Godfather\" bit. I thought both were hilarious, but Flash was inspired - who hasn't run into someone with no sense of urgency clogging up your day like that? I couldn't stop laughing.<br><br>I also got a kick out of assistant mayor Bellwether, very reminiscent of Shari Lewis's Lambchop from her TV show during the early Sixties, which goes to show you how long this reviewer has been around. Too bad she had to go rogue and hit Nick Wilde with the savage pill.<br><br>As for the larger story, there are some good messages here for the kiddies, like 'being all you can be' and chasing your dreams no matter what the detractors might say. I'll concede the messaging at times got a bit too political and can understand some of the reviewer backlash on this board. But still, the more meaningful theme that comes out of the story is best expressed by a line in that Lady Gazelle song - \"I want to try even though I could fail...\". It's a good one for kids who are tentative about trying something new and fear embarrassment if they don't measure up. A responsible adult could go a long way to help foster that message.","user":"classicsoncall","rank":[53,60]},{"title":"Best Disney movie made ever!","rating":10,"date":"9 January 2018","review":"How can someone not like this masterpiece!<br><br>the characters they created are awesome!\nthe world they created is mindblowing!\nthe story is good!<br><br>Everything about this movie is just awesome!","user":"sennotaphoorn-41473","rank":[86,104]},{"title":"One of the best of the recent Disney CGI cartoons","rating":8,"date":"23 December 2017","review":"As much as I liked movies like Toy Story and Finding Nemo, it made me curious about other CGI animated movies. I didn't actually see this movie in theaters, but I did rent it and was pleasantly surprised. Not everything is in black and white in this movie, and various stereotypes are broken. And things are not always what they seem. I loved the main characters and they all get my standing ovation. This, along with Wreck-It Ralph and Big Hero 6 are my favorites of the non-Pixar Disney CGI films. If you like anthro animals and want to see them in a somewhat modern setting with no humans, look no further!","user":"Spike-Washington","rank":[23,27]}]