[{"title":"One of the most stylish and fun thrillers of the decade.","rating":9,"date":"13 May 2015","review":"It's a bold statement but I stand by it. This movie had everything I wanted and a hell of a lot more. The plot in a nutshell is that a guy named David (Dan Stevens) goes to the house of a soldier who was KIA and claims to have known him personally, so the family invites him to stay. Then things start happening, secrets come out, and sh*t goes down. Simple premise, and if it sounds familiar it's probably because it's been done many times, but never quite with as much finesse as The Guest. <br><br>The writer and director are the same team that brought us You're Next and a few segments from V/H/S and V/H/S/2. Personally I loved You're Next - it was a straight up horror comedy with little to no surprises. Here, the duo hone their strengths into their magnum opus so to speak. The Guest is an action thriller, but there are a lot more elements at work. It's dramatic, it's funny, it's intense, and it gets pretty frightening at times. The scope seems very wide but it all flows together without a hitch, and each emotional reaction keeps your eyes glued to the screen waiting for what happens next. <br><br>The Guest is held together by its lead, Dan Stevens. I haven't seen him in anything before this but he was flawless in this role as an enigmatic, seemingly charming family friend. David is immensely likable, even when questionable things start happening you still want to root for the guy. He just has a badass aura around him. Dan Stevens plays him with such conviction that you can't see through him and you have no idea what is going on in his head, but you know that there's more to him than meets the eye.<br><br>When I say sh*t goes down in this movie, I mean it. Sh*t. Goes. Down. I won't spoil anything but The Guest has one of the most stylish, suspenseful, colorful, and downright invigorating third acts in a movie I've seen in a while. It's f*cking magnificent. Some people are split on this opinion but honestly, I thought it was an absolute blast. It takes place in a Halloween fun house; as soon as it began I turned into a giddy schoolgirl. Yeah, it's just that much fun. The first two acts are impeccable as well, building up the tension and suspense to a level of tangibility that you can cut with a knife. <br><br>The characters surrounding David are all great as well. They're your typical family, and although it may seem like they're just caricatures, they are completely convincing in their roles largely due to the realistic dialogue. Everything progresses believably and exactly how you'd want it to, and the predictability is a strength in this case because it gives the filmmakers a chance to make the simple premise as shiny and creative as possible. I was not bored for a minute of this movie. The soundtrack is phenomenal too - it has an '80s thriller vibe and a lot of dark electronic grooves similar to those in You're Next but even better.<br><br>The Guest is an action-thriller buff's wet dream, and it even throws in some horror for good measure. It really is one of the most underrated movies of 2014 and an experience that no thriller fan should miss out on.","user":"lnvicta","rank":[206,252]},{"title":"A fun and self-aware thriller; retro without being old fashioned","rating":7,"date":"29 August 2014","review":"I've never watched Downton Abbey, but I'm guessing that Dan Stevens deliberately sought out very different roles after leaving the show. The Guest is the perfect advert for his abilities. He's convincing as the mysterious but charming visitor and equally capable in moments of action, suspense or humour. I hope the right roles come along for him as he's entertaining to watch and has got everything required to become a major star.<br><br>The plot unfolds in a fashion that renders a summary both unnecessary and unwanted if you're planning to see this, but after the initial set-up it progresses at a decent pace and with escalating tension.<br><br>A special mention is required for the soundtrack. The electronic score is one of the film's major strengths and is perfectly judged.<br><br>An entertaining and self-aware mix of action, suspense and dark humour, the Guest has a retro feel without being old fashioned (a quality that is encapsulated by the score), and features decent performances.","user":"leominosa","rank":[154,210]},{"title":"'80s nostalgia with modern visuals","rating":8,"date":"24 December 2014","review":"It feels almost inaccurate to refer to this movie as The Guest when in reality it was entirely carried by a wonderful performance by Dan Stevens. I enjoyed it thoroughly, which isn't at all to say it's what I would normally call a good movie. The movie is highly campy, reminiscent of '80s-'90s action movies / thrillers, and Dan Stevens brings in an excellent all around tongue in cheek tough 80's anti-hero performance. <br><br>Stevens' acting is well matched by strong action that is to the point and not drawn out, as well as superbly chosen music, particularly in the climactic scenes. <br><br>For any gamers out there, if you enjoyed Far Cry 3: Blood Dragon for the nostalgia and humor, you'll likely love this movie as much as I did.","user":"Transcendentals","rank":[63,85]}]