[{"title":"Hostel Ink presents abundance of sex, gore, and little else. Horror fans may appreciate the carnage, the rest and fainthearted might want to steer clear.","rating":5,"date":"13 May 2015","review":"Plenty of exotic location and culture to explore, yet Anarchy Parlor still ends up with typical dumb college kids encounter with danger as its main plot. There are so few of likable characters as they are spewing profanities as replacement for acting, these guys are true representative of swag generation. Thankfully, the lead Robert LaSardo is physically and verbally convincing. Fans of the genre might find the gore very uniquely adequate, the shameless fanservice nudity is surprisingly good as well.<br><br>Set in Lithuania, a group of dumb college kids fornicate and party a lot until they happen to stumble on a tattoo parlor. The Artist (Robert LaSardo) is strange yet philosophically suave, unbeknownst to them he also harbors a sinister secret. Fans might recognize this set-up from Hostel, and to be frank, there's not much else here. Aside from The Artist himself, the rest of characters are tediously uncharismatic.<br><br>Script is filled with curse word as though the movie tries to set a record of cursing per minute. At times these guys and girls make decisions so horrible it's mind-boggling they are not shanked by random people yet. Not to mention one particular girl screamed so unbelievably annoying, I rooted for the bad guy to finish her and end my misery. It's not an understatement that the characters are mirror image of Jersey Shore cast.<br><br>What separate Anarchy Parlor are the detailed bloody sequences it presents. Make-up and practical effect like the blood work are disgustingly good down to all the nasty bits. It's not the typical slasher flick mayhem, but a lot more of solemn cutting action, the movie revels in it. There are also tons of sex scene and nudity, which are honestly good. This might just be the level of softcore production value. I guess that merits more point in rating.<br><br>As the screenplay is lackluster, a decent performance by the lead doesn't negate the rest of the loud bickering, it's quite hard to recommend this to casual audience. Furthermore, the gore is exclusively sickening. Anarchy Parlor is designed especially for horror fans only, the rest needs not enter.","user":"quincytheodore","rank":[33,41]},{"title":"Robert LaSado saves it from being a total dud","rating":4,"date":"7 July 2016","review":"A very simple 'lure tourists into a dodgy place in order to do despicable things to them' type of horror.<br><br>Overall the acting is poor but Robert LaSado is the saving grace here (you might not recognise his name but you've most likely recognise his face).<br><br>I mean he can't make you care for the other characters fate of course (being that most of them are such poor actors and very duchy you kind of feel like they deserve to die... in the movie that is) and it doesn't ever really get scary for the same reason (and plot and directing etc of course as well) but Robert LaSado is an effective bad guy and with any lesser actor this could have flunked completely.<br><br>But the Gothic atmosphere is pretty cool as well, and plenty of eye-candy (the women most likely got their roles for their willingness to appear nude more than their acting-abilities... but then they are no worse than the other guys).<br><br>So yeah definitely nothing you need to see but nothing you have to absolutely avoid either, if it's on TV one late night or so.","user":"Seth_Rogue_One","rank":[11,12]},{"title":"Meh...","rating":4,"date":"14 November 2016","review":"This is What i have to say about this movie, interesting premise and painful acting. Its trying to make a cross between saw and hostel but the result ends up a mess there Is nothing that stands out besides some gory scenes and a bunch of cliché characters its a very generic.<br><br>The only actor that's stands out Is Robert Lasardo if you seen a lot of 90s action movies you probably stumble with him as a henchmen he Is that guy full of tattoos with one liners( a discount Danny Trejo if you will)i have to admit this guy can actually act and his passion for tattoos can be shown this role was meant for him and he nailed it. <br><br>Honestly don't waist your time even if Lasardo Is good in this, its probably the only good thing in it.","user":"DogFilmCritic","rank":[5,5]}]