[{"title":"For Germans only","rating":8,"date":"17 January 2018","review":"A clear 8 star comedy, but any dubbed or subtitled version will not work. The film is a social satire based mainly on exaggerated slang and German teenage stereotypes. Its success is not linked to its plot. It does not want to send any message.","user":"lucardpicard","rank":[15,22]},{"title":"You have to understand German","rating":10,"date":"27 December 2018","review":"The film is one of my absolute favourite films, but as some of you have already written here, you have to understand German. Subtitles just don't work, because the movie mostly uses vulgar expressions and a certain pronunciation that simply can't be translated.","user":"funny77","rank":[9,12]},{"title":"Better than expected","rating":6,"date":"10 January 2014","review":"In Germany this was the \"hot\" autumn movie that everybody liked, the critics as well as the audience. When I watched it, I did not expect much, thought by the trailers it was stupid, but I have a knack for shitty teenager/school movies. Its the story of Zeki Müller, a convict who was just released of jail. While looking for the loot of his last robbery, he gets confused as replacement teacher - a great opportunity to take time and slowly dig out his treasure, who is hidden under the schools gym. He soon gets appointed to the worst class and gets along with a \"Dont bother me at all\"-attitude; for what he clashes soon with Lisi, a young idealistic teacher and former class mate of his (ad sure, the potential love interest of the movie). I expected a run-off-the-mill rom com, but, well, it was little kind of better. Especially the first half is original since they show Zeki as a kind of guy, who not only does not care for the pupils, but is not afraid to look bad as often in this kind of movies. Elyas M'barek, Germanys upcoming young male movie star, does a nice and convincing job here, while I did not like him in his former roles. It is also nice, that while education is a big subject in Germany these years, producing heated political debates and book bestsellers, they do not take the schooling aspect too seriously and keep it easy. Its not a really great movie too, because the second half follows the formula totally and leads to the obvious happy end and has the \"everybodys' got talent\"-message mostly of the movies with troubled teenagers have. But if you like those type of movies, its worth a look.","user":"Ehrgeiz","rank":[20,38]}]