[{"title":"Not worth your time","rating":3,"date":"18 March 2014","review":"I did not have any expectations when I first started to watch this movie, and I'm sure glad I didn't have any either, because this was not a movie that should have seen the light of day, the acting is really bad.<br><br>The supposedly SEALs does not act like I have a feeling SEALs should behave when they're taking fire and maneuvering. They just run around with guns blazing, killing tonnes and tonnes of bad guys. And guess what? The bad guys don't know how to shoot, at all. A little like Rambo, except it isn't. <br><br>The acting is really not that great, Tom Sizemore does not convince me, and brings little to the table. He's just walking around swearing a lot looking at a screen, and then he swears some more.<br><br>There was just one thing in the movie that made me happy, and that was a \"Saving Private Ryan\" reference, if you've seen that movie, you'll recognize it when you see it, if you actually decide to watch this.<br><br>Last but not least; This movie is FUBAR.","user":"dan-eliassen","rank":[28,36]},{"title":"What the F@#$!!!!","rating":1,"date":"21 March 2014","review":"OK, this is seriously so bad that I made an IMDb account just now for the sole purpose of warning people of the crappiness of this thing.<br><br>First, as another reviewer said, the acting is just terrible.<br><br>Second, I just CANNOT get past the absurdities of the supposed military members portrayed. -A SEAL team would NOT be dressed in different uniforms from each other -ALL of the uniforms shown (at least in the 12 minutes of the movie I was able to bear) do not even EXIST! -A SEAL would NOT perform a hand signal (silent communication used to maintain stealth) and then immediately afterwards make a LOUD, cheesy statement to everyone, let alone when they're within short distance of an enemy! -Their C.O. (in the movie) was addressed as three different ranks/titles in three minutes! Seriously, wtf?<br><br>Now, granted, I'm in the military myself, so some things, like the uniforms, may be more obvious to me, but you would have to be a complete moron to even come close to believing any of this crap is how the military, let alone a SEAL team, really is.<br><br>This \"film\" is an utter disgrace and in my opinion a major show of disrespect to the real SEALs and the military in general.<br><br>I heartily invite anyone involved in the making of this movie to pay me a visit, so that I may answer this slap-in-the-face they've produced with a kick square to their nuts with my Navy standard-issue steel-toed boot!!!!!!!!!!!!!","user":"ajb-nav85","rank":[31,41]},{"title":"The people who approved this script should be ashamed.","rating":2,"date":"23 July 2015","review":"I'm assuming this is what happens when a marginally okay director picks up a script from a special needs kid. It's not even a good idea for a charity project but what amazes me is how they got a halfway decent cast, and what seems to be a huge amount of funding and the backing of one of the largest Hollywood production studios all to produce this atrocity. Maybe Hollywood needs to stop for a moment and take a good look at itself. I am aware that there's \"movies\" out there that are worse, but non of them really irritated me like this one because they clearly had more resources than they deserve to make this pile of garbage.","user":"msul-nma-1","rank":[7,8]}]