[{"title":"Art House film gone wrong","rating":2,"date":"29 June 2014","review":"Truthfully, I walked into the theatre expecting some fun based upon such a high IMDb review. The premise of two respected comedians doing a semi- scripted trip around a set of Italian restaurants had some good potential.<br><br>However, it became quickly clear that this was a very self-indulgent \"selfie\". Apparently more so for Brydon, whose non-stop impressions became tiresome about half way through the movie. There certainly were a consistent run of chuckles, but there were no really funny moments.<br><br>Unless you're a film buff, dozens of vague (and potentially funny) references would be lost upon the audience. The college-level humour was lost on much of the audience and many walked out without that \"just saw a fun movie\" look on their faces.<br><br>The scenes involving the kitchens and restaurants were too brief and didn't really set any sense of place or any real love of the food being served. There was no \"love\" in the way the food was presented and no appreciation of the food by the characters. The premise was that one of them is writing an article about travelling to six restaurants, no?<br><br>There was no real discovery of the two stories of Brydon's unhappy marital situation or Coogan's desire to be closer to his son. We could have added some discussion between the men about their respective challenges. Instead, all we got was improvised conversation between two guys that would have normal customers asking the staff to shut them up. The only tender moments were left to the final 30 seconds of each of the six days.<br><br>Was the director trying to accomplish too much or was there a lack of skill presenting the parallel stories? I don't know.<br><br>The scenery and the food stole this otherwise disappointing show. We walked out of there thinking of our next menu.<br><br>What really hit my partner and I about the film was the boredom at the end of each day as each character met with Brydon's dismissive wife too busy with her work and being a single mum at home with a young child or Coogan just going to sleep, bored and listening to his ipad playing music. Seriously, if the actors are that bored, then how can we be entertained?","user":"dugaldallen","rank":[62,92]},{"title":"Self indulgent nonsense","rating":3,"date":"2 June 2014","review":"Apart from the beautiful scenery, and a couple of chuckles, this was boring. Normally I enjoy these guys, but this just doesn't work. Watching two mates eating, and doing impressions every five minutes, with an attempt at being funny thrown in, was embarrassing. I was hoping for more views of an amazing journey, but was left feeling short changed in that department. Whilst both Rob and Steve are very clever in their own right, this union seemed more of a challenge to outdo each other. I thought this would be more of a documentary type of movie, but sadly I was mistaken. If you're die hard fans of the duo, I guess this is for you.","user":"housemartins","rank":[96,152]},{"title":"Tedious ego-trip","rating":3,"date":"14 September 2014","review":"I was so disappointed as I have liked Steve Cougan's previous work. The movie tried to give the impression that the dialogue between Cougan and Brydon was spontaneous but came over as completely premeditated and precisely scripted so it lost all credibility. The dialogue -- especially the very good impressions by Brydon -- we so overdone and self serving they became tedious and we both were looking at our watches after 40 minutes. I hardly laughed at this comedy; the shots of the food and scenery were stunning but were too fleeting to add value to the plot.<br><br>Too many in-jokes and poetry/movie-aficionado references only heightened the impression that the movie is a self- serving Ego-trip.","user":"Clive_barons","rank":[50,82]}]