[{"title":"Total rubbish","rating":1,"date":"28 July 2014","review":"I never write reviews but I had to on this one because I am actually a fan of uwe boll's work he has gotten better over the years and can make a half decent movie thesedays, but why did he let his production company or him himself let them make this incoherent garbage it was thrown up all over the place going back and forth for no reason whatsoever the special effects were just lame and the story made no sense whatsoever. At least the first one had a story and was a brutal movie which made you squeamish in the stomach. Avoid this at all costs. Also whoever wrote the positive review of this movie has to of had some part of this movie as no one in their right mind would find anything positive in this movie.","user":"beavis269","rank":[18,19]},{"title":"Unwatchable","rating":1,"date":"22 July 2014","review":"Normally a sequel to an Uwe Boll movie that isn't directed by Uwe Boll can be counted on to be at least a slight improvement on the original film--but Seed 2: The New Breed is the exception. This movie is so dreadful it actually makes Boll look good, sort of.<br><br>Fans of the original Seed, if there are any, will likely be disappointed that this seems to have virtually nothing to do with the original film. Actually, it feels more like an unofficial Hills Have Eyes sequel than a follow up to Seed.<br><br>Seed 2: The New Breed appears to have been shot on digital video, really badly. Most of the film looks ugly and over-bright. The acting and dialog are beyond bad. The movie is clearly meant to be transgressive and disturbing (the opening scene involves a gun barrel being shoved between a squealing young woman's thighs) but the movie is simply too incompetent to make an impact beyond inspiring a strong desire to turn it off.","user":"jhs39","rank":[25,31]},{"title":"Hard to not push the eject button","rating":4,"date":"11 November 2015","review":"Went to a horror convention and bought t'his flick while the main villain was sitting there, Nick Principe. A really nice guy who was afraid to be caught taking a selfie with me, because you had to pay for pictures with the stars. Have seen a few flicks with him this was one that I really can't say that it was any good.<br><br>Strange to see Uwe Boll being used to promote this flick due the fact that many geeks find his flicks utter trash. And this wasn't any good at all. I give you one example. When victims are stabbed by a machete there's really no blood coming out of the wounds. And don't let me go deep into the acting if you could talk of any. Campbell is the one who tear this flick down to ground level. I just don't get it why people are still casting her. <br><br>Seed 2 is slow and doesn't have a good story. Nick does his best by not saying anything at all maybe he did know what was going on. Uwe Boll addicts will love this but many will be left with a huh feeling...<br><br>Gore 1/5 Nudity 1/5 Effects 1,5/5 Story 1/5 Comedy 0/5","user":"trashgang","rank":[6,6]}]