[{"title":"A cute movie, But Form Your Own Opinions.","rating":9,"date":"11 September 2014","review":"Unlike the review below, I actually seen the movie, the movies is full of some amazing, but long underwater scenes, and some suspenseful moments. The movie does promote they true meaning of rescue rehabilitate and release, especially when morals con into play, when it comes to Winter's fate and a Dolphin Named Mandy. Many times throughout the movies it is said that these animals are \"Wild animals\" as well as when Asked if it was possible would Clay release winter. his response is one he puts into perspective from when he started the hospital. Just like in dolphins tale, before the credits role and after the ending, they show the actual stories of Mandy's release and Hope's rescue.<br><br>It does not promote captivity, but it does bring a reality of what happens when a companion animal is needed for an unreleasable one, either they're paired up or moved to a park which can provide one. Unlike the previous reviewer, I believe ALL SHOULD FORM THEIR OWN OPINIONS. You should go to the movie if you like and bring your kids I'm sure they would love to see the movie as well. MAKE YOUR OWN OPINIONS Don't GIVE INTO THOSE WHO ARE SADLY MISINFORMED.","user":"Orcalinkinpark","rank":[27,38]},{"title":"Great family movie","rating":9,"date":"12 September 2014","review":"This is a great family movie. Written based on the real story is reflects on the true motto of Clearwater Marine Aquarium: \"rescue, rehabilitate &amp; release\" The movie does not promote cruelty or keeping animals in captivity. If the dolphin or the turtle health bill is good and the animal is able to survive on its own then the crew release it back into the ocean. Harry Connick Jr. plays Dr Clay Haskett, and when asked if it was possible for Winter to survive on her own would he let her go. His answer: right this minute! As it is the animals that stay in the aquarium are either too seriously injured or with other medical reasons (dolphin Panama, that was keeping Winter company, was deaf and not able to echo-locate food and feed herself) The acting is good, story line simple enough for kids to follow and some moments you find yourself holding breath waiting for what is next. And after watching the movie you may want to visit real stars Winter &amp; Hope in Clearwater, FL.","user":"thirlith","rank":[15,24]},{"title":"Dolphin Tale 2 was as inspirational as its predecessor","rating":7,"date":"21 September 2014","review":"Just saw this with my movie theatre-working friend. We both enjoyed this true-life sequel about Winter's acting strangely especially after the death of a fellow dolphin early in the film. Since Hazel and Sawyer are a little older and practically young adults, there's a hint of a budding romance between them though the main focus is on Winter and another possible new playmate named Hope. All the cast from the previous one is back and Morgan Freeman's character is allowed to say some witty lines that my friend found funny while I was a little amused at them. Actor Charles Martin Smith is the writer/director and he appears as the guy telling the Harry Connick Jr. character he has 30 days to fix whatever violations he cited. In summary, Dolphin Tale 2 was pretty enjoyable for a true-life sequel.","user":"tavm","rank":[9,13]}]