[{"title":"Amazing indie film, kept me on edge","rating":9,"date":"5 April 2014","review":"I was lucky enough to see a (sold out) screening of this at last year's Monster Fest. I went in not really expecting much. The trailer on the Monster Fest site had intrigued me but I still wasn't 100% sold. I couldn't quite put my finger on what genre the film was and whether I would like it.<br><br>That all changed as soon as it started playing. From the start, I empathised with the main character, Warren (played by Glenn Maynard), whose life revolved around his ice-cream business and Katey George (played by Kyrie Capri), an actress from a Neighbours-esque soap drama. <br><br>The film blurred the lines between reality and fiction as Warren daydreamed of what his life would be like with Katey George. <br><br>There were dark elements that were startlingly juxtaposed with comedic ones. One second I was relaxed and jovial and the next I was clutching the arm rest. Usually I'm pretty good at predicting story lines but not this one! <br><br>I would recommend this to anyone who is sick of mainstream films and the same plots over and over. This is one twisted and funny little film that kept the surprises coming. I hope to see more from the writers and the director of this film soon.","user":"belleofthyball","rank":[25,33]},{"title":"I want nuts with that","rating":7,"date":"17 December 2015","review":"It starts off a bit iffy but once it gets into the plot it is a very intriguing film.<br><br>Gray Maynard is great in this film. The jerk off scenes are equally hilarious, disgusting and sad.<br><br>This is a great story about obsession.<br><br>The directing is very original and well done and so is the script you really start to care for Warren.<br><br>It catches you off guard by being absurd.<br><br>I have never seen a film before that uses a TV show in a movie as a learning toll for the plot . The video diary's are greatly done and you really start to see Warren in a different light. These videos were inspired by an actual stalkers video diary's.","user":"shaggysexxxy","rank":[5,5]},{"title":"Dark, twisted tale","rating":9,"date":"27 April 2014","review":"A great thrill ride of a film, telling the mental disintegration of an ice cream salesman who has developed an unhealthy obsession for the central female character of a Home and Away style TV soap story. Depicts very effectively the sordid and lonely lifestyle of the main character but with touches of warmth and perverse humour throughout.<br><br>Not easily classified into any genre but a mix of dark comedy, psychological thriller, human drama, revenge horror and even spaghetti style western. It is not always clear where the lines, if any between reality and delusion are drawn in the increasingly fractured world of Warren (played with absolute conviction by Glenn Maynard) but it all builds to a cathartic and brutal finale.<br><br>One not to be missed in a world of formulaic, middle of the road and average cinema.","user":"staffc18","rank":[27,39]}]