[{"title":"I hope Mr Cusack received a large cheque...","rating":1,"date":"30 May 2014","review":"..I really do.<br><br>This is nothing more than a poorly conceived and executed advertisement for the Queensland Gold Coast hinterland. The kind of movie where the action (such as it is) limps from one rube-magnet tourist trap to the next, with the camera dwelling jarringly on the signage at each new location along the way.<br><br>I can't think of a single reason to recommend this film - but plenty to recommend against it. Fans of Mr Cusack or Mr Jane will descend quickly from confusion, to dismay, to disgust as they realise the dross the two have allowed themselves to be party to. The endless succession of car chases is unimaginative and unmoving. The performances so lifeless the cast may as well have been reciting directly from the page.<br><br>The most interesting thing about this movie is its utter, utter, utter absence of wit, style or inspiration. It will leave you genuinely searching, grasping, for reasons why a group of adults with money would possibly choose to produce something like this - something so inanely artless. My god, if you're going to take the effort to get out of bed and point a camera at something, why (how!) would you not come up with something more satisfying - something more worthy of being put before a paying audience? <br><br>I really need to take a shower. This was not just forgettable - it was depressing. Beyond pointless.","user":"rurquhart-2","rank":[74,97]},{"title":"Horrible!","rating":1,"date":"31 May 2014","review":"Has John Cusack jumped the shark? is this the best movie he can get into now? Same for Thomas Jane...The movie is a cheap version of \"Getaway\". The budget on this film was 12m which is probably why the movie was so AWFUL<br><br>I think this was John Cusack and Thomas Jane helping a grade school student with a class project. The editing is terrible, you can clearing see shots where John or Thomas is sitting in the car on the reverse side then it switches back. You can also, clearly see the stunt drivers face multiple times throughout the movie. And the acting, i don't even want to think about that...no words can explain what that was they were doing, because it wasn't acting..","user":"casinoslotguy","rank":[37,50]},{"title":"Where did the $12 million go?","rating":3,"date":"1 June 2014","review":"(Slight spoiler alert)<br><br>There are too many flaws in this movie to list. But I'll try:<br><br><ul><li>The crash scene of the Nissan Pathfinder was very obviously not the same car. Solution: Use the same wheels at least.</li></ul><br><br><ul><li>The police used VT Commodores and BA Falcons that Gold Coast police stopped using at least four years ago. Solution: hire FG falcons and VF Commodores, order some magnetic police graphics to stick on the hire cars.</li></ul><br><br><ul><li>Peter was shifting that automatic Getz too much. Solution: get a manual to cause a more 'dramatic' or 'rushed' effect.</li></ul><br><br><ul><li>Australian Federal Police do not drive Mitsubishi Challengers. Solution: hire a VF senator or caprice.</li></ul><br><br><ul><li>Pistols are much harder to own in Australia, the owners are required to attend a certain amount of meetings each year (depending on the state) and far less people own pistols than rifles and shotguns. Solution: let people have shotguns and lever action rifles. (Yes I know criminals can get their hands on pistols easier but the old lady? I mean come on).</li></ul><br><br><ul><li>An XA GT coupe in fully restored condition should not have an overheating problem while traveling over 60 kph in weather cooler than 27°C. Solution: have it run out of fuel instead.</li></ul><br><br><ul><li>Dropping a shotgun with the stock removed could never cause it to discharge a shell. Any type of gun is completely safe as long as that trigger is not pulled (there are some extreme circumstances but a 500 mm drop is not on of them). Solution: Have Peter kill the man accidentally.</li></ul><br><br><ul><li>There is absolutely no way that Ford Mustang (even though it was a 351) could beat an assumed Harley Davidson v-twin. Solution: have the motorcyclists have obstacles to navigate or have the mustang go off road a bit to shake them off.</li></ul><br><br>As you can see there are flaws, to me they are big flaws. There may be some errors in my findings but none as bad as this movie. There are more holes in the story but too insignificant for me to be bothered listing them. <br><br>It surprised me that Drive Hard made it past the revision board. It is hard to believe that this movie had a $12 million budget.<br><br>All in all, this movie is not worth watching and I do not like it. Great theory but the execution was terrible.","user":"jairbryant","rank":[20,28]}]