[{"title":"It's Exactly What You Expect","rating":5,"date":"27 June 2017","review":"Before we sit down in the theater, we know pretty much exactly what happens. Two girls go scuba diving in a shark cage and wind up a trapped in said cage 47 meters below the surface. Since they aren't experts, we know how they will react. Then sharks show up. Since they are sharks in a scary movie, we know how they will react. There is no real room for surprises.<br><br>If you expect rampant plot twists and character development, you must not see this type of movie often. It is what it is and it knows that. Despite the only real mystery being which of the girls survives, if any, or perhaps both, the movie actually manages to provide a refreshing twist.<br><br>That may sound bold to say when talking about a powerfully simple shark attack movie, but take some time to think about it. The twist is secretly ingenious and explains away many of the ghastly errors in believability.<br><br>I'm surprised to find myself defending a movie that I didn't really like all that much. But I am. It's not that movie doesn't deserve criticism. It certainly does. The acting performances earn failing grades across the board. The dialogue is laced with embarrassing over explanations and repeated lines, most of which involve warnings from the captain about the bends. Other times this takes the form of the girls obnoxiously narrating the menial tasks as they carry them out. Once or twice might have been fine, but it's tough to stomach after about the 10th time or so.<br><br>My thought on this is maybe the filmmakers knew that it was too dark to see what was going on for most of the movie, so they made the girls say aloud everything that they did. This solution makes about as much sense as going on a five-mile run after knowingly drinking spoiled milk. If one problem is easily avoidable, avoid the problem. Don't attempt a remedy that almost certainly won't help the situation.<br><br>All that said, I defend the movie because I think it executes its mission reasonably well. I shifted to the edge of my seat and felt uneasy on many occasions. The movie managed to scare the audience and it did so with fewer jump scares than expected.<br><br>Instead, the movie built to moments that would normally climax with the infamous jump scare then simply opted not to deliver one. The goal is still achieved. The moments still induce a sense of dread from the audience, but without the cheapness of frightening viewers by essentially saying \"boo.\" I'd like to see other movies emulate this tactic.<br><br>My advice: if you are going to watch this movie, understand what you are getting into. The movie likely won't surprise and that wasn't its intention. Be reasonable with your expectations. Accept the movie's strengths and weaknesses. Empathize with how terrifying the situation would be if it were you stuck in the shark cage on the ocean floor, and don't hesitate to laugh at the movie's weaknesses.<br><br>Do those two things, and you may walk away satisfied. If you are unwilling to do that, stay out of the water.","user":"Jared_Andrews","rank":[148,178]},{"title":"as an 'experienced diver' ... I quite liked it!","rating":6,"date":"26 June 2018","review":"Most 'experienced divers' reviewing the movie here, who want to share their diving knowledge and tell us about the technical holes in the plot, are missing a huge detail.. the ending. It reveals BIG SPOILER that most of the movie is the hallucination of one of the girls while she is trapped at the bottom in the cage suffering from nitrogen narcosis, the other girl disappears quite quickly so all the ascents etc don't happen. So we can forget our dive tables and decompression times, and it becomes a little bit easier to suspend our disbelief for the tank swapping next to, for example Jaws, where a shark propels itself fully out of the water and sinks a large boat<br><br>There are actually a number of things the movie gets right.. the general feel of being underwater at depth with low visibility.. the lighting and camera angles are very suspenseful and really give the right sense of disorientation and claustrophobia. Sometimes the camera seems to take a shark eye view, approaching and then deciding not to attack, at other times large dark spaces are left behind the main character just waiting to be filled with a large tooth filled shark mouth<br><br>We don't see the shark clearly or often either , which is a good thing.. the best parts of Jaws were when we didn't see the shark much, and Shallow Water which i saw recently was filled with cgi shark and wasn't scary at all. In contrast I was really kept on the edge of my seat with this movie and i am terrified of sharks and dive so i know what the feeling is like from personal experience of being slightly uneasy underwater<br><br>My only complaint is that there is a little too much chatter<br><br>Better than expected and recommended, nowhere near Jaws obviously but better than most other shark movies","user":"vailsy","rank":[8,8]},{"title":"Pretty solid!","rating":7,"date":"29 July 2016","review":"For a scary shark flick I found it totally worked. Of course the intro, party scene &amp; boys are what you'd expect for this genre, and had me wondering if I'd make it to the end due to all the cliché.<br><br>But it did take off from there nicely, had some genuine holy f*ck moments, a good pacing and had me wondering all the way if the girls would make it to the end...<br><br>The camera work was great and the sharks well done (a bit too aggressive for total realism, but hey). The ending was also original, for once!<br><br>Compared to The Shallows, I'd say it's equally solid in terms of entertainment value and getting the viewer hooked until the end.<br><br>Overall a solid 7 in my book.","user":"theshadowrunner","rank":[124,192]}]