[{"title":"Been a while since I've seen a good bank heist flick, American Heist is not that","rating":5,"date":"27 July 2015","review":"But that's mostly due to the fact that the main focus was on two brothers.<br><br>Adrien Brody plays the older brother who did hard time for the crime that also involved his little bro played by Hayden Christensen who did a shorter sentence and got out determined to do as good of a job as any ex- con to keep his nose clean, but when his brother gets out, he forces little bro back into the life as a favor to the man that stop the constant booty tapping that he was getting.<br><br>This focus could have been better. Adrien Brody gave a decent performance as a man who got broken in his decade in prison, but this performance goes over weakly in this mediocre film that did not develop his character enough for Brody's attempts at heart breaking scene stealing. <br><br>Bouncing his acting chops off of Christensen was not a good call either. He tries, but Christensen seem too focus on his though guy persona to really get any acting done.<br><br>I feel most sorry for Johanna Brewster who is now officially typed cast as the girlfriend to the criminal car nut, which she perfected in the Fast and Furious franchise.<br><br>For the movie to be called American Heist is misleading, though the implementation of the heist was somewhat suspenseful, we did not get to see much heist planning. It's no Heat or Set it off.<br><br>Whatever this movie was trying to do it kind of fumbled the ball in both cases.","user":"subxerogravity","rank":[12,12]},{"title":"Expected safe-drilling, got a bore.","rating":3,"date":"23 January 2015","review":"Action ? Nope. I calculated that the sum of all main characters spent a grand total of 17 calories throughout the story. Mostly because one of them trots about 5 yards somewhere in the first half.<br><br>Drama ? More likely. You'll mostly watch brothers talking gravely and crying in each other's arms. There's also 1 woman, and she's in a love angle. That way, 2 requirements of US formatted products are met, killing two stones with one bird.<br><br>Heist ? Barely. It's 1 hour and a half long, and the heist itself starts after 1 hour in. I'm not saying that the heist preparations take 1 hour. Preparations ? What preparations ? Let's just pop in the bank with guns, take everyone hostage and hope nobody notices from outside. From now on, you'll mostly watch brothers talking gravely and crying in each other's arms, but with their faces covered.<br><br>American ? Yes, the title isn't a complete lie. Not sure what the exact purpose of this adjective is... maybe to warn us that this heist won't occur in Papua New Guinea and that there won't be Austin Minis. Actually, I was expecting a gang of nuke-toting, gum-bubbling, Gump-quoting, segway-racing corporate-tattooed obese survivalists. Of which I saw none, so it's only technically American; just.","user":"voyou-703-655350","rank":[126,153]},{"title":"There is a \"heist\" here - if you spend money to watch this turkey!","rating":2,"date":"20 June 2015","review":"Boring, predictable and utterly forgettable, \"American Heist\" is a complete waste of time. I watched this because my wife has a thing for Adrien Brody. I think he's a fine actor, but clearly this was done just for a paycheck. It's hard to make a bland bank robbery, but it was done successfully here. Just putting known actors in a film does not a good film make, an intelligent well-written script helps and this was just thrown together without much thought.<br><br>Save your money and read a good novel or take a walk or stare into space! There are so many poor films out there. When the industry complains about loss of its audience, it should consider the product we are asked to rent/purchase.","user":"iraz","rank":[33,39]}]