[{"title":"Funny, moving, upsetting and brilliant","rating":7,"date":"3 March 2019","review":"Saw this at the Glasgow Film Festival. Im a 90s music and comedy fan from the north west of england and was a Frank Sidebottom fan. But the man behind him was so much more interesting and that is the true achievement of this film . A complex character who was a true creative whose talents were way beyond what he became famous for.\nWas so interesting to hear his wife and family talk... lovely people who inspired him<br><br>go see even if you are not a frank sidebottom fan.","user":"kbradley26","rank":[14,14]},{"title":"Now I get it","rating":10,"date":"30 March 2019","review":"I first heard about Frank Sidebottom when I read a preview of the Michael Fassbender film \"Frank\" on the Guardian UK site and thought, this phenomenon of a guy who became a novelty pop star while wearing a John Held Jr. mask that he refused to take off even when doing radio interviews sounds fascinating, but why would I want to watch a fiction film about a fictional guy who works for a fictional version of Frank? What I really wanted is this film: a documentary that would explain to a Yank like me what made Frank Sidebottom and his creator Chris Sievey so appealing to his British audiences. (I've tried watching YouTube videos of Frank and was only mystified and a little annoyed. As I said, I'm a Yank.)<br><br>Like \"The Nomi Song,\" this film does a superlative job of making a very unique artist from an esoteric branch of New Wave subculture seem like an old friend. I highly recommend it to anyone interested in British pop culture, especially British humor and the original punk/New Wave era.","user":"malmborgimplano-92-599820","rank":[11,11]},{"title":"Fanastic ! it really is .. not Bobbins in slightest","rating":9,"date":"13 April 2019","review":"A heartfelt document about the comic genius that created an icon that became his Frankenstein's monster. This is an incredible film given the source material of hundreds of old cassette tapes and video recording all of which destined for the skip.\nThis is clearly a labour of love made by fans and maybe just for fans, the tragedy id Chris Sievey never got the recognition for the awesome work whether be musically and artistically.<br><br>I can't recommend this enough, especially want to about more about the man behind the mask or even if you never heard of Frank","user":"wiltaim","rank":[9,9]}]