[{"title":"A waste of your time and theirs","rating":2,"date":"18 November 2016","review":"I like indie films and I'm prepared to give them slack that I wouldn't give to mainstream movies. I hated this movie. The acting was, throughout, bad. Sometimes painfully bad. Again, I can put up with that. Professional actors cost money that independent movie makers don't have and indie films give new talent a chance to make their marks. Plot and script writing on the other hand costs nothing and, in both, this movie literally falls apart. Horror movies, even the best of them, require a suspension of disbelief but, when the characters in horror movies start acting in ways that stretch credibility, you have a major problem. Example (one of many): There's a strange man in my new house. Response: Find a knife (check), find a light (check), take some pills, find a comfortable sofa, lie down, sleep till morning (nope). By the end I had completely lost interest in both the characters and the story line. The IMDb rating has been boosted by lots of positive reviews (no doubt from friends and family) and I'm confident it's only going to head in one direction. Don't waste your time watching it and, if you do, leave a suitable review. Don't be surprised however if your review is instantly attacked with lots of \"This review was not useful to me\" hits.","user":"nabokov95","rank":[22,27]},{"title":"Gives TV Movies a bad name","rating":1,"date":"21 January 2016","review":"Absolute trash, I'm tired of awful directors churning out this lower than b movie garbage. Unless there's an award for not being able to afford a steady-cam and constantly having the actors framed at an odd angle...if there is then this gets my vote! Unbeliveably fake reviews aside (different subject) the following issues exist: 1 horrible camera work 2 horrible acting 3 horrible script 4 seeing lance henrikson suck so bad hurt. The story itself wasn't horrendous but laughably cliché and i did personally enjoy the often bizarre incidental music as it seemed to want to build tension when quite often nothing was happening, dark and spooky unpacking for example. Who knows whats in your suitcase?? Oh clothes thats right you totally packed it. I am especially fond of demonic keyboards whilst walking or knocking on a door etc.","user":"tarquinotterfield-12456","rank":[81,114]},{"title":"Objectively bad","rating":1,"date":"23 January 2016","review":"It's funny to see all these fake reviews and how the rating of the movie has been plummeting over the last few days.<br><br>I'm not sure what to add, most points are covered by the previous reviews (the real ones, that is). The acting is stiff and amateurish, even Lance Henriksen somehow looked like he had never been in a movie before.<br><br>The story is extremely stupid. Half the scenes don't serve a point, and could have been removed from the movie without making it worse. Actually, it might have made it better. But why stop there? If just all the scenes had been removed, maybe it would have been slightly watchable.<br><br>Don't waste your time, not even if you're looking for a bad movie to laugh at. Go find something else to watch.","user":"neckelmann","rank":[64,94]}]