[{"title":"Bang Bang Thank you Man!","rating":7,"date":"2 October 2014","review":"Bang Bang is a part Espionage Thriller, part Bollywood Revenge Drama, part Musical, part Romantic Comedy, and full Global Action Adventure that not just excels in its parts, but is also riveting as a whole. An official remake of 'Knight and Day' - this is a movie that will surely seem like a knight in shining armor for the adrenaline junkie awaiting a prince charming.<br><br>Hrithik Roshan excels as the suave and sexy international thief on a mysterious mission of his own. With muscles of steel, eyes burning with a fire of passion, a body as fluid as water, and feet that seem to fly with the wind, Hrithik Roshak is truly in his elements here.<br><br>Giving company to his Greek God looks is the demure damsel in distress - Katrina Kaif - who for a change is less of a seductress and more of a girl next door. She manages to somehow keep pace with the brilliant Mr Roshan and hold her own. The supporting cast - be it Jimmy Shergill, Danny Donzongpa, Jaaved Jaffrey, Kanwaljeet Singh, Deepti Naval, Pawan Malhotra, or the delicious Dadi spice up proceedings with measured performances that meet the need of the hour aptly.<br><br>The action is truly stupendous and honestly much better than anything of \"Spiderman 2\" Andy Armstrong that I have seen so far. The cinematography, sets, locations, and costume design effectively add to the allure of breezy, hip, and yet picturesque scenes. Multiple international locations (Prague, London, Abu Dhabi, Phuket, and parts of Greece amongst others) and our very own India (Shimla, Kashmir, Manali, Mumbai, Delhi, etc) are captured in stunning visuals that will leave you gasping for that dream holiday you couldn't even dream of, and which Katrina as 'Harleen Kaur' gets to live.<br><br>To be honest, the story isn't the most gripping of tales, and the screenplay wouldn't 'script' history even though Sujoy Ghosh of the taut \"Kahaani\" fame and the prolific Abbas Tyrewaala seem to have had a hand in this. But the action, faced paced screenplay, and taut direction by Siddharth Anand, who redeems himself after a forgettable \"Anjaana Anjaani\" more than makes up for it. The hit maker of Hum Tum, Salaam Namaste, and Bachna Ae Haseeno is back to business in dishing out an entertaining dish with a dash of superstar allure in the form of Hrithik and Katrina.<br><br>Without giving too much away, I would like to summarize this as an apt action adventure film with tremendous production values, some foot tapping music (Vishal Shekhar), and outstanding choreography by Bosco-Cesar (especially Tu Meri and the title song - Bang Bang that pops up during the credits). Low on emotions, high on action, and about average on originality and recall value - this is a movie that starts and ends with a Bang and when it does, you might just say to Hrithik \"Thank you Man!\"","user":"ayanpal1","rank":[75,120]},{"title":"Review + Experience of Bang Bang","rating":8,"date":"4 October 2014","review":"I have been waiting for this since the time I saw the trailer of it. I hadn't liked the songs - but hey, lovely promos. So, when movie released I booked the tickets for Thursday night. <br><br>I opened my twitter and FB on Thursday morning and in came the flow of negative reviews of the film. All the leading reviewers gave it 1.5 star. User reviews were still not available. <br><br>My heart sank. I saw my 1000 bucks going in drainage. I checked to see if I can cancel my ticket - there wasn't any option. Wife said - no worries we'll see how it goes. I said to myself - well, it can't go poorer than Himmatwala that I had seen. <br><br>I also did one more thing - I saw Knight and Day again in afternoon. <br><br>I went in to see the film with my wife, sister and mother in law. I honestly had no expectations from the film after all the reviews I had read. <br><br>After 80 minutes in the movie, we went for interval. I looked at my wife with an expression - \"what the f**K all the negative reviews were about\"? It was an entertaining first half and I was wondering if rest of the guys saw the same film? We decided to wait and finish the entire film and see if they have goofed it up anywhere in second part. <br><br>After another 80 minutes or so, I was convinced, the reviews that I had been reading since morning were either mostly paid reviews or the people went in expecting a James Cameron film. Movie is not flawless, lets be honest. <br><br>The first half is good, however second half could have been better. The fly-board based action sequence isn't placed very well. The climax is decent, but stuffed a bit. There were big news of how interesting the Abu Dhabhi chasing sequence is with 120 cars and all, but honestly it doesn't live up to the expectation. Formula 1 car driving is from no where and there aren't great scenes shot with it. The last scene of water plane is immediately after the F1 car and it seemed that last 15-20 minutes is stuffed with too much of an action. Songs are good, but they all look alike - there should have been some variety in there.<br><br>Acting wise, Hrithik stole the show. Katrina and Hrithik I guess are best looking pair in Bollywood. They look superb together. Dance sequences are beautiful. Danny Denzogappa is wasted in the film. There isn't much of a scope for rest of the cast - wish they could have been synchronized better. <br><br>Even with all the negatives, the visual treat that movie offers is superb. It is fast paced and no where you'll feel bored with what is on your screen. Style quotient of the film is very high and continuity has been maintained. You see Shimla / Prague and other places in the film - but they are connected and it just doesn't happen out of the blue. Suspense is well built and story, even though is not new, looks connected and nicely treated. <br><br>Its an amazing attempt to make a progressive movie. Movies like these take a forward looking step for the Bollywood. I do hope, someday we'll see a Transformer as well, though I am convinced we have a long way to go. <br><br>Its a movie I wouldn't mind to watch again if I have to. Its a great work and deserves a theater run.","user":"ravik-kant","rank":[30,44]},{"title":"Better.","rating":10,"date":"24 December 2014","review":"I have got to tell anyone who will listen that this is one of THE best adventure and Action movies in Bollywood I've ever seen.<br><br>The only word I can think of to describe this movie is BRILLIANT. It's amazing work and everything I had hoped for and more. The entire cast really delivered. You needed more than just action actors or stunt doubles to play all these parts. <br><br>This movie defines Bollywood development.. and Hrthik is awesome in this movie... + dance scenes also so great music (restaurant scene)<br><br>You should watch it, better then original!<br><br>Also listen soundtrack after movie, i can't stop it!","user":"wisniat7","rank":[25,37]}]