[{"title":"Unlikeable Characters, Stale Story, Awful Soundtrack","rating":3,"date":"15 January 2015","review":"*Review Contains Light Spoilers But Nothing That Will Ruin The Film*<br><br>I'll start off by saying I have nothing to do with this film at all. I'm not from the cast or crew and it wasn't shot in my hometown. It's very obvious that 90% of the reviews for this film so far are fake, so just getting out of the way that I am simply a movie watcher who went into this with an open mind.<br><br>So with that said I just have to say this was a pretty bad movie. Right from the beginning I was tempted to shut it off, the cast was just so annoying it made it really hard to continue, but I sucked it up and decided to finish the movie. Once the ball gets rolling we realize that this is a tale of revenge, two sorority girls getting back at their sisters for something unknown to us at this point. It's an alright idea, but the execution was awful.<br><br>The girls stage a haunted house in order to play out their revenge on their sisters, the only thing is that the two girls and the rest of the cast were extremely unlikeable. There really is no one at all to root for in the movie, every single character is really a bad person at their core so you kinda just want everyone to get killed. We are treated to A LOT of dialogue between the cast and this is where the movie got really bad, why would we want to see a bunch of unlikeable people have drawn out conversations about things we don't care about?<br><br>So then the killing starts, which is one of the slightly positive things I can say about this film, there are one or two good kill scenes. But that's it, with all these victims they could have at least gone the route of taking them out in gory ways, but instead we get one or two decent kills and the rest are fairly tame or done off screen.<br><br>Also the soundtrack it definitely worth mentioning, because it is so bad. I was tempted to mute my TV on a few parts so that I wouldn't have to listen to these awful generic party songs.<br><br>Overall this movie is just a big mess. The one thing they did do really well at was making an hour and twenty minutes feel like an eternity. Ignore the fake reviews and skip the one, you are better off watching Sorority Row or one of the other many all female cast horror movies that did the concept MUCH better than \"The Scarehouse\"","user":"HorrorOverEverything","rank":[27,37]},{"title":"Don't believe the reviews","rating":1,"date":"18 January 2015","review":"How on earth this has been rated so highly i have no idea. Like other bad reviews of the film have stated, I've got a feeling the higher score were written by people involved with the film.<br><br>The film was so god awful I felt compelled to open an IMDb account to review it.<br><br>It really was the worst film I've ever seen.<br><br>I don't really care that the acting is rubbish, but there is nothing, absolutely nothing good to say about this film.<br><br>I stuck with it till the end, out of sheer determination, why I don't know, I should have done some hoovering instead. <br><br>One review said the ending left it open for a sequel. It doesn't and thank god for that.","user":"rich-the-mitch","rank":[28,42]},{"title":"Terrible .......","rating":1,"date":"15 January 2015","review":"I don't mind watching the odd horror movie which has you on the edge of your seat with a decent story and great acting. (or even average acting) This has none of them, its like something a bunch of kids would make with gore for the sake of it and silly cheap thrills like young girls half naked messing around in a room it has absolutely no suspense or story nothing keeps you gripped to the screen to see what happens next. I actually started to fast forward the movie in places hoping things would improve..... but they did not.<br><br>If you gave a camera and some fake blood to a teenage and told him to go and make a horror movie this is what he would come up with","user":"english_artist","rank":[29,44]}]