[{"title":"Refueled","rating":5,"date":"1 March 2020","review":"The Good: Exciting car chase sequences, eventhough it sort of mimics the Fast Furious series. Ray Stevenson's Frank Martin Sr. steals the show. The Not-so-Good: Ed Skrein doesn't exudes the charm of Jason Statham's, which is one of the signature of the series. Thus he couldn't carry the movie on his own. Some of the fight sequences feel stilted and not as smooth as Transporter series' trademark. No chemistry between Frank and Anna, thus the feeling between them isn't too believable. Once again, Russian are stereotyped as bad guys.","user":"MR_Heraclius","rank":[38,40]},{"title":"No need for refueling, should've gone straight to junkyard","rating":3,"date":"3 September 2015","review":"While Jason Statham might not possess incredible acting, he's a great fit for Transporter. He looks suave and confident, more importantly he looks capable in action sequences. Ed Skrein only amounts to carbon copy lookalike with accent. <br><br>Considering it's now stuck with poorly edited choreography for the scuffle, there's barely a trail of usual high octane ride. However, the worst offender is the awful script, bordering on cheap fantasy or softcore porn, the fact that it quotes The Three Musketeers so often is a literature travesty. <br><br>A group of prostitutes concocts a ridiculously intricate plan to topple their mafia boss. The Transporter is caught up in the struggle and forced to help them. Story relies on blind luck, coincidences, characters' stupidity and baseless arbitrary events. In other words, it's a complete and utter mess. Forget coherency or plausibility, the movie plays by its own faulty logic.<br><br>Unfortunately, the usual captivating fights or engaging chases are nowhere to be found. The movie opts for terrible editing and epileptic camera work instead. It's actually sad that the quirky yet brutal fighting scenes are replaced with such poor production. At the very least previous Transporters' fight is over-the-top fun, this is just confusingly bland.<br><br>Script is so awful, almost everything they say sound like 80's macho gibberish, one-liner from porn parody or silly used car commercial. I've high tolerance for cheesy lines, but when the characters literally pose for camera every five minutes to utter these insanely ludicrous lines, it's not even funny anymore.<br><br>Like before, Transporter must have damsel-in-distress, now it thinks a group of these attractive ladies would replace narrative. Audience might get juvenile guilty pleasure from the these blond short bob misses with minimal dress or a couple of nifty chases, but these gimmicks are shallow and the best they could do is slightly boost the movie rating if one is generous enough in reviewing it. <br><br>With the amount of plot holes and poor choreography it must go through, the end product is unrecognizable wreckage.","user":"quincytheodore","rank":[145,195]},{"title":"Absolute Crap","rating":1,"date":"11 September 2015","review":"Yep it is terrible. In future if you want to reboot a movie franchise, please do so without enticing me to the cinema. The stunts are awful, the fight scenes are trying to recreate Stathamness and everything appears to have been done on a miniscule budget without any thought for consequence, what the audience thinks or sees, or without any due regard for linear time.......<br><br>Do not bother with it. Ed Skrein or whatever his name is, is just not Statham, I don't like Statham, but he is a far better actor than Skrein.<br><br>I am now forced to write additional lines because I am not allowed to write a review less than ten lines, about a film which does not deserve ten lines of my time or space on the internet. How it managed 53% on Rotten tomatoes is beyond me","user":"keith-blowes","rank":[99,135]}]