[{"title":"Astounding Oscar worthy performance from Eddie Redmayne","rating":10,"date":"26 November 2014","review":"We are all familiar with the story and with Steven Hawking. His groundbreaking work 'A brief History of Time' and devastating disabilities propelled him irrevocably into the public consciousness and immortal fame.<br><br>But few of us could understand the complexities of his personal life and the shocking divorce in 1990 from his long sacrificing wife of more than 25 years. Indeed that episode served to darken his reputation in the minds of many, including myself, who felt ill at ease with anyone who could leave a partner who had done so much for him just at the long awaited moment when international fame and recognition finally arrived.<br><br>This wonderful production, so well scripted and paced throughout, serves to explain that vital anomaly in Hawking's life. And it is made all the more poignant as it is based upon the account written by his wife who has borne so much.<br><br>But it is the breathtaking performance of Eddie Redmayne as Hawking that simply blasted this film into an extraordinary level. It is difficult enough to mimic so famous a person as Hawking and it is even more difficult to portray so accurately the debilitating and gradually increasing effects of Motor Neuron Disease. But to transmit so clearly the profound emotions and inner suffering that Hawking must have experienced in his agonizing journey was a performance that left me quite speechless and at times in uncontrollable tears.<br><br>It would be a travesty of the industry if Eddie Redmayne is not nominated for an Oscar after this performance. And to my mind it was a work of art that simply cannot be equaled let alone beaten.<br><br>Have a good handkerchief ready to hand.","user":"RichardvonLust","rank":[245,295]},{"title":"The Theory of Everything - While there is life, there is hope.","rating":9,"date":"8 September 2014","review":"\"There should be no boundary between human endeavour,\" Stephen Hawking explains during a press conference. It is this line that strikes a chord at the very centre of James Marsh's incredible biopic on one of the most brilliant scientists of our time. The Theory of Everything is not just a story about the science behind the beginnings of our universe, but the science of love; and how life's challenges that we face everyday, shape who we are and what we achieve. Eddie Redmayne and Felicity Jones turn in phenomenal performances as the revolutionary Stephen Hawking and his former wife Jane Wilde. Eddie's mentally and physically challenging role, displaying Hawkings brilliance and motor neuron disease, are extremely commendable and impressive (a sure fire for a Best Actor nomination at next year's Oscars). On the more sensitive side, Felecity displays the endless love and powerful fight Jane brought to the Hawking household. As the years pass, their lives are changed tremendously in very profound and heart-wrenching ways. The movie does not shy away from making Hawking a complex character, as well as Jane, showing both their positive and negative sides. I really liked that the movie was able to shape them into fully well-rounded characters despite the \"romance\" aspect of it. The score for the film is tremendous.. absolutely outstanding! It hits all the right marks, brings upon emotions right when you are on the verge of tears, leaves you in awe after a beautiful monologue, and finishes with a melancholy but very fitting tone. The script and directing were top-notch.. right up there with the best... and the cinematography? give that guy an award already! A masterpiece to watch. While some critics may be quick to judge how the film focuses more on the romance rather than the science that made Hawking so renowned, I believe that the love is what made him who he is today. Human endeavour is endless... Stephen never gave up hope, nor did Jane... and though their lives ended up in different places, it was their years together that displayed to us how a little bit of hope can go a very, very long way.<br><br>Verdict: A beautiful story that shows how time and love are limitless... no beginning, no end (despite his earlier hypothesis). *****<br><br>In Theatres: November 7th, 2014 (USA), January 2, 2015 (UK)","user":"PatientWolf","rank":[153,189]},{"title":"Your glasses are always dirty.","rating":9,"date":"25 February 2015","review":"One might think that this movie would be about esoteric theories that are beyond the capacity for most people.<br><br>You would be so wrong!<br><br>This was probably the best love story I have ever seen. I was on the edge of my seat watching Jane Hawking (Felicity Jones) as she did more and more amazing acts of love for Stephan Hawking (Eddie Redmayne). I cannot imagine anyone that fits the definition of love more than she did.<br><br>Redmayne was brilliant as Hawking.<br><br>Anthony McCarten took Jane Hawing's book and wrote a screenplay that was a thrill to watch.","user":"lastliberal-853-253708","rank":[43,50]}]