[{"title":"Most claustrophobic story since \"The Descent\"","rating":7,"date":"17 February 2014","review":"The scariest aspect of \"The Descent\" (2005) wasn't the monsters (or even the backstabbing female-empowerment politics) but the narrow cave crevices the characters managed to squeeze through, the endless maze of tunnels they could so easily get lost in, the darkness that hid unseen dangers. \"Beneath\" has a lot of the same feel--the claustrophobia of the mine itself is as bad as whatever else is down there. And no, the crew isn't simply trapped underground, running out of oxygen and waiting to die. Worse yet, there's something else in there. What was in the unmapped cavern the miners accidentally breached, causing the cave-in in the first place? Many of the miners were buried by the cave-in--or were they? The survivors can wait for rescue, right? Or can they? It's not clear what the miners should be scared of, but it's clear they should be scared, and the audience along with them. As a haunted house movie, this mine is one hell of a haunted house. And whatever's going on in that house, it's not good!","user":"moviefansme","rank":[39,57]},{"title":"Finally, a scary movie with some depth","rating":7,"date":"30 June 2014","review":"I had to see this because mines, along with the ocean, are such a fascinating, fertile realm for scary movies -- the pretense of fear is already in the back of most people's mind. I really liked this movie. The cast had excellent chemistry and easily played off each others strengths, and most importantly to me, their characters didn't seem as contrived or cliché as most do nowadays. It felt so fresh considering all the crappy horror movies that rely on special effects, cheap scares and shaky cams. I was very impressed by everyone, but especially Lauren Gores. She's a very attractive, intelligent actress with a good sense of how to appear truly frightened. I was immediately drawn into the suspenseful buildup of the plot by her reactions as someone unfamiliar with the mining experience. They became convincingly intensified by the fears of the more seasoned crew as things began to go very wrong, and the fabric of their sense of the predictability of the situation began to tear at the seams. I don't think intelligent viewers need their interest piqued by the commercially invoked and debatable premise that there was some kind of supernatural force down there. It's scary enough to think about the real beasts of lust and violence that humans can become when under duress, whether it's fear of another race, religion or their own growing insanity due to unknown, invisible forces.","user":"briantumor1023","rank":[22,33]},{"title":"Trapped in a coal mine, things are bad... in a good way.","rating":7,"date":"30 June 2014","review":"We have seen the story before... trapped in a mine, a group of people struggle to survive. Yes, we have seen it and similar stories more than a few times before, but seldom so well. Solid acting quite effectively conveying fear, despair, and madness; a crescendo of well paced action, a VERY claustrophobic setting, a compelling twist of the unexplained, all blended together to make a real movie out of something that could have just ended up a clone of many others. I say this even admitting that I am not usually a big fan of movies with premises like this. I really liked descent (the comparison is, in some ways, inevitable), but didn't love it as much as some, and yet I put both these movies on par and rate them highly (for me a 7 is high... the mark of a movie well worth watching). If you are one of those people who loves this type of movie, I suspect you will rate it even more highly than I did.<br><br>If it could be faulted it is that the mystery madness (without giving too much away) is never thoroughly explained, and this contributes to a rather notable question mark at the end. It did not bother me... I find the mystery compels us to feel confusion in a way similar to the characters themselves, but for some viewers it will stick in their craw and they will cry foul because the director didn't spell it out for them. But this is a character and survival piece more than anything, so it can be forgiven if it defies leading us by the nose through a neatly sewn up narrative.<br><br>With that said, make what you will of it. Sit back with the big screen and good surround sound if you have it, and a significant other maybe, and enjoy.","user":"sstetsko","rank":[22,33]}]