[{"title":"A stunning comeback for Donnie Yen, this well-plotted, character-driven embodiment of a contemporary martial arts movie is thrilling, gripping and poignant","rating":8,"date":"19 October 2014","review":"As much as we love the 'Ip Man' star, we'll be frank to admit that Donnie Yen needs a hit – bad. Which is why his latest, which reteams him with 'Bodyguards and Assassins' helmer Teddy Chen, is such a huge sigh of relief for us – it packs Yen's signature brand of hard- hitting action with a compelling narrative to be both thrilling and moving at the same time, and is indeed as good a comeback as we could have asked for.<br><br>The setup isn't complicated, and fuses the themes in a kung fu picture into a police procedural. A brief prologue which shows Yen turning himself in at the police station after killing his exponent in a fight frames the former, while the latter unfolds three years later with the emergence of a serial killer who is targeting experts in different martial arts disciplines, i.e. boxing, kicking, grappling, weaponry etc. Immediately after hearing a news report of one such victim, Yen's martial arts instructor Mo Hahou starts a prison brawl just to get the attention of its lead investigator (Charlie Yeung), proceeding to name the others whom he claims would be next.<br><br>As it turns out, Yen's portents come true one by one, and he gets a temporary release from prison to aid in the manhunt. To be sure, there is no doubt on who that is – an unhinged psychopath called Fung Yu- sae (Wang Baoqiang) who has just lost his wife to cancer and now possesses only a murderous motivation to prove himself the best of the best. Unsurprisingly, the film builds to an ultimate challenge between Yen and Wang, the former's motivations and the latter's intentions more personal and intertwined than what you are likely to have thought at the start.<br><br>Chan isn't a storyteller without purpose, and none of that seems lost in Lau Ho Leung and Mak Tin Shu's tight scripting from Chan's own story. Chan's character-driven tale depicts Yen and Wang's on- screen personas as two sides of the same coin, both of them highly trained pugilists tempted to use their skills to kill rather than to protect and whose personal quests for supremacy has blinded them to the consequences of getting there. It is a familiar conceit all right, but Chan's incredibly assured direction fleshes it out convincingly.<br><br>His ingenuity doesn't quite end there; by placing such themes within the context of a modern day setting, Chan has truly accomplished a rare feat of making a contemporary martial arts movie; in fact, we'd even go as far as to say that 'Kung Fu Jungle' is the very embodiment of such a movie. The use of martial arts here makes complete and perfect sense, woven beautifully into the plotting and given a gritty down-to-earth polish that makes it all the more authentic. Chan's aim here is also homage, and eagle-eyed fans of the genre will have a field day spotting – among others – Mang Hoi, Tony Leung Siu-Hung, Tsui Siu-Ming, Yuen Cheung Yan and Sharon Yeung in cameos.<br><br>Yes, many of these stars have paved the ground on which Yen's stature as a martial arts actor stands on, and their appearances – no matter how brief – has clearly energised Yen. His work as action director here is among his best in years, but it is probably no coincidence that he is joined by other luminaries like Yuen Bun and Tung Wai. Each kill provides an expedient setting for a quick burst of adrenaline, with trained kung fu actors like Shi Yanneng and Louis Fan in brief but memorable supporting roles that Wang challenges to a one-on-one fight to the death. <br><br>Quick, clean but brutal – they pretty much establish the tone for the more elaborate setpieces to come, and it is in the latter that one is reminded why Yen is arguably the best active kung fu actor out there today. From a signature 'one against many' brawl in prison to a cat-and-mouse chase in and out of the stilt houses that form Lantau Island's fishing community to an exhilarating finish along the Container Port Road leading out of the Kwai Tsing Container Terminals, Yen impresses with his speed, agility and execution. In particular, the latter ranks as one of his best in intensity and inventiveness, especially with a wowing mid-section that sees Yen and Wang duelling with wooden poles.<br><br>If Wang ever seemed an odd choice for Yen's opponent given his filmography, the Shaolin-trained Mainland actor finally redeems himself here. This isn't their first match-up – that ignominy goes to the atrocious 'Iceman 3D' – but seeing Wang fight the way he does here is truly an eye-opener, firmly putting to rest any doubts of his ability in a physically demanding role like this. Wang is also chillingly good as the snarling murderer whose hood hides a deliberately scarred face, but is equally persuasive when portraying the part of a loving husband to his dying wife. Yen's acting is in equally fine form as an honourable man wracked by his past demons and trying to stop a monster for more personal reasons than he is willing to admit to anyone.<br><br>Truth be told, we weren't quite sold when we heard that Yen and Wang were re-teaming after 'Iceman 3D', and if you're having similar reservations, we're here to tell you that they are unfounded. 'Kung Fu Jungle' is a thrilling showcase of martial arts action and gripping storytelling, a shining example of a contemporary kung fu movie and an earnest and befitting tribute to a bedrock of Hong Kong cinema.","user":"moviexclusive","rank":[40,53]},{"title":"Kung Fu Idol","rating":8,"date":"14 February 2016","review":"Leave it to Donnie Yen, to pay respect and make a movie that is sort of a tribute to a lot of Martial Arts heroes of the past. Acting martial arts heroes that is of course. And this movie does have a lot of them. But it does pay respect to almost everyone in the credits too (stay seated or watch them through if you are a fan).<br><br>The movie also is a combination of different fighting styles. It's sort of a best of. The story is pretty decent for a movie like this too. The stunts action scenes are fantastic we knew that (if you've been aware of Donnie Yens body of work, if you'll excuse the pun). But it's also the story that you want to enjoy too. It might have a couple of bumps along the way, but overall a very good movie, especially for the martial arts fan","user":"kosmasp","rank":[5,5]},{"title":"Surprisingly jaw dropping moves and stunts","rating":9,"date":"28 July 2015","review":"Very fun to watch specially if you like Kung Fu martial arts flicks. KungFu style and moves used here are very surprisingly jaw dropping stunts. It may look bit unrealistic but just for the fun and imagination that Kung Fu is a whole lot on a different level of fighting style you will definitely love it.<br><br>If there's one thing I am missing on this movie is more challenging and long rival fights than easy to the top final match. Other rivals deserves something more too. <br><br>Anyway but still this is really a good one from Donnie yen. A must watch.","user":"sneakablez","rank":[8,9]}]