[{"title":"Wonderfuly Demented, always Engaging, Thriller","rating":8,"date":"16 December 2016","review":"If you watch a lot of movies -- please check out my 1250+ reviews -- you tend to have low expectations for Indies. On the other, die-hard movie buffs are a lot like the story of the little boy who finds a room full of manure and smiles ... because he figures, with so much manure, there has to be a pony around somewhere...? And the truth is, it is Indies just like this one that make reviewers feel like that little boy ... finally something new, refreshing and interesting that somehow managed to swim upstream to the viewer, defying all odds, and avoiding the Hollywood cookie-cutter franchise and deal-making system.<br><br>Superficially, this is a police procedural about a deal gone wrong in a small border town that no one has ever heard of.<br><br>But, it in fact, it is no such thing. And if you approach Hollow Point purely on the basis of the story, you might end up disappointed.<br><br>What it actually offers is a fun ride through a series of almost-disconnected events, events that only have in common the skill of the director and the art of his actors constantly trying to keep you interested and entertained.<br><br>For example (one of many, to make the point) there is a scene where the local sheriff forthrightly is questioning a local car dealer who, presumably, he knows and has no fear of. The car dealer, sitting behind his desk, offers the sheriff a drink, and then makes an offhand, ambiguous, comment along the lines of \"I can see you have already made up your mind\" -- and next proceeds to shotgun said sheriff with a hidden (trick) weapon built into the desk. The camera then switches to the POV of the victim, the sheriff, and slowly fades to black. The viewer ASSUMES the character is gone to his greater reward ... until the same character pops up in a later scene unharmed, and the viewer has to put the pieces together and deduce the character had a bullet proof vest all along.<br><br>IT IS THAT KIND OF FILM. A film more interested in entertaining the viewer than in preaching or making a point or even in telling a story. And it works.<br><br>Director Gonzalo López-Gallego has a great career ahead, his work is flawless. Ditto for the cinematography. Patrick Wilson and Ian McShane are both mainly character actors here elevated to starring roles -- and they are more than up to the challenge.<br><br>THE JOURNEY, NOT THE DESTINATION.<br><br>Fun. Entertaining. Recommended.","user":"A_Different_Drummer","rank":[61,83]},{"title":"Well acted crime-thriller","rating":7,"date":"26 June 2016","review":"The illegal arms trade between the USA and Mexico is the basis for the story in this crime-thriller. It involves world weary policemen, a shady local businessman, a professional killer and the dusty environs of a small town in the American South. It put me in mind of the recent Cold in July (2014) in its tone, feel and setting. Both films share quite well drawn characters and sudden scenes of strong violence. This one benefits quite a bit from a very fine cast, where we have Patrick Wilson and Ian McShane as a couple of police officers, both of whom have their own internal demons. McShane in particular seems to be having a lot of fun here and gives a very lively performance that is very good value. We also have John Leguizamo and James Belushi as the bad guys of the piece; the former doesn't perhaps get to do much more than exert an ominous physical presence (although he does it well), while Belushi is given his most interesting role in years in which he makes the most of.<br><br>The story-line is fairly complex at times, with a variety of characters interconnecting with each other in different ways. But I don't think the story is really the main selling point in this one. It does have some thrilling visceral moments for sure but this one ultimately is best enjoyed as a character-driven genre effort. A very solid and well-executed genre piece on the whole.","user":"Red-Barracuda","rank":[67,98]},{"title":"Very good movie","rating":9,"date":"21 December 2016","review":"Realistic, frightening, gritty movie - unfortunately based on a real current topic/threat/situation. Movie visuals were stunning. Scenes of dusty roads, rusted trucks showed a pretty realistic view of life in a small border town. Somewhat of a cross between an old western with a good dose of modern day reality. Acting was good enough to make you forget that these guys are only playing characters to tell a story. a story. Patrick Wilson, Ian McShane and James Belushi were very good portraying good and bad sides of their characters. John Leguizamo was terrifying. I cannot understand why this movie was given only a limited release. It should have received a theater release to mass markets. Very good movie.","user":"dsdrp","rank":[30,46]}]