[{"title":"Rizsard Kapuscinsky or how to give voice to poor and wretched peoples","rating":7,"date":"22 April 2019","review":"Rizsard Kapuscinsky is one of the most important reporters of the XX Century, and someone who witnessed some of the biggest war crimes in Europe, Latin America and Africa. His books and reportages are ineludible documents to understand all the interests behind war, invasions and geopolitics. It is not surprise that any American viewer say nothing about this animated documentary. It is very probably that American audiences doesn't like at all what Kapuscinski has written, and the way he is portrayed on here. Very far from the way are portayed reporters Bob Woodward and Carl Bernstein on the Watergate affair. In that case, there is no ideology. America film and history are made to believe that what both Washington Post reporters it is what investigative journalism is all about. This is, for say the least, an arrogant point of view. America is not the world, nor even the center of the word. Is one pole. The other is Russia, and the former USSR.<br><br>This animated documentary involves both poles from the Cold War, and is not, and cannot be by any means precisely a fruit of objectivity. But, as Kapuscinski put it in many other of his reporter works, and is put it that way on here, his job is to give word to those are condemned to be forgotten, those who usually die amidst oblivion and never are listen, those who are needed and poor, just like Jesus say on his preach, which not means I compared Jesus with Kapuscinski.<br><br>Animation is awesome on this documentary, the way are blended original footage and pictures of many of the depicted characters is just amazing, and shows how American power is capable of the worst atrocities only to support its foreing policy of destruction and empoverity entire countries. The Angola conflict is one of those defeites that American doesn't want to remember, after Vietnam. Of course, it would be naïve to consider that this documentary support openly Russian interventionism, since they abandon too Angola, only to see how Cuba took their place in the conflict and made it to succeed.<br><br>There is no such a thing called neutral interventionism, but Kapuscinski knows that he has to be the voice of those who hasn't and seem condemned to be crashed by any outside political power. \"This is the way I look\" is a frase repeated several times in the documentary, as if little people raise his voice to be remeber in the future and not fall into oblivion. That's the very point on what Kapuscinski was doing all his life, and for that will be remembered as one of the biggest and more influential reporters of the last century.<br><br>A very impressive documentary, a must see to unveil our prejudices about interventionism.","user":"jmrecillas-83435","rank":[15,20]},{"title":"Ultimately a shallow and predictable movie","rating":3,"date":"15 February 2020","review":"(I know this comes across as a political rant rather than a review. But my point is not the politics of the movie, it is the way movies like this are created, the vacuity of their viewpoints.\nI'd be just as angry if the movie were it's mirror image, centered on \"the noble FNLA and their South African allies engaged in an ultimately futile but heroic attempt to liberate Angola\".)<br><br>I have some personal interest in this movie insofar as I was growing up in South Africa during the Angolan civil war, and (as a kid, then a teen) heard occasional talk of South African involvement.\nSo I was hoping for something that gave some insight into the war. But that's not what's on offer here. Instead what's on offer is one long apologia for how great the MPLA were, and how awful UNITA and the FNLA were. I certainly have no complaint about the second part, UNITA, and Savimbi, were pretty ghastly. But that does NOT make the MPLA the heroes of this story.<br><br>We hear a constant stream of claims.<br><br>* How 90% of the population supported MPLA (well, WTF knows in 1976, but when elections were finally held in 1992 MPLA received 49.57%, UNITA 40.6%, with the majority of complaints about unfair voting against MPLA.\nWe hear about FNLA child soldiers, but MPLA apparently did the same thing. A Google search for Luis Samacumbi will tell you the story of two kid brothers, one grabbed by MPLA, one by UNITA. (BTW Kapuscinsky's heroine, Carlotta, joined the MPLA when she was 15 so...)<br><br>* While UNITA+FNLA was indeed backed by the US and South Africa, it was also backed by, tada, China...<br><br>* As for civilian deaths or massacres, it's impossible to give even approximate numbers as to which side was responsible for what, all that's agreed upon is that both sides appear to have been pretty much equally enthusiastic about engaging in such activities.\nWhat IS clear (even if you're an unrepentant strong leftist) is that on 27 May 1977 there was an MPLA internal reaction against the leadership, followed by the usual arrests, secret courts, and executions (at least 20,000, perhaps as high as 70,000).\nHow did the MPLA do as a government since 1976, both at times when the war was fierce and when it calmed down, and then eventually ended? Well, you know the story. Lots of oil, lots of diamonds, lots of astonishingly poor people. And of course home of the richest woman in Africa who (I'm sure this is just a bizarre coincidence) happens to be the daughter of the ex-president...<br><br>* One final bizarre detail. The movie keeps harping on the fact that Kapuscinsky was supposed to report that the South Africans had invaded, but this was suppressed and \"The world denied it\". I've no idea what this is talking about because the NYT, on October 24, 1975, a day or two after the South Africans crossed the border, carried on article on precisely this issue.<br><br>It seems that Farrusco's real compaint is not ethical, that \"the world\" denied South African intervention, but military, that (most of) the world acknowledged the intervention but also (correctly) saw both sides as irredeemably awful, and chose not to intervene.\n(And note that the same people so concerned that \"the world must know about South Africa in Angola\" are even more concerned that \"we must keep secret the presence of Cuba in Angola\"...)<br><br>BTW that hysterical assumption that if the US knew about Cuba they would, what, nuke Angola?, was as ridiculous as the assumption that South Africa was in it to recolonize Angola then the rest of Africa. The CIA was well aware that the Cubans were involved in Angola, as we know from the National Intelligence Daily reports published at the time.\nIt's probably, as a general principle, a silly idea to betray what you claim are your principles on the assumption that the CIA doesn't know something that's clearly obvious to an organization that can track ships and planes, and has spies and satellites...<br><br>\nI mention all this not because I'm a great fan of UNITA, the FNLA, or the South African Government or the CIA, but because I think the whole slant of the movie is despicable.\nThe slant SHOULD have been that this was a war between two awful, awful sets of human beings, with basically nothing decent on either side. Absolute monsters who chose to keep the war going for 27 years essentially for their own petty purposes.\nTo portray it as the valiant, MPLA, blameless stainless embodiment of the people against the grasping capitalist UNITA intent on nothing but stealing from the country, is pure propaganda. Kapuscinski may have made many friends among the MPLA, but that's not the same thing as the MPLA being on the right side of history -- you can find plenty of memoirs talking of individually decent German soldiers who made friends with the other side in PoW camps or wherever.<br><br>\nThe valorization of this movie (the awards, the rave reviews) show, IMHO, viewers who know nothing about the conflict, but are happy to have all their prejudices confirmed. As far as I can tell, they consider the movie greate because:\nYes, this was all the fault of outsiders and every Angolan involved had neither agency nor responsibility;\nyes the leftists (aka the good guys) won in the end; and\nyes, the most important thing about these conflicts is not that they are represented in a historically accurate way which might allow us all to learn something, but that they can serve as catharsis and growth for one writer.\nAnd if to achieve that requires grotesquely misrepresenting the larger historical truths, well, that's art for you! 500,000 dead but we're meant to interpret the entire conflict through the lens of the death of Carlota, a cross between Angela Davis, Ulrike Meinhof, and Leila Khaled...<br><br>I'm pissed off at all this because the world doesn't need yet another sappy bildungsroman movie centered on the personal story of how some individual faced trauma and grew; we already have approximately ten million movies like that. This COULD have been a movie about how awful war is, especially when is so pointless and led by such awful leaders; it could have been a general investigation of why so many people engaged in so much insanity for so long.\nBut we got nothing original, just a cartoon story of cartoon villains and cartoon heroes.\nAs long as movies like this tell these wars not as stories of pure evil, but as stories of supposedly fine decent people (Carlota, Farrusco, the entire MPLA apparatus) engaged in justifiable violence on the side of good, we're just going to get more wars. You stop war by saying, \"No, it was NOT worth it. It was a dumb strategy, pursued selfishly, that destroyed the country for at least two generations.\" Not by saying that it was all a fine honorable idea.<br><br>If you think I'm being too harsh, do a web search for Artur Domoslawski, who wrote a biography of Kapuscinski that says, among other things, he had an, uh, complicated, relationship with the truth, just as he had an, uh, complicated, relationship with Polish intelligence. (I'm guessing this is the same Artur, somewhat more cynical and realistic about Angola, who appears in the movie, but I'm unable to precisely validate that.)","user":"name99-92-545389","rank":[6,10]},{"title":"This movie was pretty great!","rating":8,"date":"13 February 2020","review":"This movie is like two movies in one. Part of it is a documentary about the Angolan Civil War. The other part is an animated film about the same subject, following Polish journalist Ryszard Kapuscinski reporting on the war in the 1970s. The first thing that I need to talk about is the animation. It is animated in that rotoscoped cell-shaded CGI style similar to A Scanner Darkly or the Love, Death &amp; Robots short Fish Night. Normally, I hate animation that is trying to look realistic, but I didn't mind it here. There are many sequences of animation in this movie that just couldn't possibly work as well in live-action. The colours are really nice and it is intense! It actually feels like you're in the middle of a war! The story I found very interesting and the intercut documentary footage of people who actually knew the main character in real life and are characters in the movie themselves was really cool and helped with my understanding of the story and the history behind the film. The acting was really good as well and I really cared about the characters. Overall, if you like animation or historical war movies, you should watch this movie. It's very short, but very good!","user":"ajzeg","rank":[2,3]}]