[{"title":"Nothing to see here, really nothing to see","rating":2,"date":"5 October 2014","review":"I didn't expect much from this film and unfortunately I was right in doing do.<br><br>The story is quite poor which makes it very easy to figure out the connection between the characters and therefore most of the plot/twist long before it is revealed.<br><br>The stereotyping is just appalling, almost about as bad as in the movie Midnight Express that was mentioned in the movie; the Turkish \"bad-guys\" were either pictured as steroid eating muscle bulging mountains or sly and cowardice rats.<br><br>I can't really go into the moral issue of the story without ruining the (attempt of a) plot, but I can say that it didn't make up for all the other awful aspects of the movie.<br><br>As a final remark, Mark O'Neal is about as good an actor as an average couch potato sports fan is at being one of the elite athlete he/she's watching. Just awful to watch.","user":"feel-1","rank":[19,22]},{"title":"Terrible in ways that would make Ed Wood proud","rating":1,"date":"24 October 2014","review":"I don't think I have the words in my vocabulary to convey how terrible this movie is. Stilted, overwrought, contrived -- even these words fall short of describing the amateurish drivel that is the screenplay for The Disappearance of Lenka Wood. <br><br>Maybe it's best to let the film speak for itself. Here is an excerpt from the second act:<br><br>Army Guy: Next time, I'll cut your leg open. Then you'll have three wounds, and only two hands. You get to choose which one stays open.<br><br>Corrupt Cop: please, ill tell you where she's being kept<br><br>Army Guy: write it down for me <br><br>Corrupt Cop: I don't have a pen!<br><br>Army Guy: You can use your own blood!","user":"adamz3998","rank":[7,8]},{"title":"Mediocre, but I've seen worse.","rating":4,"date":"6 October 2014","review":"It starts off with Dexter, a special forces member who would extract information from those in Iraq he felt had info the US military needed. After leaving the army, Dexter becomes engaged to Lenka, and the two decide to spend their pre-marriage honeymoon in Turkey. They go out to dinner, and Lenka tells Dexter to follow her in a few minutes, because she is going back to their place to put on something sexy for their \"alone time.\" He does so, only to find the place a mess and Lenka is missing. A lot of the beginning has Dexter in a police interrogation room, and there are plenty of flashbacks that show what I described. When the detective leaves, Dexter beats up three policemen, with one punch for each one. His fists must be made of dynamite. lol In fact, he sees a muscle-bound Turk on the streets and knocks him out with a single punch. Rocky's lucky he never went up against this guy. haha.<br><br>I didn't think this was as bad as the reviewer Feel-1 did, but it was nothing new. Dexter reminded me a lot of Thomas Jane, and Lenka reminded me of Naomi Watts - just in how they looked. Considering that it's low budget, the cinematography was pretty good. It clocks in at 73 minutes, and it is filled with plenty of clichés. I think it's as good as this could be with the low-budget, but it's nothing new. Parts of it were very reminiscent of \"Frantic\" starring Harrison Ford, and \"Breakdown\" with Kurt Russell, both of which were obviously better in every way.<br><br>One of the overly used clichés is that the only good-guy characters in this are Americans, and one British (?) guys. All the Turks are evil. In fact, only the lead character, his dad, and his dad's friend are the only good guys in this. That used to work in movies, but the real world is hardly as black-and-white as that. I know, this isn't reality, it's just a movie. Still, I wish movie makers would try to focus on realistic story lines if they're gonna bring realistic situations into the story.<br><br>There's very little action. A lot of the time, Dexter is spying out the area he intends to invade. I've seen worse, but I've definitely seen better. There is some nudity. A woman takes off her panties, and her butt is visible. She also takes off her bra, exposing her breasts. There was a twist at the end. I suspected it in the beginning, but as the movie went on, I doubted they'd do it. But they did it. I won't spoil anything.<br><br>I gave this a 4-star rating.","user":"chrismackey1972","rank":[5,7]}]