[{"title":"Weird ride down, but very effective.","rating":7,"date":"9 March 2016","review":"I did not see this one coming.<br><br>I really loved the music, gave it an old school giallo feel to the movie. Not that all the yellow in the cinematography didn't do the trick.<br><br>Road Games does expect us to swallow some stuff that does not go down too well, but overall it was a great slasher-styled movie experience, that never bores.<br><br>The characters are interesting enough to keep your interest to the very last minute, and I mean the very last.<br><br>The suspense of what's going on is great. Lots of twist and turns to keep you on your toes as you try to figure out what's going on.<br><br>The plot twist was a little lackluster, but it goes with the whole environment.<br><br>Well done!!","user":"subxerogravity","rank":[17,26]},{"title":"Surprise! It's a thriller","rating":7,"date":"17 August 2016","review":"Welcome to the Road Games. Something no one will be saying in this movie and it wouldn't be appropriate. It is a road movie though and it does a really good job in taking turns, if you know what I mean. You have good actors in this and they really elevate the movie and the characters they are putting out there.<br><br>You know something is not right, but what could it be? Even if you figure most of it out, before it is revealed, the joy is in the ride (no pun intended). Beautifully shot and nicely edited, the tension rises and is even more crushing if you haven't read anything about this. It also has no relation to an 80s movies with the same title. I even think in France they had another title for this overall. Whatever the case: This is a fine example of a good road thriller","user":"kosmasp","rank":[10,15]},{"title":"A ride worth taking... just make sure you're strapped in tight.","rating":10,"date":"7 March 2016","review":"Really enjoyable suspense thriller. The whole French/English language barrier is what is so unique and sets it apart from other movies. It ups the tension and is my favourite aspect, how it uses the language barrier to its advantage. Just as Jack may (or may not!) be misinterpreting events and meaning, we too are kept unsure about what we think is actually happening.<br><br>It's interesting how the language is used in this way, as part of moving the plot forward. It's intriguing and pulls you into the story, leaving you trying to untangle the madness. I'm not sure I've quite seen that in a movie before, not done in a thriller at least. <br><br>There are a few weak points plot-wise but the film works as a whole and is definitely worth a look if you're into something fun and a little different.","user":"Alf_Ant","rank":[17,29]}]