[{"title":"Blood Hunt","rating":2,"date":"15 November 2017","review":"SPOILER: What could be better than a weekend in the country with the love of your life? How about a weekend in the country with a little sadism, rape and murder thrown in? \"Blood Hunt\" starts off very slowly but soon deteriorates into a senseless gorefest when our hero and his lady run into a group of ne'er-do-wells who take them captive after a car chase. She is raped and he is nearly murdered. The bad guys are not simply bad but dumb, because they keep letting them escape. <br><br>The final escape does not go well because half-way to the nearest hospital and police station - probably a few hundred miles in this part of Australia - she realises how badly she is wounded. He doesn't, because if any normal man had been subjected to what he has been through, he would be half-dead by now, but somehow he manages to...so what's a guy to do after his good lady dies in his arms? You guessed, the only thing possible: revenge.<br><br>The soundtrack to this film is reasonable, but when you've said that, you've said it all. In recent years, the Australians have produced not a few films in this vein. Sadly, most of them suck. Certainly this one does.","user":"a_baron","rank":[14,17]},{"title":"Got a light?","rating":1,"date":"31 August 2017","review":"Dean (Dean Kirkright) and Claire (Kahli Williams) head out for a weekend only to become the toys and captives of some small town yokels who have the proverbial remote junkyard.<br><br>The film opens with a back and white rape as if it was shot from a head cam. Why? I don't know. Nothing else is found footage, which is a good thing, but doesn't prevent this Redbox offering from being a complete disaster. I was really bored having to listen an entire song while they drove the country side without talking. Doesn't add anything to the genre.<br><br>Guide: F-word. Rape. No nudity.","user":"nogodnomasters","rank":[9,11]},{"title":"One hour and eighteen minutes i've thrown away","rating":1,"date":"26 July 2017","review":"So far from being anywhere close to what a good horror/thriller/survivor-movie should have.<br><br>I really don't like being negative about low budget movies, but they usually have a deeper respect for filmmaking then the average Hollywood movies. And that's why i love indyfilms,, because they usually push the boundaries. And this is what we see in they're films. A will to make they're stories. <br><br>This has absolutely none of that spark at all. Just a idiotic plot to show meaningless violence and a poorly directed rape. And the violence is not even horrible. The bad guys are so horrible actors that the whole thing is more laughable then horrifying. <br><br>And it's never a good idea to rip off movies like \"Wolf Creek\" and \"Eden Lake\" just because you make films in Australia. The fact that it's so obvious puts more focus on the badness of the film. <br><br>Boring violence isn't enough to make a film shocking. You also need a decent story, actors, cameratechnic, editing and a lot more. <br><br>Check out \"Storm Warning\" and the others i mentioned if you're looking for good Aussie-films. <br><br>ET...","user":"edwardbundy","rank":[15,23]}]