[{"title":"Takes everything you think you know, stirs it up and throws it back at you to figure out.","rating":10,"date":"18 October 2014","review":"Camp X-Ray is one of those films that doesn't quite leave you after the credits roll. It wasn't what I was expecting and I was surprised the film didn't revolve around politics. The cinematography, the soundtrack, including the constant hum in the background all formed a very real atmosphere. Visually, Camp X-Ray is impressive, but the real essence of the film does lie in the characters. The acting is some of the best I've seen. <br><br>80% of the film takes place on opposite sides of a cell door. We catch a small glimpse through a small glass window, and yet this is enough to feel the chemistry between Peyman Moaadi and Kristen Stewart. I can't even begin to imagine the difficulty at capturing what they did through a window, but it appears effortless. <br><br>The characters are incredibly fleshed out and there are some small hints of this, such as a glimpse of Cole wearing socks with sandals. A personality statement in itself. It's all about the small things!<br><br>I do think a big part of why this film affected me so much is because of my age. I saw parts of Cole in myself.<br><br>She wants to make a difference, she's seeking a way to push herself and the army is a straight forward way of doing that. It pushes your limits, it goes against what women should really do, and by doing that you're trying to prove something within yourself. You're tougher and braver than you appear. Yet put in this situation, things aren't so straight forward or 'black and white' as she expresses. Life is so much more complicated, relationships develop, experiences happen that throw you off course.<br><br>Then there's the added uncertainty of everything, the frustration of not knowing, wondering whether this is right? Whether this is what you want to do? Whether it's okay to speak to this guy? Questioning what you have always been taught is right and wrong.<br><br>I do feel that a lot of films tend to portray women as tough, fearless and almost masculine, but underneath the tough front, I think we all really are vulnerable. There's no escaping that. It's easy to act like things are okay, to put on a tough front, to hide, but there's still always going to be that vulnerability...maybe it goes as you get older, I don't know.<br><br>In the end she discovers her way own way of making a difference, in a way that at the beginning of the film would have been unimaginable, and it just shows how much can change, how little we know, and how important it is to keep an open mind.<br><br>Overall, I was surprised. It wasn't the film I expected, but much, much more. You'll feel every emotion imaginable. It's the kind of film that takes everything you know, or think you know, stirs it all up and throws it back at you to figure out.<br><br>Everything about this film is commendable.","user":"twokelvins","rank":[150,179]},{"title":"Excellent performances by Stewart and Moaadi, moving storyline","rating":10,"date":"19 January 2014","review":"Moving and emotionally charged performances by both Stewart and Moaadi from beginning to end. I was completely surprised by the subject matter of Gitmo, expecting a political message as the underlying theme, but it turned out to be a study of humanity and relationships within extreme circumstances. Impressive directorial debut of Sattler. <br><br>Stewart plays guard Amy Cole, a young marine from a small town who joined the military to escape her life. The movie centers around the conflict of her growing relationship with a prisoner, Moaadi, who has been in Gitmo for eight years. Both actors do justice to the storyline and these complex characters without building caricatures of military and extremist personalities. I'm not one for heavy military story lines, but I was pleasantly surprised by this film's twist to the Gitmo plot with a narrow lens on the people, not the politics. It's not all heavy subject matter....Moaadi adds some appreciated humor. Bottom line: worth my time.","user":"Tdc-91-186252","rank":[232,294]},{"title":"Surprising and very moving","rating":8,"date":"25 October 2014","review":"This film affected me very deeply in a way I was not expecting.<br><br>Kristen Stewart and Peyman Moaadi deliver stunning performances which take your breathe away. You really feel for this guy and Stewart has never been more convincing. I thought it would be a stretch to imagine her as a tough soldier and it is kind of surreal yet she manages to create a credible person out of the role. Her emotional distress as the contradictions of her job as camp guard begin to overwhelm her, is very powerful and a pleasure to watch.<br><br>This film totally changed my mind about Gitmo. Just because it makes you realize the awful possibility that totally innocent people may be stuck there, and that unlike any other prison in the USA, there is no way for them to appeal or for anybody to appeal on their behalf.<br><br>There must be some way to allow mistakes to be corrected. It's not right.<br><br>It's amazing to me that I never saw it that way. I just assumed that they were all hard core bad guys. But what if they aren't.<br><br>That would be a terrible fate, and this film really punches home how terrible it would be.","user":"toby-brace","rank":[60,73]}]