[{"title":"Just as entertaining as the first movie...","rating":5,"date":"15 April 2014","review":"If you enjoyed the first \"Bad Ass\" movie, then you will definitely like \"Bad Asses\" as well, because it is just as entertaining and out there as the first movie was.<br><br>The storyline is much similar to the first movie, sure. Frank Vega (played by Danny Trejo) is now trying to live a fairly quiet life after his semi-famous attention he got in the first movie. Living in a quiet neighborhood, he frequently visits the nextdoor liquor store run by Bernie Pope (played by Danny Glover). Frank is training local youths in the boxing center, when Manny (played by Jeremy Ray Valdez) gets killed because of drugs. Teaming up with Bernie after he saved Frank's life, the two men set out to find out to clean out the dirty seed in the community.<br><br>Actually the storyline was good, despite it being corny and full of clichés. But there was just something fundamentally entertaining about it. And the movie really flourished because of the talents that were in the movie. Both Danny Trejo and Danny Glover were excellent cast for their particular roles. But I will say that Andrew Divoff really was well cast for the role as Leandro Herrera, and he played the character well.<br><br>There is a good amount of action in the movie, and despite being up well in their ages, both Danny Trejo and Danny Glover do show that they still got it. And Danny Glover did bring a comedy relief to the movie, that actually worked out quite alright.<br><br>So, for those who enjoyed the first \"Bad Ass\" movie, you don't want to miss out on this one.","user":"paul_haakonsen","rank":[13,14]},{"title":"Great Action Comedy","rating":10,"date":"20 April 2014","review":"I enjoyed the first one but really didn't know what to expect with the second one... but sure enough it delivered and it delivered hard. One of the better action comedies I've seen in a long time. Good story, well choreographed action scenes and solid cast but most of all this movie had heart. Trejo and Glover are hilarious together. What I love best is that this movie doesn't take itself seriously as it takes a page out of some of the great '80's action comedies complete with tongue in cheek one liners. Loved that they cast Jonathan Lipnicki (\"Jerry Maguire\") and the addition of Loni Love takes the comedy to a whole other level. Was very excited to hear that they're making a third installment of the film with third Bad Ass John Amos. \"Expendables\" got nothing on this movie.","user":"livimak","rank":[14,17]},{"title":"If you liked the first movie...","rating":15,"date":"15 July 2014","review":"I enjoyed the original \"Bad Ass\" movie, so I looked forward to this sequel when I heard about its release. I had to search for it in several video stores in my city, but I eventually found it. Was it worth the wait? Overall, I would say yes. The sequel has the good idea of giving the lead character an equally old and grumpy partner, and the two Dannys (Trejo and Glover) playing the leads manage to generate some great chemistry. It also helps that their characters have been written to be very likable not just together, but apart. The movie has generally good production values and moves from scene to scene fairly quickly, so there are no boring parts. Don't get me wrong, this movie is not perfect. The movie cheapens out at one point by extensively using footage from the 1990 movie \"Narrow Margin\". Also, the movie's mix of yuk-yuk comedy with hard violence does give the movie an inconsistent (and weird) feeling at times. Fortunately, there's more good stuff than disappointing material here. So if you liked the first movie, chances are you'll like this sequel.","user":"Wizard-8","rank":[4,4]}]