[{"title":"Not enough time","rating":8,"date":"27 December 2013","review":"As others have pointed out, the main problem with The Time of the Doctor is that it is too short. Or perhaps Moffat had too much to put in it. Either way, it leads to an episode with a few frayed ends where it has been stretched too thin. The whole family Christmas dinner, for starters, is basically pointless. What should have been no more than an establishing shot, a starting point for the story, is allotted too much screen time, the loss of which is only compounded in other places. For example, Mother Superious (Tasha) being Dalekified and then un-Dalekified in the space of a minute. That's no way to put us on the edge of our seats, Moffat, you have to build up the tension, then release it, not pop the balloon while you're still blowing it up.<br><br>Anyway, that can all be forgiven, which I can't say of my main objection: the Time Lords suddenly going all weak in the knees, giving the Doctor a new regeneration cycle and (apparently) just giving up the entire plan of trying to bring back Gallifrey. If that wasn't important, then why go to all the trouble? And hasn't it been established (in The End of Time) that the Time Lords are basically evil now and would rather destroy the universe than remain stuck in the Time Lock? So now we are to believe that all it took was a pretty girl saying \"please\" and that's that? Suddenly they all love the Doctor, and are okay with not doing the whole \"getting back into the universe\"-thing if it means helping him out with his bad back? Sorry, but no. I don't buy it.<br><br>That is, I don't buy the motivation. I accept that it happened. I accept that the Doctor was granted a new regeneration cycle and used it to defeat the Daleks and that it set up an excellent regeneration scene. I also feel that given the number of loose ends that needed to be tied up, we can take this in our stride and just be happy that it isn't Damon Lindelof who's running the show. At least we were given some fairly decent answers and everything mostly came together. I'm sure that had this story been given half an hour more to reach it full potential, it would have done so, and so I'm just going to imagine that it did. The canon stands, and I'm happy to fill in the gaps myself. But please, BBC &amp; Steven Moffat, next time, take your time.","user":"rubenvanbergen","rank":[17,19]},{"title":"Maybe it was all one plan","rating":8,"date":"26 December 2013","review":"OK so I will agree with some people that this special was cheesy and overly complicated. I can only imagine Steven moffat explaining the concepts and plots to the crew and cast and everyone looking at each other saying huh. But I've always suspected that Steven moffat wasn't making this up as he goes along. I think that going all the way back to silence in the library he had already written a general outline of the crack in the wall, the silence assassinating the doctor, river song being Amy ponds daughter, Amy and rory dying, the doctor meeting Clara, Clara being the impossible girl, the name of the doctor, and the doctor saving galifrey instead of destroying it. First of all in the episode lets kill Hitler the doctor is talking to hologram Amy and says \"so I just regenerate.\" This however does not necessarily indicate a contradict. Hologram Amy said \"regeneration has been disabled.\" Maybe she didn't mean that the poison disabled his regeneration but that because he is the twelfth regeneration and did not know that he couldn't regenerate again. Also in the episode in the space hotel where you find your worst fears the doctor sees what he fears most but we don't see it. Now most people assumed that it was losing Amy pond but I think that moffat always planned that the crack in the wall was his worst fear. Also when the doctor talks to Dorians head Dorian says \"on the fields of trensalore where no living creature can lie a question will be asked.\" Everyone thought that was the episode the name of the doctor but he said the fields of trensalore not the ashes. However there are things that I was in satisfied with like he stays young from age 900- 1200 and then from 1200-unknown he starts to age, even though gallifrey is stuck in a single moment they can still send out a message meaning they aren't frozen, what the doctor \"ate\" I think time energy or something caused him to shoot and destroy the daleks, that when the doctor did regenerate he didn't \"explode like the last times, and even though we only saw a peter calividi for a minute he showed a similar personality as Matt smith. Overall I recommend watching it twice and it's better the second time 7 stars","user":"Erichnathanbennett","rank":[8,8]},{"title":"Under-appreciated","rating":10,"date":"10 January 2015","review":"Matt Smith's regeneration episode was incredibly well handled. It is horrible that so many people hate on it. Moffet's writing was getting extremely dark and depressing, which is how he writes, but it began to get extreme in season 7. This episode in my opinion is more balanced. It blends darkness with a good amount of comedy and action, which is a blend I didn't expect. Moffat was continually portraying Matt Smith as getting old and worn out during the season, which people complained about, but I feel that was a good twist, a weary doctor who has seen to much and it has scarred his youthful face, and it ages him mentally, and in this epic conclusion he ages physically as he is forced over years to fight his worst enemies. It is the ultimate irony, to not spend your last years with loved ones or friends, but to spend your time slowly dining of old age fighting your worst enemies. Matt Smiths Acting was brilliant and Clara showed the scared and frightened girl, showing vulnerability, all wrapping together with a dramatic regeneration scene which had people complaining, but it really allowed him to really cut deep with his death but still have time in between to say memorable, very well written, last words, instead of a brisk, you were fantastic, or, I don't want to go, this controversial way of regeneration allows his enemies to share in the drama of the regeneration, and it is actually written in a way that it is used to defeat his enemies, not done before. And the final change is interesting as 11's spontaneous and inconsistent life ends with a fast bang, just as it should be.","user":"jgm0228","rank":[10,12]}]