[{"title":"Went in with no expectations and was still disappointed.","rating":3,"date":"4 May 2015","review":"I try to give Friedberg and Seltzer the benefit of the doubt. I'm a sucker for a good spoof movie and these guys HAVE put out some good ones in the past. I got enjoyment from the first four Scary Movies. Yes, even 4 had its moments. By this point though it's obvious that the duo of filmmakers are just beating a dead horse. They played their hand and have nothing left to show - Superfast! is just another nail in their already-laid-out coffin.<br><br>Against my better judgement I've seen almost every spoof these guys have done. If you know anything about the directors then you should know what you're getting yourself into with this movie. I had no expectations, and the movie still managed to disappoint. It's certainly not the worst movie they've done - it's a step up from the utter sh*tpile known as The Starving Games and certainly more watchable than Disaster Movie, Vampires Suck, and Meet the Spartans. The problem is that this movie had potential. It really did. Superfast! acts as a spoof not only of the Fast &amp; Furious franchise but of action movie clichés in general. The jokes that can come from that are endless, and the beginning of the movie gave a few chuckles and showed a hint of promise. But as the movie goes on it becomes more and more clear that these spoofers think toilet jokes and cheap gross-out gags are funnier than genuine satire.<br><br>I'll give credit where credit is due: The casting in this movie was good. Especially the Vin Diesel caricature and the cartel kingpin. It looked like the actors were having fun and doing the best they could do with the material they had. It's unfortunate that their talents were wasted here because they definitely have a sense of good comedic timing and decent acting chops in general. <br><br>That's about as far as the positives go. The awkward \"humor\" is just cringeworthy and uncomfortable. The toilet humor got old decades ago. A good amount of these jokes wouldn't go by well in an Elementary School let alone on the big screen. Superfast! is filled to the brim with moments that leave you thinking, who in the hell thought that was funny? Who thought making this film would be a good idea? And most importantly, why are these talentless hacks still making movies?","user":"lnvicta","rank":[38,49]},{"title":"Just a bit of daft fun","rating":1,"date":"1 April 2015","review":"If this makes an average over 6 stars I would be surprised. As a film it's all a bit of crap visual comedy but if you view it as simply a series of sketches strung together loosely based on a series of memorable scenes from the original franchise you'll probably rather enjoy it.<br><br>Written and directed by the guys that did the Scream series on a shoestring budget. Unknown actors good a pretty fair job.<br><br>I like films and cars. As a film it's not that great but as a bit of light Sunday afternoon comedy it's perfectly passable. It's the sort of film that will bomb at the box office because the core 15-25 male market will probably dismiss it in public but will soar on torrent sites in private.<br><br>Michelle delivers some dynamite lines, The Rock is pretty funny too. Paul seems to sidelined a bit, almost on purpose it feels like, a little contrived but understandable. Dom gets the best lines but fluffs them a bit but I thinks that's poor direction as he nails others. Vince, arguably, does the best parody performance of the lot, in a comedy he is the comic relief.<br><br>Don't expect too much and don't be 'that guy' on Reddit picking holes in a film that has no pretences to be a fine piece of art and you'll probably enjoy it.","user":"scott_turnbull","rank":[31,51]},{"title":"Finally, a good parody","rating":7,"date":"12 May 2015","review":"\"Airplane!\" was just about the last good parody to come out of the film industry, and it's been a long time. Since then, most attempts have failed because they take the cheap way out and give us a string of cheap dirty jokes, thinking it's funny. It makes the little kids laugh, kind of like making noises with your armpit.<br><br>I was expecting more of the same with \"Superfast.\" But it only took a few minutes to see that these people get it - they know that you have to have a constant flow of references to the film being parodied, in this case, the entire Fast and Furious franchise. <br><br>This is the first parody that I laughed out loud, along with my wife (who had had a bad day), and one of the few that we didn't lose interest before the film ended. <br><br>If you enjoyed Airplane! (\"Don't call me Shirley\") and the silly jokes it was full of, you will certainly like this one. Yeah, they scraped the bottom of the barrel once in a while, but you have to do that if you're going to get all the clichés in.<br><br>I loved it, and I didn't expect to going in.","user":"harbhippo","rank":[21,35]}]