[{"title":"Expected worse","rating":6,"date":"19 July 2014","review":"Took my 5 year old to see this fully knowing the franchise is worn out after having seen the disappointing Cars 2 and the first Planes. The plot is more interesting here as it plays out like an 80 minute episode of Rescue Heroes. <br><br>The animation is fantastic as you would expect. Having animated planes allows for more panoramic views of the woodlands and fires.<br><br>Sounds like kids were bored during the sad parts. The story didn't really need this as it's all predictable. You knew Rusty would defeat the odds to save the day in the end. Dane Cook voiced Rusty similar to Owen Wilson's Lightning McQueen, very down to earth without being over the top. <br><br>There is certainly nothing groundbreaking here but the action scenes were good enough for my son to say he liked it (which is all that really counts!).","user":"banosd","rank":[24,29]},{"title":"Surprisingly Exceeds my Expectations.","rating":7,"date":"26 July 2014","review":"Surprisingly to my knowledge, Planes: Fire and Rescue is not a cash in on the Cars Series. Unlike most sequels, The film was made to show the day in a life scenarios of firefighters fighting fire season where here in British Columbia where I live, the fires threaten many people. This is one of the best things about the film, Disney Toons, who is the studio behind the first Planes movie shows they're capable of living up to the standards of their Farther and Mother animated studios which shocked me. <br><br>At 84 minutes long, the movie opens up with a message dedicating this movie to all the firefighters who risked their lives. So now on to the film, Dusty Crophopper has won many trophies. But on the eve of a festival in Propwash Junction, his gearbox is damaged and his friends tell him he may never fly again. After an accident, the main town firefighter Mayday is in danger of losing his job and Dusty tries to get himself Certified as a Firefighter to get his job back. But is in danger of a greedy lodge owner trying to ruin everything and his life. <br><br>The most memorable characters I found in the movie was Dipper. The main girl plane of the movie. Like Ashanti from the last film, she is a new 'Friend' of his. I put it like that because she is actually a very creepy stalker. I felt uncomfortable around her because I was worried this relationship might lead to something creepier. Also, Blade Ranger played by Ed Harris is memorable mainly because this lead firefighting plane was in a show called 'Chops' which is the Cars Universe equivalent of Cops and Magnum PI. <br><br>Animation wise, it got better. The animation is lively and thanks to the sound effects it makes the animation more convincing when Dusty and the gang are out battling fires. <br><br>The story I liked. Because it has some flare to it. It gets sad within minutes, it gets evener sadder without an hours running time and is more serious than the first. More maturity to it, more life to the world, more character development, it is bigger and better. Some of the stuff is funny too. In one scene, Dusty is shown a VHS tape with the Cover of Howard the Truck, then to see its not that, but 'Chops' as I said before. I was laughing so hard when they showed that.<br><br>Overall, Planes: Fire And Rescue proves that you can do more with a sequel than just cash in on it, you can tell a engaging story that will tell you about life. It really was a better sequel and should be shared with the whole family.<br><br>78/100 B<br><br>P.S: THE MUSIC STILL ROCKS! THANKS MARK MANCINA!","user":"michaelhirakida","rank":[14,17]},{"title":"Quite decent movie from Disney","rating":8,"date":"19 July 2014","review":"OK, maybe wasn't the year movie but it's quite decent, it's much, too much better than cars 2 and for one instant i thought that it was a Pixar movie, okay, okay, maybe doesn't reach the quality from Pixar but Disney is improving in the stories and it left a very good taste. The scenes and animations are excellent and the story isn't only for kids, on the contrary it's quite decent for the adults, the characters feel like a real persons and its much better than the first movie. The only bad thing that i see is that Disney could improve the background of the leader copter or even change it, because Disney follow the same way since the cars story, one ace that teaches or trains for a bad past happening, maybe this doesn't bad but could be better. In summary it's an excellent movie from Disney and without songs, yeah!","user":"poomann","rank":[11,15]}]