[{"title":"Much better than the standard gangster flick implied by the title","rating":24,"date":"24 January 2015","review":"I've been amazed at some of the slams this movie has taken. No story? Boring? Slow? You've got to be kidding. This was a fascinating character study of an \"honorable man\" trying to retain his honor in a corrupt business and political environment. From the title, I was expecting more of a traditional Martin Scorcese gangster flick, so I was surprised (pleasantly) that \"violence\" of the film was primarily about two codes of life clashing against one another. I can certainly understand a viewer attracted to the film because of the word \"violence\" ibeing disappointed at seeing so little on the screen. But I found the film riveting: excellent plotting, great writing and superb performances.","user":"nikatnyte","rank":[163,189]},{"title":"Supremely Interesting Story Highlights Sleeper Hit Of 2014","rating":9,"date":"21 August 2015","review":"J.C. Chandor's A Most Violent Year takes place in 1981 New York City – the year New York suffered more murders than in any other. Without knowing a thing about A Most Violent Year, I looked forward to a police procedural or a mafia thriller, dealing with the homicidal apex to the desperation of the recession of 1980. But I was wrong. Very wrong.<br><br>Oscar Isaac plays Abel Morales, owner of a New York fuel oil company, in the midst of purchasing property along the East River which would position his company as a major player in the regional fuel oil market. Simultaneously, a rival firm is attacking Morales' truck drivers and stealing their fuel. Morales' wife, Anna, is descended from a mafia family, and she offers their assistance. But Abel Morales is a good and decent businessman, and he resists. At first. As the driver attacks amplify, Morales' salesmen and even his family are soon targeted by the rival businessmen. Meanwhile, an assistant district attorney, played by David Oyelowo of \"Selma,\" is investigating corruption in the local fuel oil industry, including Morales' firm. And the deal to purchase the East River property becomes dubious when his bank backs out of financing it. All this is set against the backdrop of the 1981 New York murders. The murders themselves are not the story, but we hear about them anytime one of the characters turns on a radio.<br><br>Now this set-up may sound like a glorified TV movie, but A Most Violent Year is so much more. As the tension in Morales' life builds, director Chandor draws us into the story the way Martin Scorsese does. We find ourselves pulling for an honest businessman in an increasingly dishonest world. We wonder how long it will take until he involves his wife's mafia family – or worse, takes matters into his own hands. This could be a story about one man's downward spiral, but with a resolution that will surprise and delight you. And you'll love the thrill ride along the way – culminating in a chase scene through the bowels of New York's subway and rail systems. It's as riveting as Gene Hackman's chase scene in The French Connection.<br><br>The performances are top-notch, beginning with relative newcomer Oscar Isaac in the lead role. A year ago, he played a folk singer in the Coen Brothers' Inside Llewyn Davis, a small, above-average picture which got buried in the onslaught of excellent films released at the end of 2013. Isaac really shines here. He should have received a Best Actor nod, but I'm sure his day is coming. Coincidentally, Isaac is slated to appear in the new Star Wars picture, which hits theatres next fall.<br><br>Jessica Chastain is also excellent as Morales' wife – a decent-hearted lady who wishes her husband were a little more daring in his business dealings. Her character is more than the standard \"wife\" character we've seen many times before. She's intimately involved in the business, and she's not afraid to stand up to adversaries. An almost unidentifiable Albert Brooks plays Morales' lawyer Andrew, again intimately involved in the business, but more than just the \"straight man\" character we've seen before. And I love how Chandor's script allows us to become acquainted with various characters in Morales' life and in his business – a truck driver and his wife, a salesman, the teamster boss who pushes for Morales to arm his drivers, a couple of Morales' business competitors, and so forth. Each character is well-drawn, and serves an important role in this supremely interesting story.<br><br>I also like the look of this picture. It's a bit of a modern-day film noir, cast in dimly-lit interiors, with characters who speak in hushed tones about important matters, occasionally bursting into the sunny yet unpredictable and unnerving outside world.<br><br>The only thing I didn't like about A Most Violent Year is its title. Much as the 1987 film Dirty Dancing had nothing to do with pole dancers at strip clubs, A Most Violent Year has nothing to do with violence, per se. In fact, I don't really understand what necessitated placing the story in 1981. The fact that New York's murder rate peaked that year is immaterial to the story.<br><br>A Most Violent Year is going to be a sleeper amongst Oscar contenders like Birdman, Selma, The Theory Of Everything, and others. But it's well worth a look. They don't make movies like this much anymore, and I'm glad J.C. Chandor has. It's one of this year's best films.","user":"andy-66447","rank":[36,39]},{"title":"Slow Burn","rating":8,"date":"21 November 2015","review":"This is a movie I often don't recommend to any of my friends because I truly feel it takes someone with a certain level of appreciation for film and the patience to watch this plot unfold. Now I don't mean for that to come off as snobbish, but this is a movie that could easily be cast off as boring by people who are just looking for an entertaining film. However, if you are a person who possess some level of appreciation for film and would like to see a good, albeit slow tale, I would highly recommend this movie.<br><br>The first thing of note in this movie is Oscar Issac's performance. He plays Abel Morales, an entrepreneur who runs a fuel company. He is one of Hollywood's best rising stars, and he shows what he's got in this film. He gives a very subtle, even performance that is reflective of his character, and it works very well. Jessica Chastain is also very good as his wife, and her character's primary motivation is her children and their safety. I felt that she really cared about her kids.<br><br>I don'y want to go too much into the story because it is a good one. But the fine details of the story is not what matters. It is the intricacy of the characters that is the important aspect of this film. To see how hard Abel will work for his family and his legacy shows the drive of man, and a sort of twisted sense of the American dream.","user":"lpquig","rank":[18,19]}]