[{"title":"Inside look of Dean's short lived fame / anti-fame.","rating":7,"date":"8 February 2015","review":"James Dean, although the lead-star of only three films, concreted himself as one of the cinema's golden age legends quite quickly in the 1950's - mainly through his unconventional approach to Hollywood's rules - this is, all before his premature death quite soon later.<br><br>Portrayed by Dane Dehaan, LIFE is a satirical chronicle of Dean's rise of an unknown to his Hollywood acting debut of success and fame. Yet, the film is not directly told as a documentary of his life - but via the lens of Robert Pattinson's character, Dennis Stock, a rookie photographer for a photo-agency with aspirations of becoming known.<br><br>Set in the 1950's, director Anton Corbijn's take on Dean's life is admirably applaudable as it takes us on an inside look of Dean's short lived fame and anti-fame. The sets, the cinematography, the music and the atmosphere all cipher the 50's pose, as smoking and larger-than-life LA are the standard.<br><br>First meeting at a party in 1955, Dennis (the photographer) approaches Dean; a young, sophisticated individual wearing a melo- polo, slicked hair with thick framed glasses and asks who he is. For Dehaan, the performance, both visually and in terms of acting is undeniably suited as he resonates Dean's moody and unique approach, showing him as a person, not merely an icon.<br><br>Forming sturdy relationships with Jack Warner (Ben Kingsley), of Warner Brothers Pictures, Dean's talent is soon spotted, and through several frustrations of the individual's motives, he told to 'play the part, follow the rules' and he would be made a star.<br><br>For Robert Pattinson, his take on iconic photographer Dennis Stock is equally as impressive as he enters the world of Hollywood from the other side of the carpet (and at bottom). Spotting Dean's talent early, Stock, in the two-hour running time attempts to get photographs of Dean before fame kicks in. Deadlines, pressure and awkwardness soon mount-up, and Pattinson expertly presents it onto screen.<br><br>Shot-by-shot, we capture each of Stock's photos of James Dean - but, rather than just a photo and what point it was taken - we are inclusively taken into a perspective of why it was taken, the setting and how they were so important - and now, in retrospective of our present - why so iconic.<br><br>http://gonewiththemovies.com/reviews/life-review.php","user":"CharlieGreenCG","rank":[39,46]},{"title":"Deconstruction","rating":5,"date":"17 February 2015","review":"Potentially this could have been the most interesting work from Anton Corbijn, as he is himself a well-known portrait photographer. The story is about Magnum photographer Dennis Stock (Pattison) convincing a reluctant upcoming James Dean (DeHaan) to follow him to make a series of portraits. As you might know, Magnum set new standards in photography and Stock in his famous series contributed to a completely different view on portrait photography of stars: natural setting, confrontational, honest and direct.<br><br>During the movie, a bond grows between the two, as Dean turns out to be an atypical Hollywood star ignoring the rules set out by his superiors resulting in several confrontations. Stock largely ignores his duties to his former wife and their child and becomes obsessed by Dean's idiosyncrasy. The second part is the most interesting as it almost deconstructs Dean's life and character: Dean comes from a farmland family of Quakers, likes local poets and is fond of his background and actually despises stardom. Stock is first able to shoot pictures in New York (you probably know the famous photograph) and in Indiana.<br><br>So what are the downsides: the pacing is too slow, the editing certainly not perfect and the most important trap: Corbijn as photographer is too much in love with the story, finding details relevant that are actually not that relevant. The question keeps popping up: Why does this matter? Life fails in a way as a mood piece, but is still a relatively good and stable character drama as the deconstruction works well.<br><br>Maybe both Pattison and DeHaan are too light to pull this off more convincing, but one role is certainly amazing: Ben Kingsley as Jack Warner is so spot-on you will be remembering the character despite the limited screen time.","user":"diand_","rank":[43,53]},{"title":"Its an OK drama.","rating":4,"date":"16 April 2016","review":"A movie about James Dean stands or falls by the portrayal of the man. Everything else is secondary to capturing that unique mesmerizing person.<br><br>I am a straight male, yet I remember the first time I googled that name and started browsing his photos. There was something there completely out of the ordinary. Strength with fragility, sadness with mischievousness, rebellion resting in the moment. Its like watching young Marlon Brando or Ryan Gosling in a movie like Drive, there is something extraordinary there your brain cant define but can understand.<br><br>Dane DeHaan, who I don't know outside of this movie, could probably portray Justin Bieber just fine, but playing James Dean requires a different beast of an actor all together.","user":"nikolobg","rank":[23,28]}]