[{"title":"A slow burner that never ignites.","rating":5,"date":"14 October 2015","review":"Miranda Wells, a beautiful young Nurse from a small town is invited on a blind date with a tall, dark and handsome chap 'Kevin.' Miranda has definite issues with pens and a few other quirks. When a guy turns up to meet her, she assumes he's Kevin, but events go tragically wrong, later the real Kevin turns up.<br><br>There are some definite pacing issues, it is so slow in parts, dare I say it becomes a little boring. Some scenes are so slow and overdone this movie could be edited and shown in less then an hour. The movie itself is quite hard to follow, there are times when I didn't know what was going on. It's a little telegraphed at times, you kinda know what she's all about.<br><br>Definitely issues with her dad's dog, but why did she do what she did, I appreciate it was a pretty dress, she never forgave it for that. I think that showed us her capacity for slow and definite revenge.<br><br>I love Rosamund Pike, she showed in Gone Girl just how good she is, but here she's just a bit flat and makes Miranda uninteresting, thank goodness for Nick Nolte, he added a bit of spirit and warmth to the film that was otherwise lacking.<br><br>When she performs a tracheotomy in the restaurant she got a round of applause? Would that truly happen?<br><br>I can't make out if I thought the ending was good or terrible, it was certainly a switch in tempo.<br><br>How many hairstyles did she have in this film? Every scene she looked like she'd been re-styled.<br><br>Considering the matter this film deals with I would have thought it would have left me sad or angry, but it left me a bit cold.<br><br>Some good elements, just a bit of a let down. 5/10","user":"Sleepin_Dragon","rank":[29,35]},{"title":"A strange experience","rating":7,"date":"10 August 2016","review":"I'm sitting here having watched 'Return to Sender' and I genuinely don't know what to think. I'm not even sure whether I enjoyed it or not. I could justify giving it a '3' and I could equally justify giving it a '9'. It's my kind of movie first of all. I love the 'revenge' genre. This is an odd case of that genre though. In fact I wasn't even sure it was that type of movie until 4/5 of the way through, despite the movie poster heavily implying it. <br><br>It's not a particularly well made movie, at least technically. The sound engineering is poorly done in certain scenes. Every scene involving the prison phones is incredibly hard to hear the dialogue in. It chops in and out and is often inaudible. The story is choppy and alienates the audience at times by leaving them clueless as to what the point of this all is. And yet through all this, I was having a pretty good time watching it (I think).<br><br>Rosamund Pike is a very fine actress and has the chops to carry a movie (as she proved in 'Gone Girl'). She's again pretty good here, and with a stronger script could have accomplished a performance on par with her one in 'Gone Girl' (the two roles are actually strikingly similar). It's hard to explain exactly what an odd experience 'Return to Sender' is to someone who hasn't seen it. Would I recommend this film for someone to watch? I'm still not entirely sure. The only thing I can say is watch it to see what I mean.","user":"jtindahouse","rank":[16,19]},{"title":"Return to Writer and Director","rating":2,"date":"9 November 2015","review":"How they managed to get well known actors in this ill-fated plot of a movie is beyond me. Maybe they pulled a classic bait and switch and presented one script to get people on board and then filmed an alternate script during production, either way this is what you would call a disappointment to be polite. <br><br>Now let's start with the PLOT, the whole premise for the movie was a great idea, loved it from the synopsis, the execution of the plot was discerning. After the inciting incident the whole plot takes a disastrous tumble. You will fail to realize the objective of the film by the end. Not only that the credits couldn't roll fast enough for me and I was so happy that I didn't pay $14 to see this in the cinema. <br><br>CHARACTERS: Funny enough, you may just end up rooting for the villain, that's how recklessly this film's plot us put together. I found myself with no compassion for our main character. I did however, feel bad for Nick Nolte, because I couldn't for the life of me figure out how his agent tricked him into this. <br><br>I gave this two stars. One for putting a budget together to get the film done and the other for getting decent stars to somehow film this.","user":"MilkWithHoney","rank":[15,18]}]