[{"title":"There are jump scares and shaky cams","rating":7,"date":"12 March 2015","review":"This was the very last movie at Glasgow Frightfest 2015. And quite a good one to end it all.<br><br>The bad: This is, I assume for budgetary reasons, a found footage flick. Unfortunately this means quite a lot of shaky cam. Really, really shaky. Way too zoomed in, and shaky. Like, Blair Witch with Parkinson's. I was literally squirming in my seat hoping whoever was filming would just. zoom. out. And ever so often the movie cuts to these just wild zoomed in shaky parts, where you see absolutely nothing but blur. OK, got the bad out of the way!<br><br>The Good: The good thing is that not all the filming is shaky, and pretty much all the actors did a good job. The movie was well paced and not boring (even after watching 5 movies before it, as this one was last). The characters are likable, and seem to have pretty good chemistry. There are some laughs to be had, too.<br><br>The Scary: This movie actually gave me chills a couple of times! Kudos. Some of the sound effects, and visual effects, are pretty darn creepy. And a couple of the jump scares are very effective. Pretty cool. I especially liked how some of the creepy parts gets you thinking: was that actually a creepy effect, or was it my mind playing tricks on me? <br><br>All in all it was pretty entertaining, and very good for a found footage movie. Good movie to see with a couple of friends, if you have those.","user":"Finfrosk86","rank":[13,16]},{"title":"Good Movie, Could have been great","rating":5,"date":"18 February 2018","review":"Really enjoyed the storyline, shame none of the potential movie makers in the film could actually focus on anything. Felt quite seasick at times and got bored watching a black screen. I get that they were trying to be realistic but I can film from a car window and still focus.\nHaving said that, I did enjoy it","user":"ellen-30048","rank":[7,8]},{"title":"Good acting, okay story line, but the camera work? I can't even.","rating":3,"date":"2 February 2020","review":"The plot and the acting were both adequate, and even very good in places. It had intermittent \"Us\" vibes here and there which were creepy enough. But what really drags my rating for this down is the camerawork.<br><br>\"There Are Monsters\" is what I call \"quasi-found footage\" - some scenes are supposed to be seen as if through the lens of one of the characters' camera, and for some scenes, it's obvious that no characters are recording it. If it were intended to be a bunch of amateurs, or kids, or anyone else who didn't know what they were doing, the camerawork might be somewhat excusable. But even in the \"found\" footage, the characters operating the cameras were supposed to be professional cameramen.<br><br>My ass they were. The movie was so shaky and blurry in so many places, it really took away from the decent work of the actors. No professional cameraman would produce work like that, even on a job they weren't taking all that seriously. As if that weren't bad enough, they continued the horrible camerawork even in scenes that weren't intended to be \"found footage\". For instance, the main female protagonist entered a bathroom stall at one point. She was completely alone, no other characters were in the booth to film her. It was a steady picture at some points, but a jumbled, chaotic slurry of motion and digital myopia for the most part. There was no excuse for that.<br><br>The only other thing I didn't like about it was the jump scares, but they didn't have more than maybe 5 of those. I just hate jump scares in their entirety, so that might be more of a \"me\" thing.<br><br>Over all, if extremely shaky camerawork doesn't bother you, then I would definitely recommend this for you. Otherwise, I'd give it a pass.","user":"shroyerw-1","rank":[3,5]}]