[{"title":"Do not believe the negative reviews! This is a Gem!","rating":9,"date":"11 January 2016","review":"Practical first For Parents: I watched it with my kid, and I enjoyed it as much as him. Might be a bit dark for young impressionable kids, but there isn't much gore per se, no blood, but lots of battle violence. <br><br>Dragon Nest: Warriors Dawn, was overall, a wonderful production. I am your average person who really enjoys movies, animation, gaming, and mythology. I am a fan of D&amp;D type games and story and this movie feels exactly like this! I had to write this because so many reviews were very unfair. There is no way in the world this movie deserves anything under 6, if you are being overly critical. The Movie \"The Apocalypse 2007\" deserves a 1/10 or 2/10 if you're being generous... just saying. Please be fair in your ratings. <br><br>This title has good sound effect, Great animation, Good voice acting, very cool, familiar Character types: ( light and dark elves, sorcerers, barbarians, rogues, etc), humour, drama, everything that makes a story interesting and engaging. GREAT MUSIC, by that I mean: subtle, timeless, classical instrument based that sets the tone for every scene and emotion, it's always there but it never interferes with the story, very little pop, in other words... well done!<br><br>Also, Can I just say that if you are a fan of any fantasy lore, D&amp;D base games, anime or video games, you will LOVE this. Yes this is inspired from various fantasy lore, games and/or actual folklore, but people should realize that Tolkien did not invent fairy/ Elven/ Fantasy lore... Come on. Neither does Final Fantasy games own all rights to fantasy/ Magic animations. It's not a rip off of Wow (if anything, WOW is a ripoff of so many things of pop culture) <br><br>Too many over critical people not appreciating it for what it is. Honestly, there are not enough animations like this! So much fun to watch. It is not completely original in it's genre but this does not make the beautiful animation, fun action combat scenes, silliness, drama, adorable characters any less good.<br><br>Looking forward to the sequel in the summer of 2016!","user":"magali-bassaler","rank":[14,17]},{"title":"Charming story, great animation.","rating":10,"date":"29 April 2015","review":"(no specific spoilers mentioned but if you want to go in completely without any comments about the storytelling then don't read, though you should definitely watch the movie if you are unsure, you wont regret it unless you have no interest at all in magic and fantasy world sword fights, at the very least it is a decent story)<br><br>apparently inspired by a game called dragons nest that I know nothing about.<br><br>for someone that doesn't know the lore this movie was a great watch, though the ensemble of 'heroes' was a little off 'strictly story wise, though that is understandable by it being based on the lore of a game, essentially character classes that are different from one another having prejudices about each other yet work together to achieve a common goal for the greater good.<br><br>while the story might not be the most original, if you have any interest in sword fights and combat magic, great animation and a movie with possibly perfect pacing/highs and lows this is certainly worth a watch.<br><br>compelling story telling for someone that is unfamiliar with the lore, only thing it suffers from is the introduction of too many (main?) characters right away, that might be because there is already an established lore for them I don't know but thankfully the narrative doesn't focus to much on previous events just that \"they know of each other\".<br><br>as mentioned a lot of talent went into the animation, they really deserve praise for it.","user":"J-Leidungr","rank":[31,42]},{"title":"Awesome","rating":8,"date":"25 March 2016","review":"Great movie real great direction. Its really difficult to make a movie out of an anime and even more difficult to make a movie out of an anime game why the lore of-course. We all know movies like dragon ball evolution and Last Airbender. But this movie is superb its trimed neither to fast nor to slow. neither mushy or hard on eyes. It has emotion a bit of laughter and definitely no fan service unlike game.Every character is unique and you can watch it with your kid. You will love liya and lambart and their love story better than twilight. its not very famous because its an Asian movie not backed by any big media houses like pixar or Disney. but its on par even better than some .<br><br>MUST WATCH!","user":"benigasb","rank":[8,9]}]