[{"title":"I wanted to eat on both sides of the street","rating":9,"date":"8 August 2014","review":"The only thing which bothered me a little bit about this movie was that the restaurant owner of a French restaurant somewhere in the countryside is played by an English actress. And I love Helen Mirren. There are some weird language situations which do not make sense. Otherwise I thoroughly enjoyed this little comedy about two of my favorite foods. I could not decide on which side of the street I wanted to eat.<br><br>As a senior citizen myself I am always happy when a movie is carried by people my age. And boy do Helen Mirren and Om Puri carry this movie. If you want to spend pleasant two hours in the company of entertaining people and pictures of delicious food, you will have a good time seeing this movie.","user":"pefrss","rank":[162,187]},{"title":"A thoroughly enjoyable movie","rating":9,"date":"8 August 2014","review":"I can't believe no has has reviewed this already. I just saw it, and had a great time.<br><br>There's really nothing not to like. It's a standard story of a clash between two cultures, French and Indian cooking in this case, but rather than just playing it out as that, we see the young Indian chef take an interest in French haute cuisine and experiment with how he can mix one with the other. The head of the haute gamme traditional French restaurant located in the same small French town, played by Helen Mirren, doesn't just fall in love with Indian cooking, as you would expect to happen on a made-for-TV movie about this topic. She grows to appreciate what Indian cuisine can add to classical French cuisine.<br><br>She also has certain important French Republican values that make her a more interesting character. She does not hesitate to try to ruin the opening of the rival, Indian restaurant. But when that restaurant is attacked by racists with cries of \"France for the French,\" part of the current Nationalist discourse, she fires the person she believes to have been involved in it and publicly washes away the Nationalist graffiti sprayed at the entrance to the Indian restaurant. (This is one of the many important scenes that are new with the movie and have no equivalent of the novel.) The characters are not caricatures, in other words.<br><br>There are times when the movie reminded me of Ratatouille - the in-kitchen rivalry between sous-chefs, for example. (Almost the entire subplot dealing with Hassan and Marguerite is also new with the movie and not in the novel. The novel does mention, largely in passing, that Hassan becomes romantically involved with the sous-chef, Marguerite. But she is never developed as a character in the novel, does not play any significant role in Hassan's development as a chef - it is Mme. Mallory who gives Hassan the cook book, not Marguerite - etc.)<br><br>There were times when you could see the next step too far in advance. It's not a perfect movie.<br><br>There were also things implied in the movie that never got developed. Mirren's upscale French restaurant is in a typical 19th-century bourgeois villa. The Indians establish their restaurant in what is as clearly a southern French farm building, yet nothing is done with the contrast between bourgeois cooking that has become detached from the basic country cooking that would have taken place in that farmhouse and that has always been at the basis of the greatest French haute cuisine. (That's a theme developed nicely in Ratatouille, with the explanation of the title dish.) The novel touches on that theme from time to time, but never does anything with it either, and in fact seems to forget about it for long stretches. It's not a well-constructed novel. The movie script is much better, frankly.<br><br>That the movie does not develop this theme is particularly surprising because the very clear architectural contrast between the two restaurants is also new with the movie. In the novel, the Indian family opens their restaurant in another 19th century bourgeois house, described repeatedly as a \"mansion,\" very similar to the one occupied by the two-Michelin-star traditional French restaurant. They are located across from each other, as in the movie, but in the middle of town, not out in the country. If the director - or whoever - of the movie decided to shift the locale so that he could put the Indians and their restaurant in what is very clearly an old farm house, why was this symbolism not developed?<br><br>There are, in fact, many very significant changes from the novel, interesting ones. Among other Academy Awards for which this movie should at least be nominated is Best Adaptation of Previously-existing material, or whatever that award is called. The script of this movie is very intelligent, but also very different from the section of the novel from which it was derived.<br><br>All the acting is good to first class.<br><br>It's a feel-good movie, yes, but a well-made one. Better, for example, than \"Chef\", which deals with some of the same issues, but not as well.<br><br>Go see it. But be prepared to leave hungry ;)","user":"richard-1787","rank":[109,128]},{"title":"A Hundred Percent Success","rating":8,"date":"9 August 2014","review":"This movie is filled with the joys and sorrows that accompany a full life. The acting is excellent. I could not fault a single actor. Even those delivering one liners seemed divested in the story. The photography and music are spectacular. A. R. Rahman showed even more depth and diversity than usual in his deep and varied score, and I kept wishing that I could freeze frame some of the amazing shots from the film so that I could take them home to use as inspiration for a painting. Plus, food has never looked more yummy! The story is touching and kept my interest from beginning to end. The messages contained within are subtle but definitely there, and they are positive and uplifting, which is a welcome change in today's challenging world. I fell in love with it all! Kudos! Kudos! Kudos to all!","user":"glynne41","rank":[104,129]}]