[{"title":"I for one, quite enjoyed it.","rating":5,"date":"25 June 2014","review":"OK, I see only negative reviews here, won't go bashing them, everyone is entitled to his own opinion, therefore I am going to present you mine. So let's see why I enjoyed \"Deep in the darkness\".<br><br>Well for starters, it's a horror where bad decisions aren't taken at every step and boy did that feel good. Quite refreshing seeing people using their brain, trying to survive and not fell for the dumbest traps possible. Afterwards, the acting was good, believable. The creature concept I see is a hard pill to swallow for most, I for one think it is simple and easy to go with. I approve to it! You get to see a few deaths, a few fight scenes, some interesting facts about those creatures, and other variables making their way throughout the movie, making it more complex than your usual B horror. So all in all, in my books, this is a winner, as I enjoyed it, and stayed for the entire ride.<br><br>Now, as I am putting down this comment, the score is 3:1 for the negative reviews, therefore it will seem hard to take my word for it. But, if you are a horror junkie, if you approve to more underground productions, this one is smarter than most. It has more to offer, providing a good plot, execution and minutes well spent. Therefore, I recommend \"Deep in the darkness\" as I missed a woods/creature horror, done right.<br><br>Cheers!","user":"gothic-fiction","rank":[59,75]},{"title":"Ignore the detractors","rating":7,"date":"27 April 2015","review":"I have seen a lot of negative comments about this film. My advice, ignore them. <br><br>Deep in the Darkness takes a now familiar horror premise and reinvents it, more than competently, in my opinion. Its not a terrifying film but it has enough menace, to infuse the story with a sense of unease and edginess it definitely benefits from. Nowhere is safe in this film, including the family home, which is anything but the idyllic country haven it first appears to be. <br><br>The acting is solid and includes a few old favorites from television such as Dean Stockwell, who is probably best remembered for TV series Quantum Leap. Given there are no big names in this film, some might be tempted to label it a \"B\" movie. In my view this is an unfair assessment. There is a heck of a lot to like here. So much so Id go so far as to say this title does a good job of putting a lot of so called \"A\" grade horror flicks to shame. <br><br>My advice give this film a go. Its not superb but its by no stretch of the imagination rubbish either. Seven out of ten from me.","user":"s3276169","rank":[29,36]},{"title":"idk why all the bad reviews, i loved it!!","rating":7,"date":"1 May 2015","review":"Some people gave this movie bad reviews but i don't understand why. This movie is one for horror lovers. To me it didn't seem like a TV movie and I am the queen of B-movies to the folks around me. The sets are well done, the makeup excellent, the monster makeup well done and the blood and gore pretty decent. Nothing was obviously, ridiculously fake like most TV movies. This movie is creepy as heck. It starts out creepy from the first two minutes and the hits just keep coming. Some people said the monsters have too much exposure but the monsters are an integral part of everything that happens in the movie. There is plenty of mystery left to the monsters, including their origin and other things I can't say because, spoilers! The acting is great. I felt for the characters because they really seemed to be in distress, anger, pain, etc. There were some nice twists and, overall, the movie was fun to watch! It was nice and dark, creepy and scary. I'm from a small town in the woods, so I really enjoy creepy small town movies. You'd like this movie if you enjoy movies with dark atmosphere, creepy small towns, creepy neighbors, creepy people in general, monsters, or if you have a fear of the dark or the woods. I recommend you try it with an open mind. Don't let the bad reviews make you miss this one.","user":"sabrina_makela","rank":[18,22]}]