[{"title":"The father-daughter drama might just save \"Term Life\" when the action falters","rating":5,"date":"9 May 2016","review":"At some point of action stars' life, they are bound to have adventure with their estranged daughters, just like Liam Neeson or Kevin Costner did. Those expecting a level of action production for action blockbuster might be disappointed, but the saving grace comes in unexpected engaging drama and an adequate crime thriller.<br><br>Nick (Vince Vaughn) is a planner for heist, he scouts the place, sets up escape routes, then sells the whole gig to another party. His recent buyer is caught up dead and now mobster and police are chasing Nick, who immediately grabs his daughter before making a run for it. This may seem like ordinary scheme, however it creates several chances, which unfortunately only a handful of them bear fruit.<br><br>The action is not great, one can see from the first brawl that the choreography is tedious. It's definitely not the caliber of high pace fisticuffs or intense shootout. In fact, any fighting seems a bit underwhelming and might even be detrimental to thriller aspect the movie is setting up for.<br><br>Surprisingly, the drama holds up nicely, especially the father-daughter bond between Vince Vaughn and Hailee Steinfeld. They have good chemistry and it shows a progression of their characters. Its mystery thriller works as well, while it's not complicated it is a decent crime story. Furthermore, there are some veteran actors here like Bill Paxton and Terrence Howard to name a few.<br><br>This star-studded movie is sadly lacking in action, although drama and cast do admirable job on giving it a lifeline.","user":"quincytheodore","rank":[24,28]},{"title":"Nothing New Here","rating":3,"date":"9 July 2016","review":"I just found this movie to be filled with hackneyed dialogue and shop worn and often ridiculous plot elements. There's nothing here that we haven't seen so many times before in other films.<br><br>Vince Vaughn, who often delivers his lines here like an automaton, stars as Nick Barrow, who's a professional heist planner. However, his latest caper, that he planned and sold to the son of a Mexican cartel boss, has gone terribly wrong and he finds himself on the run from not only the cartel boss but a group of crooked Atlanta detectives.<br><br>Hailee Steinfeld co-stars as Nick's 16-year-old estranged daughter Cate, who, due to certain circumstances finds herself caught up in it all, and will have to go on the lam with her father. The remainder of the movie will have them either running from or confronting all those after them, while they, of course, do a little father-daughter bonding.<br><br>Overall, the film for me was just a rehash of tired plot elements, and the whole thing was an uninspiring watch.","user":"larrys3","rank":[14,17]},{"title":"Term Life","rating":8,"date":"8 January 2017","review":"Due to the huge success obtained by super-heroes in the big screen, we hadn't seen a film based on a \"mature\" comic (ie, not including cloaks, super-powers or cosmic battles) in various years. Term Life is based on an \"adult\" graphic novel (from Image Comics) written by Andy Lieberman and illustrated by Nick Thornborrow. Lieberman himself adapted the screenplay, and along with director Peter Billingsley, they were able to create a very entertaining movie which makes the comic justice despite altering many of its elements. Some changes are small details, while other ones substantially change the premise (the affairs of the life insurance and the 21 days are barely mentioned in the film). However, the differences ended up being irrelevant, because Term Life made me have quite a good time and left me satisfied. I had found Vince Vaughn unable to play serious roles until I saw him in the second season of True Detective, and I changed my mind. His performance in Term Life displays once more his capacity to handle the drama and the action with equal credibility. Hailee Steinfeld also makes a competent work as his daughter, and she has a good chemistry with Vaughn. The interaction between father and daughter is the dramatic axis of Term Life, and it makes it more interesting than a simple tale about betrayal and criminal revenge. But that doesn't mean that the criminal aspect is neglected either; on the opposite, the initial robbery planned by the main character is well planned, and its consequences are ingenious and unexpected. In the supporting cast, we find many solid character actors (Jonathan Banks, Jon Favreau, Bill Paxton, Terrence Howard, Mike Epps, Taraji P. Henson and Jordi Mollà) who enrich the experience with their mere presence. Comparing it to other films based on thriller or action comics (without super- heroes), I would place Term Life above The Losers, but below A History of Violence or Road to Perdition. However, as I said on the beginning of this review, the comic origin is just a cultural curiosity; despite not being a great movie, Term Life works pretty well as an interesting thriller with good performances, dynamic direction and a well written screenplay, so I recommend it with confidence.","user":"Argemaluco","rank":[11,14]}]