[{"title":"Indie Just Doesn't Ring True","rating":4,"date":"16 July 2015","review":"I would have to say I was quite disappointed in this indie, as I'm a big Mary Elizabeth Winstead fan, and feel she's a most talented actress and always seems to bring an appealing quality to her roles. She stars here as Alex, a driven environmental attorney for Earth Now, and who's currently in litigation to stop the construction of a spa which may be damaging the surrounding habitat.<br><br>There's just so must Winstead can do here with a script that came across to me as being way too incredulous and nonsensical. For example, Alex winds up sleeping with the builder (Derek Luke) of the aforementioned spa, whom she meets by chance at a local bar. She, nor anyone else, gives a second thought to a conflict of interest with someone she's currently fighting in court with. Huh?<br><br>Also, when her husband George, played by Chris Messina who also makes his directorial debut here, decides to leave her and their 10-year-old son Dakota (Skylar Gaertner), because he's unhappy being a stay-at-home dad, Alex's father calls his other daughter Lily (Katie Nehra) to come help out with Dakota. No one seems to notice, till much later, that the free-spirit Lily, who \"curses like a sailor\", may not be the best influence on Dakota.<br><br>Then there's the father Roger (Don Johnson) who takes a part in a Chekhov play despite the fact his memory is failing and it looks like he will be diagnosed with early onset Alzheimer's (for which no one in the home seems too concerned about). To top it all off, there's the anti-male stereotypes that all men are \"fill in the blank\", a theme interwoven throughout the movie.<br><br>All in all, although this film has some charm, at times, and the atmospherics of Venice, California are pleasing to the eye, I just couldn't buy into the storyline which, more often than not, came across to me as phony as a 3 dollar bill.","user":"larrys3","rank":[11,14]},{"title":"An interesting yet unconvincing debut","rating":6,"date":"21 April 2015","review":"Alex (Mary Elizabeth Winstead) is an environmental attorney, currently absorbed in what is possibly one of the most important cases in her career. When her stay at home husband (Messina) surprises her with the news that he needs some time for himself, she is left alone to deal with their son Dakota, her father (Don Johnson), the arrival of her free spirited sister and above all herself. <br><br>Alex Of Venice is Chris Messina's directorial debut. It was a pleasure to discover that someone who has been on the independent film making scene for some time had decided to step behind the camera. It is probably safe to view Alex of Venice as a starting point for Messina, who shows an unwavering dedication to the titular character as well as a strong focus, which allows him to maintain a consistent tone throughout the feature. There is a potentially powerful theme at the core of Alex of Venice. Dealing with the instability and vulnerability brought along by loss is where the director's attention lies. Yet, while Alex's struggle of having to juggle with much more than work related issues is immediately apparent, there appears to be little space for growth or introspection, making her overall journey unremarkable. Nothing seems to suggest that the 20 something year old protagonist might actually find a way to \"reinvent\" herself and be able to rise up to the challenge of being on her own for the first time. Alex's relationships feel for the most part underdeveloped to the point where it becomes difficult to view her being a mother, a daughter and a sister as significant elements in her identity. Mary Elizabeth Winstead does the best with what she is given, portraying a young woman who is destabilized in more ways than one by her partner's sudden absence. There might be an idea of a missed opportunity after viewing Alex Of Venice. As previously stated, it could be considered a not entirely convincing, yet hopeful starting point for Chris Messina's love affair with characters dealing with the hardships that result from changes that are as traumatic as they are unexpected.","user":"Xander1989","rank":[15,22]},{"title":"Alex of Venice","rating":7,"date":"2 December 2015","review":"For his debut as a director, actor Chris Messina made Alex of Venice, an interesting but not totally satisfactory drama which takes advantage of its main actress' big talent, even though she might have deserved more substantial material to work with. Don't misunderstand me... Alex of Venice is a competent drama with excellent performances and a realistic story which deals with difficult and emotive topics without employing Hollywood's false sentimentality. Messina's direction is fluid and efficient, lacking of any affectations and with a good eye to create an urban/bohemian atmosphere reflecting the contrasts of the Venice neighborhood in Los Ángeles. The problem/pro of the film is letting the story be developed through the main character's silences, as well as her subtle changes of expression. Needless to say, Alex of Venice counts with a tremendously expressive actress who fully dominates her craft in that role; but I think co-screenwriters Jessica Goldberg, Katie Nehra and Justin Shelton relied too much on Mary Elizabeth Winstead's talent, and they omitted important pieces of the narrative puzzle, making the movie feel... I don't know... incomplete and premature. The main thing which makes Alex of Venice worthy of a moderate recommendation is the perfect performances, not only Winstead's, but also the ones from Don Johnson, Skylar Gaertner and Julianna Guill. In conclusion, I think Alex of Venice represents a decent debut from Messina as a director which counts with a cast whose brilliant work is helpful to overcome the limitations of the screenplay to some point. I think Alex of Venice should have gone farther in the dramatic aspect, emphasizing the main character's evolution instead of getting distracted with peripheral events which obliquely contribute to the story, but without deepening enough on the main character's experiences.","user":"Argemaluco","rank":[10,14]}]