[{"title":"The saddest excuse for a film.","rating":1,"date":"22 January 2014","review":"There's some found footage films that are great...then there's a good seventy percent that are down right awful. The Bell Witch Haunting is not only a terrible film but it is quite possibly one of the worst films I've ever seen. The acting is awful, the story makes absolutely no sense and the scares come and go without ever really developing a sense of dread or suspense. There is also a ambient stock sound that portrays the \"demon\" that sounds so fake and superficial. It's one thing to use a specific sound to implore anticipation to the audience but its a totally different ball game when it sounds cheap and lazy. It makes us feel like we are cheated. The ending never really builds up to much except for a complete gore fest that feels more like something out of a Jason Vorhees film, not a supernatural thriller. Bottom line, this film is cheap, lazy, ludicrous, and so poorly made that it makes The Room look like a modern cinematic masterpiece. Do yourself a favor, do NOT watch this. It is by far one of the worst films I've ever seen.","user":"trublu215","rank":[16,16]},{"title":"Robertson County Res.","rating":1,"date":"27 January 2014","review":"Being a Robertson County resident, knowing the real stories of the Bell witch this movie SUCKED!! When you grow up right down the road from Adams TN you hear all the stories and it would be nice to actually see a movie about the Bell Witch that was actually about the Bell witch!! Plus how are you going to have a movie set in TN and have the date as Jan and have a pool party??? Did someone not do their research or was this just another screw up and they got the dates wrong like they got the mothers name wrong?? Also it isn't Adams County...it is Robertson County, Adams is a City....and the cops that would have responded would have been county but \"Robertson County\"...again do a little research 1st!!!! Plain and simple this movie was a waste of time!","user":"jc-heady","rank":[14,15]},{"title":"I am a fan of good found-footage films.","rating":2,"date":"9 December 2013","review":"This was not good. In fact, it's a good example to demonstrate that just throwing together all of the typical ingredients of a good one doesn't necessarily work. This movie veers wildly between not showing enough in some scenes (long shots of empty rooms with somebody screaming off-camera, for which we sometimes never get any hint of the reason.) It's inconsistent and pays no attention to continuity. The pacing is bad, with no escalation of tension. People start wandering around in dazes more often and crying more often, but it still manages to not build tension.<br><br>To any filmmakers who happen to read these comments on movies like this - it isn't always a bad thing to be derivative. Go ahead and make a knock-off of the Blair Witch or Paranormal Activity. There are others like me who don't care about originality. But please, make it good. It doesn't have to be novel, but it does have to work.","user":"dld2012","rank":[33,40]}]