[{"title":"'Who would have thought that the whole of my life's work would be worth less than the room it was painted in?'","rating":20,"date":"20 August 2015","review":"It is so refreshing to watch a film with a contemporary story that focuses on older people and their choices and strengths instead of seeing them act foolish or pathetic. Based on Jill Ciment's book as adapted for the screen by Charlie Peters and directed with straightforward good taste by Richard Loncraine, this quiet little film is a wonderful platform for tow of our most respected actors – 69 year old Diane Keaton and 78 year old Morgan Freeman – who create an irresistible chemistry.<br><br>Briefly, long-time happily married couple Ruth and artist Alex Carver (Keaton and Freeman) who've spent their lives together in the same New York apartment become overwhelmed by personal and real estate-related issues when they plan to move away, having decided to cash in on their sought-after Brooklyn apartment. The story opens with one of the reasons they feel the need to move after 40 years in the '5 flights up' apartment with no elevator: their little dog Dorothy is having difficulty maneuvering the stairs and ends up with a slipped vertebral disc that requires a Vet's expertise and surgery. They engage Ruth's niece, real estate agent Lily (Cynthia Nixon, who is wonderfully, gushingly obnoxious) and the visits to the apartment begin – all manner of rather despicable lookie-loos traipse through and a decision must be made. Ruth and Alex find an apartment in Manhattan that is one the 9th floor and has an elevator, but issues arise that make them alter their initial decision.<br><br>Beautifully understated is the fact that Ruth and Alex are childless, entered an interracial marriage when it was not fashionable to do so, and have grown old together making every day count. They are wonderful and the film does them justice. It is such a pleasure to see two seasoned and gifted actors make such an impressive statement.<br><br>Recommended for all those who think happiness is dependent on social media based.","user":"gradyharp","rank":[28,33]},{"title":"A feel-good film with some respectful insight into real complications","rating":8,"date":"24 August 2015","review":"If I were to say that 5 Flights Up was a loosely structured film involving an aging couple, the real estate market, hectic home bidding, terrorism, a dog with lethal problems, interracial marriage, and painting, you'd probably be endlessly confused. However, I wouldn't be misleading you nor would I be shortchanging the film's story. For a film with an A-list cast and from a fairly large studio, it's strange for something like this to be so largely plot less and breezy, yet so thematically impacting. If nothing else, the film furthers my belief that you ultimately don't need a concrete plot or \"point-A-to-point-B\" style events to make an impacting film; you need strong characters or strong dialog, but if you have two, you're golden.<br><br>The film focuses on Ruth and Alex Carver (Diane Keaton and Morgan Freeman), an older couple looking to sell their old-fashioned Brooklyn apartment through their real estate agent Lilly (Cynthia Nixon). Due to the apartment's location and one-of-a-kind structure, the spacious home could be worth as much as $1 million and, under current circumstances, both Ruth and Alex want to get as much money possible. Though it's evident that the couple have talked selling their apartment to death, one can tell that they're quietly heartbroken to be leaving it behind, especially Alex, who has made one of the rooms his workstation for his many paintings.<br><br>Both Ruth and Alex find themselves immersed in the world of real estate buying and selling upon holding an open house and exploring other apartments in the city. They find themselves bombarded with potential buyers they are either not personally fond of or questioning whether or not they will take care of the home and love it as much as they did. While this search goes on, Ruth and Alex's dog winds up falling prey to a ruptured disc in her back, requiring expensive surgery in addition to the repeated coverage of a potential terrorist attack perpetrated by an assumed Muslim extremist when a large oil tanker is left on the Williamsburg Bridge.<br><br>Just by this description, one gets a feel of the looseness in 5 Flights Up. It would appear that writer Charles Peters attempted to make a film that was invested in real-life situations, particularly the kind that come about when trying to sell a home or an apartment in the wake of the biggest housing crisis in American history. Few films I can recall have painted the constant struggle and fuss over selling and buying a home in such a powerfully telling way, right down to the incessant \"bidding wars\" between interested clients and the dictation of a real estate agent. Such an experience is an endless cycle of monotony, false leads, and confusion and director Richard Loncraine portrays it as if the characters are operating on a field of landmines.<br><br>There's also examination of the generation gap here in a boldly subtle way. Consider Freeman trying to prove himself and his abilities to much younger, disinterested art buyers, or even the multitude of spoiled and unruly young guests that come through his home. Ruth and Alex are on their way out in numerous respects in this film, but as the film gets going, we see that they're soon to be out of their home, their element, and most importantly, time to prove themselves in a world that's rapidly changing and quickly leaving people like them behind.<br><br>Much has been made about the terrorist subplot which, in many scenes, does come out of left field and provides for a jarring tonal shift. However, if one looks at it like in the same way an announcement of any kind by Federal Reserve Chairwoman Janet Yellin sends financial markets into a tizzy, one can see its relevance, even if it does add a touch of awkwardness to the film's story.<br><br>5 Flights Up may not have the narrative structure of its contemporaries, but it damn sure understands the current state of baby boomers and sentimentality better than a lot of them. It's a film of moments and strong lead performances, with Keaton and Freeman proving through each collective and low-key scene why their performances are always highly praised. While this is a film along the lines of the feel-good flick you're likely predicting, just know if you're going to have your emotions tickled by a movie, you might as well have it done by a film that's respectful of its characters and somewhat insightful.<br><br>Starring: Diane Keaton, Morgan Freeman, and Cynthia Nixon. Directed by: Richard Loncraine.","user":"StevePulaski","rank":[22,27]},{"title":"Wonderful, humorous drama about aging and change.","rating":10,"date":"30 April 2015","review":"From the story line, it may seem that this film will be boring to kids. But, when I started watching this film I fell in love with it. Morgan Freeman's perfect timing of jokes and Diane Keeton's wonderful and priceless emotions make this film entertaining and heartfelt from the very start to the last second.<br><br>It is a bit hard to say what the main genre is. Of course, there is a lot of romance between the two characters, Alex (Morgan Freeman) and Ruth (Diane Keeton), there is also that funny side that makes it all that more enjoyable. And, there is still a serious dramatic side which keeps you on the edge of your seat till the end.<br><br>The story starts when an elderly couple, Ruth and Alex, live in a high up, massive apartment in New York City, Brooklyn actually. However, the five flight of stairs they need to take is getting more and more challenging so they decide to move to a location with an elevator. To add to the challenges, their dog is in the hospital undergoing treatment for spinal injury.<br><br>The director, Richard Loncraine makes this movie feel authentic and rustic and also shows how current society stereotypes elderly people, how they truly feel about it and how wrong it is. The cast is wonderful and the acting is just superior with serious and comedy scenes mixed together and standing out all the time. I also like how they lightly touch upon problems of the past as well as problems of today. For example, Ruth and Alex got married in a time when bi- racial couples were not welcomed with open arms. Then it shows how today a gay couple is making an offer on a house. They submit it along with a note telling how they tried to adopt a child and finally were able to adopt one. It is something Ruth and Alex wanted to do when they were younger but were denied.<br><br>My favorite scene is when they have an open house to sell their apartment and a huge crowd of people comes through, looking at everything and touching everything. Alex doesn't like it but Ruth tries to see the positive side but fails. I like that scene because it shows how the couple's life isn't perfect and also makes the film feel very real. Not only this moment does that but many others as well.<br><br>This film has perhaps several moments of adult content but none that is too mature. I recommend it to kids ages 10 to18 and give it 5 out of 5 stars.<br><br>Reviewed by Gerry O., KIDS FIRST! Film Critic. For more reviews by youth, go to kidsfirst dot org.","user":"rannynm","rank":[42,71]}]