[{"title":"Stereotypes, Weirdness and Ed Gein - Oh My!","rating":3,"date":"11 August 2014","review":"Quick Summary: a literal bus-load of stereotypes get stranded in the desert just by a museum for serial killers, where a man with... some kind of accent has brought back a Justice League of Mass Murderers so he can...eat their brains and gain their knowledge? or power? or both?<br><br>Quick Review: OK so I really enjoy the film Waxwork (which has various monsters and killers brought to life via magic) so this seemed like it might be worth £8. No, no it wasn't and that's a shame because it's a really good concept, loads of real life serial killers (which I have an interest in) in a slasher film (which I have an interest in), great, it's just the execution (pun intended?). <br><br>What's wrong with the execution? Most glaringly the 'protagonists' (read: victims) are horrendous, most offensive are the 'Goth' twosome, as written and dressed by someone who has never even been on the same side of the street as someone in a counter-culture and 'slutty bimbo' character Candi who actually screams about breaking a nail, although the Goths die first, and once that bit of misrepresentation is out of the way it's a lot easier to sit through. We also have religious maniacs, a fitness fanatic (who reappears when you least expect it brandishing scenery, I liked that bit) and Auntie May who talk jus' like yowa white butt think she gonna talk, she's boarder-line racist and she's the best character in the film so that should tell you how bad they all are. It's odd because there really seems to have been some knowledge put into the casting and portrayal of the killers; I dunno, maybe the team spent all their time at home reading about old killers and don't know how real people work?<br><br>The editing is askew too, cutting at strange times, not discretion shots, those I can understand (even if they are disappointing, show me the gore dammit!) just cuts when cuts aren't necessary or when scenes are. I thought I'd fallen asleep and missed bits at least twice, both of which were in scenes involving Ed Gein - odd. And there's some very strange plot points...I've put the spoiler tag so to hell with it (pun intended) Jack the Ripper strips off to reveal a hot girl in naughty underwear. That's the weirdest plot 'twist'/'misstep'/'madness' but exemplary I think.<br><br>Is it worth watching? Of course it is, all of these cheap horror films are worth watching once and there's some entertainment to be had; is it a good film? No. Is it so bad it's good? No, it's just bad - as bad as the lightning effects it uses, but you should be able to get through it, I did and I'm impatient. Like a lot of these films they'd benefit from a bigger budget remake with a script writer who's at least been to a Metal concert if not talked to some of the others there, or better yet, an actual Alternative.","user":"allfleshisgrass","rank":[12,17]},{"title":"My Review Of \"The Butchers\"","rating":5,"date":"1 November 2014","review":"Stephen Judd's serial killer showdown, \"The Butchers\" takes a lighthearted, tongue-in-cheek approach to bringing some of the world's most notorious killers together on screen. The plot has the six killers coming to blows with a group of travelers whose bus breaks down outside of a ghost town turned tourist trap focusing on the life and crimes of these vicious serial killers. The crap goes down when Semi's character, JB, sets out conjure the killers, whom he shares a kindred spirit with, then is interrupted by the arrival of the stranded group. <br><br>\"The Butchers\" has a creative concept going for it, bringing together these infamous killers. All of whom are just as likely to go for each other as the collection of victims thrown in their path. Judd plays up the fun side of horror with overdrawn characters that have no real dimension, acting only as meat for the grinder. The acting is as low budget as it gets in this sort of shtick, but there is no real attempt to pass the characters off as anything more so isn't too annoying. There are a few actors that give decent performances and the direction Stephen Judd takes telling the story make it understood that this is cheap, sensationalized, slaughterfest fun. <br><br>The special effects are a blend of CGI and practical effects. The CGI is within reason and keeps focus on the occult aspects displayed. The majority of the kill scenes and gore are practical methods that, although on the cheaper side, work well to create some gruesome moments. The blood and guts of the horror elements are the real treat in this film. Some of the scenes actually come off better than other moments, even for a low budget film there is some pretty sweet moments in \"The Butchers\". Just keep in mind this is a fun romp where carnage is king. Thankfully the dialog stays short and in context to the situation so I was able to enjoy the film more than I would if the writing required the actors to get theological, or wordy. The sound effects and overall atmosphere does good to keep the energy level up on \"The Butchers\" so I didn't really feel any lag. <br><br>\"The Butchers\" is not a deep, witty, horror story. The film stays pretty straight horror, leaning toward a comedy edge. The real sell is the blood and gore which for a low budget film gives good gore. The highlight of this one is the killers themselves. On screen, as they clash with one another and the victims, the story becomes really entertaining. \"The Butcher\" may not appeal to all horror fans, mostly because of the simple story, cheap thrills and gimmicks, plus some of the effects fall short of when it comes to being effective. However, for what it is, this is a fun, entertaining indie horror worthy of a once over. There is a lot things that are disappointing, but there are also some moments that really shine.","user":"ASouthernHorrorFan","rank":[7,9]},{"title":"Serial Killers, Inc.","rating":6,"date":"23 March 2015","review":"In the introduction, a hillbilly woman is (somewhat disturbingly) beaten and killed by who appears to be her violent ex-boyfriend, before said goon is killed by the lady's son. I'm still in the process of sorting out how this fits into the whole storyline, but maybe that's pointless, as proved later.<br><br>A few decades later, that same son has grown into a bearded and broody hunk. He's part of a group of disparate individuals heading to the desert for some sort of spiritual enlightenment trek. There's a preacher and his dull girlfriend, the goofy best friend, the sports fanatic, 2 bimbos, 2 worthless goths, a fat foul-mouthed lady, etc.. Halfway through, their bus breaks down and they hike to a ghost town. The same ghost town that, earlier on, a salesman \"bought\" the rights to the Death Factory Museum from an unsuspecting local. The poor chap must have been the only left resident in town. After some accidental sexual witchcraft, the 2 goths awaken the spirits of legendary serial killers like Ed Gein, Jack the Ripper, and a a healthy handful of others (including a bare-chested lethal vixen I couldn't recognize, but maybe she was only there for gender equality). The broody and hunky son makes it a mission to save his reluctant posse by absorbing the spirit of said killers, then there's some capoeira, and the Devil, and it just stops making sense.<br><br>If you agree to not try and make sense of the very messy storyline, you will probably be pleasantly entertained by the varied shenanigans. All the killers have great presence (except maybe for the aforementioned vixen, probably because she has no back-story in our collective pop consciousness). They are strongly portrayed, have threatening presence, and are prominently featured. There's lots of actions and gruesome killings, some refreshing nudity, the plot twists keep on popping until the very end, there's nothing to be bored with. Just leave your expectations at the door and enjoy the heartfelt ride.","user":"tdeladeriere","rank":[4,5]}]