[{"title":"Overall Average","rating":28,"date":"28 August 2013","review":"What a breath of fresh air from the last few terrible Barbie movies.<br><br>For some reason 2 years ago Mattel changed and created a modernised Barbie, and it all became about laptops, the internet, web blogs etc It seemed as though they had surfed the internet, found everything that is popular and then used the slightest excuse to shove that into their movies.<br><br>The last movie, Pink Shoes, mixed the original and modernised Barbie but did not work and was unsuccessful.<br><br>Now the latest movie is back to original Barbie again YaaY! But unfortunately is so boring, my kids walked away. Nothing happens, characters meet, then talk, then meet up again and talk some more. There is virtually zero action, zero suspense, and moves at the pace of an anorexic turtle.<br><br>Overall i welcome the return of the old school Barbie, but this movie just plods along, a pale comparison to Diamond Castle, Rapunzel, Swan Lake etc.","user":"ninjathesecond","rank":[6,6]},{"title":"Empatia total com a Barbie desastrada...","rating":8,"date":"25 March 2020","review":"Bonitinho e engraçadinho, com a barbie desastrata, empatia total...","user":"RosanaBotafogo","rank":[0,0]},{"title":"Back to original Barbie but with mixed results","rating":6,"date":"4 August 2017","review":"It is very easy to meet the 'Barbie' films with a lot of dislike and scorn and they are all very lowly rated here (despite some favourable reviews). It is understandable to take issue with the dialogue (a fair few are ropy in this regard), the predictability of the stories, the odd annoying character, the animation in a few (not all are well animated) and whether there is enough for adults to keep interest.<br><br>Despite not being the main target audience, to me they are mostly better than given credit for and don't deserve to be dismissed as baby-ish and for little girls only (a very narrow minded generalisation). Most of them look good if not having the polish of studios specialising in computer animation (Pixar for one), often great music, good lessons and messages, a good deal of charm, have their heart in the right place and have entertaining characters well voiced (some had actors of considerable calibre like Tim Curry, Anjelica Huston and Kelsey Grammar) and a likable title character that particularly young girls can relate to.<br><br>'Barbie Mariposa and the Fairy Princess' is not one of the best 'Barbie' films. It is not as good as 'Nutcracker', 'Diamond Castle', 'Island Princess', 'Pink Shoes', 'Prince and the Pauper' and 'The 12 Dancing Princesses' ('Rapunzel' and 'Swan Lake' are remembered with fondness too). It is a long way from one of the worst 'Barbie' films too. It is much better than 'A Fairy Secret', 'A Fashion Fairytale' and 'The Princess and the Popstar'. Instead it is a middling effort.<br><br>There are flaws here. While there is some cuteness and charm, the story is very thin and tends to plod along and go barely anywhere. Some of the characters, especially the clichéd and fairly underwritten Carlos, are bland, thankfully there are no annoying ones but characterisation is fairly thin on the ground. The dialogue was never a strong suit in 'Barbie' films, some of it is very ropy and rarely feels natural in flow.<br><br>However, the animation for a computer animated film to not have Pixar's name on it is not bad at all, pretty good actually. It never ever gets Video Brinquedo, Spark Plug Entertainment or 'The Swan Princess' CGI-animated and 'Alpha and Omega' sequels bad, even in the slightly less impressive spots it is the complete anti-thesis in comparison. There are some bright colours and handsome and imaginative backgrounds, as well as characters that do move with freedom. The soundtrack is cute and catchy, though there has always been a preference for the classical music-oriented ones.<br><br>Although the story is less than perfect, it does have cute and charming moments and has its heart in the right place. Appreciated the positive messaging, hardly new the messages taught but done in a way that's heartfelt and not like the film is talking at you. As well as being closer to the original Barbie rather than trying to make her modern. No negative messaging like in 'A Fairy Secret' and 'A Fashion Fairytale'.<br><br>Regarding Barbie herself, she is very likable and resourceful with a sympathetic personality that never gets annoying or bratty. The voice work is spirited, cannot imagine Barbie without Kelly Sheridan (the 'Barbie' films without her did suffer from her absence on top of even bigger problems) and she continues to grow.<br><br>On the whole, could have been much better but compared to a few of the recent efforts after 'Three Musketeers' it hardly disgraces itself. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[0,0]}]