[{"title":"An homage to old-school, campy, monster movies.","rating":5,"date":"25 May 2015","review":"Animal doesn't have much substance as a horror movie. It's your typical \"teenagers lost in the woods and are getting picked off one by one\" story, except instead of a machete wielding maniac chasing them it's an Alien-Predator-hybrid animal that has a taste for human meat. For what it is, it's a fun watch - it's exactly what you'd expect from a B-movie called \"Animal\".<br><br>I can't score it any higher because it gets zero points for originality and I can't score it lower because it doesn't try to be anything more than a schlocky monster movie. It's surprisingly cohesive writing-wise, and is definitely more watchable than half the F13 entries. Elizabeth Gillies' ear-piercing screams are annoying yet hilarious and add some extra zest once her friends become fodder to this unstoppable beast.<br><br>Overall Animal achieves exactly what it sets out to, but its sights weren't aimed high in the first place. It's a clear homage to old-fashioned monster movies with lots of campiness, cheesy special effects, blood and guts aplenty, and a handful of scares that catch you off-guard. All you can ever want in a B-movie romp-fest.","user":"lnvicta","rank":[70,85]},{"title":"Actually a nice creature feature...","rating":6,"date":"29 June 2014","review":"\"Animal\" is actually a fairly decent creature feature. Sure, the movie doesn't offer anything new to the genre. In fact, everything here has been seen before in other similar creature features.<br><br>But still, the movie was entertaining and thrilling. And when the movie offers nothing new and is essentially fully a movie much similar to every other creature feature, then what makes it stand out? Well, because the movie follows the \"how to make a creature feature\" to the point. But it is the creature itself that makes the movie so interesting.<br><br>The creature in the movie is unique in appearance and the special effects team did manage to pull it off quite nicely. The creature looked like a strange mutation between a rodent and human of sorts. It did look realistic and was adding a great sense of terror to the movie.<br><br>While the creature alone would make for a boring movie, then the people on the cast were doing great jobs with their given roles and characters. And it is especially great that no one is safe and out of harms way. The movie does offer that sense of unpredictability, which adds to the suspense of the movie.<br><br>The movie is visually great, but also audibly great. The score is nice and very appropriate to the movie. But the sounds that the creature was making proved to be quite interesting, not to mention unnerving.<br><br>It would be great to have another movie made with this particular breed of creature. I can recommend \"Animal\" if you enjoy a good old fashioned styled creature feature horror movie.","user":"paul_haakonsen","rank":[29,37]},{"title":"Surprisingly good (but not good enough)","rating":6,"date":"30 September 2014","review":"A strange creature attacks a group of friends visiting the woods. They run for their lives and find refuge in an abandoned dwelling where other people are waiting to be rescued. They think they are safe, but the creature seems to be intelligent enough to find a way in the house.<br><br>While writing the plot, I had the feeling to reveal too much because the movie itself does not offer much else. However, the acting and the cinematography are above average, and so are the special effects. There are few scenes that can make you literally jump out of your seat, and this is good, because the story is pretty boring and not different from something already seen. The actors are really good in their roles, and this is probably the only reason why I kept watching it. The score is nice, too. The only thing that really annoys from the start to end is the plot, too plain and simple. I think the audience needs to know more about these creatures and less about the sexual affairs of the characters. Unfortunately there are too many movies alike out there. The first that comes to my mind is Descent, which, of course, is far superior to this one.","user":"wpredari-937-297357","rank":[14,18]}]