[{"title":"Another Movie About Another Real Life Story.","rating":5,"date":"9 April 2015","review":"The Face of an Angel is a film about a journalist and documentary filmmaker that chase the story of a murder and its prime suspect.<br><br>Now, I went to a Q&amp;A of this with director Michael Winterbottom and writer Paul Viragh. I was particularly interested in what they had to say about the film since the film centred around such a well know case of Amanda Knox that was covered by the media extensively over the period of two or more years. That and also the fact that the film was nothing like I expected. I was confused, especially by Thomas' (Daniel Bruhl) hallucinations, and strangely dissatisfied. They had such a chance to cover something that us as an audience had some insight into but failed to make anything out of it and we were left as confused and alone as our lead. There wasn't much semblance of a story and introduces unnecessary oddities and fantasies to somehow \"guide\" us through the film.<br><br>From the documentary filmmaker who rabidly turned to alcohol and drugs, constantly snorting cocaine in attempts to help him write a script, to the disjointed storyline incorporating mythical creatures that were totally unnecessary and hardly helped the story at all. And not to mention the CGI was an awful mess too.<br><br>There was so many loose ends and unanswered questions with sensationalist journalism that there could have been a serious movie to be made here but it fell on its back. <br><br>I left to question why this film was made in the first place if it had nothing to say about the Amanda Knox story.","user":"crissgidas","rank":[54,65]},{"title":"From boring to extremely boring","rating":4,"date":"5 October 2015","review":"I have absolutely no idea how I came with the idea of watching this movie. As soon as it started I immediately understood that it was about the Amanda Knox case even though they use different names. So I thought it would be interesting to watch a movie about that. But what a disappointed that turned out to be. The story goes back and forth between the life of the journalists and the case itself. Difficult to follow and also extremely boring. Not that the actors were bad or so. They were all believable in their roles. But the story was just too boring and badly written. At one point I was battling not to fall asleep and at the end I just lost the battle. In a case like that I would normally just rewind until the part I fell asleep but with this movie I could not care less. I don't even want to know how it ended, too boring to waste anymore of my time with it.","user":"deloudelouvain","rank":[21,25]},{"title":"Faces of Angels","rating":5,"date":"23 July 2015","review":"This film tells the story of a film director who sleeps with one of the hottest women in the world while on a trip to Italy. After which he decides to get totally wasted on coke, marijuana and alcohol. Then he ditches one of the hottest women in the world for one of the other hottest women in the world who is half the age of the first one. Meanwhile he stumbles from party to party stoned and drunk, ignoring the other not so hot women characters that he encounters. He also has an annoying not so hot wife who pops up from time to time. He finally settles for the younger hot one but I imagine it not lasting too long. There is a side story about the murder of one super hot chick by another hot chick. Not all is lost though because Cara CAN act!","user":"stevenrosendale","rank":[11,13]}]