[{"title":"Far better than you might think","rating":1,"date":"1 January 2015","review":"This film has been written off by some lazy press reviewers as just another mockney fighting movie, probably due to its slightly unfortunate title and cover art. <br><br>The reality is that couldn't be further from the truth. Although I sat down expecting to watch some kind of sub-Nick Love fluff (which isn't setting the bar very high at all), this was a far better film than I had expected. <br><br>The cinematography, music, performances and pacing were all very good, and the story is far from the kind of nonsense you'd associate with most standard football hooligan-style movies. It has nuance, depth and some great twists. It's a proper film, basically, and not just a load of fighting. Though there's a fair amount of that too. <br><br>I don't normally write reviews but I felt compelled to defend this movie because on reading some reviews (after I'd seen the film) it seemed that a lot of people had got it completely wrong and probably prejudged it because from a glance at the box, you'd think it was a bit dim. But it isn't. <br><br>Good work all round.","user":"BongoJustice","rank":[19,23]},{"title":"Well done fight scenes, but very muddled plot and poor ending","rating":5,"date":"19 October 2015","review":"One of the movie sub-genres I enjoy is British underworld / British Football Hooliganism. It is a nice change of pace from American mob movies, yet still includes the violence and action I enjoy. I go into these movies acknowledging there probably will be an absence of award winning dialogue, emotional relationships and gripping plot. But I expect gritty violence and for the movie to bring realism to that type of criminal behavior. Some movies do end up having great acting and a nice plot twist and that can elevate the underworld movie to a classic, but the Guvnors is not one of those. The movie has its pros, but its cons ultimately would make this a pass for me.<br><br>The movie's plot revolves around a local hoodlum with an established gang. Not satisfied with earning an illegal income and terrorizing innocent members of the community, he also craves respect. Some community members mention the old gang that use to run the streets, and how that gang \"ran things the right way\". Some he sets off by causing mayhem and coercing the retired old timer to come and meet him for a showdown on the street. It is a little silly how some recent British crime movies draw on this premise – that old time gangsters were somehow more noble that current gangsters. I guess if you steal and rob by only being somewhat violent, you are considered more civilized that someone who uses more violent methods. But alas, that is the premise of this movie.<br><br>The somewhat irrational plot can be overlooked, because when we rent these movies we just want violence in a realistic atmosphere. And the fight scenes do deliver. There are typical slow motion fight scenes and drug den robberies. The hoodlum actors do a good job of making us believe we are witnessing how a drug dealer behaves. However, for some reason the screenwriter tried to involve way too many plot lines and twists. And this leads to scenes introducing characters for no reason, twists that begin to distract the viewer due to their implausibility and an ending that does not really make sense.<br><br>It is a little frustrating spending time watching a movie and then being rewarded with such a poor ending. I feel as though it is easy to deliver on a crime drama. Just give us a crime story with one twist and punctuate the movie with violence. And the viewer agrees to overlook a hackneyed plot and weak character motivations. But when the plot beings to get muddled and characters make choices that make no logical sense, it can be a problem. And when these problems are so severe that they actually being to distract the viewer and ruin the realism of the movie, that is a problem. I would suggest trying another movie in this genre. Ultimately, plot revelations that made no sense and a rather silly ending will leave you very unsatisfied.","user":"Jazzy31133","rank":[4,4]},{"title":"The low scores on IMDb need to stop","rating":8,"date":"12 January 2015","review":"Honestly, I'm surprised. I saw the name of this and decided to watch it, for no real reason, and after watching I checked out the IMDb page (as I usually do.) Seeing that this movie is 5.4/10 inspired me to create an account, finally.<br><br>This is a carefully-shot and thickly-written story which, despite some clear clichés, gets across what it wants to get across succinctly. Sometimes, the pace and storytelling gets blocky and unorthodox, but it's still altogether solid. The use of color, the acting, the dialogue, it's all enjoyable and not at all a bad mixture. I was expecting at least a 7/10. Odd.","user":"liliputian7","rank":[12,16]}]