[{"title":"Surprisingly Very Good And Actually Fairly Creepy","rating":8,"date":"18 September 2015","review":"So I think most people's main beef with horror movies nowadays are that they just aren't scary anymore. Personally I never really cared whether or not a horror movie was scary since it's very rare that a movie freaks me out in any way. But this flick caught me off guard and had me feeling pretty creeped out a few times.<br><br>I haven't really been a huge fan of Anthony DiBlasi's past films but he really did an excellent job with this one. The movie is centered around one character alone in a police station, so we aren't really treated to any great dialogue or anything, it most relies on scares and creating a terrifying atmosphere. Some of the jump scares didn't really land on my but what really got me was just the overall creepy feel of the film, the majority of the film keeps you in a very dark and dreary place.<br><br>This wasn't without flaws though, some of the effects were a little overdone and a lot of the main characters action were very facepalm worthy, but most of them were understandable to keep up the pace of the film. Also the main actresses performance wasn't perfect, but luckily the movie really didn't need to rely on her acting.<br><br>I really enjoyed this, it was a very nice surprise and I am glad that I stumbled across it.","user":"HorrorOverEverything","rank":[102,137]},{"title":"A very very very good horror","rating":9,"date":"19 June 2018","review":"If you are used to being constantly let down by insipid, uninspired, or derivative horrors (or simply by bland horrors rated highly by \"critics\") then you need to see this. <br><br>I am a fan of very good horror and my fave films include the Descent, Neon Demon and the autopsy of Jane Doe. This film features a female cop (with lips to die for, lols) who has to do a last shift at the cop shop where he father served, only for this to occur on the anniversary of a mass suicide of many satanists at the station a year before. <br><br>the film contains many jump scares but is still very original and includes some of the best moments (done very well) that I have ever seen done in horror. Watch out for the moment where the \"concerned cop\" comes to check in on her - thats one of the moments I mean. <br><br>Gripping, tense, and very well-paced. This is a great horror film and Im really not sure why it isnt rated higher than it is.","user":"slimecity-38663","rank":[18,21]},{"title":"I made an account just to write a review on this film.","rating":8,"date":"27 October 2015","review":"OK kids, go get your security blankets, Mr. Cuddles, a mouth guard and maybe a sparring helmet; this movie scared the bajeezas out of me. <br><br>If you're watching this:<br><br>1.Watch alone or cuddle up with someone who doesn't talk, they'll ruin the whole effect.<br><br>2.Eat prior, not during.<br><br>3.Do not use any sort of tools while watching (nail file, clippers, screwdriver etc..) <br><br>4.You'll need a light blanket for the chills.<br><br>I'm somewhat of a horror movie connoisseur - from 1 star to 10, there are few I miss. It's easy to get desensitized to the mayhem and after a while there are few things you haven't seen...and then I watched LAST SHIFT.<br><br>I think what made this movie the most terrifying is the simplicity - which seems to work for some people and not others. I enjoyed the one woman show, and what a woman at that! Juliana Harkavy was a perfect cast, reminiscent of Rhona Mitra. I truly hope to see more from her. She spends the majority of the movie alone and right from the get go you can feel how much impact that has on the tension..I watched the movie alone in the dark and at 2:15a.m.I'm still feeling THAT tension.<br><br>LAST SHIFT genuinely frightened me. I had shivers, hot flashes of fear, I had to put all projectiles out of arms length and sit on my hands to avoid the reflex of smacking myself in the face to cover my eyes, and of course sudden bouts of turrets associated with all movies in which the person should NOT GO THAT WAY!!! I have LAST SHIFT fever.<br><br>All in all, it's not a huge Hollywood blockbuster and it worked out better in this case. It was riveting to be scared again - I thought I'd been totally numbed to horror movies and I was pleasantly and painfully reminded that there's always another scream just around the corner.<br><br>Great job, thank you to the cast, crew, and director for making my night!","user":"aaroncbickle","rank":[50,68]}]