[{"title":"A nightmare, but for all the wrong reasons.","rating":2,"date":"1 October 2018","review":"I've noticed a pattern here on IMDb that a lot of the readership tends to respond badly to highly negative reviews, even if the movie being reviewed seriously has it coming. If you're one of THOSE people, you should probably just skip this review because reviews don't get more relentlessly negative than this one.<br><br>While I won't resort to hyperbole such as \"DON'T OPEN YOUR EYES is absolutely the worst movie I've ever seen\", you should be aware that I had to bite my own leg, viciously, to stop myself. I'm literally getting a brain cramp trying to conjure up the appropriate verbiage to properly communicate how appallingly awful this movie genuinely is. See what happened with that last sentence? I can't even form legitimate English sentences because DON'T OPEN YOUR EYES permanently damaged my IQ.<br><br>Plot line: homecare worker takes a job in a remote location caring for a mentally, emotionally and physically compromised old woman only to have things go pear-shaped in a demonic way. The end.<br><br>Cinematography: you get two choices with this film. It's either so dark that you can't see anything or you CAN see something and you wish you couldn't. In cinematography 101, one of the basic challenges is to learn how to shoot a scene that depicts darkness/nighttime while still making the scene easy to see. When you don't know how to do that, you get movies like DON'T OPEN YOUR EYES. In those scenes where you CAN see something, it's all sloppily performed, perpetually drifting angles that are horrifying because they're terrible workmanship rather than because they're depicting a scary scene. If you were in high school in the mid-70s, remember when you watched a film in class? Remember how all the colors were muted and everything looked like an uncomfortable winter's day were you should have just stayed in bed? Same thing.<br><br>Music: most movies have scores wherein the composer carefully composed music to match the movie scene by scene and shot by shot to appropriately score the musical passages to match and enhance what's happening on the screen. Nothing like that happens in DON'T OPEN YOUR EYES. Repetitive and uninspiring (and completely unrelated) music is simply played in the background with the general hope that it kinda sorta matches the feeling of the scene. Often, when a scene comes to an end before the music does, the music just abruptly shuts off or switches to something else. Just put cat on the keyboard of a synthesizer, flip some random switches and you'll get results that are a vast improvement over anything in DON'T OPEN YOUR EYES.<br><br>Acting: ugh... I think I'm going to be sick. The male nurse, who apparently is supposed to be the \"lead\" actor of the film, should have been replaced with a life-size cardboard cutout of himself when it comes to \"emoting\". For example, bearing in mind that this male nurse is supposedly being confronted with demonic activity, the only emotion he appears to be able to portray I would call \"slouching petulance\". Imagine a teenage girl who's been told she can't go to the dance with that hot bad boy and has to stay home and be grounded for even trying. The world is just too much to bear and she goes slouching around the house, listlessly, as if she's had diarrhea for a month. Well, this male nurse was just like that when confronted with demonic activity. Apparently demonic activity is like, \"unfair\" or something.<br><br>Pacing: none. There was maybe four minutes of actual action during the course of the entire film. The rest of the movie is interminable shots of the old woman, the nurse, or the woman who hired the nurse just standing or sitting there \"emoting\" to nothing in particular, all set to vaguely inappropriate background music, the combined effect of which makes you want to shove a Bowie knife in your ear in the hopes of ending it all.<br><br>One of the particularly excruciating elements to DON'T OPEN YOUR EYES was it's intensely tedious depiction of the decrepit old woman. If you've ever had to care for someone who is geriatricly debilitated in mind and body you should avoid DON'T OPEN YOUR EYES at all costs to avoid traumatic flashbacks. It doesn't matter how much you care for the person you're looking after, they're 3/4 insane from the combined effects of dementia and the physical misery of their daily life experience. Their primary response to this set of conditions is to make the life of any person around them a continuous hell on earth for as long as the situation persists. If you've ever had to live through this, it is utterly excruciating. Half of DON'T OPEN YOUR EYES is this sort of stuff and it's WAY more horrifying than any of the demonic stuff.<br><br>If you're thinking about watching DON'T OPEN YOUR EYES I would suggest that you whale away at your privates with a ball peen hammer instead. At least your suffering won't be polluted with appalling workmanship.","user":"S_Soma","rank":[16,19]},{"title":"Such a let down","rating":3,"date":"6 October 2018","review":"After watching the trailer I was excited to see this movie. First I have to say I thought the actors did a great job! So when you see these reviews please don't blame yourselves, you guys are the only reason this thing stayed a float as long as it did. As for the writer, I think it was a creative and cool \"concept\" you had but the over all story line just got tedious as dialog in the movie became nothing more than random sputtering making no sense at all. Very hard to understand and I don't mean because of an actors accent, I mean the lines given to her were just meaningless utter nonsense leaving the viewer in complete confusion. To make matters worse, the ending made absolutely no sense what so ever. What even happen to john? What was the little boys ghost role in the movie? I mean so many things that were not really planned out when making the movie. The shooting of the movie, editing, scenery were all good too. Again, story line was sorely lacking and if anything left viewers frustrated asking questions.","user":"killset-41858","rank":[8,10]},{"title":"Not as good as it could have been","rating":5,"date":"2 October 2018","review":"I really liked the cinematography which was atmospheric and reminded me of classic horrors such as The Omen and The Exorcist, with wintry outside shots slightly blue grey.<br><br>For the most part the visuals in the film were excellent - moody with interesting shot choices that really kept visual interest.<br><br>As for the story. It was an interesting concept that fell far short in delivery.<br><br>In the end this film became tedious to watch. Long dialogues that were difficult to understand and make out through the thick accent of the main actress -Gergana Mellin - and her portrayal of the character. No doubt she is a good actress and her theatre experience showed through, but something went very wrong in the volley of scenes where she relays important information about the story that just get lost. Perhaps it was a technical issue - either way, it just ended up being boring to try and figure out.<br><br>I also think there was a severe lack of build-up to some of the pivotal parts in the film. They just seemed to happen without any drama associated with them, and were gone as soon as they arrived. This led to a linear experience watching this film. There was nothing to get excited about, scared at, or have any particular emotional response to.<br><br>The ending also left a lot to be desired. Again, there was no build up or anticipation and it just happened fairly much as expected.<br><br>There are other points that detract from the enjoyment of watching this film, but I can't be bothered going in to them.<br><br>It is a shame. There were brilliant aspects such as the visuals, then the abysmal application of story telling. This is not a film I would want to watch again, which it could have been with a little more thought going in to telling the story.","user":"mjsreg","rank":[6,7]}]