[{"title":"Zombie Night: Meh!","rating":4,"date":"6 October 2018","review":"Made a full decade after Zombie Night (2003) which I'd consider one of the worst zombie movies ever made, the title is recycled and we're presented with another zombie piece.<br><br>I was conflicted what to expect initially, it's a Scyfy original and I actually think the Scyfy channel do horror quite well. However on the flipside it's made by the rather infamous The Asylum and they seldom make anything even remotely watchable.<br><br>So a zombie outbreak occurs, a town becomes panicked and crazed and we follow a group of survivors of whom you'll recognise quite a few.<br><br>Anthony Michael Hall, Daryl Hannah and Alan Ruck demonstrate here with their inclusion just how low their careers have sunk. Remember when Hannah was a prominent Hollywood star? Those days are well behind her.<br><br>Directed by horror legend Clu Gulagers son he does a decent enough job here in fact the whole thing has clear influences from both Romero and the Return of the Living Dead series (And in competent fashion).<br><br>It feels like an old school zombie movie and though it staggers in the centre it is actually better than you'd expect all things considered.<br><br>However, zombies have certain \"Rules\" present in their lore and here they decided to tweak a couple and that damages the movie more than I can express here.<br><br>Zombie Night would have been a passable affair if the writer hadn't decided to go into business for himself.<br><br>The Good:<br><br>Old school zombie movie<br><br>The Bad:<br><br>Some poor music choices<br><br>Zombie \"Rules\" changed<br><br>Things I Learnt From This Movie:<br><br>During the zombie apocalypse the police need to be vigilant with looters<br><br>Little known fact, zombies enjoy playing fetch<br><br>Warning: Parked cars can randomly explode for absolutely no reason","user":"Platypuschow","rank":[11,12]},{"title":"A zombie night that was no delight","rating":1,"date":"1 November 2013","review":"Zombie Night was always going to be one of those movies that people shouldn't expect that much from, but even when judging it for what it is you do want evidence of some sort of fun. You don't get that with Zombie Night, instead you get a complete failure on all levels with unintentional humour that gets more increasingly frustrating than anything else. The best thing about the movie is the make-up for the zombies, even when the least amateurish asset it still wasn't that good. With the rest of the production values you could tell that Zombie Night was made in a rush- especially in the editing- and with little signs of care or love. The dialogue is vomit-inducing in how inane it is, the timing is also sloppy and the line delivery flat. It does provide some unintentional humour to begin with but very quickly hearing so many what the...? gets frustrating, plus it does get needlessly convoluted at times. There is no real narrative to speak of, what there is shows lots of predictability, endless ridiculously dumb moments(the bunker and cemetery scenes for examples), no signs of life and the thrills, fun and horror elements are so empty and scrappily done with no signs of surprise that they feel non-existent. The less said about the dull and abrupt ending the better too. The characters are either irritating(Nana) or infuriatingly stupid(Karen), at no point do we root for them and their actions are so stupid beyond belief makes them even less likable. If there are any characters we do root for it is the zombies, unfortunately that is not saying much as they are under-utilised and personality-less. The actors don't or can't do anything with their characters or dialogue, very amateurish. It is ironic that the Oscar Winner Shirley Jones ties with Jennifer Taylor as the worst acting performance in the movie, and Anthony Michael Hall and Daryl Hannah are pretty much wasted. In conclusion, if you want any delights with Zombie Night you will be disappointed. It is not quite as bad as the abysmal Vampegeddon(doubt that many people have seen it and for good reason) but there is a big emphasis on the quite. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[21,26]},{"title":"No one in this movie is acting.","rating":3,"date":"26 October 2013","review":"Horrible... Atrocious..Anemic..Vanilla...<br><br>I find it surprising that Anthony Michael Hall did this film. He had his niche series with The Dead Zone, which his acting was acceptable for the genre and for the other producers and directors associated with it. It was low budget but had a good story line.<br><br>You have a pretty good character actor in Alan Ruck whose talent is wasted and covered by the horribly poor acting of Shirley Jones and Darryl Hannah. We expect that from Shirley and Darryl though. Ruck and Hall were the only two actors that had the ability to somewhat carry this movie but the plot line is so thin and the movie only concentrates on gore, which the FX dept fails to help.<br><br>This movie is low budget, has a horrible story line and is so bad that I expected Lou Diamond Phillips to make a cameo in it at some point. 2 families attacked by zombies at night. The attack miraculously ends with daybreak so they're like zombiepires or Vamzoms...<br><br>I could have dipped my big toe in an ink well, taken an ambien and gone to sleep and woke up with a better script written in blurry ink on my bed sheets.<br><br>No one in this movie is acting. The actors that are supposedly zombies don't act much like zombies in the traditional sense. One man could have opened his panic room, let the other family in, and they could have all survived.<br><br>It's so bad that it can't be called \"campy\". I'd watch Ragin Cajun Redneck Gators 10 times before I'd watch this movie again, and I've watched the movie twice tonight just because I couldn't believe how bad it was the first time that I thought I had missed something.<br><br>Nope, it's that bad.","user":"bxhancock","rank":[13,16]}]