[{"title":"He came along this road","rating":7,"date":"14 November 2014","review":"We open with Nick Cave in bed. Soon he's half-naked before the mirror. But this semi-staged documentary is no warts-and-all exposé. The lighting is kind to Cave's boyish body, and his voice-over is as precisely prepared as it is passionate and poetic. This rehearsed vulnerability sets the tone for how directors Iain Forsyth and Jane Pollard will portray their elusive subject.<br><br>Their approach provides Cave with an appropriate level of control. Control is essential to the process of self-mythologising. Cave is aware that myth is what gives popular artists their enduring legacy. It's not dishonesty. Myth contains truth: the truth of how art (and the artist) makes us feel, the senses it triggers and the images it conjures. And what images Cave has conjured over the decades; from surreal punk, through broken Americana, through dark ballads and blaring gospel rock and a parade of delicious dirges.<br><br>The focus on the recording of Push the Sky Away means we hear very little of The Bad Seeds' earlier work. We glimpse The Birthday Party (and a very amusing vignette it is). But Cave and his myriad members have gone through various phases, and we get no sense of these because we hear nothing of them. Do not go into this film expecting a retrospective. Do not expect chronology, or even much revelation. Do not expect to bring a virginal friend and open their eyes to the strange, bleak, sentimental narratives of Brighton's finest immigrant. And yet it is a film for virtually everyone; for those harbouring an idea and a glimmer of interest in the creative method.<br><br>You'll know from the trailer that Ray Winstone and Kylie Minogue drop by for a ride in Cave's car. These scenes are more than just elaborate name-drops. They're framed as natural exchanges perhaps imagined or drawn from memory. Most moving is the conversation with ex-Bad Seed Blixa Bargeld, which has the air of some latent regret being cauterised.<br><br>Toward the beginning of the film there are a number of intense dialogues between Cave and the psychoanalyst Darian Leader. These scenes are deeply intimate and engaging, and it's a pity they fall away. It's indicative of the broader sense that 20,000 Days is truncated. Surely there's more footage. There is, surely, a three-hour edit of this movie, just as compelling and original and humorous. Yes, this is a double-edged criticism.<br><br>Elegantly shot and exquisitely edited, there's warmth in every frame of this movie, whether we're in the archives, scouring scuzzy photographs from Cave's youth, or in the pleasingly chaotic space surrounding the typewriter of dreams. Forsyth and Pollard carefully walk the line between hagiography and dehumanisation: Cave comes off as neither a fallen angel nor a mad recluse. But he does emerge an enigma. And that's okay, because that's how the man himself reckons we like our rock stars: slightly unreal, swaggering and contradictory, and bigger than God. I'm inclined to agree.","user":"rooee","rank":[22,25]},{"title":"Any creative person needs to watch this film","rating":10,"date":"10 September 2014","review":"Any creative person needs to see this. Musician, writer, anything, if this film doesn't inspire you, then it will surely influence. Personally, Cave's very frank and fascinating philosophies on the creative process were stirring, moving even, especially when one of these ideas is laid out in the narration and followed by a very up close and personal live performance. Or, a ten minute, uninterrupted sequence of the band jamming out a song. It was in that latter scene you can see the conducting skills Cave possesses, as while playing the piano he is leading the band into the song's dips and crescendos. This look into the journey an idea goes on until it becomes a story, or a song in this instance, is almost intimate and extremely honest, while still managing not to spill too many beans. The unconventional nature of the film helps this aspect.<br><br>I really do think that if you write or create in any way, watch this film as soon as you can. I'm having to stop myself from going to see it again three days after i saw it. Note: this is not a documentary, but it isn't a movie either, as you'd normally think of it anyways. This film is most certainly unique, and one of the most thought provoking pieces of art that I ever ever seen, read or heard. Even his conversation with pop-singer Kylie Minogue (sp?) was interesting, as they candidly discuss different issues related to performing on a stage.<br><br>Not much action physically, but the way Cave is so spiritual about how he see and treats the creative process makes every second riveting. I didn't want it to end. For me, this was inspiring on a level that I have never felt before.","user":"punishable-by-death","rank":[39,50]},{"title":"Masterfully written, sequenced and shot. Gripping and powerful","rating":8,"date":"22 August 2014","review":"The movie had a raw feel about it, an honest look at the creative process from the perspective of Nick Cave. It opened up a line of thoughts (as an aspiring musician) that transformed, inspired, questioned and transcended my way of writing. The pace of the movie was far from slow, (though obviously nor was it fast paced), it almost reflected Cave's musical writing style, a kind of creeping epic crescendo. The movie didn't fail to completely grip my friend, who I'd rate highly in terms of his cinematic knowledge (working in the industry), despite the fact that he hasn't really been exposed to much of Cave's work.<br><br>The cinematography was beautiful, with extremely unique transitions that somehow flowed scene to scene. The soundtrack was obviously excellent, with some stirring performances, I'm fairly certain there were a few slightly teary eyes in the cinema. Nick Cave was simultaneously eccentric, enigmatic yet very down to earth and heartfelt. I did feel his heartbeat.","user":"stuartfsmith","rank":[36,47]}]