[{"title":"A disappointment in every aspect...","rating":5,"date":"17 June 2016","review":"I was kinda hyped to this one. It felt like the right when I first heard of it. The cast, the posters, the trailer, even the mysterious plot about a hole that just appears in the middle of the living room of some girl and swallows her boyfriend. I was sold, I wasn't expecting for nothing like a runner-up to the award season, but I was sold to a little indie funny and cute rom-com.<br><br>Well, high expectations has its downsides... The shitty thing, I can't be apologetic towards this movie... I tried hard to like it, but the movie wasn't able to hit the right nerve in no moment, and dude, I watch movies with an open heart...<br><br>The movie doesn't actually delivers any of the expected cuteness, comedy or quirkiness of the story that actually sounds lovely, funny and pretty intriguing. The cast, mostly Brie and Chatwin, as protagonist, aren't able to work all they can, and proved in previous works, 'cause the characters are pretty much flat, even more when the expositional dialogue tries to state the opposite. The supporting characters, unfortunately, are as much as shallow.<br><br>The movie does not tackle none of the big points it brings. It feels pretty much like the writer Steve Adams just had a good idea to a movie, but wasn't able to put it in the right way in the script, and the director Nick Wernham, in his feature directorial debut, just stuck with it 'cause it was what he had.<br><br>The movie failed to be one fine rom-com, and turns out just as a silly cautionary tale, that waste the chance to make great statements, about art, love, sex, fidelity, and people.","user":"afallguns","rank":[15,24]},{"title":"quirky idea kinda flat","rating":5,"date":"27 December 2017","review":"Guys in Spot Valley have a crush on popular school teacher Lucy Sherrington (Alison Brie). She has an affair with married football coach Clint Coburn (Colin Hanks). When she finally says \"I love you\", a hole opens up in the middle of her living room and Clint falls into the dark abyss. He's left floating somewhere deep inside and she struggles to get him out. Rydell Whyte (Justin Chatwin) is looking for Clint. He's a goon working for Clint's bookie.<br><br>It's actually kinda boring to have every man repeatedly hit on her. It's a funny idea that isn't that funny in its execution. That's my general feeling about this movie. The idea of this dark screwball comedy with Alison Brie is fun but it's dead pan flat for the most part. Chatwin tries to be quirky funny but can't get beyond quirky dark. Brie should be more flustered but she's too deer in the headlights. There is an obvious easy way to lie about the hole to his wife but Clint does it poorly. There is the theme of love but it's somewhat muddled. There is nothing overly objectionable but this doesn't engage me.","user":"SnoopyStyle","rank":[2,2]},{"title":"A look into the human lack of awareness of ourselves","rating":10,"date":"26 June 2016","review":"As Lucy Sherrington says \"You think about doing something and it's always different than what you thought\". I believe that phrase is key to what Director: Nick Wernham is bringing to light in this lite hearted comedy with a message.<br><br>The plot revolves around Lucy Sherrington - the high school art teacher - and the numerous men in this quiet idealized American small town, who have convinced themselves that each is the perfect lover for her. Lucy does not share the interest in their enthusiasm and when she finally gives into Clint - the high school coach - it's a disaster for her and him. In doing this the coach descends into a state of abstraction.<br><br>Then into Lucy's life walks the stranger Rydell, who is in that small town to do something that is completely contrary to his nature, but his family expects him to do it. Rydell is the only man to enter into Lucy's life that actually has some level of self awareness because he opens his true thoughts to Lucy and explains to her how he feels about his own life.<br><br>When the town discovers what has happened to Clint they all gather together in friendship to bring the coach back into reality. Lucy makes a public confession and Rydell's brothers arrive to take him home. Rydell decides he must be true to himself and abandons his rather hateful brothers and goes to find Lucy.<br><br>Throughout this film Clints state of abstraction is symbolized by a bottomless hole in Lucy's living room. When the hole is discovered everyone has a different interpretation to it's meaning. At movies end we see Lucy and Rydell standing before another hole but this hole is a natural formation on the earth and at cliff's edge they stand. Rydell has obviously fallen in love with Lucy but we are left not knowing if Lucy feels the same for Rydell. Lucy now faces her own state of abstraction as symbolized by the vast opening beyond the cliff. There is a difference between Clint's mysterious undefinable abstraction and Lucy's highly defined state of abstraction.<br><br>This is a fine movie for the thinking viewer!","user":"cekadah","rank":[9,20]}]