[{"title":"A cute coming of age movie that almost hits every mark.","rating":7,"date":"15 August 2016","review":"The name of the game here is Chess. Rico Rodriguez (Manny from Modern Family) plays the disconnected Texan son of Mexican heritage, Jose, in this family drama that deals with issues of bereavement and the challenges of being a single parent all thrown into the bag. Bullied at school Jose finds solace and escape from his mother (The always brilliant Justina Machado) in becoming a skillful chess player, taught by his Chess Guru Aunt (Ivonne Coll, who steals the film with her sensitive performance). Jose's talents are soon spotted by one of his more dedicated teachers, Mr Alvarado (Vote for Pedro!) who decides to build a chess team from all the kids who are regular in detention. Unsupported by the school who would rather see its cabinets filled with football trophies, he never the less persists and enters the team into local competitions. The family are soon torn asunder by a sudden bereavement and Jose feels more isolated from his mother than ever. Will Chess be the thing that brings them all together again and put the school of Brownsville on the map in the young people's chess tournament? <br><br>Films about Chess, do not always make for the most exciting of viewing, fortunately here it is used more as a tool in the story to explore other social issues facing our main characters. Brownsville is a multi racial Texan school with a large population of Mexicans. Deportations of illegals are common and often responsible for the breaking up of families and in Jose's case, part of his emotional support network. The film perhaps tries to cover a little too much but it succeeds admirably well in exploring this and other issues facing people in this situation today. What it lacks in dynamics it more than makes up for with the extremely talented young cast, many of whom are virtual unknowns and the film has a whole heap of heart. The kids in cast are all extremely good, so much credit must go to the Casting Director, for finding such a talented bunch. It's nicely shot and the more experienced older actors round out the cast well. Eventually through his persistence Jose finds redemption and his mother finds her son again, the journey of these characters makes for a heart warming story and informs you a little more about the plight of Mexican immigrants along the way. It did feel at times as if I was watching two films and not everything worked perhaps as well as intended, but I want to be clear that this was a well made film, well acted and directed and I would recommend it. If only all the worlds conflicts could be solved with a game of chess.","user":"azanti0029","rank":[3,4]},{"title":"An excellent film that will touch your heart and make you smile","rating":8,"date":"13 August 2016","review":"Endgame was among the nicest films I have seen this year. Based on the true story of a young rolly polly boy who lives in USA with his Mexican mother, elder brother (a star player of his school team) and his grand mother who has been teaching him chess.<br><br>The film starts to move forward within minutes, and saying anything else would be a spoiler (so yes - a lot happens - every few minutes!).<br><br>Some moments of the film tug at your heart (I could sense moments where I may have felt - and I am sure many other viewers too may have felt a feeling of deja vu - just like this child, albeit a few decades ago). Others make you smile, and some make you laugh.<br><br>If there is one thing this movie is, it is genuine. No pretenses.<br><br>It is only at the end that one realizes that this film is based on a true story of a small town in Texas.<br><br>The acting by everyone is excellent - especially the kids who act exactly like kids would have behaved. The music is lovely - Mexican style guitar mixed with simple songs.<br><br>Highly recommended viewing. Even if (perhaps especially if) you do not have any interest in the game of chess. For the film is more about childhood, dreams and people that about the game. And That, is a universal theme.","user":"londonmapper","rank":[2,3]},{"title":"Te toca: no me toque","rating":4,"date":"15 August 2016","review":"At the moment of submitting this first review, this film has a rating of 6.3 which in my view it does not deserve. I was far from convinced by any of it really . The acting was by and large OK from an unknown cast most of whom as you will see don't even have IMDb photos. Direction, camera work, lighting and so on also OK. There is not much to either like or dislike. The word bland comes to mind. The film is about largely Spanish-American schoolkids playing chess. Er, that really is just about it. There is much dialogue between the children and their parents, family members and teachers most of which is in English if it contains a plot point but they would often change to Spanish when it was just general chit-chat: to lend an air of authenticity you see. Now, I can speak Spanish so no problem for me but I can see some viewers becoming a bit frustrated if they are suddenly shut out like that. Why would people whose first language is Spanish be talking to each other in English at home anyway?<br><br>I used to be a keen chess player also but I found it difficult to follow what was going on a lot of the time. In the latter part of the film they appear to have reached a very high standard and are being taught complicated strategies- French opening, gambits, Engish defence and so on and you have to be very good to know or even want to know stuff like that. But in his final game the \"lead\" child actor makes a blunder so clumsy and ignorant that it is impossible to believe. I won't bore you with the details but a raw beginner would have seen it coming. So, if you like harmless almost vacuous films about 12 year olds playing board games then this is definitely the one for you.","user":"dunfincin","rank":[3,6]}]