[{"title":"Effective Realistic Romance SPOILERS","rating":17,"date":"17 September 2016","review":"Sometimes a malignant narcissist is just a narcissist--nothing can be done to make him/her interesting. But \"The Silent Storm\" is an extremely compelling movie set in the mid-twentieth century, on a remote North Sea island losing its population and (one assumes) Presbyterian congregation to the mainland. The few reviews I have seen mention \"Breaking the Waves\" in comparison, as if any film set on the Scottish coast must resemble that unbearably depressing 90's hit. Rather, this movie calls to mind \"Oscar and Lucinda,\" only minus that film's humor. For those who haven't seen \"Oscar and Lucinda,\" set in Australia: the film stars Ralph Fiennes as another messed-up son of sadistic Calvinism. <br><br>Damian Lewis is listed as one of nine executive producers, rather amusingly with one of the Broccoli's, of \"Bond\" fame. His twisted and abusive character, a minister named Balor McNeil, reminds a female congregant to be grateful for her alcoholic, abusive husband, because \"to wish for happiness in this life is arrogance.\" Balor watches his flock dwindle due to the closing of a never-seen diatomite mine. The Reverend's cruelty is established early, with stereotypical tropes from Victorian literature; and stereotypes don't profit from grand guignol soundtracks. The hideous soundtrack is the real villain of the work and the only thing that marks this as a first directorial effort. <br><br>\"The Silent Storm\" is reminiscent of Benedict Cumberbatch's \"Wreckers,\" too, in that it deals with a tightly-wound man from a post-War striving class. Rage is indistinguishable from religion to Balor; and when he opens a bottle of whiskey, which is often, his \"Lord\" is a monster. He's married to Aislin, Andrea Riseborough, whose age, though implied to be younger, is inconsequential, as rapid-aging always happens in a marriage to a religious sadist. <br><br>We learn very early that Balor somehow rescued Aislin from the sea, although the circumstances of the rescue and his role in it are never made clear. Another reviewer here has mentioned Riseborough's discordant, Eastern European-sounding accent. On first viewing, I too considered this a glaring flaw. On second viewing, I decided that Aislin's hatred of her husband's religion and vague references to an even vaguer past might suggest she is a refugee from Germany. Unfortunately, the most significant problem with \"The Silent Storm\" is an utter lack of narrative, exposition, or dialogue that fleshes out any of the three leads, but especially Aislin. (My assumption that her Eastern European accent is intentional is merely an assumption.)<br><br>Riseborough's expressive face is burdened by carrying too much of the story. No question she's in the situation Ralph Fiennes' violently abused Oscar was in before his escape; she's a free spirit whose collection of herbs has earned her the scorn of the fellow- narcissists who fill Balor's pews and gossip about her. What is inexcusable from the perspective of storytelling is the glossing over by the script of the miscarriage with which the film opens, and Balor's wild grief over this event. He is convinced he is Job, a man for whom the Lord has not divine love, but divine contempt.<br><br>Fionn (Ross Anderson), a young man identified as a truant by a do- gooder from the mainland, arrives Providentially (as he should arrive in a film about Calvinism) when Balor is beating Aislin off- screen over her miscarriage. Fionn unfortunately arrives before the island's population all depart for the mainland; he too is the object of post-Sunday service character assassination, as the stereotypical \"troubled\" and \"dangerous\" \"lad\" who'd surely stir up trouble if more people than Balor and Aislin would be around. (It turns out his great \"crime\" was that he defended himself against a man who was raping him.)<br><br>I judge a film by its ability to keep my interest. Certainly the extraordinary beauty of the gloomy island and coast would keep a viewer's interest, but only for so long. \"The Silent Storm\" doesn't rely on its exteriors. Balor is severely alcoholic, a former sailor whose losses make him more than a little deranged, and he starts to dismantle his \"kirk\" down to the studs, to transport it (like Ralph Fiennes' less luckier Oscar) to the mainland. His narcissism or indifference to Aislin, the \"witch,\" is strong enough for him to leave her alone on the island during this endeavor rather than to take the young, handsome, strapping Fionn with him. But Aislin and Fionn don't fall into each other's arms the moment they have their own private Idaho; and this is the source of much of the film's meaning and power.<br><br>These characters are not interesting. I'm making them sound much more interesting than they are written. The film suffers greatly from sufficient back-story--in whichever ways the director/writer might have chosen to provide back-story: expository dialogue, silent visuals, additional characters. Even if a film is done with minimal financing, there are ways to convey story, and \"The Silent Storm\" has about as little story as a film can have. (Compare it to the bigger budget \"Angels and Insects\" or the even older, brilliant \"Draughtsman's Contract,\" to see how story can be crammed into the most claustrophobic \"isolated country manor\" tale.) <br><br>Anyway, neither Balor, Aislin, not Fionn have any past, and, for that reason, they are not distinctive. Was this the filmmaker's point? An Everyman/Everywoman morality play? I don't know. The film has a curious amount of scenes that fade-to- black and disrupt immersion in it. Despite all of this, I never lost interest in the film, not for a second. It is lyrical and talks very quietly to the viewer about strength and convictions formed in the \"silence\" of its title. It perhaps cheats, trying to satisfy both an audience seeking bleak abusive British period drama as well as an audience of millennials seeking realism. In fact, though, it's this mixture of the mundane, the ugly, and the romantic that make the film work.<br><br>Definitely worth seeing.","user":"hilaryjrp","rank":[11,15]},{"title":"Were no Scottish actors available?","rating":6,"date":"8 November 2014","review":"Balor is the God-fearing, fire-and-brimstone preacher on a remote Scottish island some time after (I think) the Second World War. His wife Aislin does not share his deep religion and is unhappy. They are asked to look after Fionn, an angelic-faced juvenile delinquent who nonetheless loves poetry. Count those stereotypes! Add in the facts that Balor abuses Aislin, that Aislin and Fionn find each other mutually interesting, and that Balor leaves them alone on the island while he visits the mainland, and you can see why I found this film very predictable (although to be fair, what you may think will happen between Aislin and Fionn, doesn't).<br><br>When introducing the screening at the 2014 London Film Festival, as well as burbling on about 'the patriarchy' (cue eye-rolling from your humble reviewer), writer/director Corinna McFarlane also mentioned her 'Scottish heritage' (while speaking in as English an accent as I've ever heard). This makes it strange that when casting the lead roles Scottish actors were largely ignored. Instead we have Damian Lewis (place of birth: St John's Wood) with a dreadfully laboured Scottish accent, and Andrea Riseborough (born in Newcastle upon Tyne) spending much of the film sounding as if she's just been parachuted in from Warsaw. The fact that talented Scottish thesp Kate Dickie is relegated to a small supporting role only highlights this. Thankfully, as Fionn, Ross Anderson is really Scottish and it is noticeable that his lines are the only ones from the three leads delivered with any fluidity.<br><br>So, stereotypical characters, predictable plot, dodgy accents... is this worth watching? Well, yes. Sure, the viewer knows where the story is going, but at least that means he doesn't have to work hard. And the Isle of Mull scenery is spectacular.","user":"euroGary","rank":[13,22]},{"title":"Excelent drama in a beautiful landscape","rating":8,"date":"10 June 2018","review":"Great interpretations by Andrea Riseborough,Damian Lewis and Ross Anderson set in Scotland's finest landscape.\nSlow burning drama, with beautiful photography work and soundtrack.\nSimple story, but very well done, about love, hatred and what God really is.","user":"davish_wulf-1","rank":[4,5]}]