[{"title":"Offensive","rating":1,"date":"24 September 2015","review":"This film is terrible. Where to start? Poor acting, no idea where they got the guy who played Reggie from but I've seen more character in a wooden spoon. No proper research was clearly done into the Krays which makes the film hard to watch and cringe worthy in parts. The fact that the \"twins\" looked and acted a million miles apart pretty much sums it up. It's offensive that this film was even produced under the name of the Krays and I agree with other users that the logic behind the film was simply to milk the subject for all it's worth. Best advice would be to save your time and money and either watch Legend or read one of John Pearson's novels on the Krays, both of which at least do the subject some justice.","user":"luke-24940","rank":[19,20]},{"title":"A c grade movie of the twins","rating":2,"date":"1 September 2015","review":"There is an older version of this movie starring the Kemp brothers. At least they looked alike. These two actors bore no resemblance to each other. This is a cheap movie, badly acted, not true to the story and it jumps about all over the place. There is no chronological order to the Krays growing up and developing their psychopathic behaviour. The movie was a hard watch due to the poor character development. What we have here is a very loose film based around the twins with lots of violence. The twins mother was hugely influential on the boys but we don't see her. The drunken, wife beating and child beating father also doesn't get a mention. Save yourself 2 hours and read a book or go into the garden.<br><br>Hopeless.","user":"mrrob-31532","rank":[31,35]},{"title":"Total Rubbish","rating":1,"date":"9 October 2015","review":"I have always been interested in the Krays. I have read most of the books about them and I also enjoyed the 1990 film with the Kemp brothers, which was flawed and left a great deal of things out, but became a cult film. The Rise Of The Krays, however, makes the Kemp film look like a masterpiece in comparison. I only watched it for half an hour and I thought it was absolute rubbish. It featured violence just for the sake of it, no coherent plot, was obviously made on a shoestring and featured no actors that I had actually heard of before. To make matters even worse, the two actors playing the Krays didn't look like them at all! The comment on the cover of the DVD states that this is, apparently, \"The Best British Gangster Film Ever\", which is complete rubbish. This is, without doubt, the worst film I have seen for a long time and anyone who knows anything about the Krays' story would soon spot glaring mistakes. It is a blatant rip-off of the 1990 film and an obvious cash-in on the new Legend film starring Tom Hardy as the twins. He looks more like the Krays than the two jokers in this film. Honestly, just don't waste your time or money on this rubbish. If you want to know more about the Krays, then I suggest you read one of the books about them, which are infinitely more accurate and tell a fuller picture than this film. You will thank me for it, trust me. Even the 1990 film is better than this.","user":"sqdb","rank":[20,22]}]