[{"title":"Finally a great (cyber) thriller made in Germany.","rating":9,"date":"1 October 2014","review":"It is not very often that a German movie tries to do something else than Til Schweiger / Schweighöfer standard comedy. Who am I is one of those very rare films from Germany which deals with a serious subject, has a serious tone and plot and can compete with international movies in the same budget range. <br><br>This movie - regarding the mediocre budget - surprisingly can compete with international films. The plot is constantly exciting, the actors are very good, especially Tom Schilling in the lead role. And the ending is something I have never seen in a German film before. A real mindfvck and very clever.<br><br>The film is unique in its way to show the Darknet (no spoilers) in a very understandable way. The chosen imagery to show what is going on behind the screen is innovative and is visualized in a way, even people without knowledge of the subject can easily understand and follow the plot. <br><br>Who am I definitely is one of the best German thrillers I've ever seen and easily one of the best German films in this century so far. It is good to see young and talented German directors get the chance to finally make movies which do not need to hide behind Swedish or french films. This movie thankfully does not feel \"typisch Deutsch\" but much more mature and with a better production design than the \"typical\" German movie feels. <br><br>Yes, this movie is not very original and has some minor flaws. However, as the first serious German film outside the boring history drama genre in years (the last one was HELL if I remember correctly), I can ignore them. I really hope this film is a door opener for more well-produced German films in the future which might even become international hits. Something, the Swedish and french cinema already achieved. <br><br>9 / 10","user":"timo-hellmund","rank":[91,111]},{"title":"Unusual German movie, very entertaining","rating":7,"date":"28 October 2014","review":"Even though I live in Germany, it's been years since I have watched a German movie. The local cinema and made-for-TV movie market is saturated by cheaply produced romcoms and documentary-style WW2-movies. 'Who Am I' caught my attention with its very different theme. And it turned out being a very enjoyable watch. The first interrogation theme felt a bit overacted and over-directed to me and made me worry if they would try to hard to be \"cool and different\", but luckily the movie quickly found a good pace and well-balanced direction. It moves at a fast pace, with quite some jumps forth and back in time, but the director keeps it well structured, so that the audience doesn't get lost in the twists and turns. The visual effects are very well done, I especially liked the visuals of the 'dark net', depicting the online interaction between hackers as scenes in an underground train. There are some minor plot holes, and I found myself able to guess some things which would happen next, but the end of the movie will manage to surprise most viewers (now, how often can you say that any more?), and the fast pace and compelling characters (throughout well acted) will keep you hooked. This isn't a groundbreaking movie, but I see good potential for it to draw the attention of an international audience, which hopefully will lead to some more German movies in he near future who also dare to address unusual themes.","user":"maximenigma","rank":[51,63]},{"title":"Finally a good hacker movie","rating":8,"date":"4 December 2015","review":"I haven't seen a big amount of them (probably to due because not many of them are made) but the ones I have seen have, even if they were somewhat entertaining they always seem to fail on the technology-aspect to the point that you wonder if the scriptwriters even have used a computer at some times.<br><br>Here it's pretty clear that the script-writer has a lot of knowledge of how hacking works and computers in general, even though I'm sure that some who know the field still have a lot to complain about but for the average Joe in the technical aspects of computer technology most things makes sense.<br><br>As far as the whole story goes, I mean sure it's not as realistic as it would be if someone would document the life of a hacker surely and it's more of a thriller than a drama but it's not all that far-fetched that you roll your eyes or anything and it entertains most certainly.<br><br>Acting is stellar as well.<br><br>So yeah even if you are getting second thoughts when you find out that it's a German movie, it's definitely worth going through the 'tough task' of reading subtitles I assure you and no I haven't seen an English speaking hacker-movie that tops this one so yes definitely recommended.","user":"Seth_Rogue_One","rank":[36,45]}]