[{"title":"Production interference ruined ending","rating":3,"date":"14 October 2016","review":"What happened in the process of adapting the book to script, filming, cutting, editing? Did someone get knocked over on the head or did they just make a decision to kill their own film? In a nutshell: Know that brilliant, creative, controversial yet elegantly beautiful plot twist ending we all know and love from the books? Well, here's a cheesy happy ending. I can just imagine the producers (which happen to be Ron Howard and Brian Graze of Imagine) sitting in their little office going: Mmm.. that ending is crazy! We can't let that happen! What will the audience say? We can't make a STATEMENT like that! YOUR AUDIENCE (a large amount being book readers) are coming to be impressed, to see an interesting look at overpopulation and Dante's inferno and plague images! I mean, the fact of the matter is: Overpopulation is a problem and Dan Brown proposes an elegant solution in the form of a \"plague\" which PLOT TWIST: Doesn't actually kill anyone, but makes the 1/3 of the population (by random) become infertile. It solves the issue without being genocide. No one dies, yet the problem is solved. Elegant, brilliant, shocking, and opens up a conversation about a real life crisis we are facing. Interesting subject relevant to your audience.<br><br>Right, okay, at some point they decided to change the ending. Which means at the end you are still stuck with the question of overpopulation. The film makers decided to stick with the crowded scenes. So they constantly showing us that THIS IS A PROBLEM that needs to be solved. Or at least something to acknowledge. Did they offer an alternative or did they decide just to stop the bad guy? They decided to stop the bad guys, not offering even a philosophical comment by Professor Langdon. The problem is still staring us in the face as Langdon flirts with W.H.O. director Sinskey and gets his watch back.<br><br>You did not give us an ending. You did not give us a tying up of knots. You gave us a cheesy, cheap, Hollywood ending that blew up in your face. <br><br>Also lets talk about the casting choices. Or not. Because it sure looks like they didn't give a crap.<br><br>I think the producers got scared. Copped out. Underestimated their audience. Just bad storytelling really. What a waste of a Friday evening that was.","user":"ingunnlara92","rank":[363,414]},{"title":"Why would they change the ending? That was the best part of the book... WHY?","rating":4,"date":"16 October 2016","review":"Dan Brown is one of my favorite writers, maybe Inferno was not his best book but it was still good enough. i've read it in 2 days , i know a lot of people that loved it. One of the best things about Inferno was the ending, and they decided to leave it out of the movie script...<br><br>That was a big mistake, that's why i recommend everybody to give the book a chance even if u tried the movie...<br><br>I gave the book 9 stars out of 10. I can only give the movie 4 stars out of 10. <br><br>I'm sorry they changed the soul of the movie , they tried to make it more Hollywood and they made a big mistake...<br><br>Thanks","user":"tudor2","rank":[159,187]},{"title":"Don't watch if you read the book...","rating":1,"date":"15 October 2016","review":"kind of SPOILER... It doesn't matter casting, direction, location, production, acting and anything if the best part of the book, the GLORIOUS AND GREAT FINALE that made Dan Brown a genius was changed to the most common, stupid ending of a silly Hollywood mystery/thriller movie. It's like if in 'The Empire strikes back', Darth Vader answered: \"yes, I killed your father...\" or in 'Seven', Kevin Spacey is caught by Brad Pitt just in time to save his wife. What the hell were the producers thinking? They had the chance to make one of the best movies in 2016 and just wasted it. Too much shame on Ron Howard for being such a poor director and for Dan Brown for allowing it.","user":"hectorblg","rank":[131,159]}]