[{"title":"Wow! Just wow!","rating":9,"date":"13 December 2015","review":"Man, I have seen a lot of gory and bizarre films but \"Eat\" takes the bloody cake! Yes, the acting wouldn't make Meryl Streep jealous, but that matters very little because the subject matter is so damn dark. It's scary when you think about it - someone eating themselves into oblivion. I don't think I've ever seen another film like this, so its originality is what causes me to rate it so high.<br><br>This film would make an excellent study for students of abnormal psychology; really, it should probably be in the curriculum of universities and colleges worldwide. You wouldn't even need an unrated or uncut version of this movie. It's dark as hell from beginning to end. Interestingly, the acting was pretty weak in the start, but as the movie got more and more deranged, the acting improved.<br><br>\"Eat\", despite its flaws, is a must-see for all fans of extreme horror. If you can handle \"Inside\" or \"Martyrs\" or anything Takashi Miike dishes out, you can handle this.","user":"redrobin62-321-207311","rank":[9,10]},{"title":"I love this!!!!!!!!!!!!!!!!!!!","rating":10,"date":"17 February 2016","review":"I just finished watching this movie 2 minutes ago and i came straight here to make this review.. It really makes me wide awake even when i watch it rather tired.. The actress and actors are well chosen for their roles.. Really got my full attention watching. Scenes captured in very detailed manner and captured my feelings too. The music and soundtrack fits in really good.. I love it so much.. I could also feel every emotion of the main lead (Novella McClure) in the movie. Kind of feel sorry for her when she encounter problems and stressed out. Its rather extreme the things she do to vent out her stress.. Apart from that she is quite pretty and attractive lady. Love the strong gore.. I'm not sure how others rate this movie and i don't care, its a 9/10 for me. But i still give 10/10 to show my appreciation for this movie. Well done to all the people who are involve in making this film. I love this movie so much.","user":"ahao76","rank":[9,12]},{"title":"one you won't forget seeing","rating":7,"date":"21 September 2015","review":"The first full feature by director Jimmy Weber and it's one that will stick to your mind. the opening sequence is great, the editing and the graphics, it immediately got my attention. Slowly you get into the story and the first minutes nothing really is going on. Except for Novella (Meggie Maddock) who got some trouble with her thumb. It's bleeding. After going through so many auditions she's fed up and starts sucking her thumb and trouble comes in.<br><br>I can understand that some horror geeks won't going to like this flick because it do takes a while before the nastiness comes in. It's really going into the character of Novella and seeing how she's going on with her nasty habits of biting. Being used and abused (porn industry) she's becoming sick doesn't admit it and falls in love with her schrink. <br><br>Here and there you do get rewarded with gore. Overall I found it okay but to say it's one for the gorehounds no therefore I can't agree. This one just goes deep into the mind of Novella. It will stick to your mind, that I can tell.<br><br>Gore 2,5/5 Nudity 0/5 Effects 4/5 Story 3/5 Comedy 0/5","user":"trashgang","rank":[6,8]}]