[{"title":"Worst amateur actors ever","rating":1,"date":"4 April 2019","review":"I don't even know how this is allowed to be on any streaming service.<br><br>First, the acting was awful, the main character never know what he is doing or saying, you can clearly see all the bad editing in many scenes.<br><br>With no doubt I can say that any short film from any high school has better script and acting.<br><br>Don't dare to give a chance to see this \"movie\" , you'll regret it","user":"carlos-rubio-martinez","rank":[11,11]},{"title":"Without doubt, the worst thing the human race has ever produced.","rating":1,"date":"28 August 2018","review":"When the aliens finally arrive to judge us and they're taking into account Nazism, the hydrogen bomb, the treatment of refugees, the stupidity of organised religion, and all the other depredations we have wrought on each other, this film is the thing that will push them over the edge and cause them to annihilate us.","user":"machete-2","rank":[42,49]},{"title":"is it a film? Is it a joke? Is it the way entertainment's gonna be in 2101? Please bring me back to the 50s and annihilate Prime video","rating":1,"date":"6 January 2019","review":"I've seen quite a bunch of crap on amazon prime but this one is certainly winning the gold medal. Bad script, bad acting (the word acting in this context is even an oxymoron), bad plot, bad editing, bad filming, bad lighting, bad sound, bad music, bad continuity, bad set, bad props, bad fx, bad stunts... even at 57min length it looks like 3hrs long. I watched it to the end and am still waiting for the spot to start... it looks more like the pilot episode for some low budget scifi tv series. Hopefully, it will never go to fruition, which is probably the one and only silver lining there... The only funny note is for the French viewers: the subtitling (probably automatically generated by some google translate sleepwalking buggy algorithm and never ever humanly reviewed) is absolutely surrealistic... even a 6th grade student in English would have done a better job. The two guys who posted reviews over 1/10 (there is even a 7/10) have to be members or next of kins of the crew, can't explain it otherwise. And no, this review doesn't contain any spoiler: there is absolutely nothing to spoil, since there is absolutely no plot or coherent time line in this abysmal lack of any script.","user":"siteordo-48019","rank":[16,18]}]