[{"title":"It's hard to watch this one without becoming angry...or incredibly sad.","rating":8,"date":"8 March 2016","review":"This film is a fictionalized story of a woman caught up in the suffrage movement in Britain in the early 20th century. Carry Mulligan plays Maud Watts...a woman who slowly comes into the movement and the sacrifices she personally made as a result.<br><br>I noticed that a few of the reviews on IMDb hated the film and by the way they worded the reviews, they seemed upset that women earned the right to vote or thought women never had fight to achieve this!! Strange...very strange. Women DID have to fight and fight hard to earn their rights and the film does a very nice job of it. Why anyone would give the film a 1 or see it as some lie is just baffling...and ignorant of British history. The fictionalized life of Carry Mulligan's is essentially true of many women and the horrific event concerning Emily Davison DID occur in 1913....so why hate that the film dramatizes this?<br><br>Overall, the film is extremely compelling and very emotional to watch. Seeing women abused and mistreated is tough....and should grab your heart. Well acted and worth seeing. My only complaint is ts are that the film, at times, is a bit sterile...which is odd considering the events. And, it uses a modern device I hate--the roving camera (hold that camera still #@&amp;@#%^...it's NOT arsty to have bad camera work--particularly on closeups). Still, well worth seeing-- particularly for teens to realize how bad things were and how far we've come.","user":"MartinHafer","rank":[63,76]},{"title":"Despite its limitations, this is a finely crafted British film","rating":7,"date":"11 February 2016","review":"It can be risky critiquing a film homage to heroines of feminism, especially one with a star cast that includes Carey Mulligan, Helena Bonham Carter, Ben Whishaw and a Meryl Streep cameo. Respect for the cause, however, does not guarantee respect for the film, and this one chooses a very limited lens with which to view this episode of history. It does have high production values, narrative authenticity and sensitivity for the feminist struggle in early 20th century Britain. But it gets lost in balancing the broader sweep of history that shapes gender relations and the impact of particular individuals.<br><br>The story line is uni-linear, the atmosphere dark and claustrophobic, and much of the acting is melodramatic, with long close-ups of Mulligan's finely nuanced expressions recording her progress from an abused laundry worker to what today would be called a radicalised political terrorist. The historical lens is so myopic that you could walk away believing the vote was won by a few protesting women, the bombing of some public letterboxes and a suffragette who threw herself under the King's horse. No more strugglejob done! Of course, that is not true and the struggle continues.<br><br>Despite these limitations, it's a finely crafted British film. The fictional heroine Maude Watts is an avatar for the British working class women who risked everything, including their lives, in fighting for the vote. Men of all classes are the demons of this tale, and one of its chilling insights is how the most dangerous enemies of suffragettes were husbands. Patriarchal governments left it to ordinary menfolk to sort out their unruly women in an era where wives were legally subordinate to husbands. Maude's contempt for her treatment at work and home propels her into the swirling orbit of violent protest where \"war is the only language men listen to\". Evicted by her husband for shaming him, she is left with nothing; by law, even her son was her husband's property. During the struggles, over one thousand British women were imprisoned and treated shamefully, a fact only acknowledged in the film's closing credits. Admittedly, historical judgement is difficult to translate into cinematic language, but many films have done it better. If you are interested in the history of feminist struggle from the viewpoint of the small people who made up the bigger story you will like this film.","user":"CineMuseFilms","rank":[35,45]},{"title":"Re-Telling of a Seminal Moment in British Women's History","rating":7,"date":"6 February 2016","review":"Years ago the BBC did a series SHOULDER TO SHOULDER (1974) that told the story of the origins and development of the Women's Movement in Britain, with special attention paid to the WSPU (Women's Social and Political Union).<br><br>Sarah Gavron's film revisits the same territory as it tells the story of the gradual awakening of Maud Watts (Carey Mulligan) as she sets her marriage and family aside in favor of the Women's Movement. The crux of the action centers around the death of Emily Wilding Davison (Natalie Press) at the 1913 Derby, as she stepped out in front of the horses finishing the race and was crushed to death.<br><br>In view of the film's earnestness of purpose, it seems a shame to criticize it. However there are certain jarring elements that do stand out. Abi Morgan's screenplay seems uncertain whether to focus on the political or the familial elements. Maud's husband Sonny (Ben Whishaw) is just too placid a personality to become truly angry about his wife's decision to embrace the Suffagette cause, and the emotional scene where he decides to let his son George (Adam Michael Dodd) to for adoption is straight out of KRAMER VS. KRAMER. <br><br>Director Gavron seems too concerned with showing tight close-ups of Mulligan's face as she struggles her way through a dead-end job at the local laundry. Hence we get little sense of the slave-like existence pursued by most working-class women at that time. Meryl Streep, in the cameo of role of Emmeline Pankhurst, simply reprises her Margaret Thatcher turn in THE IRON LADY (2011).<br><br>On the other hand, the film does have its moments, especially when Maud goes to the Houses of Parliament and ends up talking about her life in front of David Lloyd George (Adrian Schiller). We get the sense of how much courage it takes to speak up in front of a group of unsympathetic middle-aged men. Helena Bonham Carter is quite surprisingly good as Edith Ellyn, especially in a sequence where she and her co- conspirators plan to blow up a private property constructed for Lloyd George's personal pleasure. The way Edith grinds up the gunpowder reveals her inherent anger at the ways in which women are treated.<br><br>The ending is also powerful, as Gavron fades out from the film into faded black-and-white films of Emily Davison's actual funeral taken in 1913. Through this technique we are made aware of the film's importance to an understanding of British social history.","user":"l_rawjalaurence","rank":[19,24]}]