[{"title":"I made it half way","rating":1,"date":"5 July 2016","review":"before I finally shut it off. There art nay words to pray pardon me how awful this movie is. <br><br>For the most part I thought it was a joke, or that something was going to happen and it would turn into a real movie eventually. I came here before renting and the summary seemed pretty decent, and the cast looks amazing! The IMDb summary is completely misleading having never heard of this movie before (and now I know why I hadn't). I'm a little upset I paid 4 bucks to rent this. That's 4 dollars and 45 minutes I can't get back. And I'm more upset about the 45 minutes. The summary NEEDS to say something about it being an attempt to modernize a Shakespeare...something - or whatever it was attempting to do. I seriously have never seen anything so horrible in my life - I find it near incomprehensible why anyone would even mildly consider producing something like this. I feel like I should cry a little bit over all the time and money wasted on this mess.","user":"aprilmay-75879","rank":[12,14]},{"title":"Reductive","rating":2,"date":"15 March 2015","review":"Michael Almereyda once again stuffs a Shakespearean play into modern day society and comes up with an incomprehensible mess. His film of \"Hamlet\" at least used as its framework an enduring masterpiece with themes as relevant to today's world as when it was written. But \"Cymbeline\" is an obscure, rarely produced oddity from Shakespeare's canon which employs unlikely plotting centered on obsolete sexual morality which has no relevance to today's world. Why Almereyda thought this archaic chestnut needed to be set in the present day is baffling.<br><br>It is up to the actors to inject some life into this dull mess and for the most part, they are not up to the task. Dakota Johnson is stunning to look at as the ill-used Imogen, but gives a one-note performance that is insufferable to watch. Ethan Hawke brings to the evil Iachimo the same dull monotone that he employed as Almereyda's Hamlet. And Penn Badgley makes the gullible Posthumus seem like a refugee from a boy band. Only Delroy Lindo and Ed Harris project the charisma necessary to make their characters interesting, although demoting Harris' Cymbeline from the King of Britain in the original text to the head of a motorcycle gang is unimaginably reductive.<br><br>Almereyda seems to have a fetish for updating Shakespearean drama into the modern world and has no issue with pummeling it into a different shape to fit his concept no matter what the Bard's original intention was while writing it. The approach worked intermittently with \"Hamlet\" but fails completely with \"Cymbeline.\" Almereyda would be well advised to seek out contemporary stories to make films of and leave Shakespeare alone.","user":"madbeast","rank":[42,58]},{"title":"Never have I seen dialogue ruin a film so much","rating":5,"date":"14 March 2015","review":"-Cymbeline (2015) movie review: -Cymbeline is a film adaptation of the work by Shakespeare of the same name. I have never read the original, and because I did not have a clue what was going on in the film, I cannot summarize the plot as usual.<br><br>-I have seen other films that updated the source materials but kept the dialogue the same, and I have not liked any of them. So to emphasize my point, I am going to attempt to write the rest of this review in that of ye olde Shakespeare.<br><br>-The story is left inarticulate upon the dialect of old, and events happen yonder with a purpose none.<br><br>-The pace is of an unhurried mountain.<br><br>-Not Ethan Hawke, Ed Harris, John Leguizamo, Anton Yelchin, Mila Jovovick, Dakota Johnson, and Penn Badgley of noble thespians could relinquish a burden laid heavy by discourse of old.<br><br>-Misperception flourished whence happenings of thine own charismas was.<br><br>-Piercing sounds penetrated mine own ears throughout by the score of said performance.<br><br>-Dost thou look nobly at the value and quake, yet none can undertake accomplishment in this piece, for the apprise of situation without the apprise of discourse bestows incomprehension throughout the all-inclusive picture. As nothing cannot tie in to nothing, Cymbeline cannot share the benefit of being so worth the time of it as slight.<br><br>-As I bid it goodbye a final time, my final talk of all can be said is of the rating, being R for a violent passage in thus.<br><br>-Hast seen Cymbeline of you? See what I mean about the dialogue? Yeah it made the entire film suck.","user":"rprince-832-6294","rank":[78,122]}]