[{"title":"Uplifting.","rating":7,"date":"18 November 2015","review":"I usually do not like romcoms, since most of the time they are very predictable, with a happy ending etc. Was this a classic romcom? Yes, it kind of was, at least in its essence, but that does not mean i did not enjoy it, it just felt somehow awkwardly right.<br><br>It really is surprisingly likable, hence most of the reviews are decent on this movie. The film has great flow, pace and it just somehow feels right, it is cringy at moments, funny, sad and thoroughly enjoyable. The greatest asset of this movie is its success of making you feel happy, energized and with a positive look at life.<br><br>Has many awkwardly cringy/funny moments, time passes by in a heartbeat, though the screen time is fairly short too. Its going to impress even those who traditionally dislike romantic comedies. Of course it is not spot on perfect, but for a short British romcom it is very successful and has fairly decent acting.","user":"datorsiers2","rank":[39,41]},{"title":"A romantic fairytale with good performances and some laughs...","rating":15,"date":"15 November 2015","review":"Unbelievable situations could often (at least in the movies) lead to great romances...like...it was meant to be...<br><br>A man and a woman, desperate to meet their other halves (although with different approaches, one closed to herself, the other one just trying his luck \"out there\") end up having a (blind) date in current London, in a situation with mixed identities (sort of).<br><br>Simon Pegg and Lake Bell have chemistry in the leading roles and give more than adequate performances.<br><br>Overall: A romantic fairytale with quirky humor and an obvious, although impossible, ending!","user":"Dr_Sagan","rank":[30,35]},{"title":"Nancy!","rating":8,"date":"2 April 2016","review":"Nancy (Lake Bell) is a 34 year old single and tired of being set up. She's on the train to her parents' anniversary party when she encounters 24 year old relentlessly optimistic Jessica (Ophelia Lovibond). Jessica is a devotee of a self-help book on her way to a blind date with divorcée Jack (Simon Pegg). Jessica leaves her book with Nancy. Unwilling to take it, Nancy races to return it back to Jessica only to be intercepted by Jack who mistakes her for Jessica. Nancy is intrigued and steals the blind date.<br><br>The premise is unusual. It comes with some potential pitfalls but the script handles each one with fun. It eventually follows the try-and-true rom-com formula but it also has a few surprises. Lake Bell is delightful even with her fake accent. Simon Pegg hits exactly the right notes at the right times. They are delightfully fun together and I love \"Nancy!\". I laughed whenever they yelled it. Each turn delivers touching fun and these two are a superb duo.","user":"SnoopyStyle","rank":[17,20]}]