[{"title":"Good Feeling Family Movie","rating":8,"date":"4 June 2014","review":"I like this movie. The idea that family is not always a \"Leave it to Beaver\" situation makes this a feel good movie with drama. Although loose in story structure, the point is made. The best thing about it is I can watch it with my children without any embarrassment. We can talk about decisions and consequences without sex, violence and more violence. It is nice seeing someone willing to put time and energy into a movie that is truly PG/PG13... in this day and age it would probably almost qualify as a G! The actors came across as people who were being watched. Insecure at times, as they should be in a real life situation. I recommend that this film be added to the family library since it can be watched multiple times and still not get boring.","user":"janisrbphoto","rank":[27,29]},{"title":"\"Stormy\" describes this good family movie","rating":6,"date":"5 March 2017","review":"Storm Rider is a family movie that has a few twists. The movie does an excellent job portraying more family conflicts and complexities than we see in the typical \"family movie.\" There's the spoiled and difficult teenage daughter, the young and innocent little boy, an almost perfect adolescent suitor, a crabby but kind professional who worries more about others than himself, a delightful and personable female, and a divorced couple who lack a conscience.<br><br>The screenplay and writing are good, but the acting is a little uneven with most of the players doing well while a couple are just poor actors. Kristy Swanson has a challenging roll as Jody Peterson who seems too good to be true, and she does a wonderful job making this character believable. Another standout is Danielle Chuchran who plays Dani Fielding, the difficult teenage female. And of course, you cannot help but love the mule, Stormy. I cannot say enough or more about Stormy without violating the \"Spoiler\" rule.<br><br>Watch this movie with your kids. It's a \"feel good\" movie, so it is somewhat predictable, but less so for younger viewers who will find the story suspenseful. There's a lot to discuss afterwards, and children of all ages will benefit from the experience. Adults will also enjoy the movie; and if you are willing to be introspective, you will benefit as well.","user":"edinadental","rank":[0,0]}]