[{"title":"Culver's treasure","rating":6,"date":"24 November 2017","review":"Filmed in the beautiful lake town of Culver, Indiana Little Savages is very fine family film. It's the kind of place that you might want to settle down in especially since the bad folks of two generations are dealt with expeditiously in the end.<br><br>Little Savages certainly has the look of a Disney Studio product with Disney veterans Adam Hicks, Kenton Duty, and Leigh-Allyn Baker in the cast. Duty is a good kid and Hicks the town bully and both are rivals for the Katherine McNamara.<br><br>McNamara and her nerdy brother Noah Lomax are visiting for the summer with their rather eccentric aunt Baker. They get involved in a treasure hunt specified by the town's late richest citizen and in the end it comes down to one of those kooky wills that you see in so many films the provisions with must be scrupulously enforced.<br><br>I liked the film it has a nice gentle pace and feel to it and the cast is a winning one. I liked Leigh-Allyn Baker when she was in Good Luck Charlie, she was a zany mom and her zaniness only increases in Little Savages. And I do like the way that young Mr. Lomax deals with bullies.<br><br>A nice family film indeed.","user":"bkoganbing","rank":[2,2]},{"title":"Hoping for More!!","rating":6,"date":"11 December 2017","review":"Bought the DVD as I saw a previous movie called Contest with one of the actors I was impressed with. I was hoping for more, but did get a huge surprise as I found out this flick was filmed in Culver, Indiana and on and around a lake (Lake Maxinkukee) that I spent many a day on during many a summer! Then I was even more hopeful, sadly it's just average, but still one I will cherish just because of my own personal memories!! Thanks Kenton Duty for leading me to this movie! Still overall has redeeming values for kids, and worthy of a look!!","user":"horizonbts-206-628336","rank":[1,2]},{"title":"Predictable","rating":13,"date":"13 February 2016","review":"For the record I am not Derren Brown. Though this movie somehow downloaded itself into my head in the first 5 minutes. It felt funny, so I then decided to watch it without wasting too much time on 4Xspeed. The dialogue less than mediocre even for children. At 16 minutes my head just made predictions about every detail, so I decided to watch it in sections. At the end I was right about it all. Boring, predictable, and not funny even once. Could have been due to the fact it's made from other movies of the same type and stuck together like a patchy rag doll. Normally when I see the word comedy, I expect to laugh. This is the type of movie I won't even use to fall asleep at night because I might wake up and see the disaster.","user":"craigzn","rank":[3,12]}]