[{"title":"To The Negative Reviews, What Else Were You Expecting?","rating":8,"date":"8 April 2016","review":"Wow, seeing some of these reviews really made me laugh. \"Generic, it's the exact same thing as if you were playing a FPS game!\" Maybe those who are saying those things saw a different trailer than me? This movie is exactly what it was promoted to be. An hour and thirty six minutes of a lot of violence, jokes, and well, shakiness. Within the first 30 minutes of the movie, many people walked out murmuring to themselves \"this is stupid, my head hurts\" and I really questioned why they even bought a ticket in the first place if watching a shaky camera hurts your head? Why did a group of middle aged women go see this, and leave shortly after? DID YOU STUMBLE UPON THE WRONG MOVIE?<br><br>Besides my little rant, I most definitely recommend this movie. I am not a major fan of FPS games, but having the entire movie filmed with Go Pro's, along with the great action made this a very fun and enjoyable movie. It doesn't take itself seriously, as it knows exactly what it is. As much as I hate when people say this, it is one of those movies where you really can turn your brain off and enjoy it.<br><br>I smiled throughout the entire movie, and though the trailers show some really cool shots from the movie, there is still plenty of fun in the movie to where you really do not get bored one bit. The park-our scenes are truly something else as well, with major respect to the stunt- men who did their job perfectly. The music choice was also something that I truly enjoyed, it fit the movie very well. The acting, while little of it, was passable and did not really strike me as \"bad.\" <br><br>If you are a person who can't stand something like the Bourne movies for their shaky cam, do not see this. If you love action movies and really want to admire great fight scenes and plenty of mayhem, go see this.<br><br>And for those saying the idea is not original, yes, movies shot in first person are not original. But for an action movie of this caliber, I would say it is an experience that is definitely worth it.","user":"Bourne07","rank":[460,562]},{"title":"TIFF 2015 -- Hardcore: Just plain fun","rating":10,"date":"13 September 2015","review":"'Hardcore' is the riveting story of a newly-made cyborg who must save his wife from evil tyrants and...wait a minute. Who cares?? The whole movie is a blast!!<br><br>Ilya Naishuller is a young director who had a very cool idea to shoot an action film from a first-person perspective using a GoPro Hero3 Black Edition camera. The proof of concept was released as \"Biting Elbows: Bad Motherf***er\". It was pitched publicly and helped to successfully crowd-fund the feature, 'Hardcore'.<br><br>It's better to keep this short and sweet: the film is extraordinarily violent; not for the squeamish. It has plenty of action, free-running, stunts, and plenty of room for comedic elements. Even the opening titles give you a taste of what's to come!<br><br>Sharlto Copley (District 9, and other Neill Blomkamp projects) plays the main POV's assistant throughout the film. Copley definitely gives a range of character performances and is quality. Wearing many hats, he guides you along as if you were needing assistance in a video game, which, by the way, this film makes several references to. In particular, the Chernobyl level in Call of Duty 4 with Capt. MacMillian. Even the opening scenes are reminiscent of Half-Life, and a lot of the free-running scenes are inspired by Mirror's Edge.<br><br>For those who are wondering, no. You likely won't get dizzy watching a 90-minute action film from an FP perspective. Well, maybe you shouldn't sit in the front row. Otherwise, you will have a blast.<br><br>'Hardcore' is an all-around fun time. Just be okay with the violence. It's only 90 minutes of your time that you'll likely want to experience over and over again. Or, you'll just want to plug in a play a few games. <br><br>Either way, it's bloody fun!","user":"Brap-2","rank":[328,439]},{"title":"First Person Shooter - The Movie","rating":10,"date":"13 September 2015","review":"* Spoiler Free *<br><br>Just saw this at TIFF 2015 Midnight Madness. Judging by the constant applause and laughter throughout, the audience LOVED it. I thought it was truly INCREDIBLE and genuinely new... a landmark film. Hopefully that will be recognized without hindsight. I believe Hardcore has the chance to be Star Wars for this generation... or perhaps a Terminator or a Reservoir Dogs. I'm writing this to help ensure that happens. Context: I also thought Crank was great.<br><br>The ENTIRE movie takes place in FIRST PERSON point of view (POV). ALL 90 MINUTES. It never gets old and the POV remains a strength throughout. I never got motion sickness (and the movie moves fast - incredibly fast). After the movie, the director mentioned the Vimeo short would be unwatchably choppy on the big screen. 2 engineers spent 2 months creating a special rig with 2 magnetically stabilized GoPros to shoot the film. This new rig is the reason why the audience didn't get motion sickness.<br><br>I've never seen action like this. It's not just regular action scenes filmed in first person. It's superheroic parkour, fantastical fights, and video game gunplay all presented in first person. Seen from a regular angle, the action would likely be too cartoonish. The POV helps ground everything, making it more believable. Added Bonus: During many scenes you'll wonder how the POV camerman didn't get killed.<br><br>Hardcore is incredibly violent, but rarely nasty. People who play modern FPS's will not bat an eye, others will be shocked and appalled. Expect a lot of controversy when the older crowd expresses grave concern about this film, while the younger crowd rallies behind it. Expect marketing to exploit this generation gap.<br><br>Action aside, the movie has an unexpected sense of humour. Some driven by situations, some driven by characters, some thanks to the POV. There's not a lot, but what is there is gold - and a relief during all that action.<br><br>The main character, despite never appearing, is able to communicate a personality. I believe FPSs will steal the ideas presented here. The circle is complete.<br><br>Which brings me to Jimmy (Sharlto Copley)... Can't say much but he's easily as compelling as the action. His interactions with our hero (the POV) are not straightforward, and always intriguing. Somehow they form a bond, which winds up unexpectedly touching. Before the movie Sharlto said it was the craziest, hardest role he's ever done and it's easy to see why.<br><br>The bad? The overall plot is good but not great. The bad guy, beyond being powerful and evil, has less character than the POV. Despite some attempts, women are relegated to lesser roles. (I believe the good far FAR outweighs the bad)<br><br>Russian Hollywood has created the best first person shooter ever made. When POV becomes the new bullet time, you can thank Hardcore.","user":"jimmcginley","rank":[283,403]}]