[{"title":"Equally as bad (good) as the original plus cameos","rating":5,"date":"25 September 2014","review":"Yup \"Shark happens\" This is definite junk food for the brain in a so bad it's awesome kind of way. The ultimate in guilty pleasure, Sharknado 2 is equally as bad (good) as the original although you can tell they had a bigger budget for the sequel because the special effects are better and there are a ton of cameos.<br><br>Ian Ziering, I have to give it to him here, he really gives his all and was fun as hell to watch running around New York saving the day, kicking shark ass with his chainsaw.<br><br>Lots of laughs, a good time, exactly what I was expecting from a made for TV B-movie. The opening scene with Robert Hays (Airplane) is awesome, it does drag a bit at times but filled with enough blood and epic cheese moments to make it through. Tara Reid is still god awful. The GMA guys were surprisingly hilarious. 7/30/14","user":"juneebuggy","rank":[25,29]},{"title":"From a shark's belly to the Big Apple.","rating":7,"date":"8 August 2014","review":"It's another sharknado! Remember the highlight of Fin Shepard(Ian Ziering)using a chainsaw to rip his way out of a shark's belly in Los Angeles? Nothing I can remember is as ridiculous or cheesy this time around. Fin and his ex-wife April(Tara Reid) are New York bound, when the plane is attacked by swirling and diving sharks inside some bad weather. Fin, of course, is up to his hero thing again landing what is left of the plane. Now his chore will be to save the Big Apple from two sharknados ready to converge on Manhattan. Instead of the reunion with his wife and her family, Fin will be busy with his heroics...this time with the help of an old flame named Skye(Vivica A. Fox).<br><br>Iconic NYC attractions will be attacked by torpedo-like sharks; as they prove to be able to build up a good body count just by landing on their victims. Still, plenty of chomping as the blood and guts fly. And some entertaining methods of shark killing as you lose count of all the cameos featured: Kelly Osbourne, Robert Hays, Richard Kind, Al Roker, Matt Lauer, Michael Strahan, Billy Ray Cyrus and Kelly Ripa. Judd Hirsch plays a very helpful taxi driver and the Mayor of NYC is played by Robert Klein. Might as well line up writer Thunder Levin and director Anthony C. Ferrante for \"atta boy\" awards. I just don't know how much pride to expect for confessing to watching this. I do still feel a bit cheated by not getting to hear Mack The Knife by Bobby Darin.","user":"michaelRokeefe","rank":[11,13]},{"title":"The Whimsical Adventure We All Deserved.","rating":10,"date":"30 July 2014","review":"After viewing the tour DE force that was the original Sharknado (2013), most viewers were left in awe, and with a roaring hunger to enter this magical world again. Thankfully these brave viewers did not have to suffer for long as the Man Wizard, Anthony C. Ferrante, quickly got to work on his next masterpiece, Sharknado 2. Naturally Sharknado 2 was given the title \"The Second One\". What else would you call it. He quickly enlisted the A List of Tara Reid, and Ian Zering. Both probably swamped with scripts from the likes of the Coen Brothers and Tarantino said, \"We need to revisit this story\". And with that the world won that day. It is hard to think that a movie can end wars, hunger, famine, rape, but this movie can. I can imagine that after the national viewing tonight that the war raging in Isreal will likely sease and a wave of global peace and harmony will overtake the gentle minds of a soft warm generation. This is the movie we asked for, this is the movie the world deserved.","user":"ChrisMichael81","rank":[64,101]}]