[{"title":"Refuge to riches.","rating":9,"date":"22 September 2018","review":"'Matangi / Maya / M.I.A.' is fascinating viewing, one of the most gripping, touching and chilling musical biography/documentaries of recent years, and certainly one of the most important pieces of filmmaking ever made about Sri Lanka or even just modern politics in the ugly, self-defeating era of Brexit.<br><br>Considering that M.I.A.'s original choice of career was filmmaking, the film features a priceless wealth of intimate camcorder footage from throughout her life, from her early years as a very young pop-loving refugee in London, to befriending Justine Frischmann of Elastica in the mid-90s and becoming an unlikely Britpop groupie, to her adult return to Sri Lanka and emotional reunion with her war-maimed grandmother, to her wide-eyed early years of success, performing at Coachella and Lollapalooza, all the way up to her 'disgraced' Super Bowl performance and the ludicrous aftermath.<br><br>Just like the star of the show, this film is very political, very unflinching; a lazy conclusion would be to consider the film more about Maya and Sri Lanka rather than her music, but by showing us exactly where she came from, what she sings about and what motivates her, her music is actually done more of a service than endless talking heads describing her albums and songs would have. And when concert footage is shown it has all the more impact, it is never used as filler like in most music biography documentaries (which are usually really closer to tour videos with some talking inbetween).<br><br>Ultimately, 'Matangi / Maya / M.I.A.' ends up being about more than just music, more than M.I.A. herself, even: the film is really about corruption, how we treat other human beings, how we view refugees and other races and the plight of people suffering bloody civil war, which should be of interest to all decent human beings.<br><br>Much misunderstood, especially in America, this documentary reveals M.I.A.'s reality, and it seems a hell of a lot more believable and relatable than either America's Super Bowl morality or Britain's 'taking back control' Brexit.<br><br>The footage of M.I.A.'s attempts to talk about the genocide happening in Sri Lanka on an American talk show being shut down with a dismissive, arrogant joke about cockney accents has to be seen to be believed, the evil is quite palpable.","user":"sunheadbowed","rank":[23,27]},{"title":"Matangi/Maya/M.I.A. powerfully presents an artist's authenticity to convey a message.","rating":7,"date":"24 December 2018","review":"Having only listened to a handful of her songs, M.I.A. was relatively unknown to me both as an artist and a person. Now that I've seen this informative documentary, she has earned my utmost respect for the work she produces and as an individual. A documentary chronicling her early childhood in guerrilla warfare Sri Lanka (Matangi), her immigration to London where she becomes inquisitive regarding the Tamil rebellion (Maya) and her rapid rise to fame as an international pop star where she utilises the medium to convey the brutality of the civil war to the masses (M.I.A.). Fame, fortune and popularity were ideals that never motivated Matangi. Through first-hand experience, she had encountered the very worst of the Sri Lankan civil war. The mass executions. Child deaths. Rape and misogyny. But naturally she felt as if no one was actively attempting to stop the war. No news coverage whatsoever. As a result of this, she utilised her natural rhythmic talents to convey the negative connotations of the war through her music. She never wanted to make a hit, but only to share her views. What this documentary does exceedingly well is make Matangi a relatable individual. Her humanity shines through, and the recordings of her family enhance this perspective. The rapid progression into her musical career coexists with her right to support the Tamil Tigers, and the two are balanced well. Loveridge does encounter a few focussing issues as he is unable to decide which topic takes priority, but for the most part integrates both aspects of her life efficiently. The second half tackles the various media outlets singling her out as a controversial artist, and that is when the film truly finds its pace. The several narrative time jumps does make her life seem disconnected, and does skew the pacing frequently. Her music makes a remarkable impression, however this documentary fails to do that. Whilst that may sound unfair, it was culturally informative and engaging despite the cumbersome narrative stumbles.","user":"TheMovieDiorama","rank":[9,11]},{"title":"Grateful","rating":10,"date":"15 October 2018","review":"I appreciate this movie, and I appreciate MIA. She has been a pillar of humanity and intelligence, and I am grateful her ability to view reality and make an art of it, assembling the pieces based on pattern recognition. There is so much violence, and each of us participates in de-humanizing each other. I hope that this movie can expose some of our violent tendencies.","user":"emale-14932","rank":[10,15]}]