[{"title":"Watch it for the acting.","rating":8,"date":"7 October 2015","review":"At times this is an uncomfortable watch, to say it's gritty is an understatement. The story focuses on school leaver Goob and his sudden transformation into adulthood. Set in a rather downtrodden bit of Norfolk it shows how bleak life is for him. Goob's stepfather Gene makes his life hell, but things are turned upside down for Goob when he meets young Eva and falls for her.<br><br>Truly excellent performances, the young man himself Liam Walpole is fantastic as the lead, and I will be stunned if further roles don't follow for him. As is so often the case though, my attention is grabbed by Sean Harris, i'm not sure what it is this guy has got, but he's got something, he actually manages to scare me somehow. When he's angry he means it. Sienna Guillory manages to show us how versatile she is, one minute she does historical drama, and the next she's like a contestant on the Jeremy Kyle show, she is a superb actress.<br><br>I've read of people comparing this to Tyrannosaur, I can see the resemblance but I think that hit much harder then this. <br><br>It's an excellent film, all about the acting, no gimmicks, no special effects, no gun scenes, all about the performances. 8/10","user":"Sleepin_Dragon","rank":[17,17]},{"title":"Guy Myhill's coming of age film is edgy and impressive","rating":8,"date":"27 May 2015","review":"Director Guy Myhill's coming of age film is edgy and impressive, with an eye-catching turn by Liam Walpole matching Simon Tindall's eye- catching photography of a depressing, down-at-heel part of Norfolk. Myhill's feature debut stars Walpole as 16 year-old Goob Taylor, who returns home to his mother (Sienna Guillory) for the summer in rural Norfolk where he grew up. The material in many ways is pretty familiar, but Myhill brings it up entirely fresh, as though this is the first time this kind of story has ever been told, making it feel unique. It's just 80 minutes, but it's got all the story you need packed in there. http://derekwinnert.com/the-goob-2014-movie-review/","user":"derekwinnert","rank":[18,26]},{"title":"Well worth it.","rating":9,"date":"22 February 2017","review":"Two words - spare and edgy. I love catching a film I know nothing about and enjoying it so much that bedtime gets later! The Goob is such a beast! The story is as old as time; son don't get on with evil new step dad, but it done so well, so low key that it is fresh. Cinematographer Simon Tindall achieves the impossible; making Norfolk look dreamily beautiful, harsh, ethereal and always with an undercurrent of menace. Director Guy Myhill does a great job - he takes his time but builds up the atmosphere, the story and the tension with skill and care. There is real romance here, and the many different ways of searching for it. There are believable comic interludes and there is no padding. Lead Liam Walpole is hypnotic and totally convincing, even when totally still! He looked spookily like Richard Ashcroft live on stage at Glasto!","user":"Kurt_Bludgeon","rank":[6,7]}]