[{"title":"An insult to the original","rating":1,"date":"6 September 2016","review":"I knew this movie was going to be bad, I knew that it was going to be awful but I didn't expect that it was going to be the trash that it is. One of the worst turds I've ever watched. <br><br>The film gets the premise of the original film but changing the narrative structure and adding lame new characters and subplots. There is a police subplot and a love story that doesn't even fit in the rest of this disaster...<br><br>The disastrous editing doesn't help neither, full of abrupt cuts and chopping editing that lacks of emotion of any kind of epic, in fact the training montages are awfully bad and the soundtrack which was one of the biggest virtues of the original film ,here is just horrendous.<br><br>Alan Moussi is a guy who is very athletic and has good Martial Arts skills but he has zero charisma and even less screen presence and besides that he is a terrible actor .<br><br>Dave Batista's Tong Po is just a muscle mountain with eyes that doesn't even intimidate and without any kind of depth in his character, he is just there smiling, walking and fighting , nothing else.<br><br>The girl who plays the protagonist love affair of the film I still don't even know what the she was doing in the movie.<br><br>The only reason why Gina Carano is making movies nowadays is because she was a MMA star , and she doesn't fight once in the whole movie , why they hired her then? .<br><br>GSP should keep away from cinema, he is one of the greatest fighters in MMA history but as an actor he is just awful ( He says his famous word \"I'm not impressed by your performance \" in the film, MMA fans will know what I mean :P <br><br>Jean Claude Van Damme (which is the best of the movie) have some good fight scenes ,overshadowing Moussi by the way , but his performance is nothing special neither, he don't even look to be taking serious the role and he just seem to be there to cash his check and have some fun and. I don't understand neither why they dubbed his voice in many scenes and his fight with GSP wasn't bad but it could have been better...<br><br>There are so many action sequences but are just decent , nothing really worth to be mention.<br><br>MMA legends as Cain Velasquez and Fabricio Werdum also appears in the film, but they are wasted, the director didn't know how to take advantage of their skills as fighters, Cain and Vandamme have a fight but is awful...<br><br>The final fight of the movie is long and boring , it lacks of any kind of thrill or emotion, and is basically a copy of the fight of the original film but lacking of the epic and the magic of that fight.<br><br>The movie has no personality and the only reason that was made is to cash on the name of a martial arts classic , Van Damme wasn't even the first choice to play the role of the master and he was only hired because they didn't have anyone to play the role.<br><br>I liked the cameo of Michel Quissi but I didn't enjoy the post credits scene.<br><br>The worst thing about this is that they are making a sequel now with people as Ronaldinho in the cast :( <br><br>The only positive thing I can say about the movie is that it makes you realize how great the original film is. it was a production much cheaper than this but it has become in an inspirational classic of martial arts cinema that has been inspired young kids to train for over 30 years.<br><br>One of the biggest turds ever made, let's move on and forget this trash was never made, the bastard sequels with Sasha Mitchel are even better than this and those movies are not good at all...","user":"athena-no-sainto","rank":[51,67]},{"title":"Lame, watered down reboot of a martial arts classic","rating":2,"date":"22 January 2017","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning <br><br>In this remake of the original Kickboxer movie, Kurt Sloane (Alain Moussi) tries to convince his kickboxing champion brother Eric (Darren Shahlavi) not to travel to the Far East to fight heaving warrior Tong Po (Dave Bautista) after getting a bad vibe. When Po cripples Eric, Kurt vows revenge, but after an attempt on Po's life goes wrong, he is left to turn to the unorthodox Master Durand (Jean Claude Van Damme) for the training he needs to illuminate Po in the ring, where his mystique will be broken forever.<br><br>Of all the franchises that are getting resurrected for profit, JCVD's cult martial arts classic Kickboxer might have been one of the least likely, but alas one seems to have been made, with the man himself reappearing in a supporting role, in a touch of irony now as the trainer with a new star as the aspiring young protégé. It hardly set the box office alight, and disappeared from it's limited cinema run at the speed of light. Despite being billed more as a sequel, it's actually a remake, and it's yet another of the soulless, sanitised, politically correct new reboots that sticks two fingers in the face of the no holds barred, take no prisoners 80s original.<br><br>Despite the musclebound, well honed, martial arts stars on display, instead of our moneysworth, what we are given is a series of tepid, watered down fight sequences, with a boring, unengaging story and a gormless looking lead character who looks too much like some English stand up comedian. As for VD himself, he puts on the usual drawn, grey act he's been doing in all his films lately, without any of the humour of dash of Mr. Zen from the original (not to mention the inexplicable dubbing of his voice?!?). The whole thing is like eating a bun without the burger, like the original all over again, but completely flat and without any impact.<br><br>You can't help but feel sorry for this generation of film goers, who seem to be getting served the processed meat of the prime ribs we were offered. *","user":"davideo-2","rank":[13,15]},{"title":"Total and utter garbage","rating":2,"date":"4 October 2016","review":"The original Kickboxer is one of the best classical fighting movies of all time, this on the other hand is a disgrace. I was really looking forward to seeing this, with the likes of Van Damme and Dave Batista.<br><br>The film starts out actually very well, with some good fight scenes, however as the film progresses, it becomes a complete mess. With dreadful dialogue. There were many scenes, mainly which included any romance, were poorly acted, written and executed. They were unbearably cheesy. The directing in this movie is also bad, with a lot of over the top scenes. One of the worst parts of this movie, is by far the fight scene which involved elephants. Not only was the CGI on them the worst in history of a film released after 2000, but the scene seemed forced and unnecessary.<br><br>Like most martial arts film, this film sufferers from, good looks. They cast the most attractive actor/actress they can find, who can't act worth a damn, and throw them into a film. The original film had great characters, these are cardboard cutouts.<br><br>There are only two things this film has going for it, one of them in the cinematography. Mateo Londono the person behind this, is way out of this film's league, his shots are beautiful, with some stunning lighting effects and unique angles.<br><br>The other is obviously Van Damme, he is very good here, maybe a little too good. Van has never been the best actor, but he outshines everyone here, which says something. However his character was not that great. In the original, the Master was a quiet, well mannered, wise and powerful teacher, Van Damme he is none of those. Yes he has some kickass fight scenes, but when he is mentoring, he has none of the wisdom the previous one had.<br><br>This film is gunk, and I would suggest no person to watch this, unless you are drunk and out of your 'Damme' mind. It is a acted, written and executed mess, with dreadful dialogue, poor characters, awful editing and horrific CGI.<br><br>2.1/10","user":"Dannyboi94","rank":[20,29]}]