[{"title":"Utterly Damning.","rating":10,"date":"18 July 2013","review":"I had heard a few weeks ago that a number of investigators of the Flight 800 disaster had come out publicly about their \"reservations\" about the official conclusions of the NTSB investigation. I did not, however, realize that there was a documentary that had been made, detailing the substance of those \"reservations\". Serendipity, and perhaps Fate, led me to be searching my DVR for something to watch at 3 am, whereupon I chanced to see this title. Hmmmm...<br><br>*** Spoiler Alert? *** This documentary is unique, as far as I know, in its inclusion of high-level technical officials involved in an actual investigation, giving very specific details (technical and otherwise) of a cover-up as it happened. For this alone is this film compelling in the extreme.<br><br>In addition to this, the broad cross-section of eyewitness accounts, technical data, and media footage demonstrates convincingly that not only did Flight 800 *not* explode due to a center wing tank anomaly, but that 3 (yes, *three*) different plumes/flares/etc. were witnessed by multiple (i.e. **many**) witnesses interacting with the doomed airliner, eyewitness accounts which were excluded from the NTSB investigation, an apparently unique circumstance, according to the seasoned investigators. Also, the investigators' assertions of very specific pieces of evidence and analyses which simply \"disappeared\" from or were plainly modified at the closed investigation hangar are greatly disturbing. Finally, the skew of the media coverage of the event and investigation relative to the asserted facts is impossible to discount as merely \"reportage of the story\".<br><br>The final and most explosive (pun intended) evidence in the sickening array of exposed lies is the radar return immediately after the explosion of the plane showing fragments at a distance which are consistent *only* with a velocity of about Mach 4 (~3000 mi/h), a velocity which could not be reached by anything other than a rocket or a high-explosive detonation.<br><br>In a larger context, this unique exposition of official skullduggery, malfeasance, and frankly, Evil, should hopefully shake the cobwebs loose from a new contingent of the un-awake sheeple enough to begin to make them question *other* as-yet-unsatisfactorily-explained \"disasters\". Such as World Trade Center Building 7.","user":"d00gie_B","rank":[39,49]},{"title":"Just another crime in a long list of crimes by our government","rating":9,"date":"5 November 2013","review":"This documentary on the TWA 800 air disaster provides more than enough evidence to cast doubt on the official investigation and the ludicrous explanation that was made up out of thin air to explain why this fully loaded airliner ended up in the Atlantic Ocean.<br><br>Anyone who has studied the TWA 800 event already knows that the official conclusion is completely absurd. Apparently we're to believe that a faulty wire caused the central fuel tank to explode. Yes, the FBI, CIA, and much of our government thinks the average citizen is actually dumb enough to accept this ridiculously implausible and unsubstantiated conclusion. Unfortunately much of the population accepted it without question and moved on with their lives, unaware of the treasonous and deceitful cover- up that was conducted by persons within the FBI, CIA, and NTSB. <br><br>Missiles brought that plane down. The citizens demand to know why!","user":"jackwolf","rank":[25,34]},{"title":"This research librarian is convinced","rating":10,"date":"13 November 2013","review":"I'm a research librarian who teaches information literacy to college students. Information literacy is essentially how to find, evaluate, and use credible information. There is such an onslaught of bogus information out there that it's sometimes hard to know what's actually true. One way is to look at primary source documents such as video, photographs, interviews and original research conducted at the time of events. Those involved with this documentary went to great lengths through such means as Freedom of Information Act lawsuits, to gather together primary source documents that, when viewed together with expert testimony from those directly involved in the original investigation, create a much more plausible scenario than the official findings released by the FBI and NTSB. <br><br>I would be highly suspicious of one-star reviews stating things like \"Opinions predominate, facts are scarce.\" I'm someone trained to know the difference and I can say quite confidently that this is not a \"conspiracy film\" based on innuendo and the convictions of those who hate and distrust the Federal Government. This is a well-researched documentary that asks us to consider an alternative conclusion to the one presented by the FBI and NTSB...a conclusion based on the actual evidence. I for one am convinced and I hope this film will generate enough public outcry to force the NTSB and FBI to reopen the investigation or at the very least, be more forthcoming about their actual findings.","user":"happy_in_side","rank":[22,31]}]