[{"title":"Why Did I Like This So Much?!","rating":9,"date":"5 January 2014","review":"Bad Grandpa is a film I certainly wasn't anticipating. Unlike a lot of people my age, I don't support Jackass, or enjoy any of their films. They just seem a little too over the top for my liking. But despite this, surprisingly, I adored Bad Grandpa! <br><br>I'm going to keep this short and to the point. Johnny Knoxville is fantastic as Irving, an incredibly raunchy and hilarious 86 year old man. Thrown into real life prank situations, he steals the show, pranking people in some bizarre and incredible ways that I just couldn't stop laughing at! His grandson within the film, Billy, played by Jackson Nicoll, is awesome as well, managing to create some fantastic scenarios which will leave you in stitches. I'm really surprised that I didn't mind this child actor, as I normally have a problem against their type. Nicoll though, killed it as Billy. <br><br>Despite the fact that a lot of these jokes presented are incredibly over the top, I really enjoyed the comedy here. It had me laughing the majority of the way through, and I honestly couldn't believe what they were doing in public. Jackass knows how to make pranks work, and here is easily their best work. <br><br>I didn't have expectations for Bad Grandpa; none good at least. I was pleasantly surprised though! Whilst not nearly the best comedy released in 2013, this is surely the funniest. If you love pranks, or Jackass, or both, you'll adore this film!<br><br>8.6/10","user":"Callum_Hofler","rank":[52,61]},{"title":"Go with it and you'll have a blast","rating":8,"date":"21 November 2013","review":"Despite all its low brow humor and childish gags Bad Grandpa is by far one of the funniest and seriously ingenious comedies of the year and when watched with the right mindset will be a thoroughly enjoyable 90 minutes at the movies.<br><br>Played by a worryingly good Johnny Knoxville Irving Zisman is the titular bad grandpa, a man set upon every women he sees and a man that finds himself in many a hilarious situation. Whether Irving is at a bingo center, diner or postal office Johnny Knoxville inhabits him wholly and completely that one forgets we are watching a pretend old man. It must be said also that some of the film's most quiet and funny moments come from Knoxville merely waltzing about town in full old man get up, waving and traipsing about his business as passer byes are none the wiser. Knoxville's strong inhabitation of Irving however would have been wasted if his grandson weren't such a mischievous delight as well.<br><br>As played by child actor Jackson Nicholl Irving's grandson Billy is the perfect foil for the antics the film sets up and Nicholl displays a rare ability for a child to think on a whim and more than once he will have you laughing hysterically with his verbal comebacks or physical comedy (A highlight being the trailer centerpiece and films ace up the sleeve beauty pageant routine). It's good to see Jackass stalwart and co-creator Jeff Tremaine handle both the situations and actors so well and one senses that this creation will set forward more projects under the similar vein of real life candid cameras mixed with a anchoring plot line.<br><br>Obviously not for everyone and more likely to offended than not Bad Grandpa is still a must see for all comedy fans and even if Jackass is not your usual cup of lime juice Bad Grandpa offers up a welcome deviation from the usual Jackass presentations and a showpiece for just how funny Knoxville is when given the right material.<br><br>4 knocked over penguins out of 5 <br><br>For more movie reviews and opinions head over to - <br><br>www.jordanandeddie.wordpress.com","user":"eddie_baggins","rank":[63,77]},{"title":"Lewd, crude, tasteless - and incredibly fun.","rating":7,"date":"16 January 2014","review":"In a world overrun by forgettable, banal reality television, Jackass has distinguished itself as a franchise with unexpected staying power. Who would have thought that a television show about pulling pranks on unsuspecting members of the public would go on to dominate the silver screen as well? That's precisely what Johnny Knoxville and his compatriots have done, however. Bad Grandpa marks the Jackass crew's fourth foray into the realm of feature films. The movie is itself more ambitious than its predecessors, betting that one character - an apparently doddering 86-year-old man - can carry an actual plot and an enormous arsenal of pranks. Surprisingly, it's a gamble that pays off: Bad Grandpa is frequently as funny as it is in bad taste.<br><br>The ostensible plot of it all goes something like this: Irving Zisman (Knoxville) is saddled with his grandson Billy (Jackson Nicoll) when his flaky daughter is sent to prison and his wife Ellie (Catherine Keener - yes, really!) passes away. Resolving to palm his grandson off to his ne'er-do-well son-in-law, Irving embarks on a road trip across America - an adventure that takes them from strip club to diner, from funeral to beauty pageant, and everything in between. Along the way, they meet people from all walks of life: most of them unsuspecting, several of them kind, all of them pretty good sports.<br><br>Much of the thrill of watching Bad Grandpa comes from knowing that it is a hidden-camera comedy - one that draws its greatest laughs and amusement from people who have no clue that Irving isn't actually a senior citizen. Many of the pranks border on the tasteless (Irving gets a crucial body part caught in a vending machine, grandpa and grandson engage in a flatulence contest in a diner with disastrous results), but the horrified looks on the faces of innocent passers-by make it all work. There are even some moments of inspired comic genius: chiefly, the set-pieces that take place in a strip club and at a beauty pageant. (To spoil you any further, dear reader, would be criminal.) <br><br>It takes a pair of seasoned performers not to crack and give the game away. Knoxville, of course, has years of experience and bodily injury under his belt, and he is astonishingly good at playing a bawdy old man with very few social (and some might say moral) filters. The great surprise is Nicoll, a child with the most perfectly deadpan of faces - he's hilariously convincing whether he's asking a complete stranger to adopt him or re-enacting a scenario reminiscent of Abigail Breslin's wildly inappropriate grind-bump dance in Little Miss Sunshine.<br><br>This is - evidently - very far from great cinema, even though director Jeff Tremaine does actually manage to sneak a little more sentiment and plot into the film than you might expect. But great cinema does not always equate into a fun, brainless night out at the cinema - which Bad Grandpa, if you set your expectations as low as they can go, will almost indubitably provide you.","user":"shawneofthedead","rank":[20,23]}]