[{"title":"Touching","rating":7,"date":"17 August 2017","review":"If you've read the synopsis, you pretty much know the story. There aren't any exciting twists. The acting is solid by not exciting. (Actually a pretty decent job for the kid actors.) After seeing two families, two parents, struggle with their loss, there is also some light humor.<br><br>That doesn't mean it isn't worth watching if you want to see a story about 7 people who together turn mourning into dancing.","user":"Jackbv123","rank":[8,8]},{"title":"Love this movie!","rating":9,"date":"4 January 2020","review":"I wish they'd air it more. Watching it tonight - haven't seen it for a couple of years. It's a good family movie. It studies how people can help each other in sad circumstances. How kiss can help each other heal. The camaraderie...<br><br>In circumstances that involve death, people come together and find some peace - while still remembering the ones gone.<br><br>Such a touching movie...","user":"toncincin","rank":[5,5]},{"title":"Sweet Hallmark film worth watching, 7 Stars from me!","rating":7,"date":"15 May 2017","review":"I've seen this movie twice and I loved it both times. It's Lacey Chabert who I adore on the Hallmark Channels for sure. She's very cute and charming. This reminded me of a movie similar to a TV Series I grew up watching, called 'The Brady Bunch', minus one child. I even said that the first time I watched this movie and prior to hearing Lacey say it on this movie. It was like Deja Vu. I love the kid dynamic in this movie though because all the kids seem to adjust and adapt very well to a coming together. There is even a very cool song that plays while they are either getting ready to eat dinner or cleaning up after the dinner. I'll have to look up the song that played. It was great teamwork and that's what we should all strive for in our lives, working together on a common goal. But seriously, watch this movie and remember The Brady Bunch.","user":"huggibear","rank":[4,4]}]