[{"title":"Genuinely entertaining, don't believe the low ratings","rating":8,"date":"2 January 2019","review":"A fresh and fairly funny movie with decent animation and actual imagination. Maybe that's why sheeple today can't appreciate it? Because it doesn't fit into the mundane cookie-cutter one way to see everything view that's popular these days and that scares and befuddles them? LOL... I don't know, that's my best guess.<br><br>I'm pretty sure if you give it a watch you'll enjoy it or at least not dislike it. I honestly can't imagine how anyone would think this is a bad movie.","user":"fallguy_jack","rank":[24,43]},{"title":"Great animation and voice-acting, everything else was plain awful","rating":6,"date":"12 January 2019","review":"A mediocre plot and script highlighted by several inconsistencies throughout the movie, some parts were poorly explained as well.<br><br>I feel as if the main power of the main character seems to be a rip-off of a certain Marvel character, and the villains as well. To be frank though , it is not about the powers that made this movie horrible, it was the presentation, and the characters. Especially the main character at the beginning, and yeah, the ending climax was so strange as well.<br><br>Anyways, if you exclude all the various parts of the movie, the voice acting is actually pretty spectecular, not to mention the animation, which is so smooth.<br><br>Overall, a movie with much wasted potential.","user":"yeolit","rank":[6,8]},{"title":"Political correctness dictates henchmen want to be heroes, too","rating":3,"date":"3 January 2019","review":"The \"interesting henchmen\" idea has been tackled by the successful \"Despicable Me\" movies - what could go wrong with a revival? Well, apparently a lot.<br><br>While \"Minions\" gave lovable identities to the henchmen, in \"Henchmen\" they're back to being anonymous and disposable. Except the handful of storyline henchmen, which are so nauseating helpful you'll keep wishing for more screen time of the arrogant superheroes.<br><br>After just 20 passable minutes (the original was a short) they run out of ideas and start ripping off one of the most memorable scenes from \"Kung Fu Panda\". It might be a merciful clue to leave the theatre. From there, it's only downhill with a betrayal of every possible promising idea. Including the basic premise that the bad guys always give it their best and should win for once - but this villain is just bland and erratic.<br><br>The director Adam Wood has worked his way up in the animation departments of various Pixar gems. This is the first movie he wrote and directed, and it proves he should have stuck with his old job. It's unbelievable he didn't remember how \"Toy Story\" featured an interesting oddball team, or how \"Monsters, Inc\" excelled with the charming \"the bad guys are the good guys\" story.<br><br>Look at the trailer to check out the animation style, then give it a miss.","user":"big_brother_1984","rank":[10,19]}]