[{"title":"What happened to DC?","rating":21,"date":"21 February 2014","review":"I wasn't very pleased after watching this. It seems like the superheroes were all being degraded. Look at Wonder Woman in the movie, they showed her as some spoiled girl who only wanted to fight and flash her sword around. That's not how I recall her. She was someone who was powerful but not in the \"flash my weapons to get my way\" type. It was just sad to see some of my favourite DC heroes be reduced to calling each other poor names and taking things as a joke...except for Batman, who was the only one they really kept close to what his character is typically like. It bothered me that they made almost all of them cocky. I don't think DC has as much pride in their characters anymore after watching this. I wished they hadn't changed the attitudes of some of them because it didn't help at all. J/L:Crisis on Two Earths and J/L:Doom were both better because they had more care for the heroes and the people and they hardly made fun of the Justice League.","user":"spider_pig113","rank":[45,60]},{"title":"I'm no expert, but I really liked it. Darkseid is awesome.","rating":8,"date":"7 January 2016","review":"I'm new to animated feature length superhero movies, so I'm no expert. But I do know a little something about being entertained, and I was with this one. I like the character design, and the animation is good. <br><br>What really stood out to me in this one, is Darkseid. Because man he is scary as hell. Just floating along there with his hands behind his back, impossible to beat. He actually kind of scared me. And I'm a huge horror movie buff! I guess the fact that he seems so unbeatable is what makes him scary. Good stuff.<br><br>I'm no reader of comic books, and I haven't watched that many of these animated superhero movies yes, but so far this is one of my favorites.","user":"Finfrosk86","rank":[15,18]},{"title":"Grade: C+ - a weak effort by DC Animation","rating":6,"date":"4 February 2014","review":"Grade: C+ <br><br>This was a weak effort by DC Animation (DCA), especially following The Flashpoint Paradox, Doom and Crisis on Two Earths. It was let down critically in several areas, namely in Voice acting, Characterization and Plot. <br><br>Voice acting &amp; Characterization: <br><br>Superman - Alan Tudyk is miscast in this. He is unable to effectively personify the hero that Superman is and comes off a bit of douchebag in certain moments. The costume he wears in this is not classic...and IMHO it does not look great. They could have updated it without losing the iconic look too much (e.g. Man of Steel). <br><br>Supes himself comes off as having a God-complex in this film. He does not seem the noble, self-sacrificing, protect the innocent type of hero we've all come to know and love. He also seems mildly de-powered, though he is easily the most physically supreme of the lot. As usual he disappears half-way through the film and needing Bats to save his ass. <br><br>Batman - Jason O'Mara did an OK job with gravitas. Strangely he sounded a bit of a mix between Kevin Conroy and David Hayter (Metal Gear series) - which is a good thing. Bats is well characterized in this film and comes across as the investigative lone-wolf type hero. <br><br>WW - Michelle Monaghan admirably captured WW quite well. The character was also kick-ass (with a nice ass!) and very warrior-like. Well done! <br><br>Flash - Chris Gorham did Flash well. He was also portrayed well being slightly more mature in attitude without lacking the wisecracks. <br><br>Green Lantern - poor characterization. While Justin Kirk did the voice OK, the character lacks maturity and is not a leader-type. This is more the Ryan Reynolds version of Hal at work. <br><br>Cyborg - well done Shemar! Super character to introduce in greater detail. <br><br>Captain Marvel - welcome back Sean Astin (Samwise Gamgee)! Great job and good character as a boy with Superpowers. <br><br>Darkseid - poorly executed. They reduced him to a brawler instead of a master schemer. Insanely powerful though, able to resist the entire Justice League all at once. <br><br>Animation style: This is more Korean anime style (as opposed to Japanese anime) which I find more appealing. It tends to moderate between Japanese and Western animation styles. Those who dislike Japanese anime style may find this more tolerable. <br><br>Plot: Weak JL genesis plot. Darkseid's invasion play has no clear motive other than to obtain Kal-El. The rest of the heroes are just there because...well...they need to be there to.become.the.Justice.League. Right? ;) <br><br>Overall: Poor effort by DCA. I feel they let themselves down by approving an underpar script and miscasting Superman. It doesn't compare favorably to past efforts though still watchable for fans.","user":"josephkalaivanar","rank":[30,44]}]