[{"title":"The best thing you can ask for in a movie is to be left wanting more","rating":10,"date":"28 January 2016","review":"This is one of the few films I have seen where I was left wanting more. There were non stop laughs, funny sight gags and wonderful actors. It was wonderful to see Kate Beckinsale and Chloe Sevigny back together as well. Tom Bennett is truly a joy to watch and steals all of the scenes he is in. The costumes, sets, and acting are all top rate. The script, pacing and direction all make the movie flow at a fast pace. I was never bored and at the end of the film, I was left wanting more. This is one of the greatest compliments I can give to a film. Time does fly when you watch this film and feel free to laugh out loud when you watch it. Everyone else will be.<br><br>Ten out of ten","user":"IDwasTaken","rank":[76,116]},{"title":"Austen rocks","rating":8,"date":"12 May 2016","review":"Greetings again from the darkness. Jane Austen ROCKS! Sure, that might be a slightly exaggerated description of the writer who passed away almost two hundred years ago, and is known for such subtle and nuanced work as \"Sense and Sensibility\" and \"Emma\". But it's difficult to argue the fact that Ms. Austen's 2016 is off to an impressive start. First came Burr Steers' highly creative and entertaining \"Pride and Prejudice and Zombies\", and now Whit Stillman delivers a cracking version of her (apparently) unfinished novella \"Lady Susan\".<br><br>Thanks to the standout performance from Kate Beckinsale, and the manner in which words from Austen and Stillman go zipping by (sometimes honestly, sometimes not), this is one fun and briskly-paced romp  more descriptions not typically associated with the prim Ms. Austen. Ms. Beckinsale as Lady Susan Vernon flashes spunk and comedic timing that we have not previously seen from her. She fits marvelously in the dress of the late 1700's, while packing a diabolical and manipulative nature more often displayed in contemporary settings.<br><br>The supporting cast seems to be having a marvelous time. Chloe Sevigny is Alicia, Lady Susan's confidant and gossip buddy  and one whose husband (Stephen Fry) continually threatens to ship back to Connecticut (as if it were the coal mines or outback). Emma Greenwell is Catherine DeCourcy Vernon, adversary and sister-in-law to Lady Susan, and Mofryd Clark plays Frederica, Susan's somewhat mousy and inconvenient daughter.<br><br>Though the women are standouts here, the men hold their own. Xavier Samuel is Reginald DeCourcy, the somewhat naïve and susceptible-to-advances-from-Susan young man, and Tom Bennett manages to steal most every scene as the quite silly and funny (and wealthy) Sir James Martin. Adding their own special touches are James Fleet and Jemma Redgrave as Sir Reginald DeCourcy and Lady DeCourcy, respectively; and Jenn Murray as Lord Manwaring  one of three suitors to Lady Susan.<br><br>This spoof/parody will strike a chord for anyone accustomed to the uptight nature of most period pieces, as well as the importance of status, decorum and the corresponding insecurities (a weakness the cunning Lady Susan will most certainly seize upon). Mr. Stillman (Damsels in Distress, The Last Days of Disco) is an immensely talented writer, and certainly a welcome complement Ms. Austen's posthumously published work. It's a deliciously funny and intricate story that features such quips of gold as \"Facts are horrible things.\" Welcome to the zany verbal barrages of Lady Susan, Whit Stillman and Jane Austen. Yep  zany and Jane Austen in the same sentence. I told you she ROCKS!","user":"ferguson-6","rank":[53,82]},{"title":"Whether you'll enjoy it depends entirely on your love and familiarity with the Jane Austin novels and films.","rating":7,"date":"4 April 2016","review":"I have read just about every Jane Austin novel and have seen many different versions of movies based on her books. As a guy, this makes me very unusual to say the least. But even women, who are usually the most die-hard fans of this great writer, only make up a small percentage of the population. Because of this, I feel safe in saying that a new film parody of Austin, Love &amp; Friendship, is likely only to be seen by folks who love and appreciate her stories. For them, this film is a must-see. For everyone else...not so much. Now this is not because there's anything wrong with this new movie...on the contrary, it's very well made and was produced, surprisingly enough, by Amazon Films (yes, from amazon.com)! Quite surprising...especially for a lush period piece. But the average person simply won't understand or appreciate the very droll and dry humor. And, even if you are a fan, you really have to be into the language and pay close attention for all the nuances. Again...not a complaint...more an observation which will let you decide whether the film will be right for you.<br><br>This film, as in other Austin films, is set in the Regency period in Britain (the very early 19th century). However, the filmmakers actually chose to make the film in Ireland...and it's a nice substitute. When the film begins, Lady Susan Vernon (Kate Beckinsale) is abruptly leaving the Manwaring estate. You have no idea why but soon learn that Lady Susan is a rather poor woman and generally visits with friends and family in order to sponge off them. She also feels no particular obligation to pay her mounting debts...after all, she is Lady Susan! Her sister-in-law, Catherine Vernon (Emma Greenwell) isn't completely thrilled with the visit to her home, as Lady Susan has the reputation as a very beguiling yet vicious woman...all done with a smile. Catherine is also soon alarmed because her nice but slightly dim brother, Reginald DeCourcy (Xavier Samuel) is captivated by Lady Susan and would love to marry her. Oddly, despite Lady Susan being a horrible and conniving woman, when her daughter, Frederica (Morfydd Clark) joins them at their estate, she is nothing like her mother...and the audience hopes and prays that dopey Reginald recognizes Frederica and Susan for who they truly are. However, Susan is determined to have Reginald for herself and instead foist the incredibly boring and stupid Sir James Martin (Tom Bennett) onto Frederica. Can this master manipulator be stopped or will she soon manage to make three other people completely miserable?<br><br>This film is quite funny but the humor is nothing like the long string of brain-dead and worthless parodies of films such as Disaster Movie and Date Movie. Instead of being broad and written for the average 10 year-old, Love &amp; Friendship is often very subtle and is filled with wit that should appeal to Austin fans. But it's also the sort of well-crafted film that just has a limited appeal to broader audiences. It's a shame, as it's very well directed, sports a clever script and has lots of wonderful supporting actors such as Steven Fry and James Fleet (who is my favorite in the supporting cast). For fans of the author it's a must-see...others might just want to wait until this comes to Netflix or DVD.<br><br>For fans, I'd give this one a 10. For all others, perhaps a 5 or 6.","user":"MartinHafer","rank":[59,96]}]