[{"title":"This is awesome","rating":9,"date":"5 November 2016","review":"I've never been a fan of the original Jungle Book movie, but I did grow up watching it, and I did like it. This remake is (in my opinion) Disney's best remake so far.<br><br>The animation and the scenery is basically a new age in CGI. Not only are there CGI characters and creatures now, but locations too. The entire jungle looks absolutely real, yet it's not, and that's the great thing about it.<br><br>The characters themselves were pretty cool. I didn't care for Mowgli in the original movie, but this movie got me liking him. He's brave, not as bratty, and he's pretty inventive. Bagheera is as stern and careful as ever except that he's also got the action his book counterpart had had. And I like Baloo's character here, having a bit more of a self-serving trait his older counterparts never had but eventually becoming a nice guy. And that's the main characters. The wolves got more screen time, Kaa got a lot more dangerous (though she doesn't have as much screen time, which is my only complaint in this movie), King Louie is more sinister and less comical, and Shere Khan is a flat-out beast.<br><br>I'm also glad that they brought back three songs I enjoyed as a kid. I really liked Bare Necessities, and I've also started singing this version of I Wanna Be Like You. Trust In Me made me feel like Kaa was in a spy movie.<br><br>So on a scale from one to ten, I'd give it a perfect score: 10/10. It's an epic movie, and I highly recommend seeing this movie.","user":"codydennison","rank":[45,68]},{"title":"A Good Movie, but...","rating":6,"date":"30 May 2016","review":"The Jungle Book has been raved about by everyone I know, but now that I've finally seen it I don't quite understand what all the hype is about. It's true that the CG is nothing short of outstanding, especially considering a lot of it is done during the day instead of at night, and I'm impressed with how much they were able to accomplish, but a pretty movie and an exceptional movie are not at all the same thing; similarly, a better than average movie and an exceptional movie are not the same thing, and this movie is better than average.<br><br>The writing wasn't great, but it was passable. This is a kid's movie after all, and while I don't in any way think that's an excuse for a movie to have a worse script than any other, it's important to understand that the film still needs to keep the children entertained with silly jokes and easy-to-understand dialogue. <br><br>My main problem with the film was the child actor. I'm not expecting a 12-year-old kid to be able act like an A-Lister, but there was one particular shot were he screamed and I accidentally laughed in the near-silent theater because it seemed to out of place and awkward. He was also given outrageously simple and cliché lines. It was always \"I'm doing this thing because of this other thing\" and felt like the majority of his talking was done explaining to other characters that he had to reach is his goal instead of developing his character. There were a few scenes where he was able to act like a normal kid, and those were definitely his best performances, but overall he wasn't able to give it his all because what he was supplied with wouldn't allow him to.<br><br>The other characters were played well, and the animators did a good job with the choreography of all the fights. Bill Murray was a great choice for Baloo, and at this point I can't think of any other voice that could have given a bear that much character.The songs, however, felt out of place and forced, and that's all I'm going to say about those.<br><br>I do not dislike this movie in any sense, and I recommend that people go and see it. At it's heart it is a very good story, and one that I very much enjoy. I'm sure that the nostalgia of revisiting your childhood will help you enjoy it more than I did, because the only scene I'd ever seen from the 1967 movie was the one with the singing monkeys, so there wasn't a lot in the film to connect to my past.","user":"lemonmb","rank":[59,95]},{"title":"Awesome Film","rating":8,"date":"19 April 2017","review":"The boy Mowgli (Neel Sethi) is raised in the jungle by the female wolf Raksha with her cubs in the pack led by Akela. The panther Bagheera saved Mowgli when he was a baby and delivered him to Raksha. During the drought, the animals celebrate truce to drink water around the Peace Rock together, but the cruel tiger Shere Khan sees Mowgli and promises to kill him when the water return. Bagheera decides to guide Mowgli to a village on the outskirts of the woods, but they are attacked by Shere Khan during their journey. Mowgli flees but the anaconda Kaa attacks him; however the bear Baloo saves him and they become friends. But Shere Khan wants to kill Mowgli and no animal is capable to stop him. What will happen to Mowgli?<br><br>\"The Jungle Book\" is an awesome film with fantastic CGI. It is impressive the interaction of Mowgli with the animals and the jungle. The wolf cubs are cute and the voice of Scarlett Johansson is mesmerizing. My vote is eight.<br><br>Title (Brazil):\"Mogli: O Menino Lobo\" (\"Mogli: The Boy Wolf\")","user":"claudio_carvalho","rank":[34,52]}]