[{"title":"Rocky start but then really worth the watch","rating":8,"date":"26 February 2016","review":"If you like Sci Fi and you can still appreciate smaller productions, despite being spoiled by the excess of big budgets, then you will like this movie. Having said this, the production in this movie is great. After the introduction the story slowly develops, everything about the movie picks up a lot in the second half, it becomes intriguing after a Kafka-esque twist and it really becomes an enjoyable watch.<br><br>With regards to previous reviews - Expressions involving space time belong to everything in the universe not just 'Interstellar the movie', the reference is unnecessary sigh, also the movie isn't totally focused on this theme at all. I would be more concerned with how certain other themes and concepts are unimaginatively explored to death in other movies over the last 100 years. Enjoy this movie on its on merits!","user":"michaelltf","rank":[43,53]},{"title":"Hang in there! it gets better! PROMISE!","rating":8,"date":"2 February 2016","review":"I would say that when it comes to judging good science fiction movies I have a good sense of sniffing out the good from the bad, normally I can tell within just few minutes if the movie holds any promise, but this movie is somewhat very strange it starts of very weak even through a big chunk of the budget was spent in the first 20minutes of the movie, I found myself compelled to continue watching even when it didn't hold much appeal! I'm glad I waited, the story picked up and the acting is 10x better in the second half of the movie than it was at the start, its rare to see a movie that goes from so bad to so good, and I have to take my hat off to the entire crew for pulling of a superb low-budget sci-fi.","user":"simonhayter","rank":[42,55]},{"title":"pretty decent low budget scifi","rating":7,"date":"1 February 2016","review":"Arrowhead is a low budget film and you will be reminded of that in more than one occasion; but it's refreshing to see a budding filmmaker use proper filmmaking techniques to entertain you, rather than throwing money at the screen and hoping it works.<br><br>The story is of a confused convict, trust into a situation where he is in over his head, who winds up stranded on an alien planet and infected with a weird virus. Then, a series of weird occurrences start to set in - most lifted from other films, but fused together enough to become something new. It's got a bit of Riddick, a bit of Moon, a touch of Alien, some Robinson Crusoe, and while it's not great, it's certainly watchable, more so if you yourself are interested in filmmaking .. on a budget.<br><br>No, it's not better than Interstellar, but it's also much less pretentious.<br><br>My vote : 7/10 for the effort.","user":"digdog-785-717538","rank":[32,41]}]