[{"title":"Weird, not scary. Boring, not exciting. The acting was OK.","rating":3,"date":"7 July 2015","review":"About 9 other reviewers gave this movie 8-10 stars. I'm calling BS on their objectivity. I think the high reviews for this were made by those affiliated with the film. It's got a very weird storyline, and the very end makes no sense. Some of the other reviews said there were some jump scares and this movie goes beyond cheap scares. Even cheap scares would've been better than what this movie had, which were no scares. I started falling asleep, it was that boring. And no, not a single jump scare.<br><br>Usually, low budget films, which this definitely was, gets crappy actors to go with the crappy budget. However, the acting was not bad at all for what this movie deserved. The two leads might go on to better things.<br><br>There is nudity in the movie. About 6 minutes in, the lead actress shows everything. Later, they have sex in a field, and one of her breasts is shown.<br><br>The cinematography was not good. It had very much of a low-budget look. The atmosphere was not interesting, neither was the scenery or directing.<br><br>I gave this a 3-star rating. I do not recommend, unless you're having trouble sleeping. This will definitely cure your insomnia. ZZZZZ!!!","user":"chrismackey1972","rank":[22,25]},{"title":"Out of here","rating":2,"date":"13 July 2015","review":"A hopeful couple try to figure out their mutual sex problem by retracing her repressed past on a visit to her rural hometown.<br><br>Good concept, nice actress, story a bit cliché - but terrible direction/editing/writing. I assumed the latter three were down to the lead actor, and was willing to give him credit for having the dumb determination to put this mess together, but IMDb says several people were responsible.<br><br>Low budget, so allowances are made. But the major problem is the director set the actors up for long, static scenes with lots of patchy dialogue - some interesting, the rest unnecessary. Sitting. Standing. Walking slowly. Focus comes and goes. There is an excellent shot early on, with the men back-to-back in the field, which gave me hope. But the story died on screen and, I guess, was already dead on the page.<br><br>Music atmospheric, nothing special, and the singing was pleasant enough to outshine everything else.<br><br>OK ending, but bad story telling ruined the experience well before that.","user":"begob","rank":[10,11]},{"title":"What did I just fast forward?","rating":1,"date":"7 July 2015","review":"Okay I did fast forward quite a bit of this movie so some might say I should have been more patient. Really though I tried to but everything about this movie was just rubbish from the storyline to the acting, to the directing to the (the list goes on....)<br><br>This is only the 2nd review I have done on here but when all the other reviewers gave 8 to 10 stars I thought great, a new movie that really looks good and the fact it was supposed to be a horror with comedy mixed in made it even more promising.<br><br>Anyway if you don't believe me see for yourself and it will become evident that the other reviewers must be friends or family of the actors or are from the hills where they have no TV's and have never seen a good movie before.","user":"gragsy","rank":[18,24]}]