[{"title":"Harsh reviews...","rating":6,"date":"5 March 2019","review":"After reading the other reviews - and after seeing the movie at its Berlin premiere - I have to say I find those reviews a bit too harsh.<br><br>Yes, it's probably not gonna win an Oscar but what do you expect when you read the story?<br><br>I think it's a decent B-movie and there are certainly worse ways to spend 90 minutes of your life.<br><br>The CGI work is once again very impressive and if you really want to critize something, it's the dialogues which can hardly be any more wooden at times.<br><br>Besides that it reminds a bit of teens having their first encounter with the other gender - a long build up with a very quick finish (pun not intended).<br><br>And if you watched the Q&amp;A after the showing: I think we're all waiting now for the third part with Udo Kier as Nazi robot crocodile where only his lower part works.<br><br>Watch it!","user":"yamxt600","rank":[77,99]},{"title":"'Meh' Never summed up a film better","rating":5,"date":"7 May 2019","review":"I gave the first Iron sky a 8/10. For a crazy plot it somehow all worked really well, good humor. Some likable characters. And it felt cohesive.<br><br>The sequel on the other hand feels like a bit of a mess. You can see the potential for a better film and it's pretty frustrating. The VFX for a 20 mil budget is pretty good. But the plot is just ridiculous and not in a good way like its predecessor. Most of characters were not funny and badly written. It doesn't make sense in really badly written ways that i feel could've been easily changed to make it a bit better than it was and not so by the numbers with plot holes that take you away from immersion in the wacky world they're trying to represent. Personally if i wrote this film, I would've taken it in a entirely different direction.\nAll the pop culture references mostly didn't work as intended, instead of being funny it was just cringey.\nAnd the ending was just dumb and rushed.<br><br>But I didn't hate the film, I was mildly entertained, enjoyed the visuals/world they created and because i liked the first film quite a bit, perhaps im being a little forgiving when giving it a 5/10. I can understand why people would vote it lower tho.<br><br>A younger, high audience may get more enjoyment out of this. I'm getting older and don't smoke bud anymore. Perhaps that made a difference in my enjoyment, I dunno.<br><br>I'd say to give it a go if you liked the first film, make your own assessment. I can imagine there will be some people who will like it. Its definitely not totally terrible.","user":"MoistMovies","rank":[55,72]},{"title":"Not perfect, but better than Sharknado (any of them).","rating":6,"date":"7 May 2019","review":"I didn't expect much from a sequel to a movie about Moon Nazis, but they really pulled out the stops on this one. The first movie had a lot of dull moments with interesting, if campy, scenarios that made it a watchable film (but not memorable). This time around, the acting, environments, special effects and music all got much needed upgrades. With the exception of a needless subplot, I had fun with this and I didn't feel my eyes roll back even once in annoyance. It isn't a stellar movie, but it blows the doors off of any budget title or SyFy dross.","user":"avadams","rank":[31,43]}]