[{"title":"A not true history.","rating":2,"date":"2 April 2016","review":"The man who discovered the Altamira Caves was a shepherd named Modesto Cubillas.<br><br>The person who the film says is the discoverer, Marcelino Saenz de Sautola is only the owner of the land but the film insists on giving all the importance to this man. Do you know why? <br><br>The family Botin &amp; Sainz de Sautuola is one of the most powerful families in Spain (owners of Santander Bank), they are creepy aristocrats who want to honor his ancestor with a lie. The family Botin &amp; Sainz de Sautuola are who sponsor the film. Poor Modesto Cubillas, you were \"only\" a shepherd with no money.","user":"jfseyllier","rank":[146,178]},{"title":"Great Movie","rating":10,"date":"15 October 2016","review":"I give this movie full marks. It may not be Lawrence of Arabia or a block buster but it is fine cinema nevertheless. For what the producers did with their budget and the location and interior shots - they did very well. One reviewer remarked that the movie did not credit the true discoverer of the cave. However if you watch carefully it is clear that credit is given to the huntsman who actually did find the entrance in 1858. <br><br>I enjoyed the production thoroughly. this is the perfect movie for those who enjoy historical drama. Well paced with great photography and great location sets. I have family in the film industry living in Hollywood and it is often a great battle between the corporate financiers who want as much sex and nudity with blond bimbos to boost sales and are constantly ruining potentially good cinema by inserting complete dross into otherwise good scripts. Good cinema is becoming rare. Someone has taken a punt on this movie and my bet is that it won't rake in millions - but it gets my vote and I loved it. <br><br>In May 2017 I will be visiting Altamira and will remember this movie and certainly want to read more about its discovery. Chris Lachman, Adelaide, Australia","user":"tibet10-1","rank":[24,27]},{"title":"Finding Truth","rating":7,"date":"28 October 2016","review":"Based upon a true story<br><br>1879 in Spain, Marcelino (Antonio Banderas) discovers a cave that contains drawings from the Paleolithic Era (Stone Age). Of course, this claim is disputed as a forgery by the main Council of Anthropologists, the Catholic Church that criticized Marcelino for his scientific not religious views, the press that prints he is unfit to be a father and worse of all by Conchita (Golshifteh Farahani) his wife who sides with the Church. Most believed that the cavemen did not have the intellectual capacity to perform the drawings. <br><br>Marcelino stands his ground although he is thoroughly humiliated. His 9-year old daughter Maria (Allegra Allen) who was the one who actually discovered the cave drawings of bisons stands by him. Marcelino determines how the cavemen did the drawings in a dark cave without putting soot on the ceilings. But he could not figure out why the walls showed bisons when no bison bones were ever found in the area. (The movie didn't address this either)<br><br>I really liked the Confessional Scene between Conchita and the head priest when she tells him off really good and defends her husband . (Hey, I cheered when she did this) She came around when she learned how the Cavemen did the drawings without putting soot on the cave ceilings and then she tells Marcelino she wants to see the cave. It must have been her belief in him that mattered the most to Marcelino. And it should have. <br><br>Marcelino learned that finding the truth isn't all that easy. After Marcelino's death, his chief critic, Emile Cartailhac (Clement Sibony), admitted his mistake and issued an apology in the main Anthropologic magazine. <br><br>The acting all around is good, but when everyone spoke with a Spanish accent it was sometimes difficult to understand all dialogues, but we got the idea eventually. The young Maria was the only one who spoke clearly without any accent. (You go girl!)<br><br>Go to Wikipedia to learn more about these famous Altamira drawings from the Paleolithic Era. Wikipedia says some of the drawings in that cave go back 35,000+ years. (7/10)<br><br>Violence: No. Sex: No. Nudity: No. Language: No.","user":"rutzelb","rank":[15,17]}]