[{"title":"A harsh reminder of how quickly evil can spread","rating":7,"date":"31 January 2017","review":"There is really very little you can criticize about a story when the story is true. The adaptation for the screen can come under scrutiny, but in this case there really is no cause for concern. It is a beautifully shot and crafted piece of cinema. Excellent Cast, and solid direction.<br><br>You are introduced to a view of history from a less common angle. The lives and story of people who opposed the rise of Nazi Germany from within. People who stood up to the fear, collusion, and general despair of the masses. Most too scared to fight back, choosing instead to lay low and hope for the best.<br><br>You can draw frightening parallels with the world today. Except we have social media to voice our anger and concerns at what we see as injustice. The tyrants and demigods around the world fight to block free speech on the internet just as Hitler and the SS did in Germany in the late 1930's and 40's. If you disagree with them you are wrong and risk being silenced and oppressed.<br><br>This film depicts the pre-internet world's attempt at quiet resistance. Slower, less reach, but still shows the importance of non conformity in the face of oppression. A valuable watch for all who love true stories, and perhaps particularly relevant at the moment.","user":"atcallan","rank":[55,62]},{"title":"A story of how heroic postcards became small grains of sand in the Nazi war-machine","rating":8,"date":"9 March 2017","review":"War films are stories writ large about aggression between nations. Few of them explore small-scale human undercurrents of suppressed dissent inside the countries at war. Alone in Berlin (2016) does this by looking at an ordinary working-class couple and their compulsion to express feelings about Hitler's dictatorship at time where dissent meant certain death. It is also an essay on parental grief struggling to voice its pain of loss.<br><br>Based on real events, the story opens in a small flat in Berlin where Otto Quangel (Brendan Gleeson) and his wife Anna (Emma Thompson) learn that their son has died in battle. In a long marriage that is under strain, the news pushes them further apart as they cannot console each other in grief. Otto had encouraged his son to join the Nazi army and now Anna blames him for their loss. Desperate to voice his rage against Hitler's regime, he painstakingly writes postcards and secretly leaves them on stairwells and doorways where they can be seen by passers-by: he calls them \"small grains of sand in Hitler's machine\". Initially he keeps Anna away from his dangerous mission, but she insists on being involved and they both become clandestine resistance fighters whose weapons are simple messages about the evils of Nazism. They manage to write and distribute over 260 cards despite extensive investigative efforts to stop them. In the process, they resurrect their marital relationship. After almost two years of card-writing they are caught and together face Nazi justice.<br><br>This film has two parallel narratives that start in opposition and end in convergence: one is Otto and Anna's actions, the other is the investigation. The first is focused on the smallness of the couple's actions in contrast to the enormous risk they are taking, like a pair of mice squeaking at roaring lions. The filming, colour palette and period setting are drab and lifeless; the atmosphere is paranoid with suspicion and mistrust; and the acting is subdued and understated. Brendan Gleeson and Emma Thompson are actors with broad performance repertoires but here they are minimalist in expression and Spartan in dialogue, with much being conveyed through furtive glances or avoided eye-contact. It is a slow-moving story, observant of small details in an alienated world. This has the effect of amplifying the intensity of Otto and Anna's actions. Close-ups of a pen leaving a trail of outrage on a small white card become powerful portraits of bravery that are ultimately futile as most of the cards were handed in to authorities. The couple's nemesis is a young German investigator (Daniel Bruhl) who pursues his work with ideological fervour for the Fuhrer but whose success turns into the film's most devastating moments of despair.<br><br>This is a joyless story about humble heroism. Otto and Anna are emblematic of ordinary people dealing with tragedy and anger inside a world of fear and danger. Far from being mere victims, their small protests seriously unsettled the Nazi hierarchy and the closing scenes are a tribute to the power of their \"small grains of sand\".","user":"CineMuseFilms","rank":[33,37]},{"title":"Moving but not depressing. A masterclass in acting from a stellar ensemble cast.","rating":9,"date":"2 March 2017","review":"Having come close to losing a son in Afghanistan I could entirely relate to the despair and cold anger at the lies and injustice, the central characters felt. I was overwhelmed with emotion and the movie stayed with me for days. <br><br>Both Emma Thompson and Brendan Gleeson turn in outstanding performances, as do a number of the supporting cast members. The film allows a window into the fear, shame, and hopelessness the German people must have felt, as the war progressed and the true reality of the impacts of allowing rampant thuggery, cruelty and bigotry into power, was revealed. Parallels perhaps to certain events going on in the world today?<br><br>Brendan Gleeson is an outstanding actor who depicts ' everyman' with authenticity. This movie being a case in point. Without any histrionics this movie delivers. The ending was unanticipated and well crafted. The fact that it is a true story only adds to its power. Highly recommended.","user":"Tushpi","rank":[44,51]}]