[{"title":"Trailer A+, Movie Z-","rating":3,"date":"27 April 2015","review":"My First review, I had to bring this to peoples attention The most disappointing thing about this movie is that the trailer looks exceptional while the movie falls flat.<br><br>My wife and I chose this unfortunate choice over a choice of 3 other \"RomComs\", needless to say we chose the wrong one. Helberg should stay in the Sitcoms where he is not the headliner, his breathing in the movie is very distracting and the acting is somewhat painful to watch.<br><br>In the end I decided 15 minutes before the end that I could not take it anymore and went to bed.. early.<br><br>There were a few mildly funny bits but the movie tends to distract from this very quickly with the serious notes.","user":"ben-81361","rank":[16,17]},{"title":"The best parts are the subtle ones","rating":4,"date":"26 January 2015","review":"This is not ranking high on comedy actually, it is mostly just passing time with a couple of good scenes here and there, but overall it is not that funny. I think the best parts are subtle ones, with small funny statements, or incidents and not the typical hurt yourself or crash into something that this has most of.<br><br>Simon Helberg has some way to go, but it is a good attempt it is just not as funny as I had expected from him. His part is really good, he is very insecure and messes up a lot of stuff, he plays his role very well. His farther played by Alfred Molina is also a good character. But I don't think the rest contribute much to the great parts of this movie unfortunately.","user":"osj2507","rank":[16,18]},{"title":"Excruciating watch.","rating":3,"date":"4 February 2015","review":"This took me three goes to get through. The writing feels so self-centered, characters are lacking depth while the lead is annoying to watch..a hypo, fumbling idiot. The film offers no opportunity to connect with the characters, which is a shame considering it's based on a true story. <br><br>The comedy feels forced, but with more work on some of the gags and general tightening of the editing and pacing, some of it would have come across better. <br><br>Soundtrack and cinematography were forgettable. <br><br>It felt like a pet project that wasn't meant for wider distribution, maybe something you show your friends....\"remember that time when my relationship went bad, and stuff happened?\"","user":"squidantics","rank":[13,15]}]