[{"title":"So beautiful, yet unsettling real: Of Mind and Music","rating":10,"date":"20 April 2018","review":"The most touching and real depiction about the human experience I have ever seen in years. From beginning to end, this movie had my attention; I could not believe I have not known about this movie until recently.","user":"eunicec","rank":[4,5]},{"title":"Very slow and borderline artsy but not bad for those who like this type of movie","rating":7,"date":"17 December 2016","review":"This is my first review, mainly because there aren't any others to help people out yet, so don't expect an expert film critique here.<br><br>I was in the mood for a drama and this was on Netflix. I work with dementia patients as a living so thought I would give it a shot.<br><br>The synopsis pretty much sums it up - a doctor (Joaquim de Almeida) loses his mom to Alzheimers and then tries to help another woman (Aunjanue Ellis) suffering from the same disease.<br><br>On the good side, the actors did a great job. Every one of them were believable in their part, whether or not you could actually get into their character development - if there even was any. The music was brilliant, throwing New Orleans jazz continuously into the mix. Una Vida and Stompleg (Bill Cobbs) spend a lot of time singing and playing their own tunes, which actually makes you forget the movie is dragging.<br><br>And that's the biggest problem. This was a good movie, but very slow. It dragged itself on for a lot longer than it should have. It's more on the artsy side, with too much time spent getting the perfect shot than spent writing it. The plot was so vague I wasn't sure it even had one until halfway through. So little dialogue is spoken at times that you question everyone's motives, such as the doctor's empathy towards Una Vida, which comes off as creepy infatuation. I spent the first half of the movie waiting for him to reach over and kiss her! The cinematography was beautiful, but even though a picture tells a 1000 words, an extra line of dialogue squeezed into the movie can change one's whole view. Then again, a single line spoken near the beginning is supposed to sum up Jessica's (Ruth Negga) attitude, which was really annoying at times.<br><br>Overall, the movie would have been great if the writing was better, at least in my opinion. There was very little focus on Alzheimers so don't be expecting any profound breakthroughs.<br><br>For those that like these kind of movies, I can see where they would enjoy it, and really, it wasn't that bad - good music, heartfelt moments, beautiful scenery, great acting - but I think a lot of people will get bored and turn it off.<br><br>I rated 7/10, partly because I'm easily pleased and probably rate higher than I should, but also because once you get past some poor writing and a sore thumb from hitting the fast-forward button, the movie isn't that bad.","user":"dougystyle","rank":[3,6]}]