[{"title":"A fresh breath of air in Hong Kong local cinema","rating":7,"date":"10 August 2013","review":"There is a sense of freshness and energy behind the production of \"The Way We Dance\" in which we have not seen for so long from recent Hong Kong cinema, as it is being dominated by co-op films between HK/China and often lead by aging stars. This is a film, for once, allow itself to re-define its root and restore its \"home court advantage\" (as one of the promo slogan suggested).<br><br>Right from the very beginning, the film's intention of being a truly local film can be seen clearly. The opening saw Fleur (Cherry Ngan), an recent high school graduate working in an old tofu desert shop under her parents. This kind of old shops had been disappeared right in our eyes as the city redeveloping itself. Yet, Fleur's dream and ambition of being a great dancer has never been dampened. With a rather witty (yet highly dramatized with local comical taste, perhaps a small tribute to 80's HK film) sequence, Fleur finally got her chance to get into university to fulfill her dream. <br><br>Once into the university, she quickly impressed her idol, Dave (Lockman Yeung) and join the BombA dance team to begin her dancing career. It was all going well and her involvement with the team allows BombA to finally get a chance to challenge the almighty \"Roottoppers\", which is a famous street dancing group. The story then get slightly twisted in which Fleur began to get into trouble with Rebecca (Janice Fan), a beautiful girl with an ambition of her own. Fleur eventually left BombA and began her bizarre relationship with the young leader of the Taichi club Alan (Babyjohn Choi). It was this relationship which helps Fleur to learn that life is far more than dancing and eventually to put what she learns into her dance move, and helping BombA to re-establish itself to be a worthy challenger in the annual dance competition.<br><br>Building on this conventional type of storyline (which is actually not dis-similar from a star war type of saga). The story really tells how our hero(ine) deals her disadvantages/disappointment and clear her obstacles while keeping her faith and dream to achieve her own success. A much timely reminder of how once Hong Kong people has this kind of faith and energy to succeed, whether it is from a society/cinema standpoint. The diverse background of the characters, whether it is for each of rooftoppers' members (multicultural with minority group) or tai- chi club members (ex-con/dropouts) is also an accurate portrait of Hong Kong contemporary society (at least before the dominance of Chinese mainlander!). The subplot behind these characters, including that of Rebecca and Alan, even the leader of the rooftoppers, while at times could be distracting, serve well in terms of bringing a three dimensional view of them and allow the audiences to feel attached to them.The performance of the main character, Cherry Ngan is probably by far the biggest bright spots of the film. Her unconventional beauty and youthfulness complements well with her often fun loving character. She has a gift of lighting up an ordinary scene with her cheeky smile and she understand well how to utilize her body language/dance move when they are needed the most. Even though she would need to improve her way of pronouncing her dialogs, Ngan's performance in this film has probably put her into the stardom right away and Hong Kong cinema certainly would not mind to have its own local female lead once again. <br><br>There is no doubt about the effort made by each of the dancers (many audiences certainly appreciated very much by staying on for whole end- credit being played out). Yet, the editing and certain camera movement could improve to bring more visual excitements to the dance sequence. The lighting use and some of the calligraphy of dance were at times struggle to boost dazzling dance move from the dancers in the next level. <br><br>In his third feature-length work, director Adam Wong had created something that not often seen in Hong Kong cinema (film with a dance theme is something of a rarity in HK cinema). The Way We Dance will easily draw comparison with Hollywood's production Step Up franchise. However, it should be more than that, it carries the kind of freshness (with new young actor/actress, a growing up story mixing well with exciting dance scenes) but the film serves a good reminder that Hong Kong own production can just as exciting as others and our very own image and determination should not be forget, as if we are like fleur, with one leg injured, will still able to \"fly\" with colors.","user":"starman_vagabond","rank":[16,17]},{"title":"Enjoyable and energising","rating":28,"date":"28 April 2019","review":"This film tells the story of a young woman who pursues her dreams to dance, no matter what is in the way.<br><br>When this film came out in Hong Kong, I remember rave reviews and good word of mouth. Now that I have finally seen it, I can see the positivity and inspirational elements which are quite needed by the society. The production is good, and the dances are really energetic too. I particularly like the end dance hen they incorporate traditional Chinese folk arts and Taichi into the dance. I enjoyed this energising film.","user":"Gordon-11","rank":[1,1]},{"title":"A local gem that should be going places","rating":19,"date":"19 September 2013","review":"\"The way we dance\" has just won the Fukuoka Film Festival Audience Award 2013, hopefully the first of its many other well deserved recognitions. It is not unfair to say that this movie follows a well proved template of I-have-a-dream-in-dancing, one which fits equally well in both classic and modern dances. But it must also be said that TWWD has its own special appeal that is uniquely Hong Kong, whose movies deserve to be known by more than just gangsters.<br><br>The cast is a delightful combination of a veteran (despite being very young), academically trained stage play actor, a young man bringing to the script his most inspiring, courageous true story, as well as those selected from stringent auditions (and one waited for 3 whole years afterward to be called in). The common link is their passion, heart and soul.<br><br>An unflattering common local scene at cinemas is that the very split-second the ending credit appears, the pragmatic, enterprising management would turn on the light to facilitate cleaning up, as the shows are packed closely, a revenue-focused strategy. Nor would this bother 95% of the audience who would, on cue, stand up and file out – there is a big world outside the cinema where money is to be made. Not so at the show I saw of TWWD – on the part of the audience, I mean. Management did turn on the light but not a single person in the audience stirred. They (we, I should say) sat quietly through the entire credit roll, to the very end, wanting to savoir every last minutes of the two hours shared with these \"dreamers\", memories that will be cherished for years to come.","user":"harry_tk_yung","rank":[1,1]}]