[{"title":"Take it for what it is","rating":2,"date":"2 January 2015","review":"The negative reviews for this film abound. It seems most are comparing it to the first Scorpion King, with \"The Rock.\" Admittedly, the three that have thus far followed it aren't nearly of the same quality. But if you put that aside and just take it for what it is, it's a fun film, with some wit and levity that even had me chuckle out loud a couple of times. It wasn't full of gratuitous sex or vulgarity. It's just a fun action adventure popcorn movie. It will not rank among the best movies of all time nor is it trying to do so. I had just returned from another 7-hour chemotherapy session and this film hit the spot: Brainless and fun entertainment. If you just take it for what it is, I hope you'll enjoy Scorpion King 4 as much as I did.","user":"ThePerplexicator","rank":[32,39]},{"title":"Light hearted, adventure for family.","rating":7,"date":"17 January 2015","review":"When my friend mentioned to me there was a Scorpion King 4, he said this was a Nanar, which is a french word they use in France, with the equivalent in English that could be \"movies there so bad there good\" but at the same time, its not exactly that.<br><br>First of all the movie is made to be an action adventure comedy, with a huge emphasis on comedy. Its been so long i have not seen the first Scorpion King with Dwayne Johnson, i can't remember exactly but i am sure it was not that \"on the comedy aspect\" if i can say.<br><br>It seem the cast just had fun with this one, its almost like watching a Disney cartoon with real persons. If you can remember Hercules the Legendary Journeys with Kevin Sorbo, well this is close to that.<br><br>So could we really call it a \"Nanar\"? Not really cause it seem they really knew what they wanted to do and they did just that. Honestly i had fun watching it, the characters where cool, and sure at times i was like \"oh common really?\" but always with a smile. Its just a good family fun time.<br><br>Just don't expect anything serious and you should enjoy it.","user":"destroyerwod","rank":[19,28]},{"title":"The Scorpion King The Lost Throne: Passable stuff","rating":5,"date":"12 May 2018","review":"Credit where credit is due, the Scorpion King franchise was nowhere near as bad as it could have been or by all rights should have been.<br><br>In this 4th and likely final instalment we see the return of the titular character once again played by Victor Webster who does a decent enough job.<br><br>The plot is brainless but acceptable and the action and laughs come thick and fast and once again the film doesn't take itself seriously at all (Which works in its favour).<br><br>Again it's like watching Hercules or Xena, and since fantasy movies are so few and far between I'll take what I can get.<br><br>The odd thing is how many stars are in The Scorpion King but how little screen time they get. Rutger Hauer, Eve Torres, M. Emmet Walsh and Lou Ferrigno (Who plays a big part of the cover art) are all in one single scene each which seems like a bizzare waste.<br><br>Dumb stuff, but passable this rounds The Scorpion King franchise out for me at 22/40 which isn't all that bad. I would however say that this perhaps should be the last film and it shouldn't be milked any longer.<br><br>The Good:<br><br>Some oddly good comedy<br><br>M. Emmet Walsh &amp; Barry Bostwick<br><br>Scorpion King wasn't recast again<br><br>The Bad:<br><br>No Olaf<br><br>Most of the famous names are little more than cameos<br><br>Weak CGI<br><br>Things I Learnt From This Movie:<br><br>Watching Scorpion King 4 is like watching an extended episode of Hercules, except the leading man isn't a complete moron<br><br>Agents of Shield Grant Ward is the Scorpion King? Who knew!<br><br>Rocks are secretly soft and will protect you from large falls<br><br>Women always have spare clothes that would neatly fit 6\"5 men<br><br>Making wrestlers do their finishing moves in movies is still tacky","user":"Platypuschow","rank":[11,16]}]