[{"title":"Seriously?","rating":2,"date":"25 August 2019","review":"Someone seriously thought it would be a good idea to take Jacob's Ladder, a classic take on life and death, and turn it into a second-rate thriller with none of the profundity and existential dread of the earlier movie? Was there nobody to say that's a dumb idea, the script is abysmal, you're fired? I approached this with an open mind, I love the original but I thought a remake might be interesting. It wasn't. It was unimaginative and uninspired garbage. Do yourself a huge favor, go watch the earlier version and avoid this one like the plague.","user":"aldiboronti","rank":[119,130]},{"title":"Appalling.","rating":1,"date":"25 August 2019","review":"I love the original. It is definitely a niche horror film, but so well written, directed and cast. You felt the horror the character of Jacob (Tim Robbins) was going through. Supporting cast were great as well, maing it a well-rounded uniqe experience.\nSo, what would happen in a remake...I was excited to find out. Well, with many plot changes and character changes as well it started on the wrong foot.\nWithout spoiling the film, it went so off course from the original premise as to actually be another film entirely. They could have named this another title and it might have been received more forgivingly (though the story was rubbish).\nAvoid it at all costs and stick with the oiginal. The acting was appalling, the direction confused and the writing....well, I don't know what the writer was thinking.","user":"herodotus2007","rank":[83,93]},{"title":"Terrible from the start","rating":2,"date":"25 August 2019","review":"Having watched the original movie of Jacobs Ladder I really didn't expect much from or even expected this movie was needed. How right I was. From the start your greeted with just confusing dialogue after confusing scenes. I just could not get into such a poor made movie that had no excitement like the original that was very well written and directed. I felt we the audience where being taken for idiots. Sometimes I would say give it a chance. But for this it wants flushing down the toilet. It gets 2 Stars only because it looks decent quality wise just not executed at all in a good manner. Big thumbs down","user":"cruise16174","rank":[72,82]}]