[{"title":"A Very Well Done Thriller","rating":8,"date":"24 February 2015","review":"(Not sure if there is actually any spoilers in my review but I always tick the box just in case I write something that someone thinks is a spoiler; so they can't report me)<br><br>This movie is what I would expect from Quentin Tarantino and Robert Rodriguez if they were to ever co-direct and co-write a movie. It has a simalair feel to some of their movies and also it has the kind of ultra violence that you'd find in Tarantino's movies (the kind that some people feel is out of place and unnecessary; but it's never bothered me and I kinda enjoy it in a weird way). Additionally, the screenplay is very tarantinoesque and is written in a smart way and has a simalair style to Reservoir Dogs. I'm not gonna go into the plot cause you can read that on the IMDb page anyway, but the actors who play the captors and the actress who plays the captive, are the people whom we spend most of the movie with. They are all unknown as far as I know but they all deliver solid performances and bring their characters to life in a really good way; thanks to the good writing the actors do have something to work with and the characters do have more dimensions than one e.g. one of the captors always seems nervous about everything and has a drug problem and is haunted by memories from his past when he was in the army. You may have noticed the names Tony Todd and Danny Trejo on the poster who both have top billing but are both only in the movie for just under five minutes. However, both actors are on top form and make their scenes memorable; Tony Todd plays a cop who pulls the captors over halfway through the movie and Danny Trejo arrives in the last five minutes of the movie and plays the leader of a Mexican drug cartel who is also the father of the woman being held captive in the van. A hell of a lot happens throughout the movie and there is so much more to the plot than is suggested by the IMDb plot synopsis but to give loads of details would be to spoil the story. The thing that amazed me the most about this movie was that 95% of it takes place in side the captors van and yet the director still manage to maintain a good atmosphere and the movie can be very tense in places. The only real complaint I have is that the practical effects are a but iffy e.g. someone's head gets blown off and someone else's fingers get chopped off and both times the effects look cheap, although I am glad they avoided using CGI because on the film's small budget it would have looked even worse, however ultimately this doesn't matter too much and doesn't make the movie worse.<br><br>On a final note I would definitely recommend this to fans of Tarantino and Rodriguez and also to those who enjoy a good thriller. Also ignore the fact that this has been put into the 'horror' genre on IMDb, it has no horror elements and doesn't resemble a horror movie in anyway (believe me, horror is my favourite genre).","user":"jackbradwilson","rank":[105,116]},{"title":"Plenty of violence and fun","rating":7,"date":"26 February 2015","review":"After a month and bit of watching purely Oscar nominated films it always takes a bit of getting used to, and is somewhat of a relief, delving back into standard action-thrillers. 'VANish' is obviously a long way from being Oscar material but it's still pretty good. The dialogue actually holds together really well for the most part and the story moves at a good pace. In fact the pace really does move along at supersonic speed. The film doesn't even reach 80 minutes but they could easily have panned it out to 90 if they'd wanted to with needless extra scenes and irrelevant dialogue (or heaven forbid an opening title sequence). Bravo to them for being happy with the runtime and not insulting the viewer.<br><br>\"Girl Power\" seems to be a large part of what director Bryan Bockbrader has gone for here and it works. Almost every male in the movie is a complete moron and the one and only female is a calm and competent woman who rules over them all (even when her hands are tied behind her back). That's not to say there's nothing for men to enjoy - there's more blood, guts and gore than your average thriller, that's for sure. Maiara Walsh did a very good job in the lead role and her acting seems to have taken a step in the right direction since I last saw her in 'Desperate Housewives'. All in all a nice surprise.","user":"jtindahouse","rank":[108,121]},{"title":"Crazy, awesome, messed up, wild ride of a film. Totally worth seeing.","rating":9,"date":"2 March 2015","review":"When I first heard the concept of Vanish, (being shot entirely from inside a van) I thought the idea was interesting and ambitious, but I didn't really think the concept could hold up for a full feature length film. At least not for sustaining audience entertainment value. Wow, was I wrong. The entire film is shot from inside a van, but don't let that fool you. Vanish is a fast paced thriller with surprisingly kick ass action sequences and unpredictable twists and turns throughout the film. Scene after kick ass scene, I was pleasantly surprised, impressed, and entertained all the way to the end. To pull off something this ambitious, (and claustrophobic) you have to bring together a ridiculously talented cast. To the casting director's credit, Vanish's ensemble cast was incredible. There were exceptional performances by the entire cast, especially by Maiara Walsh and Bryan Bockbrader, which is doubly impressive considering Bockbrader also directed the film. Seeing film legends Tony Todd and Danny Trejo act in a low budget indie film was also cool, and to see them actually go for it instead of just cashing in their performances (which they could've easily done) was especially refreshing. The uber suspenseful Tony Todd scene is one of my favorite moments in the entire film and I'm sure I'm not alone there. (Spoiler Alert) I won't mention anything too specific, but I will say that the twist/turn that occurs in the third act was both completely unexpected and extremely well executed. This is probably why I enjoyed the reveal so much in all it's bloody glory. Newcomer Adam Guthrie deserves special kudos for pulling off this absolutely insane sequence. (Double props to the F/X guy) As a self-proclaimed film buff, and a working filmmaker myself, at the end of the day I judge a movie by three basic qualities. Was I engaged through the entire film, did I enjoy watching it, and did I think about the film the next day. Vanish passes all three tests for me, which is why I would recommend it to anyone who likes this genre of cinema. Just don't watch Vanish alone with your grandma...unless she's into the whole ultra violence thing.","user":"Huntergun","rank":[94,105]}]