[{"title":"the badenbad ,and ugly ugly","rating":3,"date":"31 January 2019","review":"This was an uninteresting amerivan vigilate humour, mixed with spaghetti action,and spiced with mexican chilli in the eyes shootouts movie made to show that a feature movie is not that difficult to make. just make a taste of the music featured in the background,its an everlasting self repeating tune,that irritates the bones of your middleear into a big bon heur. its the revengeful,black clad,overly maked up lady with the longest shooter in the world running aroung killing siblings and half sibs and hired killers that are hired to kill her.<br><br>the story has surtainly been inspired by chales bronson flicks . the story has got some liability, but the filmography,acting and editing+ extremely sparse use of sound effects make s this film,that makes you wish it ends asap. do watch at 1,25x speed to make some fun outta the stiff movements,because else it is not memorable at all.","user":"ops-52535","rank":[9,14]},{"title":"I went in hopeful...","rating":4,"date":"15 July 2019","review":"I thought I would be on the edge of my seat with a female lead action thriller, but to no avail... The dialog was choppy and difficult to hear. The editing was, interesting at best. The story seemed to be all over the place. I went away disappointed. The only bright spot for me was Beau Yotty (Antonie). His performance actually got me through the film. So bravo to you sir. That was an accomplishment. He saved this film from a 1 star rating.","user":"sidhtownsend","rank":[4,5]},{"title":"Jesus, how could this bad movie ever be able to be approved into production?","rating":31,"date":"31 January 2019","review":"After watched so many bad bad childish stupid shallow movies out of China these years, I thought there would be no movie made in the USA could be worse than those Chinese movies, but it proved wrong after I spent ten minutes watching this awful one. What a shock, dude.<br><br>But there were two things in this crap that I still think enjoying watched: 1) The classic DeLorean sportcar. 2) The nice gated community after this so-called \"lonely woman\" drove the Delorean through the gate. That's it, folks.<br><br>This is a fair warning from me: Don't you ever waste any second to watch this crap.","user":"LogicIsEverything","rank":[11,23]}]