[{"title":"Even though it's a bit predictable, it's very entertaining with a good message","rating":9,"date":"18 November 2013","review":"This is a uplifting, coming of age film. The story is about Pete (Zachary Gordon) a middle child who has the worst Christmas ever. He wakes up the next day and realizes...it's Christmas day again and again and again... Will Pete fix Christmas and have the best day of his life or will he be stuck in the same day forever?<br><br>What I love about this film is the cinematography. The Christmas decorations and snow look amazing. The sets create a great atmosphere for the film. I also like the story. At first it seems cliché - boy has a bad day and has a chance to fix it - standard issue. However, the pacing is different. Instead of it being just a few days of Pete reliving the same day, it feels like months before he realizes that he can affect the outcome of his Christmas. At first I didn't like this, but once I thought out it as a coming of age film I accepted the change. One think that was distracting to me is the writing. Don't get me wrong, the dialog is fine. I just think the set-up for the story is rushed. The writers wanted the story to go a certain way and forced it by placing the pieces together instead of writing as if the characters were living through this situation.<br><br>My favorite character is Grandpa (Bruce Dern). He's a grumpy man who doesn't want to get the cold shoulder this Christmas. I love how Bruce plays this role, how he wants to spend time with family. Sadly he wants Christmas to be like his dead wife's Christmases. In his mind, the family doesn't celebrate it right.<br><br>My favorite scene is when Pete tells his dad why Grandpa judges their Christmas. I pick this scene for one reason - the reaction on the father's face. He takes his time to roll through all the emotions and it's just perfect.<br><br>The moral here is, \"It's not what you put in the box that matters. It's what you take out.\" No matter how much Pete recreates Christmas and gets what he wants, he stills feels that something is missing, something that is important in Christmas. Giving! <br><br>I rate this 5 out of 5 stars and recommend it to 6 to 15-year-olds. Younger kids can enjoy the funny moments and the merriness. When you get a little bit older, you know the story is predictable but it is still a movie to get you into the Christmas spirit.<br><br>Reviewed by Keefer B, KIDS FIRST! Film Critic. For more youth reviews, go to kidsfirst dot org.","user":"rannynm","rank":[25,28]},{"title":"Well above average Christmas TV movie","rating":8,"date":"8 December 2015","review":"This is a made for TV movie about a teenager who has a terrible Christmas day but gets to re-live it again and again. He gets the opportunity to change the way Christmas pans out. <br><br>It's a good natured tale and is very entertaining and while not laugh out loud funny, there are plenty of good light hearted moments. In addition there are also a few poignant moments. The setting is great but what makes this a well above average TV movie is the talented and likable cast. Whilst many TV movies suffer on this score, this one has a cast that features no weak links at all. Zachary Gordon is great as the teenager coming to terms with groundhog day and Bruce Dern adds class as the grumpy grandad. Bailee Madison also shines as the girl next door, putting in a very natural performance. <br><br>The usual Christmas messages abound but are dealt with here without the usual schmaltz. This has the feel of a much higher budgeted movie and is one of the best Christmas TV movies I've seen. <br><br>This is one of those films that is much better than you think it will be. As an easy to watch Christmas film this really hits the mark.","user":"MattyGibbs","rank":[7,7]},{"title":"Pretty Good","rating":6,"date":"21 December 2017","review":"Surprisingly good film, which keeps you interested throughout. Had there never been Groundhog Day, it would be 1 or 2/10 more than this vote. As there has been Groundhog Day, on a similar premise you cannot help but compare them. This is not as good as that was, the lead boy in parts can be a little peculiar as are the family and grandad for the earlier part of the film.<br><br>But the film doesn't always go exactly as you will expect and it is never dull and comes together well in the end.<br><br>6/10","user":"Gubby-Allen","rank":[3,3]}]