[{"title":"True British grit, I liked it.","rating":8,"date":"13 July 2015","review":"My first review. A disclaimer: I like most movies I see; I fall into the story and get lost, and I am very willing to suspend disbelief. Bad acting distracts me more than anything and I did not see that in this movie. I saw: good actors, gritty men, tough characters, a guy put into an impossible situation, suspense, violence and interpersonal relationships between family members and between violent and dishonest men. Hard men, career gangsters. A young man's life on the line, in a no- win situation, held prisoner by the bad guys and ordered to crack a safe, OR ELSE. And perhaps he will get the \"or else\" anyway. I give it an eight. I apologize that I am not as good a reviewer as most of you other folks who post on this site.","user":"Gorgo33","rank":[6,8]},{"title":"That rarity, the above average British gangster drama","rating":6,"date":"26 August 2017","review":"This is substantially better than ninety per cent of the British gangster pictures shown on the TV station London Live, that repository of films that can't get screenings anywhere else. It's written and directed with flair by Andy Bloom and Mark Abraham respectively; and although, as another reviewer has pointed out, it owes a debt to Tarantino, it's no slavish imitation. Joe Cole is convincing as a heroin addict required to crack open a safe at a farmhouse where rival gangsters are soon at each other's throats. Dialogue is to the point and unaffected and it's no surprise that, despite their inexperience, Bloom and Abraham were able to secure a distinguished cast including Peter Bowles and Alison Steadman in cameos. Film doesn't outstay its welcome but would have been even more effective without the scenes of Cole talking to the ghost of his grandfather, a nothing part for the ubiquitous Phil Davis. But all in all a commendable effort that makes us look forward to whatever these new film-makers may try next.","user":"davidvmcgillivray-24-905811","rank":[3,5]},{"title":"Total blood indeed.","rating":22,"date":"22 January 2017","review":"Good surprise, damn excellent one. I did not expect so, but after all why not? Not many women in this brutal and bloody tale of a young man, grand son of a safe cracker who, after his grand pa death, is abducted by a bunch of hoodlums in order to crack a safe in an old mansion basement. And not in a bank. Maybe I missed something, but it is not explained how the safe arrived here, nor where it came from. But, I repeat, maybe I did not pay enough attention. This movie is in the RESERVOIR DOGS way of filming, and it is obvious that Quentin Tarantino's first feature inspired this one. But that doesn't remove anything from it. Although, it is not as good as the QT's film. Brutal, bloody and also a bit talkative, but who cares? One thing could have been better. In the youngster's memory, when he remembers his grand father teaching him how to crack a safe, he uses a drill, of course, and also a micro camera that he puts in the hole, in order to watch the safe combination. That's his memory, when his grand pa was alive. But in the reality of the story, when he (SPOILERS SPOILERS SPOILERS) finally opens the safe, we see no camera at all, only the drill and its metal support. <br><br>Good film anyway, but it will never be released in France, even in straight to DVD. Dead sure of this.","user":"searchanddestroy-1","rank":[1,2]}]