[{"title":"A love letter to Rocky and film fans alike","rating":10,"date":"25 November 2015","review":"There's no other way to say it; Creed is a knockout. <br><br>From start to finish, this film exhilarates and crackles with brilliant on screen performances and masterfully directed fight sequences. It wholeheartedly captures what was so brilliant about the first film: the characters. Yes, I'll return to theaters to see the fights, but it's the characters, particularly Rocky and Adonis that truly captivated me from start to finish. <br><br>I can't say enough great things about writer/director Ryan Coogler. The way he masterfully captures the modern spirit of Philadelphia and the visceral tension of standing toe-to-toe with a man who wants to see you hit the ground is second to none. What stood out the most, however, was his writing of Rocky Balboa. The subtle nuances that we love about the Italian Stallion are effortlessly worked into the script and flow like water from Sly's crooked mouth. Speaking of, the script would be for naught if it weren't for the beautiful performances by Michael B. Jordan and Sylvester Stallone. I'm not ashamed to say I was brought to tears at various parts of this film. <br><br>I'm just so happy to say that this film wasn't a disappointment. This film exceeded my wildest hopes of a 7th Rocky installment and had me feeling amped up for hours after the credits rolled. I can't wait to see more from the talent involved in this film, and I proudly endorse and recommend Creed to Rocky fans and film fans alike.","user":"kevinoliver94","rank":[315,412]},{"title":"An Exhilarating Showcase of Talent and Heart.","rating":9,"date":"25 November 2015","review":"Ryan Coogler's Creed delivers on everything that a great boxing film should, and represents a full return to form for Rocky. Directed by superstar in the making Ryan Coogler, and starring powerful performances from Michael B. Jordan and Sylvester Stallone the film is amazing. Creed is exhilarating, beautifully acted, while honoring the previous Rocky films lovingly. The film may be a little too familiar at times, but at least approaches it's overused plot lines with a different take.<br><br>From the opening scene the film captures your attention, showing us a glimpse into who this character is \"a fighter.\" The film remains an exhilarating journey with this character, who is easy to connect with. As the film progresses, Coogler mixes old techniques like the famous Rocky slow motion sequences, with newer (less used) techniques like very intimate fight sequences, where the camera helps the viewer feel like they're standing in the ring. The film will draw you in from the moment it starts, to the moment it ends.<br><br>One reason the film is so exhilarating is the terrific acting of Michael B. Jordan, who leads this journey. Once again teaming up with director Ryan Coogler Jordan anchors the film, and in the process creates a relatable, and human main character. On this note, after seeing \"Creed\" and \"Fruitvale Station\" I would be willing to make the bold statement that I think Ryan Coogler is on his way to becoming the next Scorsese. All of this being said what may be even more satisfying is seeing Sylvester Stallone return to form as Rocky Balboa.<br><br>Some may criticize the movie for not bringing a lot of original plot lines to the movie, they would be right. However, while not very original the film handles these plot lines from a different perspective. No longer are we watching the nobody rising up against the odds, now we see a man trying to get out of the larger than life shadows of a man he never knew. Those who love the Rocky films recognize the slow motion moments in almost every film, and the iconic way the boxing matches were choreographed. Creed departs from the overuse of slow motion and more adapts the fight choreography of Raging Bull, while still mixing the essence of the Rocky fight scenes. <br><br>The way Coogler mixes old with new in many different ways helps make the whole film feel like the story it's telling. Coogler captures the tone of the older Rocky films, while also making a film distinctly different. Michael B. Jordan and Sylvester Stallone deliver, and Creed ends up being exactly what fans hoped it would be. In the end if you have the time go see Creed, it's a terrific 2 hours to spend.","user":"tjgoalie13","rank":[151,223]},{"title":"With grit, style and substance, Creed goes the distance as an exceptional crowd pleaser.","rating":9,"date":"25 November 2015","review":"History has a strange way of repeating itself. 40 years ago, Rocky Balboa became a household name and turned an unwanted actor into one of the greatest success stories in Hollywood. The fact that Rocky (1976) won three Academy Awards including Best Picture is of little importance compared to the real life struggle behind the making of that film. For Sylvester Stallone, it was a rags to riches story that mirrored his real life struggles to make a decent and honest living. Cut from the same cloth maybe, but Creed is much more than just the seventh installment in the Rocky film franchise. As a no- holds-barred sports drama, this is every bit an exceptional crowd pleaser with a lot of heart, plenty of amusing jabs to the ribs, and an unexpected but emotional haymaker to the gut. And a lot more.<br><br>Co-written by director Ryan Coogler, there's no doubt that Creed is a passionate love letter to the first film, which in itself is a poetic love story about fighting the good fight. Although boxing is the central theme, and often frowned upon as a brutal blood-sport that causes serious injuries, it's never been about the fight but more about what you are fighting for. Coogler gets this spot-on when we are introduced to teenager Adonis Johnson in juvenile detention. We soon learn that Adonis is the illegitimate son of Apollo Creed, born shortly after the latter's death in Rocky IV. Appolo's widow Mary Ann (Phylicia Rashad) rescues young Adonis from what is certain to be a life on the streets and raises him as her own in the plush Creed estate in Los Angeles. Cut to present day and Adonis (Michael B. Jordan) is a corporate executive half way up the ladder. It's a stark contrast to Stallone's blue collar stiff in the first film, but this is where both films converge. Like Rocky, Adonis (calling himself Donnie) knows he is destined for something else, so heads to Philadelphia to meet his late father's rival turned best friend.<br><br>The meeting with Rocky is one of several great moments in the film while also serving as a nostalgic homecoming occasion for every fan of the franchise. It's a fascinating intersection of the past but none better than the fact that in many ways, Creed is an inverted mirror image of Rocky. And before sending this film off on its own pulsating trajectory, Coogler reveals a full hand of spades. One of which is the legacy Rocky bestows on Donnie, and in essence, Stallone handing over the franchise baton to Jordan. We may not realize this at first and that's because we are already smitten by the father-son relationship developing between Donnie and Rocky. Their character study is the most significant aspect of this film. Donnie has always been an orphan and the reason why he never took on his father's name is an emotional revelation. Who he is and why he wants to become a professional boxer is his darkest secret.<br><br>Both equally emotive and with comic interruptions, Jordan and Stallone deliver impressive performances. Stallone in particular gives what has to be his career best performance since Copland, and if this is his franchise swan song (owing to a devastating but befitting plot device) that's all the more reason why this film must be seen. But as they say, the show must go on and Jordan is more than capable of shouldering future films under the Creed banner. And with the inclusion of Philly local Bianca (Tessa Thompson), Donnie's neighbor and love interest, future sequels look to be set in Rocky's beloved hometown.<br><br>Onto the production quality and it suffices to say that Creed has THE best technical aspects in the franchise, including spectacular fight choreography, astounding cinematography in the ring and around Philadelphia, and an upbeat hip-hop soundtrack fused with the original score from previous films. The only real letdown comes from Donnie's main opponent (Real life professional boxer Tony Bellew) who isn't as antagonistic as you would expect, given the villainous ferocity from Clubber Lang (Rocky III) and the evil Ivan Drago (Rocky IV). But that's a minor blemish to an overall outstanding film made with grit, substance and style. At its best, Creed is a very intimate film for fans and newcomers and an undisputed knockout for 2015.","user":"LloydBayer","rank":[161,241]}]