[{"title":"Underrated and insane genius","rating":8,"date":"11 September 2014","review":"I've never been moved to post a review on IMDb but considering the number of Adam Sandler films that rank in the 6s something had to be done to make a case for this little gem. And a gem it is if, like me, you're a fan of the puerile as long as it's accompanied with a healthy pinch of sardonic humour.<br><br>There is something of the genius about this movie. Something refreshingly honest about the performances, the colour palettes, the lame jokes, the physical humour, the songs, the locations, the props. To get some of the references it may help if you've grown up in the UK during the 70s and 80s or currently have children under 16 however the appeal is somewhat broader and the performances from all of the cast are nuanced, tongue firmly in cheek and the pacing and story is gentle and above all it's just fun. Consider the fact that you've got Harry Potter alumni in the cast - Julie Walters and Jim Broadbent - stars of UK screen - then you know you've got a solid British backbone to play off. Harry Hill is unphased, effortlessly gooning about in front of the camera and then you've also got great performances by Simon Bird, a bewildered Johnny Vegas as the voice of Abu and also (pop band) the Magic Numbers singing a lovely song about running a Bed and Breakfast on the British seaside.<br><br>Yes it's silly, yes it's obvious, yes it's simple but it's also evocative of the past triumphs of niche British cinema. It nods to our failings and to our weaknesses and to our guilty pleasures - and even the obviously filled in bits (Brains on legs, random shell people) don't detract from the fact that's it's just fun. Like an updated an detitillated Carry On movie - it's the best of British and I hope they make a follow up.<br><br>Try it out, suspend your disbelief, have a giggle.","user":"richard-bown-104-573762","rank":[12,13]},{"title":"Underrated, pure gold for Harry Hill lovers!","rating":10,"date":"31 December 2013","review":"I saw this film today, and i have read some of the harsh reviews which this film has been given, and i thought differently. I am a massive Harry Hill fan, and i was excited to see this film, and I wasn't let down! A great cast including Matt Lucas, Julie Walters and Simon Bird, who provide lots of laughs! Matt Lucas is amazing, as always, as playing Harry's evil twin brother and it was great to see him partner up with Harry in this film. A crazy storyline, which is exactly what you'd expect from a genius like Harry. This film is really underrated and should get much more publicity than it has now.The poor previous reviews are from people who don't understand Harry Hill's sense of humour, a must-see if you are a fan of Harry Hill!","user":"johnwreynolds","rank":[26,38]},{"title":"Couldn't Stop Laughing!","rating":5,"date":"31 December 2013","review":"I went to see this film with my family of Harry Hill lovers, and I loved it! Harry Hill, Julie Walters, Matt Lucas, Simon Bird and Johnny Vegas were all fantastic. Saying this as a lifelong Harry Hill fan, I would recommend it if you've ever watched him. If you don't know or like his sense of humor then you will probably not like it. On IMDb, The Harry Hill Movie has too many bad reviews. This is because they do not like him. It should definitely be more popular! <br><br>There were loads of funny scenes, including a fight on top of Blackpool tower. The worst part was the end credits! He has a strange background in the film, because he has a twin brother brought up by Alsatians because his Nan couldn't look after them both because their parents went on holiday but ended up staying there.<br><br>Brilliant idea for a family afternoon if you need some comedy to liven up your day!","user":"sidward123","rank":[19,29]}]