[{"title":"Don't let the low rating fool you. This is a great movie!","rating":10,"date":"5 November 2015","review":"Learning to Drive (2014) was directed by Isabel Coixet. It stars Ben Kingsley as Darwan, a Sikh driving instructor, and Patricia Clarkson as Wendy, whose husband has just left her. Wendy has never learned to drive. (Not driving is fairly common in NYC.) Now she needs to learn how to drive, and she turns to Darwan to teach her.<br><br>This is the beginning of a relationship that takes both people down long roads--literally and figuratively. Wendy's rage and frustration are almost palpable, and Darwan has domestic problems of his own.<br><br>Clarkson and Kingsley are among the finest actors on the screen today. You expect stellar performances, and that's what you get. It's a pleasure to sit back and see them demonstrate their acting skills.<br><br>For some reason, at the time I'm writing this review, the movie has a dismal IMDb rating of 6.6. This doesn't make sense to me. My suggestion is to ignore the rating. We were able to see the movie on the large screen at the excellent Little Theatre in Rochester, NY. However, it will work well on the small screen. Find it and see it. You won't regret it.","user":"Red-125","rank":[31,34]},{"title":"Please just watch it (no clever title just see it)","rating":9,"date":"16 October 2015","review":"Darwan is a very busy man, holding down two jobs, one as a driving instructor, the other as a Taxi driver. One night he picks up Wendy and Ted, a very emotional argument ensues and he leaves her, explaining he doesn't love her anymore. Wendy's daughter Tasha tells her mum she needs to get her life sorted and to accept Ted's decision, and to start driving. After accidentally leaving a parcel in Darwans's taxi he returns in to Wendy, she asks for driving lessons.<br><br>Darwan has to put up with so much, the authorities questioning his being in the country, racial abuse from people. Being a devout Sikh his religion makes his life complete, nearly that is, until his wife to be turns up. <br><br>I am so glad I watched this film, it is so watchable, and truly enjoyable. It battles fears and overcoming them. It is very heartwarming in parts.<br><br>I needn't go too deeply into the performance of Ben Kingsley, fairly biased I know but whatever he does I love him in, he is an outstanding actor, he's great in this, but Patricia Clarkson is just so good, she puts so much into this movie, screen time between the two is magical.<br><br>Loved it 9/10 it's just a lovely movie.","user":"Sleepin_Dragon","rank":[23,25]},{"title":"Beautiful collision of culture and humanity with a master class of acting","rating":8,"date":"18 October 2015","review":"'Learning to drive' is a master class in writing; directing and of course the performance of two of the great character actors: Patricia Clarkson and Ben Kingsley. There is a nobility and dignity to the story that comes from a taut but compassionate screenplay; and the wonderful interplay between the two leads. Clarkson always makes such interesting choices in projects and this is no exception. Her 'Wendy' has a lot to process during the opening moments of the movie; and it is thanks to her exquisite timing and believability; that despite her cathartic scenes early on; perhaps because of them; the audience is with her and her scenario all the way! With the age old construct of an odd pairing; Kingsley's often Zen like 'Darwan' provides the calming influence and ultimately a reciprocity that gives this film its huge warmth and overall success.<br><br>In the role of Wendy's daughter is none other than the daughter of another cinematic delight - Meryl Streep: the uncannily voiced and mannered Grace Gummer. How daunting it must be for Grace and her sister Mamie, to hone a craft in screen acting with their legendary mother's presence in film culture. Grace displays her mother's exuberance and complexity with what is really only a couple of scenes here, but makes her mark. But the film, despite some other subplots and ancillary characters, rests with Clarkson and Kinglsey and they are just superb. <br><br>If the film feels tight and rhythmically organic; it is due to Martin Scorsese's long time editor Thelma Schoonmaker who brings Isabel Coixet's carefully directed piece together with ease and no fuss; giving it a smooth and perfect running time. This is no epic; no earth shattering movie; but a reflective and nuanced dance between characters from different worlds who collide in the nicest way possible and leave a significant imprint on one another. Not a new idea, but in the hands of these expert filmmakers; it is a joy to be in their audience for the hour and a half journey.","user":"david-rector-85092","rank":[18,20]}]