[{"title":"Why I avoided this film when it was released","rating":10,"date":"9 June 2018","review":"I despise movies where the premise is beyond credible. So after reading the reviews I decided I did not want to see another Face Off type transplant story. But wow, was I ever wrong. What I was missing is one of the best characters ever created by an actor and that was Kevin Costner's doing. He develops a totally believable and absolutely impeccable portrait of a sick psychopath who is greatly affected by an unapproved medical procedure. What is great is that he is not politically correct, weak, or conflicted. It makes him incredibly interesting in the age of weak males pandering to everyone. He gets to glimpse a normal life through the eyes of a strong man who is also moral which is the Ryan Reynolds character. He also gets to feel the love of a daughter and beautiful wife which he had never known before. All of the actors are great but Costner raised my opinion of his acting ability by a mile. The story and production is also excellent with an ending that is quite satisfying.","user":"jasontheterrible","rank":[52,64]},{"title":"Criminal: Thankfully an all-star Cast.","rating":5,"date":"13 July 2016","review":"This film has been saved by its stars: Ryan Reynolds first and Kevin Costner few minutes later will make you forget most of plot's unbelievable logical holes, awful editing (what's Alice Eve's end?), repetitive scenes and complete lack of bad guy's motive (Jordi Mollà).<br><br>And Tommy Lee Jones, Gal Gadot, Gary Oldman and Michael Pitt (Alice Eve here is little more than an extra) strive to fill with workmanship and dignity their otherwise gaunt supporting roles.<br><br>They all succeed in saving the day and in the end you won't fall asleep or leave theater in contempt. But on your way home you could probably comment that this is one of the most useless (or unconvincing) films you ever watched.","user":"niutta-enrico","rank":[73,107]},{"title":"Mixed but very watchable thriller.","rating":5,"date":"4 June 2016","review":"No spoilers if you've seen the trailer (oh and the trailer really is one of those where if you've seen it, then you've seen all the best bits).<br><br>Criminal on paper looks like a safe bet, it's produced by super 'B' movie producer Avi Lerner (Olympus/London has fallen, Expendables) has an A list cast and a much worn premise, along the lines of Face Off or Ryan Reynolds lukewarm thriller from 2015 Self/less, involving body/mind swap sci-fi, while being set in a present day surrounding.<br><br>The premise, Reynolds young spy has his memory's implanted into Kevin Costners gruff, violent criminal by Dr Tommy Lee Jones, overseen by mostly shouty Spy boss Gary Oldman, to stop some bad men doing bad things with hacking and missiles. Costner's criminal escapes and goes on a bit of a rampage through London whilst also wrestling his own violent nature against Reynolds softer character traits seeping through (so basically he's got a bit of a split personality going on).<br><br>In other words it's a silly high concept plot line to effectively have Costner run around a city, beat up some bad guys, get into shoot outs, chases and save the day.<br><br>He also along the way tracks down Gal Gadot who is Reynolds wife, and by far the best at delivering anything near a believable character, followed by Tommy Lee Jones (in a very restrained role) in a very mixed bag of a movie.<br><br>The film was made for around 30 million dollars, so don't expect much big blockbuster action, although the few car chases and explosions there are, are done decently, the film still at times feels quite cheap. The pace is a little off as well as its a bit of a slog and feels longer than it should at times.<br><br>In terms of tone it's violent, full of bad language, and seems to think both of those pass as humour, they don't in the context they are used in this film and are frankly pretty misjudged.<br><br>The performances vary, by far the worst being Gary Oldman who whilst normally excellent simply feels like he's in another film altogether at times, he literally shouts his scenes of dialogue at times when it seems a quieter authority would have been better suited.<br><br>As for leading man Costner, he's playing a pretty unlikeable fella here, so you would expect the filmmakers to try and inject some charm for an audience to sympathize or grow some kind of emotional attachment, but no Costner simply grunts and swears through most scenes in a gruff lazy drool, he's watchable as always but doesn't have much to work with here, though they do try to have him form a Bond with mother and child later on its quite late in proceedings.<br><br>There's some good touches, Gal Gadot brings out a softer side of Costner's character, there's a decent mix of Electro music and the film score used is atmospheric, some of the visuals are decent, shots of London for example and the action scenes whilst only short bursts are clear to see and not confusing and finally there's the thriller plot aspect of the story that plays like a standard spy/action thriller as our (anti) hero must set out to stop the villains and save the girl.<br><br>In closing, mixed performances, misplaced serious tone with violent outbursts of humour, some decent action but a bit of misguided film, watchable, not terrible but quite frustrating given the fact there's a better movie in there that could of got out.<br><br>3 out of 5.","user":"Rawin1981","rank":[45,64]}]