[{"title":"Blond on Blonde","rating":6,"date":"28 January 2014","review":"An idealized, idyllic and seemingly wealthy 1950s family of six is suddenly hit with great tragedy. Stripped of their material goods, the family must move into an isolated Gothic mansion. In Virginia, \"Foxworth Hall\" matriarch Ellen Burstyn (as Olivia) gives them a frosty welcome. She insists the \"four beautiful children with blonde hair and porcelain skin\" must live in the attic, because their ailing grandfather disapproves of their existence. Conniving mother Heather Graham (as Corrine Foxworth-Dollanganger) hopes to inherit her father's estate, but must keep her children a secret until the old man dies. Increasingly neglected in the attic, the eldest children struggle to care for the younger twins as skeletons fall out of the mansion's closets...<br><br>Ending with awkward abruptness, this is the first in a series of \"Lifetime\" TV movies based on Virginia C. Andrews' popular stories. A previous feature film cut subplots involving incest from the story, but this version includes the incestuous feelings. The \"taboo\" subject was an important part of the original novel, but it doesn't translate well. When we first see two of the characters in question, they have clearly experienced the \"body changing\" developments latter referred to in the script. They talk about school and appear at a well-attended party (unlike the novel). Since sexual interest has begun, their attraction is more difficult to accept. In most school settings, the top physical condition of these two would not go unnoticed by most classmates...<br><br>Attractively proportioned co-stars Kiernan Shipka (as Cathy) and Mason Dye (as Christopher) handle the leading roles better than expected. Still, when he gives her a cool \"punk\" hairstyle, we wonder who cuts and shaves Mr. Dye's always neatly trimmed hair. The young stars and director Deborah Chow excel in reaction shots. In the supporting roles, Ms. Graham and Ms. Burstyn are engaging. Graham's character is cast to the wind, unfortunately; to really impress, she needed a couple more scenes. Possibly at her own insistence, Burstyn's character is more fully realized; this actress brings something extra to the role and is more intuitive about the medium. The six producers had to be happy with art/set direction and Miroslaw Baszak's photography.<br><br>****** Flowers in the Attic (1/18/14) Deborah Chow ~ Kiernan Shipka, Mason Dye, Ellen Burstyn, Heather Graham","user":"wes-connors","rank":[22,24]},{"title":"Where Have All The Flowers Gone?","rating":2,"date":"20 September 2017","review":". . . . . and when will they ever learn?<br><br>That was what was going through my mind as I watched this attempt by Lifetime. Some have raved about it because it included more of the incestuous relationship between the two oldest siblings (toned down though it was for television) but that alone does NOT make it a better film. With one exception, the acting was atrocious. Heather Graham has given some decent performances over the years, but this was not one of them. She seemed to be sleepwalking through the entire movie. Kiernan Shipka was monotonous and irritating as Cathy (her voice-over included); Mason Dye was stiff, and there was no chemistry between Christopher and Cathy. Cory (Maxwell Kovach) and Carrie (Ava Telek) were pretty much non-entities in this version. Ellen Burstyn, fine actress that she is, gives a good performance but she was completely miscast as the grandmother. Not menacing, dominant or intimidating and far too sympathetic. It's hard to imagine the older kids being scared of her; the twins, maybe.<br><br>CGI took the place of the family mansion, Foxworth Hall (doesn't anyone scout for locations anymore?), and the sets, frankly, looked like sets. The music was also nothing special. Worse, the movie feels extremely rushed; while it is mentioned that Cathy, Chris, Cory and Carrie were locked away for nearly three years, no attempt was made to make them look sunlight-deprived or lacking for food. The bond between the two older siblings was downplayed, and their role as parenting the twins barely shown, making their closeness and growing romantic feelings for each other come out of nowhere. Christopher's ambition to become a doctor, which was an important part of his character and the story, is completely omitted. Cathy's love for dance is hardly mentioned, and they were not really locked away as they were in the book or the 1987 version. Corrine is such a blank slate and it's never explained why she left her kids there for so long. The attic seemed to have lost much of its significance as well.<br><br>While the 1987 film is flawed, V.C. Andrews did have script approval and the intent of the director (who also penned the screenplay) was to be as close to the book as possible. Unfortunately, a negative reaction at test screening caused the studio to severely cut the film and add an ending that fans of the novel rightly despised. Even with those changes, it is still superior to the TV adaptation in terms of acting, chemistry, location, atmosphere and music. Louise Fletcher was terrifying as the grandmother, and Ellen Burstyn just wasn't, despite giving the best performance in the Lifetime presentation. The 1987 movie has a very haunting feeling that will stay with you after it is over (helped by Christopher Young's amazing score). Let's hope that the original director's cut will see the light of day and will hopefully obliterate this vapid, hollow Lifetime tripe from memory.","user":"Noirdame79","rank":[11,11]},{"title":"Generic, glossy, and bland","rating":4,"date":"8 January 2017","review":"FLOWERS IN THE ATTIC is an ill-advised reworking of the classic Virginia Andrews novel about a grandmother keeping her grand kids locked up in the attic and the trouble which ensues. The film was already made, memorably, back in 1987, so why the producers felt the need to do another generic version I have no idea.<br><br>And I wish they hadn't: everything about this version of FLOWERS IN THE ATTIC screams play-it-safe predictability. The more shocking aspects of the novel are merely hinted at and what we get inside is a slick and glossy production with zero power. The only interesting performer here is the reliable Ellen Burstyn, tackling a horrid character with bravado, but the rest are terrible, particularly the young actors who are completely devoid of charisma. A sequel, PETALS ON THE WIND, followed.","user":"Leofwine_draca","rank":[8,8]}]