[{"title":"Should be titled 'Raven is a bit touched'","rating":1,"date":"14 November 2015","review":"The only thing right about this movie is the wrong story description  given here on IMDb. Just read that little short synopsis and skip the  movie!   So here is my synopsis of this movie - There's this crazy amazon  transsexual living in the woods and running around dressed like Tarzan.  Raven is the name and she likes to find interesting shaped bits of wood  and then takes a hunting knife or an ax to it to change it's shape even  more. Raven spends a lot of time running around the woods - remember  she's dressed like Tarzan. Every now and then old man Joe shows up and  he gets his jolly's howling (singing) with Raven.  Kate shows up with her two kids to camp in the woods. All she brings is  a tent and a couple of chairs. The kids (teens) don't want to be there  and I can understand why! Raven shows up like a wild beast and Kate  gets all hot and bothered when she sees Raven. In the mean time Joe is  wondering around town and meets Angela, she likes to cry. Then Angela  drives into the woods and kidnaps the kids! Kate &amp; Raven are at Raven's  house getting it on hot and heavy. Angela shows up and tells Kate she  kidnapped the kids but they ran away and are lost in the woods. Raven  puts on her Tarzan outfit and takes off running through the woods with  her little flashlight. One of the kids bumps her head and decides she  can't cope. Raven shows up and hugs the kids after she has shoved them  into an old hollow tree stump. Then there's a funeral for old man Joe  and a bunch of people show up at Raven's house and go inside! The end.  Oh, and Raven at this point is wearing a dress!   So my question is - \"Who snuffed out Joe?\" Raven and the kids? Kate who  stayed at Raven's house while Raven ran through the woods looking for  the kids? Or was it that Angela - maybe that's why she was crying! Ha  Hah!","user":"cekadah","rank":[15,29]},{"title":"Better luck next time.","rating":1,"date":"18 April 2016","review":"This film is not worth watching.Sorry, Webber ,Tracie Dinwiddie can only be type cast opposite Necar Zadegan. I just felt like the casting was just wrong. Secondly there is not much of a storyline to fall in love with. The love scene was so random not much chemistry between the two protagonists.Chemistry between two people on screen is the essence of a love story. When making a lesbian film please take some notes from Josephine Tengblad producer of Kyss Mig and also Ich will dich these are two brilliantly crafted films.A beautiful love story between two women is all I want to watch and the films just mentioned epitomize beauty.This film did not do anything for me.","user":"venisefillies","rank":[5,9]},{"title":"A different film to the one described here","rating":7,"date":"8 November 2015","review":"It's nothing to do with a boy and facebook; it's a lesbian love story... how did that description get applied and stick? It's mainly set outdoors and the internet, let alone Facebook, doesn't feature.<br><br>Raven, a wild woman of the woods has encounter with family camping and is hostile at first, but a friendship develops and we find out she is grieving the loss of her niece. She teaches the family a few basic survival skills and their respect for her grows. We're introduced to Joe, a caring older guy who understands Raven and they make sweet country music, living quietly in the woods. Kate, the mother of the children Maya and Jack meets up with Raven at her cabin and they embrace and kiss. No words are spoken. The mysterious Angela watches the family from afar and gets Maya and Jack into her car, to take them into town but an argument ensues and the children jump out at Highway 22 and run off into the woods. Angela finds Kate and tells her what happened. Meanwhile, Maya stumbles and hurts herself. Kate runs to Raven's cabin and tells her Maya and Jack are lost in the woods. Raven knows the woods like the back of her hand and can work out the most likely route Maya and Jack will have taken. Will she save them? Well acted, thoughtful film.","user":"paul-smeenis","rank":[5,9]}]