[{"title":"Good, fun flick for all ages","rating":9,"date":"16 January 2017","review":"Not sure why so many are hating on this one, or basing reviews on what happened before it got to screen.<br><br>Took my 4-, 8-, 12-year-olds to see it on Saturday. All three of them enjoyed it, and I did, too. Simple enough story for the kids to understand, with little in the way of violence, profanity, sex to battle through. <br><br>Acting was good, as was the CGI. don't go in expecting The Godfather or anything -- but for a family-friendly flick with a good message, this serves its purpose extremely well. The \"monsters\" are cute enough for the most part and, when they bare their teeth, it's Star Wars-level \"scary\", if that makes sense.<br><br>Overall, check it out.","user":"davepond","rank":[59,65]},{"title":"Worth watching...It's not a remake, not a reboot and not based on existing material.","rating":7,"date":"14 January 2017","review":"I want to commend the filmmakers on this film. There was a lot of bad press about it even coming from the studio as writing it off as a loss before it was even released. <br><br>My kids (11 and 8) have been wanting to see it since we saw a trailer ages ago. I thought the concept was a bit crazy, but it did seem like fun. <br><br>After reading that Paramount was already writing it down as a loss, pretty much told me the movie must not be that good. I didn't want to not take my kids just because of that. <br><br>Cut to today. We saw the fist showing this morning. I have to say the movie was a lot of fun. It called back to films from the 80's when I was a little film-goer. Director Chris Wedge really made a fun film that has monsters and trucks, it truly lived up to it's title. I feel like he (the director) was really pulling from films like the Explorers, Flight of the Navigator, and a bit of Gremlins. Funny, action packed and not long for the sake of being long like so many movies today. It told a cute story and let us on our way. <br><br>About halfway through the movie, I realized why I was enjoying it. It was not something from another property, no comic book characters, it wasn't a sequel. It was something to get wrapped up in and enjoy. <br><br>I just wanted to say that we really enjoyed it and I hope more people give it a chance. It's not going to solve the world's problems, but it's certainly going to entertain you. First thing my 11- year-old said after it was over was, \"Can we see this again tomorrow?\" Not sure if there is a better admission of how fun it was. <br><br>Very fun!","user":"markdinatale","rank":[63,70]},{"title":"Great fun for kids","rating":10,"date":"3 January 2017","review":"I took my youngest child, six years old (nearly seven), to see this yesterday. He bounced around like Tigger the whole way through, and only paused to turn around once in a while to tell me \"This is the best movie ever!\" This coming from a boy who loves everything from Harry Potter, Star Wars, Top Gear (and Grand Tour), to Tractor Ted and Octonauts.<br><br>As an adult, it was a perfectly acceptable way to spend a couple of hours enjoying the company of my child. There's not a lot to the story, so if you've seen the trailer you won't be surprised. The monsters straddle the line well between being \"monstrous\" and cute (my boy acted suitably scared until it became clear that the monsters were on the good side, after which he loved them).<br><br>He came out of the cinema asking when it would be available on DVD, so on balance a glowing recommendation from a 6 year old and a warm fuzzy one from me.","user":"ross-988-436610","rank":[65,80]}]