[{"title":"Movie magic","rating":8,"date":"18 December 2015","review":"It could be viewed as a Korean take on the great \"Crouching Tiger Hidden Dragon\" but the movie has enough substance to stand on its own feet. The cinematic qualities are most impressive. Camera work, lighting, colors...it never stops to look beautiful. If the Shakespearean drama in the story doesn't put you away, be sure to not miss this one. Also, do yourself a favor and watch it in the cinema or at least from a blu-ray. The visual feast you will be getting is worth it. Just a warning: It's not an action movie. It's much more drama than action and even when action happens, it's mostly highly stylized. As for the acting, Byung-hun Lee is the memorable person in this. He really shines as the somewhat confused villain. Rest of the cast I'd probably just describe as OK. My movie-loving heart was glad I got to watch this and is looking forward to future Korean epics. :)","user":"shinji-ikari-1","rank":[16,18]},{"title":"Though it was well done. Found it romantic and I love the sword play.","rating":7,"date":"1 September 2015","review":"I just saw another Korean epic called Assassination last week at my local theater so I thought I give this one a shot.<br><br>The two movies are similar in their epicness, as they both had great cinematography that made it feel like a painting come to life and they seem to be working a very large story with lots of elements but is not too hard to follow, which is good for me cause subtitles can be too much to read sometimes. The scope of Memories of the Sword was big and long (at two hours and sixteen minutes), and covered a lot of drama. <br><br>I don't think I've ever seen Lee Byung-hun, who I know to be a actor from Korea, in a Korean film. He's somewhat a thing in the states, so I assumed that made him a huge star in his native land. It's the first time I did not see him in an action film with his shirt off holding a sword. It's a little misleading for those of us expecting more battle scenes from him, instead he plays more of a dramatic role that evolves romance, which I rarely see in Asian films cause I mostly deal in marshal arts action.<br><br>Which the movie does not have a lot of, but the little it does I was very impress with. Overall it was not a bad movie to sit through.","user":"subxerogravity","rank":[13,18]},{"title":"it's not Crouching tigers & Hidden Dragons","rating":8,"date":"25 January 2017","review":"Far from it, it's look alike in the way it's set, but this movie gets its own soul.<br><br>it's not a story, it's poetry about Love, betrayal and vengeance.<br><br>Byung-Hun Lee is perfect playing a man consumed by greed who rise from nobody to one of the most powerful lords in the area, killing everyone who stand against him. Do-Yeon Jeon play his love and the mother who raises her girl to be the hand of justice. Go-Eun Kim is the One,raised to kill the 2 persons who betrayed and killed her parents. all are magnificent in their roles.<br><br>it won't go as attended for all of them, but, you must see it by yourself, I insist, you won't be disappointed.","user":"pgaucher683","rank":[4,5]}]