[{"title":"made in Canada","rating":7,"date":"7 October 2013","review":"If you like fashion, you might enjoy \"The House of Versace,\" a 2013 Lifetime movie about Donatella Versace's attempts to follow in her late brother's footsteps, and her battle with drugs and alcohol.<br><br>Versace's high-profile murder at the hands of a serial killer is only touched on. Enrico Colantoni is marvelous as the designer, and it's unfortunate that he only appears in part of the film.<br><br>Versace is shown to be the genius of the House of Versace, and he and his sister Donatella (Gina Gershon) are interdependent, more so than their brother (Colm Feore) who handles the business side. Donatella is ambitious and wants her own line; while Gianni will defer to her as a stylist and believes some of her ideas are brilliant, HE is the designer and wants it to stay that way. They have some terrible fights but in the end they always reconcile.<br><br>It might have been during one of these fights that Versace changed his will and left everything to his adored niece, who was something like 13 at the time. Hurt, angry, and unable to keep the House of Versace solvent, Donatella turns to booze and drugs and loses her husband, Paul Beck (Alex Carter) in the bargain. The question is, can she turn the house around so her daughter has anything to inherit? This is not Schindler's List. It's very Lifetime and has a lot of material to cover in two hours, so there's some shorthand involved. We don't, for instance, get much into Versace's death, as mentioned before; nor do we get much insight into his life with his partner, and while we see Donatella cheating once, we don't learn much about her marriage or her husband.<br><br>Gina Gershon is, of course, much better-looking than Donatella Versace before or after she had her lips blown up, and she gives a good performance here. She is unrecognizable. Racquel Welch is absolutely gorgeous as Aunt Lucia, and I would have loved to have seen more of her.<br><br>As mentioned in the subject line, this is a totally Canadian production. Colm Feore, who plays the third Versace sibling, is not only one of the best actors around, period, but one of the biggest in Canada - a positively brilliant stage actor who occasionally takes a TV movie for the money.<br><br>Some nice fashion - again, I could have used more. Is this a fair representation of Donatella? Not sure, but she should have been happy being portrayed by Gershon.","user":"blanche-2","rank":[13,14]},{"title":"Interesting if too much about Donatella and not enough about Gianni","rating":7,"date":"9 March 2015","review":"This movie is more about Donatella than Gianni glossing over the murder and the life of Gianni but showing Donatella's meltdown and comeback. It's entertaining enough but maybe the focus could have been a bit more on before the death. The fashion shows and creative process are quite high energy.<br><br>Gina Gershon gives a good performance even if her figure is much too beautiful than the subject. Almost any actress would be way better looking than Donatella but she captures the essence with the lips and blonde hair. Enrico from Veronica Mars looks like Gianni.<br><br>Worth one watch.","user":"phd_travel","rank":[4,5]},{"title":"Living the life","rating":5,"date":"18 June 2015","review":"This TV movie based on the Versaces and their \"relationship(s)\" is nicely told. Of course there is an inciting incident with the husband (you might know what will happen, but it's about the reactions from others, especially his wife that drives this movie along). But we get a lot of other people who are somehow involved in all this.<br><br>Gina Gershon goes all in with this. And she's not afraid to show darker sides and vulnerability. Actually at times it is hard to feel any sympathy for her Versace (portrayal). But then again, do not forget, she's a human being fighting against adversary. That's not an easy thing to do. It's almost as difficult as a leopard trying to change his spots. A TV movie/drama of the week, based on and around a tragic event","user":"kosmasp","rank":[2,4]}]