[{"title":"You Will Not Like This Movie","rating":8,"date":"20 February 2015","review":"The very definition of \"not for everyone\", Tusk is an oddball, absurd, twisted midnight movie that plays more like a demented fever dream than a horror or comedy film. I'd never recommend it to anyone I intend to ever speak to again.<br><br>Here are the reasons why you won't like it:<br><br>1) It's unexpectedly surreal, with little interest in the laws of reality, or at least modern medicine and police work. And it's not directed in an obviously surreal, arty fashion like, say, a David Lynch picture, which makes it even harder to wrap your head around.<br><br>2) It's got an odd tone. There's comedy, sure, but it's mostly a slower, more cringe- inducing variety than Kevin Smith is typically known for. There's suspense, and a bit of gross-out, but the film evokes more unease than outright scares, and the grotesqueries are more evocative of a nightmare after eating one too many sliders than, say, Saw. And it swings freely between the two with no warning at all.<br><br>3) You haven't seen Tod Browning's \"Freaks\", a classic bit of cult cinema that Smith has made references to in other films. In fact, you probably don't even know it exists. (Cinephiles will notice rather direct references to many of Kev-O's other favorite movies as well, including Silence of the Lambs and Jaws.)<br><br>4) You're Canadian, and your country and culture are No Laughing Matter.<br><br>If for some reason none of the above applies to you, may I recommend \"Tusk\"? It's oddball, gonzo, at times self indulgent and slow, but also occasionally very funny and strangely thought-provoking, provided you're willing to go along for the ride. It'll make an impression...especially if your short-term memory \"isn't what it used to be.\"","user":"mjschwar-1","rank":[172,222]},{"title":"what the F did I just watch","rating":1,"date":"2 January 2015","review":"If I could have given this movie negative stars, I would have. This was accidentally rented after my Mother tried to rent Horns, and mixed her words, and came out with Tusk. We did not catch this until about an hour into the movie, in which the man was mutilated and turned in to nothing but an innocent walrus. Then, the movie had the audacity to end as the man being left in a walrus cage, at a wildlife conservatory, being fed a raw fish, by his love. Not only do the sounds of the human thing still ring in my ears, but I am having a hard time looking at a picture of any walrus, and I fear that I will never be able to look at one again. I am truly mortified that I watched this film and I do not understand how it was made. On the same note, it's going to be fantastic recommending this total psychopathic movie to all of my friends, and waiting to see their reactions. Thank you Kevin Smith for ruining walruses. And any future zoo trips. I'm going to ask you kindly to never create another animal movie while on drugs, especially about giraffes.","user":"rvenegas1","rank":[119,167]},{"title":"A film of two halves","rating":5,"date":"6 August 2015","review":"Ah, Kevin Smith – I knew him well (mainly in the nineties during his Clerks, Mallrats and Chasing Amy period). I would always say that he's one hell of a writer of dialogue, whether his work falls straight into the 'comedy' bracket, or he dabbles in other genres, i.e. romance, science-fiction fantasy or horror. And, this time round, he's playing with the 'horror genre.' 'Tusk' tells the tale of a complete idiot (played delightfully by Justin Long). He's a typical product of the modern age – a podcaster with ideas way above his station. Yes, he's a little bit famous, but it appears that a little bit of fame corrupts almost as much as absolute power. He thinks he's 'it' and lets everyone know it, whether it's his co-presenter, his doting girlfriend, or generally anyone he meets along the way.<br><br>One article on his upcoming podcast is an interview with a Canadian 'celebrity' who's also made his name on the internet. Sadly, the 'celebrity' in question is so traumatised with his newfound fame that he kills himself, 'selfishly' leaving our glorious podcaster with nothing to report on while in Canada. That's when he happens upon an interesting offer in a men's restroom. It leads him to a reclusive hermit, played brilliantly by Michael Parks, who offers to tell him his life's story.<br><br>This is the fun part. The interaction between the two is just about as perfect as dialogue can be. The two exchange tales and taken on life in the setting of Park's Gothic mansion. The tension is cranked right up to the max – you know something is going to happen (something bad, obviously), but you just don't know what. This atmosphere is just electrifying when combined with the snappy dialogue. Everything is going great until...<br><br>...the film just kind of switches atmosphere and great dialogue for cheap shocks. And shocks that look pretty bad rather than shocking. The second half of the film is everything that the first half isn't, i.e. cheesy. Yeah, there are a few moments of brilliance thrown in there, but, when you realise what's actually happening, you'll probably just shout, 'What... seriously?' It just doesn't work. It feels like someone has tacked a second (lesser) film onto a good one. If I was rating the first half I'd say it was awesome. If I was rating the second half I'd say don't bother. Fans of Kevin Smith may like the dialogue (like I did), but most people will not really go for this on account of the sudden change in mood that doesn't fit where the film was originally heading.<br><br>Best to watch this one for free however you can before you invest in actually paying for it. Some people may find the second half as shocking as it was intended. Personally, I just found it a let down and stupid. Pity.","user":"bowmanblue","rank":[36,47]}]