[{"title":"Excellent series. True to the gaming roots!","rating":10,"date":"28 May 2014","review":"If you are a fan of the original SF games, you will love this. This series gives new birth to the street fighter franchise. It sticks to the authenticity of the game series and does a great job of portraying the street fighter characters that you loved as a child. The action sequences are amazing and executed very well along with the special effects which are not over the top. <br><br>The story is very well scripted and is true to the video games.The origin story of Ryu and Ken is very authentic and the focus on the details makes it satisfying to watch. The creators of the show have done a great job of capturing all the little details that make the characters so memorable. <br><br>As a hardcore fan of the street fighter games I hope this is the start of something great and look forward to future episodes. Would love to see more of the characters being introduced into the series. Shoryuken!!!","user":"burhanrajbhoy","rank":[76,86]},{"title":"Finally STREET FIGHTER is done RIGHT !!","rating":10,"date":"1 June 2014","review":"After years of disappointment from Hollywood putting out horrible films of this beloved video game franchise, now we have an independent director come and do the film JUSTICE! This was just greatness. I've played Street Fighter all my life and now recently have become an even bigger fan because of this movie. Street Fighter Assassins Fist is what the fans have wanted for so long!!!!! <br><br>I applaud everyone who put their hard work into doing this project and hope for many more in the series to continue!! It also inspires me as a martial artist to continue my training further. The movie really goes in depth storyline wise and that is what makes this project such a beautiful thing- sticking to the script!!! Why is that so difficult for Hollywood directors to understand ::shaking my head::? BRAVO on a job well done guys!!!! I'll be watching for future projects!","user":"grae_manta","rank":[64,73]},{"title":"The longest awaited game adaptation of all time...","rating":10,"date":"28 May 2014","review":"When I was a kid, Street Fighter II was my game. Apparently, it also was Joey Ansah's, and Christian Howard's, as well as Mike Moh's!<br><br>All Street Fighter fans who loved the lore and the martial arts of the game were disappointed never to be given a rich, powerful representation of Ryu and Ken on screen, except for some great anime versions.<br><br>After a long wait (about 16 years for me), Joey and Christian announced that they wanted to make a live action adaptation, and after another year and a half, with hyped up expectations, their team unleashed Street Fighter: Assassin's Fist onto the world. It is truly phenomenal. As a fan, and one with extremely high expectations, I was amazed at how these were blown out of the water with the great story given us with SFAF.<br><br>Do they actually Tatsumaki? Yes. Do they Hadouken? Yes. Do they Shoryuken? Yes! (No spoilers here, they show it in the trailer)<br><br>And the story is indeed great: it is intricate, starts in medias res with very interesting developments throughout. The friendship between Ryu and Ken is endearing. It is for fans (with lots of little references to various elements of SF lore) as for people who have never heard of the game, and it's not just for male audiences, girls have really enjoyed it too! (And not just because of Christian Howard being topless a lot in it.)<br><br>On such a small budget, it is AMAZING what they have done. The dialogues are good, the characters are well developed, the fights are fantastic. The ending makes me cry, but also leaves me wanting more! More of Gouken, Akuma, Ken and a lot more of Ryu, knowing where the story can take us from here!<br><br>The most imposing actors in the movie for me were Igawa (no surprise there) but also Akira Koieyama, who can be very impressive and compelling. But you can also see that there is room for growth in the characters of Christian and Mike, who did a great job and will look even better is a sequel.<br><br>Regarding the cinematography, wow. The shots are great, with fantastic views and angles. The image gives off a warm vibe, a strength of colours which just feels good to me as a viewer.<br><br>I truly hope that Joey, Christian and their team will get the proper funding for many more features and will continue (soon!) to produce more of this great story on screen for us!<br><br>In the meantime, I just want to say THANK YOU SO MUCH JOEY, Christian, JACQUELINE, MIKE, TOGO, AKIRA, PATRICK, and all the others for the amazing work done on the show, and EVERYBODY, WATCH THIS MOVIE!!! It's available online on the Machinima website!!!","user":"maoui84","rank":[92,108]}]