[{"title":"Could have been so much better","rating":4,"date":"18 May 2015","review":"The Lost World idea of finding dinosaurs in a remote part of the planet is not new. Peru as a location had the potential, but it was never to be. The idea of driving along a dirt road and labeling it remote for the purpose of the film is ludicrous.<br><br>Had they spent a week in a canoe and then 2 weeks trekking to their destination using tribal Indians as guides I would have believed it. Wearing sleeveless tops in a malaria-infested rain forest at night, camping in tents and carrying a table and chair into the jungle just doesn't make sense. Their packs aren't big enough for a day trip let alone a multi-day hike. The nights are remarkably bug-free, I don't know any animal that would come around a camp with a lite fire in it. They find an albino python and don't know its albino? They can hear sounds of something big for 3 days every night but no tracks or scats are found and the scientists don't even seem interested. No discussion on what it could be? Was it a Tapir or Pecari, or Caiman? No picket at night to set up cameras and try and find out what it was. How did they navigate, as I didn't see a compass or GPS on anyone? How did the rain forest suddenly become wet sclerophyll? <br><br>In the end, I just watched to see how many things I could spot that were wrong. . <br><br>Oh, and the cameraman is an idiot. In all very disappointing.","user":"triggersplace-82096","rank":[10,10]},{"title":"Oh dear!","rating":2,"date":"25 November 2015","review":"Wanted to waste some time and I most certainly did!! Shame a lot of low budget films nowadays (and this seemed very much like one!), seem to want to film in a self-filmed view! This film is not worth wasting your time on I'm afraid! Sometimes you get a lower budget gem and its worth it, like tremors, but this isn't anything great! I'd rather watch Cloverfield and thats saying something! Have given it 2 stars because I'm sure I've seen worse, but shut it out of my memory, and it did waste a little time (although not the running length of the film because fast-forward was used!! Thought I'd give a real review rather than sugar-coat it!!","user":"mattsilvey","rank":[7,7]},{"title":"Oh God, Oh God, Cameraman James, PLEASE for the love of God in heaven stop talking!","rating":3,"date":"6 June 2015","review":"This could have been an interesting movie, in spite of the \"found footage\" nature. The location was great, and the B-movie acting talent wasn't bad. Generally, I'm a B-movie fan.<br><br>Unfortunately, it is terminally mauled by the premise that a film crew with enough budget to hire a cameraman and a producer in the first place and fly them to Peru, manages to hire a cameraman so incredibly stupid that he doesn't understand that he is not supposed to walk last so that every moving shot in the entire movie is ankles, butts, and ground, constantly turn the camera around and talk to it, take shaky spinny camera shots from behind seats, behind people, behind rocks, behind trees, yammer on and on and on and on and on and on, and shoot perhaps 7x more shots of his producer's erect nipples than of the conveniently available dinosaurs that they eventually discover.<br><br>Imagine hiring Steve Stiffler from American Pie to work a camera on a documentary, and you pretty much have \"James\". Obviously, their SFX budget was minuscule and they wanted to conserve on-screen dino time, but instead, it comes across that James is so mind-numbingly moronic that when he's actually physically pointing the camera at a living breathing dinosaur, he'd rather turn the camera away and point it at his producer's face or nipples and talk.<br><br>Did I mention that James is also operating the only documentary camera in the history of documentaries that utterly doesn't have night vision? Because, well, why would you take one of those into a jungle? And they're sleeping in a tent, in the Amazon, with every window zipped up tight as a drum, because god knows that you wouldn't be seeking a breeze in a Peruvian rain forest -- or to well, be able to see out, using the night vision that you didn't bring. <br><br>Oh, or flashlights. Why would you bring flashlights to a jungle? Also, early on they lose their guides in a separate car -- who go forward on a one-lane road because they're scared, but who somehow vanish for the entire of the movie because they, I don't know, teleported to behind them, perhaps? <br><br>It's perhaps a minor complaint among all the rest, but if your car is stopped because it's broken the night before, it probably shouldn't just start and drive away the next day.<br><br>And in spite of the \"found footage\" nature of the film, including the \"we put this together by timestamp\" intro, the producer and professor survive. Meaning that it's not truly found footage at all, just film put together by the actual person who'd have been doing it anyway. But of course horribly in any case, because cameraman James.<br><br>Unfortunately, no dinosaurs eat James. God, was I rooting for them to do so. He does die at the end, though. So yay.","user":"user_unknown-49930","rank":[6,6]}]