[{"title":"Low budget, bad acting but a good story.","rating":3,"date":"22 February 2018","review":"I decided to watch this because no one reviewed it. When it started, the acting was comical and I almost turned it off. I obviously didn't though, lol. I managed to watch it till the end. The plot was different, it was original and with better acting, more money and better plot surrounding it the movie may have been a very good movie. Putting aside everything and looking at why they made this movie, the movie itself is good. It puts a face and shows empathy to the puppy mill industry. However, the acting like I said was at times horrific. And it really got dumb when Milo was looking for Lester. Like really? Save yourself dumb***, come back for the dog smh. I wanted to see the end, so I guess that says something. But the movie is no academy award winner that is for sure lol.","user":"dejavuicutooo","rank":[4,7]},{"title":"Mysterious disappearances","rating":2,"date":"30 August 2018","review":"The cover was cool and creepy and the premise was sort of interesting. Also someone with a general appreciation for the genre it fits under. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there, made me though apprehensive, though there is no bias intended as there are good low-budget films out there. <br><br>'Days of Power' does not live up to its cover, which is much better than the film itself. It is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws present in those films are here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'Days of Power' is really bad with not much point to it, didn't see much reason to why it was made to be honest, with so many huge flaws and doesn't do enough with its potential. There is very little to recommend here.<br><br>Lets start with the positives. The music is both haunting and catchy.<br><br>'Days of Power' also starts off quite well, both intriguing and creepy.<br><br>Going on to the negatives, after a decent start the story does feel over-stretched and some of it comes over as vague and under-explained in the last third where the film especially became duller, more predictable, more senseless and less unsettled and never gaining momentum. The ending is ridiculous. All the characters are too sketchy and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates. The chemistry lacks character or punch.<br><br>The sound quality is obvious and utilised cheaply (being too loud in the build ups and people's reactions) and most of the acting seemed unsure and characterless with Eric Roberts looking like he wanted to be somewhere else. <br><br>Dialogue is very stilted and rambling. Found too many of the supposedly shocking moments not surprising and very bland and the atmosphere dreary, due to the excessive obviousness, a lot of idiotic and vague moments and explanations and the lack of tension and suspense. Thrills are none, thanks to stodginess and excessive over-familiarity, and found myself never invested in the story, which tended to be overacted and statically directed. Action is relatively minimal and is static, while there is not much enlightening or interesting regarding the music industry, the thriller elements are hurt by no surprises or suspense and the mystery element is just too dull and daft, wasn't creeped out or biting my nails and rarely on the edge of my seat.<br><br>A lot of 'Days of Power' has underdeveloped plot elements and often nonsensical and confusing character motivations, while too many of the things to make you shocked when the film sort of gets going are far from creative or unsettling. <br><br>Everything is unimaginative and are more odd than anything else, completely failing to show any sense of dread. It all fails to thrill and is very predictable and the drama is overwrought. The direction doesn't show much engagement or ease with the material and the film is too darkly lit, shoddily edited and drearily photographed.<br><br>Concluding, very bad. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[3,6]},{"title":"Lousy editing does not make a movie better.","rating":2,"date":"23 April 2019","review":"When you have to do as many cuts and edits in a matter of seconds as this movie has, it's to hide the fact that the story and script is weak.<br><br>It's really weak - and no amount of fast cut frames and choppy editing can change that.<br><br>This is alright for a 5th grade project, but for a full feature film, this is poorly done from 2 minutes in.<br><br>It's boring from the start and continues throughout.<br><br>Go to bed and have better dreams - or worse dreams...whatever.","user":"casablancavic","rank":[0,0]}]