[{"title":"Girlfriend kidnapped and promoted to drugs courier. That's what I call a screwed up vacation.","rating":6,"date":"16 August 2016","review":"\"Crossing Point\" is that kind of action thriller you could hire with the dozen at the local video store in former times. It isn't very original and certainly it's not a groundbreaking film. Actually, you can safely put it under the category \"Haven't we seen it before?\". It certainly can't compete with, lets say \"Sicario\", which also takes place under the blazing Mexican sun. And yet it wasn't such a bad movie afterall. It's not just brainless action the whole time. It's more about the nerve-racking race of Michael (Shawn Lock) as he seeks his way to the Mexican border. Expect the known ingredients you'd typically encounter in such a Mexican drug story. First there's this Mexican beauty. Also there are some ugly and ruthless members of a drug gang. And finally a helpful local gang.<br><br>The basic story actually isn't so special. Michael and Olivia (Maria Gabriela de Faria) are enjoying a relaxing holiday in Tijuana along with two friends. They spend their time surfing and partying. Until Olivia suddenly disappears from the hotel and Michael ends up with four wrapped packets of cocaine. He must get those across the border within 12 hours or else he won't see his girlfriend back alive. What follows is a race against the clock including a confrontation with a local gang and invoking the help of a local criminal called Pedro (Tom Sizemore). And on top of that, there's this resolute police inspector Jesus (Jacob Vargas) who's determined to solve a case about missing young tourists.<br><br>You see. Nothing new and even the twist in the end isn't really surprising. But still this low-budget indie movie managed to captivate me. In addition, Shawn Lock played a convincing part as the desperate friend. Although the transformation from the attractive, cool, surfing friend into an extremely skillful defensive action figure (who could handle a handgun without blinking an eye), was a bit exaggerated. The least convincing roles were those of Gabriela de Faria, she just showed up to exhibit her irresistible beauty (with a steamy shower scene as a bonus, although it was strategically filmed) and the two surfer friends who completed the gang. Luckily the contributions of those two was fairly limited, because this wasn't exactly a paragon of good acting. Rudy Youngblood was terrifying as the mastermind Mateo, although it sometimes felt as forced acting. And this time I thought it was a shame that Tom Sizemore had a limited contribution and briefly acted as the local criminal. Compared with \"Weaponized\", his role here was acceptable. But the one who looked the most charismatic and convincing, was Jacob Vargas.<br><br>Altogether a not too bad action movie. Despite the limited budget, they've succeeded to create a mix of professional-looking footage, matching music and not so bad interacting protagonists. The action is not excessive but the pace is stunningly high. After seeing some crime films taking place in these parts of the U.S., I'm going to skip Mexico as a holiday destination for sure.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[5,5]},{"title":"A middle action movie with good action scenes: Watchable","rating":6,"date":"4 May 2016","review":"Daniel Zirilli pack a mid-level action movies; the best of the cast is Jacob Vargas but also Shawn Lock is a good performance as lead star; Tom Sizemore instead appears in only three scenes but it's okay, Luke Goss instead only makes a cameo.Also the rest cast is good and Ryan Youngblood is the film antagonist, but Maria Gabriela De Farià have the sleazy role of the film. Here action there get enough and when it comes to this kind of film is already a lot since the film is based on this, given that the plot is not original enough...Good action scenes for a middle action movie but in its genre still watchable...Curiosity: the film was shot in Mexico.","user":"Romulus1953","rank":[5,5]},{"title":"Cool, not your typical low budget flick!","rating":10,"date":"15 May 2016","review":"Felt like I had to watch cause a friend is in it and wanted to support. Cheesy poster got me worried. Well, believe it or not this film is actually quite cool.<br><br>It starts out somewhat generic but then takes off. And becomes a hell of a ride. Good acting. Fast moving story telling. Great sound and music. Love the dirty look of the Mexico stuff. The good cop is awesome, great to see him in his element, I remember him from one of my alltime favorites... good old \"Traffic\".<br><br>Not the masterpiece I'd see again but it's good entertainment and worth the one-time rental if you ask me. And since I'm proud of my friend who's in it I'm giving it the \"excellent-rating\" bump here on IMDb.","user":"benjansens","rank":[9,17]}]