[{"title":"Good-Natured And Satisfying Sequel","rating":24,"date":"24 August 2014","review":"The typical good-natured yet vulgar humour the four lads have offered for years has returned in this hilarious sequel to the beloved predecessor and television series. Whilst definitely more gross than the first film, this enjoyable instalment in the comedy series has a more cinematic feel set against the stunning Australian outback. A film that overcomes the flaws that were present in the first film. Whilst the majority of the laughs generated from the film were conceived from shocks and puerile humour, the general light-hearted look into the lives of the four esteemed teenagers leaves us contented with their satisfying conclusion.","user":"CalRhys","rank":[47,56]},{"title":"Inbetweeners on the Beach","rating":7,"date":"23 October 2014","review":"Actually in Germany they still used the title they gave the first Inbetweeners movie, which was Sex on the beach. Now they added \"Down under\" which stands clearly for Australia ... well and probably something else, but I don't have to point that joke out for you I reckon. Apart from weird German titles, this has a few things that work better than in the first movie, but the first had a different kind of charm.<br><br>Well at least for someone like me, who hadn't seen the TV show (and still hasn't). The four boys are at it again, though one of them seems to have hit the mother-load over in Australia. Which is the starting point of the new adventure and the reason they all find themselves in Australia. Predictable? Yes. Still funny? Also yes","user":"kosmasp","rank":[7,8]},{"title":"Did someone forget to write an ending","rating":6,"date":"7 August 2014","review":"As a inbetweeners fan of the series and first movie I was looking forward to this movie and cant say I was diappointed but then on the other hand I cant say it was anything else than OK.<br><br>There were enough gags in their as you'd expect and one or two are worth the money on their own but the script seems very contrived to fit in certain characters or in creating a reason for the movie in the first place.<br><br>The real thing that let this down was after 90 minutes of chasing trying to achieve their goal the whole movie is wrapped up in 2 mins and then it finishes apart from some Hangover-style end credit scenes.<br><br>This movie did all the classic inbetweeners things to the extreme , I'm not sure what they could do if they ever made a 3rd movie<br><br>All in all an OK movie but I wont be too sad it thats the last we see of them. <br><br>I'd be happier watching repeats of the TV series.","user":"poan-72-672014","rank":[16,22]}]