[{"title":"Complete Waste of time.","rating":1,"date":"2 September 2014","review":"DO NOT even bother to watch. this is a Complete Waste of time.<br><br>surely the script is written while on Cannabis.<br><br>Storyline is not consistent.<br><br>Characters are poorly created.<br><br>Fighting scenes are lame.<br><br>Low grade Actors and Acting.<br><br>This is a crime against the film industry.<br><br>Watching the movie was a complete torture.<br><br>One of the worst movies ever made.<br><br>It was so slow paced that I had to watch this with 3x speed.","user":"rubelraf","rank":[45,53]},{"title":"Don't bother to watch","rating":1,"date":"7 September 2014","review":"Couldn't make it through 20 minutes of the movie. Gun fire is so fake, Barbie is jealous. Plot is not that great either. Movie and explosive effects are so bad. I don't usually write reviews but when I do, it's either the movie is too awesome or the movie sucks to the core. Wounds are fake as well. Can't stand the fake explosions and the drone scene was abused through the movie.<br><br>Low budget movie. A good military rescue movie would be Black Hawk Down. The director of Sector 4 should learn from the director of Black Hawk Down. But I understand that sometimes it maybe due to the lack of capital, however I would like to politely request future directors to NOT make movies if you have a low budget especially military movies. I was so happy initially as I thought it was going to be another awesome military movie. Do not be fooled by it's awesome poster/cover. Follow the saying \"Don't judge a book by it's covers\" how true!","user":"Singaporean94","rank":[13,14]},{"title":"Awful movie","rating":2,"date":"13 December 2014","review":"After reading the write-up of this movie, i thought it was going to be pretty good, but i wouldn't recommend this film to anyone.<br><br>Acting is way below par, it just gets really annoying<br><br>Casting is totally incorrect, i could have found more suitable actors myself!<br><br>Storyline isn't too bad once you think about it, but the way its executed onto this film is rubbish, they seem to drag the film out with pointless montages that is also really annoying!<br><br>For an action/war film,there isn't much action! And when there actually is, its all choreographed terribly<br><br>This is probably the worst film i have ever watched.","user":"danielrjt","rank":[11,13]}]