[{"title":"Not the greatest sequel.","rating":7,"date":"22 February 2020","review":"After watching this movie I can say that no it is not as good as the original but that does mean that it is a bad movie. What I was really excited to see in this movie from the trailers was the scares and the demon nun Valak. The movie does not disappoint and can't wait to see the next entry in the conjuring series!","user":"MR_Heraclius","rank":[37,39]},{"title":"An uncommonly strong sequel","rating":8,"date":"2 June 2016","review":"The Conjuring 2 doesn't waste time in bringing the scares in. By that, I mean you're pretty much in the thick of it from the get-go, being given some background (via another very notorious haunting incident) for what is to follow.<br><br>The Warrens are sent on behalf of the church to investigate some paranormal activity which is whipping up a media storm in Enfield, England and, as per the first movie, they go and attempt to work their magic on the situation. Once again, a family is being haunted and they fear for their sanity and lives. There are a few new twists this time round, so all does not play out as before - but it's not a complete departure from the format, which might have made it a bit more gripping in places.<br><br>James Wan's trademark visual style is repeated in this movie - his bag of tricks sometimes yielding a sense of deja vu but generally working like a charm. When it's intended to scare, it really does. The scares come a bit more frequently than in the first movie and do manage to build a lot of tension, even if you've seen the original, so well done to Wan for that.<br><br>What's really enjoyable about this movie, is its nostalgic recreation of 70s England. Wan has really done a great job of this, which is surprising given that he's not from there. Also, the central support role of Janet Hodgson is pretty crucial to empathising with the Enfield family and Madison Wolfe gives a solid performance.<br><br>It's arguable this one is as strong as the first. I really enjoyed it and would recommend it to anyone who enjoyed part one, or indeed likes movies of a haunting or possession theme.<br><br>Some awesome, unsettling and creepy music in places too.","user":"mungflesh","rank":[202,277]},{"title":"A rare horror sequel that delivers the same quality scares as its predecessor, courtesy of returning puppeteer James Wan.","rating":8,"date":"14 October 2016","review":"The Conjuring was a shocking horror film. It combined every creepy trope you can think of (ghosts, dolls, music boxes, mirrors, you name it), and it actually worked thanks to a genre-savvy director behind the curtains. James Wan has proved himself a capable producer on projects such as Saw and Insidious, and with The Conjuring, he cemented himself as a master of the genre. It had the perfect amalgam of horror tropes crafted in such a way that felt as fresh and spine-tingling as classic haunted house movies did in the '80s. The Conjuring 2 is another \"based on true events\" tale that has us follow expert paranormal investigators, the Warrens, this time solving the mystery of the Enfield Haunting. <br><br>Similar to the Amityville Haunting, the Enfield Haunting sees an English family plagued with a poltergeist that doesn't seem to enjoy the presence of anyone in the house. What The Conjuring 2 succeeds at is giving us both character development and another great story, which is exactly what a good sequel should do. The acting is uniformly great, but the true star of the film is James Wan. His shots are designed in a way to imbue dread and stir it around our heads for a while before hitting us with the scare. That's what true horror lacks these days, patience. The longer the anticipation is built and the more atmosphere is created, the more unsettling the situation becomes until it's like a ticking time bomb that you anxiously wait to go off. It uses familiar tropes, such as self-starting children's toys, slamming doors, and smashing furniture, but they're used as tools to mask the truly frightening fact that this family is up against something utterly beyond their control - they're hopeless, and we can feel it.<br><br>Mind you, The Conjuring 2 isn't without its faults. The runtime is a blatant offender. Pushing the 2-hour mark is never a good idea for a horror film, and some fat definitely could have been trimmed. There are a handful of cheap scares, audio scares to be precise - when the music gets extremely loud all of a sudden and you find yourself more annoyed than scared, quickly reaching for the remote to turn the volume down at the risk of enduring another ear drum shattering noise. It also doesn't feel as unique as its predecessor, understandably due to the very nature of sequels, but there are moments that drag on long enough to remind you that the first Conjuring didn't have these plodding plot points. For example, it takes about an hour for the Warrens to even get to England. Also, while in the haunted house, they're able to sleep through some horrifying sounds that would snap a bear right out of hibernation. But these dull spots and plot inconsistencies are few and far between.<br><br>The Conjuring 2 is how a horror sequel should be done. It's slick, stylish, fun, and at times, quite terrifying. When a horror movie makes me want to turn on the lights as I go roaming around the house at night, I consider that a job well done. The Conjuring 2, well done.","user":"lnvicta","rank":[59,79]}]