[{"title":"They did it their way","rating":9,"date":"22 February 2014","review":"Stromberg is, finally, great comedy from Germany, based on the super-successful British sitcom The Office. Unlike in other countries, it was never officially licensed, the production company BrainPool did their own thing based on the strong performance of actor Christoph Maria Herbst. After several very successful seasons, both with the critics and -- more importantly -- the audience they came out with a feature-length movie which transports the humor well to the much longer format. Although the concept ultimately does work better as a sitcom, Stromberg The Movie provides you with an ultimately satisfying dose of mundane office anarchy. I particularly enjoyed the reaction from the cinema audience which lapped up the harebrained, deliciously politically incorrect philosophy of Bernd Stromberg and his office guerilla. The movie feels like an extended version of the TV sitcom until the end, when Stromberg accidentally rebels against the drudgery of the allmighty Capitol Versicherung and becomes a modern-day Che Guevara. In the end, he comes out on top, although probably not for long. The system will take over and win. We are left to console us with the thought that everyone, even a Bernd Stromberg, can have his or her day.","user":"Karl Self","rank":[36,38]},{"title":"Successful ending to one of Germany's finest comedies","rating":8,"date":"16 September 2014","review":"\"Stromberg - The Movie\" serves as closure to the TV series with the same name which started roughly 10 years ago and was the German version of \"The Office\". The series was loved a lot here and the movie basically only happened because of successful crowdfunding. As a reward for the loyal fans, the names of those who gave money are shown in the closing credits to the film.<br><br>Admittedly the film needs a little while to really get going, but once it does it is equally entertaining as the series and you enjoy every minute of it. The moment they are about to enter the bus things get better and much more entertaining. I was a bit worried when Bjarne Mädel's character Ernie threatens to get out in case Stromberg takes the wheel, but obviously Ernie is too big of a character to exit the scene after 35% of the film. So he stays. Thank God. Actually i expected the bus driver to beat the crap out of Stromberg once he wakes up. Didn't happen though. Instead he runs into Stromberg's former superior at a pub? Well.. Okay. The other protagonists Ulf and Tanja meanwhile are busy with a little rascal boy they are considering to adopt. Later on they have a struggle with another insurance employee who makes salacious jokes about Tanja. I liked that part. Ulf reacted in all situations right the way I expected it. From bro-bonding with the guy to over-the-top aggression in order to show he is a man, it is all there. And Jennifer, as always, just can't do with or without Stromberg. There's not many new things in the film that we did not yet see already in the series, but that is fine. The old formula still works. The plot is generally-speaking very similar to the one used on a regular basis in the television episodes: Stromberg surges, falls hard, but somehow rises again his very own way.<br><br>It was nice to see Kurtulus and Berkel back, two of Stromberg's colleagues years ago, although my favorite choice would have been Mr. Becker. Always funny hey included him like many others with a short comment on how they perceive Stromberg.<br><br>There is some famous names involved with this production. The title song comes from Stefan Raab and the German Minister of Foreign Affairs has a brief cameo. Even if the ending and the way things went was really unpredictable, which I usually like, I was not too amazed by the ending sadly. The whole letting him go because he did not join the other managers at the brothel was not particularly credible and neither was Stromberg's rise to popularity in the population. The thing I liked more is how one party of course immediately recruits him to gain voters.<br><br>I found this to be a very funny movie and laughed a lot. Still, there is really no point in saying if you should watch it or not as I doubt there is people out there who consider watching this without knowing about the television series. Those who liked the series, will most likely enjoy this 2-hour-movie as well.","user":"Horst_In_Translation","rank":[6,6]},{"title":"Excellent","rating":10,"date":"4 September 2014","review":"Excellent German comedy. Here you can see the best from Stromberg. Its the highlight of the whole TV Show. Nothing is more crazy, arrogant, sad, stupid and funny. All the people in cinema were laughing very much. We had so much fun. We will order the DVD. I watched whole episodes of Stromberg Minimum 3 times. The Movie is the Highlight!<br><br>My wife also rated the Movie with 10 stars, even if she did not see any episode.<br><br>Worlds best German comedy movie (i am German and i don't like German movies, i hate them! this one not!)<br><br>So, if you are Stromberg Fan or even not, its a must watch!","user":"abramssammy-886-95931","rank":[7,16]}]