[{"title":"Ruby goes slumming","rating":5,"date":"23 October 2015","review":"Greetings again from the darkness. So this greasy, heroin-addicted slacker picks up a smartass tattoo artist while driving the Rolls Royce he has just stolen. What sounds like the beginning of a stand-up comedian's best joke, is actually one of the earliest scenes from writer/director Jake Hoffman's first feature film. That's right, you have seen him many times as an actor (he played shoe mogul Steve Madden in The Wolf of Wall Street), but now Dustin's son is a full-fledged filmmaker.<br><br>When first we meet Gus (Benedict Samuel, \"The Walking Dead\"), he can't be bothered to actually paint the wall he was hired to paint  \"It's already white!\" Once relieved of his duties, he heads home and white washes his apartment  not just the walls, but his TV, books and Jim Morrison poster. He claims all of his heroes are dead, and that he was unfortunately born in the wrong era  the 70's were so much more his style. He then proceeds to try and hang himself. Of course, he fails at that too.<br><br>Next we see him car-jack the Rolls and then Ruby (Krysten Ritter) is accepting his offer of driving her to Connecticut. Having previously rebuffed his advances at a local bar, it's obvious Ruby is intrigued by the banter and energy of Gus. The road trip brings it challenges and high points for Gus, and the two arrive at the communal retreat that features a mystic/yoga instructor (Goran Visnjic, Beginners) and a rock singer (Dov Tiefenbach), amongst others. Logan, the rock singer, and Gus softly battle for Ruby's attention, but it's difficult to watch as Gus drugs up and loses any sense of appeal.<br><br>It's not long before Gus is being bailed out of jail by his well-off dad  played by Jerry Zucker, who in real life, directed Ghost and produced numerous Hollywood films. The two share an awkward car ride to the home of Gus' bedridden mom played by Rosanna Arquette. Perhaps all of this makes more sense when you learn that Gus also takes life advice from his imaginary philosophical talking werewolf (voiced by Nick Nolte). Maybe this explains what those of us who don't shoot heroin are really missing.<br><br>The cast is strong, and each gives it their best shot. It's just not very entertaining or enlightening to watch some aimless dude drift through life while higher than a kite. What is clear, and has been to me for quite some time, is that at some point the right role is going to come along for Krysten Ritter, and her career will take off. She has had a solid career up to now, but next level is within her grasp. She has quite a screen presence  way more than the imaginary werewolf. Mr. Hoffman's feel for directing offers hope for future projects, and he is certainly to be commended for his use of cutting edge music. Next time  please give us a more interesting lead character.","user":"ferguson-6","rank":[14,17]},{"title":"I really wish i had read the rating on here prior to watching the film...","rating":4,"date":"11 April 2016","review":"though i probably wouldn't have then watched it, but that's my point. but u never know right? there are some films that get a low rating or people dislike &amp; i think are great (not tons, but a sprinkling) &amp; others that are very highly rated &amp; reviewed that i think are soooo overrated! anyway, i wouldn't say this film was \"bad\". i don't regret seeing it per se. i regret paying 3 different times on PPV because there was always some type of issue going on. AND i love krysten ritter (though she's getting pretty typecast now, coulda been her exact \"breaking bad\" character, et al), &amp; iggy pop was in it (LOVE), a lot of great actors in cameos basically. it was just kinda bleh. i was going to say nothing happened, but stuff did happen, it just was kinda pointless &amp; didn't really make me feel anything one way or another. THAT is how i judge films, on what &amp; how much they make me feel! along w/plot, character, storyline, acting, etc etc. cheers :)","user":"hedwig0109","rank":[6,9]},{"title":"Beautiful take on a 60s-70s theme","rating":8,"date":"10 March 2016","review":"Visually this film is stunning and the accompanying soundtrack is perfect. Choreography of the scenes is also superb.I would say this is the most visually perfect movie I've seen in years, bringing to mind The Blue Light, High Noon and other beautifully filmed movies whose images stay with you. Everyone but Krysten Ritter is perfectly cast. Unfortunately having been in similar situations when I was young, I know that she had no idea what this girl was like -- her lines worked, she just didn't know what person would be saying these things and she just isn't that person. It kept taking me out of the movie. Too bad, with better casting, it might have become a classic.","user":"Jumpygrouch","rank":[6,13]}]