[{"title":"No Skill Game","rating":4,"date":"10 May 2016","review":"A graduating class decides to prank a classmate at the beach which ends up in tragedy. What really happened is covered up. Sometime later the classmates are starting to die one by one. Who knows what they did last summer and who is going to die next? As you can guess this has been done a few times before but what is a little different is a creepy Marilyn Monroe mask and personally catered deaths. The way you died reflected what you did.<br><br>It wasn't gory but a couple of scenes had you cringing. The effects were pretty good but the cast however was awful. What was well done was you were always wondering who was under the mask. You think you knew who it was but then alas.<br><br>I was amazed at how awful these kids were to everybody. You here all the cruel jokes they played on people as they try and figure out who it might be which makes you feel no remorse for them(You also wonder why they aren't dead already).<br><br>A couple of cool scenes is all you get in this one. It just feels like a been there done that kind of film. Avoid this one or maybe just watch the last 6 minutes.","user":"shawnblackman","rank":[4,5]},{"title":"Solid Horror Film","rating":9,"date":"3 February 2016","review":"I really enjoyed this film. In the day and age where every horror film consists of found footage with untalented actors, this was a breath of fresh air. It had a great running suspense throughout the whole film, the cast was great, and the story reminded me of classics like Scream, and I Know What You Did Last Summer. It was a really taut film that paid homage to great slasher flicks of the past, while not being cheesy or campy in any way. I would definitely recommend this film to any fellow horror fans out there! You will not be disappointed! <br><br>Finally, I think this film is topical as it deals with the subject of bullying. Once again, it does so in an intelligent manner not commonly found in most horror films.","user":"Zane314","rank":[8,13]},{"title":"Solid acting, weird script, odd direction but not bad!","rating":5,"date":"26 March 2016","review":"First off, I will say this: the acting was overall very good, with only a few moments of the less skillful actors taking focus. That's not to say that all the minor parts were bad or populated by bad actors; on the whole, the acting was strong, and much more solid than you might expect from a film like this.<br><br>Second, I want to praise it for actually having the cojones to buck expectation and have mainly guys on display here, rather than the usual T&amp;A-fest. It's always welcome to see more guys show a little skin in these. There wasn't much of it in general, which kept the film feeling pretty dignified overall, and what was there was well-done.<br><br>The sound's good, the acting is good, the characters are well-cast, the effects (aside from the ridiculous surgery sequence) are surprisingly great, and the premise is intriguing.<br><br>But that segues neatly into the largest problem with this movie: its script.<br><br>It's too ambitious and ends up just being confusing, boring, and frustrating at turns. It tries to be clever too often and fails every time. We have too many dream sequences here, too many memories, too many red herrings, and just some very questionable stuff that tries too hard to mislead the audience...while at the same time muddling its own story.<br><br>The massive runtime is one thing that really contributes to a convoluted narrative. At almost two hours long, this film is way too lengthy. Things start happening very quickly, but that isn't really as good a thing as you'd think. That just means that it starts getting really confusing very fast, because it picks up basically after the story has started and run for some time. It's disorienting, since we not only have to become familiar with the characters, we also have to understand what is uniting them and the secret they have in common.<br><br>A big mistake the movie makes is just going off the rails far too early, though. It becomes outrageously over the top around halfway through, and it never really recovers from that. It just ends up looking silly and unbelievable, and it doesn't help that the development past that point is pretty ludicrous too. You'll think you've figured it out, because you'll spot the obvious red herrings (and the questionable direction doesn't help), and then it'll veer off in some random direction and end up not telling you anything when it seems about to explain.<br><br>Overall it hinges on massive coincidences, as if they had been planned for, and there's just too much that goes exactly as expected to be believable. It's all too convenient, especially when the killer's identity is made clear...or at least heavily indicated. Yep, that's right -- it never says it outright, which might have been handled well in a better movie. It wasn't here, it just makes it seem like the whole experience was pretty worthless and meaningless.<br><br>It literally would have made more sense and been slightly more satisfying -- still very stupid, but better than what we got -- if the last dream sequence in the hospital (if you saw it, you know which one I mean) had been the actual ending.<br><br>It makes me want to see the cast and crew do a better movie, honestly. Maybe one with a more consistent tone. Do they want you to take it seriously as a drama? Do they want you to feel like it's more of an old-fashioned slasher? Is it supposed to be totally over the top, or is it supposed to feel more realistic? They never really decide, and you can't really have it both ways.<br><br>It is worth watching at least once, though. It wasn't a terrible movie, it was just perhaps too ambitious for its ability to realize. It's certain to be a great time with friends, especially with some suitably adult beverages involved. If you like classic slashers and love a puzzle, this one will probably appeal to you.","user":"moonmonday","rank":[2,2]}]