[{"title":"Maddin's most impenetrable yet","rating":3,"date":"15 December 2015","review":"Canadian director Guy Maddin may be one of cinema's foremost practitioners of arty-fartiness, but he's certainly attracted some big names to appear in 'The Forbidden Room': Louis Negin (a Maddin regular), Roy Dupuis, Charlotte Rampling, Mathieu Amalric, Geraldine Chaplin, Udo Kier... I wonder how many of them understood the film? I certainly didn't, but then, I'm not sure Maddin is terribly bothered what the audience think.<br><br>The plot, such as it is, features a crew on a doomed submarine who are suddenly joined by a lumberjack. The question of how the lumberjack got on the submarine is never answered; instead he begins telling his story, which starts with a beautiful woman being kidnapped by a finger-snappin', bladder-beatin' tribe of cavemen and grows, in incomprehensible fashion, to include a man who murders his butler to cover up his own failure to remember his wife's birthday; an aviatrix who finds herself accused of squidnapping, and two animated models that are meant to represent talking bananas but which wouldn't look out of place in those smutty 'Flesh Gordon' films.<br><br>Substance, though, is not important to Maddin: it's all about style. And my word, does that style make this film a tough watch. Maddin has apparently gone for a 1940s movie serial look and while that implies a certain period charm (indeed, the underwater shots of the submarine have a pleasingly cheap and retro look), we also get bleached colour, flickering images and scratchy sound that, coupled with the fact most shots last no longer than 3-4 seconds and even then the bloody camera doesn't stay still, make it difficult for the eye to focus on anything.<br><br>To sum up, the loose and at times humorous storyline does make this an interesting watch. But the production values mean I wouldn't want to put myself through it again!","user":"euroGary","rank":[31,45]},{"title":"Ultimately Kind of Tedious","rating":5,"date":"25 July 2016","review":"I admire the film making and the art direction for The Forbidden Room, but while it initially dazzles, it quickly becomes rather tedious. There is no real payoff for the effort it takes to sit through it, and it does take some effort. The most entertaining part for me is the opening titles. The only movie I can compare it to is Stalker, and it isn't a fair comparison. While both share the washed-out, sepia tone Lynch-like visual style, Stalker has a discernible plot beyond just its style. I'd love to intellectualize the film and say it has deeper meaning, but outside of the art direction and distressed film look, after sitting through it I've decided there is just no \"there\" there.","user":"bruwhi","rank":[15,21]},{"title":"A journey to the center of film","rating":8,"date":"29 January 2015","review":"This film, like all those of Guy Maddin, has married the weirdness of David Lynch with the love of film and quirkiness of Wes Anderson, all wrapped up in a unique visual style like no other. It's absolutely gorgeous, a true adventure in filmmaking and film watching filled with dreams- within-dreams and stories-within-stories. It is like a love letter to the history of movies that blends silent films, noir, action, myth, comedy, musicals, and even instructional films into an absurd, self-referential ball.<br><br>But before you go running out to see it, you should know that it has zero interest in entertaining you. Seriously. It's dense, confusing and difficult to follow, and a tedious slog. There's no plot, if by plot you mean something that will emotionally resonate with you and keep you engaged with following the story or characters. Viewers should be the kind of masochist film geeks who enjoy subjecting themselves to such pain and then feel enlightened for doing so.","user":"Rizzleness","rank":[48,82]}]