[{"title":"Aston 6 is BACK!","rating":10,"date":"16 September 2014","review":"I showed up 9:15 AM at TIFF (Toronto International Film Festival) to watch the editor. I went into the movie only seeing the poster. I am a huge fan of Astron 6 and I wanted to be surprised once I saw the movie.<br><br>Plot: Rey Cisco (Adam Brooks) is the longtime film editor, who is editing a schlock crime thriller film circa 1980. But starting with the leading actor, someone starts killing the cast and crew. Though, in typical giallo fashion, everyone acts suspiciously, macho police detective Peter Porfiry (Matthew Kennedy) trains his eye on meek Rey, against whom the case does look pretty bad. <br><br>Now if you haven't heard/seen the Giallo Italian crime films then you will have a problem understanding the style in which the film was shot. Bad intentional dubbing, amazing use of color lighting, gore effects. Everything about this film was top notch. It is a low budget dark comedy, only shot with $150,000. Astron 6's earlier film \"Father's Day\" (2011) was only shot for less than $10,000. They used the money they had well, and made an amazing movie.<br><br>The only con I had with the movie was it slowed down on a couple of parts, that's it. Everything else was great. It was a great homage/parody to trashy Giallo films. Adam Brooks, Matthew Kennedy, and Coonor Sweeney showed up after the movie for a Q&amp;A I got a picture with them and amazing actress Sheila Campbell. I suggest you check this film out once it has an official release.","user":"djs_300","rank":[24,32]},{"title":"Really weird (which I respect)!","rating":8,"date":"19 October 2015","review":"'THE EDITOR': Four Stars (Out of Five)<br><br>An extremely odd horror-comedy/mystery flick, from directors Adam Brooks and Matthew Kennedy; the two also co-wrote the film, with actor Conor Sweeney. Brooks, Kennedy and Sweeney also star in the movie; along with Paz de la Huerta, Samantha Hill, Kevin Anderson, Udo Kier and Laurence R. Harvey (of 'THE HUMAN CENTIPEDE II' and 'III' fame). It tells the story of a veteran film editor; that becomes the prime suspect in a series of grisly murders. The movie is hilarious, quirky and packed with gruesome shocks and bloody thrills!<br><br>Rey Ciso (Brooks) was once considered one of the best film editors in the world. After a horrific accident, and a mental breakdown, left him disfigured; he now only works on low budget B-movies. When the lead actors, on his latest film, are brutally murdered, Rey becomes the lead suspect. He still struggles to complete the movie; while also dealing with a mentally ill wife (la Huerta), a new love interest (Hill), a moronic actor (Sweeney) and an incompetent police detective (Kennedy). The killer continues to viciously murder people, at the same time.<br><br>The movie is really weird (which I respect), and surprisingly funny; not to mention shockingly gruesome. Going into it, I didn't know quite what to expect (I kind of assumed it was just a poorly made B- horror flick); so I was pleasantly surprised. The filmmakers definitely have a lot of talent, and the film is packed with nostalgic style and wit; I can't wait to see what they do next. I've also recently became a fan of Paz de la Huerta; so seeing her (in a lead role) was a nice, added touch!<br><br>Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=13nGzq8Gvgo","user":"Hellmant","rank":[6,7]},{"title":"Giallo spoof","rating":5,"date":"16 September 2015","review":"If you never have seen those old school Italian horrors called Giallo then you will never understand this flick. The way the sound was created (overdubbed?), the score, the editing, the lighting it all referred to the seventies galore of the Italian genre.<br><br>The story itself is what it should make funny, sometimes it was sometimes it didn't work at all. But overall this flick delivers on gore. The effects are top-notch. But again, it's the story that tears it a bit down. You can refer to those classics but don't exaggerate. After half an hour you have seen it all on that part. So if you aren't into Giallo's then this isn't going to be your thing, for the geeks they will search to all those references made towards the classics, I did, and get lost of the story somehow and that isn't good news. But it contains what makes a good Giallo, the glove, the POV from the knife, the eye stabbing and of course a lot of gratuitous nudity.<br><br>But the story guys....<br><br>Gore 1,5/5 Nudity 2,5/5 Effects 4/5 Story 2/5 Comedy 0,5/5","user":"trashgang","rank":[15,22]}]