[{"title":"Couldn't Happen To A Nicer Guy","rating":8,"date":"7 June 2014","review":"This film is about entertainment manager Shep Gordon, who got his start by agreeing to manage (and, 43 years later, continues to manage) Alice Cooper. He also manages others, and this documentary goes through his life. You hear from people who you don't see commenting in films often, like Michael Douglas, Mike Myers (who also directed) Alice Cooper himself. It glosses over many things, there are no scandals, no moments of jaw dropping revelation, just the story of a man looking back at his career mostly with a smile. The most poignant part of the film are the parts involving the late Teddy Pendergrass, but there is also commentary from an ex's grandkids, whom Shep has all but adopted. Although now semi-retired and living in paradise in Maui, he still sees people all the time. Again, nothing scandalous, just a mostly straight forward telling of a man who mucked through the entertainment industry and still comes out of it well loved and admired. I recommend it to anyone who is interested in the subject, but it really is refreshing to watch a documentary about someone who hasn't been anything but a good person and who is held in high esteem by his friends and colleagues.","user":"crossbow0106","rank":[18,20]},{"title":"A character with a lot of stories","rating":8,"date":"19 October 2014","review":"An upbeat and informative documentary about the life of a man who's done a lot of sex, drugs and managing rock &amp; roll. He appears to have rubbed shoulders with so many celebrities, but still remains down to earth. I'm sure he has a 1001 stories to tell,some in the film are really interesting. I think Shep would make a great pick for the old fantasy dinner party scenario.<br><br>I was engrossed by his journey and the unpretentious honesty of his very interesting life, a true opportunist and marketeer who appears to remain steadfastly loyal to those around him. A funny documentary very different from so many before, loved the graphic reconstructions and the narrations transposed on these, thoroughly entertaining, I learned and laughed a lot.","user":"chrisjapan","rank":[7,7]},{"title":"Thoroughly human and uncommonly entertaining","rating":9,"date":"8 January 2015","review":"If you pay an obsessive amount of attention to film, as I do, you may have noticed the absence of comedian Mike Myers in films in the last few years. For the last couple years, Myers has been invested in making his directorial debut, a documentary by the name of Supermensch: The Legend of Shep Gordon, chronicling the life of Shep Gordon, a renowned talent manager who managed everyone from Myers himself to stars like Alice Cooper, Teddy Pendergrass, and Jimi Hendrix. In just eighty-five minutes, Myers, and Gordon, who narrates practically the entire documentary, gives us an in-depth look at the life of a person who likely enters our mind a total, abstract figure and emerges as someone we probably wouldn't mind having drinks with at any given time.<br><br>In the beginning, Gordon, who looks like a cross between Seinfeld co-writer Larry David and former Canadian Football League coach Marc Trestman, talks about his experiences as a sociology major at the University of New York, Buffalo, which lead him to venturing out to the west coast to become a probation officer. After a traumatizing experience at his first day on the job, Gordon went back to his hotel room, dropped acid, and proceeded to relax and unwind before believing he heard the screams and cries of a woman being raped. When he ran outside to \"rescue\" said woman, he was punched in the face by none other than Janis Joplin, who was doing drugs with Jimi Hendrix. It didn't take long for Gordon to become their manager, predominately based on the qualifications that Gordon was indeed high and knew the drug world all too well.<br><br>Gordon eventually got connected with Alice Cooper, functioning as his manager by staging outrageous shows that would make headlines and selling drugs in the audience to keep the crowd coming back for more in both the performance and the social aspect of the show. Gordon talks about how he realized early on that kids loved anything their parents detested, so he tried to get Cooper arrested on stage one night by having him perform naked in saran wrap, to which Gordon would respond by calling the police pretending to be an angered parent. By the time the police had arrived at the venue Cooper was performing at, the saran wrap had fogged up from the heat of the massive crowd and the police questioned why they were even called.<br><br>Gordon is filled with those kinds of wild and crazy stories, and Supermensch is a time when those stories are released and a character is revealed. One of the stories he shares is how he and Cooper sort of pioneered audience participation and liveliness within crowds at rock concerts, going as far as throwing a live chicken in the audience, which would later come back to Cooper a mangled and bloodied mess, or how feathered pillows were scattered throughout the concertgoers. In addition,Gordon talks about how him and Cooper, who have remained lifelong friends since they were first acquainted with one another, recorded Cooper's song \"I'm Eighteen\" in Canada because Cooper's own Straight Records label didn't want to be affiliated with the song. This propelled \"I'm Eighteen\" to be a huge hit in Canada and its success eventually bled into the United States, becoming one of Cooper's most recognized songs.<br><br>The ideology behind Gordon's business practices revolves around three kickers. One is his basic philosophy, which is \"get the money, remember to get the money, and never forget to always remember to get the money,\" in reference to receiving the promised paycut for the plethora of shows he scheduled for his clients. The second is conducting what he refers to as \"compassionate business,\" where nobody wins and nobody loses but everyone wins and everything works out in the end. Finally, Gordon believes in a system that uses \"coupons,\" or asking favors and repaying them through incalculable kindness, such loaning out his home to people he has known for years, or simply chipping in financially to fund someone's lifestyle at this given time. For somebody who has partied enough and undoubtedly seen every racy, cut-throat side of business there is, the fact that Gordon remains so tender and human is astonishing.<br><br>Finally, Myers doesn't neglect what the future held for Gordon, as he ventured into culinary arts after meeting French chef Roger Vergé. Gordon states how he enjoyed the freedom and liberation brought forth by the field of culinary arts because once you finished a meal, that was all that needed to be done, whereas managing talent and numerous different acts required constant contemplation of how to approach the next rodeo in a way that would mirror or best the success of the previous venture. In addition, Gordon's tireless work ethic has deprived him of the one thing we see he has needed most in his life - a wife and kids. Watching Gordon in his later years, we see a man not concerned with the party and debauchery lifestyle as he once was, but one looking to settle down and produce somebody who can go on to optimistically live the same kind of caring and open-minded life his father has done throughout his life.<br><br>Supermensch is a wonderful documentary, thoroughly human and uncommonly entertaining, with numerous celebrities like Tom Arnold and Michael Douglas weighing on what Gordon has done for them. At a simple, eighty-five minutes, Myers chronicles just about all we need to know about Gordon to come to the consensus that this is a man responsible for a lot more than what we have credited him for, and a soul just as charismatic as the talent he manages.<br><br>Directed by: Mike Myers.","user":"StevePulaski","rank":[7,8]}]