[{"title":"A Surprisingly Good Story","rating":7,"date":"2 October 2018","review":"Up front truth: Yes, it's got the whole made-for-tv level fluff going on. No, it doesn't even attempt to explore the gold mine of gritty details &amp; intricacies that a real serial killer case of this kind would yield. If you're looking for graphic fare, you'll get none of that here. In these respects, this movie is exactly what you'd expect from LMN.\nNow that I've laid out my disclaimer, I will say that I found Hunt For The Labyrinth Killer to be thoroughly entertaining &amp; I would watch it again! I won't throw in any spoilers. Instead, I'll say, I hope you watch it &amp; find yourself pleasantly surprised too.","user":"njm0923","rank":[7,7]},{"title":"Laughable excuse for a thriller!","rating":2,"date":"14 April 2014","review":"What a stupid movie.<br><br>A prosecuting attorney in a serial killer case needs to become the defense attorney when her close relative-a former judge- with whom she lives, is accused of being the killer.<br><br>And if you think that is far fetched wait for all the other ludicrous plot twists and turns.<br><br>The picture looks like it was made on a shoe string budget, and the only reason I give a vote one above the lowest mark is i) I saw the film to the end ii) there was a half decent song at the conclusion, and iii) the actor playing the former judge- given the atrocious story and script-did not do so bad compared to all the other hams.<br><br>What a load of tripe!<br><br>2/10","user":"rbrb","rank":[11,19]},{"title":"Pretty decent Lifetime Thriller","rating":8,"date":"12 May 2014","review":"Not a bad flick for a Lifetime movie. I'm only writing this review because it was better than the typical Lifetime \"made for TV\" thrillers and has a darker edge to it. I was really surprised with the twist at the end.<br><br>Generally speaking the performances were good, although it's totally obvious Michael Nouri is guilty the first time you see him. Amanda Schull was really good, loved her chemistry with Freddie the private investigator.<br><br>R.I.P to James Avery, kind of sad to see him end his career with a lesser role, but he did play a good judge.<br><br>Plot/Logic issues aside, good low budget thriller.","user":"steve-simon28","rank":[6,10]}]