[{"title":"It's not what people want it to be.","rating":7,"date":"27 September 2015","review":"Roland Emmerich's biggest mistake was calling the movie \"Stonewall\" and marketing it as if it were the actual story of the rebellion. It gave people the wrong expectation. It's not a movie about Stonewall. It's a movie about a Midwestern gay man whose story takes place on Christopher street at the time of the riots. It's also in part the story of the first person he meets in New York, played by Jonny Beauchamp, who steals the movie. It's basically a very oddball romance and coming-out story. People wanted an accurate historical epic about the importance of the riots, and the movie isn't that and was never meant to be. <br><br>For what it really is, it's a very good movie. Like most \"historical\" movies there are inaccuracies. The worst distortion is giving Danny the \"first brick.\" That's upset a lot of people, but in the dramatic structure of the movie it's as much about Danny's becoming himself--a gay man throwing away his shame--as it is about the situation he finds himself in. The police are depicted as \"bad\" in the black-and-white morality of an old-fashioned hero-versus-villain Saturday morning serial. But beyond those inaccuracies and the impossibility of recreating Christopher Street as it was (which seems to be especially upsetting to some New York viewers), the movie is as faithful to its surrounding event as any Shakespeare history play to its, including sympathetic depictions of a very diverse neighborhood of LGBT types. <br><br>As a long-time gay activist, I liked the movie a great deal. It feels real as I remember things to have been 46 years ago. I felt a genuine emotional rush during and after the riot. The movie ends with typical historical clean-ups, telling us what became of the real people, like Marsha P Johnson and others who appear in the movie, and mentioning the additional nights of rioting and how they went on to be regarded in LGBT history. <br><br>For me the saddest thing about this film is the divisions it's exposed among various components of the LGBT community. This history belongs to all of us, black, brown, white, gay, lesbian, transgender, drag queen, troll, twink, and so on; if we can't honor it in all of our variations, no one else will either. Go to see it as a good story well told, not as a factual documentary. I write this knowing some of you won't be able to, some of you won't want to, and some of you won't believe me. I wish there were something I could do about that, but there isn't.","user":"gayspiritwarrior","rank":[88,104]},{"title":"Flawed but not the horrible film I expected based on all the ranting","rating":6,"date":"9 January 2016","review":"I watched Stonewall last night and did not find it to be the horrible film I expected. It was not a great film either, a solid 6 out of ten. It was visually interesting, the dialog was a bit awkward and a little boring but IMO it accurately portrayed the feeling of 1969/70. Most of the characters were poor LGBT runaways living on the streets who were POC, transgender, dykes/lesbians and a variety of ethnicities. All the cops were white, mostly portrayed as assholes. Was the movie flawed? Absolutely. Perhaps the biggest flaw was calling the film Stonewall. Still I think it is worth seeing. If you can get past expectations of it being a historically correct documentary and watch it as a coming of age/out story about a young man from the country running to the city (which many did), at the end you can get a real reminder why we celebrate LGBT Pride today.","user":"kingwyatt","rank":[33,37]},{"title":"Campaign against this movie nauseating","rating":7,"date":"1 October 2015","review":"First off, I am gay. I was mercilessly bullied as a child back in the late 70's early 80s. It's nothing new.<br><br>I have read books, articles, and seen documentaries on the Stonewall riots......having said that, the LGBT community's lynch campaign regarding the film Stonewall has once again proved that as a group we are so self indulgent and petty, so mired in our own little dramas that we cannot see the big picture.<br><br>We should have lined up by the thousands to see this film (so starved we are about representation of our history, especially since integration) good or bad, accurate as we would want it to be or not. Instead what we have done is gleefully, shrilly and self-righteously and most of all in the most ignorant of ways, we have torpedoed it. What we have also done is send Hollywood a message that we as a group do not want to see movies about our history because we are so focused on being divisive as a group, and so intent into looking out for our own self as opposed to our collective well being.<br><br>We always have been selfish, petty, vain, superficial...in the 70s right after Stonewall, the athletic muscle boys scoffed and ridiculed the political queens because they were too busy being liberated and getting laid.<br><br>Black America stands together and supports each other....Tyler Perry can crank out countless drivel with his Medea movies and that demographic will flock. Any instance of police brutality towards an African American and that community ,rightly so, will make their voices heard.<br><br>For us that is not the case. Countless gay bashings and no one ever riots in the streets.<br><br>Two films have been made about the single most important event in our history. One in the 1990's and this last one. And what is our reaction? To squash any chance for some kid in the mid west to see it and have a spark of interest set off to get him or her and everything in between to go read up on the actual event.<br><br>POSSIBLE SPOILER: The film is not bad, it's not great, the script is a little weak, but everyone is represented. Martha P. has her moment in the limelight. A Hispanic character very much resembling Sylvia Rivera comes very close to throwing that first brick. And the lesbian dragged out kicking and screaming that howls anguishedly \"Why are you just standing there, why doesn't anyone help me?!\" is featured prominently.<br><br>So there's a white kid from the Midwest that provides the narrative for the story.<br><br>Big deal. One thing for sure, this could have been a chance to provide awareness of this event, and like self righteous idiots we have screwed this one up. You can be sure now that Hollywood will steer clear of anything dealing with LGBT issues. Good luck making that movie on whatever fluid sexuality topic now. We've killed it. A round of applause.","user":"apache67","rank":[62,88]}]