[{"title":"Contains Alexandra Daddario","rating":3,"date":"18 November 2016","review":"If you were thinking \"hey, this looks like a funny stoner flick!\" it's not. It's not funny but it's not quite dramatic either. Neither of the main characters is particularly believable in their role. If you are a smoker, you probably will not identify with any of this. If you're thinking \"high maintenance\" then yeah, save yourself the time. Again, not a stoner movie and not a comedy. It's kind of a (mediocre) RomComDram I guess? Shallow scripting and lots of emotional music forced at awkward times to try to create a dramatic moment when the situation doesn't call for it. It took me half the movie to realize that it's trying to be serious and not lighthearted/funny. I guess that's my bad for assuming it was going to be a light stoner movie. It has Alexandra Daddario though, so there's that. <br><br>(She was better in that one \"Always Sunny\" episode)","user":"thestash","rank":[21,26]},{"title":"Really wanted to like but little depth","rating":3,"date":"27 April 2017","review":"I really wanted to like this movie. I like the pot culture. I enjoy self medicating. Big Head from Silicon Valley is an actor I enjoy seeing in TV and movies. The girl is hot.<br><br>The movie unfortunately lacks depth. There is nothing compelling about any of the main characters. His relationship with the girl didn't draw me in mostly because the writing is very shallow. He likes her because she is really hot. She likes him because he plays a song she likes. It is difficult to say why she continues to like him. There is nothing funny in the movie. I think I would have liked it if it was at least a little funny.<br><br>There is little to like in this movie other than a curious fascination with how he built his weed dealing business on craigslist and some hope that we may see the girls' boobs.<br><br>There are plenty of great examples of how to develop characters and relationships in movies. No excuse for bad writing.","user":"bobjherman","rank":[9,10]},{"title":"Pleasantly Surprising","rating":8,"date":"22 October 2016","review":"I don't write reviews for movies very often and I am very critical about what I spend my time watching. With so many options available, if a movie doesn't pull me in within the first 5 to 10 minutes then I'm looking for something else. The first 60 seconds of this movie was questionable for me but I was sold before the 3 minute mark and was fully engaged from that point on (I'm not afraid to stop movies mid-stream if they get stupid).<br><br>The story line flowed nicely, the acting talent was grade A, and the chemistry between Brener and Daddario was definitely above average.<br><br>I found it thoroughly entertaining and the type of movie that I'd watch again soon with someone on a movie date (a rarity for me).","user":"coryjayw","rank":[20,30]}]