[{"title":"Some ludicrous moments ruin a good film","rating":5,"date":"7 May 2014","review":"A ten year old who can swim 50 miles. A 500 year old who can deflect hundreds of bullets from six assailants using assault rifles simultaneously with an ordinary metal sword... A serum that can turn people into bats because... Well just because. Then another serum that can turn them back instantly. <br><br>It was all too silly and cartoonish. This isn't the Batman who would out-think himself out of a tough situation. On several occasions he has to be rescued, which is just not Batman. But they break the realism aspect of the world multiple times and with it, you start caring less and less because it just gets stupid. <br><br>There was no fight between Batman and Damian, which was needed to show how their relationship builds and makes their love/hate situation evolve. There was no anger or jealousy from Night-wing. No proud grandfather thoughts from Alfred. Talias father is killed and she doesn't care. No one cared about anyone and so we stopped caring as well. There was no emotional connection between any of the characters even though the plot was screaming out for it. They just all fell flat and dull. <br><br>It looked nice, but at only 70 minutes I kept thinking that there was so much more they could have done to build on their relationships. <br><br>Its a meh movie. You'll watch it as passable entertainment but forget about it the next minute.","user":"kuuk3","rank":[27,38]},{"title":"It looked better in the Trailer","rating":14,"date":"14 May 2014","review":"This was a terrible addition to the Batman movies series. I was not very impressed, I felt this movie was rushed. Unrealistic in various aspects, not how the typical Batman movies are suppose to be.<br><br>Part of why Batman is so popular is because viewers enjoy watching a man using his intellect and natural resources to solve crimes and ultimately capture the villains.<br><br>The almighty \"trailer\" makes any movie look hype and all the rave. Which it did justice for this movie, but 30minutes into the movie I could already tell I was in for disappointments.<br><br>\"Damion\" was way overpowered, being able to take on the world's top assassin within the DC universe? That's absurd! Slade or Death-stroke is an entity to be feared and not to be so easily defeated by Damion who has not even reached his prime yet.<br><br>Also the character Batman was ineffectively orchestrated, he did not have the mysterious, lone-wolf, and independent personality which stays true to the Comics and previous movies or series and original concept character for that matter.<br><br>Overall the movie was lacking and I think a fair appraisal is, 5-5.5 out of 10. This move will keep you entertained, but not worth a second watch.","user":"ahilanc","rank":[21,31]},{"title":"Not as bad as the reviews make out ... not as good as DC ...","rating":7,"date":"25 October 2014","review":"... could have done.<br><br>The execution, the voice acting is indeed below par in places. This is true.<br><br>But I confess the story got to me. Usually any production that starts with the words \"SON OF\" is doomed. Literally.<br><br>But the story hooked me so I tolerated the subpar production values and actually had a fairly good time.<br><br>More than once I even wondered if somewhere out there was a producer who would find the cash to do this live action but given the audience expectations for a live action BATMAN, especially after Dark Knight, I guess that REALLY WOULD BE A FANTASY.","user":"A_Different_Drummer","rank":[18,27]}]