[{"title":"Mr. Robot - The Movie... except not.","rating":3,"date":"2 November 2016","review":"For any real hackers (aspiring hackers, hacktivists, otherwise criminally engaged computer wizards, or simply people in general who know their stuff) it's probably best not to touch this movie... but to people who hardly know anything about the world of hacking, who can enjoy a lower tier \"morally justified\" heist movie, it might work pretty well.<br><br>That said, the plot is dull. Really dull. Perhaps not so much the plot itself, but rather the execution of it. It's pretty obvious (from the narration, the cast) that this movie was meant to piggyback on the hype-train of Mr. Robot. Whereas Mr. Robot actually goes into detail pretty accurately, there's hardly ANY hacking going on in this movie at all. It's just a bunch of scammer kids, with a very infantile approach to the hacking phenomenon. A mash-up of jargon, combined with really poor dialogues and acting skills in general. A \"hacker\" that isn't familiar with the Dark Web or Onion? I mean, really?<br><br>Apart from that, it has a nice pace with just enough going on, to maintain a certain entertainment value that made me watch it through to the end. I'm glad that I did, 'cause it has a nice twist at the end... albeit pretty far fetched.","user":"Sancler","rank":[62,73]},{"title":"Writer/director - uh oh....","rating":3,"date":"21 December 2016","review":"I like a good hacker movie. This starts brilliantly - but goes nowhere and flounders around like a, er, flounder in a floundering thing.<br><br>As others have said, it's not so much about hacking as about scamming. It's full of very poor research and just plain wrong technical stuff. Sigh.<br><br>That there's 'something off' is so obvious but the characters don't twig. Uh oh... Dummies! Oh, and the film summary itself gives half the game away.<br><br>Apart from that, the plot just did't hang together.<br><br>Writer/director - uh oh....<br><br>He tries to bring in a character arc where the protagonist learns the errors of his ways but, heck, it's enforced, not realistic given the character and, well, total dumbbells.<br><br>Add a terrible, contrived unrealistic and dumb ending and you've got a so-so movie for people who don't know Windows from door frames - no, strike that - for people who are still looking for the Any Key!<br><br>Yup, I'll say it again - Writer/director - uh oh....","user":"iantrader","rank":[32,39]},{"title":"Waste of time except..","rating":3,"date":"21 June 2017","review":"Except if you like seeing cities and some lavish spending spree. its complete waste of time.<br><br>big time amateur film making. The narration is bad. events are totally flawed. they would go live in presidential suite but take a cheap cab on way from airport? covers up operations so well but give it away for prison cell at small cyber cafe?<br><br>hacker is always critical in thinking.. how did he even miss looking into the uncle?","user":"dilipkhumark","rank":[12,13]}]