[{"title":"Spud 3 - Minus 10","rating":1,"date":"1 April 2015","review":"Ghastly! Now I have to find something else to say for another nine lines. I remember when I saw Spud 1 - I was utterly delighted and totally surprised... a truly very funny, poignant, interesting movie about a poor boy with dysfunctional parents who is given a scholarship to a posh school. It was well written superbly directed and classy. Spud 2, also, was a wonderful romp of silliness, genuine class, humour and great acting with a top class script.<br><br>And now, to destroy all of the above, joy, silliness, fun and worthy moments, comes this grand, classless load of slop, filled with ugly adults who frankly, made me want to puke with their sex, booze and misery... what the hell has that got to do with coming of age and a sense of joyful surrender and abandon and beating the odds? Utterly nothing. <br><br>Spud 3 is so BAD that by about the 4 minute stage I was praying it would be over soon. The usual 'end of movie' three sentences of the deep and meaningful, which usually tops the Spud series, were lost on me. I was busy switching it off. <br><br>CLASSLESS, TRASHY, GARBAGE. WASTE OF MY MONEY!","user":"eyeintrees","rank":[17,30]},{"title":"Perfectly Decent 3rd Outing","rating":6,"date":"1 September 2016","review":"I'm not quite sure why the other two reviews hate the film so much. True, it doesn't have quite the sense of fun of the previous two movies, with the Crazy 8s up to far fewer antics, and there is indeed too much of the running time dealing with Spud's family, but for a third outing in a film series, this isn't really letting the side down. The script - by the author of the books, it should be noted - is less focused than previous and jumps around all over the place, but still has its moments - and there is a rather nice poignant scene between Spud and The Gov (played by John Cleese) towards the end of the film which is surprisingly touching. Elsewhere, things are a little repetitive if you've seen the other movies in quick succession, with the usual romantic liaisons, spliffs, alcohol, and school plays - not in that order necessarily. <br><br>It seems likely this will be the last film in the series, which is a bit of a shame, as I'm guessing most audiences would want to see the final book made into a film too. That said, these movies have been something of an easy-going, unexpected treat, with a decent mix of comedy and poignancy and, perhaps best of all, John Cleese doing his best Robin Williams/Dead Poets Society impression and pulling it off. He even gets a bit of love interest in the final film, which is a nice touch. <br><br>So yes, it's not quite up to the standards of the others, but it's certainly not the mess that some would have us believe.","user":"slbbooksmusicfilm","rank":[0,0]},{"title":"if you expect the plot of the book, don't go there!","rating":5,"date":"5 August 2015","review":"I loved the books. It was rare to find something to really define the term \"lol\" And I actually enjoyed the first two movies too.(although I realised that they are increasingly straying from the plot and muddled up happenings from all 4 books in both movies, but it got the message through.) Number 3 was a total shocker. And not in a good way. It feels like one of my heroes has died a tragic death. No subtle nuances, no hidden sarcastic meanings or clever play on words that one would expect based on the books or the first two movies. It seems that not even dear Mr Cleese got good lines this time. The writers blatantly changed the storyline. (what's the deal with the librarian and the botched play?!... boo!!! I understand that the book cannot be exactly portrayed, but at least stick to the facts) Bottom line: The actors probably did what they could with a cheat of a script ... I blame the writers and the new director. Shame on you!","user":"asvanzyl","rank":[0,0]}]