[{"title":"Poorly scripted and acted. Dull, dull,dull. Previous reviews of 10! You have got to be kidding!","rating":1,"date":"10 July 2018","review":"The high rating lead me to watch this disaster, which is seems like it was falsely reviewed to get people to watch. The problem with this film is the story seems to drift and fail to connect cohesively. The ridiculous dialogue and third rate acting creates no chemistry between the characters or atmosphere, especially in the build up to those dramatic encounters between humans and the alien; the shock moments of the alien jumping out at the astronauts were predictable. The worst part of this sad movie is that it isn't bad enough to be a fun bad movie.","user":"brislade-976-196892","rank":[79,109]},{"title":"Im not sure what made the movie worse","rating":4,"date":"10 July 2018","review":"The fanboi/shill reviews, or the poor acting.<br><br>I am unsure who figured these people, who acted in the past together, could still act ...together and succeed. The show is a modern B. Not that a B movie is bad.<br><br>The acting was rigid, forced and, at times, off key. The CGI was bad when ever the color red or orange was needed it seems ;)<br><br>If you are a Star Trek cast fan, there will be no deterring you from seeing this. If you are a sucker for IMDB ratings, do not be fooled, this rating is falsly inflated. The movie rating will balance out in the 4.2-5.0 range","user":"rhardy-390-701341","rank":[69,98]},{"title":"Skip and save 120 minutes of your life.","rating":1,"date":"10 July 2018","review":"If I could give it a -10, I'd complain I couldn't give it a -11.<br><br>Unbelievable bad script and acting (as in none).\nHomeworld 1 had better graphics, heck, I'm pretty sure Half Life 1 will hold up to this.\nIt may have the tag \"sci-fi\", but I'm voting for IMDB to add a \"sci-cry\" tag, though Half Life 3 may be released sooner then that happening...<br><br>Edit;\nAtleast the keyboard warriors are telling the truth, the movie really sucks.","user":"Kamuchi","rank":[76,109]}]