[{"title":"A deeply moving melodrama","rating":8,"date":"12 August 2019","review":"In China, in the early 70s, Lu Yanshi (<a href=\"/name/nm0155203/\">Daoming Chen</a>), a political prisoner, is released at the end of the Cultural Revolution. When he returns home, he discovers that his wife Feng Wanyu (<a href=\"/name/nm0000084/\">Li Gong</a>) is suffering from amnesia: she waits every day for the return of her husband, without understanding that he is at her side.<br><br>I loved the infinite tenderness that emerges from this film. The rhythm of the film is intentionally slow and we feel a real chemistry between the three main actors (father, mother and daughter). The director <a href=\"/name/nm0955443/\">Yimou Zhang</a> immerses us in a beautiful love story with the poignant beauty and intense presence of the actress <a href=\"/name/nm0000084/\">Li Gong</a>, with the extraordinary talent of the actor <a href=\"/name/nm0155203/\">Daoming Chen</a> who plays soberly in the shadow of his wife, with a neat, delicate and graceful photography.<br><br>As a synthesis: behind a slight facade of political pamphlet, a delightful ode of lyricism. 8/9 of 10","user":"FrenchEddieFelson","rank":[9,10]},{"title":"Back to Simple Pleasures for Zhang Yimou","rating":10,"date":"29 September 2015","review":"By 'simple pleasures', I don't mean that in any way to reference the Chinese Cultural Revolution, but his return to simple films, about simple people, beautifully crafted, acted, and very revealing about everyday Chinese life (as much as he is able).<br><br>Zhang Yimou (Chinese names put the surname first, IMDb doesn't, alas) is arguably one of the best directors of the 20th and early 21st centuries (best known in the West for House of Flying Daggers). He always evokes a magical feeling in me, and I love his technique and precision; almost every frame is a painting. He chose to remain in mainland China and has walked a very thin tightrope in making the kinds of films he has, as he does not shy away from the political situation in China, at least as part of everyday people's lives, which it is, of course. His films are just not primarily about Chinese politics (although his simple, but great early film, The Story of Qiu Ju, is about Chinese bureaucracy, and was indeed banned for a time. The fact that Gong Li, in this film, screams to the prison officials that have come to capture her husband, \"What did you do to him to make him want to escape?\", turning the blame for his prison escape back onto them, illustrates what their intl fame allows them to get away with.<br><br>Gong Li, Zhang Yimou's ex-wife, is, I believe, the premiere female actress in China (and now known worldwide, since the wonderful film, Raise the Red Lantern, was nominated for an Oscar in 1990), with good reason, and an actress of incredible breadth and depth. Even though she has been on many 'most beautiful people' lists, (she is very made up here (or down!)), her craft is everything and I cannot watch her enough. She is lately known here for Memoirs of a Geisha, as the evil Hatsumomo.<br><br>I was very, very glad to see Zhang Yimou and Gong Li reunite, professionally, for 2 recent films. They seem to push each other upward and she makes a perfect muse for him.<br><br>Ah, the film...(I love telling people about them!). Coming Home is about a couple dealing with and trying to reunite after Gong Li's husband is imprisoned for a couple of decades during the Cultural Revolution in China. She grows progressively ill, which adds to their difficulties, thus the meat of the movie is about their reuniting difficulties. Definitely without a stock Hollywood ending! I was struck by one very incredible scene... It is just a walk across the kitchen by Gong Li, when her husband is knocking at her door. She has been warned severely by the police. This walk seems to take several hours as she haltingly walks across the floor, with all the ramifications, both political and personal, flashing across her face and obviously in her mind. It is one of the most astonishing 20 seconds of film I think I have ever seen, and done without dialog, melodrama or Hollywood artifice.<br><br>Zhang Yimou has crafted a fine film here. It is slow, but in a good way, which builds a lot of emotional suspense. Someone said it only covers the last 20-30 pages of the book upon which it is based. As usual, every aspect of the film is top notch and it walks on the edge of the dramatic sword in a perfectly balanced manner. It will go down as another of my favorite Zhang Yimou movies. Be patient, although the tension he creates will keep you pinned, if not a bit frustrated, but that is also the beauty of it, and enjoy! And check out some of his other films!","user":"LemonLadyR","rank":[30,44]},{"title":"Warm and human","rating":8,"date":"31 December 2014","review":"Coming Home is a great example of the way in which a movie can move you, play on your emotions, without being sentimental in a negative sense. Without being a tear-jerker. And without harsh images of struggle and war. But with excellent acting, small gestures and not so much words. This movie is all about empathy, first among the characters in the story depicted, but by consequence also among the audience, that is swept away and taken in by the sentiment.<br><br>This doesn't mean that the story is only about love and compassion. The Cultural Revolution in China (1966-1976) was far from being peaceful and compassionate. People were separated for years without any information, were forced to report any 'wrong' behavior that could 'harm' or 'threaten' the Communist Party. Coming Home shows how such an environment affects people at the individual, family level. People get damaged and family relations are shattered because of betrayal.<br><br>Coming Home succeeds in portraying the consequences of such a regime, by showing what humanity and compassion mean. And that is what makes it special, and refreshing in a world where it sometimes feels like these values are hard to find.","user":"lauralancee","rank":[26,42]}]