[{"title":"Utterly demented and way entertaining film","rating":8,"date":"29 April 2014","review":"Nami (Kumi Takiuchi) is a lonely young girl prone to outbursts of left field violence, due to being ignored by her poverty-relief obsessed mother who leaves one day, leaving her with her depressed father and older sister. Nami's dad takes on a mistress and still ignored and with her sister now with a boyfriend, Nami seeks constant solace in in an inane shopping channel, captivated by the gadgets and bargains offered by the smiling host.<br><br>Years later, Nami, now a young woman has a peculiar hobby in which she observes and takes notes on sad and very lonely elderly people, who she calls \"Solitarians\". There's the angry middle aged man who barges by everywhere rudely bumping people aside, and there's the crazy homeless looking guy who feeds the pigeons, all collectively becoming Nami's muse and a source of endearment. One specific solitarian catches her attention. He's Mr. Shiomi (Takashi Sasano) an embittered old man, who once empowered with former status, is now alone, lonely and angry, going through each day with a grumpy, dreary resignation.<br><br>Nami is captivated by this with Mr Shiomi providing her with much entertainment. One day however a Christian missionary woman Su Yong (Khobbi Kim) visits Mr Shiomi and asks if he'd like her to engage in bible reading with him. Suspicious at first, Mr Shiomi eventually agrees and a hesitant friendship begins between them with Mr Shiomi, becoming less bitter and finding a new appreciation for life.<br><br>Nami is not amused. Mr Shiomi's new found zest means he's no longer a \"Solitarian\" thanks to Su Yong's meddling. What's to be done about this state of affairs? One thing's for sure, Nami will not have anyone messing with her precious hobby or her viewed from afar subjects...<br><br>Grateful Dead is well, pretty great actually with it starting off like a typically quirky Japanese comedy before slowly but inexorably getting darker &amp; darker until veering into outright horror territory toward the third act. However, it's really a (very effective) mixture of genres, combining comedy with drama and some social commentary to boot, before its demented conclusion.<br><br>A highly recommended little gem it should be sought out by any horror/genre fan or anyone who likes offbeat films in general.<br><br>A strong 8/10, just a highly satisfying and nicely demented (but not at all demented for the sake of it) film.","user":"Corpus_Vile","rank":[40,47]},{"title":"but I won't be rushing to re-visit it for a little while","rating":8,"date":"27 January 2018","review":"Director, Uchida claims that this was originally intended to be a comic film but that now only the first half has humour. Well, I didn't notice it. We begin with the heroine as a child and being ignored by her family and are suddenly thrown with an incident at her school involving a very violent movement with a floor mop. I think I actually gasped. As an adult she develops an unusual lifestyle, not very amusing and more tan a little scary, selfie with a dead and deterorating old man anyone? I have to admit that the lady herself finds all this very amusing and speeds about with her bicycle and binoculars with a manic grin on her face. In the second half things become even more crazy, disconcerting and violent as the true horror of this film become evident. Not an easy view, this is very well made with great performances in very unusual and difficult situations but I won't be rushing to re-visit it for a little while.","user":"christopher-underwood","rank":[5,5]},{"title":"Quirky Japanese comedy/horror","rating":6,"date":"25 November 2016","review":"A girl from a highly dysfunctional family grows up a loner with a tendency towards violent episodes. As a young woman she develops the hobby of spying on fellow loners and the lonely. One day she sees her favourite subject, an old man, with a Christian volunteer. The realisation that he may be leaving his solitude sets off a dangerous anger within her and she decides to take his fate into her own hands with deadly intentions.<br><br>This Japanese movie is one that seems to have gone somewhat under the radar. It's certainly a left-of-centre effort for sure that doesn't firmly place itself within one specific genre. It sets out for its first hour as an oddball comedy but in its final third it turns darker with the focus switching to the horror genre. It benefits from a couple of spirited performances from Kumi Takiuchi as Nami the disturbed young woman and Takashi Sasano as Shiomi the old man. The material never fully comes together in an entirely cohesive manner, however, with the whole idea of a girl spying on solitary people a concept that isn't developed as much as it might have been. The result is a pretty loose movie that doesn't entirely gel. It's still well worth a watch though if you enjoy Japanese movies from the quirkier side of the spectrum and it benefits also from being offbeat enough to be kind of unpredictable.","user":"Red-Barracuda","rank":[8,9]}]