[{"title":"A beautiful look at Sherlock Holmes' last case.","rating":9,"date":"7 June 2015","review":"When I first heard that Ian McKellen landed the role of Sherlock Holmes in a film about the end of the great detective's life, I knew he would be perfect for the part, and indeed, he was. \"Mr. Holmes\" (2015), based on a novel by Mitch Cullin called \"A Slight Trick of the Mind\", is a delightful film, full of humor and sadness as Mr. Holmes revisits his last case, and finds his memory isn't quite what it used to be. He has retired to his cottage by the sea and taken up his well known hobby of beekeeping or apiculture. With him are his housekeeper, Mrs. Munro (Laura Linney) and her son, Roger (Milo Parker), a precocious young boy. The on screen dynamic between these three is astonishing. More is conveyed in one glance than could be said in lines of dialog.<br><br>The sets were detailed with precision, the scenery was vibrant and gorgeous (except one scene which was perfectly moody and dark), and the cinematography was stunning. The score was perfectly understated and captured the sentiment of the scenes with finesse.<br><br>\"Mr. Holmes\" is a very different kind of Sherlock Holmes story. It is sentimental without being saccharine and I believe it is a fair representation of the greatest detective in fictional history. The movie is set to be released in Great Britain on June 19 and in the U.S. on July 17. I recommend it highly.","user":"jen-lynx","rank":[158,181]},{"title":"Lovely small movie","rating":7,"date":"8 June 2015","review":"Ian McKellen plays Sherlock Holmes as a 60 yo and a 93 yo. Both are excellent as without layers of makeup he gets the physicality of both roles perfect.<br><br>This movie is all about Ian McKellen and his acting ability... and it is a masterclass. Laura Linney is fine in this very small cast, though I question whether she was right for the role. Too upright and groomed for a middle aged war widow. Not her fault, but she was meant to be the foil for the son who is bright and full of potential and she is offering to bring him to Portsmouth to follow in her footsteps.<br><br>Beautifully shot, lots of external shots and small cast show off the small budget But the acting is superb. Definitely bound to be a favourite in the boutique cinema.","user":"conan-2","rank":[105,121]},{"title":"A tribute to the elderly Great Detective","rating":7,"date":"16 July 2015","review":"Greetings again from the darkness. Be honest  would you be excited to see a film if it were described as follows: \"A grumpy 93 year old man struggles with his failing mind and deteriorating body as he tends to his beehives during retirement in a small coastal town\". Chances are that synopsis would cause you to skip on to whatever else is showing at the theatre. However, a single revelation would likely change your mind  the elderly man is actually legendary detective Sherlock Holmes. <br><br>Ian McKellen stars and holds little back as he portrays the elderly Holmes trying to reconcile the past, the present and his failing health. And yes, there is one last case to solve  only it's the last case he actually solved 35 years earlier. Sadly, Holmes can't recall how that case ended, and the fictionalized version written by his friend John Watson offers no resolution. <br><br>We first see Holmes as he returns from an international trip – a trip that seems a bit out of place with the rest of the movie; at least until it circles back near the end of the film. In fact, we get quite a bit of back and forth between the present and past, and McKellen pulls off both the elder and much younger Holmes  though his performance as the faltering, frail one-time genius is Oscar caliber. <br><br>Laura Linney plays his housekeeper, but it's her son Roger (Milo Parker) who jells with Holmes and re-kindles that twinkle in the eye. The scenes with Roger and Holmes provide poignancy and humor, and also the dose of reality so necessary to a film focusing on a living legend.<br><br>Bill Condon (Dreamgirls, Gods and Monsters) directs the film, which is based on the novel \"A Slight Trick of the Mind\" by Mitch Cullin, and pretty quickly pulls the rug out from under us on the iconic deerstalker cap and the ever-present pipe. Still, only the staunchest, least-flexible fans of Sir Arthur Conan Doyle's character will be turned off by this mostly gentle and insightful look at aging – and a reminder that even fictional geniuses grow old. <br><br>Baker Street makes an appearance, as does the charred and blackened Hiroshima site, and a blurry Dr. Watson. Don't expect the frantic pace of Robert Downey, Jr or the elegant precision of Basil Rathbone and Benedict Cumberbatch. Instead, enjoy the subtle moments, the wry smiles and the valiant attempt to bring a mortal end to the seemingly immortal Great Detective  with a few clues tossed in for good fun.","user":"ferguson-6","rank":[63,74]}]