[{"title":"Brilliant moving and accurate I know I was there.","rating":10,"date":"11 February 2015","review":"I have just watched this film and on a personal level it affected me greatly. I was a young gay man in 1984 and I and friends, travelled to both the 84 and 85 Pride marches in London. I remember the Miners support at the 85 and we were greatly touched at the time. The movie got the details exactly right, I and many of my gay friends were on lots of marches including the ones against Clause 28 the evil Tory piece of legislation that outlawed promotion of homosexuality in schools and publicly funded museums and art gallerias (among others).<br><br>What I want to say about this film is that young gay and straight people should see it. It is immensely moving and funny. Just the right balance. I wept throughout and laughed because it brought to life my youth as I lived it in protest against that evil woman and her kind who dared to tell us how to live our lives, and who we couldn't legally love. It was scary times, AIDS, homophobia and arrest for protest.<br><br>I probably can't be objective because of my involvement as a youth in gay protest, it brought raw emotions to recall how angry we young people were then. But more importantly for me it reminded me like it was only yesterday of the immense Pride we felt at fighting for our rights and anyone who was a victim of hatred and prejudice.<br><br>All of the actors were a delight, and the portrayal of working class solidarity spot on and very emotional. I loved the fact that it had that British humour that is so peculiar to this country. The details were very true to the time, I recognised the clothes, the music and how tatty gay clubs were with peeling paint on the walls. It is a film that brings to life a time that has not been portrayed before, of protest, solidarity and how together we can change things.<br><br>I'm glad that such a film can be made and successful in this country now as a mainstream film as well. Maybe that shows that the protest of our youth changed things. I can get married now if I wish and thanks to a Tory PM, who'd have thought it? So one big thank you to all involved for making this 50 something gay man remember so vividly, and in spite of the dark days portrayed, our youthful struggle and reminding us that we really did something wonderful and change things, as this film is proof positive that we did just by the fact that is got made.<br><br>I hope that young gay people, who still cope with the same problems we did, isolated, alone, and scared can watch this film and gain strength from it and join the fight against prejudice still to be won.","user":"ste-scouse","rank":[94,99]},{"title":"Superb... but then I'm biased.","rating":9,"date":"9 September 2014","review":"A fabulously rich movie with a superb mix of talent relating the victories of human relationships over and above the overwhelming power of political ideology in partnership with business.<br><br>Bill Nighy plays a beautifully understated, quiet and thoughtful role in contrast to the ebullient Imelda Staunton, matriarchal doyenne of the small Welsh mining town that is the focus for solidarity expressed by LGSM. Paddy Considine as Dai is the somewhat unwitting emissary who meets with the group in London and speaks powerfully and clearly to the community there and to the rather more conservative community in his home town as to the nature of solidarity. Much humour is placed in the two cultures coming together and throughout there are themes of coming out, for both communities; the subtle and insidious nature of discrimination, the hegemonic control it exerts when backed by powerful media presentation, the opportunism of the bitter and resentful, and the damage that is wrought upon families and communities when work is alienated from the individuals identity. Jessie Cave, Ben Schnetzer, Sophie Evans, George Mackay and Freddie Fox all perform keenly and will have done their rising stars no harm here. Not sure how this film will travel internationally, a bit parochial, but then I thought the same about Billy Elliott and that seems to have done OK.<br><br>Culturally the film is a trip down memory lane, the music, the politics, the clothing and decor all take me back to 1984, the year of my eighteenth birthday, when my father was one of those striking miners, my mother and the other mothers ran the kitchen in the local church hall. Hence my bias, there is much in this film that is intensely personal.but even if this were not the case, I would still recommend the artistry of this movie and it's passion to anyone.","user":"n-j-terry-250-33041","rank":[120,139]},{"title":"There is nothing not wonderful about this movie.","rating":10,"date":"1 October 2014","review":"If you don't laugh, don't shed a tear, or don't want to get up and cheer at the end, then you weren't paying attention during this movie. Based on a true story, this is a film about how two unlikely groups came together in the troubling times of the early 80s in the U.K., but in addition to that, there are a lot of side stories that occur at the same time. Excellent character development (especially after the first 20 minutes), which is critical for a based-on-true-life film. The acting is superb. Listen carefully for the deadpan humor the British are known for: especially if you're not used to London and Welsh accents. Highly recommend this movie to anyone who needs a lift and a reminder that *people are good.*","user":"dixiecheese2003","rank":[74,84]}]