[{"title":"The un-scary possession of nuns","rating":4,"date":"12 August 2019","review":"'The Convent' was hardly one of those films that was dead on arrival from the get go or anything. Not one of those films that had few or no interest points or where the idea was bad. Actually thought that the idea was interesting enough, even if it was one where one should know what to expect (not Oscar-winning material, not that kind of film) and the cover looked creepy.<br><br>Even when knowing what to expect, 'The Convent' just didn't deliver and doesn't really execute its interesting idea well. Really tried to take it for what it was and what it was trying to be and do, but it was hard to do that when too many elements are done poorly and when not a particularly good job is done scaring or entertaining. Have seen far worse potential wastes recently, films that waste absolutely everything going for it and films failing when they shouldn't have.<br><br>Will start with what 'The Convent' does reasonably in. Most of it looks pretty decent and could tell at least what period and such it was set in, it has an unsettling look namely down to the lighting and the costumes and settings, while not lavish, don't at least look shoe-string budget-like. The camera work mostly isn't too gimmicky and is suitably moody. The music is variable in 'The Convent', but when it works it is haunting and doesn't create a discord with the atmosphere.<br><br>It did start off quite creepily, not original sure but the creepy atmosphere was there. While like the music the acting was on and off, Claire Higgins and Hannah Arterton were more than respectable throughout.<br><br>However, some of the other actors are pretty monotone and don't really bring much to their very limited material. Michael Ironside is generally watchable and has been known to be one of the better things of mediocre or less films (and he has his fair share of those), but did not see the point of him being there. He has very little to do and his appearance is placed so awkwardly, he felt very out of place. Some, not all as said but enough times for it to be a problem, of the music was inappropriate in style and tone and jarred as a result, like it was intended for another film. Occasionally the camera work is not particularly professional but on the visual side it's the slapdash and over-obvious special effects that fare worst.<br><br>Found the script to be cheesy, very stilted and like it was barely finished, a re-write and read-through more (if there was any of either in the first place) and that would have made at least a smidgeon of a difference. 'The Convent' started well enough, but as it progressed the duller and sillier it became. Suspense and scares were far too few, and the middle especially drags. The last act didn't really excite or unsettle me and it bordered on silly, while the gore could be used excessively and for no real reason other than the film's way of creating some kind of shock value.<br><br>On the whole, nothing offensive about it but not a particularly good effort. 4/10","user":"TheLittleSongbird","rank":[5,5]},{"title":"More demon nuns","rating":4,"date":"3 May 2019","review":"I don't know what we've done to deserve it but for the last few years you can't go anywhere near a cinema without tripping over a possessed nun. The film begins in 1619 with a nun whining about the evil she's brought on the convent. While she whines we see bloodied nuns aplenty, presumably the victims of whatever she brought into the place.<br><br>Move forward 40 years to 1659, incidentally the final year of Cromwell's reign. A woman chained in a dungeon. A man enters and says, \"Up, witch!\" Interestingly he appears to be a time traveler as he's wearing a three-cornered hat of a style which didn't come in till the early 1700s. He drags her before a judge. Yay, it's Michael Ironside, and he's the only reason the film gets 4 points. 3 are for him. He condemns the woman to death when in swoops the Mother Superior of a convent. She demands the girl be turned over to her and threatens him with the Inquisition if he refuses. Nobody expects the Spanish Inquisition! Or indeed any inquisition at all in England which was a Protestant country and had no time at all for the Catholic institution of the Papal Inquisition. Michael Ironside instead of kicking the old crone out on her ass and telling her to read up on her history agrees to turn over the accused as he's grown tired of the whole thing. As indeed am I.<br><br>The rest is easily told. Yada yada yada ooh scary nun yada yada yada. Avoid like the Black Death.","user":"aldiboronti","rank":[24,36]},{"title":"Solid 6 Stars","rating":6,"date":"5 May 2019","review":"I enjoyed the atmosphere of the movie. The time period felt (relatively) authentic. Persephone jumps out of the fire into an all-together different frying pan.<br><br>The store is not original and I wish they explained the back story better, but it is a solid film. I watch a lot of horror and this is definitely not the worst!<br><br>My pet peeve - I hate when the scenes are so dark that you cannot see anything. This does happen through most of the film, but the eyes do shine bright.<br><br>Fine for people who like horror period pieces with some gore.","user":"cynthiacaton","rank":[15,21]}]