[{"title":"Exactly what you would expect from the third movie in a series that didn't need a sequel to begin with.","rating":4,"date":"15 June 2014","review":"\"You don't want to take that road, trust me.\" A group of street racers head off to a race and they stop in a small town for lunch. While there they ask what the quickest way to get to their destination is. When they are told to avoid the fast road because of its history they laugh and take it anyway. As a joke they decide to cut off a truck driver. This little action pits them against the dangerous Rusty Nail (Kirzinger). There really isn't a whole lot to say about this movie. The original was good and tense because it was new and different. A harmless prank that you could see yourself doing leads to something no one can imagine. Much like everything in the last 10 years if enough people like it a franchise begins. The second one was a bland version of the original and this one isn't much better. The thing that made the first one so interesting was the originality of it. This one has no surprises at all and you can see everything coming a mile away. All that said though because this is the third movie in the series and since it is a straight to video B-rate movie you really can't expect much more then that. Overall, exactly what you would expect from the third movie in a series that didn't need a sequel to begin with. I give this a C.","user":"cosmo_tiger","rank":[11,13]},{"title":"Standard stuff but moderately entertaining","rating":6,"date":"6 January 2015","review":"I enjoyed the first Joyride which was full of tension and very well done. Unfortunately as we already know the perpetrator this one does away with the tension to instead concentrate more on gore. <br><br>A group of boy racers and assorted girlfriends pick on the wrong lorry to mess with and pay the price. It's all fairly predictable stuff but there are one or two good scenes i.e the opening death scene to keep you interested. At times it is extremely gory with some SAW like scenes which I'm not sure add a great deal to the movie. The acting is what you'd expect, by no means bad but not great either. <br><br>Overall as long as you don't have high expectations this is an OK time filler but I doubt it's one that will live long in the memory.","user":"MattyGibbs","rank":[5,5]},{"title":"Joy Ride 3 is mediocre, but moderately entertaining","rating":6,"date":"22 July 2014","review":"I found the original Joy Ride mediocre, but it was successful enough in order to have a straight-to-DVD sequel (Joy Ride 2: Dead Ahead), which abandoned the road movie/thriller premise in order to belong to the horror genre. And now, Joy Ride 3 attempts to resurrect the franchise putting the emphasis on the villain; the result is mediocre, but moderately entertaining. The characters are slightly more intelligent and less irritating than in other horror films, something which creates a reasonable level of suspense; but the screenplay lies too much on improbable coincidences and on the villain's almost supernatural capacity to always be one step ahead of the victims. For example, the victims have constant difficulties to communicate through their mobile phones and civil band radios. Meanwhile, the villain doesn't have any problem in keeping a wireless connection to the Internet while he drives his truck at 100 kilometres per hour over an abandoned highway through the desert. And in that way, jumping through logical holes and employing trite situations (including the obligatory personal conflicts and romantic tension), the film advances by fits and starts, even though that doesn't avoid the movie from being tolerable. So, even though I didn't find Joy Ride 3 a very good movie, I can give it a slight recommendation, and I would place it above the second film of the saga and at the same level of the first one. And to the fans of J.J. Abrams', don't waste the opportunity of seeing this famous director's name in the credits of a mediocre straight-to-DVD sequel (he was a co- screenwriter of the original Joy Ride, and he keeps receiving the \"Inspired on characters created by\" credit; I'm sure that his publicist must have nightmares in that regard).","user":"Argemaluco","rank":[14,18]}]