[{"title":"Amazing","rating":10,"date":"20 February 2015","review":"This movie was enough to bring me to tears, and I'm an adult.<br><br>Very wonderful movie. I'm very saddened that this will be the last movie they are making in the Tinker Bell franchise—I would really like to see how Tinker Bell comes to meet Peter Pan and how what Disney has done ties into J.M. Barrie's story. However, though that will likely not happen (though, with this movie and The Pirate Fairy they come pretty close to getting into that story, which made me hopeful it would be done after this movie), I say they went out with a bang on this one. This one could be my most favorite, though I love them all! Not only entertaining for children but people of all ages. I hope they reconsider more movies. I feel we need one or two more!","user":"jessicajeanfox","rank":[40,44]},{"title":"Disney movie that captures the heart","rating":10,"date":"16 March 2015","review":"This movie was as expected and like with all other Disney movie, it contains morals and values for kids to learn from. As the synopsis briefly describes, you can never judge a book by it's cover or in this case, the fangs. <br><br>As an adult, you can see the message they are relaying to everyone of all ages. Children especially because they need to know this stuff to develop into their positive character trait.<br><br>I also did not expect to cry from this movie. It's very touching and hits you in the heart. Loved ones will want to watch this together. Especially if you have kids. I just couldn't help but shed a few tears, and I'm not the type to get teary-eyed either. <br><br>Overall, this movie is cute, funny, adorable, touching, and keeps you drawn to the plot. Excellent!","user":"tomlu1","rank":[19,20]},{"title":"All the Feels.","rating":9,"date":"21 February 2015","review":"This movie follows Fawn, an animal faerie, as she encounters a beast unknown to those of Pixie Hollow - the Neverbeast... all while going head to head with Nyx (a scout faerie), one of the protectors of Pixie Hollow.<br><br>I found this movie to be very endearing. It contained a level of emotion and depth that isn't always present in the other Tinkerbell movies... but it still contained that spunky Tinkerbell Charm. After watching this, I have a newfound appreciation for Fawn and her compassion for animals of all shapes and sizes. I'm hoping this might be the first of many Disney Faeries movies to focus primarily on Tinkerbell's close friends and their varying talents... rather than on Tink herself.<br><br>For anyone who has watched the other Tinkerbell movies, the plot is fairly predictable from the beginning... which is true of most of the other Tinkerbell movies. <br><br>I highly recommend this movie, but definitely have tissues at the ready! Trust me, I was not prepared to cry!","user":"hmgaida","rank":[23,25]}]