[{"title":"Responsible","rating":7,"date":"14 April 2014","review":"Greetings again from the darkness. This is the perfect Film Festival movie: low budget, recognizable star trying something new, up and coming director, and potential star in the making newcomer. While it has an air of familiarity, there was enough here to make it one of my favorites from the 2014 Dallas International Film Festival.<br><br>Writer/director Kat Candler has a definite feel for creating real moments for characters, as she expands her 2012 short to feature length. She was also wise enough to nab cinematographer Brett Pawlak, who did such a great job with Short Term 12 (one of my top six films of 2013). The blue collar life gets a twist here as Aaron Paul (on top of the world after \"Breaking Bad\") plays an alcoholic, emotionally-distant, grieving widower having to deal with his two sons when he can barely make it through a day. This is certainly a different kind of role for Mr. Paul, and he shows real depth with minimal dialogue.<br><br>As impressive as Paul is, the real find here is young Josh Wiggins as Jacob. It's his first screen role and he absolutely owns the role of the big brother lashing out at his dad, corrupting his little brother (due to jealousy) and dealing with things that kids his age shouldn't have to. Not to give away much, but one too many incidents leads to a visit from Child Protective Services, and just like that ... the family is torn apart again.<br><br>The real guts of the story is the parallel paths of father and son as they react to the displacement of little Wes (Deke Garner). Neither seems to fully accept the role they played in this mess, but both carry sorrow and anger the way males often do. Both pursue their own idea of proving something to Wes and to themselves - in very different ways. Juliette Lewis seems a bit out of place as Paul's sister, and is the only minor misstep in the script. We needed either more on her, or less.<br><br>Rural Texas and the challenges of youth are captured through so many details, and the realistic feel of dialogue and setting certainly stands out here ... as does the spot on camera work. This is one of the little movies I am really rooting for, because if it gets a chance, many will share my appreciation.","user":"ferguson-6","rank":[24,28]},{"title":"A good family drama with great performances.","rating":7,"date":"17 June 2014","review":"Hellion tells the story of a delinquent, rebellious teenager named Jacob who is coasting through life on fumes. He lives in a low income home with his emotionally absent father, Hollis (played brilliantly by Aaron Paul). The story chronicles the growth between the two and proves that you can become a man at any age whether you are 13 or 40. While Hellion delivers a heavy handed message through heavy metal and motocross, the story is very bare bones and when some nice meaty scenes come our way, they are done and over with in thirty seconds. This never really allows us to truly connect to these characters in the way that director Kat Candler wants us to. The only thing that really keeps us connected to the story (or lack thereof) are the actors. There is not one bad performance in this film and that is a huge compliment to all those involved, especially when you take subject matter as melodramatic as this is. Aaron Paul gives a subtle and controlled performance as Hollis, a disillusioned father who surrounds his boys with figures from his unsavory lifestyle. What Aaron Paul does best is convey pain just by moving his eyes a certain way, and this film really showcases this man's talent. Child actor Josh Wiggins gives another powerhouse performance as Jacob, an unruly and emotionally unstable teenager. Not since Tye Sheridan have I seen a child actor this good and I am truly excited to see what he does next. The supporting cast includes Juliette Lewis doing what she does best, playing a white trash mother-figure that tries to do right. While she has made a career out of playing this type of character, this does it better than any other actress could. The direction and writing is sub par compared to the talent in front of the camera. The story is jumbled and, at times, a bit unrealistic and some of the dialog is a little heavy handed no matter how well Aaron Paul can deliver it. Overall, Hellion is a decent indie drama that is sure to turn heads because of Aaron Paul and Josh Wiggins, but other than that, there's not too much to it.","user":"trublu215","rank":[12,13]},{"title":"Slow Motion Explosion","rating":8,"date":"4 August 2014","review":"I had no expectations going into this film; I hadn't even read the plot summary. <br><br>This was a film that had you shout predictability until what I thought would be the climax, came entirely too early and I realized...I had no real idea what was ahead. I found myself having little tolerance or care for Jacob throughout most of the movie, whereas I was overcome with emotions when it came to little Wes. Jacob ended up stealing my heart however and I was surprised at the director's ability to do this. <br><br>I noted this as an \"explosion\" because the build up was serious! It's a common story in much of America, but truly shot in a way that the viewer finds riveting, emotional, and genuine. The acting, from the CPS counselor to Wes, was truthful and accurate. Facial expressions and moments of silence between characters can usually spill the guts on who's new to the game, and I just didn't find that here. A low budget film that will probably not get much viewership, but those that take the time out will not be disappointed.","user":"cumberbatchv","rank":[11,13]}]