[{"title":"Outstanding movie about a truly inspiring human being","rating":10,"date":"12 November 2017","review":"I've had the joy of seeing Richard Turner perform many times over the last 23 years. No one else on earth has ever had his skills with a deck of cards. This is partly because no one approaches his character or work ethic. So I was anxious to see Dealt, and I was not disappointed. I expected this to be a movie about overcoming great odds to become the best. Of course it was, but it was much more. It turns out that the love and humanity of Richard's family is as great as Richard's skill with cards. We're left to wonder: where does such love and commitment come from? Dealt is a movie you can see again and again. I recommend it to everyone.","user":"thall-57710","rank":[10,10]},{"title":"BEST BIOPIC & INSPIRATIONAL Movie","rating":10,"date":"5 July 2018","review":"This is one of the best biopic documentaries I have seen &amp; seeing a blind man performing world's best card game is even more intruguing.","user":"goutamhebbar","rank":[7,7]},{"title":"pick a card","rating":8,"date":"19 October 2017","review":"Greetings again from the darkness. One of the sub-genres of film documentaries involves profiling those folks who are doing extraordinary things in life. Sometimes these people are changing the world, sometimes they are sharing their talents, and other times they are overcoming challenges that most of us don't have. Richard Turner of San Antonio, Texas is one who checks all three boxes.<br><br>Mr. Turner is the world's best card mechanic  a magician, if you will – although he doesn't much like that word. Now you might be asking how a card trickster is changing the world, and it's a fair question. The answer becomes clear when we see him quietly bonding and sharing some card secrets with a young, similarly visually- impaired girl late in the film. That's correct, Mr. Turner is himself blind, and if you assume that a blind man cannot possibly execute highly complex and entertaining card tricks, you are encouraged to learn more about this remarkable man.<br><br>Mr. Turner is quick to recall what drew him to cards. He references the James Garner TV series \"Maverick\" as an inspiration, and soon decided that would make a pretty good way to earn a living. He has used his touch of hyper-activeness to relentlessly master his card skills, while also honing his stage presence. We hear others discuss his impact, and watch vintage clips of his TV appearances. \"Blind\" was a word he spurned for years, as he was driven to let his skills stand on their own against all others (skills that would be mind- blowing and world class even if he weren't blind). Turner's adamant refusal to admit his disability (no Braille, no cane, no dogs) was enabled by his dependence on his son, whose departure for college left a gaping hole in dad's life. We also meet Richard's sister Lori. She owns and runs her own construction company  and is also blind.<br><br>Director Luke Korem expertly provides the necessary background for us to understand how Turner has become the star he is. Rather than focus on the technical aspects of card \"magic\", he focuses on the man and his personal journey. It's fascinating how he delivers a personal profile of the family man – the flawed man – who has slowly, but surely come to accept his disability after a life of denial. So while we \"ooh and ahh\" and gape in amazement at his card skills, our hearts are touched by the relationships he has with his wife Kim, his son Asa (yes, Asa Spades Turner), and his self- reflective drive that allowed him to reach 5th degree black belt. Mr. Turner likely fine-tuned his card skills for nearly16 hours today  how was your day?","user":"ferguson-6","rank":[17,20]}]