[{"title":"Cookie-Cutter PotBoiler Never Makes A Head Of Steam","rating":5,"date":"9 November 2017","review":"I suppose I've always enjoyed the steamy adult thriller as much as the next bloke. Certainly, everyone knows the formula – you cast some gorgeous looking actress in the role of a sex-starved housewife, one who can't help herself but look beyond her present circumstance for a little bit of bedroom heat. As you can predict, the whole thing goes horribly wrong, and – before you know it – she's racing against her best instincts to save whatever shamble of a marriage and a family she has left. Because you really do know what you're getting at the outset, it's especially important that all of the cinematic pieces fuse together in just the right concoction, or the storyteller runs the risk of alienating the audience before the last scene unspools.<br><br>For all of its brief merits, 2016's INDISCRETION really never rises to the challenge (double entendre intended), but thankfully it's striking averageness never risks offending the audiences' sensibilities as there's not so much as a bared boob in here.<br><br>(NOTE: The following review will contain minor spoilers necessary solely for the discussion of plot and/or characters. If you're the type of reader who prefers a review entirely spoiler-free, then I'd encourage you to skip down to the last three paragraphs for my final assessment. If, however, you're accepting of a few modest hints at 'things to come,' then read on )<br><br>From the product packaging: \"While her politician husband (Cary Elwes) and precocious teenage daughter are away, New Orleans psychiatrist Veronica Simon (Mira Sorvino) enjoys a weekend fling with Victor (Christopher Backus), an alluring young sculptor. But after Veronica calls off the affair, Victor refuses to let go and will stop at nothing to have Veronica for himself \"<br><br>There's a bit more, but that's really all one needs to know about Indiscretion, an unrated thriller written (in part) and directed by John Stewart Muller. And – a bit to my surprise – \"unrated\" here doesn't mean what it does in the realm of most motion pictures as there's not nudity whatsoever, along with (ahem) sex scenes that are astonishingly uninventive and (dare I say?) routine. In fact, I'm not quite so sure why Veronica would have fallen for Victor in this context as the young man clearly has nothing to offer her by way of any legitimate relationship  I suspect that may've been the appeal.<br><br>In that case, wouldn't a bit of chemistry and/or charisma have been a nice touch anyway?<br><br>Muller's feature lacks the required chemistry to make the set-up entirely believable (much less acceptable), but everyone seems to be coasting on autopilot here as the potboiler never rises to the point of boiling. So much of this 'Indiscretion' feels like a bloated TV movie – the kind you can probably find every other weekend on any regular channel, since there's no T'n'A in here – so in order to attempt to salvage the audience from this mess Muller and co-writer Laura Boersma hold back a last scene reveal until – well – the last scene. You know the kind? You can't talk about it without spoiling the ending  but I'll simply leave it at this: there's far too much 'contrivance' to this entire affair for the twist to even really be plausible much less interesting.<br><br>As a production, Indiscretion has some problems with continuity: the relationship's opening sequence follows Veronica and Victor to a handful of locations, all the while Ms. Sorvino's attire kinda/sorta changing like she stopped at home to throw on a different blouse before hitting the next scene. (???) That and the fact that whoever came up with costuming for Sorvino apparently insisted on dressing her as one of the least appropriate child psychiatrists in the history of the business. Really? Those are pretty close to cocktail dresses there, and you're wearing that to meet troubled children?<br><br>Also, there's this little problem: in order to accept Veronica's situation sexually as it is at the onset, the audience is asked to suspend disbelief about whether or not fictional hubby Elwes would've found her attractive. The only glimpse at the sex life posits Sorvino coming to bed looking very much like a Victoria Secret's lingerie model  and I'm expected to belief her hubby wouldn't want to be getting jiggy with this?! Sorry, but I call \"shenanigans.\" That and the fact that Victor looks like Blake Shelton's grungy brother just made so much of this untenable.<br><br>(MILDLY) RECOMMENDED. Heck, it used to be that one could expect a steamy adult thriller to ratchet up a certain amount of heat on the silver screen, but gone are the days of The Postman Always Rings Twice (1981) and Body Heat (1981); in its place we're left with stuff like Indiscretion, a veritable 'AfterSchool Special' geared at mature viewers but giving us nothing that makes maturity requisite. Mira Sorvina is essentially wasted – as is the always watchable Cary Elwes – in this kinda/sorta popcorn flick of carelessness gone wrong  or did it? You can always bank on screenwriters to wrench out some last- minute twist to try and give even the most predictable yarn a bit more thread, but this whole thing feels so second hand you'll probably find it at your local Goodwill store any day now.","user":"ncc1205","rank":[7,8]},{"title":"The politician's wife","rating":4,"date":"12 June 2018","review":"Mira Sorvino, won an Oscar for best supporting actress in Woody Allen's Mighty Aphrodite. She appeared in Robert Redford's Quiz Show. Guillermo del Toro directed her in Mimic in 1997 which was produced by the Weinstein brothers. Harvey Weinstein allegedly made a play for her and he was unhappy that she would not play ball with him. According to Sorvino this affected her career in Hollywood.<br><br>Interestingly when Guillermo del Toro was making Mimic his father was kidnapped by Mexican gangsters who demanded a ransom. del Toro has since stated that it was easier to deal with the kidnappers than the Weinsteins!<br><br>Indiscretion is one of these Lifetime made for television thrillers elevated by the above average casting of Oscar winner Mira Sorvino and Cary Elwes.<br><br>Sorvino is Veronica, a psychiatrist, a mother and the wife of a politician, Jake who is running for election and behind in the polls. Jake may also had an affair and his slightly pro gun control stance is doing him no favours.<br><br>At a party, a frustrated Veronica enjoys a fling with an artist, Victor (Christopher Backus) however he deludes himself in believing that they have something special together rather than just a meaningless fling. Victor has temper tantrums, stalks her, he becomes friendly with her husband Jake, starts to give art lessons and maybe even sleeps with their teenager daughter. Veronica even believes that Victor plans to shoot Jake at a weekend hunting trip.<br><br>Indiscretion is a silly thriller where plausibility goes off the scales with various plot contrivances. Not only is Victor a man of artistic abilities and temperament, he is a crack shot from his army days. Victor just happens to meet Jake at a shooting range where he impresses everyone with his aim. Their daughter just happens to need art lessons. More handily Jake is so unstable, his bizarre behaviour is convenient for Veronica as the film wants to infer that he has been played by her.<br><br>Backus who is actually married to Sorvino is a terrible actor. The film is aimed at a female audience who might lap it up as time waster melodrama.","user":"Prismark10","rank":[4,5]},{"title":"Paulie Cicero's daughter takes after her father","rating":5,"date":"22 October 2018","review":"Not a bad film, but not great. Wife of a Louisiana senate candidate has a fling with local artist and things go from bad to worse quickly. Ends with an unexpected twist. Sorvino is no shrinking violet. She is as devious as her opponents in this film.","user":"mxsuba26","rank":[2,2]}]