[{"title":"Peculiar, the worst Spike Lee movie I've seen (and I've seen most of them)","rating":4,"date":"14 August 2015","review":"Spike Lee is one of my biggest favorite directors so I was interested in watching this regardless of the low rating<br><br>And I wanted to like it I really did, the opening shot is amazing it has some superb break-dancers break dancing outside to a smooth Bruce Hornsby piano score, looks beautiful<br><br>But that montage really has nothing to do with the movie itself, the movie is about an upper class arts collector who by some circumstances get a thirst for blood<br><br>Mind you, if you're expecting a typical vampire horror you will probably be let down it's not really that type of movie<br><br>What type of movie it is though I can't really describe, it's just a peculiar movie that I had a hard time figuring out what it was trying to be and what it was trying to say<br><br>The dialogue is not bad but more-part of it doesn't sound realistic to what a person would say, often sounding more like theatre monologues basically<br><br>Acting overall is pretty wooden (but that could be an intentional thing being that the people in it are very posh) and pace very slow<br><br>It has some above average scenes separately but together it just doesn't get it's right flow and your often sitting wondering why or wondering what the point of it all is, and by the end of the movie (at least I) still have no idea<br><br>For the record I have not seen the movie GANJA &amp; HESS of which this movie is a remake on, perhaps I would understand this movie better if I'd do that but if one has to watch something else to understand the movie you were watching than that would mean that this movie failed IMO<br><br>Honestly it felt like Spike Lee didn't put his whole heart into this project which is a shame, since it was funded by his biggest fans via a Kickstarter campaign","user":"Seth_Rogue_One","rank":[9,10]},{"title":"Wow...what am I missing?","rating":2,"date":"3 June 2015","review":"Spike Lee is one of the premiere directors of my generation. With that said, I am still trying to figure out the focus and purpose of this movie. The actors, many of whom, we've seen in other Lee films, are so subdued and non significant. The movie seems to lack...well, life. His career has created valuable works that have symbolically and literally offered calls for self-awareness and offered insights into the social-political realities of African-Americans and America in general. I can't figure out what significance this movie has. There are some disturbing scenes that do not seem to add any insights or purpose to the movies story. The few things I gathered from this are: rich/poor exploitation, addiction, socio-sexual dynamic, and Sankofa. The story telling doesn't offer anything new or dynamic. So, with a heavy heart, I give this a thumbs down and not let this be representative of Spikes true genius!","user":"avdors1","rank":[14,18]},{"title":"Spike Lee does a vampire movie!? It's as odd as it sounds!","rating":5,"date":"15 February 2015","review":"A remake of a Blaxpolation film called Ganja &amp; Hess, Dr. Green is a expert on African artifacts who after a botched murder, suicide begins a strange addiction to blood that makes him indestructible.<br><br>A very strange low key indi vampire (sort of) picture. Reminds me of last years, Only Lovers Left Alive by Jim Jarmusch, but Mr. Lee is asking me to have a far more opened mind than Mr. Jarmush did. <br><br>The premise of the movie is about an African tribe who drank blood like it was alcohol or drugs, and a doctor who begins to practice this particular custom, feeling that it's society that made this addiction stranger than all others. I did enjoy the premise of not using the Eastern European origins of what is a vampire, at the same time, Spike use this as a comp out for when people come up to him and say \"your vampire film really sucks\"(bad pun cause no biting went on in the movie).<br><br>For the most part, I got the Impression that the film is more about addiction and how it can drive you and the people around you. I saw a movie no different than Requiem for a Dream, but the drug of choice was blood.<br><br>It definitely had the feel of a Spike Lee film all over it. His signature style was all over This cheap independent production and reminded me of his recent film, Red Hook Summer and his first film She's Gotta have it. The Jazz composed score really help push the story along too. <br><br>So this is what that Kickstarter campaign was all about, huh? Overall, it showed that Spike still has a foot inside true independent cinema, and it was something truly different an unexpected from the maker of Do the Right Thing. I think it has the makings of a Midnight Movie cult following. Way better than Old Boy","user":"bbickley13-921-58664","rank":[14,21]}]