[{"title":"Smart Rom Com, two things that don't often go together","rating":8,"date":"17 September 2016","review":"I'm a little surprised at all the negative reviews here. It's hard to imagine what the reviewers found missing. Romance? Comedy? Or both? Because I found plenty of each. I will say that I can see how you need to be able to relate to the lifestyles depicted to appreciate the film. Because if you can't, this might as well be about life on Mars.<br><br>This is a smart movie. And the concept is pretty original, considering the difficulty of deviating from the restrictions of the genre. The leads are immensely likable and each able to toss off complex comedic riffs with ease. And I very much enjoyed seeing Adam Scott play the heavy. Not easy to portray a dull-as-donuts bad guy, but he pulled it off.<br><br>Despite the \"truthiness\" of the dialog, the movie does share one thing with all romantic comedies: it's a wet dream for the love hungry. Especially for those folks who juggle and struggle with the reality of modern relationships. The lead characters wear a veneer of cynical sophistication that many of us use as protective shields. But, as is expected from a rom-com, the veneer cracks. And we're glad when it does.<br><br>I thoroughly enjoyed this movie, but be warned: it is a movie for grown ups.","user":"ekeby","rank":[48,57]},{"title":"Not everyone will like it as much as I did, but some might.","rating":10,"date":"24 January 2016","review":"Let's start by saying, you can't take the title as an accurate representation of this movie. It suits it very well though, just not in a literal sense. Some people didn't like it because they expected an original comedy about open relationships and got a romantic comedy about two emotionally messed up individuals. And if you aren't expecting it to be something else, this movie absolutely nails it.<br><br>I know not everyone wants to see a movie about those kind of characters, but I'm really sick of rom-coms about people who have a healthy relationship with sex unless they're a bad guy or someone whose not mean to find love. I thought it was really refreshing to see characters with these issues and the movie was well done. Sure it's a romantic comedy with all the right clichés and cheeky music, and sure the characters aren't relatable to everyone, but for me, it was just perfect.","user":"ga_x","rank":[39,55]},{"title":"A film that really speaks its target audience's language about what really matters","rating":8,"date":"16 January 2016","review":"\"Pretend this empty bottle of green tea is your vagina.\" - Jake, Jason Sudeikis <br><br>\"Looks just like it.\" - Lainey, Alison Brie <br><br>(nearly interrupting her) \"Great, let's move on.\" - Jake, Jason Sudeikis\"<br><br>Early on-set chemistry between actors in movies is a seriously beautiful thing, especially when it's a chemistry you can see develop from the very first frame in the film. Sleeping with Other People features two delightful performers that I would've never thought have been so charismatic and fun together. The performers in question are Alison Brie and Jason Sudeikis, both proved assets to nearly every film they are in, Brie for her constant, easy-going charisma and her strengths at situational and conversational humor, and Sudeikis for affable and impressively mature \"manchild\" roles, if that makes sense.<br><br>The two make Sleeping with Other People, the sophomore effort from Leslye Headland, who directed Bachelorette in 2012, a delightful romantic comedy, one that speaks to the current generation by use of wit, deadpan sarcasm, technological incorporation, and quick-witted banter. Rather than trying too hard to try and illustrate a new kind of relationship between people like Friends with Benefits, or frustrate with its narrative conventions and compliance with incredulous circumstances like Safe Haven, Sleeping with Other People is so simple and genuine that you may overlook how large its impact is.<br><br>The film opens in 2002, where a young collegian named Lainey (Alison Brie) creates a scene outside of Jake's (Jason Sudeikis) dorm. When she is about to be kicked out by security, Jake vouches that she is indeed his guest, and the two spend most of the night in his dorm as she states that her plan was to lose her virginity to her teaching assistant Matt (Adam Scott). Jake, who is also a virgin, slams Matt as one of the most boring people on the faces of the Earth, and both him and Lainey end up hitting it off so well that they wind up having sex.<br><br>In the present day, we see Lainey break up with her long-term boyfriend after telling him she has been cheating on him. Per her therapist's request, Lainey decides to visit a \"love addicts\" meeting where she runs into Jake, who is there for his inability to commit. The two wind up reconnecting just in time for Lainey to realize that Matt, who she was cheating with, is getting engaged; both Lainey and Jake decide to serve as one another's personal therapist as they carry out a strictly platonic relationship revolving around discussing sex and learning the process and perks of commitment.<br><br>As stated, the bulk of this film relies on the charming and nonchalant chemistry of both Sudeikis and Brie, which is something that consistently works in the film's favor. Both are comedians well-versed and trained in the field of modern comedies, so it's no surprise that when the two get together, Headland's script has them zealously spouting off quick-witted lines filled with subtle humor and sarcastic undertones. Furthermore, this is the kind of language that the target audience speaks in, especially when the subject revolves around love and romantic commitment.<br><br>We're approaching a day and age where more and more young people are rejecting the idea of committing to another person or even formally dating. Positives and negatives of that aside, films like Sleeping with Other People are what we need to document such a shift in mindset. This is a film that doesn't condescend the already disenfranchised demographic when it comes to assertions of them \"getting serious\" with one another, or the lack of ability to do so, nor does it feel like this was a film made by outsiders looking in, thinking they know how the newer generations operate without really knowing how they operate. Headland does a wonderful job at conveying a sense of maturity and restraint in her script, even when situations call for Jake showing Lainey how to masturbate using an empty bottle of green tea.<br><br>Quoted above is a line that perfectly summarizes the humor in this film, not in terms of content, but in terms of zealous energy and conversational wit. Sudeikis and Brie are so used to commanding the screen in their films, regardless of whether or not they have a starring or supporting role, that it's almost as if they cannot help but exhaust all their comedic abilities in this particular film. The result, coupled with the recurring themes of this generation's approach to love and relationships, is refreshing and uncommonly fun, especially given how laidback this film constantly feels.<br><br>Starring: Alison Brie, Jason Sudeikis, and Adam Scott. Directed by: Leslye Headland.","user":"StevePulaski","rank":[35,54]}]