[{"title":"Delightful New York City Ballet documentary","rating":8,"date":"10 May 2015","review":"\"Ballet 422\" (2014 release; 75 min.) is a documentary about how New York City Ballet dancer Justin Peck, all of just 25 yrs. old, is commissioned to choreograph a new ballet piece, and he has only 2 months to do it, with the premiere scheduled for January 31, 2013 (it is the only new ballet piece of the Winter '13 season, and it is the ballet's 422th overall). The documentary opens with a couple of facts regarding the City Ballet itself (such as: it has its own full tie orchestra), and then we dive straight in, and we are treated to a no-holds barred behind the scenes look at how Peck goes about it.<br><br>Couple of comments: first and foremost, if you don't care for ballet, please save yourself the trouble and check out another movie instead. On the other hand, if you love ballet, chances are that you will marvel as we get a glimpse of how the City ballet actually works on a day-to-day basis. We get to know Justin Peck a little bit, as well as several of the featured dancers including Tiler Peck (no relation) and Sterling Hyltin. If you are expecting high drama (say as in \"Black Swan\"), you will be sorely disappointed. Instead, we get to appreciate the hard work that goes into a ballet piece, all the way to the smallest details (it is amazing to see how much attention the costume design is given). Couple of surprises for me from the documentary: at no point does Justin Peck share explain his vision or concept for he new ballet piece, or if he did, it didn't make it in the documentary. Also, while we are told that the music being used for the ballet hails from 1935, we don't find out what composer or which music piece until the movie's end credits, wow. But in the end those are minor quibbles, and I enjoyed \"Ballet 422\" quite a bit.<br><br>I saw \"Ballet 422\" at a recent one-time only special showing at my local art-house theater here in Cincinnati. It was announced beforehand that following the showing there would be a Q&amp;A with Victoria Morgan, Creative Director and CEO of the Cincinnati Ballet. It was great that the theater was absolutely PACKED for this, and indeed there was a lively discussion after the showing, with Victoria sharing her further insights on all this. If you love ballet, I strongly encourage you to check out \"Ballet 422\", be it in the theater, on VOD, or eventually on DVD/Blu-ray (where hopefully there will be some bonus materials). \"Ballet 422\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[15,17]},{"title":"Disappointing","rating":5,"date":"22 September 2015","review":"This was pretty disappointing. There is just not enough dance and too much filler (or cinema verite) as in:<br><br><ul><li>Justin Peck (choreographer) walking down empty corridors</li></ul><br><br><ul><li>the orchestra being conducted</li></ul><br><br><ul><li>too much on costume assemblage (there is footage of a washing machine)</li></ul><br><br><ul><li>NYC subway stations</li></ul><br><br>There is not much on the inspiration for the dance and the choreography; there is some perspiration (some short dancing scenes), but very little on the creative process. It's like seeing architects and engineers walking and talking, but never seeing the finished product(the building - in this case the dance).<br><br>For dancers only. Not for the audience. I pressed fast forward several times. Badly assembled and edited.","user":"MikeyB1793","rank":[11,14]},{"title":"Avid interest only","rating":2,"date":"11 March 2016","review":"As an ex - professional ballet dancer I found this an interesting piece to watch . I was excited to watch a \"dance film\" but found that It focuses greatly upon rehearsal and the choreographer yet sadly lacks any entertainment value. Dance, is about the artistic representation of life , love , passion, however this film has none. The part where the choreographer is asked to thank the orchestra is particularly cognisant of how narcissistic dancers can be . I would encourage young dancers to watch it to realise that this is again sadly actually what being a professional ballet dancer is all about. There are better things to do with your life .","user":"thespoonies","rank":[7,10]}]