[{"title":"Generic and predictable...","rating":3,"date":"19 August 2014","review":"\"Zodiac: Signs of the Apocalypse\" is a very generic and stereotypical disaster movie that follows the dummies handbook of how to make a disaster movie. Everything in the movie was so predictable and scripted that you saw it coming a mile away. And this really brought down the overall enjoyment of the movie.<br><br>Sure, the movie was entertaining enough for what it is, but if you have seen any other disaster movie, then you basically have seen this one as well - in theory.<br><br>The story is about a series of disasters that happen around the world, and the future of the entire planet rests in the hands of a few people that run against time to save the Earth.<br><br>Yeah, basically the same as most other disaster movies. And for some odd reason all these events were happening all around these people. It just didn't make sense. Why would all these cataclysmic events take place around these and not at random locations around the world? Effects-wise, then \"Zodiac: Signs of the Apocalypse\" was adequate. The effects worked well enough for what they were supposed to portray. But they weren't mind-blowing or overly impressive. So don't get your hopes up for these.<br><br>As for the acting, well people were doing good enough jobs with their given roles. Joel Gretch was the one who carried the movie, no doubt about it.<br><br>\"Zodiac: Signs of the Apocalypse\" is a very average run-of-the-mill disaster movie that offers nothing new to the genre. You watch this movie once and never again.","user":"paul_haakonsen","rank":[55,67]},{"title":"Not worth the time","rating":2,"date":"11 January 2015","review":"I give credit to the director for trying but don't expect much. The storyline is like any other disaster movie, only difference is how the disasters come about. The special effects are terrible and you can see clearly they are computerized and transfered - hardly believable. Some of the characters got under your skin, and Christopher LLoyd - maybe it 's his age but a disappointment from his days in Back To The Future. The actors did do a nice job carrying the movie but the special effects just didn't seem to help it - in fact it made you cringe at the way some of the effects appeared. A made for TV film for a rainy Sunday afternoon.","user":"panther_husky","rank":[22,25]},{"title":"Spend 1,5 hours in oblivion","rating":3,"date":"15 January 2015","review":"Especially the special effects for the tidal wave were one of the worst I have ever seen.<br><br>The screaming girl with the blond/pink hair needs more acting lessons! She seemed to squeak, scream and express fear at almost everything that happened in the movie and not very good at it as well. I felt like slapping her in the face and yell at her; pull it together bitch!<br><br>The silly scene where the other woman was being sucked away from the car, I was cringing in despair - I couldn't even watch how stupid this scene was unfolding!<br><br>In general a movie for when you don't want to think too much and waste your precious time you could have spend better reading a book.","user":"patricevanes-583-951297","rank":[6,7]}]