[{"title":"Breakdown Lane: Lifeless zombie effort","rating":3,"date":"23 August 2017","review":"This Canadian zombie film actually started quite well. Telling the story of a woman who breaks down in the middle of a desert waiting for a pick up truck unaware that the zombie apocalypse has begun.<br><br>Dealing with the elements, zombies and cannibals she must escape the desert and survive the ordeal.<br><br>Again it starts promisingly but get's real dull real fast.<br><br>The Good: <br><br>Lead is competent enough <br><br>Premise is original <br><br>The Bad: <br><br>Awful sound editing <br><br>The soundtrack is essentially the same piece of music on a loop <br><br>Things I learnt from this movie: <br><br>1 day after the zombie apocalypse begins and its essential to breed <br><br>Liberals are evil due to their doctors &amp; their scientists <br><br>The first aid kit is where people store their lollipops","user":"Platypuschow","rank":[15,15]},{"title":"Take it for what it is","rating":5,"date":"19 June 2017","review":"A very low-budget zombie flick that actually has some decent aspects to it but can't seem to decide which type of movie it is. For starters, the tone is all over the place.<br><br>It starts off as a fairly suspenseful movie, with the main character stranded on the highway miles from anywhere and there's small ominous feel to it that she'll be fighting for her life in the wilderness.The hillbillies/rednecks turn up to save her and she escapes, meets another guy who saves her and take her to the city/town, then the movie begins to lose itself a little bit. <br><br>She suddenly goes from a helpless woman to Rambo in the space of the minutes, with scenes like reading 'Shooting for Dummies' then she's a shooting ace and expert zombie killer, and the tone almost becomes like a comedy/spoof. The hillbilly/redneck just happens to be outside the door in the Mall, of all the places to be!<br><br>The pacing is a little off too, with the car scenes going over a relatively slow timescale, then once she's in the city, it speeds up and whizzes through its story, and the suspense from the start is a bit lost and it all becomes a bit tongue-in-cheek. <br><br>The acting is pretty good for a film of this stature, the lead actress, Whitney Moore, does a good job and carries the film well. The actor playing Max, was also pretty good and made the character likable. Same can't be said for the minor rooftop characters who were pretty wooden and emotionless, and just not very good.The rooftop jumping scene where they all jump onto rubbish, is clearly just a 2m drop as some of the actors landings are just awful. I appreciate that's what the set is, but still at least make it look like a jump from a building's rooftop. <br><br>The zombies or makeup aren't bad given the budget, but the CGI is bad, blood spurting everywhere yet no bullet holes or anything. <br><br>Is it great? No. Is it terrible? Also no. 'Breakdown Lane' doesn't outstay its welcome with its running time nor does it really bore the watcher. Take it for what it is, A C-movie zombie flick that quite frankly is a valiant effort that shouldn't be take too seriously. I enjoyed it. <br><br>5/10","user":"egghead28","rank":[6,7]},{"title":"Was this a spoof?...","rating":3,"date":"5 June 2017","review":"I knew that I should have taken heed to the low rating that \"Breakdown Lane\" had managed to score here on IMDb. But it is a zombie movie after all, and that is really all that is needed to make me watch a movie. However, the market is unfortunately flooded with questionable entries in the zombie genre.<br><br>\"Breakdown Lane\" didn't break that mold, and it turned out to be just another low budget zombie movie with the heart resolute on trying, but failing to achieve anything.<br><br>This is definitely a B-movie in every meaning of the term. Low budget script writing, low budget special effects, low budget acting talents, well, you know how it goes.<br><br>The movie is incredibly slow paced and very, very little happened throughout the course of the movie. And that made it really difficult to sit through and watch it to the very end. And believe me, it was indeed a struggle to sit through this.<br><br>As for the script, well this pretty much sums it up; are you kidding me? Wow, the script for \"Breakdown Lane\" was definitely something else. And points for trying, but come on... It was just so far fetched that it was like it was a farce on the zombie genre.<br><br>It was so hard to take it serious that the day after an outbreak happen that people would resort to cannibalism. One day! There would be so much food at the stores and homes, it was just idiotic. And more so why would they say that they needed to breed and repopulate the Earth? Just how fast and effective was this outbreak? Talk about some major plot holes and lacks of writing anything worthwhile.<br><br>The zombie effects were laughable at best. But at least they were trying. And sadly so, because special effects are vital - pardon the pun - to a zombie movie to be effective. Here \"Breakdown Lane\" didn't come through.<br><br>\"Breakdown Lane\" is not a particularly impressive addition to the zombie movie gallery. And it is definitely not a movie that I will be returning to watch again, as it just didn't have any outstanding qualities to it. Actually, I gave up after about an hour of sitting through this slow paced ordeal, then I just tossed the towel in the ring.","user":"paul_haakonsen","rank":[12,19]}]