[{"title":"Intense thriller based on a true story and with a rare glimpse on ethnic relations in the 80s USSR","rating":10,"date":"24 December 2017","review":"A fascinating Estonian angle on Nordic noir, \"The Ghost Mountaineer\" is an excellent and original autobiographical thriller by Estonian documentary filmmaker Urmas Eero Liiv, a one-time biologist and a mountaineer. It tells the story of a group of late-Soviet Estonian university students embarking on a long hike in the snowy mountains and valleys of Buryat mountains in Siberia in search for the rare nephrite-rocks and, of course, fun. On the way, they lose one of their own and are forced to struggle with the harsh Siberian climate, their own inner-demons, perverse provincial Soviet bureaucrats, and the seemingly mysterious Buryat natives, semi-tamed by the European \"civilization\" of the Soviet/Russian type.<br><br>The imdb plot description and the previous reviewers seriously misrepresent this film. This is neither a youth film, nor an adventure movie. This is no horror flick or an orientalizing supernatural fantasy. It is a realistic thriller about youngsters from the European part of the USSR encountering the far-away Soviet East and its provinical colonial Russian bureaucrats. Kalatozov's \"Letter Never Sent\" meets with Peter Weir meets with the best of contemporary Nordic thrillers. Though the depiction of Buryats and Russian bureaucrats could have been subtler, it honestly represents the ethnic projections, stereotypes, and relationships in the USSR on the eve of its collapse, without any retroactive political correctness so typical to the morally monistic cinema today. The film's dream sequences not only shock, but also offer an interesting glimpse at how the Estonian youngsters project their culturally conditioned fears on the strange environment, and the film makes it pretty clear that this point of view has little to do with the much more complex social reality existing in the Buryat village at the time (the film was shot on location in the same Buryat village, where the actual events took place).<br><br>This is a very fine snowy thriller and an excellent debut for Urmas E. Liiv. I hope he will return to feature filmmaking very soon.","user":"georgekaplan2","rank":[5,7]},{"title":"Solid fun","rating":6,"date":"27 December 2018","review":"This is quite a solid horror flick, much better than your usual teenage slasher. It has some very good photography and the young actors do a decent job. I enjoyed it quite a lot, even though it has its obvious misses and occasionally loses the track.","user":"vandre-92843","rank":[1,1]},{"title":"Hectic, at times fathomless film, with some good performances","rating":6,"date":"17 December 2017","review":"As spoilt by Nordic Noir, I can´t say that I had high hopes, regardless of its popularity in our cinemas (was among the most popular films in 2015) and some young actors who have made a name for themselves already... But I thought that realistic background and exotic locality could elevate the viewing experience. Well, apparently they did, as I decided to watch until the end, but there were really many scenes when I focused on beautiful nature and venue peculiarities - as the course of events and lines were not catchy. The most interesting character/performance appeared to be Vadim Andreev as the local militia chief, and everything supposed to be mystical was rather tedious or over-sophisticated, without logical round-up of events. The background voices of real persons brought along unnessary documentarism, plus too early in the film (they could have been involved towards the end, before or with credits). <br><br>6 points (performances and use of landscape - 7, the rest - 5) thanks to realistic motifs only. Alas, Must alpinist is a mediocre work even among Estonian films (= usually slow and made with limited budget).","user":"BeneCumb","rank":[2,4]}]