[{"title":"Watch out for critics who lead you astray","rating":9,"date":"9 November 2015","review":"I thought this was an interesting concept film - sure there are relationship breakdowns in it but these characters depicted are clever - they are not perfect. This film is simply about accessing Telepathy and what you might do if you could read or influence another persons thought processes and what happens when a g'meant gets hold of technology for controlling its citizens thinking. Listening is an interesting concept film. I say concept because you need to constantly watch out for the critics (rotten tomatoes) who review films - they give big scores to crap films like Spy and Turbo Kid and then hang crap on a concept film like this. I don't understand what exactly they hope to gain out of honoring stupid spoof films or comedy genital overloaded jokes films with there 8/10 score. They don't like concept films that's for sure!!.","user":"pgrieves","rank":[19,21]},{"title":"The war on people - the magicians other hand!","rating":9,"date":"20 October 2015","review":"An excellent script well performed.<br><br>-- <br><br>When you look at a street in almost any city in the western world today, you see cameras pointing towards the street to automatically and silently film people going about their regular business.<br><br>The way to protect yourself from this kind of information gathering is by hiding your face ALWAYS, when you are outside. Which would most likely garner you a more intense surveillance - possibly wiretapping and your house bugged and your friends bugged and you mail read and electronic activities monitored, all the way up to physical intervention, incarceration, \"evidence planted\", defamation - possibly elimination, if the watchers cant make you.<br><br>If you go on the net, there is no mechanism designed to cover your tracks and actions, which cannot be cracked - leaving your thought patterns, your needs, your funding, connections, friends, family etc wide open to blatant scrutiny or simple data gathering. Forget about VPN or Tor or what ever. One slip, and your IP is toast and not just your secrets are out, but everything your have ever shared digitally with anyone over the net.<br><br>Why is that? Because ever since 9/11 USA and all other countries (in order to be able to send and receive plane passengers from all over) have treated their citizens and citizens of most other nations as suspects - potential threats to cities, infrastructure, businesses, economic structures and institutions and their national citizens too, if not for humanitarian reasons then from an attempt to prevent widespread fear and out-of-control actions taken by more than gun-ready-and-willing men and women.<br><br>What if that lack of control over citizens could go away within a short while? What if USA, always seeking to be the bigger, the stronger, the wisest brother in the world, found a way to do that? What if the war on people was really patricide/matricide from blind greed, last rat gets the bigger loot?! <br><br>= = = = = = = = = = = = = SPOILER = = = = = = = = = = = = = <br><br>This movie explores well know themes of surveillance and mind control in order to show that mainstream people only used to guns in the media don't realize surveillance and monitoring and pooling private information is really a weapon against a nation's citizens, not a protection from foreigners.<br><br>As an intellectual exercise this is kinda easy to both realize and sort of accept, but when you actually understand the implications of controlling powers being able to predict your actions and opinions and choices, it loses its intellectual shine as it verges towards actual loss of freedom - of mobility, speech, purchasing power, schooling, teaching, voting, housing, participating, giving aid and assistance etc.<br><br>Population control is becoming an increasingly difficult task, as shown by the recent Sicario (2015), where whole major cities can be besieged by criminal and violent \"examples\" and all \"loyalty\" goes to those, who can instill fear, rather than to those who protect.<br><br>While \"Listening\" may skip a bit on the realistic side, when it comes to calculating the consequences of thinking, feeling people falling pray to fascistic measures without relevant opposition - thus over-playing both spread and danger of a technological mind-control scheme - the script still manages to represent the eager greed with which possible control of people's patterns and actions is to be measured. (It IS lucky that everything living by electricity will die from lack of electricity or from magnetism. Making an EMP placed here and there hunky dory, if ever they tried anything similar in reality).<br><br>But don't take the movie as a literal statement. Take it as a pointer to the magician's other hand: What is everyone upholding power doing in their free time, that they do not want out in the open? What are they doing during working hours, that they don't want to share? See this film as an argument for full disclosure - as long as it is out of VOLITION. In an atmosphere of distrust, meaning: \"You go first...\"","user":"krabat-0","rank":[17,20]},{"title":"A real 'Diamond in the Rough'.","rating":8,"date":"16 October 2015","review":"This is an excellent film which tackles some very interesting moral questions in an understandable and entertaining way. It's rare to see such a strong narrative which holds your interest for the entire film. With surprisingly good production values and some great casting choices, this really is a 'Diamond in the Rough'. There are plenty of twists and turns in the plot, which deals with basic human freedoms and ethics - even though it can seem a little slow at the start. If you stick with this movie and give it a chance, you'll find yourself drawn into a world of secrets, espionage and brain-computer interfacing. If you enjoy films that pose interesting moral dilemmas and aren't just full of action, stunts and CGI effects, this title is one of the best I've seen in quite a while and I'd recommend it highly.","user":"emberstonepierce","rank":[22,28]}]