[{"title":"Should be 3 different movies","rating":3,"date":"17 August 2015","review":"Too many ideas and stories happening in this movie.<br><br>First story - there are the two brothers - street performers - one recites Shakespere while the other is picking the pockets of the pedestrians listening to the recitation. All their efforts to steal money is absorbed and spent by the wicked alcoholic gambling addicted father. His sons want to help him but the father wants to control them for his own purposes.<br><br>Second story - there is the father full of false ideals for his children. But his gambling/alcoholic addiction has and is destroying his two sons. The father has borrowed so much money the mob wants payment. All three think the mother (who left years ago) will come back. Never happens! <br><br>Third story - one son has allied himself with a friend who has designed the perfect counterfeit money! They go on a spending and gambling spree and this alerts the mob and they want revenge. Unknown to the counterfeit whiz kid, his friend is in an affair with the whiz kid's mother! <br><br>All three of these ideas are mixed into this movie and you never feel the characters &amp; plot reach their full potential. As soon as you get into one element of this plot another plot jumps in. I hope this review makes sense because the movie had a hard time sticking to one plot! As I'm having a hard time writing this review.","user":"cekadah","rank":[10,11]},{"title":"Totally Disjointed","rating":3,"date":"20 June 2015","review":"The true mark out of 10 will be apparent when some more votes come in rather than those from the friends and family of the production team...This film had several stories which were poorly explained and never developed. It could've been an excellent film if it weren't trying so hard to be something more than it's substance permitted whilst ending up just a contrived piece of nonsense. Just pretty boring and predictable all round.<br><br>The acting was pretty poor from some characters too with one memorable horrendous attempt at an English accent from Roman (Gbenga Akinnagbe). All in all the whole experience left me a little underwhelmed and with the overall feelings...\"What was that?\" and \"Is that it?\"","user":"mairtino","rank":[11,14]},{"title":"A Shakesparean movie. But in the end it looks like an accumulation of unfinished ideas.","rating":3,"date":"30 October 2015","review":"\"At your age, I was better !\" <br><br>Occasionally you come across a movie you've never heard about, with a well known actor starring in it. Like \"Phantom Halo\" for instance with Thomas \"The Maze Runner\" Brodie-Sangster. In hindsight it seemed as if they wanted to cram different stories in one film. One of those stories was portrayed in a successful way. The storyline which covered the criminal element, lamentably ended in a fiasco. The use of centuries old literature written by Shakespeare, won't turn it into a classical drama. Even though this was the most successful part.<br><br>Samuel (Brodie-Sangster) and Beckett (Luke Kleintank) are two brothers whose daily task consists of hiding the little bit of money they own for their father Warren (Sebastian Roché). The latter is a gambling alcoholic who apparently quoted Shakespeare somewhere on a stage in the past. And that's what Samuel has to do at street corners. He holds a Shakespearean monologue, while his brother deprives the bystanders of their wallets and other valuables. When it turns out that Warren owes a rather large amount of money to a loan shark, Beckett tries to solve this problem with help of his old friend Little Larry (Jordan Dunn).<br><br>And as this second fact evolves, the level of this film goes downwards and culminates in a horrible, clumsy denouement. The moment Ms. Rose (Rebecca Romijn), the breathtaking handsome mother of Little Larry, opposes Donny, I expected the worst already. This fragment felt so amateurish and implausible. And indeed, the follow-up was nothing to write home about.<br><br>To think that the run up to this ending was so much better. The portrayed family drama was fascinating to watch. Especially the brilliant interaction between father and sons. The way Samuel and Beckett try to make ends meet and how they are instructed by their father to scrape together the much needed cash, which Warren spends at the gambling table after wards. But unfortunately this is ruined by irritating futilities and stupidities. At some point you even forget where the title of the movie is related to and the cartoon character \"Phantom Halo\" seems to be nothing more than a fait diverse. Out of nowhere a fingertip-chopping Chinese girl appears (after which I was wondering what the punishment would be when stealing her fathers car). And although Little Larry was repeatedly warned by Donny not to deceive him, after a while he's unabashedly driving around together with Beckett with a glitzy Bentley. That was a bit shortsighted, not to say plain stupid. The brief affair with Ms. Rose was totally irrelevant. And apparently they tried to finish it in a Tarantino way. But this attempt looks amateurish and rather fake.<br><br>Briefly and concisely: this movie is an accumulation of unfinished ideas.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[5,6]}]