[{"title":"Deserves a higher rating than the current 5.1","rating":7,"date":"8 September 2015","review":"A nice surprise, which I didn't have terribly high hopes for after seeing the ratings but it was actually a nice little film.<br><br>It's a drama about a black teenager from a really religious upringing who's struggling with his sexuality, biggest reason for his struggle being his force-fed belief that homosexuality is a sin. <br><br>But there is tons of humor in the movie as well, it's definitely not all darkness even though there are plenty of sadder moments as well it combines the serious drama and comedy very well. <br><br>The cast all do a very good job and may I say that the lead; Julian Walker is a brilliant singer as well? Well he is. <br><br>The only issue I have really is that there was a moment in the end where they throw a bit of a twist on you that I didn't really quite understand fully but on the rewatch I'll pay closer attention and perhaps it will fully make sense. <br><br>Still nothing that takes away from the overall feel of the movie.","user":"Seth_Rogue_One","rank":[18,20]},{"title":"Blackbird Voices Struggle of Many Real-Life Youth","rating":8,"date":"16 August 2015","review":"Blackbird pulls at the heartstrings with a touching story of a young high school student struggling with his sexuality against the backdrop of small town Mississippi. To make matters worse our main character is being raised in a deeply religious household and his baby sister has been missing for several years. As you can image, this has caused a huge rift in his family that threatens to tear it apart forever.<br><br>Young Randy, played by newcomer Julian Walker, must be strong for both himself and his mom (Mo'Nique); the latter of which is on the verge of a major breakdown. Randy's father, portrayed by Isaiah Washington, would like to be there for his wife and son, but it appears both parties have given up on the father for reasons which aren't really clear. Randy would very much like to help his family cope through these tough times; however, before he can do this, he must first learn to help himself. This starts by learning and accepting who he, himself, really is.<br><br>In the opening scene I must admit I wasn't very impressed with Walker's acting but as the story progressed I began to see why writer/director Patrik-Ian Polk was charmed by the unknown actor. Walker ended up doing a fine job and seems like a natural. <br><br>I think a lot of the reasons why I liked this film so much is because I see so much of myself in Randy. I, too, grew up in a devout Christian household struggling with my sexuality. I didn't have a missing baby sister or an openly gay best friend named Efrem (Gary L. Gary), but the struggle, confusion, and secret, sinful pleasure was all there. And that's what makes Blackbird so special – it's a real life story from the perspective of so many young boys and girls across the country that have secretly struggled (and still struggle) with their sexuality. Even in today's progressive society this can still be a taboo and scary issue – when it shouldn't even be an issue at all. <br><br>Luckily for Randy – he eventually does figure it out and accept who he is. However, one of his high school buddies, Todd (and secret crush) shows up in a dream and foretells the future. He'll have some ups and downs along the way, but nothing he experiences, no matter how great, will ever take away from this coming-of-age period in his life where he figured it all out (his sexuality). And I know this feeling too: Nostalgia! This is what Blackbird captures so well. <br><br>That said, I did have a few issues with the film – hence the reason it's not receiving a perfect 10 rating First up, while Mo'Nique once again shows she's not just a loud-mouth comedian, her role was too close of a rehash of the crazy, abusive mother she played in Precious; maybe this time with a sprinkle of Piper Laurie's overly- religious Margaret White from the original Carrie. To her credit, Mo'Nique did own her part in Blackbird, though I just knew at any moment she would breakout with, \"you sit there and you judge me, and you write them notes on your notepad\" Lord! There lies the problem. We've seen enough of Mary in Precious. Can we leave her in that movie? <br><br>And this next one is just my personal gripe, but - no way in hell if I were Randy could I have been battling gay feelings/dreams and had an openly gay friend as fine as Efrem who obviously had the hots for me. This movie never would have been made because I would have figured it out (with Efrem's help) a long time ago...","user":"Marc_Action","rank":[11,13]},{"title":"Great Film...Period","rating":10,"date":"25 February 2016","review":"It is low budget movie....so what! The actors portraying the teens were great. I would have liked them to be fleshed out more...but so what! The story line of youth coming into their own is probably playing out in millions of homes across the world. The writing was start/sad/witty/funny. I would have liked to see more about the young couple and their struggles. The sex scenes were not just obligatory, they were well produced/directed. Did I say it was low budget....SO WHAT! I can't find the soundtrack to this movie...the first song should be on my Ipod...Period... If there is a soundtrack please release it somewhere....Period","user":"complaintsrus","rank":[5,5]}]