[{"title":"19th Century Romantics Alert","rating":8,"date":"12 September 2014","review":"If you like the idea of traveling to Italy and also of watching period costume dramas, this pick may be for you. I ate it up. I thought the main performance was astonishing and you will rarely see a film which takes better advantage of fabulous locations throughout Italy which appear to just unfurl as scenery miraculously still in existence despite the passage of more than 150 years.<br><br>I did not know this poet at all and yet I definitely enjoyed this poetic film. Although I was the only one in the theater who laughed at regular intervals, I think you might find some underlying wit in all the melancholy. Rarely has the cage of being upper class been so well depicted in film. If you want to feel sorry for the independently wealthy nobility of Italy, this film will lay it all out for you.<br><br>As a fan of Jane Austin and most of the films made of her work, I heartily recommend this movie for a very interesting escape. It is not a tale of a romance, but rather of a man who's heart is bursting with passion. His brain is ahead of his time and it makes for modern excitement. Great contemporary music is woven in very skillfully.","user":"juliasf","rank":[20,22]},{"title":"The rebellious poet.","rating":8,"date":"6 November 2014","review":"Hard to sum up the tormented and passionate human experience of Giacomo Leopardi, one of Italy's finest artistic minds and souls, and hard to do it without slipping into easy pathos and sentimental triteness, without playing and indulging with the innate melancholy of the poet's world view, to lever on the audience's feelings and appeal to them, the cheapest way. But Martone's eye seems to have no interest in focusing on that aspect. Although the narration is in no way dry, the director lets the poet (portrayed by a wonderful Elio Germano) speaks for himself. <br><br>Poetry comes alive, and through poetry, line after line, recited to the night sky, to the moon, to the \"native wild village\"'s roofs, to a dead love fantasy, recited in the grass of his \"lonely hill\", to the infinite, romantic wilderness of nature and space; through poetry we see Giacomo: a hungry soul, a restless mind, a rebel, a restless rebel, a hungry mind. The explorer, the wanderer, the child. It's in the details, in the vocal hues, in the witty comebacks, it's in the pride towards creation, towards feelings, towards sadness even; it's in the laughing quietly in the face of the disease. It's in eating ice cream when expressly discouraged, and falling asleep in the marquise's waiting room. It's the strength of the spirit, flashing fragmentarily through the cracks of a wrecked body, of the grip of a possessive, impossible father, of the unbreakable walls of social conformity. It's Giacomo mixing with the common class in the streets of Naples, and smashing (in his mind) the chair where he's sitting when subjected to his old man's sermon. <br><br>Martone described Giacomo Leopardi as some kind of Kurt Cobain of the nineteenth century. Many would find this definition outrageous, hasty, forced, but -- at least as this movie shows -- closer to the truth than expected.","user":"hushsara","rank":[14,16]},{"title":"A life of poetry successfully transformed to cinematic beauty and realism.","rating":9,"date":"4 May 2015","review":"This is a breathtakingly beautiful film, doing justice both to the unfathomable tragedy of the poet and his whereabouts, character, relationships and experiences, with a fascinating conclusion in Naples of apocalyptic scenery aptly illustrating the almost Goya-like dark world of Leopardi's visionary imagination. Some of the best scenes show some of his outbursts, which pinpoint his case: at one point in a tavern he hits the nail by resoundingly demonstrating that his dark poetry has nothing to do with his terrible physical condition but is only pure poetry of the mind and nothing else. All the acting is superb, and the bold experiment of using modern music, or at least more music made today than in the 1800s, is intelligently successful. The temptation is great to give this a full 10 point score, but it's at least 9.5 for certain. At first you suspect there will be no real story, that it will be like a parallel film to the morose William Turner film earlier this year, but the story is there and gets clearer the longer the film goes on, following with overwhelming carefulness the development of Leopardi's declination with his horrible illness, almost developing into a freak, but he never falls into that trap but sustains his sovereign poetry all the way. He has been called the greatest Italian poet after Dante, and there is something to it, the beauty of his poetry contrasting sharply against its contents of mainly associating with suffering, agony and death. For all his decrepitude, his life was the more passionate, which the film carries forth with realistic style and eloquence all the way. This is a film to watch again from time to time, in spite of its increasingly excruciating pain, but once you have seen it the first time, you can the next time concentrate your attention on its poetry and beauty. The horrible invalidity is only a frame for enhancing the beauty of this life and accomplishment.","user":"clanciai","rank":[9,12]}]