[{"title":"Dark, slower, great","rating":9,"date":"23 March 2018","review":"Great movie with a darker side and slower pace. Solid pictures and directing. Highly recommend it!","user":"tcart-50668","rank":[10,15]},{"title":"Too long, too slow and too bored","rating":10,"date":"10 March 2018","review":"This film if without checking the shooting locality and the accent people spoke, you might mistakenly thought it's an Irish film, but no, it's not. The whole movie gave you no sunshine, no nothing except always a cloudy sky, grim and dark all the time. The movie told you that the older brother made the town richer since he ushered a prison(private own?) to be built in this dreary deadbeat town, but it didn't show you any proof that this town's thriving image, still got a small police force, maybe two cops(s)?. There's not much to see about anything, even we didn't see several key persons existed in this town. \nThe film also told you through the old brother, telling his younger brother, an ex-con after he had served up his prison sentence, that they both got compensation payments from their suicided mother's life insurance. It didn't tell you the exact insured period of time whether her mother's life insurance was after she committed suicide after two years suicide clause, and how much the life insurance policy was insured. Also, guess the timing background was 1986, so the guy could still smoke in any place he wanted. <br><br>The whole movie was at a very slow pace and purposely used the lousy weather condition, always dark and grim to give you an impression it was a suffocating film, only the son who came back believe his mother's death was not a suicide but a murder. But as a viewer like me, I just couldn't care less for this story, so I needed a lot of patience to sit through it. To the end, I felt none of any deep feeling to all of the characters and the film itself. It's a no big deal film that pretentiously provided you with some melancholy touch. Not a bit memorable at all.","user":"LogicIsEverything","rank":[18,32]},{"title":"Slow","rating":3,"date":"1 July 2019","review":"Low budget film...or at least it appears to be that. Lots of unnecessary plots. The hour fifty the movie was could have been done in 30 minutes .","user":"fedesanfe","rank":[2,2]}]