[{"title":"Convergence is exactly the kind of movie we need more of.","rating":9,"date":"1 March 2016","review":"Convergence is one of those movies that I had to watch more than once. What I loved most about it, was that it challenges both the horror and psychological thriller genres in a whole new way. This film does what Hollywood is scared to do. They attempted something different. The religious themes that run through out add a unique view point that I feel gives more depth both to our hero and to the lunatic he is out to get. Truth be told I did feel there were a few pacing issues just around the middle of the film, but the pay off was worth it. The effects were amazing and done without being so over the top that you are taken back out of the film. They kept it classy. I enjoyed that there is certainly some gore but it's not mindless blood lust. Ethan Embry plays a stellar antagonist and Clayne Crawford shows us the emotional side of being pitted in a situation no man wants to face. Convergence brings it home on numerous levels. Eery ghost like beings, a complete nut job that you cant reason with, and feelings of loss when you attempted to do your best for the hero. The supporting characters are huge in this. The nurse alone gave me goosebumps and one unfortunate soul who had a really bad day as far as his face is concerned really got me. I look up to movies like this because they challenge convention and the day to day, re-purposed crap that Hollywood calls original entertainment. Do yourself a favor and watch Convergence at your nearest opportunity. Drew Hall and his crew really know how to entertain.","user":"kiamag","rank":[11,16]},{"title":"The best horror- thriller -cult classic type film i have seen all year!","rating":8,"date":"16 February 2016","review":"This movie is Fantastic! I really wasn't expecting much when I viewed this film. These days it seems like, \" you've seen one you've seen them all\" and I'm really getting sick of all the Copy Cat \" SAW/ Poltergeist/Satan's busting a move to take over the world \"Franchise Crap, but that's Holly wood for you, rehashing a theme until it's a dead horse mangled on the ground.<br><br>This movie is done like a cult classic and I think they did it that way on purpose. It has a couple of good spins in it, some scares, some corn ball Lurch types, even a 50's Betty-Boop nurse. It really had a great mixture all around. I'm not really a horror/beyond the grave/Limbo movie fan, but this kept me in my seat and motivated to keep watching.<br><br>The twist towards the end and how it just slid right into your lap was really well done, My prediction of how it was going to end was way off and that was refreshing for once.<br><br>If you get the chance to take this Movie in, Do so. Enjoy!","user":"scottamac","rank":[18,33]},{"title":"A solid 8, with a well written story","rating":8,"date":"18 April 2018","review":"After glancing over the reviews, and seeing people's confusion/dissatisfaction, I almost didn't bother to watch. If one can only think linearly, or if they are uncomfortable with an unconventional movie, then this movie will probably not be enjoyable. Off the top of my head I'd call it Paranormal, but there are almost equally strong elements of Crime, and Slice of Life. <br><br>I tried doing thing whole \"figure-out-the-plot-twist\", don't bother.....trust me. This may also be an element of what turns people off. This is purely a story being told. Just empty your mind of any preconceived notions and watch. Everything ties in smoothly at a good pace, and the ending is satisfying. Remember, I also labeled this as a Slice of Life. This means no dramatic moments of extraordinary epiphany followed by action. In the end the MC knows exactly what's going on, and just like every human who exercises free will, makes a choice. Also, just like many of us emotion will overcome sense. His heroic deed was accomplished in an anti-heroic style, but just like in life his obsession will.......well I've gone on long enough I think.","user":"annique-83019","rank":[4,5]}]