[{"title":"Surprisingly low rating for such a nice film","rating":8,"date":"29 January 2015","review":"I read a couple of negative reviews and I can only conclude that this is one of those times when people have simply different expectations (high or just different) and they are overall too surprised to enjoy the movie as it is. Some say Holmes plays too young character for her actual age, some say the film isn't funny enough, when it should be a dark comedy and some complain the story is too predictable. <br><br>Main complaint however is that the storyline fails to develop enough to seem believable, and simply emerges to, quote, off-puttingly bizarre (review on holywoodreporter). I must disagree. This movie would not seem annoyingly odd, if you simply don't watch it with certain expectations, and this actually counts for almost any movie. Forget for a minute you're watching Tom Cruise's ex wife, forget that she's also a co-producer, and just let yourself enjoy the movie. Who says films should be \"believable\"?! You may treat this movie as a fairy tale and you'll get overwhelmingly fascinated by the tap-dancing, the hairstyle and the costume design in it. <br><br>You also may be surprised you actually like Holmes' acting. She plays a woman living in a fantasy world, who starts slowly meeting the reality - but who says she should meet the reality all the way through? She abandons her fairy-tale world for a while, just to fix the things that are too odd, but what's nicely surprising is she doesn't abandon it completely. I would say she plays some sort of an everyday super hero, because she fearlessly helps and saves people in need, but she's is depicted without the clichés for a superhero character, and the film is weird enough, in a nice way, to make us think of this without putting it too obvious. <br><br>Another reason to watch this movie is Brenda Abbandandolo's costume design. Miss Meadows' clothes, combined with her hairstyles and maybe the makeup, are the things that make this movie so enjoyable. For any fashion lover, this is a reason alone to watch it. Scenography is also nice, but Katie Holmes in a elegant high waist skirt wearing white gloves and tap-dancing shoes, with cute hair strands and big eyes, this is something completely overwhelmingly cute and sure a reason to love at least a little the film. Her well-illustrated character will make you like the rest of the cast's look - Sheriff's intentionally balding hair, bad guy's evil looking face and his character's overall look - the hair and the dog on a leash. <br><br>At last, I suggest if you suspect that you have developed any kind of high expectations for this film, simply skip it. Watch it only without prejudice, and you will enjoy Katie Holmes acting, and Miss Meadows' clothing and hairstyles.","user":"mmiu","rank":[36,45]},{"title":"Tribeca Review","rating":10,"date":"25 April 2014","review":"I saw this at the Tribeca Film fest and I really liked it. Sure, the plot is clumsy at parts but it is all part of the fun. It's actually hard to describe this film since it has such a unique tone. Think Mary Poppins meets John Waters. It's funny, dark, campy, and it's very out there. I have to say my favorite thing in the film was Katie Holmes. This type of role you just do not expect from her and I hope she continues to do characters outside of her comfort zone because she certainly has the chops to bring them to justice. This is the best performance I've seen from her. the movie got a very generous applaud at the screening I attended at the festival but I don't think this will be a mainstream hit. I think it will eventually find its audience though. I wouldn't be surprised if in the future it joins the list of most respected transgressive cult films.","user":"picuco9","rank":[101,140]},{"title":"Sweet Vengeance Well Deserved Awesomeness","rating":10,"date":"20 March 2015","review":"Katie Holmes is absolute perfection and so absorbed in the role she becomes the character. Miss Meadows makes you question how far you would go to protect innocence if you knew you could prevent it from being taken. A character movie that grabs your emotions and convictions satisfying to the last second of film. This is by far her best role in anything and hopefully will get her well deserved recognition as a character actress. Brilliantly directed and executed, Miss Meadows will share it's deserved place in cinema history as a film that stands out on it's own and delivers a message we should never forget. For those of you that love gripping vengeance films this one redefines the rules of engagement. Superior film making.","user":"sastorytellerfilms","rank":[25,32]}]