[{"title":"Had potential , could have been better","rating":6,"date":"18 July 2018","review":"I don't think this movie deserves all the very negative reviews it is receiving. The acting by Blake Jenner is pretty outstanding and Grant Harvey is also excellent. In this film about completely lost lower class hoodlums most of the roles are actually very well cast. There are some very well done, gritty, realistic and painful scenes. The problem is the screenplay by Mr Jenner really needed work and like so many mediocre movies nowadays, there needed to be more dialogue and less filler scenes, people dancing, walking and lying around. The settings were perfect, but the cutting back and forth from past to present and the scenes shown literally in reverse just came across as gimmicky. Taken as a whole, the movie though is tragically realistic on most points and what saved it for me were the very fine performances from most of the cast.","user":"hampersnow-28905","rank":[8,9]},{"title":"Don't watch unless you consider yourself Low Brow","rating":1,"date":"17 June 2018","review":"This movie is so bad forced me to write a review i'm not going to add spoilers as its not even worth leaking any out .The movie to me has a basketball dairy,kids,Bomb the system kind of vibe to it .All those movies were way better than this film ,this has a film student quality to it which is to say it doesn't have any quality at all.For such wooden predictable cliche writing the actors seem to over act .This is a film for pretentious tool bag hipsters/unwiped artsy fartsy asses as well as navel gazers .Very predictable story you know how its going to end even before the end .Not worth seeing at all then to top it off you have the explicit sex scene thrown in out of no where which just as out of place as the actors.Any time i see some graphic sex in a movie its a huge red flag that the movie is horrible and the sex is thrown into shock and get people talking about about a film that should of never seen the light of day what the girl from super girl was thinking by being in this is beyond me .Imdb really needs to install a negative rating system because giving this a 1 in the positive is too much i would rate this a - Negative 5 if i could .Nothing to see here folks unless you like seeing nude melissa bolona at the expense of being bored to tears by this mental masturbation fodder don't bother","user":"kidjay83","rank":[10,17]},{"title":"Torn","rating":5,"date":"7 March 2020","review":"There were two reasons I watched this movie. The first was to see Melissa Benoist exercise her acting chops in something a bit darker after seeing her in Glee and Supergirl - not that Marley and Kara are the same but something with a little less sunshine. She delivered in this role as she always does. It appears that no matter what it thrown her way, she bats it out of the park... incredible actress. The second reason I watched it is simply because I love indie movies and I found it on Amazon. While not a fan of Blake Jenner, it was apparent he had no problem accessing his anger as an actor and using it to get many of his points across, which was interesting to see after what's been on the news lately. But the primary theme of the movie, as I perceived it, was that quite often no matter how hard you want to change the people around you often won't let you. They shove you into a box, wrap it in tape, and mark it with a sharpie and now matter how much you claw and contort yourself you often can never break out of that box that others have trapped you in. The main character in this movie wanted to change. He wanted out of the gang he was in. He wanted the beautiful girlfriend and the normal life. But no one would allow him to leave his past behind and change except Jennifer. However, she had to protect her own boundaries and rightfully so when Billy put her family in danger. The theme of the movie is a true statement about humanity... about our society. Friendships... relationships often fall apart when one person tries to improve in some way. Other people involved will try to sabotage or, if you're lucky, you will find someone to grow with you. Billy was not so lucky. His friends wanted him to fall with them. So he did... and he took some really good people with him. I won't lie. This movie took 3 hours for me to get through. It wasn't the worst movie I've ever seen. Melissa Benoist did a great job and, like I said, though sad, the theme will hit home for a lot of people.","user":"rebeccaj-90028","rank":[2,2]}]