[{"title":"A SERIOUSLY good flick..","rating":8,"date":"27 January 2017","review":"The biggest mistake you can make going into iBoy is expecting something from the Marvel catalog.<br><br>Cause that is simply not going to happen.<br><br>Instead what you get is a solid Brit \"estate gang\" story (like Harry Brown 2009 or a dozen others you could probably recite from memory) with some Marvel/Spiderman superhero stuff cleverly thrown in.<br><br>And that is a mouthful because I have watched and reviewed a lot of films (check out my list, about 1300) and have never seen anything quite like this before.<br><br>Does it work? For the most part, YES. There are some pacing issues here and there, and it takes a while for the young lead to develop a character arc that the audience is comfortable with, but the suspense/payoff is rock-solid and nail-biting; and the close is edgy but respectful and optimistic.<br><br>The two best performances come from supporting actors -- another oddity.<br><br>Maisie Williams steals every scene not otherwise nailed down and does so with a sweetness of character that makes you wish you knew someone like her when you were in school.<br><br>And Rory Kinnear as the arch-villain almost but not quite moves into the rarefied air of a Bond film -- you keep waiting for him to say \"WHAT DO I WANT IBOY, I WANT YOU TO DIE\" -- but shows enough restraint to keep from falling over the edge.<br><br>In short, given the brilliant idea, the solid execution and its ability to keep the viewer both offguard and entertained at the same time, this a fun flick deserving of a higher IMDb score than I am seeing.<br><br>Recommended!","user":"A_Different_Drummer","rank":[175,215]},{"title":"Solid, but a missed opportunity to make something really great.","rating":7,"date":"28 January 2017","review":"This movie has a lot of good qualities. A largely unknown cast come together nicely, and the cinematography, special effects and score are all very well done.<br><br>The story as a concept is pretty simple, and in the early stages of the movie things were looking very promising and I was enjoying it a lot. As the movie reaches its climax things began to run out of steam and a few unnecessary writing decisions opened up a number of plot holes which had me scratching my head at times. This movie didn't require the big ending it went for. Some more subtle twists and craft would have taken it to the next level and I can't help but thinking some big opportunities were missed.<br><br>Regardless, much of this movie is highly enjoyable and entertaining. I've certainly seen similar concepts executed far worse.","user":"me-589-145643","rank":[45,64]},{"title":"Pretty Bad","rating":4,"date":"30 January 2017","review":"I gave this movie a watch despite it's poor title choice. It's not particularly engaging and doesn't have a very good hook. Although the acting and cinematography are good.<br><br>A boy gets his smartphone smashed and embedded in his head, and gets super powers from this. His powers are never really explained, but it looks like he gets a heads up display of electronic items. As well as being able to control electronics with his mind. Such as speaking over radios and taking money out of online bank accounts.<br><br>Most of the characters are high school students and small time criminals. It's supposed to be gritty and street, but it's hard to believe. How are these kids so well armed? Why do they have access to all these drugs? What is ANYBODIES motivation? These are only some of the unanswered questions.<br><br>I think one of the main shortcomings is that audience age demographic wasn't properly decided on. Most of the actors are high school age, as well as most of the drama and comic relief. But the plot line and suspense is something from a more adult crime movie. The result gives us some incongruous action and unbelievable characters. <br><br>It's like a cross between 'Attack the Block' and '71'. Taking the characters from Block, and the convoluted plot from 71. But lacking all the congruity and charm of each project.<br><br>It looks good though and is well made. Everything but the plot is well executed. The super power angle ends up taking a back seat to the same old re-hashed Brit crime tropes after the first half. The climactic ending seems familiar. The establishing shots of London are the same as always. The cockney crime boss is just as menacing as in every other movie....<br><br>*Sigh* <br><br>You could completely avoid this movie and you'd miss nothing. Or if you like faux gritty Brit street movies then you'll find the good in this.","user":"TherzThz","rank":[63,103]}]