[{"title":"Great movie!","rating":9,"date":"8 May 2016","review":"One of my favourites of the Monster High films and a much watch for the fans! The CGI is very good and polished (as normal). It looks pretty (especially in the lantern scenes). The CGI also fits the atmosphere of the film. The plot is very good and quite creative. The new characters are some of my favourites in the series and it's overall a very enjoyable film. The voice acting is pretty good too. Although Draculaura's voice does get on my nerves quite a bit.<br><br>I would definitely recommend this film to MH fans. It has a good plot, good messages and some very interesting parts to it. A good film that is great for a range of ages.","user":"mccreadielyn","rank":[2,2]},{"title":"Can't feel my eyes.","rating":1,"date":"10 September 2019","review":"This movie has the most awful animation I've ever seen.","user":"toastcustard","rank":[0,0]},{"title":"Very Enjoyable If You Keep Expectations Below","rating":5,"date":"10 January 2014","review":"just saw this film yesterday as this was a DVD release i really liked it for what it was,keep in mind that this is not a Disney release so animation levels are way below similar to late 90s cartoons like Ed Edd &amp; Eddy plus with a little Barbie touch, the story involves rock punk genre &amp; little Egyptian magic tales,based one Monster High Franchise this film is worth a watch.<br><br>The Plot:a young girl at monster high school wants to be popular her dreams come true as she meets a genie who grants her 13 wishes but those wishes come with a price,what will happen to others In Monster High School,is there a curse along with those wishes,all these answers lies in this film.<br><br>there are many funny moments in this film this school is for people who are half human &amp; half monsters one guy has snake on his hair cut appears most of the time,the girls are dressed up with a lot of makeup as Barbie one can think did this franchise aped Barbie not but definitely inspired by it,the dialog's,characters are fun but it looks like your playing a video game or watching some really weird cartoon as animation is out of places at many points,but still the flaws don't overshadow the good story and characters that is what i liked &amp; it became enjoyable,the voice dubbing is little funny too.<br><br>this is a movie for little kids specially girls i don't know why i picked it up as a man to watch this i am old enough but was it worth it yes it was,it will be same for anyone who wants to see this but they will have to keep expectations way below to be saved from disappointment.<br><br>My Rating for Monster High:13 Wishes 2013 is 5/10.a one time good watch","user":"FilmMan47","rank":[2,5]}]