[{"title":"LOVED IT! Can't get this story off my mind.","rating":10,"date":"15 November 2014","review":"This movie from start to finish was nothing short of amazing. Very here and now. Very real. Gugu and Nate Parker gives an exceptional performance in their roles. Even though I come from a very different life than Noni, I could relate to her feelings of not being seen or heard. I found myself feeling sorry for Noni, but wanting her so desperately to rise above all of it and find her own voice and embrace herself. I so appreciate how Gugu caused me as the viewer to feel every scene as if I am right there. I hope she continues to make great films. She was amazing in \"Belle\" and she surely did not disappoint in this one. Great job cast, writers, directors and producers of this film! I definitely plan to add this one to my video library when it comes out on DVD.","user":"whocanfind-379-485123","rank":[40,50]},{"title":"Pleasantly Surprised","rating":9,"date":"24 February 2015","review":"I had never heard of this movie before a colleague recommended it and even then, had no intention of watching it. I was bored and watched it and MY OH MY was I pleasantly surprised by how much I enjoyed it! I thought it would be a cheesy movie but the story and actors were extremely believable. The addition of realistic award show backdrops added to the current condition of the music industry psyche. Soundtrack was lovely and I enjoyed hearing a current Amel Larrieux jam during such a touching scene. (Sidenote: Check out Ice Cream Every Day for more Amel gems!)<br><br>I HIGHLY recommend this movie to anyone interested in a combination of a love story and music. And if this helps, I wouldn't describe this as a chick flick at all - it has a universal appeal to anyone who stays current with the industry and knows how it can steal souls.","user":"wisdombody7","rank":[11,12]},{"title":"Not my genre but still thoroughly enjoyed it","rating":10,"date":"13 November 2014","review":"With the low IMDb rating, pop culture and romance, I was thoroughly expecting overused tropes, bad acting, and marginal writing. What I got was the complete opposite. I am not a fan of pop culture or romance movies but somehow these characters became very real for me.<br><br>In particular, I am impressed with the director's discipline. There are so many overused tropes that could easily have dominated the screen time. Instead, she hits her points and moves on.<br><br>The supporting cast was particularly impressive for their sheer believability. Hollywood too often takes the liberty \"it's only a movie\" or \"it's Hollywood, we can totally do whatever\". Instead, they stayed true.<br><br>This movie will go in my Blu-Ray collection when it finally comes out. The subtleties are impressive and worth revisiting. This is the second movie with a primarily romantic focus to achieve that honor. The first is True Romance.","user":"a_sad_cow","rank":[34,44]}]