[{"title":"Simply Not Funny","rating":3,"date":"31 July 2015","review":"Much has been said about the talented lead performers, and they have done decent work in previous endeavors. However, not much can be done with a weak script and with overextended dialogue that doesn't substitute for quality.\"Trainwreck\" deserves its title for it crashes early on and never recovers.<br><br>We are subjected to the required introduction to explain the protagonist's wishes to remain unattached. It's most likely the first misstep for now there's not much to discover in the development of the film. We know and see a disturbed and socially inept person who is unable to bond with a person of the opposite sex. What we also get is a very unattractive person because her language, attitude, and behavior are really not much to entice any guys beyond the overnight date.<br><br>Yes, we can look at it as statement for a woman's right to choose how to live her love life, but why make the character so unlikable and vulgar. We have our share of challenging and difficult girls on screen before, but there were compensating qualities, and the script gave us intelligent and funny lines. Apatow continues on his crusade to trivialize and gives himself an easy way to please the crowds and not demand much from performers and the audience. <br><br>Overall, it's an experience that will tempt you to walk out if you are in the mood to expect at least a decent film.","user":"aharmas","rank":[165,254]},{"title":"Bad","rating":4,"date":"26 October 2015","review":"This movie is like a lot of similar type of movies; meaning movies that aims to challenge preconceived notions of \"what a lady should and should't be like\". It quickly becomes banal, predictable and irritating. There's no depth of character here, because you sort of get the gist of the jokes before they're halfway delivered. Having said that; these kinds of movies can and have been saved by good performances. Unfortunately Amy Schumer doesn't deliver that. I don't know why scriptwriters and directors hit the same creative pitfalls every time a movie like this is to be made. We get it: here's an urban girl with a modern outlook on life who does what she wants, sleeps with whom she wants and doesn't apologize for it, etc etc.. good, but then what? A movie needs more than just a cliché of a character, predictable jokes and bad acting.","user":"mailstudiostar","rank":[158,246]},{"title":"Great Name for the Film!!","rating":3,"date":"2 November 2015","review":"And what a trainwreck it is! I have actually watched a few episodes of 'Inside Amy Schumer', laughing a few times and sitting there confused for most times. I understand how hard it is for a stand-up comic to not only star in, but write a comedy that lasts at least 90 minutes. However, with all my understandings I just didn't like this film. Small parts of it were kind of funny, but the rest of it was like a mashup of ideas that were trying hard to come together.<br><br>Hader was the only redeeming factor of the film. He acted with intent and knew the role he was playing. All the celebrity cameos (especially from some of the sports stars) seemed strained at the best of times. Amy herself is unrelatable. I don't understand why people are going crazy for her?? Is it because she is a female in a highly male dominated industry? I'm sure she truly is a funny person, but maybe test run these things a bit more before sending them out into the world.","user":"blairparkinson","rank":[110,170]}]