[{"title":"Suspenseful and engrossing, but as the mystery slowly unravels, the movie does as well.","rating":6,"date":"11 June 2016","review":"Honeymoon reminds me a lot of The One I Love which came out the same year. They're both about a couple who go on an isolated retreat and end up getting more than they bargained for. It's a good premise and one that promises potential, but it's entirely reliant on the execution of the mystery. Something is wrong with Bea, the wife of the recently married couple. The first night of their honeymoon, she wanders out in the middle of the night and Paul, the husband, goes out to find her naked in the woods with no memory of what happened prior. From then on she acts distant - hiding things from him, lying about trivial things - something just isn't right. And the way the movie is set up is very well done. For a good hour of the movie I was totally into it. I had no idea what the threat was and was eager to find out. Then you do find out what it is and it's quite horrifying, but you can tell the filmmakers didn't exactly know how to end the movie. <br><br>What carries Honeymoon is the acting. The two leads are excellent and have great chemistry throughout, so when the weird things start happening, you believe the husband's growing concern and the wife's pleads of innocence. And the pacing is spot on. Atmosphere is front and center from the start. The setting is a cabin in the woods, and as cliché as it may be for a horror story, it can be thoroughly effective with the right ambiance and Honeymoon delivers in that regard. The mystery itself is unraveled at a good pace as well, leaving breadcrumbs for the audience and throwing a few twists and turns along the way. <br><br>Now I'm giving the movie a lot of praise, and that's because I consider 6/10 an above-average score which is precisely what Honeymoon is - an above-average horror mystery. It's nothing revolutionary. The One I Love did a better job with this premise, but that doesn't mean Honeymoon isn't worth checking out. If you're in the mood for an engaging edge-of-your-seat thriller, you're looking in the right place.","user":"lnvicta","rank":[41,45]},{"title":"Well acted psychological horror, indie flick","rating":7,"date":"29 June 2014","review":"For their honeymoon, a newly-wed couple Paul and Bea travel to the bride's former home, a rural, sparsely populated community in Canada. A strange encounter with an old acquaintance follows a sleepwalking incident involving Bea and from hereon in it becomes clear that something is terribly wrong.<br><br>This indie flick has a very small cast that relies largely on the acting of its two central characters, a couple of Brits called Rose Leslie and Harry Treadway whose American accents are pretty flawless it has to be said. Both put in very strong performances in roles that require a fair bit of range. The characters evolve from so-happy-we'll-make-you-sick just married, through to relationship distrust and eventually onto outright psychological horror. The actors are good enough to convince in all these very differing levels of emotion. Because the story has so few characters, such a remote setting and such intense emotions, it's a film that is somewhat claustrophobic in its effect. It underplays the horror side of things and slowly builds thing up layer by layer. But we are never in any doubt that there is something very strange going on and there are small unusual clues punctuated along the way, such as strange sexual-looking marks on Bea's body, a recurring gooey substance found alongside her discarded night-dress and her strange distant behaviour. To reveal any more would be unfair, so I will leave it at that but suffice to say that this is a very good, mysterious genre piece well directed by Leigh Janiak.","user":"Red-Barracuda","rank":[84,119]},{"title":"A Conjugal Ordeal","rating":7,"date":"9 January 2015","review":"Honeymoon can immediately be assumed as a scary movie, easily because it involves some paranormal situation, but the heart of the story is studying how long would the main couple hold together no matter what. How the characters flesh out their relationship and the sudden trouble of their connection instantly triumphs the whole film, until it still attempts to do something more crazy in the end for the sake of the genre. It sadly doesn't live up to what it has set up and rather turn things underwhelming, but Honeymoon is still a pretty clever psychological thriller that is a lot interesting to watch than your average horror film.<br><br>This is basically an ultimate test of a seemingly perfect marriage. The beginning already shows that nothing can keep the two apart, and it's even more clear to how strong their connection is to each other. Once it moves to the mystery, their sweet romance fades, but still doesn't abandon its core. In spite of having a possible traumatic or paranormal involvement to the new behavior of Bea, it still centers to how their relationship goes. The real horror of the film is basically having the fear of losing the loved one and suspecting the worst things to come. It is done terrifically as a slow burn, but what reveals in the end, though can be acceptable, won't be the kind of answer that people would be blown away or terrified at. But the best of the movie is how it smartly defines this couple, even when things get stranger.<br><br>Horror films today rarely finds good performances, but this movie pleasantly has two great leads. Rose Leslie and Harry Treadaway convincingly shows the couple's affections. Leslie does an excellent job shifting the traits of her character, without taking the weirdness too far. While Treadaway naturally manifests his character's confusion towards the situation. The direction is slick, guided by a decent pacing. The camera-work captures a lot of beautiful shots. Though, horror movies tend to make things look ugly for the sake of being creepy, this movie does have one gross scene that you might not forget in a long time, but most of the experience looks pretty, as an illusion from the terror behind.<br><br>Honeymoon still has an underwhelming revelation that fails to be scary or anything beyond that, but the film is better when the horror is much grounded, creating an intriguing symbolism within the mystery. It never really matters where the threat comes from, the film just challenges this newlyweds and there it's already fascinating, by building a much serious conflict. This is the quality that can only be seen in indie horror. It leaves out the conventional tricks and tries to make tension out of its own. But even without trying to be scary, it still offers a good story.","user":"billygoat1071","rank":[34,46]}]