[{"title":"This house breaks little new ground but is nevertheless filled to the rafters with its own magic and charm.","rating":7,"date":"24 December 2013","review":"In too many ways, the Hollywood animation industry has ruined the market for everyone else. Disney and Pixar are leading a pack – DreamWorks, Fox, Sony – that have considerable resources at their disposal: they can easily afford to hire the best talents and bombard the entire world with adorable tie-in merchandise, even if the films they're producing aren't particularly good. It's a real shame, because it means that smaller, semi-independent efforts like The House Of Magic – an utterly charming French co-production – might too easily fall by the wayside.<br><br>Abandoned by his owners, a cat sneaks into a mysterious mansion that the neighbourhood pets are convinced is haunted. In short order, our feline protagonist gains a new name (Thunder) and a new master – the genial, elderly Lawrence, a magician who lives happily in a magical world with his toys and mechanical gizmos. However, Thunder also gains a few enemies: Jack Rabbit and Maggie Mouse have no intention of allowing him to become part of Lawrence's act, even as Lawrence's nefarious nephew Danny plots to sell the house away.<br><br>Plot-wise, there isn't anything particularly special about The House Of Magic. The story marches along in largely predictable fashion – the schemes cooked up by Thunder and his buddies aren't enormously innovative and the ending of the film is never in doubt. It's also the kind of movie in which moral complexities are easier to ignore than include, so don't expect many shades of grey in the characters of Thunder, Lawrence or Danny. Even Jack Rabbit, who proves a worthy, grouchy secondary antagonist to Thunder, is quickly forgotten in the film's action-packed ending.<br><br>But it's all woven together to charming, sweet effect in the film, which benefits enormously from its excellent character design. It's easy to forgive the straightforward narrative when it's hurried along so effectively by the bouncy, adorable Thunder and his desire to be part of a family again. Lawrence's toys are also wonderfully realised: Edison, the most expressive walking lightbulb you'll ever see, is a standout, but the other supporting characters are lovingly developed too. Much of the joy in the film comes from watching them come together to thwart Danny's efforts.<br><br>Taken all together, The House Of Magic has the feel of a well-worn bedtime story: it may occasionally feel like something you've seen a thousand times before, but it's also powered by a comfortable, familiar spark of magic – the kind that makes you feel right at home, wherever you might be.","user":"shawneofthedead","rank":[49,55]},{"title":"A classic animation film from start","rating":10,"date":"31 May 2014","review":"What a fun and charming movie to watch! Great for children and adults. Colorful, great characters, a flowing plot, and plenty of smiles and laughs.<br><br>The voice overs are done to perfection, the goofy gadgets are highly imagined and brought to life, and the evil real estate nephew and evil bunny top off the story.<br><br>Some may say the kitten, Thunder, is too cute but that's not so. He's young and full of himself and wants a home. Each of the perspective buyers the nephew brings by to see the house is original and funny. Then the two construction workers met their match inside the house - it's hilarious!<br><br>Fun and sweet for all ages .. you will enjoy!","user":"cekadah","rank":[31,39]},{"title":"Very good for kids!","rating":6,"date":"3 April 2016","review":"Every time that I sit down to watch an animated movie nowadays, I inevitably end up surprised by the visual quality of the animations, and this film was no exception. The visuals are stunning (I watched the motion picture in 2D, as i am no fan of 3D for the time being). You could see many of the effects are intended for 3D, but even as 2D they are uniformly excellent and very exciting to watch. The story itself is rather simplistic and intended mostly for children, as are the dialogs.<br><br>I watched it together with my wife and 8 year old daughter who found the movie to be excellent. My wife on the other hand thought it to be extremely boring. Myself, I am probably somewhere in-between the two extremes. I found this to be a very decent, professionally made animated movie mainly aimed at a younger audience, and in that it fulfills its purpose totally. Recommended.","user":"buiger","rank":[9,10]}]