[{"title":"Do not need a functioning brain to watch this","rating":1,"date":"28 February 2014","review":"I cannot believe that this movie scores over 2. I understand that this is a \"z\" grade sci-fi flick, but seriously, it assumes that the viewer has an IQ of an amoeba. This \"turkey\" has more errors than Windows 3.1. For starters,<br><br>1. Shark frozen in an ice berg being towed to a port in Egypt!!! 2. Botany Bay Australia does NOT have a fishing fleet. 3. A shark that can jump out of the water to chomp on a plane 30,000 feet in the air - REALLY??? 4. Same shark can redirect a torpedo fired from a submarine with its tail to sink a battle ship.<br><br>This movie was not released, it escaped. This is so bad I could not even laugh at it. If you want to lose 90 minutes of your life, then go for it - you have been warned.","user":"coivaln007","rank":[40,52]},{"title":"Just as flipping bad as it looks.","rating":1,"date":"2 April 2014","review":"Jack Turner and Rosie Gray are a couple who are proofing a submarine/AI system that is shaped like a shark. That is the Mecha Shark. The AI is 'Nemo,' a voice-only character.<br><br>The world is a tizzy about rampant megalodons; those would be the Mega Sharks. So, there is at least one Mega Shark that is headed to Australia, to an ancestral mating ground. Great.<br><br>In the midst of all this macro-disaster, there is a little girl looking to stay hidden from her mother. This is some joke that the screenwriter apparently thought was funny. Guess again. That somehow snags Rosie's efforts.<br><br>The Mecha Shark has an amphibious mode. Nero gets lost in cyberspace, and the shark becomes just as big a problem as Mega Shark.<br><br>Will Mecha Shark stop reaping destruction in Australia? Will the Mega Shark get put down? Will Elisabeth and Christopher get into some better movies and stay out of this sort of nonsense? <br><br>-----Scores-----<br><br>Cinematography: 5/10 There are some nice aerials and shots of US naval vessels. The CGI is hit or miss, mostly miss.<br><br>Sound: 2/10 Mostly not a factor, but the background music is truly poor.<br><br>Acting: 4/10 I liked Elisabeth Roehm in American Hustle and Law and Order. I liked Christopher Judge in Stargate SG1. Debbie Gibson was her usual bubbly self. Past those three, we had performances that are beneath amateurish. Even the veterans must have had a tough time not barfing at the bad dialog.<br><br>Screenplay: 2/10 Poor dialog. The script has about 15 minutes of story spread over 85 minutes.","user":"suite92","rank":[12,17]},{"title":"Mediocre","rating":3,"date":"18 February 2014","review":"'Mega Shark vs. Mecha Shark' is a monster/disaster film directed by Emile Edwin Smith and released straight to DVD in early 2014. The film is the third instalment of the 'Mega Shark Trilogy', successor to 'Mega Shark vs. Giant Octopus' and 'Mega Shark vs. Crocosaurus'. The film stars Christopher Judge and Elisabeth Röhm, with Debbie Gibson reprising her role as Emma MacNeil from the first film.<br><br>Following a similar plot to its predecessors, our protagonists are confronted by a bloodthirsty megalodon intent on causing havoc off the coast of Australia, and are left side-lined as their own creation designed to destroy the shark – a robot called Mecha Shark – begins an autonomous unforeseen attack following a communication failure. Following an encouraging opening, the film quickly delves into the series' formula of unoriginal and repetitive set pieces attempting to subdue the creatures, whilst an implausible romance blooms. The narrative of films like 'Mega Shark vs. Mecha Shark' demands the lowest of expectations from audiences, and whilst the film surpasses these nethermost expectations, it sadly offers little to even be classed in the 'so bad it's good' category.<br><br>Performances across the board are satisfactory, but there is a gargantuan non-existence of wit and tongue-in-cheek moments which begs the question why a film entitled 'Mega Shark vs. Mecha Shark' is taking itself so earnestly. Undeniably the film offers brief moments of gratification – a shark destroying the head of an Egyptian sphinx can only be a good thing. On majority though the film feels stale and, considering the film's title, it would have been beneficial to give much more screen time to the clash between the Mega Shark and the Mecha Shark. <br><br>'Mega Shark vs. Mecha Shark' is a formulaic and uninspired film which begs for, believe it not, more destruction and mayhem. Not totally without merit, the film isn't the lowest of the low of its genre, but is certainly does not amaze or thrill.","user":"JoshuaHarryMurphy","rank":[17,26]}]