[{"title":"gritty, bizarre neo-noir","rating":6,"date":"24 October 2017","review":"Producer-director Brian DeCubellis had done some TV movies and short films before this bigger directorial effort, the neo-noir Manhattan Nights, from 2016. He certainly has talent.<br><br>The film stars Adrien Brody as Porter Wren, a columnist for a New York newspaper. His wife (Jennifer Beals) is a surgeon, so they are able to have a darling house that is hidden down an alley in Manhattan - something like Patchin Place in the west village. <br><br>When his newspaper is taken over by a Rupert Murdock type (Steven Berkoff), Porter reluctantly attends a party for him. There he meets the beautiful Caroline (Yvonne Strahovski) whose husband, well-known director Simon Crowley (Campbell Scott) was found dead, buried under the rubble of an imploded building, surrounded by pieces of jade. The two wind up having an affair.<br><br>It seems Simon was a complete weirdo with an interesting hobby of recording \"honest moments\" on video cards. Caroline takes Porter to a safety deposit box with dozens of them. She invites him to watch them. But it turns out one of those honest moments is being used to blackmail someone, and the person being blackmailed wants it and begins to terrorize Porter to find it. This leads to Porter uncovering secrets about Simon, Caroline, and person being blackmailed, and learning something about himself.<br><br>The film is based on an novel called Manhattan Nocturne. I suppose the name was changed because the filmmakers thought not enough people would know what a nocturne is. That's sad. The story is good but unsavory, and, frankly, so are the characters. And it has the usual female nudity.<br><br>The acting is very good, particularly from Brody and Strahovski - she is gorgeous and reminds me of Sharon Stone when she was younger. Brody has had a so-so career since winning the Oscar. This was a good role for him. Linda Lavin has a cameo, and she's excellent.<br><br>Overall I can't say I was crazy about \"Manhattan Night.\" It was well done but unpleasant.","user":"blanche-2","rank":[12,13]},{"title":"Loved it! Way better than what the reviews are saying.","rating":10,"date":"31 May 2016","review":"Watched this on demand tonight. Wasn't expecting much based on the reviews. I thought it was excellent once you get past the first 15 minutes or so, which feel a bit contrived. The movie is very intense and keeps the viewer involved and wanting to see where it's going. I would categorize the movie as mystery/suspense. The acting was excellent. Adrian Brody just has a certain something special in every movie he is in. The female lead is drop dead gorgeous. The guy who played the lead's deceased husband gave a quite fascinating, if sick, performance. I did correctly predict the ending in my head about halfway through, but still enjoyed it very much. I literally got chills at the end.","user":"gxme","rank":[47,67]},{"title":"Dark & Erotic Noir Falls Short","rating":5,"date":"30 August 2016","review":"This very dark and erotic noir just contained too many incredulous and far-fetched plot elements for my liking. There seemed to be a better movie lurking within this one that never really came together and emerged.<br><br>Adrien Brody is fine as Porter Wren, the poker-faced investigative reporter and columnist for a daily New York City newspaper. When he's unable to resist the seductive advances of the gorgeous Caroline Crowley, portrayed by Yvonne Strahovski, Porter will find himself being led down a path of dark and demented secrets that will cost him dearly.<br><br>All in all, this movie, written and directed by Brian DeCubellis, based on a novel by Colin Harrison, had enough intrigue to keep me interested for the most part, but it seemed to fall apart as it progressed, with the filmmaker choosing shock value over plot elements that might have enhanced the story.","user":"larrys3","rank":[20,26]}]