[{"title":"Two types man or time. This is about the time","rating":8,"date":"14 June 2019","review":"I thought this was very good. The only criticism is that it should be under crime drama and not crime thriller. The crime starts the movie and then we see how time, guilt and life is changed for all of them due to that one event. Definitely one of the better flicks I have seen in the past few months.","user":"shaneandamy-19629","rank":[16,20]},{"title":"Don't understand why so many bad reviews","rating":8,"date":"31 May 2019","review":"I've started this movie with almost no expectation based on critics and viewers reviews. It was supposed to be badly acted, too slow, unfinished... but, I found none of the above. The movie has two major events, one in the beginning, one at the end, the rest can seem indeed slow and boring, but I think that was exactly the point, whatever happens in the arc between the beginning and the end it's just life, little moments, which I found were very well put together to imply that life goes on and it does not have to be extraordinary every day. It was what made the movie very realistic. As for the ending, without giving too many spoilers, I will just say that I think it was quite clear, even if the authors did not spell it out for us, the message was there, one look to freeze him on the spot for the time being and one left wide open door for him to come in eventually say quite enough. The entire movie was less about words and more about acting and I think the actors did a great job acting it.","user":"adelao-02096","rank":[16,21]},{"title":"Compelling!","rating":10,"date":"21 May 2019","review":"This movie has very fascinating dramatic story lines, amazing acting, especially from Alycia Debnam-Carey who was beautiful in this, and visually stunning. Most people don't know how hard it is to pull this off with only the limited resources and time this indie movie had and even for a big budget film it was truly very enjoyable! Definitely worth the watch!","user":"bripilar-41153","rank":[19,30]}]