[{"title":"An excellent movie, but perhaps a bit misunderstood.","rating":8,"date":"18 October 2014","review":"I read the book when it came out, and absolutely loved it. I won't go too in depth into the differences between the book and the movie. Some characters were cut, some stories were shortened and rearranged, and the ending is somewhat less dark. However, I would say that all of these changes are understandable when making a two hour movie. The soul of the book is still there though. If you liked the book, you will like the movie. The directing and acting are great, and I have zero complaints in this department.<br><br>I do have a few complaints, starting with some parts of the plot seem like they would be hard to follow if you haven't read the book. There were segments of the story that would have benefited from a little more time spent on them for clarity. I am a fan of long movies, and understand that a lot of people are not, but I think an extra 15 minutes could have made a big difference.<br><br>The narration seems to be a sore subject among the other reviews I've read, and I have to say I have mixed feelings. I like the idea of narration in a book-turned-movie. There's a certain amount of context and motive behind characters' actions that can get glossed over in a movie if there's no narration, but it was too inconsistent in this case. It either needed more narration, or it needed to be limited to just the intro and outro.<br><br>I think the major issue with the movie is that people are focusing on the wrong parts of it. Everyone wants to talk about the blunt sexual content, and the excessive use of technology in the movie. To me, those are the things that make it a realistic story. Perhaps that's just because I'm in my twenties, and blunt sexual content and excessive technology use are a large percentage of my life. People call this a movie about how technology is ruining and/or changing relationships. I disagree. This movie is about growing up, relationships, and miscommunication. Affairs aren't new. Questionable parenting isn't new. Body image issues aren't new. Sexual frustration isn't new. Depression isn't new. The movie shows technology not as a cause or effect of any of these things, but as being intertwined with them the exact way technology is intertwined with modern life. People are looking to MWC as a comment on technology in modern life, and finding it wishy- washy. But that's because it's not taking any sides, it's just showing how things are.<br><br>If you go in to this movie expecting an interesting story, rather than an editorial about technology, you'll probably enjoy it. Just don't bring your kids or your parents.","user":"tophatfab","rank":[78,95]},{"title":"An Excellent Jason Reitman Film","rating":10,"date":"6 September 2014","review":"I recently got to see Men, Women, and Children, the newest feature from Jason Reitman (Juno, Up in the Air) and co-writing partner Erin Cressida Wilson (Chloe) based on the novel of the same name by Chad Kultgen.<br><br>The film is an ensemble drama, about the effect the internet and technology has had on relationships, intimate or otherwise. They're no groundbreaking original story lines. There is a Romeo (Ansel Elgort) and his Juliet (Kaitlyn Dever). A marriage is on the rocks (Adam Sandler and Rosemarie Dewitt). An overbearing mother trying to control her daughter (Jennifer Garner). An unwitting parent trying to live through her child (Judy Greer and Olivia Crocicchia). A newly single parent trying to connect with his video game addicted son (Dean Norris and Ansel Elgort). An impressionable teenage girl dealing with severe body image issues.<br><br>All of the actors did a proficient job. Adam Sandler was excellent, in his first straight drama role since Reign Over Me (or Funny People, if you'd count that). Ansel Elgort and Kaitlyn Dever had both breakout performances. Each of their characters plights will your break your heart, and leave you rooting for them. And most of all, Jennifer Garner was as good as I've seen her in years. She did such an incredible job to make me hate her character as much as I did.<br><br>It's a linear story from a big studio with an independent feel. Emotional fireworks are few in this movie. Some of the quieter moments feel the loudest.<br><br>This story is timeless. Nobody understands technology in this world. Not the teenagers who superficially know how to use it, and not the parents who are mostly right to be afraid of it. No one understands it. Every character in this story believes the internet can solve their problems. They are searching for a way to mask their wounds. It's ironic that the internet provides anonymity, but those who search for it most crave human connection.","user":"Joshsports60","rank":[96,131]},{"title":"A sobering and uncomfortably accurate portrait of the digital age.","rating":8,"date":"9 October 2014","review":"Jason Reitman's Men, Women and Children takes aim at communication in the digital age, offering a sobering and uncomfortably accurate portrait of the way we connect - or rather, fail to connect - with each other when there's a wealth of technology at our fingertips. Take Don (Adam Sandler) for example: a quiet schlub whose sexless marriage to Helen (Rosemarie DeWitt) finds him sneaking into his son's room to feed his internet porn addiction, while his wife struggles with the temptation of using a cheating website to start an extramarital affair. This is the kind of issue that an open dialogue and honest communication could likely overcome - but that would require both of them to put down their iPads or look away from the television.<br><br>There's also Hannah (Olivia Crocicchia), a fame-obsessed cheerleader who force-feeds her sexuality to everyone around her in hopes of blazing a path to stardom, Kardashian style. It doesn't help that she's enabled by her mom, Donna (Judy Greer), a failed actress who constantly snaps photos of her daughter for a \"modeling\" website that happens to include a private section reserved for paying members. Hannah has a thing for Chris (Travis Tope), Don's football player son whose own internet porn habits would not only put his dad's to shame, but have also left him unable to become aroused by anything but the images on his monitor.<br><br>Most tragic and heartbreaking of all is Allison (Elena Kampouris), so desperate to catch the eye of her crush that she developed an eating disorder after overhearing him make a disparaging comment about her weight. Now pale and waifish, she maintains her figure by seeking \"support\" from an online forum dedicated to staying thin at any cost, offering such helpful hunger-battling hints as \"drink water and wait five minutes.\" Their slogan? \"Pretty bitches never eat.\" <br><br>At the opposite end of the spectrum is Patricia (Jennifer Garner), a suburban parent who redefines the term \"overprotecrive\" as she demands that daughter Brandy (Kaitlyn Dever) surrender her cell phone on a regular basis so that she can read her emails and text messages, in addition to poring over pages of chat logs and using a GPS locator app to monitor her daughter's movements whenever she leaves the house. Patricia is convinced that she's keeping Brandy safely out of harm's way, yet remains oblivious to the fact that she's stifling any chance of her having a normal teenage existence.<br><br>And then there's Tim (Ansel Elgort), a star running back who elected to quit the football team in favor of investing his time in online role-playing games. Tim's interpretation of Carl Sagan's Pale Blue Dot (a recurring theme throughout the film) is that nothing matters in the grand scheme of things, so why bother investing in a \"pointless\" activity like football? He's much more content to form connections with other like-minded individuals in a virtual world, while growing increasingly distant from his father (Dean Norris), who continues to cope with the sudden departure of Tim's mother the previous year.<br><br>If that sounds like a lot to keep track of, you're correct. As the film progresses, each character is faced with their own individual conflicts, while simultaneously crossing paths with other characters and creating new conflicts along the way. It's not only gut- wrenching to see how commonplace cruelty has become in today's digital world, but terrifying to see how broadly we can all be affected by it. Seemingly innocuous decisions turn out to have major, far-reaching consequences, with actions affecting other characters in surprising ways. It's unapologetically reminiscent of Crash, which admittedly pulled off the same trick in a much more organic fashion that was far more believable.<br><br>But that's not to say that Men, Women and Children doesn't feel authentic. Having been acquainted with people that have struggled with eating disorders, depression, or poor self esteem, every performance in the film is pitch perfect, and it's almost frightening how expertly Reitman nails some of these issues. If you're looking for a film that will send you home with a smile on your face, this one isn't it. But if you want a thoughtful, genuine depiction of the how far our communication skills and regard for our fellow humans have fallen, look no further.","user":"BrentHankins","rank":[60,84]}]