[{"title":"Truth about the way kids are treated by a Sadist world","rating":10,"date":"17 July 2017","review":"Thanks Brummund for such an excellent work. There should be more such courageous people who can tell the truth at the face of a super-hypocrite society in which we live. We live in a society which has no shortage of Sadists and very unfortunately children are the softest sufferer. I spent a year and half in a Missionary School in West Bengal, Kolkata. I was luckier than Wolfgang because my mother protected me, she did listen to me when I came home for summer vacations and complained that I will die if I go back to the mission. The film is actually so realistic, unlike what many reviewers here feel. I know that because I had been in a similar institution, though thousands of kilometres away. I remember how cruel had been many people in my locality after I returned from the coveted missionary school. There were many who asked why I returned, some suggested that I was kicked out. So I can understand why Wolfgang hit the neighbour he met on the street after he left him home without meeting his mother. Rest assured that such terrible places are still there in almost every country and will be there as long as we don't properly learn to treat others of our own species respectfully.","user":"idaaning","rank":[22,25]},{"title":"Primal brutality","rating":9,"date":"10 July 2017","review":"This is the first movie review I am writing in my life. I am writing it because none of the reviews I read (after watching the film) seem to grasp the primal emotions the movie conveyed for me. I feel so weird about this. I actually have the impression some of the reviewers are not able to feel the abyssal anti-pedagogic methods in all their bleakness and brutality. Could it be that they simply are not able to open themselves for this sort of raw, unprocessed emotion?<br><br>This movie caught me completely unprepared, and may be that's why it left such an impact on me. I just switched on the TV and the movie popped up, showing the scene where Wolfgang, the protagonist, is standing around naked with his clothing in his hands. Now I am expecting to hear the screams of Wolfgang in my head for days.<br><br>Most people seem to criticize two things: 1.) The predictable story-line. 2.) The exaggerated portrayal of the life at Freistatt.<br><br>As to 1.) Yes. It is predictable at times. I only needed few seconds to recognize the direction the movie was gonna lead to. However, when Wolfgang was buried alive, I was shocked. I didn't think he'd survive (spoiler: he did so because it was a planned action, he got un-buried before he suffocated). I also liked the ending. It was not a happy ending, it was not a cruel ending, it was a right ending. What Wolfgang experienced was too cruel to not traumatize him. At the end he was free, but I could tell that he would never be able to lead a normal life.<br><br>As to 2.) I don't know how much the movie sticks to the actual events, or whether or not it does them justice. (I am also wondering: How much do the other reviewers know about this? Have they been there? If not, which knowledge enables them to make a judgment like that?) I don't have the feeling that this is what the movie is about anyway. Not at a single point the movie felt like a historic documentation to me, but like a story about a boy with an instinct for freedom, fighting against an oppressive system. At points, it almost felt like a miniature 1984 to me, especially regarding the circumstance that Wolfgang's drive for freedom was finally broken - after his mother let him down and he got buried alive. Nevertheless he made the right decision and didn't return to his mother at the end.<br><br>This is not a movie to analyze and think about much. It's a movie to feel and connect with your instincts. Reviewers who filter it by looking at it through their abstract glasses are missing its essence. And I feel inclined to suspect they don't have a healthy connection to their primal instincts themselves. I know one should avoid becoming personal, but I just can't say otherwise.<br><br>Much respect to Louis Hofmann, who did a splendid job as Wolfgang.","user":"dertypmitdembein","rank":[12,14]},{"title":"Powerful movie... So realistic... But many people are so naive....","rating":8,"date":"23 August 2017","review":"I'm write for the first time, because this movie took me to the guts, is so powerful to show how the Human race are bad...<br><br>I'm live in Switzerland, and in the 70'S same thing happens in my countries... So many young are suffer of child abuse, free violence and death, it is reality, not just a movie... <br><br>The Switzerland state has apologized for what it is to pass in the 70s only in 2015, and yet enormously young people who have passed through these camps are still today marked in blood...<br><br>I'm shocked to read the comment of Thomas in this tread, so naive and non-constructive, I thought this poor guy have never see the reality of the world we live... For a German guy it is a crook... <br><br>I have finally to say, Hitler has better treat his Hitlerian youth than the German government did after the war, it is sad...<br><br>Do not listen to the negative comments or say that it is exaggerating, they have not understood anything in life... <br><br>look without hesitation this Powerful movie but hard and realistic on a part of the German history which they should not be proud of...","user":"thierrybarras","rank":[11,14]}]