[{"title":"Storywise better than Passengers (2016)","rating":7,"date":"9 April 2017","review":"Without a forum, I cannot reply to review such as below...which is a bit harsh. The movie is a mishmash of 2001, Event Horizon, Lost in Space. Its a better movie story-wise than passengers (2016) with the Hollywood sweethearts JLaw and Pratt. Doesn't have the Hollywood budget unfortunately.<br><br>The mystery was gripping and kept the attention BUT the resolution was a bit weak.<br><br>The Genetic Transformed (GT?) Super Humans of the future are sent to fix the mistakes of a previous human mission to the distance planet. They find a lone Human survivor and artificial person. <br><br>Then everyone, it seems, malfunctions, and ethical dilemmas and decisions have to be made....<br><br>Interesting use of literature from Tolstoy to Sun Tzu....<br><br>\"This seems to have started out as a thought-provoking script and devolved into a thoughtless movie, mainly due to the ridiculous costumes that looked like they were created by Project Runway rejects - the poorly sewn dart seams on the voluptuous actresses' costumes were distracting, and the shoulder pads were ill-fitted on the hunky guys' costumes, and let's not forget those high heel booties so necessary on space missions. This looked as if someone decided the acting was going to be so bad that they may as well make a porn, and then forgot the porn.\"","user":"ChazzJazz","rank":[40,58]},{"title":"Not What I expected = That's Good","rating":8,"date":"11 September 2017","review":"I'm going to review this because I so object to the low, around 3 stars, rating it seems to have gotten. It's a science fiction film, but it's not about killer robots, particularly; it's not about planets or star ships blowing up; it's not about aliens invading the earth. It's a quiet, sort of slow film, that seems to be about one thing and then turns out to be about something else. It's low budget but I don't think that is damaging in the least. The acting isn't bad - it's part of the story. In fact, I will watch for the actors in other work just to see how they do. The story, as I said, seems to be one thing, but then starts to twist and turn to an ending that is quite moving.<br><br>All in all, I'm glad to have stumbled across this.","user":"zboston3","rank":[18,24]},{"title":"It's a movie with a message.","rating":6,"date":"17 April 2017","review":"In many ways this movie reminded me about the original Star Trek series. The costumes, the props, the effects, the clichés, the play, and even the way it tries to explore social norms and problems.<br><br>It's definitely a low budget film, so don't expect amazing visuals. It's not an action movie that would hold you on the edge of your seat, either. It's a drama and if you could overlook 1 hour of SciFi clichés, you might come to enjoy it. I certainly did.<br><br>Be warned, the plot does involve 3 different themes, one of which comes out as surprise twist out of nowhere, yet it strangely rhymes with the events on the station. It's not hard to imagine that both are result of the same logic, even though they are completely separate events. In retrospect this twist is probably the reason why I liked this movie and why I would recommend you to watch it.","user":"iive","rank":[22,31]}]