[{"title":"a lot better than you think","rating":6,"date":"29 October 2015","review":"I am very surprised this film has some bad reviews as i really enjoyed this film, Yes its a old fashion cat and mouse chase type of film but its well done. Olga kurylenko plays the lead role and shows just how good she is, the ex hit-man (2007) and bond girl (quantum of solace) is a thief with a certain set of skills that will do whatever it takes to get the job done while james purefoy (a knights take) is the man sent to stop her. Plot is basic and easily followed but the action and constant clash between olga and james makes this film worth watching, with a small role in the film for morgan freeman \"momentum\" is one of the better small production films of 2015 and well worth a watch from the opening scene that looks like a bunch of power rangers on speed to the final 20 minutes of the film momentum delivers.","user":"wycherleyp-960-470658","rank":[57,74]},{"title":"It's Okay","rating":5,"date":"16 October 2015","review":"It's not the greatest of the female-themed action adventures, but it's certainly watchable. I saw it because I'm a fan of James Purefoy and Olga Kurylenko. They were good in their roles, but each time Purefoy said one of his \"Damn! She's good!\" lines, it was silly. It wasn't that she was such a professional, it's more that the bad guys came across as rather inept. Some of it was tongue-in-cheek, such as when Purefoy's coat caught fire, he slowly took it off, saying \"I liked that coat.\" There wasn't a great deal of urgency projected from the bad guys showing they needed to get back that drive quickly. Morgan Freeman's character was fairly a mute point in the movie. They could've stuck any actor -- famous or not -- in that role, that's how superfluous his character was. All in all, it was entertaining. Having seen him play Blackbeard and Joe Carroll, I have to say James Purefoy does the bad guy roles very good.<br><br>I gave this a 5-star rating. I'd recommend this if you liked Colombiana and Salt. It's not as good as either of those movies, but it's along the same lines, and Kurylenko is good in the few action scenes she's in.","user":"chrismackey1972","rank":[52,71]},{"title":"Nice low budget action flick","rating":5,"date":"5 November 2015","review":"SPOILER: My quick rating 5,3/10. A pretty straight forward action movie with a really kewl looking robbery to start off with. When the main character (Olga Kurylenko) is accidentally seen on a supposed diamond heist, she must run from those that hired them to steal the diamonds, or was it for the diamonds at all? This leads to a cat and mouse game between them and does involve some interesting action sequences along with a solid female lead to be reckoned with. Not really anything new but enough flare to hold your attention, especially for a limited budget flick. I wouldn't mind seeing a sequel to this (the ending sorta leaves the door open) since this movie did well with what it had to work with.","user":"jackmeat","rank":[24,31]}]