[{"title":"A more mature brother to its predecessor which feels like the 'middle' film of a trilogy","rating":6,"date":"11 December 2015","review":"7 years ago a biographical British Gangster film set in the Essex crime world was a successful hit and one what divided critics. It was also a film that highlighted more than ever the dividing line of snobbery that exists in the British film community. To explain what I mean by that, there are the big commissioners in the industry with great connections to the Baftas and other awards and anything that falls outside of that sphere is often looked down upon, much the same way as the stars of Soap Operas are somehow regarded by the same establishment (wrongly) as less serious actors than their contemporaries. I mention all this because its important to put into context how this film will be viewed by many. ROTF 1 was in many ways not an easy film to like. It was a story about unsympathetic characters, small time crooks and their way of life. (A very similar premise to Goodfellas) It was dismissed by many (wrongly in my opinion) as trashy violence, but I actually thought it should be regarded as one of the best British films of that genre about that era. It was essentially a biopic of ICF member, Carlton Leach, and later a key figure in the Essex underworld, and friend to the murdered Tony Tucker of 1996 Ranger Rover murders.<br><br>This sequel examines the aftermath that Leach had to deal with his slow climb back to a reality where he finds some sense of normality. Carlton (Played again by Ricci Harnett who also writes and directs) starts the film in a downward spiral. He works all the time and when he isn't sniffing coke and stealing from dealers, he's cheating on his wife with a bit of skirt in an alley round the back, his behaviour is alienating his friends, his work colleagues and not least of all his family, especially his wife, Denny (Coralie Rose, superb) who soon moves out taking the younger kids with her. Carlton is soon forced to re- evaluate his attitude and his life but while pushing coke off the table comes with relative ease when the stakes are so high, leaving behind the life of crime comes with more difficulty and is harder to extricate himself from. An unexpected reunion from the past soon forces him to make changes in his life for the better of those around him. <br><br>Those expecting a balls to the wall gangster caper may well be disappointed as Hartnett opts for a far more realistic depiction of the downside of the less glamorous side of the life of crime. This is a film about a damaged man and his slow steps back to recovery and while yes the gangster life is still there, the story here is smaller, because this part of Carlton's life is set on a smaller stage, entirely his own. While the shady deals and debt collections are still very much the backdrop for the journey the story this time is less about the crime and more about the fallout damage of that life style. For some this might make for less compelling viewing but I personally think it was a very brave decision by the film maker. This film might be uncomfortable for those who have experienced drug addiction, anger issues and broken marriages to watch but for many it may well come hand in hand with being in this line of work. Hartnett wisely assembled a team of very competent actors in his supporting cast to fill out the other roles - Luke Mably is in a class of his own as best friend Shawn, the loyal torture specialist whose speech about his love playing a record will make you squirm in your seat. I felt like we needed to see more on his back story though one can just accept him as a member of Carlton's firm easily enough. He is supported by Johnny Palmiero as Mad Jack who gets all the best lines and brings much needed humour to the piece, because if you have even dipped your toe into that world you will know that many of the real characters are faster than anyone with their comedy come backs. Joshua Osei and Scott Peden do well with very under written roles to make their mark and the likes of solid actors Nabil Elouahabi and Jasper Britton add strong credibility to their characters.<br><br>Despite a tight budget and being aware that Harnett had a very difficult journey getting the film finished the film doesn't feel rushed or cheap. The shots of sex are done with some degree of taste while the violence is cleverly more implied (with much greater effect I might add) than it is shown. Well shot by Alfie Biddle, it is a well produced compliment piece to its predecessor and a very different kind of animal and even though the setting does change from Essex to Tenerife it doesn't feel quite as epic but clearly that was not what Hartnett was going for. This is sadly a world where female characters take second place, with the significant dialogue going to Coralie Rose as Carlton's wife. (Rose is a massively under rated actress and should be seen on our screens a great deal more) However, as a film which continues to tell the story of Carlton Leach, it does exactly what it says on the tin - I only have a casual interest in films of this genre and there have been some truly dire films over the last few years which have tried to capitalise on the continued telling of stories connected to the Range Rover killings. This film does not feel like one of those at all and while its general appeal maybe fairly narrow its a competent well made piece of work with some stand out performances which will certainly need a third segment to bring it to its final conclusion.","user":"azanti0029","rank":[17,26]},{"title":"Rise of the foot-soldier two review","rating":10,"date":"13 December 2015","review":"I was at the premiere of this film from the beginning of the night to the end of the night it was a brilliant event I thoroughly enjoyed the film and I thought considering it was one of the actors directorial debut i thought he turned out a brilliant effort both directing and acting and I thought all of the actors were brilliant and if you want to see a all round film this is for you it had everything the story was really well told and had a load of depth to it and to top it off the question and answers session after was the icing on the cake i can't wait for this to come out on DVD and all the people that didn't get to see it at the cinema you should definitely get the DVD/Blu Ray as it is well worth the money you won't regret it","user":"everitt-47106","rank":[10,23]},{"title":"Not a patch on the first","rating":3,"date":"6 January 2019","review":"Not a patch on the original William/Julian Gilbey Rise of the Footsoldier.\nThis concentrates on the aftermath of the Rettendon Range Rover murders. I am not sure even Director Ricci Harnett, who once again plays Carlton Leach, knows what to do in the movie. The script is like it was made up as he went along.\nNo wonder you can buy the Blu-Ray for a couple of quid at major online retailers. This straight to DVD job went straight in the bin after viewing.","user":"stephenbishop-22925","rank":[1,1]}]