[{"title":"A beautiful and poignant movie","rating":8,"date":"28 June 2018","review":"The three main stars put in stellar performances, Emily Mortimer in particular shows her true acting colours in this aged tale about class and corruption. \nI love the story, the direction, the acting, and the way it shows at the end that despite all the corruption and badness in humans, one can touch another one in their life for a short period of time, and have a lasting positive impact on them for the rest of their lives. \nBeautifully done and my only regret is that I can't see it again for the first time.","user":"Boristhemoggy","rank":[89,103]},{"title":"Negative reviewers are philistines","rating":10,"date":"27 May 2018","review":"I've never written a review before but am saddened and taken aback by the vitriol of certain reviewers of this masterful and subtle film. The production, the cast, and the story are all captivating and moving. I needn't go into a synopsis of the story as others have more or less done so. I will say that it is a big \"little\" film that tells of small town politics and human dynamics with great compassion and sensitivity. It also tells an honest story of what all too often happens to an outsider. Book lovers will especially appreciate it.","user":"artworks-5","rank":[191,233]},{"title":"a slow-moving village drama full of old-world Britishness","rating":8,"date":"5 June 2018","review":"Echoes of Dylan Thomas' Under Milkwood whisper throughout the deliciously slow film The Bookshop (2017), a village drama that captures the essence of old-world Britishness. If narrative action is important to you there is little to see here, but if you enjoy character portraits you will love this inconsequential tale told beautifully.<br><br>Set in a sleepy 1959 seaside port, young widow Florence Green (Emily Mortimer) arrives determined to overcome her grief and open a small bookshop. The town has never had a bookshop and most of the villagers don't like books anyway, except for the reclusive Mr Brundish (Bill Nighy) who reads everything he can. After pushing through a wall of petty officials the shop opens in a run-down cottage despite fierce opposition from the imperious Mrs Gamart (Patricia Clarkson). She wants the cottage reclaimed as an arts centre, so battle-lines are drawn between small-mindedness and the winds of change.<br><br>At times the story slows down so much that it almost stops, just to watch tall grass swaying in the wind or to hear leaves sighing on trees. The camera lingers in the space between words or glances, or it traverses shelves full of books with titles hinting that change is coming. Even the film's highlight romantic scene is little more than agonisingly tender moments that evaporate into the ether. Fortunately, the cinematography is up to the challenge of capturing mood and nuance as it dwells on Bradbury's dystopian Fahrenheit 451 (1953)and Nabokov's controversial Lolita (1955)to telegraph the post-war social transformation that is underway elsewhere.<br><br>Instead of pushing the narrative forward, the film prefers to dwell on archetypal caricatures of small people in small places. A smug gadabout, a banker nicknamed Mr Potato Head, a smelly fishmonger, a precocious teenager, a dithering lawyer, the snobbish and manipulative Mrs Gamart, and of course, the incurable romantic Mr Brundish. While these are portrayed with a light brush, it is Florence who holds our attention for the depth of her vanguard feminist courage and self-belief. The entire cast is well chosen, but Emily Mortimer is the film's undoubted shining star.<br><br>It might be argued that Bill Nighy is such an icon of British movies that he overpowers any given role simply by being a composite of every other persona he has ever played. In other words: he is always Bill Nighy. But that is a minor distraction in an otherwise flawlessly directed, slow-burning village drama of how books and ideas can change the world we live in. It is not recommended, however, for anyone who does not have the time or need to stop and smell flowers or watch boats sail by.","user":"CineMuseFilms","rank":[70,84]}]