[{"title":"You might as well be blind.","rating":1,"date":"22 January 2018","review":"First off do not get this confused for the Topher Grace, Patricia Clarkson, Emma Roberts movie. IMDB is using the same poster art for that as this pile of garbage. \nNOW about this..No explanation by the ending. All the characters are your typical douchey-frat boiz with names only pretentious parents give their entitled kids. The story did not really make sense. I could not figure out the motive. How is a house this old so freaking clean? Everything in the place is pristine, like the cleaning service just left. The #1 worst thing about this movie is the entire thing is lit with flashlights or video camera lights. In the woods, in the middle of the night. I don't think I could tell you who was who it was just a bunch of names being yelled out. People would disappear for a while but you would never know because you couldn't tell who anyone really was. Save your eyesight and go look straight at the sun.","user":"Markyajv","rank":[16,20]},{"title":"Truly Terrible","rating":1,"date":"27 January 2018","review":"There is nothing to like about this movie. Bad actors running around a house shouting. That's all this is. How it scored 3.4 I have no idea.","user":"maddy-982-627019","rank":[11,13]},{"title":"Delirium (2018)","rating":4,"date":"15 March 2018","review":"An extremely average horror movie which is full of all the typical cliches and tropes. The acting is servicable, some is bad. There's a confusion about it being slightly \"found footage\", the footage from the in-movie camera and the movie itself is the same, it's especially confusing then the film in a \"standard\" mode with shaky hands up close, like it's a \"found footage\" one (the scene with the pool). <br><br>The main characters are a gang of your typical muscline American college alpha males, there's no absolutely nothing even remotely interesting about them. The ghosts always use the same teleportation teleportation technique in order to \"BOO\" the viewer. Sigh.","user":"SashaDarko","rank":[7,8]}]