[{"title":"Coal mining disaster survivor struggles to find his way.","rating":8,"date":"12 July 2014","review":"I wasn't planning to attend Little Accidents when it screened at the Seattle International Film Festival. With 450 films from which to choose, a film about a coal mining disaster sounded depressing. However, when I was sent a free pass from SIFF, I went anyway. <br><br>Not only was I was pleasantly surprised by Sara Colangelo's debut feature film, I was moved by it. Little Accidents is the type of film that stays with you long after the lights come up. <br><br>Although it is a coal mine disaster that sets the events of the film in motion, the action begins months after the accident, as Amos Jenkins (Boyd Holbrook) returns to his life in the small West Virginia town after convalescing from injuries that he sustained in the accident. He is the sole survivor.<br><br>Life is anything but normal as Amos finds himself torn between telling the truth about the cause of the accident, and keeping his mouth shut, which will dishonor his ten friends who died. If he testifies that management's cost-cutting decisions led to the disaster, the mine will be closed and his friends and family will be left without any way to feed their families. <br><br>Just as the town is beginning to deal with the loss of the miners, the son of one of the mine's managers (Josh Lucas) goes missing. Is it retaliation or a freak accident? Young Owen, played by Jacob Loftland (Mud), who is the son of a killed miner, has the answer, but he deals with his own struggle to reveal the truth. <br><br>The character-driven film follows the seemingly parallel story lines of Amos, Owen and Diane Doyle (Elizabeth Banks), the mother of the missing boy, but eventually the parallel lives begin to intertwine as they find themselves connected by fate. <br><br>The performances by everyone in this film, especially Holbrook and Loftland, are superb. A touching scene between Amos and Diane outside a convenience store nearly left me in tears. <br><br>Although I felt the relationship between Amos and Dianne could have been developed further, I was fully satisfied by the completion of the plot lines and left feeling blown away by the entire experience, which was enhanced by the attendance of the director, Colangelo.<br><br>Colangelo directed a 2010 short by the same name, which deals with issues of the working class. She wanted to set the expanded feature film in a mining community, after being moved by so many recent coal-mining accidents that she was unable to get off her mind. <br><br>One interesting piece of information that Colangelo provided was that the movie was shot in 24 days and entirely in film, in order to capture the grittiness of the subject matter. Kodak donated half of the film.<br><br>Little Accidents isn't so much a film about a coal mining disaster as it is a film about loss and how we choose to deal with the tragic events that occur in our lives. Of all the films I saw at SIFF this year, this is my favorite. <br><br>The film is set to be released in January 2015. Go see it!","user":"MaryS-333","rank":[42,55]},{"title":"Guilt and remorse","rating":7,"date":"2 April 2015","review":"Dramas are normally not the kind of movie I'm going for so I was not expecting much before watching this movie. After seeing it I must say I'm not disappointed at all. It's certainly worth a watch. It's a movie about all kinds of accidents, guilt and remorse, coping with losses. I thought all the actors gave a good performance. The filming was not bad either, I thought it was enjoyable to watch. The storyline is entertaining enough to not get bored. It is kind of slow with not much action but that's why it's a drama and not an action movie. Nothing wrong with that if you like that genre of movie. I probably won't watch it a second time but I certainly don't regret watching it.","user":"deloudelouvain","rank":[9,10]},{"title":"Heavy Breathing","rating":6,"date":"17 January 2015","review":"Greetings again from the darkness. You know how we always hear that there are no secrets in a small town – how everyone knows your business? This first feature film from writer/director Sara Colangelo exposes the fallacy of that notion. It seems all residents of this small mining community are carrying secrets, and some are whoppers! <br><br>The story picks up about a year after a horrible coal mining accident killed ten local miners. The lone survivor was Amos (Boyd Holbrook) who is struggling with physical limitations resulting from the incident. However, generating more pain for Amos than his withered arm and leg is the internal battle the ongoing investigation is causing him. Should he expose the known safety issues that caused his co-workers to die? If he does, those 10 families probably get justice and a financial reward, but the mine likely shuts down - crippling the local economy and throwing much of the town out of work. If keeps quiet, those families get nothing and it's business as usual for everyone else.<br><br>Amos is joined in a daily conundrum of secrets by: Owen (Jacob Lofland), who is much too young to handle the situation an accident has placed him; Owen's brother James (Beau Wright) who has Down Syndrome and is even less equipped to keep his secret; the mine's supervisor Bill (Josh Lucas) who defends his poor decisions by saying he only did what the company forced him to do; and Diane (Elizabeth Banks) who is Bill's wife and reacts to the disappearance of her son and lack of respect for her husband in a manner that can't possibly end well.<br><br>As is common in poverty-stricken communities, there is even more to add. Owen's father was one of the miners killed in the accident, and Owen was among the group who last saw Bill and Diane's son alive. Also, Amos is living with his father who is paying the health price for a lifetime of coal mining. The film is bookended by Amos' testimony regarding the accident, and in between we see these intertwined lives and much soul-suffering and personal stock-taking. It's a reminder of how powerful grief can be, especially after such an instantaneous tragedy.<br><br>Boyd Holbrook and Jacob Lofland deliver outstanding performances. Mr. Holbrook's career is in skyrocket mode as he appeared in 8 projects during 2013-14 (including Gone Girl, The Skeleton Twins), and has 5 more for 2015 (including Terrence Malick's next film). Young Mr. Lofland was a standout in both Mud (2012) and his recent recurring role on TV's Justified. Also of note is one of the few dramatic turns for Elizabeth Banks. We have come to expect comedy excellence from her (even as Effie in The Hunger Games), but we have rarely seen the emotional depth she portrays here.<br><br>The movie is beautifully shot by Rachel Morrison, and the film stock provides the grainy look that adds to the realistic feel necessary for us to be absorbed into this isolated world. Comparisons to other mining movies are expected, and North Country (2005) and Matewan (1987) come to mind, however, those were centered on mistreatment in the workplace and labor issues, respectively. This movie is much more concerned with grief, and for some reason The Stone Boy (1984) comes to mind. Dealing with tragedy does not become easier with age, financial status or social standing. Ms. Colangelo's film provides an intimate look at this.","user":"ferguson-6","rank":[17,23]}]