[{"title":"Interesting idea in a collection of missed opportunities","rating":6,"date":"4 November 2018","review":"The general story/idea is interesting and about as original as you can get in a romantic comedy.<br><br>It really isn't a \"vanity project for the virgin lead\" as some put it. The circumstances under which the nerd gets three hot women are realistic and even explained to some extent in the movie. Sharon#1 is a \"business advisor\" - basically a hot, experienced, glorified realtor. Such women often use sex as an insurance, that's how they hooked up and then she happened to like him, so they do it again from time to time. Sharon#2 is a hot woman who decided to go into IT (presumably after a career in modelling). She doesn't have time for dating and gets interested when she sees that Sharon#1 is hooking up with the nerd. Sharon#3 is basically the nerd's soulmate - it's just that she's a hot girl, so she wasn't bullied in school, but, other than her looks, she's just like him, so they hook up. Of course, all of this is pushed to extremes, especially if you put them together, but, that's how you make comedy.<br><br>Now, the fact that movie feels it needs to explain this to you is a bad sign. It obviously feels it's not good enough, you won't conclude this on your own.<br><br>There are some jokes, a few are good and most of the rest are OK. There's some fun to be had. But, the movie reeks of missed opportunities. The final confrontation, with a botched three-way is one of the biggest. Actually, it's the end when it all comes crushing down, it's not funny nearly as much it could have been, it's not really realistic anymore (Sharon#3 forgives the nerd after he keeps repeating \"I love you\" and \"give me another chance\", after he did that a lot before and she hadn't forgiven him). That's probably another reason this movie doesn't get much love, because the ending is what sticks with you, and this one is bad. Not the worst, mind you, but, bad.<br><br>The acting isn't great, but, it's OK for such a comedy. Sharon#3 is probably the worst, she looks the part, but doesn't act it well. The lead nerd is OK for the comedic elements, but, not really good otherwise, we don't see him actually changing when Sharon#3 dumps him, which is kind of the point of the movie. Others are actually doing a fine job, with Sharons taking the lead.<br><br>Still, with all it's flaws, it's worth a watch.","user":"srdjan_veljkovic","rank":[4,4]},{"title":"Zzzzzzzzzzz","rating":3,"date":"22 September 2018","review":"A nerd dates three girls named Sharon and falls in love with one and the rest find out... blah blah blah...\n Yo, where's the comedy aspect of this movie??? This seems like an ego project by the virgin leading man. I did not laugh once and was bored from start to finish. It's not funny, charming, fun or in any way entertaining. Don't bother with this.","user":"MikeHunt1075","rank":[13,20]},{"title":"Offensive in so many ways.","rating":1,"date":"26 August 2019","review":"Sexist and silly fantasies and stupid workplace harassment. This stupid movie should be in prison with Weinstein. Some decent actresses sadly sadly wasted.","user":"w-84065","rank":[2,2]}]