[{"title":"Without a doubt, the best \"Christian film\" I've ever seen.","rating":9,"date":"24 September 2014","review":"I put \"Christian film\" in quotes because the filmmakers are Christians, but I guarantee it's not the type of movie you're probably thinking of (God's Not Dead, Heaven Is For Real, Kirk Cameron's stuff, etc). It is the first \"Christian film\" I've seen that wasn't preachy or trying to cram a message down my throat. Messages are there, sure, but they are for you to extrapolate and consider like any good film. Also, the film isn't reserved or afraid of poking at its home audience. In fact, I'd say a good portion of it is designed to intentionally provoke questions in Christians themselves where usually Christian movies are trying to get non-believers to \"question\" things. Lastly, it is most definitely the funniest Christian movie I've seen (Miles Fisher and Max Adler are superb) and probably the best in terms of the craft of filmmaking (something many others tend to put low on the priority list).<br><br>I was just honestly taken aback by how much I enjoyed it. I typically loathe Christian films, having seen so many growing up, but this was like a breath of fresh air. If more Christian films were like this, perhaps they wouldn't be thought of as such a joke by most everyone else.","user":"refocusedlarry","rank":[43,61]},{"title":"Believe Me... this film is lame","rating":3,"date":"31 October 2014","review":"Believe me is about 4 frat brothers who start a fake charity so that they can make money to wipe off a college loan. If this film was supposed to be a commentary on the current state of US higher education they might have had something. Sadly the main characters are just like the self-entitled privileged jocks that are usually painted as the bad guys in 80s films where the nerds finally have their day, so straight off the bat you hate them. The whole thing kind of sounds like a light-hearted college film, right? Wrong. Before I watched it I figured it would contain all of the classic frat characters and hijinx we have come to love from college films like Animal House, and the preview made it look funny. Wrong again. Sadly the film doesn't know whether it should be funny or serious. It pivots between poorly timed jokes that don't hit their mark and moments where we are supposed to see the human side of these asshole characters -and neither works. If it had stuck to being a shameless comedy (and they cast actors with a concept of comedic timing) then this film might have worked. Instead they tried to give it a serious edge and the lack of commitment doesn't pay off. The premise is flawed to begin with and it doesn't help that the script doesn't do anything to set up how and why the audience should believe these characters have the capability to accomplish what they are doing. The thing stinks of lazy writing, amateur directing and below average acting. Don't waste your time.","user":"Dizzyscribbles","rank":[14,25]},{"title":"Refreshing spin on an otherwise tired topic","rating":10,"date":"1 October 2014","review":"One criticism I have heard of this film is that it can't seem to make up its mind. Is it for or against Evangelicals? Do the ends really justify the means? What makes you a good person? What makes you a bad person?<br><br>Pictures are painted on both sides of the religious fence of both good and evil, just like in real life. Rarely do we find a perfect Christian, or an evil nonbeliever, but rather we live in a reality where often nothing is clear. Therein lies the beauty of the film- that it is authentic. In a world that wants to paint itself black and white, this film lives in the grey and forces the viewer to decide for themselves what is noble in life. <br><br>Presenting this question in a way that treats both sides fairly, or unfairly, depending on your leanings, is quite a feat. Furthermore, the fact that the film maintains a predominantly lighthearted tone with some truly zippy humor while presenting thoughtful conversation points results in a truly intriguing and enjoyable film.","user":"bryanlnewman","rank":[12,24]}]