[{"title":"So many questions","rating":2,"date":"7 July 2018","review":"Question 1: Please tell me why a child that size drowned in the bathtub?? Sit up kid. \nQuestion 2: Why is no one investigating her missing husband? Meanwhile she's doing \"research\" like most typical horror films trying to get to the bottom of it!\nQuestion 3: Does she even care that her husbands gone?? Nope. Doesn't seem to bothered by it. \nQuestion 4: Why were they so angry with her for giving him a sleeping pill only to hold him down to give him a shot???\nQuestion 5: Why was the front door to the orphanage unlocked???\nI think that's it. But I'm still pretty confused by the whole thing. Could have been great, but didn't quite get there.","user":"autumnjoshields","rank":[73,96]},{"title":"Do not expect a \"regular\" horror movie","rating":7,"date":"29 July 2016","review":"This movie somewhat reminded me of \"A.I. Artificial Intelligence\", a movie that started out like a drama and in the end felt like a fairy tale story. \"Before I Wake\" has the feel of a horror movie at times, but turns into, albeit a scary one, a fairy tale. The good: The actors did a fine job, especially the two leads. A well written story and the fantasy effects looks good. The bad: The monster did not look very scary, but I guess there is a reason for that in the story. The movie is promoted as a horror, I guess that will leave some viewers disappointed. This is not The Conjuring or Saw. This is a fantasy with some scary elements.","user":"connyskribent","rank":[40,52]},{"title":"Who cares if they got the Genre Wrong! GREAT GREAT MOVIE!","rating":9,"date":"20 August 2016","review":"Okay here we go... I am so sick of all the people writing reviews where they pick apart the Genre classification, like that some how makes the content of the movie bad because of their \"say-so\". Get a damn life and quit being a anal retentive Armchair sycophant. Couldn't you just say they got the sub categories wrong and be done with it. No one really gives a crap. If you think it really matters, Then write to the Studio that produced the film and complain to them. (guaranteed your letter will wind up in the round file\") Instead, write a fair review about the actual \"Movie\" and move on. NOW... I liked this movie, it was done well, great acting ( the kid stole the show in my opinion). Filming was great, suspense slow and grinding, Music was good and the special effects were actual good for this type of movie. It reminded me of the 1984 movie Dreamscape with Dennis Quaid and David Patrick Kelly where he helps the kid with the same kind of problem. Done well and It was great entertainment. Enjoy.","user":"scottamac","rank":[98,140]}]