[{"title":"A film that's sadly uncommon in America (which is also makes it a film you need to see)","rating":9,"date":"31 August 2015","review":"\"The Diary of a Teenage Girl\" is a film that shouldn't be as uncommon as it is for American cinema. It's a seriously contemplative and revealing drama about a young woman lost and confused about her sexual identity upon committing one of society's most serious taboos and realizing that she liked it and might want to try it again. And again. And enough times to keep an audio diary of her thoughts and experiences about said act.<br><br>I'll catch you up; set in 1970's San Francisco, Minnie (Bel Powley), a fifteen-year-old girl and aspiring cartoonist, experiences her sexual awakening after losing her virginity to her mother's sorta-boyfriend Monroe (Alexander Skarsgård). Minnie considers herself overweight and undesirable in every sense, and is largely neglected by her Bohemian mother Charlotte (Kristen Wiig), who is usually too busy smoking weed or doing drugs with strangers to even notice her daughter, so this awakening comes as an immense shock to Minnie and her person.<br><br>Minnie begins to crave more sex and attention from Monroe, going as far as to make intimate sex with him a regular thing, in addition to craving sex from strangers and other boys her age, all under her mother's nose. This sex drive, however, is deeper than horniness, but a cry by Minnie for companionship, desire, and, most of all, love. Minnie wants to be the apple of someone's eye, so much so that when she leaves, the person feels like they'll die without her company and security.<br><br>I've long had the same hunger Minnie has had, though I've been fortunate, as a male, to see roughly two or three coming of age films that accurately reflect my emotions, my desires, and my sexual awakening. Young girls and stories of their sexual awakening have been cruelly shortchanged in American film and \"The Diary of a Teenage Girl\" takes note of that just by existing. Consider scenes when Monroe and Minnie have sex, makeout with one another, or Minnie describes past sexual advances to her best friend. If these scenes made you at all uncomfortable, uneasy, or awkward (like they did me), then writer and directress Marielle Heller has effectively proved that fact without even saying it. Now switch the genders of the two main characters, think about the situation over again, and see if you feel that same level of discomfort.<br><br>Heller unapologetically details Minnie's desires in a way that, while revealing, is whimsical, thanks to the presence of Minnie's drawings springing to life before her eyes. However, this occasional distraction is offset by Heller's honest depiction of Minnie and, most importantly, the rawer scenes of the film, like when we see Minnie stand naked before a mirror as she examines her body and voices her desire to be loved and cherished. It's something I'm sure most young girls have done at least a few times in their life; standing before a mirror entirely exposed and hoping someone will love you for all of you rather than just parts of you. It's the basic level of human feeling, and Minnie has discovered it and craves it much quicker than any of her friends have.<br><br>Bel Powley is a force on-screen here, positioning herself not as a fabled caricature but an empowering everygirl that transcends beyond the confines of a typical teenage girl into somebody many can relate to. It also helps that Powley, herself, is such a great screen presence, confident even when her character is insecure, and encapsulated in a bubble that teeters between innocence and the loss of innocence.<br><br>\"The Diary of a Teenage Girl\" could easily be paired with \"Turn Me On, Goddammit!,\" a Norwegian coming of age drama about a girl relatively the same age as Minnie, who becomes entranced with masturbation and sexual pleasure so much so that it takes over her life. Truly impacting and significant coming of age stories for young girls are depressingly few and far between and here is a film that boldly asserts itself by silently calling audiences out on its double standards for young women, focusing on a relatable protagonist throughout the film, giving us artful direction and attractive aesthetics not as a means to sugarcoat but to humanize, and concluding the picture with an ending that, while unfortunately fairly radical for American cinema, hits as hard as some of the best endings of films this year.","user":"StevePulaski","rank":[84,108]},{"title":"The Diary of a Teenage Girl is a Must-See movie!","rating":10,"date":"24 March 2015","review":"I saw the movie that at the New Directors/New Films film festival in New York in March 2015. I read Phoebe Gloeckner's graphic novel that the film was based on. Although I did enjoy the book, I did struggle with the characters and a lot of the things the characters were doing, but I couldn't wait to read it every night. I loved the way she told the story of a 15-year-old girl that has just started an affair with her mother's boyfriend in 1970's San Francisco.<br><br>I was drawn to read the book and see the movie because I am a huge Alexander Skarsgård fan and I love to support his films. His character, Monroe Rutherford, seemed like a total jerk in the book. Alex's take on the character was much sweeter. Sure, the content is the same, but the characters in the movie (ALL of the characters) seemed much more likable in the movie. It was hard to see why Minnie would be so into Monroe in the book, but it is quite evident in the movie. Besides Alex's handsome good looks, his Monroe is a happy-go-lucky guy that shows he has a heart. (Very caring) Not that I think that having an affair with your girlfriend's 15-year-old daughter is a good thing or appropriate, you can see how a situation like this could happen (especially in that household). The fact that he could take a character like Monroe and make him so likable, convinces me that this is his best performance to date.<br><br>Minnie is the kind of girl that loves to be touched and show affection. She is a highly talented girl that has so much going on around her, and she is receptive to take it all in. I'm happy to see the way that the director/screenplay writer Marielle Heller told her story. I had heard some people said there were cringe-worthy scenes, but I didn't feel that way.<br><br>Sure there are plenty of sex and drug scenes in the movie but they are done fairly quickly and with respect and are essential to the story. There is humor throughout and lots of animation in the style of Phoebe Gloeckner and Aline Kominsky.<br><br>As I said earlier, I didn't care for the characters in the book as much as I did in the film. Bel Powley is SUPERB as Minnie (you never do detect her natural British accent). Kristen Wiig still plays an awful mother, but you can tell she cares, but in her own way. Christopher Meloni was a caring and humorous ex-step-father. I also enjoyed Madeleine Waters as Kimmie and Margarita Levieva as Tabatha which were two of the characters I particularly didn't like in the book.<br><br>Marielle's take on the book was superb. This was a passion project for her and it shows. I hope to see more of her work in the future. <br><br>Brandon Trost won the Cinematography award at Sundance and you will see why. It just doesn't feel like any other movie I have seen. It is such a stand-out film.<br><br>THE DIARY OF A TEENAGE GIRL was an excellent movie and I cannot wait to see it again and again. I hope it has a soundtrack because I definitely want to buy it. It may not be suitable to see with the family, but definitely grab your best friend and go!","user":"Jody K","rank":[74,105]},{"title":"An Honest, Unfiltered & Nonjudgmental Account Of One Girl's Sexual Awakening","rating":31,"date":"31 December 2015","review":"An honest, unfiltered &amp; nonjudgmental coming of age drama about a young woman's sexual endeavours, The Diary of a Teenage Girl is a nicely crafted, sensibly narrated &amp; wonderfully performed cinema that's highly bohemian in nature, emanates a psychedelic vibe from start to finish &amp; is further uplifted by its well-put together cast.<br><br>Based on the graphic novel of the same name, the story of The Diary of a Teenager is set in San Francisco during the 1970s and concerns Minnie, a 15-year old aspiring cartoonist who in the wake of her sexuality begins a relationship with her mother's boyfriend. However, her longing for love &amp; acceptance soon sets her on a path to much bolder adventures.<br><br>Written &amp; directed by Marielle Heller in what is her filmmaking debut, The Diary of a Teenage Girl is oddly stylish, surreal &amp; provocative in depicting the sexual &amp; artistic awakening of its protagonist and captures the highs &amp; lows of adolescent life with utmost sincerity. Heller's direction is as good as her screenplay, and it's refreshing to see the story being told from a girl's perspective.<br><br>Production design team does a good job in replicating the 1970s setting, Cinematography makes splendid use of its camera &amp; bright colour tones to further enhance its images, and Editing is finely carried out while the music fits its scene. Coming to the performances, Bel Powley delivers a terrific performance and is brilliantly supported by Alexander Skarsgård, Kristen Wiig &amp; others.<br><br>On an overall scale, The Diary of a Teenage Girl is a bold example of its genre that attempts to capture the turmoil of teenage years without sugarcoating any of it, is capable of leaving a few viewers squirming on their seats with its explicit nature, and thanks to its playful tone &amp; sensible handling of its characters, is a welcome entry in the coming-of-age filmmaking landscape. Definitely worth a shot.","user":"CinemaClown","rank":[26,37]}]