[{"title":"Can't find the wow factor","rating":9,"date":"9 June 2016","review":"This film tells the story of a group of magicians who are going to reveal the secrets of a corporation. However, they get outsmarted and blackmailed. They have to try get an upper hand in a seemingly difficult situation. <br><br>I enjoyed the first \"Now You See Me\" because I was wowed by the mystery and suspense it had. This installment, however, does not provide me with the same experience. <br><br>This time round, the film spends a lot of time introducing the new characters and to set the picture. Then, there is a constant stream of trickery, which are unrealistic and unlikely. The plot becomes so far fetched and random, events happening so conveniently that it loses believability, which is the key that made the first film great. There are some scenes in here that's good, but most of the time I am left to wonder when the film is going to end. Unfortunately, I can't see the wire factor in \"Now You See Me 2\".","user":"Gordon-11","rank":[117,151]},{"title":"Big giant mess!","rating":4,"date":"8 June 2016","review":"Here's the thing about 2013's \"Now You See Me,\" I didn't hate it but I wasn't completely wowed by it either. Mildly entertaining is how I'd describe it. It's heist caper like Ocean's Eleven but with faster sleight of hand. So to say that \"Now You See Me\" didn't have its amusing moments, would be a lie. But this sequel however, NOW YOU SEE ME 2, is a big giant mess.<br><br>In NOW YOU SEE ME 2, the four horsemen Jesse Eisenberg, Woody Harrelson, Dave Franco, Lizzy Caplan, after a year of outwitting the FBI and winning the public's adulation with their Robin Hood-style magic spectacles, resurface for a comeback performance in hopes of exposing the unethical practices of a tech magnate. But a certain revenge plot threatens their impossible heist yet.<br><br>The first film had more mystery, thriller and intrigue, so at the very least it kept you engaged, but NOW YOU SEE ME 2 resorts to cheap laughs and a build up that frankly kinda insults our intelligence. The film would like to make you believe that it's smart, it even thinks itself that way, but in its attempt to give you a seemingly intricate and elaborate trick and a big reveal, it gets lost in its own process.<br><br>Isla Fisher's Henley whom I thought was a strong female character, got replaced by Lizzy Caplan's Lula who's more concerned about getting laid. For some reason, they had to present Woody Harrelson's character's identical twin brother, also played by Woody Harrelson. I think that was a poor decision on the filmmakers' part. It's bad enough that they had to resort to this annoying unlikable family member, on top of that, they couldn't just get another actor and have it be a brother, instead of identical twin?! Woody Harrelson is a great actor, but watching two of him bantering, that's the point when I stop taking this movie seriously as a piece of entertainment. This franchise says that the closer you look, the less you see. Well, if you step back a bit, you'll see the big picture that NOW YOU SEE ME 2 is not as crafty as it's cracked up to be.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[190,268]},{"title":"4/10","rating":4,"date":"8 June 2016","review":"\"Now You See Me\" was a personal guilty pleasure of 2013, it was absolutely unpretentious and unbelievable but it knew it was so and with the help of a talented cast and a couple of good characters and story beats it turned out as a fine time at the theater. Its sequel starts out with the same unpretentious and fun vibe of the first only to slowly escalate up to what becomes one of the most lifeless and visually painful experiences of the year.<br><br>As I said the movie started out really fine, in the sense that it was doing what I wanted it to do. Nobody should or would walk into this film expecting the new \"Heat\", I just wanted to have some dumb fun, with a self referential film that doesn't take anything seriously and up to the fist two set-pieces of the film that's what I was getting. The cast was working the best they could and the action felt fluent and visually pleasing, there was a rhythm to it and a reason for it in particular.<br><br>Yet, as soon as we start getting into this film's second act things fall apart to a mind numbing degree and I mean that literally, my mind went blank with the level of stupidity and inconsequentially of what was going on, I watched this film in a state of trance where I couldn't tell if I was dozing off or simply bored to death.<br><br>\"Now You See Me 2\" takes the levels of suspense of disbelief to a whole new world where not even laughing at the film proves to be of any kind of satisfaction, everything going on is just visual noise and other than being filmed in the most uninteresting and unstylish way possible, it has no momentum, no character, it's just there for the sake of extravaganza and it keeps going on for unbelievable amounts of time and it never proves to be any kind of pleasant.<br><br>And we haven't even taken into consideration the logistical implications of what happens. It is just crazy. There is no grit of grounding of actions, stuff just keeps happening on top of other stuff and without any kind of character or story implications the film becomes more of a showcase of dull visual tricks. Not to mention the story twists it spices in which are preposterous to even think about and sprinkled with silly clichés and dialogue that not even Ruffalo or Freeman, two of the greatest actors, manage to make even passable.<br><br>I got a head ache from this movie, it was a terrible experience, I don't recommend it and the shortness of my review is reflective of how lost with words I am about it.","user":"James_De_Bello","rank":[250,360]}]