[{"title":"Easily Seagal's poorest film....he needs to give it up now.","rating":1,"date":"26 May 2016","review":"There was a time when Seagal was a big hitter in Hollywood. Back in the early nineties, his films would always debut at number one at the American box office, and you could tell he actually cared about what he was doing, despite appearing slightly larger in each film.<br><br>This year has seen him at his laziest. Sniper: Special Ops had him sitting down for the majority of the film, and Code of Honour didn't even have speak until 48 minutes into the film.<br><br>Now whilst he does stand and speak in this film (he must have been paid well), it's the fact that the rest of the cast and the narrative are just handled so poorly, it makes Seagal look deceptively on form, but if you are/were a fan of his, it's clear he isn't bothered about the film in the slightest..<br><br>When two American robbers, Jack and Sam, embark on a series of heists in Southeast Asia, they run into more trouble than they bargained for when they steal money from a ruthless drug lord. <br><br>A fight for riches turns into a fight for survival as Jack and Sam become the target of the drug lord and his gang's vengeance.......<br><br>The girls narration throughout the film makes it feel like a cross between a lifetime movie and a really bad reality TV show (aren't they all?). It's soulless, poorly executed and her voice is just so mundane, it makes you feel sad.<br><br>The 'hero' of the film looks like a cross between Evil Ed from Fright Night and Bill Paxton (he ironically played his part in Terminator: Genisys), and dresses up like Brad Pitt in fight club. He's highly unlikable, and the fact that his partner is a cockney geezer with name calling issues, just makes matters worse.<br><br>Seagal spends the film in his Bandana, shades and ball gown, doing gentle martial arts, by waving his hands in front of the camera, and showing the lady of the film, what appears to be Madonna's Vogue dance.<br><br>It really is a terrible piece of work, and a thankless cameo from Michael Jai White doesn't add anything to the film.<br><br>An ordeal to get through, it's the cinematic equivalent of a Buffet owner seeing Seagal walk in with a knife and fork...........horrifying.","user":"FlashCallahan","rank":[13,14]},{"title":"So bad!","rating":1,"date":"18 March 2017","review":"First of all, I turned the film off. I simply could not watch the entire fiasco. The acting was so amateurish that it was laughable. How old was Jack's girlfriend? All of seventeen? Where do they find the actors for these disasters? But to make matters worse, the three minute segments with Steven Seagal who is way too old and out of shape to be in all these action films he so call stars in. I watch these films to see just how much worse they can get. This one certainly met my expectations.","user":"popnruss","rank":[8,8]},{"title":"Everything you would expect and nothing more.","rating":2,"date":"13 May 2016","review":"I really thought that the inclusion of MJW would hopefully lift this slightly higher than expected. Sadly he is unseen but for a fleeting scene in which his role could have been played by any random crackhead.<br><br>The whole thing is so poorly acted and scripted not to mention directed that it really comes down to a D grade action flick built around Sensei Seagal playing patty cake in his pj's (yet again) and delivering even worst dialogue than usual. Even giving him the opportunity of playing a bad guy for a change seems too much like hard work for the Sensei who dials in one of the lamest performances from him yet. Maybe his lethargy is a result of being squeezed too tightly into his Spanx.<br><br>Perhaps the worst offender in this mess is Director (and I use that term very loosely) Daniel Zirilli. He continues his rise towards mediocrity with another typical example of his very obvious limitations.<br><br>Watch only if you absolutely must, but don't say you weren't warned.","user":"dtwine","rank":[23,28]}]