[{"title":"Quite special","rating":9,"date":"24 February 2015","review":"Sweet, beautiful, wordless animated film, telling the charming, endearing and sometimes sad story of a young boy from the country going in search of his father who has moved to the city to earn money for the family. <br><br>The film seems an attempt to see through a child's eyes, and it succeeds, leading to images that are surreal, wondrous and odd, and that don't always make literal sense. Imagine how the high tech modern world would seem to a small boy of say 5, wandering in alone from the countryside. The film captures that feeling<br><br>Done in a simple, colorful, handmade style that's the opposite of most computer animation we see these days, recalling artists like Joan Miro, there's a heartfelt quality that goes with the handcrafted nature of its slightly surreal and beautiful images. Truly universal, there's not a single word of real dialogue, just some occasional gibberish-speak. There's also great Brazilian music that changes personality with the boy's adventures, along with a nice lesson for kids about the loss of the beauty of nature in the industrial world. Quite special.","user":"runamokprods","rank":[30,31]},{"title":"One of My Best Discoveries of Late","rating":10,"date":"8 May 2015","review":"The Boy and The World has been one of my best discoveries in recent times. A movie that tells its story not through words but music, colours and the eyes of a young boy with a sense of wonder and innocence. The two dimensional animation did nothing if not alleviate the visual thrill that the movie was. A boy's imaginations were carefully captured that went apace with his emotions.<br><br>The story is about our young boy who sets out to seek his father who had to leave to work in the city. But on his journey, the boy finds many more facets of life that he had never experienced. He sees life as it could never have been in his imaginations. It is his survival through all the changes, which he never welcomed or run away from, that meets him in his lifelong quest for his father. It maybe a poignant piece for many viewers, but it is the 'hope' of the better world, which is born anew every time it is vanquished, made the movie marvellous.<br><br>Ale Abreu has not only produced a masterpiece, but also, I am sure, has given us that long overdue movie which vibrates in me as a symphony of life.","user":"flamboyanza","rank":[29,31]},{"title":"The Full Spectrum of Human Emotion","rating":9,"date":"8 March 2016","review":"Decades behind a computer, toiling and tinkering with the programming and software has given us the near-photographic realism of CGI animation. The culmination of which is the film Inside Out (2015) which won the Best Animated Feature Oscar this past year. Yet as anyone who truly loves animation will know, it's not about who has the most detailed techniques or the most expensive equipment. With great ideas and simple yet sublime stories, something as lo-fi as Boy and the World can move its audience to the core.<br><br>The story begins with a young boy (Garcia) who lives in a rural abode near the jungle. His father (Campos), a mustached man sporting a straw hat and a flute, grabs a suitcase and heads to the city. the boy is heartbroken by his father's sudden absence and decides to head to the city to find him. On his odyssey he meets a host of colorful characters and comes face to face with the seductiveness, absurdity and danger of modern life.<br><br>The animation is reminiscent of the work of Don Hertzfeldt. Everything is cobbled together with simple geometric shapes and seemingly done in charcoal and crayon. Yet unlike Hertzfeldt's work there isn't a sense of ruing existential doom; at its heart it is innately humanistic. Its simplicity and kaleidoscopic vision immediately strikes you with a sense of childlike wonder and as things in the story become more complex it washes over you in a flood of emotion and awe. The color palette in this film is so effective in rendering the wonder of the jungle, the bustling of the city and the rainbow-tinged weaving's of the Mestizo people that parade down the streets.<br><br>It's important to note that the movie is largely non-verbal. What is uttered is dubbed in backward Portuguese and the only guiding light you're given are the visuals and the soundtrack. And what a neat soundtrack it is! Grupo Experimental de Musica (GEM), Emicida, Nana Vasconcelos and the Bushdancers all somewhat obscure Brazilian bands that help the story gently flow through you. Not since the early work of Hayao Miyazaki has there been a more genuine work of youthful artistic expression and such a full spectrum of unfettered emotion.<br><br>A movie so deceptively simple and yet so emotionally complex comes around only once every few years, and an animation of this caliber comes round perhaps once in a generation. Some may not be hard won by it's environmental overtones and be contrarian to its thoughts on consumerism yet there's no denying that a story this human deserves attention and praise. Blink and you'll miss this little gem but if you can find it in theaters or (hopefully soon) on Netflix, I highly recommend it.","user":"bkrauser-81-311064","rank":[14,15]}]