[{"title":"Not quite there","rating":5,"date":"23 May 2017","review":"The movie isn't bad - but it isn't great either. I wish the characters had more flesh and backgrounds to be honest. <br><br>Racist white man shoots people trying to cross the border. Why does he do it? That would be interesting to know. Why is he so hateful? And what are the people who are trying to cross hoping for, what are their dreams - what do they leave behind? <br><br>I felt little sympathy for them, other than the obvious - because they were so one-dimensional - and the murderer isn't really any better - which leaves for a movie you only watch to the end because your favourite actor is in it.","user":"mariellealien","rank":[15,18]},{"title":"What is the directors intention?","rating":3,"date":"16 April 2017","review":"Desierto is a movie that tries to tackle a very serious topic with a handful of caricatures and two very good actors which are lazily directed. <br><br>From a purely technical stance it tries to offer up some captivating shots during its first couple of minutes but it becomes quite clear as the movie progresses that Quaron does not know how to shoot a chase sequence, which this movie basically is. It's one big horror movie chase sequence that leaves a lot to desire in terms of dialog and pacing.<br><br>The most concerning thing is that one leaves the movie without knowing what the directors intentions were. Was it to shine a light on the topic? to make a polarizing movie? to get some sort of radical reaction from the viewer? to serve as a cautionary tale?<br><br>In any case, it ends up being a pretty tasteless and irresponsible treatment of a serious topic and it doesn't offer up anything else as a possible saving grace.","user":"shmittyfro","rank":[26,39]},{"title":"Not Subtle, But Interesting","rating":6,"date":"15 October 2016","review":"I saw \"Desierto\", starring Gael Garcia Bernal-Mozart in the Jungle_tv, Letters to Juliet; Alondra Hidalgo-This is her first movie; Lew Temple- The Walking Dead_tv, The Devil's Rejects and Jeffrey Dean Morgan-Negan on The Walking Dead_tv, The Losers.<br><br>This is a movie about illegal immigrants from Mexico crossing the border into the United States. Hey, just in time for the election season-I bet Trump has already seen this one more than once. Gael and Alondra are just two of the approximately twelve to fifteen immigrants making the journey in the back of a packed truck when it breaks down in the middle of the desert. They are forced to make the rest of the trip on foot. That is when they cross paths with Jeffrey, a good old boy, driving around in his pick-up truck-with a Rebel flag, of course, so you will know he is a racist-drinking his whiskey, with his rifle and hunting dog named Tracker, in case you had any doubts about what kind of dog he was. Yep, Jeffrey takes his border patrol part time job very seriously. Lew plays a real Border Patrol policeman that runs into Jeffrey but can not seem to catch him doing anything wrong. As you can probably guess, Jeffrey starts to take out the immigrants, one by one, until only a small group is left on the run-Oh yeah, Tracker does his share of making the group of runners just a little smaller, too. The movie is in Spanish with English sub-titles, so you have to do some reading. And, in case you are not up on your Spanish, Deseirto means desert. It's rated \"R\" for violence and language and has a running time of 1 hour &amp; 34 minutes. It is an interesting movie, not real subtle, but interesting. I don't know if I would buy it on DVD but it would be a good rental.","user":"stevendbeard","rank":[18,27]}]