[{"title":"Not up to par with what I usually expect from most Pixar short films.","rating":6,"date":"26 March 2014","review":"'PARTY CENTRAL': Three Stars (Out of Five) <br><br>The second Pixar animated short in the 'MONSTERS, INC.' film series. It takes place shortly after 'MONSTERS UNIVERSITY' and tells the story of Mike and Sully (once again voiced by Billy Crystal and John Goodman) helping their Oozma Kappa frat brothers throw a party. They come up with the plan of using a 'door station' to sneak into parties, at other fraternities, and steal guests and refreshments (while passing them through the bedroom of a sleeping couple). It also features the voice talents of actors Sean Hayes, Dave Foley, Charlie Day, Joel Murray, Julia Sweeney and Peter Sohn and was written and directed by longtime storyboard artist Kelsey Mann. It's 5 minutes long and plays in theaters before 'MUPPETS MOST WANTED'. I found it to be amusing enough but not up to par with what I usually expect from most Pixar short films. I have seen a lot worse animated movies though and I'm sure most fans of the 'MONSTERS, INC.' franchise will enjoy it.<br><br>Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=D2NdCvPRYk4","user":"Hellmant","rank":[2,2]},{"title":"A monster party","rating":7,"date":"25 June 2019","review":"Saw 'Party Central' for many reasons. Love animation, and always have done as a child, will be forever grateful towards it for helping me relax when very much needed. Love Pixar and a vast majority of their films, in my mind 'Monsters Inc' is one of their best if not quite one of my all-time favourite animated films. Really like to love their theatrical short films and the feature-related shorts are fun enough though don't put them on the same level personally.<br><br>One of their feature related shorts, 'Party Central' is enjoyable enough but nowhere near a Pixar high point to me. Being still very well made and characterised, but an example of the Pixar feature-related shorts that doesn't quite have the same amount of charm and heart of the feature film. Of the feature related shorts, 'Party Central' is neither among the best or worst and fits very comfortably in the middle. Which is a solid position to be in. Very like the other 'Monsters Inc' related short 'Mike's New Car'.<br><br>'Party Central' is a bit hectic in terms of pacing, due to having a lot of content in a short, perhaps a little too short, period of time.<br><br>It's not really going to remembered for its story either, which is somewhat lost amongst the physical humour. While it's very funny and colourful, it doesn't have the same amount of heart that 'Monsters Inc' has.<br><br>The physical humour though is very funny, timed beautifully and looks great in the animation. Just as good is the verbal comedy, which is as sharp and witty as one expects. There is more than enough energy and it is a party that one would be happy to be at. Mike and Sulley are still the great characters and double act that they were in 'Monsters Inc' and the supporting characters are colourful and amusing (if not near as memorable as those in 'Monsters Inc'.<br><br>Voice acting is very good, wonderful in the case of Billy Crystal and John Goodman. Can't imagine anybody else voicing Mike and Sulley. The music captures the party mood adeptly, but one of 'Party Central's' best assets is the animation. It is beautifully vibrant and rich in background detail, have also always admired how real Sulley's furry character design looks.<br><br>Altogether, enjoyable short. 7/10","user":"TheLittleSongbird","rank":[2,3]},{"title":"Short and Fun,","rating":8,"date":"25 March 2014","review":"Party Central is a very funny,quick and very enjoyable short film.It shows before Muppets Most Wanted and really warms you up and gets you excited for the feature film.I didn't know this short film was coming,and I usually do before I see the movie,and it was a very pleasant surprise,I was very happy to see these characters again,even if it was just for a few minutes,and was very impressed that they got Billy Crystal and John Goodman to record dialogue for Mike and Sully.Party Central is a few minutes of fun and comedy that fans of Monsters Inc and Monsters University should really appreciate.<br><br>When their college friends throw a house party that no one shows up to,Mike and Sully go against school rules in order to get people to go to the party.","user":"lesleyharris30","rank":[2,3]}]