[{"title":"The poor are crazy, the rich just eccentric...","rating":31,"date":"31 January 2016","review":"This is a drama about a rich eccentric man in his 60s who suffered a traumatic event and became addicted to substances. Feeling guilt he tries to make amends but in his terms baring gifts which are not acceptable by the persons receiving them.<br><br>Richard Gere gives a solid performance but nevertheless this is a \"little\" movie with not much to offer.<br><br>Everything moves slow and the whole premise is quite simple, so no one can really recommend this movie as a quality spectacle. The low budget is evident through out the movie and some obvious plot holes are quickly swept under the rug.<br><br>Overall: Nowadays TV series got more complicated and interesting while low budget movies carry simple plots without such interest to justify 95 minutes of your time. If you are a fan of R.G. go and see the latest movie of your favorite actor. Otherwise...","user":"Dr_Sagan","rank":[34,38]},{"title":"Decent acting but doesn't really go anywhere","rating":6,"date":"28 November 2016","review":"The Benefactor is a small drama with a decent cast. Sometimes these kind of movies are really engrossing but unfortunately this one although not terrible isn't memorable. <br><br>Richard Gere plays a Philanthropist haunted by the death of his friends and wanting to relive his past and make amends at the same time. He therefore sets out to help his friends daughter and her new husband. Although Gere is a good actor his character in this film just comes across as unlikeable. This therefore stops any sympathy you have for him and effectively ends much interest in the film. I thought Theo James did a good job as the husband but Dakota Fanning is woefully under used. <br><br>At times this is mildly interesting so it wasn't a complete write off but towards the end it sags badly and the rushed ending is highly unsatisfactory. <br><br>Unless you're a huge fan of any of the actors I'd give this one a skip. This probably worth a 5 but I'll up it to a 6 just for the shock scene near the start.","user":"MattyGibbs","rank":[10,10]},{"title":"No Real Benefit To This One","rating":4,"date":"25 February 2017","review":"A very slow moving picture with a rather predictable story-line. <br><br>Richard Gere gets to play a quirky eccentric rich man who has his own demons to deal with and tries to make others happy by giving of his money and manipulation.<br><br>Dakota Fanning is a solid young actor who has a great career ahead of her but needs to steer clear of this type of movie. This did nothing good for her even if all she got was to work with Richard Gere.<br><br>Theo James is a mostly TV actor who I have never seen before but he carried his weight in this one well and was not overwhelmed by Gere and Fanning.","user":"wtmerrett","rank":[5,5]}]