[{"title":"We love no matter who we are.","rating":7,"date":"4 February 2016","review":"This film moved me... or rather made me look at things a little differently I suppose. I normally give money to panhandlers, buy them a hot meal whenever I can. Where I live, homelessness is an issue that people don't concern themselves with as much as New York because the climate is warmer, and people generally survive easier I suppose. But this movie made me think about those individuals who are struggling in a deeper way.<br><br>Shelter takes place over the course of a few seasons in New York city. A tough place to be, and even tougher if you're homeless. It's hard to get by, and there is no shortage of people who are willing to take advantage of you. We are introduced to two such individuals played aptly by Jennifer Connelly and Anthony Mackie. Two different lives that simply interact one day, and forever changes their paths. Both are on the street for different reasons, and both have their own demons to deal with. Their paths intertwine and they begin to show real promise, as a couple just down on their luck, just looking for and hoping for any real opportunity to dig themselves out of the hole they are in.<br><br>What really sticks with you is how utterly believable the situations are. Most movies about homelessness, usually with a huge celebrity attached to it are much harder for me to believe, but with this cast and story it was so easy to fall into. Times are tough all over the world, and New York is probably more susceptible than most cities to find yourself in hard times and taken advantage of. I feel very grateful to not have been in any of the situations you witness in this film, but I promise you, it will make you think about those who are.<br><br>An excellent first story from writer/director Paul Bettany.<br><br>7/10","user":"kdavies-69347","rank":[15,17]},{"title":"RE: The most profound movie I've seen.","rating":9,"date":"21 June 2016","review":"I watched this movie by chance yesterday and have not stopped thinking about it since. The ending is so powerful and just overwhelming. The music is haunting. <br><br>I know some have panned it but the emotions it generates are deeply felt and the dynamic between the actors is great. I find it to be a mild commentary on homelessness and the fact that people could be living a comfortable life in a city and because of some unforeseen event find themselves without shelter.<br><br>The actual and implied sex scenes are so uncomfortable because of the utter helplessness of Hannah.<br><br>I hope others find this as thought-provoking as I did.","user":"shaun-20241","rank":[13,15]},{"title":"speechless......!","rating":8,"date":"16 November 2015","review":"I have no words for this beautiful and unexpected piece of gem...i watched it and not sure what is all about ...but after watching it i was speechless....great topic and sure an eye opening subject ...Jennifer Connelly and Anthony Mackie did a well job with their role...and i am surprised why its not well rated.i don't know why the junk movies are well rated that the producers are making and remaking it again and again...Paul Bettany is clearly sending a message with his debut direction and writing ..that he can do something with a topic that no other famous directors even bother to see.. its a powerful drama and worth watching... i think it deserve more than the average stars ...Go see it with your heart ...i am sure you will not regret it..","user":"eleventh-warrior","rank":[21,27]}]