[{"title":"A cliché thriller.","rating":5,"date":"31 March 2015","review":"This movie is really nothing we haven't seen before: A woman on the brink of divorce has an affair with her younger next door neighbor and, afterward, wants nothing more to do with the man. As a result, the neighbor gets violent and stalks her.<br><br>It is a fast-pace thriller with steamy love scenes and quick action sequences. However, the plot is predictable and the acting is sub-par at best. For a movie called, \"The Boy Next Door,\" there should be more suspense and plot twists that lead up to the title role, rather than a one-time encounter that basically reveals almost immediately who the antagonist is.<br><br>It's not a entirely bad movie to pass the time with; however, you will find much more suspenseful and captivating thriller than this one.<br><br>Grade C-","user":"OllieSuave-007","rank":[27,30]},{"title":"A complete mess","rating":1,"date":"24 January 2015","review":"This erotic thriller starring Jennifer Lopez is definitely one of the worst movies I have seen in recent history. Some movies can be panned critics and still be somewhat entertaining. This movie is NOT one of them. The acting was horrendous (especially at the end), the plot was absolutely cheesy, and the whole script was pretty much chaos. This film was like a rip-off of movies like Fatal Attraction or American Psycho.<br><br>Jennifer Lopez plays Claire, a mother who is dealing with marriage problems and is a teaches English at a high school. Noah, a young man in his late teens, moves next door and befriends her son, Kevin. After having a sexual encounter with her, Noah grows an obsessive relationship with her and begins exhibiting violent behavior such as brutally beating another student and turning Kevin away from his father. <br><br>Just about every scene in the movie was predictable. There were no elements of surprise whatsoever, there wasn't even anything remotely scary about it. Most of what we get is nude shots of Jennifer's Lopez's body and gratuitous sex scenes. The acting was so awful that it would make you laugh. The fight scene were unrealistic and looked as if the actors didn't know what they were doing and had to constantly had be directed by the camera man.<br><br>I do not recommend this movie to anyone unless they are a die hard Jennifer Lopez fan.","user":"Screen_Blitz","rank":[102,146]},{"title":"One of the worst films I've ever seen","rating":1,"date":"22 January 2015","review":"The Boy Next Door is the latest film that January of 2015 has to offer and man oh man does this film scream January. It doesn't just scream January, it screams out multiple other adjectives to describe this useless, idiotic, and ridiculous film. The Boy Next Door pits a recent divorceè in a torrid affair with the next door neighbor who happens to be crazy and you could probably tell how this film is going to go due to its overtly \"let's not even try anymore\" attitude. Let's start off with the good...there is none. Now for the bad, there's a ton. Number one, I think that anyone with half a brain could probably realize that this is a horrible film. It is paced terribly, it has the dialog of a cheesy Lifetime movie from the nineties and it has Jennifer Lopez in her worst role to date. The film's 90 or so minute runtime even feels too long as we wallow in classic stalker movie clichés for its duration. It runs through the classic genre thrills from Fatal Attraction, Basic Instinct, The Hand that Rocks the Cradle and many more and uses absolutely nothing with it. The biggest issue with this film isn't the terrible plot, it isn't the half baked thrills, it is the dialog. The dialog in this film sounds like the first draft of an episode of Guiding Light. There's no flavor to it, thus letting the actors turn in bland and listless performances. For a film that is listed as a suspense thriller, there is no suspense and zero thrills. Quite honestly, the only thing that was thrilling in this film were the end credits. Yes, this film is that bad and it stands up pretty high on the list of terrible films I've seen. It fits nice and snug between Troll 2 and Gigli.","user":"trublu215","rank":[143,211]}]