[{"title":"Beautiful at times, but also a double-edged sword","rating":6,"date":"25 January 2019","review":"\"Journey to the South Pacific\" is an American English-language documentary from 2013, so this one is already over 5 years old and it was written and directed by Stephen Judson and of course he got help like so many other times by 2-time Academy Award nominee Greg MacGillivray briefly before his 70th birthday and he is not the only man in charge with said last last, so it is also a bit of a family production. The title makes obvious where this is headed, namely like so many other McGillivray films deep down into the ocean. Like lots of other IMAX productions, this runs for 40 minutes exactly pretty much. And this relatively small running time means that if you want to succeed, you really have to deliver greatg focus and be spot-on from start to finish. Sadly, this one is not. It is a decent documentary with enough emphasis on the beautiful underwater world, but at times the film also loses itself in depicting uninteresting dance rituals of native tribes that add nothing and could have been recorded anywhere else on the planet in another not too far developed country. Also the story line with the boy going on the journey mentioned on the title is pretty cringeworthy. Even if we get so many references like the father talking about how in the old days boys went on long journey and returned as men (what an embarrassing parallel to what his son does), I am pretty sure this was all very much scripted and staged and there was no real journey and even if there was this was certainly nowhere near the level where it would be life-changing for the boy. His narration was also fairly weak. If it worked, then only because of what he said like the hidden second sea horse and not how he said it, but well what can I say, at least he wasn't as unbearable to listen to as his dad. It is not uncommon for IMAX nature documentaries to deliver a mixed narration between locals and one superstar. Streep, Depp and Winslet have narrated already and here we get Oscarf winner Cate Blanchett. She is one of the world's finest actresses without a doubt, but she is not as much of a voice talent as I hoped she would be. Another flaw. Then there is the music and that one really made an impact in both directions, positive and negative. Early on, we hear some beautiful music, very early on right after the film starts, but near the end there was one moment where it was so bad that I almost had to mute the sound because it left a negative impact on the beautiful underwater photography for me. So yeah, the latter is there, not always, but frequently enough for a positive recommendation. These IMAX films arfe never failures, but this one here has more weaknesses than expected. A cautious thumbs-up from me, despite the half-baked environmental message that should have received better focus and emphasis instead of the boy's journey. Go see it. The sea horses, turtles (well the one in the water), not the big poor one surrounded by all these men) and the (other) fish makes it a good enough watch.","user":"Horst_In_Translation","rank":[0,0]},{"title":"too many fake scenes, sea life making sounds we wouldn't hear","rating":1,"date":"28 May 2017","review":"Of very little value, some photography is bad fakes, and couple who supported return of coral reef and bigger fish was barely mentioned. The couple who paid to re-create a former poachers' boat as a traveling school AND stop local fisherman from over fishing AND created a resort environment so local population didn't have to totally rely on fishing (they'd been part of the reason why the big fish had left the area) AND stopped bombing for fish.<br><br>Very poorly written, sea life shown making sounds we wouldn't hear if we were there, some underwater scenes were breath-taking (in so many ways) but they were only small moments. Most of film seemed forced.<br><br>There could have been value in this film.<br><br>Sadly, in March 2017 a cruise ship (without even contacting the island) crashed into and destroyed over $18,000,000 of irreplaceable coral reef.<br><br>See www.thejakartapost.com/travel/2017/03/14<br><br>Now tourists have whole sections with no reef, and the native fisherman probably have even less fishing options.<br><br>Is this island better off because tourism came?","user":"elainewencl","rank":[1,3]},{"title":"A documentary that might have been funny","rating":29,"date":"29 March 2015","review":"This is a documentary that might have been funny. Or at least ironic. But it is serious. And pointless. There is no evolution, no change. This is only a vacation snapshot. Colorful images. An exploitation of a land like the advertising heavens for the bigger screens. And I am sure the production team members had the time of their lives. And I am happy they got paid for living there. Still, I have seen better wedding movies.<br><br>The humor or irony was ironed out as much as possible. Yet, it still surfaces. The people doing their ritual dancing using body paint of unknown origin, but also Colgate toothpaste. In the end I don't know if the villagers playing the savages for the tourists do clean their teeth. Of course their old ways were better. But not without cotton, imported meats, and don't forget gas/oil for their boat engines. I was amused to hear even the fascism budding in the small island where people used to fish with dynamite talk about the big bad foreigners that fish without license.<br><br>Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch","user":"ersbel","rank":[1,6]}]