[{"title":"Total garbage.","rating":1,"date":"14 January 2016","review":"I don't care what the budget was, this was pure garbage. Acting was poor. Script was poor and the infamous shaky hand-held camera was out in full glory. Can't show an good action sequence, not to worry, just shake the camera all over the place to cover it up. I'm fed up with that moronic approach to filming.<br><br>Want to know about Manson, watch the excellent film Helter Skelter or even a documentary. Steve Railsback gives a remarkable performance. There has been a lot of good films made on shoestring budget. This however is not one of them. Just to take a notorious event is not enough. Try learning some basic skills first.","user":"RMS1949","rank":[31,42]},{"title":"House of Manson ... pretty good considering the time and budget!","rating":4,"date":"21 October 2014","review":"I attended the Premier of this film at the Twin Cities Independent Film festival. The film kept my attention at least and there were some things that stood out such as Ryan Kiser's lead role as 'Charlie'. He is obviously a step up from the other actors in this movie and deserves a shot at a higher budget film. I also felt the chemistry of the entire cast was good and made for a believable 'cult family'. The actors playing the parts of Leslie Van Houton, Squeaky Fromme, and Tex Watson were believable and stood out above the other supporting cast. However, the acting for the role of Sharon Tate was unfortunately a disaster. The Susan Atkins actor had the right idea, but I felt she may have just been trying too hard to be crazy/quirky. That being said, I understand that with a higher budget and more time, many scenes could be redone with some extra attention from the director.<br><br>During the Q&amp;A with the Director and Cast, it came to light that this movie was filmed in 15 days, covering a 128 page script. Wow ... that in and of itself was amazing! There were some admitted sound and scene transition issues that hopefully will get cleaned up. On that note ... I felt there was a severe over use of music/sound effects. Most every scene had continuous sound effects which was unnecessary. It was distracting at times and took away from the effect of the overall dialog. I assume it was intended to establish a mood, but some of that mood could have been created by the dialog itself. Every scene was shot up close and could have used some wider angles to gain a better experience of the entire landscape (lack of budget most certainly played a role here). <br><br>Some people know the Manson story much better than others. The assumption should be that the viewer of the film doesn't know a lot of the details. The characters of the 'family' could have been introduced better. Some of the scenes could have been set up in order to introduce characters instead or relying on the knowledge of the 'Manson' story. <br><br>The director said during Q&amp;A that they wanted to show the humanity of Charles Manson and why he may have turned out the way he did (ala Michael Myers - Halloween (2007)). The idea was there, but more time should have been focused on the abuse and abandonment that developed his character. They mentioned that Charlie's mom sold him for a case of beer, so why not add that scene in? Showing Charlie watching his Mom kiss a man (from a crack in a door) does not show a pattern of inappropriate parenting, much less abuse. Dig into that and you might persuade me that he was a victim of poor upbringing at least. <br><br>All in all, this was a decent attempt, but I think it could be even more engaging with some additional time and budget. I enjoyed it for what it was. Good job for all who endured the compact 15 days of filming!<br><br>This is only my opinion as a movie goer, and I realize it is much more difficult to create an independent film based on what you have to work with. It intrigues me to understand all that goes into creating an entire film with so little budget. I am a fan of the entire scene and wish all involved all the success they deserve for all the hard work they have put into such a film.","user":"alterego910","rank":[19,25]},{"title":"House of Manson takes the story Charles Manson Without being over the top","rating":7,"date":"19 October 2014","review":"\"House of Manson\" is a film that chronicles the life of Charles Manson and focuses in on the events leading up to and including the Sharon Tate murders of 1969. Unlike other Charles Manson biopics that focus in on the sex or the over the top nature of the Tate murder, this one focuses in Charles Manson's influence and connection with his followers, the Manson family as they call themselves.<br><br>Charles Manson is portrayed by Minnesota born actor, Ryan Kiser, who seemed to approach the character in a very serious tone and does a fantastic job conveying the crazy yet brilliant way Charles Manson was able to draw followers into his cult. <br><br>Devanny Pinn co-stars as one of Manson's followers Susan Atkins and gives a chilling performance as her screen presence is freaky. Pinn truly becomes Atkins on screen as the facial reactions make you think this women is completely off her rocker and has no moral compass at all. An overall amazing performance by Pinn.<br><br>\"House of Manson\" does suffer from some technical flaws as the sound isn't completely smoothed and could use some more attention by a sound mixer. The filmmakers even admitted in a Q&amp;A following the world premiere that some of the sound transitions were going to need to be looked at. The film also has a saturated look that doesn't look completely intentional. The image doesn't pop off the screen as some movies do that have a more crisp and sharp look to it.<br><br>Overall, \"House of Manson\" is a great portrayal of the events surrounding the infamous Charles Manson. It doesn't get too crude or violent as previous films about the same subject matter, it takes the source material as it is and conveys the story in a very tasteful matter. With a great cast and direction by Brandon Slagle, \"House of Manson\" is definitely worth checking out when it later finds distribution.","user":"brak014","rank":[23,38]}]