[{"title":"Dan's a dork and cheap painter film doesn't make good effects","rating":1,"date":"30 August 2016","review":"Geesh, where to begin. This was such a mess that I don't even know where to start. The acting wasn't even sub par. The script was laughable. Thriller? I think not. I don't think they have a clue what a thriller is. Dan runs like a girl. Hershey syrup with water doesn't look like blood. Sorry. Need to look that up on the internet to get better tips on what looks like blood in a movie. Flimsy painter cover showed how much they didn't have to spend re: budget. Speaking of budget, this had to have been made for $1,000. or less and that would've been spent on renting the inn. Who's the sketching fool? Callie and her siren song...oh my. I don't think anyone would've ever guessed she wasn't singing. Not. Good heavens, this is a total mess from start to finish. I'll never get this time back so I beseech you not to do the same. Turn away. There is nothing to see here. Really. Nothing. Nada.","user":"reviews1958","rank":[14,21]},{"title":"You broke my heart so I busted your jaw","rating":5,"date":"2 December 2017","review":"Dan's (Matt Silver) cheating wife (Chloe Partridge) gets murdered as Dan gets pipe wrenched to the head. He starts an on-line relationship with Callie (Rikke Leigh) who lives on an island with her two sisters, Lydia (Eloise Oliver) and Tess (Helen Rule). They are part of a group of Sirens who must lure men to their deaths to feast on their hearts. Dan eventually makes it to the island and Callie is a reluctant siren.<br><br>I love it when a film incorporates aspect of classic mythology or Shakespeare. I like it more when it is done well and doesn't have the worst narrator (Felice Gioia) imaginable for the film. Why does he have to have an irritating French accent? The thing that really irks me is they could of had someone else do it as the guy's lips never move. The second option is to leave the monologue out of the production altogether to allow the audience to figure it out for themselves. I enjoy a film when I get to do that myself rather than have the director think I am an idiot who needs to be spoon fed.<br><br>A film that would be far better with a slight tweak. C. Thomas Howell had a small role and Matt Silver needs to learn facial expressions.<br><br>Guide: F-word No sex or nudity.","user":"nogodnomasters","rank":[1,1]},{"title":"I enjoyed it to a point","rating":6,"date":"22 December 2016","review":"Not a blood and gore type of film but overall I enjoyed the movie. I had no problem with most of the acting and 99% of the cast were complete unknowns with C T Howell in there to sell it. The story is an update of the mythological Sirens story. I got the feeling something was cut out of the film because somewhere in the middle of it as the story doesn't make sense. A couple of the characters just seem to vanish without any story and hen later appear dead and it's a bit like a cop out. If you like gory horror then I don't recommend the film because you won't like it but if you like a creepy, atmospheric stuff then it might float your boat. Ignore the user who goes on about it looking shitty, the film looks glossy and the locations are amazing. The acting is actually pretty decent and most of the actors are New Zealand or British. Some people might find it boring in contrast to other films of the same genre. No nudity, no sex, some bad language and unoffensive bloody violence.","user":"ColinRakerSmith","rank":[2,5]}]