[{"title":"Home Alone meets Look Who's Talking and you have Bone Alone(aka Alone for Christmas)","rating":5,"date":"12 January 2014","review":"Comparing briefly what Bone Alone was reminiscent of, it is not as good as the first two Home Alone films or the first Look Who's Talking but is on the same level as Look Who's Talking Too and Home Alone 3 and is better than Home Alone 4(almost anything is in all fairness) and Look Who's Talking Now. I disagree with the first two reviewers, Bone Alone to me wasn't great but it also wasn't that terrible, if anything it was a mixed bag with some good and some bad.<br><br>Good: For a low budget movie, Bone Alone does look surprisingly decent, the scenery is very nice and colourful and the camera work is better than most low-budget movies, not entirely smooth but far from choppy. The soundtrack is bright and breezy, there are some well-engineered if in some cases somewhat familiar slapstick traps, there are some refreshing twists in others, and some effects are alright. The acting is mixed but much more watchable than expected to be, Kevin Sorbo gives the best performance with the best comic timing of the movie. David DeLuise is both sympathetic and amusing. Oh and the dog Bone is just adorable, with Bill Pomeroy doing a competent job as the voice of Bone. Bone Alone is a short movie and whizzes by though with some lulls in the middle.<br><br>Bad: The comic timing is very off in places, too over-earnest and forced. Kim Little, who usually isn't so bad an actress, is disappointingly erratic as the mother and Davis Cleveland is very annoying, if not quite as unwatchably obnoxious like he is on Shake It Up(one of the Disney Channel's worst shows). Not all the effects are particularly good too, some in the trap settings and executions are very slapdash. In regard to the comic timing too, that the dialogue is very corny and awkward does them no favours and the characters you never do engage with, the criminals being among the dumbest committed to movie celluloid. The story being predictable is to be expected but a few scenes in the middle feel drawn out and it is never plausible that Bone can fool the criminals in the way he did. The whole movie is lacking in heart and can feel harmless, also for a movie supposedly set at Christmas there is not much of a sense of the festive spirit.<br><br>All in all, could have been better could have been worse. Mildly watchable family entertainment on the whole. 5/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,12]},{"title":"Better than some actual Home Alone films","rating":8,"date":"4 November 2019","review":"\"Alone for Christmas\" is another film from \"The Asylum.\" They often produce ripoff films of blockbusters or \"mockbusters,\" as they are called. This one fits into that category except the subject of the ripoff is Home Alone rather than their contemporary fair. It's an accomplishment that this film manages to be more enjoyable than some of the Home Alone Films.<br><br>I think to enjoy this film the most you should be between the ages of 7 and 13 and like dogs. The dogs here talk but not like most movie dogs do. Their voice actors speak in an intentionally cheesy manner. They are in on the joke. A dog in the main role is already unbelievable so it doesn't matter what he sounds like. Might as well make one dog sound paranoid and the other like a bored salaryman. One even sounds like an emasculated cuck because he couldn't protect the family.<br><br>Bone, the main dog, defends his homesite from the intruders by setting up elaborate traps. Many of the traps have analogs in some of the Home Alone films. I do appreciate the effort to parody its influence. Bone causes one burglar to become stuck to stuffed animals which is inherently funnier than tar and feathers. Hot objects, soap and scattered toys abound.<br><br>The film's primary set, the house is small enough that we see nearly all of it. The traps span the entirety of the house. Bone is even caught because he miscalculates how one trap will cause a bad guy to eventually rush toward him. I appreciate the attention to scale. When the burglars are under distress there are funny sound effects to accompany the physicality of the trap. For example, the man covered in stuffed animals squeaks whenever he walks.<br><br>Kevin Sorbo makes top billing despite his brief appearance in the film. His character is a parody of Captain Quint from Jaws, and a good one. He enters with authority and his footstep sounds are exaggeratedly heavy. He proceeds to fish for the Bone using an actual fishing rod! He never laughs during any of this even as he recalls the various scars chihuahuas and other tiny dogs have inflicted on his body. The performance is worth the purchase of the DVD alone.<br><br>\"Alone for Christmas\" is a rare surprise. It has every reason to be insufferable. Instead, this clever family Christmas film has enough conviction to be actually funny sometimes while maintaining the cringey genre tropes it must have. I think if I were 8 it would get a perfect score.","user":"doctorsmoothlove","rank":[2,2]},{"title":"Awful","rating":1,"date":"20 December 2013","review":"This is the worst film I've ever seen! I can't believe that this film was made in 2013. The effects is ridiculous. I think that this film budget is 10$... Just look at this film 36:33. It's \"really a REAL car\".. And there are many other fails. So I think this film is BULLSHIT! Maybe the idea of the film is good, but the staging is horrible. When I was watching this movie, for me it was hilarious because of the \"amazing\" effect and disgusting at the same time. For example let's take some shots of the film. Just look at 01:04:27. I really don't think that man can drown in a shower cabin. 01:04:56 - there water looks very \"realistic\". I think that 7 year old child would notice these fails. So in my opinion this film is worthless.","user":"giedriussmm","rank":[10,19]}]