[{"title":"If you love Bill and music ignore the hate(ALSO STAR WARS TRAILER)","rating":8,"date":"23 October 2015","review":"First of I love Bill Murray in just about anything. I often check up on Bill to see what he is taking on next and have looked forward to this ever since i read about it. I enjoy going to the movies with my grandmother for a nice time together and asked her out to spend 2 hours with Bill today. I was not disappointed what so ever. Yes there was more potential with the stellar cast that was put together and the editing may be a bit sloppy but don't let that turn you off. This movie will take you on a journey if you care to let it. Murray once again plays a bitter old timer that turns out to have a heart of gold in the end. If you are sick of this shtick, which i will never get tired of, then don't bother. But this is a social commentary on the oppression of middle eastern women and really the overall need to take a stand for yourself. Bill has the \"golden ears\" and knows talent when he hears it even if he didn't discover it himself. He puts his life on the line for his 20% to support an Afghani girl(one in too many) with a talent she isn't allowed to share. Once this comes into play the movie blossoms into beauty. While it isn't lol funny, which i don't understand why people come to expect that from William these days, it is very sweet and heartfelt. The jokes are there if you care to listen and not sit on a pedestal. I get if you don't want to be ripped off for the price of admission for this movie but don't s**t on it and wait to rent it. It is still far better than 99% of the garbage that comes out on a weekly basis. I also enjoy casually questioning people as we leave the theater as to how they enjoyed the film and ran into a refugee from Afghanistan who really enjoyed this picture and the message that it sent. Idk I'm half drunk and rambling and wrote a terrible first review but Eff off film snobs go judge the globes and shove them where the sun don't shine :) peace out imdbers","user":"dalegribz","rank":[63,93]},{"title":"Enjoyable non-blockbuster","rating":7,"date":"24 October 2015","review":"This movie will be horrible for people who expect every movie to be like Independence Day, The Martian and Star Wars. This isn't a block buster. It's a simple movie about a simple story with a raw cut feel. There are no fiery explosions. It's an interesting story with characters that are cliché but real cliché. <br><br>Bill Murray gave a good performance and it wasn't phoned in. I enjoyed it. It felt to me like a 2nd (and better) attempt at a Lost in Translation type story. My guess is that most people will want to catch this on Netflix or On-Demand, which is fine. There is no particular reason to see this on the big screen, but it is a decent film to watch.","user":"tonybluegoat","rank":[50,75]},{"title":"Funny, transporting experience","rating":8,"date":"11 November 2015","review":"A washed up talent manager arrives in Kabul to do a tour but ends up discovering a talented Afghan singer and enters her in a singing competition. It's a comedy and keeps the tone throughout even though the background is serious. The flight to and arrival in Kabul is quite laugh out loud. Lots of culture clash and war humor about the conditions in Kabul. Zooey Deschanel as the singer and Taylor Kinney as a soldier deliver some funny lines. This is a Bill Murray role and he keeps the comic tone and a droll vibe going. Kate Hudson looks pretty if unlikely as the hooker with the heart of gold. The young Afghan singer played by a Palestinian actress is quite lovely and sings well.<br><br>I don't understand the negativity. This is an insightful and very different comedy and a rare comic look into Afghanistan. The on location filming in Morocco is quite atmospheric. Worth a watch.","user":"phd_travel","rank":[20,28]}]