[{"title":"Fun Scottish/Irish horror co-production","rating":6,"date":"20 June 2014","review":"A mysterious man hands himself into a police station in small town one night. It soon appears that he seems to know about the inner demons of everyone there, the cops and prisoners alike. All of these individuals have dark secrets it seems and the mystery man is the catalyst that brings them to the fore and drives them to further depravity and violence.<br><br>Let Us Prey is one of a small group of horror films set in Scotland. As it happens, two of its stars featured prominently in a couple of the other most notable Scottish set horrors of the last few years, namely Liam Cunningham who appeared in Dog Soldiers and Hanna Stanbridge so impressive as one of the main characters in The Outcast. In this one Cunningham has the central role of the mysterious demonic stranger, while Stanbridge gets to sink her teeth into a role of a female cop with a penchant for violence. She is not the only strong female character here though; Pollyanna McIntosh plays the other policewoman and is in fact the lead character to all intents and purposes. It is refreshing to have a genre picture give women more central roles; I have no idea why it doesn't happen more often. As it is McIntosh's cop is on her first night at this remote police station, the very night when things go horribly wrong. In this respect, the influence of John Carpenter's Assault on Precinct 13 is pretty obvious. In addition, the electronic soundtrack used here sounds very Carpenteresque too, which was also nice.<br><br>It's a pretty modest production but it makes the most of what it has. The cast all acquit themselves very well and make the most of their characters. The direction is pacey and nicely stylised in places. I particularly liked the opening credit sequence with images of giant waves and sinister ravens. It maybe could be argued that the film doesn't perhaps ultimately go into as interesting places as it promises it might and it does get a little generic towards the end. But it is still different enough to ensure it is interesting. It also has the distinction of having a central demonic villain who is not one dimensionally evil; he's just a guy with a job to do.","user":"Red-Barracuda","rank":[49,65]},{"title":"Nice Surprise Hit of the Festival","rating":8,"date":"27 October 2014","review":"When director Brian O'Malley introduced his new film, Let Us Prey, via a prerecording in front of the Toronto After Dark Film Festival he informed us that his intention was to make a timeless horror classic. To accomplish this, he set on out to deliver a film that could not be dated (watching Let Us Prey ten years from now and there is nothing in the fashion, look or feel of the film that would immediately reference 2014) and that had a synthesizer styled score reminiscent of the great John Carpenter films of the 1970's and 80's. Check and check.<br><br>Let Us Prey stars Liam Cunningham (Game of Thrones) as Six, a mysterious drifter who is hit by a vehicle driven by Caesar (Brian Vernel) on a quiet town road. Casear is immediately taken into custody by first-day-on-the-job Constable Rachel Heggie (Pollyanna McIntosh), but Cunningham's Six character cryptically disappears. It is while at the police station we are introduced to the remainder of the cast which includes a Sargent, two Constables that are lustfully engaged, a wife beating prisoner and a doctor who is called to assist when Six suddenly appears at the front door of the station.<br><br>The veteran Constables and Sargent do not immediately warm up to the by-the-book newbie in Rachel, but their personal feelings towards her routine are quickly swept to the side once Six begins to instigate mayhem in the prison taking over the minds and souls of all those with a dark past to hide. And this is when the fun really starts.<br><br>Each character shows a history of violence in their backstories from the simple (hit and run) to the extreme (mass murderer) and when a prior transgression is revealed, Six is there to ensure their life pays for their wrongdoing.<br><br>With a backdrop of a fantastic musical score (as promised) there are fights, shootings, beatings, murders and attempted murders as things at the station escalate quickly and deadly for all those involved.<br><br>Cunningham is a standout and plays the mysterious Six with devilish glee. The film hinges on Cunningham's character and the well-trained thespian delivers the goods with a Clint Eastwood cool. Pollyanna McIntosh is equal to the task as the freshman fish-out-of-water new Constable. She is equally beautiful and tough and McIntosh walks this line with the ease of a veteran.<br><br>The story goes a bit off the rails towards the end as some of the character's revealed background stories and subsequent actions are a bit 'out there'. But it is a means to an end to heighten the violence and give the audience the good time expected from the action/horror intention.<br><br>Let Us Prey was a surprise delight and the perfect way to begin winding down the Toronto After Dark Film Festival. It was violent and fun and the ending opened the door to a multitude of possibilities and, hopefully, sequels.<br><br>www.killerreviews.com","user":"gregsrants","rank":[47,64]},{"title":"Wicked Fun","rating":7,"date":"26 March 2015","review":"Let Us Prey features a police station in a ghost town. Literally. You cannot find any people in this town making you wonder what these idiots are policing. Regardless, a stranger played by Liam Cunningham (Ser Davos from Game of Thrones) appears in the police station and sets off a chain of events which results in everyone in the station confronting/unleashing (mostly the latter) their inner demons.<br><br>And boy are those demons nasty or what! The film is not that scary but it is quite fun and has a good sense of humor. It also has good performances from Cunningham and Pollyanna McIntosh as a likable rookie named Rachel. Also in the mix are a gallery of interesting, if not likable characters such as a really creepy sergeant, his two vengeful subordinates alongside Rachel, a (not so) slightly unstable doctor, a grammar Nazi wife-beater and a drunk-driving teen.<br><br>Overall, the movie is quite fun with a delightfully nutty climax. The 5.9 rating is a bit too low. Do give it a look!","user":"jackthehack","rank":[33,46]}]