[{"title":"See No Evil 2 has nothing new or surprising to be added to the genre and not enough cheesy fun comparing to the first film // instagram: moviesmaniax","rating":5,"date":"19 February 2015","review":"From the twisted mind of director The Soska Sisters comes a disappointing sequel that lost all the cheesy bloody fun of the first film. See No Evil 2 is such a typically mediocre horror film where victims get killed off one by one with not much of a surprise and coming from such potentially imaginative director (seeing from their previous works in American Mary and T segment from ABCs Of Death 2), it's quite a huge disappointment here. The GORES here are also really let down comparing to how much more gleefully bloody and nastier the first film was, but it's still moderately bloody nonetheless. The SCARE here is mostly jumpy one as our Jacob Goodnight here lacks the personality that can deliver the suspense and just looks pathetic instead. However, thanks to a cheesily tempting performance from Katharine Isabelle (American Mary) that's at least FUN to watch throughout the film. Other than that, See No Evil 2 has nothing new or surprising to be added to the genre and not enough gores or violence to even surpass the cheesy fun of the first film. &gt;&gt;C&lt;&lt;","user":"moviesmaniax","rank":[9,10]},{"title":"Awful movie","rating":2,"date":"26 October 2014","review":"The movie is boring. There is tension in the entire film, but this is more of a sci-fi genre than horror. I was disappointed by the first part of the film in 2006, but after all these years I thought that we are waiting for something better. I was wrong.Throughout the film the main character succeeds in something that is impossible to time. The whole time he seemed to read the thoughts of others, because he knows exactly which doors should be closed, in which the room to wait. Better knowledge of the entire building and all the rooms in it than the workers who work there. I am disappointed.If you want to see the horrible details I assume that you will be satisfied, but it is all that is interesting in this movie.","user":"enisa-lokic","rank":[17,28]},{"title":"Who Is the Most Stupid Character?","rating":2,"date":"21 November 2014","review":"After the tragedy at the Blackwell Hotel, the bodies of Jacob Goodnight (Glenn 'Kane' Jacobs) and nine of his victims are transported late night to the city morgue. The EMTs try unsuccessfully to revive Jacob. The crippled Holden (Michael Eklund), Seth (Kaj-Erik Eriksen) and Amy (Danielle Harris) are working in the graveyard shift and Seth and Amy bring Jacob's corpse to the scale room. But Amy's brother Will (Greyston Holt) and her friends Kayla (Chelan Simmons), Tamara (Katharine Isabelle) and her boyfriend Carter (Lee Majdoub) come to the morgue to celebrate her birthday. The weird Tamara goes with Carter to the scale room where Jacob is to have sex with her boyfriend. Out of the blue, the serial-killer awakes in the beginning of a night of terror.<br><br>\"See no Evil 2\" is an awful slash movie with a story full of clichés, silly situations and moronic characters. Jacob provokes a blackout in the morgue, but it seems that there is axe but no fire alarm in a city morgue with flammable liquids. The greatest question in this flick is who the most stupid character is. In the beginning, it seems to be the awful Tamara but actually Amy is. Her dreadful attitude exposing the hideout of Will and she, or her decision of facing the notorious serial- killer with an ax are laughable. In the end, this slasher is a forgettable garbage. My vote is two.<br><br>Title (Brazil): \"Noite de Terror 2\" (\"Night of Terror 2\")","user":"claudio_carvalho","rank":[17,30]}]