[{"title":"The acting is phenomenal!","rating":8,"date":"22 February 2020","review":"Marvelous film. Captivating plot filled with mountains of emotions. Brie Larson's performance in this film was breathtaking. Her emotions, facial expressions and tones were perfectly done, which is one of the main reasons why this was such an incredible film. Jacob Tremblay's performance was also amazing.","user":"MR_Heraclius","rank":[46,49]},{"title":"Imagine yourself as a 5 year old child discovering for the first time a brand new world exists outside of your room","rating":10,"date":"20 September 2015","review":"SPOILER: At the 2015 Toronto International Film Festival the film \"ROOM\" won the People's Choice Award today. It tells a story of a young woman and her five year old son who have been held in captivity in a confined and windowless living space for six years. Brie Larson stars as Ma and her son named Jack is played by Jacob Tremblay who is so believable that you will feel empathetic towards their captivity but relief as to how Ma convinces Jack that their little world is real and is wonderful. <br><br>As Jack grows he starts to ask questions about their isolated lifestyle and we the audience anticipate that Ma must try and escape with young Jack but how?<br><br>The story draws similarities to the actual events that were Jaycee Lee Dugard's true life story which occurred on June 10, 1991, in South Lake Tahoe, California. Dugard was 11 years old at the time she was abducted from a street while she was walking from home to a school bus stop and she was held captive for the next 18 years in a concealed back yard in a make shift shed. There is also some resemblance to the kidnapping of Amanda Berry who had a child fathered by her kidnapper Ariel Castro. This film was titled Cleveland Abduction and it was released in 2015. It tells the true story of three girls who were held captive for over 10 years by Ariel Castro in his home with no one aware how close the girls were to their own homes and families.<br><br>The film Room focuses more on Jack and Ma's awkward adjustment to life outside of their room which was their entire world for the past six years. There is a strong supporting cast including performances such as Joan Allen's role as Jack's loving Grandma and the ever convincing all-star William H Macy as a resistant Grandpa who is having difficulty accepting that his daughter is raising her rapist's son. <br><br>There are some scenes that are so heartwarming that it will be difficult not to find yourself becoming emotionally involved. In one particular very touching and loving scene, Jack asks his Grandma to cut his long hair so that the strength that he thinks that his shoulder length hair possesses can be transferred over to his sick Ma so she can return home from the hospital. Jack who understandably is initially withdrawn from anyone other than his Ma simply tells his Grandma after she washes and cuts his hair that he loves her. This loving scene between Jack and his Grandma will stay with me forever. <br><br>Jack and Ma's is a story of isolation, fear, hopelessness versus hope and most importantly a film about redemption and the family bond. Room is deserving of an Oscar nomination for best picture and nominations in a few other categories as well such as best actress, best actor and best director. I give the film a 9.5 out of 10 rating. This film is terrific!!","user":"Ed-Shullivan","rank":[284,362]},{"title":"A brilliant movie, but painful to watch","rating":10,"date":"14 December 2015","review":"Room (2015/I) was directed by Lenny Abrahamson. It stars Jacob Tremblay as Jack and Brie Larson as his mother (\"Ma\")<br><br>The situation becomes very clear early in the film. Jack and his mother are held captive by a man who has kidnapped her, raped her, impregnated her, and uses her as his sexual slave. Jack and his mother have lived in a small, locked shed, which they call \"Room.\" Jack's mother has lived in \"Room\" since she was abducted seven years earlier. Jack has lived there for all of his life--five years.<br><br>By incredible ingenuity, motivated by love, Ma has kept Jack from realizing the horrors of their situation. It's hard to believe that anyone could be so motivated and capable, allowing the boy to believe that his situation is normal, but it works in the film and you accept it.<br><br>What happens next is pretty well known, but I won't go into it because it might decrease your enjoyment of the movie. It's dramatic, frightening, and, heart-wrenching, all at the same time.<br><br>Brie Larson does a wonderful job as the mother, and Jacob Tremblay has to be the best child actor we have. He is absolutely brilliant. Director Abrahamson must be an extremely talented man to draw two such great performances from his actors.<br><br>This is a must-see film, but it's not easy to watch. Even though Room wasn't based on any specific incident, we all know of cases of warped men who have kidnapped and enslaved women. It's hard to think about the lives of those women without becoming depressed. <br><br>We saw the film at the excellent Little Theatre in Rochester, NY. Given the claustrophobic atmosphere of the movie, it will work on the small screen as well. Seek it out and watch, but prepare yourself mentally before you begin.","user":"Red-125","rank":[137,185]}]