[{"title":"I liked it","rating":7,"date":"16 November 2016","review":"I really want to draw attention to the title of the review above. I'm sure many die-hard potterheads would want every review on this site to score this movie 10/10 and say it is a masterpiece. Well I can't do that, since that isn't my honest opinion. What I can say though is that Fantastic Beasts and Where to Find Them is a thoroughly entertaining affair that is well worth a watch, especially if you're a fan of J.K. Rowling's magical world. <br><br>For starters the cast was great. Eddie Redmayne feels perfectly cast in main role as Newt Scamander. A very awkward and introverted person who prefers the company of animals rather than humans. He has the quirkyness down to a tee. I also really liked the muggle (or no-maj as the Americans call him) played by Dan Fogler. How he reacts to the whole wizarding world and the events that happen around him is actually really funny. I also thought Katherine Waterstone and Alison Sodul did great playing two sisters who wind up roped in to the whole adventure. <br><br>The creatures are the best part of the entire movie by far. They CGI on them looks kind of fake, but it's more than made up for by the concepts alone. Almost all of them have some clever twerk that keep them from feeling generic and they're all filled with personality. The sequences when they're catching these creatures are all really fun to watch. <br><br>However there are some problems with this movie. For one it has way too many side characters. A lot of them feel completely underdeveloped and add basically nothing to the overall story (*cough* Jon Voight *cough*). There's also a magical threat that becomes more central towards the end but it honestly kind of left me scratching my head. I just wasn't that engaged in that part of the story to be honest. <br><br>Still these problems are not enough to ruin the movie by any means. It's filled with wonder and creativity and being back in the world of witchcraft and wizardry is worth the price of admission alone. I enjoyed the characters, the humour and the creatures a whole lot. I also want to give J.K. Rowling huge credit for not just rehashing the Harry Potter story again. This is fresh and new and while it isn't flawless by any means it's certainly entertaining!","user":"hcarljohan","rank":[303,447]},{"title":"What a letdown","rating":4,"date":"18 November 2016","review":"It's a letdown. The fun and charming bits of Harry Potter were left out of this film. I like J.K. Rowling's work immensely, so that's hard to say.<br><br>Plot-wise, things are a mess. Newt and his luggage full of magical creatures are a side plot to the important things going on. The real story is that an auror in New York is searching for a powerful and dangerous magical force that manifests within a teenager. His plan: turn the destructive energy the teenager carries into a weapon, I assume. Enter Newt Scamander, who is trying to transport a thunderbird(?) to Arizona for release back into the wild. Some of Newt's other creatures escape in New York, and he has to round them up, all while becoming entangled with the auror and his teenage target.<br><br>The plot sounds sort of okay, but it's not well integrated. The characters don't add up to much of anything, either. The sidekick baker is fairly likable, though, along with his brewing romance with Queenie. Newt's a bit thin as a character. Eddie Redmayne's dialog also tended to come out mumbled, which made him hard to understand at times. Throw in a few acronyms and oddball words like MACUSA, and that makes for more confusion.<br><br>Altogether, the film needed more work to tighten the story lines and make Fantastic Beasts a story focused on Newt and his menagerie, instead of what we ended up with.","user":"heatsink98","rank":[408,625]},{"title":"SFX pretty good, characters & pacing lacking.","rating":6,"date":"19 December 2016","review":"It's OK, I suppose.<br><br>Good parts: Period costumes &amp; sets were beautiful. Special effects were (mostly) very good, and the Fantastic Beasts were individually great fun.<br><br>So-so parts: The acting was only OK. Newt (Eddie Redmayne) in particular left me dissatisfied. Yes he's playing an introverted character, but I saw no reason for the bond he seemed to build with Tina. The MACUSA wizards &amp; witches were extremely underdeveloped, including the President. Their hot-and-cold treatment of Tina for her interruptions made no sense to me either.<br><br>Poor: The editing seemed off to me, in a way I haven't noticed since The Chamber of Secrets. --- awkward pauses littered the film, robbing it of its momentum. Newt's interaction with some of the larger beasts didn't look realistic (e.g. his stroking the Thunderbird's neck). And I personally dislike FX-heavy movies where the Big Bad is some amorphous cloud (not as bad as Green Lantern, but pretty bad).<br><br>Final thought: why do so many large beasts have bird's heads? This seems to be a thing with Rowling ...","user":"beany_kelly","rank":[49,69]}]