[{"title":"Quite a solid B-movie","rating":8,"date":"14 April 2014","review":"I didn't expect to have such a good time with Ice Soldiers. The plot sounded like a hybrid between The Thing and Frankenstein, and I expected it to be a piece of crap, but it ended up being a very competent B-movie with good direction, solid performances and a good dominion over the suspense. Dominic Purcell makes a credible work in the leading role, expressing his character's internal turbulence with his body language and his intense looks. The rest of the cast includes some famous faces from the fantastic genre (Michael Ironside, Camille Sullivan) and other ones which are unknown (like the trio of Russian super-soldiers), but they all bring conviction and enthusiasm to their characters. The special effects are sporadic and not very flamboyant; after all, this isn't a gory film and it didn't require any spectacular moments... just the tension of the \"human hunt\" in the frozen Arctic tundra, accentuated by occasional fights and a few explosions to season the recipe. I'm glad to say that that was enough for me to enjoy this amusing movie. On the negative side, the ending is kinda anti-climatic, and there are a few absurd scenes. But, for the rest, I liked Ice Soldiers pretty much, and I think it deserves a recommendation, specially to the ones who like fantastic cinema.","user":"Argemaluco","rank":[10,11]},{"title":"Better than I thought","rating":6,"date":"21 September 2016","review":"I recorded this movie on my PVR, thinking it was going to be just another cheapo actioner imitating Asylum's garbage. Planned to fast-forward through the painfully boring parts, and stop by only for the delightfully stupid or violent (nudity was also promised by the warnings, but it turned out to be not female :)).<br><br>...and I ended up watching it from beginning to end. This movie actually has an interesting SF and Cold War premise; several great veterans of acting (Michael Ironside and Adam Beach) and performers I have never heard of before (Camille Sullivan, and Gabriel Hogan whose evil perfection is genuinely captivating), and they all seem to fill out their roles comfortably and believably. The actors manage to make their characters interesting enough that you want to listen to what they say, however banal that sometimes turns out to be. The writer(s) also tried to drag a bit of science and historical 'authenticity' into their story, and the dialogue is pretty decent (sometimes even good) most of the time. <br><br>On top of all that, the sets are solid (if indubitably inexpensive), there is an excellent use of real life locations, and the effects range from competent to good. This film is not a shoot'em-up actioner, but the action it does have (and when it has it) seems well-paced, and integral to the story. <br><br>Low-budget, frequently flawed, and somewhat cliché'd (I thought the 'big reveal' at the end was obvious after the first 5 minutes of the film), it is mediocre at best. Considering how many TRULY horrible movies you are flooded with on a daily basis, though, 'Ice Soldiers' is definitely not a bad movie; and it tries in every area - and really hard - not to go out of its way to offend your intelligence. Plus, this is one of perhaps only two or three movies in which Dominic Purcell is actually perfect for the character he plays!","user":"dingo865","rank":[6,6]},{"title":"Decent action mystery that wasted an opportunity","rating":6,"date":"9 November 2014","review":"During the Cuban missile crisis a plane crashes in the Canadian arctic. Folks from a nearby station arrive and rescue 3 survivors. They are all blonde and tall. The physician there is a girl and she's attracted to the sole conscious survivor. Next, he breaks free and kills everything in sight.<br><br>50 years later an oil expedition arrive to the area. Part of it is a scientist named Malraux and his Russian sidekick. In charge of the oil exploration is some mean lady called Frazier. Some paramilitary team lead by Col. Trump is also involved and they mostly join Malraux, whose goal is to find the 3 guys from the intro. They could be the result of a Nazi experiment or just Russian soldiers trying to take over NY. He and the paramilitary team set up camp near a mountain. When bad weather threatens to end the operation, Malraux explores a cave and finds the three bodies. They are transported to the station and put on life support. Then their hearth start beating again. When Malraux tries to kill these guys, he's placed in custody. Then the guys wake up and ravage the camp.<br><br>Malraux survives with an injured leg and starts limping after the three guys. He runs into an Indian who offers to take him to the next town. On the way they stop at a camp where the three guys have just killed everyone. Malraux and the Indian manage to survive and make it to the town where the Russians are enjoying drinks and strippers. That's when Maulraux confronts the guys and we learn some secrets.<br><br>Ice Soldiers starts out pretty well. The part at the exploration camp is pretty good. Things start going downhill when Malraux goes ofter those guys. Direction is pretty good. Acting is also good. Purcell, Ironside, Beach, Branzea, Sullivan are all solid. The problem is with the dialogue of the script. Very little is said and when something is said it's either confrontational, or unclear. The overall story has some interesting ideas. But it gives up these ideas or doesn't explore them to turn into an ordinary chase/action movie. Several things that happen are completely unbelievable and should have been handled better. Had this movie stayed at the camp for the entire length of it, it would have turned out better. Still, it's different and enjoyable.","user":"TdSmth5","rank":[6,6]}]