[{"title":"Tailing it like it is, this flick is adorable, with big laughs for your loved ones","rating":8,"date":"3 November 2014","review":"Eddie (Jonathan Silverman, reprising a role from an earlier Beethoven flick), is the trainer to a big Hollywood star, Beethoven the St. Bernard. At the moment, they are shooting a film called Spy Dog. But, at the end of a critical scene, which has the dog racing from a supposedly secure museum, the big doggie won't make the last jump. After 42 takes, the director chews out Eddie and the producer (Morgan Fairchild) on his way to the coffee machine. Shortly after, Eddie and Beethoven get fired and send away in a rental car. How dare they? But, Eddie concedes something is amiss with his talented canine. One the way back home to Hollywood, the car breaks down in a most unusual place. On the coast, the town is a planned community to celebrate its heritage as a place where a pirate named O'Malley hung out. There is a museum, a bed and breakfast, and other touristy things. Unfortunately, there is only one small mechanic shop, run by a harried owner, Phil (Dave DeLuise). Needing parts, the only recourse Eddie has is to stay at the B and B. At a critical moment, Ed sees the owner, Grace (Jayne Eastwood) booting out a magician with a rabbit while pointing to the sign that says NO PETS. So, first, Beethoven has to be snuck in after paying for the night. Happily, the innkeeper has a beautiful daughter, Anne (Kristy Swanson) and a smart preteen grandson Sam (Bretton Manley) who make friends with Eddie. Anne runs the town's museum, where maps claim to show a way to a treasure, if one can pick the right one. Sam is avid about finding the loot, for the town is about to be taken over by an insufferable German financier, if they don't. But, alas, he has tried many times before and Anne doesn't want to encourage his future hunts. Naturally, these two discover our Beethoven, although they keep the secret from their relative. Beethoven has perked up, too, from his contact with the boy. With Eddie's car NOT done the next day and his interest in Anne growing, can this animal trainer help find the treasure with a set of fresh eyes? Or maybe Beethoven's fresh NOSE can help in the search? Tailing like it is, this family film is adorable. Silverman is a great slapstick comedian with handsome looks and a sunny attitude. Watching him fall in a small boat full of fish and shout Holy Mackerel is very funny! Swanson is likewise beautiful and talented while Manley, Eastwood, DeLuise, and all of the other actors are a pleasure to watch. Add on the darling doggie Beethoven and who can resist the cast? Then, the coastal setting is lovely while the zany plot, full of pirates and buried treasure, will attract all kinds of fans to a \"hot theme\". The movie even borrows a bit from the Goonies, which should please viewers as well. So, ho, ho, ho, and a bottle of, er, soda, with popcorn, plus this winner makes a great evening of fun.","user":"inkblot11","rank":[6,19]},{"title":"no treasure","rating":1,"date":"11 September 2015","review":"When I found this on a dusty VHS tape in a burnt-out Ford Pinto in front of Kmart, I was excited. A dog? Sure! A dog wearing a pirate costume? Oh boy! A dog in a pirate costume in a pile of treasure? Woah! I'm there! So you can imagine my disappointment when SPOILER ALERT, after devoting my whole afternoon to this film, I realized that there wasn't a singe piece of treasure in the whole thing. The cover of the VHS clearly indicated that there would be at least some treasure in the film, maybe even a whole chest's worth. Alas, there was none. If I ever see Ron Oliver on the street, I'm not going to do anything, because he is and will forever be a terrible director of no consequence to anyone, and will never have any notoriety beyond the three and a half hour lie that is Beethoven's Treasure Tail. One star.","user":"mradamrudy","rank":[3,8]}]