[{"title":"Nothing different,same old","rating":1,"date":"20 December 2013","review":"terrible music, same incredibly unlikeable singer, same poor film-making. This movie is just another way to get him more money and to keep people talking about him.<br><br>Obviously if you don't like him, like most people, you won't like this movie. My \"EX\"-girlfriend was begging me to see this with her and so I gave in thinking it can't be too bad. Maybe it'll be an interesting look into his life or even 'so bad it's funny'. But no, this has to be the most boring, stupid, unbearable film I've seen. The single positive thing about me seeing it is that I can legitimately review the movie.<br><br>Seriously, that's it.<br><br>If you love him, you'll love this. If your indifferent to him, or worse........ Don't give him more money. I highly regret paying to see this. DO NOT SEE THIS IN THE THEATER UNLESS YOU'RE A FAN. Maybe if non-fans stop talking about him he'll go away sooner than later. He has an inflated ego and is desperate to stay in the public eye, that's obvious by this. <br><br>Too many annoying fans in the theater. Sadly, there are enough that this'll make a profit like the first and he will not go away for a long time. <br><br>I'm surprised that so many other musicians(who all have more talent than him) showed up in the movie. Is Justin Bieber actually this popular among grown men?<br><br>I either don't care for or absolutely hate his songs. So one reason it was unbearable was the fact that his songs were playing in the background nearly the entire time. That may make me a little biased. Perhaps if you find his music fine(but detest him / his fame) than you might not completely hate the movie.<br><br>But I'd wait for it to come out on DVD and check it out for the library. The movie is just footage from his concerts, crazy fans, people talking about how great he is, and such. From what I've heard of the first movie, the main difference is new music and more mature incidents he'd gotten himself into.<br><br>Incredibly unlikeable star IMO, mostly caused by him being incredibly famous and having crazy fans for an OK singer at best. I don't know what it is about him that got him so famous. There are thousands better musicians/artists who barely get by while he makes millions for impressionable tweens who will pay even in the hundreds of $$ just to see their \"god\" in person.","user":"dyed_red","rank":[204,267]},{"title":"Kids, wake up!","rating":1,"date":"24 December 2013","review":"It still amazes me how successful this broad has become. Let's face it, his talent is very limited. His voice is very common and all his songs suck. He has no charisma and he knows it. So what does he do? He tries to cover up by putting up a pretty boy front which has fooled the prepubescent community. His popularity is gradually diminishing as his prepubescent fans grow up and realize how silly they were. I wonder, when Bieber's time under the spotlight is up, would his name echo in eternity and make the history books? Will people be talking about him in the same breath as Michael Jackson or Elvis Presley? Absolutely not. He did not revolutionize singing or dancing in any way. Bieber is a waste of time, we should brush him aside and pave the way for more talented artists so we can be spoiled by the MJs and Elvises again. Kids, please don't waste your parents money on his concert tickets, albums or any Bieber merchandise. Don't you think it's ridiculous that talentless broads like Bieber can enjoy the same fame and success as those legends that I mentioned earlier? Please stop being the catalyst behind the death of good music.","user":"scottygoldie","rank":[155,209]},{"title":"A Nomination? For What? The WORST Documentary Alive?","rating":1,"date":"29 January 2014","review":"I'm sorry but I hate Justin Bieber and everything he stands for. I don't see why many people many so many TV movies or documentaries of him and his life. He is way too young and too talentless that he doesn't deserve that much fortune, but Jon M. Chu, a big fan of Bieber, wanted to make his fame grow bigger. Like we want to see this douche again. He is talentless and his songs still don't improve. The editing in this documentary is very amateurish and seeing a hour with this kid is like pain to the balls. I can't write a long review for this movie because I actually had the balls to walk out of the theater cause the film really was that bad. 1/5","user":"LegionOfRock","rank":[63,87]}]