[{"title":"A family fright fest...","rating":4,"date":"6 September 2014","review":"\"Mostly Ghostly: Have You Met My Ghoulfriend\" is indeed a family movie in every sense of the word, and just with the right pinch of spooky thrown into it as you always get with the material from R.L. Stine.<br><br>The story is about Max, who is friends with two ghosts, who has to thwart the evil plans of a ghoul that dwell in the local cemetery. But things are not all that easy, especially when there is a trickster ghoulish spirit on the prowl with the ability to inhabit the bodies of the living.<br><br>\"Mostly Ghostly: Have You Met My Ghoulfriend\" is a good movie for a Halloween event with the entire family, especially if there are youngster in the group, because this movie has just a little bit of something for just everyone.<br><br>As for the effects, well they were doing alright and serving the purpose they were intended for. Just don't expect to be dazzled and blown away by a multi-million dollar CGI budget here.<br><br>The people on the cast list were doing good jobs with their given roles, and that added to the overall enjoyment of the entire movie.<br><br>If you enjoy R.L. Stine's books, then you would also enjoy this movie.","user":"paul_haakonsen","rank":[12,18]},{"title":"Good movie, bad casting","rating":5,"date":"15 October 2014","review":"I'm going to start out by saying that I did not hate this movie, I actually enjoyed it. I personally loved the first one so much that I watched it religiously for about three months. The first one had by far the best cast of the two movies (Madison Pettis, Luke Benward, Sterling Beaumon, David DeLuise, and Kim Rhodes)where as the second one had only had one of the original cast mates (Madison Pettis)which is odd for a sequel to a movie to that came out six years prior. I really only had a problem with the casting and wish that they would have used some more of the original cast or people who looked similar in features not people that look the complete opposite of the originals. Also, I wish the would have came out with it a little soon then they did just because of the time frame between the two books is supposed to be one year and they came out with sequel six years later... Maybe if they would have filmed it sooner the cast wouldn't have grown up so much and they could have kept more them. Other than those two things I would have gave the movie a ten because it really does have an amazing story plot and concept. I suggest watching it if you want to know what happened after the first one ended..","user":"cynthiaholmes13","rank":[2,4]},{"title":"I HAVE A LIFE","rating":8,"date":"28 May 2019","review":"This is a non-scary Halloween story for the younger crowd...8-11? Max (Ryan Ochoa) is the main character who has come into possession of a magical ring, one that keeps the demon-ghost Phears (Charlie Hewson) in check. Phears plans on getting the ring off Max's finger and lead an army of the undead who will mostly likely want to visit old friends instead of conquering the world.<br><br>Max is aided by two teen ghosts and has a love interest in Cammy (Bella Thorne) who ignores him at the beginning of the film.<br><br>The film opens with a whimsical sound track and ends like a Bollywood production. Kids will enjoy this film while most adults will find it tolerable. The plot points were a bit confusing and took a lengthy explanation by Phears. Humor includes slap stick, fart humor, and some puns.<br><br>Joan Rivers has an early brief appearance.<br><br>For a female lead try \"Girl vs Monster.\"","user":"nogodnomasters","rank":[0,0]}]