[{"title":"Different kind of ...","rating":8,"date":"12 February 2018","review":"When you read Snowflake (english title), you may think this is about politics, but it has absolutely nothing to do with that. So in case you were thinking in that direction, forget about it. I actually don't know if there could've been a different title for this movie. It is really something crazy and almost unique. At least for Germany and it's filmmaking culture.<br><br>This really goes full throttle when it comes to crazy. It takes one idea and runs with it. No prisoners taken. That means it may have issues from time to time and the movie feels like it's done in chapters (when you realize it was shot over a period of 4 years, mostly on weekends, due to money/funding problems, it makes sense) ... if you don't mind that and like movies to take it to the next level, break the 4th wall (and any other walls nearby with it), then you could do a lot worse. This is fun and silly, but especially driven to be different. And it very much succeeds in that regard. If you have an affinity for low budget movies with hillarios ideas ... come on in and enjoy the show!","user":"kosmasp","rank":[13,14]},{"title":"A radical, smart, action packed and hilarious thrill ride for Quentin Tarantino & Kevin Smith fans alike - from Germany!","rating":10,"date":"19 September 2017","review":"I have waited way too long and have seen way too many miserable German films - but \"Snowflake\" is my reward, the pot of gold at the end of a rainbow of shite. <br><br>Not since \"Run, Lola, run\" has a film blended action, humor, violence and smart dialog so perfectly. It's also a brilliant meditation on the nature of movie making and determinism/free will. <br><br>It's nigh unbelievable that - due to a lack of studio or network support - this was actually filmed over the course of four years (mostly on weekends). It looks absolutely polished, never openly betraying its very limited budget. <br><br>Is it flawless? Almost. Sure, the final act could've done with some minor trimming, the title is a bit bland and the sections that were shot in English are a bit more awkward than the rest - but these are minor quibbles. <br><br>Watch it in German, if you can - watch it with subtitles, if you must. But watch it. You'll have one hell of a time.","user":"torsten-dewi-1","rank":[21,25]},{"title":"Thank you for this Movie","rating":9,"date":"23 December 2018","review":"I have to say, although i'm German, that our movie industry sucks...\nWe are producing one unfunny comedy with Schweiger/Schweighöfer after the other and our glory days in filmmaking are long gone, nearly forgotten by some... but then there was Schneeflöckchen a brillant, funny and bloody movie from some friends who wanted to make something different... and they totally nailed it.<br><br>Well, the story was seen before but not with those twists and strange characters and on top of that, it maybe started a new wave of cinema for Germany, but we will see about that in the future. All i have to say is, that this is a fantadtic movie with a brillant ending and a bright future to look forward to.<br><br>Special thanks to Capelight, who made a cinema run for the movie possible...<br><br>9/10","user":"loewleon","rank":[5,5]}]