[{"title":"Romans, faith, and reason.","rating":8,"date":"20 February 2016","review":"With nothing else to see, I went, somewhat reluctantly, to see the new Biblically inspired, movie, 'Risen' (which, as you can see, got good reviews on IMDb). Ostensibly about the crucifixion and resurrection of Christ, it's more a logical investigation imaginatively laid atop a history lesson, a key miracle of the New Testament, and a logical examination of rational thought challenged by inexplicable events. Told from the perspective of a Roman Tribune sent to investigate how Jesus' physical body disappeared from it's tomb, it's a story well told, seems historically authentic, and I (a lapsed Catholic/agnostic/skeptic) recommend it highly. It was also an interesting exercise in memory, as I strained to remember what I remember from hours of Catechism, and yearly celebrations of Good Friday, Easter, and the Feast of the Assumption...which turned out to be...not much.<br><br>There are parts which recall 'Life of Brian', it's a little bit long, the disciples resemble the inhabitants of the hippie commune in 'Easy Rider', Bartholomew is completely over the top, and the actor who plays Christ is iffy. But, then again, he is tasked with the impossible role of being man and God (just what expression would you choose if you played Christ?) without descending into camp farce. All in all, he does OK.<br><br>Joseph Fiennes plays the Tribune with authenticity, honesty, and an openness which allowed me to put myself in his place...how does a rational man deal with fundamental challenges to his heretofore solid as a rock, world? When do you surrender to faith when all the 'reason' in the world suggests that reason has little to do with it all?<br><br>It's a good movie, well worth seeing.","user":"mjjusa-1","rank":[106,125]},{"title":"Pretty Decent","rating":7,"date":"18 February 2016","review":"With the most recent Biblical movies that Hollywood has come out with, Noah and Exodus, the main complaint, at least from the Christian viewer-base, was that they didn't stick to the accuracy of the Bible; in this film they do - so it has that going for it, if you're a Christian. <br><br>At the top of the IMDb page it lists this movie as Action, Adventure, and Drama; but in reality it's pretty much just drama. There is a 3 minute action sequence at the beginning and that is about it. It's not bad that it's Drama, but it is a slower paced movie - I only point this out because that is one of things I like to know when going into a movie. <br><br>The movie itself wasn't terribly exciting, but for the Christian audience, who like to see portions of the Bible \"brought to life\", I think it will find a decent viewer ship. That being said, if it's Friday night and you're looking for a fun movie, then this probably isn't it.<br><br>Thankfully, this isn't another \"God's Not Dead\" where they smack you in the face over and over again with how awesome Christians are and how terrible atheists are - it basically just sticks to a fictional storyline of what might have happened to a Roman centurion who is in charge of finding the missing body. <br><br>The bottom line is this movie is the very definition of \"good\" to me, not bad, but not great...just good.","user":"allstarrunner","rank":[112,136]},{"title":"A soldier's story","rating":8,"date":"17 October 2016","review":"This is the best Christian film I have seen in a long time. The worst of them are chock full of stereotypes, contradictions, and just plain bad writing and acting (cough...God Is Not Dead...cough). This one has none of that. It is the story of a Roman tribune, Clavius, who is stationed in Judea at the time of Christ. He puts down uprisings and kills the rebels, but he has neither joy nor sadness about this fate. It is simply his job and he is rather stoic about it. It is part of his long term plan that gets him back to Rome, position and power, wealth, a good family, and then a home in the country - \"a day without death\" as he puts it.<br><br>The governor of Judea, Pontius Pilate, assigns Clavius to find the body of Jesus when it disappears from its tomb. The next 20 minutes or so of the film is like an ancient CSI as Clavius methodically seeks out Jesus' believers and tries to get them to talk. He thinks he has tracked down the body to a small room. Clavius draws his sword, kicks down the door preparing to fight, and there, sitting in a circle are the twelve disciples with Jesus looking right at him. He knows this is the man he saw dead on the cross days ago, he sees his wounds, yet he is alive. He cannot just go back, so he follows these disciples to Jesus' ascension. Particularly moving is the conversation between Jesus and Clavius as they sit alone at night. What will Clavius do in the end? Watch and find out.<br><br>The filmmakers took the time to get so many aspects of the film right. The coin under the tongue of the dead Roman soldiers and the funeral pyres for them, the open grave where the bodies of the executed are tossed, not buried, the horror of an actual crucifixion, and the simple love and joy of the original Christian faith. And they don't try to paint Clavius as some searching soul. He is quite at home in Roman culture, praying to Mars - the Romans had a quid pro quo arrangement with their gods. The mortal offers to do something, if the god will do something. The only thing that stops him in his tracks is seeing something that reason tells him cannot be.<br><br>I like how for once Jesus looks like someone who actually was born at the intersection of Europe, Asia, and Africa. He has swarthy skin, and his physique is unremarkable. He is not ugly or handsome, neither tall nor short. Ironically Jesus is played by the New Zealand Maori actor, Cliff Curtis, born half a world away from the setting of the film.<br><br>Kudos to the actor who played Pontius Pilate too. He truly captures the essence of a toady politician who has enough conscience to regret doing something he thinks is wrong, but if it is you or his career he will choose his career every time. And the emperor is coming for a visit and Pilate above all wants the emperor to find order in Judea when he arrives. This is the motive for everything he does.<br><br>I'd highly recommend this film.","user":"AlsExGal","rank":[26,29]}]