[{"title":"Loved it!","rating":10,"date":"20 April 2014","review":"It was an excellent movie. Short summery a 'whinging pommie' and a 'dinkum Aussie' sort the differences in backyard cricket. The movie itself was a good small budget comedy that unlike others really delivers not only a good laugh but conveys a message about how a person who you don't like can become a friend. The whole setting is a typical Aussie setup none other than backyard cricket. They have nicknames based on popular cricketers such as Dougie waters 'Dougie Walters' and 'pidge 'pigeon aka Glenn McGrath' the whole movie is basically dedicated to the Aussie bloke who loves playing or have played backyard cricket with mates. A must see for a comedy fan!!!<br><br>Overall 10/10 A good laugh and a great small budget film!","user":"r-burgess35","rank":[14,20]},{"title":"Embarrassing","rating":2,"date":"3 November 2014","review":"Embarrassing.<br><br>Between making great crime-dramas (eg Animal Kingdom, Snowtown), Australia makes some horrendously bad movies. Pretentious dramas (eg Jindabyne), low-brow comedies (eg the Wogboy) and its cousin, the intended-to-be-folksy-but-really-quite-stupid comedy. This is one of the latter.<br><br>Watched this because it involved cricket, and almost immediately regretted it. It has some good moments - some cricket in-jokes (eg the Muralitharan = chucker observation and bowling a beer underarm to a New Zealander) and some other laugh-out-loud moments - but these are few and far between. This is seriously bad.<br><br>Every stereotype is employed, every cliché abused in this farce. The writers and director could not have made the characters more of caricatures of Australians and English if they tried. The plot, for lack of a better word, is silly and contrived. It's as if they wanted to be as predictable and unoriginal as possible.<br><br>Embarrassing to watch, especially if you're Australian. A movie made to appeal to the lowest common denominator.","user":"grantss","rank":[4,5]},{"title":"Pretty awful (the bits I saw).","rating":3,"date":"29 March 2014","review":"This movie was a first for me - the first movie that I have ever left (or even contemplated leaving) half way through. It was dull and unfunny, but worst of all it was clichéd. Despite some appealing performances (particularly from the women, who had very little to do) the overall effect was dispiriting. The \"all bosses are bastards\" concept was laid on thickly, and the upper class Englishman stereotype was offensive and could probably be viewed as racist. (The supporting \"ethnic\" roles were also in questionable taste.) There was a lack of logic and consistency in the set-up - for example, the English boss was a skinflint who bought a house because it was cheap but drives an expensive car. After smiling once, laughing never and gritting my teeth constantly, I left about the half way mark. Even though this is a short movie it wasn't worth wasting any more of my time on. I take no pleasure in criticising what is obviously a low budget movie, but I took even less pleasure in watching it.","user":"Equivoco","rank":[13,23]}]