[{"title":"Greece's Hidden Treasure","rating":9,"date":"8 March 2014","review":"Great cinematography of landscapes and faces, portrays the unseen Greek island, the Greek people of the 30s, and a story about romance, submission and the silent triumph of love.<br><br>It grasps you from the beginning, so long you settle with the way these people are to speak. To my opinion, mostly when they are in silence, true performances emerge to be given by some of Greece's youngest and eldest actors, performances that go back and go deep into the human tale. <br><br>And, not to be missed! , one of the most excruciating scenes since the beginning of cinema, performed by Pinelopi Tsilika.","user":"Vaggre84","rank":[32,35]},{"title":"LONG YET UNMISSABLE (proud to be Greek sometimes...)","rating":9,"date":"21 December 2013","review":"Little England is the beautiful Greek island of Andros, in the 1930's - an island breeding sailors who spend most of their lives at sea, while some of them are destined never to return. Their women – mothers, daughters, wives, lovers - adjust their own lives to the pattern of the men's absence, looking forward to the happy yet brief homecomings, always praying for their safety, always half-dreading the worst.<br><br>This is the premise of the film's story - a tragic love story of epic proportions - based on Ioanna Karystiani's best-selling book. Mrs. Karystiani herself finely adapts her novel for the screen, while her husband, renowned Greek director Pantelis Voulgaris (\"Brides\") takes it from there and, with the help of a great cast of actors, creates an almost flawless masterpiece.<br><br>(I am not supposed to give away any spoilers, so I can only say that the film's climactic scene will probably make it to my personal top ten movie moments of all time).","user":"theonianz","rank":[37,44]},{"title":"A must see!","rating":10,"date":"10 December 2013","review":"Pantelis Voulgaris in his best so far film. The actors, photography, scrip everything was in tune! I am Just grateful I have watched this film! The aesthetics have a unique character. The cinematography gives of a real character to the film. Every angle is beautiful and truly can me isolated, framed and hung on a wall. Nevertheless it is so humble without exaggerations operates in favor of the storytelling. The characters are very well written and have an amazing depth to a point that become symbols. The actors gave wonderful performances and in many cases we see excellency in acting. After leaving the cinema I felt that I have seen something magnificent. I cannot recall many films giving me such filling!","user":"nmamalos","rank":[46,58]}]