[{"title":"He's the Captain now","rating":7,"date":"8 September 2016","review":"Greetings again from the darkness. Society has a tendency to go to extremes – hero worship for those who probably don't deserve it and character assassination for those who have the gall to be less than perfect. Chesley \"Sully\" Sullenberger has experienced both. On January 15, 2009, Sully made the decision to land the crippled aircraft of US Airways flight 1549 right into a river  an event immediately labeled \"Miracle on the Hudson\".<br><br>Surprisingly, this is the first film collaboration for Tom Hanks and director Clint Eastwood. Both have cinematic experience with true life stories and real people: Hanks most recently in Captain Phillips and Bridge of Spies; and Clint with American Sniper and J. Edgar. This one is the perfect fit as Hanks takes on a good man who takes pride in doing his job, and Clint brings to life a story that showcases the best of human nature.<br><br>Tom Komanicki adapted the screenplay from the book \"Highest Duty\", co-written by Sully and Jeffrey Zaslow. Much of the attention is given to the doubts and uncertainty Sully experienced during the NTSB review. The scrutiny of his work by the committee (played here by the ultra-serious Mike O'Malley, Anna Gunn, Jamey Sheridan) left his career and reputation dangling, inspiring nightmares that are much worse than yours and mine.<br><br>Certainly we are in awe of what Sully pulled off that morning, but as movie goers, we are anxious to see the plane crash/splash/landing. Clint comes through in breath-taking fashion. While it lacks the hysterics and drama of the upside-down plane in Flight, this re-creation is so realistic that we nearly obey the flight attendants repeated instructions of \"Heads down. Stay down\". Even the cockpit chatter, passenger evacuation, and first responder's (many of whom are real life folks, not actors) activities are played in matter-of-fact manner  more people just doing their job. We shiver knowing the icy Hudson River water is 36 degrees, and we feel Sully's anxiety as he desperately tries to get a final count  a count that he prays will hit 155.<br><br>Aaron Eckhart plays co-pilot Jeff Skiles and has a couple of memorable scenes, and Laura Linney embraces the thankless role of telephone wife of Sully during the aftermath and hearings. We get a glimpse of Sully's background with flashbacks to his flight lessons at a Denison Texas private airfield, as well as a portion of his military service. Hanks is the perfect choice for a role that would have suited James Stewart just fine if it were the 1940's.<br><br>The conflict here comes from the NTSB inquiry. Backed by computer simulators that show the plane could have coasted back to LaGuardia, we get the distinct feeling that the committee's goal is finding human error – naming a scapegoat (other than Canadian geese) for their \"lost\" plane. It's Sully who reminds us that the committee is simply doing their job  just as he was, Skiles was, the Flight Attendants were, and the first responders were.<br><br>This is technically expert filmmaking. We know the ending, but are glued to the screen. Frequent Eastwood collaborator Tom Stern handles the cinematography, and like the acting and story-telling, the camera work avoids any excess or over-dramatization. The film provides one of the best examples ever of the duality of hero worship and intense scrutiny, and how a person can be a hero by simply doing their job. The closing credits show clips of the flight's reunion and every survivor would agree that the best among us allowed a continuation of life  something that could have gone to the other extreme.","user":"ferguson-6","rank":[163,197]},{"title":"Power of the Human Spirit","rating":9,"date":"9 September 2016","review":"If there's one thing you can count on Clint Eastwood doing well, it's directing an emotionally heartfelt story. Sully continues Eastwood's success by giving us probably the most human drama of 2016.<br><br>\"The miracle on the Hudson\" is the subject of this Eastwood drama, starring Tom Hanks, Aaron Eckhart, and Laura Linney. There will be plenty of obstacles with any film based on a true story, but with a film based on an event that lasted a mere 208 seconds, it's extra difficult. But Eastwood manages to pull a great story out of these unbelievable events that comes in just under 2 hours. Of course, the flight itself isn't the only hurdle that captain Sully went through, as he dealt with reporters, investigators, and the National Transportation Safety Board determined to diminish his heroic efforts.<br><br>Who could possibly be better to play Captain Sully than the great Tom Hanks. Having wonderfully played another \"controversial\" captain back in 2013 as Captain Phillips, there was no doubt he could pull off a somewhat similar role. Boy does Hanks deliver. He always effortlessly pulls out the big speeches and powerful dialogue well, but I often find his more subtle acting to be more impressive. It's the moments when Sully is reacting to the big moments with only his facial expressions and body languages that give me goosebumps. Not many actors are able to bring me to the verge of tears just by a facial expression, but Hanks is one of them.<br><br>Eastwood and his editors also deserve tons of credit for their work here. Much like Hanks' subtle acting, I love when Eastwood holds back the bombastic music (that can sometimes take you out of a story like this) and lets the audience choose how to feel by watching gorgeous cinematography and poignant acting and directing. This may be Eastwood's best directorial work since Million Dollar Baby. He understood exactly the moments to use and not music in order to pull the emotion out of his audience.<br><br>Most of all, this film is a great display of the power of the human spirit. Everything about this film is grounded with humanity. No one seems fake. So often Hollywood is flooded with over-the-top filmmaking that can easily dilute the power of the film's message. Sully knows exactly what it's going for, and it does it to near perfection.<br><br>+Eastwood back at the top<br><br>+Hanks subtle acting<br><br>+Power of human spirit<br><br>91/100","user":"ThomasDrufke","rank":[165,206]},{"title":"One of Eastwood's and the year's best.","rating":6,"date":"6 September 2016","review":"\"Everything is unprecedented until it happens for the first time.\" Sully (Tom Hanks)<br><br>On January 15, 2009, a decidedly un-cinematic hero, Captain Chesley \"Sully\" Sullenberger of US Airways, landed 155 souls into the Hudson River, safely, as he struggled with a plane crippled by birds in both engines. As we all know, the passengers and crew survived, so what does director Clint Eastwood bring to the big screen that could engage an audience knowing the blessed outcome? <br><br>First, he brings Tom Hanks, not unknown to portray low-key heroes (see Bridge of Spies and Captain Phillips most recently), whose understated courage seems accurately to reflect the Sully we have come to know and see displayed with the credits. Second, Eastwood crafts one of the most believable crash and rescue scenes I have ever encountered.<br><br>As in the authentic Hanks interpretation of the quiet Sully, the disaster is compelling and understated. No swelling or morbid music takes away from the terror. Because the simulations at the National Transportation Safety Board hearings were necessary to prove fault, the contrast between the NTSB creations and Eastwood's rendition of the real incident is starkly evocative of the film's attempt to get it all right.<br><br>Even the NTSB's grilling Sully at the hearings, while it unsettlingly tracks his alleged errors in the \"Miracle on the Hudson,\" has a low-profile approach. It confirms Eastwood's and writer Todd Komarnicki's affirmation that everyone in the film is doing his and her job, from pilots, investigators, and rescuers to director and writer.<br><br>Even Sully's wife, Lorraine (Laura Linney), in the ever-annoying wife-in-waiting-role, is stronger and more balanced than the stock character. Although the passengers are not always first-rate actors, they do seem sincere. However, it is Hanks's film with his stolid, no frills acting, followed by a supportive Aaron Eckhart as his co-pilot, Jeff Skiles.<br><br>But then, that powerful under-acting is emblematic of the director himself, a lean craftsman who wastes no time in production and has no time for puffery. Although not Unforgiven, Sully is one of Eastwood's best and one of the best films of the year.<br><br>After seeing this film, you may have a heightened respect even for flight attendants, who evidence a more sincere bravery than summer blockbuster heroes could ever do as that crew directs the passengers: \"Brace. Brace. Brace. Head down, stay down!\" If you see Sully in IMAX, your head will be up in the clouds and your heart too.","user":"jdesando","rank":[167,217]}]