[{"title":"A lovely film!","rating":8,"date":"4 May 2016","review":"I don't think I stopped smiling from the first frame until the end, even though a few times I was smiling through tears. Call it a chick flick if you will, but this is a film with great heart and more than a little gravitas. I have enjoyed Adriana Trigiani's novels for years and was pleased to see that Big Stone Gap was to be made into a film. I admit that I was a bit skeptical about the author serving as writer and director, but kudos to her for an outstanding job! The cast is excellent -- Ashley Judd and Patrick Wilson are just right as not-so-young single residents of a small Virginia town where everybody wants to mind their business. The supporting cast includes veteran actors such as Whoopi Goldberg, Jenna Elfman and Judith Ivey, who really pull their weight. It's funny, heartwarming, and absolutely beautiful, shot on location in the real town of Big Stone Gap, Virginia, where Trigiani grew up (and where Patrick Wilson's grandparents lived. Go figure.) No phony Southern accents in this film - They get it right. Thank you!!","user":"scriptster","rank":[11,12]},{"title":"\"Big Stone Gap\" may not be big on excitement, but it is big on heart.","rating":6,"date":"7 November 2015","review":"Many films that are set outside of large metropolitan areas, or away from other well-known places, use fictional names for their settings, but not \"Big Stone Gap\" (PG-13, 1:43). Big Stone Gap is a real place, thank you very much. It's a small mining town in Virginia, nestled in the Appalachian Mountains, so far west in the state that seven other state capitals are closer to the town than its own state capital of Richmond. The nearest city of at least 100,000 people is over two hours away – and in another state! Big Stone Gap has a population of under 6,000 and has only grown by about 1,000 people since the late 1970s. This might not sound like the kind of place that warrants a feature film bearing its name. Well, it helps that writer Adriana Trigiani grew up there. After some success writing for TV sitcoms, she became a novelist. In 2000, she published her first novel, \"Big Stone Gap\", telling about her hometown as she knew it as a young woman. Then, she got the chance to write and direct a movie based on her book.<br><br>Big Stone Gap is a close-knit town full of colorful characters, who are hard-working and compassionate – simple, but proud salt-of-the-earth folks. The central character is Ave Maria Mulligan (Ashley Judd), a pretty, 40-year-old woman who never married and proclaims herself the town spinster, with pride and just a touch of melancholy. She owns and operates the town's pharmacy, whose only other employee is the stubborn but sweet Fleeta Mullins (Whoopi Goldberg, sporting a full-sized late-70s afro). Ave (pronounced AH-vay, like the Catholic prayer after which she is named) is the kind of woman who personally delivers prescriptions to the town's residents and then returns home at the end of a long day to take care of her aging widowed mother, an Italian immigrant named Fiammetta (Angelina Fiordellisi).<br><br>Ave also directs the town's annual outdoor drama. Her cast and crew include most of the movie's main characters. The show's co-stars are Ave's long-term boyfriend, Yankee transplant Theodore Tipton (John Benjamin Hickey), and the man-obsessed and self-absorbed Sweet Sue Tinsley (Jane Krakowski). Vivacious librarian and bookmobile driver Iva Lou Wade (Jenna Elfman) sells the tickets and the town's attorney and paramedic, Spec Broadwater (Anthony LaPaglia) helps out behind the scenes. Then there's Jack MacChesney (Patrick Wilson), who is one of the show's musicians. During the day, Jack is one of the town's many coal miners. He and Ave came up through school together and have remained friends over the years. Jack has been seeing Sweet Sue for a long time, but we wonder why he's 40 and still single.<br><br>When Ave's mother dies and Spec gets to work on fulfilling Fiammetta's final requests, Ave learns a family secret that turns her entire self-concept and, really, her whole world, upside-down. The implications of this discovery could cost her the pharmacy and even her home, not to mention that Ave is trying to figure out how she should react to the information that she has learned about her family. But she can't just stop her life and focus on these issues, as important as they are. Real life continues to happen all around her. Ave has taken a lonely bi-racial teen (Bridget Gabbe) under her wing. Ave tries to build up the girl's self-esteem, bring some purpose into her life and help her and her mother (Jasmine Guy), who both live outside of the town – physically, socially and economically. Oh, and I almost forgot to tell you the REALLY big news that's going to affect everybody in town! (Based on a real-life incident in Big Stone Gap in 1978!) John Warner, the Republican Candidate to represent Virginia in the U.S. Senate, is going to make a campaign stop in Big Stone Gap – and he's bringing his new wife – Elizabeth Taylor!! Why that's enough to make a country hog stop rolling in the mud and learn to mind his manners! \"Big Stone Gap\" is a pleasant and enjoyable movie. There are enough interpersonal conflicts to keep things interesting, but none of the main characters cross over into becoming unlikeable. There's enough drama to keep the plot going, but without overwhelming other important aspects of the movie. And, most importantly for this film, there's enough country charm to give Movie Fans a good sense of time and place, but without becoming syrupy sweet or allowing the characterizations of small-town folks to become disrespectful parody. This film isn't about big issues or big events (except from the point of view of those directly involved in the goings-on), but it is about big hearts. This isn't the kind of film that will change your life, but it is the kind of film that will leave you feeling really good. \"B\"","user":"dave-mcclain","rank":[16,19]},{"title":"Every bit of story line is interesting and entertaining","rating":8,"date":"2 November 2015","review":"This adaptation is dramatic, interesting, and a great period piece. I really like that the cast of this film is filled with recognizable actors and actresses who make it a great film. <br><br>In a small town in Virginia, the life of middle aged spinster, Ave Marie (Ashley Judd) is shaken up and permanently altered when, after a semi-anticipated unfortunate event, she discovers a family secret that has been buried for a long time. While she tries to figure out why things are the way they are, her eyes are opened to situations and experiences that she never noticed. Ave Marie makes a life altering decision and as a result the whole town unravels. <br><br>Since this film is a period piece, I was really intrigued as I watched it. I love all of the romantic aspects that are displayed throughout this film. Along with the romance and bits drama, Big Stone Gap offers great comedy, which really separates the dramatic pieces nicely and gives this film great balance. My favorite character would have to be Fleeta (Whoopi Goldberg) because of the comedy she gives to the film and also because of the boldness and confidence in her character. <br><br>Over all, I cannot say this I have a favorite scene, every bit of story line is interesting and entertaining, I will say this all the scenes with Fleeta are very nice to watch due to the way her character interacts with others. Another aspect that I greatly enjoy is the wardrobe, because of how much it's involved in this story, the clothing that is worn, adds different details to each and every character and their personality. Even though sometimes I am a bit confused about the plot line, everything clears up in the end. <br><br>A message that I found in Big Stone Gap is that life is always changing, and nothing is set in stone. Another message is that sometimes life is unfair, and we shouldn't dwell on all the inconveniences in life for too long.<br><br>I recommend this film for ages 9 to 18, due to its slight suggestive content. I give it 4 out of 5 stars, because of its comedy, romance, and cast. <br><br>Big Stone Gap is in theaters October 9th, so please check it out. Reviewed by Brianna B., Age 15, KIDS FIRST! Film Critic.","user":"rannynm","rank":[14,18]}]