[{"title":"Baffled why everyone is trashing this movie","rating":7,"date":"3 August 2015","review":"Reading many reviews about this movie including some of the comments in the forum, I have came to a conclusion that many have either not really seen the movie, or made preconceived idea that the movie is bad because Katherine Heigl is in it. Add that that is a LGBT movie, than the movie really must be that horrible. <br><br>But, I have seen the movie and I liked it. <br><br>If you watch the movie with open mind, then you would actually see that the theme of the movie is quite great. It's a story about a family who had no idea that daughter/sister was a lesbian. That she is getting married to her \"room-mate\", who turns out wasn't really room-mate but her girlfriend of 5 years. It's a story of family coming to terms and dealing with facts, that they had been lied to for a long long time. It's very hard coming out to your family, because you never know how they will react, or say, or think of you. And this is why it has taken Jenny so long to come out to her family. Her fathers reaction is a very big reason why many stay in closet. A lot of reviewers say that Bledel and Heigl do not have chemistry. Considering that they shared very little screen time together, there really wasn't much time for it. And the movie really was not about their relationship.<br><br>It's not the movie of the years. It's not a movie that will earn countless awards. But give the movie a try, give Heigl a try because she was good in this role.","user":"Trufflesss","rank":[81,94]},{"title":"nice coming out movie","rating":7,"date":"20 September 2015","review":"5.3 is way too low for this movie. An emotional family drama dealing with an uptight family's anxieties and prejudices and although the film is a fantasy and on the side of the angels it plays out what should happen if a family had to turn round and accept what is unacceptable to them. It is nice to see a main stream film that is not just the usual tired romantic comedy. <br><br>The actors do a good job. Tom Wilkinson and Linda Edmonde are excellent as the parents and have the meaty roles to play as they have the difficult journey to take. Family dynamics are played out well as a background to the story as well as the social network that the parents live in.","user":"willmurphy6663","rank":[37,48]},{"title":"A very down to earth movie!!!","rating":8,"date":"14 August 2017","review":"Even telling what this movie is all about is a spoiler. Jenny is our girl next door belonging to an \"ordinary\" family who grew up in a closely knit neighborhood. Jenny does get married but not as per her parents expectations. She is gay, a fact that she kept away from her family all along until her as well as her family's attempts at getting her set up on dates with random guys pushes all of them to frustration. So at her father's behest she finally decides to tell her family who she was dating. This is a coming out story of a woman who was openly lesbian in the city but all sly when it came to her family and locality. It's about how the parents reacted when their favourite child threw something at them that they just didn't understand. When Jenny tells her to her mom who she was particularly close to she wasn't so much afraid of her being gay as she was of what \"people will think\". Its clear from the fact that she asks Jenny not to tell this to anyone except her father right now. She is worried of her life in that community where she has lived all along.Jenny's father's reaction is equally baffled although he rests his gun on the mother's shoulders and would rather talk about how her mother was getting hurt rather than his own confusion and resentment. They are baffled that they never understood this about their child. This is a textbook reaction of parents that they are \"ordinary\" people and they don't get it. The movie was very down to earth about handling this subject from the POV of a regular family. Tom wilkinson and Lind Emond as the parents were extremely believable. It was amusing to see how the father couldn't look on as the brides kissed after cutting the wedding cake although he had come around to accept his daughter's sexuality. Katherine Heigl's performance as Jenny was good. Her partner performed by Alexis Bledel didn't have much to do except look on supportingly. It was taken for granted that her parents had no objection and all was well at that front. This movie is not an out and out war cry for the LGBT community. It is not corny Or prudish nor is it overtly sexual. It is targeted at those people who dealing with the uncommon sexual inclination that they do not understand. They they never have come across in their known circles.These are regular people who do not deal with the ultra liberal ideas that come with cosmopolitan life. I see a lot of critics panning this movie. Someone blamed it of dealing with \"too much sheltered people\". But that is the fact. Not everybody lives sex and the city kind of life. Majority of people live an ordinary low key life and yes a \"sheltered existence\". Someone has to make a movie about that kind of people too. A movie's degree of impact varies based on the context and complexity of the situation addressed in it and not every movie will address the most complex even though talking about the same issue. Not every gay person evolves to be a LGBT revolutionary and not all families are utterly rejecting although they have their sets of challenges. This movie is a low key drama which is very identifiable and extremely approachable.","user":"cadburypg","rank":[10,11]}]