[{"title":"Nothing awful, just very forgettable and average","rating":5,"date":"14 May 2017","review":"OK, so here we go. \"The Last Face\" premiered during Cannes last year and it got bashed by critics and even booed at. When I heard about that I couldn't really believe it. I mean, a film directed by Sean Penn starring Charlize Theron and Javier Bardem being that bad? It got me curious to watch it. Because I needed to know if it was getting fair reviews or not. It turned out to be a long wait, because It took a year for it to finally come out in other countries. I went in with an open mind. Ready to give it a deserving chance like every movie does. Well, now after seeing it I understand where the problems lied. Although, I must say right off the bat that it's not completely terrible... But it does get messy.<br><br>What I didn't like was that it got exaggerated and tried to force the emotion rather then earning it. The romance was predictable and typical. It goes through all the expected beats of \"Will they be together or won't they?\" The movie uses narration and I thought it was unnecessary. It would have worked better without filling the audience in on the plot so often. I think people can figure it out perfectly well on their own, because it just added to the melodrama. Which was annoying at times with them over sympathizing the story and dragging out moments. It was good whenever it just calmed down and showed some realism. The premise itself is fine. Doctors going to Africa to help people in need. I understood the overall message of mankind's goodwill. The hospital/doctor scenes had some tension to them and they felt very realistic. There's also a lot of gruesome and horrific imagery of people's misfortune in Africa which was affecting. Those were the parts that stuck with me. The characters were able to convince me in many scenes, but unfortunately not the entire way through. It's sad, because Bardem and Theron looks to have put so much effort into this.<br><br>Like I said, the story of them being doctors and traveling in Africa to help people was fine. It was the romantic story that dragged on and felt clichéd. They should have toned it down and made the entire movie more realistic and down to earth. I was able to see glimmers of what could have been really good touching moments. Instead we get too much melodrama with musical soundtrack telling you exactly how to feel instead of the story itself making you feel something. Although there was some music I liked in it: The local African songs and the Piano tracks towards the end. There are scenes that are good. Scenes that feel like real life stories with heart to them. The thing is that we get so few of them spread across the movie. I was never able to truly appreciate those scenes so well because the following part would often drag it down again.<br><br>Without spoiling anything, the final moments were finally able to get some emotion across. The ending was my favorite part. It made me finally care for what was going. It was a little too late. But hey, at least it was something. The movie leaves you reflecting on life a little bit. But not nearly as much as I'm sure the filmmakers wanted. It does, however have its moments that work. And for that I will give it points. The movie is not nearly as awful as some people are making it out to be. It's just average. If you are looking for something to pass the time with, then this will work fine. Just don't expect much. It's watchable, but nothing memorable.","user":"paulijcalderon","rank":[63,86]},{"title":"Thought Provoking","rating":9,"date":"13 May 2017","review":"First,let me respond to all the negative reviews of this film.Oh the self-righteousness! Oh the humanity! Yes,this movie is a love story that takes place in Africa amidst turmoil and terror,and yes-its the Africans who are the victims in this movie-not the \"white saviors\". It never claimed to be anything else. Before I review the actually film,I have to ask people who rated this movie negatively solely for its \"white saviors of black people\" premise; is it a crime for white people to go to Africa to try to help Africans and also fall in love with each other?In your outrage at believing this movie undermines the humanity of Africans, you strip the white characters of their humanity.I've fought racism all my life whenever the opportunity presented itself,and am a firm supporter of Black Lives Matter.Of course a non-black person cannot say they are anti-racism without immediately condemning themselves to scrutiny and \"aha's!\" from others.Skipping the am I racist rant,I just could not understand why just about everyone immediately condemned the white lovers/activists for daring to be in Africa to help refugees of war and audaciously fall in love. Should white people stay out of Africa? Yes if they are there to exploit.If they are there to help,then by all means..help. <br><br>The film is gorgeous.Charline steals the show once again. The brutality,horror and hellishness of what Africans face is not watered down,not reduced to art.It is full in your face truth.Its funny how people who hate the white activists also seem to ignore the horrors that Africans face in their desperate self righteousness. Throw the baby out with the bathwater I guess? This stunningly beautiful film will stay with me a long time,and I already know it belongs with my other favorites of this genre...which also received poor reviews for the white savior premise....Keys to the Kingdom and The Revenant.White people who bridged the gap between cultures and ethnicities rather than be hateful,violent and racist.These types of movies really tick people off.Tough.The world needs more bridges,less hate and condemnation. The Last Face is a precious gem for that reason...if you happen to go to Africa as an activist, and you want to make a difference in the lives of Africans who have suffered(often because of the west's exploitive racist ways) ...don't feel guilty ,even if you fall in love....","user":"slhma-86182","rank":[90,134]},{"title":"The Last Face - Loses its Face and its Way","rating":3,"date":"11 December 2018","review":"What might have been a heartfelt African tragedy falters under the heavy hand of Sean Penn who does here, what he once claimed Terrence Malick was guilty of: (with words to the effect... 'Creating something that looked good on paper but failing to transcribe it to film'. Shoddy hand held photography, poor composition, disjointed editing - with scenes that should have been short, left long, and visa-versa. Sound was another problem, people whisper - with it all being so low, as not to be heard. Eye rolling arty shots without purpose - a story that's on again-off again, with performers doing what they can but, being left all at sea by their overindulging director.<br><br>A movie maker seemingly pushing his political views - at the expense of third world persons lost to the corruption within their own leaders and an uncaring world - surrounded by repugnant violence (some of the violence is realistically shocking) Mr Penn may (or may not) have his heart in the right place but tends to allow the shadowy edge of politics to blind his visionary vocation. At one point some innocent victims exclaim 'In the name of Jesus' - the people there to help them reply: 'what about in OUR name'? Maybe that's just the point - take Christ's unconditional love from these poor souls and they have exactly nothing! - So, what does the story teller dislike most, the love or the forgiveness? Some music choices on the sound track help to a small degree but sadly, self importance does not, a good movie make. Like other Penn movies this seems to run forever, needlessly.","user":"krocheav","rank":[12,15]}]