[{"title":"Relationship drama with sci-fi twist: plenty of style, not enough substance","rating":6,"date":"19 March 2016","review":"\"Creative Control\" (2016 release; 97 min.) brings the story of two couples. There is David and his girlfriend Juliette. David is working at an ad agency and is tasked with coming up with a good ad campaign for a new \"augmented reality system\" called Augmenta. David gets to try it out (by wearing regular-looking glasses) for some time. Juliette is a yoga instructor. It looks like their relationship isn't the greatest. Then there is Wim and Sophie. Wim is David's long-time buddy who hasn't the slightest problem with cheating on Sophie. David then hires Sophie to come work at the ad agency. At this point we're not even 15 min. into the movie, but to tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: first, this is the latest release from Amazon Studios, which is starting to spread its wings in the movie business quite nicely. Second, this is the Benjamin Dickinson show all the way: he stars (as David), directs, co-writes and co-produces this film, his first feature-length as a director. Dickinson sets the story in the not too distant future, where things still look quite familiar (certainly New York does), but technology has made continued progress. Yet the idea of an \"augmented reality system\" is of course not new. In fact, conceptually the movie is eerily similar to/reminiscent of that movie from the early 80s, \"Brainstorm\" (starring Christopher Walker and Natalie Wood, in her last film), where sex also was a big driver. Yes, I said sex. There is quite a bit of nudity in \"Creative Control\", so if that bothers you, you'd better pick another movie. \"Creative Control\" is shot in black and white, and given the slightly futuristic setting, it makes for a very stylish movie, and one of its better aspects. The other lead performers (Nora Zehetner as Juliette, Dan Gill as Wim, and Alexia Rasmussen as Sophie), all below the radar names, do their best to flesh out their characters, but in the end, the biggest failing of the movie is that it left me emotionally uninvolved and, frankly, I didn't feel invested in any of the movie. Plenty of style, but not enough substance.<br><br>\"Creative Control\" opened this weekend out of the blue without any pre-release buzz or advertising on a single screen here in Cincinnati. The Saturday matinée screening where I saw this at was attended okay but not great. Given the lack of star power and lack of marketing for this movie, I can't imagine that this will play long in theaters. If you are into movies heavy on relationship drama but here with a sci-fi twist, I'd encourage you to check out \"Creative Control\", be it in the theater, on VOD, or eventually of DVD/Blu-ray and draw your own conclusions.","user":"paul-allaer","rank":[29,39]},{"title":"Couldn't Care About the Characters Here","rating":3,"date":"17 June 2016","review":"There's plenty of sex, drugs, nudity, explicit language, and Augmented Reality fantasies here, but if you're looking for any characters you can care about you may very well come up empty handed. Shot in black-and- white, to be fair there is some humor and satire that emerges every so often, but it never stays on a steady enough path to sustain itself.<br><br>Benjamin Dickinson stars here as David, as he also directed the movie and co-wrote the screenplay with Micah Bloomberg, an advertising exec who wins the Augmenta account for his agency. They specialize in Augmented Reality glasses and David volunteers to try out the product so he can prepare his marketing campaign. However, he begins to find the trips into Augmented Reality much preferable to his fast crumbling personal life.<br><br>All in all, there's a few things to like here but they're outweighed by pretentious and unlikable characters, so that by the end of the movie I really didn't care what happened to any of them.","user":"larrys3","rank":[12,17]},{"title":"Artsy?","rating":5,"date":"2 May 2016","review":"I'm guessing this is what one would call an artsy film, the whole movie is shot in black and white, which is actually quite well done, but the movie itself kind of goes overboard in the whole art project thing.<br><br>The story is actually quite simple, and not as hard to understand as the few trippy drug scenes imply, but it also isn't anything special, and really wasn't worth the 1,5 hour movie, as it could've fit into a 30min short.<br><br>A lot of scenes give the feeling someone went overboard with the filters, adding unnecessary sfx and 'noir' style effects to scenes that really didn't need them.<br><br>There is also quite a bit of dialogue that goes a little bit too far in its 'high/trippy' mindset. An actual quote; \"I was looking into his eyes, and that's when i saw you, i saw you, and i realized that loving him was loving you was loving me, because we're all one\"<br><br>This is where i stopped watching and started writing this review while leaving it on for the final 10 minutes. The end was actually quite good, but felt rushed, almost as if the budget ran out and they weren't able to film any substantial scenes for it. (probably because they used it all on unnecessary sfx earlier on.)<br><br>In the end i was left feeling like this would have been great for an art exhibition, and with that in mind it was kind of impressive i almost made it to the end, the camera-work and music quite good also, which is why i give it a 5/10, instead of anything lower.","user":"pepetiebosch","rank":[15,25]}]