[{"title":"I Am Wig!!!","rating":5,"date":"14 October 2016","review":"John Travolta does his imitation of Charles Bronson in \"Eraser\" director Chuck Russell's political crime melodrama \"I Am Wrath,\" and this formulaic revenge epic bristles with moments of spontaneity. The worst thing about this derivative fodder is the ghastly toupee that Travolta sports. This obvious hair-piece resembles something made out of latex that you'd find in a Halloween costume store. Had Travolta interacted with it, scratched, brushed it, or ran a hand over it, so it might have looked realistic. Sadly, he doesn't do anything to diminish the impact of that unsightly rug. It just clutches his head like a rubber chicken, and no matter what he does, this frightful thing detracts from an otherwise meaningful performance. Meantime, this \"Death Wish\" knock-off hasn't got a single, original trope in it. You've seen this movie a million times. Nevertheless, Russell manages to generate enough gusto that you forget about the wig and enjoy the hair-raising violence. Christopher Meloni co-stars with Travolta, and the former \"Law and Order\" star looks like he belongs in his trigger-happy role as the protagonist's friend from the past who cuts hair in his own barber shop. The plot concerns a crooked politician's efforts to cover up corruption. <br><br>Vivian Hill (an older but still sexy looking Rebecca de Mornay of \"Risky Business\") is married to an automobile engineer, Stanley Hill (John Travolta of \"Pulp Fiction\"), and she picks him up at the airport. As they are about to depart in this SUV from the lonesome parking garage, Stanley notices that the driver's rear wheel is pancake flat and prepares to change the tire. Out of seeming nowhere, a thug with a tattoo on his face appears and appeals to them for a small loan. Stanley refuses to accommodate this stranger. The next thing that we know, another assailant surprises Stanley, clobbers him, sends him sprawling to the pavement with a bleeding cut on his forehead and then starts killing him. The first thug, Charley (Luis Da Silva Jr of \"21 Jump Street\"), stabs Vivian and kills her. Stanley struggles to save her, but she is dead. The thugs roll away in a Monte Carlo. Later, Stanley identifies Charley in a police line-up, but he watches incredulously as uniformed cops release him. As it turns out, Charley and his hooligans were paid to kill Vivian, and Stanley has to pry the information out of a reluctant Charley during a gunfight in a night club later in the movie. It seems that Ohio Governor Merserve (Patrick St. Esprit of \"Independence Day: Resurgence\") had hired Vivian to serve as a researcher on his staff, but she failed to crunch numbers to the governor's satisfaction. Facing the possibility that she might expose him, Merserve uses a drug dealer, Lemi K (Paul Sloan of \"The Scorpion King\") to eliminate her. It seems, too, that Lemi has a blackmail video that he is holding over Merserve. Now, Stanley is so grief-stricken that he slams his elbow through the sheet rock at the back of a closet and drags out a satchel that contains firearms, passports, and various denominations of cash. He phones his own buddy from his black operations days, Dennis (Christopher Meloni of \"Man of Steel\"), and they track down Lemi K's thugs and turn them into dead men.<br><br>As interesting as it sounds, \"I Am Wrath\" qualifies as an old-fashioned, vengeance-is-mine thriller that benefits from some cool gunfights, but suffers from deplorable scripting. The first problem is why did the Columbus, Ohio, Police Department bring in Charley and put him in the line-up. Well, of course, the answer is: it's a movie. This entire scene is designed to horrify us as much as the hero who has just seen his wife die. Later, when they track him down to a crowded night club, our heroes display marksmanship that rivals The Lone Ranger. Literally, no innocent bystanders are wounded during this brief foray. Eventually, Lemi K is angry about the treatment of his crew and the loss of a drug shipment, and he comes down heavy on the two detectives that worked the case. Detective Gibson (Sam Trammel of \"True Blood\") and Detective Walker (Asante Jones) find themselves between a rock and a hard place. Ultimately, Governor Meserve finds himself entirely inconvenienced when Stanley storms into his home and the fireworks fly.<br><br>Russell has done far better work than \"I Am Wrath,\" but he manages to keep things going forward despite several unconvincing scenes and this 91-minute, R-rated opus doesn't wear out its welcome. \"Pulp Fiction\" lenser Andrzej Sekula does a good job of concealing the low-budget. According to IMDb.COM, William Friedkin and star Nicolas Cage were originally attached to make this generic thriller.","user":"zardoz-13","rank":[20,26]},{"title":"This is not a bad movie at all. On the other hand its a little too generic for it to be all that good.","rating":6,"date":"25 June 2016","review":"\"How is him walking out of here going to help my case?\" Stanley (Travolta) has just returned home from a long trip and is excited to see his wife again. While on his way home she is murdered. After doing everything by the book legally the killer is set free. Not willing to accept that Stanley takes matters into his own hands and the hunt begins. First of all, this is not a bad movie at all. On the other hand its a little too generic for it to be all that good. There are a few neat twists in this but for the most part you can predict everything that is going to happen pretty easy. Travolta isn't a bad choice for this but he seems a little flat in some parts. In terms of the little B action movies that have been coming out this is definitely one of the best ones, but again this movie has been done over and over and is just not all that exciting. Overall, good movie but too generic to watch over and over. I give this a B-.","user":"cosmo_tiger","rank":[25,36]},{"title":"It's a good action movie starring John Travolta","rating":6,"date":"14 May 2016","review":"I saw Travolta on the poster and without knowing much all I could think of is Charles Bronson in Death Wish. I was close. The movie reminds me of a cross between John Wick and The Punisher (of which Travolta played the villain in the 2004 movie version).<br><br>Travolta plays what looks like your average Joe, who watches his wife get murdered right in front of him by what looks like an average car jacking in a city that's been boiling over with violence lately, but it turns out Travolta has a past that was beyond average and goes Liam Neeson on the bad guys.<br><br>Though he does not look as good as Neeson lashing out those particular set of skills on his wife's killers (but who does?),Travolta was still fun to watch as he hunted down his foes one by one, and just when he thought he was finish, turned out we have more villains to kill. It was like he was leveling up in a video game, that's how far up it goes.<br><br>Travolta himself was more convincing as average Joe wanting vengeance for his wife's death then he was at the dude who could seek this vengeance flawlessly, which is why they kept it light. Helping with this tone is Christopher Meloni who plays the dude Travolta has to call when he gets back in the game. I'm a huge fan of Meloni and he gives a great performance as the guy who has one hand still in the pot while pretending to be a barber. The chemistry of Meloni and Travolta as two old soldiers so jaded by it all that they joke back and forth as they stomp out evil. It's good banter.<br><br>This action movie was a great safety net for Travolta, I can't remember the last time I seen him in something decent, and that's what this was, very decent, very watchable from the very beginning all the way to the very end.","user":"subxerogravity","rank":[38,58]}]