[{"title":"Starts FANTASTIC! .... and then fizzles in the last half","rating":5,"date":"6 August 2016","review":"Figuring out the star rating to give \"The Suffering\" was pretty easy. Approximately the first half of the movie seems inspired and then it degrades precipitously during the second half to just awful. So 10 and 0 averaged together should give you about a 5.<br><br>Structurally, the beginning of the movie is very similar to the classic \"Dracula\". A real estate professional is dispatched to act professionally, on-site to a very remote location, for a client. Starting with the ride to the estate, everything seems \"just wrong\". And everything just gets \"wrong-er\" as the movie progresses until there's just no pretending everything is okay or accepting what you're experiencing.<br><br>Henry Dawles has been hired by the owner of an estate, Mr. Remiel, an aged, morbidly obese and mobility-impaired Col.-Sanders-looking old gent to appraise his entire estate, and given the size and extent of it, the appraisal process is undoubtedly going to take several days. Henry will be living on site until the appraisal is completed.<br><br>As I said, for a horror picture, the first half of \"The Suffering\" is absolutely inspired. Everything seems off, just slightly wrong and just kinda creepy. Like the way desalinated water goes across your tongue. The cinematography is atmospheric, the music is beautiful but slightly chilling, the camera motions, skillfully restrained and gentle, wonderfully add to the overall feeling. All parts of the picture, from paint to canvas and frame, all working together perfectly.<br><br>Particularly creepy is the almost continuous set of scary and off- putting sounds that adorn nearly every scene. Sometimes the sounds aren't even scary in and of themselves, just difficult to identify.<br><br>The driver that brought Henry to the estate seems off, and his speech patterns are peculiar. The car they ride in is off, decades out of date. The maid/servant woman has an oddly intense, severe face and her speech patterns are also weird. Mr. Remiel seems polite and friendly enough, but definitely odd.<br><br>The first night of Henry's arrival he's told he can walk around and familiarize himself with the main house as Mr. Remiel trundles off in the wheelchair lift to bed. As Henry goes about the darkened house, peeking here and poking there, strange sounds and bumpings come from... someplace kinda close but kinda far? Not quite disturbing enough to make one want to raise the alarm, but just shy of that. He opens one door to a staircase that descends into impenetrable darkness, and up from the inky black come sounds of water that is too watery. Sounds more like an ocean grotto down there than a drip from a hot water heater. And some of the drips are echoey. Like they come from far away. Is that a basement or or a giant cavern?<br><br>The next day, Mr. Remiel directs Henry to survey an outbuilding, a cabin-like affair. Would Henry be so kind as to take some pictures while he's there to share with him?<br><br>At first, given the description of the building, everything Henry finds seems to be more or less as one would expect. Full of bric-a- brac and personal items and things of sentimental value. And when Henry ascends to check out the little attic, there, haloed in hazy sunlight from the attic window, obviously having committed suicide, hangs the entirely desiccated body of a man replete with a single- line suicide note on the floor beneath his feet. Whoever he is, he's been there a long time.<br><br>Henry returns to the main house and attempts to back out of the project. Mr. Remiel calmly explains that this isn't the first time something like this has happened. Given the size of the estate, vagrants regularly insinuate themselves on the property and occasionally come to untimely ends. Henry wants to call the police and to quit the job, but Mr. Remiel points out that that wouldn't do anybody any good and reminds Henry of how much Henry and his new family need the money. Henry is surprised and uneasy that Mr. Remiel is so intimately familiar with his personal circumstances, but Mr. Remiel explains that away, too: of course anyone hiring someone like Henry for such an important job in such a remote place would certainly check the background of such a person. Wouldn't they?<br><br>A little extra grease for the palm, and though Henry is still uneasy, things move forward.<br><br>Gradually, evolutionarily, straw by straw, things get worse and more frightening and more incomprehensible and inexplicable. Henry's relationship with Mr. Remiel begins to degrade badly as the occurrences become more frightening and far beyond things that can be explained away.<br><br>The pervasive, ever-growing queasiness and unreasonableness of the experiences Henry encounters makes us know that there has to be some final punch line, some ultimate, encompassing reveal. The fevered- nightmare-like nature of the events are vaguely like the feeling you got from \"The Others\".<br><br>But what will that explanation be?<br><br>Unfortunately, as we surmount the hump at the middle of the picture and start to slide ever faster toward the explanatory rocks at the bottom, the director loses control. Splat splat splat! the odd events hit you in the face one after the other without any of the subtlety, atmosphere and enhancing music and genius but subtle camera-work that marked the first half of the movie. Until, in the last 5 or 10 minutes of the movie, the director whacks you repeatedly in the face with a wiffle bat, tying together all the loose ends throughout the movie that \"need explanation\".<br><br>I must say it was rather disappointing. The first half of the movie really was terrifying, and in a really great way. A few times my breath was a little catchy and I felt a bit goose pimply. That there is a good movie. I guess the director just couldn't keep it up.","user":"S_Soma","rank":[13,17]},{"title":"A Psychological Thriller Worth Watching","rating":8,"date":"9 August 2016","review":"\"The Suffering\" is unlike most horror movies out there today. It's slow pace and strong character development make this flick much more than just another scary movie. <br><br>As a viewer, you're in store for one hell of a ride as you explore this house of horrors alongside the movie's main character Henry. The jump scares are incredibly effective, as are the film's supporting characters Mr. Remiel and Mrs. Gates, making \"The Suffering\" truly chilling at times. <br><br>I was blown away by the twist in the end, so I'll be giving this flick a watch again to catch all of the clues. If you're a fan of throwback horror movies, you'll most definitely enjoy \"The Suffering.\"","user":"kylesbrittany","rank":[16,28]},{"title":"Watch out for the— Oh. Too late.","rating":3,"date":"18 August 2016","review":"Some bloke goes to a big house in the country where the enigmatic owner has requested a market appraisal. <br><br>Blah blah, mysterious spooky stuff happens. <br><br>And happens some more. <br><br>And some more and some more and some more. (This is all going somewhere, right? I mean, it's GOT to be going somewhere...)<br><br>As tensions between the bloke and the enigmatic owner become unbearable, the mystery begins to unfold, until... epic anticlimax.<br><br>I rate The Suffering at 9.99 on the Haglee Scale, which works out as an anticlimactic 3/10 on IMDb.","user":"Sankari_Suomi","rank":[11,19]}]