[{"title":"Wanted to like it.","rating":1,"date":"18 February 2019","review":"I wanted to like it. I thought the premise was a great one for a movie but the execution was all wrong and it made me feel as if I were on a bad acid trip instead.","user":"the_nephilim71","rank":[11,17]},{"title":"The Doomed Generation..","rating":9,"date":"13 November 2019","review":"And to think I was going to avoid this based on some early keywords that I'd heard based on its premise, e.g. troubled teen, social media broadcast, millennial trash, and other such things that make me groan.\nAnd yet, what awaited me was one of the highlights of the year.<br><br>It's certainly not going to be everyone's favorite biscuit, especially for those who place things like 'plot' above all else.\nI'll happily admit that this lacks a traditional plot, focusing instead on an extended circumstance that quickly gets out of hand, and the overall disturbing mental stability of a young woman getting an adrenaline kick from doing bad things.\nBut where this excels is in its stylised editing, the color palettes (and some sweet neon that tickles my fancy), great performances and a bleak insight into the sad reality of many teens and adults today.<br><br>Robert Mockler's debut came out of nowhere and in many ways, it resembles a contemporary version of Gregg Araki's The Doom Generation (1995); where even the premise is coincidentally similar.\nExcept in this case, the descent into violence and the macabre is fuelled by social media; such as content-reaction videos, internet infamy and hate trolls.\nBut the base ingredient seldom changes; that being of the instability of certain young people whose boredom and apathy venture into a twisted game of hurting others to feel something more; adrenaline, empowerment, invincibility, etc. And in many cases, simply because they can, with the lives of others carrying little to no merit in their eyes.\nThe stunning Addison Timlin plays this character brilliantly - a tomboyish emo teen - despite her 26 years of age when this movie was shot.<br><br>Almost every shot is a beautiful picture (despite the often gruesome content) and the mood accompanies the style of the movie perfectly.\nAn arthouse acid trip of a movie that hits all my pretty buttons.\n*The ideal after-midnight movie.","user":"alexqueens","rank":[7,10]},{"title":"Awful","rating":1,"date":"6 May 2018","review":"Awful, just awful. It was like watching a millennial performance art piece.","user":"davedavidedwards","rank":[29,56]}]