[{"title":"Juvie delinquents, ghosts, sordid pasts, oh my....","rating":5,"date":"11 March 2016","review":"Overall, I found this movie dull, but it could have been saved with more in-depth characters. We really don't know much about the troubled young adults who come to the Barn Theatre for \"rehab\". We know what happened to Vivian, but we don't really know her.<br><br>In addition, it just was not scary. It really needed some more haunting moments.<br><br>Cary Elwes shines as the tortured soul trying to save a dying little theatre, while running from his own demons - his performance at the end is intense and moving.<br><br>A painfully slow-paced movie saved by good acting. Worth watching if you can be patient with it's slow pace.","user":"wildsparrow16","rank":[11,12]},{"title":"For teen Macbeth fans","rating":29,"date":"29 February 2016","review":"Run by a failed Broadway director a Midwest work release program which rehabilitates young offenders as an alternative to jail puts a group of teens through the mill when a pesky curse is played out.<br><br>To cut a long story short director/writer Phil Wurtzel's Haunting in Cawdor is a rework of Shakespeare's Macbeth with a 'Venus in Fur' touch about it. Now some horror fans reading this maybe be thing 'eh, what?' That's because Friel Films' Haunting in Cawdor is not a horror film per say, it's more of a thriller with the associated Scottish curse, speaking the name Macbeth inside a theatre which will cause disaster.<br><br>The budget is clearly small, the camera work is crisp and the goings on are centred on one interesting and fitting location. Any work based on Shakespearian play is, as you might expect dialogue driven leaving the special effects waiting in the wing. Wurtzel clearly loves the source material. Pouting, innocent eyed beauty Shelby Young plays the deeply disturbed Vivian faultlessly. The acting is theatrical and fits its offbeat tone which suits Cary Elwes' (secretive Lawrence O'Neil) acting prowess perfectly.<br><br>Haunting in Cawdor panders to the Twilight generation of teen angst but also covers suffering and graver abuse issues. Incidentally, Twilight star Michael Welch appears as rouge Roddy. As the curse increasingly starts to look like a reality there's some jump scares, smidgens of blood and dream-like visions but generally it's jammed with teen summer camp-tropes and Elwes pensively looking over his glasses. <br><br>It's a wordy, low budget character piece with at best creepy theatre shenanigans, dressing rooms and running through the rain. Don't expect 100 minutes shock and terror and you may 'break a leg' finding some teen cinema charm in Cawdor.","user":"amesmonde","rank":[4,4]},{"title":"Slow, Yet Painfully Boring","rating":2,"date":"22 May 2016","review":"This one was bad. \"A Haunting's\" premise was a girl finds an actual recorded murder and tries to investigate. Oh, if that were only the case.<br><br>Vivian is sent to some sort of rehab place for wayward souls. The viewer finds out later that she was actually here as a last stint for a murder she committed when she was 15. It is never disclosed who she murdered or why she murdered. In some sort of flashback, you see her with a knife jumping on an unsuspecting man. The backstory to all of this is not hard to figure out, so you're left with a lot of time to watch boring stuff. I could go on about the auditions for a production of Macbeth, yadda, yadda, yadda, but what would be the point.<br><br>The only reason I did not rate this snooze-fest a 1 is because at least the director decided not to go the usual route of having the bodies pile up. However, at least that might have made this a little more interesting. I do not believe this was rated, but contains brief nudity, minimal violence, and language.","user":"dcarsonhagy","rank":[6,7]}]