[{"title":"Spoilers follow ...","rating":3,"date":"20 June 2016","review":"One of the things I like about the found footage genre is evidenced at the beginning of 'The Devil Within', when the camera remains locked onto a character as he conveys all kinds of emotion to the viewer without the help of moody lightning, artistic cutting or indeed anything to enhance the performance. The actor therefore has no choice but to play everything completely naturally because the unforgiving nature of an unedited shot would betray any lapse.<br><br>That's the first impression I got from the opening moments as Professor Popescu (Adrian Carlugeo) warns us how terrible are the events we are about to see. He is wrong, unfortunately, for what follows is three actors with very little chemistry traipsing around the tremendous snowy Hoia Bacui Forest in a shockingly dull, blatant recreation of events in 'The Blair Witch Project (1999)' – inferior in every way, sadly. They get lost, argue and nothing happens. The discovery of the dead body of their erstwhile companion, the ferociously bearded Mr Dogaru (Bill Hutchins) fails to invest any scares into these uneventful wanderings: 'What happened to him?' 'He's f****** dead, that's what happened to him,' – all lines delivered with all the conviction of characters not remotely bothered.<br><br>Rumour has it that for 'Blair Witch', the director left his cast alone for most of the time in the unforgiving location, only to creep up on them at night and scare them – this produced a very real, wearied, raw set of performances. Here, the terrain is even less hospitable, but there are no scares, no tension whatsoever – any energy is drained from the young cast producing beleaguered dramatics in a disappointingly uneventful picture.","user":"parry_na","rank":[7,8]},{"title":"Seriously! Give This One A Miss","rating":2,"date":"14 April 2017","review":"This has to be one of the worst films that I have ever seen.<br><br>If you like watching a few, very uninteresting, people walk through snow-covered woodlands for most of the movie, then you're in for a real treat. I can honestly say that I don't think I've ever seen a film with such a weak cast and such a weak plot. It's like a really bad Blair Witch in that it's set in a haunted forest, but it has no believable scares or any interesting characters. The characters and plot are so lame, it's like a few people, without an ounce of imagination between them (and I'm not exaggerating here), got together and shot an extremely low budget amateur home movie.<br><br>I'm the first person to rant about people giving films bad reviews that really don't deserve them, especially when they give half decent films only 1 star. You know the type of trolls I'm referring to, but in this case I genuinely believe that the 4.2 rating is far too generous.","user":"michaelant555","rank":[9,11]},{"title":"The Devil Complex: Found footage with even less footage than usual","rating":3,"date":"14 November 2017","review":"The Blair Witch Project (1999) has a lot to answer for. Ever since its release we've been bombarded with found footage movies because of the seeming popularity and because they're insanely cheap to produce.<br><br>This British made one is set in Romania and revolves around a documentary film crew investigating the infamous Hoia-Baciu Forest. For those unfamiliar this is a forest within Transylvania that is well known for it's stories of ghosts, demons and ufos.<br><br>The first 3/4 of the movie is character establishment, when something finally happens it still doesn't. Truth be told this is less actual content or activity than Blair Witch, than Pararnomal Activity. By that I mean literally nothing happens.<br><br>It claims this is based on true events, yet again a lie. The forest is well known for stories, but no basis or evidence to support any of them.<br><br>One thing I found baffling is that the forest is well known for its central circle and distinct tree growth in some areas. They don't show any of this, why go all the way there and not film the two most impressive things within the forest? Forest, snow and some very unlikable characters. That's your lot.<br><br>The Good:<br><br>Fantastic setting<br><br>Based on something real and fairly interesting<br><br>The Bad:<br><br>Weird writing decisions<br><br>Nothing happens","user":"Platypuschow","rank":[3,3]}]