[{"title":"Movie about great music & broken friendship","rating":8,"date":"21 April 2014","review":"The Swedish House Mafia broke up, no need to sugarcoat it and this film certainly doesn't do that. The movie gives insight in how 3 individuals with different backgrounds got together to create music, and how it evolved from that point, with 'Don't you worry child' as their high-point and last creation. Of course the movie is filled with great images of performances and I know of no other music documentary/film that delivered the party-feeling so well. A few bits are repeated from the previous documentary (Take One), but the main-theme 'one last tour' makes it very different.<br><br>I have been to one of the Last Tour performances, and I've been on-stage next to the DJs as part of press-work I did at festivals. The Swedish House Mafia have always been different compared to other DJs of the new generation. They party off-stage but are fully focused on delivering a unique experience for the crowd when behind the turn-tables. In the film this is captured in a great way, while showing the different styles that Axwell, Sebastian Ingrosso and Steve Angello have. This is not only applicable to the music, but also personal lives and role in the Swedish House Mafia collaboration. Steve Angello is the swagger, individualistic character, Sebastian Ingrosso the most stable, funny guy and Axwell forms the heart and glue of the group. A lot of scenes make it obvious why the Swedish House Mafia couldn't stick and why luxury hotels, private jets and nice cars won't bend a negative attitude.<br><br>Sadness comes to mind when you need to capture the one and a half hour in a word, however it's something of a frustrating, beautiful sadness.","user":"tom-810-150081","rank":[32,34]},{"title":"Three makes a Crowd...","rating":6,"date":"14 March 2014","review":"When I saw that this documentary would have an advanced screening only a short ride from my residence, I rushed to put it in my calendar. I sat near the computer not one day, but two due to a system glitch. As the crowd poured intro the seats, we all glanced at each other and started dancing in our seats as they played SHM music to get us ready.<br><br>Let me start by saying that the scenes displaying pieces of their shows are amazing. The sound quality, the editing, and the energy the film captured at their shows was a great feeling. However, when I walked into this movie I believed what I was going to watch was going to be a celebration of how these 3 men helped forefront the movement of EDM music around the world. What I expected was a celebration of the unity and love that SHM has created. What I got instead was a depressing documentary about how these people couldn't sit down and have an honest conversation. The whole filmed just harped on how there has been too much damage done and there is no going back. <br><br>I wanted to leave feeling good about this group who had just left at the top of stardom and instead I felt like the whole film was their way of personally breaking up with their fans. When you near the end of a relationship, you begin to see all the tiny flaws you were so blind to see in the beginning. At one point they show Ingrosso and Axwell resenting Steve for getting a tattoo while trying to finish \"Don't you Worry Child.\" And then another scene of Ingrosso telling Steve to stop complaining about the tour. The icing on the cake was a scene where Ingrosso deliberately insulted the Malaysian culture by refusing to take a lei and Steve just looked at the camera like \"well, I tried to tell him.\" However when they were greeted in India with turbans, Ingrosso took it with no problem. So much negativity. <br><br>What I did love were the scenes from their show and the scenes with their families. I loved how they pointed out Axwell was the rock of the group, Ingrosso was the comedic, and Steve is the one with the \"Swag.\" They displayed the huge impact they made in India and how EDM is evolving not only there but around the world. There were such sweet and touching scenes with their families, especially showing the struggle of keeping in contact while on tour. They played \"Don't Worry Child\" when they would turn down the music and just listen to the crowd, which left me with goosebumps. There were beautiful moments in this film, but you still feel conflicted when you finish watching it.<br><br>I just hope that when you watch it you take away less of the negatively that they displayed and just focus on the One Last Tour scenes where you have no other choice but to sing and dance in your seat. <br><br>p.s. And even though LA was technically their last personalized show, they didn't display any of it. And if you were there, you would know that feels like being robbed. (clearly not SHM's fault, but the producers...wahhh wahhh)","user":"rmalekoff","rank":[10,17]},{"title":"A great documentary for a great group","rating":10,"date":"11 August 2014","review":"After watching the Leave the World Behind: One Last Tour I had only one word on my mind: Why? Why this great trio had to broke up? Of course the answer on my question was cleared through the 95 min. of total duration of the film. We can witness how these DJs prepared for their last tour but also I had the chance to learn about their first steps in the music industry. How they met, ho they formed the group and finally how the conquered the EDM world. I have mixed feelings right now. We've lost a great group but it was unavoidable. They stop the exact moment where they should. At their peak! At their very best! They could really stay 3-4 years making some tracks but would they be same or higher quality? I doubt it, as they do at their film. Also, their friendship was already in steak after a while and we can tell watching the film. There where conflicts constantly and they where about to lose their magic. Bottom line, this is a ***** star film and a MUST HAVE for every Swedish House Mafia or EDM fan.","user":"cmvaggs","rank":[3,4]}]