[{"title":"I've Seen Worse","rating":6,"date":"7 January 2015","review":"I had very low expectations going in regarding this film, so I'd have to say it overall was somewhat better than I anticipated. Yes, it has some really ridiculous plot elements, but it does maintain a fair degree of tension throughout and might serve the viewer as simply an escape type flick. It also has quite the strong cast in John Cusack, Ryan Phillippe, Rachelle Lefevre, Jack Weaver, and Luis Guzman.<br><br>Set in Puerto Rico, a well-off couple Steven (Phillippe) and Shannon (Lefevre) arrive on the island to pick up their newly adopted seven-year-old daughter Nina (Briana Roy). It's all been set up by an international adoption agency run by a Mrs. Reigert (Weaver), who greets them on their arrival and arranges for them to stay at a resort for a few days until Nina's passport comes through.<br><br>While there, they're approached by the creepy and mysterious Benjamin (Cusack) and his two cohorts, and they start to feel quite uncomfortable with Benjamin's omnipresence and all his questions. Steven and Shannon change hotels, but soon find themselves right in the middle of a huge adoption scam called \"reclaiming\", and eventually even find themselves being kidnapped.<br><br>All of this will eventually lead to a wild, prolonged, and rather melodramatic ending.<br><br>All in all, as mentioned there's some gaping plot holes to be found in the movie, but I still thought there was enough here to be mildly entertaining. I've certainly seen a lot worse and felt it was worth the $1.59 I spent at redbox.","user":"larrys3","rank":[10,11]},{"title":"one of the worst scripts i ever seen","rating":1,"date":"30 September 2014","review":"The idea of the movie is great. It's suppose to be a great thriller. The man who wrote this script must find himself another job, because he has done all he can to ruin it. it's so unreliable and has so many holes and problems. If i ignore the script and the bad acting, the sites of the film are very beautiful. i don't understand how John Cusack agreed to play in this movie. Luis Guzman got himself a bad role, and he performes very badly in it. I think he was discussed of the script so much he couldn't do it right. If you like thrillers, do yourself a favour and DON'T watch the movie. Sometimes the score of a movie in IMDb lies, but this time i think the grade of the movie does a mercy with it.","user":"yaniv_ya3","rank":[39,60]},{"title":"Such an annoying movie!!!","rating":2,"date":"27 October 2014","review":"Try as I might otherwise, I am certain the NO ONE is as dumb as the parental couple in this film. Every decision the parents make is wrong. Upon multiple reviews, I could not come to similar choices if I were in their place. Again and again common sense is replaced by sheer stupidity. My frustration level was so high after watching, that when I returned home after watching, I was yelling so much at these simpletons that my dogs hid from me. If the writers and actors intent was to frustrate the paying patron with idiocy, I wish they'd let us know ahead of time so we could perhaps dig a hole in the back yard and toss the admission money into it instead. Anger and annoyance from the waste of my time.","user":"sensory-746-150115","rank":[24,36]}]