[{"title":"Not much can be done with a Skeleton Ghost.","rating":4,"date":"8 October 2016","review":"If you're about to watch this movie, you should put behind the logic of the ghostly thoughts you have. It's a predictable movie with a common plot of 'friends having fun a abandoned pretty place'; which doesn't work out as the way they planned. <br><br>After watching the movie i myself think that much could have been done to make the movie thrilling, story wasn't good, but, you can't do much with a skeleton ghost. Acting was Okay, Tom Zembrod (The Knucklebone) did good, cinematography was mediocre. Watchable if you don't have anything to do. Good that they didn't decide to longer the plot more, it could have been a nightmare then. Good twist in the end i may say.","user":"parasvanzari","rank":[8,9]},{"title":"No bones about it...this is the acme of awful","rating":1,"date":"20 January 2017","review":"\"Knucklebones\" might be the worst movie I've ever seen, and I've seen a lot of bottom of the barrel schlock. Let's review what's in store for the unwary who are about to give up precious minutes of their lives watching this threadbare attempt to create a killer skeleton franchise.<br><br>Grade Z acting by the casting call relatives of the guy who dumped this steaming pile on an unsuspecting world. No one seen here is the age they're supposed to be, except for a pre-teen girl who didn't have enormous boobs that could be used for titillation purposes. See what I did there? Way more inventive than anything ol' Knucky can offer. The teen girls look like pole riders from a seedy bar. Of note is the 30-something \"best friend\" of the suicidal main character who's channeling Paris Hilton. She pouts, wears tight sports bras and booty shorts and just loves herself. Other females seen in this stupidity readily bare the bazooms and get killed by the Knucky-thing. Bad gore and the prerequisite hilarious one-liners by the skullguy. You won't understand 99% of what he's cracking off, probably because the actor person under the terrible mask has a cloth over his real mouth so you can't see his real teeth. This is visible every time Knucky gets down and verbally assaults his prey. Naturally all the activity takes place in an abandoned factory in Texas, that has occult ties to the Nazis! This is explained as \"wartime profiteering\". Uh huh. Spooky things are discovered, Knucky is invoked and bad juju happens. Can someone explain why the electricity is still running in an abandoned factory for decades? <br><br>The story makes no sense, and the writer/director didn't really give a damn. He gets very close to porn, which is what this whole stupid movie really wants to be. Might have been better that way, to think of it. One star for the scene in which a stud muffin, who's wearing pants, gets castrated while his top-heavy gal pal rides the about to be severed member. Knucky jams a saw on a stick up the girl's backside, cuts off the stud's junk and then cuts the cowgirl in half. Family fun! Come to think of it, Miss \"Paris Hilton\" gets the sharpened end of a broom rammed up her perky posterior, where it comes out of her mouth. Hmm. The director of this mess has issues. Thanks for sharing!<br><br>This isn't so bad that it's good. It's just bad. Shot on a digital camera so old it's one step away from a camcorder. The titles alone look like an old paintbox program from the late 80s. The ten star reviews here are most likely from family and friends of the director. Avoid and do your laundry or watch paint dry, either is a more fulfilling undertaking.","user":"Atomickid1950","rank":[14,18]},{"title":"A Joint Effort","rating":4,"date":"22 October 2016","review":"The Nazis create a demon that you can summon by rolling knuckle bones and saying a few words for the purpose of wiping out enemy troops. This demon is a Jason type with a Freddy voice and his sense of humour. Years later the bones are found in a box stored in an old factory. Wouldn't you know it some teens play the game and summon Knucklebones.<br><br>This one had so much potential. When Knucklebones is summoned he needs a body to come through. Your bones will just start snapping and sticking right through your skin then he crawls right out of the person leaving a spent corpse. When you see this you think this film is going rock but then it never does. It just seems muddled.<br><br>One problem was his voice which was a distorted Freddy. You could make out his one liners sometimes but mostly not. Everything seemed to wrap up quick which I think the writer sort of wrote himself into a corner. He has Knucklebones stop pursing one of the last survivors only to leave the factory and go all the way to the survivors house to go after the young sister. What's even worse is the sister is waiting in bed with a bow and arrow. What? The one thing I laughed at the hardest was what she went through to get some new knuckle bones. She makes Ash look like a sissy.<br><br>I hope a different writer gets to do the sequel.","user":"shawnblackman","rank":[8,11]}]