[{"title":"Surely this is a joke?","rating":1,"date":"19 October 2015","review":"Bad direction, bad script, bad production, bad research and acting. This is very low budget (nothing wrong with that) but it shows. According to this the Battle of Devil's Bridge was fought by about ten people. The scenery around the North West of France is snow capped mountains (it isn't) and the first castle they battled in was defended by one knight. <br><br>Had to give up after just fifteen minutes (if that but it felt like longer) and walk out. Felt to me like they were just mugging me off.<br><br>Apparently I need ten lines of text for the review. Which is ten more than the film merits. Originally, all I wanted to say was \"Oh dear. Why?\"","user":"collioure_bee","rank":[46,51]},{"title":"Don't waste your time or money","rating":1,"date":"30 August 2015","review":"Probably the worst film I have ever watched. Poor acting, directing, filming, &amp; script. I have nothing against low budget films but this is incredibly bad. It is the type of film you would make at school. It is a great shame because it could have been so good. The one thing that is good is the costume &amp; set. Still something is not quite right with this though. It is all a bit to clean! When the film starts you think once the intro is over it will turn into a normal film, it never does. The scene isn't set very well, the introduction to characters is poor a confusing. In summary this did reach my expectations of what looked to be a very good very. It didn't even come close.","user":"jlittle-86119","rank":[34,43]},{"title":"Interesting","rating":4,"date":"17 December 2016","review":"It is clear that this title received little funding, but given that it has some pretty good sets, locations, weapons, costumes and sound design.<br><br>The actors are amateurs, and whilst there are some terrible performances (including a few bad attempts at the French accent) many of the actors are pretty good, and the camera work is well framed on the actors and their motions.<br><br>There clearly is a plot although I couldn't tell you what it was.<br><br>As far as films go this is an amateur production, but as far a amateur films go this is a pretty good effort.","user":"AnonymousCritic","rank":[4,4]}]