[{"title":"The ending","rating":10,"date":"30 December 2019","review":"Some comments lament the movie has changed from the book (especially the ending). I heard a Greta Gerwig interview today where she explained she studied Louisa May Alcott and found out Alcott, in actuality, was pressured by her publishers, to marry Jo at the end of the book. Gerwig wanted to honor Alcott by ending it the way it really was meant to be. This knowledge made the movie so much better for me.","user":"nancyrn916","rank":[295,371]},{"title":"Powerhouse Performances and Skilled Directing","rating":8,"date":"1 January 2020","review":"\"Little Women\" is the classic story of the four March sisters growing and learning about the world together in the northeastern United States during the 19th century. We have Jo (Saoirse Ronan) - the strong-willed writer, Meg (Emma Watson) - the softer, more traditional sister, Beth (Eliza Scanlen) - the quiet one, and Amy (Florence Pugh) - the spirited and most immature. Marmie, the mother, (Laura Dern) oversees the girls while the father is at war.<br><br>They're a charming bunch, different in their own way. The headstrong Jo believes she has this whole life thing figured out, and she often urges her sisters to follow her suggestions, which are an ounce of urgency away from becoming outright demands. Despite Jo's efforts, each girl possesses the gusto to follow her own path, and ultimately, they live the lives they want to lead as little women.<br><br>Greta Gerwig delivers a wonderful adaptation of the classic novel, perhaps the best to date. Give her plenty of credit for the work, just make sure to also credit the actors. They're all brilliant. The girls give outstanding performances, as does Timothee Chalamet as Theodore Laurence, the boy next door to the girls. Everyone calls him Laurie, everyone except Jo.<br><br>Jo and Teddy, as she calls him, share an instant and lifelong connection. They love each other immediately and always. It's clear as day to everyone. The only person who doesn't seem to see it is Jo. Focusing on her writing and drive to show the world that women are worth more than their appearance, Jo has no interest in marriage or love. But this is a story, so the two will have their chance.<br><br>Here comes the SPOILER.<br><br>I'm sorry to question the writer of such a wonderful story, but with the clear love between Teddy and Jo, why in the world do they not end up together? The movie's version of the story attempts to explain it but fails miserably. In every scene Teddy and Jo share, the two characters display magnetic chemistry - the rare kind. Nothing can keep them apart. Except for an unfathomable choice by the author of the novel. Jo turns down Teddy, who turns to Amy for her hand in marriage. She says yes. This works well for Amy because she had always loved Laurie, as she calls him. But Jo is later so upset and desperately lonely that she immediately agrees to date a professor she met while teaching young writing students. The two get along fine. Just fine. The two get together after he shows up at the March home one day, spends a bit of time with the family, then leaves. As soon as he walks out the door, the rest of the family shouts at Jo that she loves him and should chase him. What? It's laughably absurd, as there is zero indication that Jo actually loves him. I hate to say this because I liked the movie very much, but this misstep in the story must be called out. Jo and Teddy should be together. Yes it's predictable, but it's the correct ending.<br><br>END of SPOILER<br><br>Gerwig makes a beautiful film, sagely including enough light moments to complement the heavy theme material that makes up more of the movie than younger viewers might notice. Gerwig establishes a fitting tone, lighting and style, all elevating the overall film. With all that she does well, she also makes one curious decision, which is to sequence the film completely out of chronological order. It never totally works, more often taking away from the story than improving it. The choice is one of the couple tiny blemishes preventing the film from being flawless.<br><br>For anyone and everyone, \"Little Women\" is worth seeing. See it with others and talk about it afterwards. It'll be well worth your time.","user":"Jared_Andrews","rank":[64,79]},{"title":"a fascinating film!","rating":8,"date":"18 January 2020","review":"This film is simply spectacular! The acting is superb by everone in the cast, the attention to detail here is just breathtaking. I was wondering during the film that how much time and effort were into making this movie.<br><br>I was a bit annoyed by the non-linearity of the script and thought it was overdone but besides that I enjoyed this film a lot. Go see this.","user":"mbrcf","rank":[46,56]}]