[{"title":"An Overwhelmingh Historical Tale","rating":8,"date":"24 November 2017","review":"I happened only 70 years ago and so many young people have never even heard about it. How can it be? And, how dangerous. Not to know will always put you at a disadvantage, oh yes, sooner or later. Trumbo feels like a story set in a totalitarian Country and yet...The spread of fear is a powerful weapon used by self-aggrandizing sociopaths. Joe McCarthy's success is still a mystery to me and Trumbo proves, in the most riveting way, how easily we can fall in that trap. Bryan Cranston is simply, sensational portraying a true American in all its contradictions. I never really thought of the actual degradation Trumbo and the other blacklisted writers went through until I saw it in Bryan Cranston's face. David James Elliott portrayal of John Wayne is chilling and disturbing, specially because id true. I've heard from people who knew him, what a nice man Duke was and yet...Helen Mirren as Hedda Hopper was another chilling and unexpected portrait of utter ignorance. I've only recently found out that she was behind the forces that wanted Charles Chaplin out of the Country. Congratulations to director Jay Roach and to a spectacular cast. Let's hope everyone pays attention.","user":"fanaticusanonymous","rank":[78,91]},{"title":"Bryan Cranston owns the screen","rating":8,"date":"18 October 2017","review":"All movie fans should recognize the name of Dalton Trumbo. Even if his heyday was a good half-century ago, his actions during one of Hollywood's very darkest periods still have tremendous impact even today. Especially today, for that matter.<br><br>Some quick background. You may recall that in World War II, the US and the Soviets were allies but that after the war we became distrustful adversaries. This time was known as the Cold War – since the two countries didn't fight one another – and really ended only in the late 1980s. Prior to the end of WW II, many Americans joined the Communist Party as a way to fight the rise of Fascism in Europe. After the war, current and former members of the Party were looked upon as pariahs of the highest order. Screenwriter Dalton Trumbo (Bryan Cranston) was one of these pariahs. It didn't help that he actively tried to rally technical workers on film sets (grips, lighting and sound technicians) to strike for higher pay. Unionizing was seen as a bad thing, despite the gains it had achieved for American workers earlier in the century.<br><br>Trumbo's membership in the Party wasn't a big deal at first, but then gossip columnist Hedda Hopper (Helen Mirren), who wielded an enormous amount of power in Hollywood, took it as a personal affront and used her column (and weekly appearance in newsreels) to denounce Communism in general and Trumbo in particular. Kicking the whole scandal into high gear was a little-known congressional group – the House Un-American Activities Committee. These guys tried to rout out Commies from Hollywood (which it saw as holding a lot of sway over Americans, much more so than today) by calling a group of known or suspected Communists to Washington for sworn testimony. These men were known as the Hollywood Ten. Trumbo was one of them, and he refused to tell the committee the names of anyone else who was or who could be a Communist. He, like his fellow Ten members, was found in contempt. Later, someone not in the group did name Trumbo, and he was put in prison for a full year.<br><br>When he got out, no one would hire him (or any of the others in the Ten). Except for King Brothers Studio, which couldn't pay him much. But Trumbo worked fast as both a writer of original stuff and a fixer of existing scripts. The Kings loved him. So much so that the others in the Ten were offered jobs (for no credit, same as Trumbo) working as script doctors. During this time, Trumbo also got work from some friendly sorts in the business by selling them a script but not taking on-screen credit; the credit typically went to a fictitious person, or to a willing accomplice – known as a front. Through this method, Trumbo won two writing Oscars – although no one knew it at the time.<br><br>Dalton Trumbo fought for himself, his fellow writers, and for anyone for whom the Bill of Rights holds any meaning. He reasoned that if people could be silenced for political beliefs, then anyone could be silenced for any reason. This is, unfortunately, still true today. And although he didn't receive credit at the time, Trumbo was awarded his Oscars eventually (one posthumously). He's recognized as being one of the very greatest screenwriters the world has ever known. The movie does a terrific job describing Trumbo's struggles – and that of his family: his wife Cleo (Diane Lane) and his three doting children. The toll that his stance took on them was noticeable to everyone except for Trumbo himself.<br><br>Cranston turns in what was an Oscar-nominated performance, but his was not the only one of note. Lane is superb as his suffering, strong better half. Elle Fanning, as his eldest daughter, is also a standout, as are John Goodman (as Frank King) and Alan Tudyk (as writer Ian McLellan Hunter). Spellbinding from start to finish, and all screenwriters owe Trumbo a huge debt of gratitude for his long struggle on their behalf.","user":"dfranzen70","rank":[34,38]},{"title":"A Very Important Film","rating":8,"date":"7 December 2015","review":"I give this movie an 8 out of 10. I think, technically, it deserves a 6 or 7. It hinges on the modern notion that a biopic isn't complete unless we see all the nuances regarding the protagonist's family life. That is not necessarily the fault of the filmmakers. I don't think a picture can get funded if it doesn't adhere to these modern foibles. I give it an 8, however, and, for its purpose alone, it deserves a 10.<br><br>It takes guts to make a movie like this today.<br><br>In the United States, we tend to get comfortable and forget that the concept of freedom of speech is the most important idea any human being has ever put forth. We tend to forget that the powers that be don't like that idea. <br><br>They really, REALLY don't like that idea. <br><br>They want us lowly masses to be good little sheep and do what we're told and think exactly the way they want us to think. We tend to forget that fighting against that tendency of power is a struggle, a painful, sometimes lethal struggle. Folks in other countries know about it. They know all too well. That's why, in spite of all the other problems they may have with the U.S., they still want to live here.<br><br>But we've gotten lazy. Not only are there forces on the extreme right that would like to dictate how we live, think, and even breathe--now we have a warring faction from the left, seen most prominently on college campuses, that embraces censorship and the \"shutting down\" of alternative opinions like little McCarthys on methamphetamine. The concept of a \"safe space,\" where no \"offensive\" opinions may be heard, is nothing short of censorship. Defenders of this nonsense often make the claim that the government is not getting involved, therefore, it's not a violation of the First Amendment. Here's what's wrong with that argument:<br><br>1. Remember our old friend Katherine Hepburn in Adam's Rib? In her closing arguments, she says the law has two parts--the letter and the spirit. It's true, by the letter of the law, students harassing and banning speakers on campus they don't agree with does not equal the federal government censoring those speakers. But it does violate the SPIRIT of the First Amendment. The government, as the film Trumbo clearly shows, cannot always be trusted to safeguard the LETTER of that particular law. It is up to us, We the People, to safeguard the SPIRIT of that law.<br><br>2. Trumbo shows us the horrific world where the government trampled on the First Amendment from the top down. What is happening on college campuses today is that violators of what is deemed \"politically correct\" (a phrase originating from Mao's Cultural Revolution, which should raise several alarms on that basis alone) are subjected to kangaroo courts on the campus, away from legitimate, LEGAL courts of law. They are harassed and humiliated (just as dissenters in the Cultural Revolution were) with no legal recourse. If this practice becomes accepted in normal society, we will have a political environment no different from the times depicted in the film. The only difference--this time, it we have started with the people and spread to a government ready and willing to enact \"speech codes\" for its own purposes.<br><br>By now, those who still, stubbornly, cling to the notion that there is nothing wrong with what is happening on college campuses today will have dismissed this review. They might even leave typical ad hominem attacks on the message boards to make what attempts they can to silence me (to kill the messenger, if you will). This should very well indicate that what I've said is true.<br><br>The sane people reading this, no doubt, are asking what the heck this all has to do with Trumbo.<br><br>Answer:<br><br>Everything.<br><br>Having been subjected to a kangaroo court on a college campus where I was called in to the Title IX office for teaching Vonnegut's \"Harrison Bergeron,\" I couldn't help but think, as I watched Trumbo, of the horrific witch hunt I was subjected to. That the film so easily earned my empathy is a testament to how well it's made.<br><br>I wish everyone involved a long, healthy career in the movies. We need more stories like this, stories that remind us the struggle to survive as individuals in a world that so stubbornly clings to collectivism is a never-ending battle. It's happened before. It's happening now. If we don't speak up and resist, it will continue happening in the future.","user":"litcity","rank":[180,233]}]