[{"title":"Not My Type of Horror, but You Might Enjoy it.","rating":4,"date":"13 May 2015","review":"OMG! I rooted for the badguy, even though he was stupid. However, the kids were dumber than most I've seen in horror films.<br><br>Yes, this was low-budget. I have to say they had good kills, if that's your thing.<br><br>Kirsty was the most annoying character. She was mean from the start and rather confrontational for no reason. When they got up the next morning and Mark and Jessica were missing, it was like a scene was missing.<br><br>When the killer had three of the kids in his lair, I thought it was weird. He killed anyone else in the woods where he found them, but he decides to knock out the kids, drag them all the way back to his place for some ritualistic torture. It wasn't consistent with the other kills.<br><br>If you're bored, and you want something to watch, maybe you might enjoy this. I do not recommend, because it almost put me to sleep (no joke).<br><br>BTW, the people who died deserved it for their stupidity.<br><br>I gave this a 4-star rating. It would've been lower, but I could tell they did try to put together a fun movie, and I think effort counts.","user":"chrismackey1972","rank":[23,29]},{"title":"Wow this is bad!","rating":1,"date":"14 May 2015","review":"This movie was truly awful. It's a try by the creators to make a Friday the 13th style slasher, but it fails miserably.<br><br>The makeup effects for the killing scenes were actually quite good, but if that is the only good thing out of this movie, then it falls completely flat on its face. IF the creators had spent a bit more time on this, planning out the script, more rehearsals for the actors, it might have been better.<br><br>The acting... well, honestly there wasn't any. TRULY stupid decisions were made by the actors in this movie, making it almost a joy to see them done in lol. Do yourself a favor and give this one a pass. All the \"great\" reviews I've seen on this one obviously came from friends/family of the crew/actors.","user":"ScottM2753","rank":[18,24]},{"title":"If you like bad, this is the one for you.","rating":1,"date":"15 May 2015","review":"To be honest, I haven't read any reviews before watching this thing, shame I haven't. This movie is complete junk, there's no horror in it, the gore is bad and is only slightly better then the lame text.<br><br>Now lets start, the movie doesn't bring anything new to the screen, it follow a pattern of other movies like it. Friends going to the wood, gets killed, end of story. However, other movies following this pattern might bring better effects, better dialogue and much better actors. You can pretty much see this movie is junk right at the start when you hear the sound of the knife and few seconds later, the axe, is the same sound. So they took the same audio file and just copy &amp; paste it every time, they didn't bothered to even slightly change the pitch, speed or EQ (something that can be done in almost every free audio software out there) yes, it's that bad.<br><br>As I said the dialogues offers nothing new, and the players reading them are just MEH. All monotonic, without highs and lows, all in the same pace one word after the other. <br><br>Now lets see some more. In the part when they all sit around the fire and someone tells the story, how can someone screw in this one? I have no idea, they might sit next to the fire, but there's no read evidence for that, the light source is not the fire, or the moon (which supposed to be full) but from external light source, just normal light bulb from the set, dear director, how high were you when filming this one? <br><br>Still, I watched it to the end, I actually thought it might bring something in the end, but no. Just the big old disappointment. One last thing, one of the characters had fake eyebrows (painted, or what ever they ladies call it) it was ugly, ugly ugly ugly. Even with that the crew screwed up. <br><br>So really, do yourself a favor, don't watch, don't think I might get better at the end, they dialogue is not getting better, the gore is not getting better, the and characters are not evolving and the killer will still be super lame version of Jason Voorhees.","user":"komer83","rank":[15,20]}]