[{"title":"Unexpected & Exciting","rating":10,"date":"19 November 2014","review":"I saw Gabe Polsky's new documentary at AFI Fest recently and was blown away by its robust sensibility. Not knowing precisely what to expect beyond the hockey element, I feared that my general lack of interest in sports would prevent me from enjoying the film. \"Red Army,\" it turns out, uses hockey as a mere vessel for a story about pride, friendships, politics, and passionate devotion to the art of a sport. Polsky's movie is his love letter to hockey and the titular Soviet team, who the film reveals were probably some of the best technical athletes of any age. Superlatives like \"best\" and \"greatest\" came with a heavy price; these guys were not just hockey savants, but devices in a political narrative about the USSR's ability to dominate the world in the waning decades of the Cold War. \"Red Army\" shows how the team was often intimidated by government leaders into doing what they were told and when. One of the more defiant players was team captain Slava Fetisov, the documentary's somewhat audacious and resolute central figure. The Fetisov of today, seemingly unworried about PR, does and says what he wants on camera, berating the director over what he feels is a poorly conceived question and scoffing at others. At one point Fetisov even gives Polsky the finger when the director's interviewing interrupts him checking his email. It's a hilarious, authentic moment that will make you love and remember the film. Without a doubt one of my favorite movies of 2014.","user":"khquigley","rank":[45,48]},{"title":"Perspective Shaper - Hard Men Real Relationships And Team Bond","rating":9,"date":"5 October 2014","review":"I came away from this movie deep in thought, trying to piece together the personal journeys of the cast, the context of life in the USSR, the changes and resulting impact upon the players lives. <br><br>This documentary is well researched and highly viewable, it is not just a male only film.<br><br>Women get to see stripped to the bare bone, deep male team bonding, open responses to complex relationships and real meaning as to how 5 men dominated a sport in the USSR and the Americas.<br><br>The death of one of the cast members shortly after the movie added a melancholy touches, yet there is humour from both Gabe Polsky and Vyacheslav Fetisov. <br><br>It was clever, I see this documentary staying around for some time, certainly one to watch again.","user":"ZRHZurich","rank":[36,39]},{"title":"Among the greatest sports dynasties ever","rating":9,"date":"31 December 2018","review":"Red Army (2014) documentary, directed by Gabriel Polsky, retells the story of probably the greatest dynasty in the history of sports, the Soviet Union national ice hockey team of the 1980's, and its best five-man unit featuring Viacheslav Fetisov and Alexei Kasatonov on defense, Vladimir Krutov, Igor Larionov, and Sergei Makarov (aka the KLM Line) at forwards, all in their 20s, aided with the legendary goalie, Vladislav Tretiak, in his 30s. The five dominated national and international hockey for nearly a decade.<br><br>Having foundation of their game laid by Russian hockey coaching pioneer Anatoli Tarasov, based on creativity, organized team movements to create and win the space, as well as individual puck control, with its timely transition into an empty space on the next zone of the rink, ultimately to a player in prosperous scoring position, Soviet players, additionally subjected to military discipline added by Tarasov's successor, head coach Vladimir Tikhonov, who took over the Soviet national team in 1977., skated three times a day, eleven months of the year, \"perfecting both their individual skills and their teamwork\". Knowing that \"copy is never as good as the original\", creative \"father of Russian hockey\", Tarasov, sought inspiration from other team sports, even from theatrical arts, primarily ballet, to create a unique style, \"a completely new way of playing hockey, which changed the sport\".<br><br>I was lucky to watch alive two games of this incredible hockey team in 1984 Winter Olympics in Sarajevo, the first one early in the competition and the last one in the finals. In the opening round, against Cubans, USSR won comfortably, and in addition to enjoying the game and individual virtuosity of USSR players, managing to combine two seemingly incompatible traits, improvisation with harmonious and fluent team play, comparable maybe only to similar traits of the best jazz orchestras, by having being coincidentally seated right in front of him, I was also listening to the professional comments of Ivica Osim, one of the greatest footballers to grace the soccer fields of Sarajevo, who has had thus far spent most of his active career whether playing for or coaching my favourite local team \"Zeljeznicar\", and was soon to coach national team of Yugoslavia. It was pure delight to listen to professional comments this great football enthusiast and expert had about the style and strategy of the Soviet national hockey team, and about the skills of its players, as well as comparison between the two sports, level of individual skills and tactics applicable in both. I can clearly remember Osim's comments and his longing for soccer outfield players of comparable individual skills, conditioned for so called total football, based extensively on player's capability not to cover only for his nominal position in the field, but, as it becomes required, to take over the role of any other player in a team.<br><br>Strength of this team composed of players with incomparable skills was shown in the final game. Although the end result was not impressive, 2:0, nearly routine execution left no doubt who's dominant, and another participant, Check Republic, practically had never had a chance to win.<br><br>Documentary, cleverly composed from interviews with three players of thus far surely the best five skater hockey unit ever to hit the ice, and from mixture of archive footage from their games, trainings and other life events, by showing how great and undefeatable they have been, really does them a great justice. Therefore, in the rest of this review I'll rather just add the words of the \"Red Army\" director, copied from a featurette \"Gabe Polsky Hockey Commentary\" found on a DVD:<br><br>(Red Army-Director Gabe Polsky discusses the essence of Soviet hockey-2014)<br><br>\"I'm Gabe Polsky and I directed the movie Red Army. The Film is about the Soviet Union and the greatest sports dynasty in history. The Soviet Union national hockey team revolutionized sport, they took hockey and sport to a whole new creative level. When I was a young kid and I watched for the first time (the) Soviet Union play in a 1987 Canada Cup VHS tape it was a religious experience, it was incredible what they did on the ice creatively. This was the best hockey ever played in history. In the series you saw the greatest players from the Soviet Union face off against the greatest Canadian players. (Starting Lineups: USSR (Fetisov, Makarov, Larionov, Krutov, Kasatonov) vs Canada (Grossman, Gartner, Gretzky, Messier, Bourque).) The Soviet style play here is like a finely tuned symphony: the passing, weaving, improvisation. (situation description) Krutov hits the puck out of the air to his team mate Makarov who has a breakaway: improvisation and awareness. (situation description) Here we see how they knew each other so well they could almost play blindfolded together. The passing is like an artistic tapestry. They transitioned fast and confused defenders with their movement. (situation description) Here we see incredible skill and creativity, and a sense of one other. This kind of hockey was incredibly fun to watch. (situation description) Here we see how quickly they punish you for mistakes. (situation description) This is one of my favourite players showing the skill level of the Soviet players... (situation description) The Soviet game and style is all about puck possession and passing we see here. (situation description) Here's Sergei Makarov, one of the greatest magicians in hockey history, passes to Krutov and then has an accurate shot. (situation description) Here tremendous skill, being able to shoot from any position. (situation description) And this here (Demiensky breakthrough and score), my friend, is pure art... the essence of hockey.\"<br><br>Learning the essence and enjoying the art of ice hockey, indeed, while delightfully watching masters of the ice rink in their stellar moments.","user":"Davor_Blazevic_1959","rank":[30,33]}]