[{"title":"Watermelon Sized Buds!","rating":5,"date":"28 November 2016","review":"A British fantasy comedy done as a variant of Jack And The Beanstalk. A young man heads to Amsterdam to find his father who runs a surf themed smoke shop. After finding his father he finds out his shop is failing due to the shop across the road that takes all the business with their green giant theme. The young man ends up meeting a mysterious homeless man who gives him a magic seed. The seed ends up in the toilet and the next day a massive pot tree takes up the whole store with buds the size of pumpkins. This puts him back in business but soon has the competing store plotting on how to steal the bud and enter it into the Amsterdam Bowl.<br><br>This is a light stoner flick mixed with a bit of Time Bandits and Jack The Giant Slayer type themes. It is watchable (better if you're high yourself) and you will laugh a few times. Not for kids though as there is constant joint smoking and coarse language (joint smoking is hard on the throat). All in all not bad and they even throw in a few minutes of animation. There was even a moral or two but I can't remember.","user":"shawnblackman","rank":[6,7]},{"title":"Silly, juvenile, tacky and a shed load of fun!","rating":7,"date":"17 October 2016","review":"If you love Stoner movies you'll enjoy it, if you don't... you probably wont :) Its stupid, childish and tacky... and I enjoyed the hell out of it. If you've ever been to Amsterdam and got stoned you'll get all the in jokes. Probably longer than it needed to be, but its low budget excuses most of the issues with editing and production. Acting is a little wooden, and the 'bad guy' reminded me more of a gangster leprechaun, but the supporting cast keep the laughs coming and the dwarfs... evil dwarfs.<br><br>Fantastic to see Howard Marks give his final performance on screen (RIP Howard we miss you!).<br><br>*note: Amsterdam Coffeeshops aren't really like this but never mind its fun! Non stoners probably shouldn't bother though...","user":"alex-wilson-577-761270","rank":[9,14]},{"title":"Silly, Stupid, Stoner Flick!","rating":8,"date":"11 February 2017","review":"Whether you're a stoner or not, Amstardam The Movie/Stoner Express is funny regardless. Can't fault the production or actors and the locations looked amazing. <br><br>Best performances have to go to Kenneth Collard (Eddie) and Eric Lampaert (Loz) as both were hilarious. The narrative has that 'Jack and the beanstalk' (or 'greenstalk') feel to it which was a nice touch and it was great to see the legend Howard Marks appear at the end too (R.I.P) for the Amstardam cup. <br><br>It's good to see a well made British stoner film with a decent score, something that is quite hard to come by! Oh and the 'powerpuff girls' inspired animation looked excellent too...","user":"hevkinz","rank":[4,5]}]