[{"title":"For me, a near masterpiece","rating":9,"date":"26 June 2016","review":"I'll tell you what you need to know: if you like movies like this, you'll like this one. Maybe a whole lot. It's a science fiction movie with heart, that doesn't rely on explosions and death rays and warp speed travel, and it sheds light on things that are happening in our society today. The acting is very, very good. There is genuine chemistry between the leads, and they were both born to play these parts. The movie makes you think and feel. It's smart and it's deep. It's internally consistent. The soundtrack works. You can learn from it. There aren't anywhere near enough movies like this being made these days.<br><br>Some people hated this movie. A lot of times, I think people that hate a movie like this are people who don't like the fact that their own shortcomings are being exposed.<br><br>For me, when the movie ended, I experienced body-wide chills, and my eyes filled with tears. I loved it. I subtract a point because, from time to time, it moves a bit slower than it might need to. It's not quite an all time science fiction masterpiece, but it's close. It'll move you. You'll remember it. It'll give you something to talk about. It's a date movie you can both enjoy.<br><br>If you like movies like this, you know who you are, and you can't possibly miss this movie. You won't. You're too smart for that.","user":"elliskjames","rank":[162,219]},{"title":"A movie about suppressing emotions will make you pretty emotional","rating":10,"date":"5 October 2015","review":"I don't think this film deserves the bad reviews it is receiving. Of course everyone has different opinions on a great film. Personally, a movie is good (or great or excellent) if it sticks with me for a while after. I found myself thinking about the main characters for a few days after watching it at the Toronto International Film Festival. This film made me feel many emotions for the characters -which is very ironic considering the main theme of Equals. I thought Kristen Stewart and Nicholas Hoult had excellent chemistry and portrayed their characters so wonderfully, and that's an impressive accomplishment if you remember the characters for the most part are supposed to be emotionless.","user":"meredithclarke-57041","rank":[149,217]},{"title":"It messed with my emotions","rating":8,"date":"14 December 2018","review":"There were a lot of parts about this movie that I didn't like. I'm tempted to give it a 7. Then I remember the way that it affected me emotionally, and I have to bump up the score. It made me think, and made me very sad. I feel a little traumatized at this point, but for me, that's a good thing.","user":"msmoogoo","rank":[6,6]}]