[{"title":"RE: a young woman seeks meaning in an empty world 10 October 2014 <> by laara1101 (Canada)","rating":10,"date":"24 January 2016","review":"SPOILER: Hi Laura, To answer your question about what this movie is about. The whole movie takes place in the last few seconds of the girls life. As she is driving over the bridge the power plant explodes and kills her. What we see is her saying good by to all the people who truly loved her in life. <br><br>This is why after each chapter in the movie she ends it with saying goodbye to the person she was just thinking about.<br><br>The last scene while the grandfather is telling her what her grandmother said on her death bed is similar to what you hear the girl say through out the film.<br><br>The sleepy fellow mentions that he thinks that the power plan is going to explode at some point and i feel this is the source of the bright flash of light.","user":"dangeiger-15815","rank":[24,29]},{"title":"Beautiful but grim (spoilers)","rating":7,"date":"17 October 2016","review":"This movie is well worth seeing. It has beautiful photography and original story telling. A lot of the photography seems to be influenced by the photo-based art of Vancouver artists Roy Arden, Jeff Wall, Ian Wallace and others. It is the type of movie that is difficult but engrossing. I would watch it a second time to get a bit more out of it.It not your typical Hollywood fare. The movie is a series of flashbacks the main character has as she is dying. She recalls the people in her life who loved her. I wonder if these are typical Norwegians? Is Norwegian cinema always this depressing? And depressing it is! It's best to have your psychologist or AA sponsor near. Don't go see it on your own on a rainy autumn day in Vancouver.","user":"denman_isle","rank":[6,7]},{"title":"a young woman seeks meaning in an empty world","rating":6,"date":"10 October 2014","review":"I just saw the film at VIFF and didn't get it. It's not the first one I didn't 'get' -- that is to say -- what am I to take out of the theatre with me? was there a purpose to this film? some message about life that just passed me by? Granted, the main character is nice to look at and I understood that she was on a journey -- a search for meaning and love -- I didn't even mind reading all the English subtitles when they were speaking Norwegian -- when I could read them, that is -- somebody should learn how to do this properly -- yellow print on white background does not show up and I can't read at the speed of light either -- Despite these annoyances, there were some very creative visuals on the screen at times, although I'm not sure what they meant -- did they depict her internal struggle? Also there was some REALLY LOUD and strangely haunting music accompanying them and I liked this, even though I wasn't sure why -- and there were bleak locations -- empty hardware store, stark little room above it, girl eating out of a can -- and all the people she encountered could not love her, it seemed, in any real or normal way. They were mentally or emotionally ill in one way or another -- she had no normal relationships. Was this film all about her depression? Her internal suffering? Was she going to die soon and these were her last days on the earth? If so, that is if I were she and this is all life had to offer me, I would gladly go to my death. So when her grandfather tells her about his wife's dying and about how it felt like water, like electricity, like the noise of a fridge -- and we've heard that many times already in the main character's voice, am I to assume she is dying? Is hers a living death of depression that she is constantly fighting, and meaninglessness, which seems to come out of the mouths of the people she encounters? Is Norway part of the problem? Is there too much darkness? not enough light? Anyway, some creative visuals and sound effects kept my attention at times and there was some good camera work, but I gave it all my attention and I still didn't get it. NOt much on the Internet to help me either. My question is: What was this film actually about?","user":"laara1101","rank":[14,25]}]