[{"title":"New take on a coming of age tale for young teens in age of social media","rating":8,"date":"5 September 2019","review":"A great sign of a good movie is when it provokes discussion. This movie did that and more. In talking about it to friends and family and finding the short film that preceded it on the official website plus looking at interviews from the director and cast about the movie and short film I think I can finally do a review on this.<br><br>\nDirector and writer Tchaiko Omawale created the short film and followed it up with the feature film partially as a passion project. It was later in life when she realized she had a eating disorder when friends pointed it out to her. To help other teens in this new age of social media she also realized the loneliness some feel even when around others and wanted to help them deal with it and provide \"solace\" for them.<br><br>\nMost of the actors are outstanding and standouts are Hope Olaide Wilson (Sole) who was also the lead in the short movie. Chelsea Tavares (Jasmine) and Luke Rampersad (Guedado) who I felt delivered a critical statement in the movie. The trio had all been kissed by death and are a motherless trio.<br><br>\nKudos also to Lynn Whitfield (Irene) and Glynn Turman (Clay \"Pastor Davis\") who were also incredible. Even the adults have been kissed by death as well and have something to learn from pulling together with the teens.<br><br>\nWhen I discussed what was going on with others one thing became evident. This new age of the Internet with growth of Social media platforms has opened another Pandora's box for our world. With the level of information sharing and 24 hour news cycles some people are facing information overload and some people, especially young people who have never unplugged can easily get caught up in a protest mentality. With all the exposure to the negative things taking place some people are getting depressed or caught up in issues that can overwhelm them. Finding life's balance is the key and finding it with others makes it a whole lot easier.<br><br>\nVideography high marks. Music exciting at the appropriate times. Recommended watching.","user":"jrneptune","rank":[3,4]}]