[{"title":"Kudos to Netfllx","rating":7,"date":"10 December 2017","review":"Will it win an Oscar or an Emmy? Heck no. Was it fun to watch? Yeah it was.<br><br>Kudos to Netflix for making this. Tim Allen really shined and it was great to see Kurtwood Smith also. It was a good time-occupier, had a good ending. Cinematography? Script? Sound? whatever, it was fun and well cast.<br><br>Hope Netflix can keep producing things like this and \"Godless\". You gotta swing the bat to make a hit and \"El Camino Christmas\" was a solid single (while Godless was a stand up double, maybe a slide-in triple).","user":"sales-85","rank":[51,60]},{"title":"Pretty darn good, but not for everyone","rating":8,"date":"9 December 2017","review":"**WARNINGS**<br><br>First warning: If this were a rated film, it would be \"R\", not only for the multiple F-bombs, but the subject matter and plot.<br><br>Second warning: This ain't Hallmark. There are some funny moments, but overall, this is pretty dark. It's not a typical \"Christmas\" movie. In fact, there isn't a super strong connection to Christmas.<br><br>That said, I enjoyed it a lot. Tim Allen is definitely playing against type. I believe it's hard to play \"stupid\" convincingly, but Dax Shepard pulls it off. Michelle Mylett looks very familiar, but upon checking IMDb, it's doubtful I've seen her before. I predict we'll see a lot more of her. The rest of the star-studded cast turn in an excellent ensemble performance. <br><br>It's a bit predictable in parts, but still a very enjoyable movie. And in the end, you really are in the Christmas spirit.","user":"Mobius2000","rank":[37,48]},{"title":"A hit and a miss","rating":4,"date":"11 December 2017","review":"I only watched this movie because of the awesome cast and they're all really great here. My biggest problem is the tone of the movie. It starts off really good with some great humour, the characters are likable and all and you think this is how the movie will continue until out of nowhere it just goes off the rails and becomes some kind of drama / sort of action movie. It totally destroyed any potential the movie had. If anyone watched Tim Allen's 'Big Trouble' (2002) would know what I'm talking about. That movie is a great comedy and it stays that way from start to finish even though there's guns and action involved. Now this one really missed the target big time, unfortunately. It could've been a great comedy movie with such a great cast but I think they messed up hard, with their ideas all over the place so the movie doesn't know if it's a comedy or a drama or an action flick. Overall, it's watchable as a time waster but not something I would recommend readily for everyone.","user":"mako_reactor","rank":[25,36]}]