[{"title":"Marvel Needs to Revamp it's Animation Department","rating":3,"date":"2 December 2013","review":"The animation in the movie was horrible, and though there might be some people out there who may like this type of animation, I am not one of them.<br><br>The whole story was ridiculous and they completely failed in writing the Hulk. It makes me wonder if the people who wrote the story know anything about the Hulk in the first place.<br><br>I had fewer problems with Iron Man, although it seems his armour is indestructible or something since it doesn't seem to even get scratched.<br><br>Marvel needs to take a long serious look at its animation department and make some quick changes because they are way behind DC in overall animated film quality.","user":"Athanatos173","rank":[30,33]},{"title":"Heroes united, viewer disgusted.","rating":3,"date":"3 December 2013","review":"Hulk and Iron Man. Face it, here are the two fan favorite characters from the Marvel cinematic universe. It is no doubt that Marvel would see fit to milk these cash cows dry.Their answer: animation. Successful as Marvel's live action film projects have been, their animation projects left much to be desired. A downward spiral in quality which left off with the dismal \"Thor: Tales of Asgard\" led to a stint in visually impressive but narratively flat Japanese anime. Now, Marvel is dabbling in feature length CGI animation. The result? This.<br><br>Seemingly a very loose adaptation of the mobile app game \"Avengers Initiative\", IRON MAN &amp; HULK: HEROES UNITED sees our two titular heroes first at loggerheads then teaming up to save the world. Two H.Y.D.R.A scientists have combined Iron Man's arc reactor technology with the Hulk's gamma energy and unleashed an electrical energy creature called Zzzaxx. Standing in our heroes' way is a graveyard full of Wendigo monsters, a legion of robots and a goofy Russian accented Abomination.<br><br>A little background in the original game for starters. The game is a ripoff of \"Infinity Blade\" with a thin excuse for a story to tie one finger swiping fight to the next. This movie replaces that so called \"story\" with another that is just as thin and muddled. The original story was purely a Hulk adventure, with Iron Man only turning up at the end. The change feels forced and unnecessary, as if Marvel mandated that Iron Man be the main protagonist instead of the Hulk just because of his misplaced popularity. At least the character designs had been successfully ported over from the game, and they look awesome. <br><br>The artwork successfully combines powerful designs with a cel shaded look that replicates modern digital colouring used in the comics. Looks as if the comic panels themselves come alive. Unfortunately, visuals aside, the animation itself seems dated. The way the characters move, their facial expressions, they all feel stiff; like something made for TV from more than 10 years ago. Such lapse in quality, in this day and age of shows like Transformers Prime, is unforgivable.<br><br>The writing is no better than in TV programmes for ten year olds. Lame humour abounds (that running joke of the Hulk being hungry gets real old real fast), silly lines and childish dialogue. All of this set to mediocre acting and an Iron Man who sounds like some twenty year old fresh from university, not some veteran superhero millionaire. <br><br>With each new height set by Marvel's live action movies, there is a new low set by their animation productions. IRON MAN &amp; HULK: HEROES UNITED is the lowest as of 2013. Either it was done on a shoestring budget or nobody involved put one bit of effort into it. The whole thing is merely riding on the brand name of Iron Man and Hulk, out to cheat money from uninformed fans. <br><br>The scariest part? Marvel seemed to darn confident that this thing would turn a big profit that they put in enough clues for a sequel.","user":"xamtaro","rank":[22,25]},{"title":"Blurry textures, low resolution, uninspired story. Super short. Terrible","rating":1,"date":"3 December 2013","review":"Poorly written dialogue, awkward animation with movements that look like something from the 90s. Blurry textures, low resolution,<br><br>Uninspired story. Super short. Terrible. <br><br>Every spoken line feels like something that is aimed at 2 year olds, and at this day and age, even 2 year olds won't find it interesting. Characters argue like they are pre school kids. and they talk too much, a scene that MIGHT have been OK is ruined by the character stating the obvious. Please shut up. <br><br>Marvel might have won the silver screen but direct to DVD animated movies and TV series belongs to DC.","user":"lbaswjkja","rank":[26,31]}]