[{"title":"A funny sweet and likable little film, emphasizing character over story","rating":7,"date":"8 August 2014","review":"Two aging ex-brothers in law - the extroverted, lovable and slightly embarrassing Mitch, and the more introverted, sad-sack Colin take off for a getaway to Iceland. Their adventures are low key and episodic, but the comic rapport between the two men makes it hard to stop smiling. <br><br>There's no big catharsis or lesson learned, no moment when the smiles turn to tears, nothing that screams 'important movie'. Just an enjoyable hour and a half spent with two eccentric old guys finding themselves and each other on the road in a strange place. <br><br>The film looks very nice for it's tiny budget, and the two lead performances by Earl Lynn Nelson (a surgeon in real life) and Paul Eenhoorn (an accomplished Australian actor) create a fun naturalism that feels as authentic as if it was all improvised, with us just listening in on these two quite lovable older men.","user":"runamokprods","rank":[20,23]},{"title":"What do you do when you're Too Old to Rock 'n' Roll: Too Young to Die?","rating":8,"date":"26 July 2014","review":"I took the title of this review from the 1976 Jethro Tull album, which is an appropriate time period for this movie because Mitch and Collin, the two main characters in this movie, appear to be either pushing 70 or in their 70s like many boomers. Mitch was a doctor. Collin was a bank manager. Neither is working any longer. Both are now divorced. And alone. The two were married to a pair of sisters, which makes them ex-brothers-in-law but more important, old friends. It's giving nothing away to tell you that the movie spends five minutes in Kentucky and the rest of the time in Iceland.<br><br>This is a road trip movie that follows a set pattern. It starts sort of rocky, gets into a swing, there's a trumped up moment that drives the characters apart, then there's resolution. It seems like every road trip movie is written this way. Only the surprises differ. In this movie, there's a third main character that never speaks. It's the incredible geography of Iceland, which Mitch and Collin explore throughout the movie.<br><br>This is an enjoyable film, which looks lightly at some of the issues associated with growing older that many baby boomers just like Mitch and Collin face today. See the world through Mitch's and Collin's eyes and you'll feel a bit better about the journey. Better yet, buy two first-class tickets to Iceland like they did.","user":"steven-leibson","rank":[15,19]},{"title":"Dreary, Unfunny and Possibly Suicide-Inducing","rating":3,"date":"21 August 2014","review":"Actually the spoiler is that there is nothing to spoil about this depressing mess. It has no plot and no story. I'm a man in my 70s, and if at age 30 I'd thought that THIS represented my future I'd have been tempted to end it all right then. The principals are two old men. One has money and has not yet given up on life; the other is less wealthy and having recently divorced is glum, taciturn, self-pitying. The former dragoons the latter to go on vacation in Iceland, which he generously pays for, and relentlessly tries to bully his buddy into cheering up. They smoke some weed. They dance on the beach. There's locker-room humor and fart humor for connoisseurs of same but there is no real humor and no wit. The sound track varies from annoying to hateful. There are some handsome views of Iceland; however, the Northern Lights seem to have been off duty during filming, and I desperately wanted to see something, anything that would make this experience worthwhile.","user":"marsanobill","rank":[17,23]}]