[{"title":"Not horrible, just weak.","rating":6,"date":"10 November 2017","review":"November Criminals (2017) This&nbsp;is a crime drama about college bound friends find themselves falling for one another, but after the mysterious murder of their classmate, they defy the authorities to uncover the truth.&nbsp;The film has been released straight to video on demand, before a limited theatrical release. It stars Ansel Elgort (Baby Driver) and Chloë Grace Moretz (Kick Ass). These are two of my favorite young actors of today. Viewers had mixed reactions and critics felt it was very thin. Everyone seems to agree it failed to to reach its potential. There simply wasn't any movement in the film. I want to get an understanding of the crime. They failed to give us pieces to the puzzle until nearly the close of the film. This is actually a film that could have been far better with just a little more time. Both the love story and the investigation needed to be beefed up. It would have helped get the viewers more invested. I would have tweaked the ending myself. Not horrible, just weak.","user":"johnny-burgundy","rank":[57,60]},{"title":"Likable cast can't make up for the much ado about nothing story","rating":5,"date":"11 November 2017","review":"I usually love Chloe Grace Moretz's movies but this one isn't great. There just isn't quite enough of a story. It's a real shame with A list cast members even the supporting cast is good with David Strathairn and Catherine Keener playing parents. Ansel Elgort's acting is a little bit better but that's not saying a whole lot. The romance between the 2 is quite cute but the main story is really nothing much. A high school kid gets involved in finding out who killed a classmate. Don't really feel for the cause since there is no establishing story or plot with the deceased. Later he manages to find out who it is quite easily. The climax or lack thereof was hardly anything. I even wanted some kind of twist.<br><br>Not a must watch at all.","user":"phd_travel","rank":[24,28]},{"title":"Bored","rating":5,"date":"20 April 2018","review":"I had a hard time buying into the characters conviction which is what carries the story. It was also slow and at times boring with the storyline.","user":"jyuktirat","rank":[12,13]}]