[{"title":"I honestly don't get all the hate..","rating":8,"date":"13 March 2015","review":"As you've read, this is not your typical Adam Sandler movie.. yes it has it's jokes but it's not his typical shtick .. some of that is thrown in for good measure, but this is much lighter.<br><br>This has what I thought to be a very good story and even a nice twist, even though I saw it coming before it was revealed, it was still a nice twist.<br><br>I think this movie has a lot of heart and it has morality tale spun in for good measure.. It has a pretty good cast of characters as well.. I got my laughs, I got some sincere emotional moments and the \"yay for the underdog\" moments as well .. I left satisfied!<br><br>The KEY to this movie is don't go in with expectations.. if you're going there hoping to see another \"Click\" or \"Happy Gillmore\" movie you'll be disappointed.. <br><br>I honestly do feel bad for Adam because he's gotten typecast .. if he tries to step out of the expectations then people think he sucks.. Jim Carrey has fought that for a long time.. just as so many others have... Give them a chance!","user":"lonniew","rank":[162,218]},{"title":"Sandler's best film in a long time","rating":8,"date":"6 April 2015","review":"I used to be a big Adam Sandler fan, until he started phoning it in with the same kinds of immature jokes and \"safe\" comedies that sucked but still made a lot of cash.<br><br>I'm really glad he branched out and took a chance with this film; I think it really paid off. This film has a lot of heart, some decent comedy, and a nice story. It's more drama than comedy, but it's not too much drama. It even has a nice fantasy element without getting too caught up in it.<br><br>I don't get why it has such a low rating. I read some negative reviews by \"critics\" and thought it was another disappointment by Sandler, but I was pleasantly surprised to find out that it wasn't. Give it a chance, and if you're not already prejudiced, I think you'll be glad you did.","user":"spmact","rank":[98,133]},{"title":"The story is so catchy,, the comedy is fresh,, one of the best Sandler's movies in years ;)","rating":7,"date":"9 May 2015","review":"The idea of the movie is fresh new ... at the beginning it starts so vaguely intriguing .. if i didn't knew it's Adam sandler's movie and already had watched the trailer and knew it's a comedy i wouldn't get it from that start of New York 1903 story ;)<br><br>The plot is catchy starts easy understandable and grows nicely to the flip point where the shoe maker uses that magical \"stitcher\" machine we saw on the trailer and wears his first shoe ,, there is some predictability but it was still nice storyline to follow.<br><br>The screenplay is tight ,, perfectly written, the movie itself is purposeful ,, like literally \"put yourself in somebody's shoes\" what would you do !! Seeing how everyone's life really is ... having his own life, problems, having fun ...etc until things go waaaaay bad :D<br><br>Well as for the cast ,, i mean come on .. it's Adam Sandler and i don't know but i really liked the short appearance of Dustin Hoffman i like him too,, his role kinda brought some emotional moments to the movie ;)<br><br>Overall the movie is really sweet ,, not the type of comedy where you find yourself on your back laughing ,, but it works with the events smoothly.","user":"Aktham_Tashtush","rank":[48,67]}]