[{"title":"Falling Flat","rating":3,"date":"1 June 2015","review":"I had the (dis)pleasure of seeing Carol Morley's The Falling during an evening with my housemates. Having read a brief summary of the plot of the film, as well as having viewed an online trailer several months in advance, I was intrigued, if somewhat confused. Neither the synopsis nor the trailer gave much away concerning the storyline. Now, having seen the film in its entirety, I can safely say I'm none the wiser. If anything, I'm much more confused.<br><br>The film focuses on schoolgirl Lydia's (Maisie Williams) almost obsessive, lesbianist relationship with Abbie (Florence Pugh), a fellow student, who falls ill after having slept with Lydia's brother. Following her death, Lydia begins to show similar symptoms and collapses numerous times before the teaching staff. Before long, all the other girls follow suit, resulting in an epidemic that the tutors swiftly attempt to sweep under the rug. Meanwhile, Lydia's agoraphobic mother (Maxine Peake) remains disturbingly unresponsive to her daughter's behaviour until the film's final moments.<br><br>Throughout, the film raises several questions, like 'what's causing this epidemic?', 'why is Lydia so deranged?' and 'why is Lydia's mother afraid to leave the house?' But the biggest question on my mind whilst watching the film was 'what's the point in this tripe?' As you can probably tell, this is one of those pretentious, moralistic and metaphorical films that is supposed to maintain some kind of underlying meaning or social commentary. The problem is that it's never made clear what this commentary actually is. Is Morley saying that early sexual activity is wrong? Or is she providing a commentary on the restrictive educational system of the late 1960s? Or both? Or neither? God only knows. What's more, a number of questions remain unanswered. For example, one of the girls, Titch, remains immune to the so-called epidemic, but it's never explained why. In addition, Lydia's bizarre romantic and sexual relationship with her brother (yes, this actually happens – as if Morley couldn't have made the film any weirder) doesn't seem to serve much purpose. I'm half-expecting someone to respond to this by arguing some deeply profound metaphorical jargon to the contrary. Don't bother. It's controversial for the sake of being controversial; pure garbage.<br><br>As some other reviewers here have already noted, the acting and cinematography are mostly of a high standard; Maxine Peake is no less than outstanding in her role, making her the film's only truly convincing character. The other characters are burdened with weak, horrific and sometimes laughable dialogue and cheesy faux-horror movie acting. Scenes in which the group of girl-friends are seen linking arms, chanting Abbie's name and dancing in a circle, are particularly excruciating, not to mention somewhat comedic, as are the fainting scenes, of which there are too many to have any impact; it just comes across as ridiculous. Why Lydia constantly feels the need to perform some interpretative dance piece before collapsing is anybody's guess. Despite this, the young cast's acting abilities are far from abysmal, but with no logical narrative or decipherable plot, this is hardly enough to save the film from falling flat on its face. It's slow, it's repetitive, and laden with shameless attempts to be controversial and innovative. The fact that this film has critics in awe is extremely worrying, and it makes me wonder whether people know what makes a good film anymore.<br><br>On a vaguely positive note, the title is appropriate. There is, indeed, a great deal of falling that occurs in this film. In fact, any fans of seeing people repeatedly fall over for no discernible reason are in for a real treat. Unfortunately for the rest, you may risk falling asleep.<br><br>3/10","user":"cooperm-26264","rank":[59,81]},{"title":"A clunky mystery with few noteworthy aspects.","rating":6,"date":"17 October 2014","review":"One of the London Film Festival's handful of world premieres, The Falling had naturally generated buzz as it's a film funded by the BFI, which is quite unusual for them. Unfortunately, while it has its merits, it doesn't quite live up to expectation as a whole. That said, the limited budget is impressively spread out with a solid cast including Game of Thrones' Maisie Williams and convincing 1960s production and costume design. The creativity of director/writer Carol Morley is less striking. It's a film interested in starting a lot of tangents without finishing them, or instead giving us underwhelming payoffs. It's built on the backbone of an odd mystery, one it's uninterested in resolving, but interested in escalating. <br><br>Set in a 1969 girls school, when the promiscuous student Abbie, played by Florence Pugh, accidentally gets pregnant, she begins to suffer from fits of fainting seemingly at random. Her best friend Lydia, played by Williams, deals with the consequences after the epidemic spreads across the school with girls fainting out of control. The film appears to be a story about the friendship between Lydia and Abbie, but it fractures off into different directions, some more engaging than others. Most dramatically is exploration into Lydia's past, or rather, how she came into this world. Her relationship with her agoraphobic mother, played by Maxine Peake, is a key aspect of the film and one of the few things that eventually pay off in a satisfying way, if a disturbing one. It needed some more development beforehand to feel fully fleshed out, but the delivery of it in the third act is the film's greatest strength. <br><br>While kept deliberately ambiguous, it appears that the fainting is somewhat of a punishment for early sexual behaviour (which incidentally appears to mostly be instigated by Lydia's brother, played by Joe Cole). There's no charm in its apparent disdain and shaming for the young girls' urges and it doesn't feel like a thought thoroughly argued through enough. It's most interesting for the way the authority figures react, which is in complete denial that anything is wrong, even when Lydia is on her knees in the hallway. Even so, characters don't react the way people would react to others fainting, though perhaps it's supposed to hint about how it's become so tiresome. It contributes to the uneasy atmosphere of the film with its dreamlike eeriness. <br><br>It is quite rewarding to see Maisie Williams in this type of environment for a change. It's clear that she's making the most of it and trying her best to feel natural, but she doesn't quite have the conviction to make it work just yet. In time she'll be a great actress. It just feels as though Morley has misjudged what the film was trying to do for the most part, thematically and tonally. It does have some good aspects and interesting tidbits, existentialism that's valid if unremarkable, but as a whole it brings nothing new stylistically to the table and is often too uninspired in execution. It has a bizarre sense of humour that doesn't quite gel with its thoughtfulness and mystery. Solid production for the budget, interesting and engaging moments here and there, but The Falling is misguided from the script's initial intentions direction. <br><br>6/10 <br><br>Read more @ The Awards Circuit (http://www.awardscircuit.com/)","user":"Sergeant_Tibbs","rank":[36,55]},{"title":"Don't waste your time","rating":2,"date":"25 April 2016","review":"****MASSIVE SPOILER***<br><br>(The film and this review is spoiled and terrible) <br><br>I saw trailers for this film last year and thought, this film looks like the sort of thing I'd like. The cinematography appeared ethereal and dreamy. The cast was interesting and I thought I'd found another independent gem for my collection of pseudo intellectual DVDs and blu-Rays I leave lying around to show how clever I am.<br><br>This film is weak. Area Stark is vapid and stares off into space a lot. Maxine Peak is good, she's literally the best thing in this film. The film is not scary, don't be fooled by the trailers into thinking this film has some sort of supernatural haunting quality. It's literally a film about two girls, one is slutty, the other one isn't, and then the non slutty has really gross sex with her brother and her mum catches them. So I guess they're both slutty. Oh and there is some fainting at school. Then non slutty brother sexer gets expelled (maybe she was excelled before the sex? Who cares, it doesn't matter) The end.<br><br>So yeah, spoilers, but I've really just saved you two hours of your life that's you'd never get back, k.","user":"jangreenhill1","rank":[21,32]}]