[{"title":"True to Dethklok! One of the best ways to spend 46 minutes of your life.","rating":9,"date":"14 November 2013","review":"Im not going to lie... I was a bit skeptical when I heard about a Metalocalypse Opera but after sitting through the first 5 minutes of the movie all my fears were quickly washed away!<br><br>I'm a massive Metalocalypse fan, been one since day one. The over the top black humor and references along with the all the wonderful satire and cliché's make it without a doubt one of the best TV shows of the last 10 years in my opinion and this 46 minute special is absolutely on par with the rest of the shows material. Its big, its dark, its bombastic and it stays true to the shows comedy styling, it's hilarious.<br><br>If you are expecting a 46 minute episode then you will be disappointed. It is exactly what it says it is, an Opera. There is singing and music throughout the entire movie so if you are one of those people that just can't stand musicals then maybe this one isn't for you. I am usually like that but I found this an absolute joy to sit through. <br><br>I'm not going to go through the story of the film as I think that's something that you should find out for yourself but the story of the movie does pick up where Season 4 left off. If you are a Metalocalypse fan or even just a fan of heavier music or the darker side of comedy I'd say that this is definitely for you. It is undoubtedly one of the hidden gems of 2013, Brendon Small has done it again!","user":"Osterman-henrik","rank":[39,44]},{"title":"Awesome doesn't cover it.","rating":10,"date":"16 November 2013","review":"Never been a fan of operas and whens this landed my heart sunk.<br><br>1st time I jumped through it thinking W T F.Second time I stuck with it and can't put the sodding thing off now. The animation is what you'd expect with Metalocalypse. Brilliant. It's the audio that'll surprise you though. First I thought they might have a problem with it... I found it a crazy mix of funny and serious. I got dragged in with the funny stuff and gradually got more and more drawn to the story and arrangement.<br><br>Huge respect for everyone involved. I hope they get to tour it.<br><br>Incredibly catchy, funny, serious, fantastic, ugly and beautiful all together.<br><br>Brendon Small is a genius","user":"mailskip","rank":[34,39]},{"title":"Most Epic Episode","rating":10,"date":"15 February 2017","review":"I don't see how people disliked this. Since it may be the final episode of Metalocalypse, they did what they could to try to finish the story. From showing how Toki originally joined the band (through an incredible guitar duel played by Mr. Small himself) to the epic climax of the defeat of the man in the metal mask, the fulfillment of the Church of the Black Clock prophecy, and the arrival of the Doomstar this entire 45 minute long cartoon is nothing short of epic. Yes, they sing a lot because it is a rock opera. That's kind of the point. I don't understand how someone wouldn't be impressed by the fact that Brendon Small wrote songs spanning multiple genres and used a 50 piece orchestra for certain segments. In short: if you're not blown away then you're not paying enough attention.","user":"itsthebeard","rank":[5,6]}]