[{"title":"Hallmark Has Another Winner! Enjoyable, Predictable Holiday Fare with Appealing Leads!","rating":7,"date":"25 May 2014","review":"I have to admit that I am a sucker for the Hallmark Channel's holiday movies. I look forward to their annual, 2-month long \"Countdown to Christmas\" extravaganza with the giddiness of an excited child waiting for Santa Claus on Christmas Eve. Hallmark's movies are warm, inviting and comforting, and they envelop me in holiday spirit, like a cozy winter blanket or a cup of hot chocolate. The plots are good-natured, usually a bit flimsy, and always predictable -- and yet I am drawn into the stories they tell as though I think something new and unexpected is going to happen at the end of each one.<br><br>In the case of \"Snow Bride,\" I expected a standard, lightweight, family-friendly, thinly outlined romantic comedy -- and that's precisely what I got. However, it seems surprisingly modern and fresh.<br><br>One highlight of this movie is that the two romantic leads in \"Snow Bride\" (the striking Katrina Law and Jordan Belfi) are impossibly attractive, and they have genuine chemistry. This is not to say that other actors in other Hallmark productions are unappealing, but many times the couplings fall flat in the absence of any true sparks. The \"Snow Bride\" duo, however, sparks left and right.<br><br>Also, the repartee between \"Greta\" and \"Ben\" throughout this movie is fairly snappy, witty, and clever, which had me wondering if Hallmark hired some new writers...or maybe just better actors? <br><br>I suppose the only reason I am not assigning a higher rating to \"Snow Bride\" is that the circumstances under which our two leads meet seem a bit implausible and preposterous, although that is generally the formula for many of the Hallmark holiday romcoms that I already love.<br><br>Overall, though, \"Snow Bride\" is one of the better installments in Hallmark's pantheon of reliable, feel-good Yuletide fare. It's not going to win an Emmy, and it's not going to provoke deep thought, but it is as sweet and delightful as a sugary piece of Christmas candy, and that's all I need it to be.","user":"Esselleee","rank":[15,17]},{"title":"Nice Film to Watch","rating":7,"date":"12 September 2016","review":"Greta Kaine (Katrina Law) is always in search of juicy gossip. As a tabloid reporter at \"Pulse! Gossip\" in Los Angeles, it's her job to expose the rich and famous for the entertainment of the magazine's readers. So when word gets out that one of the late Senator Tannehill's two sons might be proposing marriage at the family's Big Bear compound during Christmas, Greta and her chief rival Wes (Tom Lenk) are challenged by their old-school editor to get the scoop. There's incentive to be the first, too-- the editorship of the magazine's new online incarnation.<br><br>Greta's assistant tells her that Wes has a head start to snowy Big Bear, so she dashes to the mountain resort. When she mistakenly ends up as a guest of the family, she's in the middle of what could be her best story yet! However, she soon discovers that the family, including matriarch Maggie Tannenhill (Patricia Richardson) and caretaker Peters (Robert Curtis Brown), are more down-to-earth than she ever gave them credit for. Increasingly guilt-ridden about her game of subterfuge, Greta must make a decision: how far will she go for the sake of a story?<br><br>This film was surprising. The \"Kennedy\" type family in this film are not mean spirited at all. They are nice. They are just press shy and afraid of letting new people into their lives. The film is worth watching. Kids will Be bored but its meant for a slightly older audience","user":"Christmas-Reviewer","rank":[9,10]},{"title":"Another winner for the romcom crowd, thank God television still turns them out","rating":7,"date":"3 December 2013","review":"Great (Katrina Law) works for a blab magazine in the Los Angeles area. Single and very pretty, she nevertheless has been unlucky in love. One of her friends is getting married soon and Greta, good friend, volunteers to pick it up from the bridal boutique. But, wait! Just then she gets a call about trailing a famous political family up in the mountains of California. Dashing off in her shorts, she drives the car into a snowbank and starts to get the big \"chill\". Needing extra clothes, she puts on the wedding gown and then tumbles down a hill. At the bottom is a good looking guy, Ben (Jordan Belfi) who swears he is the caretaker of the nearby mansion of the famous family Greta is to find. Ben asks Greta about her dress, is she a runaway bride? Playing along, Greata says yes. No one is there to blow here cover. But, not so Ben. Soon it becomes clear that Ben is the elder son of the rich politician and it is expected that he will announce a decision to run for office. Just at this critical moment, Ben's younger brother shows up with a new girlfriend. Horrors! She's Ben's old flame, a true golddigger. Thinking quickly, Ben asks Greta to pretend to be his current squeeze. She agrees to play along. But, what will happen when the secrets start coming to the surface? This nice film is funny and romantic. It has all a romcom lover could wish for, that is, an attractive cast, a beautiful setting, sensational costumes, an energetic direction and a clever script with plenty of twists and turns. Even if its snowing to beat the band, fans, try to get a look at Snow Bride.","user":"inkblot11","rank":[14,19]}]