[{"title":"A life changing movie- opening eyes and hearts","rating":10,"date":"6 August 2014","review":"This move was incredibly heartwarming. It was a fantastic film, not just because it highlighted the reality of down syndrome, but because it truly captured the reality of everyday life. It should be commended for its bold efforts in changing the stereotypes of people with and without intellectual and developmental disabilities. However, the movie is so much more than a cause- it is a generally fantastic film. From the actors, to the filmography, to the story, this movie excels. It is touching, moving, and enjoyable. This movie goes where no other move has gone- it truly highlights life. I recommend this movie wholly on the fact that it is well made, not just as an activist for equality for people with disabilities, but as a person who laughed and cried during this fantastic piece.","user":"abbygregory60","rank":[23,29]},{"title":"It changes you for the better","rating":8,"date":"10 May 2015","review":"he last Christian-themed or faith-based movie I actually enjoyed was \"Fireproof\" and that was more than seven years ago, I was a single man and that movie even spoke to me, whether or not you're married, whether or not you're a believer, you can learn a lot from \"Fireproof,\" and I think that's what makes WHERE HOPE GROWS effective, is that you may be at the point in your life where you're still looking for what it is that you'd like to believe in, but you can still get something out of watching this good-hearted film that changes you for the better.<br><br>I'm with you there when I say that I don't like movies that are too preachy or all up in your face, shoving sermons down your throat, which is why I had avoided pretty much every faith-based movie since \"Fireproof\" because the level of preachiness just went through the roof, most of them were not even about story and characters anymore. If I wanted to watch sermons, I'd simply just straight up watch it off youtube, there's tons of evangelical seminars on the web, but if I come to watch a film, a film is what I want to end up watching.<br><br>From writer/director Chris Dowling, WHERE HOPE GROWS, in a nutshell is about Kristoffer Polaha's character, Calvin Campbell, a former pro baseball player whose career was cut short due to panic attacks at the plate. Nowadays, he turns to alcohol for solace and struggles raising his teen daughter (McKaley Miller). Calvin strikes an unlikely friendship with a young man with down syndrome, Produce (David DeSanctis) who works at a local grocery store. This friendship gives Calvin a new look on life as he finds redemption, but this friendship will also be put to the test.<br><br>I think it's wise move on the filmmakers' part that they cast an actual man with down syndrome to play Produce, instead of having actors like Cuba Gooding Jr. (\"Radio\") or Dustin Hoffman (\"Rain Man\") for example. There is a benefit to actors convincingly pretending to be what they're not, but there is an even more benefit to just giving the role to someone who literally knows what it's like to be that person. And David does a fantastic job of balancing vulnerability, humor, and ingenuity. You take a few seconds look at David and the way he carries himself, and it suddenly makes you want to be a better person. I must admit, as far as filmmaking goes, it's extremely simple, nothing much about it that would blow your mind, this is a case of working within the budget that you're given. The plot is also very thin, very generic, this is the type of road from self pity to redemption that you've seen a thousand times before, but I still enjoy the themes quite much, and I think WHERE HOPE GROWS is an important film that young generation today need to watch so that they can learn to be more sensitive and tolerant and more accepting of those whose are different from us.<br><br>Read more at Ramascreen.Com","user":"Ramascreen","rank":[14,17]},{"title":"Excellent from start to finish!","rating":10,"date":"30 April 2015","review":"My wife and I were treated to a special screening of this film in the middle of April. We just absolutely loved the whole movie! It was sweet, enlightening, encouraging, and just great fun. It was also a great vehicle to show just what a special needs person (in the character of Produce, played magnificently by David DeSanctis) has to offer others, and how their take on life can often be untainted by the cares of this world.<br><br>Chris Dowling and McKaley Miller were in attendance, taking questions after the movie. Both of them were so very sweet and gracious as they also gave little 'behind-the-scenes' stories, especially with working with David.<br><br>I highly encourage everyone to go and see this movie. Bring your friends. Bring tissue.","user":"isaiah-36644","rank":[19,25]}]