[{"title":"Disjointed telling of the Butcher of Prague story","rating":6,"date":"3 January 2018","review":"Solid performances all round (Jason Clarke is excellent!)\nHowever, movie should have fleshed out the Heydrich / Butcher of Prague story more rather than re-telling the post death aftermath - an angle already covered by the Cillian Murphy/Jamie Doran movie (Antripoid). Their (brilliant) movie told from the perspective of the Czech Assasins.<br><br>If you really want to see a movie about Heydrich (and the lead up to the \"Final Solution of the Jewish Question\"), watch \"Conspiracy\", the Kenneth Brannagh/Stanley Tucci TV movie. SHOCKING!","user":"Phil006","rank":[27,31]},{"title":"Incoherent WWII drama - if you watched Anthropoid, you can skip this one.","rating":5,"date":"8 June 2017","review":"This movie feels like someone shot two separate movies - one being Heydrich's biography, second being action thriller about his assassination - cut the run time of each one to half and merged them together. The first half follows Reinhard Heydrich on his rise to power, orchestrated by his wife Lina. It's not exactly a thrilling spectacle, but both Jason Clarke and Rosamunde Pike deliver solid performances (although Clarke is far from the brilliance of Ralph Fiennes in Schindler's list). The problem is that the story line seems absurdly rushed, many important events are left out or shown through short collages with voice-over and music playing and it just feels incomplete. I would love to see a full 2 hours long Heydrich's biography that would dig deeper into Heydrich's relationship with his wife, his rise to power and his work and status in the Nazi regime.<br><br>Unfortunately, after one hour of this rushed biography, the movie almost completely abandons Heydrich and his wife (both have literally minutes of screen time in the second half, most of it together) and shifts focus to Czechoslovak paratroopers in Prague. Since then, it feels like Jimenez just took the movie Anthropoid (2016), cast new actors, re-shot the movie shot by shot and cut out half of the scenes. If you have seen Anthropoid, you can skip the second half in its entirety and you won't miss anything. The fact that Jack O'Connel and Jack Reynor look alike to the point it's easy to confuse their actions doesn't help either. The only upside of the second half is Mia Wasikovska who does much better job than Ana Geislerova in Anthropoid. HHhH (or The Man with the Iron Heart) is not a bad movie per se, it's just oddly structured, rushed and given the existence of Anthropoid, feels a bit redundant.","user":"petr-varak","rank":[108,143]},{"title":"Not quite iron hearted enough","rating":6,"date":"12 January 2018","review":"Saw 'The Man with the Iron Heart' as somebody fascinated by the subject it covers, and by the man who really did have an iron heart and earned the ire of even Hitler himself. Also really like a lot of biopics and there are a few talented names. <br><br>'The Man with the Iron Heart' is a brave attempt at telling this story, but it is also agreed frustratingly uneven and disjointed. The general consensus is that the first half is better than the second half, personally found that the case too after viewing it. It is far from a terrible film, there are a number of strengths here, but it could have been so much more. And is what is meant by that it is frustrating that 'The Man with the Iron Heart' is uneven is that the flaws of the second half could easily have been avoided. <br><br>Starting with the strengths, much of the film looks great visually. There is a real feeling of evocative authenticity, with attractive costumes that captured the era well, elegant interiors and very atmospherically grim landscapes. The music is suitably haunting and the direction fares strongest in the first half and the harrowing scenes that are uncompromisingly powerful.<br><br>First half is very interesting and compelling, with some very thought-provoking writing. When the film focuses on Heydrich, his motives and his family life, it is where it most excels, being very engrossing, emotional and intense, actually also taking time to show what happens and being structured in a way that makes sense. Even if there could have been even more meat to what was told.<br><br>Although 'The Man with the Iron Heart' is a problematic film, the blame does not lie with the cast which is actually the main saving grace. Rosamund Pike especially is excellent as Lina (am really liking where her career is going), while Jason Clarke portrays Heydrich's iron heart, lack of compassion and coldness adeptly. Mia Wasikowska gives one of her better performances to date here and is one of the main reasons to stick with the second half. <br><br>It is really unfortunate that the second half is nowhere near as good. The inferior quality and the shift in focus gives a really disjointed feel and like the two halves were two films in one. The focus on those who tried to assassinate Heydrich is nowhere near as illuminating or compelling, just didn't find myself involved or engaged by it. The characters are sketchily written, the opposite to Heydrich and Lina who did have intriguing character development if still not quite enough. <br><br>Furthermore there is no tension and what is covered is rushed through with no attention to depth or sense, the odd almost incomplete-feeling structure and some strangely amateurish filming (which wasn't as apparent in the first half) also confusing it. The flashforward was not needed at all, further diluting any suspense by explicitly revealing what happened. <br><br>Although Heydrich is still interesting, the film did miss an opportunity in properly fleshing him out due to not focusing on him enough. <br><br>Overall, interesting, well acted and (mostly) made and brave but disjointed, uneven and rushed. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,8]}]