[{"title":"A beautiful poem about life, love and death","rating":9,"date":"30 November 2014","review":"No, the last film of Naomi Kawase, internationally known as \"Still the water\", is not a film reserved to \"intellectual people\", as I heard recently. If we refer to \"Last year at Marienbad\" (Resnais-1961) as a film for\"intellectual people\", we find no common point, except slowness of the rhythm. <br><br>The spectator should only follow the example of the female heroin, Kyoko, who, in one scene at the beginning, dives into the sea with all her clothes (except her shoes), and enjoy this bath, meeting joyfully with the old-fellow fisherman, \"PapyTortoise\".<br><br>Following her example, we, spectators, should dive into the film, and enjoy the play of sunlight across the branches of the old banyan, just in front of the terrace of Kyoko's house; enjoy the meals lovely prepared by Kyoko's father (so much different from the meals eaten in a restaurant at Tokyo by Kaito, Kyoko's lover, and his father; and completely opposed to the food left by Kaito's mother in the refrigerator); enjoy even the soft departure of Isa, Kyoko's mother, after a long illness, among songs and dances.<br><br>I love so much this warm celebration of la joie de vivre, typically a Japanese one, as, after each disaster, typhoon, earthquake or tsunami, we see Japanese people build again, with a strong faith in life, all that has been destroyed.","user":"jlrousse04","rank":[21,25]},{"title":"The film is great, Metacritic reviews expose Hollywood critics as buffoons","rating":9,"date":"1 April 2015","review":"This review is not about the film but the crude American taste.<br><br>Whenever my cinema-savvy friends criticised Hollywood, I'd jokingly dismiss their arguments, saying I enjoy action-packed, fun films for afternoons and that Hollywood has great production. I stand corrected.<br><br>This film has been given a 5 by metacritic. Check out the reviews. They say silent moments are awkward.. or that stares are long... I had an epiphany that Americans and their layman critics have actually no appreciation for an actual good work when they see one. Everybody likes a big Mac but in no way it means you can slam a 5-michelin star cuisine.<br><br>I always acknowledged Hollywood films try to appeal to the lowest common denominator. It makes them fun to a point. But I realised today it's not just their audience that is unnaturally confused with junk, but apparently American select critics are actually the lowest common denominator.<br><br>P.S. IMDb will not be a universal source until it goes beyond Hollywood standards.","user":"faridandroid5","rank":[47,62]},{"title":"Very deep and moving","rating":8,"date":"13 October 2014","review":"Death, love, commitment...the movie treats those question in a very human rhythm, and surprises you in its deepness. I was moved to tears.<br><br>It's set in a paradisaical coast of a Japanase island, full of light and sea. The actors are impressively true and beautiful.<br><br>Japanase music being played and sang was a real plus too. The few scenes happening in Tokyo were a really good reflection to appreciate better the lifestyle in that countryside.<br><br>the last third of the movie was maybe a little bit slow to reveal itself, but it saved some great scenes and was matching the rest of it.<br><br>It's also socially and culturally very enriching and interesting. Leaves you with true surprises about the way these kids behave towards losing someone, towards relationships, etc.","user":"leo-lester-leo","rank":[23,30]}]