[{"title":"Charming whimsy","rating":7,"date":"1 January 2015","review":"Mr Hoppy, a shy, ageing American plant lover, lives in the flat above Mrs Silver, a rather ebullient retired midwife who buys a tortoise for company. Mr Hoppy falls in love with her but, crippled with shyness, develops a plan to win her heart by substituting ever-larger tortoises to satisfy her worries about the original's slow rate of growth.<br><br>This rather daft and whimsical story by Roald Dahl is adapted into a rather daft and whimsical TV film by Richard Curtis and Paul Mayhew-Archer. There isn't too much here by way of laughing out loud (Judi Dench has one short but hysterical piece of dialogue towards the end), but there is a lot of smiling and a fair amount of chuckling. And there are two delightful and touching performances from Dustin Hoffman and Judi Dench as the tortoise-linked couple, both of whom deliver performances of far greater integrity and subtlety than the slightness of the material would suggest.","user":"neil-476","rank":[23,25]},{"title":"Delightful, heartwarming, funny, brilliant characters","rating":10,"date":"3 January 2015","review":"There is no doubt that Roald Dahl is a true genius, nevertheless there have been cases where movies have not lived up to their original works. There is no doubt that Judi Drench and Dustin Hoffman are huge names and absolutely amazing (to say the least) actors, however there have been plenty of movies with superb actors and great names which turned out less so. This is NOT one of those. The BBC did a great job to put a marvellous story into this magnificent movie, for the young and the old alike.<br><br>Dustin Hoffman does such a sublime job playing Mr. Hoppy that I find it hard to imagine him as anybody else. Quiet, shy, kind Mr. Hoppy made his way into my heart from his first minute (more like seconds actually) on the screen. Judi Drench appears as the love interest of Mr. Hoppy, Mrs. Silver, whom despite not being the brightest bulb in the box was a lovely character. All in all both have given wonderful performances.<br><br>The writers were, in my opinion, the ones who managed to bring real magic to the movie. Looking for more detail, they turned out to be Richard Curtis, Paul Mayhew-Archer, 'old' names to the admirers of comedy from the BBC. Their tasteful humour is no news to me and they managed to put their light, yet deep, touch to this script. They have managed to insert some of the loveliest jokes, and produced a masterpiece that would bring tears to people's eyes for ages. <br><br>There is not enough praise I could ever possibly bring to this movie and for it to be enough. I could go on for ages, praise every joke and every scene.","user":"matemariaescu-591-221762","rank":[30,36]},{"title":"Enchanting","rating":8,"date":"11 January 2015","review":"This is a simple sweet tale.Nothing to dislike. The story is cute and inoffensive. The film has been written to pad out the story and it has done so in a sympathetic and appropriate fashion. The thing that makes it so delightful is how Hoffman and Dench make the characters adorable and relatable regardless of the fact that they are unlikely. If you don't like charm, wit and a bit of suspending disbelief, move along. I intend to use this to vet people in the future. If they don't like this movie I won't be going for coffee with them. Relax, turn off your cynicism and wallow in the treacle and charm until your all marshmallow inside. :)","user":"mandaqu","rank":[19,25]}]