[{"title":"Dark history piece. Great to look at","rating":8,"date":"21 February 2018","review":"I liked. A very raw irish drama with strong moments and incredibly good images. The story was simple structed and was pretty basic but its based on true events and that makes it shocking. You have your unbeatable war hero who turns against those who actually praises him to be what he is and everything becomes messy. Then you have the police commissioner whose specialtiy is being a hunter who .. hunts him. But the historic truth behind it makes it extremely authentic. Director Lance Daly really successes in making it a believable drama and avoids every poor cliches to make it more cinematic.\nThe acting worked as well. I really liked Hugo Weaving who shines in the leading role as the trouble commissioner who gets one last chance. James Frecheville delivers with a very silent but extremely raw performance, much in the tradition of Leonardo DiCaprio's Revenant turn. Good Supporting roles by Stephen Rea and especially Jim Broadbent who is in the second half of the movie but pretty much owns every scene he is in. Nice turn by newcomer Barry Keoghan was well.The cinematography was amazing, the scenery excellent (except for those painted village images, which were a bit irritating at times) . It has many shocking moments and some well edited action sequeces. A great mix that works most of the times. Good performances over all. Lovely irish music that adds a lot to the general mood. Very recommendable movie even if it had the one or other dry scene.","user":"Alexander_Blanchett","rank":[115,136]},{"title":"Please do not refer to this as English history","rating":10,"date":"28 June 2019","review":"This movie depicts just one atrocity committed against the Irish people in a very long occupation. It was atmospherically bleak, as is the material on which it is based. I have known of this horror my entire life and still shudder at the coldness of the British as they blamed the famine on laziness of the Irish, and calmly went about exporting 98% of what the Irish grew - leaving them only the potato. I cannot fault the acting or the story but I would have rather seen an irish actor in the lead. If you care about injustices against a people, you need to see this - just as you need to see \"Bitter Harvest\" about Stalin's genocide against the Ukrainians. Any movie that leaves you wanting to flesh out the history had done its job.","user":"Melrosemiss","rank":[27,30]},{"title":"fantastic Irish western","rating":10,"date":"30 August 2018","review":"I really enjoyed this film which tells the story of An Irish Ranger who returns home after fighting for the empire abroad to find that his homeland is destroyed and family killed by the very forces he was defending. he sets out on a revenge journey which is set to the back drop of the famine in the west of Ireland. I like the fact that lance does not bow to a Hollywood production and instead depicts a very real narrative. It is dark and the performances are brilliant. The photography is class and you feel you are moving within the scenes along with the characters..hope to see the movie translate to overseas audiences. THumbs up.","user":"eugenequinn","rank":[78,98]}]