[{"title":"Will Poulter Graduates From The School of Comedy","rating":6,"date":"8 October 2016","review":"Having watched Kids In Love last night, and quite enjoyed it, I thought I would log onto IMDb and see what others thought of it. But nobody else had seen fit to review it. Nobody. Not a single review. And I thought that was rather unfair, so here I go.<br><br>It's not bad. The acting is solid, the script is pretty good and the characters, whilst not entirely likable, are developed reasonably well. So far, so-so. However, it is Will Poulter as the protagonist, Jack, that elevates the movie above the mediocre. He really is a credible actor these days, and I really enjoyed his performance in Kids In Love.<br><br>I guess, at its heart, Kids is basically a coming of age movie, but it has a lot of heart, and I genuinely cared that things would work out for Jack. However, I am not so sure about Alma Jadorowsky as the ethereal Evelyn. Yes, she is attractive, but I did not feel that she exuded the \"je ne sais quoi\" (it's okay, Evelyn is French) that the script demanded.<br><br>That said, the London locations are fun, and although things became a little predictable in the last twenty minutes (as these sorts of films generally do) I must confess that I was left with a smile on my face.<br><br>Undemanding, but enjoyable.","user":"alan_hart","rank":[19,20]},{"title":"A film that felt made for the middle class youth who live off their parents money","rating":3,"date":"10 December 2016","review":"I watched this because I am big fan of Will Poulter, an extremely naturally gifted actor &amp; he so he is here but struggles with the material he is given. <br><br>Poulter plays Jack, born of middle class Nottinghill parents who plan for him to take an internship with a friends law firm as soon as he is back from taking a gap year of travelling with his friend Tom. Jack meets Evelyn, a French girl visiting London, whom for reasons unknown strings Jack along even though she has an on/off boyfriend who can only be some sort of pimp / drug dealer though what he does is never clearly explained. Through meeting her he goes clubbing to secret hedonistic places where young posh kids go, who don't work, have threesomes and do drugs. It's all very pastel colours and warm tones. Jack has an interest in old school photography, befriends some sisters who seem to own a 'come and go as you please' mansion while their parents are away and meets an assortment of odd other characters. Some arguments are had and some friendships are tested and that's about it really. The script is almost entirely devoid of any real drama save for a couple of heated rows with the parents and his best friend. Coming of age dramas and films about first young loves can be engaging but sadly this film isn't in that category. It's only real saving grace is Poulter who plays the stumbling Jack with an appropriate level of blind confusion. Adequate casting in terms of the parents is provided by stalwart actors such as Pip Torrens and Geraldine Sommerville, but the rest of the cast find it hard to make their mark. The script lacked any real characterisation (Perhaps these kids are just that bland, and that was the point?) and I just really wasn't interested in the petty dilemmas of these spoilt rich kids. At the end of the films running time I felt I barely knew any of the characters any better than I did when the film had started apart from Jack, whose own journey seems to have taken him no where. Perhaps that was the point of the story, that they were all so vacuous that Jack was better off where he had started, than with meeting them at all. Be that as it may, it did make the film somewhat pointless. <br><br>It says much about a film where the most memorable moment is a scene with a guy who sits on the sofa and says nothing.","user":"azanti0029","rank":[14,16]},{"title":"Privileged morons...","rating":4,"date":"5 September 2017","review":"A festival of unlikable characters. Espouses the worldview that it's OK to turn your back on anyone who's ever supported you or made sacrifices for you, if you get a whiff of an exotic alternative lifestyle. Perfect for spoiled trust-fund babies who believe they don't owe anybody anything, and that nobody else *gets* just how windswept and interesting they REALLY are.<br><br>Rather than stay at a commune with them, I'd prefer to just dump them all on an island, and leave them stranded!","user":"Howlin Wolf","rank":[6,6]}]