[{"title":"The way the story should be told.","rating":10,"date":"8 March 2014","review":"For those who are expecting a repeat of the Mel Gibson movie, then prepare to be disappointed ... or pleasantly surprised. This movie is the sanitized version of the Gibson extravaganza. It is the movie that Gibson would have made if he had decided to ease off on the gratuitous depictions of violence. Depicting violence in a movie about Christ is unavoidable; it is part of the story. The violence has to be shown. The question is: how, without the violence itself becoming the main theme? This movie sticks to the story about Jesus; the violence is a part of the story. He is beaten, mocked, scorned, discredited, tortured, crucified and murdered. The story is told in its entirety. Yet, the director succeeds in telling the story in a straightforward non-sensationalist manner. By emphasizing Christ's humanity he brings the audience into the story. Regardless of your religious beliefs, one can relate to Jesus, his ministry and what he is trying to accomplish. His actions are plausible and understandable. His preaching is simple, sensible and comprehensible. His suffering and anguish is pitiful; his resurrection miraculous. Here the movie is strongest. Unlike the Gibson film, the resurrection is given full treatment and concludes the movie on a positive note, which is appropriate. The story of Jesus Christ requires no embellishment; it speaks for itself. Jesus was born, conducted his ministry, was betrayed, and was sacrificed. This is how the story is depicted in this movie. What more should anyone expect?","user":"PWNYCNY","rank":[147,251]},{"title":"Nothing Redeemable About This","rating":3,"date":"28 February 2014","review":"In case you don't know, \"Son of God\" is a spin-off of the successful History Channel mini-series, \"The Bible.\" The movie was filmed at the same time as the show. In fact, it's the extended footage of the Jesus section of the series. But there was a reason all of that footage was cut. If it wasn't good enough for television, how can this possibly be good enough for the cinema?<br><br>Well, it's not. This movie is a bore. With an unnecessary 138 minute run-time, the film drags through dialogue delivered at a pace slow enough for the slothful to keep up. Even then the script isn't interesting. The selections of the gospel that get quoted are mercilessly butchered. And that's another thing, if not the most important criticism of a movie of this caliber -- the filmmakers had no respect for the source material.<br><br>The story misses on minor and major elements. Anyone with anything better than a felt-board understanding of Sunday school Bible stories will be able to identify the inaccuracies. And they are many: from theology to dialogue to locations to the people involved and the list goes on. If the filmmakers don't care for even simple and easy details, how can we believe that they care about the more complicated matters addressed by the gospel of Jesus Christ? Sadly, they don't.<br><br>Truth be told, creators Roma Downey and Mark Burnett are New Age believers. They soak up multiple forms of paganism, mysticism, and spirituality -- like a lot of celebrities do. It doesn't take more than a little bit of Googling to know what any celebrity believes. Yet the American church has been duped into promoting this trite, vapid representation of the Bible to make the Downey/Burnett couplehood a fishing boat-load of cash.<br><br>It's no surprise that Joel Osteen, K-Love, T.D. Jakes, and Rick Warren gobbled this thing right up. But Mark Driscoll, Louie Giglio, Focus On the Family, Liberty University, and the Women of Faith conferences should have done their research and known better. \"Oh, she was in 'Touched By an Angel' and he made 'Survivor' and they claim to be Christians and God told them to make this! Let's promote the hell out of it!\"<br><br>The Jesus portrayed in \"Son of God\" is not the Jesus of the Bible. In the vein of the film being just downright boring, Diogo Morgado puts forth one of the worst depictions of Jesus I've ever seen. He's pretty passionless, as is the rest of the disciples and the attitudes of the crowds who follow him. The climax and resolution of the story don't resonate because the previous hundred minutes of the movie haven't given us any reason to care.<br><br>Whether you're arguing from a theological standpoint, or just as a movie-lover, the film is devoid of content. It's worthless. There's nothing redeemable about this film. Save the money, save the time. And for heaven's sake, know your Bible. As long as the church is out there ready to promote anything with the word \"God\" on it, we're going to get horrible material like this.","user":"gphmusic","rank":[188,326]},{"title":"A Humble Telling Of The Son Of God","rating":8,"date":"6 March 2014","review":"I do have to take exception with the reviews that declare this movie 'boring' because it didn't go all out with special effects – or quote entire passages of the Bible. I thought that this movie was trying to portray a humble man who was simply going about the business of living out his destiny. Which is exactly who Jesus was. I found it refreshing not to have a slam-bang all-out special effects, miracle exploding on the screen, drama-in-you-face version of this life. The important points were there. In fact, just the important moments and quotes that were needed and wanted. I kept thinking as I'm watching, how could anyone have doubts about this Son of God when it was all such a life as usual, normal people time and yet.and yethere we are 2014 years later, and this is still the most important person who ever walked on this earth. And everyone knows His name and what He did and who He was. No. This movie was precisely what it needed to be and no more. I took extra tissue, but still it wasn't enough. Watching the end of the earthly life of My Lord was so painful, so heart-rending that, indeed, I cried as much as I feared I would. Maybe more.","user":"patsworld","rank":[130,223]}]