[{"title":"Better than expected!","rating":8,"date":"3 August 2018","review":"For a B-grade film, this was surprisingly better than I expected. The acting was great by all cast members, the directing was on point, the writing was actually pretty good - without many plot issues one would normally expect, the cinematography perfect, the pacing was great, especially for the 107 min length, and the editing not too bad except for the flashbacks. My only critique was the terrible score, especially towards the last act. Had the score been more professional and consistent through out, the suspense would have been stellar instead of adequate. Overall an impressive film. A well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[106,136]},{"title":"Entertaining!","rating":8,"date":"17 August 2018","review":"Good movie! Great plot! Edge of your seat twist and turns! Picture and acting qualities are excellent!.... If theirs anyone looking for good reviews and not sure of watching. Pay no mind to the bad reviews. If you like crime thrillers.. this is a good one!","user":"celestinoavilajr","rank":[48,62]},{"title":"Done Before, But Not Too Bad, A Little Extra On The Formula","rating":7,"date":"4 May 2018","review":"Over all not too shabby, definitely better than I expected. So yes its been done many times before, person (or in this case; people) break in to someones house for some ulterior motive, only to discover the home owner is either hiding something or is some sort of killer. But it throws a little extra into the formula, some works, the emphasis on the killer and his story was refreshing. But is it scary? Is it a horror movie? Because lately so called \"horror\" movies are indeed not scary at all. And as far as this film is concerned, I'm not sure what I want to say, because some of it was effective, and some of it wasn't. First of all, I like how they expanded on the typical story line they were telling, and without giving to much away, it creates this admittedly tense cat and mouse chaotic situation for all parties involved, so I liked how it just didn't stick 100% to the \"Rear Window\" and \"Disturbia\" formulas.<br><br>But was it scary? I'd say it was in places and was not in some, it was as simple as that for me. Some of the scenes/situations/jumps got me, and I got a little tense, but some other scenes just didn't do it for me, maybe because I'm so desensitized to brutal horror movies. The acting was also hit and miss, some actors did a fine job while others, were just... meh... And to be fair some of the good acting added to the intensity. I also didn't like some of the editing choices. I liked the color scheme of the film, the dark and deep colors, something you would expect from a James Wan or Hammer Films movies. I really want to say I liked it, because i definitely did like some of it, but some of it just didn't tickle my horror bone like it could have, but overall it was not too bad, much better than I expected.","user":"neener3707","rank":[56,84]}]