[{"title":"A nice propaganda piece for the Weider Empire","rating":5,"date":"20 October 2018","review":"As a biography, Bigger hearkens back to the days when Hollywood biopics cranked out knights in shining armor using whatever mixture of fact and fiction they thought would fill the seats and send everybody home happy. Joe Weider is a presented as a blemish-free altruist who only wants to help the world become a fitter place; various inconvenient aspects of Joe's private and professional lives - including the timing of his two marriages and the existence of his daughter, legal difficulties stemming from highly exaggerated claims of his products' effectiveness, questionable treatment of business partners, and strong presence in the gay-oriented \"beefcake magazine\" market of the 1950s and early 60s with titles like Adonis and Body Beautiful - are either glossed over or ignored completely. Meanwhile, the villainous foil \"Bill Hauk\", officially claimed to be a composite of several real-life characters but pretty clearly a representation of U.S. Olympic weightlifting coach and rival muscle mag publisher Bob Hoffman, is a cartoonishly evil, racist, anti-Semitic, homophobic, violent thug. Exec produced by nephew Eric Weider, the film plays like the Weider Empire's bid for Joe's sainthood.<br><br>Historical inaccuracies and omissions aside, as a movie it just isn't very satisfying. The years flip by so quickly it's difficult to build up much momentum, and we're often left wondering exactly how last year's big dilemma played out. Tyler Hoechlin as Joe does a capable job mimicking Weider's distinctive Polish/Yiddish/Quebecois accent but tacks on an awkwardly stilted manner of speech; oddly, both of these are absent in the always-classy Robert Forster's portrayal of Joe as an old man. The labored delivery combined with Joe's single-minded obsession with fitness makes him appear to be a sort of Rain Man of bodybuilding, and only succeeds in distancing the audience from the character. Repeated anti-Semitic attacks and accusations of homosexuality fail to build the viewer's sympathy after the first few instances, with a mounting array of epithets not heard for a while in a non-Tarentino movie.<br><br>The film tries hard to present Joe Weider's life story as a classic David-versus-Goliath struggle. But given the ending we already know, it's pretty clear that this David's goal all along was to become an even bigger Goliath.","user":"denny321","rank":[32,41]},{"title":"Inaccuracies & Poor Acting","rating":1,"date":"21 October 2018","review":"As a bodybuilding historian I was angered by the many historical inaccuracies in this movie. Seeing that present day Weiders were involved with it made this make more sense as the Weiders always inflated claims about their products. The acting was bad overall but seemed to get better through the movie. Hough was a bright spot as well as Moger's Arnold accent which was much better than I thought it would be.","user":"clintemshoff","rank":[30,42]},{"title":"Unnecessary lies","rating":1,"date":"7 February 2019","review":"Joe and Ben Weider had extraordinary lives and accomplished so much on their own. I have no idea why this movie felt that they needed to invent unnecessary lies.<br><br>Weider did not invent the gym. Salzmann and Adolph Spiess started building indoor gymnasiums in the nineteenth-century. There was also several health clubs in France and England. John Wareing and Jack Lalanne created some of the oldest gyms in America in the early 1930's.<br><br>Weider did not discover Arnold.\nArnold moved to England before he moved to USA, he competed against Sergio in the 1969 Mr Olympia but lost, and then came back in 1970 and won.\nThe story about his legs was most likely from his trainer in England, not Weider.<br><br>Then you have the problems and controversies with Weider that isn't addressed in this movie. He was investigated on multiple occasions for false claims regarding his nutrients. Many of them ended in heavy lawsuits.<br><br>He was involved in gay porn that caused at least two clashes with obscenity laws.\nToday we don't view homosexuality as illegal activity, and it would actually have been interesting to hear the motivation behind not just 1 but 2 magazines. JEM came out in 1956. That was pretty darn risky at the time.<br><br>And there has been many scandals involving Mr Olympia. Accusations of fixed results, the suspension of Sergio Silva. The 1980 Arnold scandal, The 1981 Franco scandal, and this has continued all the way up until 2015 with Kai Greene.<br><br>The man was not a saint. And I for one would like to see an actual movie about that.","user":"jonathanmarklund","rank":[17,23]}]