[{"title":"The downfall of America as described by a world renowned philosopher","rating":10,"date":"6 May 2016","review":"Forget the bad review found here from the person from London. This is the real reason for the downfall of America and it has everything to do with the moneyed class wresting control of our government from the hands of the average citizen. Noam Chomsky is a world renowned American linguist, philosopher, cognitive scientist, historian, logician, social critic, and political activist who details the collapse of a once great country step by step. He makes it easy to understand and provides very specific examples of his elucidation of the hijacking of our economy and country. I find the perspective of a professor emeritus at MIT much more edifying than the simple minded who dismiss him as an extreme leftist.","user":"rocks-67264","rank":[91,101]},{"title":"Relevant in this Election","rating":10,"date":"10 May 2016","review":"Somehow, conservatives have awoke from their slumber and become aware that we have severe economic problems in this country and the American middle class has seen their economic power erode while the \"masters of the universe\" just become richer and richer and exert more power and money to ensure that legislation is written that will continue to benefit the 1%. Donald Trump acknowledges this in his stump speeches while Bernie Sanders has made it a cornerstone of his campaign. Clinton tries to avoid the subject lest her opponents bring up Goldman Sach's yet again. Choamsky puts the intellectual underpinnings on why the American Dream is fast becoming a nightmare. His ten principles are pretty easy to understand as he invokes the Founding Fathers and Adam Smith to buttress his intellectual arguments that income inequality in the U.S. is not only a problem but a huge problem that not only affects us in the pocketbook but undermines our democratic processes that have stood us so well over the last 200+ years. We have a professional class in the U.S. that has become immune to the globalization issues facing blue collar workers and both political parties have turned a blind eye to helping American's who have borne the brunt of trade policies that benefit corporate America at the expense of working people. Also the constant drumbeat of the elites against labor unions in our country, an organizing group that once had immense power to protect American wages. In the new \"sharing\" economy there are vicious fights to keep the sharing workforce from unionizing. Also massive attacks mounted against public sector workers including teachers because they belong to a union. These attacks are not random events but carefully orchestrated events with an end in mind: the continued growth of the 1% that even Adam Smith warned us about. The big fear among the enormously wealthy is that the majority of American's will get too much democracy and start pushing for rights that have long been denied them. They rely on law enforcement and even the military if necessary to protect their property rights and right to govern or manipulate the legislators who supposedly represent their constituents but in reality only represent the interests of the !%. Chomsky lays this all out in his documentary. You may not agree with everything he lays out, but he makes an awful lot of common sense. Many American's are finally waking up to this reality. Watch this documentary and it will provide a good insight into how this country arrived at this economic state.","user":"bobzmcishl","rank":[47,53]},{"title":"A Must See for anyone interested in why the US is having so many problems","rating":10,"date":"5 June 2016","review":"I agree with another reviewer who said that if you've followed Noam over the years, you won't be learning anything new. That's true, I've heard most of these topics being discussed in previous books and talks that he has given but, having the focus of the entire movie on one topic was a treat and personally, I feel much better informed for having seen the movie. Also, Since Noam has so much information it's nice to have it edited so all the information is concise. <br><br>People love or hate Noam Chomsky, I fall in the love category. I just feel that whenever I hear him speak he is saying what I sense but I am unable to put into words. I've worked hard all my life but, never manage to get much accomplished so, his words are kinda soothing to my soul. <br><br>I just got finished watching it and already I am planning on when I can watch it again. I'm sure I missed a few points. I just love intelligent people and Noam is one of the best.","user":"pipstraw27","rank":[34,40]}]