[{"title":"Not great but a tale well told","rating":7,"date":"2 May 2016","review":"This is a difficult film to review as there are obvious weaknesses. It is nice to look at and the cinematography balances indifferent acting. The story is not demanding but has a simple charm Old fashioned romance and lost love a story worth telling.. The work which has gone into it does not deserve the vitriolic criticism of one of the reviews posted here any more than it justifies the effusive praise of another.. The director displays some nice touches and must have enjoyed the beautifully framed shot in the chapel towards the end. My compliments to the producer for getting it made and the director for working with limited resources. I for one am grateful to watch a film free of the curse of CGI and noisy intrusive soundtracks I tip my hat to director Derek Ting for telling a simple story well.","user":"SlowRambler","rank":[52,53]},{"title":"Strong entertaining independent film about Hong Kong","rating":8,"date":"11 March 2016","review":"I found 'Always' on NOWTV video on demand &amp; enjoyed. Strong acting by Derek and Danni, cinematography shot in great locations in Hong Kong and Shanghai, cross-border love story also addressing issues of family obligations and finance industry ambitions. Loved the soundtrack! Been listening to Big Phony's music on rotation since watching, particularly song 'But I Will, Everyday'. Great to see a movie addressing serious real world issues in Hong Kong in an entertaining way. Those of us living &amp; working in Asia will appreciate the reality of themes and story. Excellent to see such a well-made low-budget movie reaching a global audience. Congratulations to NiQ Lai for his producing credit. Wishing Derek, Joyce &amp; team the best on this journey.","user":"pbbp-33033","rank":[54,56]},{"title":"Beautiful","rating":8,"date":"20 May 2017","review":"I've never seen Hong Kong shot like this before. The filmmaker takes us to many places and has a keen sense of the geography of Hong Kong(I'm from there). I like the fact that it shows that HK has a lot more to offer than just skyscrapers. The tie in to Shanghai which is booming was smart. I really liked the love story and I won't give it away, but you will feel a nudge of emotion. Absolutely good film and I'd like to see more of these actors.","user":"k-43321","rank":[33,34]}]