[{"title":"Caught me by surprise","rating":8,"date":"16 September 2016","review":"Generally, I don't go for dramas much, and I really dislike long draw- out dramas. I watched Cardboard Boxer knowing zero about it apart from the title, and got totally sucked into the story. Its a story about a human being, not a \"homeless person\". It didn't dwell on the plight of the homeless, or try to preach about the class divide.<br><br>I thought the movie made outstanding use of its unashamedly simplistic characters and setting to tell a very thoughtful story with a rich vein of truth and humanity at its core. I found much I could empathise with despite never having been anywhere near homeless myself.<br><br>But yes, it is no more about \"bumfights\" than Romeo and Juliet is about hot-rods and Brylcreem. For people wanting to see that sort of thing, give this one a miss and skip straight to WWE.<br><br>Whatever its shortcomings may be, this movie tackles some of the darkest places in the soul of man and still manages to bring the viewer through it feeling optimistic and uplifted without having to resort to anything as patronising as a 'happily ever after'.<br><br>Cardboard Boxer touches on many facets of human-nature, but at its heart, it's a love story told through the eyes of someone so utterly alone that they have never even known anyone well enough to develop an unrequited crush, let alone fall in love. By rights, it should be the type of utterly depressing movie that makes me switch off after 10 minutes, but it was quite the opposite. That's a pretty neat trick Mr. Lee.","user":"graemeburke-28832","rank":[33,35]},{"title":"A good drama with a hint of action","rating":8,"date":"20 September 2016","review":"First of all.... don't be fooled by the word Boxer. I generally get thrown off by movies about boxers as I feel this gerne his been swallowed, digested and eventually ended up in the sewer through a process we all privately enjoy. Anyways, I think this film portrays the fear of every human: Loose everything, become homeless and adapt to the street life. I could not imagine, can you? Where do you go? What do you do? What does one do for entertainment? What does one do for money? This film, I think, provides a great glimpse into the life of a homeless man and reveals hardship, friendship and the ups and downs one may or may not encounter.<br><br>His love for his new found treasure, his thoughts, his emotions, his actions are captivating and intriguing. This movie will make you think, will make you appreciate, will touch your soul (I am a cold person and not easily touched or moved).<br><br>Enjoy this movie over candle light, with your better half. Men have a chance to appear empathetic and sympathetic, while still getting a bit of violence in. Win win.<br><br>Superb movie which will be greatly underestimated. Enjoy!","user":"matthijsalexander","rank":[21,25]},{"title":"Really Mr.Church's best work","rating":10,"date":"22 September 2016","review":"I don't really care about any body else's review . I'm an Er doc and I've seen homeless people for most of my life and career.He did a great job showing there desperation and how they have been abandoned.These people are human beings not to be manipulated and deserve the same respect as everyone else.It's not a popular fad to help someone in need .It's a need we should inherently have to help our own species.What else have we become ?Not driven by media but by emotion . Not by government and programs but by the the individual who gives that person a hug ( the burnt child that gives Mr Church in the final scene) .Thank you ,if you ever read this Mr Church.","user":"cobrafix","rank":[33,42]}]