[{"title":"Some balance here...","rating":8,"date":"27 July 2018","review":"I've never written a review, but felt compelled to do so after reading some of the 1 star reviews here. <br><br>This is no Citizen Kane or Matrix. It's never going to deserve a perfect 10. But it also doesn't deserve one star. To all the people giving it the lowest possible score because of the 'annoying children', I have a message for you: as a parent, I can 100% confirm that their reactions were accurate and well scripted. All the screaming. Totally realistic. The 'poor decision making'? Yup, would totally happen too. I'm sick of how binary reviews have become... didn't enjoy the movie? Worst movie ever. Seriously, get a grip. <br><br>Anyway, here's my review (trying my hardest to avoid spoilers, unlike some people here): <br><br>Things this movie didn't do well for me: first, the 'visions' were over too soon. We needed another 5-10 minutes of that. It felt too quick and rushed in. Second, when the reveal comes, we needed more of the backstory... at least another couple of minutes. It all made sense, but it really warranted some additional background, particularly regarding the evacuation. Third, right at the end, the scene in the train was super rushed. The CGI as it went into the mountain was distractingly poor, so they could have spent a little more time on that one... would also be a super simple re-edit if they're thinking of making tweaks to the movie. Finally, I was left a bit unsatisfied that yet another movie with a grand theme such as extinction failed to zoom out and show the bigger picture. This is a pretty big world, and yet we're zoomed in on one area of one city... I really wanted more context.<br><br>What worked well: first, the action was really good, definitely had me sitting up at points. The stress of trying to save the kids and the wife at the same time felt real, I really empathised with the protagonist and thought they nailed some of that. Second, the premise for the movie was genuinely brilliant. There's a story here that they're barely scratching the surface of, and I'm not sure I've seen it told this way before, so some marks out of ten for originality of plot. Finally, the twist... you can feel it coming from the very first scene of the movie, and it's slowly drip fed to you... you kinda feel like you know what it is, which is why I found the reveal so satisfying, because it really does take you by surprise. <br><br>Anyway, that's my tuppence, thanks for reading ;)","user":"lat297","rank":[707,843]},{"title":"Extinction: Nice surprise","rating":7,"date":"11 December 2018","review":"What is it with Netflix lately? They're taking over, everything I watch seems to be a Netflix original movie. And in some cases such as this one that's not entirely a bad thing.<br><br>Extinction is an oddly enjoyable little scifi tale starring Michael Pena, Lizzy Caplan and Mike \"Luke Cage\" Colter. I went in knowing nothing and expecting very little and walked away pleasantly surprised.<br><br>I'm not a big sci-fi guy and the cover certainly makes this look like a generic alien invasion film. I can assure you that it isn't, in fact it's a well constructed highly original clever little movie.<br><br>Arguably it's a big \"Twist\" style movie so I can say very little. What I will say however is that it's well worth a watch regardless of your stance with the sci-fi genre. I found myself genuinely shocked by what I was watching and that doesn't happen very often.<br><br>Netflix gets another thumbs up for one of their originals, good going.<br><br>The Good:<br><br>Some excellent ideas<br><br>Looks great<br><br>The Bad:<br><br>Mike Colter is underused<br><br>I still struggle to like Michael Pena<br><br>Yet another Netflix movie that feels like it should be a tv show<br><br>Things I Learnt From This Movie:<br><br>Lizzy Caplan is immortal and refuses to age","user":"Platypuschow","rank":[61,69]},{"title":"The twist *is* what makes this film a brilliant and rare gem","rating":9,"date":"30 July 2018","review":"I read a few reviews people complaining about the 'twist' and thus I didn't know what to expect. I had seen the trailer and found it interesting, curious, and was impressed with the visuals but hesitant with Michael Peña's acting, but still decided to see this film.<br><br>From the start, everything was on point - the directing, editing, visuals, cinematography, score and story all held my interest quite well. I was really impressed with the modern/futuristic sets. I felt some of the SFX (i.e. some of the CGI explosions) could have been better, but still adequate. The pacing felt a little slow, but started to make sense towards the end. <br><br>But initially I was not impressed with Michael Peña's acting, I felt he was being lazy and struggling with his character, as was Lizzy Caplan. I kept thinking to myself that the two children where much better actors - until the 'twist' happened. Only then did everything fall into place and I understood the two lead characters performances (I don't want to give anything away) and was blown away by the brilliant concept.<br><br>Finally, a sci-fi with something uniquely different and refreshing that was produced exceptionally well. I am truly blown away as almost an hour has passed and I can't get this film out of my mind and certainly want to see it again. My only critique was that I felt the story could have been tighter. I usually complain that a film is too long but for the first time, I'm complaining that I wanted it longer with more in-depth details of the back story.<br><br>I get the wanna be critics slamming this film (mostly for stupid and infantile reasons), but am shocked that the real critics didn't see the brilliance this film had.<br><br>I really hope the producers ignore the negativity and come out with a sequel, as this film is certainly a contender for a cult following status for the true and real sci-fi fanatics such as myself. <br><br>Bravo to the entire production team and especially the writers for creating this little brilliant gem of a concept and executing it into a remarkable film.<br><br>Even though at first you may think, there are no let downs in this film, only pleasant surprises if you're patient. A well deserved 9/10 from me. Please create a sequel!","user":"TheTopDawgCritic","rank":[321,422]}]