[{"title":"Weak, so weak!","rating":3,"date":"9 November 2014","review":"Firstly you'll have to endure around 30-40 minutes of almost nothing, just a presentation of the group, some very dramatic music and personal choices, the love affairs, the group dream and the boredom itself. Afterwards the drama begins!<br><br>I would never recommend H Project, it is slow, weak, not quite easy to predict but that could be because you don't wanna look into it too much. It takes too long to begin and too much to end, the middle is confusing, some decisions are very questionable, instead of a better character built you get to see just how stupid they can act and the ending itself pretty much comes as a slap in the face because it will make the middle almost completely useless. The plot it thin, the acting is OK, characters are, diverse, but nothing looks real, cardboard people that you get to see only in movies.<br><br>You want a good haunted movie? I don't even have to recommend any, there are plenty since the beginning of Poltergeist! Go look elsewhere!<br><br>Cheers!","user":"gothic-fiction","rank":[7,10]},{"title":"H Project","rating":4,"date":"3 March 2015","review":"If you find this film confusing and difficult to follow, rest assured the language barrier has little if anything to do with it. Ditto cultural differences. The theme will be familiar to horror buffs, a group of teens or near teens visit a haunted house. In this case they visit it knowingly, but rather than a mere house this is a haunted city, and a real one to boot.<br><br>The island of Hashima is well known; it was once the most densely populated place on Earth, but was abandoned for commercial reasons in 1974. Our intrepid Thai adventurers visit the island, mobile phone cameras in hand, and then...<br><br>Hmm, well, there is the little matter of a ghost, a mysterious ring which one of them picks up then decides he wants to remove, using a pair of scissors to do so, and as he is drinking what looks like whisky, and is certainly drunk, you know exactly what is going to happen, and it does. He hacks off his finger. At this point, even the dumbest of the dumb would have picked up the finger and made off at breakneck speed to the nearest A&amp;E, but not he. Not that he would have got far because this is where the side plot comes in; his domain is invaded by a terrestrial menace, a gang of armed thugs in pursuit of lucre, but the leader settles for raping one of the female members of the group, and stealing the ring. Bad move, as the gang get in their car, they are murdered in a drive-by shooting, clearly a professional hit, but could this be part of the curse?<br><br>The film is certainly atmospheric, but it tries too hard; the best thing about it is the music, as for the end, well, find your own meaning, reincarnation...?","user":"a_baron","rank":[1,1]},{"title":"Messy and Uneven","rating":3,"date":"19 June 2015","review":"As a fan of the horror genre, I've been looking for good horror flicks and decided to try this Thai film. <br><br>Two hours is quite long for what little actually happens in this movie. The pacing is uneven: Nothing happens for a long time, and then suddenly everything changes in 20 minutes. The final plot twist is so crazy is a totally WTF moment because it makes no sense. <br><br>It's kind of difficult to understand what exactly is happening because given the plot of the story, the timing and location(s) of the ghost doesn't jive with the tale told to the teens. I.e., she appears way earlier than she \"should\" and really had nothing to do with them setting foot on the island. <br><br>Overall, the movie just feels like the director's trying to throw a bunch of horror clichés at the wall and see what sticks. What results is a subpar film, period. Horror or no horror.","user":"holyabdul","rank":[0,0]}]