[{"title":"Inspirational and Well Worth Watching.","rating":22,"date":"22 February 2019","review":"A movie that wears its Christian faith proudly yet isn't ham-fisted is welcome indeed. It does drive home the point that each one of us has a race to run and every one of us will be tested and face devastating set backs and trials. THAT is this movie's strength...showing how faith provides a reservoir of strength and ultimately hope when faced with those trials. The movie itself is dry to start and very vanilla. Yet, I like the right amount of vanilla. It hits its stride with the Christmas moment and peeks when the brother's relationship is fully fleshed out. The performances were masterful by the actors playing the brothers. What seemed strange to me was the ending. After seeing this at the theatre I went home and immediately looked to see if this was based on a true story. If it were, than that ending would have fit. However being a fictional account, I really don't understand the \"downer\" ending. Yes, for those of true faith it's not really morose but it just isn't the way to end a message film.<br><br>Still, well worth seeing.","user":"MovieMystro","rank":[24,32]},{"title":"Excellent movie, don't listen to the critics go judge it for yourself.","rating":10,"date":"2 March 2019","review":"This movie is about real life, hardships, heartaches, love, trust, faith and forgiveness.","user":"faback","rank":[14,21]},{"title":"Depressing","rating":2,"date":"24 February 2019","review":"I really wanted to like this movie, but it was so unbelievable. First off, the two \"high school\" boys are in their mid-twenties--even too old to be college students. The girlfriend is even older--late twenties. Supposed to be dating a high school student? Creepy. Then you have two high school students living alone together in a decrepit, remotely-located house with no adult supervision--no one to clean or cook or earn money for them. Nobody seems to think this is any kind of big deal--just tough luck. Church doesn't help out. Didn't anyone ever watch \"The Blind Side?\" The \"boys\" never go to school or do any homework, never do laundry, never cook, never shop--even so their clothes are always trendy and clean, they are fed, they have a car--so weird. They have no friends (except the creepy, immature nurse), One brother regularly has seizures, but drives anyway--no way he could have a license. THEN there is the bane of Christian movies--way too many terrible crises at once. Sorry. You can have a deadbeat alchoholic father OR have the star football quarterback sustain a career-ending injury, OR have the mom die young of cancer, OR have the brothers have to survive on their own, OR have one of the brothers die unexpectedly (why didn't they transfer him to a major medical center???)--but not all at once. And then the death is treated so lightly--everybody kinda smiles it off. The Christian message was too pat and fluffy. And there is more--like how did the kid who didn't qualify for the state track meet get to run anyway? Why did the star character's personality keep changing? Sigh. Wish I had skipped this one. Really bummed me out.","user":"dlspilgrim","rank":[32,66]}]