[{"title":"Horrid Camera Work, Score and an Idiotic Plot","rating":1,"date":"15 January 2017","review":"I don't understand how they expect to make money of these kind of movies. Are these C Flicks a method to launder money?<br><br>The movie tried to appear real slick but ends up delivering motion sickness inducing camera work. Headache inducing soundtrack and Corny Computer Hardware clichés. Last times like Schwab and Diebold...seriously? <br><br>I'm trying to think of something positive and it's quite difficult.<br><br>I kept hoping to hear the Purge Siren go off, and the main character to start killing everyone to end the movie quickly. It would have been a much more redeemable ending.","user":"adityagt","rank":[44,52]},{"title":"Thinly disguised chick-flick with bad CS","rating":2,"date":"15 January 2017","review":"Bad guys are going to crash all the financial markets in the USA. They tell us they will do it in two days. They tell us in advance so that our hero can assemble his team (like in Ocean's 13, )? Anyway, lots of other hardcore CS action. He needs the \"back door codes\" for all the market servers. He gets them – typed on a sheet of paper. Yeah, that's how I would pass on codes. But don't worry, when they use them the first security key to a market server is \"RG182.\" And when the servers reboot, they all proclaim to be MS-DOS 6. Yes, fresh DOS 6.0, so much better than MS-DOS 6.21 for heavy Internet traffic.<br><br>Anyway, chop up 30 minutes of top CS action like this, stick it into a one-hour soap opera chick-flick. They are separated and fight over their daughter, who is dying of cancer of course. Then we have the betrayed employee who can help save the world – oh, and is banging the dying daughter. Finish up in 2016/17 style – the unbelievable plot twist of a betrayal, and a big-ass preachy ending.<br><br>SUX-net.<br><br>(I see reviewers rave about this wonderful film, blame bad reviews on trolls. Perhaps they didn't watch this turkey, just got a check? One is titled \"very realistic\" -- perhaps they have never been around computers?)","user":"drm-36233","rank":[35,42]},{"title":"How does this junk get off the cutting room floor?","rating":30,"date":"30 January 2017","review":"I don't spend a lot of time reviewing movies, but when I looked this movie up on IMDb and saw a few 'great reviews' I figured those folks were getting paid, so I wanted to add my thoughts.<br><br>My theory is that they made the camera work so bad (the camera is constantly shaking and zooming in and out) the viewer wouldn't notice the terrible character development and lack of plot. Seriously, if you have ever tried to take a photo with a camera while the the zoom/focus constantly is going in and out, then you will have a preview of what it is like trying to watch this piece of junk. Did they give an I-phone to a 2 year old to do the camera work? <br><br>As far as the plot, totally predictable and weak as water, and I felt no no connection to the characters.<br><br>Bottom line: if you were wanting to present a movie where nothing worked, this would be a superb example.","user":"beaver_333","rank":[25,33]}]