[{"title":"Hard crowd to please","rating":7,"date":"27 September 2017","review":"Wow. A lot of people seem hard to please on here. Most series are struggling by the 7th entry (7 stars appropriate) having ruined continuity, rehashed the same formula seen before or by having lost original cast members. A Nightmare on Elm Street had to switch it up to 'it's a movie but not', Halloween had to bring JLC back, Saw was calling it a day, Hellraiser was already screwed and Friday the 13th gave the heroine telekinetic powers to spice things up. It's damn hard to keep a series going and adding new ideas.<br><br>I thought this entry had a lot going for it. Whilst only glimpsed post credits in Curse, Cult sees Andy Barclay back and all grown up since the first 2 entries and also with the original actor, Alex Vincent. Thanks to his childhood run-ins with Chucky, Andy is pretty bad ass taking no crap and is out to to stop him (much alike Tommy in Friday the 13th Part 6 which was a bloody good entry).<br><br>One reviewer said this was cheap in production. This is what I thought of Curse, of which after 2 attempts of watching it, 4 years later (thanks to Cult) I revisited that film and watched it ignoring the lesser production budget. I was maybe a bit harsh. Cult employs animatronics over CGI at every turn apart from one shot that I could see of. I much more prefer this as animatronics still work the best for this character even in this modern CGI world.<br><br>The kills are a throwback to some other films but overall are fantastic for gore with one drill scene which would have had the censors in uproar a couple of decades ago. <br><br>I love the continuity for this film as everything in previous entries is in place and hasn't been changed with many a nod to earlier entries. For fans of the series this does show the love Mr Mancini has when writing these later entries. Add to this all the familiar cast are back including Fiona Dourif who turns out to be an excellent piece of casting (being the real life daughter of we know who) when 'expanding' her role later in the film (I'll not give anything away on that).<br><br>Lastly, people seem divided on the humour in the series. I personally enjoy it. This entry has the humour lacking from Curse which I found a bit bland without it. This entry has enough without being too OTT like Bride or Seed. It's probably my favourite entry and a while since I've seen it but i recall CP2 having some dark humour so stop moaning those who don't like it.<br><br>Overall the entry managed to breath some new life to the series with a new concept that could prove interesting if used minimally (again not saying more)....we are on entry 7 but it ain't telekinesis! The series has moved away from cinema release so the budget is never going to be what it used to be. This can be seen now and then but thankfully not when it comes to the FX for Chucky. <br><br>Child's Play/Chucky films are what they are - about a murderous doll who kills people. They are watched by fans who know what they are getting. I look forward to entry 8 and seeing where things go. Make sure you watch after the credits!","user":"weemonk","rank":[55,70]},{"title":"Chuck Flew Over The Cuckoo's Nest","rating":7,"date":"7 October 2017","review":"The old adage that \"big things come in small packages\" has definitely proved to be true for the \"Child's Play\" films. Somehow, against all odds, this little guy has legs, becoming the most enduring and consistent horror movie franchise in recent memory, spanning and surviving three decades, without retcons or reboots. A big part of that success lies at the feet of writer turned writer- director, Don Mancini, who has been at the helm since the beginning, ensuring consistency throughout each installment. Also along for the ride since the beginning is the indispensable Brad Dourif as killer turned killer-doll, Chucky. Dourif's manic and often hilarious vocal performance combined with Mancini's \"anything goes\" sensibility makes each film a true pleasure to watch. All of that fan-pleasing, funny-bone teasing goodness is back for the seventh film, \"Cult of Chucky.\"<br><br>Picking up where 2013's \"Curse of Chucky\" left off, \"Cult of Chucky\" finds Nica (Fiona Dourif) now committed to a mental institution. Nica has been pummeled by electro-shock therapy into believing she killed her whole family, so it's up to Chucky's original nemesis, Andy (played by a now fully-grown Alex Vincent), to come to her rescue and put childish things away, once and for all. Along the way, he has to contend with Chucky's on-again/off-again lover, Tiffany (Jennifer Tilly), who has now inhabited the body of Jennifer Tilly. Confused? Well, watch the other movies. <br><br>Though it's the second film in the series to be sent direct-to- video, the quality has most certainly not dipped with \"Cult of Chucky.\" Mancini returns to the director's chair for the third time, and his visual style is very much informed by his time spent working on NBC's short-lived \"Hannibal.\" Along for the ride is special effects guy Tony Gardner, who turns in some of his most impressive work to date. The film is riddled with practical effects that are not only convincing, but inspiring. If a DTV sequel can have special effects that put similar theatrical releases to shame, maybe there's hope for the future of the genre after all. On the acting front, Fiona Dourif digs deeper into her character and really seems to relish going slowly mad. The elder Dourif, meanwhile, is as crazy and charming as ever as the voice of everyone's killer doll. Vincent's return to the franchise is definite cause for celebration. His performance is a little wooden, but when you consider he gave up acting some 25 years ago, it's easy to cut him some slack. His presence is enough, as far as this fan is concerned. Speaking of presence, Jennifer Tilly is still an absolute bombshell, and her character feels very lived-in and is now an essential component of the franchise.<br><br>The film has a few surprises you won't see coming, and you'll definitely want to stay until the very end, friend. Like \"Curse\" before it, \"Cult of Chucky\" plays the fan service game without insulting its audience. There's plenty of fresh ideas stirred among the nostalgia, and Mancini's mythology will probably require an extensive road map going forward. The humor is good, the horror is well-done and the film looks and sounds appropriately cold and crisp (shout out to composer Joe Loduca, of \"Evil Dead\" fame). It's all in good, gory fun. Fans who have made it this far will find this \"Cult\" worthy of worship.","user":"Minus_The_Beer","rank":[14,20]},{"title":"'Cult of Chucky' FrightFest Premiere Review: A Good Guy Fun Ride!'","rating":9,"date":"25 August 2017","review":"Back at the start of July I managed to secure tickets to the opening day of FrightFest 2017. As soon as I heard Cult of Chucky was going to be having its World Premiere there, I jumped at the chance and paid money for a day pass even though this was the only movie on Thursday that I REALLY needed to see. Like hell was I risking the single tickets not being available and me missing the chance to see Chucky back on the big screen. <br><br>The Positive<br><br>Like all of the Chucky films, Brad Dourif is an absolute delight as the voice of our favourite killer doll. I really felt that the events that transpired in the movie aided in showing how much passion Mr. Dourif still has for voicing the character and the range he has as a voice actor. I'll keep my praise in the family and say that I was a huge fan of Fiona Dourif as the returning character Nica, who has some VERY interesting character development throughout the movie whilst coming to terms with her actions in Curse of Chucky and facing Chucky once more.<br><br>Unlike most sequels that seem to throw continuity out, this movie does great job at throwing back to the previous entries in the franchise in subtle, yet fun, ways! (there may even be a cameo or two).<br><br>One thing I was extremely happy about was the amount of gore and practical effects used in the movie. There is no noticeable CGI Chucky like the one in Curse and it looked like the majority of the Chucky doll scenes were done using animatronics and puppetry.<br><br>The gore in the movie is on point and not overused to the point of overkill. I mean, don't get me wrong, there are some pretty brutal kill scenes, but not gallon upon gallon of blood split and spraying all over the place.<br><br>Don Mancini was so passionate about the franchise he built when he was doing the Q&amp;A and urged the fans in the room to go out and support this one so that they can continue telling the story we were left with at the end, although I won't be divulging that information until October.<br><br>The Negative<br><br>My main gripe with the movie is that it felt lacking in the plot department. A lot of new concepts were introduced but with little explanation, although Don did say these would be addressed in a future installment if this one performs with the fans.<br><br>Fans of Bride and Seed will be happy to know that Chucky is at his witty best, but I know that a lot of fans take issue with the mixture of both humour and horror. Although the effects were great, there were still one or two set pieces that looked a little off but I can appreciate that this is a low budget affair when you compare it to current Hollywood horror movies.<br><br>It is a solid entry in a franchise that is already six installments strong and it also manages to breathe new life into what most may think is a tired concept. I firmly believe both fans of the original Child's Play series and Bride, Seed, and Curse of Chucky will be very happy at what is on display in this installment and will be begging for another one come closing credits.","user":"jameswdevine","rank":[42,74]}]