[{"title":"\"I'm like a Spanish Conquistador!\"","rating":8,"date":"6 April 2015","review":"\"Kumiko The Treasure Hunter\" (2014 release; 104 min.) brings the story of Kumiko. As the movie opens, we see Kumiko walking alongside the beach with a map, eventually retrieving a VHS tape from under a rock. It turns out to be the movie \"Fargo\", and Kumiko becomes obsessed with it, and in particular the character played Steve Buscemi , who buries a briefcase full of money in the Fargo snow. Meanwhile, we witness Kumiko becoming more and more aloof and isolated in her day-to-day life, including her job as an Office Lady in corporate Japan. It's only when she is watching \"Fargo\" that she feels alive. Kumiko eventually decides to go to Fargo. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Several comments: the movie is directed, co-written by and stars David Zellner (his brother Nathan co-wrote the script). The story is a fantastical concoction that is loosely based on true events, and when I say \"loosely\", you should read that in the broadest possible meaning. The movie's initial 45 minutes play out in Tokyo, and Zellner captures the loneliness and isolation of the Kumiko character, still an Office Lady at age 29, perfectly. When Kumiko is caught trying to steal a huge world atlas from the library and is asked why, Kumiko passionately explains that \"I am like a Spanish Conquistador, retrieving untold treasures!\", to the shock of the library guard. The last hour of the movie plays out in the US, and captures the mood of the 'frozen tundra' and also the mood of the \"Fargo\" movie perfectly. When Kumiko is wondering the snowy fields, the movie becomes the anti-\"Wild\" movie: rather than finding herself, Kumiko becomes more and more lost. Please note that, like in \"Wild\", there are long stretches in this film where not a word is spoken. Knowing some of the background on the real life events on which this is loosely based, I was quite surprised with the ending offered by this movie Last but not least, there is a great instrumental soundtrack, composed and performed by Austin-based indie band The Octopus Project.<br><br>I head read about this movie, and was intrigued by it. Imagine my surprise when \"Kumiko The Treasure Hunter\" opened without any pre-release fanfare or advertising at my local art-house theater here in Cincinnati this weekend. I went to see it right away and the Sunday matinée screening where I saw this at was attended okay but not great. Which is a shame, as this is a very nice 'little' movie that is quirky and off-center, yet always entertaining if not intriguing. IF that sounds like it might appeal to you, you cannot go wrong with this. \"Kumiko The Treasure Hunter\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[41,54]},{"title":"Viewing the world through a whole different perspective","rating":9,"date":"5 March 2014","review":"Kumiko, a Japanese employee, has only one hobby : treasures. She doesn't have any friends, and is really bored by her job. After seeing a VHS of \"Fargo\", she decides to travel to North Dakota to find the money hidden by Carl Showalter in the movie.<br><br>This movie is an excellent piece of work. Rinko Kikuchi appears under a new face with this introvert and amazing character, inspired by a true story.<br><br>David Zellner really did a good job of balancing comedy and drama : never exaggeratively funny, nor never desperately sad, the directing is very subtle and finds its own way to create an atmosphere around the point of view of an unusual character that sees the work differently than most of people do.<br><br>Which is, sometimes, really refreshing.","user":"Neossir","rank":[49,74]},{"title":"Surreal","rating":21,"date":"21 October 2016","review":"An introverted, heavily antisocial woman in Japan sees Fargo, the Coen Brothers film about a couple of gangsters failing at a job, and in the process hiding and losing a briefcase full of money. Fair enough, but the fun and the story start when she becomes fixated on the fact that surely this must be a true story and there's a real treasure somewhere on the side of a North Dakota road just waiting for her.<br><br>Kumiko is a bizarre story, as you have probably already surmised. Rinko Kikuchi, most known for Pacific Rim, plays the lead here, and she absolutely sells the character. She is the epitome of a square peck in a round hole and it's at times painful to see her trying to surmount the obstacles of everyday life that we take for granted. And a lot of the mystery of the film comes from wondering how she ended up like this and just how deep her condition goes. There's a very good scene near the beginning where she meets an old friend, who greets her like any other high school friend you have not seen for years, and you realize that surely Kumiko was not always like this. Something happened.<br><br>But the real treats start rolling when Kumiko decides to follow her only true passion and buys a plane ticket to America. The rest cannot be really talked about without spoiling the story, but trust me that it's just as surreal as Fargo at its best and, more often than not, even more so.<br><br>Plus, the ending, which is just about perfect. The only way this kind of story could really end.<br><br>Kumiko, the Treasure Hunter is an experience. Its reach is perhaps greater than its grasp, but it's still a movie I'd definitely recommend for its sheer ambition and uniqueness.","user":"Vartiainen","rank":[7,8]}]