[{"title":"what?!","rating":10,"date":"2 July 2016","review":"Bo Burnham found accidental fame after posting a couple comedy songs on YouTube. His first special \"words, words, words\" was a collection of pun heavy comedic songs which would have you laughing instantly and than hours later after the puns finally caught up with you. This special 'what' follows in his trade make style of quick and quirky comedic songs while this time being accompanied by an arrangement of lights and backing tracks. Burnham talks about religion, modern 'pop stars' and ask's questions we never knew we needed answers too.<br><br>This musical style of comedy is very quickly becoming my favourite genre. 10/10 glittery dick jokes.","user":"scoobz_93","rank":[9,11]},{"title":"The most artistic and daring comedy show I've ever seen","rating":10,"date":"18 October 2017","review":"I have admired Bo Burnham since he was 16 and I was 22. At the time (and still), I was teaching 16-years-olds how to write music; but for me, Bo was a source for my own study. His wit, his timing, and his absolutely genius writing was simply something I had never seen before in lyrical form.<br><br>Bo started out as a giant: and still he continued to grow. This show is, simply put, masterful. It is laugh-out-loud funny, it is surprising, it is honest, and simultaneously real and surreal. Bo: my hat is off to you. Please keep doing exactly what you're doing: and please keep surprising us with something different.","user":"broadwayacr","rank":[4,5]},{"title":"This","rating":8,"date":"20 December 2013","review":"Bo returns to the stage, and delivers on his multiple talents - playing instruments(mostly \"air\" ones) and comedy - musical(including making it largely out of sampled sounds), verbal and physical. He goes for wordplay, the clever, and the silly, with universal jokes, rather than ones that will date this.<br><br>As usual, he prioritizes being consistently funny and challenging over having one specific focus - with that said, he does get rather introspective(such as the \"two halves of the brain\" bit), and one can tell that he has grown since he launched on the internet. Of course, this doesn't mean that he is unrecognizable, far from it. His brand and identity remain intact, and in-between, sometimes even in, the intellectual parts, he gets just as immature as we want him to.<br><br>Awkwardness is embraced, not shied away from. That of himself, and some of the things that go into shaping a show like this - yes, he does go as meta and self-referential as usual(a child of YouTube, that much is clear). We can follow his line of thinking, and yet he throws curve-balls our way. Plain and simple, we never, for a second, know exactly what he's going to do next, and whenever he jumps tracks in his train of thought, the audience(including the live ones for the video recording of this) loves it. It is simply that carefully crafted.<br><br>Among his material are social problems(with an indictment of himself and other artists, making this simultaneously the illness and the cure, the reason for needing, and the actual pursuing of, therapy), integrity, religion, sexuality, etc. At the time of writing this, the entire well-paced 60-minute presentation is up on, and thus endorsed by, his own channel, so legally free to watch.<br><br>There is brutal and disturbing imagery in this. I recommend this to any fan of Burnham. 8/10","user":"TBJCSKCNRRQTreviews","rank":[4,6]}]