[{"title":"Some good ideas hampered by an underwhelming execution","rating":6,"date":"27 February 2015","review":"The premise of The Atticus Institute is a very promising one. In fact, going into it, I was not sure if it was going to be a documentary or a fictional movie. In the event, it turned out to be a pseudo-documentary. Set in the mid 70's, it's about a group of scientists who perform a series of paranormal experiments on a woman with extreme extrasensory abilities. Before long the government get involved and things go increasingly badly wrong.<br><br>The film-makers have taken some care to present this in a manner that replicates an actual documentary. To this end we have lots of talking heads footage involving people who were connected to the story and there is also retro looking filmed material as well as stills. It would only be fair to say that the execution of the whole thing is less than the actual ideas. It's pretty low budget and this accounts for some mediocre acting, while the script was a little clunky in places. The biggest problem though is that it all gets a bit samey and one-note after a while with little variation in events. On the whole, however, it gets points for trying to do something interesting and having an intriguing central idea. It could surely have been better but it has some good things about it.","user":"Red-Barracuda","rank":[24,34]},{"title":"Good ideas, but movie fails","rating":3,"date":"15 February 2015","review":"I like mocumentary style more than founded footage, but movie absolutely fails in realization. I would like to have movie with similar plot and style, but this was cheap with terrible CGI and actors. A lot of clichés and mistakes. Some footage from 70s doesn't looks like footage from 70s because it is shot in FullHD, 16:9 with just computer effect. Even VHS films was more believable. <br><br>It have some interesting ideas, but didn't use them too much (security system automatically skips camera after few seconds, first kinetic people in lab was just a hoax), movie keeps staying in stereotypical loud music scares and clichés (dogs are barking, because something evil is happening). I would prefer it in style of real documentaries - not too many quick cuts and no jumpscares. I would prefer more practical effects or at least good CGI effect. Death of main test subject looks like something you could make in After Effect in few minutes. It was almost laughable.<br><br>I liked movie \"The Box\" by this director, it is a much better movie.","user":"trnkafilmstudios","rank":[17,24]},{"title":"How can you hate this movie?","rating":9,"date":"21 February 2017","review":"Seriously how can you hate this movie?<br><br>Clever, interesting and original The Atticus Insititute gets a thumbs up from me, hats off to writer and director Chris Sparling. <br><br>Filmed as a mockumentary, it initially revolves around telekinesis and one particularly gifted woman, Judith Winstead. Rya Kihlstedt who plays Judith gives a brilliant and totally believable performance.<br><br>I really don't want to say much and spoil any of it, I'd just say give it a go.<br><br>How many noses does a monkey have?","user":"nancy666","rank":[6,8]}]