[{"title":"Unexpectedly riveting.","rating":9,"date":"20 March 2014","review":"I had intended to just watch the opening, after so many people I know were recommending this to me. \"I gave it a shot,\" I was going to say. \"It's just not my thing.\" Minutes later, I was shushing my family so I could hear the movie. I couldn't turn it off until the credits rolled. SO good. Such a fantastic character study of these quite different people, their quite different lives, and their shared dedication to Dota.<br><br>I'm not into Dota. Not even a little. I think I played it one time, and didn't enjoy it. I wasn't expecting to enjoy this either. 75 minutes of Dota? Yawn.<br><br>But it's not 75 minutes of Dota. In fact, for a documentary about a Dota tournament, there's very little Dota in it. They don't really explain the game much at all, or why certain units were chosen over others. This was 100% fine with me (since, let me stress, I am not into Dota). Instead, it was all about the _players_, and was incredibly compelling.<br><br>Who do you cheer for, when you have sympathy for all of them?","user":"Phoenix-24","rank":[56,62]},{"title":"A surprisingly emotional look into the growing world of E-Sports.","rating":8,"date":"19 March 2014","review":"Free to Play follows the story of three pro-gamers who are given the chance to win 1 million dollars from the tournament of the online video game Dota 2. The Ukrainian prodigy Dendi, the American veteran Fear, and the Singaporean talent HyHy. <br><br>Right off the bat, this is a beautifully shot and expertly edited documentary. The in game footage itself has been spiced up to fit the drama, and even though you will hear a lot of gaming jargon, it will be very clear as to whose winning or losing in the heat of things. <br><br>What I didn't expect, was the amount of emotion Free to Play builds up. You realize that these players have literally given it all to pursue a career in gaming and the pressure is on. Pretty much all three, especially HyHy, have parents who blatantly disprove their career choices and would rather have them studying and pursuing a more stable path. The film does not glamourize E-Sports as a sure fire way to fame and fortune. E-Sports is a high risk, high reward, winner takes all industry and does not guarantee a steady income. How these players deal the pressure from home, and at a tournament at such a young age is truly remarkable. Close to the end, this movie can become a real tear-jerker for the light hearted.<br><br>E-Sports is a fast growing industry, and Valve has made a great contribution to promoting it. As for the criticism that Free to Play is just an extended commercial for Dota is very unfair. It is akin to calling 'Senna' an extended commercial for Formula 1. Of course the sport in question will be featured time to time. Free to Play is a look into the human side of this sport and the motivations and challenges of the players. My only real complain is that it is a bit short. I would have loved to see another 20 minutes just to hit the 90 minute mark.<br><br>Overall, this is a solid and well made documentary. It is available to watch for free on YouTube and I would recommend playing it in full HD.","user":"hanz12891","rank":[29,32]},{"title":"Incredibly experience","rating":10,"date":"19 March 2014","review":"This movie is basically for everyone who doesn't understand the hype on e-sports to get it, it's seriously amazing, i couldn't have loved the movie more than what we got.<br><br>I really loved features from different sections in the e-sports world, from North America to CIS to China each one of those guys had to work hard to achieve what they've achieved. Fear for example has been like 10 years in the e-sport scene and just one couple of weeks ago he got to win his first lan (monster invitational) which i must imagine must feel amazing.<br><br>So yeah i'm rating this 10/10 because it's obviously worth the wait, it's an incredibly piece of work and valve and the players (in general) should be proud of this movie.","user":"pokemonthgeneration","rank":[60,75]}]