[{"title":"Terrible acting with an even worse plot","rating":11,"date":"11 November 2014","review":"I'll begin with a couple of positives for this film, and there aren't many. Firstly it is shot quite nicely its a nice film to watch and the soundtrack and editing is also pretty well done. That's it though.<br><br>At the beginning we see Jane (played by Sarah Butler) sparring with her partner in her house, doing a few punches and knees to a pad he is holding. I mention this because later in the film this is very important when dealing with assassins. <br><br>The entire first half of the film is set in Jane's office where she sits at a computer screen (touch screen may I add to make it look even cooler) pretty much the entire time where she discovers some fraudulent activity has taken place within the company she works for. Alarmed by this she spends even more time at her computer to make sure what she has discovered checks out. <br><br>She then informs her co-worker Ronald (played by Ian Gomez) about this discovery, who informs her they should take it higher to report it. However, in true plot twisting style, Ronald is in on this whole shenanigans and instead of reporting it, he calls in \"the muscle\", namely FRANK (D.B. Sweeney) to sort out this mess and shut her up.<br><br>Now FRANK being an assassin, is having an off day, not only does he let a woman beat him up so she can escape, he also misses her from about 10 yards with a gun containing seemingly infinite ammunition. Jane then gets in the elevator where she stays for the entirety of the second half of the film. The lift is disabled because Ronald presses one wrong button so Jane is trapped in there. Things turn worse for FRANK as he realises he cant get to her, so he kills the security guard and smashes Ronald's head in with a bar because he's being annoying. After another session of shooting at Jane in the elevator with another 15 bullets, FRANK misses with 14 of them, yes that's right, he still cant hit Jane even putting his gun in the elevator where she runs from side to side. He finally manages to hit her with one bullet, however this doesn't kill Jane, it merely grazes her and at the end of the film gives her magical powers. FRANK is now in serious trouble because his gun which contains about 50 rounds of ammo has finally ran out.<br><br>He realises he needs to call in the elevator expert to open the lift and get Jane out. The elevator guy arrives, FRANK lies to him saying Jane is saying crazy things because being locked in the elevator has made her go mad. The elevator guys believes FRANK and starts to get her out, he then sees an empty bullet shell on the top of the elevator and realises FRANK really is a naughty man. He tries to escape but FRANK having that assassin intuition realises he's on to him, FRANK then beats him to the ground and pulls out a knife, at this point you think its game over for the elevator guy but for some reason FRANK decides to stick the knife into the top of elevator guys shoulder that merely grazes him. Another fail for FRANK. <br><br>Finally the movie comes to that classic end battle between good and evil. Jane v FRANK on top of the elevator, where else. This is where the first scene I mentioned becomes really important. Frank the Assassin v Jane the slim beautiful office worker. No content right? right? WRONG.<br><br>In a amazing turn of events, Jane suddenly becomes MMA's Ronda Rousey, pummelling FRANK with punches, kicks, knees, at one point she even climbs the elevator pulley and does a spinning roundhouse to finally knock him off the top of the lift to fall to his imminent death. It is tense, you really do not know who will win the fight, but eventually after gasping for air it is Jane MMA champion who comes out on top.<br><br>A fitting end to a truly appalling movie.<br><br>Malcolm McDowell plays Thaddeus Gault, the owner of the company and the man behind the whole fraud thing and there's a half hearted sub plot going on between Jane's partner and her co-worker over a meal in a restaurant.<br><br>Terrible","user":"alan-micron","rank":[41,55]},{"title":"Surprisingly Fun and Entertaining. Sarah Butler Did a Good Job.","rating":6,"date":"25 December 2014","review":"I'm not really sure why the other reviewers (2 at the time of this writing) have given this movie lackluster reviews. I liked the movie. I remember seeing Sarah Butler in \"I Spit on Your Graves,\" and she was fabulous in that. I've seen her in a few other things, mostly guest spots, but she is someone who should be a star. She is a really good actress. She was convincing in this movie as well.<br><br>D.B. Sweeney was good in his role, but his role was not written very good. Instead of being someone who is feared, he's the kind of bad guy who's more comical, though it's not intended. He apparently has a magazine clip in his gun that carries more bullets than any that are actually on the market, because it never seems to run out of ammo. Also, when shooting at the girl, he was more likely to hit her if she ran than if she stood in one place. Yes, he could have spent a little time at the gun range learning how to shoot. He had a disagreement with one of his colleagues, so BAM - a wrench to the old thinker solves the problem. He behaved more like a part-time thug than like the chief muscle the founder of a multi-billion dollar company would hire.<br><br>Malcolm McDowell should have been used more. Possibly, he was too much money. The film cost $1.5 million. By the look of the movie, I thought they spent more than that. McDowell, Butler, and Sweeney are not nobody's. They're not superstars either, but still.<br><br>I gave the movie a 6-star rating, because I thought it was fun and entertaining, which is really all I look for, especially for a movie like this. It could easily have been made for television. However, Sarah Butler gave a realistic performance, and I thought this movie, based on the other two reviews, was going to suck. It did not.","user":"chrismackey1972","rank":[11,16]},{"title":"Give me control of a nations money supply, and I care not who makes it's laws","rating":4,"date":"20 November 2014","review":"Free Fall is a low budget direct to home video film that never really gets anything done. The story is there, but you can basically tell where it is going early on. While this is usually not a bad thing for these types of films, nothing exciting ever happens to keep our attention. The following is my review of Free Fall.<br><br>The film was written by Dwayne Alexander Smith. Smith is a relative unknown, which doesn't really hurt a film like this since the plots are usually paper thin to being with. The story follows Jane Porter(Sarah Butler) as she goes into work one day to find that her co-worker killed himself by jumping off the roof of the building. As Jane is cleaning out his work space, she finds a flash drive that has evidence that her company is taking part in criminal activity. When Jane tells one of her bosses what she found, the muscle comes in to knock off another employee to keep this quiet. Jane eventually gets caught in the elevator and the rest of the plot unfolds, or lack thereof. As I said above, the plot is paper thin, and sadly there is little to keep you interest for eighty five minutes. While I expected a bland script for one of these direct to home video films, this one just didn't keep my attention all that well.<br><br>The film was directed by Malek Akkad, who is well known for being the big name Producer of the Halloween series, having taken over that spot from his late father. Akkad is not known for directing film, as this is his first major outing as a director. If you can even call this a major outing. There is not much action until very late in the film, and even then the action is very light. The film overall though it shot amazingly, and you never really get the sense that this is a direct to home video film, that is until towards the end of the film there is a cheesy CG shot that looks awful.<br><br>The acting is fairly good, which surprised me. The film is lead by star Sarah Butler(I Spit on Your Grave) and secondary actors like Ian Gomez, D.B. Sweeney, and acting legend Malcolm McDowell. With names like this, you cannot go wrong in terms of acting. I've never payed attention to the career of Sarah Butler before this film, but she doesn't do a bad job in this film. D.B. Sweeney is one of my favorite actors, and he plays a fantastic bad guy, even though his character is not all that well written. Malcolm McDowell can play any character in any film and totally pull it off without any problems, and that is the case once again in this film.<br><br>Malek Akkad has a fairly good outing at his first attempt at directing a fairly bigger film. Sadly, the script wasn't anything special to keep our interest.<br><br>Timothy Andrew Edwards is the composer of this film, and most of his experience has been composing television material. While this is not exactly an award winning score in any way, I must say I did enjoy what Edwards did with this film. The score is fairly cheesy, but that works in a film like this. Overall, Edwards doesn't offer up anything amazing, but his effort is good enough for a film like this.<br><br>In closing, this film is a below average direct to home video film. The story itself is hurt by the uninteresting story later in the film, and also lack of action. The acting is really one of the few bright spots of this film, so if you are a big fan of smaller films like this, mixed with some good acting, this is a film you probably will want to check out. Most however will likely just want to skip this film.<br><br>4/10","user":"CowherPowerForever","rank":[10,18]}]