[{"title":"Check out \"Palo Alto\" instead of \"Memoria\"","rating":5,"date":"5 February 2017","review":"\"Memoria\" (2015 release; 70 min.) brings the story of Ivan. As the movie opens, we see a guy walking into the Golden Gate Bridge. Is he thinking of jumping off? We then go back in time, as we get to know young Ivan, whose father, a Russian immigrant, has returned to Russia. Ivan's stepfather is the stern type, making awkward attempts to forge a relationship with Ivan. As Ivan grows older, he becomes even more distant from his mom and stepdad, and instead spends time with his friends. At this point we're 10 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the second movie that is based on James Franco's writings. In 2013 there was the okay \"Palo Alto\", and now this. As in the earlier movie, Franco plays a small role, as the HS teacher who tries to help out van. Franco has maybe 10 min. of screen time. Indeed, the focus is not on Franco, but on Ivan (played by Sam Dillon) and his HS friends, whose idea of getting through the day is to do as little as possible, while partaking in drugs quasi constantly. As Franco's character says: \"I know how hard it an be to be a HS kid\", and indeed we feel Ivan's pain and isolation. Ivan comments \"I don't care what they think\", but instead he does very much care, too much so indeed. An obvious question is why this movie is a mere 70 min., too short really to be a theater-ready full-length feature. Surely, the makers could've come up with, say, another 10 min. of material? <br><br>I had no idea that this movie was released (it premiered at film festivals in Fall of 2015, and then next spring went straight to DVD), and when I noticed it the other days at my local library, my curiosity was peaked and I had to check it out. It's not a bad movie per se, but neither is it all that memorable. The similarities between this and the previous \"Palo Alto\" are obvious, but \"Palo Alto\" is easily the better of the two movies.","user":"paul-allaer","rank":[2,2]},{"title":"A Boring Teenage Diary","rating":1,"date":"13 July 2016","review":"I can't believe this film was an academy nominee. It's the heart-boring story of a spoiled white boy who smokes weed all day, but isn't satisfied with a life of entitlement. So, one day after not really trying to do anything or ever trying to change his life, he decides it's not worth it and jumps off a bridge.<br><br>In order for this to be considered a legitimate review, I'm required to write ten lines about this movie. However, given the content of the film, that's a daunting challenge. I wonder when it is that our poor character finds the strength to almost kill his family (but is ultimately too weak to even do that)--was it when he was wishing he could be with the blonde girl? Was it when he wasn't attending class? Was it when he wasn't practicing skateboarding? Or, was it when he was smoking weed that he was hit with the great epiphany that his life actually doesn't matter to himself or to the audience?<br><br>I guess we'll never know and this film doesn't seem to want to answer that question.<br><br>With a hipster soundtrack and cameo appearances by Cole of The Black Lips as the drug dealer, this film will be the whatever of the whatsit thing that whatchamacallit, you know? Chyeah.","user":"jmdavisjmdavis","rank":[9,18]},{"title":"Really effective and well-done","rating":30,"date":"30 May 2016","review":"I found this to be a deeply affecting film. It's not fun by any means, but the dialogue felt really on-point in its realism and it did a great job of really making us understand just how the lead character felt. The whole mundane existence that he felt he was living, I've seen many films try to accomplish it but I think this one greatly succeeded. It puts everything into perspective as to why these awful things happen and why these people, who are many times just like the rest of us, are on the brink of committing acts that could ruin the rest of their lives. Really god acting as well, really well-written and directed. I definitely recommend this film to anyone wiling to endure some hard-to-watch realism.","user":"Red_Identity","rank":[8,19]}]