[{"title":"If you like horror, see this","rating":9,"date":"20 December 2016","review":"I'm a big horror fan and this is the best little horror yarn I've seen in ages.<br><br>Well acted, with some recognisable faces. Brian Cox is great as the small town coroner that leads the autopsy on the titular body, in one scene he even managed to give me a sad lump in the throat which was an unexpected feeling during an unnerving horror flick. Emile Hirsch plays his son and assistant and though he's good doesn't have as much impact as Cox. Roose Bolton (Michael McElhatton) makes an appearance as the town sheriff.<br><br>Where this film really succeeds is in doing something a lot of modern horror has forgotten about - it toys with the viewers imagination, creating an uneasy feeling out of the narrative, half light, sound and shadow. This is not to say you don't get to see anything grotesque or unsettling, as certain scenes are not for the squeamish.<br><br>I don't want to spoil the story but will say this, the resolution is not quite as good as the build up. It's very hard for a horror film, especially one that plays on fear and the imagination, to deliver a conclusion that is suitably unsettling - this one half succeeds. But the ride is more than worth it and the ending is far from a failure.<br><br>If you like horror, watch this.","user":"umme4uke","rank":[337,399]},{"title":"Creepy as Hell","rating":9,"date":"21 December 2016","review":"And a simply wonderful throwback to the 1970s when horror was, well, horror -- and not based on gimmicks like \"found footage\" but rather genuine scene-setting, story building, audience engagement, and full-tilt creepiness.<br><br>Probably destined to become a classic.<br><br>Brian Cox is this generation's Donald Pleasence, that is to say, a character actor who could not give a bad performance if he tried yet is destined to never actually stand out in any single production because that is his style.<br><br>Director André Øvredal is one of those rare finds -- an auteur with (so far) a small body of work who is producing better and better films. This suggests that over time he will probably give us bigger and better treats to come.<br><br>And while Ophelia Lovibond does not get a lot of screen time, the exposure she does have will only add to her fan base. An American accent so natural you would think she was trained by Hugh Laurie and a performance so sweet you might not even recognize her (unless you looked twice) as the very same actress that underpinned an entire season of Elementary.<br><br>Recommended? This is a must-see!","user":"A_Different_Drummer","rank":[259,318]},{"title":"A pretty good idea","rating":6,"date":"28 January 2017","review":"This movie's story isn't actually a bad idea! I love the fact that it's about a topic that isn't too cliché, however, the small predictable scenes kind of ruined the fun. <br><br>Things that didn't need to happen that did: - Girlfriend didn't really need to be accidentally axed to death, there was minimal reaction to this and it was so unrealistic - Cat didn't need to be found mangled, then within 2 seconds, receive a neck snap, no questions asked, again with no realistic reaction from characters - Morgue bodies didn't really need to start walking about again like zombies - Being trapped in a storm without electricity or signal on the phone (obviously)<br><br>Things that needed to happen that didn't: - More history on the witch - More cool facts about the dates and possibilities of what happened to the witch - Tie the loose ends about her links with the characters she was involved with<br><br>I loved the music, the unusual scenes, the CSI style findings and whatnot, I wish there had been more story and less jump scares.","user":"Lignin92450","rank":[129,156]}]