[{"title":"Psychological Thriller Could Develop Characters but Offers Solid Genre Pleasure","rating":7,"date":"14 June 2016","review":"If you're coming to this film because you enjoy the actresses, you won't be disappointed, because they give strong, thoughtful performances. An English actor unknown to me, Joe Anderson, is particularly strong in the limited role of an abusive boyfriend. Eli Gather is an ingenious choice in the other central role as May (Jessica Biel)'s boyfriend. A fifth role is woefully underdeveloped: Kate Burton plays May's mother, but she isn't given enough material to shade the portrait of psychological control she exerts over her daughter. <br><br>The story is cleanly laid out: May is a yoga instructor who lives with her boyfriend Dex in a residential studio that hosts the classes May leads. We first see her exploring the information that she has a biological sister from a mother she never knew: This is Shiva (Zosia Mamet), a \"sexy massage\" worker who lives with boyfriend, the psychotic Cody (Anderson). What's best about this noir representation of upper middle class and lower class L.A. are the scenes director Diane Bell writes for the May and Shiva as they reluctantly meet, go to a bar, and slowly, as they drive around (we need to see more of these locales) learn about the other, before May takes her home, where they meet the cautious, almost superciliously straight Dex, who has May on a tight leash he's only partly ready to admit exists between them -- these scenes make you aware of the possibility of borderline personality disorders the two central female characters share in their creepy relation with their boyfriends, who seem in other ways entirely opposite. The script, which results in an 84 minute film, needs to develop how the social scenes the characters belong in offer resistances to who they imagine they might be, but Bell has created a chamber piece for five characters, with three locations: Shiva and Cody's apartment (which includes a gun -- okay, that's a tired trope), May and Dex's studio, and the Santa Barbara house May and Shiva flee to when Cody almost immediately becomes possessive of his \"girlfriend's\" new sister. The three locations are crucial to the drama, but they don't allow the characters enough space to act out versions of who they are and what their developing relationships might mean. <br><br>Mamet's Shiva is a bit of a sludge: She doesn't seem to pick up on the possibilities this latent sister offers her (where is the discussion of May's spiritual practice? How else are we to understand it?), but rather siphons off the energy others project in her, and what's that all about? The film (perhaps channeling May too closely) circumspectly denies to us the representation of how Shiva goes about her job, so that the sex worker milieu becomes almost a fantasy projection of the audience's interest in the actresses. This strikes me as an impoverished craft decision on Bell's part. Mamet seems almost to be fantasizing a sex worker, but is stronger in her work with Biel's May, and Anderson's Cody. Biel, however, is suited very well to play the highly controlled, \"bleeding heart\" May, whose every thoughtful decision seems to leave her farther from a life that would sustain the soulfulness her yogic work projects for her. Bell shrewdly shows how cold is this life May and Dex have made with each other, and what might be at stake in May's escape from it. Biel shows us the fragility of that life West Coast spiritualism promises its adherents, and the price it pays in the beauty it so easily affords. <br><br>The cost is finally tragically high for May. It's a spare and understated close, but it satisfies our expectations.","user":"jbhamilt-1","rank":[7,7]},{"title":"Love dramas like this","rating":10,"date":"25 May 2016","review":"I watched this film alone. I actually found myself yelling stuff at the screen. Something I never do. I was really into it.<br><br>Good dramas are like this. Keep you rooting for certain characters. The two sisters were great characters and I rooted for them the whole movie.<br><br>The story is in large part about an abusive boyfriend and the issues that it entails. The story and acting were top notch with great performances. I never had an issue with the acting.<br><br>I wonder how much this cost to make. It is a pretty simple story but so well executed. The best kind of story is simple but done well. If you like dramas and this type of story I would recommend.","user":"SillyGayBoy","rank":[11,17]},{"title":"Sketchy pacing and inconsistent narrative hamper its well-intended message, even though the sisterhood vibe by the two leads is lovely.","rating":5,"date":"20 December 2015","review":"Family tie is a good hook for drama, especially if the two main characters are pretty endearing. The cast, albeit small, perform admirably to set strangely surreal characters. However, this is a simple story told in excessively cumbersome way, the slow pace and mundane script prevent any excitement from the first half, and even when it looks like it would gain momentum, it doesn't end up in satisfying conclusion.<br><br>May (Jessica Biel) finds her long lost sister Shiva (Zosia Mamet), but their lives are world apart. It's basically the entire premise and there are not many twists or shocking developments. What the movie does well is presenting these two sisters with modesty. Jessica Biel and Zosia Mamet look the part of siblings, they also have a good on-screen connection. Their relationship is heart-warming and even thought-provoking at times.<br><br>However, the movie takes a very sluggish approach. This may necessary to build up characters, yet the scenes tend to get tedious early on. Some interactions feel repetitive, such as the sisters' banters, which might be adorable but it can be quite overused, the abusive boyfriend who constantly bullies them and shallow use of alternative life style. It needs about one hour to get the momentum rolling, and it's still imperfect then.<br><br>Edi Gathegi and Joe Anderson play the male supporting characters, they do a presentable job considering their personalities are not as deep as the sisters. This is a drama through and through, it may turn into thriller slightly, although it doesn't know what to do when it gets there. The theme of violence or rape could be used more thoroughly instead of being another uncomfortable gimmick. It only partially succeeds in displaying female empowerment.<br><br>There's a delightful drama at heart with the sisters, yet the extremely sloppy pace and one dimensional direction only amount to mediocre showing. .","user":"quincytheodore","rank":[7,11]}]