[{"title":"An Unpredictable Thriller","rating":7,"date":"24 July 2017","review":"American Romance, though a violent rendition of love experiences, is without question a fresh cinematic depiction of the complicated subject of love with great depth. The raw sexual scenes were necessary to underscore the carnal level, while the dialogue buoyed the more cerebral forms of love relationships. I only recognized one actor in the movie--John Savage--who is an awesome actor, but all of the other actors carried their parts with great professionalism. Each really excelled in their roles. There were a number of unexpected twists and turns in the film. It was a serious and complicated thriller which is not for the faint of heart. I highly recommend it.","user":"wendellfountain","rank":[6,13]},{"title":"Daveigh Chase","rating":5,"date":"2 March 2017","review":"What to say about this movie. I picked it up simply because Daveigh Chase was in it, not really knowing anything about it. It's been two days hence and it is still throwing me for loops, and with chronoceptive hallucinations those loops get real weird, real fast, I digress. The opening scene is haunting, disturbing when that very old hippy dude extends a hand to a very young girl of 6 or 7 we know what is happening, but if we are slow on the uptake they added evidence through the boy who was playing in the sandbox with the girl. trip ahead, what 10 years? yeah maybe 13 years and we see dead bodies set in dioramas. The grown boy and girl are our protagonists. The old truck driver seems to be our killer, we see him kill, so we really can't go wrong suspecting him (I didn't) The script is kinda all over the place, there are two timelines to follow and they do a good job of confusing us, has to be intentional, because if it isn't they are bad filmmakers. There are some conversations, some murders, then it's over and we are left wondering what the one timeline had to do with the story, just some weird plot element that just didn't work. Daveigh gave a decent performance. There is an undercurrent that is never really fleshed out and that's the connection of the first scene and the rest of the movie. I think we are asked to find that ourselves. Even though it knocked me, I enjoyed it. No it is NOT a 10, but if you enjoy it what difference does the rating make? See it, hate it, enjoy it, whatever just remember it has Daveigh Chase","user":"deadgirlsamara","rank":[2,5]}]