[{"title":"Laugh :D","rating":1,"date":"21 October 2015","review":"Bikini Model Academy, as the name says it is about Bikini Model Academy. But there is nothing model nor academy about this movie all there is bikini. There is no sense, no story, nothing. All there are some half naked somewhat hot girls running around wearing bikinis. Oh there is one naked one, I do not know what was the purpose of her. I think everyone was high when they shoot this movie so they did not realize how lame is it.<br><br>So you may ask why I wasted 30 minutes of my time. It is simple: to warn you all through this review. Stay away from this one. Trust me you are not missing anything. Rather do something useful, like plant a tree or something.","user":"niaz_islam","rank":[49,57]},{"title":"Total piece of crap","rating":1,"date":"9 July 2016","review":"This movie is so bad i want someone to pay me back for the time i wasted on it. No story, random events and not even the hottest girls you can find. I cant even understand how they made Morgan Fairchild appear in this, but Busey i can understand as he has become somewhat of a joke recent years and takes anything that pays his next drink.<br><br>The actors have personalities totally blown for any good screen appearance, so maybe the actors should attend a Actor School soon before their next role.<br><br>So save yourself, don't bother with this movie. Its not even worth watching for the \"girl\" content as 5 minutes on google gives you better results.","user":"hawkie_norway","rank":[7,8]},{"title":"Awkward, just awkward. Teen flick gone wrong on every level.","rating":1,"date":"18 October 2015","review":"Two friends kills their latest Marihuana crop and thus loose their girls who are portrayed as simple gold diggers. While eating some pot cake they get the \"brilliant\" idea to create a bikini modeling school. Busey as their mentor tells them to create a business-plan, the 3 stage plan is \"get girls\". Failure to attract girls/\"students\" forces them to pay students to attend. The comedy is completely lost and what remains is a sad awkward mess. Gary Busey is terrible as their \"mentor\" and just sad to watch.<br><br>This movie is so below par and it fails on pretty much every aspect. The only thing it has going for it is girls in bikini, and that seems to be the very idea of selling this sorry excuse of a movie. <br><br>Do yourself a favor and spend your time and money on something else.","user":"pfsense","rank":[12,17]}]