[{"title":"Van Gogh's art comes alive","rating":9,"date":"20 September 2017","review":"This beautiful work has made history in the genre of Animation cinema - a precious gift from devoted film-makers. The story is well known - a matter of history. Vincent painted the portrait of Joseph Roulin, Postmaster of Arles. The film tells us the story of Vincent's life and last months before his death on 29 July, 1890 (aged 37) from a self-inflicted gun-shot wound, via the device of the postmaster's son being sent on a mission to deliver a letter from Vincent to his brother, which has been returned. Vincent and his brother Theo were very close, and Theo supported Vincent with regular gifts of money, and painting canvas and tubes of paint. The postmaster Roulin knew and loved Vincent, because these two loving brothers kept up a very frequent correspondence. These letters have been published elsewhere and make very moving reading. The son of Roulin goes to Paris, and to Auvers-sur-Oise where Vincent had been in care after he had an emotional breakdown, and talks to people who knew him. He is at first unwilling, but becomes interested, then passionate to find out the truth of the man whom he is now starting to fully appreciate. The remarkable aspect of this film is that the entire story, 95 minutes of it, is told in hand-painted oil paintings, done in the style of Vincent's own work. Scenes begin with an image that Vincent himself painted and if viewers are familiar with all his works, they will recognize the people and the places. But now they are moving, they are speaking, they are telling their stories, and their impressions of Vincent, the man. Some were fond of him, some ridiculed him. There are various points of view.<br><br>Technically the film \"Loving Vincent\" is a wonder of animation. One hundred artists in two countries, (Poland and Greece) working in Vincent's own style contributed full colour paintings for \"the present\" and black and white paintings for \"the past\" as the story is being told by the people who knew Vincent.<br><br>The film is made up of 853 'shots', and each one began with a first frame of a full painting on canvas board. As the animation photography was done in 12 frames per second, the first painting, would then be photographed, then painted over, with each gradual change to certain details or all of it, until the last frame of the shot. (This is in place of the use of animation cels, which could not be applied in this style of work.) At the end of the 'shot' the film-makers were left with an oil-painting on canvas board, of the last frame. So at the end of filming 853 paintings remained, and 200 are being auctioned off, and many have already sold, (as can be seen from the films own website) although at the time of writing the film has not yet premiered in the USA. The size of the works was usually 67cm by 49cm. Bear in mind that for one hour of film, 43,200 paintings were required, and you will begin to see the extraordinary ambition of this project. Additionally 90 design paintings were created in the planning stages during the year before shooting started. The purpose of these was to define the style in which the artists would all re-create Vincent's style of painting and make it move, live and breathe. 65,000 painted frames in oils were made for the whole film. The story moves along briskly and is full of wonderful characters (the people in Vincent's life). The dialogue of the characters is full of expression, as are the faces, and the characters have been created to really \"live\" for us. This was done by casting well known and excellent actors in the main roles, and filming them in live-action, then using those 'normal' cinematic images for a basis of the key paintings for each 'shot'. As the film went on, I recognized (from other films) certain of the painted faces of the real actors, who are also giving voice to the painted characters on the soundtrack. This type of animation has never been done before, and as it took seven years to make the film, it might never be done again. The ingenious planning of how to actually do it is brilliant and has been a great success.<br><br>Vincent, who suffered, from what we now call bi-polar disease, was an intelligent, deeply sensitive man, who had a sad childhood in a strict bourgeouis family, and was something of a misfit. He showed immense natural art talent. This can be seen clearly and unmistakably by looking at his early drawing. Later he used brush techniques that imitated the 'signature marks' in his pen and ink works. He was understood and saw visual texture.<br><br>From Paris Vincent went to Provence, and lived in Arles. He begged his friend Gaugin to come and join him. Vincent was over-joyed but after a few months, things went wrong between them, and Vincent seemed to become very distressed. When Gaugin departed, he was inconsolable. After the famous incident of cutting of his own ear in his distress, he went into care of Dr Gachet in Auvers, where he found a kindred spirit in Gachet, who loved art, and recovered. There he did quite a few more strong drawings and paintings. Vincent saw the world in a kind of almost violent motion and most of his works, drawings and paintings show this. It's as if the wind was visible to him in the air itself, not only in the resulting movements of trees, and fields of grain, or the moving sea.<br><br>He never sold a painting in his own lifetime, but gave away some, and sent many to his brother Theo who attempted to sell them in his Paris art gallery. And yet now his works hold the record as being the most expensive ever sold – which happened in modern times.","user":"CynthiaMargaretWebb","rank":[126,132]},{"title":"Not a One Trick Pony","rating":8,"date":"13 November 2017","review":"Most of the focus will be on its incredibly innovative visuals, the entire film is animated oil paintings. The paintings are all in Van Gogh's style are they are a beautiful backdrop that brings incredible life to the film in a way that no other style possible could.<br><br>But there is much more to Loving Vincent than the art, it is a riveting story that dives into who Vincent Van Gogh was as a man and the mystery surrounding his death. It unfolds in the same manner as \"Citizen Kane\" with the posthumous exploration into a person through talking to the people who knew him. It is engrossing with excellent voice work and incredibly smooth animation and movement.","user":"fletcherc21","rank":[32,32]},{"title":"Amazing work of art, telling a melancholic tale","rating":8,"date":"12 November 2017","review":"This is one-of-a-kind movie and definitely a must for lovers of Van Gogh. I studied art, therefore I was very interested in seeing how they managed to produce new painting using his technique. The result is visually striking. You can actually experience some of Van Gogh's paintings coming to life, which is in itself pretty amazing.<br><br>However, a movie must also have a strong script, a good story to go with the visual. The plot is about Armand Roulin, son of Joseph Roulin - two frequent subjects of Van Gogh's portraits. In fact, the whole Roulin family, inclusive of mum Augustine and her other two children were painted several times by Van Gogh, while in Arles.<br><br>Joseph was Van Gogh's postman and in the movie he entrusts Armand to deliver his last letter to brother Theo. Vincent and Theo's letters were published at the beginning of the last century, shedding light on their affectionate relationship, but not about Vincent's demise. <br><br>Therefore, Armand sets out to investigate Vincent's last days. The tone is somber and melancholic, somehow clashing with the beautiful visuals. Van Gogh comes across as an enigmatic man who could be sweet and full joy one moment and despondent the next - maybe suffering from bi-polar disorder, but we'll never know.<br><br>The plot develops a bit slowly in the end we do not know much more of what we knew at the beginning, but for sure we can retain the memory of this fantastic pictorial voyage.","user":"dierregi","rank":[35,36]}]