[{"title":"It's all because of you","rating":6,"date":"1 July 2016","review":"***SPOILERS**** Best selling author and renowned hypnotherapist Victoria Wrightmar's, Victoria Pratt,life and practice starts to get unhinged when one of her patients Blair Bennett's, Barbi Castro, dreams or nightmares are so much similar as one of her previous patients Dylan McNalt, David Chokachi, who was under her care who committed suicide. This starts to affect here work with patients-besides Bennett- that she's caring for now who are starting to go over the deep end. That's with Bennett's deep mental problems taking over Victoria's life.<br><br>Trying to get therapy herself from her good friend and former teacher in psychology the cool headed know it all Doctor Sylvan, Richard Burgi, he advises her not to get so involved with her patients where they look upon her not only as their doctor but their friend or even lover. This happened with two of Victoria's male patients's one of them the manic depressed Derek Barris, Patrick Muldoon,who when she told him to get lost and take a cold shower that he almost,in a deep depressive state, committed suicide on her! It was a good thing for Victoria that Derek was such a bad shot that he missed shooting himself from a distance of as little of 6 inches. <br><br>***SPOILERS*** As Victoria later learns that all her problems stem from the previous suicide of her former patient Dylan McNalt who somehow has risen from his grave, in her subconscious mind, to get revenge against her. And it's that revenge that's causing her to now lose her patients who are out to kill themselves because of her sloppy and un-professional treatment of them! Confusing and a bit hard to follow and understand film that's saved only by the terrific eye scratching hair pulling cat-fight between Victoria and her attacker at the very end of the film. It's then that Victoria finally realizes that it wasn't her that failed her patient McNult but he himself did by ignoring her treatment of his mental problems and trying to go it, by killing himself, on his own!","user":"kapelusznik18","rank":[4,4]},{"title":"Crazy by Candlelight","rating":6,"date":"9 January 2016","review":"Over the credits, a well-built man gets out of bed and does push-ups in his black trunks. He showers and dons a sharp, purple suit. Suddenly, he shoots himself. Clearly, this man wants to look his best for Death. As the opening credits end, a woman wakes up as if the preceding scene was a nightmare. We don't get to see her shower or get dressed, but she will make up for this in later scenes. This woman is beautiful and wealthy psychiatrist Victoria Pratt (as Victoria \"Vicky\" Wrightmar). She is the story's heroine, psychoanalyst, hypnotherapist and self-help author. Super-friendly, Ms. Pratt addresses her male patients in a sultry voice. This may be why Pratt has trouble relating professionally to attractive patient Patrick Muldoon (as Derek Barris), a slightly Rob Lowe lookalike. Pratt's tone with female patient Barbie Castro (as Blaire Bennett) is only a bit more professional. In fact, she seems overly warm and loving with everyone...<br><br>The ambiguous title \"Patient Killer\" may refer to the backstory of this slow-burning thriller. Some years ago, we're told, Pratt's attractive patient David Chokachi (as Dylan McNalt) committed suicide. We see a bit of him in flashback. Presently, Pratt is seeing handsome Casper Van Dien (as Jason Turner), who also directed the movie. He directs himself to surprise Pratt, while sunning herself, with a rough strangle-kiss. This seems like a cheat, but you can decide for yourself. The ending surprised this viewer only in that a character turned out to be the sibling, rather than the spouse, of another character. One more gripe is the fact that Pratt seems ill-suited for her profession. People do not see their psychiatrists in candlelight or cocktails. Still, the actor-director and photographer Bernard Salzmann do give it a lush, dream-like quality. And, since most all and everyone are strangely inappropriate, they add up to a style.<br><br>****** Patient Killer (2015/01/13) Casper Van Dien ~ Victoria Pratt. Barbie Castro, Patrick Muldoon, Casper Van Dien","user":"wes-connors","rank":[6,7]},{"title":"Beautifully shot","rating":7,"date":"27 July 2015","review":"Seeing many indie films out there, I have noticed that the quality on this production is amazing. The shots made all the actors look wonderful. Both the director and cinematographer did an outstanding job. The make up on the characters was pure perfection. The set design was superb. Lets not forget wardrobe as well. The color palettes for the characters were beautiful. I did enjoy Casper Van Dien's, palette choice. He looked amazing. Victoria Pratt was another favorite! Overall great cast! I must say that Patrick Muldoon scared me, and did very well in his role. Antoni Coroni, is one intimidating detective, and funny enough could definitely see him as a detective in other films. Richard Burgi is also another amazing actor. I enjoyed every character and definitely did not see that plot twist at the end. It is good to know that there are still good indie films out there but more importantly that take all of it into consideration.","user":"Film_Diaries","rank":[7,14]}]