[{"title":"Not even pseudoscience fantasy.","rating":1,"date":"20 January 2019","review":"I forced myself to finish this movie in order to feel okay about writing a review; however, I really wanted to step away after the first major factual inaccuracies presented themselves in the first 5 minutes. As an environmental engineer, I feel more than qualified to comment on these inaccuracies. I'll outline several of them from throughout the movie for you here:<br><br>1) \"... to harvest geothermal energy from other planets.\" (00:01:20)\nThe prefix \"geo\" is defined as \"relating to the Earth\"; therefore, \"geothermal energy\" refers exclusively to thermal energy from the Earth. You cannot \"harvest geothermal energy from other planets\" anymore than you can harvest solar energy from a lightbulb.<br><br>2) \"Sample 181B. Drawn from the sediment strata, should confirm or disconfirm the presence of bacterium able to use ammonium as a main oxygen source.\" (00:04:46)\nThis quote contains two errors, so I will refer to them as \"2a\" and \"2b\".\n2a) Ammonium consists of only Nitrogen and Hydrogen, so it could never be a \"main oxygen source\". In the unlikely case that by \"ammonium\" the writers were implying \"ammonium oxide\", it would be within the realms of a science fiction piece to make this claim. However, the fact that this is an isolated use of the term \"ammonium\" in the movie (the writers prefer \"ammonia\" in every other case, which actually is a different chemical compound), along with a later inaccuracy I will address, make the loose inference of \"ammonium\" to \"ammonium oxide\" very unlikely. What's more is that it is not a new concept that bacteria exist which can respire in such conditions. In fact, we have known that they exist for a long time and rely on them in many ways. I will mention this later on as well.\n2b) In this quote, the singular \"bacterium\" is used in the plural sense. It's interesting that the writers were even familiar with the singular form when \"bacteria\" is colloquially used in the singular sense, and \"bacterium\" is almost exclusive to scientific literature and dialogue where it is always used in reference to a single bacterium or singular strain of bacteria. Later in the movie, another character makes the opposite but more forgivable mistake when he says, \"Was it a bacteria?\" (01:15:46)<br><br>3) \"Anaerobic reproduction in a water-striding insect colony.\" (00:08:56)\nTo my knowledge, there is no such phenomenon referred to as \"anaerobic reproduction\". That is not to say that this is impossible or does not exist. Let me explain. Anaerobic simply refers to processes which occur in the absence of a common electron accepter (e.g., nitrate, sulfate, or oxygen). Many organisms, such as anaerobic bacteria, do in fact reproduce in these conditions. However, this is not referred to as \"anaerobic reproduction\" because neither anaerobic nor aerobic conditions lend themselves to a specific type of reproduction. More than likely, the writers actually meant \"anaerobic respiration\". This makes sense in light of the \"scientific\" premise of the movie, which is the struggle of life on earth to adapt to an atmosphere contaminated with ammonia and implicitly low oxygen. The reference to anaerobic conditions also discredits the notion that the writers implied \"ammonium oxide\" when using the term \"ammonium\".<br><br>4) \"We filter our drinking water through sand and charcoal. It's all it needs.\" (00:26:55)\nAssuming the water is contaminated with ammonia (like the air), sand and charcoal would do nothing to purify it. In wastewater treatment, where ammonia removal is a necessary process, nitrifying bacteria are used to nitrify ammonia. That is, they ultimately convert the ammonia to nitrate, hydrogen and water. This is a very complicated, multi-step process that involves balancing pH, dissolved oxygen and biochemical oxygen demand to achieve the desired effect. Had the writers suggested that Sam harvested nitrifying bacteria (likely quite common on an ammonia-rich Earth) and used them to treat her water, this would have been within the realms of a science fiction piece. But sand and charcoal would do nothing for ammonia.<br><br>5) \"It's only cloudy like that because of the charcoal.\" (00:26:49)\nCharcoal filtration removes particles from contaminated water through adsorption. Most household filters use activated charcoal to improve the aesthetic qualities of their water (look, taste and smell). Implying that the charcoal would actually discolor the water is a major inaccuracy, since it would in fact do the opposite. Now, if the process actually added charcoal to the water instead of filtering the water through the charcoal, this would discolor it, but it would do nothing to filter the water. However, I doubt that is the implication when the \"treated\" water has a light brown hue. Charcoal would have turned the water gray or black, depending on the amount added.<br><br>6) \"You'd think they could live up high like us.\" (00:30:27)\nThis quote implies that the surviving humans were able to escape the contaminated air by living at a higher elevation. However, ammonia is lighter than air, meaning the ammonia concentration would likely be higher at an increased elevation, not lower.<br><br>7) Throughout the movie, Sam regularly monitors the air quality by sustaining a flame and observing its color. In the movie, a purple flame is supposed to represent contaminated air, whereas a yellow/orange flame represents clean air. When ammonia burns in the presence of oxygen, the flame is actually yellow, not purple. But let's look at this a little deeper. Ammonia has a flammable range of 15 - 28%. This means that ammonia will not ignite at a concentration of less than 15% volume of air or a concentration higher than 28% volume of air. According to the CDC, ammonia is \"immediately dangerous to life or health\" at just 300 ppm, which is just 0.03% volume of air. A concentration of 15% (150,000 ppm) or higher would not just be damaging to the eyes, nostrils and lungs, but also to the skin. The character would need to wear a fully-enclosed, airtight suit to protect herself against harm.<br><br>I understand that science fiction writers are not scientists, but the premise behind science fiction is to provide a somewhat plausible scenario that is at least loosely based on some scientific truth. Even fantasy pieces, which delve into realms far beyond the scope of even pseudoscience, do not attempt to rewrite or misrepresent well-known, established scientific fact without some sort of explanation (even if it's something as ludicrous as dolphins that suddenly bound from the ocean into deep space because of their sentience and connections to other-worldly beings).<br><br>It's quite disappointing to think that so much money and effort could be put into a movie on the part of writers, producers, actors, videographers, and visual effects specialists (to name a few) and yet they didn't think to have somebody with at least the qualifications of a middle school science teacher read over the screenplay.","user":"quiggsmcghee","rank":[957,1]},{"title":"See it with a friend who can slap you awake when you nod off.","rating":1,"date":"21 January 2019","review":"No sense of urgency, no interesting developments, no empathy, no rockets, no IO.<br><br>The balloon was the most interesting character.<br><br>Utter, utter rubbish.","user":"PiAnt","rank":[198,244]},{"title":"Slow and painfully dull.","rating":2,"date":"18 January 2019","review":"How did this get made?\nIt's like listening to your girlfriend tell you about a boring dream she had for 90 minutes straight.\nAchingly pretentious but without the artistic beauty to back it up.\nMackie struggles with Twilight level dialogue while a surprisingly graceful score beautifully frames the drama and emotion that should be there but simply isn't.\nA crushing waste of everyone's time.","user":"artenfrize","rank":[434,568]}]