[{"title":"Aptly Named and Surreal","rating":30,"date":"30 January 2015","review":"In what may be one of the most aptly-named films at this year's festival, Slow West is in no hurry to tell the story of Scotsman Jay Cavendish (Kodi Smit-McPhee) and his continent-spanning quest to find Rose (Caren Pistorius), the long-lost love from his hometown. Things get complicated when a desperado named Silas Selleck (Michael Fassbender) decides to accompany Cavendish on his journey—possibly to cash in on a bounty that hangs over Rose's head. Taking a cue from neo-westerns like Jim Jarmusch's Dead Man, Slow West uses the chaotic landscape of the American frontier as an allegorical exploration of love and death. There is something surreal about seeing the old west interpreted through the lens of New Zealand where the film was shot, and it added to the story's dreamlike tone. The immensely watchable Fassbender exudes some serious Han Solo vibes as he guides Cavendish through the unforgiving wilderness while trying to act like he doesn't give a crap. McPhee's boyish, innocent appearance is ideal for a character whose belief in true love has guided him so far into the lions' den. While the film's ending is sure to polarize audiences, it was a ballsy way to emphasize the point that the frontier was an ecosystem all its own, indiscriminately filling some hearts with purpose and others with bullets.","user":"SLUGMagazineFilms","rank":[99,115]},{"title":"A wry exploration of the human condition.","rating":8,"date":"14 July 2015","review":"This is my first review, I wanted to save it for a movie that I was touched by and one that gave me something I didn't expect, in essence a film that gave me everything that I thought it wouldn't. <br><br>Slow West magnificently portrays the human condition, with all it's defects and strengths. It rather wonderfully and in a very subtle way exposes it's capacity for love and betrayal, loyalty and mistrust, fear and courage. It reveals to us that desperate good people do terrible things to survive in hard times, how hard bitten and essentially broken souls have the means and wherewithal to do good and be forgiving. It shows how we can be innocent and naive and yet still be able to teach, how we can be overly aggressive and yet protective, greedy yet also so very giving. The true wonder of this film is to me is that it exposes to us that all of us can be all of the above at some point in our lives, that we all have the capacity for evil or good and sometimes it is only circumstance that turns us either onto or away from a particular path. It's theme to me is the delicate balance between success and death in the American west during that period from the standpoint of choices made, and to my mind I think it succeeds in portraying this exceptionally well.<br><br>Many of the reviews I have read on here in regards to this film say it is far too slow, I don't think it is at all, it is a journey, a gradual layering of the story building to a climax, it is not supposed to be action and bells and whistles from the off, I think it is a film that ultimately is trying to make you think; you are invited to explore who we are and what we are capable of as humans in hostile conditions. <br><br>The performances are excellent all round, the thoroughly underrated Ben Medelsohn particularly as the 'realist' outlaw and Michael Fassbender who commands the screen in all his scenes, as he so often does. I think the writing of the dialogue is fantastic and nuanced, the humour dry and cleverly interspersed and the attention to period detail almost faultless. My only gripe is that there are a couple of scenes that don't seem to fit the narrative, maybe that is what slows this film down for some.<br><br>I understand that that this kind of western or period drama for that matter is not to everyones taste, that for many 'action' is the byword by which these films stand or fall, well to that I say to each their own. If however you are keen to watch a movie that attempts to reflect back to you just what it means to be a person with all a persons flaws, and how circumstance can shape us into the judged or judgemental, then this very well may be a worthwhile watch for you.","user":"padwoir","rank":[51,58]},{"title":"I just loved it!","rating":10,"date":"25 June 2015","review":"Many of the reviews here seem to be written by contributors who take their cinema VERY seriously (not that there's anything wrong with that, as Jerry Seinfeld would say!). However, my take on Slow West is that I just loved it. It was a beautiful story with a great ending and it was a pleasure to see it all condensed into 84 minutes and not follow the new 'value for money' 3 hour epic scenario that a lot of films seem to be going for these days. All of the actors were superb and I loved the occasional quirky characters that showed up, especially the Congolese trio singing away in the middle of nowhere! So, in my humble opinion, Slow West is a good traditional enjoyable Western movie and that's it!","user":"annmoore","rank":[84,100]}]