[{"title":"Beautiful cinematography, but highly dissatisfying!","rating":5,"date":"22 June 2016","review":"Where do I start? Epic proportions both in the way this is beautifully filmed in the locations, costumes and attention to detail (worth watching for these things alone) and the length of the film (2 and a quarter, very long, hours.)<br><br>Story is a mixture of several traditional Italian fairy tales with more than a sprinkling of sex and gore (Think Brothers Grimm meets Silence of the Lambs)<br><br>Disturbing tales of human failings that start and stop throughout the film, picking up where they left off a few moments later. Some of them didn't have very satisfying conclusions and the ending was rather a let down (You would expect all the tales to come together at the end but they don't)<br><br>Superb acting from all of the cast. Some relatively new faces that I am sure we will see again.<br><br>All in all, worth a watch for the casting and production, but if this had been a book, I would have flung it across the room in frustration after the last page as the story promised so much more than the weak ending delivered.","user":"riasheridan-75247","rank":[48,58]},{"title":"Charmingly bleak compilation of twisted fairy tales.","rating":7,"date":"7 September 2015","review":"This is not your average princess and prince tales, it is a series of the grim version of myths without warm Disney filter. The multiple stories are woven together in one underlying tragic theme, occasionally wicked Tale of Tales is definitely not for children. The most vexing thing about it is not the scandalous tale, but the slow pacing as it tries to deliver three nearly horror stories.<br><br>The focus continuously shifts between monarchs from three separate kingdoms. Each of them is affected by equally peculiar plaguing events. One queen's over protective nature rules over her senses, a king's lust leads to mishap in bed and a princess' wedding becomes malady as she faces an ogre as the groom.<br><br>Its screenplay is mixed feeling of innocence remnant and utter perversion. There's a good quality of cast to ensure overall bizarre atmosphere, and make no mistake, these stories can be downright disturbing for some. The director even adds a couple gore scenes or rather appalling instances which are shockingly unexpected, even more so considering the colorful setting.<br><br>Visual is very good, the medieval vibe simply oozes from the scenery. It resembles a lively stage for dramatic play yet feels convincingly dreadful enough. Production, from make-up and costume, looks captivating and sometimes intimidating. As many TV series or movies adapt modernization of fairy tales, this one is more memorable with the eccentric outlook and more modest on CGI usage.<br><br>However, it can be a bit slow. The three stories span across more than two hours, so it takes its time. Fortunately, it sets the characters really well, but on the flip side, some of scenes feel plodding. Tales of Tales might resemble the iconic Pan's Labyrinth at some turns, although it's still not on such legendary stature.<br><br>This movie is certainly not for everyone. The mixture of odd fables and near horror elements leave strange lasting trail, it might not be all merry party yet it's enigmatically and irresistibly bewitching.","user":"quincytheodore","rank":[68,90]},{"title":"A gorgeous and bloody anthology on love and obsession","rating":8,"date":"19 May 2015","review":"Using a traditional folklore anthology as guideline (XVII century \"Lu  cunto de li cunti\" by Gian Battista Basile) Garrone puts on screen  three gorgeous (loosely) intertwined stories that have for protagonists  various Kings and Queens facing huge obsessions.  - In one Salma Hayek and John C. Reilly are a royal couple that  struggles to get an heir, until a mysterious cloaked man offers them a  magical solution. The birth of the child will not be exactly as  expected.  - In another Vincent Cassel is a sex-maniac king that became obsessed  by a mysterious woman with a beautiful voice. Her true identity is,  well... complicated; and her desire to became queen will result in a  magical help that will be for her both a blessing and a curse.  - In the last story Toby Jones is a king so fascinated by a magical  animal to neglect her only daughter Viola and her desire to marry. The  death of the animal and the desperate need for affection of the king  will result in a bizarre challenge that will mark a dire fate for the  princess.  Every story it's connected by the themes of blood and duplicity: how  obsession seems like love and makes you do things without caring for  the consequences. All this in a slow paced, softly spoken movie that  suddenly outburst in tense scenes of violence, gore and horror; always  gorgeous in its unique aesthetic based on the constant opposition  between rich baroque splendor and poor barren settings. It may appear  \"bare\" by the current standards of fantasy movies but that's exactly  the point: this is not fantasy, it's folklore; even a grand task like  slaying a sea dragon became trivial compared to the depths of human  relationships.","user":"manus_nigra","rank":[85,120]}]