[{"title":"Not impressed","rating":6,"date":"23 February 2020","review":"The best part of this movie is the action, the story was very lack luster. I think it had potential with a good cast including Anthony Hopkins, but the writting always falls short in these movies. You can watch it over and over for the action, you just might scratch your head at certain spots.","user":"MR_Heraclius","rank":[43,46]},{"title":"The worst Transformers movie","rating":1,"date":"22 July 2017","review":"This movie is like a big story put up in one paragraph with no punctuation marks whatsoever. Usually Transformers builds up a simple story that explodes into one big final battle, filled with special effects and epic fights between autobots and decepticons; pretty entertaining to watch, especially if you're into big explosions- action-robots-movies and usually it works. \"The last knight\" is different from the beginning, it introduces way more story lines than it should, it tries to make a suspenseful plot with so many resources it just drags into a story that's full of holes and patches that it seems you're watching a lot of trailers from different movies with no connection between each other. <br><br>The movie forces a lot of secondary roles (between the old and new characters) that it becomes boring and confusing at the same time. The main story becomes clear in the last quarter of the movie, just in time for the final battleby this point you're in fully overdrive mode trying to catch up with everything that's happened that it's barely enjoyable. <br><br>Personally I think that the worst part is the lack of continuity, they jump from one scene to another in less than 30 seconds. This \"dynamicity\" makes it impossible to follow the main plot or even one story line. There are so many details and jumps between stories that it exhausting trying to connect the dots. I don't recommend it at all, not worth the money or time. Maybe if you're really curious or a big fan into the saga you may find it entertaining at some point, my only suggestion: lower your expectations, cause this is, by far, the worst Transformers movie.","user":"gabiirrs","rank":[406,574]},{"title":"Transformers: The Last Knight --- A True Disasterpiece","rating":1,"date":"15 July 2017","review":"The movie cuts and jumps so much and so quickly (Some scenes are literally less than 20 seconds long... in succession...) that by the end of the first half you'll feel dizzy from trying to follow.<br><br>It takes everything from the other movies... and spits them out in raw, bloody bits which make no sense and flow like chunky soured milk.<br><br>If Michael Bay has gotten tired of the franchise.... it finally shows. The last 45 minutes of battle were so bad... it didn't even redeem the movie.<br><br>Trust me... don't bother going to see it in the theater, it's a waste of your time.","user":"bethelabba-553-227653","rank":[288,433]}]