[{"title":"Voodoo possession more like doodoo possession!!","rating":5,"date":"5 February 2014","review":"I had low expectations for this movie and not even those were met! It was definitely one of the worst scary movies the I've ever seen, if u can even call it a scary movie!!<br><br>The acting wasn't terrible but I definitely wouldn't say it was great. There is not attachment to the characters created, I can't even remember the names of any of them. So I couldn't care less when any of them were killed. And the so called monster was more like a giant cockroach so unless you are afraid of bugs it's not scary at all.<br><br>The so called special effects were horrible and clearly low budget, especially the terrible stabbing scenes that were so unrealistic and left a lot to be desired. The music choices failed to create any suspense or even evoke the slightest bit of emotion.<br><br>It was difficult to be scared of any of the possessed characters in this movie, each time they came on screen they made us laugh rather than create any terror.<br><br>Overall the storyline was a bit hazy and hard to follow as it kept jumping in and out of different worlds, this was also hard to follow as the movie failed to hold my attention. <br><br>This movie was missing a \"falk in the road'","user":"Falks723","rank":[7,9]},{"title":"Lacking coherency...","rating":3,"date":"25 January 2014","review":"Granted, I am not overly into the rituals, myths and mysteries of voodoo. But still, I am finding it rather interesting. And having read the synopsis for the movie, I decided to give this a go. With Danny Trejo on the cast list, it couldn't be all bad.<br><br>I found this movie to be a mess, to be frank. The storyline was really jumpy and was basically everywhere and nowhere at the same time. As such, then the movie as a whole turned out to be less than enjoyable. Especially because the audience sit there without really knowing what is what and being unable to find a red thread throughout most of the movie.<br><br>\"Voodoo Possession\" doesn't make use of million dollar effects, but still, they pulled off the movie nicely enough. Whatever effects were there, were used nicely and served their purpose well enough.<br><br>As for the acting, well people were doing good enough jobs. Just a shame that Danny Trejo didn't have a bigger role in the movie. Aside from him, then I can't really claim to be familiar with anyone there. And it is nice to see a movie with all new faces from time to time.<br><br>I didn't particularly enjoy this movie, so it is a mere 3 out of 10 stars from me.","user":"paul_haakonsen","rank":[5,6]},{"title":"Amateur awful low budget film.. Avoidable","rating":2,"date":"24 January 2014","review":"Well if you are looking for a cool Horror film, then look else where, as Voodoo Possession adds nothing new to the genre, and is not any way a scary or thrilling movie. First of, i hate how these movies try to make attractive posters that has nothing to do with the film, the poster you see here on IMDb is quite misleading and looks cool, which is not the case with movie itself. Also using big names to market a film is a cheap thing to do, here they managed to pull Danny Trejo to appear in brief scenes, which add nothing to the movie as a whole.<br><br>The Plot : it follows a young guy WHO travels to Hiati to investigate the disappearance of his Doc brother who was trying to use Voodoo to help heal mental illness, the older brother is helped by his girlfriend who is a journalist and gathers up a crew to accompany the older brother to help find out what happened to his younger Doc brother, once arriving in Hiati and into the mental hospital, creepy things start happening and the movie starts to dig in deep into Psychology and family dynamics which was more of boring drama than Horror.<br><br>The worst thing about the film is the acting, most are complete amateurs, very poor acting that one can tell that these are actors. Even Trejo seemed out of it. Some actors actually show their excitements in being in a movie, total lack of professionalism.<br><br>The other parts of the movie making was all amateur work, poor direction and camera work, awful soundtrack and score, poor audio editing. The movie screams low budget. And i don't have anything against low budget films, i had my share of watching some and they still managed to offer something good, but this one is truly awful.<br><br>I can understand the effort and the desire to make this movie from the people behind, but they lack big time in producing something that looks cool and professional. If id make movie like this, i wouldn't want people to pay to watch it, maybe just post it for free on the internet. In short, total amateur work here, low budget film that lacks in all areas with cheap marketing strategies, not scary at all, avoid it.","user":"med77_99","rank":[8,15]}]