[{"title":"Doesn't achieve what it set out to do","rating":3,"date":"8 August 2015","review":"I've been following the progress of Harbinger Down for over a year now, eagerly awaiting each update. Films like John Carpenter's The Thing and David Cronenberg's The Fly are some of my favourite films ever, and Harbinger Down looked to bring this classic 80s practical monster effects goodness to the present day.<br><br>The reality? For a movie that's whole purpose is to showcase practical effects (PFX), it doesn't do this nearly enough, nor does it feature Studio ADI's expected level of quality for these effects.<br><br>Almost all the scenes that feature the monster are poorly lit (often only by a flashlight). This is to be expected to a certain extent, being a horror film, however if you watch The Thing/The Fly, you'll notice the creature is always at the forefront, in all it's grisly detail. In Harbinger Down you never truly get a good look at the creature, which I'm sure will be disappointing to many, as the whole point of the movie was to show off an awesome looking creature. What's more, there is a distinct lack of quality for some of the monster effects, something that is unheard of in Studio ADI's other work. Presumably this is why the effects are often obscured by shadow and low light. The few scenes that are well lit are either far too brief or garishly poor quality (the first appearance of the monster comes to mind). There is also a distinct lack of blood/gore in the film, which is a major shortfall. John Carpenter's The Thing is a hideously gruesome film, and that plays a big part in why the film is so loved. This film features barely any blood and gore, and the few scenes that do are often brief and very conservative on the bloodiness. I don't believe I'm wrong in assuming most people interested in these kind of films want to see gruesome practical creature effects and all the bloody mess that goes with that. Harbinger Down completely fails on this.<br><br>It feels below Studio ADI, as I know what incredible work they can do. I appreciate the budget was low for this movie, but the movie's whole purpose was to show off PFX and prove to the industry that CGI isn't always the best option. It feels like they have shot themselves in the foot, as this film is a poor effort at showcasing the power of PFX. A little more time and money could have refined the effects and really made a statement about PFX (which, ultimately, could lead to much more work for Studio ADI).<br><br>Unfortunately there's nothing outside the creature effects that is even remotely noteworthy. There's a lot of inexperience here, with directing, writing, movie pacing and acting, and it shows. But this is something that is hardly surprising, or overly important. All I was expecting was some gorgeously gruesome creature effects. I was happy to settle down for a hammy, poorly acted film - but in a \"so bad it's good\" way - where the monster would take centre stage and wreck up the place. The monster instead cowers in a dark corner, ashamed to show it's ugly face, while unlikeable characters and a largely un-engaging plot take the centre stage.<br><br>I'm a huge fan of Studio ADI's work and I adore practical creature effects. But this doesn't cut it. This is a poor movie. A poor movie that could have redeemed all it's shortcomings in acting, filmwork, writing, etc by just having regular, explicit monster appearances showcasing ADI work at it's best. This is, sadly, not what Harbinger Down is.","user":"progenitor33","rank":[59,73]},{"title":"Came for the effects, left because everything else","rating":4,"date":"4 November 2015","review":"It's hard to bash bad indie movies generally and Harbinger Down is no exception. So I'll try to keep this short and more critically factual.<br><br>This movie was kick-started by The Thing (2011) prequel's SFX leftovers that didn't pan out in the final cut of the movie so this thing got birthed on the actual Kickstarter. Inspired by the above mentioned - The Thing, and a bit of Alien, Harbinger Down storyline follows a group of people that for various reasons end up aboard the Harbinger - crab boat. After a short while, they stumble onto something frozen in ice, shenanigans ensue.<br><br>It's almost a classic-legacy horror/scifi setup these days, and sometimes it works, sometimes it doesn't. Here it doesn't and the reasons why that is are numerous. I'll mention just a few of those reasons.<br><br>Right of the bat, the movie logo itself contains suspiciously similar fonts to ALIEN (HARBINGER part) and PREDATOR (DOWN part). Not a good sign.<br><br>Then there are POV found footage moments that are just random and makes you wonder why's this here? And the rest of the photography is similarly bad. Weird, too close and generally bad camera angles don't make this a pleasant viewing at all.<br><br>Characters are blank and the acting is bad most of the time. Lance Henriksen being the exception, everyone else was just not good. Leading lady was boring with some forgettable flat performances. The token white guy with beard and the token black guy were also bad as was the Russian lady. <br><br>Ah, the Russian lady. She had some truly brilliant script pieces in this. Moments like \"Do you make-up, sis?\", or something like that, were the moments where you question yourself why are you watching this in the first place? Also the thing that she looks kinda botoxed and nip-tucked with some super-fake contact lenses and you can see that she is actually wearing some makeup, makes this particular question even more stupid.<br><br>So, the story is bleh, script is dumb, acting is the same, are the effects any good? No. I mean, they sold this movie most on that part - the practical special effects, but they are wildly uneven and mostly cheap. Which is kinda the most disappointing, because there are some SFX veteran names in this movie.<br><br>If this movie was shot (way) better with better SFX, bad acting and dumb story would be forgiven. But it wasn't and it lacks in almost all the major parts that make a movie. Script is dumb, acting is not that good, story is recycled billion times by now, effects are not that good and as a bonus there are some just cringe, face-palm inducing moments.<br><br>It's watchable, but I see no reason why you should do that. Maybe for Lance, but he just sorta breezed through this and didn't make this movie that much better by appearing in it.","user":"cheighlee","rank":[32,38]},{"title":"Disappointing, but watchable","rating":5,"date":"14 September 2015","review":"This is a very uneven movie.<br><br>On the one hand, it's not bad for an independent movie with a tiny budget. The settings is pretty nice and the actors are OK.<br><br>The movie is an obvious reference to \"The Thing\" and it uses practical effects and no CGI. And here lies the first problem: The effects aren't impressive. From a company that deals with practical effects, which has some veteran effects guys and lots of experience, I expected more. A lot more. The effects here only show how amazing Rob Bottin's work was over 30 years ago. I also expected the effects to be a lot more explicit, yet I always got the feeling they try to hide them by shaking the camera, cutting, putting something in front, etc.<br><br>The last problem has to do with direction: It's pretty obvious that this is the work of a first time director/writer - The movie is very uneven, there are good scenes and bad scenes, there are continuity problems, coverage problems, editing problems, things that simply don't connect and hard to understand what the director meant to do and also many scenes that seem to be missing a dialog.<br><br>All in all, this is a so-so movie for something independent without a budget. I expected more and I'm a bit disappointed, but I'd still think it's worth a watch, at least for the effort.","user":"room102","rank":[20,24]}]