[{"title":"Out of the dark","rating":9,"date":"16 August 2014","review":"Have you experienced a feeling like this? The kind of feeling that your sorrow and loneliness nailed you down and you fell into the deep darkness alone, then you stood up, and finds sparks and sparks of lights appeared, leading you to the end of the nightmare, and when came out, you found the sunshine was warmer than ever? This is the movie \"when Marnie was there\".<br><br>I like this movie. It's a story about two lonely girls, about family and the world, magical but real. As a OCD viewer, my left brain kept investigating who that girl is, and my right was eager to know what will happen next. The good thing is, however, both my brains were astonished and satisfied again and again, unlike how other Ghibli movies roll. This new film, which is the first one after the retirement of the two great founders, shows the skills and talent of the next generation Ghibli artists. Future is saved, or maybe better?<br><br>And as many Ghibli movies, \"when Marnie was there\" is full of beautiful paintings and musics, voices recreating the characters vividly, and an unforgettable theme song in the end. The story, like I said, is fabulous. I don't like spoiling movies, and the secret in this case is the core and foundation of everything. I'll leave it to you to discover. Enjoy!","user":"k-sky123","rank":[128,138]},{"title":"A Heartwarming Thank You.","rating":10,"date":"22 August 2014","review":"Following Miyazaki's retirement, the pressure was heavy on Director Yonebayashi as the next successor of Ghibli Studio. But in the Japanese multimedia, it was stated by the Former Director Miyazaki and Producer Suzuki that the future successor was finally decided after watching Yonebayashi's first solo directed movie \"When Marnie Was There (2014)\". Was this really the case? My answer - Yes.<br><br>This movie is unique in a sense that the story revolves around two female protagonists \"Anna\" and \"Marnie\"; although it does remind us a hint of the nostalgic movie \"My Neighbour Totoro\" which starred \"Satsuki\" and \"May\", their relationship is far more complex. As the story progresses, their relationship becomes more clear and vivid to the audience, and the confusion of the intertwining reality and the dreamlike world starts to unfold. The two girls go on a journey as they discover each others past and dwells upon their current problems, and gradually develops an unbreakable bond that unites them stronger.<br><br>Although the trailer did cause some confusing misunderstandings between the two girls in Japan, and at the same time my expectations lowered; after watching the movie it was no doubt a splendid and flawless piece of art both literally and figuratively.<br><br>It is worth noting that Yonebayashi truly challenged the impossible, as even Miyazaki had once thought of making this novel into a movie but had backed down due to its continuous complex changes that occur in the world of the two girls. Furthermore, Yonebayashi has created his \"own\" depiction of the sky in this movie, and is no longer the \"blue sky\" and \"white clouds\" that Miyazaki has portrayed in his series of work. So we can expect to see his own unique world of Ghibli gradually bloom in the next upcoming years.<br><br>To summarize the experience, it was astonishing how we, the audience ourselves can go on a journey together with the protagonists to overcome their obstacles. Paying attention to the changes in Anna's facial expressions is extremely crucial if you want to enjoy this movie. The succinct yet complex portrayal of these two girls really make you think of the depths of friendship.To conclude, I would like to end with Suzuki's logo that he had written for the advertising poster. The message of the logo is so sincere that to me there is no better way of epitomizing the message that the author and the director was trying to convey to the audience - 「あなたのことが大好き」- \"I love you\"; an unconditional love.","user":"tak8493","rank":[107,118]},{"title":"Some people're destined to meet the secret friend.","rating":9,"date":"16 June 2015","review":"From the director Hiromasa Yonebayashi of 'The Secret World of Arriety' fame. Based on the 1967 English novel of the same name and so the important characters borrowed the western names. This is what I call a fine adaptation, great transformation from the words to the motion picture. Actually, it suited for the narration from the standpoint of Japanese culture and lifestyle, especially for this anime version with the beautiful fictional coastal landscapes. Whenever I remember this film in the future, that Marsh house would be the first thing to pop out in my mind, an unforgettable landmark for sure.<br><br>The movie promos were damp. The posters were not that impressive, but okay and the trailer was very ordinary. Studio Ghibli was the reason to go for it, so I expected nothing spectacular from the movie. Even while I was watching, I thought it was just an enjoyable mystery flick, but you know sometime the value of the whole movie comes at the end twist. Once the end was near my stance changed, especially after the hidden truth revelation. Some movies need a re-watch to terminate any doubts regarding characters and scenes. As for this movie, if your focus is straight, then it's does not require.<br><br>Not a technical brilliance like the director's previous movie, but the story was strong and twisty. The characters were very interesting, suspense was the movie's influence for the audience to stick till the end. There is no loose end, certainly gives a few topics to discuss about, but the narration moves on a circular track and hits back like the boomerang. That does not mean it is a time travel or something. The narration bends and blends with the time. To realise what is real and what is not, you have to wait till the end. After seeing the film, I understood everyone's childhood memories could monopolize if we encounter same object, place, person and other things again in the later life. Yes, I had few minor experience in my life as well.<br><br>The opening dialogue itself a hint of what kind of movie it is going to be. There are two prominent girls, Anna and Marnie in the story, like the Anna and Elsa from 'Frozen'. The narration flips on a regular basis to tell the multiple layered story. As this film was a puzzle in portrayal, obviously viewers try to solve it, including me. I tried my best. I thought Anna's childhood toy was something to do with all the fuss, but I was terribly wrong. That was a perfect divert if you observe it closely. In another perspective, I kept 'The Others' and 'The Orphanage' in mind, but was not even close to where this story was heading. Whether you succeed or not, very fun to solve a mystery, you know. Finally, it gave me full satisfaction like that indirectly I saw 'The Uninvited' once again.<br><br>Feels like the Oscars was concluded yesterday, but I am already thinking about the next one. If I am not wrong this movie is definitely one of the contenders for the best animation race, along with 'The Good Dinosaur' probably. Absolutely, I would be disappointed if I don't see it in the final five. There is lots of time between now and then, so anything might happen, who knows. After all, this film has already won my little heart and millions of other's. I know no one can replace Mr. Miyazaki, but feels like Hiromasa Yonebayashi could come near if his future projects as much effective as his one. Best of luck to him and he's only a 41. But remember Isao Takahat is 80 and still in the race, yet to announce his retirement. And this film was very close to his 'Only Yesterday'.<br><br>I love you more than any girl I've ever known.<br><br>Studio Ghibli is like Disney Studio from the east. As we know, narrating a fairy tale having the tween girls in the lead is what they're famous for. The previous couple of movies were out of their trademark, so, happy they are back with this masterwork. At a same time I am very very very very sad, because it's their final movie after the 30 years of triumph. Since Hayao Miyazaki's retirement everything falling apart from the studio's management. They've given reasons and it is only a temporary, though hope the rise of 3D animation is not the one to halt the production, praying for the pause to be lifted soon.<br><br>This film is not just passing through from this giant anime production house, but it is a masterpiece. As usual, it is a girly movie and that does not stop grownups, especially men from a watch. I loved it, every time when I like a movie I express my desire for a sequel and so I did for this film. Though it was one time story with nothing left over for further development, possibly some new thing can be attached to it. Whatever happens this movie will remain as one of the best from the studio and can compete with any modern animations and live-shot masterworks. Highly recommended, not just for anime or animation fans, but for mystery and who love the layers in story narration.<br><br>9/10","user":"Reno-Rangan","rank":[23,25]}]