[{"title":"A US centric so called documentary","rating":1,"date":"28 July 2015","review":"This movie would have you believe that WWII started at Pearl Harbor! Nothing of what happened before seems to matter, the USA were not in it! So forget about WWII, this movie should be called: the USA in WWII, with an overview of what the lesser players did too. <br><br>Of course explaining WWII in that short duration would be a challenge, but in this case it seems to go for a lot of over simplification, the imagery is very gimmicky too and doesn't really add anything. <br><br>The \"from space\"perspective, is no more than a marketing trick, there isn't anything new there and it doesn't add to the comprehension more than moving maps etc... that we've had for decades.<br><br>Painful to watch if you know anything about the subject.","user":"rodbrauner","rank":[33,47]},{"title":"Nothing new, alas","rating":3,"date":"20 May 2018","review":"It sounds like a B Movie title but it's not. At least it's not supposed to be. It's a new way of looking at the events of WW II, offering a global perspective of land, territories and battles.<br><br>It's very USA-centric - guess who made it - and starts with the Japanese attack on Pearl Harbour which brings America into the war. Ok, let's go with that.<br><br>However, it skips backwards and forwards in time to look at various events of the war. This is annoying at best and is confusing. How much better if it had simply followed a linear path and let us see how the war developed as it played out.<br><br>Given the limitations of a movie's length, however, it is very much a potted history so there's nothing radically new or in depth here.<br><br>The view from space is a nice idea to help visualise the global scale of the conflict. However, often when dots flash up on a swiftly-rotating globe of the world to highlight cities and countries, far from illumination, they're simply blobs in a fog because some landmasses are obscured by cloud! As it's CGI-generated this is folly beyond redemption. Someone obviously thought it added a sense of realism but it simply detracts from the movie's admirable goal. Not all scenes are like this, just enough to spoil some of the movie's intent.<br><br>Essentially, it's just another WW II documentary. It has nothing new to add, it's very USA-dominated and it doesn't achieve what it sets out to do particularly well.","user":"iantrader","rank":[8,10]},{"title":"A butchering of History","rating":1,"date":"20 May 2019","review":"Glad to see that a few other reviewers have commented this is not WWII but USA's part of WWII.<br><br>I was so hoping to see the politcal plays that started the war on a 'from space' viewpoint. It literally starts at the bombing of Pearl Harbour.<br><br>It is a shoddy mix of interviews, poor CGI and just a mess of visuals with the all too annoying 'American Hero' voice over.<br><br>If you are American, you will probably enjoy it. If you are interested in WWII avoid it like the plague.<br><br>Horrible.","user":"Srwp","rank":[2,2]}]