[{"title":"Nice french movie","rating":7,"date":"25 October 2014","review":"Samba is a french romantic-comedy. I really like that this film sticks with its origins. What i like about french romance and comedy is, that it is not so cheesy and over the top like those Hollywood productions. Samba is a very personal film. The characters are every day people with everyday problems. I appreciated, that the movie picked up the migration problem in France. The actors Omar Sy and Charlotte Gainsbourg perform very well. The downside is that the film is quite strait forward. Not much suspense, but what do you expect from a romantic comedy. The soundtrack is from Ludovic Einaudi, who also did the soundtrack for \"Les intouchables\". And also like in \"Les intouchables\" the music makes a perfect match with the story and the images.<br><br>For me this film is perfect romantic, funny, entertainment with a little bit of drama and social criticism.","user":"masterlee-sro1","rank":[30,38]},{"title":"Reality brought to your screen.","rating":6,"date":"19 August 2015","review":"First of all, Samba is not a movie about dancing. I guess we all know that but I really felt like making this joke. Forgive my sometimes childish spirit. Samba is an enjoyable movie about a subject we are all aware of: ilegal immigrants. Unfortunately, ilegal immigrants are not our primary concern and I doubt anyone wastes more than 5 seconds a year thinking about them and their situation.<br><br>Samba is a nice young man from Senegal who finds himself as close to being deported as when he arrived in Paris ten years back. During this decade in Paris, he worked in all sorts of jobs to take care of his family back home, and hoping to one day legalize his situation. In his particular struggle surviving in France and hiding from the police, he will find 3 people to rely on: his uncle who gives him a roof, a funny Arabic man who like him does not have a visa, and a french girl who is helping immigrants while taking a break from her real job. <br><br>The adventures of our protagonist will make you laugh, and they will make you sad. Either way, they are a clear representation of the reality for thousands of men who are completely forgotten by the world, and who were born to struggle. More than men, they are like ghosts in our cities. <br><br>As a conclusion, I would said, this is not the best movie I have seen by any means, but clearly a movie I am happy to have watched. I am not going to become a social worker just yet, but at least, the thought of these brave men will stay with me for more than a few seconds I previously dedicated to their cause.","user":"santiagocosme","rank":[13,15]},{"title":"Laughed and cried in the same breath","rating":10,"date":"12 April 2015","review":"As some have noted before, it is a light-hearted movie on a serious topic (undocumented immigrants) but always respectful at that.<br><br>I cannot quite agree with the reviewers that did not see the humor in this movie (I laughed about every three minutes throughout - expect towards the end - and sometimes even cried at the same time). Neither can I understand how people can say that the characters are flat or even \"boring\". Imho, the film succeeds in portraying them in not just black and white; each of them (and there are many!) evolves within the 120 minutes so much so that, in fact, it is not about the immigrants being the \"angels\" and the immigrant officers being the \"devils\" at all. On the contrary, lines are blurred very early on and especially in the end.<br><br>I find that this is a worth successor of \"Untouchables\"; I probably even prefer it. It is a very moving film (similar to the documentary \"l'Escale\") but without trying to be so. Also, the actors are brilliant! (Omar Sy, I think, even manages to mimic a Senegalese accent.)","user":"l-bugayong","rank":[24,31]}]