[{"title":"Suvari's performance worth watching..","rating":3,"date":"18 October 2015","review":"... but only if you are a casting director looking to find a formerly A-list actor who has the chops but has not been getting the roles needed to show off her skills.<br><br>The rest of the film is basically a clinic in how to make a sub-B indie product: <br><br>1. Pull together some actors who are slightly past their BEST BY date and will work cheap.<br><br>2. Lay down the heaviest sound track you can, because everyone knows that deficiencies in the production (direction, lighting, acting, scripting) can be \"hidden\" if the viewer is distracted by a heavy sound track.<br><br>3. Shoot the entire film in as much natural light as you can. If anyone complains, call it \"authentic\". Others of course might just call it \"dark.\" This saves a lot of money.<br><br>4. Speed up all the action scenes just a little, maybe by dropping a few frames here and there. This makes the action look faster and cooler than it actually is.<br><br>5. (Optional) If you are the director and writer, give yourself a one-word name -- like Madonna -- so that viewers will remember your work and avoid it in the future <br><br>Finally, for the record, Martin Sheen is one of my all time faves but PA-LEEZE to imagine he can still play a professional, active-duty, cop at 75 years of age almost qualifies this film as Science Fiction.","user":"A_Different_Drummer","rank":[16,18]},{"title":"Worth watching (once only)","rating":19,"date":"19 May 2015","review":"I am British, so rarely watch US TV crime series. Maybe for that reason there were some angles in this \"dirty cop\" drama which were new to me, and kept me watching to the end.<br><br>But they were not developed as they could have been, and the screenplay was to blame. The direction, too, is mediocre with the same tired style of flashbacks to patch holes in the exposition that we see in so many direct-to-DVD movies. <br><br>I think the intended ironic statement about \"truth\" and \"honor\" is indeed there, but gets muffled in the obligatory Hollywood ending.<br><br>The heroine and the \"redeemed\" cop were too lightweight, while Martin Sheen popping up in a supporting role, and still-beautiful Natasha Hensbridge in a dispensable one, only served to undermine the intended grittiness and remind us we are watching a Hollywood movie.<br><br>I am posting because I think this movie deserves better than the current 4.7 score. I give it 6, and most of that is for the storyline rather than the way it is realised on screen.","user":"london777","rank":[11,15]},{"title":"Another 'corrupt cop' movie but not a terrible one.","rating":6,"date":"18 April 2015","review":"All the scenes in the movie and the story,u would have seen it all before, most of the time done better than how it's done in this movie. But still this movie is very watchable and had some interesting parts. The acting in this movie is solid too. Not award material but for what they are given,i think the actors have done a very good job. Lochyln Munro ,especially,was really good in his role. He seemed so involved and committed to his role and it shows in his performance. The director could have directed his scenes better though and maybe build a little more character arc for him. And they could have also used Martin Sheen more. I didn't like the climax much as it seemed rushed but other than that i think it's a good enough movie that u can rent and watch or if u happen to catch this movie on TV,it's worth spending some free time on.","user":"nathan_kugan","rank":[8,13]}]