[{"title":"If you are l[ooking for a cute little popcorn movie, go somewhere else.","rating":1,"date":"15 June 2018","review":"Hands down, this is the worst movie I have ever seen. Now, take into account that I'm 62 years old and a life long movie fan. I have seen a remake of \"Plan 9 From Outer Space\" which was worse than the original. I didn't't even think that that was possible. But Garlic And Gunpowder goes to an all time low. I'm not going to give any spoilers, but the acting was awful. Just the fact that Judy Tenuta was near top billing should give you an idea of how bad it was. The plot was preposterous. There were lots of sophomoric jokes. But even those were unfunny. The only reason that I gave it one star was because they wouldn't't let me give it zero stars.","user":"brianofnazareth-01132","rank":[5,8]},{"title":"It's Bad, but in a Good Way ... and a Bad Way","rating":5,"date":"30 October 2019","review":"Okay, to be clear, this is a bad movie with bad writing, bad acting, bad lighting, bad make-up, bad costumes, and just bad everything. But, if you really pay attention, you start to realize that a lot of it is bad on purpose, like they were trying to make the next big movie that was so bad that it is good and can be shown at drunken frat parties.<br><br>Unfortunately, to be a movie that is so bad that it is good, the viewer has to believe that the producer truly believed that he was making a good movie but was so clueless that it really was bad. That makes it good.<br><br>But, for this movie, we can tell that they were purposely trying to be bad. And that ruins the magic, leaving it as just a plain old bad movie.<br><br>Yet, you can tell that some funny people worked on this movie. There are several moments and lines that really were funny or so silly that they made me chuckle.<br><br>There's no choice but to rate it a 5. It's not bad enough to be a good movie and it's not good enough to be a bad movie.","user":"bing-57","rank":[3,6]},{"title":"OMG tragic","rating":1,"date":"21 March 2020","review":"There is simply god awful and then there is this pos. WTH. This was intentional? Really makes me curious how much they lost in their budget. The whole $50 worth of it.","user":"devlisalliam","rank":[0,0]}]