[{"title":"Not that bad....","rating":6,"date":"1 June 2016","review":"Take \"The Sand\" for what it is. And if you do that, it is a fun little flick.<br><br>It is a B movie with minimal budget, minimal special effects, filmed in one location and with a cast of unknowns and still it has an interesting premise.<br><br>I see it as a homage to the 50's man-in-a-rubber-suit monster film. And it works very well in this respect. The difference being that instead of a monsters something weird is crawling under the sand. <br><br>It is a little bit longer that it should be, some of the characters are annoying, but still it is worth a rental","user":"trans_mauro","rank":[24,29]},{"title":"Predictable but fun horror","rating":5,"date":"19 October 2015","review":"I watched it from beginning to end.I didn't have high expectations of the movie but the acting was good.No cardboard wooden acting.Its definitely NOT the worst movie of 2015.Talk about hyperbole.A group of young adults are trapped on a beach where something deadly has spawned overnight in the sand..There is some gore,not a lot.Its positively funny at times not because of cheese factor but because of some of the characters.Think Cabin Fever.The plot is thin but I watched it just to see who would survive.It tries to be more intelligent than it is but at the same time if you have a sense of humor..it makes light of itself at the right times too.I laughed out loud at a couple scenes.I really enjoyed The Sand,although it fails to be The Ruins or Don't Blink.If you like those movies you'll enjoy The Sand.Five stars for an enjoyable viewing experience.","user":"shayislandshay","rank":[25,31]},{"title":"Take it With a Grain of Salt","rating":4,"date":"20 October 2015","review":"A​ whole bunch of students get together for big beach party where they have to turn in their phones for a Vegas rules party. They don't want anybody recording something they shouldn't plus this gives the writer the opportunity to explain why they won't have their phones later on. You see where kids drag over a hideous pod type thing they find in the water. The morning after the party people wake up to realize everyone who was on the sand is gone. The first movie I thought of when watching this was Blood Beach(1980) which is similar with a hint of Sand Sharks(2011). This one entertains though. The plot may seem ridiculous but you are on the edge of your seat hoping they don't touch the sand because if any part of your body touches the sand the creature has you. This is where the CGI effects kicked in which sucked but the tension made up for the cheesy computer blood. People would have wondered what's going on watching them film this because seeing them trying different ways to cross the sand without touching it was funny like using surfboards and inflatable rafts plus the sand would suck them in after chewing for a bit. I mean we see the CGI and spectators wouldn't. You will enjoy this guilty pleasure but be warned it goes from tense moment to tense moment and try not to let to logic get in the way. 4/10.","user":"shawnblackman","rank":[23,31]}]