[{"title":"Missed the point of Pan","rating":1,"date":"9 December 2015","review":"Pan is one of those films where it's hard to pinpoint what is wrong because the answer is basically everything. I'm confused as to how they managed to turn such a simple story into such a convoluted mess.<br><br>At his core, Peter Pan is just a boy who escapes to a magical fantasy land because he doesn't want to grow up. In Neverland he leads a crew of similarly disenfranchised kids, plays games with Indians, swims with mermaids, and fights pirates.<br><br>Simple right? Well not according to Joe Wright and the producers of this film. For some reason they felt the need to cram in every single cliché possible in order to 'modernize' the story despite the fact that the themes in Barrie's stories were already timeless.<br><br>Levi Miller stumbles here and there but he was well cast as Peter. However the script doesn't support the role. At certain points he becomes secondary in his own story. His desires don't move the plot forward and after the first 20 minutes he has very little to do except \"learn how to fly\". We never seem him turn into the character we know as Peter Pan except for the fact that *spoilers* he flies at the end. And don't even get me started on 'The Chosen One' thing.<br><br>Tiger Lily, played by Rooney Mara, is bland, and I'm not talking about the color of her skin. She's your typical warrior princess and for some reason they try to set up a possible romance between her and Hook. She's basically around to be walking talking exposition.<br><br>Jackman also does a good job, but his character, Blackbeard, isn't interesting. His motivations are paper thin. He wants to mine some fairy dust in order to live forever which doesn't even make sense because Neverland supposed to be a place where people don't age. Blackbeard is just shoehorned in there so they could have a villain other than Hook.<br><br>This brings me to one of the most pointless things in the film: Hook being Peter's ally. It doesn't amount to anything. You never get a sense of conflict between the two. You keep waiting for a point when Hook is going to betray Peter but it never happens. You want to see that scene where Peter cuts off his hand and feeds it to the crock, but it never happens. Hook's only motivation in this film is to escape and go home. He doesn't seem like he could turn into the devious Captain we know. At the end of the film, Hook and Pan are still friends and they just hint at a possible conflict in the sequel with a throw away line. Also, if you're a kid and this is your introduction to the character of Hook the 'twist' will go right over your head.<br><br>And why is Hook American? Who made this decision? <br><br>Another problem with Pan is the over-use and reliance of CGI. It looks fake, especially Peter's flying. Peter Pan was better animated in 1953, not in terms of graphical fidelity, but in motion. He had weight, he had grace, and he was agile. In Pan he just kind of floats like he's being dragged by a mouse cursor.<br><br>When you stretch the rules of reality too far it becomes unbelievable even in a world like Neverland. You have to have rules. In Pan there are flying pirate ships. Why? How do they fly? It's never explained. The ships can fly both in the real world and Neverland. There is no consistency.<br><br>I'm giving this film a 1 out of 10 because they squandered so much potential. The source material is so rich and this is the best they could come up with? I think a live action Peter Pan film could be successful but if they ignore the themes that make the story interesting in the first place it just won't resonate with the audience.","user":"michaeltong-29180","rank":[156,221]},{"title":"Awkward and misguided","rating":3,"date":"11 May 2016","review":"If there was a more awkward movie than Pan released in the last few years I'd certainly like to know about it as Joe Wright's big budgeted wannabe franchise starter is a lavishly coloured and extravagant picture that lacks knowledge of what it actually wants to be or who in fact it's aimed at and judging by the films flopping at the box office the world over, it seems as though audiences too struggled to figure out who should be watching this revamping of J.M Barrie's classic material or why they should be watching it.<br><br>Tonally all over the place and with a story that seems to meander about the motions until a highly lacking finale and lack of answers regarding certain story questions (a glaring one being how Hook and Pan in fact become enemies as they are adventures together here), for the first time in his quietly impressive directing career Wright seems completely lost within his narrative and fails to liven up proceedings despite throwing every known colour onto the screen, plopping in Nirvana songs and letting many of his actors ham it up to level 11 to try and cover up the fact Pan's story is actually rather dull in a world that should be anything but.<br><br>Our Pan here is played by newcomer Levi Miller and the poor young performer labours in his first major turn injecting Peter with neither the charm, smarts nor emotion that was needed for the role. When you consider however how his cast alongside a horribly miscast double act of Garrett Hedlund (who continues to frustrate as a lead actor) and the beyond bad Rooney Mara, the child performer didn't really stand much of a chance. The films only saving grace acting wise is Hugh Jackman who has a blast playing Blackbeard the fearsome pirate who will stop at nothing to collect that sought after pixie dust but while he has fun it still doesn't make a whole lot of sense having Blackbeard in this beloved tale.<br><br>Whilst normally it would not be something called out for by the masses it would've actually been nice for Pan to stick more closely to the original Peter Pan story that has enchanted readers and viewers for decades upon decades and while its commendable for a big budget film to take such a risk on a new take on a well-trod property, Pan is a stinging reminder of what can go wrong when money is thrown all over the place and scripts seem doctored to tick off as many set piece wish lists as possible and for the first time in his career Joe Wright has crafted an almost irredeemably bad piece of cinematic entertainment.<br><br>All those seeking a Peter Pan fix are much better off seeking out a copy of Disney's beloved animated take or even the similarly styled Steven Spielberg event Hook.<br><br>1 ½ awkwardly used Nirvana song out of 5","user":"eddie_baggins","rank":[35,46]},{"title":"There is much to enjoy in this film","rating":7,"date":"16 June 2018","review":"The visuals are stunning. Hugh Jackman is just great, clearly relishing his role. His performance alone makes the film worth a watch. The story is capable of dragging you in. You have to forget your Peter Pan pre-conceptions and accept that this is different. Be prepared to go with the flow.","user":"wheatley-20230","rank":[13,17]}]