[{"title":"Spring can be whatever you want it to be","rating":6,"date":"25 July 2015","review":"I'll bet they have fun with this one in film studies. Spring can be used as a personality test based on how a viewer perceives it. Do they see it as a romantic drama comedy about star crossed lovers? Do they see a satire poking fun at the gamut of movies about an immortal falling in love with a mortal that they've only known for 5 days and be willing to give up their immortality for love? Do they see an art house style movie full of symbolism and bravo for abstract expression? Do they think it's just stupid and makes no sense? Do they just see a zombie shooting drugs in a church? <br><br>Spring is a little bit of all of that. I was kept guessing only when it related to what the heck Louise was. The rest follows the generic formula for a romantic comedy that didn't really leave me satisfied when it was over. I am not really ashamed to admit that I was hoping she'd eat Evan at the end.","user":"georgiamoxie","rank":[29,31]},{"title":"A beautiful, intelligent, thought-provoking film","rating":9,"date":"28 March 2015","review":"A hidden gem and easily one of the best movies I've seen in a long time. The acting, writing and directing are all seamless.<br><br>I admit there were moments, such as when our poor protagonist reacts to the truth about his girlfriend, which stretched the bounds of plausibility, but aside from those few scenes the film was incredibly real and fresh throughout.<br><br>The film's brand of dry, intelligent humor was a lovely surprise. I buckled in for a thriller and found myself laughing many times instead. I also highly commend the snippets of philosophy, morality, mortality, religion and science which were sprinkled throughout the film and delivered with just the right amount of wit and depth by both actors. <br><br>It really is a wonderful blend of romance and sci-fi, and this is coming from someone who loves sci-fi and has a pathological fear of chick flicks. I highly recommend it.","user":"LilyDeSilva","rank":[83,101]},{"title":"A slightly twisted, supernatural companion piece to Before Sunrise? maybe, maybe not.","rating":7,"date":"21 March 2015","review":"This turned out to be much sweeter, much more touching than I had first anticipated. Though the film takes a good half an hour to get into its stride it really is worth the slight uneasy feeling you may have when Evan first gets to Italy and you're wondering if it's going to turn into something akin to the Hostel series, but thankfully this is as far away from that kind of horror as possible.<br><br>At it's core the film is a dark, fairy-tale like horror romance but it keeps itself grounded in ways that are really satisfying and could only be possible in the world of independent cinema because if someone else, other than Benson &amp; Moorhead, had made the film it could've easily turned into one of those slick, Hollywood style fantasy movies with lots of leather, low-key lighting, vivid colours and fast editing. The film does have very dark moments, horrifying moments, but they're handled with a certain amount of grace and elegance that I wasn't expecting and you will enjoy this film more than you think you might.<br><br>The lead actors are great. Lou Taylor Pucci's portrayal of Evan is wholly convincing, his character could've run the risk of being entirely forgettable but he's sweet and charming and highly likable. Nadia Hilker has been working in German television for about 5 years, this is her first feature film, and I have to say I'm a little bit in love with her. The personality she gives to a character that could easily have fallen into the realms of utter cliché is really, really refreshing.<br><br>A slightly twisted, supernatural companion piece to Before Sunrise? maybe, maybe not. But definitely something different, at least.","user":"adamcrossstills","rank":[84,103]}]