[{"title":"A beautiful and moving film","rating":9,"date":"5 May 2019","review":"I am a huge Tolkien fan and after reading some of the critics reviews I was a bit wary of seeing this film. I do not know which film the \"critics\" have seen but from their conclusions I do not recognise this film. I have literally just left the cinema, I found it so moving that I found myself in floods of tears. Beautifully acted, and set against the backdrop of WW1 the sense of loss and the harrowing reality of what war is came across in such depth. I loved the focus on language and the weight it can carry, It made me feel that words are in their own right living creatures. This is one of the few films that has not just entered my brain but is also in my heart. Please go and see this film whether you are a Tolkien fan or not, it is truly captivating.","user":"alever-46823","rank":[361,411]},{"title":"beautiful","rating":5,"date":"5 August 2019","review":"...because it represents more than a biopic. Because it gives a bitter - poetic portrait of familiar things. From friendship to bitter choices, from love to discover of vocation, from war to the most significant small things defining you. Because it is real well acted and has inspired script and propose a version of Tolkien ' s life more touching and precise than I expect. A film about war and passion and friendship and love , seductive for the game of nuances and for a sort of...magic. And, sure, Nicholas Hould seems the most wise option for the roles of real, real special writers.","user":"Kirpianuscus","rank":[50,57]},{"title":"Entertaining and poetic","rating":6,"date":"24 June 2019","review":"A story as romantic as biographical of the first three decades of <a href=\"/name/nm0866058/\">J.R.R. Tolkien</a>, who is best known as the author of the classic high fantasy works The Hobbit, The Lord of the Rings, and The Silmarillion: his childhood and adolescence just before the first world war and his decisive encounters (Edith Bratt who will become his wife, the professor Joseph Wright who will turn his mentor and help him to to enter to the University of Oxford, and his friends with whom he will form a brotherhood, or even a fellowship).\nThe analogies with his novels are obvious: the Ringwraiths a.k.a. the Nazgûl between the German trenches of the Bay of the Somme, or even Sauron on his black horse and his huge sword. The film portrays also the manifold sources of inspiration such as Nordic cultures / languages or operas like Der Ring des Nibelungen composed by <a href=\"/name/nm0003471/\">Richard Wagner</a>.\nThe photography, the Computer-Generated Imagery and the costumes are excellent. The movie reflects reality more or less closely (the audience shall then dissociate the real from the fantasy) but is globally poetic. 6/7 of 10.","user":"FrenchEddieFelson","rank":[65,82]}]