[{"title":"Anti-entertainment. Brace yourself.","rating":8,"date":"17 October 2015","review":"Audiences not braced for what Rick Alverson's Entertainment has to offer will be doomed for an unpleasant and gruelling experience. This is anti-entertainment if anything, not in the sense that it uses anti-jokes but the comedian protagonist is on the lowest rung of humour. Using cheap sight gags, resorting to insulting the audience, taking uncalled-for hits at celebrities and using not-so-funny voices, the laughs the characters do get are cheap. This comedian is a 19 year routine from lead actor Gregg Turkington, otherwise known as Neil Hamburger, but that backstory has no relevance to the film's narrative as he's otherwise unnamed. It's performance art, but also satirical as it's not far from the truth of what some comedians actually resort to in their acts. In that sense, it's a study on what's considered entertainment, why people are drawn to it and what it means to people.<br><br>The film chronicles a cycle of repetitive sequences that grow darker in despair. The comedian attends novelty tours on his journey, browsing at eye-sore mechanical marvels in the middle of the desert, often away from the main group and guide. Then he performs at third-rate gigs such as dingy bars, often saying how he's travelled from miles away but never where from exactly, and gets upset when the audience don't laugh at his jokes. That's all part of his act, however, but it doesn't get them more comfortable. His warm-up act is an amateur mime artist played by Tye Sheridan, though how they're travelling together remains a mystery. He calls his estranged daughter before bed in hopes that she'll pick up and reconnect, but it's ostensibly in vain. Some other characters take him aside, such as detours from his wealthy cousin played by John C. Reilly, an example of success, and Michael Cera in a four minute cameo as a hustler who wants company.<br><br>It feels like the films of Roy Andersson by way of David Lynch as a surrealistic nightmare. From constant stumbles, the comedian is on a broken American dream, both as a father and as a budding entrepreneur with his comedy act – which it must be noted, is far from his stoic self. He seems willingly isolated offstage, but abrasive when he's onstage. If comedy is an escape for some, is that necessarily a good thing? It can be cryptic in these scenes that don't tie in together, but they're all expressing his anxieties and failure in his career and fatherhood. Almost every gig he does is greeted by an apathetic 'good show' from the manager while he looks dead inside. The tragedy is off-screen and internal but it's palpable, highlighted by the washed-out and carefully composed photography. Entertainment is a very unsettling film, and at one point near its middle I found myself tested by it, but it's thoroughly profound for those who want something challenging and hauntingly beautiful.<br><br>8/10<br><br>Read more @ The Awards Circuit (http://www.awardscircuit.com/)","user":"Sergeant_Tibbs","rank":[64,79]},{"title":"A Guide through the Dark Side of Entertainment","rating":7,"date":"18 November 2015","review":"An exploration through the dark side of entertainment. A feverish introspective nightmare of a character who remains more mysterious by the end of the film than at the beginning. Entertainment drags us along on a slow road trip through the desert with a comedian who loses his self along the way. The line between reality and dreams become completely blurred. The whole film seems like an inside joke the filmmakers refuse to let us in on. Sure, there are funny moments, especially during the first half, but by the end you'll be left with more questions than answers.<br><br>It's emotionally heavy, bizarre, heart-breaking, surreal and even somewhat disturbing. What is truly masterful is how, without ever fully understanding who this character is, the film causes us to lose our sense of reality with him. He is explored, with great depth, inwardly without us ever sure of who he is on the outside. Rick Alverson has perfectly re-created the dream logic story telling techniques and beautifully strange cinematography of a David Lynch film. Yet, he does this using his own voice, which is strikingly original. Entertainment is somewhere between a broken character study, an absurdist comedy and modern tragedy.<br><br>Entertainment is not for everyone and if you try using your brain while watching it, you may give yourself a migraine. If you try to use your heart to feel your way through, you won't be sure where to put it and may feel depressed afterwards. This film is a trip that you have to allow to wash over you. Let yourself get lost in it's wonderful visuals and be sure to have friends to discuss it with afterwards.","user":"themissingpatient","rank":[24,29]},{"title":"No idea...","rating":24,"date":"24 November 2015","review":"I just saw this and... no idea. Parts of it are truly intriguing and fascinating to watch while still being kind of uncomfortable to watch, and other parts are just kind of obnoxious and unsatisfying. I totally didn't recognize Tye Sheridan at first, truly a chameleon (and should have been used more, if just to increase my interest). At parts the film seemed like it was on the verge of true magic, but my interest was never fully captured because it (intentionally) keeps itself at such a distance. It seems like this year I've seen many films like this, and most of them haven't stuck with me at all. Perhaps this will follow in that pattern. Don't know exactly what my rating should be","user":"Red_Identity","rank":[16,19]}]