[{"title":"You've got to be kidding","rating":1,"date":"13 January 2019","review":"Aside from the astounding number of 10-star reviews that all surprisingly appear almost the same date (can you say \"bought reviews?\")... we have this gem of wisdumb:<br><br>\"Safe for kids barring language, violence, and very brief nudity.\"\n(And the review actually seems to be serious.)<br><br>Are you kidding me?","user":"Snootz","rank":[10,15]},{"title":"A Ridiculous Headache","rating":1,"date":"21 July 2019","review":"There were parts of this with intentional shaky cam and unnecessary constant zooming that were physically difficult to watch. The storyline was not nearly as cohesive as it needed to be and with all of the VHS references that miss the mark by miles, it feels like it was made by someone who never experienced them.","user":"cerasaur","rank":[3,4]},{"title":"Very unique and creative film for the budget","rating":9,"date":"18 March 2019","review":"I attend several midwest horror conventions each year, and one thing I like to do is buy random films from the companies and actors who are in attendance. I know going in that these films may not have the best acting or editing, but I really appreciate seeing the passion that these folks put into their work and I like to support that.<br><br>I met some of the folks involved with Skeletons in the Closet at Horrorhound Weekend in Cincinnati in March 2019, and they were clearly very excited about this film so I bought a copy. This is one of the best films of this type I have bought at a horror con and I am very happy I was able to grab the second to last copy they had at their table! It is very well shot and has a slick look to it, and the acting and timing of everything was perfect for this type of throwback film.<br><br>I am not going to review the plot because if you read the summary here on IMDB then you will either watch it or you won't, but this is definitely a hidden gem. This is not a standard anthology film because unlike others (Creepshow, VHS, etc.) there are two \"wrap around\" segments (a babysitter watching a kid who is watching the movies, and two horror host type monsters watching everything unfold on their own t.v.) that are tying things together, each of which is almost a movie in itself. The segments themselves are stories that put a twist on your standard horror trope and there is a very energetic feel to everything throughout the film.<br><br>If you want something different from most of the low budget, indie stuff that is out there I would highly recommend Skeletons in the Closet. This is a great one to just sit back and watch if you want to relax and be entertained!","user":"Silverboy76","rank":[4,8]}]