[{"title":"Great movie","rating":10,"date":"3 October 2015","review":"I just so happened to run across this movie on a Friday night . I have to say, My Favorite Five turned out to be an excellent movie to wind down to after a long and hectic work week. I enjoyed every minute of it. The cast (as beautiful as they all were) did an awesome job in their characterization and it was nice to see some familiar faces. They played out their roles in a way that others could relate to with real life situations. The love story was predictable but served as icing on the cake. It gave a message of being able to reflect change in self and forgiveness in others. I would definitely recommend this movie as a must see and I hoping there will be a part 2.","user":"cheyennadoll","rank":[5,5]},{"title":"Great Movie","rating":10,"date":"22 March 2015","review":"This movie was not what I expected it to be, it was much better. The plot and character development was emotionally drawing. As you watch this movie even if you may think you know the ending, you will keep watching. If you believe or don't believe in love this movie will still touch your heart. It felt real and for me that says a lot. This movie proves that having a big budget for a project is not necessary to always be good. Quality is much better and having characters that possess the right chemistry to make a well written script come alive. Watch this movie and you will see how it will affect you in various ways. There needs to be more movies like this especially in the times that we are living in now, when so many people get hurt in relationships and never fully get healed or delivered from their pain. They are the walking wounded.","user":"myproviderproductions","rank":[4,5]},{"title":"Captivating and Romance","rating":10,"date":"19 March 2015","review":"Excellent movie! The storyline was amazing and kept me captivated. I love watching a good, romantic and a tear-drop movie. I was born on a small-city island and having a scene with the water and sunset, just took me back. I remembered those days growing up and taking a companion out on the shores just to watch the sunset and appreciate the time we shared. Thanks for taking me back home. It was great to see that each character was able to be flexible with their emotions in every aspect of their relationships. Although the movie was very entertaining, I was very emotional and drawn to the main characters (Chris &amp; Halley) Great job to the cast, writers and the producers. Michelle, Houston Texas","user":"mlturner-12987","rank":[2,3]}]