[{"title":"OK hear me out... (Theory)","rating":7,"date":"7 January 2016","review":"I watched this movie today and I can't help but think that the film is more complicated than it might seem. I feel that this movie is more about mental illness than it is about spirits in the Aokigahara. Let's start with the facts, we have our main character, Sara, and her identical twin, Jess. The story behind these sisters is that, when they were small, they were going down a set of stairs with their grandmother. When they are approaching the bottom of the staircase, the grandmother yells \"cover your eyes\". What had happened was their father had killed their mother and then proceeded to kill himself. Sara covered her eyes and never saw what had happened, but Jess did not and saw everything. Now here is what I think this whole movie is about, there is no twin sister. There is no Jess. <br><br>Bear with me here. I think that due to this traumatic experience in the childhood of Sara, she dissociated her personality into two different people, Jess and Sara, so that she wouldn't have to deal with the fact that she saw both her parents dead. She claims throughout the movie that she never helped Jess \"carry the burden\" of what she saw that day, indication I believe that it is simply a place inside her head that she locked away very deeply in order to escape the truth. Now, this theory makes a lot of sense if you pay attention to certain details I believe the director left there on purpose. Here are my top 5:<br><br>1. Early during the movie, we see a scene where Sara is going down a set of stairs to a basement. In the basement, she sees a yellow tent. From the outside, we can see two distinct shadows sitting inside it, but when she opens it, there is only one girl.<br><br>2. When she tells her boyfriend, Rob (Eoin Macken), that she needs to go to Japan, he has on his face a very concerned look. He looks somewhat tired and not shocked by the announcement. I saw this as someone who knows that she is mentally ill and thus tries to calm her down in order to make her not go, without actually trying to reason with her.<br><br>3. When Sara stays the night in the forest, she runs out at night and finds this Japanese lady who tells her to not trust Aiden. This makes her paranoid the rest of the movie whenever he's around. Now here is the deal breaker for me. When she asks him for his cellphone to see if he had any pictures of Jess, she yells at him that there are pictures of her sister in his phone. Aiden denies that he had ever met her sister and just looks at her clueless not knowing what the hell was going on. I think, the picture she saw was one he had taken of her (Sara). She thinks Jess is another person but she's not. <br><br>4. Near the end, when she is in the cabin with Aiden, she loses it because she puts her ear to a door and she swears that she can hear Jess from the other side. Jess slides a note from under the door asking if Aiden was there, Sara answers yes, Jess tells her to kill him (I think). Bottom line is, if you look closely, the handwriting on both \"sides\" of the conversation is the same. Anyways, Sara grabs a knife and goes to Aiden and is all \"Open the closet and let Jess out\". Again, Aiden is just completely clueless and tells her that the key is in his boot in order to distract her and try to take the knife from her. In the end, she stabs him, he dies. What's interesting is that the \"closet\" door opens by itself, yet all she can see when she opens it is that traumatic experience that she lived as a child. There is no Jess. At this moment, she walks down the stairs towards the little girl, and \"sees\" her parents lying dead on the ground. She yells at the girl that was there to run upstairs as her dad comes back from the dead and \"convinces her\" to slit her wrists. Again, only one girl there. So it begs the question, who wrote her the note then? It was herself. This further supports the theory because where \"Jess\" is supposed to be, we only see the event that traumatized her.<br><br>5. After she runs away from the shack, her sister manages to somehow run in the exact same direction at the exact same time. The way the scene is recorded, we can see some sort of parallelism going on between the two. When Jess comes out, Rob looks at her and asks \"Sara?\" Now, given that the two supposedly have different hair color, I'm not entirely sure he would confuse the two. When she doesn't answer, he asks \"Jess?\" to which she responds. He then proceeds to walk her out of the forest. I don't think he would have left that forest without Sara...my theory is that he did leave with her; he left with Sara/Jess. The reason why \"Jess\" was the only one that came out of the forest was because Sara faced her reality back at the shack and accepted that she was the one that saw her parents lying dead on the floor. Thus, two different personalities finally came together into one single person and Sara was forever lost in the forest that was supposedly one that makes people \"face their sadness\" and \"find themselves\". That's why Jess says \"I can't hear it inside me anymore. The noise where Sara was, it's gone\".<br><br>If a sequel comes out, then I guess my theory isn't valid which makes the movie not that good... So I'll stick to my theory. I enjoy it more that way.","user":"jarora2213","rank":[341,407]},{"title":"The Forest has a creepy enough atmosphere, but it's not enough to make up for the confused plot and lack of scares.","rating":3,"date":"28 March 2016","review":"I had my eye on this movie since it came out earlier this year. It was a January release so I was in no rush to see it, but it had a genuinely cool premise: looking for someone in the suicide forest, which is an actual place in Japan where people go to commit suicide. It's pretty unsettling. In the movie, it's said that the forest compels people to kill themselves due to supernatural forces or vengeful spirits. The Forest focuses on Sara, whose sister has gone missing in said forest, and Sara's desperate endeavors to find her sister despite the evidence pointing to her being dead. Up until about the 30-minute mark, I was on board. The pieces were set, the exposition was established, and the characters (Sara, her journalist friend Aiden, and a tour guide) were finally heading into the forest. Again, the atmosphere is creepy throughout. The director clearly has a grasp on how to build tension.<br><br>The problem is that the promising build ups lead to zero payoffs. There are handful of cheap jump scares, a couple of which admittedly shocked me but only momentarily. Once the initial shock wore off seconds later I was in the same state of mind as before. Effective jump scares linger for a while; they imbue dread and usually add something to the narrative. The jump scares here are your typical, \"Boo! Something's behind you!\", which are easy to shrug off. Also, once they're in the forest, the characters make some decisions that are unfathomably stupid and out-of-character. Like, the main point of the forest is that it makes you think you see things, a psychedelic effect if you will. So after Sara receives this crucial information, she runs after the first thing she sees scurrying around in the forest. While it's pitch black, mind you. It completely takes you out of the movie and makes you lose all empathy for the characters for putting themselves in these avoidable situations. <br><br>Also, The Forest focuses more on the bond between Sara and her sister than the actual forest. So there are plenty of flashbacks, dream sequences, all that garbage that just muddles the fact that, hey, this forest is really f*cking scary. Why not focus on the forest instead of forcing character development, if you can even call it that? It makes no sense. Also, there's nothing we haven't seen before. People being hung? First scene in Sinister. Claustrophobic underground tunnels? The Descent. The only thing that makes the movie unique is the actual setting which is used as a backdrop more than anything.<br><br>The acting is good, as is the premise, but the potential littered within this movie is never fully realized. The director can definitely creep you out but he'll need a better script if he wants to make a truly great movie. The Forest just leaves you feeling hollow and disappointed.","user":"lnvicta","rank":[103,119]},{"title":"The Forest (2016)","rating":4,"date":"10 January 2016","review":"Japan's Aokigahara \"Suicide Forest\" by itself is a creepy and gruesome place because of its reputation as one of the most notorious suicide spots in the world as well as its historic association with demons in Japanese mythology. Its inherently scary atmosphere is perfect for a good horror movie, but The Forest mostly squanders its promise by degrading it to a hot spot for cheap jump scares. The Forest stars Game of Thrones star Natalie Dormer in a dual role as twins Jess and Sara. Jess has disappeared into the forest, and Sara travels to Japan to go into the forest to look for her, unaware of the demons that lurk in the forest. The film has a pretty interesting premise and could have worked if executed correctly. 2014's As Above, So Below took an intrinsically creepy setting, the Paris catacombs, and used an unsettling atmosphere and good scares to make one of the better horror films of that year. The Forest does not use its setting to its advantage. Any atmosphere created by the forest is frittered away by a dull jump scare. Despite all the loud noises and sudden shocks, the scares are just boring. That could have been helped by a good story, but once Sara actually reaches the forest, the plot just sort of stops. The last half of the movie is just her running through the forest while demons pop out from behind the trees. It's not until the end that the plot decides to move forward any more, but by the time the big twist happens, you don't really care. The Forest has a committed performance from Natalie Dormer and glimmers of an interesting movie but mostly wastes them on predictable jump scares and a bland story.","user":"samgiannn","rank":[82,96]}]