[{"title":"Next time, don't blow the entire budget on special effects.","rating":3,"date":"7 May 2014","review":"Before I began watching The Mummy Resurrected, I wondered how anyone could make a mummy movie with a budget of only $750,000. Then, as I watched the film I understood. Most of the money was spend on special effects (they were reasonably good and a few were very good) but there really wasn't anything left to pay for a good script or actors or a director. And, speaking of director and script, it is very odd that when I looked up this film on IMDb, I noticed that although the cast and producers were listed for the film, this is NOT the case for the director or writer. Perhaps they didn't want to have their names associated with the film—all I know is that it makes no sense to omit these two very important credits.<br><br>The film is the story of six cute co-eds who are inexplicably in Egypt and are invited along on a mummy hunt. Now considering that these young ladies don't seem to know the first thing about archeology and seem like extras from a college sorority film, I felt perplexed. Yet, somehow we are expected to believe that one of them has a long-lost archaeologist father and instead of mounting a proper expedition with SUPPLIES, appropriate clothing and Egyptologists, for instance, he takes these six cute undergraduates into the desert to look for some ancient burial site. Once there, the three guides he brought are murdered (by whom we never have any idea—as it looks like the writer forgot about this plot thread) and he and the girls just ignore this and go exploring!<br><br>Later, the girls start dying—one by one. Does the girl whose father brought them there care? Not particularly—she just wants to hang out with daddy. Nor, unfortunately, does the audience care as it took so long for these deaths to occur that you'll find your attention sadly waning. Much of it is because the ladies' reactions were so muted. I've seen women break fingernails and act more upset than these actresses when one of their friends dies. I also had to laugh because one of these well-trained and well outfitted ladies had to use her smart phone as a flashlight inside the tomb because you can only assume they forgot to bring enough flashlights for everyone! So how does it all end? Who cares?!<br><br>Let's cut to the chase--the film is quite poor. The dialog was often atrocious ('it's like I totally blacked out'), the story was often dull, the edits were occasionally poor (scenes would go from full sun to dusk and back within the same scene) and the film never really made a lot of sense. These folks also didn't really seem like actresses—more like ladies who showed up for a campus kegger and on the way got invited to appear in the film because they had nice hair and looked kinda cute.<br><br>The bottom line is that the 1932 version with Boris Karloff is a classic. See that instead.","user":"MartinHafer","rank":[72,74]},{"title":"New heights of the low!","rating":1,"date":"7 May 2014","review":"This movie's gift to the world is a whole new definition to the word \"Pathetic\". Typing 10 lines for this review is a Herculean task. This movie (really???) is a new landmark to the fact that how low and degraded a plot, an actor, and a director can go trying to thrive on reputation of previous Mummy trilogy. A couple of special effects were kinda okay but can be completely ignored. One can give credit for that to cheap CGI effect agencies available now days. Within five minutes into the movie then skipping and fast-forwarding till the end in another 5 minutes seemed eternity. Do yourself a favor... stay away from this movie, it is so infectious it will ruin your whole day. I am running out of patience to end this ten line policy of IMDb. In fact this movie needs and can be defined in one word... Horrendous!","user":"vkasthakur","rank":[63,68]},{"title":"My Opinion","rating":1,"date":"7 May 2014","review":"I just saw the full movie and it looked like it was made in the early 2000's horrible acting, to say the least it was no where near what I was expecting out of a 2014 movie. It made the Earlier ones look like a masterpiece. Very disappointed. Was hoping it would have much better graphics and somewhat realistic. The mummy movies were awesome, I grew up watching the movies and it had a realistic plot and a good climax. This new one just didn't meet any expectations. It was not worth the hour movie it was. I hope some of the other viewers do enjoy this but i'm sorry the movie had no climaxes and not much of an interesting plot. Sorry for dumping on this movie.","user":"jcoderr","rank":[41,46]}]