[{"title":"Writers needed apply here...","rating":4,"date":"7 March 2016","review":"This movie had all the parts it needed to be a great horror movie. A creepy situation, creepy location, good acting (Jason Patric), and part of a story.<br><br>They didn't do a good job though. It's like they were baking a cake, got all the ingredients out, and then just left it all on the counter in separate piles, tadah!!!<br><br>The story makes no sense at all. I think Louisa Krause is probably a decent actress, but was over acting all the time. All though I'm pretty sure that was due to the writing. <br><br>This would be a good movie to remake with all the same actors and the same place, but with someone that knows how to tell a story that makes sense.","user":"tmdarby","rank":[22,25]},{"title":"A+ for atmospherics, C- for scripting","rating":5,"date":"17 June 2016","review":"\"The Abandoned\" has a young troubled woman (Louisa Krause) working as a night patrol at a massive abandoned luxury apartment building in New York City. Training her on the job is a cynical longtime employee (Jason Patric), but what should be fresh on-the-job jitters becomes a living nightmare when she discovers something sinister lurking in the building.<br><br>Perhaps it's because I went into this film with relatively low expectations, but I found \"The Abandoned\" to really only be half-bad. Previous reviewers are astute in their observance of the film's atmosphere, which is laid on thick and is really the central reason that I stuck with the film from beginning to end. It's well-photographed and the sprawling Renaissance-meets-art deco interiors are profoundly creepy. The film is worth viewing for this reason alone, as it is truly engrossing on just a visual level.<br><br>The script is where this film is truly weakest, although this mostly lay in the hodgepodge resolution, which is where the film really begins to come apart at the seams. It is not necessarily as cliché-ridden as many have seemed to paint it to be, though it is most definitely clichéd. At times the film reminded me of 2011's \"The Innkeepers\" due to the sparse cast and nightshift setting, though a far less subtle version; at other times, it seems inspired by 1999's \"House on Haunted Hill\" remake. Louisa Krause and Jason Patric have great chemistry on screen here, and play off of one another quite well. Both provide solid performances that are better than the material demands.<br><br>Overall, \"The Abandoned\" is a middling supernatural horror film; it is far from revolutionary, and is at times frustrating in its employment of routine plot devices, but the synergy between Krause and Patric is great, and the film is at times legitimately creepy, even in its conventionality. On a visual and atmospheric level, it's fantastic, but, as I said, the script doesn't match up with the film's aesthetic strides. 5/10.","user":"drownnnsoda","rank":[15,17]},{"title":"Typical cliché roller coaster with a better roller coaster.","rating":5,"date":"17 January 2016","review":"The scares are there, so are the intense moments, good chilling atmosphere, good execution and pretty much OK acting. <br><br>A normal horror, they didn't over stretch it, didn't over play it, they kept it simple and effective. Just don't expect to be blown away or even slightly impressed, the ending itself is very predictable. The Abandoned is a horror movie that some will see and they will most likely either quickly forget about it, or keep comparing it with so many other such productions before it.<br><br>All in all, an OK movie for a lonely late night.<br><br>Cheers!","user":"gothic-fiction","rank":[25,31]}]