[{"title":"The beautiful music of Boychoir is what lingers long after the credits roll","rating":9,"date":"10 September 2014","review":"I attended TIFF for one reason and one reason only, Boychoir. After swooning over François Girard's The Red Violin I was looking forward to a beautiful story set to beautiful music. I was not disappointed. The story is told in sections, reminiscent of Violin. In the case of Boychoir, however, it is not necessary and, as a result, the story does not flow seamlessly. The audience will easily fill in the gaps though and will be quickly won over by what Girard knows best – the music. <br><br>From start to finish, the music is breathtaking. The music of American Boychoir provides the thread that the story lacks. Not only does the music provide the thread, it provides the heart of the story as well. You will catch yourself smiling as the boys, known for their sophistication, sing a silly song when no one is looking. You will shed a tear when angelic voices rise to meet the demands of their choir master. The music is in equal measure haunting and uplifting. The members of American Boychoir, who were not recreated but actually recruited for this film, look like seasoned veterans on screen. It is clear that the music is a part of them and singing appears as natural as breathing. <br><br>Newcomer Garrett Wareing is subtle in his performance and a joy to watch. Veterans Dustin Hoffman, Eddie Izzard, Josh Lucas and Debra Winger undoubtedly earn their paycheck. Kathy Bates has some wonderful lines and delivers them brilliantly. <br><br>But the beautiful music of Boychoir is what lingers long after the credits roll.","user":"chaskasselman","rank":[34,41]},{"title":"Well acted story","rating":8,"date":"6 September 2014","review":"Boychoir as a movie was nothing earth-shattering or surprising in it's material. It's the typical 'kid who got a rough deal in life finally gets someone who believes in him' story and has all those things that normally show up in that kind of story. However, that doesn't mean you shouldn't see it...quite the opposite in fact.<br><br>First off, the script is pretty good, but fairly predictable. There are some great moments in terms of how the script is filmed though, and obviously the director is the one who deserves the most credit. The performances he pulls from the actors are fantastic, and because of this there were dozens of times when you laughed, or felt a tear well up, or just wanted to shout at the screen to support the players. That's why we go to the movies; to become emotionally involved in a story, and Boychoir accomplishes this very nicely.<br><br>Hoffman is Hoffman...there's not much else to say about him. He gives the exact right performance as you would expect. Garrett Wareing manages his role as the boy Stet very nicely, and it's a big task, a little too big for him at times, but there's potential in this young actor and it definitely surfaces. Josh Lucas and Debra Winger in their small roles add nicely to the cast, and Eddie Izzard and Kevin McHale are great in their supporting roles. The scene stealer in this film though, as is usually the case with her, is Kathy Bates. Every moment she is on screen she pulls the audience deeper into the story and injects just a touch more life into the film.<br><br>Finally, it would be remiss not to mention the music, which really is the cornerstone of the film. Watching the choir process and listening to the building sounds as the film progresses adds so much to the experience, and really helps build on the emotional lines of the story.<br><br>Boychoir is an emotional journey, and it was a nice experience to be at the premiere and be able to stand up and applaud the cast that were present, and who completely deserved the ovation.","user":"Fludlerk","rank":[20,25]},{"title":"Pleasant, but Unchallenging","rating":6,"date":"5 June 2015","review":"This movie, released in 2015, had a brief run recently at Princeton's nonprofit movie theater. It's the story of the fictional \"National Boychoir School\" and features the singing of students from the local, real-life American Boychoir School. ABS has fallen on hard financial times, and if it needed an infomercial to stimulate a really big donation, this is it. The movie stars Dustin Hoffman, Kathy Bates, Debra Winger, and Eddie Izzard in the adult roles, but director François Girard and writer Ben Ripley demand little of their talents. The story dwells mostly on the boys, and one particular boy (Garrett Wareing)—a misfit who arrives at the school unable even to read music, yet such a vocal prodigy that . . . yes, you can guess the rest. When the credits rolled and it turned out the movie had some affiliation with the Hallmark Hall of Fame, that was one of the least surprising moments in a string of non-surprises. Leaving aside its dramatic shortcomings, the creators' generosity with the music lifts the whole production. Actual ABS students are used in the production, according to a local news story, and director Girard said of the school, \"It was extraordinary to see them at work. What they accomplish goes way beyond music.\" A good movie for kids and a pleasant, if unchallenging interlude for grownups, too.","user":"vsks","rank":[13,16]}]