[{"title":"Not The Best But Still Worth Your Time","rating":6,"date":"9 September 2016","review":"\"The Neighbor\" is a brand new horror/thriller from director Marcus Dunstan, who also directed one of my favorite horror movies \"The Collector\" and it's sequel \"The Collection\". Dunstan did a great job in putting a spin on the home invasion premise with \"The Collector\" so I was excited to see what else he could bring to the table. The film stars Josh Stewart who was also the lead in \"The Collector\" and \"Collection\". So there are definitely a lot of similarities between those two films and the similarities do not end there.<br><br>The film follows John (played by Josh Stewart) who is a low level criminal looking to get one more big payday so he can get himself and his girlfriend Rosie (Alex Essoe) out of the business. But just as John gains the opportunity to get out he starts to realize that his neighbor Troy (Bill Engvull) is up to something very dark that may get in the way of John's hopes for a new life. It was definitely hard to ignore how similar the set up to this movie was to \"The Collector\", but as the movie progresses it definitely starts to take on it's own form. It does drags a bit in the beginning, it's not incredibly boring or anything but they do kind of take their time to kick things off. After about forty minutes the film really picks up and is a lot of fun, it's still not wildly original at that point but it does enough to feel fresh, for me at least. There are a couple scenes I could have done with out, and there were a few good scenes slightly ruined by some cheesy dialogue but for the most part the movie really delivered in it's third act.<br><br>I was pleased with the majority of the cast, especially Bill Engvull. I never would have thought that he would take on a role in a horror movie since he is known for being a very cheesy comedian. I was never really all that impressed with his comedy and the only movies I ever saw him in before this were low bro comedies that were not funny in my opinion. But he does a good job in this, he portrays his character well and actually came off as a little sinister in some scenes. Josh Stewart was good also, he plays almost the exact same character he played in \"The Collector\" but he does it well so I guess I can't complain. Alex Essoe does alright but there were a few scenes where she was trying a little too hard to be \"The Tough Girl\" and it just came off as super cheesy and unrealistic. <br><br>I enjoyed \"The Neighbor\", it's a little unoriginal and fairly predictable, but it's a well done movie with some tense scenes and a mostly good cast. Worth checking out for sure in my opinion.<br><br>6.5/10","user":"HorrorOverEverything","rank":[34,41]},{"title":"Just how well do you know your neighbors?...","rating":6,"date":"29 September 2016","review":"The 2016 movie titled \"The Neighbor\" starts out fairly slow and doesn't really progress much at any kind of speed, right up until Rosie sees something through the binocular. But then the movie does kick up into an impressive gear, and leaves behind its former semi-boring pace.<br><br>Without going too much into detail about the actual storyline, I will just briefly summarize the movie. John and Rosie are planning to leave town in order to start a new and better life, when Rosie makes a gruesome discovery through a looking glass directed towards their neighbor. And when John comes home, Rosie is nowhere to be found...<br><br>What works out in \"The Neighbor\" is the way that director Marcus Dunstan constructed the movie and managed to build up a good atmosphere and a sense of dread throughout the course of the movie. There is a good flow to the storyline, once it kicks into gear.<br><br>And the acting in the movie was quite good, although you shouldn't expect any dramatic Shakespearian thespian performances though. But people did good with their roles and character, taking the genre and fairly simplistic storyline into consideration.<br><br>I will say that Josh Stewart (playing John) actually stood out among the acting talents in \"The Neighbor\", because he really carried the movie quite well.<br><br>However, the movie did suffer from an overshadowing predictability. You knew what would happen throughout the course of the movie, and you knew how it would end. To that point, it was somewhat of a disappointment, because \"The Neighbor\" didn't really bring anything new to the crime / thriller genre which hadn't already been seen countless times before.<br><br>\"The Neighbor\" is a good movie for an evening's worth of entertainment. However, I doubt that you will be putting the movie on a second time around, because once you have seen the movie, there just isn't enough meat on the bone to support more than a single viewing.","user":"paul_haakonsen","rank":[10,11]},{"title":"from drug dealing to a brutal revenge survival flick","rating":8,"date":"28 November 2016","review":"I came across this one because I liked Don't Breathe (2016) people said well there's another one in that style to watch but hasn't got the publicity the other one had. So i picked it up.<br><br>It starts rather as a flick about dealing in drugs and living underground to earn money so John (Josh Stewart) and his girlfriend Rosie (Alex Essoe) can leave it all behind and go to start a new life. Until that point this flick is not delivering but of course on day they got a visit from their neighbor. <br><br>From there on this flick suddenly turns into a brutal flick were it doesn't matter who's face is smashed to bits, girl or boy. I can't go too deep into the story or I would spoil it all but you just doesn't see it coming how this flick turns into a horror suspense flick.<br><br>Excellent flick, don't bother about the characters not being evolved, this is all about surviving. <br><br>Gore 1/5 Nudity 0/5 Effects 3/5 Story 3/5 Comedy 0/5","user":"trashgang","rank":[11,13]}]