[{"title":"I'm Lucky to be Alive","rating":10,"date":"25 December 2015","review":"I am a survivor of playing on high school concussions. I finally quit playing by so many positive family influences in my life. I grew up playing Texas football, the \"American Dream\". I received my final football concussion in 2000 and discontinued playing football. Troy Aikman was the only one anyone talked about at this time regarding concussions and everyone thought he was fine. What they didn't talk about which this movie does a great job is pointing out all the players that died or had violent disruptive behavior due to post conclusion syndrome. I rated this movie a 10 because there will be millions of dollars spent to make the movie go away. It's important for every parent in America to understand what football can do to your kids. Football is a great sport but their can be serious life consequences that can come from it. <br><br>Football 2000 years later will be looked at as Roman Gladiators once were. <br><br>I loved every minute of my experience with football growing up. But the reality is the overwhelming effects this sport causes to our brains. <br><br>It was once said to me that if the brain injury could be seen on the outside of your body it wouldn't even be a question if football would still be a sport. However, it's not and that's why it's unspoken. <br><br>I very much support this movie and I am glad that Sony Pictures (only non nfl contract) took the liberty to show people what this sport's health effects can have on young kids and adults. <br><br>Hope you enjoy my real-life review. I feel lucky to be alive. Lucky that I was surrounded by people that could think there was more to life then the \"American Dream\". God Bless","user":"agallo33","rank":[239,289]},{"title":"I'm not a Smith fan or a football fan but this is a must see","rating":9,"date":"28 December 2015","review":"The acting was Oscar worthy, the science behind the discovery was fascinating, and the fact that it's based on a true story is incredible. It's proof that one person can make a difference. What is more impressive is after watching the film I discovered that this movie was a watered-down version of the original script. Even though Sony tried to avoid legal issues with the NFL by softening the script, I still found it spellbinding.<br><br>I will say that I think it's ironic Sony made a movie about a man taking a stand against the NFL yet Sony pictures, with all their resources, are too afraid to do the same.","user":"dv-12048","rank":[99,129]},{"title":"This movie shows it is Time for Change, MUST SEE!","rating":10,"date":"29 December 2015","review":"I've played football at every level and nearly every professional football league possible for the last 20 years of my life and trust me when I say this movie is a MUST SEE!! After watching \"Concussion\" with my son on Christmas day I had an epic awakening of common sense. The movie hit home so hard for me that I will no longer support the game of football. I will not play, coach, or watch it again until overall awareness and change is set in place for the affects of playing the game to be accounted for in some kind of way on a large scale. I have played this game for the last 20 years of my life and have physically felt the affects of it more and more each year. If you have played this game you know the \"SuperMan\" like culture that comes with it. How it is a sin to get hurt or say \"I have a headache\". I will no longer turn a blind eye to the long term affects of ignoring the phrase. What the normal fan or anyone who hasn't played the game at a high level doesn't know is the stress and depression that comes with leaving the game. I'd equate it to being the same as losing a spouse of 30+ years but add 100 blows to the head every day of each year. You already feel lost and meaningless but you also have years of brain damage which inflates the process. I grew up with a love for football because of its culture, all the great things it taught me, and the qualities it brought out of me and my \"brothers\", my teammates. BUT all of that is not worth my life after football. The fact of the matter is we as a society have turned a blind eye to the long term affects of playing football and I refuse to be a part of the problem any longer. This movie is not as visually gripping as it could have been and it also doesn't expand anywhere near as far as it could have on the obvious occurrence of brain injuries throughout every level of the sport but it gets right to the point and it shines light on the facts. The sport isn't going anywhere safe until the NFL does and the NFL has not and probably will not because of money. If change in the sport is going to occur it has to start at the top. After watching this movie every parent has to question if they want their child to participate in this sport. For me and my children, it's a definite \"No-Brainer\".","user":"chucksonspets","rank":[138,189]}]