[{"title":"OK... just OK","rating":6,"date":"8 November 2016","review":"I'm a big fan of Tom Cruise. He is a real old-fashioned film star, generous with his fans on the red carpet and with real star power at the box office. And I can happily sit down in front of just about any one of his DVD's time and time again and still enjoy it. Unlike many critics, I even enjoyed his last outing as Jack Reacher.<br><br>Unfortunately, and it pains me to say this but, his latest outing - \"Jack Reacher: Never Go Back\" - is a bit dull.<br><br>Lee Child's Reacher has many years before turned his back on his military past and wanders the country as a drifter righting wrongs outside of the law. In this film, his military past again makes a major (\"No, ex-Major\") intrusion into his life. Potential love interest Major Susan Turner (Colbie Smulders, from the \"Avengers\" world) is arrested on trumped-up espionage charges and Cruise sets out to clear her name. Along the way he accidentally (and rather too conveniently for the plot) discovers that a paternity suit has been filed against him and Reacher confronts the rebellious and light-fingered teenager Samantha (Danika Yarosh, aged 18 playing 15).<br><br>Unfortunately the big-cheeses involved in the international arms skulduggery are determined to tie up each and every loose end in their intrigue, and that includes Reacher, Turner and young Samantha by association. Needless to say, the villains - led by a one-man killing machine (Patrick Heusinger) - haven't counted on Reacher's 'particular set of skills'.<br><br>My problem with the film (after an entertaining opening) is that the screenplay lumbers from standard thriller set-piece to standard thriller set-piece in a highly predictable way. It's as if the scripts from 20 different films have been stuck in a blender. Shadowy arms dealing shenanigans: check; Cute teenager in peril: check; Gun fight on a dockside: check; Rooftop chase: check.<br><br>Are all the individual set-pieces decently done? Yes, sure. But the combination of these bits of action tapas really don't add up to a satisfying meal. The story arc is almost non-existent as there is no suspense in the 'investigation': the plot is all pretty well laid out for you. <br><br>Where there is some fun to be had is in the play-off between the born- leader Reacher and the born-leader Turner, both trying to be top-dog in the decision making. The romantic connection between the leads seems almost plausible despite their 20 (TWENTY!) year age difference: this is more down to how incredibly good Cruise still looks at age 54 (damn him!). Turner makes a good female role-model right up to the point where there is a confrontation in a hotel room and Turner backs down: despite Cruise being the \"hero\" it would have been nice for female equality for this face-off to have gone the other way.<br><br>The director is Edward Zwick, who helmed Cruise's more interesting movie \"The Last Samurai\".<br><br>The trailer started off well and then progressed into general mediocrity. Unfortunately - for me at least - the film lived up to the trailer. Watchable, but not memorable.<br><br>(Agree? Disagree? For the graphical version of this review and to comment please visit bob-the-movie-man.com. Thanks.)","user":"bob-the-movie-man","rank":[126,156]},{"title":"Not an improvement over the original","rating":6,"date":"27 October 2016","review":"While the trailer gives too many of the best scenes away (as do seemingly most Hollywood trailers of late), the second entry in the Jack Reacher franchise fails in it's attempt to capitalize on the momentum of the original. <br><br>With the titular character ably portrayed by Tom Cruise as the quintessential and confident bad-ass, the surrounding cast and paint-by-numbers story-line struggle around his nucleus to present a believable and involving action flick.<br><br>One of the issues that plagues the franchise is that the source material portrays Reacher as 6'5\" tall at a beefy 250 lbs, capable of taking on 4-5 attackers at a time. Cruise is in great shape and appears at least 10 years younger than his actual age but even with strategic camera angles, at 5'7\", it is fairly obvious that he is physically outmatched when surrounded by 4 of his assailants. Yet much ass is kicked with relative ease. This affects the realism meter as the film progresses.<br><br>Another issue is the somewhat stilted dialogue and a few \"Oh, come on, that would never happen!\" moments that elicited a few unintended laughs from other audience members during the viewing I attended.<br><br>The supporting cast do their part in workman-like fashion and some of the dialogue between Cruise's Reacher and Co-star Cobie Smulders' Turner entertains and engages as they argue while being simultaneously attracted to one another. Rounding out the cast as the chief antagonist, Patrick Heusinger is an effective (if somewhat clichéd) ex- Special Forces Psychopath who hunts Reacher throughout the film.<br><br>It's unclear at this point whether there will be a third film instalment but based on early box office returns, a sequel is likely. I hope they can take the best elements from the first film which had better fight scenes, less stilted dialogue and fewer formulaic plot devices. Seeing as the Jack Reacher Book series is currently at 21 novels, there should be a worthy successor in the Lee Child-penned Canon to put the film franchise back in good stead the next time around. <br><br>If you are looking for a breezy action flick with low expectations regarding plot twists or realism, Jack Reacher: Never Go Back fits the bill.","user":"admtech69","rank":[85,106]},{"title":"Huge disappointment","rating":7,"date":"7 November 2016","review":"Having read all of the Reacher books, I was one of those who cried \"What??!!\" when Cruise was cast as Reacher, but I changed my tune when I saw the first Reacher movie. I thought Cruise carried it off well.<br><br>So I was really looking forward to this next instalment . . . and what a disappointment.<br><br>The difference between the Reacher stories and other so called anti-hero stories is the realism that Lee Child brought to them. For example, none of those long slugging punch ups, Lee Child made it clear that a single punch would suffice and if not delivered correctly, then there was a danger of broken hands etc. And they followed this ethos in the first Reacher movie. But in this latest offering there was just slugging match after slugging match after slugging match, with nothing to show for it other than a cut above Reacher's eye. Where's the bruising and swelling? I'm sure he got smashed on the arm by a pipe, but there's nothing to show for it the next day when he's wearing his t-shirt.<br><br>On top of that, there's a hell of a lot of running throughout the movie - I'm surprised they didn't run to the toilet. This, with the camera work and editing had a way of making the movie feel rushed. <br><br>Finally, the script had one of the clever wit in the books.<br><br>All in all a disappointing follow up. Was it the Director? I think so.","user":"Vondaz","rank":[92,120]}]