[{"title":"A fair review of Hotel Inferno","rating":6,"date":"10 July 2014","review":"As it stands right now, all of the reviews from this movie are 1 star or 8-10 stars. All of these people are wrong.<br><br>For starters, this movie plays out exactly like a fist person shooter video game. The tropes, the dialog, and obviously the camera angle and movement. There's little doubt what this movie is supposed to be and, in all honesty, it does it rather well. The whole first person thing has been tried to a much more limited extent in some movies. House Of The Dead and Doom come to mind. But in these movies it was more for the movie's denouement...a final showdown. In Hotel Inferno it's done throughout and it's kind of enjoyable.<br><br>This isn't without it's drawbacks. The camera is jumpy, the dialog is on-par with a video game, and it lacks a bit of continuity. You'll find a 10 minute action sequence ended just to have some exposition on what happened and what will happen next. Again, exactly as you would in a video game. It's like finishing a mission and waiting for a cut scene to tell you what you did and what to do next, except it's a movie. This gets a bit old even if you follow the premise.<br><br>For a movie with this budget the special effects are actually quite well done. Gore fans will undoubtedly appreciate the over-the-top violence and gore and others will probably just laugh at the preposterousness of it all. Either way, the special effects team absolutely did the most with what they had.<br><br>All in all it's a relatively enjoyable movie if you know what you're in for (and have a six pack of your preferred adult beverage available). It's something a little new but absolutely not without it's flaws. Is it perfect? No. Is it a bit of fun to watch with some friends? Absolutely.","user":"Heislegend","rank":[48,56]},{"title":"Bloody Awesome","rating":8,"date":"23 February 2014","review":"I was excited to check this out, as I had been a fan of Necrostorms previous entries (Adam Chaplin and Tater City). I finally got my copy in the mail, and wow, it was quite the scene. <br><br>We open in a taxi, through the eyes of a man named Zimosa. We will see the entire movie through his eyes, completely first person. We find out that Zimosa is a hit man, and will be working for a mysterious millionaire called Mistrandia. Zimosa is informed he'll be performing a simple job of taking out a couple that are in the hotel room next to his. Couldn't be more simple. But not everything is as it seems and Zimosa is about to have one hell of a night. <br><br>I have only seen two other movies told in first person, the Maniac remake and Enter the Void. Both of which I enjoyed. Hotel Inferno was no different, I did very much enjoy this flick. I thought the effects were outstanding, I found it very easy to become immersed in this bloody world. Because it was told in first person, and we see people being blown away, shot up and punched to death, it feels like a violent video game that you can't control. That was a fun experience. I do find pacing can be difficult with a first person movie, but I was never bored with this one. <br><br>I was surprised at how creepy and chilling this became. Most of these movies have been bloody fun, whereas because we are so immersed in this one, it's quite freaky and even scary in parts. The atmosphere really paints this out to be a nightmare of a Hotel. <br><br>The gore is excellent and excessive, as the usual with a Necrostorm project. At times, it actually looked disturbing realistic, while other times it was just bloody mayhem. Fans of Adam Chaplin and Tater City will dig the gore. <br><br>We also have our mutilated villains. There seems to be this reoccurring theme of mutating the bad guys in some way, making them ugly/deformed. It works so well in splatter films, they look so cheesy, I love the effects. <br><br>The one thing I did find distracting was Zimosa's voice. Since we never see his face, I couldn't help but think his voice sounded strange. Nevertheless, the actor did an outstanding job, especially for someone we never see. The guy playing Mistrandia though had a perfect voice. I don't know what it is about the English accent, but it works! <br><br>I do feel the ending was a little anti-climatic, as our big bad \"girl\" wasn't as shocking as I thought she would be. But it was memorable enough leading to a very interesting conclusion which I won't spoil here. <br><br>Fans of Taeter City and Adam Chaplin will dig this. If you love splatter gore or video games, this is for you.","user":"Shaza123","rank":[48,70]},{"title":"I was surprised!!!","rating":8,"date":"8 July 2014","review":"I was excited to check this out, as I had been a fan of Necrostorms previous entries (Adam Chaplin and Tater City). I finally got my copy in the mail, and wow, it was quite the scene.<br><br>We open in a taxi, through the eyes of a man named Zimosa. We will see the entire movie through his eyes, completely first person. We find out that Zimosa is a hit man, and will be working for a mysterious millionaire called Mistrandia. Zimosa is informed he'll be performing a simple job of taking out a couple that are in the hotel room next to his. Couldn't be more simple. But not everything is as it seems and Zimosa is about to have one hell of a night.<br><br>I have only seen two other movies told in first person, the Maniac remake and Enter the Void. Both of which I enjoyed. Hotel Inferno was no different, I did very much enjoy this flick. I thought the effects were outstanding, I found it very easy to become immersed in this bloody world. Because it was told in first person, and we see people being blown away, shot up and punched to death, it feels like a violent video game that you can't control. That was a fun experience. I do find pacing can be difficult with a first person movie, but I was never bored with this one.<br><br>I was surprised at how creepy and chilling this became. Most of these movies have been bloody fun, whereas because we are so immersed in this one, it's quite freaky and even scary in parts. The atmosphere really paints this out to be a nightmare of a Hotel.<br><br>The gore is excellent and excessive, as the usual with a Necrostorm project. At times, it actually looked disturbing realistic, while other times it was just bloody mayhem. Fans of Adam Chaplin and Tater City will dig the gore.<br><br>We also have our mutilated villains. There seems to be this reoccurring theme of mutating the bad guys in some way, making them ugly/deformed. It works so well in splatter films, they look so cheesy, I love the effects.<br><br>The one thing I did find distracting was Zimosa's voice. Since we never see his face, I couldn't help but think his voice sounded strange. Nevertheless, the actor did an outstanding job, especially for someone we never see. The guy playing Mistrandia though had a perfect voice. I don't know what it is about the English accent, but it works! I do feel the ending was a little anti-climatic, as our big bad \"girl\" wasn't as shocking as I thought she would be. But it was memorable enough leading to a very interesting conclusion which I won't spoil here.<br><br>If you love splatter gore or video games, this is for you.","user":"actionjunky81","rank":[34,48]}]