[{"title":"It's very basic and raw.","rating":6,"date":"9 August 2016","review":"The reviews on it were right. The film is all about David Oyelowo and Dianne Wiest bouncing things off each other, and it's got that going for it, that two such great actors can hold down a film all by themselves, but you do have to like Oyelowo and Wiest a lot to really like the movie.<br><br>It's one of those movies that does not really have a point or expresses it in such low key that only someone watching who has been in that position could really reflect on what is going on and fully feel the emotion.<br><br>It's not that pin point of a situation. A man loses his wife in a car accident and the only one who can relate is his Mother-In-Law, but she is a pain in the neck even after her child's death (although she's dying from cancer so give her a break). This is a harsh situation while they're grieving<br><br>Also thought Rosie Perez was great too in the small role she had. Wish it had more of her because I like seeing her on the screen a lot.<br><br>It was good that the director and writer did have three really good actors to implement their material. They were the redeemable factor in the mediocre film.","user":"subxerogravity","rank":[12,14]},{"title":"So disappointing","rating":4,"date":"13 February 2016","review":"I made a point of booking early to see this film when it was announced at the Victoria Film Festival. I simply went on the fact that the two actors headlining would make it a powerful engaging movie.<br><br>This was obviously a labour of love for David Oyelowo (producer) and his performance is to be quite honest \"over the top\" and I am a fan of his work. I was so disappointed with the dialogue between the Oyelowo and Weist, as much as this is a difficult subject matter, in my opinion the writer did not give them sufficient material to work with.<br><br>I left the movie not having any emotional attachment to the previous 82 minutes watched and feeling my time wasted.","user":"wbabronco","rank":[20,28]},{"title":"I'm sadder than you","rating":6,"date":"30 April 2016","review":"Greetings again from the darkness. Every young filmmaker should be so fortunate to have Dianne Wiest and David Oyelowo accept roles in their first feature film. With what appears to be little more than an outline for a script, these two top notch actors bring the weight necessary to make us care about their characters  neither being especially likable.<br><br>Written and directed by Maris Curran, it's a story of two people working through their grief and guilt, unable to share the burden due to their inability to get past their own feelings. When a woman dies in a car crash, her husband Sherwin (David Oyelowo) and mother Lucinda (Dianne Wiest) are both devastated. Sherwin tries to drown his depression with non-stop boozing, and ultimately accepts Lucinda's invitation to visit her in rural Maine (a long way from his home in Atlanta).<br><br>The two have never gotten along with each other, and it turns out they each had a strained relationship with the now deceased wife/daughter. What follows are some uncomfortable dinners and conversations punctuated with much awkward silence  or cruelly pointed comments from cancer-stricken Lucinda. An unusually reserved and charming Rosie Perez is at her least obnoxious in the limited role of Lucinda's nurse (and Sherwin's confidante).<br><br>There are few things that waste more energy than a competition over who deserves to grieve more. In fact, Lucinda has a line where she states that being a parent brings out the worst in people  in this movie, that holds true for grieving as well. These two characters are not their best selves as they struggle to come to grips with the gaping hole that now exists in their lives.<br><br>\"It should have been me\" is not an uncommon thought for those who have experienced the loss of a loved one  especially if they are haunted by the past. The sub-plot of the marital battle over whether to have kids becomes much easier to understand as we get to know Lucinda. As talented as Ms. Wiest and Mr. Oyelowo are, it still would have been nice to have a tighter script, and director Curran could have backed off the relentless hand-held close-ups without sacrificing the solitude and intimacy. Beyond that, she does have some good insight into the process of mourning, and how so many people hold those emotions down deep.","user":"ferguson-6","rank":[13,19]}]