[{"title":"Retro Sci Fi Horror","rating":7,"date":"10 May 2015","review":"This film borrows a lot from classic sci fi horror movies, you get some of the tech from alien, a little bit of Event Horizon, and has the claustrophobia of The Thing. For a movie made on such a low budget, its pretty good. Maybe not quite on the level of some of the films I've mentioned but still a lot of fun.<br><br>A group of colonial marines like characters start off on a search and rescue mission in a far away outpost. Who's alive? Who's dead? You don't really know at the start, but the movie takes its own twist which will be fun for sci fi fans. Its a little weak in the latter half of the 3rd act, too many repeating scenes. I think some things could've been cut.<br><br>Overall, its an enjoyable sci fi horror movie. It knows what it is, the actors play their parts well. And even though it borrows heavily from earlier works it still has a fresh ending. Worth checking out especially because this genre is sadly neglected.","user":"thisisbs911","rank":[101,123]},{"title":"Entertaining Sci Fi","rating":7,"date":"9 May 2015","review":"Overall I think this was a good movie. The acting was convincing, the characters came across naturally and with conviction. It's not a complicated film to understand. You find out what goes on gradually as the characters do and that's a nice touch, keeping you in suspense as you don't quite know what's happening or what comes next. The movie pulls you into its world, the storyline was plausible as far as futuristic sci fi's goes, the characters kept you engaged and you felt for them as they struggled. I would recommend this film if you're a fan of sci fi's, and to those who aren't because it doesn't use silly effects to keep you engaged, it has just the right balance. Fun, entertaining mind twisting thriller.","user":"purpleprinc3","rank":[133,172]},{"title":"Pleasantly surprising, good sci-fi!!","rating":8,"date":"19 May 2015","review":"As always I started weighing my choices of movies for the evening by consulting several movie-review sites, amongst which also IMDb. When I saw the 5.4 rating I thought it might be some kind of cheap-shot bad attempt at movie-making, however after going through some of the reviews here (most of which were actually encouraging) I decided to give it a try anyway. What I got was almost 2 hours of so much tension that afterward I realized I had literally not moved my face away from the screen during the whole movie. Personally I like this kind of sci- fi. The dark, claustrophobic, tense scenario provides for a genuine thrill. Character development is not very deep (it's not exactly that kind of movie), but is certainly not lacking. The production value is up to standards as well, good CGI but definitely not overdone (did not need to be overdone as no compensation for a lack of plot is needed). The movie reminds me a bit of Pandorum (2009) and Sunshine (2007). My only comments on the script/plot is that they could have cut several scenes short by a few sentences, which would not have resulted in any loss of quality and would have maybe improved the progression slightly. But I dare to say that Infini is better than 90% of the sci-fi stuff produced in the last 10 years. I absolutely loved this movie and would recommend it to any true sci-fi fan.","user":"luka3991","rank":[72,98]}]