[{"title":"Nice visuals, but weak overall","rating":5,"date":"5 September 2019","review":"Highlights:\n<ul><li>The visualization of the various horror figures, e.g. Harold and the Pale Lady.</li><li>Several creepy and/or shocking moments keep things interesting, e.g. the pimple scene.</li><li>Zoe Colletti as Stella was fun to watch.</li></ul><br><br>Lowlights:\n<ul><li>The 'outer story' constructed to wrap the stories together is lazy and uninspired. It would have been better just to leave them separate and flesh them out a little, drawing out the tension in each.</li><li>I liked the attempt to bring in the 1968/Nixon/Vietnam stuff, but it just came across as awkward.</li><li>The characters are all pretty stock, giving the film a packaged feeling.</li><li>The scene with Stella and Sarah towards the end is in particular forced and weak (\"that's on you\" ...ugh, an eight year old could have written this)</li><li>Overall comes across as pretty standard stuff. It's not horrible, but it could have been much better.</li></ul>","user":"gbill-74877","rank":[110,153]},{"title":"Scary Stories to Tell in the Dark","rating":7,"date":"19 March 2020","review":"In small town America 1968, there is a dark history that hangs over an old abandoned house regarding the fate of the Bellows family. While escaping the town bullies, a group of teenagers break into the house to hide and it is in this house they find a dusty old book full of terrifying stories but as they take it away with them, new stories begin to appear in the book and the group of friends start to disappear one by one. When I first saw this advertised, I had never heard of the books on which it is based and from the trailer I couldn't figure out who the audience for this story might be. From the trailer I felt it was aimed at young teenagers but then some of the imagery used on screen seemed so terrifying and disturbing i thought it couldn't possibly be. Well it turns out it is aimed at teenagers and if i was a teenager watching this i would probably have loved it. As an adult i did still enjoy it, the horror elements were done brilliantly, scary, disturbing and memorable. It's the bits in between the horror that let it down slightly. I just felt the characters weren't developed enough and didn't really gel together like the young cast of IT did. Visually impressive and a decent story behind it but could have done with some extra time dedicated to character development.","user":"MR_Heraclius","rank":[31,43]},{"title":"An adaptation that should please fans of the classic book anthology series, as well as serve as a great gateway horror film.","rating":8,"date":"7 August 2019","review":"While this film doesn't break any new ground or add innovation to the horror genre necessarily, it brings the stories we grew up with to life and gives them a richer visual identity. Ovredal/Del Toro excel at giving us chillingly well constructed tension filled scenes of ominous creatures, haunting spirits, and just an atmospheric overall feel that puts the viewer right into the stories. While the teen characters are by the numbers and wreak of goosebumps/IT/Stranger Things influence, they are serviceable for the particular story. The horror visuals take the main focus and steal the show for the 108min runtime which is actually longer than most horror's of this nature and build off scene to scene effectively. Even viewers that are unfamiliar with the classic stories of the same name will be very satisfied with this film and hopefully be inspired to go back and read the books. I hope this film spawns a franchise and I'm happy to say this thoroughly surprised me as i was cautiously optimistic as to how they'd adapt it.","user":"frankjohnsonhawks","rank":[142,247]}]