[{"title":"Good but disappointing ending.","rating":6,"date":"6 May 2019","review":"Would like to see a bit more after she is freed. And reasons why Andi would wash his hands after women touched him, background info on his mom and childhood, otherwise great acting from Clare.","user":"kitkat449922","rank":[13,15]},{"title":"Review: Berlin Syndrome - A psychological tornado of violence and suspense.","rating":7,"date":"12 April 2017","review":"I've never seen Teresa Palmer in a film before, which is especially weird because she's Australian. I'm sorry that I haven't, because she was utterly fantastic in Berlin Syndrome.<br><br>The story is fairly simple; an Australian tourist is swept off her feet by a charming local in Berlin, staying with him for a couple of days before realising that she isn't allowed to leave.<br><br>Palmer's performance as Clare is so excellent that counterpart Max Riemelt can barely keep up, but keep up he does. His character, Andi, can be dashing, friendly and witty, or he can be sinister, cold and (perhaps most frightening) entirely unreadable. While director Cate Shortland surely deserves an enormous share of the credit, a scene I found simply remarkable is one where Andi suffers a loss and we as an audience are still able to feel sympathy alongside Clare for this monster of a human being.<br><br>Presumably borrowing the title from Stockholm Syndrome, the lines in the relationship of Andi and Clare do begin to blur throughout the film. Where Clare feels resigned to her fate, she attempts to make the most of her situation. It's a heartbreaking journey into the human mind and what it will do to survive – or keep from going insane. In certain scenarios it's impossible to tell if Clare is so deluded as to be sincerely happy or not, though these scenarios are of course interspersed with descents back into crippling despair.<br><br>What's interesting is that we don't simply follow Clare for the duration of the film, but just as often see how Andi is spending his day. It's an interesting division of screen time that frequently has the audience seeing a scene from Andi's point of view as he arrives home; we wonder along with him what Clare has been up to while he's been gone. It's a strangely fun viewing experience watching him examine the apartment for anything amiss or askew.<br><br>The cinematography is great, the score fantastic. One thing I loved about the film was its ability to convey so much wordlessly. The two main characters are regularly away from each other, and these scenes are therefore obviously less reliant on dialogue. Despite this, we are able to see and almost breathe the raw, exposed emotion of the duo.<br><br>The flaws in this film lay with a couple of weird editing choices (at some point we seem to be misled as to whether a character is painting their own toenails or someone else is painting the toenails of a cadaver, for some reason, and elsewhere a flight of stairs and multiple apartments could absolutely have been less disorienting). Clare also has access to a kitchen, but never uses a knife in an escape attempt. Because of the exciting moment where she finds a screwdriver in an early scene, one would assume that the kitchen is knifeless but we're never shown an empty drawer or anything to indicate a lack of knives. It just felt a little off.<br><br>The ending was disappointing; it manages to be both predictable and nonsensical, which isn't a great combination. I didn't let that ruin the film for me, though; Berlin Syndrome is a wonderful character-study and a psychological tornado of violence and suspense.<br><br>Sidenote: Do people in Berlin just hate calling the police, or something?<br><br>http://alexfalzon.com/berlin-syndrome/ - for spoilers (and more reviews)","user":"AlexFalzon","rank":[72,107]},{"title":"You'll be distracted by how much better it could have been","rating":4,"date":"15 October 2017","review":"This is one of those films where someone said \"hey, what if...\" and presented a very basic plot, then rushed out a draft script. Rather than redrafting and reflecting on how to make the story interesting and relevant in some way, they just pad it out to make it a feature length. As it is, what could have been a detailed, fascinating film ends up being empty and boring. <br><br>Where the story promises most isn't so much the escapist suspense side of things but the situation as a metaphor for relationships. Issues of control, dominance, repression of freedom, gender stereotyping, c0-dependency. Some of these ideas are hinted at but nowhere near developed, like the writer just didn't have the substance, depth or experience to know what they were doing or saying. There's one scene where the captor is shown to be a germaphobe, which is incongruent with many other scenes in the film (he basically never shows this OCD trait again). <br><br>As a suspense film it has the occasional moment, but is woefully under-written. It simply could have been a LOT better, especially given the two hour run time.","user":"rabbitmoon","rank":[29,43]}]