[{"title":"This was meant to highlight female directors?","rating":19,"date":"19 February 2017","review":"I don't know where to begin with my thoughts on this anthology. I would more or less refer to them as proof of concept ideas that filmmakers give to production companies.<br><br>The first concept 'The Box' started creatively enough with the mystery of a boy seeing \"something\" in a box and then it went no where. This wasn't horror, it wasn't scary, and it came across like it was alluding to a message that I couldn't decipher. It does remain true to the Jack Ketchum short story of the same name, but it failed to capture the narrative style the book delivers. If they retold the story from the mother's POV I would add another star to my review, but she's a background character until the very end. Disappointing.<br><br>'The Birthday Party' would be better listed as a dark-comedy. I didn't like it at all. Don't know what else to say about it, but it was a waste of time. I wanted to find hidden meanings behind what was happening and I kept expecting something to relate with. It delivers nothing. This isn't even something to share over a campfire.<br><br>'Don't Fall' was a straight forward horror genre without any real content. It seemed to be making fun of such stories rather than trying to be plot or character driven. It was as derivative as most\"monster chasing a girl\" movies can be and just as lifeless. Terrible acting, no pacing and not even a claustrophobic element with the small camper. It's like the director didn't want the job or didn't bother trying.<br><br>'Her Only Living Son' was actually the closest to being watchable. It was this short that helped keep it above 1 star for me. The plot was ... conventional ... is a kind word. The acting was sub-par, but I did like Kyle Allen as Andy. I thought this could have been broader and more illusive about the surprise mystery. It's a clichéd tale (probably should say a throwback) from 1970's flicks based on devil-worship. I never liked those things. It's just people acting creepy or weird and I'm certain today's audiences are fully desensitized by their nightly news to give 2 cents about this garbage.<br><br>All in all; I wish I had paid attention to the warnings of other reviewers. Because the focus was on women directors, I didn't want any negative influence from misogyny or patriarchal leanings. I watched with all the hope in the world and it was very disappointing.","user":"jegd-847-631407","rank":[112,148]},{"title":"Not quite good enough","rating":4,"date":"19 February 2017","review":"Four short horror films, no linking narrative, although there is some decent Svankmajeresque stop-motion animation serving as transition:<br><br>A boy loses his appetite after getting a glimpse of something mysterious; a woman discovers her husband's corpse on the day of her daughter's birthday; four attractive young people discover an Ancient Evil (TM) in the wilderness; and a mother deals with the discovery that her nearly adult son is disturbingly violent and yet everybody worships the ground he walks on.<br><br>Production values tend to adequate-high, and effects are acceptable, but there are small issues with each section that leave the overall film feeling amateurish. They're generally small issues, and I expect the filmmakers to work them out for their next projects.<br><br>Narratives are disappointing, generally from the lack of resolution-- although inconsistent characterization and unimaginable motives plague the second, making it the weakest. I can enjoy unresolved horror shorts in general, but it doesn't work here, not with the way these films are implemented; there's too much dragging along at each end, suggesting a reveal that never materializes.<br><br>The first was my favorite, and I found it generally creepy, although, again, the resolution was handled poorly; there were also some instances of poor acting, and too much voice-over exposition.<br><br>The \"theme\" of XX is apparently that all four films were directed by women, but there's not really any significance to that. If the title wasn't so eager to let me know, I wouldn't have realized it, and it kind of feels like painting a handgun pink for marketing purposes, a little dubious. Still, it's not a big deal to me, just a title. But after knowing, a few things stand out: the inversion of stereotypes for the parents in the first film; the unwillingness to commit to any crazy-lady characterization in the second, even though that's the only thing that would give the story even a lick of sense; the self-important and overly long soliloquy in the final film. (The only thing that maybe stands out in the third is that none of the attractive young people decide to disrobe, as they do so often in similar films.)<br><br>I'd say that the first film is probably worth watching, but I wouldn't bother watching past that. Not worth paying money for. Still, there's no reason not to expect good things from the filmmakers in the future, as they find some better scripts and improve their techniques.","user":"vasiln","rank":[63,86]},{"title":"XX: XX = WTF","rating":3,"date":"11 February 2019","review":"XX is an independent horror anthology that got a bit more press than the average due to it notably being advertised as one written, directed and being lead entirely by the fairer sex.<br><br>I have to admit this did interest me, women do tend to lead most horror movies but written and directed by? My interest was peaked, and I do love horror anthology films.<br><br>Telling 4 short tales separated by creepy stop motion animation it was worse than I ever thought it could have been. You see it reminded me heavily of The ABC's of Death (2012) which was an anthology I'd expected huge things from and ended up being one of the worst films I've ever seen. The stories were pointless, disturbing (And not in a good way) and just downright confusing, and that's basically what we have here. The tales aren't exactly what you'd expect, they aren't traditional horror or even alternative horror for that matter. They are weird art house films for the most part which are neither interesting nor scary. One of them simply isn't horror at all and the first story was just, well the whole thing is just terrible.<br><br>The third story was passable, the rest range from bad to absolutely dire. The films all female gimmick isn't worth watching this for, it's truly poor stuff.<br><br>The Good:<br><br>Story separators are interesting<br><br>Melanie Lynskey<br><br>The Bad:<br><br>3/4 stories are just awful<br><br>1/4 isn't even horror","user":"Platypuschow","rank":[19,23]}]