[{"title":"A small step. Very small tho.","rating":4,"date":"11 August 2016","review":"So, this is another indie, small horror project, that took itself serious, and had some good parts to offer. But do bare in mind the budget and the possibilities.<br><br>The acting was overall satisfying from my point of view, better than expected for this kind of movie, actors were nicely chosen I'd might say, the dialogue worked OK. The deaths were also good enough, you get your share of blood, violence, pretty much the usual. There is a plot to it, you most likely seen it before but this is a small step up from all the others I've laid my eyes on lately. <br><br>You could watch it if you have absolutely nothing better to do. Or if your wifi fails and leaves you stranded with only the movies on your computer. Or netflix. Whatever, wherever. I won't recommend it, but I'm not going to bash it either. It's a 4 star movie at best, perhaps, slightly, less, but I'll round it to 4 thanks to the effort put into it.<br><br>Cheers!","user":"gothic-fiction","rank":[10,12]},{"title":"I liked it a lot","rating":8,"date":"28 May 2017","review":"A girl is held captive in some abandoned building. She manages to free herself while her captor is somewhere praying while holding some creepy little figurines. When he hears the girl he puts the figures away in a box and cloth bag and goes chasing after her with his drill that has a giant bit reminiscent of The Slumber Party Massacre--one of my favorite movies. As she escapes the building, she runs into a cop who's looking for her. That allows our villain to put to drill to some very good use. But another cop shows up and kills him. Now this is a great intro! While the cops are in the car some scary lady appears demanding the cops give her box with the figurines. Of course it's evidence so they can't give it to her. Yet somehow the box ends up in the hands of the cop's daughter and estranged wife, who has some crafts store. The girl makes some pendants and bracelets with the creepy figurines which for some reason all the customer find so cool and by them all up right away. The girl keeps one of them though.<br><br>Sure enough, one guy who gets a figurine pendant from his girlfriend goes nuts after becoming very pale at a convenience store and kills the worker there and is shot by the owner afterwards. Not only that, but he leaves a bloody sign painted in blood. This intrigues the cops because it's the sign that the serial killer from the intro used.<br><br>Next, the cop's daughter goes pale and nuts and kills the beautiful family Rottweiler. She's then quickly taken to the hospital where the problem is initially attributed to her epilepsy.<br><br>Then a family friend gives another figurine pendant to her husband who goes bonkers, kills the gardener and then attacks the wife just as the cop arrives. When the cop finds the figurine he decides to visit the crazy woman from before who wanted the box. Turns out she adopted the abandoned serial killer when he was a child. The figurines, or worry dolls or more accurately translated, sorrow dolls, come from Guatemalan lore and are designed to remove someone's sorrows and pains. Her grandparents were from Guatemala. But in the case of the serial killer since he was innocent and yet consumed with hate, the sorrow dolls ended up transmitting the hate. The solution is for the cop and his sidekick to collect all the dolls with the box and deliver them to her by dawn. He succeeds but there's a twist.<br><br>Devil's Dolls won me over with the brutal intro. Unfortunately, it doesn't keep up the intensity probably for budgetary reasons. We could have used at least one more doll/killer/victim. For some reason it doesn't focus enough, literally, on the dolls. They are small and creepy but the camera doesn't zoom in at any point, and for some reason no one looks at them carefully, even though they are unusual and striking. The wonderful intro credit scene featuring sights of Mississippi plus the dolls themselves which have some wooden structure reminded me of the first season of True Detective. I found the script smarter than usual. It handles for instance the relationship between the cop, his (ex)wife, and her new guy very well. The background of the dolls is also interesting. Casting is strong, most of the ladies are attractive. Christopher Wiehl who multitasked as producer and writer as well, occasionally delivers an unconvincing performance as the detective.<br><br>I found that this movie delivers more than most horror movies these days. And it's the stuff that I like--strong kills, a novel deeper story, it features a Rottweiler who can't escape the usual dog fate in movies. One nice touch is that the filmmakers thank the audience at the end for watching the movie, something I wonder why not more do. I highly recommend Devil's Dolls, it's better than the score here would lead you to believe.","user":"TdSmth5","rank":[6,7]},{"title":"Horror about dolls that bring out the worst in people","rating":4,"date":"28 June 2016","review":"A serial killer leaves behind a box of \"worry dolls\" after he is killed by cops. Basically, you tell your worries to a worry doll and supposedly it takes them into itself thus liberating you. Anyhow (yawn), the dolls (4 or 5, I believe) accidentally get distributed while in transit to police headquarters. Not a good thing for the new owners whose fears and insecurities become amplified to paranoia by the dolls.<br><br>The good news: Movie could have been longer. But don't take this to mean it was a terrible movie. It was just a straight-forward, \"nothing new or surprising\" movie. Once you learn about the dolls in the earlier part of the film, your brain just coasts thru some bloody, but unremarkable deaths until the end where there is a little bit of the unexpected. Before I close, let me say this: A human being on fire is not funny. But I think that if in a movie said human is made to run a considerable distance while aflame....well...you know. I'm only human, folks! Love, Boloxxxi.","user":"Boloxxxi","rank":[14,20]}]