[{"title":"A painfully self-aware sequel drowning in its own self-applause","rating":1,"date":"3 October 2016","review":"Folks, this movie is Exhibits A through Q of why you cannot make a sequel to a cult classic of decades past.<br><br>The great thing about the original Samurai Cop is that it was hilariously unaware of how bad it was--which made it so enjoyable from a \"so bad it's good\" kind of viewpoint. Amir Shervan was trying to make a good movie, but failed on a spectacular level. In this movie, the director and writers went out of their way to cram EVERY possible reference to the first movie that they could into its bloated run time. It is as if they were sitting there going, \"See? See? We're cool! We know you like stupid movies, so here's a stupid movie! We also got Tommy Wiseau from that other horrible movie you enjoyed!\" This sequel is SO self-aware, I think it destroyed the entire philosophy of existentialism.<br><br>This movie purports to be a sequel that takes place 25 years after the events of the last movie. However, there are numerous continuity gaffes all over the place that all combine to make a disjointed, meandering ball of confusion that tries WAY too hard. Fuj Fujiyama is somehow alive with no explanation as to how he survived. Jennifer fakes her death for literally no plausible reason, goes into hiding under a different identity, and suddenly now has a brother (Tommy Wiseau's character) that is a high-ranking member of a gang. Also, the American kid who \"kills\" her in the beginning of the movie is revealed to be her brother. So, a curly- haired, American teenager grew up to be a mentally-challenged, stringy-haired Eastern European man???<br><br>There are so many gangs and gang figureheads that appear out of nowhere, get like four lines of dialogue, and have no relevance to the plot, that it is nigh-unto impossible to keep up with any of it.<br><br>Also, at least FOUR separate times, a character (mostly Frank) absolutely takes a sledgehammer to the fourth wall by staring directly at the camera and acknowledging us, the audience. Again, this movie is painfully self-aware and it isn't good.<br><br>This movie is an absolute mess, and not an entertaining mess. It was a chore to sit through. Fans of the original, please do not watch this. You will be severely disappointed, which is saying a lot considering I expected it to be bad anyway.","user":"Xenomaster","rank":[22,24]},{"title":"Possibly the worst movie sequel of a 'so bad its good' cult movie","rating":2,"date":"4 February 2016","review":"Like many of you reading this review, I am one of those special individuals who enjoys watching bad movies because of the non intentional hilarity factor involved. A movie which has a cast and director who actually try to make a good movie but are not aware nor can cope with their lack of expertise, budget or comprehension of a proper film can have gut wrenching laughs.<br><br>Now enter the Samurai Cop 2. Building up from its cult following and the internet movement of glorifying old bad movies, it invested some money into creating a sequel to satisfy rabid fans. Now the problem is that the movie is too self aware about what's going on. The first film had an amateur director with big dreams leading a cast of actors who where desperately trying to build their acting portfolios and then suddenly everything crashed and burned. The second seems like it was trying too hard to re-create the tragic magic it had from the first film and instead of making a movie so bad its good, its just a terrible film. The cast and crew came into this movie knowing it was nothing special and it ends up being just that.<br><br>First off we can talk about the story. I have yet to figure out what the hell was going on. At first it seemed to make sense. Losing a loved one caused samurai cop to go into hiding. There's a clan war between two large gangs and they need him back to stop the impending chaos. After that you get random scenes of flash backs, poorly executed action scenes and reused meditation sequences of samurai cop on the beach. I know the story wasn't the main attraction but it created this vortex in which the more you tried to follow it the more you got lost in what was going on. It got to the point where you couldn't focus on the jokes because your brain was too warped from the messed up information it just received.<br><br>The actors that were in the film weren't great either, which is to be expected because they brought back many of them that were in the first film. The new characters consisted of porn stars and Tommy Wiseau to cater to those who enjoy gratuitous nudity and The Room. I am one of those people so that's where one of the stars from my rating is derived. I enjoyed Kayden Kross' performance and it's quite sad that her acting was better than most on set. Her black wig made her look like Jill Valentine...mmhhhmm...anyways back to the review.<br><br>The interior sets were poorly done consisting of reused basement rooms and decorated basement rooms to simulate places such as bars, clubs and building complexes. The colour scheme they used was really bright which almost rivaled tron for its neon use. They said they used the kickstarter money for special effects but it looks like basic animations and sfx that come free with a low end video editing software. They really screwed kickstarter backers if they spent 50k on elementary school cgi work.<br><br>The music was the other reason for the second star for this review. I enjoyed it and it set the mood quite well and hit the right notes to move you through the poorly acted scenes.<br><br>All in all I give this movie a 2 out of 10 starz rating. I would not recommend this film. They ruined perfectly good memories of the first bad film and didn't even try hard to make a good film which would end up being unintentionally bad. They should have used the budget and kickstarter money to make a porn parody as they could've used the same cast, been more entertaining and cost less money.","user":"BeDeeJames","rank":[44,52]},{"title":"Painful","rating":1,"date":"5 April 2016","review":"It's not funny. It's not nostalgic. It's not anything, really.<br><br>A spectacular example of hipster counterproductivity, this outrageous waste of time is really just a feature-length showcase of how much money &amp; online hype can be flushed down the toilet by the utterly untalented.<br><br>There's no plot to give away, because nothing happens. It's just crap, stumbling from one nonsense \"scene\" to another, with a few little \"nods\" to the original along the way. I can't even think of words to describe the rest... bright colors? No attempts at continuity either, unless a small parade of lame cameos qualifies as such.<br><br>Maybe the most tragic - yet interesting - thing about this project is the increased appreciation this pile inadvertently lends to that first movie. At least Samurai Cop stumbled into accidental charisma here &amp; there! That Amir guy must be turning in his grave.<br><br>I'd like to further skewer this trainwreck, but it's frankly just depressing.<br><br>Don't watch it. It blows.","user":"greenviking","rank":[24,30]}]