[{"title":"Um...What Did I Just Watch?","rating":4,"date":"23 January 2019","review":"One of my most anticipated films of 2019 is sadly a dud. The film starts off with modern U.S Marines wearing World War II helmets and that really sets the tone for the rest of the film.<br><br>World building is exceptionally vague with hardly anything explained and character development is pathetically rushed and paper thin. Even with extensive voiceover, I could barely tell you what the plot of this film even was, when it took place or why the characters act the way they do. Worse still, I didn't care too. It feels less like a film than it does a collection of poorly strung together scenes tied around Hayden Christensen's impressively acted, but narratively useless, voiceover. I was getting Slender Man (2018) flashbacks watching this at points and that's not a good thing. You can really tell how much of a nightmare this was to make and large portions of the movie just seem straight out missing. Often times, characters will shift behavior and personality seemingly between scenes. Hayden's Tove begins the film as a physically vulnerable, washed up bum and then becomes a cold, efficient, martial arts mastering badass a scene later. Occasional exposition will be thrown in to give us at least a bit of context, but hardly anything that makes this any easier to follow or any more compelling from a story standpoint.<br><br>It's a shame, because there's a lot to like here underneath all the incompetence. Hayden Christensen's performance is genuinely award worthy, probably his best since Shattered Glass. I was shocked by the range of his vocal delivery, it's easily the most he's ever showcased, and his facial acting is equally nuanced. It's one of those performances like Meryl Streep in The Iron Lady or Leonardo DiCaprio in J. Edgar, where his acting clearly belonged in a far better movie.<br><br>Harvey Keitel isn't half bad either. He's at a stage in his career where acting is pretty much optional for him, but he genuinely seems to be trying here. He believes in this film and he believes in this character and he definitely commands the charisma and presence of a \"dark messiah\"-esque character.<br><br>The overall aesthetic of the film is excellent as well. The visual direction (mostly) looks better than most theatrical wide releases, really capturing the dark, Gothic feel of a Gotham City or Blade Runner-style LA. The musical score is one of my favorites in recent memory as well, evoking a very moody, ominous and intense tone.<br><br>Overall, The Last Man is a mess. It has plenty of positive elements, but they can't fix a broken and confused (If not outright incoherent) story and character development. It's worth a onetime watch just to appreciate Rodrigo H. Vila's inspired direction and the excellent lead performances, but it's not worth much else. I was frustrated with The Last Man and ultimately let down by it.","user":"TheMovieDoctorful","rank":[29,32]},{"title":"it tries to be real","rating":4,"date":"29 September 2018","review":"The best thing I can say about it is that it tries to be. Not \"good\", but \"something\". The film essentially meanders between apocalyptic sci-fi, noir (à la Mute), some kind of parable about climate change and traces of post-Vietnam war movies (PTSD). It just doesn't do too well in any of those fronts, choosing instead to bury down in itself with the promise of meaning.\nIf you hate voice over, or simply think that it is a poor substitute for good storytelling (or storyshowing), and a crutch for emotional exposition, just stay aeay from this dissapointing film.<br><br>No, not even if you are a Harvey Keitel fan, or like the genre. It will not add much to your life.","user":"eduardo-g-melguizo","rank":[40,53]},{"title":"a disappointing mess","rating":4,"date":"25 January 2019","review":"Actors were not bad so I have to chalk it up to bad writing and dialog. My gf actually walked in and asked why they are talking like that. great concept just was not portrayed in a professional manner. a big disappointment for me and i am sure you will see the over-all rating plummet once a few people have seen this mess of a film.<br><br>3.8","user":"natcalgary","rank":[17,23]}]