[{"title":"As the Gods Will brings the morbid aspects of human's demise, presented with vibrant color, ironic laughs and healthy dose of horror.","rating":7,"date":"27 May 2015","review":"Based on manga with the same title, Kamisama no iu tôri (As the Gods Will) is a story of average high school students forced to play a series of deadly games. Takeshi Miike who has proved capable with such theme is the perfect pick to create a fascinating, occasionally humorous and gory live action of the manga. He has a distinct stylish visual, timely touch of horror and a proper respect to the original source.<br><br>For such grimly movie, the cinematography is very sleek and cool. Viewpoints from above and panoramic shots are used often to set the ambiance. Visual offers bloody gore with mildly tone down violence. For the part of full blood pool of the manga, this movie counterpart uses a more comical effect yet without neglecting the intensity of the scene. In fact Miike, as expected, produces a couple of nasty gruesome sequences of his own.<br><br>Humor and philosophical elements are steadily present. The first half sees more comedy for ironic purpose, as the story progresses and the death dealing intensifies the tone tends to be more serious. The movie has taken the liberty of creating more appropriate screenplay for later games. This is due to the fact that it might become overly complex for a feature length movie to display later arcs, and frankly it's not a cause for concern as the new screenplay is still presentable and keeps all the thrilling attributes of the manga.<br><br>Miike has a knack for the unassuming shift of tone, as seen from Crows Zero and 13 Assassins. Sometimes the movie would transition from quiet scene to a rather explicit one. It doesn't venture into dark territory too much, but it does warrant a mature rating. If there's any concern, it's that the nature of the games is highly inspired by Japanese culture, this might create a rather awkward narrative at some points though it's only a minor hindrance.<br><br>Equally quirky and disturbing, the myriad of bizarrely captivating games of death is brought to live by Takeshi Miike.","user":"quincytheodore","rank":[30,36]},{"title":"Takashi Miike is an artist","rating":6,"date":"2 August 2015","review":"At core, Takashi Miike's As The Gods Will may seem like another Battle Royale rip-off as we've seen oh so many times before but I don't exactly believe that to be the case.<br><br>The cinematography on one hand was gripping, the color scheme meshed so amazingly. This was a rather pretty movie to look at all things considered.<br><br>The acting was a bit weak from some of the minor characters but the actors for the main characters was great.<br><br>Now as for the movie itself, it was fun which really is all I demand of a movie. To be entertaining. I don't even think the premise was bad.<br><br>The concept of the gods playing games with humans in order to test their skills is something that has been around since ancient Greece, but this did it exceptionally well as it never felt too forced. If it had gone to great lengths trying to explain everything it would've ruined the feel of the movie.<br><br>It's a ride from the start to the ending, never once did I feel bored during it and there were several moments where it was actually suspenseful.<br><br>I know some film snobs might overlook this movie as not being good enough due to it being a bit silly, but I think they are missing out on a brilliant experience.<br><br>I recommend this movie if you just want to sit back and enjoy a suspenseful ride with charm, creepiness and gore.","user":"firedace","rank":[14,18]},{"title":"Stunning, twisty-turny, and NOT what you expect. The 'WTF did I just watch' guy totally misses the point... Rewatchability: Very High Blu-ray: excellent A:10 V:10","rating":7,"date":"23 July 2015","review":"WOW! This is NOT my normal fare, let me tell you. Normally I would cross to the other side of the 'street' rather than watch many of Takashi Miike's films. BUT... I had indeed kind of braced myself for a bit of a cartoony gore-fest, although that is NOT my first choice in films. But, this premise was SO damn WAAAAAAAAY OUT there, that I just had to check it out.<br><br>Man, I truly do not know where to start... I am still kind of reeling a bit from the film, which I JUST finished. Well, firstly, it was not really that realistically gory or graphic; it mostly had a more cartoon-like vibe to it. And, regardless of the director's NOTORIOUS proclivity for extreme, sadistic violence (thus my normal avoidance of his films) this one honestly came off as not really that explicit or 'Real'. Other films of his where he has actual PEOPLE doing horrific, REALISTIC things to other people, I wouldn't come within 100 miles of, but based upon the extremely Fantastical premise, I figured that this would not likely be another one of his super heavy-handed Sadist- fests, and it truly wasn't.<br><br>YES, the basic premise of what these 'Gods' are doing to these students is of course in principle quite terrible. But, that really wasn't the point of the film; the primary focus was NOT just a big set-piece for a bunch of gory deaths, although those do happen, but for most part, with a couple of exceptions (where I did FF a bit) they were not graphic or overly explicit.<br><br>At the end, without giving anything away, you are left with a feeling that there are more layers to this than seems evident on the surface. As a matter of fact, the last minute or two actually left me kind of puzzled because I didn't quite understand what exactly happened (so I will be frigg'n LIVING on discussion boards until I find that out!) One underlying level of the film is fairly apparent concerning the one fellow learning to appreciate the life that he has (sort of a Psychedelic, Acid-induced 'IT'S A WONDERFUL LIFE' by way of Takashi Miike) But, even beyond that there are other things touched upon and quite unexpectedly thought-provoking.<br><br>So, I can fully understand how some here (3/5?) who are likely VERY hard core Miike fans, would be BITTERLY disappointed that this is NOT one of his usual more horrific and sadistic films, and probably just find this one totally Stupid. Understandable... BUT... for me, NOT a usual fan of Miike, heh... what I would call by comparison a 'Normal' person (using the term VERY loosely) I think the movie if you give it some thought, actually is more intriguing and entertaining and surprisingly thought-provoking than what might appear at first glance.<br><br>So, I would say that if you are a hard core Miike fan and you really LIKE his usual hard core stuff, than this film will probably leave you flatter than Chaz Bono. BUT... If you like your Horror films REALLY Imaginative, and you aren't just looking for a bunch of torture-porn sadism, and if you can be patient and give the movie some thought, I think that many people will definitely come away from seeing this with several different feelings and levels that the movie touches in you that you would not expect...","user":"lathe-of-heaven","rank":[13,19]}]