[{"title":"Not very good, ya","rating":3,"date":"31 July 2015","review":"This is what happens when you make a cheap movie in south Alabama. The scenery was wrong for northern France. <br><br>Women didn't serve in combat in 1944. WACs and nurses didn't have hairstyles like Nancy and Vera. <br><br>There were no German vehicles in movie. They just tossed Nazi flags over U.S. Jeeps. The German spoken was unrecognizable, and I speak German. They just used a bunch of familiar words like schnell. One of the German soldiers spoke with a Brooklyn accent.<br><br>Maxwell disappeared when grenade blew-up--poor special effects. The clothing and weapons were from post-Vietnam era. <br><br>Only a young person would be fooled by this poor excuse for a WWII movie.","user":"bfwhalen3","rank":[46,61]},{"title":"It is almost like Saving Private Ryan, but without the Tiger tank.","rating":3,"date":"3 September 2015","review":"A long time ago in a place far far away to the east of the US, a SS unit, spearheaded by an outdated assault gun(by golly, it is a Stug III!), attacks some US troops in what resembles a forest that is proclaimed to be in the North of France in World War II, but is probably located in the Apennines. <br><br>Some make a stand and others flee, like a a bunch of soldiers of the elite Screaming Eagles 101st airborne division, which might have greatly offended any vet still living and make him die with the sheer outrage of it. No US airborne unit operated in the autumn in the North of France(they were held in reserve), but no SS units did either(they were pulled in reserve for the planned counter attack later in the year). So it is just a lot of baloney either way.<br><br>Nor did the SS operate with a Stug III in what is obvious sandy camouflage, which nobody in his right mind would use in the green landscape of North West Europe. At least not for long considering the total air dominance by the allies. <br><br>So the SS surrounds a group of American soldiers, which also includes two women of the medical staff, one a nurse and the other a doctor. This surely attests to the reach of the counter attack as women medical staff didn't operate near the front-lines, so we are talking about a deep advance into liberated territory with one assault gun, a bunch of captured American vehicles and what might have been a SDKFZ 250. <br><br>Interestingly enough the SS officer later on tell us that they have been commanded to stay put. This makes it even a greater feat because it is an counter attack that is actually not a counter attack. It boggles the mind! <br><br>It is a pity that this feat has gone completely unrecorded in history, but lucky we got this movie to tell us all about it. <br><br>The story meanders a bit while the US soldiers liberate themselves, capture Germans, then get captured again, then escape again and so on. After a while you lose count of the many twists. It might even be called exasperating. <br><br>The cast has no script to work with, unless it must be a early draft of Rambo, as one inexperienced private escapes the German clutches and goes on a killing spree. Which isn't really a big deal as the Germans are the most inadequate hapless bunch I have ever seen. Their main type of attack is aiming. They never got to the pulling the trigger part of their combat training. Or perhaps they are to dumb operate on their own and require a specific command to fire their rifles. Most likely they know they don't have any real ammo, for they just shoot blanks in this movie.<br><br>Considering that these Germans managed to drive off the US forces earlier in the movie, this must say something about the quality of the US troops as well.<br><br>The Germans are interestingly dressed in almost every possible piece of uniform that they had from 1940 onward. Just look at the boots! Almost every type is present. It is a feast of merriment for anyone who is somewhat interested in the German army. <br><br>It looks to me that someone invited a bunch of re-enactors to play the Germans. Which must be true, because everyone, including the French dude, speaks English, which is lucky for the audience, because the Germans speak the most atrocious German I have ever heard. It isn't even close to German what they garble. Come on people, stick to English if you really can't speak a word of German, now you just look like the assorted bunch of pretending idiots that you are. <br><br>Almost everything is wrong in this movie, which has a Captain who is far too old for a field commission, a nurse who wears hair that is far too long and voluminous for the period, Germans who are too stupid to aim straight, Germans armed with assault rifles and machine pistols that they never use in the fight scenes(lucky for Rambo), Germans adorning their vehicles with very big German flags(which helps with the bombing). And on and on goes the list of foolishness in this dreadful piece of nonsense. <br><br>Is there any redeeming quality to this movie? <br><br>Well it is at better than Orcs!<br><br>Perhaps the movie would have been better with a Tiger tank in it? <br><br>Who knows.","user":"meritcoba","rank":[28,40]},{"title":"WWII POWs, nurses, suspense","rating":8,"date":"25 March 2016","review":"I love POW stories, not that this is a POW story per se, but the second half of the story does include that. The mental dynamic of soldiers from opposing sides in the same physical and mental space is always fascinating to me. Nice inclusion of army nurses too, which felt realistic and made this film stand out as something different. Good performances and directing. Starts fast, but slows down a bit in the middle. Strong end. Clearly an indie, but worth it. I know this doesn't count as the actual movie review, but the Behind the Scenes Making Of was interesting and well done. It's on the DVD. I definitely recommend, but don't go into it expecting a Saving Private Ryan big budget blockbuster.","user":"kellyq12","rank":[9,11]}]