[{"title":"Basic Idea Executed With Little Flair (Minor Spoilers)","rating":3,"date":"11 November 2016","review":"I saw the potential for a good horror film here. Hot young cast; creepy asylum setting; Jen and Sylvia Soska! I ended up importing the DVD into Aus from Amazon Marketplace. It arrived today. I was so excited. So what went wrong?<br><br>The opening kills were just weird. I mean, what was that guy doing taking his wife and newborn son into an abandoned mine? I suppose we needed a dead body for our hot young cast to find.<br><br>The five \"bickering college friends\" were probably asked to do a bit too much with the script. I really thought they were ad-libbing a lot of dialog. And some of it was pretty lame: \"I like my face.\" Yeah, nothing's gonna happen to HER face...<br><br>The editing felt weird too. Lots of abrupt cuts and transitions, confusing location changes.<br><br>In the \"pros\" column, the bad guys were creepy and threatening, there were a couple of real cringe-inducing torture scenes, and 34 year old Sarah Lind can still pass for a college student. Not a lot to recommend here though.<br><br>Oh, and as far as I can tell, none of the film takes place in an asylum.","user":"bradley-g-lang","rank":[6,6]},{"title":"Gorier Wrong Turn copycat.","rating":4,"date":"15 October 2016","review":"Surprisingly enough, I rated this a 4 stars! But here is why: the actors did OK overall, I do believe it was the characters that had problems and not those on set. A lot of blood, plenty clichés, those lovely situations where our heroes could die, but of course they are given all the time in the world to escape and save the day. <br><br>If you compare it to other movies, like Wrong Turn, The Hill Have eyes, this one will fall flat. It looks cheaper, it uses the same moves you've seen 1000 times, perhaps C+ movie at best. If they tried better with the development of the bad guys, I think we could have been in for a good ol' B horror. Close but no cigar. <br><br>Overall, for a very boring night, it could fill up some time in a somewhat, meh kind of way. Just go without expectations and be ready for a plot that was written too many times already.<br><br>Cheers!","user":"gothic-fiction","rank":[10,13]},{"title":"Worst Director of All time!","rating":1,"date":"16 November 2017","review":"What a laughable waste of time. This stuntman turned wannabe Director seems to be driven more by the ego of directing then possess any professional skills needed to construct a watchable film. <br><br>I hope he is a better stuntman then Director but then Canada has very good unemployment benefits I understand.","user":"jeffrocks-29276","rank":[3,5]}]