[{"title":"Another biopic that sacrifices analysis of character for emotional tension.","rating":5,"date":"15 May 2018","review":"Colin Firth takes lead in this incredible story based on true events of amateur sailor Donald Crowhurst's attempt to circumnavigate the globe single-handedly on his self-designed trimaran, as part of the Sunday Times Golden Globe race. Under the pressure of a publicity agent hyping his story to exceeding proportions, expecting sponsors and the self-applied noose of possible debt should he not finish the race, mounts the struggle of Donald Crowhurst to the highest proportions.<br><br>Giving this movie its backbone is the heavy emotional weight throughout, director James Marsh turns an otherwise quite controversial person and event into a sympathetic and quite touching story. It's a story that today needs to be told more, one of the pressures that men face and their inability to talk out about them. It's this coupled with the terrific pacing and structure of The Mercy that allows the audience to connect to Donald Crowhurst, as a dreamer and as somebody who had misfortunes that he was unable to deal with alone. It's only reinforced by the excellent performances given by Rachel Weisz and Colin Firth, that add a much-needed soulful and human touch to the film and grounding it for the audience, whereas a misplaced casting choice might have resulted in a far less captivating story.<br><br>However, while the story is one that is sure to hold a sympathetic gaze, what the film fails to achieve and execute properly is demonstrating how truly isolated and consumed with pressure Donald Crowhurst was. The film needed more time, this would have allowed further scenes of Donald on the boat so that much like The Life of Pi or even Castaway the audience could have tapped into that isolation. Instead, the film edits back and forth the boat and Crowhurst's family, this does, of course, keep the emotional tension high but dramatically it is weak, never buying into Crowhurst's isolated madness it puts the film on a weak footing. This might not have been a huge issue if the story's focal point was elsewhere but it's not, the most crucial part of the story is the pressure and isolation that Donald faced on the boat, it sacrifices a highly layered look into Donald Crowhurst for its emotional tension. The film needed less time reinforcing emotional backdrop and more time heightening the dramatic point of the story.<br><br>The Mercy is a film that depending on what you came to see, you will enjoy it more or less. The emotional backdrop is orchestrated perfectly, never missing a beat and tapping the audience into the supportive and hearty theme but the dramatic focal point of the film is underplayed and does not do much in the way of aiding the audience in its comprehending of Donald Crowhurst.","user":"jake-young96","rank":[50,57]},{"title":"Why watch the dramatisation when you can see the real story?","rating":2,"date":"5 June 2018","review":"Watch the doco on the man and the race here:\nhttps://www.imdb.com/title/tt0460766/reference. <br><br>Way better than this. This really captures nothing of what it is like to be on the water alone. It is interesting we idolise the failure when the heroes in the race are so amazing. I feel sorry for the man, but what a crazy undertaking to take with so little experience. No one is really capturing what the real people are like. <br><br>The doco is amazing. I've watched so many times because the characters themselves are so incredibly different in themselves. <br><br>FYI, in this first race, it took about 9-10 months. Today, the record is shy of 43 days. This is usually contested every 4 years with the Vendee Globe, but there are always independent challenges. Truly amazing.","user":"buxbe","rank":[34,47]},{"title":"I didn't know the real-life story and I'm glad I didn't; it's a well-told, surprisingly moving bio-pic.","rating":7,"date":"10 February 2018","review":"Though it is highly speculative and certain implications it heavily makes may be either irresponsible or insensitive because of this, 'The Mercy (2018)' has the advantage of an interesting mystery that affords a certain dramatic license simply because of the perspective it portrays. It represents a rather captivating and ultimately quite tragic tale of man vs wild and, perhaps more acutely, man vs both our inner demons as well as those of the ones we leave by the shore. I didn't know the real-life story and I'm glad I didn't, because it certainly goes in ways I didn't expect. The pacey first act is fast, fluid and fantastically well-told, even if its montage style is sometimes slightly tiring, but the picture always knows when to drop its anchor so that the slower moments can hammer home the rather blind-siding sad soul at the heart of this surprisingly moving flick. 7/10","user":"Pjtaylor-96-138044","rank":[27,37]}]