[{"title":"Good fighting movie","rating":8,"date":"23 February 2020","review":"Great. Having seen the previous films this film lives up to its predecessors and it does well at delivering action packed excitement. Boykas character development was great.","user":"MR_Heraclius","rank":[37,38]},{"title":"Finally -- Adkins finds his inner Stallone","rating":8,"date":"9 April 2017","review":"Reviewers Notes: <br><br>1. If you arrived at this franchise late, you would be forgiven for feeling a little lost. But if you have seen the others, this new instalment is surprisingly satisfying.<br><br>2. For newbies, the original \"Undisputed\" (which starred A-listers) took an unexpected turn. Not uncommon for film franchises these days, later attempts to keep the franchise going involved smaller budgets and lesser-known stars. But here UNDISPUTED got lucky. A younger Scott Adkins found his ideal role in Yuri Boyka (much like Stallone found Rocky) and gave new life to UNDISPUTED in two back-to-back segments.<br><br>3. At that point, things get a little murky. For reasons that are not entirely clear to this reviewer, there was a long gap between the last instalment and this one. During that time, Adkins handlers gave him a series of odd B-movie parts, some of which (heavy sigh) were purely dramatic and had no fight sequences at all. The closest thing to a good MMA movie that Adkins did recently was NINJA SHADOW OF A TEAR. However, as the IMDb rating for that movie shows, it was still not in the class of UNDISPUTED.<br><br>4. AND HE'S BACK! Boy, nobody does Boyka like Adkins! Plus someone actually opened their wallets and spent some cash bringing this one to the screen. You have enough \"producers\" in the credits to start a football squad. David White, who penned the last two Boykas (also the sloppier SHADOW OF A TEAR) had help in developing the story from Boaz Davidson, a writer with a few dozen action hits under his belt. Interestingly (!) Davidson worked with Stallone on the Expendables franchise. Director Todor Chapkanov is new to the franchise but acquits himself well as an action director.<br><br>5. The narrative backbone of the story is a bit soppy -- this one could have been subtitled \"Boyka Gets Religion\" -- but thankfully it is used mainly as a plot device to keep the fight scenes coming.<br><br>6. There is a scene at the 40:00 minute mark where Boyka is training and another fighter tries to \"claim\" his punching bag. It is a short sequence but memorable.<br><br>7. Also clever is the way the film ends with Boyka back in prison. For most characters that would be a negative. But, and you will see this if you watch the series in order, Boyka THRIVES in prison! Is there a Boyka 5 coming? We can only hope.","user":"A_Different_Drummer","rank":[74,87]},{"title":"Fight movie with a heart.","rating":9,"date":"10 April 2017","review":"Boyka Undisputed was worth the wait. Unlike many fight movies this movie have a heart. This is one of the best fight movie of the decade and the best of the year, which had movies like Kickboxer: Vengeance which was an utter disappointment. <br><br>Moreover the character of Boyka has been molded so wonderfully that you can feel the pain of the character when he tries to smile and feel his rage in silence. <br><br>Scott Adkins has done an a wonderful job and Boyka is a piece of art. The best part is this isn't just a Fight movie... Every now and then there, when you are unprepared and unguarded this movie hits you in such soft parts that you might tear up too. <br><br>Nobody ever thought that Undisputed would later create an antagonist named 'Boyka' who would be loved so much that his name would come before the name of the actual movie i.e UNDISPUTED.","user":"xzing-1503","rank":[40,47]}]