[{"title":"Cute fantasy","rating":23,"date":"23 April 2014","review":"Now that her mother is deceased, Natalie Russo is running the L'agrifoglio (Italian for holly) Italian restaurant, and it is in trouble. But she has hired a new chef Mario who knew her family but is temperamental, and she has some changes in mind.<br><br>Mike and Charlotte Smith are about to celebrate their 40th wedding anniversary. Their son Nick is a successful architect who is not allowed to be creative or even present his ideas directly to clients. But he is up for the Green Bridge Award. He just went through a bad relationship with Jessa, and Charlotte wants to fix him up.<br><br>Natalie and Nick both throw a penny into the Hayward Fountain at the same time and the pennies touch. According to the woman who sold Natalie flowers, there is a legend about that fountain and having dreams.<br><br>Natalie and Nick both have the same dream, where they meet and find out details about each other which are real, even though they have never met. They dream about each other more than once, and Natalie start looking forward to going to sleep. She even puts on a sexy nightie so she'll be ready.<br><br>Nick ends up dating Lori Beth, who he knew when they were in school. She's perky but in an annoying way. They're just not right for each other. Then he gets an emergency call from Jessa. It's just a mouse. But it's a big mouse! Soon we see in Jessa the shallow, demanding attitude that apparently caused trouble between these two.<br><br>Meanwhile, Natalie starts making changes at her restaurant. This includes a new name, Russo's. She makes changes in the recipes handed down my her family. And she replaces the opera music (including what I believe to be that song Charles Emerson Winchester was whistling while playing poker) with annoying music that women seem to like, which gets played on what are called Triple-A radio stations. And Mario seems interested in her.<br><br>So will Natalie and Nick meet? Will Natalie's restaurant succeed? Will Nick win his award? Will Nick decide to quit his job? As one might expect, there are plenty of obstacles standing in the way.<br><br>Katharine McPhee does a very good job. She's confident and determined and so easy to like. We want her to succeed in everything she wants to do. Plus I know her from \"Smash\". The one negative is her bangs. She's not Zooey Deschanel, who can make that look work. But she is pretty, and her hair looks better later on.<br><br>Mike Vogel is unfamiliar to me but likable enough. But he and McPhee are so perfect together. No other couple in the movie gets it just right. The dreams where they are together are one of the best parts of the movie, with one exception where the relationship is no longer ideal.<br><br>Jessalyn Wanlim as Sharla, Natalie's waitress and best friend also does very well. She has a great personality and makes the perfect waitress. And no, she's not merely a lowly worker but has a relationship with Natalie that makes her more like a business partner. When needed, she can be the boss.<br><br>Joe Massingill makes a real impact as Joe, Nick's best friend and co-worker, who might join him in a new architectural firm.<br><br>JoBeth Williams does a good job as Nick's meddling mom.<br><br>And Lilah Fitzgerald and Dakota Guppy are so cute as Nick's nieces.<br><br>It's a worthy installment in the Hallmark Hall of Fame series.","user":"vchimpanzee","rank":[22,24]},{"title":"Hallmark Twilight Zone bliss!","rating":8,"date":"7 April 2017","review":"I was not looking for this movie, but only stumbled across it by accident. Once I figured out the premise, I was hooked. It's a magical fantasy, almost like a modern-day episode of Twilight Zone, yet without any of that show's morbidity. In My Dreams doesn't take itself too seriously, and it's clear that everyone involved had fun with the production.<br><br>I found all of the characters down-to-earth and sympathetic, even those who are only there to provide obstacles to the protagonists finally meeting. For instance, almost any other movie would have portrayed the two other women Nick spends time with as evil/psychotic, but this movie avoids that cliché. They're simply \"the wrong person\", not bad people.<br><br>In My Dreams has no heavy message, and it ends with a wide-open horizon of future possibilities. In other words, the screenwriters allow the viewers to decide for themselves just what they've witnessed and what the future might hold. The performers were all perfect for their roles. The only thing that could have made this movie better would have been a soundtrack by The Blue Nile. So to everyone involved in its creation and broadcast: Thank you for something different!","user":"stevewyzard","rank":[7,7]},{"title":"Well it wasn't completely bad...","rating":7,"date":"23 April 2014","review":"Before watching the movie, I had read a review (I forget which one exactly) that said McPhee and Vogel had really good on-screen chemistry. It was NO LIE. I literally could not stop smiling as I watched them interact in their dreams. Sure it kind of felt that the relationship was progressing really quickly, but I'll just chalk that up to the fact that neither was certain that the other was real (or if they would meet again) and also the soul mate card. The script itself wasn't anything spectacular but for some reason that didn't stop my heart from pounding every time when... <br><br>[**SPOILER**] Nick and Natalie were RIGHT NEXT TO EACH OTHER (in the real world) but the universe thought it'd be funny for them not to see each other. This happened SEVERAL times. Haha I didn't realize I was so emotionally vested in the characters but there you go. I'm a hopeless romantic. I was really disappointed with how little screen time there was of Nick and Natalie together (after finding each other) in the real world. Five minutes was not enough!!! It's about the journey and blah blah blah but come on! **END SPOILER**<br><br>So OK script, great actors, could have done with some better directing. A lot of scenes had so much more potential. Also I feel like there wasn't enough character development. <br><br>**SPOILER** I mean I know that Natalie learns to let go of the past and look towards the future, and Nick learns to believe in himself but that is pretty much the extent of it. Like I said before, there could have been more!!! The problem is that all the characters are pretty one- dimensional. Natalie's struggling with her restaurant and Nick's struggling with his bridge and his love life-- that's it. Sorry, for me it was too simple. **END SPOILER** <br><br>Personally I like films that aren't predictable, and In My Dreams is pretty predictable. But then it's Rom/ Rom-com so what was I expecting? But overall it was fairly enjoyable.","user":"ShariHappenstance","rank":[9,10]}]