[{"title":"Best movie so far for outstanding Liz Gillies","rating":10,"date":"6 July 2014","review":"Killing Daddy is an intense drama about a young girl, Callie, with deep psychological problems who wants revenge for what her father did to her and her mother. It's a beautiful, intense and also a sad story, well written and very well performed. Callie is played by Elizabeth Gillies and she really has done an amazing job. It's really impressive how she manages to play a very disturbed girl in a way that makes you relate to her and feel with her. This lifts this what otherwise would be a typical lifetime movie to a different level. Gillies is able to make Callie a versatile character both strong and vulnerable, and this makes it to me her best movie so far. It shows her potential to become a very big star in the future, no doubt about that.","user":"Frederique14","rank":[54,75]},{"title":"Average TV movie","rating":5,"date":"28 October 2016","review":"Don't read if you haven't seen the movie yet. Acting is almost OK but the story has many holes.It is watchable but not a great movie at all, ...<br><br>The guy who killed her dad is just too stupid to be real... Also I don't get it why did she have to burn the place down - she drew unnecessary attention. And then she even used her father's gun and left it with one bullet less in the house!! And then she is stupidly rude with father's lover, housemade.WHY???? I like the end, she's not crazy after all just pretending to get away from the charges of double murder... And one thing's kind of left in the air is;, have they confirmed another testimony ?","user":"culicmladen","rank":[5,5]},{"title":"villainy rooting interest","rating":5,"date":"4 February 2018","review":"Callie Ross (Elizabeth Gillies) is stealing and getting fired in her aimless life. She steals her petty criminal boyfriend Jake's truck. With nowhere to go, she decides to go home. Her father, who originally cut her off, had a vegetative stroke. Despite her stepmother Emma (Cynthia Stevenson) and half-sister Laura Ross (Tori Anderson)'s open arms, Callie sees an opportunity to seek revenge for her mother who committed suicide.<br><br>Trying to tell a story from the villain's side is always difficult and infinitely fascinating. It's different from other Lifetime TV movies in that the female lead is not a victim. In fact, I expected a tale of sexual abuse by the father. I guess it's interesting that it does not go down that path. It would elevate the stakes if the money amount is bigger. The style is strictly Lifetime TV. The switch does leave a confused rooting interest and resign this to a limited idea. Gillies has a damaged bratty beauty persona. She needs to spice it up with some more volatile violence. She needs to single white female this more.","user":"SnoopyStyle","rank":[4,4]}]