[{"title":"loose ends? Plot twists - more like a plot derailment!","rating":10,"date":"10 February 2019","review":"Don't waste your time - not a worthwhile movie.<br><br>I can not figure out how this poor attempt at a \"film noir\" got such a high rating.\nIt is short (1 hr 52 min) and wanders around at the beginning then rushes the ending with what the author must have thought was a plot twist. It is so rushed it leaves loose ends laying around.<br><br>The lack of a plot leaves me to believe that it was either the first attempt at a film or was on such a low budget the production could figure how to tie off the various open ends. The climax is so poorly constructed and rushed it doesn't answer what happened.<br><br>I started watching it because I went to Cal Poly; I wanted to turn it off after 20 minutes but my wife was doing the ironing and wanted to see if there were more shots of SLO,","user":"thegreatarranger","rank":[8,9]},{"title":"Stylish, insubstantial, disappointing","rating":4,"date":"29 March 2019","review":"As premises go, it's thin: Claire is a freelance investigator for the San Luis Obispo Country Department of Social Services who finds relatives and family members of those who die alone with no known heirs. (Aside: if the count government had such investigators, they'd be working for the probate court, but never mind). Claire is assigned the case of an unidentified murder victim known only as the White Orchid who was killed in a particularly grisly way. She is only supposed to identify the victim and leave the actual murder investigation to the police. Since Claire is a brunette who immediately presents as plain, timid, and inhibited, of course she dives into not only the murder investigation, but the identity of the victim, who was a stylish and (bi)sexually uninhibited blonde bombshell.\nJust because a movie's premise is thin and implausible doesn't mean the movie can't be good or even great: Hitchcock's Vertigo, which this movie alludes to several times with all the subtlety of a jackhammer tearing up concrete, seems similarly silly on paper, but delivers a great experience to its viewers in its visual style, great performances and direction, and a memorable soundtrack. White Orchid only has visual style going for it. Direction and soundtrack are undistinguished, while the performances are pretty bad, which isn't so much an annoyance as it is a puzzler, since many of these actors are capable of good or even outstanding work (an exception is Nichelle Nichols, who turns in a tiny gem of a performance as a shut-in retiree). It doesn't take long before the viewer realizes what this movie wants to be, and how far short of its goal it fell. You may stay with it for the (unfortunately predictable) plot twists, or you may turn it off before that. I stayed with it despite realizing I would be disappointed.","user":"bud-morans","rank":[10,12]},{"title":"just bad","rating":2,"date":"8 July 2019","review":"Incredibly brainless, not sure how this film made it to the screen, the main character is on a spectrum.\nthe only reason I gave it 2 stars because I like Jennifer Beals.","user":"Annaval","rank":[4,4]}]