[{"title":"My life before and after seeing this movie","rating":10,"date":"20 November 2015","review":"human.... <br><br>I know that my writing ( I am from Brazil) here is awful, but still I have to speak about this unique film. Before seeing it was easy to judge someone , it was easy to define love, fear, terror.... I thought that feeling something very deep in a movie was almost impossible, always artificial ... After watching \"humans\", I understand the complexity of what is to be a human, the beauty of what is love , I was moved like never before seeing a father talking about his son... Something very deep inside me has changed after watching this movie, something that is now open, and that is my view on the others, judging someone, for me now, is as simple as understanding love... <br><br>Thank you for showing me what being a human is all about...","user":"patrick-553-787683","rank":[57,62]},{"title":"The antidote to prejudice: Human shows how we're all connected","rating":10,"date":"21 November 2015","review":"My favorite film of 2015. Spanning dozens and dozens of countries and languages, Yann Arthus-Bertrand's Human is a mission to explore our humanity. The three-year project interviewed some 2,000 people and got them to tell their own personal, emotional stories about things most significant in their lives—love, war, poverty, happiness—things to which we all can relate. It's a masterpiece. And the entire film has been released online for free.<br><br>The format is simple. Clean, candid close-up interview shots spaced with gorgeous slow-motion aerials backed by a powerful score. It's beautiful. And it had me eagerly awaiting each new story to be told. I've heard it all before in one form or another. But the format makes it easy for us to listen—really listen—to so many people from so many different backgrounds. These stories here can echo so deeply and with such a strong feeling that we are all connected—if you choose to allow them. With this, the film is unforgettable.<br><br>This is a film that matters. It has no plot. No drama, no storyline, no action. And no celebrities—save José Mujica, the humble former president of Uruguay. It's simply a grassroots collection of short stories and vignettes united upon a theme. But it's the antidote to so many films that divide us, that reinforce the us-vs.-them dichotomy that enables us to prejudge, to define ourselves against others, and to resort to violence so easily.<br><br>I want to travel the world and know even more about others now.","user":"Birsay","rank":[33,36]},{"title":"A stunningly beautiful love letter to empathy","rating":9,"date":"26 January 2016","review":"Learning, to me, goes beyond understanding the mechanics of our environment. It includes the development of habits, such as introspection, critical thinking, and empathy. The moment we came screaming into this world, our brains started making sense of things. What is love? What is trust? What are other people?<br><br>Some of these things we learn not just by words or imitation, but through systems in our brain that have evolved to respond to particular experiences: seeing faces, experiencing touch, hearing the heartbeat of our mothers.<br><br>But as in any other category, we may learn the wrong things. Abuse destroys trust. Negligence withholds love. Separation stifles empathy. And over time, we need to reinforce our knowledge of love, trust, and empathy – like any other thing we've learned.<br><br>Yann Arthus-Bertrand's \"Human\" is a tour de force in exercising our empathy. Filmed in 60 countries, it is the result of interviews with more than 2,000 people. It showcases not only the diversity of humanity, but also the beauty of our planet through stunning aerial photography.<br><br>This is an intense work. It requires setting aside time and mental energy to take in the stories, which are often heartbreaking. You will hear the stories of people living in abject poverty, people who have lost their entire families to war, women who have been raped, killers who have been forgiven, and humans of all ages who have endured shameful prejudice.<br><br>Tales of heroic endurance and the relentless pursuit of happiness, education, justice – those are the most uplifting moments in the film. A film like this might risk falling into a kind of moral relativism, a mere celebration of diversity. But \"Human\" returns to the call for justice throughout.<br><br>One Indian man tells the story of how the victims of water shortages are helping to construct a twin tower with 76 swimming pools to be enjoyed by the wealthy. He says he is furious because the connection between inequality and its effects is so apparent. A destitute old woman yells at the camera, calling us all to account for ignoring the suffering of the poor.<br><br>In another scene in between interviews, we see a vast array of skyscrapers lit at night. From afar, they look gorgeous, an incredible show of light and architecture. Then the camera zooms into one of the buildings, and we see office cubicles, lonely workers, a soulless, sterile environment.<br><br>\"Human\" does not give us an answer to injustice, inequality, poverty, waste, war. It reminds us powerfully that there is a question here: If we care about one another as human beings, what do we do now?","user":"xirzon","rank":[24,26]}]