[{"title":"Good story, not about the deep web","rating":7,"date":"11 August 2015","review":"I really liked Alex Winter's Downloaded, as I thought it gave a very good synopsis of the Napster story. When I saw that he was doing one about the deep web, I was pretty stoked, especially sine this is a subject that is in it's early stages, unlike Napster. I heard Winter on Adam Carolla's podcast talking about it, and he spent most of the time talking about the Ulbrecht trial, which I was unfamiliar with. Still, since Ulbrecht was a major figure in the deep web, I thought it was going to be a substantial part of the documentary. I was mistaken. Ulbricht's story comprises 90% of this documentary, with various opinions on the war on drugs comprising another 8%. The remaining 2% actually talks about the deep web, and that merely serves to provide a framework and reference point for Ulbrecht's story. I hope that someday there will be a documentary about the deep web that isn't about one particular story or person, unfortunately this isn't it. That said, this is still really interesting, especially to people who have never heard of Ulbrecht's case or the deep web in general.","user":"Magnotta43","rank":[39,43]},{"title":"The Government vs Ross Ulbricht","rating":8,"date":"1 June 2015","review":"As someone who is very interested in current events, politics and world history, I'm somewhat ashamed to admit that I did not know anything about Silk Road or had even followed the trial of Ross Ulbricht. <br><br>Yes, I did read the headlines announcing the verdict but it was only after watching this fine documentary did I learn about the trial and the issues surrounding Silk Road and the charges against Mr. Ulbricht. <br><br>The \"facts\" are placed in context and many questions remain but what is presented in this film should be seen by all Americans and people seeking justice. This film is a must see even if it's only to get your footing on where Internet technology is heading and the dangers that lurk out there for all of us. <br><br>Again, this is a \"must see film\" and I implored everyone take the time to view this film.","user":"wleongittens-1","rank":[61,74]},{"title":"The Deeper Web","rating":8,"date":"7 June 2015","review":"As I write about cybercrime and cyber security, I took a special interest in this film. It is far different from the usual fare. In the usual cybercrime movie, there is always the scene where the hacker-hero sits down at a keyboard, begins typing frantically away, then turns to his eagerly awaiting colleagues and says something like, \"okay, we're into the Pentagon's computer network\". If only life were so easy. The movie may be good in other aspects, but the hacking scenes don't usually hold up.<br><br>Documentaries on cybercrime are a bit different. Some of them are quite good, though they often come with an angle. By this I mean that they are not really trying to be objective, they are trying to make a case. In The Deep Web, it is clear early on that Alex Winter has an angle. The angle is that the deep web, the Silk Road, and Ross Ulbricht have provided a valid, honest service that does not undercut social values and, in fact, may have re-invigorated them. On the surface, this might seem like a difficult case to prove, but, to his credit, Winter does a remarkable job. <br><br>Winter portrays the deep web as a new cyber nation where anonymity, freedom, and relief from the burden of government surveillance can thrive. It is, or can be, the true libertarian utopia. Although the film is hyped as being narrated by Keanu Reeves, he actually has a limited role. This is more of a marketing ploy than anything. In fact, a significant part of the film is carried by \"consultant producer\" and Wired magazine writer, Andy Greenberg. Greenberg was the first person to actually interview Ulbricht when he was only known as Dread Pirate Roberts. He believes that Ulbricht was sincere in his libertarian philosophy and truly felt that an open drug market would reduce the violence that was connected to illegal drug use. You'll have to decide for yourself if Greenberg and Winter makes a good case for Ulbricht or not. <br><br>Winter does try to balance his pro-Ulbricht stance with interviews of various law enforcement officers connected to the case. There is some good and somewhat rare footage here of interviews with Ulbricht's lawyer, Joshua Dratal, Ulbricht's parents, and some of Ulbricht's friends and admirers. There are even some home movies of Ulbricht himself that show he was more than just a drug dealer looking to make quick money. The one interview lacking is the one of Ulbricht himself. <br><br>The crux of the film, at least for me, was the insinuation that Ulbricht received, to put it lightly, something less than a fair trial. He makes you wonder about two key points: the objectivity and competence of Judge Forrest and whether or not Ulbricht was railroaded. At times, Winter makes you wonder if there was not some sort of collusion between the prosecution and the judge; they just seemed to work so well together. Again, you can decide this for yourself. <br><br>If there is one weak point in this documentary, it is trying to portray Ulbricht in too positive a light. I have read his Tor chats, even the ones he released after his sentencing to show that he was not only concerned about making money. From these alone, you can see that Ulbricht is not the aw shucks, golly gee, kid next door that Winter makes him seem to be. In short, like everyone, he has his positive and negative characteristics. That said, this is a good documentary and one that should be watched. <br><br>I would recommend The Deep Web to everyone, even those who do not know much about the deep web, Ulbricht, or cybercrime. Winter makes the viewer consider the basic values that have created America and whether they have been dismantled to build something other than a free society. It could be that the Ulbricht trial was the crucible in which these fundamental American values were put to the test. Overall, The Deep Web is a first-rate documentary. Go see it. It will certainly give you a lot to think about.","user":"SteveMierzejewski","rank":[47,56]}]