[{"title":"Well acted and atypical gay couple story...","rating":8,"date":"20 December 2018","review":"Australian gay drama about a hunky, good looking, straight acting, successful gay couple who desperately want a child. The two leads are very good actors and totally convincing as a non-stereotypical gay couple. Lots of drama and uncomfortable scenes unfold after they get involved with a very troubled pregnant woman who doesn't want her child. The ending makes a political statement about the legality of gays adopting. High production values and very believable acting. At times, it was almost too real. Likeable characters except....please STOP the smoking. It's unhealthy and low class!!!! It's rare that gay characters are portrayed as non-smokers.","user":"ohlabtechguy","rank":[4,4]},{"title":"Not your usual story","rating":8,"date":"20 October 2018","review":"This film is a first class attempt at a dramatic story involving two men wanting to create a family. One enthusiastic the other very unsure about this idea. And is that situation so very different from the common place male/female story? No - it is not.<br><br>Due to social/political/religious indoctrination of \"society\" our two main characters are forced to take a dangerous path to accomplish their goal. The true message within this film is the oppression of social convention when two people of the same sex have the dedication and means to adopt a child and are rejected.<br><br>This film is good - not great - but worthy of anyone's time to gain an insight into a major part of our society and what they can offer but are rejected because they don't fit the social norms prescribed by the culturally religious dictates of society.","user":"cekadah","rank":[4,4]},{"title":"Loved it","rating":10,"date":"21 January 2017","review":"It's not an usual movie, it has a unique plot... a gay couple who re trying so hard to have a baby , adopting a child from a desperate young woman, who's return with a dangerous new boyfriend, threatens to destroy everything and abusing her.<br><br>I believe it is a worth watching movie, Alex and Steven are both very handsome and they fit perfectly together. The scenes with them are full of affection and love, they re very good actors and made a great job. If you have time give it a chance.<br><br>It is a very good attempt to make a beautiful and excellent movie, if it was succeeded is up to you.","user":"Demian_Ds","rank":[15,27]}]