[{"title":"PLEASE - no more of these","rating":1,"date":"13 February 2014","review":"All I can say is this is dumb, dumb, dumb.<br><br>I was one of the gullible who wasted two hours of my life watching this move.<br><br>The plot has so many holes, it would seem to be written as a class project in a 3rd grade class.<br><br>The acting is mundane.<br><br>I laughed at how simplistic this whole thing was.<br><br>I watch Hallmark quite a bit and this is the very worst \"movie\" (if you can call it that without laughing) that they have ever aired.<br><br>If I ever see the group in My Gal Sunday come back as another lame movie, or heaven forbid as a series, I will avoid it at all costs.<br><br>Completely unbelievable and sophomoric.<br><br>What in the world was Hallmark thinking when they televised this?","user":"lfseale","rank":[12,17]},{"title":"Snore Feast","rating":2,"date":"25 January 2014","review":"Boring show no chemistry between the two leading characters. They seem to be just saying words not revealing any emotions at all. Realize that they are soap opera stars but good grief even some of they can act. There is more chemistry and emotion between the father and son-in-law than in any one else. I am trying to get thru the rest of the show but I find myself getting bored and I start to play games on my tablet instead of watching the show. The very beginning was not plausible, bringing a convicted prisoner to a home residence to reveal the real killer just wouldn't happen. The male actor was goofy and the female actress just can't act at all. The kidnapping was pathetic, the couple sat there in a stupor and then when they awaken they are all huffy and confrontational and arrogant. Let's face it if you were kidnapped would you be arrogant. Then above all else they call the President of the United States for help as if he would have the time to do anything to help. After all the previews I have seen prior to the show I was looking forward to seeing a good who done it, but this isn't it.","user":"lbowles639","rank":[12,17]},{"title":"Younger version of Hart to Hart","rating":2,"date":"26 January 2014","review":"My Gal Sunday is a movie that might appeal to those between 18 and 40. It is a crime fighting drama. Cameron Mathison seems to act very little in this movie. Actually, overall, I found the acting poor; the plot weak; the drama barely there; and a high predictability of the outcome. I think the crime fighting couple is supposed to be a younger version of Hart to Hart. Seen it. Done it. At least with Hart to Hart there was good acting and plots. This is a filler movie. Fills the time and provides very light entertainment. I would like to see Cameron Mathison in something other than his character in All My Children. He is a nice looking guy and I am sure he is capable of characters with depth. Popcorn all around here. It will help to keep you entertained.","user":"jfarms1956","rank":[7,9]}]