[{"title":"Welcome A New Action Star To The Club - Marko Zaror !","rating":8,"date":"12 August 2015","review":"Action fans may remember Marko Zaror from \"Undisputed III\" . If you loved that movie and other great martial arts action films of the recent past like \"The Raid\" or \"Ninja II\", you will definitely enjoy \"Redeemer\". Marko Zaror further proves how underrated of an action star he really is in this solid B-movie which features wall-to-wall action packed, violent fights from start to finish that will have you saying holy sh*t at least once. The action and fights are inventive and feel fresh, gritty and realistic compared to most PG-13, shaky cam and CGI bloated action films that come out of Hollywood. Fans know that in these types of low budget B movies, story/character typically come secondary. surprisingly enough, the story is engaging and plays out like a classic western. The character is also given a little more depth and back story than you'd typically expect. This is one of the best and at the same time least known action movies you will see all year. Fans of such modern action stars like Scott Adkins, Donnie Yen and Tony Jaa. Welcome Marko Zaror to the club as he proves he can kick some serious ass. Overall, for the real action fans out there, your faith in modern action movies just may be redeemed after watching this !<br><br>8/10","user":"ActionFan-Reviews","rank":[19,26]},{"title":"Watch This Movie and You Shall Be Redeemed!","rating":9,"date":"29 August 2015","review":"Redeemer (2014) is fantastic.<br><br>It is missing the Hollywood bells and whistles, and has a low production cost, but that does not make a movie watchable.<br><br>This movie is watchable and has a somewhat mysterious hero. We see glimpses of his past as the movie unfolds, to see what made him the Redeemer.<br><br>This is a solid action movie, which I always search for. I want those awesome 80's action flicks back. Small budget gems like Perfect Weapon and No Retreat, No Surrender 1-3 and so on.<br><br>This movie while not in the same vain, as it is somewhat serious throughout, makes me happy that Chile, can produce movies, that Hollywood forgot how to make. The acting is okay, but we are here for the really nice fight scenes. Very well done! <br><br>I gave it a 8.5 out of 10! Very surprised and happy I gave it a shot, and you should too.","user":"Dark_Lord_Mark","rank":[13,24]},{"title":"Redeeming Features","rating":19,"date":"19 October 2015","review":"REDEEMER is a Chilean action film, which isn't something you see often. The story is a classic Western: a hero with a dark past (and an impressive amount of Catholic accessories) comes to a small town being oppressed by drug lords and naturally decides to clean house one drop- kick to the face at a time. The locations are lovely - with plenty of Instagram style colour tints - and the narrative commendably brisk. The only problem is that the hero remains too much of an enigma and as a result there's a lack of emotional connection; it's cool to watch but you don't feel anything except during the most gruesome kills (thankfully these are largely set up and then happen off screen). It doesn't help that the guns are all CGI enhanced, meaning they lack any physicality. Still, the martial arts action is fantastic, with really well though out back-and-forth combat and stuntmen (including the hero) skilled enough that the scenes can play out in single steady shots which let you appreciate the skill on display. It's a small film but a good one and if Hollywood has any sense they'll be hiring the people who made this for a big budget remake.","user":"YohjiArmstrong","rank":[3,5]}]