[{"title":"Who's in Charge Here?","rating":8,"date":"15 April 2014","review":"Greetings again from the darkness. Definitely one of the best documentaries at this year's Dallas International Film Festival, this is one detailed and informative expose' that focuses not just on bad guy Whitey Bulger, but a seemingly corrupt system that allowed him to maintain his power.<br><br>Joe Berlinger is an award-winning and very prolific documentarian, and he certainly goes all in here with an overwhelming amount of information, detail and speculation. The film begins with the 2011 arrest of Whitey Bulger after 16 years on the lam. We then explore the trial, as well as the background of Bulger's 30 years of power in South Boston (after his release from Alcatraz).<br><br>The interviews are fascinating. We get first person responses from attorneys, thugs from the Bulger syndicate, as well as many of the victim's family members ... some still so desperate for justice after decades of pain.<br><br>The Bulger defense team claimed immunity due to his status as an FBI informant. Of course, this claim opens up the real intrigue here ... how deep did the corruption go with local law enforcement, the FBI and the judicial system? Was Bulger empowered by those who should have been protecting the citizens and pursuing him? Many questions are asked, and the likely answers do not quell conspiracy theorists.<br><br>While some documentaries seem a bit thin as they stretch material, Mr. Berlinger's approach is to supply much information, many details, and an endless stream of interviews ... all to force us to wonder if Whitey Bulger's reign of southie crime was permitted, even encouraged, by those we thought were the good guys.","user":"ferguson-6","rank":[17,19]},{"title":"The Departed times Reality","rating":7,"date":"9 July 2014","review":"James J. Bulger probably is the greatest mobster who ever lived, ending up as the second most wanted fugitive right next to Osama Bin Laden on the FBI's list. He survived 25+ years on the crime-ridden streets without even a slap on the wrist due to—you guessed it—bribery. The potent gangster's wits never failed him until the very end; he had other fellow mobsters doing most of his dirty work like murdering countless people that found themselves involved in this monumental mess of a business in one way or another—they got whacked because they didn't abide by the Bostonian mob's rules. Not to mention, there were the innocent such as Stephen Flemmi's (another mobster by Bulger's side) girlfriend who simply chose to call their relationship off, and boom!—she was deadbecause she couldn't be trusted anymore. <br><br>See, this crime ring began to far outstretch its original scope as the FBI, themselves, came into the fold and started covering up the numerous nefarious acts committed by these heinous criminals for favors like protection or a nice wad of cash into the pocket. Everything was covered up; everyone continued with their respective business, and everyone protected each other and let nothing slip until the eventual downfall materialized. Suddenly, several mobsters were revealed as FBI informants, and the government agents and gangsters started ratting out on one another, culminating in a colossal display of pure chaos. <br><br>This intriguing documentary adopts a crime-thriller style (oftentimes resembling the tone of a film this history actually inspired: The Departed). Acoustic guitar music plays in the background as the true depth of this whole scheme—the chilling ties between the government and the menacing wiseguys out and about in our streets—unravels. An abundance of information and interviews with highly significant figures in this horrific matter flesh out an incredibly compelling and scary story of America's troubled past—of a corruption that streams not only through our transparently wicked but also through those who've promised to serve and protect us. The smell and appearance of money tempts and is never rejected by any human being, and that is the frightening point that is expressed herein: \"anyone is prone to corruption\" as the film strongly emphasizes. There is no escape from the toxic system we've built and deeply dug ourselves into—the depravity of capitalism will persist 'til the end of days. <br><br>In terms of documentaries in general, this will be a very entertaining experience for anyone even though it occasionally gets wrapped up in its somewhat sophisticated presentation of facts, terminology, and the multitude of individuals involved throughout this shameful era. Whitey: United States of America v. James J. Bulger also interestingly does something I see all too rarely in documentaries: even those who you witnessed being interviewed in-person somewhere during its duration unexpectedly meet their deaths in the coming months and years as the narrative proceeds, excellently showcasing the extent of time the filmmakers dedicated to this project and the refreshing unpredictability that comes with it. Overall, this thrilling account will allow you to look through two equally felonious perspectives (that are supposed to be operating on the exact opposite sides of the law, mind you) that first support each other but then come to a clash as all things do: the mob circuit and the US government. If that premise doesn't fascinate you, I have no idea what will.","user":"FilmMuscle","rank":[11,15]},{"title":"Winter Hill Unveiled for all","rating":8,"date":"6 September 2014","review":"Outstanding work, original directing, well researched, and pure subject matter. Although I do not agree with every insinuation in the film, it is none the less presented very well. The editing is the real star here which makes the court room dialog's a pleasure to watch. The interviews are personal and enthralling, you can actually feel the victim's emotions. For a long time there was not much information on this subject (for obvious reasons) and now we have several decent documentaries. If you are interested in Boston's organized crime legacy then this picture is a must see!<br><br>I am glad Bulger was caught, and he got what he deserved. I hope this can bring piece of mind to many of the families of the victim's he affected. Watch to see what became of several of the Bulger associates I think you will be surprised to learn some of the deals that were cut after the trials!","user":"vegaxterror","rank":[7,9]}]