[{"title":"Ho comes between bros","rating":8,"date":"28 April 2015","review":"A sadist and a masochist record their killing spree, but things change when the sadist falls for a willing girl.<br><br>Interesting film, but classed as romance so horror fans might not give a thumbs up. <br><br>Some very good scenes of violence. The opening sequence is surprisingly effective, with a nasty end for the late Karen Black. The Rachel sequence is good too, but in the end not as effective as, say, the final scene in Looking For Mr Goodbar.<br><br>The triangle is a common pattern of behaviour, so if you think of the killing spree as the dating scene you get a fairly straightforward story. The masochist's story sort of trails off - a fictional alter-ego? So when told to eff off, maybe the divided self is reuniting.<br><br>A lot of dialogue, some of it pretentiously post-modern, with unfocused undirected shots that sometimes drag on. And there's back story, but not everything gelled well. Hell.<br><br>The editing was sometimes excellent, and the sound and music were good - although I didn't get the point of the Suicide vinyl tune. Good performances too - but white girls still can't dance.<br><br>Overall an uneven mix of self loathing, love, and the nature of putting things on the record. Interesting and well done.<br><br>ps. Still thinking about this film 10 days later - even better than I thought, so +1.","user":"begob","rank":[7,15]},{"title":"Wild VHS/Found Footage","rating":8,"date":"29 July 2015","review":"While it seems weird and sometimes while you are watching this you may forget about it, the movie is shot in \"Found Footage\" kind of style. But let's start from the beginning. A very disturbing beginning that had me chilled. Not because of a loud noise or something big happening, but the creepiness of what was shown on screen.<br><br>The goal of the movie is to creep you out and it does a very good job. Even if you don't like the themes (or the acting for example), you can't fault the technical aspects of the movie. Someone really thought through what they were going to do. Even so, you might be confused and irritated and might not like what you see. But the movie does not aim for liking it as I already stated above.<br><br>It might be slow most of the time, but the mood it creates makes up for that. It's sadistic to say the least and tough to watch. Creatively speaking I was more than surprised what I got to see. There's nudity and intercourse, but it's not about those things. It's about detachment and losing ones mind ... portrayed in an excellent way.","user":"kosmasp","rank":[7,16]},{"title":"A violent and perverse cinematic drug  Los Angeles as blissful post-millennial wasteland  A nightmarishly blistering debut","rating":9,"date":"10 December 2015","review":"Have you ever been in a movie theatre with an audience that burst into spontaneous and rapturous applause? How about following the punchline of the film's opening scene? I have, twice.<br><br>The first in 2003 during a preview screening of Kill Bill Vol. 1 in gleeful response to Tarantino's audacious gunshot to Uma Thurman's head.<br><br>The second occurred this past summer in Madrid during a film festival screening of Wild In Blue. And while the opening moments of this film also features a character with a gun to their head, it's made perfectly clear that Writer/Director Matthew Berkowitz has an altogether different kind of sucker-punch in mind.. and when the trigger is finally pulled - as was the case with Tarantino's film - he's got you exactly where he wants you.<br><br>The \"where\" is inside the twisted mind of Charlie, a kind of post-millennial Travis Bickel, acting out a disturbing manifesto all his own that involves the making of a film and the seduction and murder of a series of beautiful women.<br><br>I can only speak for myself, but I assure you that the Taxi Driver comparison isn't made lightly. While sitting in the theatre, it felt as though I was experiencing a post-millennial incarnation of Schrader's antihero, on a journey not through the grime of Scorsese's New York, but rather through the blissful wasteland of Los Angeles as seen through the narcotized lens of Gaspar Noe, or perhaps Nicolas Winding Refn. But while Bickel's disillusionment was a product of a politically and socially turbulent period in American History, Charlie's seems to have been instilled at birth (..to close this reference: Charlie is the product of the Travis Bickel generation). And fuelled by his own existential angst, parental failure, and an increasingly narcissistic and self-destructive culture, Charlie uses the God-like tool of cinema to create a privately defined world all his own, operating under the guiding principles of absolute control and total destruction. <br><br>Therein lies the brilliance of Wild In Blue; it is a film of contradictions. At once beautiful and brutal; blissful and jarring; sexual and sadistic; cerebral and kinetic. Moments of brutality punctuate those of sexual fantasy, while Charlie's existential stream of consciousness finds itself framing scenes that play as beautifully hypnotic tone-poems — albeit of the depraved, nihilistic variety.<br><br>If you've read the film's synopsis, you'd be forgiven for assuming Wild In Blue is an exercise in horror filmmaking (likely another entry in the slasher or torture porn sub-genres). And granted, there are fragments of these sub-genres to be found therein, but in reality Wild In Blue is as much a horror film as Drive is an action film or Taxi Driver is a revenge film. Such a premise acts as the jumping off point for something far more subversive; existential. Simply put: Berkowitz has far too much raw talent at his disposal, and a maniacal vision he's hell bent on seeing through to the end of Charlie's twisted story. It's clear that he adores the medium he's playing within; he has no interest in conforming to the increasingly generic and sanitized HBO inspired-cinematography that pervades the current filmic landscape; his is a camera infused with an intelligence of its own; wandering with an uneasiness that mirrors the intensity and unpredictability of his protagonist. <br><br>He's made a film brimming with mood and atmosphere; with tension. One that's intensely colourful and inventive, shocking and darkly humorous, sexy and menacing. And thanks to a stunning performance by Frank Ceremack, the same can be said about Charlie. In what could have so easily become a caricature of evil.. a ghoulish Patrick Bateman, Ceremack delivers an unhinged tour-de-force. It's his go-for-broke commitment to exploring the darkest depths of human existence that gives the film its soul; thanks to Ceremack, Charlie is a menacing and devastating anti-hero for the post-digital age. <br><br>The aforementioned references — particularly those to Noe, Refn and Schrader — will likely be apparent to fans of those auteurs' work while viewing Wild In Blue. But Berkowitz isn't recording a covers' album. With Wild In Blue, he manages to subvert expectations and carve out a path all his own. His is an aesthetic the equivalent of the late 70s/early 80s infused post-punk that scores the film; an attitude of reckless abandon, dripping with a nostalgia at once blissfully euphoric and violently crushing. He's got style to burn.<br><br>(A final note, in reference to my introductory statement: since most viewers won't have the advantage of experiencing Wild In Blue on a theatre screen.. do yourself a favour and watch this baby in the dark and PLAY — IT — LOUD).","user":"DigitalSixx","rank":[4,9]}]