[{"title":"This 'queen' will surely rule your hearts! <3 <3","rating":9,"date":"7 March 2014","review":"Wanna experience a hot air balloon ride? If not literally, Vikas Bahl's 'Queen' will surely give you the feel! This one too takes off after fire of strife but gradually zooms up in the air higher and higher, all liberated from the shackles of earthly rules and grief. 'Queen' is a journey of discovering oneself. Simply put – \"When things go wrong, cry not; gather your guts, not just move over but fly!\". A more detailed analysis follows:<br><br> Plot: The plot resembles Gauri Shinde's 'English vinglish' in its theme but it is the execution and premises which makes 'Queen' more exuberant. While the former was poised and mature, this one is raw, yet sensitive, sensible, effervescent, all at the same time. How an otherwise banal story on paper could become so entertaining on-screen, only Bahl can tell. He injected the same positivity in his debut venture 'Chillar party' earlier. Another endearing fact is the handling of 'haww'-type (by Indian sanskriti standards) cheeky humor gracefully enough to make it watchable with family. Dialogues by Anvita Dutt and Kangana (yes, she has contributed here too) are pertinent. Despite lot of French and little Japanese here &amp; there (with no subtitles), you don't mind as the situation and emotions say it all. Dilliwali Punjabi lingo, though, adds credibility. Heartiest congratulations to Anurag Kashyap and Vikramaditya Motwane for shelling put money for such a cinematic delight!<br><br> Cast: It is out and out Kangana's film, with all others in supporting role. Bahl is believable in saying he penned Rani's role keeping only her in mind. No other actress would have better lived the vulnerability, innocence, craziness, elegance and emotions of Rani, the way Kangana did. This movie will definitely mark as a milestone in her career and give all reasons to other filmmakers to look beyond her fashionistic persona. Donning demure, no make-up, plaited look and wearing kurti with sweaters, she looks perfectly the Indian girl next door. At the climax too, she looks glamorous not out of the dress but the confidence she wears! Full marks to casting directors as all actors play within the skin of their respective characters, be it the confused Rajkkumar Rao, Rani's family (Dadi is esp. lovable), sensuous smart Lisa Hayden or Rani's endearing firangi friends.<br><br> Cinematography: On Rani's canvas, you get to move from rues of Lajpat Nagar to the majestic Eifel Tower to the picturesque bridges of Amsterdam! Kudos to Siddharth Diwan and Bobby Singh for the awesome camera work!<br><br> Music: Amit Trivedi is a winner all the way. Already hit \"London thumakda\" gives way to \"Ranjha\", classical pop 'Badra bahaar' and 'O gujariya'. However, it is the remixed \"Hungama ho gaya\" from 'Anhonee' (1973) rendered emphatically by ever boisterous Asha Bhosle, which stays with you even after you leave the theatre. Songs are nowhere a speed- breaker in this flick.<br><br> Flaws: I failed to find any. :)<br><br>The film ends with a confident rejuvenated Rani thanking her betrayer for giving her the opportunity for self-awakening; we as audience thank the director for infusing optimism into the minds and hearts of esp. female watchers. Go ladies, this one's the best Woman's day gift you can give to yourself. Men too will surely enjoy it for all its youthfulness. It's a movie for all. HIGHLY RECOMMENDED.<br><br>My rating: ****1/2 (my favourite in the last 1 year)<br><br>P.S.: Ending credential FB ishtyle are not to be missed!","user":"Swapnilagarwal","rank":[123,139]},{"title":"This QUEEN is ROYAL in every way!","rating":10,"date":"8 March 2014","review":"QUEEN is directed by Vikas Bahl, starring Kangana Ranaut, in the lead role, along with Rajkummar Rao and Lisa Haydon.<br><br>The film revolves around Rani (Kangana Ranaut), an innocent Punjabi girl, who gets dumped one day before her wedding day. She gets an idea to go on her honeymoon all by herself, and that very trip shows her road to self-empowerment while going through several comical situations...<br><br>The trailer of Queen didn't quite attract much attention, therefore, the film was extremely underrated by several critics, including me. However, the songs did grab a portion of my attention, so I was curious to know whether I was looking at Queen from a wrong angle. The film, itself, faced fierce competition from Madhuri-Juhi starrer, Gulaab Gang and the much-awaited Total Siyapaa. However, the reviews came in for the three films, and I was shocked to see so much praise for Queen. So I decided to go with the critics and chose Queen over Total Siyapaa that weekend. And I think its safe for me to say that it is one of the best decisions I've made in my life (and it might be yours too).<br><br>Queen starts off in the most mainstream desi way possible. The Big Fat Indian Wedding with relatives at every nook and corner and dance to Punjabi tunes is galore. The calling off of the wedding takes place and you feel yourself going through the very same events as Rani. This is due to pure direction and acting. However, the film takes a VERY sharp turn when she leaves for her honeymoon. Rani meets new friends, goes through life how a woman should, and I think it was a smart move on the director to release it on Women's Day, because at the end of the film, the message is pretty clear. However, I shall not go on further about the plot, because after she leaves India, its all just fun.<br><br>The acting is just top-notch. Kangana Ranaut, in all honesty, carries the film on her shoulders throughout the 2h30m run time. She portrays her character with such finesse that she deserves awards and utter praise for it. Rajkummar Rao played a great job as well and the rest of the foreign actors were just delightful and splendid to see.<br><br>The songs are great as well. Amit Trivedi also deserves applause for the great music as well as background score. Every single song captures a theme of the film and just blends perfectly with the several scenes in the film. It helps you feel like Rani while she goes through her journey. 'London Thumakada' captures the Indian Wedding Theme, while 'O Gujariya' is just great to listen to. A special mention about the remake of 'Hungama Ho Gaya' which is just complete fun to listen to.<br><br>In conclusion, QUEEN is possibly one of the best films of the year. I can't seem to see any flaw in the film; it is just complete fun. Go watch it; I highly recommend it.<br><br>QUEEN- 10/10","user":"andre_rox99","rank":[92,107]},{"title":"Queen is soul stirring","rating":10,"date":"10 March 2014","review":"Its not every year (or sometimes even years) that you come across a bollywood flick that stays with you for days after you watched it. Queen is one such film that will make you want to watch it again.<br><br>The story is similar in theme to English Vinglish (Yet another masterpiece) but stands out in execution and story telling.<br><br>Kangana Ranaut delivers her career best in Queen no doubt.<br><br>I was actually there on location in Amsterdam sometime in September 2012 when they were filming the last scene where she runs down the bridge to meet her friends at the rock show. The simplicity of the set and all involved was an indication of a good film which i later found out was to be named 'Queen' Watch it right away and you will leave the hall with a smile.","user":"ashwinrath","rank":[83,99]}]