[{"title":"Sicario","rating":10,"date":"14 February 2020","review":"Sicario was first released back in 2015. I just watched it for the first time last week...and I really have no excuse other than I'm an idiot. I knew I'd like it, I'd heard nothing but amazing things, and five minutes into the movie I completely regretted not watching it sooner. Sicario is, hands down, one of the best action/thrillers of the decade. Director Denis Villeneuve manages to create so much suspense and intensity throughout 120 minutes that at times it's almost unbearable. Needless to say, my fingernails did not survive this movie. The plot itself is fairly basic - the FBI teams up with some shady people to fight a brutal Mexican drug cartel. Emily Blunt plays the young FBI agent recruited into the fight, and for most of the movie the audience is just as confused and suspicious as she is. It delivers plenty of wonderful \"what the hell?\" moments, as you never really get a sense of anyone's true motivations until the end. The performances are universally terrific and the dialogue is sharp, but the main reason the movie works so masterfully is Villeneuve. With the help of some striking cinematography and a brilliant score, he gives us one of the most surprising, tense, and atmospheric thrillers in the history of the genre. If you've never seen Sicario, please don't make my mistake and see it ASAP.","user":"MR_Heraclius","rank":[51,53]},{"title":"8/10","rating":8,"date":"24 September 2015","review":"One of those select few thrillers that will have your eyes stuck to the screen from the opening credits to the very end, and I mean that literally: I changed my sitting position many times during the film, yet I clearly recall never ever turning my head away from the film, this is how intense it is.<br><br>With this Denis Villenueve has now consolidated his name as one of most important and gifted directors of our time and has shown us he is here to stay. I truly marvel at how this film is so tightly put together and even despite it faults, which it has, especially in script, it just never gives you a chance to breathe and take it all in, thanks to the atmosphere that is established from shot one until the last one, you are always anticipating something's going to happen and that is the sign you are watching a great thriller. You are always on the edge of your seat and in some occasions you are really biting your knuckles. The movie has a way to throw you into the action that is really rare to find, especially in a highway sequence where I literally felt I was there.<br><br>All of this is achieved thanks to probably the best cinematography of this whole year. Deakins does it again, once more playing with a lot of blacks and shadows and once more succeeding one hundred percent. Also remarkable is the use of helicopter shots which don't feel like connective tissue, but actually part of the organic, that's something really hard to pull off. The sound design of this film is flat out amazing, some of the best I have truly ever had the pleasure to experience. It is so in you face, so tight, it really contributes in making you feel a part of this even in the more intimate scenes. Music too is also excellent and while some may say it was a little too ominous and dark I felt it matched the tone perfectly and enhanced some parts magnificently, contributing to a nail-biting building of tension.<br><br>Of course one couldn't get past reviewing this film without nominating the three great performances at its center. Del Toro, Brolin and Blunt are each better than the other and continue stealing the screen to themselves scene after scene. There really isn't one stand out, the three of them just excel sky high and give depth to characters that are interesting. The characters are really what holds the film together, they are truly developed three dimensionally and explored in depths that aren't normally reached.<br><br>What makes the film stumble is the fact that in never has a good enough plot to make things as interesting as they should be. It really has a hard time in setting up which way it's going and in the end it actually doesn't end up with a satisfying resolution. You are certainly left with something to think about because of the themes, the characters, the atmosphere and the intensity, but all in all the plot doesn't offer interesting turns and not enough moral questioning, unlike \"Prisoners\", and so remains slightly one-note for the whole duration. It also has a totally useless character in Blunt's partner, which other than never understanding why he was there or what was his arch in the film, I never understood how he was being played.<br><br>Still there is nothing short of amazing in what Villenueve achieves in two hours. What could have been a screenplay turned into a very generic police drama, is actually one of the most atmospheric and tense movies of the year.","user":"James_De_Bello","rank":[343,439]},{"title":"El País de los Lobos","rating":10,"date":"11 September 2015","review":"\"Sicario\" describes, with surgical precision, the fatal and bloody desecration of Mexico as a result of its decades long cartel war. And it does so by compressing this almost endless tragedy into a two-hour tour-de-force of filmmaking. <br><br>At its center we find idealistic FBI-Agent Kate Macer (Emily Blunt), who is recruited to pursue a Mexican drug-baron. She is being guided by a seemingly untouchable covert assassin named Alejandro (Benicio Del Toro). Their investigation and methods are pushed further into unknown territory where justice and morality are no longer valid. The end not only justifies the means, it requires them.<br><br>Denis Villeneuve's masterful piece exemplifies not only filmmaking of the highest order, but carves out a place alongside the terrible news reports as a deeply regretful, angry and at times almost unbearable look into the abyss of a socio-political nightmare that is fueled by first world-habit and global economics.<br><br>Through the powerful performances by Blunt, Del Toro and Josh Brolin in the leads as well as the excellent supporting cast, do we get a sense of the human cost (physical and psychological), which the war on drugs has taken.<br><br>From an exploding prison population, to the destruction of Mexican agriculture, to refugees and a cycle of violence that is beyond barbarity; the pull that \"Sicario\" exerts over the viewer is undeniable and by skirting the limits of bearable tension, without ever becoming exploitive, it is never giving an inch concerning its subject matter.<br><br>Few movies this year will have such a clear and defined structure and unflinching approach towards a situation that appears to be beyond salvation, while showing at the same time, that life nevertheless continues.<br><br>Taylor Sheridan's script doesn't miss a single beat and without sidestepping anything frees itself from beaten movie conventions by using familiar elements in an extremely skillful manner.<br><br>All these themes, stories and characters are captured through the lens of veteran Roger Deakins (Skyfall, No Country for Old Men) who lets us always know how the micro- and macro-particles of any conflict are inextricably intertwined. We share the vistas of beautiful sceneries while having to witness their downfall. <br><br>Whatever ideals the likes of Emiliano Zapata once had, their country has now, as it is described in the movie, become the land of wolves\". <br><br>Fifteen years ago Steven Soderbergh's Traffic\" which earned numerous Oscars, not the least of which went to Benicio Del Toro, made a clear statement about the various strands the drug trafficking business touches. Now, all those years later we see in Sicario\" that even the faintest of hopes that Traffic\" held onto have been eviscerated. <br><br>What now? One might ask.","user":"Serge_Zehnder","rank":[411,545]}]