[{"title":"Low Key, Low Budget, 12 Monkeys Has Pluses and Minuses","rating":7,"date":"10 August 2018","review":"At first glance this film is a pleasant little discovery. The problem is it's neither as fully realized nor as polished as it should be to qualify as that one-in-a-million-diamond-in-the-rough indie film discerning viewers search for. For my money it is not as bad, nor as great as other reviewers have suggested. But if you are tired of the usual one-dimensional mindless drivel flooding many streaming services you could do a lot worse than Diverge. I would just temper your expectations a bit. It is a low-key, intimate variation of Twelve Monkeys (or any project where someone travels back in time to avert a pandemic) although it provides some original variations of its own. It is fairly intelligent - if not as intelligent as it, or it's characters, should be. Some of the scenes feel underdeveloped as scientists and pharmaceutical big-wigs talk about the points pertinent to the plot, but do not seem to be well-versed in the science or even high level corporate manipulations. It is competently made on all levels, with believable performances all around - although Ivan Sandomire is weakest any time he has to stray from introspection. The director is to be applauded for creating some visually interesting images, managing a low budget effectively, and being brave enough to embrace a certain visual poetry. Yet at the same time the film lacks energy and momentum. It's a little too quiet for it's own good and I can forgive a leisurely pace (I am a fan of Tarkovsky's Stalker, and that is almost literally three hours in which nothing happens). It might stem from Sandomire's reserve. It might be the filmmaker's choice. I mention it as a fact, not necessarily as a criticism.\nI reserve my criticism for the ending, where in the interest of being \"clever\", the film takes the all-too common misstep for Time Travel films and stumbles into violating it's own shaky logic and ends up nonsense. With all the effort and good intentions expended by the writer/director up to this point I am disappointed he didn't recognize this (and a few other moments) for the flaws they imposed on his work. But if you are the type of viewer who can accept a twist or surprise for it's own sake then I doubt it will distract you as it did me. There's a lovely little poetry to it - I'll grant you that. It just makes no sense. \nOverall I wish the film could have done more with all it's potential, but it's a film I will say kind things about to my friends, and they all know how critical I can be.","user":"seriouscritic-42569","rank":[8,11]},{"title":"5 out of ten for some of the acting but 10 out of 10 for everything else!","rating":8,"date":"20 March 2018","review":"All in all a movie that you really do have to watch in its entirety to appreciate the plot, and a movie that you have to forgive the co-stars for being somewhat cardboard in their performances. But a movie worth the time if you have an open mind and are okay with seeing a time travel movie that a) doesn't attempt to represent the methodology behind the activity and b) doesn't add those silly paradox components where people vanish or explode if they come into contact with themselves from a different chronological pathway!","user":"dagallop","rank":[7,12]},{"title":"Highly recommendable!","rating":7,"date":"3 February 2018","review":"Great film, beautifully shot, thought provoking and not standard Hollywood crash boom bang crap. Don't miss it if you have a chance to watch it.","user":"snaxxx","rank":[12,25]}]