[{"title":"Brainless B-Movie So Bad, Nasty and Gory that Becomes Funny","rating":4,"date":"28 May 2017","review":"When the necrophile janitor of a morgue Cornelius (W. Johnson Wayne) has sex with the corpse of a Jane Doe that died of STD (\"Sexualy Transmitted Disease\"), he spreads out a deadly virus that turns the dead into sex drive zombies. Meanwhile, the former soldier Dirk (Trey Harrison) and his girlfriend Pam (Nicola Fiore) head to the Redwood Budget Motel to have sex. The teenage school friends Christine Wayne (Rebecca C. Kasek), Freddy (Michael Merchant), his girlfriend Carrie (Toni Ann Gambale), his fat and stupid cousin Jason (John Walsh) and the pothead Brooklyn (Tarrence Taylor) head to spend the weekend on the beach in a SUV but it rains and they stop their car at the same motel. Soon they are attacked by Cornelius and other zombies that want to have sex with them.<br><br>The trash \"Night of Something Strange\" is a brainless B-movie film so bad, nasty and gory that becomes funny. The film is a big joke of bad taste beginning with the names of the characters (Christine, Freddy, Carrie, Jason). The lead actor that performs Cornelius physically recalls the unforgettable Richard \"Jaws\" Kiel from the 007 franchise and does not have any line along 1h 34 min. The jokes are gross and most of them are related to sex and the scenes have lots and lots of gore. The make-up is amazing and if the viewer is fan of the Troma Entertainment B-movies, he or she will certainly like \"Night of Something Strange\". My vote is four.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[12,15]},{"title":"Wild and entertaining","rating":7,"date":"19 December 2016","review":"A morgue janitor decides to rape a female corpse that died from \"radiation exposure/STD? - some living cells.\" Back at home he suffers from groin pain, turns into a zombie, and attacks his partner, rapes her, and rips some of her insides out. She too turns into a zombie and attacks a mail man who also becomes a zombie. The janitor zombie is run over by two guys in a truck and ends up in the truck bed.<br><br>Meanwhile seven kids leave for spring break--a couple separately and 5 together. Everyone ends up at some point at some gas station, including the janitor and later at a motel where they are attacked by these sex-crazed zombies.<br><br>In addressing the issue, what if zombies were into sex?, Night of Something Strange aims to be extreme, vulgar, gross, adolescent, obscene, nasty, etc. And it succeeds at that. Most horror, even, or especially R-rated, is sanitized to death and boredom. Then there are movies like this one, which relish in being graphic. In addition it's supposed to be a teen comedy so you have all bodily functions and all body parts involved. It's not particularly funny but it does rely heavily on outrageously gross situations the actors and actresses were willing to put themselves in. There are countless nods to horror movies as one can tell from the character names: Jason, Freddy, Christine, Carrie, but also to other great movies like Heat.<br><br>I appreciate graphics horror movies, not so much graphic comedies, but Night of Something Strange blends the two well to create surprises and shocking scenes at every turn. You'll be amazed by the stuff they come up with here. So it's an entertaining movie no doubt. And if it's true that the budget was as low as shown on IMDb, then the movie is quite an accomplishment. You can't help but like a movie that's so enthusiastically outrageous.","user":"TdSmth5","rank":[14,18]},{"title":"stupidity, gore, humour and dedication to the genre","rating":8,"date":"30 November 2016","review":"Not knowing what to expect from this one I saw it was supposed to be a funny horror. Funny horrors mostly doesn't work out but there are exceptions like this one.<br><br>Let me be straight, this is a no-brainer. Just sit and enjoy. For some people this will be over the top because it's all about teens eager to have sex and terribly going wrong but you will see if you watching this flick. The flick starts immediately with pure horror and before you know it you are into a funny ride full of gore gore ,a bit of nudity and gore. <br><br>I can't spoil what is going on but it all starts with necrophilia. From there on the virus is on his way to conquer the world. <br><br>And just when you think that this flick is falling down on humour when a guy is having sex in the dark with his girlfriend, you're in for another ride of...well, just pick this up if you do like for example Tucker And Dale (2010) or the Ash vs Evil Dead series. <br><br>I enjoyed it a lot and had a smile throughout the whole flick.<br><br>Gore 3/5 Nudity 1,5/5 Effects 4/5 Story 2/5 Comedy 2/5","user":"trashgang","rank":[14,19]}]