[{"title":"Very good - but you might need subtitles","rating":9,"date":"22 January 2017","review":"Fassbender is a good actor as is Brendan Gleeson and the story is a good one.<br><br>It is hard to understand what they say &amp; i am Scottish!! It's all gypo ( gypsie) talk and anyone from anywhere else other than the UK is going to have a hard time with this - subtitles needed :)<br><br>The story is a well trodden one - where the main character wants to change his life but is enmeshed in the culture he was brought up in and it's taking him down.<br><br>Some good car chases - even through fields!! Someone said it has no redeeming qualities but ultimately it's not Hollywood and there are no happy endings. A good gritty story with tension and a fair bit of action - food character study - Fassbender does a good job here.","user":"alanjamesbuchan","rank":[35,46]},{"title":"A small movie with great actors","rating":7,"date":"11 September 2016","review":"First time feature-film director Adam Smith establishes much in the opening minutes of the movie.<br><br>Our first image has the camera on the heels of a bullet-fast hare being chased and running for it's life through an endless meadow. Chasing, it seems, is a way of life for the backwoods thieving Cutler clan who we're about to meet.<br><br>The local British constabulary is usually doing the pursuing. <br><br>Chad Cutler (Michael Fassbender) squirms under the thumb of Colby, his domineering father, whose never-ending lifestyle of thievery sees no happy end. With a brother already trapped in prison, Chad looks at his young impressionable son and wonders whether he can offer him a different future. <br><br>To create a different path he must reassess Colby as a role model, and contemplate the unimaginable to trespass against his father's wishes and put his own young family's well-being above the clan's. Ensuring an education – something his father denied him – seems to be the only escape route for his children's otherwise ill-fated future. <br><br>Colby, played by the indomitable Brendan Gleeson, is an uneducated patriarch whose limited worldview is a creeping cause for concern. His knack for planning successful robberies is now questionable, and he senses growing desperation and worry since it's become apparent his schemes are outdated and flawed. But knowing no other way of life, he hangs on, using whatever resources he can to keep his son, Chad, with him. <br><br>Michael Fassbender is an extremely talented actor and makes a powerful presence on the screen. Through him we witness Chad's struggle to be a dutiful son, loving husband and responsible father. With no formal schooling, no ability to read or write, his strongest skill is seen behind the wheel of a car in hot pursuit, he wrestles to make a choice on what kind of future he can offer his young family. <br><br>My rating: 76 /100<br><br>20 /25 – Overall<br><br>11 /15 – Directing<br><br>12 /15 – Acting<br><br>13 /15 – Cinematography (colour, angle, camera position)<br><br>06 /10 – Editing (rhythm, pace)<br><br>08 /10 – Script (dialogue, storyline)<br><br>06 /10 – Music/score (sound foley, costume, make-up casting)","user":"wxgirl55","rank":[57,83]},{"title":"Another raw Fassbender performance","rating":7,"date":"26 December 2016","review":"Another astonishing and raw performance from Michael Fassbander, who plays an uneducated father of the family desperately trying to unchain himself from his father's robber-gang. The brutal moment when you realize you are in under influence of something evil or bad, but you're incapable of changing things and you get mad at the whole world. But the fault is on you, because you weren't strong enough to free yourself out of the chains in the first place. You have the choice to change it now, you have obligations towards your family and you have to choose what is best for them now, because you've lost your chance to help yourself.","user":"KarenAM","rank":[28,41]}]