[{"title":"Planting cabbages","rating":6,"date":"7 January 2016","review":"Greetings again from the darkness. The comparisons to Crash, the 2006 Oscar winner for Best Picture, will be numerous and understandable. However, rather than an expose' on racial tension, writer/director/actor Tim Blake Nelson turns his pen and lens towards the somewhat less profound, though still fruitful subject matter of suburban angst amidst the educated elite.<br><br>An opening featuring a violent mugging on the stoop of a NYC brownstone grabs our attention quickly, and rather than follow the immediate aftermath, we are instead taken back in time to study the characters and events leading to that tragic moment. The tangled web of intertwined stories is made up of no fewer than fifteen different characters, each of whom is impacted by what happens in that opening sequence.<br><br>Sam Waterston plays a beloved Columbia University Philosophy Professor who is exceedingly happily married to Glenn Close. Director Tim Blake Nelson plays their son, who is married to Jessica Hecht, and together they have a teenage son and daughter (Ben Konigsberg, Hannah Marks). Michael K Williams plays a big shot attorney who forces his best friend (K Todd Freeman) into drug rehab with a renowned doctor (Yul Vazquez), while Gretchen Mol plays the mother of two daughters and wife of Corey Stoll.<br><br>All of the above might seem simple enough, but Mr. Nelson's script jumbles things up for each character  just like what happens in real life. Waterston discovers that his prized pupil (Kristen Stewart) has psychological issues and needs professional help – just as he decides it's time to retire from teaching. While their kids are smoking pot and exploring sexual frontiers, Hecht and Nelson are dealing with a medical dilemma. During his rehab, Freeman is quietly confronted by a nurse while being let down by his only friend; and as Ms. Mol turns to the bottle to numb her daily pain, her hubby is making plans with someone else (Mickey Sumner)  and China may or may not play a role. Whew!!<br><br>Daily life creates many opportunities. Some of these turn out good, while others seem destined to create pain. It's that pain  sometimes quite arbitrary  and how we deal with it, which is at the core of these characters and their stories. There is also the always-present quest for truth and search for the meaning of life. We know we are in for a ride when Waterston's character says \"I used to believe in nothing. Now I believe in everything.\" Worlds colliding at every turn keep the pace of the film brisk, and the familiar cast of actors allows us to easily accept each of the characters. A bit more polish on the script could have elevated this, but even as is, the film delivers a worthy punch, and has us questioning if we should be \"planting cabbages\" (Montaigne).","user":"ferguson-6","rank":[38,55]},{"title":"Beautifully Done!","rating":8,"date":"23 April 2015","review":"I had the pleasure of seeing Anesthesia at it's world premier at the TriBeCa film festival last night and was very impressed. Ensemble cast, multiple narratives and an \"anemic\" budget makes pulling this off quite difficult. But, they did. The stories develop well, come together when necessary but not to a point to where it comes off as a gimmick. And where the film could get have gotten lost in it's ambition, it still takes time for humor and delivers a story with an arc that's quite compelling. Tim Blake Nelson knew how far to take it, but also didn't get too deep into the weeds or over indulgent with his impressive cast. <br><br>Honest filmmaking, deliberate performances and the best setting in the world make Anesthesia well worth checking out. Enjoy!","user":"slidingstage","rank":[39,60]},{"title":"if you don't like philosophical, emotionally complicated, eloquent movies...","rating":10,"date":"9 March 2016","review":"i'd DEFinitely say this movie is NOT for you...SURE it's flawed in ways i'd rather not discuss. i don't want you to be looking for the things that unsettled me. aside from the stories themselves. i've seen and see many, many movies. was born and raised in b'klyn, ny. this movie takes place in, mostly, manhattan(and places close enough to still be considered ny. although a commute away...). i rarely vote a score for a movie...but the ratings were ALmost low enough to dissuade me from seeing this. and that would've, truly, been a loss...i consider this movie to be a masterpiece in that it mixes lots of important thoughts and questions into the story. questions that need asking/addressing. i found it so thick with drama...or moments/conversation that i had to think about that i was almost overwhelmed. i was sooooo glad that i didn't see this in the movies. i had to stop it a number of times to absorb what had just happened...either emotionally or intellectually. and the cast! i can't believe NOTHING from this film was nominated ANYwhere...like i said, it IS flawed in certain respects...but overall? it's a 'wower'. but not a Hollywood movie. well...not a typical one, anyways...it's uncompromising in that it doesn't cater to being popular. though it IS successful in being ironically twisting in ways that'll make you feel like you've had a rough appointment at the chiropractor... some of the performances are noteworthy...and i think some of you will very much enjoy seeing actors you're familiar with(but don't know their names. yet...)from places like 'boardwalk empire' or 'buffy the vampire slayer'...falling skies/saints and sinners/mr robot...house of cards/the strain... i COULD go on. seriously. these are the 'lesser names'. but not performances... i haven't posted a movie review in quite a while...but i wanted no one else to ALmost miss this work of great storiestelling... and i ALSO, very much, wanted to thank those few reviewers that already posted reviews saying that it was good. you were the tipping points...","user":"imizrahi2002","rank":[23,36]}]