[{"title":"One of the best modern Horror Anthologies","rating":10,"date":"25 April 2015","review":"I went to see German Angst after hearing that Jörg Buttgereit has directed the first part of three movies. I hadn't heard about the other directors: Michal Kosakowski and Andreas Marschall.<br><br>The first movie draws a parallel between a pet guinea pig and people. Very gritty and painful movie really with many levels of meaning. Buttgereit's direction is as strong as ever here.<br><br>The second movie is topical with all the racism going on in East-Europe and Ukraine where minorities are increasingly blamed of the problems instead of the \"owners\" that are causing the problems. The violence looks very painful and realistic without having to use excess gore and the conclusion is strong.<br><br>The last movie was a true surprise. A well told story of a man looking for some extra spice from outside his current relationship. Well, he finds it. Some scenes remind me of Andrzej Żuławski's Possession, which is the ultimate relationship movie. The last movie features one of the most outrageous sex scene I have ever seen.<br><br>No laughs here. German Angst is something that needs to be digested for a while. Something that is very rare these days where the actual content is often missing. Empty shells masked with glitter and hype.","user":"algar","rank":[20,28]},{"title":"A trio of Teutonic terror tales.","rating":7,"date":"7 October 2016","review":"A horror anthology from three of Germany's most shocking film-makers, German Angst opens with Final Girl, a unusually weak effort from Nekromantik/Schramm director Jörg Buttgereit, in which a young woman vents her anger on her abusive father by castrating him and cutting off his head, all the while waxing lyrical about her pet guinea pig Mucki. Heavy on the artsy-fartsy pretentiousness, but surprisingly light on the gore (the castration occurs off-screen, although Buttgereit doesn't spare us the sight of the victim's junk), this first story is the most disappointing of the three.<br><br>The second segment, Michal Kosakowski's Make A Wish, is far more satisfying. Annika Strauss and Matthan Harris play a deaf and dumb couple of Polish descent who are humiliated and tortured by a group of racist thugs, but who manage to turn the tables on the gang's leader through the use of a magical amulet that allows the transference of souls. A nasty wartime flashback to the massacre of some Polish villagers by SS soldiers kicks off the strong stuff, and when poor innocent Strauss gets a bunch of fives in the face, its abundantly clear that this one isn't going to pull any punches.<br><br>The third story, Alraune, from Tears of Kali director Andreas Marschall, is a lot of fun if only for its sheer weirdness. Milton Welsh plays fashion photographer Eden, who recounts to his girlfriend Maya (Désirée Giorgetti) how he has been lured into joining a bizarre cult where unimaginable pleasures can be experienced, just so long as one doesn't break the rules. Of course, he does just that, and what follows is seriously bizarre, kinda like Cronenberg meets Lovecraft, with some messy mutilation involving broken glass and a toothy tentacular sex-monster.<br><br>7/10—after a frustratingly poor start, German Angst proves to be a rather entertaining anthology.","user":"BA_Harrison","rank":[5,6]},{"title":"Mediocre horror that doesn't really deliver","rating":3,"date":"15 December 2019","review":"Horror anthologies have a lot of potential; they can allow directors to experiment with unusual ideas, and the short format of each segment often makes for nice, snappy pacing. Unfortunately, \"German Angst\" only offers half-baked, shallow ideas with awkward, disappointing pacing.<br><br>The first segment, \"Final Girl,\" is a minimalistic tale of a young girl who sits around in her apartment and sometimes tortures her bound-and-gagged father. This could have been an interesting character portrait, but the actress playing the girl is utterly robotic and dull. Unlike the rather tragic and complex characters seen in Buttgereit's other films, this girl is a faceless cypher with no personality. There is a brief bloody death scene, but that's no substitute for an actual horror story.<br><br>The second segment, \"Make A Wish\" attempts a heavyhanded message but winds up being very muddled. This one is about a young deaf-mute Polish couple who get attacked by thugs. The lack of sympathetic characters is a big problem here, too: we're supposed to sympathize with the couple, but we learn nothing about their personalities. They frankly come across as vapid, upper-class idiots, since the man looks downright preppy, and they both think it's a jolly fun idea to wander alone into an abandoned building that's covered in street gangs' graffiti.<br><br>This short attempts to make a social commentary about the suffering of Poles in Germany, but it shoots itself in the foot by stereotyping the working-class characters as scary, psychotic villains. Hardly an open-minded portrayal.<br><br>This short also features a flashback to a WWII scene where nazis invade Poland and kill a farmer's family. I guess this scene was supposed to be shocking, but the violence and villainy are so over-the-top that it felt very cartoonish. When the nazis come zooming in on motorcycles, you KNOW they're evil because there's a dramatic shot of them running over a tin can! This segment is bound to get some laughs from the more irreverent audiences, as some unintentionally-goofy piano music kicks in, the Colonel Klink-esque commander yells a lot and grins like Snidely Whiplash, and the nazis slap everyone around with all the subtlety of a high school improv troupe.<br><br>In the end, this short pulls an \"Incident at Owl Creek Bridge\" cliche, and that's the height of its creativity. When they finally attempt to make a \"deep\" message, they resort to a character expositing straight into the camera. I could hardly believe they used such an amateurish hack move.<br><br>The third and final short is \"Alraune.\" It's the most decent of the bunch, and if you actually want a spooky story, skip to the 58-minute mark to watch this one.<br><br>Unlike the first two shorts, \"Alraune\" understands the value of suspense and piquing the viewer's imagination. This one is about a guy who discovers a mysterious sex club which turns out to harbor a supernatural secret; most of the short is about building up the mystery surrounding the club, so this is some engaging stuff that keeps you intrigued. This short also has the only scene that actually delivers on the horror; there's a scene involving a bathtub that is both spooky and visceral.<br><br>That said, \"Alraune\" is a decent short but still very flawed. Again, the main character is utterly unsympathetic. The lead actor is embarrassingly hammy, like a past-his-prime action hero wannabe. At the club, we briefly see some other characters who aren't nearly as weird or creepy as the movie thinks they are. The elderly host of the club is the best character in the film, but too much of his dialogue consists of \"you can't understand our secrets\" cliches.<br><br>The worst aspect is the climactic scene, which is the big monster reveal.It's fine to only show your monster briefly; less is more, after all. But it's a seriously lazy, stupid gimmick to violently shake the camera around during the entire scene. It doesn't make the scene more intense or scary, it's just an annoying crutch that takes you out of the moment. After that, instead of ending on a high note, the film awkwardly fizzles out with a few final scenes, ending everything on a very weak note.<br><br>I had really hoped for some creative and spicy material from this film, but the whole thing is just plain tepid and disappointing. It simply fails to live up to an anthology's potential.","user":"Dar_Sargent","rank":[2,2]}]