[{"title":"An above average found-footage movie with a lot of chills and a little cheese.","rating":7,"date":"19 May 2015","review":"The Taking of Deborah Logan is a creepy, creepy movie. If you want a good midnight creepfest then this will certainly do the job. The plot revolves around this girl and her camera crew who's studying Deborah Logan for her Ph. D thesis on Alzheimer's disease. Deborah's daughter Sarah is the one who sets this whole thing up and is basically the movie's protagonist and is a necessary part of getting through to Deborah during the rough times and helping mediate with the camera crew and whatnot.<br><br>Let me say right off the bat, the acting in this movie is very good. Well above average for a horror movie, and it almost gave me a Babadook vibe because its about a woman dealing with something difficult and her slow descent into madness. Both movies feel more like character studies rather than flat out scary movies, mainly because the leading women are so convincing and terrifying in their roles. Sarah was also very believable as Deborah's daughter doing everything she can to keep her own sanity while dealing with her mom's deteriorating condition. That's the main thing when it comes down to found footage horror: Whether the found-footage feels like a gimmick or not. And in this movie it doesn't. They set this thing up like a documentary. There are even a few medical scenes that explain the effects of the disease and how it affects the brain which I thought was a nice touch.<br><br>Like I said, this is a creepy movie. It's very slow paced like most found-footage movies but the exposition is well done and interesting, and actually gets us to know the family and how they operate so we can really be affected when things start going downhill. Even before the supernatural factors start coming in, there's an ominous aura to this movie, tonally, it's just very down-to-earth which makes it feel like you're actually there, which in turn makes it that much creepier. So the movie nailed it on that front. Then when the supernatural stuff does come in, it gets even weirder and a few scenes get really intense. Some shots are extremely quiet and scary and you think a jump scare is about to happen any second but... then... nope, next scene. And I love that, because the anticipation and tension from that shot still lingers into the next, and then the next, until you feel it's going to explode at any minute. It's very well directed in that respect.<br><br>That being said, there are cheap jump scares. There are some really cheesy ones with amazing build ups that have really LOUD sound effects to try to make you jump but just leave you like \"eh, that could've been a lot better\". But some scares actually pay off mainly near the end of the film and those are worth waiting for. There's also a lot of creepy imagery. Like, borderline disturbing imagery, because you believe this woman is doing these things and it's hard to watch, but in a good horror movie edge-of-your-seat kind of way. I really liked the tone of this movie, and I loved how they tied the disease with the supernatural stuff seamlessly. And there aren't that many dull spots in the movie - there's always something creepy going on whether in the foreground or background that keeps you on your toes.<br><br>In short, The Taking is an effective found-footage movie. The atmosphere is unnerving as hell, the acting is great, and it definitely creeped me out which is all I can ask for in a horror movie. Definitely worth a watch if you're a fan of the genre.","user":"lnvicta","rank":[85,93]},{"title":"Turn the damn light on!","rating":5,"date":"1 March 2015","review":"You know when you watch a movie and you constantly yell at the characters because they do everything wrong? Yeah, this movie is one of those.<br><br>Here's the premise: A group of people get to film an old lady in the struggle of an early diagnosed Alzheimer's disease. Her behavior is getting worse really fast, but it seems something else is going on with her, something evil...<br><br>Jill Larson is the best actress in the movie. She really nails her character. Anne Ramsay follows, then the rest of the acting is okay I guess.<br><br>Now, the problem with this movie is mainly about rational behavior of the characters. You know, when you are looking for someone confused in the house, it works better with the lights on. But here noooo, that wouldn't be scary enough. The group could also make sure to tell her they are coming and are looking for her, but it feels like they are almost hiding from her. Then when we find the lost lady or something scary, we also get a bonus unrelated scary sound, to make sure the jump scares are effective. <br><br>Some scenes can get pretty exciting sometimes, but don't hope to find anything extraordinary with this movie, you'd be disappointed. If you're looking for a barely decent found footage/mockumentary flick, you can give this one a chance. Just don't think too much about logic in this movie, because it is pretty much inexistent.","user":"fclermont777","rank":[51,71]},{"title":"Creepy Done Right","rating":7,"date":"27 October 2014","review":"If The Taking of Deborah Logan was just about a sufferer of Alzheimer's disease, it would be scary enough. The illness robs its victims of their minds, and in turn, their humanity. The Taking's plot walks a dangerous line in how sensitively it treats its subject matter, but the experience outside of its horror-premise is authentic enough.<br><br>I watched my grandmother deteriorate from Alzheimer's when I was quite young, but certain events still stand out vibrantly in my memory. I recall her talking to herself in the mirror, late at night, unable to realize that it was a one-way conversation. At times, she was coherent and alert. As the disease progressed, these periods of awareness dwindled. <br><br>My mother was an emotional wreck. She had now lost two parents to mentally-debilitating illnesses. I can see shades of her experience in the fantastic performance by Anne Ramsay, Deb Logan's daughter. Ramsay has naturally sorrowful eyes, but she exudes more than sadness. She's frustrated; tired of trying to make sense of it all; weary of her mother's inexplicable behavior. She's steeled herself emotionally against the slow, inevitable, and bitter end she knows is just around the corner. Throughout the film she struggles with losing a mother who's already gone but not yet dead.<br><br>Jill Larson's performance was gut wrenching in its authenticity. We imagine ourselves as Alzheimer's victims, frightened of what we've become; of what we've lost. But that's just not how it works. Deb Logan isn't frightened, because she's only aware of what she's doing while she's in the driver's seat. When an early-to-mid stage Alzheimer's patient lapses into one of their spells, who's in the driver's seat then?<br><br>The Taking's answer is, of course, much more horrific than in reality. It's a horror movie, by the numbers, by the book. Sure, the scares are well-crafted, and there are 30% less annoying jump scares than normal. But when you get down to it, the movie has the same skeleton that most run-of-the-mill horror movies have. What sets The Taking apart from the others is its humanity. Sarah Logan loves her mother and tries desperately to help her however she can. She doesn't understand what's happening but she's damn well going to fight it anyway. This isn't a \"love conquers all\" story, but love sure makes a valiant effort. <br><br>The movie is not without its flaws. It overplays various horror staples like creepy kids or people walking slowly up to a possessed person who's facing a wall. Dude, they're gonna turn around and scream at you or something. Mia Medina's camera crew makes a believable enough vehicle for the \"found footage\" style the movie's going after, but she doesn't actually have much to do once the plot gets going. Police seem oddly unable to stand in the way of a middle-aged woman, a girl in her 20s, or a camera man. Attics and basements are still bad places to go.<br><br>Overall though, Where most horror movies feature characters that couldn't die fast enough, The Taking succeeds because its principle characters are believable, and we actually care about them. That, and I find it eerie that you could cut 5-10 minutes out of the movie - all the expressly supernatural parts - and what's left could easily be a true story.","user":"King_Kestrel","rank":[42,60]}]