[{"title":"Decent movie adaptation!","rating":8,"date":"4 August 2015","review":"I haven't read the manga this is based on, but I HAVE seen the anime of it which was one of my favourites in the past few years and while the plot in this movie adaptation is very sped up, it is extremely well done! The story is cohesive enough even though plot points had to be edited and the special effects are superb considering what they COULD have been... beat the socks off San Andreas which was nothing BUT one long CGI sequence. Hollywood, take note... sometimes less IS more.<br><br>I can understand people who are new or haven't been exposed to the story possibly having a tough time 'getting it', but there really is enough to hang a story on... even with a giant chunk missing here and there. As for the detractors going on about how the original has been butchered, give it a rest would ya?? The anime clocked in at somewhere near 9 hours in it's entirety and yes, it was condensed from the manga, but what the heck do you need to be satisfied with a movie adaptation? Five to six full length movies? a few 3 hour movies?? get real here... there's an old saying that goes 'A movies length should be no longer than the average viewer's bladder capacity'. Get off your fandom, 'purist' snotty attitudes and accept it for what it is... a wholly ORIGINAL and satisfying experience that Hollywood could do FAR worse to emulate!","user":"viligeidiot","rank":[19,20]},{"title":"A film that you can be fully satisfy once the credit rolls but still make you crave for more sequel // instagram: moviesmaniax","rating":9,"date":"20 May 2015","review":"To be honest I never read the Japanese comic book version before but now, I think I should start reading one. Even though Parasyte Part 1 seems to have some unsettling moments going on, but at the end it all wraps up really well from its thoughtful and amusingly entertaining storytelling. All the actors here did their roles really well thanks to the script that leaves room for character development resulting in an effectively touching moment in the last act. The effects in the film is also impressive in an Asian film level and it gets really bloody, GORY, and disturbing throughout as well. I may not be able to compare it to the comic since I never read it but overall here, Parasyte Part 1 is an accomplishment in entertainment value while being able to add in thoughtful social context and creating a character where audience can actually care about. It's a film that you can be fully satisfy once the credit rolls but still make you crave for more sequel.<br><br>&gt;&gt;A-&lt;&lt;","user":"moviesmaniax","rank":[20,26]},{"title":"Parasyte: Part 1 is AMAZING","rating":10,"date":"16 November 2015","review":"This live-action of Parasyte: Part 1 (Kiseijuu) is very well filmed. I watched the anime version of this movie before I watched the live-action and it was both great. A lot of the live-action movies are worst than the anime version but this film is not. The edition in this film is amazing and all of the things look real, just how I want it to be. The actors are also skilled and they did very well. The storyline is also great. It contains lots of excitement and some parts are a bit scary but that is what makes this movie awesome to watch. In addition, it also provides very good messages to all the audience. It was even greater than my expectation. I do not just like this movie but I love it. <br><br>I cannot wait to watch the second part. I feel like it is going to even be better and exciting. <br><br>I give this movie a 10 out of 10 rating.","user":"sokhuilim","rank":[10,12]}]