[{"title":"Memories of a Cataclysm","rating":7,"date":"22 September 2014","review":"The film starts in 1970 in a remote unnamed Filipino village. We follow the lives of its inhabitants. Sito Almazan (Perry Dizon) was a ranch hand who gets sacked from his work when three cows were butchered during his watch. Hakob (Reynan Abcede) is an 11-year old boy whom Tata Sito adopted as a baby, who accompanies him at work and while hunting an elusive wild dove. Pacita (Hazel Orencio) is a woman who had dedicated her life to taking care of her physically and mentally disabled sister Joselina (Karenina Haniel). Tony (Roeder Camanag) is the local wine- maker who intrudes on the sisters' lives in more ways than one. Heding (Angelina Kanapi) is an out-of-towner who settled in the village as a busybody peddler, not only of house wares, but also malicious rumors.<br><br>For the next five and a half hours, we witness their lives unfold and hear their secrets told as mysterious events were happening all over town. Lav Diaz takes his time with his settings, the camera capturing the scene from an empty landscape upon which a small human figure will appear in the distance, walking to the foreground until he exits in a close-up. We will have many scenes like this throughout the film. Diaz's camera also likes to linger a inordinately long time on his characters as they go about their mundane chores and habits. We will see Sito warding off evil spirits as he walks through the woods, Hakob saving up for a trip to see his parents in Palawan, Pacita giving her sister a sponge bath, Joselina with her repetitive physical tics and facial contortions, Heding invading the privacy of homes. <br><br>I feel the main story could be compressed into a couple of hours, as the last two hours can practically tell the whole story. However, the success of the last two hours is there only because we have three hours before it slowly building up the proper mystic atmosphere and insidious suspense. Yes, this is Lav Diaz's style of story telling. The revelations are deliberately slow and unexpected. That is what makes these reveals extra special. If they were told straight-forwardly, then these secrets would not have the impact they had on us who had the patience to sit and stick with it through to the end. That climactic scene where we hear the reading of the Declaration of Martial Law was so well-timed. Humor broke the maudlin mood in the most unexpected ways.<br><br>However, the last twenty minutes or so of \"Mula\" was very puzzling for me. I felt the film already had a beautifully emotional ending as we witnessed a funeral pyre catch fire and waited until its flames eventually die out and it floats out of the screen. The voice over narration summed up everything very well. But instead of ending there, we are brought to yet another scene which I felt just went nowhere. I did not get why Lav Diaz decided to end the film that way it did, making the final payback not too satisfying.<br><br>Many of the actors in \"Mula\" were also seen in \"Norte\", Perry Dizon played Sid Lucero's mentor in \"Norte\". Here in \"Mula\", Dizon is Sito, the central character who survives everything thrown at him and swears never to leave his hometown no matter what. Hazel Orencia played Angeli Bayani's loyal sister-in-law in \"Norte\". Here in \"Mula\", she had to essay a more difficult role as Pacita, a tortured woman who had to sacrifice her whole life to take care of her invalid sister. This stirring portrayal already earned her the Boccalino de Oro Independent Critics Award for Best Actress award in Locarno. Angelina Kanapi again plays Heding as an annoying offbeat comic-relief role that will surprise us all. It was her character that got the most audience reaction.<br><br>Roeder Camanag is disgusting as Tony, the drunk wine-maker. Joel Saracho is very earnest as Fr. Guido, the dedicated parish priest. Ian Lomongo is chilling as Lt. Perdido, the military commander assigned to set up camp in their village. Young Reynan Abcede is only in his first screen role and he gets great exposure here as Hakob. (Ironically, he was not allowed to watch this screening because it was Rated R-16. He was asked to step out of the theater when the movie started to play, despite pleas from his co-stars.)<br><br>The town is very much a character in this film-- its desolation, its poverty, its being at the mercy of the elements. The whole film was practically shot in inclement weather. You can hear and see the wind howling. You can hear and see the rain falling. You can feel the chill in the air. There was mud everywhere. As big strong waves splash all around the sacred rock formation called \"Wrecked Face of the Virgin\" with great power, this dangerously picturesque locale is a perfect sacrificial altar. Lav Diaz intelligently captures the drama of the location in impeccable black and white, which made details stand out. Shooting this place in color would have come off as drab.<br><br>If \"Norte\" at four hours was not for everyone, \"Mula\" at five and a half hours is more so. The investment of this length of time for a single film will be too much for most audiences. It remains an acquired taste, even for me. Watching \"Norte\" first ten days ago prepared me for the Lav Diaz style of film-making. However I cannot really say that I am used to his long slow epic approach. \"Mula\" had a more languid pacing and had so many extraneous scenes which I felt did not exactly further the progress of storytelling. Serious international cinephiles have already accorded \"Mula\" their highest accolades, so there is undoubtedly a rare quality in here that will reward viewers if they decide to take on the full challenge of this moving artwork. I still have a lot to learn from films like this. 7/10.","user":"3xHCCH","rank":[27,29]}]