[{"title":"A beautiful, poetic road movie about love and loss and redemption.","rating":10,"date":"14 January 2016","review":"There's a poetry to My Name is Emily. Not just in the words - it permeates the imagery and music as well. That should come as no surprise to anyone familiar with Simon Fitzmaurice's work - his short films won all around them, lauded as lyrical and beautiful. His stream-of-consciousness film-making evokes a response on myriad levels - visually, musically, emotionally - and My Name is Emily succeeds on all fronts.<br><br>Emily, played beautifully by Evanna Lynch, is a troubled soul - deep and considered and stubbornly beyond conformity. She is wounded, armored and iron-strong. Arden, played with great charm by newcomer George Webster, is similarly bruised, but meets his own challenges with an infectious wit and enthusiasm. He hides his own pain under bravado, to a degree, and his inherent optimism and seize-the-day attitude are a perfect counterpoint to Emily's initial introspection. Their growth as characters as they journey across Ireland builds in an organic and believable way, gradually revealing themselves to each other, and in turn, the audience.<br><br>To call this movie a road trip is a little reductive - it is, for all intents and purposes, but the journey Simon so wonderfully evokes is through an emotional landscape as well as a physical one.<br><br>Parents loom large for both these characters, in different ways. Emily's father Robert is written across every aspect of her life. Their history together has forged her, left her vulnerable, searching for answers. Michael Smiley delivers a nuanced and powerful performance as Robert - a broken man, gradually remade through love and forgiveness.<br><br>Simon finds humor and pathos throughout, delicately balanced against themes of loss and redemption. He adds richness and texture in deft strokes, letting peripheral characters shine in fleeting moments - Arden's Granny, full of wit and wisdom, Emily's foster parents, crippled by their earnest middle-class nicety.<br><br>Emily's pain and loss simmer, fathoms deep, etched across every subtle expression. Lynch plays it flat at first, closed and impenetrable, but gradually opens up as the movie progresses. It's wonderful to see Emily start to smile and laugh, to watch her being freed as Arden helps her come out of herself, out of her pain. My Name is Emily is a poem about love and loss, darkness and light and everything in between.","user":"JayConnors","rank":[17,17]},{"title":"Uncommon Insight and Wisdom","rating":9,"date":"8 November 2015","review":"Wordsworth abandoned the woman he loved because he couldn't stand up to the public opinions, conservatives and morality police of his day. Emily, an insightful teenager in the present day, does not want to be in pain like he was. Her motto, like that of her father, is that if you hide from death, you hide from life. Because of Emily's uncommon insight and wisdom, she is isolated from her classmates. She is labeled as a freak. So she doesn't have much to lose by leaving them. With the help a similarly isolated young man, Emily goes on a quest to find answers regarding the forced transfer of her beloved father to a mental institution.<br><br>The young pair travels through the countryside, camps along seashores and beneath the stars, and beholds rainbows. The film is a tad predictable and could be more powerful and better acted and organized, yet despite such drawbacks it has a powerful story. This, the story, weighs most heavily for me when I rate films. I just love Emily's philosophy about living life to its fullest, or, as Emily puts it, \"life happens fast, like mountains that appear in the background, and suddenly you are in them.\" Seen at the Toronto International Film Festival 2015.","user":"Raven-1969","rank":[10,12]},{"title":"Luna Lovegood interesting","rating":6,"date":"6 June 2017","review":"Emily (Evanna Lynch) feels lost in the world. After her mother's death, her father Robert (Michael Smiley) deteriorated mentally and forced into an institution. Emily was placed in foster care. In the new school, teachers keep asking, \"What is wrong with you?\" The kids think she's weird except Arden (George Webster) who is head over heels for her. It's her birthday and the expected card from her father has not arrived. She enlists Arden in her mission to save her father.<br><br>Evanna Lynch is most well-known as Harry Potter's Luna Lovegood. This one is a similar flighty, ethereal character. She is quite compelling playing this type of role and has a certain magnetic charisma. George Webster is a relative newcomer and presents a very appealing actor. Most of this works well as a teen romance and road trip. At a certain point, the story struggles to do something more than the simple formula. The father's story could have been more emotional. For all the possibilities, the danger to him fizzles. It becomes something interesting about the father daughter relationship but it could have been more dramatic. Its potential is not fully realized but it's good nevertheless.","user":"SnoopyStyle","rank":[3,4]}]