[{"title":"Surprise Story","rating":10,"date":"14 February 2016","review":"This was a surprisingly sweet movie that I loved all the way through. Every time I thought something awful or dangerous would happen, it didn't! During a horrible snow storm, two young people, two old(er) folks and a few other assorted people are brought together in way no one could imagine. Their actions and reactions to each other were really fun to see and around every turn there was another surprise I didn't see coming. I ended up loving all the people &amp; their stories and wish I could see more of what's going to happen to them all. I highly recommend this movie to everyone who likes just enough suspense to keep you interested in what can happen when strangers meet. There is no r-rated language or sex in this movie - so refreshing!","user":"jbcnh","rank":[16,20]},{"title":"For forlorn lovers of good romance novels with a happy ending","rating":8,"date":"25 December 2016","review":"I don't think Rosemont is a film that will appeal to the masses, and although it has an underlying Christmas theme (the alternate title is A Christmas at Rosemont) it is more a story of two women, one older named Josephine (Grace Zabriskie) and wiser, and one younger named Lisa (Ayla Kell) who is unsure if she even wants to continue with her life.<br><br>Now Josephine owns a once thriving winter retreat named Rosemont which has been closed for the past 18 years and her able but often hard drinking caretaker Abe (Brad Dourif) always seem to be on latter sides of the fence when it comes to making any decisions about the outside world. <br><br>When two young people named Brad (Brendan Michael Coughlin) and a pregnant Lisa (Ayla Kell) attempt to get out of the cold after their car falls off the road during a winter storm they are met by Josephine's gun barrel. Then Josephine's capable caretaker Abe influences Josephine but only after winning a had fought argument with her that these two young people must get out of the storm or they will surely die.<br><br>Each of these four characters who must now share a roof for at least one night get to know each others story of who they are and why they feel the way that they currently do. As each character starts beginning to have feelings of empathy for the other three they all find a way to enjoy each others company for a few more days and nights ...and then Christmas comes and all is good in the world once again. <br><br>Mrs. Shullivan and I both enjoyed this Christmas themed film but it may not be for everyone's taste unless you have a warm spot in your heart for soppy stories.<br><br>It rates an 8 out of 10","user":"Ed-Shullivan","rank":[11,13]},{"title":"Heartwarming","rating":10,"date":"7 December 2019","review":"This is one of those that will fill your heart with love and peace goes to show you never know who you might meet or what your life has in store for you it makes you wish life could turn out just like it does in the movies check it out you won't be sorry","user":"youngbooty","rank":[3,4]}]