[{"title":"OK, I guess.","rating":5,"date":"1 June 2014","review":"The movie deserved the overall three it got but I'm giving it two extra points for the Great nudity. It's good to have Great nudity when your movie is weak. <br><br>And the movie is kinda weak. The story is about a Frat house that is forced to share a house with a Sorority, and both sides come up with a plan to get rid the other, so they can have the house to themselves. <br><br>The movie is really by-the-numbers and you can kinda guess what happens once the Situation is reveled, which happens early in the movie. <br><br>Maybe if the movie was a little more even with the ladies vs. the men situation. Girls are smart and clean, boys are like animals, I get it. but the awesome amount of T&amp;A in the flick totally leans the whole thing to a male perceptive no matter how much you try to even it out in the story.<br><br>Totally worth seeing for the tons of naked women, but no point if you are not into that.","user":"bbickley13-921-58664","rank":[26,33]},{"title":"It is great that we live in a country where....","rating":2,"date":"11 May 2014","review":"... anyone can become president (trust me on this) and anyone can make a movie.<br><br>No, seriously. It's all good. It's about freedom and, as everyone knows, we're all about freedom these days.<br><br>In 1978 ANIMAL HOUSE (which, embarrassed to say, I saw in a theatre when released) was done by a major director (John Landis) and starred not one but actually bout a half-dozen recognizable stars including the incredible John Belushi and Harold Ramis.<br><br>Flash forward 36 years and, through the miracle of direct-to-video technology, writer/director Jacob Cooney has produced this knock-off.<br><br>Which, to be fair, is really more off than knock.<br><br>There are no recognizable stars here (most of the bios of the players have the words \"up and coming\" in them which, in view of the content of this film, may possibly have a double meaning) but that too makes sense, because Cooney himself, prior to this, has mainly credits as \"assistant-this\" and \"co-that.\" To these tired old eyes, it looks like the aforesaid Mr. Cooney simply got tired of waiting for lightening to strike on its own (which according to Google, is a 1 in 3000 chance) so he rounded up a bunch of youngsters in the exact same situation and said, hey, I know, LETS MAKE A MOVIE.<br><br>Nothing wrong with that. I watched Mickey Rooney do something similar with Judy Garland in a bunch of films, and THAT always worked out nicely....<br><br>OK, back to this movie ... err .. video. The core premise is that a bunch of nerds from a failing fraternity end up, because of university politics, having to share quarters with a bunch of women who are all very pretty, very cranky, not especially bright, and love to spend all their free time - no, NOT STUDYING! - either exercising in the nude or sleeping in the nude of just doing nude-oriented things.<br><br>I am pretty sure that was the logline for the project. \"Pretty women with a quasi-nudist lifestyle forced to share frat house with unknown actors...\" or something like that. Financing must have been a snap.<br><br>Anyway, in the interests of my small but loyal IMDb readership, I dutifully watched this film looking for such things as humor, audience connection, entertainment value, and so on. By the end of my search, I would have been happy just to find evidence that these kids were working from an actual script...<br><br>But I digress. The current IMDb rating, as I write this, is a 4. That could possibly be a tad high .... you have been warned.","user":"A_Different_Drummer","rank":[12,20]},{"title":"Not bad if you don't have high hopes","rating":4,"date":"28 December 2018","review":"The story is not only cliche but just plain unbelievable. But if you're just expecting some cheesey entertainment and great nude scenes, then this is worth a watch.<br><br>It's like Anerican Pie meets Animal House with less laughs and more boobs.<br><br>The writers obviously were never part of a fraternity and may have never gone to college by they way they portray college life and rules that govern them. On top of that the plans that the guys and girls execute to get back at each other don't even make sense. You won't understand what the goal or their plan was. But its all an excuse to show some good nude scenes. And the women are gorgeous. I bought this movie on a discount rack for $1 and for that price I wasn't disappointed.","user":"NinjaXCV","rank":[2,2]}]