[{"title":"Much better than the first","rating":6,"date":"18 January 2015","review":"The second installment in a trilogy, if you've not seen the first film, you may struggle to get to grips with who the characters are but, given 20 minutes, you won't be worrying... actually, it may even make this more fun, since one wouldn't know of the visual treat to come.<br><br>What's good about The Four 2 is that, though it jumps straight into both the story and action, it doesn't leave gaps like the first one did or leave the viewer wondering what was the point in certain scenes; instead, it filters out minor players to make for a more compact viewing, and with the main plot events coming via the actions of characters introduced in this film, it works almost perfectly as a stand-alone product.<br><br>With a plot designed to intrigue the viewer as to whom is lying and about what, it's difficult to reveal much, but it was novel to see such tools introduced into a sequel, as in-fighting amongst team members would have come far more naturally than the forced time-fillers that took part in The Avengers or the awful dog \"joke\" that cued the bout in the Part I.<br><br>There have been some who complained that the ending was just a set-up for the third part, but really, it isn't - all questions are answered and had I not known that there was a Part III to come, it wouldn't have ruined the ride for me in any way.<br><br>Enjoyable.","user":"grandmastersik","rank":[3,3]},{"title":"Suffer from being the middle part ..but worth it","rating":7,"date":"3 February 2014","review":"like a lot of planned trilogy's it suffers because it doesn't conclude the story so you might want to wait until part 3 is released before watching The Four .. however both part 1 and part 2 were very well made a lot of cgi flying and wire-fu but some interesting characters and a few good fight scenes(more in part1 than part2 though) and some very good cinematography at times,what i loved most was how they were prepared to really let loose with the magic/fantasy aspects of the story western cinema just doesn't seem to get how to do that even in the big budget fantasy films that Hollywood produces... another excellent part of the production was the score and the musical direction it was very impressive...i really need to see part 3 now","user":"wildfire160","rank":[6,11]},{"title":"You need to wait and catch The Four 3 for a satisfying conclusion","rating":4,"date":"28 December 2013","review":"Within a short span of a year, Gordon Chan returns with his sequel to The Four, a supposedly planned trilogy based on the novels of wuxia writer Woon Swee Oan. We highly recommend that you catch the original before you pay a ticket to this one though - else you might end up feeling sore about the constant references to the first, and even more so when the movie just abruptly ends.<br><br>Since we have been introduced to the group of misfits that formed the Divine Constabulary led by the wise Zhuge Zhenwo (Anthony Wong) in the The Four, the sequel wastes no time in setting up the events that happened after the death of the evil and powerful An Shigeng (Wu Xiubo). As it turned out, An is still not dead but, for reasons unexplained, has been transformed into sort of a parasite kept alive by his father and hidden in a cliff far away. His father, Lord An, in the mean time is hell bent to take revenge against the Divine Constabulary and he also has plans to usurp the Emperor because (well) every villain out there believe he or she deserves the throne.<br><br>Thus writer and director Gordon Chan devotes a good one hour detailing the conspiracy and plan to frame and throw Zhuge Zhenwo into jail for the murder of the head of Department Six, the official constable section of the Emperor. Zhenwo's men are in turn thrown into frenzy after his capture and their unity is once again tested. Wolfboy aka Cold blood (Deng Chao) believes Zhenwo is hiding some deadly secrets from them especially one which involve the family massacre of his now girlfriend, Emotionless (Crystal Liu Yifei). Life Snatcher (Ronald Cheng) believes in Cold blood's theory but Zhenwo's trusty servant, Iron hands (Colin Chou) refused to believe in them. It's not until the suggestion of Zhenwo's companion, innkeeper Lady Chui (Shereen Tang in a cameo) that their internal conflict might be more than meets the eyes. <br><br>It's a shame that Chan is not much of an impressive mystery novelist nor a crime writer as The Four 2 has neither elements to engage the audience. The question of Zhenwo's credibility is obvious and the reliance of a single shape-shifting villainous character to do the entire dirty work is unbelievable. Even a sequence of Cold blood and Life Snatcher checking out the crime scene shouts lame. (Apparently, Divine Constabulary needs to recruit Detective Dee immediately.) Unfolding without any twists and turns till the second half with the revelation of why Emotionless' family is massacred; Chan's efforts are often laborious and unengaging like his earlier Painted Skin. If he thinks getting the busty Liu Yan to show some skin in a shower scene opposite Jiang Yiyan can salvage his storytelling skills, I guess Liu Yan needs to reveal more.<br><br>Making matters worse is his preference to pepper every single action scene with subpar visual effects and these prove to be more of a distraction in the decently well-choreographed action direction by Ku Huen Chiu. When it comes to the cast members, Deng Chao and Liu Yifei, who dominate the screen time, continue to emo and bore the movie with their zilch chemistry. The other two members of the Four, Colin Chou and Ronald Cheng are relegated to mere supporting roles with even lesser dialogue than the predecessor. Jiang Yiyan never ceases to tease the audience with her good turn bad or vice versa character, while Anthony Wong remains the only respectable presence in this otherwise boring martial arts flick.<br><br>Will the foursome who are blessed with remarkable Marvel/X-Men abilities reunite for the finale and take out the villain once and for all? Well, like I mentioned The Four 2 ends on a cliff-hanger and we hope Chan can gives us a satisfying answer to Lord An's ambitious plan to overthrow the Emperor.","user":"moviexclusive","rank":[8,16]}]