[{"title":"Pitiful DTV","rating":1,"date":"5 July 2015","review":"Danny Trejo who is on the front cover is doing a cameo only. A bunch of bounty hunters crossed the Mexican border to bring back a mysterious girl who is going to testify against some cartel kingpin. We don't really care actually. It's poorly directed. They are supposed to be special ops team and they act like a bunch of amateurs during the siege in the motel. They scream \"no\" each time one of them is hit by a bullet. So cliché. <br><br>The dialogs are horrible. \"Promise me you will keep on going if I am going down\". Totally forgettable.<br><br>I don't even know if I can write 10 lines for this total garbage.","user":"wanama","rank":[23,31]},{"title":"Ineffective","rating":3,"date":"9 April 2015","review":"The IMDb plot section announces: \"They soon realize that their fugitive [...] is much more than she lets on.\" We do as well. We realise who she is in the first minutes. From there, we expect fun... that never comes because the story decides that the bounty hunters will remain ignorant. So, instead of what we want, we get dull images, boring gunfights in the dark.<br><br>Of course the bad guys always miss, with either assault rifles or rocket launchers, while the average guys (who hunt people for money, so no, I can't call them good guys) are as good at bullseye as they are at bullshit. Realising their inferiority at handling heavy weapons, the professional killers later opt for much better tactics, going one by one and hand-to-hand against the gun-wielding hero, with the results that you would expect. The Night Crew is one of those movies.<br><br>The action scenes do not make up for their inanity, in either tension, humour or spectacle. They are simply bad. As for Danny Trejo, don't expect to see much of him. He is there sporadically, and only for talks.","user":"voyou-703-655350","rank":[15,21]},{"title":"Nice B action flick with a welcome twist","rating":7,"date":"30 August 2015","review":"Greetings from Lithuania.<br><br>\"The Night Crew\" (2015) is enjoyable low budget action flick with some nice twist. It's nothing original or exciting, but it is very watchable and can be even enjoyable, if you will lower your expectations first. The plot is simple but there is one nice bloody twist which i won't spoil. There are some gory scenes and it's kinda bloody picture, but it's not to bloody or disgusting. Acting was OK, nothing special although i liked performance by Chasty Ballesteros - she looks sexy and she gave probably the best performance in this movie - so it's a double win for viewer :) <br><br>Overall, \"The Night Crew\" (or better known as a \"Blackwater\") is a B action flick with some intriguing twist. If you skip it, you won't going to regret it or loose anything, but it worth a look on a boring evening.","user":"851222","rank":[7,9]}]