[{"title":"No idea what was going on here","rating":1,"date":"6 April 2019","review":"This was pretty bad. The storyline says it is \"A hallucinogenic summer noir cocktail spiked with suspense\", whatever that is supposed to mean. It seems like a collection of unrelated words, in the same way it seemed this film had a collection of unrelated scenes. Some of the scenes were separated by random images, I guess for impact. One of the images looked like it was stolen from Lost Highway. I'm probably wrong.<br><br>Anyway, this was horrible. As I write, it scores 3.2 on IMDB. I have no idea how it scores that high.","user":"biglogmollydog","rank":[5,10]},{"title":"Don't swim in the pool","rating":8,"date":"17 April 2019","review":"This is a noir style film about a former detective who searches his dreams for clues to unravelling the mystery of his wife's murder. The movie is filtered through an inferno of hallucinogenic vignettes and set against a distinctively West Aussie backdrop - babes, bitumen, great whites, backyard pools and long hot nights. I loved the way flames and scorching heat are used throughout the film - they're the detective's over-heated insomniac visions, but they're also the lust that brings Max (main suspect for the murder) and Charlotte (detective's daughter) together. But flames and smoke are also used to suggest destruction - of love, memory, lucidity and closure.","user":"gardiner-66990","rank":[1,1]},{"title":"A cage is also a home.","rating":8,"date":"10 April 2019","review":"Edward Bloom (Richard Mellick) is a detective. He is in a wheelchair following the accident that killed his wife. He is looking for the person that caused the accident for six years...and then Max Woods (Liam Graham) shows up at his door and says, \"I did it.\" Being a detective, Edward is dismayed that he didn't solve the case and attempts to use Max for clues that will eventually lead to him, so he can claim he solved the case...or something like that. Edward states that his dead wife is helping him in his dreams as he leaks clues in \"The Miracle Case.\" Edward has a daughter Charlotte whom he blames for the accident, even though she was at home. We find out more about that late in the film.<br><br>The film is done in noir style. It is a mystery where we know who is dead and who is the killer, but we need the backstory. Charlotte (Alyson Walker) and Edmond each have monologues during the film in metaphoric and poetic prose. It is a film that is not for everyone, but those like quirky films built on highly flawed characters.<br><br>Guide: F-word, sex, nudity (Alyson Walker, Sarah Fillipi, Christine Snell)","user":"nogodnomasters","rank":[1,1]}]