[{"title":"Worst movie ever?","rating":1,"date":"14 April 2018","review":"I can't think of any movies that I rated worse than this one. The only 6 votes on here must have been crew that voted because no objective human being would give this a score above 1....","user":"quintinv-97334","rank":[3,6]},{"title":"Average","rating":6,"date":"5 July 2018","review":"This movie would be ok on a Saturday afternoon with the kids, but when it comes to well made movies, its not among the best that's for sure. The acting, is atrocious, even if the kids are kinda cute. I can see what the writers were trying to achieve here, with a moral, but it falls flat because the movie never really gets going.","user":"battlecrusadersgames","rank":[0,0]},{"title":"A good kid's Movie about imagination but it doesn't have any awareness of danger","rating":3,"date":"19 July 2018","review":"This Movie did have a little bit of bullying in, and a few scenes about how to brake locks and get into things. I did think that the music was good but it was a little overdone at times, I felt sorry for Daniel because his sister, Lucy was there at the audition and she kept teasing him about how bad it was. <br><br>The women at the airport really annoyed me. she put a bag that was like the same as Dan, and Peter's bag right next to there's. If I was her I would of put it between my ankles or something. Or kept it on my back. <br><br>I think that Peter was silly letting Dan look after all the passports and well everything. Dan was just a little boy and Peter was the adult. Peter just wouldn't let dan be a kid. And Peter left dan with a stranger that he only meet that night. <br><br>I liked the airport worker, she went out of her way to help Peter and his son, but after I found the whole situation creepy and strange. I do think that this was a good kid's Movie about imagination but it doesn't have any awareness of danger like going into a van with a stranger and following them. <br><br>I liked the intro and music and how it joined together with the flow of the Movie, I think the acting at times was okay. I like the first scene where Peter and his son, Daniel both were trying out for a type of audition, at the same time but different place. Both auditions didn't go very well, I like how it showed both of them how alike they were.<br><br>I liked that Asanda and dan became friends, I liked Asanda he was funny and sarcastic and I also liked jabo who was Asanda dad, talk with Peter, I know that Peter wants to give dan a better live than he had but he was doing it all wrong.","user":"ChrisLFinch","rank":[0,1]}]