[{"title":"quirky, creative, sweet and funny","rating":8,"date":"30 April 2018","review":"\"Adventures in Public School\" (NR, 1:26) is a comedy from two guys who've spent most of their movie careers as actors and have only recently started working the other side of the camera - Kyle Rideout, who directs and, along with Josh Epstein, co-wrote the screenplay. (Each did the same for 2015's \"Eadweard\".) This movie was originally titled \"Public Schooled\" which seems a more fitting title. It's about a high school senior who was always home-schooled, but decides that, before he heads off to college, he wants to spend time in public school - and he really gets \"schooled\". (See what I mean?) <br><br>Daniel Doheny plays Liam, an extremely intelligent, but socially awkward young man. For what seems to be the entirety of his young life (the father's absence never being explained), Liam's mother (Judy Greer) has been his only teacher - and only friend - and they both seem perfectly happy with that - proud of it, even. Then, in a classic case of doesn't-know-what-he's-missing, when Liam goes to the local high school to take the exam he needs for his graduation certificate, he looks around at the school and all the students and decides he wants to finish his education there - but mostly so he can pursue the pretty Anastasia (Siobhan Williams). He intentionally fails his exam, giving him an excuse to enroll in the school.<br><br>The story's fairly formulaic, but not stale, in that it displays its own quirky charm. Liam makes mistakes, doesn't talk like most high schoolers and is atypically open and honest for his age group. The scenes of him adjusting to high school aren't laugh-out-loud hilarious, but they are cute, sweet and not uncomfortably awkward. For her part, Liam's mom, who was initially horrified that her son wanted to go to public school, soon gets with the program. Having taught Liam everything else so far, she helps him figure out how to make his rebellious phase as productive as possible and gets personally involved in this new world that's opening up to him. Meanwhile, Liam's socially awkward principal (Andrew McNee) is trying to date Liam's mom, and grandma (Maxine Miller) adorably observes events from the sidelines.<br><br>\n\"Adventures in Public School\" isn't a typical fish-out-of-water comedy. Liam's challenges never get too serious and his social awkwardness is nicely underplayed. Doheny brings his limited acting resume but considerable charm to the lead role. Rideout has the courage not to make him a stereotypical nerdy kid and the skill to make Liam sweet and adorable - not just because he's socially awkward, but also in spite of it. More experienced actors might've done a better job with some of the roles, but it's the fresh faces in the cast which account for much of this film's appeal. The same could be said of the lack of experience of the filmmakers vs. their fresh approach to the sub-genre of high school comedy. All things considered, it's this combination of elements that works well and makes for such a quirky, fun, feel-good movie. \"A-\"","user":"dave-mcclain","rank":[14,16]},{"title":"Lovely little comedy","rating":9,"date":"29 April 2018","review":"Judy Greer is a star. It would've been a decent teenage movie but she took it to another level and it's really enjoyable to watch. The humor is cute throughout and I laughed out loud a couple of times.\nCan't remember the last time it happened.","user":"alex-1250","rank":[11,14]},{"title":"Yes, High School was that Awkward","rating":8,"date":"28 April 2018","review":"The only person more socially awkward then Liam is his mom, but watching his mom project on him is just cringingly funny. I loved this movie","user":"david_stever","rank":[10,13]}]