[{"title":"Friend Request","rating":5,"date":"13 February 2020","review":"I found it to be a okay movie, maybe something to watch when you are so terribly bored. This is due to the fact that the movie did not give the audience enough time to understand the characters, causing the audience to not be able to sympathize with them. And the ending of the movie was very open-ended, leaving the audience confused.","user":"MR_Heraclius","rank":[35,37]},{"title":"Poor writing spoils a lot of potential","rating":6,"date":"6 September 2016","review":"The internet can be a very dark place. It's that way because people feel more comfortable saying how they truly feel on matters when they're hidden behind a computer screen, rather than being face to face with someone. Using this darkness as a film subject has been touched on, but not really mastered yet by Hollywood. 2014's 'Unfriended' is the best example I've seen of this subject so far. It has a lot of similarities to 'Friend Request', but remains a superior film. The main thing that it had going for it was that it was shown in real time, which covered up the biggest problem 'Friend Request' faced - the implausibility of no one being able to help.<br><br>'Friend Request' starts out as a very fine film. The '2 Weeks Earlier' segment is brilliantly crafted and sets up what should have been a great movie. Then, unfortunately, things start to fall apart. Characters start saying and doing things that make no sense, and all logic in regards to the social network problems go out the window in order for the story to stay afloat. There are some very good jump scares admittedly, however a number of the death scenes are a big let down in terms of suspense. It still remains an above average horror movie, but the disappointing thing here is the waste of potential.","user":"jtindahouse","rank":[40,57]},{"title":"Run of the mill horror.","rating":5,"date":"21 April 2016","review":"I was quite looking forward to this movie, having seen the trailer, I thought it looked promising. It started well enough, with Laura (Alycia Debnam-Carey) meeting Marina (Liesl Ahlers), who is new at the school, feeling a bit sorry for her and seeing that Marina has no Facebook friends, Laura accepts her friend request. It is quickly apparent that Marina is a bit strange and is practically stalking Laura. Laura decides to unfriend Marina and that's when thing's take a turn for the worse. It's here that the movie turns a bit flat and is pretty much like any other run of the mill horror. A few predictable jumps here and there and thats about it. Liesl Ahlers is perfectly cast as 'the creepy girl' but we have all seen this movie before and it offers nothing fresh at all.","user":"kyliem11","rank":[32,47]}]