[{"title":"Not so bad revisit to Blaxploitation","rating":6,"date":"7 February 2014","review":"First off, this IS a budget movie, with budget movie production values. Second, taking that into account, it's not so bad. I've seen many many films with way bigger budgets that were FAR worse. I don't recall any Blaxploitation film being made with high production values, though this is definitely a B-movie. It is called Android Cop, and the android part doesn't take over. Good use of future technology to drive the story.<br><br>Acting; reasonably good throughout, with a few exceptions. C S Dutton as the mayor is very good. Not such a big role, but what he does he does well. The main protagonists are somewhat hampered by the characters they have to play, but they manage it well enough.<br><br>Action; in parts it suffers from the 'many bullets' syndrome of so many Hollywood films. Hundreds of bullets are sprayed from endless ammo guns, and hardly any damage. Oh well, seen that a thousand times.<br><br>Photography; for such a low budget film, in parts some of the angles and editing are quite gripping. Only a couple of times did I find myself really criticising the angles, timing of cuts etc.<br><br>Dialogue; well, I burst out laughing a couple of times. Genuinely funny. It's not very moving, but it's not saccharine either. Again, only a couple of times did I think the lines were lame.<br><br>Story; nothing new, but well delivered. Twists and turns in the right places and nicely paced.<br><br>Overall, I didn't think I had wasted my time.","user":"Amadio","rank":[38,54]},{"title":"Android Cop - not Murphy, but it entertains","rating":8,"date":"20 February 2014","review":"Ah, another blockbuster, another knock-off. This time, it is of the RoboCop remake. I picked the combo-pack from my local Best Buy today. Basic Plot: A human cop is teamed up with a machine while sinister forces watch and wait (hardly a spoiler, the box itself gives us as much). In other words, this is a RoboCop knock-off.<br><br>I will just tell it like it is. The action scenes are pretty good. Michael Jai White is visibly doing all his own fighting and probably most of his own stunts (minus a couple CGI stunts – you'll know them when you see them). No complaints about the hand-to-hand combat. And when the guns come out the shooting stays pretty exciting. It's on par with 3 Musketeers (also from The Asylum). <br><br>The CGI, in my opinion, deserves its own paragraph. For once, the CGI was developed in-house so The Asylum didn't have to rely on the always fake looking effects of \"Tiny Juggernaut\". The CGI looks way better and a certain vehicle used in the film looks very real, like it was actually there. That and those two afore-mentioned stunts were pretty much the only visual effects used in the whole movie. They didn't go for the \"robot point-of-view\" (like in AVH: Aliens vs Hunter) or have everything get CGI exploded (like in 3 Musketeers). Quite the opposite: when something blows up (and that's very seldom), it's with real explosives! <br><br>The acting is pretty good. All actors do a pretty good job. There's plenty of action movie acting and very little character development but, all in all, better than I've seen in similar films. Charles S. Dutton is really going for the Oscar at the end of the film. And one must give props to Randy Wayne who has the hardest job of all – the title character.<br><br>All things considered, this is an entertaining little movie. It's not perfect and switches from night time to day in some places; not to mention the plot holes. And yet, it delivers everything it promises. Often when someone says \"a film from The Asylum\", people panic and run the other way. But, if you give \"Android Cop\" a chance, you're in for a treat. I give this movie eight out of ten stars.","user":"MrBigDub","rank":[12,19]},{"title":"This is essentially a poor man's \"Robocop\"...","rating":5,"date":"13 April 2014","review":"The Asylum does it again; take on a forthcoming potential blockbuster and make a poor man's version of it. This time it is with the remake of \"Robocop\", and The Asylum cleverly called it \"Android Cop\". Potato, potato...<br><br>Despite it being such a shameful and blatant copy of \"Robocop\", then I will say that The Asylum actually well all the way with this one, and it is by far one of their best productions to date. Be it a rip off or not, there are so many similarities that you just can't ignore.<br><br>Moving on... The movie is about police officer Hammond (played by Michael Jai White, I wonder how they managed to get him to do this particular movie) who ends up having to work with a highly advanced android police officer (played by Randy Wayne). Teamed up, they have to infiltrate a dangerous zone to find the mayor's daughter. But as they progress in their investigation, more and more secrets are unveiled, and things are definitely not what they appear.<br><br>\"Android Cop\" was actually rather enjoyable, despite being a rip off movie. Just take it for what it is, and don't read too much into it.<br><br>The effects in \"Android Cop\" were actually quite nice, especially for a production by The Asylum - they really upped the stakes here. And it was a nice thing, a most welcomed thing indeed. The CGI effects were quite good. The only thing that wasn't overly impressive was the toy-like suit of armor that the android police officer was wearing.<br><br>\"Android Cop\" get a solid 5 out of 10 stars from me, and this is definitely a step up for The Asylum - I just wonder when they will stop with the copying of forthcoming potential blockbusters and start coming up with original ideas for themselves...","user":"paul_haakonsen","rank":[9,14]}]