[{"title":"Great movie especially if you are a WW2 buff!","rating":9,"date":"22 February 2020","review":"This movie is amazing! It will keep you on the edge of your seat as it's tense &amp; thrilling. 100% recommend! What this man and everyone helping him endured is pure inspiration just unbelievable. we need more films like this!!! Great acting, scenery beauty and much more!","user":"MR_Heraclius","rank":[38,39]},{"title":"Wow. what a great story and great film, well told","rating":10,"date":"1 July 2019","review":"This came up first in my Netflix list so I decided to have a look. I am so glad I did. This is one of the best films I've seen for ages. It is graphic, violent at times, harrowing, nail biting (in more ways than one), heart rending, heart warming; but overall inspiring.<br><br>It is very realistic and is well acted by everyone. The lead roles are excellent and very convincing. That it is a true story is mind blowing. I was absorbed in the film from the start and it just got better.<br><br>It is different than most war films I have seen, quite a low key production, but it tells this story in a way that takes you right into the conflict. You can't help but feel for the characters involved and marvel at their resilience and bravery. It will have you cringing and crying and watching mouth opened.<br><br>I was blown away by it. Very very highly recommended.<br><br>I can't believe I have not come across it before. I guess being Norwegian and subtitled it just staying the background of mainstream blockbusters, but for me it was a marvel.<br><br>I am so glad I watched it. It inspired me, moved me and educated me.<br><br>There was just one thing I wanted at the end, that was not to be, but that's real life I guess.","user":"rickcorbishley","rank":[15,15]},{"title":"Amazing true story. Told the way Jan wanted it","rating":9,"date":"29 December 2017","review":"The whole family went to see this film. We had high hopes for it. Neither of us was disappointed. Its a brutal story, told like the soldier who went through the ordeal wanted it to be told.<br><br>It has been made before, different title. (9 lives, 9 liv) Jan Bålsrud did not like that version because he did not see himself as a hero. He felt the people who helped him was the heroes. That film received an academy nomination for best foreign film<br><br>The helpers really are the story here. The role of Jan Bålsrud played by Thomas Gulestad is potrayed brilliant and brutal.<br><br>\nI like Harald Zwart, brilliant underrated filmmaker.","user":"toreborgen","rank":[87,112]}]