[{"title":"Give it a Chance","rating":7,"date":"13 September 2016","review":"This was a very good movie. Yes, it starts slow but if you have the patience to watch until the very end you will find the writer and director did a wonderful job at tying everything up together. It shouldn't have been booed, as it was a heart warming story that had excellent acting. This movie deserves an opportunity at redemption in the world of movie downloads, and cable movies. So sad to see it destroyed by critics without having been given a chance. This is not a movie that I would watch over and over, but it is a very good one time watch. The use of flashbacks may be a turnoff for some as it drags out the movie a little longer than some may be comfortable with. The filming was different but captured the essence of the film, emotions and desperation. Trust me, do yourself a favor and give it a view on a weekend when you are bored... so no loss in the event you agree with the film festival crowd and critics.","user":"jbarber-35518","rank":[75,81]},{"title":"Don't let others influence you to not watch this movie","rating":10,"date":"27 August 2016","review":"I don't understand why this movie was booed at the Cannes Film Festival. This is a beautiful story. It is a story in which we learn so many lessons about life's most difficult moments and how one can find the courage to survive. Excellent acting and beautiful script. The cinematography is beautiful.<br><br>An American man, Arthur Brennan, played by Matthew McConaughey travels to the \"Suicide Forest\" (Aokigahara forest) to kill himself at the base of Mount Fuji in Japan, the site of numerous suicides. There he encounters a Japanese man, Takumi Nakamura, played by Ken Watanabe, who wants to kill himself as well, and both men begin a journey of self- reflection and survival.<br><br>But more than the suicide theme, there is the story of Arthur Brennan and his relationship with his wife, Joan, played by Naomi Watts, which is told to the viewer with a series of flashbacks. The core problems that exist in so many marriages are brought to the surface and examined during the unfolding of the story. It is a stark reminder of how easily we sometimes let love and relationships deteriorate when we don't have to. Thinking we will one day have time to fix the problem. <br><br>Beautiful story and excellent acting from all. I loved this film.","user":"esteemdancers-1","rank":[166,190]},{"title":"Ignore the critics. This film is worth the watch!","rating":8,"date":"27 August 2016","review":"OK, so the critics panned this film as boring and lack luster with some very harsh comments, but my curiosity was sparked by the unusual plot so I gave it a go. <br><br>Ten minutes into the film, I was near ready to give up on it and agree with it detractors, as it was very slow moving at the start, however, as the story developed I became interested in the 'why' and committed myself to discover the answers. <br><br>Matthew McConaughey offers a very good performance as does Ken Watanabe, both of whom demonstrate their desperation, frustration and hopefulness with convincing commitment. Naomi Watts completes the group of well matched, well directed talent. I found the cinematography to be excellent as well. <br><br>I did figure out the plot twist before it was revealed, but the way the director exposed it, I thought, was quite brilliant, and, just when I thought the film was over, we are presented with still another surprise that actually made me smile. <br><br>All and all, Sea of Trees delivered as both entertainment and a moral study from which every observer can benefit. I enjoyed it, and, given a chance, I think most views will as well.","user":"julian-640-544058","rank":[128,146]}]