[{"title":"I don't understand the hate a descent awesome MCU super action superhero - Captain America is the king","rating":10,"date":"2 July 2017","review":"I don't understand the hate for this movie it actually surprised me, I really enjoyed this film. Captain America: Civil War is a descent awesome MCU super action the third film of the Captain America trilogy. To me the second movie Captain America: The Winter Soldier is still the best one I just love that movie to death, but I like this one I love the first one but I just love all three of Captain America films. I thought the cast did a good job Chris Evens kicks ass once again he is Captain America and I look this movie from his point of view. He is really become my favorite hero of the Marvel Cinematic Universe and the Avengers films especially Age of Ultron, Captain America is still a guy who has a lot of screen time that it is the focus of a movie and he is still the guy I can take a side I agree with him, I can understand his choices.<br><br>We have also almost everyone from Avengers films except Thor and Hulk actors Chris Hemsworth and Mark Ruffalo did not appear. Chris Hemsworth thought that MCU fired him because he was not cast as Thor but he was later explained that MCU wants his own movie and his own stand alone path which I can't wait for Thor: Ragnarok.<br><br>The cast beside Chris Evens includes Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Emily VanCamp, Tom Holland, Frank Grillo, William Hurt, and Daniel Brühl.<br><br>In Captain America: Civil War, disagreement over international oversight of the Avengers fractures them into opposing factions-one led by Steve Rogers and the other by Tony Stark. We have two opposite teams now fighting each other: <br><br>Team Iron Man: War Machine, Black Widow, Black Panther, The Vision, Spider-Man.<br><br>Team Captain America: Hawkeye, Sharon Carter, Falcon, Bucky Barnes, Ant-Man, Scarlet Witch.<br><br>The battle between Captain America and Iron Man draws a political line in the sand. On one side, you have Tony Stark, a man looking to protect the world from super-powered individuals who've proved in the past to be more destructive than helpful. On the other, you have Steve Rogers championing civil liberties. It's the age old debate of safety coming at the cost of freedom, and we'll get to see it play out to a hopefully satisfying conclusion this year.<br><br>The action scenes are fantastic, the fight scenes on the airport are incredible heart pulse breath taking awesome. The fight scenes were very well done and well choreographed. I liked this movie more the story drew me in, the villain wasn't that good.<br><br>Robert Downey Jr. does a good job, Paul Rudd he is fun in the flick, he has a great moment as Ant-Man he has a few moments but one predictable. Scarlett Johansson did great! Black Widow kicked ass specially in the beginning of the flick. Anthony Mackie I really like him as Falcon he as a lot of good stuff in this. He was down played in Age of Ultron but has a lot screen time in here which was excellent and they made that for that in this one I am glad for it. Anthony Mackie has a lot of good screen time, specially in the action moments. Falcon has a remote control like a mini Flacon I thought that was really cool. Chris Evens is to root for this character, Black Panther interesting the actor playing black panther was really good I like him and I am really interested seeing his up coming movie. Bucky Barnes: Winter Soldier did fine.<br><br>A lot of people are complain about how terrible this movie is I am sorry I don't see it that way, I don't see at all it is peace of sh**. I wish that Frank Grillo as Brock Rumlow / Crossbones wouldn't die and it was nice to see him in the beginning of the movie. I still wish he would work for the villain I still enjoy his screen time.<br><br>I thought Chris Evens and Robert Downey Jr, did work great as a opposite team. I love the end of fighting between Cap, Iron Man and Bucky Barnes. I thought the last fight scene was well choreographed I honestly think Iron Man would have won and he would killed Bucky Barnes. If Cap wouldn't have hurt his heart. I know when Tony find out Bucky killed his parents and he killed his mom in 1991 he decide to kill him. I mourn with Tony and it was a great dialogue \"That shield doesn't belong to you. You don't deserve it! My father made that shield!\" <br><br>Captain America: Civil War is a 2016 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.<br><br>I understand the hate, because Captain turn the law politics back to save his friend, but he actually try to safe an innocent man who was framed by Zemo. <br><br>Captain America Civil War WAS BETTER THAN X-MEN APOCALYPSE, Batman v Superman: Dawn of Justice, Man of Steel and Deadpool I don't like those movies they are peace of sh** and too way overrated. The rating I am giving is 10/10","user":"ivo-cobra8","rank":[181,259]},{"title":"\"Captain America: Civil War\" Pits Two of MCU's Biggest Heroes in One Epic Confrontation","rating":9,"date":"27 April 2016","review":"The Marvel universe gets tenser with the most-awaited \"Civil War\". For what fans clamor to be a storyline that the MCU is building towards, here comes a showdown of Marvel's biggest properties.<br><br>\"Captain America 3\" starts off where \"Avengers: Age of Ultron\" ended, when the New Avengers, led by Steve Rogers/Captain America (Chris Evans), are cornered by international concern in response to continuous collateral damage. As a result, a governing act is proposed to the Avengers, fracturing the team to two sides, one led by Rogers and another led by Tony Stark/Iron Man (Robert Downey Jr.). But when a new threat is on the horizon, the team has to face the repercussions of their brawls.<br><br>It is a huge help that the Russo Brothers returned to hold the weights of Marvel's Phase Three, after their spontaneous effort in \"The Winter Soldier\". Though \"Civil War\" may not be as solid as its predecessor, it is still a worthy addition to the Avengers storyline and Captain America's saga. Yet, it excels for taking a mature route that brings a compelling character study, a token from the first Avengers movie. Out of such character study is the major theme of vengeance. I am not going to give any more details about it. It is best to be seen and be enamored by how such themes are delivered with an affecting yet entertaining vibe.<br><br>Kudos to the cast ensemble that all brought their A-game, even though some characters are not that fleshed out, or feeling shoehorned. Evans is at his most moving as the fading patriot who wishes the best for his team and loved ones. Downey Jr. is still what we expected from RDJ. Scarlett Johansson as Black Widow has a neutral but affectionate presence, despite her rather little involvement. The rest of the cast is great to see, with notable breakout performances from Paul Rudd as Scott Lang/Ant-Man/Giant-Man, Chadwick Boseman as T'Challa/Black Panther and Tom Holland as Spider-Man/Peter Parker. And Daniel Bruhl as Helmut Zemo is a better addition to Marvel's lacking lineup of antagonists. But despite the cast's collective efforts, there is an obvious battle for screen time with all characters. Thankfully, it was all salvaged as the two parties brawl in a cleared airport, in an exhilarating action sequence that will surely make every audience member cheer.<br><br>For all the makings of a summer blockbuster, \"Captain America: Civil War\" gets it all started right. Besides being a loyal companion to the comic book storyline, it is a worthy setup to Marvel's other properties and one that truly can hold on its own, courtesy of its consistent superhero action scenes, the Russo brothers' tense direction, the excellent cast, its thought-provoking themes and its exciting story with its signature Marvel snappy dialogue. Let us hope for the best for MCU's future, including Tom Holland's \"Spider-Man\".","user":"thependragonscribe","rank":[95,159]},{"title":"Great","rating":8,"date":"23 February 2020","review":"Great movie, very well crafted and it is an awesome thriller-action-drama at the same time. Character's decisions are likable and understandable. Absolutely do not miss this one!","user":"MR_Heraclius","rank":[41,66]}]