[{"title":"Obviously unpolished but very worth watching.","rating":8,"date":"8 May 2019","review":"If you're here reading reviews with an eye to deciding whether or not you want to watch LANCASTER SKIES, the best advice I can give you is that it's very important for you to approach this movie with the proper frame of mind.<br><br>By way of analogy, have you ever had the experience of your kid bringing you home the gift of the results of some art project? After the shock of absorbing the reality of the horrific things your child is capable of doing with cardboard, dry macaroni and glitter and that an art scholarship is probably not in your child's future, you're usually hit with a flood of emotions. These emotions are mostly having to do with how much you love this monstrosity that's been made for you and the painful depth of your love for your snot-encrusted kid. You see how proud your kid is that they made you a gift and how much they want to give it to you. It's this thought that hits you so profoundly. As trite as it might sound, it's the epitome experience of \"it's the thought that counts\".<br><br>LANCASTER SKIES, if we are to be truthful, has more than a little cardboard, dry macaroni and glitter about it. Much is made of the fact that the budget for the movie was £80,000, and seeing is definitely believing. But somebody loved this movie. In a world of millennials and partisan politics and deep obsession with global warming, somebody cared enough to make this movie about a time and place where every-day people did heroic things by the literal ton while never knowing if they would live to see another day.<br><br>I viewed this movie with the mindset that I was watching a video of a community theater stage play. It kept my mind open and my attitude forgiving and my concentration focused on the actors and the story.<br><br>Exactly like community theater, LANCASTER SKIES is possessed of the community theater-like mix of mostly amateurish workmanship mixed with sudden and unexpected bursts of high quality.<br><br>Most of the acting, for example, is somnambulistic and stilted. However, at least two of the actors were quite good. Joanne Gale as Kate was convincing at the very least and David Dobson was actually stellar in most scenes. He's a little on the short side which may cause him a bit of trouble in his future projects, but there's no question of his acting chops.<br><br>Most of the special-effects and Lancaster bomber images were pretty iffy, again, as you would expect from a community theater type production. And yet, every now and then, you're surprised by some particular shot that's actually impressive. There's one scene where three bombers take off and begin a slow, ponderous starboard turn to head off to their bombing objective and it had as much big-screen feeling as you can get.<br><br>Where LANCASTER SKIES screams its budget is its complete lack of context. In any movie, and most especially a period piece like LANCASTER SKIES, context is incredibly expensive. A World War II era airfield barracks or pub simply didn't have blank white walls with the occasional 8.5 x 11 LaserJet-printed pinup and white-frosted-out windows. Most scenes looked like they were shot in somebody's London flat and they probably were.<br><br>Every scene is shot with the lens so tight in on the actors faces to avoid having to show period-accurate context that there's danger of the lens going up an actor's nostril.<br><br>LANCASTER SKIES, in short, is a labor of love and is deserving of audience appreciation for its choice of worthwhile subject matter and the committed devotion of the people that made it, actors, crew and all.<br><br>In my opinion, there is only one genuinely negative thing to say about LANCASTER SKIES, all other positive elements notwithstanding. Many of the reviews here on IMDb extolling its virtues are 1-review wonders obviously from people directly involved with LANCASTER SKIES creation. Glowing reviews by interested parties without benefit of disclosure are just slimy. Engaging in that sort of thing goes a long way to besmirch a movie that deserves more respect and appreciation. LANCASTER SKIES creators should be proud enough in their work to not engage in such base behavior.","user":"S_Soma","rank":[42,50]},{"title":"Not what I was expecting, but thats okay","rating":6,"date":"13 May 2019","review":"Took a punt on Sky. Script was a bit hit and miss, can't argue, but I read this film was made for 80 thousand pounds so I'm giving leeway.<br><br>Was hoping for more plane and war, to be honest. However, despite the poster mis sell I did find it fairly engrossing. 2 lead characters were good and the rest of the cast played there parts well. Undeserving of some of the criticism if you ask me, but I do understand the misgivings.\nAt least it's not a studio remake - and well done for getting it done and being brave enough to focus on the people.","user":"ogdenhalifax","rank":[14,16]},{"title":"Excellent job for such a low budget","rating":6,"date":"27 February 2019","review":"Despite the cost of this movie coming in below £80,000 it easily held my attention for the full ninety odd minutes. Yes, if you look closely you can see some irregularities, and the action scenes are very few and far between. On the whole it is worth watching. The Merlin engines sounded fantastic at the cinema, and the story really conveys the desperation of the brave bomber crews, whose lives could end at the flip of a coin. It also did a great job of showing how living as fully as possible on the brink of disaster took its toll on the ground crews and families of those involved.","user":"jimthething","rank":[28,38]}]