[{"title":"Accidents Will Happen","rating":2,"date":"28 December 2015","review":"A nightmare awakens sexy brunette mother Kayla Ewell (as Rachel). The bloody accident in her dream turns out to be a big part of Ms. Ewell's \"Lifetime\" TV drama. Ewell lives in a huge and luxurious home, with her precious three-year-old daughter \"Mia\" (impersonated by sisters Ariella and Isabella Nurkovic). Heartaches in the household arise when Ewell's estranged husband Bryce Johnson (as Daniel Miller) calls his former home. A relatively poor city attorney, Ewell says he can't afford to keep paying for the expensive house and cars. Ewell is miffed. This means she must go to work. Gasp...<br><br>So, the demanding mother goes back to work. She's a courtroom sketch artist in, in cases with Mr. Johnson. They're officially separated, but not yet divorced. He wants to get back together with Ewell, but she refuses due to his cheating past. While she's working, Ewell, must put her doll-like daughter in daycare. It's preferable to hiring a nanny, which Ewell thinks would be a nightmare (and another movie). Doting daycare teacher Christy Carlson Romano (as Gabby) seems nice, albeit a trifle too personal. The title \"Deadly Daycare\" suggests things will go wrong, and they do...<br><br>Writer-director Michael Feifer should have received more support and advice in this effort. Someone with knowledge concerning special needs children and daycare facilities might have been helpful. The characters are incredibly stupid. Dumbest move may be when a central character places a \"hidden\" surveillance videotape camera in one of the daycare \"cubbies\" (where the kids keep their balls and books). That's really not the best hiding place in a classroom. One recess, and the camera's kaput. The little actresses playing the little girls are very cute, but they should be doing something else.<br><br>** Deadly Daycare (2014-11-29) Michael Feifer ~ Kayla Ewell, Christy Carlson Romano, Bryce Johnson, Tyler Rice","user":"wes-connors","rank":[4,8]},{"title":"First ever complete waste","rating":1,"date":"11 April 2020","review":"This movie is the first movie I would never recommend under any circumstances, even if someone wanted to watch a movie about babysitting drama. The director for this movie made a seriously bad product I am sad actors had to act out. Not sure if the movie is suppose to portray it's ok to cheat, or maybe killing is ok, or maybe ruining someone's life is ok. You may find yourself wanting Gabby (the mother who had her child killed and husband paralyzed by the main characters) to win, whatever winning is to you. You may want the main characters to at least admit they're wrong and have a sincere moment where they understand just how terrible it is they did, you may at the very least want Gabby or the husband to have some relief or something positive happen, some of you may have even wanted the spoiled wife to not get back with the cheating husband and the husband who seemed the least concerned about anything they caused to not just get his perfect family back while the other family is as broken as can be. Well no one will get anything they want from this movie. There is no relief, there is no positive message, there is not a single redeeming quality about this movie. The biggest praise I can give to this movie is the quality is decent and it makes you at least watch till the end with hope that they will make a good decision of what direction to go which they never, and I mean never do. In fact they do the exact opposite near the end, showing the broken mother almost kill herself then yell at the main characters how they took everything from her, which is the last thing you see of her as she gets taken away and the main characters get their happy ending. Next we see the main characters together and the husband gets back with spoiled mother which not a single person felt heart warmed about for multiple reasons, and the husband who hit the co worker with the car is not seen again, because that completely makes sense.<br><br>Terrible movie, even if you wanted to watch a movie just to see all the things you should avoid if you want to be a Director, still dont watch this one. Just awful in every aspect, I'd give negative stars but I can't sadly","user":"rosedjboone","rank":[0,0]},{"title":"Deadly Daycare = Delightfully Daffy TV Movie Dynamite!","rating":10,"date":"3 April 2020","review":"Deadly Daycare is another fun example of taking a tired formula and super-charging it to create a film so utterly surreal that it works as thriller, and as satire of same.<br><br>The script is nuts, in a good way, with an implausible conspiracy wrapped around an impossible set of coincidences, defying credibility all the way.<br><br>Characters are overdrawn to the point of parody, and the casting director picked types that were themselves caricatures of familiar TV-movie types (warrior mom, spooky psycho-woman, fretful matriarch, etc).<br><br>Many of these new-breed TV movies have at least one standout performance to showcase, and Deadly Daycare is no exception. Christy Carlson Romano is a real knockout here, her portrayal of a slow-burn schizo nothing short of mesmerizing. There are single takes of Romano in which she fluctuates seamlessly between innocent and demonic, and these scenes are highly disturbing.<br><br>The script takes a dyed-in-the-wool cliche (woman wants to steal a baby) and modifies it to something almost comical, and the result is a wild, wild roller coaster ride of turgid melodramatic thrills.<br><br>The producers of these made for TV films figured out a long time ago that as long as you stick to the basic ground rules of such films, you can really have some fun with it, and take the audience on a bizarre thrill ride that almost passes as satire of its intended formula.<br><br>Deadly Daycare takes the TV movie formula to dizzying heights, it's bigger-than-life soap opera style merged to a traditional thriller template to create a true gem of melodramatic weirdness.<br><br>To recap: a wild script brought to life by good actors, with lots of soul-searching closeups and mind-bending plot twists = TV movie heaven.","user":"Atomic_Brain","rank":[0,0]}]