[{"title":"Well, it was something. The SRK what I grew up watching","rating":10,"date":"14 April 2016","review":"FAN is Shah Rukh Khan's best performance till date. His Aryan Khanna is Excellent but his Gaurav Chandana is better. This is the SRK I grew up watching. He can't really top this one. Kudos to the VFX and the prosthetic team for the make up. Maneesh Sharma's direction was brilliant. The story is different. The dialogues are very very good. Habib Faisal has done a good job with the dialogues. The costumes are dope for Gaurav . The editing is crisp and the screenplay is Fantastic. The movie has no songs(That was a bummer) The cinematography was exceptional, great locations. Since, the movie is completely focused on Aryan and Gaurav, the supporting cast don't have much to do. It's good seeing a movies like this is being made. Something different. <br><br>It won't be a great success at the Box Office as it's a dark movie. <br><br>The flaw what I found was the Special Effects in the first Chase Sequence- You'll notice it. <br><br>Well one of the best movies SRK has ever acted in. 9ish/10","user":"kamran_3012","rank":[260,422]},{"title":"It's difficult to match King Khan's performance","rating":10,"date":"16 April 2016","review":"I'll try not to be emotional in this, although as a Shah Rukh Khan fan I felt waves of emotions while watching the movie and after it ended it was an emotional moment to see the King Khan back with a blinding, thundering, stupendous performance for which we (the fans) have waited for so long. <br><br>The idea of the movie was interesting, and the script has several plot holes, some of them, pretty big. Character consistency of Aryan Khanna the star is dubious. But.... what gives?<br><br>The overall execution, that is, the direction, the dialogues, the pacing, the grey areas, and above-all the performance of SRK which sometimes makes it a one-man show simply because he doesn't allow you to see anything else. For non-fans of SRK, this movie will show them how to play a character of a young person without behaving like a half-retard, ears and eyes popping out, juvenile character whose puerile emotions are only based in innocence. For the average Indian audience whose cinematic vision derives from star worship and alignment of the star with their own personal values, \"intelligent acting\" equates how they see the world and what they are fed as \"acting\" and \"cinema\" packaged as \"intelligent\" which is as genuine and honest as \"Patanjali\" Maggi. <br><br>But SRK, thankfully, didn't fall into that straitjacket. There are moments in the film where you could be wondering about how a certain thing could be possible (don't want to give away spoilers) but not for one second, will you have second thoughts on credibility of emotions portrayed and character portrayed. <br><br>Go and see this film if you want to see good performances. <br><br>Yes, I wrote good *performances*, because honestly speaking, there are two people in it--SRK the star, and SRK the actor. <br><br>I'm so glad I finally got to see the actor, for which I became his fan. Proud of my star.","user":"koyelranu","rank":[17,22]},{"title":"For every person who is a fan of someone.","rating":10,"date":"15 April 2016","review":"First of all,I must say the movie is outstanding in all aspects.Though I am not a fan of this actor but I should say that he has done a very nice acting in both the roles of Aryan Khanna and Gaurav Chandana. Specially, the role of gaurav chandana as a fan is fabulous. The story is unique in a Bollywood and well scripted too. The screenplay is very well maintained and full of excitement. The only thing I wonder about is that it has very comical scenes in a first half and some darker side and intense scenes full of emotions in a second half. Although it is a good combination and actor well maintained the balance between two roles. I have not seen such a great acting in any of his past movies like dilwale, happy new year and chennai express. But this time, he has done exceptionally well and may be best performance of his life. I would not tell you whole story here. You just go and watch the movie.It is not only for shahrukh khan fans. Everyone of us is a fan of someone.","user":"sultanbhaijaan","rank":[75,123]}]