[{"title":"Almost as good as Vacancy!","rating":6,"date":"10 January 2016","review":"To me, it was refreshing seeing a horror with a small budget acting far better than the latest productions. I got more intrigued with every minute so all in all, it was quite a pleasant surprise.<br><br>The story is typical, the execution is good, acting OK, and most of the time the decisions taken by the characters are natural, they don't seem to be written by someone. The bad guys did their job, our heroes the same and at the end of it you get your closure. For that I am thankful to Sweet Home.<br><br>If you give it a try and lower your expectations just a little, I'm sure most of you will appreciate this little movie cause it has quite a baggage to offer. I recommend it!<br><br>Cheers!","user":"gothic-fiction","rank":[10,12]},{"title":"Not the greatest, not the worst","rating":6,"date":"26 September 2016","review":"To me Sweet Home deserves a bit more then it's actual ratings. Okay it's not the greatest movie ever but it's worth watching once. There are a couple good horror parts, the filming and sound also contributes to make it an okay horror movie. Maybe the story might not be the most original and sometimes you wonder why they don't make other more logic decisions to get out of the building they're trapped in but with most cat and mouse horror movies you rarely have any logic. The mixture of Spanish and English was fine for me. I don't mind reading subtitles so it wasn't an issue for me. Ingrid García Jonsson and Bruno Sevilla are the two major actors in Sweet Home and they did a good job. Are there better movies in this genre? For sure, but it was still worth a watch.","user":"deloudelouvain","rank":[4,5]},{"title":"Could have been named Trapped","rating":7,"date":"10 August 2016","review":"I'm always on the look-out for a good horror flick and Sweet Home was a delightful treat.<br><br>I admit, at the scene in the beginning of the movie where the girl was speaking Spanish with the older gentleman,I stopped watching. I understand Spanish a little, but it seemed like the movie flipped to a foreign language altogether. At that point, I gave up. The next day I decided to continue the movie, simply because the movie is short in length(only 80 minutes). To my surprise, the Spanish dialogue was only a few minutes long and really didn't affect my viewing pleasure nor hinder my ability to follow the story.<br><br>I'm glad I decided to give it another try because it was honestly a pretty decent movie. Of course a few cliché moments in the film, but I've certainly seen worse. This film had me on the edge of my seat waiting to see what was going to happen next.<br><br>The movie moves along pretty quickly and has action throughout. I found myself thinking what would I do in this situation?<br><br>Although a fair amount of the reviews are negative, In my opinion, if you like horror/slasher films, check this one out! Honest rating 7/10.","user":"dopenamehere","rank":[5,8]}]