[{"title":"Rich, Deep and Dazzling","rating":9,"date":"4 November 2017","review":"The radiant colors of fire sparks in the night, shocking pink native dyes and lush green moss, and oscillating cascades of sound including exotic guitar, electronic interludes and soothing lapping waves, these and other rich innovations bring extra zip to the already thrilling story of Don Diego de Zama. Zama, a Spanish administrator in 1700s South America, refuses to adjust to his surroundings and instead pines for the continent and habits he left long ago. As his expected transfer to Spain hangs in limbo, Zama's paranoia about the dangers of the local landscape and hostility towards those of different races, increases. He lives in a bubble of his own creation. Yet if the sulking and morose Zama will not visit the pulsing and vibrant new landscape around him, it will visit him.<br><br>Director Lucrecia Martel deftly makes the audience part of the story. The scenes she provides are rich and dazzling in a variety of ways; color, sound, wildlife, clothing, furnishings, evident historical research, insight into human nature, brilliant acting and more. Her portrayal is wonderfully balanced. Martel does not glorify the past, nor does she skewer it. Pristine and beautiful scenery of lakes, rivers and forests are offset by glimpses of the morgue with its cholera and plague victims, the cruel and routine punishments and torture implements of the time and whirling ceiling fans that remind you of what the tropics without air conditioning must feel like. Martel's sensitivity and depth of feeling is astounding. The film audience, for example, is not provided with subtitles of native languages. \"We deserve to not understand what the natives are talking about,\" said Martel who was at this Toronto International Film Festival screening. \"History taught around the world is mostly about the colonizers.\" In one scene there are three sisters who revolve around a central point in a room, and Martel wants it to seem like they are part of a miniature music box. Such wonderful little touches. The film is spiced with brilliant lines throughout. \"Europe is best remembered by those who were never there,\" for instance, and \"nighttime is safer for the blind.\" The film is based on a novel by Antonio Di Benedetto.","user":"Raven-1969","rank":[37,60]},{"title":"A beautiful borefest","rating":4,"date":"12 October 2018","review":"Let me start by saying that I adore Herzog's \"Aguirre\" and Coppola's \"Apocalypse Now\" is one of my absolute favourite movies of all time. Contrary to what critics say, \"Zama\" is nowhere near aforementioned masterpieces. It is well crafted in technical terms, with great use of cinematography and sound design, but it is also self-righteous, pretentious and unbelievably boring. The characters don't evolve, the story goes nowhere, the social commentary is sparse (if any) and all you are left with is some nice shots and traits of black humour. It's not enough to constitute a good movie, obviously. If you want to see a good movie from Argentina, watch Pablo Trapero's \"El Clan\" instead.","user":"heatisroundthecorner","rank":[28,44]},{"title":"draws you into its strange little world, but WHY?","rating":31,"date":"31 May 2019","review":"The costumes, cinematography, etc do create a self-contained but claustrophobia-inducing world. The random sounds, strange glances, etc make one wonder if it is all just some inside joke in a pointless world. And, so much attention is on the insecure zama &amp; the supercilious governor that there isn't even any real exploration of day-to-day life.<br><br>All in all, one of the strangest films ever.","user":"bringbackberniew","rank":[6,7]}]