[{"title":"My Review Of \"Closer To God\"","rating":6,"date":"17 June 2015","review":"First off let me say that this is not \"Splice\" or \"Splice-like\" for any sci-fi, horror fans expecting that kind of movie experience. This film is a more down-to-earth, loose representation of what an event like \"a cloned child done secretly then leaked out\" would be like, how it would be received by society. \"Closer To God\" is more of a dark drama with horror affectations.<br><br>The film is directed by Billy Senese who tells a very emotional, long-drawn out, story with a real heartfelt approach to the human experience surrounding such an event as \"Closer To God\" explores. Cloning a successful human, then expanding the science of possibilities while protecting the material and the child. Compound that with the social repercussions, religiosity and naturalistic outrage, and you have Senese's film's theme. <br><br>The cinematography and setting is dark and somber, offering a more emotionally disconnected approach to this dark character study with only slight moments of personality that leak in from the Scientist and host mother's point of view. The rest of the time we are \"chaos rubber-neckers\" watching from a distance as this train-wreck of scientific achievements unfolds. That doesn't mean that the film or story is without personality or emotion. \"Closer To God\" reeks of melodrama and emotion, the story is strong and the acting is so well done that a tense, connection develops between the audience that story develops.<br><br>The horror aspect is minor and you have to hold on for the duration of this slow-burn, melodrama to get to that horror portion. It may not be worth it to die hard horror fans, or people going into the film wanting high energy thrills and chills. \"Closer To God\" keeps with a somber, macabre, almost haunting atmosphere, like watching a wake or or funeral, but only if the Westboro Church was outside, or the dead person was a mass-murder and also one of your closest relatives. That is the human connection I got once I became invested in these characters and this dark, sci-fi story. The effects are spot on but there isn't a lot of attention or sensationalism offered to those moments. <br><br>Overall I have to say that, as a dark drama, \"Closer To God\" is an intense, emotional story that is captivating. As a horror film or a \"Frankenstein\" styled film, I never really got that aspect. I say some aspect at the end, but it was so underdeveloped or poorly highlighted, that it doesn't really count. I think for people that have a pace of film that they like similar to \"Stoker\" or \"Birth\" , then \"Closer To God\" will be your speed. For more action, suspense, horror film fans-skip it because your just gonna get bored. I personally enjoyed the story and subject matter, I love any film that explores cloning! I say we go there and get it done-let the nightmarish consequences unfold!","user":"ASouthernHorrorFan","rank":[15,18]},{"title":"A moderate, modern Frankenstein","rating":4,"date":"26 April 2014","review":"Closer to God is a modern revamp of Frankenstein, and it somewhat straddles the genres of science-fiction and horror, or at least tries to. While there's a large attempt of things that seem scientific, I really feel like that area was so underdeveloped that I just didn't find that at all convincing, even for suspending disbelief for the purposes of a film. It's what comes of a film trying to make some pretty broad claims about science without really exploring or addressing them. The horror film aspect of it has its moments, and while I think it did a very good job of building up tension, it really seemed to fall apart when it came time to cash in on that by being a bit blunt about it, after doing a fairly good job of building up the unease and mystery.<br><br>There certainly are some other interesting questions that are at least mentioned about what represents humanity and how cloning factors in, and it acknowledges a lot of issues with the ethics, philosophy, and spirituality of cloning, but it doesn't really explore or discuss those issues much. It opens the door to them, and I do give it some credit for not pushing a particular answer to those questions, but I feel like more could have been fleshed out with them.<br><br>An overall slow pacing, I think it could've been made up for with stronger points, both conceptually and thematically, instead it fizzles out a bit at the end.","user":"Lowbacca1977","rank":[23,30]},{"title":"\"Human cloning\" elicits ...","rating":9,"date":"27 September 2016","review":"expectations of \"ah ha, the first human clone\" which should bring some earth-shattering, new expose on the science of cloning - achieving what no other scientists have been able to do. Of course, we have to throw in the usual moral issues associated with cloning a human but here, in this movie, things were treated rather differently.<br><br>Yes, there were the elements I mentioned above. The science was mostly hinted at and not in detail, which made me think at times what the story was supposed to be telling us. What gradually grew to make me like this movie was the tug-of-war between cold, unfeeling science and the love that exists for family and human life, especially that for a newborn so much so that, in his compassion, Victor, the genetic scientist, withdrew from what he later regrets not having done, which later culminates in hurt and pity.<br><br>Shades of Frankenstein the movie may have on the surface but it deals with deeper issues that influence and torment the different characters in the story - Victor the scientist, his assistants who, in one way or another, add to the mix of his work and the moralities involved, the tormented misgivings of his caregivers who trust and place hope in Victor's decisions which came too late, his wife who is also torn between her compassion and revulsion, and the safety of their own two little girls who are innocently caught up in the machinations. All of these add up to a nicely-blended mix that pull at our sympathies and yet horror at what we see coming. Last, but not least, is Victor's failed experiment which also tugs us both ways with fear and then the hurt that comes from the need for human closeness.<br><br>This is a movie that elicits expectations and depending on what these expectations are, it is little wonder we read the extreme poles of ratings and reviews among users and critics.<br><br>I, for one, enjoyed it. The low budget did hurt it a little, like the somewhat thin group of protesters. A bit of camera work attempted at giving it more substance with the illusion of bigger numbers, which did not work too well. What was done well were the close-ups of individual protesters that illustrated the hate and fear invoked.<br><br>Whether, in this day and age, people would come out to protest human cloning, we only have to look at the numbers coming out (on both sides) on the issue of same-sex marriage.<br><br>The lighting and camera angles, close-ups and deliberately out-of-focus scenes helped contribute to the mystery and suspense.<br><br>I also liked the added touch at the end on human evolution, though the science was not explained. It is, after all, sci-fi and we have seen throughout history that sci-fi has a way of becoming reality like those from Jules Verne and a particular communication device used in a classic star voyaging series that has survived for half a century to this very day.<br><br>Overall, a very good effort despite its low budget and thoroughly enjoyable (for me).","user":"shamrock_d","rank":[3,4]}]