[{"title":"Kind of middling","rating":22,"date":"22 July 2016","review":"I do think this had the potential to be something really great. Unfortunately, it never gets there. It doesn't even come close. The acting in this is really fine and solid, and the characters have the outline for being great but what really stops the film from becoming that much more interesting is that the story doesn't always allow them to feel like real people, no matter how good the actors are trying. I don't just want to focus on the negatives however. It's still very watchable and walks a fine line between being obnoxious and endearing (just like its lead character, which I do admit I have to warm up to) but ultimately lands on the positive side. One can do worse than see this film, but one could also do better.","user":"Red_Identity","rank":[4,5]},{"title":"Wonderful Theme","rating":8,"date":"27 March 2015","review":"This movie is light hearted, fun and has a solid message. It reminded me of Ann of Green Gables. The acting and story line are engaging. I'd like to see more movies like this being made that highlight women of substance. <br><br>There was one part that seemed as though it skipped ahead or somehow a scene was missing but overall the scenes flowed together seamlessly.<br><br>The story outlined in this movie helps shine light on the wonderful qualities of a strong-minded young women, especially when she is fortunate enough to find a quality mentor that can help guide but also grow from the relationship. Well done and highly recommended.","user":"jeffreygenung","rank":[6,9]},{"title":"Poetic and Intellectual","rating":9,"date":"24 March 2015","review":"I had the privilege of attending the premier at SXSW in Austin and even had the chance to meet some of the cast members. Not an action-packed film by all means, but a poetic and intellectual story with added levels of complexity true to the relationships of women. They empower one another in different ways to help each other achieve their own dreams. At the same time, they also help each other through dark times which brought out the best in themselves. Crisp and white winter sceneries brought a sense of peace and serenity throughout the film. Veteran Diane Ladd's performance was outstanding with several up and coming actresses to look out for!","user":"glynn-66069","rank":[6,9]}]