[{"title":"A return to the core of the genre","rating":9,"date":"2 August 2015","review":"At first I thought \"Oh no, not another zombie movie!\", but from the very first minutes I got hooked. The beginning scene of the film is great and reveals the overall theme of the movie: it is not about why or the how, it's all about the who.<br><br>Extinction is rather badly chosen a title, because the scope of the film is not global, but very localized, very human and personal. It feels more like a play, with a total of four roles that are worth mentioning. It is not about a problem that someone solves, but goes back to the core of the zombie genre, the pure survival of the group of individuals in a hostile world. The creatures themselves are very secondary with the focus on the people, with complex and well written characters.<br><br>Bottom line: this film deserves a lot more recognition than the IMDb rating seems to indicate. It is not a masterpiece, but certainly a work of art, not another recycled \"run, shoot, run\" clone. It lasts for two hours and it is a slow paced character driven story. So glad to see well written stories from time to time.","user":"siderite","rank":[103,133]},{"title":"A human drama set against the zombie apocalypse","rating":8,"date":"2 August 2015","review":"I was very pleasantly surprised by this film. Pretty much everyone is tired of the zombie genre by now but no one seems to be doing much to try and change up the formula.<br><br>Enter \"Extinction\", where the main story focus is on the relationship between the two main male leads. After a brief intro scene setting the zombie apocalypse stage, we are sent years into the future and the two men, though living next door to one another in their survivalist enclave, have nothing to do with each other. What has happened in the intervening time to drive them apart? Well, we learn that during the course of the movie, naturally, but it was nice to see that, although there are zombies in the movie, they aren't the focus of the story, merely the backdrop.<br><br>This type of movie works really well. The mystery surrounding the two men's falling out and the relationship with the little girl keep you guessing for a while. Of course, the \"twist\" isn't so wild or subtle that you don't guess it really early on, but it is nice, nonetheless.<br><br>The zombies, of course, though absent from much of the film, reappear at length, and we are treated to some nice moments of film making that put me in mind of older films. There is suspense and some nice moments of tension until they are finally revealed but there are a few too many jump scares.<br><br>Ultimately, the human drama enhances what would otherwise be a boring zombie movie and makes it into a very decent film indeed. The two main actors involved, Matthew Fox and Jeffrey Donovan, handle their roles very well and give very good performances.<br><br>That said, if you prefer your zombies slow and shambling, or your zombie flicks to be fast paced and violent, then this one may not be for you. On the other hand, if you want to try something a little bit different in the zombie apocalypse, then give it a go.<br><br>SUMMARY: More human drama than zombie-fest, though there are plenty of them towards the end. Well worthwhile if you want something more than \"Pew-pew-pew! Die Zombie Die!\" to watch.","user":"Rob_Taylor","rank":[66,90]},{"title":"Such a rare thing as a good zombie movie","rating":8,"date":"3 August 2015","review":"If you are looking for a good zombie movie look no further. This little gem is a character driven film with just the right amount of action.<br><br>This is not an action movie with zombies or a cheap independent gore- flick. This movie actually has some substance. Which can't be easy in the zombie genre.<br><br>Big thanks to the cast and director for taking the genre \"seriously\". This makes it a good movie and a great zombie flick. <br><br>I was even a bit surprised by the two main actors ability to cast away their regular TV acting skills and leap into film acting. Who knew they could push themselves to this level. Hope to see more of this in their future endeavors.","user":"Ctrl-Alt-DL","rank":[53,79]}]