[{"title":"A fan of Syfy B movies","rating":1,"date":"5 July 2015","review":"Unwatchable. I'm a fan of low budget films and can usually find some redeeming feature in just about any film. Perhaps if I had been able to make it through more than the first 25-30 minutes I would have been able to find it... Following is my best shot at a top 10 list for the film:<br><br>10. Cinematography is almost as good as most youtube selfie videos 9. Script writing makes one rethink the quality of the sharknado series 8. Acting, while not up to Sharknado standards, is...well...OK, I got nothing. 7 Plot...didn't include zombies(not sure if this is a plus or a minus) 6. Budget...you get what you pay for 5. Sigh...I give up. At least its over.","user":"sek41","rank":[26,28]},{"title":"1960s effects in 2015","rating":5,"date":"4 July 2015","review":"Wow, this thing was bad. Bad acting, poor camera work, bad story. <br><br>But, the worst was the \"special\" effects. Now I know this didn't have much of a budget, but I have seen high school kids make some pretty realistic CGI stuff. <br><br>This used a big guy in a horribly made suit, worse than old Godzilla movies, and then for full body shots of the dinosaur, it looked like a claymation dinosaur that didn't look anything like the suit version. And the way the dinosaur was spliced into the scenes when it interacted with humans will just make you laugh. <br><br>The depth of field was so messed up, they didn't even look like they were near each other. Oh, man....<br><br>You should probably just check this out only so you can laugh at the dinosaur scenes. It's pretty entertaining in itself!","user":"rupert-ian","rank":[20,22]},{"title":"Just because.....","rating":1,"date":"6 July 2015","review":"some genius decided to try and make a movie by joining a bunch of videos clips together shot from i would guess is, judging by the image quality, their android phone and tried to pass it off as something other that pure garbage. 4.8 score? really? let me guess the cast and crew all voted on their own film to \"pad\" the IMDb vote count, pathetic. this is by far the worst movie i have ever watched for less than 5 minutes of, but it was actually closer to about 20 seconds that i knew this was utter trash, sad. this is where i actual begin to feel pity on the folks involved with this joke of a project. stick to doing whatever else it is you do. leave movie making up to the professionals, and for heavens sake don't release it.<br><br>PLOT \"A group of people brought together through a twist of fate hide out in a remote cabin, unaware that a ferocious monster roams the surrounding area.\"<br><br>ridiculous toy baby dino....er monster<br><br>just because you can do something doesn't mean you should.","user":"tangoscash","rank":[24,29]}]