[{"title":"A mostly dull uninteresting film with little in the way of surprises","rating":3,"date":"8 October 2017","review":"Katie (Nicky Whelan) is a mother whom has recently escaped from an abusive relationship. Katie ends up befriending wealthy couple Angela (Gina Gershon) and Brian (Nicolas Cage) and stays in their guest house whilst serving as their nanny. Initially all is well, but the couple start to get suspicious of Katie when they start to learn that she's hiding a dark secret...<br><br>The set-up isn't a bad one and in some ways this film reminded me of 'The Hand That Rocks The Cradle', but despite an intriguing set-up the film doesn't contain much in the way of audience involvement. There is some mystery with Katie's character, but the film reveals too much too soon which ultimately kills much of the suspense. The main story also lacks credibility and requires a leap of faith to be able to accept what you're seeing is even remotely believable; a couple allowing a stranger to be their nanny without carrying out any kind of background checks first??? <br><br>The tempo picks up slightly towards the end, but by this point I'd already lost interest in the story (mainly down to the drawn-out first half of the picture where next to nothing actually happens). I also wasn't impressed by Jonathan Baker's direction which was far too leisurely and I also wasn't impressed by the art-house pretentious feel that the film had as a whole.<br><br>The acting isn't too bad though with Whelan and Gershon both being the standout's here. Nic Cage is the big named actor here, but the filmmakers waste him here by just having him hanging round in the background (he's never sufficiently developed and isn't given the chance to make any kind of impression on the picture). The cynic in me thinks that he may have only been cast in the film as a gimmick to make the film appeal to a wider audience.<br><br>FINAL VERDICT; skip this one and watch The Hand That Rocks The Cradle instead.","user":"jimbo-53-186511","rank":[25,30]},{"title":"Like a Lifetime movie but with Nic Cage","rating":6,"date":"17 July 2017","review":"This is a Lifetime style thriller with slightly better photography and direction and it has Nicholas Cage. The story is about average Lifetime psycho standard - not better not worse. So it's not too bad a watch.<br><br>The title is a pun on the word. Or it could be called crazy egg donor. Gina Gershon plays an older doctor with fertility problems. She has a kid with an egg donor. Nicholas Cage plays her husband. She befriends another young mother whose daughter and hers become friends. Unknown to her she is actually the egg donor and goes around checking how her babies are being raised and if she isn't happy she gets dangerous. The story mostly checks out but it kind of is rather lame how she would invite such a pretty woman to stay in her guesthouse.<br><br>OK watch if you don't expect feature film standards.","user":"phd_travel","rank":[22,27]},{"title":"Done-to-death \"evil woman\" thriller","rating":1,"date":"19 November 2017","review":"Really just a terrible movie. And its been done SO many times in the past -- someone mentioned \"The Hand That Rocks the Cradle\" but I just saw a black variation on this last year (can't recall the title, very boring) with a rich black couple who hire a surrogate. This is virtually the same film with a white cast!<br><br>I call these \"evil BEE-yotch\" films. There is always a nice woman, and then an evil woman who is jealous and wants the nice woman's \"life\" (which is always wealthy beyond belief). The husband is a passive dupe. Sometimes he cheats with the evil BEE-yotch, but not always -- not here, even though Nicky Whelan is far prettier and younger than Gina Gershon.<br><br>The only thing that could pass for a twist is that the Whelan BEE-yotch character is a lesbian. But that hardly raises an eyebrow today.<br><br>Aside from how derivative this is...they can't even get the details correct. There are numerous logic errors in the film. In the first scenes, Katie (Welan in a brunette wig) is seemingly an abused new mother, trying to runaway with her baby, when her husband comes home -- there is an altercation and she kills him with a convenient kitchen knife.<br><br>BUT...later in the film, we learn she is really their EGG DONOR, who managed to find their identities, track them down -- and is STEALING the baby -- and she has just murdered the babies real mother upstairs in the tub. Then she kills the husband. She has to have left DNA and fingerprints all over the darned house, but NOBODY -- police, FBI -- is searching for her! ha! she's fooled them! she has COLORED CONTACT LENSES! (BTW: nobody is searching for a kidnapped newborn baby? are you kidding me?)<br><br>At the end, an emergency room doctor tells Nick Cage that his wife (Gershon) -- ALSO stabbed by Whelan! in an identical incident! -- \"didn't make it\". He weeps. Everyone weeps. Katie (Whelan) is nowhere around, she's giving birth. Later, it turns out Gershon is not even INJURED from a huge knife plunged into her ABDOMEN (!!!). She's alive, to the shock of Katie (Whelan) who intended to kill her, and steal her husband and new baby. But...why on earth would the ER doctor have told Cage that his wife was dead? when she was FINE??? The only reason was to FOOL the audience! with totally false info!<br><br>We see Katie go into the hospital -- she is also injured slightly -- and they are just putting a bandage on her and it's a DAY after Gershon supposed DIED. Yet they are just putting a bandage on her wound? for the first time? then she's suddenly in labor, even though earlier we were told \"she has three more weeks\". She is put UNDER for a C-section (why???) -- totally knocked out -- which is NOT how c-sections are normally done. (They are done with spinal blocks and most women are completely awake &amp; alert through the procedure.)<br><br>THEN we see her wake up, not even in the recovery room -- she's alone somewhere -- and they go down to the nursery to see the new baby. She is so FINE after a C-SECTION -- which is major surgery, cutting your abdominal muscles -- that she can get out of her wheelchair and run around. Note: most women can barely walk after a C-section and it takes 6 weeks for a complete recovery.<br><br>Did none of these people ever have a baby? yeesh. On top of that, we see Cage, Gershon, their new baby, their existing 5 year old daughter -- AND KATIE'S DAUGHTER!!!! -- all together in bed. Supposedly they get to KEEP Katie's daughter, even though the child was never theirs -- belonged to another (murdered) couple -- the child is entirely unrelated to either Cage OR Gershon (though a half sibling to their own daughter).<br><br>On what planet would they have gotten custody? That child had a family, even if her parents were murdered -- aunts, uncles, grandparents -- who would be desperately searching for her! Even if Cage's family wished to adopt her, it would be a lengthy process and no guarantee they would win custody. (Even if the murderous mother, Whelan, were in jail -- it would not sever her parental rights and the child would likely go into foster care.)<br><br>Mistakes like these are utterly thoughtless, showing NOBODY involved gave this the most minimal attention -- just slapped together lazily the tritest elements of this genre.<br><br>Gershon and Whelan do decent work, to be fair. Cage sleepwalks. He and poor Faye Dunaway look just awful -- hello folks? there is high def film now! you can't hide the wrinkles! -- and their presence is just sad.<br><br>Lastly: why oh why do these films always have to be set in the most obscenely lavish mega-mansions? This one is so over the top, it made me think of the \"Versailles\" palace from the film \"The Queen of Versailles\". It is just exhaustingly large and opulent. Even a pair of doctors would not likely have a house like this. Don't people in ordinary colonials and bungalows also have problems with infertility? The set is just a total distraction from the plot or characters, such as they are.<br><br>An empty shell of a movie. Avoid.","user":"LilyDaleLady","rank":[29,38]}]