[{"title":"Like Sliders without the, you know, entire story.","rating":5,"date":"29 March 2015","review":"Found this on Netflix highly recommended based on my previous ratings of movies. Watched it. REALLY enjoyed it. Kind of like Sliders meets Lost. But here's the thing--what a total waste. Meant to be a pilot for an entire series, the \"movie\" so prematurely ended that not even a single mystery was explained. I'm guessing that FOX, once again, gave the axe to a promising series, but enough was filmed that someone just said, \"screw it, make it a movie.\" The pilot is really really good. As a movie, it really really sucked. You can't just write a screenplay for a pilot and call it a movie, it doesn't work like that. It's too bad, because this is a series that I would really love to watch.","user":"howardka-08446","rank":[161,171]},{"title":"Umm","rating":5,"date":"15 March 2015","review":"I have to give this a 5 because it is unfinished. Apparently it was suppose to be a TV show but didn't get picked up so they made a stand alone movie.. Well, I guess the pilot episode was turned into a movie and of course it has no closure, it just ends. No questions were answered that it poses which is a shame because it was a pretty decent flick accept for a few performance issues and some pretty cheesy dialogue. Other than that, the premise was good, inventive and much darker than Sliders. ohh well. I wondering if anyone will pick up the rest of it and I am just writing more cause it says I have to have 10 lines of review and I don't have that much cause it just ends.","user":"RobertLThorpe","rank":[50,54]},{"title":"Great Premise, Poor Ending","rating":5,"date":"5 March 2015","review":"I saw this on Netflix. Marked as a movie. We watched this with enthusiasm. We really enjoy seeing alternate realities and how people overcome their obstetrical. But this \"episode\" left the viewers wanting. The end is a total cliff hanger. WITH NO QUESTIONS ANSWERED. The ending even posed more questions than not. <br><br>For a show/movie with no adverts claiming future productions, this movie left me almost feeling angry that there was no conclusion. I had to watch something else after just to get over my frustration. Some shows pull off cliff hangers perfectly, this show failed. <br><br>If they find funding and fans enough to continue, we'd love to watch it. But, without awful cliffhangers. Great plot and acting otherwise.","user":"casey-may-r","rank":[105,129]}]