[{"title":"By no means perfect, Anti-Social is a worthwhile watch","rating":7,"date":"20 September 2015","review":"While another review on here claimed this to be a poor imitation of Snatch, they seem to have either never seen Snatch or never seen this movie. Snatch, a tongue in cheek look at a crazy unrealistic criminal underworld, was no doubt entertaining to the last drop. Anti-Social, on the other hand, carries a much darker undertone with it, including rape, tragic death of major characters, and the true, unrelenting realities faced by a modern armed robber. Anti-Social doesn't pull any punches and certainly does not glorify the lifestyle in any way whatsoever, instead contrasting it to the much safer (and, it could be argued, much more lucrative in the long- term) career of the street artist younger brother.<br><br>While I have to profess I was a little mystified at the ending, I can't say this movie wasn't worth my time or money. It was generally well acted, the events in it, however far-fetched some reviewers on here may believe them to be, are all ACTUAL events that have occurred in London over the past few years and the movie does an excellent job of putting a human face to the smash and grab robbers of the older brother's gang.<br><br>If you're looking for a laugh, keep looking, but if British crime films are your bag (as they certainly are mine) this movie will likely not disappoint.","user":"Timtacular","rank":[85,91]},{"title":"London's underbelly in stark realism and rite-of-passage journey","rating":8,"date":"19 September 2015","review":"Following the journey of Dee, a working-class youth who drifts from his roots in pursuit of an art career but who is intrinsically influenced by older brother Marcus, a professional armed-robber and aspiring gangster. Dee is a young man with many guises; motorbike courier by day, law-breaking graffiti artist by night, and side-line face London's trendy fashionista circuit thanks to his new girlfriend who is a model. It's a far cry from his family back home on a North London council estate who are entrenched second generation armed-robbers. Marcus leads a tight clique of 'smash and grab' blaggers (the robbery format which has in fact gone near epidemic in London these days), brazenly heisting London's top-end jewellery stores in motorbike raids, and he is managing to do this below the radar of the Flying Squad by keeping his boys and their accessory-to-crime girlfriends in check with the long established criminal codes.<br><br>As the social gap between Dee and Marcus widens, the story focuses on the brotherly love between them and the unspoken loyalty that goes with the criminal upbringing they have. Dee begins mixing with some influential art-dealers who like his anarchist style graffiti and anti-establishment attitude, while at the same time Marcus, who's robberies are now all too frequently making the nine-o'clock news, decides to stay one step ahead and moves into the drugs trade after convincing his boys to pool together their ill-gotten gains. Allying himself with some big time London gangsters and getting too confident in the underworld lifestyle of fast cash and flash nightclubs, he finds himself in an all-out, deadly violent, gang-war with a rival crew of drug dealers from the next neighbourhood over territory and 'ownership' of women. Dee loyally returns to North London in the middle of the violence to try and salvage what's left of his family but before he can make sense of it all, is pulled deep into Marcus' next job (a crime which in real life was Britain's largest ever jewel robbery).<br><br>\"Anti-Social\" recreates in acute detail several of the most highly publicised armed-robberies to have taken place in London in recent years, as Marcus' crew carry out their motorbike raids through shopping centres and have shoot-outs on the West End streets, including the infamous robbery at Selfridges when the robbers disguised themselves as women in Burkas. The film is an uncompromising drama which carefully combines the underworld with commentary on modern London life, and is something of a rite-of-passage story for Dee, the boy from the wrong side of tracks who wants to move to a better future. It contains an array of gritty, brilliantly mounted action sequences, some of which are reminiscent of a Michael Mann film which get the heart pounding, and there are moments of sheer brutality straight after scenes of everyday life, which unsettles but contributes to the sense of realism as the viewer is took on a journey into an unpredictable environment. Thankfully devoid of the usual hard-man, geezer clichés all too common in the Brit gangster sub-genre, the characters are on-the-surface normal guys who do extreme things in a parallel underbelly-society.","user":"Rozzi1","rank":[86,94]},{"title":"This is a great movie!","rating":10,"date":"16 September 2015","review":"I will start by saying that I see a lot of movies. So many movies that I always check the description on IMDb and the score. Then I also watch the reviews to see what other people think. There were only two other reviews and they were pretty much bad reviews. <br><br>But it does have a score of 6 and I could not find another movie to watch. So I thought \"I will just give it a try\" and I am glad I did! This is a good movie! I don't know what the other two people were expecting from this, but maybe something like \"Snatch\" as one of the other reviewers compared it to this. I, however, think it's more like \"The Town\" with Ben Affleck and Jeremy Renner. <br><br>There are two brothers. They have a really good relationship but they aren't alike. One is really into art \"grafitti\" and the other is in a gang of four people. The gang rob jewelries and we also see them use guns sometimes. But even though the two brothers have separated lives, their paths still cross as they want to help each other any way they can. I won't give any spoilers and therefor I won't say anymore about the storyline. <br><br>The acting is great. The camera works great as well. Everyone does a good job. <br><br>I did not find anything wrong with the ending. We are told everything we need to know. We also see a bit more after the credits have begun - so don't stop the movie right away when the credits begin ;) <br><br>I give this movie 10 stars out of 10. Don't hesitate to watch it and if my review isn't enough to persuade you, then watch the trailer or something and just give it a go :) You will know from the beginning if this is not a movie for you :)","user":"kasperdyrendal","rank":[90,104]}]