[{"title":"It's all about the message","rating":7,"date":"30 August 2014","review":"The first Rampage was a shocker for most people because of its crude violence, as we rarely see these days and was a wind of fresh air for those of us who are tired of a movie industry that is too afraid of doing anything remotely controversial.<br><br>Rampage 2 succeeds because it doesn't take the easy route, which will be just to replicate all we already saw in the first movie. Here,we have less killings, but in exchange of that, we are taken into a ride where the main character explain why he thinks that this society is rotten to the core and must be cleansed. Bill essentially deems every political party and corporation as responsible for the injustice in the world. Topics as censorship, corruption, religion and invasion of privacy are constantly brought up by the main character as prime examples of how decadent the society is in his eyes.<br><br>Regarding the action scenes, they are more or less on the same level that we saw on the original, nobody should expect anything new or ground breaking on this department, but hey, why fix what's not broken is just more of the same but the death toll in this movie is not even close to the one on the first one, mainly because in this movie take place inside a T.V station and is a hostages situation, not a killing spree out in the open.<br><br>If you are interested on the character's motivations for his extreme actions, peppered with some good shooting segments, I think you will enjoy this movie, but if you expect a carnage just as big or bigger than the one on Rampage 1, you better start looking for another movie to quench your thirst of blood.","user":"Deadiron29","rank":[41,51]},{"title":"I know what you're thinking...","rating":8,"date":"22 September 2014","review":"An Uwe Boll movie with a rating over 6 stars (currently anyways)? You must be asking yourself if the planets have aligned just right to give this guy some competence? Is the Armageddon approaching? Don't fear though, even the biggest idiots say something smart at least once in their lifetime right? <br><br>I watch Uwe Boll films to have a good laugh, don't we all? This one was a little different (although I did let out a few hardy chortles at Uwe's acting in this film). <br><br>Now, this is no masterpiece of film-making, but i'd say it's still worth a watch. I can't believe i'm saying this about a Boll film... I must be losing my mind. <br><br>The film has a pretty clear, in your face, kind of message (maybe a little preachy). I think the message can be taken all kinds of ways, and it might alienate some of the audience. However, if you just take it for what it is, and go along for the ride it is pretty fun. <br><br>Every single movie has flaws, even critically acclaimed masterpieces. In bad movies it's easy to spot the flaws because you aren't invested in the story. Good movies, with engrossing stories distract you (at least the first time watching) from all the mistakes, minor plot holes, camera-work, and things of that nature. <br><br>This movie had me fully invested in the story. I think Brendan Fletcher's performance is what kept me invested. I mean damn, he is a extremely talented actor. It really is thanks to him that this movie was so fun to watch. You can tell he really gave a s*** about his role and put a lot into it. I believed his character every single step of the way. I'd recommend watching it just to see him act. <br><br>Now this movie is violent (I mean it's called Rampage for Christ's sake) but it isn't full of gore and it give you a break from the violence every once in awhile. <br><br>Again, it's got a pretty clear message and I don't think its really saying anything different or new, but Fletcher's performance does make the message pretty powerful (to me anyways). <br><br>Look, Uwe Boll blows dogs for quarters, but he took a break from doing that and actually made something decent. Check it out, even if it's just to watch a very talented actor put a lot of hard work into a performance. <br><br>I always appreciate it when you can tell someone really had a lot of passion for their role. That someone actually cared about a vision they were trying to bring to the public. Brendan Fletcher does just that.","user":"alkalinetrio1010-108-844328","rank":[30,37]},{"title":"bold and thought provoking","rating":7,"date":"27 August 2014","review":"I do not agree with murder in any way, shape or form, and this is the irony of the movie. But you have to admit most of what he is saying is true, and that government and corporations are at the center of evil and corruption in many ways in society and have been for a very long time, for thousands of years. However, for example, Assange and Snowden would never say to go murder people just to get the attention of others or to expose evil. Neither of them did that. The other side of the coin is many people are losing their lives all over the world because of much of what our own government agencies and United Nations has done, and that has actually been proved. These are not just conspiracy theories either. One example he brought out was the 50 children who died by drone for one terrorist who was not even proved a real terrorist. There is something to say about that also from the Obama drone killings. I also know our government is connected to the phony war on terror, which has been connected to the Mossads being the false Al-Qaeda. War is bred from all sides for one order of evil, and this has been seen in history with Rome, Babylon and pretty much everywhere. This movie of course should never be seen as a justification to murder people, as this is clearly wrong, but one reason why things are going sour in a lot of places is what he is talking about, and that is very real. I give it 7 out of 10 for that. Uwe Boll just has some real guts making movies like this considering shootings that have sadly happened, but I can tell you mind control is not far off from that either in connection. We know how to clone, make robots, send out satellites, etc. etc., so how hard is it to think we cannot control a person or groups with any method, especially seeing in the past projects like MK ULtra and the current Project Monarch? Think about that. Dark movie, but good points are made.","user":"erniecolorado1","rank":[42,71]}]