[{"title":"A great animated movie for all ages a classic in the making","rating":9,"date":"6 October 2015","review":"\"Avril and the extraordinary world\" was presented before the official release at the Anim'est international animation festival in Bucharest. I went to see it after a brief look at parts of the official trailer, without knowing anything about the cast, cartoonist, director and the plot in general. I have to say that it was a magnificent movie, reminding me of some classic Disney style hand crafted animation that I used to love when I was a child. It is beautifully drawn and looks without any flaws. The story takes place in an alternative universe, where some modern inventions where never discovered or made available for the advancement of our societies. This makes you question how would the world look like if we have never used electricity or petrol in our daily lives. And the movie answers a lot of these questions. The plot keeps you for most of the movie engaged and in some small parts at the edge of your seat. The comic release character, a talking cat with the name of Darwin was instantly liked by all people present at the screening, adults and children together. His comments of various situations in the movie proved to be very effective, bringing smiles and laughter all around.","user":"iutes_alex","rank":[25,28]},{"title":"A very unusual animated steampunk, sci-fi, alternate reality picture!","rating":9,"date":"13 August 2016","review":"I recently reviewed a Japanese film and was left a bit indifferent by the film. It's a shame, as I really love animated pictures. Thank goodness I found \"April and the Extraordinary World\"...an animated movie that was delightful and really, really unusual. It isn't so unusual because it's in a steampunk world...a few other films have explored this same sort of material. However, the film offers far more in this odd alternate universe...and it makes the film worth seeing. Fortunately, it just debuted on DVD and is available through Netflix.<br><br>When the film begins, you learn that this alternate tale of planet Earth diverged for our reality in the 19th century. Apparently Napoleon III was a bit of a nut and was intent on using his top scientist to create super-soldiers which the French could use against the Prussians. However, the experiments were failures and soon the French and Prussians made peace. His successor, Napoleon IV, was also a bit of a nut...and tried as well to use the top scientific minds to make super-weapons...but, oddly, soon all the scientists began disappearing...and so the world never experienced the gains of the 19th and 20th century. Electricity never really came into widespread use and instead the world was a dirty, deforested strange steam-driven place...and the French were part of an empire dedicated to war with the United States...a war for resources as the Europeans had completely exhausted their natural reserves.<br><br>Time passes and soon the story soon involves a family torn apart in the 1930s. Napoleon V's agents have been searching for the scientists and a few of them are in hiding in Paris. Soon young April and her scientist parents and grandfather are all separated and the young girl is raised in an orphanage. A decade passes. April lives in a secret hiding place with her talking cat...yes, I said talking cat. Anyway, government agents are looking for April...and assume they can use her to find her family and the other scientists. Here's where it gets weird...yes, weirder than the talking cat! It seems that most of the scientists, including April's parents, are working with aliens...yes, aliens! What are they working on and how does April figure into all this? And, how does the cat become a hero? See this clever mind-bending film and find out for yourself.<br><br>This project has an unusual pedigree. It originally was a graphic novel...which isn't unusual. But it was made and financed by French, Belgians and Canadians! The overall product is a very nice bit of escapism. I liked the story very much as well as the characters. My only complaint, and it's so small that I barely want to mention it, is that the characters themselves weren't drawn to the highest standard. The background and much of the animation was lovely...but April and the rest don't exactly look like Disney or Studio Ghibli quality. I found I was able to look past this.<br><br>So who would enjoy the film? Well, most anyone except younger kids. It is not cute or child-oriented in any way and younger kids would probably be confused and bored. The youngest I'd show it to are kids about 10. Try it if you love anime, try it if you love more traditional animation, try it if you like sci-fi or try it if you just want to see something different. I'm glad I did.","user":"MartinHafer","rank":[12,13]},{"title":"One of the smartest, most imaginative animations ever.","rating":4,"date":"4 May 2016","review":"\"Steampunk is ... a joyous fantasy of the past, allowing us to revel in a nostalgia for what never was. It is a literary playground for adventure, spectacle, drama, escapism and exploration. But most of all it is fun!\" George Mann <br><br>April and the Extraordinary World is an animated French adventure for the whole family (I recommend about 8 years and older) reminiscent of the fantastic 'toons of Hayao Miyazaki (think of Howl's Moving Castle). Leading us through an alternate steampunk history of modern France, April (voice of Marion Cotillard) is a little girl whose scientist parents in 1941 were abducted by the \"Empire\" to advance the cause, in this case by creating an immortality drug.<br><br>With her charming talking cat(a product of the scientists' experiments), April spends her youth confronting malevolent forces like a driven policeman (Javert anyone?), a roguish boy, and nature itself. Not one moment of the 1 hr 45 min is wasted; each is crafted under the expert direction of Christian Desmares and Franck Ekinci for maximum adventure and humanity (for example, love may be blooming and Grandpa Pops is feistier than ever).<br><br>The graphics as well are outstanding in the steampunk visual style with the omnipresent steam and pipes, furtive surveillance rodents, bicycle-powered blimps, and suspended trolleys, among some of the creative expressions. Although great advances such as the use of electricity and oil have not been discovered, the above-mentioned steam objects awe April as she navigates this alternate universe of coal and wood.<br><br>Conservationists shouldn't despair, for there are numerous references to the need to use coal, for instance, responsibly—already coughs are in the ambient sound. The suggestion that without the invention and use of atomic energy and fossil fuel, the world could have been stuck in an ecological disaster is an intriguingly benign take on modern energy.<br><br>The extraordinary April and the Extraordinary World is nothing if not an invitation for girls to follow their dreams and create as their talents demand. For all children it is a call to be bold and responsible as they enter the real modern world.","user":"jdesando","rank":[17,21]}]