[{"title":"Zombie film with braaaains.","rating":8,"date":"26 September 2018","review":"If you are looking for a purely mindless crimson-sprayed gangrenous brain-gorging splatter-fest, The Cured is almost guaranteed to bore you to tears. Not that it is lacking its share of gore and heart-pounding zombie-runs, but this film is focused on the social and interpersonal dimensions of a post-infection world, rather than running for your life and mashing Zombie brains in order to keep your own grey matter off the menu. As a well-crafted tale about \"othering\", and the directed and broader impacts of the alienation of one group by a \"well meaning\" majority, this film, possibly unintentionally, delivers an almost perfect analogy for the impact to the broader gay community of the AIDS epidemic in the 1980s and 90s. The film also maps successfully to the impact of demonising migrant, ethnic and religious groups (very possibly its intent, coming from Northern Ireland); take your resonant flavour of \"othering\" and insert here. A stark, brutal and effective expository. If you want to cook up extremists, this film delivers the recipe...<br><br>As an experimental vehicle for the fabulous Ellen Page, this film didn't get the exposure it deserved - Page once again proves both her versatility and her ability to believably breathe gritty appeal into the characters she inhabits. The other key cast were equally compelling, save maybe for Paula Malcomson, who maybe didn't receive the best treatment from the production - she felt atypically undercooked as Dr Lyons.<br><br>A must-see if you want some gore and splatter to go with a massage of your grey matter.","user":"troy-boulton","rank":[25,28]},{"title":"Not everyone has seen In The Flesh","rating":8,"date":"25 June 2018","review":"This is my first review. there are no spoilers. I thought this was a good premise for a movie - not all of us live in the U.K., sadly. It was well written, very well acted, and I really quite enjoyed it. From someone who is really quite versed in the zombie genre, I thought it was comparable to The Girl With All The Gifts; a fresh take on the zombie narrative. I would recommend it, certainly, if you're a sucker for zombie films. Though it has a somewhat predictable plot, overall it was an enjoyable film, with some really interesting elements thrown in. I'll watch it again.","user":"lisadyoung","rank":[45,59]},{"title":"To call this a zombie movie is a disservice","rating":8,"date":"18 November 2018","review":"I enjoyed watching this movie very much and I can easily see myself watching it multiple times.<br><br>This is so much more than a zombie movie. To me it presented bigger questions about our own humanity and how we treat others. Even how some people who strive for power over others will manipulate and use others for their own goals.<br><br>The director and the cast did a great job and I loved how some of the back stories behind the main actors were explained if you took the time to watch the movie.","user":"jrneptune","rank":[15,19]}]