[{"title":"Poorly Written!!!!!","rating":6,"date":"27 October 2014","review":"This movie had a great cast. I liked most of the actors in their respective roles but the script was terrible. The situations were contrived. Most of the conclusion that the main character drew were based on faulty reasoning. The decisions they made to solve problems or get out of dangerous situations were always based on bad decision making. I found myself constantly saying aloud: \"No one would do that.\" More than once, someone was accused of a crime based on ridiculous logic. This was a Murder Mystery; a formula that calls for a certain amount of logic and deduction. I found both sorely missing. I really liked Erica Durance in the lead. I really hated the lines they obviously forced her to say. As Hallmark Movies go this was the most disappointing one I have ever watch. Disappointing because it had all the elements to be enjoyable. If, when you suspend belief while watching this, you also suspend logic and reasoning, you may still be able to enjoy this movie.","user":"NateWasHere","rank":[9,11]},{"title":"Murder was only a preliminary","rating":6,"date":"22 July 2016","review":"Lately the Hallmark Channel has been having all kinds of amateur female detective heroes in their films. It's all in the grand tradition of that most famous and successful amateur sleuth of the female gender Miss Jane Marple.<br><br>Erica Durance is our detective here and as you see by the title she's a wedding planner. Right now she's planning her rich friend Chelan Simmons's wedding. But there are a lot of complications like a feud between her father and his former business partner, both of whom are under investigation. And then there's the death of a cousin of Simmons in a car crash where the car was tampered with.<br><br>While all this is going on Durance is also being courted by reporter Andrew Walker and lawyer Brandon Beemer. Who will she choose?<br><br>As it turns out that murder was only part of a greater scheme hatched by members of the cast. That's what Durance has to foil to get this wedding back on track.<br><br>Wedding Planner Mystery was a pleasant enough mystery with some good performances by the ensemble. Hallmark with its PG programming is providing some good entertainment with these films.","user":"bkoganbing","rank":[3,3]},{"title":"Cast Good; Script Bad - my own 2 cents","rating":6,"date":"4 February 2017","review":"I love Erica Durance; the other cast members were good and believable. However, the script was the worst. I see others came to the same conclusion. I, unfortunately, cannot suspend enough (belief, logic, you name it) to enjoy this movie as a murder mystery. I finally figured out the only way to enjoy it was as a comedy. And that worked. It's amazing that Hallmark airs this because most of their murder mysteries, in addition to having good production values, are fairly well written. This is a major bump in the road from that angle.<br><br>Note that I absolutely believe there are people out there who are dumb enough to act this way. But no one should make a movie about them! It just gets viewers upset over nothing.","user":"mikerjones","rank":[3,5]}]