[{"title":"Seriously...Again??","rating":2,"date":"22 July 2018","review":"This is by far the most played out setup of horror movies today. A group of young paranormal investigators go to a haunted house to try and capture on film the existence of the supernatural. You'll never guess what happens. Actually, you already have. <br><br>The formula goes: cheesy jumpscare, everybody makes excuses for what's happening, eventually everything settles down, someone dies, and repeat. There is absolutely nothing new here. All of the deaths occur in the same fashion with no originality at all. There are zero scares to speak of. ALL of the \"special effects\" are nothing more than camera movements, cut-aways, bad makeup, and filters. The acting is barely passable, there is no character development, and the story is completely nonsensical. <br><br>Do not waste your time on this one. You have already seen the better and equally bad versions of this movie and there's no need going back for more. I get that these are easy movies to make, but come on. This is getting really old.","user":"mikedegroot","rank":[23,27]},{"title":"Um...how do I get my money back?","rating":1,"date":"12 August 2018","review":"Acting: terrible. Storyline: so full of holes I can see my own hand. Just no.","user":"lishiana-damico","rank":[13,15]},{"title":"\"Billy?\" \"Where's Billy? \"Billy!\" \"Billy?\"","rating":5,"date":"23 July 2018","review":"This was a well-acted, well-directed film. It just needed a better, more engaging and compelling story. And a more creative one. <br><br>The scene with the ever-returning ball has become a cliche in horror films, showing up in A BLADE IN THE DARK, THE CHANGELING and THE SHINING. So,\nwhy do it here? And you can always tell when a film is lacking in scares when it\ndoes the \"fake\" scares, and this occurs two or three times. It's just done to keep the viewer awake because the screenwriter realizes the script is...kinda boring. Finally, the pacing and some of the reactions are way off. One character is murdered and there's not much of a reaction to their friend being killed. Then it happens again, and still, very little emotion is shown. And at the one hour mark, I realized I was kind of bored. But instead of ratcheting up the tension for a slam-bang finish, everything slows to a crawl. One couple even prepares to have sex! REALLY? By this point, I think three people have been killed, you can't get out of the house, so you start making out...and the film stalls. <br><br>There is some terrific talent here, I just wish they had been better served by the script. And when one person disappears--Billy!--all they do is ask, \"Where's Billy?\" \"Have you seen Billy?\" Not a lot of concern for the missing fellow. This would have been a much better film with an original story instead of rehashing what we've seen.","user":"derekjager","rank":[6,10]}]