[{"title":"Low Budget?? This is BEYOND Low budget!","rating":1,"date":"1 May 2017","review":"This film infuriated me from the word go, really. I know a lot about low budget filmmaking and I understand that this film is not necessarily the worst low-budget film ever made... but it comes very close. Here are my two main gripes:<br><br>1. The acting - absolutely atrocious! From fumbling accents to people who can't cry/look scared properly, the acting in this stinker is all over the place!<br><br>2. The clown character in this is NOT menacing at all, with cheap costume, very bad acting (see above) and appalling voice characteristics, this character (who could have worked well) simply flopped.<br><br>Now, I am a veteran horror and low budget film watcher, 35+ years experience in watching them, and I have seen many films with HALF the budget of this which have been much better than this (not to mention half the trash that Hollywood spews forth every year).<br><br>There's no excuse for this - bad filmmaking that the director should be bloody ashamed of...","user":"KittyKelly1976","rank":[32,42]},{"title":"Worst movie ever.","rating":1,"date":"1 May 2017","review":"I had to give it one star because zero isn't an option. Really don't know what to say except what a waste of time, watch a bunch of backpackers on an island in Thailand trying to make a scary low budget B movie. Classified as a holiday adventure would be more accurate. I've no idea what the movie is trying to be or say. Avoid. 0/10","user":"psxexperten","rank":[11,13]},{"title":"Thailand is Beautiful but this movie STINKS","rating":1,"date":"29 October 2017","review":"I am an American watching this movie in South Korea with my Thai wife. We wanted to like the movie as we live part time in Thailand. Unfortunately, this movie was awful. <br><br>The acting was atrocious and the story was ridiculous. No explication of the killers' motivation at all. It is one of those movies where the characters are inexplicably stupid and make decisions that nobody in real life would ever make.<br><br>90 minutes of my life shot to hell.","user":"stevenkongju","rank":[4,4]}]