[{"title":"Jennifer Aniston is convincing as a chronic pain sufferer in Cake","rating":8,"date":"9 September 2015","review":"Jennifer Aniston plays Clare, a woman in chronic pain who becomes curious about a fellow support group member's-Nina's (Anna Kendrick in dream sequences)-suicide. She ends up becoming involved in Nina's husband (Sam Worthington) and his child platonically though she also has a maid who also cares for her even though she doesn't always treat her with the utmost respect. I'll stop there and just say this was quite a departure for Ms. Aniston from her usual comedic persona as she's convincingly quite pathetic in appearance and demeanor. This was not an easy thing to sit through and one gets confused a few times but for all that, I recommend Cake.","user":"tavm","rank":[16,16]},{"title":"Why the 'Oscars' are irrelevant...","rating":9,"date":"14 January 2015","review":"So... a pretty, funny, former sitcom actress... gives us a few signs that she might be capable of playing roles outside of the 'amusing chick' rom-com regular. <br><br>She does parts that secure her reputation of being a talented American 'cutie', she plays 'off-beat' characters with ease... and only occasionally lets the 'pay-day' Hollywood 'starlet' see the light of day. <br><br>Then she does this. A film that explores suicide, mental illness, self-loathing and the morality of friendship.<br><br>At the age of 60, I have gotten used to the annual round of 'Oscar Worthy' films being shoved down our throats... but this is different. Fine writing, authentic story telling... and unnecessarily great acting. <br><br>Any 'Oscar' hungry actor could have made a decent job of this... but Ms Aniston makes a brilliant job of it. She is no 'pretty-girl' actor here... she displays vulnerability, courageous wit... and does it all with aplomb.<br><br>If she doesn't get 'Best Actress'... the 'Oscars' are irrelevant.","user":"soupster1","rank":[193,235]},{"title":"More than an Aniston Oscar vehicle","rating":8,"date":"12 January 2015","review":"It's not hard to guess why critics and audiences might be turned off by Cake. For the first half, Jennifer Aniston's Claire is snarky with a comeback for everything, manipulates and abuses everyone around her, and indulges in a constant, expensive pity party, and we aren't told why. Once the meat of the story reveals itself, however, Cake is astonishingly clever, delicate, and emotional.<br><br>Claire Bennett is the apparent victim of an unexplained accident that left her with chronic pain, a bad attitude, and a trail of broken relationships. After a woman in her pain support group commits suicide, Claire tracks down the woman's husband in a curiously misguided search for answers. <br><br>It's not the most unique premise, but screenwriter Patrick Tobin takes the story in unexpected directions, avoiding clichés and handling the subject matter with surprising grace. Director Daniel Barnz could have used some more time in the editing room -- certain side characters and subplots get either more or less time and background than they deserve; why Anna Kendrick's character made it past a rough cut is beyond me -- but in his hands a wordy screenplay becomes visually interesting, moves along at a comfortable pace and is backed by a reflective, unobtrusive score. His direction, and so the movie, really won me over at the climax, where after an hour and a half of sarcasm and one-liners Claire shuts up for once and finally lets the pain in. It's a beautiful, heartrending scene, and the decision to rest Cake on Jennifer Aniston's shoulders was absolutely the right one.<br><br>I never thought much of Adriana Barraza in Babel and have only seen her in a couple of other movies but she adds so many personal touches to the role of Claire's maid/cook/home health aide/best friend, she has a real talent for empathy and nuance. Jennifer Aniston, though, is the standout. She clearly reveled in the chance to break away from Rachel and she aced it. There's a tiny moment where Sam Worthington's character tells her she's messed up, and she plays the reaction shot so completely differently from anything she's done in the past - that's when I really started believing her in the role and she only got better from there. She nails her character's dry sense of humor and selfishness, and knows exactly how much charm to give her to make her watchable if not likable. It's a seriously committed, seamless, career-defining performance and she'd be my pick for this year's Oscar.<br><br>Verdict: watch it for Jennifer Aniston, walk away pleasantly surprised.","user":"Emma_Stewart","rank":[118,145]}]