[{"title":"A wonderful surprise!","rating":9,"date":"18 August 2017","review":"Like some have written before me, I was ready for something in the vein of Lost Boys... Instead I was served an amazing coming-of-age story, a surreal depiction of how cruel kids can be - and what good they are capable of. Part memories, part imagination, add real life, myths, and a sprinkle of the paranormal - this is the recipe for a very good film.<br><br>A layered film that should have obligatory screenings at high-schools world wide. (I hope kids today get it)","user":"berencamlost","rank":[42,48]},{"title":"Saying farewell to childhood","rating":8,"date":"3 October 2017","review":"It is Halloween and a bunch of mean boys are going out to have some fun. One of them is starting to out-grow the group, especially when they pick on another boy he knows from when they were kids. The bullied kid black mails his old friend to spend the evening with him.<br><br>This is a coming of age film with a heavy under lying sense of menace, the horror element is very slight indeed.<br><br>The film has a slight surreal feel about it, all the adults leave the kids to run amok across town and everyone bumps into each other in the most unlikely of places.<br><br>There is a certain inevitability about this film that could be seen as predictability but I quite liked it.<br><br>The dynamics of the gang are portrayed with great zeal and shows how strong personalities can cloud the better judgement of others.<br><br>Well filmed, produced and acted. Some of the kids look a little bit old but their acting skills make up for it.<br><br>You will see the ending coming a mile off and there isn't much meat to the story but this was a very enjoyable Netflix watch.","user":"thekarmicnomad","rank":[23,25]},{"title":"Don't believe the negative reviews","rating":9,"date":"29 October 2017","review":"This is not a horror movie, what it is is a coming of age movie. Much like Stephen Kings \"Stand By Me\", if you liked that movie you won't be disappointed. I don't think that this info is really a spoiler but, there is a ghost and ghosts of memories and dreams that can only be made in childhood. Ghosts of promises made, promises broken and when to run with the wolves or stand on your own. I gave this movie a 9, I don't do 10's because I'm not at deaths door and who knows what next great film I'll come across.<br><br>Add on: The negative reviews were written by those who expected a true \"horror\" movie and/or under the age of 14.","user":"vmalast","rank":[25,28]}]