[{"title":"Hollywood has reached peak remake season","rating":3,"date":"26 August 2019","review":"I am not sure why Hollywood keeps remaking and remaking (hello Lion King) films. Well, I suppose it has to do with taking cash from simple folks and a lack of ideas but how about a minor nod to integrity and art, folks? Get some of the latter and stop making and remaking please.\nMurder On The Orient Express is as needed in a new film as yet another trashy tattoo on a footballer or another Miley Cyrus affair, er marriage...\nSpecifically the acting is bad.. the girl from Star Wars should just throw in the towel and the director has forgone colors in favor of grey all over.\nSIgh.","user":"treycekensei","rank":[135,168]},{"title":"Shock! Horror!!! Gasp!!!!!","rating":3,"date":"7 May 2019","review":"Who knew?? Not every (any) film needs to be remade and remade and remade. Don't make a film if you have no ideas. That is how it works!\nThis film was terrible. It was dull in script and visuals and also made the boring and vapid morals seem even more tired.<br><br>What I also suggest is that the eye for an eye stance is immoral and wrong. One crime does not deserve another. It is understood that Poirot brings the set of criminals to justice, but let's not assume that revenge is justified.","user":"rahuldyllon","rank":[146,191]},{"title":"Difficult to Review","rating":5,"date":"10 November 2017","review":"Difficult Kenneth Branagh makes, produces, and stars in good movies, and this version of Murder on the Orient Express features impressive sets, beautiful scenery, and lovely period clothes. An impressive case features Penélope Cruz, Johnny Depp, Derek Jacobi, Michelle Pfeiffer, Judi Dench, Willem Dafoe, and Kennth Branagh as Hercule Poirot. I think those who are not familiar with Agatha Christie, Poirot, or the story may very well like this movie.<br><br>I, on the other hand, was massively disappointed, especially by Branagh as a sort of English upper-class colonel with a stick-on cavalry moustache and by the needless addition of an introductory scene at the Wailing Wall. But I am prejudiced. I read the 1934 novel decades ago and again more recently. I liked the 1974 star-studded version with Lauren Bacall, Ingrid Bergman, Jacqueline Bisset, Sean Connery, John Gielgud, Wendy Hiller, Anthony Perkins, Vanessa Redgrave, Richard Widmark, and Michael York—despite the fact that Albert Finney was a very poor version of Christie's Hercule Poirot. <br><br>In my opinion, the 2010 television version of the story starred David Suchet as the definitive Poirot, and the ending was far and away the best of all the versions with which I am familiar. So I think Christie fans may want to skip this edition of the classic.","user":"WylieJJordan","rank":[335,452]}]