[{"title":"Let it Stand Alone","rating":8,"date":"15 July 2016","review":"Personally, I was enthralled with this Western from the start and stayed that way. It delivers twists and turns that keep you planted to your chair, and after reading some of the reviews of others, I was surprised at the 'nic picking' that went on while comparing it with the 'Hateful Eight\". This movie stands on its own, and if H8 hadn't of been out, then I feel the reviews would have been more favourable. I thought it was great...it certainly turned corners and ventured into areas that would/or may offend others, yet being a lover of good movies, this 'epic' kept me glued to the screen. It is certainly well worth the watch, so you can determine for yourself.","user":"brockleyavenue","rank":[38,63]},{"title":"An ultra violent, psycho-sexual art house flick. Totally unique","rating":10,"date":"6 August 2016","review":"I think the main problem when it comes to the bad reviews here is that many folks watched this expecting a western and it's only a western because of the time period. The story isn't for fans of westerns, clearly, and people expecting the same old satisfying formula plot points in a normal western are going to be sorely disappointed. This is a wild ride. Fans of Bad Lands, Killer Joe, Natural Born Killers and Goodfellas will have more in common with this than anyone else. Acting is incredible. Story is totally surprising and unique. And that gorgeous and grainy 35mm film is absolutely stunning. Not for the faint of heart, but a damn good ride.","user":"noremakeassistant","rank":[33,55]},{"title":"Good western","rating":8,"date":"29 July 2016","review":"An excellent low budget western, shot in the style of your favourite 70's westerns. I can't believe some of the negative reviews. It is well acted, well shot with some great thoughtful moments and has a nice flowing style with a few twists and turns. I really enjoyed this film leading up to a great last half hour.<br><br>It helps being a huge fan of westerns but I think some reviewers think the western starts and finishes with the Hateful Eight.<br><br>This film deserves more than 5.4. If you are a fan of westerns check it out. If you are 16 years of age move on,, <br><br>Can't wait to see more from this writer director.","user":"bogle-63500","rank":[28,47]}]