[{"title":"\"I'll. Be. Right. Here.\"","rating":9,"date":"5 January 2017","review":"The worst thing about this movie is its title. The second worst thing about this movie is its trailer. Both will either a) put people off seeing it (it succeeded in that with my wife for example) or b) make people conclude it is a 'nice holiday film to take the kids to', which is also an horrendous mistake!<br><br>This is a crying shame because it is a riveting drama and a superb piece of film-making that may well catapult it already into my top 10 films of 2017. But it is not, I would suggest, a film that is remotely suitable for kids under 10 to see, dealing as it does with terminal illness, bullying and impending doom. For this is a dark (read pitch black) but hauntingly beautiful film.<br><br>Lewis MacDougall, in only his second film (after last year's \"Peter Pan\") plays Conor - a young but talented and sensitive artist growing up as a 12 year old in the North of England with his single mum (Felicity Jones). She is suffering from an aggressive form of cancer and is forever medically grasping for a new hope (D'ya see what I did there?). Young Conor believes fervently that each new treatment will be 'the one' but the building tension, the lack of sleep and his recurrent nightmares are destroying him mentally and physically. As if this wasn't enough, his distracted nature is leading to him being seriously bullied at school and there is the added stress of having to live in his grandmother's pristine and teen-unfriendly house when his mother is hospitalised. <br><br>Towering over the nearby graveyard on the hill is an ancient yew tree and Conor is visited after midnight by this \"monster\" (voiced by Liam Neeson). Is he dreaming, or is it real? The tree dispatches wisdom in the form of three 'tales', with the proviso that Conor tell the tree the fourth tale which \"must be the truth\".<br><br>A tale of grief, guilt and a search for closure, this is a harrowing but rewarding journey for the viewer. <br><br>The film is technically outstanding on so many levels:<br><br><ul><li>the art design is superb, with the gorgeous 'tale animations' being highly reminiscent of the beautiful ones in \"Harry Potter and the Deathly Hallows, Part 1\"; </li></ul><br><br><ul><li>the use of sound is brilliant, with sudden silence being used as a weapon with which to assault the senses in one key sequence; - the cinematography by Oscar Faura (\"The Imitation Game\") is faultless, capturing both the dreary reality in a Northern winter with the comparative warmth of the strange dream-like sequences;</li></ul><br><br><ul><li>the music by Fernando Velázquez is used effectively and intelligently to reflect the sombre mood; </li></ul><br><br><ul><li>the special effects team led by Pau Costa (\"The Revenant\", \"The Impossible\") shines not just with Neesen's monster, but with the incorporation of the root and branch effects into the 'normal' surroundings. </li></ul><br><br>As the BFG illustrated, having a whole film carried by a young actor is a bit of an ask, but here Lewis MacDougall achieves just that like a seasoned pro. His performance is nothing short of staggering and - although a brave move by the Academy - it would be great to see him nominated for a BAFTA acting award for this.<br><br>Confirming her position in the acting top-flight is Felicity Jones, heart-wrenching in her role of the declining mum, and Sigourney Weaver is also excellent as the po-faced but grief-stricken grandmother. Liam Neeson probably didn't add much by getting dressed up in the mo-cap suit for the tree scenes, but his voice is just perfect as the wise old sage.<br><br>The only criticism of what is an absorbing and intelligent script is the introduction of Conor's Dad, played by Toby Kebbell (Dr Doom from \"The Fantastic 4\"), who is literally flown in from LA on a flying visit but whose role is a little superfluous to the plot. <br><br>This is exactly what \"The BFG\" should have been but wasn't. It draws on a number of potential influences including \"Mary Poppins\"/\"Saving Mr Banks\" and \"ET\". Wise, clever and a thing of beauty from beginning to end, this is a treat for movie-goers and a highly recommended watch. However, if you have lost someone to \"the Big C\" be aware that this film could be highly traumatic for you..... or highly cathartic: as I'm not a psychiatrist, I'm really not that sure! Also, if you are of the blubbing kind, take LOTS of tissues: the film features the best use of a digital clock since \"Groundhog Day\" and if you are not reduced to tears by that scene you are certifiably not human. <br><br>(For the graphical version of this review, please check out http://bob- the-movie-man.com).","user":"bob-the-movie-man","rank":[194,225]},{"title":"Absolutely blown away","rating":9,"date":"14 December 2016","review":"When I first walk into theater, I was not expecting much of this. Yeah, the first moments were so cliché I thought this would just be a mediocre movie at best. But after the movie, everything changed, and this became one of the best movies I've seen in years The director use beautifully rendered CGI to deliver the emotions of a struggling young boy coping with reality. It was already a hard concept that few movie successfully delivered, and yet he make so many people I know broke down in tears. Moreover, he also make use of the visual to express the incredibly complicated yet meaningful plot of the movie, constantly changing between fantasy and reality, truth and lies, acceptance and the growing of a boy into adulthood. The main actor while only a young man has already show signs of greatness, you can only wonder if he had already gone through all of this. He also actually took the time to developed each character, making the audiences attach to each and everyone of them. Which is why the ending was even more dramatic and sad for many of us And the soundtrack, oh man, the soundtrack just hit me where it really feels, this is probably the best part of this movie. Whether it's total silence for contemplation of characters or full- on orchestral work for the climax or the sad violin, man, they totally nailed it.","user":"assassin-42523","rank":[140,169]},{"title":"Emotionally Honest","rating":9,"date":"5 January 2017","review":"A Monster Calls is the rare movie geared toward a younger demographic which refuses to pull an emotional punch. The movie explicitly states that the protagonist, Connor O'Malley, is \"too old to be a kid and too young to be a man\". The introductory tagline is the perfect way to relay the film's tone to the audience. From the brutally honest acting to the gorgeously animated \"stories\", A Monster Calls allows raw emotion to emanate from the experience. Magic on the screen happens due to the unique specificity of our hurt hero. The fantastical elements found in a typical family movie organically merge with the painful reality of adulthood. For example, a fight will begin building up in Connor and the anger will call out the monster. The monster is never a simple vicarious outlet for the young adult. Instead, the monster is a well-executed manifestation of perceived guilt towards a deeper truth. Liam Neeson's monster revels in the humanity of the moment while also holding a magnifying glass up to it. Life continues to get worse for Connor and each appearance leads to a gradual slip of harsh reality. Refreshingly, A Monster Calls never hides that uncovering important personal insight is a painful process. The climax makes up for one of the most touching revelatory moments in modern cinema. The value of the film is revealed in how both children and adults in the audience gain a better understanding of the inherently personal nature of grief. The way we deal with a loss can come across as something else entirely for ourselves. A wide release of the film will hopefully begin to kindle in an audience a desire for introspective cinema. In a sense, specific scenarios are able to paradoxically tap into a universally human truth. Movies like A Monster Calls show a better alternative to the next soulless generic blockbuster movie.","user":"kraytdragon-sean","rank":[72,90]}]