[{"title":"Runners to your marks: Ready: Set: \"RACE\"","rating":5,"date":"23 February 2016","review":"Maybe not as prominently remembered as he once was, Jesse Owens, was one of those men in history who was able to overcome the many barriers in his life to exemplify greatness. Not only as an athlete, but as a human being.<br><br>\"RACE\" is the story of Jesse Owens(Stephan James) from 1933 through 1936. James Cleveland Owens was born in Alabama and at age 9 moved with his family to Cleveland, Ohio. It was in Cleveland where one of his teachers, unable to understand his thick southern accent, thought he was saying his name was Jesse when in fact he had been saying JC. This mistake led to JC being known as Jesse for the rest of his life.<br><br>A prominent high school track athlete, Jesse entered The Ohio State University in 1933 and began his NCAA track career under the tutelage of legendary track coach Larry Snyder(Jason Sudeikis). Snyder recognized greatness in Jesse the first time he watched him run and let Jesse know that he would be able to compete and win in the 1936 Olympic Games.<br><br>The movie moves from Jesse's life and troubles to Nazi Germany and back again. The story of The Amateur Athletic Union(AAU) and the American Olympic Committee(AOC), struggling with the decision to attend or boycott the games, runs parallel to Jesse's trials, tribulations and his ultimate success.<br><br>When the AAU and AOC make the decision to attend the games, the NAACP asks Jesse to refuse to enter. Due to the atrocities being committed against the Jewish population in Germany and the open hatred the Nazis expressed toward other races as well, the NAACP felt Jesse's refusal to attend the games would make a strong statement. The decision to attend the games by Owens turned out to be a much more powerful statement than could ever have been imagined. As the scene unfolded and the representative of the NAACP told Jesse what a strong statement his boycott would make, I was hoping the writer's would have had Jesse respond by saying, \"It will be much more meaningful for me to attend the games and come home with the Gold\" – or something along that line.<br><br>Jesse Owens, to me, has always been one of the larger than life individuals that only come along every so often. The film not only celebrates Jesse Owens' accomplishments, it also emphasizes the wrongs to which people of color had to endure in the United States. Even at a dinner held in Mr. Owens' honor, Jesse and his wife were asked to enter the hotel through the service entrance. The filmmaker's parallel stories of Jesse and Nazi Germany, as they prepare for the games, brings to the forefront the hypocrisy of our American Ideals and what was really happening to many of our citizens. \"RACE\" is a title that fits well because it not only speaks to Jesse's prominence on the track, but to the relationship between the citizens of this planet.<br><br>The story is a worthwhile one. Historical figures like Jesse Owens need to be kept in our memory. However, as great as Jesse Owens was, this was not a great film. At 134 minutes, I felt it was a tad too long. I also felt it dragged somewhat at various times. Although the parallel story of what was happening in Europe at this time in our history is important, I feel to much time was spent on that story and not enough on Mr. Owens.<br><br>I recommend seeing this film although I feel the matinée price would be the best option.","user":"steve_ford53","rank":[29,40]},{"title":"Poor research?","rating":4,"date":"22 May 2016","review":"I think the script writers were confused. Either they don't know the difference between Cleveland, Ohio and Cleveland, Mississippi, or they don't care, which would be even worse.<br><br>There was no discrimination in public accommodations in Cleveland, Ohio in the 1930s. African Americans did not have to sit in the back of the bus. When the script called for Jessie Owens to sit in the back of a bus in Cleveland, Ohio, it was in complete disregard for the truth. I checked with my mother, who went to the same high school with Jessie Owens. She went everywhere on the bus or the street car. Everyone did. And they all sat together, black and white. <br><br>Another problem with the script was the blatant racism in the locker room at Ohio State University. The Buckeye football team was already integrated by the time Jessie Owens arrived. William \"Big Bill\" Bell was an All American for the Buckeyes, and played from 1929 to 1931. I guess there could have been some racists who gave Jessie Owens some grief in the locker room, but it certainly would not have been so institutionalized as depicted in the film.<br><br>As much as those blatant misportrayals bother me, the thing that bothered me most was when Jessie was agonizing over whether to go to Berlin, his wife told him that he was never much good at thinking, so he should not do it. How much more racially condescending could the script writer be?<br><br>What a shame that this movie that could have been a rich source for teaching a moral lesson instead was turned into a source of misinformation and condescension. <br><br>The movie had some good moments, so I give it 4 out of 10 stars. Do not accept it as a reflection of reality, as it is not.","user":"DrZom-77-388656","rank":[42,71]},{"title":"May take liberties with actual events","rating":7,"date":"20 April 2016","review":"'Race' is an overall entertaining movie hampered by some fairly predictable flaws. It features pretty standard sports movie clichés, e.g., hard-ass coach with heart of gold, rival who becomes best friend, etc. The personal (melo)drama seems pretty mundane, and, as to be expected in historical dramas, certain liberties are taken with the facts for dramatic purposes. But there is interesting dramatic tension in the scenes in which the US Olympics commission debates boycotting the '36 games, and in Owens' personal struggle over whether to compete in the face of certain factions of the black community entreating him not to. The actual scenes of competition are presented in an exciting fashion. My favorite scene captures Owens' P.O.V. as he enters Berlin Stadium at the height of pre-War Nazi pageantry, Hindenburg flying overhead, Hitler waving in the stands to a thunderous chorus of \"Sieg Heils.\" It must have been overwhelming. Carice van Houten plays Leni Refienstahl as a sympathetic character, defying Goebbel's orders to tell the true story of the 1936 Olympics, and Stephan James as Owens provides an enjoyable leading performance.","user":"pcqgod","rank":[21,33]}]