[{"title":"Lifetime didn't make this melodramatic comedy?","rating":1,"date":"17 August 2019","review":"So much went so wrong so quickly. There are some decent actors making do with a bad/cutesy script and some serious overacting by other actors. This is the kind of movie where everything that can go wrong does in the course of a Thanksgiving-how cute! The main character tries to tell her family she's dating a woman 1,000 times but no one listens, and her male roommate shows up and they think she's dating him. Hijinks ensue-how cute! A fire gets accidentally started, the turkey is ruined, half of the family gets high on pot, the way underage cousin tries to seduce the male roommate-- *cue laughter.* I could go on, but do you really want me to? Super annoying and unrealistic.<br><br>Tries wayyyyy too hard to be a witty, funny movie but with the talent of Lifetime network writers. Unrealistic, ridiculous, and just plain unfunny. Also not as endearing as it tries to be. It really was written exactly like a silly holiday lifetime movie.","user":"earthboli","rank":[7,8]},{"title":"Batman vs Lesbians","rating":8,"date":"10 November 2018","review":"I'll just say this: check IMDb's rating statistics. You'll note a majority of ratings is 1, and it comes mostly from young boys and old men, but not from ones 18-45, and th emost voted for review only mentions a male actor in the review, otherwise is suspiciously vague, and comes from a man who rated Hot Fuzz 1 and I can only hope wrote a bot to rate all untranslated Pokemon anime 10.<br><br>After you remove this artifcat, those you could expect to be in a relationship suggest a 7.0 score. You'll see the average rating from women is 6.7, peaking at 8 in one group. My opinion is that these scores reflect the quality of the movie.<br><br>Now, consider who most likely watched this movie before rating, and who decided to wage a homophobic war on a rom-com.<br><br>*sigh*","user":"madameminty","rank":[48,76]},{"title":"Fun family comedy","rating":9,"date":"10 November 2018","review":"Lez Bomb is a great throwback family comedy, the kind that was popular in the 90s/00s and don't seem to be made anymore, but with a lesbian twist. Fast paced, funny, and with a great cast--Deirdre O'Connell is a particular standout. Tons of heart, lots of fun, highly recommended!","user":"wipsaunders","rank":[18,29]}]