[{"title":"Unlike Flowers in the Attic, Petals on the Wind is Nothing Like the Book","rating":3,"date":"24 April 2016","review":"I got my hands on these novels when I was in early high school. My mother had owned them and I found them in a box in the basement and devoured them. As an adult, of course this series is a lot creepier than I though it was then. <br><br>After watching the first in this series, Flowers in the Attic, and finding it to be not too far reaching from the original storyline, I had high hopes for the second, this installment, Petals on the Wind. Unfortunately, I was sorely disappointed.<br><br>The fact that it opens up to Dr. Paul Scheffield's funeral was enough to send me digging through my bookshelves to make sure that I wasn't remembering everything wrong. Sure enough, Paul was just as big a part of that book as I had remembered. Not only did he take the three siblings in, he nearly married Cathy! Removing him from the movie's storyline did it a great injustice.<br><br>Then there was the horrible job done of Cathy's career (in the books, she was going on world tours), Julian (they were married, he tried to destroy her feet, and after the accident - which Cathy was NOT in - he killed himself), Henny (she was mute!) Chris's turmoil (he was NEVER able to overcome Cathy - there was no Sarah in the books and that whole thing doesn't even fit with the story), Carrie's unhappiness (she was incredibly depressed during most of the book, and at the school, the girls left her bound, gagged, and blindfolded on a roof to die - she survived but broke her leg), and her death (Alex was not a minister to start with - Carrie had an ingrained fear of religion thanks to the grandmother), and Cathy's views of her mother (she did not try to reach out in love - she only wanted revenge in the books, and PLOTTED to steal her mother's husband). This wasn't just omitting parts of the story or changing little details to make a film watchable (think Harry Potter and the Goblet of Fire). They had to completely rewrite entire chunks to make their botched adaptation work.<br><br>I have not watched If There Be Thorns or Seeds of Yesterday yet, though I will. Hopefully they fare better than this one. <br><br>It's an okay movie overall for a Lifetime.<br><br>Just don't go into Petals on the Wind thinking it will be anything like the original novel, or you'll be heavily disappointed.","user":"kelly-jay91","rank":[9,9]},{"title":"Young, Restless and Related","rating":5,"date":"23 July 2014","review":"In the January \"Lifetime\" TV Movie \"Flowers in the Attic\" (2014), three blonde siblings finally escaped from their attic prison in a Virginia mansion. They had been held there by fanatical grandmother Ellen Burstyn (as Olivia), who considered them \"the Devil's spawn.\" The kid's self-absorbed mother Heather Graham (as Corrine) lent her blessings to the abduction. For this \"Petals on the Wind\" sequel story, the older actresses reprise their roles. However, the \"Dollanganger\" children have grown into Rose McIver (as Cathy), Wyatt Nash (as Christopher) and Bailey Buntain (as Carrie). Luck changed for the kids as they were quickly adopted by a wealthy man; they spent ten happy years in his custody. As you may recall, incest ran rampant in the Dollanganger family. Being trapped together while coming of age, the eldest two siblings became sexually intimate...<br><br>We're not sure what happened during the missing ten years, but the goal was clearly for the children to lead a normal, non-incestuous life. This leads to a major weakness in the story. After \"falling in love\" during the first movie, \"Cathy\" and \"Chris\" live together for ten years. What happened then doesn't seem to match the ensuing story, which involves the very attractive sister and brother fighting off their sexual attraction. They simply pick up at the maturity level from a decade earlier, as if no living had occurred in ten years. After we see Ms. McIver and Mr. Nash try to settle down with other partners, the story moves on to cover McIver's attempt to get even with her mother – for the sinful neglect and imprisonment committed in the first movie. These are the two main story lines in this second in a series of adaptations of Virginia C. Andrews' popular novels...<br><br>Out of the Attic, the characters move too quickly from one situation to the next. We know little about the ten year gap and are crammed with current events. While the original performers are missed, McIver and Nash are well-cast. Likewise attractive, young Miss Buntain is referred to as a \"freak\" by school-girls for looking weird and carrying a doll. In fact, she looks like a beautiful \"girl woman\" under model-worthy make-up and wigs. We don't see much of Ms. Burstyn and Ms. Graham is two dimensional. Those who appreciate the male physique will be delighted with Nash and two additional shirt-shedding hunks – amorous Dylan Bruce (as Bart Winslow) and aggressive Will Kemp (as Julian Marquet). Director Karen Moncrieff and her crew handle it all in the \"soap opera\" style. Perhaps \"Lifetime\" should return to \"Peyton Place\" – or somewhere close.<br><br>***** Petals on the Wind (5/26/14) Karen Moncrieff ~ Rose McIver, Wyatt Nash, Heather Graham, Dylan Bruce","user":"wes-connors","rank":[8,8]},{"title":"Hollow adaptation of Cult novel","rating":4,"date":"1 June 2014","review":"This TV movie version of the beloved cult novel \"Petals On the Wind\" from Gothic romance author V.C. Andrews, mostly fails for several reasons. Of course it's biggest flaw is the tele-play adaptation. Somebody had the blind arrogance and stupidity to think they could improve on the source material, by making major alterations. Characters and incidents that are imperative to the story are sloppily chopped out of the script. At the same time, newly invented characters are introduced, pointlessly destroying the arc and the rhythm of the story. For instance, Christopher, who was so tortured by his love for his sister in the novel, suddenly finds time to embark on a shallow romance with a twangy speaking Southern airhead named Sara! Their relationship goes as far as the two becoming engaged. Apparently the writers failed to understand that Chris' unswerving devotion to Cathy, was the most tragically romantic aspect of this whole story. The sexy, and dangerous Russian ballet dancer, Julian is suddenly a whiny, un-intimidating Brit. Why? Why castrate one of the most potent and frightening characters in the book like this? I'm guessing the creators of this shallow soap opera were too lazy to do the research, or at least mimic a Russian accent. And remember how evil and terrifying Olivia was in the novel? Not here; now she is a strict, religious fanatic who still has the ability to show sadness and regret for her cruel treatment of the children in the attic. What the hell were they thinking? <br><br>Apparently the creators of this film had no idea about the dedicated cult following that these novels have. They are loved and remembered by millions of fans throughout the world. Sadly, the movie could have had the same effect, if they didn't tamper so unforgivably with the storyline. Admittadly I did like the movie a bit more the second time around. By that time my expectations were lowered enough to watch it without getting angry. It isn't a total waste, as the V.C. Andrews story still manages to shine through all the horrible alterations. At it's heart, we still have that sad, and doomed love that exists between Chris and Cathy. The actors for the most part, look as they are described in the novels. Ellen Burstyn is a fine actress, and the movie comes alive the few times she is on screen. But again, I can't figure out why she is playing the Grandmother with a sympathetic edge. And at least the movie does have a very pretty look to it, as well as some effective romantic music. <br><br>But it just isn't enough, for something like this. It's very sad, because with the right screen writer, this thing could have been EPIC. I mean, it's supposed to be an 8 hour production when you put all four movies together. I just wonder why they had to gut and slaughter the source material so much. The third book, \"If There Be Thorns\" is supposed to be realized into a film next...let's hope they don't try and tweak THAT story. to the creators of this series: Get it right next time..there are people out there that actually care, even if you don't...","user":"Falconeer","rank":[19,24]}]