[{"title":"The Intruders (2015): Cliché The Movie","rating":2,"date":"7 June 2015","review":"I was curious to see what Miranda Cosgrove could do as a leading lady, all I ever hear is criticism about her acting ability. I never get to see her in anything as what she tends to do doesn't exactly fall into the category of stuff I would watch (With the exception of School Of Rock).<br><br>Starring alongside more than competent veterans Donal Logue &amp; Tom Sizemore this horror is one big cliché &amp; steals material from other movies, sticky tape's it all together and calls it original.<br><br>Dull and lifeless this is a hard one to make it through as it goes nowhere, is more predictable than a Cena match and goes nowhere.","user":"Platypuschow","rank":[27,32]},{"title":"Same old, same old.","rating":3,"date":"23 February 2015","review":"Not entirely sure how to categorize this movie. It's definitely not horror or a thriller. Most likely someone's idea of suspense. Too bad there wasn't a true suspenseful moment. <br><br>I would not recommend this movie. The story is really nothing original as it has bits and pieces from other movies. The acting is nothing special. <br><br>Without giving details, it is basically one person has experiences that can't be explained, they are shared with someone else that doesn't believe them. The first person is believed mentally unstable. Nothing new. The extremely slow build-up does not deliver so much as the bat of an eyelash. Not much of a build up at all. Pretty lame actually.<br><br>In a nutshell its just boring. If you want to see how boring, knock yourself out. Its a waste of an hour and a half.","user":"hiyaboyos","rank":[42,59]},{"title":"Unoriginal, Predictable and Full of Clichés","rating":4,"date":"19 October 2015","review":"The disturbed twenty year-old Rose Halshford (Miranda Cosgrove) moves with her father, the architect Jerry Halshford (Donal Logue), to an old house after the loss of her mother. Soon Rose meets her next door neighbor Leila Markby (Jenessa Grant) and she learns about the tragic disappearance of the teenager Rachel that was sheltered by the previous owner of her house, Cheri Garrison (Claire Calarco) and her son Marcus (Michael Luckett). Rose suspects of Leila's father Howard Markby (Tom Sizemore) and she also learns that he had been the prime suspect of the police but proved his innocence. Rose overhears noises in the house but her father believes she is still traumatized by the loss of her mother. Rose also dates the constructor Noah Henry (Austin Butler) that is refurbishing the house. When strange events happen in the house, Jerry believes Rose is the responsible. Is his daughter really paranoid?<br><br>\"The Intruders\"is an unoriginal and predictable film full of clichés. The formulaic story seems to be on the shelve ready to be prepared without any creativity. In addition, the lead character is annoying and does not seem to be a twenty year-old college girl. The conclusion is so obvious that irritates. My vote is four.<br><br>Title (Brazil): \"A Casa do Medo\" (\"The House of the Fear\")","user":"claudio_carvalho","rank":[9,11]}]