[{"title":"Strange but Holds the Attention","rating":6,"date":"21 October 2018","review":"\"Painless\" is a strange drama about a lonely young scientist with a rare disease that makes him feel no physical pain. He researches the cure and is supported by his physician that treats him since he was a child. He is afraid of hurting himself since he is painless. The only twist in the storyline is when he feels attracted by a young woman he meets in the subway and when an ambitious unethical scientist proposes to help him. Although developed in slow pace and with few things happening, \"Painless\" has details and in the end holds the attention of the viewer. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[9,9]},{"title":"Captivating... but where is the Sci-Fi?","rating":8,"date":"4 October 2018","review":"The production value is above reproach and all the players turn in solid performances. Not really sure where the Science Fiction comes in unless they mean its a fictional story about science. The story is much like Lorenzo's Oil but from the 1st person as an adult. There are several places the film could have played a predictable (and expected) card but it stays true to a harder vision and doesn't sell the character to the story (what I mean is in many films you will have a character act out of character to create the 'issue' that carries the story forward, they don't do that here). As a result I found myself much more invested in the lead character than I usually get. I could have watched another hour without a hiccup. A very solid piece of work.","user":"barrelhousegutboy","rank":[7,10]},{"title":"Obsessive Drama","rating":4,"date":"5 March 2019","review":"This is about a guy who can not feel physical pain. He is trying to find a way to remedy his condition.<br><br>This was a bit of a drag for me. I was expecting it to be much more thriller than drama but once it feel into the drama rut, it just never found a way out. I guess if you are looking for a slow, dark drama it could meet you needs. If you are wanting a thriller you are better advised to look elsewhere.","user":"Foutainoflife","rank":[2,2]}]