[{"title":"Great inside look at a ambitious and competitive milieu","rating":10,"date":"5 August 2014","review":"This Norwegian documentary is one of those I never planned to see, as I'm not very interested in ballet as a whole, though I can appreciate both the beauty of well performed ballet, as well as the grace and hard work which is put into it. But starting watching this; i was quite mesmerized by the great film making, and also the charm of the young athletes. If you don't know ballet firsthand, it's important to understand this basically is hard work, carved in blood, sweat and tears, as well as training passion and enjoyment.<br><br>The film follow three young Norwegian teenagers from Oslo, 14-15 years old in 2012, all attending the same school and loving ballet, with great ambitions. They all tell about their lives, ambitions, everyday life, teacher conversations, parents relations, stage performances, hopes and joys. We meet them right in the age when they really have to decide if they are to really take the step up from being amateurs to go for it to become professionals. We follow them through a year, through competitions as well as in every day struggles with things every teenager might go through.<br><br>The documentary is really well made, is very true to the environment portrayed, and the film is building up interest in a perfect way. It helps, of course, that the youngsters are opening up to their inner thoughts; and are charming and interesting to get to know. It's an inside look of the demands, tests, the physiological and psychological test and the training they go through as they all try to become students at a higher level. Impressive film making by Kenneth Elvebakk. I haven't seen any of his earlier films, but his film making skills is beyond doubt very skillful. A recommended watch.","user":"OJT","rank":[14,15]},{"title":"Touching Documentary About Teenage Relationships","rating":7,"date":"25 September 2014","review":"At first it seems as if Kenneth Elvebakk's documentary is going to cover the kind of thematic ground staked out by BILLY ELLIOT (2000) in portraying the world of teenage male ballet dancers. They are aware of the fact that to an outsider the world of dance might seem rather effeminate, but in truth they have to commit themselves to long hours of training, often in the most inhospitable weather.<br><br>As the documentary unfolds, however, so we understand that the focus of attention is actually on the relationship between the three protagonists - Lukas, Sylvert and Torgeir. From a mixed-race background, Sylvert wishes he could be 100% Norwegian so that he could find a girlfriend. Sometimes his desire to continue ballet wavers slightly, but he misses the camaraderie as much as the training. Torgeir, the tallest of the three, is perhaps the most potentially talented dancer; but eventually it is Lukas who advances the most, as he obtains a place at London's Royal Ballet School. Elvebakk's film focuses on the pain of separation, as he leaves his friends back home in Oslo and moves to a student dormitory in the center of London.<br><br>Yet we are not meant to feel sorry for him, or to sympathize with his two friends, who have grown up with him but not have to manage on their own. On the contrary Elvebakk emphasizes how the three boys are completely focused on developing their abilities as dancers. They might not become professionals in the future, but at least they haven't tried. The experience is very good for developing their self-discipline: training involves a lot of work on their own in the rehearsal-hall, as well as keeping their muscles supple through regular stretching exercises. One cannot help but admire their dedication.<br><br>Filmed with an acute grasp of the importance of setting - the cramped rehearsal-hall, the darkened areas off-stage as the boys perform, the snow-covered streets of Oslo in winter, and the crowded streets of central London, BALLET BOYS is the kind of film that increases admiration for the strength of human beings as they pursue their (perhaps impossible) dreams.","user":"l_rawjalaurence","rank":[7,8]},{"title":"a choice","rating":21,"date":"21 September 2019","review":"...or dream. Fundamental. Essential. Defining each of three boys. Beautiful cinematography, inspired reflection of emotions and fragility of boys. Splendid perspective about the fight for succes and about the grace of grow up. Short, beautiful portrait of a great choice.","user":"Kirpianuscus","rank":[0,0]}]