[{"title":"I liked it","rating":10,"date":"7 April 2015","review":"This is certainly not a perfect movie, but 5 stars out of 10?!? its more a 6-7. The movie had humor and love and well it was typically Chinese in that there is no real happiness possible on earth for true love and only in death can you be together. But there is also a deeper message, can you love some enough that you would die for her or him, love some one enough that you would sacrifice your love, your memory of them to save them.<br><br>I know I have never loved anyone like this, and never will. For seeing a glimpse of this magical fairy tale love, which is so powerful that not fulfilling it is an agony beyond description, that it turns one's hair white in an instant and that this love is so mighty that it will even conquer the forgetful mind, in a way it even conquers reality/death, since it shows the lovers ascending into the stars at the end, as if they have left the earth forever and went to a place were dreams are eternal.<br><br>I love this kind of bullshit. Because we humans do not love like this, we love in many ways, we will even die for love etc. die for our children but rarely does a man or woman follow love with out question. And maybe we shouldn't since it can lead to madness and ruin and suffering without end, discarding all reason as we stalk the one we crave who wants to know nothing about us, but maybe that is not even love. I don't know and I won't ever know. But to believe that some one, somewhere out there has felt such a thing is joy enough to give this movie a 10 (even though it's more of a 6 on a rainy day). I hope no one feels offended by my sentimental bullshit.","user":"arus_royus","rank":[12,14]},{"title":"Despite its Flaws, one cannot deny the Magical Experience Conveyed by The White Haired Witch","rating":8,"date":"15 June 2015","review":"From the gorgeously executed opening, you know you have encountered something special, though the film occasionally falters in its ability to constantly meet the expectations it initially sets. The visually elegant features include the brilliantly colorful costumes that demand viewer attention, alongside the picturesque beauty of the landscape that is as artful as it is pleasant, however, at the same time, obviously unrealistic, and though the grand scale of the film's ambition can be clearly realized when these elements work well, on more than one occasion, the film seems to be an example of a production studio exceeding their grasp. During one segment, there's an endless mass of troops, depicted through well used effects, however, the fight itself occurs between only a handful of soldiers, leaving those thrilled by epic battles dismayed, this contrast between the realities of the production, and its terrific execution, continuously butting heads.<br><br>This aside, the stylized fight sequences are suspenseful and dashing, the characters moving gracefully through the air, however, those familiar with other like features will probably encounter little new content, despite the awe of its execution, or the significance of the entertainment. The battles are very quick, though at the same time easy to focus upon, while it is the soundtrack that is truly visionary. Although there is one track that bares resemblance to one my ears have previously been blessed by in a former film, the themes are continuously fascinating, brilliantly encapsulating the moment, from the passion to the futility, from the excitement to the grief.<br><br>Zhou Yihang (Huang Xiaoming) is a newly elected Wudong leader, who is tasked with the honor of delivering Red Pills to the Emperor, to help secure the longevity of their ailing ruler, the people of Wudong renown as medical practitioners. On his trek towards the kingdom, he encounters an unnamed woman (Fan Bingbing), who, if beauty was a crime, would be locked up for eternity. Referred to by others as Jade Raksha, Zhou promises to one day give her a name suiting a woman of her unmatched gorgeousness, hoping to meet her again.<br><br>Accused later of poisoning the Emperor with the Red Pills be brought, and hunted by the secret police, Zhou finds himself in the middle of a tyrannical battle, as countless treacherous war-mongers and politicians alike vie for power in this turbulent time. The first portion of the feature, in which the aforementioned story is introduced, could easily be described as difficult, the narrative being clouded by an unfathomable number of sub-plots and characters alike, where several non-important characters have their names presented on screen for the viewer, while none of the leads are ever provided such an honor.<br><br>Although navigating this jumbled mass can prove uneasy, many of the plots remaining unfulfilled in their execution, the film manages to steady itself once the love story becomes a major focus. Jade Raksha, who fights to help the oppressed people, finds herself equally accused of a crime she did not commit - the murder of Governor Zhonglian. She and Zhou are forced to return to her fortress, the Lunar Kindgom, where she and many others watch over the land in their attempt to bring prosperity back to the region, while Manchurians and corrupt officials, especially the villainous Jin Duyi (Vincent Zhou), wish to cripple Jade's land, and all those who follow her.<br><br>Unable to resist her beauty, grace and compassion, the relationship between Zhou and Jade contains many poetic, melancholy conversations, her view that love is poisonous being a well developed notion that continues throughout the feature. Although one particular segment of dialogue seems to copy from the Notebook, the emotion and poignancy throughout their many interactions is fantastically maintained, being, arguably, the most sweepingly beautiful part of the narrative, which is especially due to the talents of the actors.<br><br>Although Ms. Bingbing receives a notable role in the feature, she deserved a much larger part, occasionally being overshadowed by her co-star, Mr. Xiaoming. This is particularly frustrating, as Jade is a far more mysterious and interesting character, with elements of her story, including the cursed affliction that causes her hair to turn white, although subtly hinted towards, never being provided a thoroughly acceptable explanation.<br><br>By the time the conclusion is imminent, the number of unanswered questions is staggering, which leads this writer to wonder if the producers were perhaps planning to promulgate a sequel. If not, although the beauty of the film's ending cannot be denied, it could only be described as alarmingly disappointing, for a majority of the plots conceived within the narrative are never provided a sufficient resolution. As a love story, The White haired Witch cannot possibly be faulted, however, as an epic war feature, or a fantastical historic drama, the film significantly requires further substance.","user":"totalovrdose","rank":[8,10]},{"title":"An uninspiring adaptation of a classic which is bogged down by the lack of chemistry between its leads","rating":4,"date":"1 August 2014","review":"Hong Kong movie director, producer and screenwriter Jacob Cheung probably does not believe in churning out productions like a factory line, considering his sparse filmography. However, whenever the 54 year old filmmaker directs a movie, it is something we'd enjoy. His credits include A Battle of Wits (2006), which was nominated for Best Director and Best Screenplay at the Golden Bauhinia Awards and Beyond the Sunset (1989), which was a nominee at the 9th Hong Kong Film Awards. Of course, there is the much loved Cageman (1992), which showcased the director's ability to translate human relationships and emotions on the big screen. Cheung's last work was Ticket in 2007, and seven years later, we were very much looking forward to his latest work.<br><br>But alas, what a letdown and regrettably, a laughable piece of CGIladen movie it is. Maybe this comes with the fact that it is yet another remake of adaptation of Liang Yusheng's classic fantasy novel The Story Of The White Haired Demoness (1957), about a star-crossed love story between a witch-like woman and martial arts expert Zhuo Yihang.<br><br>The version we are all familiar with is Ronny Yu's 1993 movie The Bride With White Hair, starring Brigitte Lin Ching-hsia and the late Leslie Cheung, which is widely considered a classic of the genre. Here, it is an ironically too messy and overstuffed piece of work that lost our interest 30 minutes or so into the movie.<br><br>For the uninitiated, the 104 minute movie tells the story of a witch- like woman known as the Jade Raksha (Fan Bingbing) who becomes a wanted criminal after getting framed for the murder of a prominent government official. At the same time, a young man known as Zhuo Yihang (Huang Xiaoming) is framed for the murder of the emperor. The two fugitives meet by chance and fall in love, but when Jade Raksha becomes a prime suspect who is responsible for the murder of Yihang's beloved grandfather, can there still be a happy ending?<br><br>There are countless scenes boasting expensive CGIeffects, but they are not excuses for the evident lack of chemistry between leads, who despite putting in lots of effort to emote individually, just do not manage to stir any emotions with their supposedly tragic romantic relationship. This is an obvious case of how the industry hopes to bank in on the stars' commanding power in Mainland Chinato earn some quick bucks.<br><br>It doesn't help that there are several complex palace intrigue and politicking side plots which serve nothing but confuse and dilute the interest levels of viewers. Nope, thefootnotes of character names and relationships superimposed on the side of the screendo not help.The uninspiring screenplay includes the intriguing sub-plot of apolitical marriage of convenience between the male protagonist and the beautiful daughter of a scheming eunuch, amidst other uninteresting story lines. They are jam packed into one movie here, and bythe time the moviereturns to the romantic couple, we can't be bothered to find out about their fate. Even playing Leslie Cheung's heartfelt end credit song doesn't help anymore.","user":"moviexclusive","rank":[14,31]}]