[{"title":"Must See","rating":9,"date":"6 July 2016","review":"A brilliant film which i saw at the Edinburgh Festival., The chemistry between Juno and Timothy was fascinating and well thought out. There was a touch of humor, great music which added a lot to the film and sadness as well. The flashbacks to how the 2 main characters arrived in Blackpool was gripping. Blackpool was an ideal location for this film because it is usually a place where you can have fun and and seen as the Vegas of the UK. The idea to have an older man and a young woman as the main characters was terrific and really paid off.I would recommend this film to anyone who likes films with a difference.I truly hope Away is great success and wish it the best of luck in the future.","user":"clarkfraser","rank":[23,28]},{"title":"Great story, amazing performances. Cool music","rating":10,"date":"24 June 2016","review":"Hi, saw this film at Edinburgh film festival and it knocked my socks off. I cried and laughed. Juno Temple and Tim Spall are amazing in it, those eyes staring down from the big screen (Juno's!) and Spall is very convincing in his wretched situation. Great story and how it's told is really clever as it's not straight forward like you might get with a Hollywood Blockbuster: You get fed elements of the story as small morsels along the way to always keep you enthralled. The scenery also makes me want to go to Blackpool too so a good advert there for them! A man in the audience commented on how he always cries at the drop of a hat at films but he knows it must be powerful as his wife who never ever cries at films was crying buckets.","user":"jtebrett","rank":[17,24]},{"title":"Away","rating":10,"date":"31 July 2016","review":"I thoroughly enjoyed this film. In today's continuously challenging world , it hit some very strong chords with me. So often new films today seem to have little to say, often the same old story lines with slight twists. However, this really got me thinking about life, it's complexities and the reality of the difficulties so many people face. Life's journey is never simple, and every so often a film is released that captures something special ...I think it will be very popular, especially with people who enjoy films that have more to them than the basic Hollywood stuff...some seriously good acting, and music fab.actually the music was superb! The story line has the ability to remind one that ,although you may have your own issues and challenges, you are not alone. In today's environment so many people face daily survival and this film reminded me , there are many in the same boat. I think it's a must see ,and is a film one could watch more than once to really capture its powerful symbolism .","user":"jonniekendall","rank":[13,19]}]