[{"title":"Confused","rating":4,"date":"27 December 2014","review":"Haunted house story.<br><br>A couple with money worries and two kids move to an old house on the moors so the wife can work on renovating it for her client. Turns out the house was the scene of a murder and suicide a long time agoooo ...<br><br>This is very busy, with lots of plot points and subplots. Plus you get to channel The Shining, The Grudge, and The Woman in Black. But in the end you're left with no idea where the evil comes from - just that it's something to do with a Rosicrucian ritual with no clear purpose.<br><br>There are four characters who come and go purely for exposition - the client, the builder, the killer's ghost, and the ghost whisperer. Turn up, give a little speech on the back story, and ... poof - they're gone for good. And strictly speaking the son isn't necessary either. And what is the victim's ghost up to? Saving the next victim, avenging her own death?<br><br>There's a vial of some liquid, a bizarre red potion, blood here and there, a mysteriously ringing telephone, and some google research. The jump scares are not effective (no fridge door!), and at no point do you fear for the female characters. It's a mess.<br><br>The production and acting are quality (how old is Modine - doesn't look good from certain angles), so the director's screenplay has to take the blame. Ghost stories are all about dark secrets, but this one skipped that part of the process.<br><br>ps. I'm completely wrong - look at all the reviews posted in April 2015. Hehe!","user":"begob","rank":[16,18]},{"title":"Ghost story which borrows heavily","rating":5,"date":"27 December 2014","review":"The Altar is a ghost story in the classic tradition. Meg (Olivia Williams), Alec (Matthew Modine) and their children move in to a decrepit Yorkshire mansion whilst Meg restores it for the owner. Over the next couple of months the haunted nature of the house becomes apparent, with the usual banging sounds, slamming doors and ethereal appearances. Most of the film relies heavily on Olivia Williams and she does an OK job, with Matthew Modine limping in towards the end.<br><br>Undoubtedly, the film borrows heavily from other ghost and spirit films, most notably The Shining, but it was almost like playing bingo, identifying tropes from other films as it progressed, such as The Exorcist, Don't Look Now, etc. The TV movie feel and austere feel of the grand old house give a 1970s drama feel to the film. Some may associated this with quality drama, some with cheap production values. <br><br>There are some plus points: the old Yorkshire mansion and it's windswept grounds give a good background feeling, and the explicit pictures of the ghosts is usual and scarier than most in the genre - more like The Grudge than Turn of the Screw.<br><br>Overall, I was left with the question, why? Did this movie really need to be made?","user":"btraish","rank":[16,20]},{"title":"A half-baked load of rubbish","rating":3,"date":"29 December 2014","review":"It's always a warning sign when a film bypasses cinema release to go straight on TV, so when THE HAUNTING OF RADCLIFFE HOUSE (original title: ALTAR) appeared on UK TV on Boxing Day I knew something was up. And, unsurprisingly, it turns out to be very bad indeed: a complete rip-off of a film made by people with no understanding of how the ghost story genre works.<br><br>The film features a pair of past-it actors (Olivia Williams and Matthew Modine) as a married couple who move into a creepy old mansion in the Yorkshire moors with their bratty kids. Unsurprisingly, the place is haunted, and the haunting takes the most obvious route imaginable: dumb ghost scares ripped off from THE GRUDGE, a possession straight out of THE SHINING, and a myriad other scenes ripped off from elsewhere. When the film does try something new (like a ghostly encounter in broad daylight) it just falls flat.<br><br>The production values are acceptable here, but the level of cliché is just too high for it to be enjoyable. The grey filter cinematography has been done to death, the performances are shrill and histrionic (and Williams just CANNOT carry a movie) and the scares silly. Oddly, much of this seems to have been copied from an old favourite of mine, the '90s-era video horror game PHANTASMAGORIA, except without the fun factor. Throw in some dodgy historical rumblings and an equally dodgy cameo from SIGHTSEERS star Steve Oram and you have a complete train wreck of a movie. M. R. James would be spinning in his grave...","user":"Leofwine_draca","rank":[41,63]}]