[{"title":"Was the title supposed to be a paradox?","rating":1,"date":"12 August 2017","review":"I need to write this review quickly before I forget that I even watched this. Was the title supposed to be a paradox? <br><br>They must not have spent very much money on this film because it shows. It had the potential as a plot but failed in execution. It seems that this film wants to be Gone Girl, but you have to actually be able or want to write a script for that to have happened.<br><br>Rosario's character is too weak and needs more lines. <br><br>Heigl's character (I don't remember the name in the film and I'm not putting effort into remembering) is overly developed. Julia (played by Rosario) is unfortunately not balanced against this development; this leaves the viewer feeling too frustrated to root for her. As the viewer, I feel manipulated into wanting her to finally stand up to Heigl's character.<br><br>This script is too formulaic and insulting to the viewer. For Lifetime, yes this is fair quality but unacceptable for a WB production in 2017. <br><br>1 star and this is for the styling team that maintained Rosario's wavy hairstyle.<br><br>The film does try to explain why Heigl's character is the way she is, but this is also as hackneyed as Rosario being a weak abuse victim. Give me something throughout the rising action so that I am not left underwhelmed by the climax. Speaking of climax, the sex screen was dry. I like math so I am all for a formula if it works but this 1+1=2 is not as exciting as something like a system of equations with nuanced and dynamic characters vs. these very stale and static ones. Why is the ex husband so dumb? Is it because he is that self-absorbed that he couldn't put together that his ex is crazy and capable of madness? These characters were written so poorly that I really didn't care about anyone. So if the goal of this film was an exercise in apathy, then well done!","user":"idnakb","rank":[32,39]},{"title":"Unforgettable in the Worst Ways","rating":2,"date":"21 April 2017","review":"The idea of recovering from a broken relationship is one that could make a very heavy emotional movie. The deep feelings we have for one another when in love and the discovery that your partner no longer shares those feelings is lot to bear. But why explore such issues when you can just make another psycho ex movie.<br><br>They must make at least one or two of these every year. However, such films are not being made because they portray deep themes that resonate with the audience. They're being made because they're cheap and pretty much guarantee a return on investment for multi- million (sometimes billion) dollar movie studios.<br><br>With the exception of Rosario Dawson, who gives her role a better performance than it deserves, no one in this movie even attempts to do anything compelling with this material. Katherine Heigl's character seems copied and pasted from her role in Home Sweet Hell (2015). Although that cinematic experience was also a suckfest, at least it tried to be something unique. In that film's world, her role as the stuck up housewife who's willing to do anything (including murder) worked (within the established parameters). Here, she plays the same role but in a more grounded universe where you have to seriously wonder who could possibly marry such an abysmal characterization of a human being.<br><br>I could criticize the movie's pacing if it had any. Each act feels prolonged far longer than it should be with Heigl repeatedly messing with Dawson as we wait for Dawson to figure out that her fiance's ex is truly, unbelievably, Simon Legree evil. When we finally get to the third act rather than following a natural progression the movie is dragged there kicking and screaming as it allows characters to discover things not because it makes sense but because even the filmmakers finally recognized that this thing must end.<br><br>What might be worst of all is that this movie concludes with a bit of clear sequel baiting. At that point, all I could think was \"sure, why not\". Let's get Unforgettable 2. Hell, let's build an Unforgettable Cinematic Universe with spin-offs and team ups. In that way I hope that I can leave this particular movie's universe and be sure to never come back.<br><br>In short, if you need some painful dental work done that would be a much more entertaining expenditure of your time and money.","user":"rs403404","rank":[56,74]},{"title":"Oh my God, this movie blows","rating":2,"date":"11 May 2017","review":"Obvious melodrama about a woman being harassed by her fiance's sociopathic ex-wife, and her own violent ex- boyfriend. Sleazy, depressing, and is pointlessly​ told through flashback (from six hyperbolic months earlier) for three quarters of its lazy story, before jumping ahead another six hyperbolic months for the ending.<br><br>Heigl is chilling in this, but everyone and everything else is laughable.<br><br>It was also a bit unclear when this story is taking place, as characters still have landline phones (along with cell phones) and still have the newspaper delivered to their front door.<br><br>The final \" Oh, here we go again \" end scene, with the grandmother, made me shout, \" Oh, f*** off! \" at the screen.","user":"Zbigniew_Krycsiwiki","rank":[44,58]}]