[{"title":"That's what's so funny","rating":9,"date":"9 April 2014","review":"If ever you wondered what happened to the 'valley girl' ethic, rest assured that it is alive and well in Williamsburg, Brooklyn. Harper (Bridey Elliott) &amp; Allie (Clare McNulty) are 20-something best friends whose parental affluence hasn't really required them to mature in the years since college. This comedy follows their ill-conceived attempt at being thrifty as they choose to bike (rather than taxi) across Brooklyn to a Rockaway Beach party. These are two of the most vapid and shallow characters ever portrayed as protagonists - they don't learn a thing as they spend hundreds of dollars during their 10 mile odyssey - and that's what's so funny. As for winning the SXSW Grand Jury Prize, I can totally see the comparisons with, festival darling, Lena Dunham's 'Girls' - which is a guilty pleasure of mine - but, where Dunham's wit and goofy characters coax empathy, the 'Fort Tilden' characters have no apparent redeeming qualities. I laughed a bit but this is no Patsy &amp; Edina or Romy &amp; Michele; I got more than my fill of Harper, Allie, and their equally self-centered world.","user":"basil1984","rank":[25,27]},{"title":"Flat Tedium","rating":1,"date":"20 October 2014","review":"'Fort Tilden' is the tale of a ten-mile road trip by a couple of tiresome Brooklyn trust fund brats, who head for the beach to hook up with a pair of charmless dudes. Their big adventure soon turns into a plodding marathon by bicycle, cab and foot, since this airhead odyssey comprises only lame exchanges and minor fiascoes involving various acquaintances and strangers. The 'heroines' are portrayed as spineless selfish simpletons, and although the film is clearly intended to be a comedy, it's short on laughs, wit or interest.<br><br>The actresses struggle gamely with the pedestrian material, but their characters' feckless behavior and whiny griping leaves one hoping a truck will squash them into roadkill at every intersection. When they finally meet their romantic prospects on a gray windswept seashore, the encounter is just another flaccid flop in a series of screw-ups.","user":"tigerfish50","rank":[41,62]},{"title":"Loved it!","rating":8,"date":"16 December 2016","review":"Reading other people's reviews of the film I can clearly see this movie isn't for everyone. But it was absolutely a movie for me!<br><br>The film is about two recent grads: best friends and roommates Harper and Allie. Meeting two cute guys at a performance neither of one want to be at they make loose plans to meet up with the guys at Fort Tilden the following day where they plan to hook up with them. The following day they set off on their bikes and of course everything that could go wrong does go wrong. <br><br>Let's get one thing straight: the women are straight up selfish, egotistical, a**holes. Behind their cutesy faux-kind personalities they snipe at one another and others and the more their plans go awry the more their facade drops. They are anti-heroines in the vein of Charlize Theron's Mavis in 'Young Adult'. If you liked that movie, you'll love this one.","user":"ReganRebecca","rank":[2,2]}]