[{"title":"I really enjoyed it","rating":7,"date":"21 February 2020","review":"Despicable Me 3 is my personal 2nd favorite in the series. There are parts of what made the first so amazing and each part shot into one of the sequels and I think Despicable Me 3 did its part better. The movie has only two major weaknesses that are easy to get past being that there is too many plots and that it relies on juvenile humor and toilet humor more than the last two. However, these are just small flaws and are easy to look past once you see the plots mesh together in a really satisfying way. This movie had some pretty good highlights, like when Gru said his mother told him that his father died of disappointment when he was born as well. Overall, Despicable Me 3 is an extremely enjoyable ride I'd recommend to anyone who can get past its flaws.","user":"MR_Heraclius","rank":[36,37]},{"title":"It's not terrible by any means but the series is starting to fade.","rating":6,"date":"12 July 2017","review":"It's a common curse with the third movie in most trilogies (assuming we don't count Minions.) The third movie is usually where it starts to wear off. Such is the case for Despicable Me 3. The movie is average. That's it. It's not great, it's not bad, it's just average. The story is that Balthazar Bratt (Trey Parker), former 80s child actor turned super villain has eluded capture from Gru (Steve Carell) and Lucy Wilde (Kristen Wiig) for too long, and the new chief of the Anti Villain League isn't happy about it and fires them. Eager to get their jobs back Gru receives word that he has a long lost twin brother named Dru (Carell also) who invites him to his home in a country known as Freedonia (the same country that Groucho Marx ran in Duck Soup). Dru attempts to get Gru back into villainy. Gru manages to resist the urge for a whole 5 minutes. The master plan is to now steal a diamond from Bratt and hopefully be readmitted to the Anti Villain League. Along the way we have numerous sub plots involving Lucy trying to be a good mom, the Minions fed up with lack of crime and going to jail (it's never specified how that happens), Agnes (Nev Scharrel) wanting to find a unicorn after hearing a legend, Bratt wanting to destroy Hollywood in revenge for rejecting him as a teenager, and the relationship between Gru and Dru. In all honesty I think there's more plots than The Dark Knight Rises. This is really the biggest problem. A Despicable Me movie really doesn't need this many plot threads. Most of the time the movie just jumps around to each one and it comes off as being unfocused. Kids will probable be fine with it and it is enjoyable enough, but I don't think it's as good as the other three.","user":"ofpsmith","rank":[53,63]},{"title":"Feels More Like a Sitcom Than a Movie","rating":7,"date":"9 July 2017","review":"As far as disposable sequels to kids films, Despicable Me 3 is pretty much on par with Cars 3 (2017). It's not a particularly memorable film nor can it really hold its own against something like The LEGO Batman Movie (2017) but at least it's not unpleasant. In-fact in may ways Despicable Me 3 is better than the original in that it improves its look-and-feel and provides a decent foil for once in the form of Trey Parker's Balthazar Bratt. Of course it's to the detriment of neutering the refreshing mean-spirited-ness of the original, but hey, at least you still got those Minions am I right? Despicable Me 3 catches Gru (Carell) and newly minted wife Lucy (Wiig) trying and failing to secure the world's largest diamond from the hands of Bratt our flamboyant 80's themed villain. Fired by the new head of the Anti-Villain League (Slate), Gru and Lucy discover he has a twin brother named Dru (also Carell) whom their parents separated at birth. With nothing on their plate, Gru, Lucy and the girls (Cosgrove, Gaier and Scharrel), travel to the Mediterranean coasts of Freedonia to meet Dru.<br><br>When the family lands in Freedonia, the movie descends into a series of fun but thematically incongruous vignettes. Gru bonds with his brother over Dru's desire to become a villain, Lucy fails, succeeds and fails again to become a mother figure to the three girls, Agnes, the youngest of the three tries to capture a unicorn, Balthazar Bratt sees his plans for world domination come to near-fruition and the Minions...well let's just say they have their own thing going as well.<br><br>About half of all this busy, busy, business works at least as far as furthering the plot. The fact that none of the film's insanity really coalesces into a compelling whole, only makes the film feel more like a mediocre sitcom episode than an actual movie. Yet as far as inspired moments of slapstick, Despicable Me 3 supplies a little bit more than is to be expected. One highlight involves Gru and Dru driving around the Freedonian countryside in a golden-plated mean machine while police follow while riding literal pigs. Parents will find these comedic bits more amusing than funny but the kids, the kids will be rolling up and down the aisles.<br><br>And isn't that what this movie is ultimately about? To provide entertainment to children? While I don't necessarily condone families watching kid's films for their own sake (and this one in particular is all over the map as far as messaging), there's not really all that much to object about here. Despicable Me 3 is at its core a thoughtless but entertaining jumble of sights, sounds and goofiness. Thankfully unlike your racist aunt, Illumination Entertainment has not used the Minions for nefarious purposes...at least not yet.","user":"bkrauser-81-311064","rank":[41,53]}]