[{"title":"Scrapped after 70%?","rating":3,"date":"23 April 2017","review":"The ending was so botched, I can't help thinking the crew itself got \"evicted\" half way through the filming (read, ran out of money or fell apart). Despite the weird behavior of several characters, the story had a good potential till it suddenly, stupidly, untimely took a twist that is so used and abused, it doesn't even elicit a chuckle anymore. It just made an impression that the crew abruptly pulled the plug in the middle of all the action. Movies like this make me wonder how someone gets so much money, convinces a bunch of talented people to participate (most of the actors, the operator was pretty good), and is not held accountable for making bad script decisions that inevitably cut any hope for a good payout. Anyway. If you are reading this review, be smarter than me and trust the low rating: it is not an underrated gem. You would waste your time.","user":"wteutonin","rank":[38,42]},{"title":"Trust me, Havenhurst is the ideal method to get rid of an addiction.","rating":4,"date":"11 April 2017","review":"\"Our rules are simple.You stay sober, you lead a good life, and you don't fall back into your old habits.Then, you are welcome to stay here until the day you die. And if I don't lead a good life? Then your stay at Havenhurst would be terminated.\"<br><br>Are you a recovering addict and you're offered to stay at \"Havenhurst\" as aftercare, you'd better make sure you do not slide back into your bad habit. The result is an eviction from this gigantic baroque looking building in downtown New York. A normal eviction would involve you packing your bags and closing the door behind you in an agitated mood. If your stay is terminated at \"Havenhurst\", the eviction is quite painful and final. But you can be sure of one thing. You won't fall of the wagon ever again.<br><br>The person who moves to \"Havenhurst\" is Jackie (Julie Benz), a recovering alcoholic who's responsible for the death of her lovable daughter because of her addiction. After she gets fired from rehab, she'll get a further follow-up in this luxurious looking hotel. Apparently, a whole bunch of ex-addicts are staying there. As said before, there's only golden rule in this building. The residents shouldn't start again with their bad habits. This is explained by Eleanor (Fionnula Flanagan), landlady of this shelter. A distinguished-looking elderly woman who clearly shows her sympathy towards the inhabitants and who obviously cares about their welfare. In retrospect, she appears to be mother of two less peaceful sons. Even a link is made with the notorious Herman Mudget (better known as H. H. Holmes, one of the first documented serial killers from the 1800s).<br><br>In itself the film wasn't so bad but it wasn't really impressive either. It's a mixture of a few superficial ideas and concepts already used in other movies. The house is a maze of secret corridors and entrances in the walls, just like in \"House Bound\". The final destination of the victims and the denouement is again similar to \"The Hoarder\". The basement reminds you of \"The Texas chainsaw massacre\". And of course again you'll witness a little bit of detective work when Jackie realizes that some guests disappear without a trace. Unfortunately, there are also plenty of elements which aren't explained. There's the disappearance of Jackie's girlfriend Danielle (Danielle Harris). A brief event and a reason for Jackie to initiate an investigation \"Havenhurst\". And her relationship with the helpful agent isn't explained either in detail.<br><br>The biggest disappointment for me was the horror content of the film. You can't really call it horror because it isn't actually frightening. Gory scenes can be counted on one hand. There is only one explicit scene and it's also kind of implausible at the same time. And to be honest the physical strength of the killer who moves throughout the building via cleverly designed mechanisms, is a bit exaggerated. His new victims are hurled through the room as if they weigh nothing. At one point I thought it was a paranormal phenomenon with a superhuman strength. <br><br>And how is it that other people haven't heard that something was wrong? The walls are apparently paper thin so you can easily hear every suspicious noise or moaning. But apparently only Jackie can hear it. \"Havenhurst\" is no more than a thriller containing a gloomy mystery. A sort of horror for beginners. Unfortunately, there is not such a refuge in reality. Otherwise, more people would admit they have a problem so they are sure of a place in such a majestic building. Without a serial killer of course.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[18,21]},{"title":"Should've hired Mudgett as the writer","rating":3,"date":"18 February 2017","review":"HAVENHURST takes not only its inspiration but it's foundation from the real life historical details surrounding Herman Webster Mudgett, a.k.a. H. H. Holmes, \"one of the first documented serial killers in the modern sense of the term\".<br><br>Taken as a whole, what is so incredible about the original, real, Mudgett story is that, if you were to read it as a novel rather than as an account of recorded historical facts, you simply wouldn't believe it. Mudgett comes across, literally and completely unbelievably, as an antebellum comic book supervillain. Dashingly handsome, obviously a genius, a graduate of the University of Michigan's Department of Medicine and Surgery at age 23, he was possessed of an infinite supply of charm, intelligence, chutzpah and urbanity that allowed him to charm anyone and apparently pull off any con. Turning his collection of deceptive skills to good use, he was seemingly able to generate large sums of money at will.<br><br>But what's a supervillain without a lair? By the age of 28, Mudgett had amassed enough fortune to build a massive hotel building, a three- story block-long affair that was nicknamed \"The Castle\" simply because it was so enormous (for the time). While the street-level floor housed conventional commercial shops, the upper 2 floors \" contained his personal office and a labyrinth of rooms with doorways opening to brick walls, oddly angled hallways, stairways leading to nowhere, doors it could only be opened from the outside\", and so on. Like Capt. Nemo, he never allowed any one individual to gain significant knowledge of any large part of the construction project. Reads like a Stan Lee origin story, doesn't it?<br><br>Within the walls of The Castle, in the middle of Chicago no less, \"somewhere between 9 and 200\" people were killed as part of a variety of for-profit schemes involving life insurance scams, skeletal models for medical schools, and model organs. To help with operations, he invented his own alarm systems to monitor people moving about within his building.<br><br>The Mudgett story goes on and on in this same vein. If you saw it as a movie, you simply wouldn't believe it. It's just too outlandish. And you need to keep in mind that he accomplished all of this and was dead by execution by the age of 34. Even the account of his own hanging is excessively ghoulish.<br><br>As part of the Mudgett story, it's known that it had been his intent to build more than one hotel. This intention provides the foundation for the movie HAVENHURST; HAVENHURST is another one of Mudgett's \"specialty hotels\". For the purposes of the movie, it's a different family running it and their motivations are different from what Mudgett would understand, but it's pretty much \"second verse, same as the first\".<br><br>The connection to the original Mudgett story serves to highlight two points. Firstly, truth really is stranger than fiction. The original Mudgett story is intrinsically more fantastical and made even more so by the fact that it is entirely real. The writer of HAVENHURST basically goes head-to-head on the story and simply can't create a fictional story that can stand on the same playing field with the historical one.<br><br>And secondly, a basic movie through-line composed primarily of slicing and dicing people, for whatever reason, is just not enough to carry a movie. HAVENHURST does draw a little extra spark from its roots in appalling historical facts but then just falls flat. It's all been said and done far better by Mudgett himself in the real world before the movie even begins. The movie literally depends on its audience being completely ignorant of the historical facts surrounding the Mudgett story in order to have anything to serve up to the audience; if you know the Mudgett background, HAVENHURST is simply a tiresome exercise in tiptoeing through the intestines. Having to depend upon audience ignorance in order to have something to give is a bad plot strategy.<br><br>While they can't save the movie from its own intrinsically limited playbook, Julie Benz and Fionnula Flanagan, who were also together in the TV series DEFIANCE, do provide some quality acting to help relieve the boredom. Ms. Flanagan has been providing quality acting since 1965, if memory serves, and it's interesting to see how much atmosphere she's able to create in what is otherwise a vacuum of interest.<br><br>And lastly a note for the makers of HAVENHURST... You should at least do 10 minutes of research if you're going to make a movie based upon historical facts, people, and events. You want to exploit historical facts, not trip over them. Mudgett took pains to provide soundproofing in his kill rooms. Some of his methods of killing could take days and probably involved lots of screaming. Having eerie screaming from behind walls and echoing up as the victims disappear down hidden chutes as a primary scare effect just conflicts with historical facts. You certainly wouldn't have heard them in a Quality Mudgett Hotel.","user":"S_Soma","rank":[9,11]}]