[{"title":"Partially copied from copycat.","rating":1,"date":"3 November 2015","review":"A 90's movie with Sigourney Weaver with the same condition and also a thriller and that was a fairly good movie.<br><br>This is sad in comparison and has some annoying acting and a cast that don't feel comfortable with their roles.<br><br>The story goes all over the place and it's like they could not decide with which genre to go.<br><br>So it dumps some bad effects on you calling it a supernatural flick than it turns into a thriller when you find out her husband is cheating on her and wants to kill her.<br><br>The mixing of genres is not that easy and this is another example of a failed attempt.<br><br>It looked like they had some budget on this but somewhere with the script or the director and certainly the casting something went wrong.<br><br>Would be nice to see a project with the basic subject matter because done right it would still be something I would watch.<br><br>You can watch it if you want.<br><br>But...I don't recommend it.<br><br>A messy movie.","user":"djangozelf-12351","rank":[13,16]},{"title":"Agoraphobia: Decent enough despite its flaws","rating":5,"date":"1 January 2018","review":"Another movie by Lou Simon who at present time does not have the best record with me, her movies have been less than impressive.<br><br>Agoraphobia tells the story of a young woman suffering from *Drumroll* agoraphobia who moves into her newly inherited home but begins to question whether she's alone.<br><br>Starring Cassandra Scerbo who I will always just see as that girl from the Sharknado films who shows her cleavage a lot. Also we have the horror legend that is Tony Todd, though his presence is sadly minimal.<br><br>The majority of the film is highly generic and very uninteresting. It's not until the end when the film delivers a twist and steps up its game, but by that point it's a tad too late.<br><br>The finale saved Agoraphobia from sheer mediocrity and though it's still nothing special it's a harmless enough 84 minutes for fans of the genre.<br><br>The Good:<br><br>Tony Todd<br><br>Maria Olsen for the first time ever<br><br>Nice twist<br><br>The Bad:<br><br>Tony Todd felt wasted<br><br>Highly cliched for the most part<br><br>Things I Learnt From This Movie:<br><br>Can we have a horror movie where the family doesn't have pets please? We all know how that works out","user":"Platypuschow","rank":[5,5]},{"title":"Tony Todd!","rating":4,"date":"1 October 2016","review":"This movie is a complete ripoff from one of the Outer Limits episodes. But the execution is quite alright, so it worked OK in the end.<br><br>After so many indie projects, here comes this one, with an old premise, some B class acting, B type actors and some mystery involved. The death scenes are laughable, the story doesn't always make lots of sense and the reaction from the characters are truly amusing. It is clear that the budget did not help this movie, except maybe to get Tony Todd involved.<br><br>It's just another horror like so many seen before, regarding the plot, the way it was made, shows that it couldn't pass its own boundaries.<br><br>Cheers!","user":"gothic-fiction","rank":[1,1]}]