[{"title":"The Kid liked it. I didn't.","rating":5,"date":"9 December 2016","review":"From the first minute, it's clear that the writers are really desperate to bring out fresh ideas, but it just comes across as purely that; desperation. It borders on the ludicrous. My kid watched on silently, but I never heard her laugh once. Not good for a comedy. It's dull. It's ridiculous. It's way over the top, even for a animated kids film with talking mammoths. It's just plain stupid. This series has reached its end. I really hope it's over but I hear there's another in the works. While there's still a modicum of profit, the machine keeps churning. It's really sad, and an insult to the first few films, which were fun and fresh. Let it die. It's begging to be put down.","user":"anthonyjlangford","rank":[53,64]},{"title":"Milking a dead cow","rating":3,"date":"19 December 2016","review":"You gotta know when to stop. This franchise has run a couple of movies too long. <br><br>Now concentrating on this movie only, not the franchise, plainly put, it is a bad movie. If you are a die hard fan and want to pick positives and try desperately enough, you can do so. I am not that desperate and I take my movie watching pretty seriously and there is nothing good I can say about this movie. There is no point in going into the plot and dissecting it. Scrat used to be funny, but that seems to be a lifetime back. Sid used to be lovable, but I can't even remember the last time I felt so. There is no life in this cow, let alone milk.","user":"prasanth-ajithkumar","rank":[37,47]},{"title":"Time to put this franchise on ice forever!","rating":1,"date":"14 January 2017","review":"Original is not a word that comes to mind when watching the fifth (yes FIFTH) entry in this tired, worn, quite frankly burned out franchise.<br><br>What does come to mind however is the fact this franchise has gone on for far too long.<br><br>If you can't come up with any original ideas and you have to scrap the deepest barrel for the most unoriginal idea as possible, it's time to go.<br><br>If you can't keep your characters fresh and funny and make them more boring, dull and annoying to watch, it's time to go.<br><br>If you're out of jokes to use and you pull some random rabbit out of a hat and it's a rabbit that says \"Think of some really bad jokes mate.\", it's time to go.<br><br>If you have 4 (yes, I do mean 4) writers and not one of them can give any good dialogue out, it's time to go.<br><br>And when a franchise that is constantly dead in the water is still going like THIS, it's time to go.<br><br>I don't care if these films still make money, Fox, it's time to put this franchise on ice forever!","user":"l-62911","rank":[34,43]}]