[{"title":"Solid B-action movie","rating":11,"date":"11 June 2015","review":"The premise of \"Pound of Flesh\" is interesting to say the least. It's difficult to describe the plot without any spoilers. It unfolds in every scene. It's not a \"mystery\" per se, but if you think you have the usual revenge type b-seagal-movie you are mistaken.<br><br>Overall it is good for what it is. I liked the pace (not too hasty or abrupt), I liked the direction and editing, and the plot/script is good enough.<br><br>Van Damme got old, as it was expected. We see his trademark feet open 180 degrees as in many of his movies, but the stuntman was obvious in a few scenes. The green screen used in many scenes, including many scenes inside a van are distracting but I wouldn't insist on that as a serious flaw.<br><br>The newcomer (her 1st movie) Charlotte Peters has an interesting look that maybe give her some good roles in the near future but she need lots of training in her acting (despite the fact that she went to Drama Studio London, a prestigious drama school based in England).<br><br>The conclusion, that I won't spoil you, is satisfying, something that lack many movies nowadays.<br><br>My recommendation: Check it out. Is better than the 5 average you see here. I gave it a 8 to boost it a little. Might not worth such a high score but I think is better than other recent movies of Jean-Claude.","user":"Dr_Sagan","rank":[27,36]},{"title":"A good solid Van Damme underrated action thriller flick!","rating":1,"date":"17 January 2016","review":"Disclaimer: If you are a viewer that mainly prefers art-house-type movies, then you might as well ignore this review. In addition, if you're not able to take a good solid action Van Damme thriller, drama flick, ignore this review, as well. We'll both be better off.<br><br>Pound of Flesh (2015) in my opinion it is a solid action thriller Van Damme action movie to watch. This is the last movie of him that he made he is filming now a Kickboxer remake, it is my favorite movie that does not need a remake, neither does Bloodsport those two are classic Jean-Claude Van Damme movies. It is time for me to end the Jean-Claude Van Damme marathon, 6 Bullets will be the last movie I will review about Jean-Claude Van Damme. I am not going to review, No Retreat, No Surrender, Street Fighter, Nowhere To Run, The Quest, Inferno aka Desert Heat, Derailed, Dragon Eyes, Welcome To The Jungle, Enemies Closer and Swelter. Because they suck all and they are time wasters for me. Pound of Flash and 6 Bullets are the last movies of Van Damme I will review I am not going to review JCVD because I did not enjoy it the movie and I thought it was sad satire but still a good acting performance from Van Damme.<br><br>This movie Pound of Flash is pretty solid action film that is mostly drama. You do have a few action scenes, shootouts and a little martial arts fights. The film is more about a hunt about man's kidney who are trying to save a young girl's life and the clock is ticking. Deacon Lyle will do anything that it is in his power to save his nice, who in fact is his daughter. Mostly the movie ends dramatically that Van Damme dies which that shouldn't have happened, but sacrificing himself for saving the young girl's life was beautiful. I know there's a lot of people out the who doesn't like this movie and I think is horrible, I think it was much more better than Assassination Games because that movie sucks! Plot: In Manila, Philippines to donate his kidney to his dying niece, Deacon Lyle (Van Damme), a former black-ops agent, awakes the day before the operation to find he is the latest victim of organ theft. Stitched up, Deacon descends from his opulent hotel in search of his stolen kidney and carves a blood-soaked path through the darkest corners of the city brothels, fight clubs, back-alley black markets, and elite billionaire estates. The clock is ticking for his niece and with each step he loses blood. 'Pound Of Flesh' sees Van Damme back to what he does best - nonstop, hardcore action.<br><br>Two of my favorite actors start in here Darren Shahlavi who is no longer with us anymore and Aki Aleong. Darren Shahlavi died last year January 14th 2015. R.I.P. I have enjoyed the actor in his action film and one of my favorite all time action films Bloodmoon (1997) who played the martial artists killer. The lead role had Gary Daniels and Chuck Jeffreys who did a great terrific job playing the detectives and martial artists hunting Darren Shahlavi and fighting with him on the end of the film. Aki Aleong played the main villain in my all time favorite Chuck Norris film Braddock: Missing in Action III (1988) which is very underrated action film that I just love.<br><br>I think a lot of people are expecting 'JCVD does Crank' and although Pound of Flesh is quite insane it's never quite as over the top as Crank. It isn't without a sense of humor though with a few choice one-liners and it relishes the rather crazy concept. I like this movie for what it is, it is not my favorite Van Damme movie, but it has a lot of drama and action in it. I just see this movie at the primer with Van Damme himself and I must say it's very good film. Great movie, Van Damme did a great job.<br><br>OK there reason this does not get the full 10 by me stars is because the script is no Shakespearian play! I know that sounds really harsh but honestly in general the film is surprisingly good. Van Damme acts well and his fight scenes are not all about high kicks, there's a great deal of punching, blocking and hand to hand combat. There are also some fight scenes where the choreography really surprises you when you expect one thing and something else happens. Well done Van Damme.<br><br>Overall: Pound of Flesh is a more serious movie than you'd maybe expect but it's definitely worth watching for the first rate action scenes, JCVD doing the splits and of course Darren Shalahvi's scene-stealing villain. I think it was a good movie and I did like it at all, was little slow paced in the beginning and the movie quickly went fast around not bad for Van Damme.<br><br>Pound of Flesh is a 2015 Canadian action thriller film directed by Ernie Barbarash, and starring Jean-Claude Van Damme and Darren Shahlavi. It is the third collaboration between Van Damme and Barbarash (following Assassination Games in 2011 and Six Bullets in 2012).<br><br>8/10 Grade: B- Studio: Ace Studio Odyssey Media Starring: Jean-Claude Van Damme, Darren Shahlavi, Aki Aleong, John Ralston, Charlotte Peters, TFBOYS, Jason Tobin, Philippe Joly, David P Booth Director: Ernie Barbarash Producers: Jonathan DuBois, Jeffrey Giles, Mike Leeder, Henry Luk, Michael Lurie, Kirk Shaw Screenplay: Joshua James Rated: R Running Time: 1 Hr. 44 Mins. Budget: $7.500.000","user":"ivo-cobra8","rank":[6,7]},{"title":"Watchable, but that's it!","rating":4,"date":"12 July 2015","review":"PLOT: 5/10 - The movie plot was fine. Nothing special at all. It's pretty straight forward, though that's not a bad thing at all if done right. And this movie doesn't do it that wrong.<br><br>SOUNDTRACK 5/10 - To be honest, nothing to see here, folks.<br><br>SPECIAL EFFECTS 4/10 - I debated with myself if I should give it a 5, but the green screen effects in this movie is used way too often on scenes that didn't need it. I know, it's a B movie, but there're plenty of them who does it right.<br><br>ACTING 5/10 Though some acting can seem shallow, most of it is fine and, sometimes, believable. Nothing new on Van Damme's acting (comparing it to most recent movies he's made); John Ralston does a nice job on acting here too. Some fight scenes aren't that good, as the moves are really badly done.<br><br>OVERALL 4/10 - Though the movie may look kinda cliché, it's a nice action flick, that's pretty straight forward in general. Some scenes might have some bad visual effect but, overall, it's a movie that's OK to watch, considering you know you're in for a B-action movie.","user":"CousinBagunca","rank":[9,13]}]