[{"title":"Better than the first one!","rating":9,"date":"6 April 2018","review":"SQ2\nTHIS sequel is much better than the first part. Great visuals, dynamic and interesting plot. While the main idea of the first film continues its logical development in the second, this film is fun to watch it its own. Once again, the viewer is shown that the main battle between good and evil occurs in the soul of every person, that it is never too late to go over to the side of the good and the truth. The movie will be interesting for both adults and children. I liked it!","user":"bobby-maddox","rank":[4,4]},{"title":"Keep an open mind","rating":9,"date":"23 March 2017","review":"First, let's start by reminding people that Wizart is a NEW animation studio that started up in 2011. As far as animations studios go, this is a very young studio. With that said, however, that also means that trying to compare them to weathered studios like Disney/Pixar and Dreamworks isn't exactly a fair assessment.<br><br>So, let's focus on what really matters:<br><br>Story: The Snow Queen 2 opens by skimming sequences of the first movie, but then quickly points out that this film is just as much attached to the events of the first, but also striving to be it's own thing... which it does quite well. <br><br>Your Main Character, Orm is a complex character filled with emotion that he buries deep inside of him. Add in a sarcastic-humor and you get a pretty entertaining character. Mixed in with a number of other colorful personalities (many are stereotypes) you enter a world that is not meant to be thought to hard on, rather enjoyed for what it is.<br><br>If I must state that the highlight of this film isn't Orm so much as it is his grandma, who happens to have quite a character for an old lady... I enjoyed every moment that she was on screen.<br><br>The downside of the film was in the return of several of the main characters from the first film, almost as a crutch to the film. Their cameo (as it were) almost felt out of place and the action that revolved around them did distract from the characters that you DID want to pay attention to... but to be fair even their animation was a major improvement over the first Snow Queen film.<br><br>As far as the message of the film, I really have to say I loved it. It's a pretty clear message that any child could understand: Lying. Lying not only can hurt people, but it can tie you up into a sophisticated web that you find difficult to release yourself from. Add in the bonus message of forgiveness, and this film in many ways was better than your average Pixar/Disney film for that reason alone.<br><br>The music.... pretty average... not bad, however, not something I could hum out of a theater.<br><br>Animation quality: Still not talking about a perfect A+ animation, however, that didn't seem to be the negative of this film. For some reason, the film's loose animation style helps drive itself away from being mistaken from a Disney/Pixar film... for a person like myself, that's actually a good thing.<br><br>Wizart has so much to offer, and I'm sure that they're only going to keep getting better as time allows. I am genuinely impressed with their progress.<br><br>If you haven't seen this film, check it out. I highly recommend it.","user":"nickjeromana","rank":[3,3]},{"title":"More icy than magical","rating":6,"date":"29 September 2017","review":"Found myself surprisingly liking the first 'Snow Queen' film from 2012, though it will never go down as one of my favourites. The second 'Snow Queen' from 2014 is actually not as bad as the review summary seems to imply (which is an admittedly corny play-on of the film's title 'The Magic of the Ice Mirror'), it's pretty decent but of the two films the superior one is the first.<br><br>There are things that bring 'The Snow Queen 2: The Magic of the Ice Mirror' down. Several of the first film's characters return here, but they are mostly reduced to cameos and only seem to be there to tie in with the first film. This does clutter the film somewhat and distracts from more interesting characters like Orm and his grandmother, while some of them are entertaining others didn't add anything. Gerda frankly could have been left out entirely because she barely has anything to do.<br><br>Storytelling isn't as good either. Not awful certainly, there are tense, fun and heart-warming parts, some of it is not too hard to follow and the messaging is beautifully done, being interesting and giving the film heart. The pacing does tend to be a bit too slow though and there also tends to be a clumsily disjointed and muddled feel to the storytelling that doesn't make the film as focused as ought. Parts of the dialogue are corny and some of the music choices don't quite gel.<br><br>However, the animation is great. If there is anything that is an improvement over the first, it is that the character designs are more appealing and refined with smoother movement. Once again the colours are lavish and atmospheric, the backgrounds are meticulous in detail and there was certainly a lot of attention put into the little things as well as the big effects. Much of the music, mostly the scoring, is rousing, haunting and rousing.<br><br>As said, 'The Snow Queen 2: The Magic of the Ice Mirror' does have some heart, fun and tension and the message is a good, clear and well-intended one delivered in a way that makes its point but not in a preachy way.<br><br>Orm is an interesting character, the entertainment value and conflicted edge the writing brought makes him more than a standard archetype. The grandmother steals all her scenes. The voice acting is serviceable.<br><br>In summary, not exactly magical but not a sequel to be left cold by. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,6]}]