[{"title":"A beautiful thoughtful debut feature film from director Andy Goddard .","rating":10,"date":"23 July 2014","review":"A black and white two hander some what similar in concept to Christopher Munch's Lennon/Epstein double header \"The Hours and Times\" or Simon Curtis' more recent \"My week with Marilyn\" Set Fire to the Stars shows us a semi-fictionalised account of a few days in the lives of Welsh poet Dylan Thomas (Celyn Jones) and the literary professor John Brinnin (Elijah Wood) who brings him to perform in New York. A raging alcoholic Dylan Thomas leaves behind a trial of destruction while also teaching Brinnin that poetry is about more than technique but about feeling and living and being.<br><br>Early reviews cited some disappointment that this film wasn't more in the spirit of Withnail and I. The link is understandable as a large section of the film features two opposing personalities (one of whom clearly struggles with drink) spending time together in a remote cabin but the comparison is a little lazy. Though at times laugh out loud funny this is a long way from some Brit-com romp and is instead a thoughtful and thought provoking piece on the difference between the academic and the artist.<br><br>Celyn Jones' performance as Dylan Thomas is perfectly pitched. It would have been easy for him to have slipped into caricature but he makes Thomas real and presents us with a man who is clearly troubled but who is also brimming full with warmth and passion. As is clear from the poet's work he was all too aware of the fleeting nature of life and Jones shows that. His Thomas doesn't want to waste a moment (often to the detriment of those around him). He is also aware of his gift with words but unlike the academics he meets doesn't want to look too closely at why his poetry works in case through knowing he loses it all.<br><br>While Thomas is about the magic of the words (demonstrated best by the look of pure joy when horror writer Shirley Jackson finishes her tale) Elijah Wood's Brinnin is about wanting to know why those words were chosen in the first place. There is a moment when Brinnin asks one too many questions about poetical technique and Thomas/Jones goes from laughter to a face twisted with rage in an instant. His Dylan is a wild beast who you do not want to rile. For me the best scene in the film is when he tires of the masters from the Ivy League Universities and decides to prick their pomposity with a few well delivered limericks. Jones shows us not just a drunk at a table but an artist all too aware he is about to press the self destruct button. We also see in Jones' performance the regrets and fears that Dylan had to live with because of his behaviour as well as the understanding of the power his words carried. \"Tell him Dylan Thomas thinks he's great\" he suggest to Brinnin when reviewing the work of one of his students; knowing that sometimes less really is more.<br><br>The success of Lord of the Rings has clearly given Wood the freedom to pick roles that interest him and John Malcolm Brinnin is no exception. His performance is subtle but with the massiveness of Thomas next to him it needs to be. It would have been easy for Brinnin to simply be the straight man, the academic clearly out of his depth and picking up the pieces left in Thomas' wake but the character goes deeper than that. Wood's Brinnin isn't just hanging on for the ride, he is very much part of it and his character develops throughout. He goes from wanting to protect his career to protecting his friend.<br><br>The acting across the board is of a particularly high class. Shirley Henderson and Kelly Reilly (who emerges nymph like from Dylan's self consciousness) have been singled out by many for praise but mention should also be made of Kevin Eldon as Shirley's cuckolded husband Stanley, Steven Mackintosh as Brinnin's boss Jack and an exceptional turn from Richard Brake as the mysterious \"Mr Unlucky.\" The script written by Jones and Goddard is based upon Brinnin's 1957 \"Dylan Thomas in America\" but the film actually covers no more that the first 30 pages of 300. The critically lauded scene of the meeting with Shirley Jackson for example is one brief paragraph. The integral letter from Thomas' wife Caitlin mentioned in no more than a couple of sentences. Drunken exploits are referred to in Brinnin's book but never expanded upon. It is remarkable that so much of the script is fiction because it flows and feels so true. The script is clever, witty and moving. The quality of the acting obviously helps but those words have got to come from somewhere.<br><br>Visually as well the film is stunning. It is a snapshot of a moment of Thomas' life and the cinematography reflects that; capturing beautiful moments in crisp black and white. There is a wonderful overhead shot of Dylan in the bath, fully clothed and surrounded by floating candy wrappers. Comedy and tragedy there for all to see. Accompanying the images is Gruff Rhys gorgeous soundtrack, a new breed of Welsh poet.<br><br>There are other reasons to admire and love this film. Viewers should know that it was shot in less than two weeks by a crew for many of whom this was their debut feature film. You should know that this was filmed entirely on location in Swansea, Wales with a few carefully placed fire hydrants creating the illusion of New York. That none of these things are apparent from what is on the screen is just another reason to be stunned by what has been achieved.","user":"home-townunicorn","rank":[26,36]},{"title":"Mesmerising","rating":10,"date":"30 May 2015","review":"This film is the perfect example of why great writing, direction and performances will always be more important to creating great cinema than having oodles of cash and lavish visual effects. Shot in weeks not months, no one misses a beat in this story about an enigmatic, troubled genius. Wood and Jones are mesmerising as Brinnin and Thomas respectively and it's beautifully directed in black and white by Andy Goddard. Finally, a mention for Gruff Rhys whose haunting soundtrack perfectly augments a beautiful film. It amazes me that films like this have to fight to get made. One of the best films I've seen in the last few years. A must see whether a fan of Thomas or not.","user":"stevelewis92","rank":[10,12]},{"title":"A return to The Golden Age of Hollywood.","rating":10,"date":"21 November 2014","review":"Having now watched this film twice I have to say that to me Set Fire To The Stars is a master class in classic film making, Hitchcock often referred to 'pure cinema' the art of story telling via the art of the composition of shots and the smooth editing used to translate the written word into a visual experience and this film truly achieves what Hitchcock discussed. <br><br>It takes me back to the classics of film, the films that originally drew my attention and focus into the importance of film as an art form and lead to my career aspirations of sharing the joy and experience I had felt into the minds of the young and impressionable generations of the future. I have been a lecturer in Film Studies for 15 years.<br><br>The relationship between Thomas and Brinnin is just so beautifully created it almost feels as though one is part of this close and personal journey they shared. The relationship that develops through the film almost brought me to tears on more than one occasion while watching the film (if not for being a true 'Yorkshire man' then I think I could have shed a tear or two) The pain and frustration that Brinnin feels towards Thomas can be truly felt by the viewer, in one moment their relationship is so perfectly created only for the next scene to totally destroy Brinnin's 'love' for Thomas – pride that almost immediately becomes embarrassment, joy that turns swiftly to sadness – can only be said to be breath taking. <br><br>The performances of both Celyn and Elijah are at the height of what one would expect from the classics of Hollywood in its Golden Age, I do have to say that Celyn outshines on more than one occasion - which are the moments that made me feel extremely emotional, a man on the edge who was so lost in excess that I felt extreme sorrow for the character and those around him. <br><br>The composition of the shots is without doubt awe inspiring; I did not find one shot that jolted me from this visual feast. I get great delight from films that are obviously so cinematic, sadly something that is missing from so many contemporary films and what distinguishes a film from a movie. The scenes that stood out the most to me are the lake scene, the café scene (which was perfectly composed), the chess game and the woodland – just perfect.","user":"The_Educator","rank":[19,27]}]