[{"title":"Wolves are a part of the greater circle; innocence, honesty, spirit, mother earth","rating":10,"date":"26 February 2016","review":"Buckle up, turn up the volume and listen to ethereal music, songs of the soul and the story of the wolf. Join Julia Huffman, director of Medicine of The Wolf as she takes us on journey. Chapter by chapter, we are introduced to Canis Lupus . Along the way, a Wolf biologist, Native American Indian Elder, photographer, a youth program, with rescued wolfdogs, and others share with us the history of the wolf, their value as apex predators to the ecosystem, their beauty, and how their strength and survival depends on the family unit or pack. They also teach us about the cultural and spiritual significance of the wolf and their ability to draw us in to a deeper spiritual sense of love.<br><br>Sadly, While the language of the wolf is universally recognized by their soulful howls, there is a divide in how they are are understood and seen; going back to the story of Little Red Riding Hood and today, their fragile place on the endangered species list . By some, they are viewed as ruthless killers and werewolves and by others, as intelligent, magnificent and essential creatures. We learn, just how misunderstood and persecuted they are. We learn just how much we also care about their survival.<br><br>Most of us will never have a chance to see or hear wolves in the wild. Medicine of the Wolf allows us to travel into wolf country and gives us a chance to see them through the eyes of Jim Brandenburg who has lived and photographed wolves for 45 years. We also find ourselves; like the teens at Wolf Connection reconnecting with something deeper within ourselves in the presence of wolves; if even on film. We are able to for a time, hear their howls and recover that which most of us have lost; our wildness, our sense of freedom and to ability to sing from the depth of our souls.<br><br>Medicine of the Wolf reminds us, why we should not only care about our Apex predators but also about this earth and the circle we are all part of.<br><br>Medicine of the Wolf, will leave you tasting the salt of your own tears. I LOVED it -- it left my heart filled with hope for our wolves. I know, I won't be alone.","user":"fmrl_os","rank":[8,10]},{"title":"Guaranteed to touch your soul","rating":9,"date":"15 November 2015","review":"Julia Huffman shows us how miss understood and beautiful the wolf really is. I had no idea what a positive impact the wolf has on our environment. We must do our part to protect this beautiful species. Julia shows us in such a touching way the amazing connection Jim Brandenburg has to the wolf. He has spent his life living with wolf's and taking incredible photographs of them to also help us all see wolfs in a different light. Thank you Julia for bringing to our attention the importance of protecting this beautiful animal. I just can understand how anyone could kill such a beautiful animal, for that matter any animal, especially for sport. Personally I feel trophy hunting is not OK and should be banned. Please recommend to others to see this important film so more can get to know and understand the wolf, and maybe more will help protect them.<br><br>Kevin","user":"hmmmisthatright","rank":[10,14]},{"title":"Informative and inspiring","rating":10,"date":"10 February 2016","review":"Julia Huffman's documentary beautifully tells the history and uncovers many of the mysteries of wolves. It's current and compelling. The film comes at a time when the existence of wolves is in danger. Decisions by politicians to remove wolves from the endangered species list led to other decisions, state-by-state, to add wolves to the lists of animals that can be legally hunted and killed. Medicine Of The Wolf brings the audience literally face to face with wolves. We wolves interact with each other and with humans. The film introduces us to Jim Brandenburg and his images of wolves taken over a career of nature photography. Watching Medicine Of The Wolf I gained a deeper appreciation and understanding about this often misunderstood animal species and the choices humans can and will make about its future.","user":"kerrysd","rank":[5,7]}]