[{"title":"Smart with heart.","rating":8,"date":"8 June 2016","review":"Woody Allen by way of Noah Baumbach is as close as I can come to give you an idea of how amusing, smart, and awkward Rebecca Miller's Maggie's Plan is. But, then, the adjectives as well describe indie-fav Greta Gerwig playing Maggie, whose plan to send her husband back to his ex wife reveals the layers that make Maggie one of the most complex romantic heroines in film.<br><br>Having fallen in love with hot \"ficto-critical anthropologist\" John (Ethan Hawke) at The New School, where she works as a career counselor for grad students, Maggie in her quietly innocent but manipulative way has a child with him after his divorce and their marriage. One of the comedic elements is her previous plan to have an artificial insemination from hippy pickle entrepreneur Guy (Travis Fimmel). She has no need to produce the baby in a normal way, an eccentricity never explained but for me felt to be another facet of her quirky and honest personality.<br><br>Although you can see the goofy and formulaic elements, underneath is Maggie's genuine wish to have a normal love, a situation not really meant for her given her wacky judgment and clueless orientation. Throughout the wryly wacky plot are numerous elements of truth in modern culture: having a child purposely without father involved; career taking precedence over family (Julienne Moore as high-powered ex-wife academic); step kids as complicating elements; and so on.<br><br>Writer/director Miller is deft at playing the elements off each other to make it feel as if all of this confusion is just part of a larger plan. Maggie, as a self-confessed meddler, goes through a labor-intensive series of challenges that go beyond the clichés of the romantic comedy formula. Although the accumulation of challenges may seem too many, each one resonates with a human predicament common to us all.<br><br>It's romantic comedy with brains and heart. So human.","user":"jdesando","rank":[29,42]},{"title":"a richly satirical, funny and entertaining post-feminist comedy about sex and marriage","rating":7,"date":"13 July 2016","review":"The eternal triangle and the romantic comedy have been soulmates forever but how many ways you can tell the same old love story? The era of female empowerment and emotional recycling is upon us, so it is refreshing to see Maggie's Plan (2016) take an old story formula and update it with offbeat humour centred on modern marriage. Contemporary lifestyle choices such as wanting a baby but not a man or handing a used lover back to a former owner are just some of the scenarios played out in this intelligent and delightful rom-rom.<br><br>The simple triangular plot pivots on independent-minded Maggie (Greta Gerwig), an over-controller who loves falling in love but cannot keep a relationship longer than six months. Wanting a baby without the strings, she arranges for a sperm donor just as she meets John (Ethan Hawke), an insecure academic who is emasculated by the stellar career of his imperious wife Georgette (Julianne Moore). John's need for constant mothering is no longer fulfilled by the dynamic Georgette, so Maggie and John inevitably pair up and one corner of the triangle disappears. Three years later, Maggie is over the needy John and his permanently incomplete 'great novel' so she hatches a plan to reunite John with Georgette. A clever script laced with tangled textual barbs like \"ficto-critical anthropology\" (Google it) and one-liners like \"nobody unpacks commodity fetishism like you do\" are rapid-fire and hilarious send-ups of the pretentious world of academe. It is at this level that the film shines brightest: not with belly laughs or madcap comedy, but through a whimsical lens focused on the world of intelligent people who think they control the ebbs and flows of the uncontrollable.<br><br>The acting performances are all top-shelf. Julianne Moore plays the understated dominatrix with a hilarious deadpan Danish accent, and Ethan Hawke is perfect as the hapless male out-powered by the females in his life. The standout performance is Greta Gerwig whose big doe-eyed innocence and naivety about the ways of the world make her scheming utterly forgivable. While the story has a predictable narrative arc, the dialogue is richly satirical, funny and totally female-centered. It is also an entertaining post-feminist comedy about sex and marriage which imagines a future where males are only needed for sperm and are then recycled amongst whoever will tolerate their innate weaknesses.","user":"CineMuseFilms","rank":[20,28]},{"title":"Ambivalence hurts this comedy.","rating":5,"date":"9 June 2016","review":"Maggie's Plan (screened at the 59th San Francisco International Film Festival), along with many indie films like it, uses a more ambivalent tone in regards to a character's reaction to dramatic shifts in their lives. It's a popular approach towards acting these days, but it can sometimes make a film seem like it is mocking a situation that should otherwise be dealt with in a genuine and serious way- even if it is a comedy.<br><br>Greta Gerwig plays Maggie, a teacher at a local university. She is single and seeking to have a baby on her own very soon. She begins spending time with John (Ethan Hawke), another teacher, who is married to Georgette (Julianne Moore). Maggie agrees to give John notes on his book that he is writing, and soon the two fall in love. They consummate their relationship the very night Maggie has inseminated herself with sperm from a guy she knew from High School. Three years later John and Maggie are married and have a beautiful three-year-old daughter. However, Maggie is done with John and realizes she doesn't love him anymore, so she hatches a plan to get him to back together with his former wife.<br><br>As the film is called Maggie's Plan, it may have been better to only follow her around the whole time. She is a character with a quirky nature in a cast full of overtly strange characters. If the story remained firmly told from her perspective, rather than from others in the film, she may have stood out more, and her motivation might not have been lost. Instead, everyone is just as quirky and just as detached as her, making it hard to become attached to any of them, as none of them feel like they are taking their lives seriously.<br><br>Gerwig (Frances Ha) is a good character actress, and she manages to represent what this kind of millennial character is supposed to be according to the world: passionate but passive about their interests. With no genuine moments or emotions. She's like a more idiosyncratic blonde Zooey Deschanel; usually this shtick works for her, but this story is so fraught with what should be pure human emotions that it lessens the impact of the situation.<br><br>Julianne Moore's Georgette is an intimidating character. Moore sports a very confusing European accent, the only reason seeming to be that it adds even more quirkiness to the movie. She has an almost militaristic strategy towards raising her and John's children and how she approaches her relationship with John. In one scene, she says Maggie ruined her life by taking her husband, but she is completely passive about it when it comes to her actions. She's the most well adjusted wronged woman in the world. This is an example of how the characters will talk about emotion and love but perform no action to back it up. Ethan Hawke's John is such a clueless man that it's kind of sad. He works and works on this book that he is writing so much so that he doesn't even notice the games the women around him are playing with his life.<br><br>There are some truly fun and funny moments in the film, which comes naturally with such a tone. Maggie's interactions with the children are amusing, and she has a few good one- liners in there about the state of relationships. Director Rebecca Miller (The Private Lives of Pippa Lee) may just love this type of film making, which is fine; she is in the same camp as Jim Jarmusch and Yorgos Lanthimos. The ambivalent formula does work for many people, but it seems counter intuitive to make light of love and marriage while also insisting how important it is.","user":"stinadianne","rank":[12,17]}]