[{"title":"Shawshark redemption","rating":5,"date":"8 March 2016","review":"There are already 50 shark movies and most of them are weak even for the fans of the shark attack films. This one is not the worst but actually quite hilarious one.<br><br>Somebody blows up something and the prehistoric monsters are released (which time already? Dinoshark, Malibu Shark Attack, Jersey Shore Shark Attack, Megalodon, Jurassic Shark). Parallel, some good looking female prisoners are taken to the forest for some involuntary work. Nobody knows that one of the ladies is organising an escape plan. On the way back the prison truck is ambushed by Rayne - the vampire slayer and a lover of one of the prisoners. Nonetheless, their plans to reach for freedom are quickly revised by river/sand sharks. The local area is also investigated by two agents - Sculder and Molly I presume.<br><br>This flick contains everything bad you can get in a shark attack film. It also has everything charming concerning the amateur productions. The special effects are practically none, most of the attacks happen in an off-screen fashion. There is a cheesy romance subplot, god knows what for. However, I must say I was interested in the events. Why? Because the humour was really good. Actually it makes you go throughout the movie quite quick and fortunately it's only 80 minutes long. So normally it would be like 3/10 but I gave more for the funny parts.","user":"majdo007","rank":[20,24]},{"title":"So bad it's good :)","rating":6,"date":"18 May 2016","review":"This is awesome, everything a good b grade movie should be except for being surprisingly low on gratuitous nudity given the subject matter.<br><br>Underrated movie methinks, i'd have it at least 2-3 rating points higher than jurassic world, i mean it's sh*t and ridiculous but at least it knows it's sh*t and ridiculous and doesn't pretend it isn't and didn't cost the GDP of a small nation to make. <br><br>The CGI is an embarrassment but that's OK cause you're too busy laughing at this movie jumping the shark by introducing us to prehistoric amphibious land sharks, the acting is a little better than horrendous which suits the tone of the movie perfectly. <br><br>There wasn't a great deal of logic or sanity in the making of this film, someone just said f*ck it i wanna make a movie about prehistoric sharks that are somehow also capable of swimming through land (no, i am serious really you need to watch this) and have them eat all these prison porn stars that are on the most ridiculous work release program ever.<br><br>Highly recommend :D","user":"shawnl1970","rank":[12,14]},{"title":"Sharkasm","rating":9,"date":"17 April 2017","review":"Well, since everything that needed to be said about this movie has already been written about by one of the Top 500 Commenters on Amazon, then I'll just add my bit to it. (While it was a highly entertaining and excellent work of art, achievable only by the most experienced Shark Trainers in the World, just imagine how difficult it must be to train the sharks to burrow through sand and swim in less than a foot of water, and what kind of treats could they possibly be giving the sharks to entice them to perform so admirably, but at the same time not eat the Cameramen, Lighting and Sound Technicians). Just some \"SARCASM\" here to lighten the mood. Hope you enjoyed my Bit.","user":"sgdptech","rank":[4,4]}]