[{"title":"A good looking effort, but no new ground broken","rating":6,"date":"10 June 2015","review":"The movie is about the early days of Wong Fei Hung, a real person in late-19th century/early 20th-century China whose deeds have been greatly embellished and made into dozens of films and TV series. He is the same character portrayed by Jet Li in the Once Upon a Time series.<br><br>However, the film itself has almost nothing to do with the real person. The main character uses the WFH name and his father conjures up familiar memories of a umbrella-wielding kung fu master popularized by the Iron Monkey film. Also, in the real-life tales of WFH's heroic deeds, it is said that he took on a dock gang in his early days, which this movie loosely portrays.<br><br>Other than that, this movie could have simply been a standalone film. But the WFH name is famous throughout China and no doubt was used to sell more tickets.<br><br>Although the use of CGI and wire is very noticeable at times, the overall look and choreography of the film is very good. Unfortunately, as is common with Chinese films, too much attention is paid to the look, but not enough to the substance. <br><br>Ultimately the movie does not break any new ground. As is common in Chinese action films, characters again do inexplicably idiotic things for the sake of creating \"drama\" or \"emotion\" and to create convenient scenarios to push the plot along without any serious attempt to explain WHY. <br><br>Overall, it's not a bad movie but it's also little more than another typical Chinese flick that looks good but doesn't do anything beyond that.","user":"holyabdul","rank":[4,4]},{"title":"A moderately entertaining, if uninspired, prequel that is more gangland thriller than origin story on Wong Fei Hung – not least for its lack of any thrilling fight sequences","rating":6,"date":"26 November 2014","review":"No less than two decades have passed since Jet Li took up the iconic role of Wong Fei Hung in Tsui Hark's classic 'Once Upon A Time in China' series, and for good reason, no filmmaker for that matter has dared mount a similar big-screen version of the renowned folk hero. Until now of course – 'Rise of the Legend' sees Hong Kong director Roy Chow Hin-Yeung step up to the challenge of re-making a legend by way of an origin story, casting rising Taiwanese actor Eddie Peng as the titular protagonist.<br><br>We're sad to disappoint fans of Peng, but the actor is simply no substitute for Li. The comparison, unfair as it may be, is inevitable, because Li had so completely inhabited the character that the very first impression which comes to mind when one thinks of the character is Li himself. While he may project enough confidence and fresh- faced charm to convince as a younger and brasher Wong Fei Hung, Peng simply lacks his predecessor's poise and nuance to make his portrayal as dignified and compelling.<br><br>A lot of Peng's performance doesn't go much further than posturing, alternating between a smug self-confident demeanour when with the members of the villainous Black Tiger gang whom he infiltrates to dismantle from within and a spirited show of grit (not unlike that which he displayed in 'Unbeatable' as an MMA-fighter) when taking on his opponents fist-to-fist. Only when he gets the occasional reprieve to hang out with his childhood buddies Fiery (Jing Boran) and Chun (Wang Luodan) do we see a more sincere and earnest performance from Peng, but these scenes – given the covert nature of his character's personal mission – are sadly few and far in-between.<br><br>Though he may have the athleticism and physique (we're talking oiled-up pecs and rippling abs here) to boot, Peng lacks the physicality of someone who's trained in the martial arts. Indeed, that is too ostensible in the action sequences directed by veteran choreographer Corey Yuen, which in narrower high-walled alleyway settings is filmed with the sort of artistic distractions emulating last year's 'The Grandmasters' – complete with rainwater, (plenty of) slo-mo shots and p.o.v. framing – that sees Peng look rather than truly impress and in more expansive locations relies too heavily on the use of wirework to augment Peng's moves (or lack thereof). The fact that the fight sequences aren't as exciting as they should be isn't Peng's fault alone no doubt, but, unfortunate as it may be, it still is too clear Peng isn't a natural performer the way other luminaries like Li, Jackie Chan or Gordon Liu were.<br><br>To be sure, Peng is hardly the start of 'Rise's' problems, which, though absorbing in parts, has its obvious flaws. Though intended as a story to explain the origins of Wong Fei Hung, Christine To's script hardly gives the character much depth. A few flashback sequences show Wong's father (Tony Leung Kar-Fai) imparting some words of wisdom about saving people which he continues to hold dear as well as how a brief stint at a monastery transformed his sense of vengeance following his father's death at the hands of some local thugs to one seeking justice, but come off obligatory rather than poignant. There is even less time to get to know Fei Hung when Peng takes over as a young adult, as To has him too busy caught up in the plot machineries of a gangland thriller than to build a multi- faceted portrait of him – other than the already established fact of his inimitable sense of righteousness.<br><br>Not that the colourful underworld comprising of Sammo Hung as Master Lei, the leader of the Black Tiger gang, and his adoptive sons – North Evil (Jack Feng), Black Crow (Byron Mann) and Old Snake – isn't entertaining; there is good fun to be had in watching Fei- Hung, Fiery and Chun destabilise the squabbling trio and their domineering head from within – as Fei-Hung wins Master Lei's trust by killing the head of the rival North Sea gang to become his fourth adoptive son – and without – with Fiery and Chun leading the poor, hungry and oppressed men on the streets under the banner of the Orphan gang against the Black Tigers. To weaves quite an ingenious scheme here, so much so that Chow's filming struggles to keep up, and there are scenes which would clearly have benefited from the direction of a stronger helmer.<br><br>That is probably also part of the reason why To's attempt to paint Fei Hung as a man with a big dream of restoring justice to the masses, who stuck with his ideals even though they came at a hefty personal cost, isn't quite as rousing as it is meant to be. Yes, sacrifice figures heavily in the third act, but because the friendship between Fei Hung and his childhood buddies doesn't get enough screen time to be fully fleshed out, the eventual denouement awaiting some of them, in particular as it relates to Fei Hung, is less moving and persuasive. <br><br>Whereas one would have expected a character-driven narrative for this origin story of Wong Fei Hung, Chow and To (whose previous collaborations include the unintentionally hilarious detective thriller 'Murderer' and a middling follow-up 'Nightfall') opt instead for a plot-driven one that transplants the elements of a gangland thriller into a martial arts actioner. The result is more the former than the latter, so those expecting some thrilling fight sequences will surely come off disappointed – more so after a lacklustre showdown between Peng and Hung in a blazing warehouse where the two do more staring at each other and asking each other how 'hot' it is than fighting. For now, this 'Legend' remains firmly with Li and Tsui Hark, whose 'Once Upon A Time in China' remains the only Wong Fei Hung you need to know.","user":"moviexclusive","rank":[14,21]},{"title":"Exciting but very familiar as well.","rating":7,"date":"19 February 2015","review":"Before I can really discuss \"Rise of the Legend\", I need to give you some background. This isn't especially clear in the film and for non-Chinese audiences, the setting might be confusing. In the 19th century, various nations forced the weak Chinese Ch'ing leaders to accept their presence in the country. Countries like Britain, Russia, France and even Japan carved out portions of the country to be used as bases for trade and one of the ways they made money was in the opium trade. Additionally, Chinese warlords and gang leaders worked with these foreigners to exploit the country and its wealth and, not surprisingly, the common people resented this. But these foreigners and their Chinese partners were getting rich and had little regard for the damage they were causing. This led to a variety of wars (such as the Opium Wars and, later, the Boxer Rebellion) and eventually to unification and the abolishment of the Emperor--who seemed to care little about the plight of the people or the weakness of his country. One hero during this period of civil war and chaos was Wong Fei-hung (also known as Huang Feihong). His prowess with martial arts made him a rallying point and many of his exploits have been celebrated and exaggerated in movies over the years, such as Jet Li's \"Once Upon a Time in China\" and Jackie Chan's \"Drunken Master\" films. The latest in a long line of semi- biographical films is \"Rise of the Legend\".<br><br>In this version, the earlier part of Wong Fei-hung's life is explored by director Roy Hin Yeung Chow and the legendary man himself is played by Eddie Peng. While Peng is not exactly a household name, his martial arts skills are superb in the film-- mostly because they are both incredible to watch and generally believable. Little so called 'wire fu' is used in the film and heroes DO bleed and get the snot kicked out of them from time to time. The only really difficult to believe part for me was watching the familiar actor Sammo Hung fighting the hero to nearly a draw. While Hung has made a ton of martial arts films (many with his friend Jackie Chan), he is in his 60s and, well, a bit rotund (I have NO reason to talk in this department)--and seeing him battle Peng did take some suspension of belief, though Hung did amazingly well and surprised me with his performance.<br><br>The film is a bit difficult to follow, as some things in the plot the film assumes the viewer will know. Additionally, the storytelling is occasionally non-linear. So, as I watched, I found that I really needed to pay attention, understand the context and piece it all together in my mind as I watched. What you slowly come to realize is that the evil leader of the Black Tiger Gang in Canton, Lei Gong (Hung), has just made Wong Fei-hung his fourth adopted son after Wong single-handedly kills one of Gong's rivals and takes out a HUGE number of the guy's soldiers. You can only assume Wong is evil, as Lei Gong is rich from his profits in selling opium and slavery. However, as the film progresses, you realize that Wong is playing a very deep plan--one that aims to eventually free the slaves, destroy the opium warehouses and aid the common man. Considering that Lei Gong is ruthless, evil, has an army of his own and has three other adopted sons who are amazing with their martial arts skills, Wong's task seems monumental to say the least!<br><br>So is this any good? Well, generally yes. The action is first- rate. While not quite as wild as you might find in many films, the martial arts fighting looks real and it will keep you on edge. Additionally, there are many story elements that work well. My only qualms are the way the story is presented. As I alluded to above, the film can be a bit hard to follow and sometimes I got the feeling that I've seen many similar films--and I have considering how many Wong Fei-hung films have come out of China in the last few decades! My verdict is that if you are a fan of the genre and understand the context, by all means watch this one. If not, then it's not exactly a must-see film...though you certainly can't go wrong watching it.","user":"MartinHafer","rank":[11,18]}]