[{"title":"Making Night of the Demons","rating":24,"date":"24 May 2015","review":"You're Invited: The Making of Night of the Demons (2014) <br><br>*** 1/2 (out of 4) <br><br>This 72-minute documentary starts off with director Kevin Tenney, animators Kevin Kutchaver and Kathy Zielinski, writer Joe Augustyn and producers Jeff Geoffray and Walter Josten as they discuss the pre-production on the film. Tenney talks about how he ended up getting hired for the project and there's a lot of talk about certain changes that had to be made to the original screenplay. From here we learn about the original title of the film and why it had to be changed and what problems this had for the animators of the opening credits.<br><br>From here cast members get introduced and discuss how they were hired. Linnea Quigley, Cathy Podewell, Allison Barron, Donnie Jeffcoat, Alvin Alexis, Jame Quinn, Billy Gallo, Amelia Kinkade, Lance Fenton and Hal Havins are all interviewed and talk about their characters and what it was like to work on the film. Finally, we get stunt coordinator John Stewart and make-up artist Steve Johnson who talk about their roles.<br><br>If you're a fan of NIGHT OF THE DEMONS then you're going to be extremely happy with this Shout Factory! documentary that nearly runs as long as the feature and as you can tell, the majority of the cast and crew are here sharing their stories. The documentary gives you a great idea of everything that went on during the production but I'd say the best segments are the first when we hear about the various issues that came up even before the cameras were turned on.","user":"Michael_Elliott","rank":[2,2]},{"title":"Nifty retrospective documentary","rating":8,"date":"1 January 2019","review":"This engrossing and informative 72-minute retrospective documentary covers a lot of neat ground on the making of the low-budget horror cult classic \"Night of the Demons.\" Director Kevin Tenney reveals that he got the gig to helm \"Night of the Demons\" because he had previously done \"Witchboard\" for the same company. Makeup artist Steve Johnson talks about how he met his future wife (and popular 80's scream queen) Linnea Quigley on the shoot and goes into detail on how exactly the infamous lipstick scene was done. Hal Havins admits that one especially vulgar line he says in the movie he took from John Belushi. Amelia Kinkade discusses how thrilled she was to perform and choreograph her own dance number. Cathy Podewell quit her waitress job after getting cast in the lead while James Quinn did all the demon voices. Moreover, we also learn that the house was located in a bad neighborhood, the possession makeup took five to six hours to apply, the cast were constantly playing practical jokes on each other, and a room in the house had to be fireproofed for an intense fire gag. Recommended viewing for fans of the film.","user":"Woodyanders","rank":[0,0]}]