[{"title":"Entertainer","rating":7,"date":"29 August 2014","review":"I was not expecting much from this movie. May be that is why it surpassed my expectation. Their are some cons in this movie, but it has got some pretty good twists in it and will make you watch till the end. Love story part is not up to the mark. It is just a cliché. It even will make you laugh at several occasions. But that was obvious. The songs are really good. 'Tere Hoke Rahenge' is quite brilliant. The entire movie is visually very pleasing. You wont feel any lag at any point of time. This is definitely not a movie for the critics. I recommend this movie for everyone who intend to have just some fun time...!!!","user":"abhishekthegreat-pulimoo","rank":[18,19]},{"title":"Cunning Script with LOOPHOLES","rating":10,"date":"29 August 2014","review":"Nice and Entertaining Film. This time Eemran Hashmi Fans wont be disappointed. After the Average movie \"GHANCHAKKAR\" . Eemran Hashmi will be seen on screen after a gap of more than a year.<br><br>Story Starts with Raja a Small Co artist Dupe's people with his friend Raghav(Deepak Tijori). They hit the jackpot when they dupe goon-turned- businessman Vardha Yadav (Kay Kay Menon)The cat-and-mouse game and how the duo shake them off their back makes the film interesting. Then how they plan to sell the cricket team to KK MENON. Yogi(Paresh Rawal)Prepares Raja for the big thing. Why does paresh rawal helps him? For that u need to watch the movie.The Songs can be ignored coz they come whenever they want actually spoiling the mood of the film. I think the director only needed to patch them up :P . There are several loopholes in Raja Natwarlal when it comes to logic and the conning could have certainly been more cunning and conniving. One of the film's biggest confusions is how the scene shifts between Mumbai and Cape Town. Emraan is in a business deal with Kay Kay and the next moment he meets his girlfriend who had fled to Mumbai after fighting with him! And after their adventurous ride in the rainy streets of Mumbai, they are back in the lift of a hotel in Cape Town. Lets ignore that and just sit back enjoy the movie. How they con KAY KAY and how did they loot crores of money. <br><br>Total PAISA VASOOL . SURE SHOT BLOCKBUSTER","user":"bhushanagarwal555","rank":[16,18]},{"title":"Raja natwarlal in Tarantino and Soderbergh style....","rating":10,"date":"5 September 2014","review":"Raja natwarlal is way beyond my expectations and it pleasantly surprised me. Oceans trilogy fans will love it. I liked the twist in climax but the plot is too impossible in real life. So far best con movie of 2014. Emraan hashmi did decent job with new handsome look on-screen. Paresh rawal and kay kay menon are plus point to the film, especially, kay kay menon's best acting impressed me. Deepak tijori is back after long time and best suited to his role, reminded the old days of sadak, khiladi.... I don't know the names of rest of the cast but all done good job. Story line has many twists and turns which grasps your attention. Bottom-line is, heist movie fans shouldn't miss it, give it a try, worth your time...","user":"sbrjiten","rank":[6,6]}]