[{"title":"Actually Was really Funny!","rating":8,"date":"20 August 2017","review":"So I did watch the original when it came out but can't really remember the old film so I was going into this film fresh, now this film was a good watch and really made me &amp; others laugh at points throughout the film.<br><br>The film does have quite a high pace, which is not a bad thing, the animation was really crisp and the detail on the animals was really well done tbh, not that the kids would notice. As always with animation the human characters where excellently designed including the main villain, the Mayor! The story is about the Mayor wanting to demolish the park and put an amusement land there, but the animals have to fight back by causing chaos with the diggers etc, which is all good fun to watch! <br><br>Overall I enjoyed the film and I love animation films, defo worth a watch if you want to laugh!<br><br>8 / 10 – Age: 23 – Location Saw: Bedford Cineworld – Saw Using \"Unlimited Card\"","user":"kmjnhh123","rank":[9,10]},{"title":"Really, really good!","rating":10,"date":"10 August 2017","review":"In Season 4, Episode 11 of comedian Jerry Seinfeld's eponymous sitcom, he tells his mother, \"I like kids' shows. They have a very innocent, wholesome quality.\" Some kids' movies hold the same appeal for adults, not based on any double-entendres the writers insert into the script to keep adults entertained, but simply because of the good, clean fun inherent in the film. \"The Nut Job 2: Nutty by Nature\" (PG, 1:31) is such a movie. But it wasn't always this way with the franchise's characters. The genesis of this movie goes back to a 2005 animated short called \"Surly Squirrel\". The title character was more than surly. He was downright mean. You might even call him evil. That animated short (which is available on YouTube) also included enough adult language and violence that it could've received a PG-13 rating from the MPAA. Yet, it proved to be a good starting point for its writer/director, Peter Lepeniotis.<br><br>2014 saw the release of the animated feature \"The Nut Job\", which Lepeniotis co-wrote and directed. He made his squirrel friend the protagonist this time (not quite as mean, but still pretty surly) and made the plot more kid-friendly. In spite of low ratings from critics, enough kids and adults saw the film that it earned nearly $120 million worldwide (almost three times what it cost to make) and quickly earned a greenlight for the sequel. Originally, Lepeniotis was set to write and Carl Brunker (\"Escape from Planet Earth\") to direct, but Lepeniotis left the project. Brunker did direct – and also co-wrote – with Bob Barlen and Scott Bindley, all three of whom were already working on the 3rd film in the franchise (for a 2019 release), even before the 2nd hit theaters. But never fear, \"Nut Job\" fans. (I didn't mean that the way it sounded.) The sequel does well in the continuity department, with most of the main characters returning (voiced mostly by the original actors) and a plot that picks up where its predecessor left off.<br><br>The animals of Liberty Park are thoroughly enjoying access to the abandoned neighborhood nut shop. Surly Squirrel (again voiced by Will Arnett) is the hero who made it all happen and he, along with most of his furry friends, have practically moved into the basement, which has become a combination 24-hour buffet, night club and amusement park. The animals are eating, drinking and making merry like the good times will never end, but one of their own is sounding the alarm. Surly's friend and fellow squirrel, Andie (Katherine Heigl), is complaining that the animals are forgetting how to get food for themselves and that the way they are living is unnatural. She also warns that this situation can't continue forever. When it turns out that she was right, everyone looks to Surly for guidance. He assures them he can find food and takes his practically mute and none-too- bright partner-in-crime, Buddy (Tom Kenny), with him. Not only do none of Surly's ideas pan out, but he and Buddy run afoul of a tiny white city mouse named Mr. Feng (Jackie Chan) who absolutely hates being called \"cute\" and sicks his many mousy minions on the pair.<br><br>But soon, Surly and company have bigger problems than a cute (yeah, I said it), angry Kung Fu mouse, or a food shortage. They're about to become homeless! An overweight, egotistical, entitled and greedy politician (this cartoon is a mayor) simply called \"Mayor\" (SNL's Bobby Moynihan) is making plans to monetize the only place in the city that doesn't help fill his coffers – Liberty Park. He's decided to bulldoze it and use the land for an amusement park (one that looks to be as dangerous to the city's residents as he is). Meanwhile, the female pug (and friendly, but annoying face licker) named Precious (Maya Rudolph) is snatched out of the park by the Mayor's spoiled little girl (Isabela Moner). She brings Precious home and stuffs her in a cage with her male bulldog named Frankie (Bobby Cannavale) who takes an immediate liking to Precious. Back in the park, Surly has to learn a few things about teamwork and getting along with others if the animals are going to have any chance of saving their home.<br><br>\"The Nut Job 2: Nutty by Nature\" has everything an audience member can ask for in an animated feature, regardless of the Movie Fan's age. There are fun characters, an engaging story and unusually good action sequences (for an animated movie). There are also plenty of laughs (very good jokes, puns and sight gags), movie homages (\"Toy Story\", \"Mad Max\", \"Back to the Future\" and \"300\") and lessons for all (including selflessness, teamwork and the importance of working for what you need). Some of the adults in the advanced screening I attended commented that this movie was better than the first one and the kids around me seemed to be having a good time too. Transitions between story elements were a little awkward, but this sequel is still terrifically entertaining family fun and is one of the best animated sequels since \"Toy Story 2\". \"A-\"","user":"dave-mcclain","rank":[39,55]},{"title":"Really enjoyed the movie","rating":7,"date":"15 August 2017","review":"I took my three grandchildren to this movie and was a little apprehensive because of a review I had read. However, we all thoroughly enjoyed the movie. It was a good kids movie but I enjoyed it as well. It was about friendship, working together and protecting your space. The graphics were great and in general a feel good movie about the little guy winning against great odds.","user":"donna-26611","rank":[16,22]}]