[{"title":"A film that does not run rivers","rating":4,"date":"30 July 2015","review":"Rivers 9 is b grade, and more trash for Howell to do. The whole plot, whatever is nothing new, where it uses larger than life characters to compensate for what is just bad b grade fare. The acting isn't the problem, Vinnie Jones a standout, playing what he plays best. He plays a real bastard here, where we see another nasty side of him. I don't know what the F he was doing in his. Ed O Ross, I missed, because he's unrecognizable as a bad wannabe thespian at this dodgy casino run by sleazebag Jones, a two bid thug, who works for the mob. Our lead, Thomas Downey, gave a impressive and take note performance of realism, exhibiting a lot of emotion as a down on his luck guy/loser who works as a mechanic. Getting bopped by Jones, on the account of one of his thug employees causing a fracture to his windscreen, whatever, he declares war, which results in him and his wife and her daughter, nearly being blown to smithereens. The exterior shots outside of his caravan, and living premises, honestly gave the feel, it was shot on a stage. Now really pi..ed, in the wake of these thugs taking what he had, him and a few accomplices, including a couple of employees (one love smitten for the daughter, where a nice romantic scene eventuates) hatch a plan to rob a safe in Jones's office, full of moolah. What was disappointing here, among other things, was the under use of Tommy Howell's fine performance as a backwards talking, \"thinks his hot s..t\" cop, whose car doesn't run on the best tyres for some reason. The film's well acted by the others too, and the heist part of the picture doesn't end how you think. It's a thought provoking ending for all the good folk concerned. Making Thommy Howell, as a bad cop, was so obvious too, way before he showed his real self. Rivers 9 with a nice opening score, is full of some crazy characters, good performances and some quite human and funny moments. The daughter and the mother were lovely, but this film falls to the obvious, of a limited funded b grade, and \"seen it all before story\", with no real new angle. That's clearly the film's problem, and you'll notice that from the opening shot. This joins all the other fodder of Howell's, in that descent into b grade many years ago.","user":"videorama-759-859391","rank":[7,12]},{"title":"Don't think other reviewer gets it","rating":8,"date":"18 July 2015","review":"This isn't some hugely high budget mobster comedy like THE WHOLE NINE YARDS. That is like comparing apples to oranges in content, cash budget, and casting 'options' when TWNY was a major motion picture.<br><br>That being said this is charming, endearing, smaller indie version of OCEANS 11. Some absolute stand outs for casting (Ed O'Ross is a gem in everything and anything. Vinnie Jones has great presence. ) The fun camp factor is definitely there with Easterbrook, C. Thomas, Dante. It is what it is and enjoyable for it!<br><br>I think the other reviewer who gave it 1 star was harsh or didn't really see it for what was intended. Give it a shot.","user":"kjnawrocki","rank":[11,22]},{"title":"Wow","rating":1,"date":"5 July 2015","review":"I can't believe I sat down and watched this. <br><br>The acting was just so horrible. The writer and director need to put some more time into thinking about what people would say and do in a movie. Seriously Mobster A tells a chick he is gonna slaughter her and ship her to Mexico and she just says \"I love Mexico.\" I can't really tell what the director was going for. Just plain stupid? or if he was serious about how tacky everything was. The racist jokes were absolutely tasteless and out of place.<br><br>Don't waste your time. If you want comedy and a mob movie, watch The Whole Nine Yards, or even better Analise This.","user":"saburaukami-645-566777","rank":[11,26]}]