[{"title":"Romantisizing the Realtor","rating":8,"date":"8 October 2017","review":"Not in recent memory has there been a film which deals with the intricacies of the real estate world, let alone one which features an actual real estate agent as the hero of the film. \"I don't just sell houses, I deal dreams\" remarks Jack Woodman (played by James Jurdi), a super hot, ultra slick shark in a suit who happens to be L.A.'s top realtor. This guy, or maybe Jurdi's engaging performance, actually made me want to consider studying up on real estate.<br><br>Woodman's rise, fall, and ultimate redemption make up the bulk of the story, along with the crazy deal at the heart of the film which amplify the intrigue/mayhem. Satire in the vein of \"The Player\" and \"Get Shorty\" add to the mix, producing a film which flies fast, digs deep infrequently, but whose ultimate purpose is to entertain, and oh yeah, to make us all wish we were super cool Beverly Hills real estate agents who find themselves in situations with femme fetale bombshells, Russian mafiosos, Mexican gangsters, and Rob Lowe as a rock star-styled villa owner with a dark side. Are we having fun yet? You will. That's the point.","user":"rustywiler","rank":[152,155]},{"title":"A winning cocktail of \"Body Heat,\" \"The Player,\" \"Get Shorty,\" and \"Million Dollar Listing\"","rating":8,"date":"30 January 2018","review":"A genre cocktail, mixing Scorsese-light material excess with reversal of fortune drama and high stakes, sexy con man noir. But it works... largely in part to solid performances from Jurdi as an amiable anti-hero, Clark as an irresistible femme fetale straight out of a 1950's Orson Welles crime yarn, and Lowe in a hipster wig and a welcome return to the kind of raspy voiced, cool as ice villains he perfected in such comedies as \"Tommy Boy\" and \"Wayne's World.\" Wish Burt had more of a presence here though, but just happy to see him in something legit. The film also feels a bit out of the '90's, even late '80's style of action comedy which is a bit over the top but never the less welcome entertainment.","user":"melsaab","rank":[114,116]},{"title":"Real Estate, Revenge, and Redemption","rating":8,"date":"2 March 2018","review":"A redemption story about a scummy real estate agent who falls from grace, becomes a slumlord, and then gets a comeback shot at the mother of dirty deals. Good story and excellent acting","user":"marychriss-29626","rank":[106,108]}]