[{"title":"A great film","rating":9,"date":"3 August 2014","review":"Lot's of people are disregarding this movie due to \"Lack of plot\" or \"Poor cinematography\".<br><br>This isn't supposed to be that sort of movie, it's a mockumentary, done in the style of a documentary.<br><br>They have nailed that look perfectly, and the plot doesn't matter in a comedy.<br><br>The comedy is great, the deadpan nature of it is hilarious, the jokes are brilliant.<br><br>Go in with the open mind that it's not your classic style of comedy.<br><br>I think it's a great movie.","user":"lachlan-71-358174","rank":[380,423]},{"title":"Goes down as One of My Favourite Comedies","rating":10,"date":"26 December 2014","review":"\"What We Do in the Shadows\" is a mockumentary about four vampires sharing a flat together. <br><br>Going into this movie knowing nothing but the above, I did not have any idea what to expect. What I got was one of the funniest movies of this year or any year for that matter. The jokes where brilliant and more importantly, they were frequent and consistently brilliant. I loved the interaction of the main characters with each other and the supporting characters.<br><br>Each of the main vampires had their moments and were all equally funny. The movie even had werewolves and they were also hilarious. I was also surprised by the special effects which were really well done.<br><br>At one point it did feel like the jokes were getting old, but just as I had finished that thought, the movie changes and ends brilliantly. Even though there isn't much of a story, it doesn't really matter for this movie. Just watching some of the hilarious chaos that ensues in their everyday life is enough.<br><br>There are not many movies that make me actually laugh out loud, but this one did on several occasions (usually comedies, even great ones, just keep me grinning through out). This is easily one of the most enjoyable experiences I have had at the cinema.","user":"Sahl_95","rank":[213,244]},{"title":"Brilliant","rating":10,"date":"19 June 2014","review":"When you very nearly spray a mouthful of drink over the person in front of you, its generally a good indicator the movie is pretty funny. The sandwich joke had me in stitches! This movie doesn't rely on just a few jokes to carry it, they maintain a subtle layer of humour throughout and then have you in stitches with some brilliant jokes. The cast in this movie are well picked, and Stu was brilliantly played by...well Stu. Taiki Waititi &amp; Jemaine Clement really get the whole dilemma of everyday life as a vampire! Hopefully this gets picked up and the masses get a chance to enjoy this wee gem. Loved this movie and would definitely recommend it. Gave this a 10. A must see!!","user":"jabberwockynz","rank":[212,251]}]