[{"title":"What is supposed to be a taut financial thriller turns out to be an exercise in bad filmmaking, rendering this even less than a storm in a teacup","rating":4,"date":"21 June 2014","review":"Just when we thought the Hong Kong movie-making industry was making a rebound, along comes a disappointment like 'Z Storm' to give us pause. There's no doubt about it; the financial thriller is a huge letdown - not only is it because it had been touted as one of the most highly anticipated blockbusters of 2014, but also because of its pedigree (John Chong of 'Infernal Affairs' is credited as the sole producer) and its big-name cast (a who's who of the industry including Louis Koo, Gordon Lam, Michael Wong, Lo Hoi Pang and Liu Kai Chi).<br><br>But as the opening minutes quickly reveal, one should severely scale down your expectations if you don't intend to be frustrated by it. Right from the get-go, there is clearly something off with Wong Ho-Wah's script as well as David Lam's (who also receives a story credit) direction. Both have largely been absent from the filmmaking circle since the late 1990s (their last collaboration was an utterly mediocre film in 1998 called 'The Magnificent Team' starring Francis Ng and Amanda Lee), and it seems have fallen gravely out of touch with even making a decent film.<br><br>Beginning with an extended prologue that plays like a recap at the start of an episode of a TVB drama, we are fleetingly introduced to the superintendent of the Commercial Crime Bureau Wong Man Bin (Gordon Lam), who in a raid on an office abets an accountant Law Tak Wing (Lo Hoi Pang) in disposing crucial evidence that could implicate him and many others in financial fraud. Man Bin comes to the attention of the ICAC when his wife goes to the latter with evidence of his possession of a large sum of cash in a black bag upon his return from Macau. That immediately piques the attention of ICAC Principal Investigator William Luk (Louis Koo), who promptly instructs his team to bring Man Bin in for questioning.<br><br>Wong's interrogation is the sole highlight of the first half hour of the film, where he promptly calls William's teammates (Stephen Au and Derek Tsang) out for having but only circumstantial evidence of his alleged corruption. Other than that, and right up till William realises he is going up against the likes of two high-powered politicians (Alfred Cheung and May Law in guest roles), the film flits from scene to scene with nary any care for continuity; in fact, we'd go so far as to say that it doesn't even bother with establishing a single compelling sequence, disguising its incompetence with an urgent but ultimately silly momentum and an awfully cringe-worthy score that knows no subtlety.<br><br>By the time the ICAC christens the titular operation, your patience would probably have been worn thin, but any hope that things will pick up are just as quickly dashed. The needlessly convoluted story further introduces Michael Wong as a shady lawyer Malcolm Wu doing the dirty deeds for a George Soros-type character, using Dada Chan's cancer survivor Angel Leung as a pawn to hook Lo and Felix Lok's high-ranking civil servant into his Ponzi scheme under the 'Z Fund' - hence the name of the operation if you're wondering. And yet these subplots add little to the central story of the ICAC versus Wu and Co., serving only to pad the runtime so that the climax can unfold on the day the fund is supposed to be listed on the Hong Kong Stock Exchange (HKSE).<br><br>If the story is too scattered for its own good, the characters fare even worse. Koo's dogged personality is attributed to the unfortunate death of his wife from a lift accident a few years back, one of the many melodramatic backstories established in a flashback that feels utterly forced and contrived. The rest of the characters are even less defined - we are supposed to infer that greed is the motivation for Man Bin's corruption, obligatory gratitude as the reason for Angel's predicament, and well spousal love for why Tak Wing turned rogue - and not one of them go beyond the one-liner that would have been used to summarise them in a storyboard.<br><br>The same can be said of the obligatory action scenes, which are choreographed with as little flair as the rest of the movie. The vehicular chase you see in the trailer is but the only one that appears in the entire movie, which comes to an anticlimactic stop when the baddies back off after spotting a police roadblock. A shootout that follows shortly after is played out in terrible lighting and ends in terribly clichéd fashion. We know the ICAC aren't exactly the SWAT, but that is no excuse for the sloppily conceived action, which rings smack of the kind of the slapdash filmmaking which the glut of 90s Hong Kong films were guilty of.<br><br>Indeed, the association is deliberate. Though blessed with a big budget, 'Z Storm' squanders what potential it has and what vested expectation we have with a shoddy script that is made even worse by Lam's amateurish direction. Lam's experience with ICAC-themed material notwithstanding, this wholly ill-conceived attempt to extol the virtues of the agency is a terrible misfire on every level, and could not come at a worse time when the anti-graft organisation is in real life struggling to regain its own reputation after a scandal involving its former chief. Contrary to its title therefore, there is no storm, not even a squall to speak of here, only a rumble that ends in a whimper.","user":"moviexclusive","rank":[23,27]},{"title":"The best among the series","rating":9,"date":"6 February 2019","review":"My sequence in seeing this anti corruption series is proved to be correct. This first one is the most entertaining.\nThe fast moving pace of the story makes the movie exciting. Acting of leads are above standard. I have virtually no complaint on the movie, except that Chan, as a suspected bribed senior police officer, could be so powerful.<br><br>My feeling on commentary of the series is intensely underrated. Especially this first one is actually very entertaining. But I just cannot figure out why the rate of IMDB and professional critics is so low. To me, I recommend especially to the Mainland watchers to boost their sense of anti corruption.","user":"madbird-61243","rank":[1,1]},{"title":"Most exciting movie","rating":10,"date":"10 November 2018","review":"Very detailed criminalogy, you can just go on and watch again and again.","user":"prestigekelvin","rank":[1,1]}]