[{"title":"Standard tortured person to ghost idea but I don't mind that.","rating":4,"date":"18 September 2019","review":"What I don't like is the manga cartoon backstory - really odd and probably no cheaper than filming it with lower standard actors.<br><br>And I really do not understand (or like) the fact that they are filming with a handycam (Sony I think) that states HD on its fold out screen but when that footage is shown it is in monochrome and REALLY grainy. That makes no sense at all - it isn't archive/vintage footage.<br><br>Then the manga cartoons are injected again and again in the various clips of backstory. All the drawn characters are \"Asian\" but the language is American English as is any writing shown within them. Just odd.","user":"leerjwd","rank":[6,6]},{"title":"Worst plagiarized movie ever","rating":1,"date":"10 September 2019","review":"Some kids decide to stay overnight in some creepy old mental asylum and then...<br><br>\"Wait\", you say, \"haven't I seen this a thousand times before?\"<br><br>Yes, you have - but never as bad as this.<br><br>The only horror about this stinker is the total lack of any originality or creativity or talent you are going to witness.<br><br>In that way it works - the lack of any basic filmmaking skills is really horrific and will scare you for weeks to come.","user":"Shizuka2008","rank":[27,40]},{"title":"Eh...","rating":2,"date":"10 September 2019","review":"Screen icon Meg Foster (Stepfather 2, They Live, Masters of the Universe) was the draw that made me watch this film. Sadly, she only appears in the movie for a very short amount of time, but trust me. She's the best part.<br><br>The PR materials for this film promise that it combines \"traditional narrative story-telling, as well as numerous forms of pioneering technology, including found footage, hand-held cameras, surveillance cameras, and smart glasses.\" That's true - and you can also tell where they ran out of budget and had to resort to shooting the storyboards as animatics and decided to treat that as an intentional choice.<br><br>This is literally about the thirteenth investigation that a group of college science students makes, this time delving into the urban legend of The Mole Man, an ex-patient of the Black Grove Asylum.<br><br>According to the movie's IMDB page, \"This first feature will introduce the killer and we're looking to do a spin-off series where we will then go on to produce Mole Man, Mole Man 2 and Mole Man 3.\" This movie finally got scary, because I know at some point I will have to suffer through all three of those movies the same way I did this one.","user":"BandSAboutMovies","rank":[11,17]}]