[{"title":"Almost didn't watch because of reviews!","rating":8,"date":"17 September 2018","review":"I assume everyone with a 1 star review is not into this type of film or has created a film experience that is worthy of a 10 star review. This movie is exactly what you would expect. It was late one evening and I wanted to watch something fun. I saw this movie and decided to look up reviews. I had to think about it for a bit due to the horrid reviews, decided to go with it... turned it on and was entertained the whole time... simple as that. I'd even watch a sequel.","user":"mverellen","rank":[75,101]},{"title":"Shelved for a few years and should have stayed there","rating":1,"date":"14 August 2018","review":"After watching this travesty of a film I did a little research online and this movie was shot back in 2015 and is so bad Sony shelved it. That is all you really need to know, because it should never have left the shelf. How they managed to get some fairly decent actors to star in this can only be explained by an actor's need to eat and pay bills too. There is barely a plot or story, It looks like it was made for TV and not quality TV, but something children might watch in the afternoon. It's one of those movies where there is no budget to film the good and exciting stuff , so much of what has happened is told in voice over , over the opening credits. There is no caring for the characters because there is no build-up. Matt Smith, who is British , tries to do an American accent but just sounds like there are marbles in his mouth. He is awful and Stanley Tucci is just embarrassing himself. I love movies that are so bad they are good, but this is just boring and stupid and I had to struggle to stay awake. Some movies should never see the light of day. Couldn't Sony have taken it as a tax write off and saved me 90 minutes ?","user":"hampersnow-28905","rank":[88,121]},{"title":"Wow! The hate!","rating":6,"date":"3 September 2018","review":"I really can not understand the hate for this movie. So many 1 star \"Reviews.\" Having been a IMDB user since the early days, I am used to seeing all sorts of strange reviews, but never have I seen such misplaced hatred for a reasonably good movie. Understand me, this is not a \"Great\" movie, however, it is competent in every way, and there are many many worse movies!\nThis is more a psychological movie than an action movie. It could almost be a live theatre piece.\n For what it is worth, I enjoyed it, possibly the worst thing was Mat Smith's \"American\" accent, but it's not worth the hate.","user":"lightningslim","rank":[57,78]}]