[{"title":"less time would have been enough","rating":4,"date":"13 September 2018","review":"Greetings again from the darkness. Dating back to H.G. Wells' 1895 book and 1960 film THE TIME MACHINE, time travel has long been a favorite and familiar trope for filmmakers and writers. It's been a central topic for comedies (BILL &amp; TED'S EXCELLENT ADVENTURE, HOT TUB TIME MACHINE), science fiction (LOOPER, INTERSTELLAR), oddities (PLANET OF THE APES, DONNIE DARKO), adventures (BACK TO THE FUTURE, MIDNIGHT IN PARIS), and romance (SOMEWHERE IN TIME, ABOUT TIME). <br><br>Since time travel has crossed many genres, it only makes sense that a filmmaker looking to tackle the topic would understand something new must be brought to the party, if a new project can hope to have any appeal. Director/writer Thomas Hennessy and co-writer Scott Kennard attempt to blend romance with a dose of science and philosophy, but unfortunately, even as a low budge B-movie, it just comes across as a lackluster effort with a too-simple script. I'm not familiar with director Hennessy's TV work on \"Bugmashers\" and \"Ten for the Chairman\", but his background as a cinematographer should have at least resulted in a more visually impactful film. <br><br>Justin Hartley (\"This is Us\") stars as Eric Lazifer, a successful Account Manager who saves his money, watches science shows on TV, and is easily \"bored\" by the married women who hit on him in bars. So, Eric is a fiscally conservative Brainiac who looks like a male model ... clearly a rough way to go through life. Eric's best bud Kal (James Kyson) serves as the comic relief, and is one of the few who bring some energy to their role. A recent company acquisition has Eric's boss (Mark Valley) mandating he iron out the details with that firm's leader Julia, played by Crishell Stause (Mr. Hartley's real life wife). <br><br>It's pretty easy to see where this is headed. Eric falls hard for Julia. However, she fails to swoon for his ice cream-philosophy-romance recipe since she is already engaged to a great guy. So Eric does what any guy would do ... he tracks down disgraced Physics professor Dr Joseph Goyer (Alan Pietruszewski) so that Eric can travel back in time to meet Julia before she connects with her fiancé. It's a solid and logical plan with very little chance for something to go wrong (!). If the story was ever on track, it's here that it really flies off the rails. Watching Eric assist the Physics expert with solving unsolvable equations is just a bit too much.<br><br>On the bright side, this segment allows Eric to meet a bartender named Ally, played by Arielle Kebbell. Ms. Kebbell definitely brings a welcome screen presence to this otherwise uninspired project. The soap opera look and feel likely relegate this one to the world of streaming, where, if it's lucky, it might find some time travel obsessed viewers.","user":"ferguson-6","rank":[23,29]},{"title":"Weak.","rating":4,"date":"15 September 2018","review":"The acting isn't that bad i guess, but everything else is very weak and boring.\nIt is one of those \"love\" stories where you simply don't care about the characters or their relationship.","user":"skurk123","rank":[16,20]},{"title":"Another time travel movie, but not Sci-Fi","rating":5,"date":"10 January 2019","review":"Slow start, fast ending..\nThis is pure romantic drama and has nothing to do with Science Fiction nor Fantasy.<br><br>Quote from the movie: \"Those who don't study history are doomed to repeat it\"","user":"Bac_Hir","rank":[4,4]}]