[{"title":"A fascinating look at Philippe Petit's dream and a beautiful tribute to the Twin Towers","rating":10,"date":"2 October 2015","review":"Robert Zemeckis continue's to be of the best director's in Hollywood. He has made a beautiful movie and even though you know what happens, he keeps you gripping your armrests and holding your breath until the very end. Joseph Gordon-Levitt shines in this role along with the rest of the cast.<br><br>I suppose this review is also for the people who were in New York during 9/11. As a survivor of 9/11, I couldn't help but cry at the end of the movie. Seeing the Twin Towers rising in all their glory, basking in the sunset and reminding us of their beauty that so many of us took for granted, brought back so many emotions for me. They were like old friends saying hello and goodbye one last time.<br><br>Thank you Zemeckis for telling a great story, making a beautiful movie and bringing back old friends to life!<br><br>If possible, go see it in IMAX! You won't regret it!","user":"johnlin9999","rank":[82,97]},{"title":"Joseph Gordon-Levitt struts with style and aspiration every step of the way","rating":8,"date":"7 October 2015","review":"From the first scene Joseph Gordon-Levitt dons the all black persona and talks about his passion, I'm hooked. This monologue heavy delivery requires that caliber of performance from the lead, also reminds me of Ewan McGregor on Big Fish. It takes the audience on a bizarre yet fascinating adventure and makes us feel like a part of the character's larger-than-life endeavor.<br><br>This is the story of Philippe Petit, a performer with the idea of wire-walking across the World Trade Center towers. While it may sound simple, the journey there is a captivating one. The presentation is almost magical with circus act and flamboyant atmosphere, although there are plenty of realistic details and intricate planning involved, at times it almost feels like a funny heist movie.<br><br>Visual is breathtaking, the cinematography takes full advantages of the vistas, let it be small village or big city. The way the scenes are shot gives the movie a much more surreal ambiance. It's an enhanced realism, and although it's not as refined, there's a spirit of Hugo lingering here. It makes great use of 3D with timely panoramic shots and even stuff-thrown-at-your-face antic, but for this movie I wouldn't mind.<br><br>The same goes with its jazz influenced soundtracks, occasional slow ballad or alternate take on popular songs. The production value just oozes gorgeousness. All the technical aspects aside, the best attraction is definitely Joseph Gordon-Levitt. He is utterly remarkable, youthful and charming. This is the kind of acting prowess that can captivate audience with sheer passion, it's a true homage to the real life counterpart.<br><br>The Walk is nothing short of a breathtaking tale. Its charismatic protagonist and masterful visual invite the audience to not only walk alongside, but in a sense glide freely through such an inspiring story.","user":"quincytheodore","rank":[37,42]},{"title":"\"The Walk\" isn't a thrill-a-minute, but it is thrilling!","rating":8,"date":"3 October 2015","review":"One of the best measures of a good movie based on a true story is the tension that it manages to create in the audience. Whatever the main conflict in the film's story, if audience members know the ending, keeping their attention and interest and keeping them emotionally invested in the story's outcome is a challenge for any filmmaker. A movie with a great script in the hands of a great director with a great cinematographer and editor and a great cast can meet such a challenge, but when it happens, it's still an impressive accomplishment. Two examples from recent cinematic history come to mind. In 2013, director Paul Greengrass turned the well-known incident of Somali pirates seizing the Maersk Alabama into the thrilling and suspenseful \"Captain Phillips\". The film was nominated for the Best Picture Oscar and earned acting nominations for star Tom Hanks and Somali actor Barkhad Abdi (in his film debut), both of whom were also nominated for Screen Actors Guild Awards, which both won. Earlier, in 2006, Greengrass was also the director of \"United 93\", which chronicled the 9/11 terrorist attacks, focusing on the flight which passengers attempted to retake from the terrorists. As the film neared its tragic foregone conclusion, as a moviegoer who knew a lot about the events of 9/11, I still found myself hoping against hope that the story would end differently than it did in real life. Creating movies like that take a tremendous amount of skill. (Don't even get me started on the fact that Paul Greengrass has yet to be win a Best Director Oscar.) 2015 has legendary director Robert Zemeckis trying his hand at creating tension in a story with a well-known ending in his docudrama \"The Walk\" (PG, 2:03).<br><br>Joseph Gordon-Levitt plays Philippe Petite, the French high-wire artist who decided to string his wire between the Twin Towers of New York's World Trade Center and walk it. But, of course, no one would attempt something like that on a whim. Philippe became entranced with wire walkers the first time he saw one in the circus back home in France. As the boy grew into a young man, he taught himself to walk on ropes between trees in his backyard, he got better and better and started walking actual wires. He becomes very comfortable on his wire, but it's \"Papa Rudy\" (Ben Kingsley), the local patriarch of a family of wire walkers, who teaches Philippe what it means to walk the wire safely and as performance art.<br><br>Philippe isn't interested in the scripted performances of the circus, but is very interested in performing – and challenging himself to bigger and better performances. After repeatedly clashing with his father about his passion for walking the wire, Philippe leaves home and moves to Paris. There he finds larger crowds to see his performances and more places to hang his wire. He also finds a girlfriend in a fellow street performer, a guitar player and singer named Annie (Charlotte Le Bon). She encourages him in his wire walking, even when he illegally strings and walks his wire between the two towers of Notre Dame Cathedral. By this time, Philippe has started gathering a group of co-conspirators (as he calls them), like photographer Jean-Louis (Clément Sibony) and Jean-Louis' friend, Jean-François (César Domboy), who wants to help, but is also afraid of heights. That's okay. Philippe needs all the help he can get.<br><br>Philippe has decided to walk a wire between the two tallest buildings in the world, a goal which he calls \"the coup\". After talking through the details and working out some of the problems with Papa Rudy and the co-conspirators, it's time for some on-site reconnaissance. Philippe, Annie and their friends travel to New York, where Philippe dresses as a construction worker to blend in with those still working on the interior of the new World Trade Center. He also meets and recruits some New Yorkers, including French expatriate Jean-Pierre (James Badge Dale) and Barry Greenhouse (Steve Valentine), a fan of Philippe, who witnessed the Notre Dame performance and happens to work in the Twin Towers. This disparate group of people (plus some late additions), each have a role to play in Philippe's grand plan.<br><br>\"The Walk\" isn't a thrill a minute, but it is thrilling. The story is fascinating and the acting is strong, especially from Gordon-Levitt, who learned French for the role and studied wire walking from Petite himself. The script tells the story well, although the scenes in which Gordon-Levitt narrates by talking to the camera are kind of hokey, mostly because of how they're shot. The rest of the cinematography is spectacular – especially the movie's climactic wire-walking scene which turns out to be much more exciting than you'd expect from an incident which is so well-documented. \"A-\"","user":"dave-mcclain","rank":[22,25]}]