[{"title":"Family Friendly Feel Good Fare","rating":7,"date":"29 September 2015","review":"Destined to become an Australian Classic, 'Oddball' is a very enjoyable family friendly flick which says much about the local film industry and audiences. When a good yarn is well produced and marketed, people will go out and see Australian movies. Whilst not perfect, 'Oddball' is a genre pic - the kids movie that the whole family can watch; with cute animals, a wide eyed and intelligent child, a quirky and memorable leading man and a good versus evil motif. What's not to love? For me, the drawbacks were the casting/writing of an American in a major role. Surely this was not for funding reasons! The actor cast is not even a big name. It could have been written for a corporate Australian type; and there are dozens of great local actors to cast here, even if Alan Tudyk is a competent performer for both the comedic and dramatic moments. He has zero chemistry with the current superstar of Aussie cinema the omnipotent Sarah Snook. This actress is the next Cate Blanchett. World domination awaits her. With already a number of lead and supporting roles under her belt, Sarah has shown why she is the next big thing. This seems an odd choice, pardon the pun, with her career trajectory,but as it will turn out to be one of the biggest box office hits this year, perhaps there was strategy from her and her agents to take this role. The child actor playing her daughter is great, and Shane Jacobson once again ('Kenny') creates an unforgettable screen character. He shows a great ability to straddle both humour and gravitas, often from moment to moment. He is becoming a national treasure. Deb Mailman gets to do very little, but doubles up with narration; and Richard Davies ('Offspring') shows why he deserves more screen time and more work. The hilarious Frank Woodley goes somewhat against type and is terrific. But the obvious stars of the movie are the animals. They are just delightful, although it was not seamless when dog and penguin were spliced into one frame - not quite, for these eyes, anyway. With a movie like 'Oddball' its ending was always going to play out as it did, but there was a lot of fun and tension getting there. It has a very sweet heart to it this film, and I recommend it on that basis.","user":"david-rector-85092","rank":[37,48]},{"title":"A cute and cuddly family yarn","rating":6,"date":"14 January 2016","review":"A lovable based on a true story family movie that's partly filmed in one of the worlds most naturally beautiful locations and most livable cities (no bias here at all) in the form of regional Australian city Warrnambool, Oddball is a film that's enjoyable for the young and young at heart and one of the better Australian feel good stories in some time.<br><br>A huge success at the local Australian box office in the later half of 2015, and in particular in the town of Warrnambool where Oddball played at the local cinema for 3 months, Oddball's the type of film even the biggest of movie grouches will have fun with despite its slight narrative and overacting from a talented cast.<br><br>A dramatization of eccentric chicken farmer and genuine \"oddball\" Alan 'swampy' Marsh, Oddball sees one of Australia's great larrikin characters Shane Jacobson inhabit the overalls of the great bearded man who developed the ingenious idea of using Maremma sheep dogs to protect a local fairy penguin colony that had been decimated by pesky foxes.<br><br>It's a unique scenario but not one that exactly makes for thrilling viewing and Oddball's major struggles come from trying to draw dramatic tension from a simple idea that just doesn't have the cinematic qualities of other such true tales. Well respected actors Sarah Snook (breakout star of Predestination), Alan Tudyk and even Australian comedy legend Frank Woodley all feel a little lost with some pretty lame supporting characters.<br><br>Oddball flys on the back of Jacobson's work, young actress Coco Jack Gillies likability, the great locations and of course the lovable animals that make penguins and fluffy dogs even more adorable than one would've thought possible.<br><br>A film that's appropriate for all ages and a tale that has appeal for animal lovers the world over, Oddball is a slight yet wholeheartedly enjoyable Australian film that's likely to become a new favourite of the youngest members of the family and an Australian film that holds a more universal appeal than the average homegrown movie.<br><br>3 Great Ocean Road shots out of 5","user":"eddie_baggins","rank":[10,12]},{"title":"Not enough Oddball","rating":6,"date":"29 December 2015","review":"It was W.C. Fields who said, 'Never work with animals or children.' He may have had a point because the actors in this film become almost irrelevant when Oddball, a beautiful Maremma sheepdog, shares the screen with the fairy penguins.<br><br>The film is based on real events. Apparently, Middle Island off the Victorian coast at Warrnambool, used to be home to a thousand fairy penguins until foxes started to snack down on them, reducing the population to just ten of the little guys.<br><br>Finally, a chicken farmer, Swampy (Shane Jacobson), and his dog, Oddball, come to their rescue and rid the island of foxes after hunting and trapping had failed.<br><br>The film is described as family fare, and Oddball steals every scene he is in, but I think children would be a little restless with the amount of story taken up with the affairs of the adults. Maybe the filmmakers tried to cram in too much. Along with the case for conservation, every character in the film seems to have a back-story. But it's all at the expense of more time with Oddball and the real stars of the show - the fairy penguins.<br><br>No doubt the scenes with the penguins would have been hard to do, but the film could have used a lot more of the confrontation between Oddball and the foxes - there are few long shots and much of the action seems either very close-up or off camera. Here and there the film gets to the heart of the matter - the human drama can't compete with the tension in the scene on the island when the fox sticks its head into the fairy penguin's burrow, or when Oddball saves the egg from going over the cliff.<br><br>Although no rival to \"Babe\", \"Oddball\" is nicely made, and no one will hate it, but I feel that the filmmakers missed the opportunity to make it more memorable than it is.","user":"tomsview","rank":[10,14]}]