[{"title":"Surprising Film","rating":8,"date":"28 June 2016","review":"What a gem of a film. I wasn't expecting much when I hit the 'Play' button, but as I kept watching, I was surprised at how good it turned out to be. It was predictable at times and yet I found myself still rooting for the main characters. Have you ever started watching a movie and during the opening credits, you start scrolling through your cell phone? That's what I did in the beginning. After hearing the music, I looked up, put my cell phone down and stared enjoying the scenery in the 1st few minutes. I was hooked after that. If you have seen a lot of dance movies (Step-up, Save the Last Dance, Stomp the Yard) I suggest you give this film a chance. It might surprise you, like it did me.","user":"Yoyo76","rank":[28,45]},{"title":"A budgeted version of all the parts of step up","rating":3,"date":"1 June 2016","review":"I saw the trailer and it was of the genre i liked and so i thought, why not, let's give it a try. I knew going in that it would similar to all the dance movies that i have seen but boy oh boy i was disappointed. The lead male tries to play an angry guy but utterly fails. It is a big competition with 25 grand prize money and scholarship but only three teams enter it (sign me in the next one dude) :P Even in center stage turn it up we saw how big the competition was.... The room mate is very badly depicted. One minute she is continuously partying the next minute she is all redeemed after hearing that all we dancers do is dance, lol. I can write a better script than that guys. And the dance crew had no ambitions? It's like they were all sleeping and one day someone said you should enter this competition and they just accepted. I mean making a name for themselves shouldn't they be on the look out for these sort of events in the first place? And how does the lead actor even get the gig? I mean shouldn't it be university students only or such. Even step up had to show that the guy was spending his community service hours. And the crew did not go to the university either. The acting, the directing all of it sucks. You would do well to avoid this one. I assure you i am a fan of these dance movies and even i consider my time wasted by this one. Save the 96 minutes.","user":"murtaza_kzl","rank":[17,26]},{"title":"Not bad at all once you get pass the fact that all the kids are annoying stereotypes","rating":6,"date":"10 April 2016","review":"High Strung was not the movie I planed to see, but the projector was broken on the movie I paid money for and I had limited options, so I gave it a try thinking the movie was this generation's version of Fame, but it looks and feels more like a spin-off of the Step-Up Franchise. <br><br>First off, I really need to vent on how ticked I was that they thought Romania was a good replacement for Manhattan. This vent is actually important to the film's content cause as unrealistic as it is to see young and poor college students living in a Loft that looks like it cost 500 dollars a minute to live in, it really annoys me that this is suppose to be the poor rough section of Manhattan. I would not want any upcoming dancers to see this movie filled with stock footage of New York Landscapes inter cut with Eastern European streets and be inspired to come to the city and find the same thing.<br><br>One of the lead characters named Johnny Blackwell is a Brit who was inspired to come to New York to be a violinist. This character was kind of lame. He was a pretty white boy with a chip on his soldier who wanted to bring the Violin into contemporary times, as if though no one has ever done that before, His Edgy attitude made no sense for a dude living in such a seller loft in Manhattan. <br><br>Maybe it was the Multi ethic dance troop he live above that ticked him off. These cats were living and breathing dance. The only character that did not annoy me when she first came on the screen was Johnny's love interest, a good girl ballerina similar to Julia Styles in Save the Last Dance, who is at an art school in Manhattan on a dance scholarship. They were smart to keep whatever background on the character short, because the little I knew the more I like.<br><br>Then came the point in the film when a \"dangerous\" street gang got into a break dance battle with a group of New York city Construction workers, and that's when I realized, I'm taking this movie far too seriously.<br><br>I realized that all I'm doing is watching a large dance recital being composed with string instruments, just like the recital at the end of the movie, which Johnny enters at the end of the film to use the cash money to stay in the country. Once I got that into my head I began to enjoy the movie for what it was.<br><br>It was fun to watch the dance numbers, this combination of ballet and modern dance, once again the concept is not original, but they had some cool dance routines going on.<br><br>I wish I could say that I loved the sting instrument part as much as I loved the dancing, but more so, I really respect that High Strung seemed to use more original composing than contemporary radio hits, which is far better.<br><br>So in the end, I could not help but to laugh out loud in my seat at the Archetype characters (They even had the spoiled little rich girl with dark hair who hated the blonde good girl and the preppy White dude who thought he was better than \"street hood\" white boy because he had money (did I mention Johnny has a cute little beauty mark on top of his puffy lips?), but the main focus is on the dancing mixed with the music, and that was enjoyable","user":"subxerogravity","rank":[32,54]}]