[{"title":"New fav!! Need to make a second one!!","rating":10,"date":"21 July 2018","review":"I just discovered this on Netflix!! I love it! A little sappy but nothing wrong with that right!!?? Love the religious tones and the overall full hearted feeling!!! Please make a second one!!!","user":"country-rain","rank":[11,13]},{"title":"Promise unfulfilled","rating":3,"date":"19 August 2017","review":"Going in to this movie, I wasn't really expecting much, so in that sense the movie delivered on its promise. But the synopsis, while simple enough, made me think it would at least be a bit entertaining. Not so much. It was like painting a room beige: nothing wrong with it exactly, but not really satisfying either. The coffee shop set is actually the best part of the movie, it looks like every coffee shop should look. But there are several things that just made this unsatisfying. The characters were so stereotyped that they looked like they stepped onto the stage of a high school play. The plot was simple to the point of being uninteresting. If so many people would show up for Donovan's fundraiser and tribute then why didn't she have more customers so her shop wouldn't be in financial trouble in the first place? At the tribute supposedly everyone was going on and on about her good qualities as a person, but at no time in the movie were any of these actually displayed through her actions. She was obviously lip-synching during the song, but my real pet peeve about this movie was this: the movie took place in a small town in Alabama (you could read the state name on the top of her foreclosure notice) yet not one single person in the whole movie had a southern accent. Not a single one. It could have just as easily taken place in Iowa except for the oceanfront scenes. That isn't really a small detail, it just fits in with the whole feel of the movie, one that looks like it didn't really try too hard to put any depth into the plot. And there was the kernel of a good plot there, but it was wasted. I would not advise spending time watching this unless you are having trouble falling asleep.","user":"Ponticar","rank":[13,16]},{"title":"Simple, pleasant entertainment","rating":8,"date":"19 April 2015","review":"As made-for-TV romantic comedies go, this is one of the better ones that I have seen. The story is simple but surprisingly smart and even realistic. The characters all feel genuine.<br><br>Basically, the story revolves around Donavan, a coffee shop owner, who has been unlucky in love. Just when her shop faces the threat of foreclosure, she meets Ben, a playwright who is in town, at the invitation of a mutual acquaintance, looking for inspiration for his next play. After an awkward but amusing misunderstanding between the two, sparks begin to fly. However, before anything further develops, Donavan's ex, Patrick, returns to town. Patrick is back in town to help Donavan with her financial troubles with the hopes of rekindling his relationship with Donavan. Meanwhile, with each encounter with Donavan in town, Ben finds himself increasingly unable to resist Donavan's charm. Will Donavan end up with Patrick or Ben? <br><br>The handsome Cory M. Grant and beautiful Laura Vandervoort are amiable and there is sufficiently palpable chemistry between the two to make this movie an enjoyable watch. The supporting cast is also good without any clichéd characters. All in all, this is a simple and pleasantly entertaining romantic movie. 8 out of 10","user":"Dan-121","rank":[20,27]}]