[{"title":"Continuing the trend of decent action marred with sloppy production","rating":5,"date":"22 November 2015","review":"The most casting role Scott Adkins has nowadays is either supporting or antagonist character where he would only do a couple of fight scenes but plastered on the poster nonetheless for more draw. Luckily, Close Range has given him more freedom to deliver his trademark action sequences, although it's plagued with an alarmingly sketchy presentation of gangster genre with cheesy Cinemax vibe and awful soundtracks.<br><br>Plot is actually good, at least for the first act, as MacReady (Scott Adkins) opens the movie trying to save his niece from mafia. It's a nice setup as it wastes no time to push the action, and continuous shot fighting scene definitely helps. However, it soon becomes the tedious cat-and-mouse between MacReady, the Mexican mafia and unsavory cop.<br><br>The pacing loses steam fast, repeating the same angle of corrupt police officer or gang member chasing the hero. It lacks structure aside from the primordial rush of periodic fisticuffs and gun-totting scenes, even these are simplified. As expected, there's not much in term of acting, it's not utterly terrible but it does appear jarring at times. The characters are either stereotypical damsel-in-distress, overly vilified or straight up gangster extras.<br><br>Most of the presentation revolves around old corny action flick ambiance, a bit like binge night on Cinemax with the music department playing the same Desperado inspired tunes over and over again. Fortunately, the action is admittedly decent. Scott Adkins has more plenty of chances on creating brutal beatdown, some of which are pretty creative. Even though this can get over-the-top, the high octane action would definitely please genre fans, or those wanting for more Undisputed action.<br><br>Close Range tries to spice the bland drama with misguided style. It's a good thing that the combat looks visceral enough, but it still might not attract viewer beyond action buff.","user":"quincytheodore","rank":[18,18]},{"title":"They spent all of the money on action choreography...ALL OF IT","rating":6,"date":"22 November 2015","review":"...And it kind of works out. The acting, wooden. The writing, juvenile. The directing, well, he stuck to a detailed storyboard so it's not too terrible. But what is actually watch worthy is the action sequences. Fantastic fight scenes, creative shoot outs. Complex single shot stunt takes that wow. I was impressed from the beginning (except for one accidental camera angle where a bad guy clearly waits to jump into the fight-my peeve). This is not a thinking persons film at all. In fact I suggest you crack a twelve pack with your bros and sit back to cheer for some brutal MMA action. P.S. There really should have been some gratuitous nudity. It's just that kind of flick.","user":"skantea-155-113487","rank":[29,32]},{"title":"Excellent martial arts scenes, lousy gunplay, flimsy plot","rating":6,"date":"26 December 2015","review":"\"Close Range\" boasts excellent martial arts choreography. The hand-to-hand fights earn solid A grades, while the knife fights earn middling Bs. Production values are adequate for the budget and genre, although far too much reliance is placed on jiggly-cam shots. Make-up effects are of uneven quality. The script is a mishmash of overused tropes with just enough clever one-liners to consider a clemency plea when they go to lynch the writer. A climatic paean to Sergio Leone is fairly good – until they inexplicably shift POV from third-person to first with a memory flash. With no character arcs, moral or coherent theme, the actors don't have much to do except try to kill one another. Several characters are dispatched for no particular reason other than dramatic effect. Scott Adkins does an adequate job as the taciturn loner antihero and handles the action scenes admirably, but deserves a better script. <br><br>Where the movie fails is in the gunfights, which comprise a large portion of the running time. We should establish some basic rules for gunfight choreographers and movie characters who find themselves in gunfights. <br><br>1. If you have a limited amount of ammunition, you might not want to use it all laying down suppressive fire. Save your bullets until you have a target in sight. <br><br>2. If you've taken cover in a dimly lit house and the heavily armed bad guys are outside in the bright sunlight, you have a huge tactical advantage because you can see them much more easily than they can see you. However, you sacrifice that advantage if you stand by the window and stick the barrel of your weapon outside, because now they can see you and you may also have the sun in your eyes. A better strategy is to stand back away from the window and fire. If the bad guy is fifty yards away, you don't gain much advantage by moving to where he's only forty-nine yards away, but you sacrifice a considerable advantage. <br><br>3. If your weapon fires really big bullets that are the length of a man's finger and have tapered casings, they probably pack a bit of a punch and go through things like walls and the sheet metal used in automobile bodies. You're probably better off trying to fire through whatever the bad guy is hiding behind than firing overhead and hoping the bullet changes course directly above him. <br><br>4. Those little metal things over the barrel and above the breech are called sights. You stand a much better chance of hitting your target if you use them. <br><br>5. If you've seen \"Zombieland,\" you know the advantage to a double-tap, but the incremental advantage drops dramatically. When you have a limited amount of ammunition, there isn't much advantage to putting five high-power rifle rounds through somebody's chest, as opposed to only one or two. <br><br>Other than the climatic scene, the gunfight choreography was painfully amateurish and largely nonsensical. The only purpose seemed to be to empty the weapons so the characters would need to engage in hand-to-hand combat. Initially, the characters seemed oblivious to the notion that bullets can go through things, even after a character is hit. Later, they did little except fire through walls, floors and protective gear. <br><br>The movie is a series of well choreographed fight scenes admirably executed by Scott Adkins and his opponents, linked together by a flimsy excuse for a plot. Fortunately, the fight scenes are worth the price of admission.","user":"ginocox-206-336968","rank":[14,16]}]